[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "10/14/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000997,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE INVESITGATE THE OIL PUMPS ON THE 1999 DODGE DURANGO.  OURS HAS GONE OUT 2 TIMES OVER THE PAST 2 1/2  MONTHS.  THE DEALER IS TRYING TO BLAME THIS ON SLUDGE IN THE ENGINE FROM NOT CHANGING THE OIL, BUT THAT IS NOT TRUE.  WE DO HAVE OUR OIL CHANGED.  THEY ALSO TRIED TO STATE THAT WE WERE REALLY LOW ON OIL.  MY HUSBAND HAD JUST PUT A QUART OF OIL IN THE ENGINE THE DAY BEFORE.  I WENT TO CARSURVEY.COM AND FOUND SEVERAL LISTINGS OF THIS SAME PROBLEM WITH THE 1999 DODGE DURANGO...THE OIL PRESSURE SUDDENLY DROPS TO ZERO.  SOME REPORTS STATE THEY EVEN THREW THEIR RODS WHEN IT HAPPENED.  OTHERS HAVE HAD BEARING WEAR.  WE WERE ON THE INTERSTATE WHEN OUR OIL PRESSURE SUDDENLY DROPPED TO ZERO WHEN THIS HAPPENED THE FIRST TIME.  WE HAD TO STOP AND CONTINUE PUTTING OIL IN THE ENGINE ABOUT EVERY 100 MILES SO WE COULD MAKE IT HOME FROM VACTATION.  IT'S LIKE THE OIL WAS DISAPPEARING, BUT THERE WAS NO VISIBLE LEAK.  NO LEAK IN OUR DRIVEWAY WHEN WE GOT HOME EITHER.  THE DEALER REPLACED THE OIL PUMP AFTER WE GOT HOME IN OCTOBER. THREE WEEKS LATER THE OIL PRESSURE WOULD START AT ZERO WHEN I INITIALLY TURNED ON THE CAR IN THE MORNING, THE CHECK ENGINE LIGHT WOULD DING, AND THEN THE OIL PRESSURE WOULD GO UP TO NORMAL.  I THOUGHT IT WAS DUE TO COLD WEATHER.  LAST THURSDAY, I WENT TWO BLOCKS AND THE OIL PRESSURE DROPPED TO ZERO 4 TIMES WHILE I WAS DRIVING.   I IMMEDIATELY RETURNED THE CAR HOME AND MY HUSBAND HAD IT TOWED TO THE DEALER BECAUSE WE ARE AFRAID TO DRIVE IT.  THE DEALER IS REPLACING THE PUMP AGAIN.  I READ ON CARSURVEY.COM THAT SOMEONE WAS TOLD THIS WAS A PROBLEM WITH SOME GASKET BEING TOO SMALL FOR THE OIL PAN BY THE DEALER.  THEY ASKED WHY THERE HAD NOT BEEN A RECALL TO FIX THIS AND THERE WAS NO REASONABLE ANSWER GIVEN.  PLEASE HELP.  THERE APPEARS TO BE A BIGGER PROBLEM THAT IS BEING SHUFFLED UNDER THE TABLE.",
        "vin": "1V4HR28Y0XF"
    }
]