[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2003",
        "dateOfIncident": "08/26/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010290,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "3000GT",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1996 MITSUBISHI 3000GT VR-4 WITH A 6 SPEED MANUAL TRANSMISSION.  MY FRIEND, BRIAN WATSON AND I WERE TRAVELING EASTBOUND ON HIGHWAY 20, JUST ABOUT 50 MILES EAST OF BEND, OR. I MADE AN ATTEMPT TO SHIFT FROM 5TH TO 6TH GEAR, BUT BECAUSE OF SOME PROBLEMS WITH WHAT I NOW UNDERSTAND TO BE THE SYCROS, IT WENT INTO 4TH GEAR.  NOT NOTICING IT WAS IN 4TH GEAR BECAUSE I HAD SHIFTED IT INTO THE POSITION OF 6TH, I LET OUT THE CLUTCH AND PRESSED THE ACCELERATOR.  SHORTLY AFTER, I HEARD THIS POP.  I LOOKED DOWN AND NOTICED THE RPM'S WERE PAST THE RED LINE, THIS IS WHEN I FIGURED OUT THAT THE CAR WAS IN 4TH GEAR.  I SHIFTED IT BACK INTO 5TH GEAR AND BEGAN TO SLOW DOWN, CONCERNED ABOUT THE POP SOUND I HAD HEARD.  I ASKED BRIAN, IF HE HAD HEARD IT AND HE TOLD ME NO. I ASKED HIM IF HE WAS SURE HE DIDN'T HEAR IT, HE TOLD ME NO, SO I KEPT DRIVING.  SHORTLY AFTER, I STARTED HEARING CLANKING SOUNDS COMING FROM WHAT SOUNDED LIKE THE TRANSMISSION. THE ENGINE STOPPED, THE VEHICLE STARTED SLOWING DOWN RAPIDLY. I IMMEDIATELY PULLED OVER OFF THE PAVEMENT ONTO THE GRAVEL ON THE SIDE OF THE ROAD.  I NOTICED SMOKE COMING FROM UNDER THE HOOD OF THE CAR.  I'M WORRIED THAT MY CAR IS ABOUT TO CATCH ON FIRE.  I BEGAN POURING THE WATER ONTO THE TRANSMISSION, WHICH WAS BOILING THE WATER AT THIS POINT, BUT IT SEEMED TO BE ENOUGH TO STOP THE ENGINE AREA FROM SMOKING.  LATER I FOUND OUT THAT THE TRANSAXLE WAS BAD AND THAT IT COSTS $4414.29 NEW, PLUS $696.00 FOR LABOR. I ASKED IF THEY COULD GET THE TRANSAXLE REPLACED CONSIDERING THE DRIVE TRAIN HAS A 60,000-MILE WARRANTY ON IT AND MY MILEAGE IS ONLY 66,000-MILES. THE LOCAL DEALERSHIP SAID NO AND SO DID THE PERSON THAT MADE THE DECISION AFTER I CALLED MITSUBISHI.  SO I AM WRITING IN HOPES THAT YOU MIGHT BE ABLE TO ASSIST ME IN THIS MATTER. THE TRANSAXLE SHOULD NOT HAVE SHIFTED INTO THE WRONG GEAR, IT ALSO SHOULD HAVE NOT EXPLODED BECAUSE IT WAS IN ABOVE RED LINE.*JB",
        "vin": "JA3AN74K8TY"
    }
]