[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/13/2003",
        "dateOfIncident": "03/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "ASTRO",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PEDAL POSITIONS AND DRIVERS FOOT ROOM ON MY 1997 CHEVROLET ASTRO CONTRIBUTED TO AN ACCIDENT. I WAS TURNING LEFT INTO A DRIVEWAY WHICH I COULD SEE WAS ICED OVER. I WAS DRIVING LESS THAN 5 MPH AND BRAKING WHEN I ENTERED THE DRIVEWAY AND FELT THE ANTI-LOCK BRAKES BEGIN TO FUNCTION. THE BRAKE PEDAL IMMEDIATELY DROPPED DOWN AND THE VAN NO LONGER DECELERATED. IN FACT THE VAN ACCELERATED THE HARDER I STOOD ON THE BRAKE PEDAL AT WHICH POINT I REALIZED MY RIGHT FOOT WAS PRESSING THE ACCELERATOR AS WELL AS THE BRAKE. AS I TRIED TO MOVE MY RIGHT FOOT FURTHER LEFT MY SIZE 12 RIGHT SHOE GOT TANGLED WITH MY SIZE 12 LEFT SHOE IN THE DRIVERS FOOT WELL. BY THE TIME I CORRECTLY POSITIONED MY FEET AND WAS ABLE TO PRESS EXCLUSIVELY ON THE VERY SMALL BRAKE PEDAL THE VAN CRASHED INTO THE GARAGE, PENETRATING THE DOOR AND COMING TO A STOP AS IT MET THE RESISTANCE OF THE VEHICLE PARKED IN THE GARAGE. IT HAPPENED SO FAST AT FIRST I FELT LIKE AN IDIOT FOR HAVING AN ACCIDENT UNTIL I ANALYZED THE CHAIN OF EVENTS.  I DISCOVERED THE WAY I NORMALLY POSITION MY FEET, OUT STRETCHED IN THE FOOT WELL IS UNSAFE. I NOTICED WHEN I APPLY THE BRAKE WITH THE BALL OF MY RIGHT FOOT DURING NORMAL STOPS THE OVERALL WIDTH OF MY SHOE HOVERS OVER THE ACCELERATOR PEDAL. THIS IS NORMALLY OF NO CONSEQUENCE BECAUSE THE BRAKE PEDAL HITS BOTTOM ABOVE THE HEIGHT OF WHERE THE ACCELERATOR PEDAL RESTS DURING NON-ABS STOPS. HOWEVER WHEN THE PEDAL DROPS DOWN DURING ABS ASSIST THE FOOT ROOM IS TOO TIGHT. THIS REQUIRES ME TO REST MY LEFT FOOT LEG BENT ON THE LEFT WHEEL WELL. ALTHOUGH THIS IS UNCOMFORTABLE FOR ME I BELIEVE I WILL NEED TO DRIVE THIS WAY FOR SAFETY PURPOSES. SHORT OF GM REENGINEERING THIS POOR DESIGN, ADULT MEN NEED TO BE MADE AWARE OF THIS POTENTIAL WHILE DRIVING THESE VANS. THERE ARE A LOT OF ASTROS AND GMC SAFARIS ON THE ROAD. I CAN'T BELIEVE I AM THE ONLY PERSON WHO HAS HAD THIS PROBLEM. *JB",
        "vin": "1GBDM19W4VB"
    }
]