[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/14/2003",
        "dateOfIncident": "06/01/1998",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010429,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT COMES ON< GOES OFF< COMES ON< GOES OFF< COMES ON< STAYS ON< GOES OFF! AND THE DEALERSHIP (GREENE FORD, GAINESVILLE, GA.) ALWAYS HAS A DIFFERENT REASON FOR THE PROBLEM AT A COST OF APPROXIMATELY. $600 OR MORE TO FIX EACH TIME, TO NO END. THE FIRST TIME THE CHECK ENGINE LIGHT CAME ON THE IMRCS WERE SUPPOSE TO BE THE PROBLEM ACCORDING TO THE DEALERSHIPS DISAGNOSTICS TEST (COST $80.00) THEY REPLACED AND SUPPOSEDLY FIXED THE PROBLEM, (COST $560.00). LIGHT CAME ON NEXT DAY WHILE TAKING A FAMILY VACATION OUT OF STATE. HAD AN INDEPENDENT MACHANIC PERFORM A TUNE UP ON VEHICLE, REPLACED PLUGS, WIRES, OIL CHANGE, THROTTLE BODY CLEANED (COST $223.00)  THE CHECK ENGINE LIGHT CAME BACK ON WITHIN TWO DAYS. UPON THE NEXT RETURN TO THE DEALERSHIP THE DIAGNOSTICS TEST (COST ANOTHER $80.00) REPORTED A CODE EGR INSUFFICIENT FLOW AND A #4 CYLINDER MISFIRE (EST. REPAIR COSTS $600.00). HAD A DPFE SENSOR REPLACED ($76.00) THE CHECK ENGINE LIGHT CAME BACK ON! IT IS AMAZING TO ME THAT THESE SO CALLED DEALERSHIPS (EXPERTS) WITH THEIR SO CALLED (DIAGNOSTICS TESTS) HAVE NOT THE FOGGIEST CLUE ABOUT HOW TO FIX THIS PROBLEM. IT IS ALSO DISTURBING THAT AFTER REVEIWING THE NUMBER OF COMPLAINTS ON THIS WEBSITE, THAT NHTSA HAS NOT ORDERED FORD TO STOP PLAYING GAMES AND FORCE A RECALL FOR THESE PROBLEMS. IT IS APPARENT THAT OTHERS HAD THE SAME SYMPTOMS AND PROBLEMS IN THE PAST THAT NEVER GET RESOLVED UNTIL THE HEAD GASKETS FAIL AND THE REPAIR BILLS GO FROM $600.00 TO $2000.00. I AM ACCUSING FORD OF KNOWINGLY AND WITHOUT REGARD TO THE BEST INTRESTS OF THEIR CUSTOMERS ALLOWING MAJOR PROBLEMS TO EXIST AND PERSIST IN AN EFFORT TO INCREASE THEIR PROFITS AT THE CUSTOMERS EXPENSE. FORD CORPARATION SHOULD BE ASSAMED, BUT THEY HAVE SHOWN NO ACCEPTANCE OF RESPONABILITY. AND THE DEALERSHIPS ARE NO BETTER, EVERYTIME WE DISCUSS THIS PROBLEM WITH THEM, WE GET DIFFERENT ANSWERS AND COSTS FROM DAY TO DAY AND IT APPEARS IF YOU COMPLAIN TO MUCH YOU GET TO PAY EVEN MORE. THANKS FORD, FOR NOTHING!   *JB",
        "vin": "2FMDA5144TB"
    }
]