[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/16/2003",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GOODYEAR",
                "productYear": "1982",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DEAR SIRS,   I HAVE ATTACHES A COPY OF THE NOTE I SENT TO GOODYEAR RUBBER COMPANY IN REGARDS TO THE TIRES ON MY VEHICLE. IT SOUNDS SUSPICIOUSLY LIKE A PROBLEM THAT FIRESTONE HAD AND MAY RESULT IN ACCIDENTS. I THOUGHT I WOULD LET YOU KNOW AS WELL FOR YOUR DATABASE. I HAVE 3 OUT OF 4 GOODYEAR WILDERNESS TRACKER TIRES THAT ARE FACTORY TIRES ON MY DODGE DAKOTA THAT HAVE 2-4 INCH SPLITS ON THE SIDEWALL NEXT TO THE BEAD. SOME ARE ON THE OUTSIDE BUT SOME ARE ON THE INSIDE SIDEWALL. THE GOODYEAR DEALER OFFERED ME 40 $ OFF A 120$ REPLACEMENT TIRE . THE TIRES HAVE 27,000 MILES ON THEM. NOT ONLY IS THAT UNACCEPTABLE FOR AN OBVIOUSLY DEFECTIVE TIRE BUT I DID NOT WANT MORE OF THE SAME TIRE. I DISCOVERED THIS PROBLEM AS I HAD 2 REAR TIRES GOING FLAT WITH NO FOREIGN OBJECTS IN THE TREAD. THE GOODYEAR REP STATED THAT HE HAD SEEN THIS PROBLEM BEFORE SO IT IS OBVIOUSLY A MANUFACTURING DEFECT AND IS UNSAFE. WHILE I DOUBT GOODYEAR WILL OFFER ME ANY REIMBURSEMENT I THOUGHT YOU SHOULD BE AWARE OF THE PROBLEM AND I WILL BE CONTACTING DODGE AND THE NHTSA WITH MY CONCERNS AS WELL . IT WOULD BE QUITE DISASTROUS IF THE TIRE SEPARATED FROM THE BEAD WHILE AT INTERSTATE SPEEDS.   TIM FULTZ....*NLM",
        "vin": ""
    }
]