[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "03/16/2003",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10010636,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "850",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER AND DRIVER OF A 1996 VOLVO 850. ON SUNDAY MARCH 16TH 2003, THE DRIVER AND MYSELF WERE STOPPED IN A DRIVE THROUGH RESTAURANT WHEN MY DRIVERS SEAT CAUGHT ON FIRE. THE CAR STARTED SMOKING FROM THE SEATS, THEN WE TURNED AROUND TO LOOK WHERE IT WAS COMING FROM WE  NOTICED FLAMES COMING OUT FROM UNDER THE SEAT INTO THE BACK SEAT AREA. WE YELLED FOR A FIRE EXTINGUISHER THAT THE DRIVER USED TO PUT OUT THE FIRE, WHILE PUTTING IT OUT HE SUSTAINED INJURY. THE LOCAL FIRE DEPARTMENT WAS NOTIFIED AND A REPORT WAS TAKEN.  THEY HAD ADVISED ME NOT TO DRIVE MY CAR.  I WAS CONFUSED ON WHAT HAD HAPPENED SO I DECIDED TO RESEARCH \"ELECTRICAL WIRING PROBLEMS IN VOLVO'S\" WHEN I FOUND  DIFFERENT ARTICLES RECALLING MY MAKE AND MODEL OF MY CAR THAT AS OF DECEMBER 2, 2002:  65,000 1996, 850 VOLVO'S WERE BEING RECALLED BECAUSE THE SEAT HEATERS COULD SHORT CIRCUIT AND CATCH FIRE. IN MANY OF THE ARTICLES IT HAS STATED THAT EITHER VOLVO HASN'T STARTED A CAMPAIGN YET TO NOTIFY THEIR CONSUMERS OR THAT VOLVO WOULD NOT RETURN CALLS TO COMMENT ON RECALLS. I CONTACTED THE NEAREST VOVLO DEALERSHIP TO ME AND THEY WERE VERY CONFUSED ON WHAT TO DO. THE MAN ON THE PHONE FIRST TOLD ME THAT HE HASN'T HEARD OF A RECALL FOR THAT BUT A FEW MINUTES LATER HE SAID THEY RECENTLY SERVICED HIS BOSS' 1996 850 VOLVO FOR THE SAME RECALL, HE SAID HE WOULD RESEARCH AND CALL ME BACK. EARLY AFTERNOON, I CONTACTED  VOLVO CARS OF NORTH AMERICA TO COMPLAIN. I TOLD THE ABOVE STORY, WHERE  THEY THOUGHT THEY WEREN'T LIABLE FOR THIS. ONE MAN SAID JUST BECAUSE IT'S RECALLED DOESN'T MEAN THAT IS WHAT HAPPENED WITH MY CAR. I THEN SPOKE WITH HIS SUPERVISOR WHO TOLD ME THAT I NEEDED TO TOW MY CAR TO THE DEALERSHIP WHICH IS APPROXIMATELY 45 MILES AWAY, I HAVE TO FOOT THE BILL AND THAT'S WHERE AN ADJUSTER FROM VOLVO WILL INSPECT THE CAR. IN THE MEANTIME I CAN NOT DRIVE MY VEHICLE AND THEY WILL NOT PAY FOR A RENTAL WHILE MY CAR IS OUT OF COMMISSION. LIVID AT THE FACT THAT MY SAFETY AND THE SAFETY OF MY PASSENGERS WAS COMPROMISED!  *JB",
        "vin": "YV1LS5728T1"
    }
]