[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "01/15/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010606,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG CONVERTIBLE",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "AT UNPREDICTABLE MOMENTS, USUALLY BUT NOT EXCLUSIVELY WHILE SLOWING TO A STOP, WITH MY FOOT ON THE BRAKE, THE ENGINE WILL REV UP AND CAUSE THE CAR TO LUNGE FORWARD, INSTEAD OF STAYING AT IDLE AS IT SHOULD WHILE COMING TO A STOP. I KNOW THIS SEEMS INCREDIBLE, AND MAY BE AN INACCURATE OBSERVATION ON MY PART, BUT IT SEEMS THAT THE HARDER THAT I PUSH DOWN ON THE BRAKE IN THESE SITUATIONS, THE STRONGER THE ENGINE PULLS. THE FIRST TIME THIS HAPPENED, ABOUT FOURTEEN MONTHS AGO, I JUST ABOUT HAD A \"HEART ATTACK\" AND ALMOST RAN INTO A BUILDING, AS I WAS PARKING THE VEHICLE. THIS SITUATION HAPPENS MOSTLY AT RED LIGHTS AND STOP SIGNS, ALWAYS AT SPEEDS BELOW FIFTEEN MILES PER HOUR WITHOUT ANY WARNING AND  CREATES A REALLY SERIOUS PROBLEM. WHEN IT DOES OCCUR, I HAVE TO PUT THE TRANSMISSION QUICKLY INTO NEUTRAL OR TURN THE KEY OFF WITH THE VEHICLE IN GEAR, TO KEEP FROM HITTING THE CAR IN FRONT OF ME. IN SITUATIONS THAT ALLOW ME THE LUXURY ( NO VEHICLES OR OTHER OBJECTS CLOSE ENOUGH TO BE IN DANGER) I HAVE FOUND THAT LETTING MY FOOT COMPLETELY OFF THE BRAKE PEDAL, WHILE THE ENGINE IS REVVING AND THE CAR LUNGING EVER HARDER FORWARD, WILL CAUSE THE ENGINE TO GO IMMEDIATELY TO IDLE. THIS PROBLEM THEN ONLY HAPPENED OCCASIONALLY, FOR QUITE A FEW MONTHS, BUT REAPPEARED LAST WEEK AFTER I REPLACED SPARK PLUGS AND WIRES. IT ORIGINALLY STARTED WITHOUT ANYTHING BEING DONE TO THE CAR.    *NLM",
        "vin": "1FALP4444SF"
    }
]