[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "12/12/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010607,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "SABLE",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "I CONTACTED THE FORD MOTOR COMPANY COMPLAINING ABOUT A FAULTY TRANSMISSION IN MY 1995 MERCURY SABLE THAT SUDDENLY WENT OUT ON ME WHEN I WAS ON MY WAY HOME IN DECEMBER OF 2002.  THE CAR HAD BEEN HAVING PROBLEMS SINCE THE FIRST DAY I GOT IT AND I WAS TOLD THAT IT WAS OKAY, THAT THE PROBLEM WOULD CORRECT ITSELF.  MY CAR HAD BEEN SKIPPING FOR A WHILE, THEN IT WOULD STOP, SO I THOUGHT NO MORE OF IT.  I BOUGHT MY CAR IN EXCELLENT CONDITION FROM A CAR DEALER (NOT A FORD DEALERSHIP) AND PRINTED A CARFAX JUST TO DOUBLE CHECK FOR ANY MAJOR PROBLEMS.  I FOUND NONE.  AFTER REPLACING THE RADIATOR, FIXING THE ALTERNATOR, AND REPLACING THE BRAKE SYSTEM IN THE THREE YEARS THAT I HAVE HAD MY CAR, THE TRANSMISSION WENT OUT.  IT ONLY HAS 123,000 MILES ON IT.  I CONTACTED YOUR WEB SITE AND DISCOVERED 19 OTHER COMPLAINTS BESIDES MINE ABOUT THE SAME PROBLEM IN THIS MODEL CAR.  AS A MATTER OF FACT, ONE MAN REPLACED HIS SIX TIMES!!!  THEN, TO MAKE MATTERS WORSE, THEY CONTACTED ME AND TOLD ME TO GO LOOK AT ANOTHER CAR AT FAIRWAY.  WELL, THERE'S A FAIRWAY FORD HERE IN ANDERSON, SC.  I GO UP THERE AT 10 LIKE I'M SUPPOSED TO, AND THEY HAVE NO IDEA WHAT I'M TALKING ABOUT.   I CALL THE BRANCH BACK AND THEY TELL ME THAT THEY DON'T OWN ANY FORD PLACES IN SC, THAT I WAS SUPPOSED TO GO TO ALBANY, GA.  THAT IS A GRAND TOTAL OF 600+ MILES AND 10 HRS AWAY ROUND TRIP.  I GO ALL THE WAY DOWN THERE FOR THE MANAGER TO TELL ME BASICALLY THAT I WENT DOWN THERE TO TRADE IN A CAR.  I HAD TOLD THEM THAT MY CAR IS NOT RUNNING, BUT APPARENTLY, THEY DON'T LISTEN VERY WELL.  SO, I'M STILL OUT OF A CAR AND THE ONE I HAVE IS NOT TRADABLE IN THE CONDITION ITS IN.  I STILL OWE $1700 AND ITS GOING TO COST ME AT LEAST THAT MUCH IF NOT MORE TO FIX IT.  ALL I WANT IS FOR THEM TO FIX THIS PART THAT THEY KNOW IS FAULTY, BECAUSE OTHER CONSUMERS ARE HAVING THE SAME PROBLEM.  I JUST HOPE IT DOESN'T TAKE SOMEONE GETTING KILLED ON THE HIGHWAY WHEN THIS PART QUITS ON THEM BEFORE FORD WILL RECALL THESE CARS AND FIX THEM.   *NLM",
        "vin": "1MELM50U5SA"
    }
]