[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "03/06/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAILBLAZER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT A SPEED OF APPROXIMATELY 65-70 MPH, I FELT A SURGE AS IF THE TRANSMISSION WAS SHIFTING. AS THIS WAS HAPPENING I NOTICED THE LIGHT NEXT TO THE FOUR-WHEEL SWITCH SELECTOR KNOB WAS BLINKING ABOVE THE AUTOMATIC 4HI POSITION.     THIS HAS HAPPENED ON OCCASION QUITE FREQUENTLY. MY WIFE WHO NORMALLY DRIVES THIS VEHICLE SAYS IT HAPPENS SEVERAL TIMES DURING A TYPICAL 60-MILE TRIP. THIS SAME THING HAPPENED A WEEK AFTER WE STARTING LEASING THIS VEHICLE BACK IN APRIL OF 2002. I TOLD THE DEALERSHIP ABOUT IT AND THEY SAID THEY COULDN'T FIND ANYTHING WRONG. THEY SAID IT'S HARD TO FIND SOMETHING WRONG WITH IT WHEN IT'S NOT ACTUALLY HAPPENING IN FRONT OF THEM. IT ALWAYS TENDS TO HAPPEN IN THE SPEED RANGE OF 50-70 MPH.     THIS ISSUE HAS ME CONCERNED, ESPECIALLY WHILE DRIVING ON SNOW, ICE, OR WET SURFACES. I'M AFRAID IT COULD JERK ENOUGH TO THROW US OFF THE ROAD.    I'VE NOW REALIZED, THROUGH THE NHTSA WEB SITE, THAT MANY TRAILBLAZER OWNERS/OPERATORS HAVE HAD SIMILAR PROBLEMS AND GM HAS DONE NOTHING TO REMEDY THE PROBLEM. I'VE ALWAYS PURCHASED GM SINCE MY FATHER IS A RETIRED GM EMPLOYEE, BUT I'M NOW CONSIDERING BUYING OUTSIDE OF THE GM FAMILY. WHAT GOOD IS THE GM EMPLOYEE INCENTIVE/DISCOUNT, WHEN YOUR LIFE IS AT RISK? APPARENTLY TO GM, THE COST OF LIFE IS NOTHING COMPARED TO THE COST OF A RECALL.    I'M CONSIDERING GETTING OUT OF THE LEASE, NO MATTER THE COST, DUE TO THE LEMON OF A VEHICLE WE NOW HAVE.  HOW MANY PEOPLE WILL BE INJURED AND OR POSSIBLY KILLED BEFORE GM DECIDES TO BITE THE BULLET AND RECALL THEIR BREAD-WINNING VEHICLE?    TODAY (3-17-03) WHILE IN FOR NORMAL SERVICE, I WAS TOLD THAT THE DEALER RESET THE CONTROL MODULE, WHICH MIGHT FIX THE PROBLEM. I ASKED THEM ABOUT CHANGING THE SWITCH AND THEY SAID THEY HAVE DONE THIS ON SOME VEHICLES BUT PREFER TO START WITH RESETTING THE MODULE. ONLY TIME WILL TELL. I HOPE THE FORECAST IS FOR DRY WEATHER!  *NLM",
        "vin": "1GNDT13S622"
    }
]