[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "02/11/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010599,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 25,000 MILES MY 2001 FORESTER STALLED 3 TIMES IN MY DRIVEWAY AND SHOOK A BIT.  I HAD THE IDIOT-NEW-OWNER-PACKAGE WITH THE DEALER WHERE THEY DID ALL THE MAINTENANCE, ETC. AND WAS SCHEDULED FOR AN OIL CHANGE/WHATEVER MAINTENANCE ANYWAY SO I ASKED THEM TO CHECK IT OUT.  THEY COULD NOT REPRODUCE THE PROBLEM AND IT DID NOT HAPPEN AGAIN TO ME UNTIL SEVERAL MONTHS LATER.      NOW AT 38,000 MILES (3000 MILES AFTER WARRANTY AND AFTER THE END OF THE IDIOT-PACKAGE) IT HAPPENED AGAIN.  THIS TIME IT STALLED ON SEVERAL OCCASIONS BOTH IN PARKING LOTS AND AT STOP LIGHTS.  IT SHOOK AT AN IDLE AND THE CHECK ENGINE LIGHT CAME ON.  A LOCAL SHOP DIAGNOSED THE PROBLEM AS A FAILED COIL PACK.  HE ALSO NOTED THAT THE APPARENT CAUSE WAS THAT IT APPEARED NO MAINTENANCE HAD EVER BEEN DONE.  THE SPARK PLUG CHANGE AND A 30K MILE TUNE UP THAT WERE ON MY SERVICE TICKETS AS HAVING BEEN PERFORMED WERE PROBABLY NOT ACTUALLY DONE.  THERE WAS NO WAY TO PROVE THAT WITHOUT TOWING THE CAR TO SUBARU AT MY EXPENSE AND THEN PROBABLY HAVING THEM STILL CLAIM THE SERVICE HAD BEEN DONE.      I DRIVE VERY CONSERVATIVELY, DON'T SPEED, DON'T TAKE OFF QUICKLY AND LIVE IN A MODERATE TEMPERATURE/WEATHER AREA (NORTHERN VA).  THERE IS NO REASON THAT WITH PROPER MAINTENANCE THIS SHOULD HAVE HAPPENED.  SUBARU OF AMERICA SAYS IT IS A DEALER PROBLEM.  THE DEALER CLAIMS NO WRONG DOING.  I CAN DISPUTE THE POINT AND HAVE IT TOWED TO ANOTHER DEALER FOR VERIFICATION OF THE LACK OF PROPER MAINTENANCE, WHICH WE ALL KNOW WILL NOT BE THEIR FINDING OR PAY THE $530 REPAIR STRAIGHTAWAY.  I CHOSE THE LATTER.  IS THERE ANYTHING I CAN DO NOW TO GET SUBARU TO REFUND THE COST OF REPAIR?   *NLM",
        "vin": "JF1SF63531H"
    }
]