[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/19/2003",
        "dateOfIncident": "03/08/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010749,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 CHRYSLER INTREPID V6-2.7 LITER VEHICLE.  AT 57,442 MILES I NOTICED A TICKING NOISE COMING FROM THE ENGINE OF THE CAR.  THE DEALERSHIP I PURCHASED THE CAR FROM DIAGNOSED THE ENGINE NOISE AS A NON-COMPRESSING OR EXTENDING TIMING CHAIN TENSIONER.  THE TENSIONER WAS REPLACED AND THE COST WAS COVERED UNDER MY 60,000-MILE WARRANTY.  LAST WEEK I NOTICED THE SAME TICKING NOISE WHILE I WAS DRIVING THE CAR.  BEFORE I COULD REACH A SAFE DESTINATION THE CAR ENGINE COMPLETELY STOPPED RUNNING AT 64,222 MILES.  AFTER COMING TO A STOP THE CAR WOULD NOT START AGAIN.  I HAD THE CAR TOWED TO THE DEALERSHIP TO BE LOOKED AT AND TOLD THE SERVICE ADVISOR I HEARD THE SAME TIMING CHAIN NOISE THAT OCCURRED AT 57,442 MILES.  THE DEALERSHIP SERVICE ADVISOR STATED THAT THEY WERE ABLE TO START THE CAR FOR A SHORT PERIOD OF TIME AND ALSO CHECKED THE ENGINE OIL.  THE SERVICE ADVISOR INFORMED ME THAT I WOULD NEED A NEW ENGINE AT A PRICE OF APPROXIMATELY $6,700.00?!  I ASKED THE SERVICE ADVISOR IF A DIAGNOSTIC TEST WAS PERFORMED AND HE SAID ??NO??.  BY LOOKING AT MY OIL LEVEL AND LISTENING TO MY ENGINE NOISES THE SERVICE ADVISOR RECOMMENDED AN ENTIRELY NEW ENGINE.  I WAS ACCUSED OF NOT CHANGING MY ENGINE OIL REGULARLY EVEN THOUGH I DO.  I ASKED ABOUT REPAIRING NON-WORKING PARTS OF THE ENGINE BUT THE SERVICE ADVISOR TOLD ME IT WOULD MOST LIKELY COST MORE THAN A NEW ENGINE CONSIDERING THE LABOR HOURS INVOLVED WITH THIS TYPE OF REPAIR.  THE SERVICE ADVISOR WAS SO SURE THAT I NEEDED A NEW ENGINE AFTER ONLY CHECKING THE OIL AND LISTENING TO THE ENGINE NOISES.  I HAVE FOUND WEB SITES WITH HUNDREDS OF PEOPLE HAVING SIMILAR PROBLEMS WITH THE V6-2.7 LITER DODGE/CHRYSLER ENGINE (ENGINE FAILURE WITHOUT WARNING, VERY PREMATURELY, AND DEALERSHIPS THEY WENT TO SAID THEY DIDN'T CHANGE THEIR OIL OFTEN ENOUGH).    *NLM",
        "vin": "2C3HH46R7YH"
    }
]