[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2003",
        "dateOfIncident": "02/24/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010663,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "TRANS SPORT",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I ARE THE ORIGINAL OWNERS OF A 1997 PONTIAC TRANSPORT WITH 71,000 MILES.  SINCE ABOUT 65,000 MILES, IT SEEMED TO VERY SLOWLY LOSE COOLANT, BUT WE COULD NOT FIND OUT WHERE IT WAS GOING.  AT 70,000 MILES, A \"WHITE MILKY SLUDGE LIKE JELLY MATERIAL\" APPEARED IN THE ENGINE, AND RIGHT AWAY I KNEW WE HAD A PROBLEM.  THIS VEHICLE HAS BEEN METICULOUS MAINTAINED, SO IMMEDIATELY I TOOK IT TO OUR LOCAL PONTIAC DEALER AND INFORMED THEM THAT WE HAD COOLANT LEAK.  THE SERVICE DEPARTMENT AT THE DEALER CONFIRMED THAT THE LOWER INTAKE MANIFOLD GASKET HAD FAILED, ALLOWING COOLANT TO MIX IN WITH THE OIL.  THEY HAD TO REPLACE THE GASKET AND FLUSH OUT THE MOTOR ALL TO THE TUNE OF $731.00.  CALLING GM CUSTOMER SERVICE WAS A WASTE OF TIME BECAUSE THEY \"DENIED\" ANY PROBLEMS, AND THEY SAID SINCE THE VEHICLE WAS OUT OF WARRANTY, WE WERE RESPONSIBLE FOR ANY REPAIRS.   COME TO FIND OUT THAT A LOT OF OTHERS WERE EXPERIENCING THE SAME INTAKE MANIFOLD GASKET ISSUES WITH GM.  I AM HOPING THAT OUR PROBLEMS WAS CAUGHT IN TIME AS IT SEEMS LIKE MANY FOLKS ARE WORSE OFF.   I KNOW THAT MY VEHICLE IS OUT OF WARRANTY, BUT SINCE THE PROBLEM SEEMS TO BE WIDESPREAD ACROSS MANY GM VEHICLES, MODELS, AND ENGINES, I THINK THAT GM SHOULD BE HELD RESPONSIBLE FOR SOME/ALL OF THE COSTS ASSOCIATED WITH THIS GASKET DEFECT/SERVICE ISSUE.  I DIDN'T KNOW IF YOU MIGHT BE ABLE TO HELP OUT?? *JB",
        "vin": ""
    }
]