[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/20/2003",
        "dateOfIncident": "12/29/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPORTED TO THE DEALER A PROBLEM WITH MY '02 BRAVADA IN WHICH VEHICLE SHUDDERING OCCURRED WHILE STARTING A TURN FROM A STOP.  I WAS TOLD THE PROBLEM WAS IN THE ALL WHEEL DRIVE (ALL WHEEL DRIVE) TRANSFER CASE AND THAT OLDSMOBILE (GM) WAS ATTEMPTING TO SOLVE THE PROBLEM BUT HAD NOT YET (AS OF 9/17).  IN 12/02 ALL WHEEL DRIVE WAS INOPERATIVE AND A FAULTY TRANSFER CASE SHIFT CONTROL MODULE WAS REPLACED ON 12/09/02 RESTORING ALL WHEEL DRIVE.  ON 12/18/02, THE TRANSFER CASE ENCODER MOTOR POSITION SENSOR WAS REPLACED.  CALIBRATION CHANGES WERE ALSO MADE TO INCREASE TO DELAY IN WHICH FRONT WHEEL ENGAGEMENT OCCURS AND TO DISENGAGE IMMEDIATELY.  PROBLEM:  THE CALIBRATION CHANGES HAVE LED TO A VERY UNSAFE CONDITION WHEN DRIVING IN WET AND SNOW CONDITIONS PARTICULARLY, DRIVING THE VEHICLE IN THESE CONDITIONS IS VERY TREACHEROUS AND RISKY BECAUSE SIGNIFICANT REAR WHEEL SPIN OCCURS (DUE TO THE INCREASED DELAY) UNTIL THE ALL WHEEL DRIVE ENGAGES WITH A LURCH.  IN SLOW TRAFFIC SITUATIONS THIS LEADS TO A SERIES OF CONVULSIVE, SPASMODIC LURCHES, WITH REAR END FISH TAILING, AS THE ALL WHEEL DRIVE ENGAGES AND DISENGAGES UNCONTROLLABLY.  AT MORE MODERATE SPEEDS, APPROXIMATELY 20 MPH, THE FISH TAILING BECOMES EXAGGERATED AND LEADS TO A SPIN OUT (FORTUNATELY, THERE WAS NO OTHER TRAFFIC).  I HAVE DRIVEN 4 WHEEL DRIVE VEHICLES FOR 15 YEARS, ALL WHEEL DRIVE FOR 6 YEARS AND HAVE NEVER EXPERIENCED ANYTHING LIKE THIS.  THIS IS TRULY THE MOST DANGEROUS VEHICLE I HAVE EVER DRIVEN IN SNOW, INCLUDING 2 WHEEL DRIVE.  IT CANNOT BE DRIVEN SAFELY IN EVEN THE LIGHTEST SNOW CONDITION.  WHAT IS THE POINT IN OWNING AN SUV IF IT CANNOT BE SAFELY DRIVEN UNDER CONDITIONS IN WHICH YOU NEED IT.  DEALER SERVICE, OLDSMOBILE CUSTOMER SERVICE, AND TECH SERVICE ADVISOR ALL SAY THE SYSTEM IS PERFORMING ACCORDING TO MANUFACTURER SPECIFICATIONS.  I FIND THAT STATEMENT TO BE OUTRAGEOUS.   *JB",
        "vin": "1GHDT13SX22"
    }
]