[
    {
        "components": "STEERING,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/23/2003",
        "dateOfIncident": "03/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010917,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VENTURE",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1998 CHEVY VENTURE VAN.  I RECENTLY TOOK IT IN FOR A RECALL FOR A DEFECT ON THE STEERING RACK AND PINION (NHTSA CAMPAIGN ID NUMBER : 02V286000).  THE DEALER WOULD NOT REPLACE THE DEFECTIVE COMPONENT BECAUSE THE VAN HAS A SALVAGE TITLE.  I WAS NOTIFIED THAT \"THE BEARING IS ABOUT TO FALL OUT\"  AND THE ENTIRE RACK AND PINION WAS DAMAGED DUE TO THE DEFECT AND HAS TO BE REPLACED AT A COST OF $600.  I CALLED GM AND WAS INFORMED THAT IT WAS THEIR POLICY NOT TO DO RECALLS ON VEHICLES WITH A SALVAGED TITLE.  THIS IS A DEFECT AND A SAFETY ISSUE REGARDLESS OF THE SALVAGED TITLE AND I THINK GM SHOULD BE RESPONSIBLE FOR FIXING IT.  THERE IS ALSO ANOTHER SAFETY RECALL ON THE TRANSMISSION (NHTSA CAMPAIGN ID NUMBER : 98V131000) THAT IS A PROBLEM ON MY PARTICULAR VAN.  ABOUT A YEAR AGO, A 5 YEAR OLD FRIEND OF THE FAMILY WAS PLAYING IN THE VAN (WITHOUT OUR KNOWLEDGE).  HE WAS ABLE TO MOVE THE SHIFT LEVER ENOUGH TO DISENGAGE THE TRANSMISSION LOCK EVEN THOUGH IT WAS STILL IN PARK, AND THE VAN ROLLED DOWN THE HILL IN OUR BACK YARD.  IT WAS STOPPED BY A SMALL TREE.  NOBODY WAS HURT EVEN THOUGH THERE WERE TWO OTHER CHILDREN IN THE BACK YARD PLAYING AND THE VAN SUFFERED ONLY MINOR DAMAGE.  I THOUGHT PERHAPS THIS WAS BECAUSE THE VAN HAD PREVIOUSLY BEEN IN AN ACCIDENT SO I DIDN'T PURSUE LOOKING INTO THE PROBLEM.  THEN I DISCOVERED THE RECALL ON IT AND NOW I FEEL THAT GM SHOULD FIX THIS PROBLEM.  WHAT CAN I DO TO GET THEM TO FIX MY VAN?.   *JB",
        "vin": "1GNDU03E0WD"
    }
]