[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/24/2003",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010923,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT1100",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 HONDA MOTORCYCLE SABRE 1100 CC.  THE \"PIVOT BOLT\" AND \"ACORN NUT\" THAT HOLD THE SHIFT PEDAL AND LINKAGE IN PLACE COMES TOTALLY LOOSE AND VIRTUALLY FALLS OFF EVERY 50 MILES.  THIS HAPPENED ON MY FIRST RIDE ON THE NEW MOTORCYCLE.  TWENTY-FIVE MILES OUT, THE MOTORCYCLE WAS NOT SHIFTING RIGHT.  I LOOKED DOWN AND SAW THE SHIFT PEDAL HANGING BY THE LAST THREAD ON THE BOLT.  I GOT OFF THE ROAD, USED THE HANDY TOOL KIT HONDA PROVIDES, AND TIGHTENED EVERYTHING UP.  IF IT HAD COME ALL THE WAY OFF, IT COULD HAVE RESULTED IN AN ACCIDENT, AND WOULD CERTAINLY HAVE RENDERED THE MOTORCYCLE INOPERABLE, LEAVING ME STRANDED BY THE SIDE OF THE ROAD.       I ATTRIBUTED MY MISFORTUNE TO THE BOLT NOT BEING TIGHTENED PROPERLY DURING THE MANUFACTURING ASSEMBLY AND/OR DEALER ASSEMBLY.  WHEN I GOT HOME, I DISASSEMBLED THE PEDAL, AND PROPERLY LUBRICATED AND REASSEMBLED THE PEDAL AND LINKAGE AS PER FACTORY SPECS.  MUCH TO MY SURPRISE, 50 MILES LATER IT WAS HANGING BY THE LAST THREAD AGAIN.  I CAUGHT IT JUST BEFORE IT FELL OFF.  I NOW HAVE IT BOLTED ON USING A STANDARD \"HARDWARE-STORE\" SELF-LOCKING NUT.  I RODE 150 MILES YESTERDAY WITH NO PROBLEM.         I NOW THINK THERE IS A DESIGN FLAW OR ASSEMBLY ERROR IN USING THE WRONG TYPE OF BOLT AND NUT.  I CANNOT BLAME IT ON SLOPPY ASSEMBLY AS IT CAME LOOSE AGAIN AFTER I METICULOUSLY ASSEMBLED EVERYTHING MYSELF.       TO HAVE THIS CRITICAL PIECE OF EQUIPMENT CONSISTENTLY COME LOOSE IN 25-50 MILES OF RIDING IS A VERY DANGEROUS SITUATION.  I AM SURE YOU WOULD AGREE.  I AM SUBMITTING THIS FOR YOUR CONSIDERATION.  I HAVE NOTIFIED HONDA AS WELL.  *JB",
        "vin": "1HFSC43053A"
    }
]