[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/23/2003",
        "dateOfIncident": "03/18/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010904,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKING CAR OUT OF DRIVEWAY IN APPROXIMATELY. 6 INCHES OF SNOW (HAD BEEN PARKED NIGHT BEFORE AFTER 1-2 INCHES HAD FALLEN).  ROCK GUARD CAUGHT SNOW (GAVE NO FEELING OF RESISTANCE) AND RIPPED OFF, ALSO PULLING OFF FRONT BUMPER (MOSTLY DRIVER SIDE) AND DAMAGING DRIVER SIDE HEAD LAMP ASSEMBLY.  DEALER CLAIMS THIS IS \"NORMAL.\"  HOWEVER, THE MINIMAL SPEED AND FORCE THAT IT TOOK FOR THIS AMOUNT OF DAMAGE MAKES US QUESTION THE INTEGRITY OF THE PARTS USED IN OUR VEHICLE.  TOYOTA REFUSES TO INVESTIGATE OR CLAIM ANY RESPONSIBILITY, AND REFUSES TO GIVE OUT ANY INFORMATION ON HOW TO REACH A FACTORY REP. OTHER THAT TELLING US THEY WILL \"RELAY THE COMPLAINT\" TO THE FACTORY REP. AND HAVE HER CALL US \"WHENEVER SHE WILL BE IN TOWN.\"  THE VEHICLE HAS ONLY BEEN OWNED FOR 8 1/2 MONTHS AND HAS NEVER BEEN IN AN ACCIDENT.  IT HAD NO PROBLEMS DRIVING FORWARD IN SNOW CONDITIONS.  WE WERE TOLD DUE TO THE BUILD OF THE VEHICLE TO WITHSTAND FRONT END COLLISIONS, THAT IT MAKES THE CAR VULNERABLE TO THE CIRCUMSTANCES WE HAVE EXPERIENCED, HOWEVER, WE WERE NOT GIVEN THIS INFORMATION PRIOR TO PURCHASING THE VEHICLE.  WE HAVE NEVER HAD THIS PROBLEM WITH ANY OTHER VEHICLE IN EXACTLY THE SAME OR WORSE CONDITIONS IN THE PAST.  WE ARE NOW BEING HELD RESPONSIBLE FOR OVER $1400 IN DAMAGES.  WE FEEL THAT THERE IS FAULTY MANUFACTURING INVOLVED AND WOULD LIKE THIS INVESTIGATED.  WE ALSO WANT TOYOTA TO OWN UP TO SOME RESPONSIBILITY FOR THEIR PRODUCT MANUFACTURING.  *JB",
        "vin": "JTDBE32K620"
    }
]