[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/24/2003",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010946,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 NISSAN MAXIMA.  ITS HEAD LIGHT HAS BEEN STOLEN TWICE IN THE PAST 6 MONTHS, ONCE IN RIDGEFIELD PARK, NJ AND THE OTHER IN WEST PATERSON, NJ.  BOTH CASES, THEY POPPED OUT THE GRILL THEN POPPED HEAD LIGHTS FROM SIDE. THE  RUMOR I HEARD WAS THAT SOME DEALER HAD 14 PAIRS OF MAXIMA'S HEAD LIGHTS STOLEN.  I HAVE BEEN SEARCHING INTERNET FORUM, LISTENING TO MECHANICS, AND SEARCHING PLACES TO GATHER INFORMATION REGARDING THIS MATTER AND FOUND OUT THAT THESE HEAD LIGHTS CAN BE STOLEN WITHIN FEW MINUTES.  IN FACT, ON SECOND TIME, 2 MAXIMA'S IN SAME PARKING LOT HAD HEAD LIGHTS STOLEN WITHIN MATTER OF MINUTES AS WITNESS RECALLED.    I HAVE SPOKEN TO A NISSAN DEALER AND THEY SAID, \"(THEY) PROVIDE ANTI-THEFT DEVICE FOR SUCH BUT WON'T BE AFFECTIVE SINCE IT'S A DIFFERENT TYPE OF HOOD LATCH.\"  AND, I HAVE TO PAY FOR IT.    I HAVE ANOTHER VEHICLE WITH HID.  TO TAKE HID HEAD LIGHTS OUT OF THIS VEHICLE, MECHANIC HAS TO REMOVE BUMPER, FEW STEEL BEAMS, AND LOTS OF SCREWS INCLUDING HIDDEN ONES.  IT WOULD TAKE MORE THAN AN HOUR.  2002 & 2003 NISSAN MAXIMA'S HEAD LIGHTS ARE TOO EASY TO STEAL WHICH COSTS CONSUMERS TIME AND MONEY TO REPLACE.  FOR EXAMPLE, IT TOOK MORE THAN 3 WEEKS TO REPAIR SINCE PARTS ARE OUT OF STOCK DUE TO INCREASING NUMBER OF STOLEN HEAD LIGHTS AND IT COST INSURANCE COMPANY OVER $2,500 PLUS RENTAL CAR WHICH TOTALS MORE THAN $3,500.    I WILL BE GLAD TO SEE NISSAN DESIGNS A ANTI-THEFT DEVICE THAT WOULD MAKE STEALING HEAD LIGHTS MUCH HARDER AND DISTRIBUTE IT AT THEIR EXPENSE.   *JB",
        "vin": ""
    }
]