[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/26/2003",
        "dateOfIncident": "03/26/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011047,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 INTREPID BY DODGE WITH APPROXIMATELY 43000 MILES ON IT. THE ENGINE HAS BEEN BLOWN AND I WAS INFORMED THAT WE HAVE TO PAY FOR THE REPAIR TO BE DONE BECAUSE OF SLUDGE IN THE ENGINE.. I HAVE AN EXTENDED WARRANTY ON THIS VEHICLE THAT I BOUGHT AT THE TIME OF PURCHASE.. BECAUSE OF THE FACT THAT WE DO OUR OWN OIL CHANGES AND THE ONLY THING WE ARE GUILTY OF IS NOT KEEPING RECEIPTS THAT WE HAVE BOUGHT OIL AND FILTERS TO CHANGE IT.. WE HAVE DOCUMENTATION ON DATES AND MILEAGE THAT WE HAVE HAD THEM DONE.. IN FACT THE LAST ONE WAS DONE AT A PLACE OF BUSINESS.  THE VEHICLE STARTED MAKING A CLANKING NOISE WHILE I WAS DRIVING , NO WARNING LIGHT OR ANY SUCH LIGHT CAME ON THE INSTRUMENT PANEL WHATSOEVER I PROCEEDED TO PULL OVER IN A PARKING LOT AND SHUT THE CAR OFF, AND IT WOULD NOT START, I  HAD THE CAR TOWED TO DEALERSHIP..THEY HAVE NOW HAD MY CAR FOR 3 WEEKS AT THE DEALERSHIP.  DODGE CORPORATE IS SAYING THAT THEY HAVE NOTHING TO DO WITH THIS COMPLAINT BECAUSE OF THE FACT THAT THE EXTENDED WARRANTY IS NOT THROUGH THEM, THE DEALERSHIP CAN USE WHOM EVER THEY WANT TO FOR EXTENDED WARRANTIES. I HAVE SEARCHED MANY COMPLAINTS AND THIS IS AN ONGOING PROBLEM WITH THESE ENGINE'S. MY EXTENDED WARRANTY IS FOR 7 YEARS OR 75000 MILE WHICH EVER COMES FIRST.. I HAD A DIFFERENT DEALERSHIP LOOK AT MY CAR FIRST AND WE HAD TO PAY THEM ALMOST 400.00 TO HAVE THEM LOOK AT THE VEHICLE AND TELL US THE WARRANTY PEOPLE WILL NOT FIX IT. THEY ALSO INFORMED US THAT THE TIME CHAINING HAD BLOWN AND WHEN THAT HAPPENS YES THERE WILL BE SLUDGE AND WHATEVER ELSE. WHICH WHY YOU HAVE TO REPLACE THE WHOLE ENGINE. I HAVE RESEARCHED THIS AND KNOW THAT THERE IS NUMEROUS COMPLAINTS ON THIS PARTICULAR CAR AND ENGINE. PLEASE CAN YOU ADVISE AND HELP.. AS AN ADDED NOTE THE CAR ALSO SMELLS LIKE IT IS BURNING OIL. *JB",
        "vin": "2B3HD46R5YH"
    }
]