[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/24/2003",
        "dateOfIncident": "03/12/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010966,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "SIMPLY PUT.  THE GAS PEDAL STICKS.  MY WIFE HAS FOUND THE GAS PEDAL TO STICK WHILE SHE IS DRIVING.  IN THE PAST, THE GAS PEDAL WOULD COME UP IN A SECOND OR SO.  SHE DID NOT REALIZE WHAT WAS HAPPENING.  SHE THOUGHT HER SHOE WAS GETTING IN THE WAY OR SOMETHING.  BUT ON THE EVENING OF MARCH 12TH THE PEDAL WAS STICKING DOWN FOR ABOUT 5-10 SECONDS AS SHE WAS TRYING TO SLOW DOWN FOR AN INTERSECTION.  IT FINALLY CAME UP AND SHE COULD COME TO A STOP.  SHE CALLED ME IMMEDIATELY AND I INDICATED THAT THE CAR NEEDS TO GO IN IMMEDIATELY.  THE EARLIEST THE DEALER WOULD TAKE THE CAR WAS THE MORNING OF MARCH 14TH.  WHEN I EXPLAINED IT TO THE SERVICE GUY, HE KNEW EXACTLY WHAT WAS WRONG. HE EXPLAINED TO ME THAT THE AIR INTAKE FOR THE ENGINE IS CONNECTED TO THE THROTTLE BODY.  THE AIR INTAKE FLAP  HAS A BUILD UP AROUND 15,000 AND IT WILL NOT CLOSE PROPERLY.  THIS WILL CAUSE THE GAS PEDAL TO STICK.  HE TOLD ME THAT I NEED TO HAVE THIS SERVICED EVERY 15,000 MILES FROM HERE ON IN.  HE WROTE ON THE SERVICE SLIP \"ENGINE MINOR\".  I CALLED TOYOTA CONSUMER SERVICE AND THEY INDICATED THAT THIS IS AN USUAL INCIDENT.  HOWEVER, HE SAID IN THE SAME CONVERSATION THAT THIS PROBLEM HAS OCCURRED WITH THE SAME YEAR MODEL ON OTHER CARS.  THE GENERAL EMPHASIS ON HIS PART WAS I WAS OVER REACTING AND INDICATED THIS PROBLEM WILL NOT HAPPEN AGAIN.  THIS CAR HAS ONLY 50,000 MILES.  TOYOTA'S STANCE WAS THAT THIS PROBLEM HAS HAPPENED ON OTHER CARS BESIDES TOYOTA.  I AM PLEADING WITH THIS ORGANIZATION TO INVESTIGATE THIS MATTER.  I FEEL MY WIFE'S CAR IS NOT COMPLETELY SAFE UNLESS TOYOTA REPLACES THE PART IN A SPECIFIED AMOUNT OF TIME OR REDESIGNS THE ASSEMBLY AND DOES A RECALL.   *JB",
        "vin": "4T1BG22K0WU"
    }
]