[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "03/25/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013534,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 25, 2003, AT 5:15 PM MY 2002 FORD ESCAPE WITH 13800 MILES STALLED GOING DOWN A STEADY GRADE.  I LOST ALL POWER TO THE STEERING AND BRAKES.  IN RUSH HOUR TRAFFIC, WITH SEVERAL OTHER MOTORISTS IN FRONT OF AND BEHIND ME, I HAD TO FIGHT THE STEERING WHEEL AND BRAKES TO REGAIN CONTROL OF THE VEHICLE, ALL WHILE ATTEMPTING TO RESTART THE CAR--AN ABSOLUTELY FRIGHTENING SITUATION.  THIS IS THE SECOND TIME IN 7 MONTHS THIS HAS HAPPENED.  THE FIRST TIME THIS HAPPENED, I WAS GOING DOWN A SHARP GRADE AROUND A TIGHT BEND TO THE RIGHT.  I LOST ALL POWER TO THE BRAKES AND STEERING, CAUSING ME TO NEARLY FALL OVER A STEEP CLIFF ONTO TRAFFIC BELOW.  HAD THIS HAPPENED, I'M SURE I WOULD HAVE BEEN KILLED ALONG WITH SEVERAL OTHER MOTORISTS AS WELL.  EACH TIME I TOOK THE CAR DIRECTLY TO THE DEALERSHIP WHERE I WAS TOLD THE PROBLEM WAS \"FIXED.\"  THIS CAR IS EXTREMELY UNSAFE TO DRIVE AS IT SHUTS DOWN WITHOUT WARNING!  I HAVE INFORMED THE DEALER OF MY CONCERNS ABOUT THIS VEHICLE'S EXTREMELY UNSAFE CONDITION, AND THEIR RESPONSE IS THAT I SHOULD TRADE IT IN AND BUY YET ANOTHER NEW CAR FROM THEM.  I HAVE ALSO HEARD OF SEVERAL OTHER PEOPLE IN MY AREA WHO ARE EXPERIENCING THE SAME PROBLEM WITH THE SAME TYPE OF VEHICLE.  FORD NEEDS TO CORRECT THIS VERY SERIOUS ISSUE IMMEDIATELY BEFORE THERE ARE DEATHS ASSOCIATED WITH THIS APPARENTLY COMMON FACTORY DEFECT!   *NLM",
        "vin": "1FMYU04142K"
    }
]