[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "02/02/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013566,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PRESSING ON THE GAS PETAL, IT FEELS ROUGH AND NOTCHY. IT'S HARD TO ACCELERATE SMOOTHLY. STARTED TO NOTICE THE PROBLEM AT ABOUT 85,000 MILES. THEN, WHEN I WAS ON THE FREEWAY THE ENGINE LIGHT CAME ON. I TOOK IT TO SCOTT ROBINSON HONDA IN TORRANCE AND THEY SAID THE PROBLEM WAS PROBABLY MY DIAGNOSTICS SYSTEM. THEY INFORMED ME THAT IS WAS COVERED BY HONDA EXTENDED WARRANTY. AFTER MY CAR WAS IN THE SHOP ALL DAY, THE TECHNICIAN INFORMED ME THAT IT WASN'T MY DIAGNOSTICS SYSTEM, BUT MY TRANSMISSION. HE SAID THAT THE COMPUTER'S DIAGNOSED CODE WAS(PO715), WHICH MEANS THAT THE MAINSHAFT SPEED SENSOR FAILED. HE SAID THAT SINCE THAT PART IS INSIDE THE TRANSMISSION, THEY FELT I SHOULD HAVE IT REPLACED. THEY WANTED ME TO SPEND $3,500.00 ON A REBUILT ONE TO REPLACE MINE. I ASKED HIM IF MY CAR WOULD BE OK TO DRIVE AROUND WITHOUT REPLACING IT, HE SAID HE DIDN'T KNOW. IT COULD DIE ON ME IN A WEEK, OR IN A YEAR. SO FAR, MY CAR IS STILL RUNNING. I HAVE NEVER MISSED A REQUIRED SERVICE DATE. MY ENGINE LIGHT STILL OCCASIONALLY COMES ON, AND I HAVE TO DISCONNECT THE BATTERY EACH TIME TO RESET THE COMPUTER SO IT WILL GO OFF. THE GAS PETAL STILL FEELS ROUGH WHEN I PRESS ON IT FROM A COMPLETE STOP. I TOLD HONDA ABOUT THE RECALL #99I002000 (VEHICLE SPEED CONTROL) AND ASKED THEM IF THEY WOULD REPLACE MY THROTTLE CABLE. HONDA INFORMED ME THAT THERE IS NO SUCH RECALL ON A 1997 HONDA CIVIC. I PRINTED OUT THE INFO FROM YOUR WEBSITE AND FAXED IT TO THEM. I AM STILL WAITING TO HEAR BACK.   *NLM",
        "vin": "2HGEJ6620VH"
    }
]