[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013555,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "CENTURY",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BUICK HAS 90,000 MILES ON IT.   I HAD A PROBLEM WITH THE CAR. THE CAR WAS JUMPING INTO GEAR. THE JUMPING STARTED VERY VERY SMALL IN AUGUST 2002. TODAY THE JUMPING IS VERY NOTICEABLE. AFTER ONLY DRIVING IT, THEY TOLD ME THERE WAS SOME INTERNAL TRANSMISSION PROBLEMS. THEN THEY HOOKED MY CAR UP TO A DIAGNOSTIC COMPUTER AND TOLD ME THE PRESSURE IN TRANSMISSION WAS LOW.  THEY TOLD ME THEY WERE NOT SURE I WOULD BE ABLE TO DRIVE SAFELY TO MY NEXT DESTINATION. I ASKED THE REPRESENTATIVES WAS THE PROBLEM UNDER WARRANTY? THE REPRESENTATIVES SAID \"NO.\"  THE POWERTRAIN HAD JUST GONE OUT  AT 80 THOUSAND MILES. ONLY 10 THOUSAND MILES AGO. THE REPRESENTATIVES AT SALE AUTO MALL ENCOURAGED ME TO GO AHEAD AND TRADE THE CAR. THEY WERE SORRY BUT THE WARRANTY HAD EXPIRED AND THEY COULD NOT REPLACE ANYTHING. I ASKED THE REPRESENTATIVES HOW MUCH WOULD IT COST ME TO REPLACE THE TRANSMISSION? THEY QUOTED ME A PRICE OF ABOUT $3000. WHICH WOULD BE FOR A REBUILT ONE GM WOULD GUARANTEE FOR 3 YEARS OR 50,000 MILES.  I DROVE AWAY WITHOUT LETTING THEM FIX THE CAR. MY COMPLAINTS ARE:  1.SINCE I KEPT GOOD SERVICE ON MY CAR, THE CAR'S TRANSMISSION SHOULD HAVE LASTED LONGER THAN IT HAS---TROUBLE FREE. POWERTRAIN WARRANTIES USUALLY LAST 5 YEARS/ 100,000 MILES NOT 8 YEARS/80,000 MILES.  2. WHEN I PURCHASED MY BUICK, I WAS TOLD BY ALL BUICK COMMERCIALS ON TV  ALL FLUIDS, LIKE THE BRAKE FLUID, TRANSMISSION FLUID(DEX-TRANIII), AND ANTIFREEZE(DEX-COOL) ARE GUARANTEED FOR AT LEAST 100,000 MILES. I GET THE OIL CHANGED REGULARLY AT  EVERY 3,000 MILES. IF OVERHEATED TRANSMISSION FLUID POSSIBLY HELPED CAUSE THIS JUMPING TRANSMISSION PROBLEM, WHY DID GENERAL MOTORS MARKET SUCH FLUIDS, AS I MENTIONED, WERE GUARANTEED FOR 100,000 MILES?  3. TRANSMISSIONS SHOULD NOT BE FAILING AT 90,000 ON A CAR THAT HAS BEEN TAKEN CARE OF,  THAT IS ONLY 3 YEARS OLD.   *NLM",
        "vin": "2G4WY55J8Y1"
    }
]