[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "03/03/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013543,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 FORD TAURUS SE, ABS, TRACTION CONTROL, 3.0 24 VALVE ENGINE.  THIS MONTH WE HAD TO REPLACE THE REAR BRAKES WITH ONLY 45,500 MILES ON THE CAR.  THE VEHICLE IS KEPT IN HOUSE GARAGE. AFTER DRIVING A FEW DAYS ON RAIN SLICK ROADS AND AFTER BEING IN THE GARAGE OVERNIGHT THE REAR BRAKES HAD LOCKED SHUT AND WOULD NOT ALLOW THE VEHICLE TO MOVE. IT TOOK SEVERAL TIMES THROUGH-OUT THE DAY OF GENTLE SHIFTING BETWEEN DRIVE AND REVERSE TO GE THE REAR BRAKES TO UNLOCK AND FREE THE CAR TO MOVE. TOOK THE CAR IMMEDIATELY TO A NEARBY GOODYEAR DEALER TO HAVE THE BRAKES CHECKED. THE BRAKES APPEARED TO HAVE RUSTED SHUT. THE BRAKE CYLINDER COVERS ON BOTH REAR WHEELS HAD BURNED HOLES IN THEM FROM THE EXCESSIVE HEAT CREATED BY DRIVING WITH RUSTED BRAKES. THE EMERGENCY BRAKE CABLE WAS NOT INVOLVED IN THE PROBLEM, AND IT DID NOT SHOW ANY EVIDENCE OF BEING LOCKED. CALLED THE LOCAL FORD DEALER TO FIND OUT IF FORD WOULD TAKE CARE OF THE PROBLEM AND WAS ADVISED THAT SINCE THE 3 YEAR, 36,000 MILE WARRANTY HAD EXPIRED FORD WASN'T INTERESTED IN REVIEWING THE PROBLEM. FORD DEALER OFFERED TO MAKE REPAIRS AT MY EXPENSE AND THEN FILE A REPORT WITH FORD. I CHOSE TO HAVE GOODYEAR FIX THE BRAKES, AND KEPT THE RUSTED BURNED PARTS FOR FUTURE REVIEW IF NECESSARY.  SITUATION CREATED A POTENTIALLY DANGEROUS SITUATION WHEREBY THE REAR BRAKES COULD HAVE HEATED TO THE POINT OF CAUSING A FIRE OR OTHER SERIOUS PROBLEMS IF WE HAD TO TAKE THE VEHICLE ON A LONG DISTANCE DRIVE.  FORD AND THE NHTSA NEEDS TO LOOK AT THIS PROBLEM AS POTENTIALLY DANGEROUS.   *NLM",
        "vin": "1FAFP56S7YG"
    }
]