[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013539,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4 RUNNER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 TOYOTA 4RUNNER SR5.  VIN: [XXX].  IT WAS PURCHASED NEW FROM TOYOTA.    I PURCHASED A TOYOTA FOG LIGHT KIT FROM A TOYOTA DEALER.  TEXAS TOYOTA OF GRAPEVINE.   THE TOYOTA PART NUMBER FOR THE KIT IS PT297-89010.  MY VEHICLE COMES PRE-WIRED WITH A FOG LIGHT HARNESS.   THE KIT CONSISTED OF THE FOG LIGHT ASSEMBLIES 2 OF THEM (PT297-89014).  A SWITCH, RELAY AND SOME ANCILLARY PARTS ALONG WITH INSTRUCTIONS.    BY THE WAY, IT IS MADE BY HELLA FOR TOYOTA.   AGAIN THIS IS A VALID TOYOTA PART APPLICABLE TO MY VEHICLE.    THE PRODUCT WAS PURCHASED ON JULY 5 2000. AND WAS INSTALLED WITHIN 2 WEEKS    THE LIGHTS WORKED FINE FOR A WHILE.     THEN STOPPED WORKING, I AM NOT SURE OF THE EXACT DATE BECAUSE AT THE TIME I HAD NO IDEA THAT THE FOG LIGHT ASSEMBLIES WOULD BECOME DISPOSABLES. AT THE PRESENT TIME I CHECK THE FOG LIGHTS EVERYDAY BECAUSE OF MY FAILURE EXPERIENCE.    ON MAY 5 2001 ONE FOG LIGHT ASSEMBLY WAS REPLACED. THE PART WAS SUPPLIED UNDER THE TOYOTA 12 MONTH PART WARRANTY BY SMITHTOWN TOYOTA, SMITHTOWN NY BECAUSE IT WAS CORRODED. THE PART NUMBER OF THE REPLACEMENT WAS PT297-89014    ON JUNE 8 2001 THE OTHER FOG LIGHT ASSEMBLY WAS REPLACED. THE PART WAS SUPPLIED UNDER THE TOYOTA 12 MONTH PART WARRANTY BY SMITHTOWN TOYOTA, SMITHTOWN NY BECAUSE IT WAS CORRODED. THE PART NUMBER OF THE REPLACEMENT WAS PT297-89014      ON APRIL 4, 2002 I LOST ANOTHER FOG LIGHT DUE TOO CORROSION. THE UNIT WAS REPLACED BY TOYOTA OF MORRISTOWN NJ UNDER WARRANTY AFTER A SOMEWHAT HEATED DISCUSSION. THEY TOLD ME THAT THE WARRANTY HAD EXPIRED. THE PART NUMBER OF THE REPLACEMENT WAS PT297-89014    ON MARCH 18, 2003, WHICH HAPPENS TO BE MY BIRTHDAY; I NOTICED THAT ONE OF THE FOG LIGHTS WAS OUT. I TOOK THE RUBBER BOOT OFF AND IT AND THE WIRING WAS CORRODED AGAIN.    ON MARCH 26, 2003THE OTHER FOG LIGHT ASSEMBLY WAS REPLACED. THE PART WAS REPLACED UNDER WARRANTY BY AUTO LAND, SPRINGFIELD N.J BECAUSE THEY WERE CORRODED. THE PART NUMBER OF THE REPLACEMENT WAS PT297-89014.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JT3HN86R5Y0"
    }
]