[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/29/2003",
        "dateOfIncident": "03/02/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013628,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MARCH 2, '03  WHILE TRAVELING ON A SECONDARY ROAD WITH 5 OCCUPANTS, IN A NON-ACCIDENT EVENT, THE SUBJECT VEHICLE PASSED OVER A LARGE METAL PLATE THAT IS USED TO COVER ROAD WORK FOR THE EVENING OR WEEKEND.  WITHOUT WARNING THE DEFECTIVE AIRBAG SYSTEM DEPLOYED THE PSGR SIDE AIRBAGS!   NO DAMAGE OR IMPACTS WERE NOTED ON THE PASSENGER SIDE OF THE VEHICLE BODY.  HOWEVER, A SMALL SCRATCH WAS NOTED UNDERNEATH THE VEHICLE BETWEEN THE DOORS (RIGHT SIDE) AND WHAT APPEARED TO BE A THUMB PRINT IN THE UNDERCOATING UNDER THE FRONT PASSENGER SEAT.  NEITHER OR BOTH MAY BE RELATED TO THE INCIDENT.   VW INDICATED THAT THEY BELIEVE THAT ONE OR BOTH OF THE MARKS, BEING LOCATED VERY NEAR TO THE SENSORS, CAUSED THE DEPLOYMENT.   ALTHOUGH UNKNOWN FOR CERTAIN, IT IS POSSIBLE THAT A BOLT OR SOME OTHER OBJECT MAY HAVE BEEN LYING ON THE METAL PLATE AND MAY HAVE BEEN PINCHED BY A TIRE - CAUSING IT TO STRIKE THE BOTTOM OF THE VEHICLE.  IN NO WAY AN INCIDENT THAT SHOULD HAVE DEPLOYED THE AIRBAG SYSTEM.  VW HAS ADVISED THAT \"AN OUTSIDE INFLUENCE\" CAUSED THE AIRBAG TO DEPLOY AND STATED TO THE VEHICLE OWNER THAT \"THE SENSORS CANNOT DETERMINE WHETHER A STONE IS HITTING THE VEHICLE OR IF A TRUCK IS HITTING THE VEHICLE.\"  A STATEMENT THAT ALSO INDICATES A DEFECTIVE SYSTEM .  WHILE IT'S UNDERSTOOD THAT SENSORS ARE TO \"SENSE\" THAT SOMETHING HAS OCCURRED, THE \"AIRBAG CONTROL MODULE\"  SHOULD INTERPRET THE INFORMATION BEING SENT BY THE SENSOR AND BE ABLE TO MAKE A MORE REASONABLE ASSESSMENT.   IN ANY EVENT, IT IS IMPORTANT TO NOTE THAT GENERALLY VEHICLES ARE NOT STRUCK BY OTHER VEHICLES FROM UNDERNEATH.  VERY IMPORTANT NOTE AS OF 3/28/'03 - VW OF AMERICA HAS REFUSED TO COVER THIS UNDER WARRANTY - A $3,775 REPAIR!!!!!    IT IS IMPERATIVE THAT THE NHTSA INVESTIGATE THIS VERY SERIOUS DEFECT AND ORDER A RECALL BEFORE SOMEONE IS INJURED SERIOUSLY OR KILLED.   *NLM",
        "vin": "9BWGT61JX14"
    }
]