[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/29/2003",
        "dateOfIncident": "11/19/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "ASTRO",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE STEEL PROD. CO.",
                "productMake": "FIRESTONE",
                "productModel": "P215R7515",
                "productYear": "1982",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED REPLACEMENT TIRES FOR A 1999 CHEVROLET ASTRO ON THIS DATE.  THE DEALER FIRESTONE TIRE & SERVICE CENTERS, 7950 E SPEEDWAY, TUCSON, AZ 85715 REPRESENTED THE TIRES AS SUITABLE FOR MY VEHICLE.  AFTER I GOT HOME I DISCOVERED THE TIRES, FIRESTONE FR380 P215/75R15, WERE RATED FOR 1742 LBS AT 44 PSI BUT THIS SHOULD BE REDUCED TO 1585 LBS WHEN USING THIS TIRE ON A TRUCK OR MULTIPURPOSE VEHICLE WHICH, I ASSUME, WOULD PERTAIN TO A VAN AS WELL.  THE TIRE JUST MEETS THE MINIMUM REQUIREMENTS OF THE VAN WHICH IS A LOAD CAPACITY OF 1575 LBS. BUT IT MEETS THE REQUIREMENT ONLY WHEN INFLATED TO 44 PSI.  CHEVROLET RECOMMENDS A TIRE PRESSURE OF 35 PSI AND WHEN THE FIRESTONE INSTALLED THE TIRES THEY INFLATED THEM TO ONLY 30 PSI.  I INCREASED THE PRESSURE TO 44 PSI SINCE ONLY THEN WOULD THE TIRES MEET THE VAN SPECS.  I TRIED TO GET THE DEALER TO UPGRADE THE TIRES ABOUT 25 DAYS AFTER I BOUGHT THEM BUT THEY SAID THEY MET THE REQUIREMENTS OF MY VAN.  LATER WHEN I WENT IN FOR AN OIL CHANGE THE CHANGE SAID THE TIRES WERE OVER INFLATED AND REDUCED THEM ALL TO 35 PSI.  I AM VERY CONCERNED THAT THE TIRES ARE NOT SAFE BUT CANNOT GET CONSISTENT ADVICE NOR ANY ACTION FROM THE DEALER.  DOES THE NHSTA HAVE ANY STANDING IN SUCH A DISPUTE ?   *NLM",
        "vin": "1GNDM19W5XB"
    }
]