[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "10/01/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013581,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW VW PASSAT GLS 2002, ON JUNE 18, 2002 AT COMMONWEALTH VW AUDI, 1450 AUTO MALL DRIVE, SANTA ANA CA 92705. UNFORTUNATELY, THE VW PASSAT GLS 2002 HAS NOT HELD UP TO ITS PROMISE OF BEING A WELL-ENGINEERED CAR. AFTER LESS THAN 9 MONTHS OF OWNERSHIP, I HAD TO BRING THE CAR TO THE DEALERSHIP FOR REPAIRS 3 TIMES, WHICH IS A FAR DRIVE FROM MY PRESENT RESIDENCE IN HIGHLAND, CA.  I PURCHASED A BRAND NEW CAR WITH THE INTENTION OF HAVING A RELIABLE MODE OF TRANSPORTATION FOR THE TWO-HOUR TRIP BACK AND FOURTH FROM TUSTIN TO ONTARIO ON A DAILY BASIS FOR WORK.  I HAD CONFIDENCE IN VOLKSWAGEN BECAUSE OF ITS PRESTIGIOUS REPUTATION.  HAVING SUCCESSIVE CAR PROBLEMS HAS MADE ME RELUCTANT TO DRIVE THIS CAR. THE FIRST BREAKDOWN WAS IN OCT. 2002, THE MIL (MALFUNCTION INDICATOR LAMP) LIGHT CAME ON, THE CAR STARTED TO SHAKE, AND IT LOST POWER ON MY WAY TO WORK.  I WAS ABLE TO MAKE IT AND I HAD THE CAR TOWED TO THE DEALERSHIP. THE DEALERSHIP REPLACED THE DEFECTIVE IGNITION COIL, AND SET THE READINESS CODE.  I DID NOT GET A LOANER CAR, AND THE CAR WAS LEFT AT THE DEALERSHIP FOR TWO DAYS.  THE SECOND TIME, WAS IN DEC. 2003. THE EXACT SAME PROBLEM AROSE.  THIS TIME THEY HAD REPLACED ALL FOUR IGNITION COILS, SET THE READINESS CODE, AND SUPPLIED ME WITH A VW RENTAL.  THE CAR WAS IN THE SHOP FOR TWO DAYS AS WELL. I HAD LOST ALL CONFIDENCE IN THE PASSAT I PURCHASED.  THE THIRD OCCASION, AS I EXITED THE FREEWAY TO GET TO WORK, THE MIL LIGHT CAME ON AGAIN. I WAS AT A COMPLETE STOP. WHEN I PRESSED ON THE GAS, THE CAR JERKED TWO TIMES.  I MADE IT TO THE PARKING LOT OF MY JOB, AND HAD THE CAR TOWED YET ANOTHER TIME.  THIS WAS MARCH 18, 2003.  THE DEALERSHIP REMOVED AND INSTALLED THE AUTOMATIC TRANSMISSION FLUID  PAN, THE TRANSMISSION SPEED SENDER, AND THE VEHICLE SPEED SENSOR.  THEY SUPPLIED ME WITH A 3-DAY LOANER CAR.  THE PASSAT STAYED IN THE SHOP FOR 4 DAYS.  *JB",
        "vin": "WVWPD63B92P"
    }
]