[
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/30/2003",
        "dateOfIncident": "03/30/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013667,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS TURNED OFF DURING OPERATION AT NIGHT WHILE DRIVING. LISTED BELOW IS THE TEXT OF MY NOTE TO THE DEALER MORE FULLY DESCRIBING THE PROBLEM.    YOU MAY RECALL AFTER REVIEW OF YOUR SERVICE RECORDS THAT I BROUGHT THIS VEHICLE TO YOU DECEMBER 3, 2002 FOR A FAULTY BLOWER MOTOR.  AFTER DIAGNOSIS YOU PHONED AND INDICATED THE PROBLEM WAS A RESISTOR, NOT THE MOTOR AND DURING DIAGNOSIS YOU DISCOVERED WIRES UNDER THE HOOD DAMAGED BY AN ANIMAL WHO HAD BUILT A NEST UNDER THE COWLING.  I AUTHORIZED REPAIR OF BOTH THE RESISTOR AND THE WIRING.      ON JANUARY 3, 2003 I RETURNED THE VEHICLE TO YOU FOR A SIMILAR PROBLEM, THE BLOWER MOTOR WOULD FAIL INTERMITTENTLY ALONG WITH THE ELECTRONICALLY DIMMED REARVIEW MIRROR AND THE INTERIOR DASH LIGHT WOULD FAIL TO DIM WHEN THE HEADLIGHTS WERE TURNED ON.  YOU KEPT THE VEHICLE UNTIL JANUARY 7, 2003 BUT WERE UNABLE TO OBSERVE THE PROBLEM.    I HAVE HAD TWO INSTANCES OF THIS BLOWER FAILURE SINCE BUT WAS UNABLE TO GET TO YOU BEFORE THE FAN AND ASSOCIATED PROBLEMS DISAPPEARED.     THIS MORNING SHORTLY AFTER 5:00 AM (IN THE DARK) I HEADED TO THE RICHMOND AIRPORT.  AS I WAS ABOUT TO PULL ONTO ROUTE 54 FROM OUR DEVELOPMENT I DECIDED TO TURN ON THE BLOWER TO CLEAR MOISTURE FROM THE WINDOWS.  WHEN I DID THE HEADLIGHTS EXTINGUISHED.  HAD THIS BEEN TWENTY SECONDS LATER I MAY HAVE WRECKED MY VEHICLE AND INJURED OR KILLED MY PASSENGER AND MYSELF.   *NLM",
        "vin": "2G4WB52K2W1"
    }
]