[
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/28/2003",
        "dateOfIncident": "03/08/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013617,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS DURING THE FAST FREEZE WHEN THIS INCIDENT TOOK PLACE. WE WENT FROM 45 DEGREES TO 20 DEGREES WITH IN 2-3 HOURS. IT WAS RAINING AT FIRST THEN SWITCHED TO ICE & SNOW. WE PUT THE 2002 FORD EXPLORER IN 4X4 DRIVE DUE TO THE WEATHER CONDITIONS. AS WE WERE ENTERING THE EXPRESS WAY WE LOSS CONTROL OF THE TRUCK ONLY GOING 28 MILES PER HOUR. WE SPUN OUT OF CONTROL AND HIT THE GUARD RAIL. IT WAS AS THOUGH WE HAD NO 4X4 DRIVE. WE CALLED THE POLICE TO GET A ACCIDENT REPORT FOR OUR INSURANCE. WE THEN TOOK THE TRUCK A WEEK LATER TO MARTIN BUICK TO FIX THE BODY DAMAGE TO THE LEFT SIDE OF THE TRUCK. THEY TOOK THE TRUCK TO LASKO FORD ACROSS THE STREET TO WORK ON THE 4X4 SYSTEM. THEY TOOK THE CLUTCHES OUT AND DRAINED THE TRANSMISSION FLUID. THEY FOUND DAMAGE TO THE CLUTCHES. THESE PARTS WERE BLACKENED AND GLAZED OVER. THEY SAID THAT THIS LOOKS LIKE WEAR AND TEAR FOR THIS TRUCK AND THAT THE TRUCK WAS NOT MAINTAINED. WE REGULARLY CHANGED FLUIDS AND THE MANUAL STATES THAT THE TRUCK DOES NOT NEED MAINTENANCE UNTIL 150,000 MILES. I ASKED HOW COULD A NEW TRUCK HAVE SO MUCH DAMAGE TO THE 4X4 AND THEY SAID THAT IT MUST HAVE BEEN IN 4X4 WHEEL DRIVE FOR A LONG TIME. I KNOW AND SO DO MY PASSENGERS THAT THIS IS NOT TRUE. THE DASH BOARD ALWAYS INDICATED 2 WHEEL DRIVE NOT 4X4 UNLESS I PUT IT IN 4X4. THE AUTOMATIC 4X4 NEVER TURNED ON THE 4X4 DRIVE I HAVE ALWAYS HAD TO PUT IT IN 4X4 IF I NEEDED TO USE IT, WHICH HAS ONLY BEEN ONE OTHER TIME. SO FOR A TRUCK THAT IS ONE YEAR OLD AND ONLY BEEN DRIVEN IN 4X4 WHEEL DRIVE TWICE THERE SEEMS TO BE AN AWFUL LOT OF DAMAGE TO MY CLUTCHES AND MY FLUID SO BURNT. THE FOUR WHEEL DRIVE ON THIS TRUCK. I WILL HAVE THE MODULE THAT CONTROLS THE \"CONTROL TRAC\" 4X4 WHEEL DRIVE SYSTEM TESTED TO SEE IF IT FAILS TO ACTIVATE OR DE-ACTIVATE THE 4X4. THEN I WOULD LIKE FORD TO FIX THE PROBLEM OUT OF THEIR OWN EXPENSE AND STOP GIVING THEIR CLIENTS THE RUN-A-ROUND AND TO REIMBURSE ME FOR MY TIME AND EXPENSES. *JB",
        "vin": "1FMDU73E12U"
    }
]