[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2003",
        "dateOfIncident": "03/25/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013629,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 DODGE GRAND CARAVAN ES  THAT HAS ON 3 SEPARATE OCCASIONS HAD GRINDING NOISES COMING FROM THE LEFT FRONT TIRE AREA PRIOR TO THE STEERING WHEEL LOCKING UP WHEN MAKING LOW SPEED TURNS.  ON THE FIRST INCIDENT THE POWER STEERING WAS SO TIGHT I HAD TO FIGHT TO TURN LEFT ONTO MY STREET. FORTUNATELY THERE WAS NO ONE BEHIND OR IN FRONT OF ME BECAUSE THE CAR KEPT GOING STRAIGHT EVEN WHEN THE ROAD DIDN'T. I WAS ABLE TO STOP BEFORE I HIT THE CURB. ON THE SECOND INCIDENT, AGAIN I WAS TURNING AT A SLOW SPEED, THIS TIME RIGHT, AND AGAIN HAD A LOCKUP OF POWER STEERING. I WAS IN THE MIDDLE OF THE STREET AGAIN. THIS TIME WITH FRIGHTENED PASSENGERS AS THEY WATCHED ME STRUGGLE WITH THE STEERING WHEEL TO GET US OUT OF ONCOMING TRAFFIC. ON THE LAST INCIDENT, AGAIN  FIGHTING TO TURN ONTO MY STREET, I DIDN'T ATTEMPT TO TURN INTO MY GARAGE. I PARKED ON THE STREET AND CALLED FOR A TOW TO THE DODGE DEALERSHIP TO HAVE THEM LOOK AT IT. I DIDN'T FEEL SAFE DRIVING IT. I WANTED IT TO BE CHECKED OUT. I WASN'T LOOKING FORWARD TO GOING SINCE THE CAR IS OUT OF MANUFACTURER WARRANTY WITH 44,716 MILES ON IT, BUT I TOOK IT AND THE DEALER STATED THEY TESTED THE VEHICLE AND MADE SEVERAL TURNS AND FOUND THE VEHICLE IS OPERATING AS DESIGNED AT THIS TIME, SO I PICKED UP MY VAN AND I TOLD THE SERVICE ADVISOR THAT INTERMITTENT PROBLEMS ARE ALWAYS THE HARDEST TO FIND AND I WOULDN'T HAVE INCONVENIENCED MYSELF 2 DAYS IF THERE WASN'T A PROBLEM. I FEEL THERE IS A PROBLEM THAT SHOULD BE INVESTIGATED MORE COMPLETELY. MANY PROBLEMS DON'T SHOW UP UNTIL AFTER THE WARRANTY HAS EXPIRED AND PEOPLE IN THE REAL WORLD HAVE DRIVEN SOME MILES. UNDER REAL LIFE DRIVING CONDITIONS.  THERE IS WHERE YOU'LL FIND ANY FLAWS.  I AM MAKING THIS COMPLAINT BECAUSE PEOPLE MAY GET HURT OR KILLED IF THE POWER STEERING UNPREDICTABLY CONTINUES TO FAIL WITHOUT WARNING.   *NLM",
        "vin": "2B4GP54L81R"
    }
]