[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/29/2003",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013645,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT BRACKET/TRACK THAT ATTACHES THE DRIVER'S SEAT TO THE FLOOR BOARD BROKE ABOUT A YEAR AGO. I HAVE HAD TO DRIVE WITH A BROKEN AND UNSTABLE SEAT EVER SINCE. YESTERDAY WHILE ON THE FREEWAY I ATTEMPTED TO STRETCH MY BACK AND THE BRACKET/TRACK ON THE RIGHT SIDE BROKE! THIS CAUSED ME TO SWERVE AN NEARLY HIT THE MIDDLE CEMENT RETAINER WALL! NOW THERE IS NOTHING TO HOLD THE DRIVER'S SEAT SECURELY TO THE FLOOR. I HAVE A FRIEND WHO ALSO OWNED A 1994 MUSTANG AND THE EXACT SAME THING HAPPENED TO HIS SEAT TOO. IN FACT, EVERYTHING THAT WENT WRONG WITH HIS, WENT WRONG WITH MINE. WE BOTH HAVE HAD TO HAVE THE TRANSMISSIONS REPLACED (TWICE!), IDLE SENSORS REPLACED, COMPLETE BRAKE SYSTEM REPLACED, RADIATORS REPLACED, WATER PUMPS REPLACED, THE CHECK ENGINE LIGHTS REMAIN ON ALL THE TIME NO MATTER WHAT IS DONE TO THE CAR, AND THE SAME BRACKETS ON THE SAME SEATS HAVE BROKEN. AFTER THE MULTIPLE NUMBER OF COMPLAINTS REGARDING THE SAME SEAT ISSUE, DOESN'T THAT CONSTITUTE SOME SORT OF RECOURSE FOR THE CUSTOMER TO HAVE REPAIRS DONE AT FORD'S EXPENSE? IT'S OBVIOUSLY NOT AN OWNER'S ISSUE IF SO MANY OWNERS ARE HAVING THE SAME PROBLEM. IT'S OBVIOUSLY AN ISSUE OF FORD USING SUB-STANDARD MATERIALS IN THEIR MANUFACTURING OF THE VEHICLES. AS I SAID, THIS JUST ABOUT CAUSED ME TO HAVE A VERY MAJOR ACCIDENT ON THE FREEWAY. I COULD HAVE BEEN KILLED. IF FORD DOES NOT STAND BEHIND THEIR PRODUCT AND TAKE RESPONSIBILITY FOR THE DEFECTIVE PARTS IN THEIR CARS THEY ARE GOING TO FIND THEMSELVES WITH A VERY HUGE LAW SUIT WHEN SOME ON FINALLY DOES GET KILLED.  *NLM",
        "vin": ""
    }
]