[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/30/2003",
        "dateOfIncident": "09/19/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013693,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "WRX",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED SUDDEN LOSS OF BRAKE PRESSURE: [I HAVE SUBMITTED ONE PREVIOUS COMPLAINT, BUT I CANNOT FIND IT HERE.  SINCE THIS PROBLEM HAS YET TO BE RESOLVED (AT LEAST 18 MONTHS AFTER IT WAS FIRST REPORTED) I WOULD LIKE TO POST MY COMPLAINT AGAIN.]    ON TWO (2) SEPARATE OCCASIONS I HAVE LOST ALMOST ALL BRAKING FORCE WHEN ATTEMPTING TO STOP ABRUPTLY ON SMOOTH, DRY_ PAVEMENT.  IN BOTH INSTANCES I HIT THE BRAKES QUICK AND HARD, LET UP MOMENTARILY, THEN REAPPLIED.  IN BOTH CASES IT WAS ON THE SECOND APPLICATION THAT THE PEDAL WENT TO THE FLOOR AND THE CAR SEEMED TO BE ALMOST COASTING FREELY.  LUCKILY, IN BOTH INSTANCES I HAD AN ESCAPE ROUTE.    THE FIRST FAILURE WAS ON NORTHBOUND GEORGIA AVE., APPROACHING A RED LIGHT.  THE WEATHER WAS MILD, PAVEMENT CLEAR, DRY AND SMOOTH.  SPEED UPON INITIAL BRAKE APPLICATION WAS APPROX. 45 MPH. (ANOTHER NORTHBOUND DRIVER PULLED IN FRONT OF ME WITHOUT WARNING).  TIRES WERE BRIDGESTONE RE730'S.  BRAKES STOCK.    THE SECOND TIME WAS ON NORTHBOUND I-270 AT EXIT 31.  AGAIN, THE WEATHER WAS MILD AND THE PAVEMENT WAS SMOOTH AND DRY.  SPEED UPON INITIAL BRAKE APPLICATION WAS APPROX. 65 MPH.  (A DRIVER ENTERING I-270 ABRUPTLY MERGED ACROSS 3 LANES INTO LANE 1 DOING ALL OF ABOUT 25 MPH).   TIRES WERE FIRESTONE SZ-50EP'S.  BRAKES STOCK.    AFTER THE SECOND INCIDENT I INSTALLED NEW FRONT BRAKE PADS, HAWK HP-PLUS.  NOT THAT I THOUGHT THEY WOULD HELP WITH THE ABS PROBLEM, I JUST WASN'T HAPPY WITH THE PERFORMANCE OF THE STOCK PADS.  DURING THE INSTALLATION I BLED THE BRAKES AND FOUND A LOT OF _AIR_ IN THE SYSTEM.  BY A LOT, I DON'T MEAN LITTLE BUBBLES, I MEAN A 2-3 INCHES OF AIR IN THE CLEAR BLEEDER TUBE.  SINCE THAT TIME I HAVE HAD NO FURTHER PROBLEMS.    THE ABS DOES CONTINUE TO BE VERY SENSITIVE, ACTIVATING EVEN ON SLIGHTLY RIPPLED PAVEMENT WHEN BRAKING MODERATELY FROM 25-30 MPH.  AT LEAST WHEN IT ACTIVATES, THE PEDAL STAYS FIRM AND THE BRAKING FORCE ONLY DECLINES SLIGHTLY.   *NLM",
        "vin": "JF1GD29652G"
    }
]