[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2003",
        "dateOfIncident": "04/02/2003",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013842,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "TROOPER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY TROOPER NEW. I HAVE ALL OF THE PRINT OUTS OF THE OIL CHANGES MADE WHICH ARE AT  OR BELOW RECOMMENDED INTERVALS. AT APPROXIMATELY. 25000 MILES I REPORTED A SHIFTING PROBLEM AND THEY REPLACED THE TRANSFER CASE BECAUSE METAL FILINGS WERE FOUND IN IT. THEN 2000 MILES LATER THE PROBLEM RE-OCCURRED AND THEY REPLACED THE ENTIRE TRANSMISSION. IT WAS BOUGHT IN BACK 500 MILES LATER FOR AND ADJUSTMENT ON THIS AGAIN.   AT 40000 MILES THE CD PLAYER JAMMED AND THEY REPLACED THIS WITH A NEW ONE THAT TOOK 8 WEEKS TO RECEIVE. WE HAD FOLLOWED THE DIRECTIONS IN THE MANUAL. FOLLOWING THIS, THE CD PLAYER AGAIN JAMMED @ 51,000 MILES AND THEY REFUSED TO REPAIR IT -OUT OF WARRANTY- AT THIS POINT WE REALIZED THAT PART OF THE DIRECTIONS IN THE MANUAL WERE FAULTY. WE DID REPORT THIS TO THE DEALERSHIP TO NO AVAIL.  IT IS STILL NOT FIXED BECAUSE THEY WILL NOT RELEASE THE CODE TO REPAIR IT.     EACH OF THE TIMES THAT WE HAVE HAD THIS IN WHILE STILL UNDER WARRANTY, WE HAVE HAD TO COMPLAIN TO RECEIVE A RENTAL/LOANER CAR WHILE IT WAS IN FOR SEVERAL DAYS AT A TIME.   THEN AT 60000, THERE IS AN EVAP. CODE THAT INDICATES THERE IS AN ISSUE WITH THE VENT VALVE AND IT IS NOT PERFORMING CORRECTLY, BUT THE DEALERSHIP HAS TOLD ME 3 DIFFERENT TIMES  THAT IT HAS BEEN IN 3 DIFFERENT CAUSES.    NOW AT 74,000 MILES , I HAVE JUST BEEN INFORMED THAT THE SHORT BLOCK HAS TO BE REPLACED AND THE HEADS MAY BE CRACKED. THE LAST OIL CHANGE WAS AT 71,800 MILES AND THE OIL LIGHT DID NOT COME ON. THEY CLAIM THAT THERE WAS NO OIL IN THE ENGINE BUT, THE OIL DIPSTICK SAYS THAT THERE IS A PROPER AMOUNT. THIS IS A 7400+ REPAIR.  THIS IS THE 12 THE TIME THIS VEHICLE HAS BEEN IN TO THE DEALERSHIP. ALL REPAIRS HAVE BEEN DONE BY AN AUTHORIZED DEALER.  *NLM",
        "vin": "JACDJ58X4X7"
    }
]