[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2003",
        "dateOfIncident": "03/28/2003",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013806,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "GSXR600",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW SUZUKI GSXR 600 ON 03/27/2003.  I TOOK IT FOR IT'S FIRST TEST DRIVE ON 03/28/2003.  NINE MILES INTO THE TRIP I ALMOST CRASHED ON THE OFF RAMP OF THE INTERSTATE AS THE MOTORCYCLE STOPPED WORKING WHILE DRIVING.  I PULLED OFF TO THE SIDE OF THE ROAD AND FOUND THE GAS I HAD SMELLED WHILE DRIVING WAS SUDDENLY MUCH STRONGER.  I THEN REALIZED I WAS COVERED IN GASOLINE, THE BIKE WAS DRENCHED IN GASOLINE, AND I HAD BEEN SPRAYING GASOLINE DOWN THE ROAD THE WHOLE TIME I WAS DRIVING.  I WAS PICKED UP BY THE MERCHANT WHO SOLD ME THE BIKE.  AFTER INSPECTING IT IN THEIR SHOP, THEY FOUND THAT SUZUKI HAD NEVER ATTACHED THE GAS LINE.  THEY ADVISED THE GAS LINE HAD NEVER BEEN UNATTACHED BEFORE AND THAT IT WAS SUZUKI'S RESPONSIBILITY TO ENSURE THIS WAS ATTACHED.  SUZUKI WAS CONTACTED BY THE MERCHANT, HOWEVER THEY REFUSED TO REPLACE THE MOTORCYCLE AND BELIEVE I SHOULD KEEP THIS MOTORCYCLE THAT NOW AFTER BEING DETAILED STILL IS COVERED IN GASOLINE AND SMELLS LIKE A 20 YEAR OLD LAWN  MOWER.  BUT ASIDE FROM THE DAMAGE IT CAUSED THE VEHICLE AND MY CLOTHING, THE MOTORCYCLE OR MYSELF COULD HAVE EASILY CAUGHT FIRE THAT DAY SINCE WE WERE SOAKED IN GASOLINE.  THIS WAS A SEVERE SAFETY HAZARD THAT COULD HAVE COST ME MY LIFE HAD A SPARK IGNITED ME OR A CIGARETTE BUTT COME MY WAY.   BUT APPARENTLY SINCE I DID NOT BURN UP OR DIE, SUZUKI FEELS IT IS NOT AN ISSUE. *JB",
        "vin": ""
    }
]