[
    {
        "components": "FUEL SYSTEM, OTHER,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2003",
        "dateOfIncident": "12/27/2002",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013830,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AS A RESULT OF A BID RECENTLY RECEIVED BY THE STATE OF NEW JERSEY FOR 175 SCHOOL VEHICLES, IT CAME TO OUR ATTENTION THAT VEHICLES PROPOSED TO BE MANUFACTURED BY U.S. BUS CORPORATION, 3 PAT MALONE DR., PO BOX 329, SUFFERN, NY DO NOT APPEAR TO COMPLY WITH FMVSS 301 FOR FUEL SYSTEM INTEGRITY.  WHILE THE STATE OF NEW JERSEY DISQUALIFIED THEIR BID, U.S. BUS CORPORATION HAS SOLD A SIGNIFICANT NUMBER OF SUCH NON-COMPLIANT VEHICLES AND CONTINUES TO OFFER THEM.  THE VEHICLES IN QUESTION ARE SCHOOL BUSES WITH CAPACITIES BETWEEN 16 AND 30 PASSENGERS, AND WHEELCHAIR ACCESSIBLE VARIATIONS, BUILT WITH FLAT FLOORS.  THE VIOLATION APPLIES WHEN THESES BODIES ARE MOUNTED ON CHEVROLET AND GMC CUTAWAY VAN MODELS G315, 318,319 WITH OPTION B3D (SCHOOL BUS EQUIPMENT PACKAGE).  WHILE THESE CHASSIS ARE CERTIFIED BY GM FOR COMPLIANCE WITH FMVSS 301, THEIR CERTIFICATION ONLY APPLIES PROVIDED THAT THE HEIGHT OF THE BODY FLOOR DOES NOT EXCEED 110 MM ABOVE THE TOP OF THE FRAME.  THE FLOOR HEIGHT OF BUSES BUILT WITH A FLAT FLOOR ON THESE CHASSIS SIGNIFICANTLY EXCEEDS 110 MM.  THUS, SCHOOL BUSES BUILT WITH FLAT FLOORS BUILT UPON THESE CHASSIS ARE REQUIRED TO HAVE BEEN TESTED FOR COMPLIANCE WITH FMVSS 301.  ACCORDING TO MR. TOM VACLAVIK OF UPFITTER INTEGRATION GROUP, THE ONLY SUCH TESTING OF WHICH THEY ARE AWARE TO CERTIFY COMPLIANCE WITH FMVSS 301 OF FLAT FLOOR SCHOOL BUSES MOUNTED ON THESE CHASSIS IS:  1.SHARED TESTING PERFORMED BY A CONSORTIUM OF GIRARDIN, BLUE BIRD, THOMAS, CORBEIL AND GM, COORDINATED BY THE NTEA.  THE RESULTS OF THESE TESTS AND MODIFICATIONS REQUIRED FOR COMPLIANCE WAS PROPRIETARY TO THESE PARTICIPANTS.  2.  INDEPENDENT TESTING PERFORMED BY COLLINS BUS.  THERE ARE A SIGNIFICANT NUMBER OF SUCH SCHOOL BUSES MANUFACTURED BY U.S. BUS CORPORATION IN OPERATION, WHICH APPARENTLY HAVE NOT BEEN TESTED AND PROPERLY CERTIFIED FOR COMPLIANCE WITH THIS REQUIREMENT FOR FUEL SYSTEM INTEGRITY.  WE BELIEVE THIS MATTER REQUIRES INVESTIGATION.   *NLM",
        "vin": ""
    }
]