[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "01/25/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013894,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO COMPLAIN AGAINST DIFEO HYUNDAI, HUDSON MALL, RT. 440, JERSEY CITY, NJ.    I HAD THE FOLLOWING RECALLS DONE ON MY HYUNDAI SONATA 97 (VIN [XXX]) FROM DIFEO IN JANUARY, 03:    NHTSA CAMPAIGN: 97V026000.   NHTSA CAMPAIGN: 00V314001    DIFEO HAD TO REPLACE THE FUEL TANK AS A PART OF THE RECALL.    SOON AFTER THE RECALL WAS DONE, I NOTICED THAT THE FUEL GAUGE NEEDLE WAS STUCK ON THE UPPER END.      SPOKE TO DIFEO SERVICE MANAGER [XXX] ABOUT THIS PROBLEM ON 2/14/03 AND TOOK AN APPTMENT FOR 2/18/03 MORNING. CONFIRMED THE APPTMENT BEFORE LEAVING ON 2/18/03. HOWEVER, ON REACHING THE SERVICE CENTER I WAS TURNED AWAY BECAUSE IT WAS CLOSED FOR THE DAY.    THIS IS NOT THE FIRST TIME DIFEO HAS SHOWN SUCH UNPROFESSIONAL ATTITUDE IN SERVICING THE RECALL.     1.WHEN I APPROACHED DIFEO THE FIRST TIME IN NOVEMBER 2002, THE DEALER REFUSED ANY KNOWLEDGE OF A RECALL. HAD TO HAVE HYUNDAI USA CALL THEM UP TO INFORM ABOUT THE RECALL.   2.AFTER THIS WHEN I WENT TO THE SERVICE CENTER ON 1/11/03 THE REPRESENTATIVE THERE (MIKE), AGAIN REFUSED ANY KNOWLEDGE OF SUCH A RECALL.  3.AGAIN HAD TO GO BACK TO HYUNDAI USA FOR HELP. HAD [XXX] AT 1800 633 5151 X [XXX] TALK TO [XXX]. ONLY THEN DID DIFEO AGREE TO SERVICE THE RECALL.  4.FINALLY DROPPED OFF THE CAR ON 1/25/03. MIKE FROM DIFEO INFORMED ME THE SAME EVENING THAT THE CAR WAS READY FOR PICKUP. HOWEVER, ON REACHING THE SERVICE CENTER I WAS INFORMED THAT CAR WAS NOT READY YET AND THE GAS TANK WOULD HAVE TO BE REPLACED.  5.FINALLY THE FUEL TANK WAS REPLACED.    AM SURE THE PROBLEM WITH THE FUEL GAUGE HAS OCCURRED BECAUSE OF DIFEO'S POOR WORKMANSHIP. I AM APPREHENSIVE IF DRIVING THE CAR IN ITS PRESENT STATE MIGHT ENDANGER MY SAFETY. DIFEO WAS HESITANT TO SERVICE THE RECALL IN THE BEGINNING AND WHEN FORCED, DID A SHODDY JOB OUT OF IT.     I DEMAND THAT DIFEO PICK UP THE CAR FROM MY RESIDENCE AND DROP IT BACK AFTER DOING A THOROUGH JOB OF THE RECALL. I REQUEST YOU TO GET ME SOME RELIEF FROM THIS HARASSMENT.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KMHCF24T2VU"
    }
]