[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "02/21/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013909,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THE DODGE CARAVAN SE IN 1998. LAST YEAR, WHEN THE VEHICLE WAS AROUND 30,000 MILES, THE CAR WAS STARTING TO HAVE PROBLEM ON SHIFTING. IT SOMETIMES LOCKED ON THE 2ND GEAR AND WOULDN''T GO FASTER. AFTER WE TURNED OFF THE ENGINE AND RESTARTED, IT WAS ALL OK AGAIN.      ON FEB 21ST, 2003 WHILE WE WERE DRIVING ON THE HIGHWAY, THE TRANSMISSION GAVE UP AND BROKE. THE WHOLE FAMILY WAS STRANDED, AS THE VEHICLE WOULDN''T MOVE AT ALL.  THE VEHICLE HAD ONLY 42,000 MILES ON IT AND ONLY 6000 MILES AFTER THE WARRANTY EXPIRED.        I THEREFORE CONTACTED THE CHRYSLER SUPPORT. THEY REPLIED PLAINLY THAT IT IS MY RESPONSIBILITY BECAUSE IT HAS PASSED THE WARRANTY.  I THEN  PURCHASED A REMANUFACTURED TRANSMISSION FROM PHOENIX REMANUFACTURED TRANSMISSION IN ARIZONA AND HAD KUAN''S AUTO REPAIR, AN ASE CERTIFIED REPAIR SHOP IN ST. PAUL, FIX IT.     I WENT ON AND CONDUCT AN EXTENDED RESEARCH ON CHRYSLER''S TRANSMISSION. THERE HAS TO BE SOMETHING WRONG IF A BRAND NEW TRANSMISSION WOULD BROKE IN 42000 MILES.  THE RESULT OF THE RESEARCH IS ASTOUNDING:  CHRYSLER HAD THIS TYPE OF THE TRANSMISSION SINCE 1988 AND IT IS A DESIGN FLAW IN THE TRANSMISSION. THE WORST PART IS, CHRYSLER KNEW ABOUT IT SINCE BEGINNING AND DID NOTHING ABOUT IT.  THOUSANDS OF PEOPLE HAVE THE SAME PROBLEM WITH THIS TYPE OF TRANSMISSION (A604 41TE) ON DODGE, PLYMOUTH, CHRYSLER BRANDS OF MINI VANS.   CHRYSLER''S IGNORANCE TO THE PROBLEM CONTINUES TO JEOPARDIZE THE SAFETY OF THOUSANDS OF FAMILIES WITH THIS DEFECTED TRANSMISSION ON THEIR MINI VANS.       A MINI VAN IS A FAMILY CAR AND THOUSANDS OF MOTHERS AND CHILDREN DEPEND ON IT.  IT IS TIME FOR CHRYSLER TO PUT THE SAFETY AND QUALITY ON THEIR PRIORITY AND PAY FOR THE COST TO FIX THOSE FAULTY TRANSMISSIONS.",
        "vin": "1B4GP45G1WB"
    }
]