[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "03/16/2003",
        "fire": false,
        "manufacturer": "Yamaha Motor Corporation, USA",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013895,
        "products": [
            {
                "manufacturer": "Yamaha Motor Corporation, USA",
                "productMake": "YAMAHA",
                "productModel": "YAMAHA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 YAMAHA GRIZZLY 660 LE    AFTER RIDING FOR ABOUT 3 HOURS I STARTED UP AN INCLINE TO GO HOME.  HALFWAY UP THE ATV SPUTTERED, LOST POWER AND ROLLED BACKWARDS BACK DOWN THE HILL.  LUCKILY IT WASN'T EXTREMELY LONG OR STEEP SO I WAS ABLE TO CONTROL THE ATV WHILE BACK DOWN.  IT APPEARED I HAD THE VAPOR LOCK ISSUE NUMEROURS OTHERS HAD.  I INSPECTED VENT LINES FOR CLOGS AND FOUND NONE.  I TRIED AGAIN AFTER ABOUT 15 MINUTES AND AGAIN HAD TO BACK DOWN.  I WAITED FOR ANOTHER 30 MINUTES TO GIVE IT TIME TO COOL AND TRIED A THIRD TIME.  I MADE IT ALMOST TO THE TOP THIS TIME AND IT SPUTTERED AND QUIT.  THIS PORTION OF THE INCLINE WAS NOT AS STEEP AND I WAS ABLE TO STOP THE ATV AND USE MY WINCH TO GET TO THE TOP.  IT SPUTTERD THE REST OF THE WAY HOME AND WHEN I GOT THERE I COULD HEAR A \"BOILING\" SOUND IN THE FUEL TANK.  WHEN I REMOVED THE CAP THERE WAS SOME PRESSURE IN THE TANK AND I COULD SEE BUBBLES COMING UP FROM THE LEFT SIDE.    I TOOK THE GRIZZLY TO MY LOCAL DEALER THE NEXT WEEK.  THEY HAD OTHER WITH THE SAME COMPLAINT.  THEY INSTALLED A \"HEAT KIT\" THAT CONSISTS OF (TO MY KNOWLEDGE) VENTILATED SIDE PANELS, A HEAT SHIELD UNDER THE FUEL TANK AND FUEL LINES WRAPPED IN SHIELDING.    IN MY OPINION THESE FIXES DO NOT DIRECTLY ADDRESS THE PROBLEM AND THOUGH THEY SEEM TO HELP I'M UNSURE AS TO WHETHER THE PROBLEM IS COMPLETELY SOLVED.  MY PERSONAL OPINION IS THAT THE EXHAUST HEADER IS TOO CLOSE TO THE CARBURETOR, REQUIRING EITHER A COATED HEADER TO MINIMIZE HEAT RADIATED DIRECTLY TO THE CARB BOWL OR A REROUTED PIPE.",
        "vin": ""
    }
]