[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "02/12/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013925,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND PRIX",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PONTIAC GRAND PRIX GT, MY SERVICE ENGINE SOON LIGHT CONTINOUSLY COMES ON. I WENT TO THE DEALERSHIP AND THEY PUT THE CAR ON THE COMPUTER AND SAID THAT THE WIRES TO THE HARNESS WERE BROKEN. I DON'T UNDERSTAND HOW THE WIRES TO THE HARNESS COULD BE BROKEN BECAUSE IN ORDER TO GET TO THE WIRES YOU MUST TAKE OFF THREE PARTS.THEY ALSO TOLD ME I HAD A LEAK IN THE INTAKE MANIFOLD AT THE TOP OF THE ENGINE. THE MECHANIC CHANGED THE GASKET AND CHARGED ME $270 PLUS $50 FOR PARTS AND PAYED $360 FOR THE LABOR FOR THE WIRES OF THE HARNESS. THE LIGHT TURNED OFF, THEN THE NEXT DAY THE LIGHT REAPPEARED. I WENT BACK TO THE DEALERSHIP AND THE SAME CODE CAME UP WHEN IT WAS PLACED BACK ON THE COMPUTER (R442), ON THAT DAY THEY SAID THE GAS CAP WAS LEAKING AND HAD TO BE CHANGED. AT THAT MOMENT THE LIGHT WENT OFF! THEN THE NEXT DAY THE LIGHT CAME BACK ON ONCE AGAIN!!! NOW THIS IS THE THIRD TIME I'VE BEEN TO THE DEALERSHIP WITH THE SAME CODE (R442) THEY TOLD ME THEY DON'T KNOW WHAT THE PROBLEM IS. IF THEY CAN'T FIND THE PROBLEM WHY DO I HAVE TO PAY FOR THE PREVIOUS PROBLEMS IF THEY CAN'T EVEN FIND THE PROBLEM. THE WILL NOT HELP ME AND SINCE THESE PROBLEMS OCCURED RIGHT AFTER THE WARRANTY, THEY TOLD ME THAT I HAVE TO PAY FOR ALL THE WORK THEY THAT DO, EVEN IF THEY JUST PUT THE CAR ON THE COMPUTER. $90 AN HOUR! I'VE CALLED CUSTOMER SERVICE REPEATEDLY AND SAY THAT CAN'T DO ANYTHING FOR ME BECAUSE THE DEALERSHIP WILL NOT WORK WITH ME! THEY ARE ALSO FINDING A TRANSMISSION CODE 1811 THEY SAY THEY DON'T FIX TRANSMISSIONS!! WHAT DO I DO??? THE LIGHT WILL NOT TURN OFF AND I'M WORRIED FOR MY SAFTEY! PLEASE HELP!",
        "vin": "1G2WP52K1YF"
    }
]