[
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "04/04/2003",
        "dateOfIncident": "04/02/2003",
        "fire": false,
        "manufacturer": "Britax Child Safety, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013945,
        "products": [
            {
                "manufacturer": "Britax Child Safety, Inc.",
                "productMake": "BRITAX",
                "productModel": "161 (ROUNDABOUT)",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "MY TWO YEAR OLD UNFASTENED THE CAR SEAT METAL BUCKLE WHILE I WAS DRIVING THE CAR ON THE FREEWAY.  SHE IS ABLE TO PUSH THE RED BUTTON SO THAT THE PIECE THAT SECURES THE BELT TO THE BUCKLE POPS OPEN.  THE SEAT IS MADE FOR CHILDREN UP TO 40 LBS, MY DAUGHTER WEIGHTS 31 OR 32 LBS.  I PANICKED.  I RETRIED THE SEAT, AND--SURE ENOUGH--CHLOE COULD PUSH THE BUTTON UNTIL IT POPPED OPEN.  SHE THOUGHT IT WAS A GAME. WHEN I CONTACTED THE COMPANY ON 4/2/2003, THEY WERE NONCHALANT AND UNAPOLOGETICALLY, SAYING IT HAD HAPPENED BEFORE, THAT THEIR SEATS WERE NOT \"CHILD PROOF\", AND THAT I COULD RECEIVE FROM THEM A PLASTIC PIECE TO PUT OVER THE BUCKLE/FASTENER.  WHEN I POINTED OUT THAT  I WOULD NOT BE ABLE TO TRANSPORT MY DAUGHTER UNTIL I RECEIVED THE PART, THEY OFFERED NO RECOURSE.  I WAS FLABBERGASTED.  I CALLED THE RIGHT START STORE WHERE I PURCHASED THE CAR SEAT, AND THEY TOLD ME THEY HAD THE PIECE.  I DROVE THERE, RETRIEVED THE PIECE, BUT FIND IT AN UNACCEPTABLE WAY TO USE THE CAR SEAT.  I CALLED BRITAX AGAIN TODAY TO COMPLAIN, ONCE AGAIN THEY WERE UNRESPONSIVE AND I WAS TOLD THERE WAS NO WAY THEY WOULD REPLACE WHAT I CONSIDER A FAULTY, DEFECTIVE CAR SEAT.  NO TWO YEAR OLD SHOULD BE ABLE TO GET OUT OF A CAR SEAT AND--IF THE COMPANY KNEW THIS COULD HAPPEN (E.G. THEY HAVE A SPECIAL PIECE) THEN AT THE VERY LEAST PARENTS SHOULD BE WARNED OF THAT POSSIBILITY--NOT HAVE IT COME AS THE SHOCK OF THE SEASON WHILE DRIVING 65 MPH ON THE FREEWAY.  I PAID OVER $200 FOR WHAT I THOUGHT WAS THE BEST AND SAFEST CAR SEAT.  AND, THAT IT WAS WHAT I WANT FOR MY DAUGHTER (THE BABY OF FIVE CHILDREN, I HAVE NEVER HAD THIS PROBLEM BEFORE WITH THE OTHERS!)*JB",
        "vin": null
    }
]