[
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "03/18/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013911,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I  RECENTLY PURCHASED A FORD F250 SUPER DUTY 6.0 LITER DIESEL PICKUP TRUCK. THIS IS A NEW ENGINE THAT WAS JUST RELEASED THIS YEAR. THERE ARE ALREADY MANY SERVICE BULLETINS LISTED ON THIS PARTICULAR TRUCK FROM FORD. THE PROBLEM WITH OUR TRUCK STARTED WITH THE CHECK ENGINE LIGHT COMING ON. WE HAD OWNED THE TRUCK FOR THREE DAYS AND IT WAS IN THE SHOP FOR THE FIRST TIME. A PART WAS REPLACED AND TWO DAYS LATER THE LIGHT WAS BACK ON AGAIN. BACK TO THE SHOP FOR THE SECOND TIME IN LESS THAN A WEEK FROM THE DATE OF PURCHASE. THE NEXT PART BEING REPLACED WAS DELAYED IN SHIPPING. THE DEALERSHIP OFFERED TO REMOVE THE NEEDED PART FROM ANOTHER TRUCK ON THE LOT BUT WAS WARNED BY FORD THAT THEY WERE AWARE OF THE DEFECTIVE PART AND USING ONE FROM ANOTHER TRUCK WOULD NOT CORRECT THE PROBLEM. FOUR DAYS LATER WE WERE ABLE TO PICK UP THE \"REPAIRED\" TRUCK. FIVE DAYS LATER THE LIGHT IS BACK ON AGAIN AND NOW IT IS ALSO RUNNING ROUGH, SLOW ACCELERATION, STALLING, SLOW RESPONSE FROM A STOP, ETC. FORDS LATEST BULLETINS TO THEIR DEALERS IS THAT THERE IS NO FIX FOR THIS AT THE PRESENT TIME. THIS IS A VERY DANGEROUS SITUATION WHICH COULD RESULT IN AN ACCIDENT FROM THE SLOW ACCELERATION AND STALLING. THIS VEHICLE SHOULD BE TAKEN OFF THE MARKET UNTIL THEY RESOLVE THE PROBLEM. THOSE THAT HAVE ALREADY PURCHASED THIS VEHICLE NEED CORRECTIVE REPAIR ACTION OR REIMBURSEMENT. AFTER FINDING SIMILAR COMPLAINTS ALREADY LISTED I AM WONDERING WHY THEY ARE STILL SELLING THESE TO THE PUBLIC.  APPARENTLY THERE ARE MANY PEOPLE THAT ARE HAVING THE SAME PROBLEM. ARE YOU GOING TO WAIT UNTIL THERE IS A SERIOUS INJURY OR DEATH AND THEN TRY TO CORRECT THE PROBLEM? PLEASE HELP!  NB",
        "vin": "1FTNW21P13E"
    }
]