[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "03/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013915,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "AIR BAG SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I PURCHASED A NEW FORD FOCUS IN JULY OF 2001.  MY WIFE USES THE CAR TO DRIVE ON THE HIGHWAY TO AND FROM WORK.  WE HAVE HAD THE CAR FOR 18 MONTHS AND TOOK THE CAR TO THE LAIRD NOLLER DEALERSHIP IN LAWRENCE FOR THE 30,000 CHECK UP WITH 33,000 MILES ON THE CAR.  AFTER SPENDING $300 FOR THE CHECK UP, WE WERE TOLD THAT THE BRAKE PADS AND ROTORS NEED TO BE REPLACED.  I HAVE SPOKEN WITH TWO MECHANICS AND HAVE BEEN TOLD THAT THE ROTORS SHOULD NOT NEED TO BE REPLACED ON A CAR THAT IS DRIVEN PRIMARILY ON THE HIGHWAY SINCE THERE IS NOT A LOT OF STOP AND GO DRIVING.  THERE A DOZENS OF LISTINGS ON THE INTERT AND THE NHTSA WEBSITE OF THE SAME COMPLAINT ON THEIR FORD FOCUS VEHICLES.  I WAS TOLD BY THE DEALERSHIP THAT FORD PUTS THIN ROTORS ON THE FOCUS TO BEGIN WITH SO THEY HAVE TO BE REPLACED VERY EARLY.  I WAS ALSO LEARNED FROM AN EMPLOYEE AT THE DEALERSHIP THAT THE PERSON THAT PERFORMED THE SERVICE ON OUR FOCUS HAS HAD TROUBLE MEETING HIS QUOTA OF UPSELLING REPAIRS ON CARS THAT COME IN FOR THEIR CHECK UP.  AFTER PICKING UP THE CAR, THE ENTIRE DASHBOARD WAS SHAKING AND THE FRONT TIRES WERE MAKING NOISES.  WHEN WE BROUGHT THE CAR IN IT WAS FINE , AFTER WE PICKED IT UP IT SOUNDED HORRIBLE.  WE CALLED BACK UP TO THE DEALERSHIP AND WERE TOLD TO DRIVE IT FOR A FEW DAYS AND IT SHOULD BE FINE.  AFTER WAITING THE TWO DAYS, THE BRAKE PADS BEGAN TO GRIND INTO THE ROTORS AND THE CAR DID NOT DRIVE WELL AT ALL.  I HAVE SPOKEN WITH FORD AND WITH THE DEALERSHIP AND THEY HAVE TOLD ME THAT THERE IS NOTHING THEY CAN DO FOR ME AND THAT I AM RESPONSIBLE FOR THE REPAIRS.  FORD KNOWS THAT THERE IS A PROBLEM WITH THE ROTARS THEY ARE USING ON THE FOCUS, BUT IS NOT WILLING TO DO ANYTHING ABOUT IT.  I AM WORRIED THAT ARE NOT OTHER PROBLEMS WITH THE CAR THAT MAY MAKE IT UNSAFE.  I HAVE TWO SMALL CHILDREN AND AM WORRIED ABOUT DRIVING THEM AROUND IN THE CAR.  I BELIEVE THAT WITH THE NUMBER OF COMPLAINTS I HAVE SEEN, FORD SHOULD BE TOLD TO INITIATE A RECALL ON THE ROTARS.",
        "vin": ""
    }
]