[
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "08/20/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013924,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "7000",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TOTAL SYSTEMS TECH., INC.",
                "productMake": "TOTAL SYSTEMS",
                "productModel": "TOTAL SYSTEMS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "BELOW IS PART OF A LETTER SENT TO BUDGET/RYDER TRUCK RENTAL EXPLAINING PROBLEMS MY HUSBAND AND I HAD WITH A TRUCK WE RENTED LAST AUGUST.  IF THIS IS SOMETHING YOU WOULD LIKE TO LOOK INTO, I WILL PROVIDE COPIES OF FURTHER CORRESPONSENCE AND A PHOTOGRAPH OF THE TIRE MENTIONED IN THE LETTER.      ON AUGUST 20, WE PICKED UP A 15'' BUDGET RENTAL TRUCK AND TOW DOLLY IN SAN DIEGO, CA.  THE FIRST TRUCK WE WERE GIVEN HAD THE ''CHECK ENGINE'' LIGHT ON.  WE ASKED FOR ANOTHER TRUCK.  THE EQUIPMENT WE WERE GIVEN INSTEAD SEEMED FINE AT FIRST, BUT WE SOON DISCOVERED SEVERAL PROBLEMS.    AT THE FIRST GAS STOP, A PLASTIC PIECE INSIDE THE GAS CAP BROKE.  WE REPLACED THE GAS CAP OURSELVES.  WE LATER NOTICED THAT A TAILLIGHT ON THE TOW DOLLY WAS NOT WORKING.  WHEN WE ENCOUNTERED HEAVY RAIN NEAR HOUSTON, WE DISCOVERED THAT THE DRIVER'S SIDE WINDSHIELD WIPER WAS COMING APART.  THE NEXT PROBLEM IS BY FAR THE MOST CONCERNING.  AS WE CREPT THROUGH TRAFFIC IN HOUSTON, WE BLEW A TIRE.  WE PULLED TO THE SHOULDER AND FOUND THAT OUR LEFT FRONT TIRE WAS FLAT.  THE MAN WHO REPLACED IT WAS APPALLED AT THE CONDITION OF BOTH FRONT TIRES.  THE MEN WHO INSPECTED THE RIGHT FRONT TIRE AT OUR DROP-OFF LOCATION IN ENTERPRISE, AL, ALSO FOUND THE CONDITION OF THE REMAINING TIRE DISTURBING AND WERE NOT SURE IT WOULD MAKE IT TO A TOWN 20 MINUTES AWAY FOR MAINTENANCE.  HE ALSO NOTED THAT ONE TIRE ON THE TOW DOLLY WAS IN BAD CONDITION.      HAD ONE OF THE TIRES BLOWN WHILE WE WERE AT A TYPICAL SPEED WE COULD HAVE BEEN SERIOUSLY INJURED OR KILLED.  WE HOPED THAT BUDGET/RYDER WOULD RETURN WHAT WE PAID FOR THE UNSAFE EQUIPMENT AND REASSURE US THAT THEY WOULD WORK TO KEEP THIS FROM HAPPENING TO OTHERS, BUT THEY ONLY APOLOGIZED FOR THE INCONVENIENCE.   WE REPORTED THIS TO THE BBB, BUT THEY DID NOTHING.  IT STILL ANGERS ME WHEN I THINK ABOUT BUDGET/RYDER GETTING AWAY WITH ENDANGERING OUR LIVES AND HOW THEY COULD BE DOING THE SAME THING TO OTHER PEOPLE NOW.  ANYTHING YOU CAN DO ABOUT THIS WOULD BE GREATLY APPRECIATED.",
        "vin": ""
    }
]