[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/05/2003",
        "dateOfIncident": "03/30/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "AVIATOR",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE AND POSSIBLY DEADLY 2003 LINCOLN AVIATOR MADE BY FORD MOTOR COMPANY    1.CAR PURCHASED ON 2/15/03.  PICKED UP SAME DAY ON 2/15/03.  2.GAS PEDAL SNAPS AND BREAKS ALMOST CAUSING A HIGH SPEED COLLISION!  ON 03/30/03  - ON SUNDAY, 03/30/03 I AM TAKING MY DAUGHTER TO ICE SKATING PRACTICE WITH THIS CAR.  I AM DRIVING DOWN THE LONG ISLAND EXPRESSWAY (I-495) IN THE LEFT LANE.  MY EXIT IS COMING UP SO I HAVE TO GET OVER.  IN ORDER TO DO SO I MUST SPEED UP QUICKLY TO GET AROUND ANOTHER CAR.  I HIT THE GAS PEDAL.  I AM STARTING TO SPEED UP WHEN ALL OF THE SUDDEN THE CABLE OR SOMETHING SNAPS AND THE PEDAL GOES TO THE FLOOR.  A PIECE OF PLASTIC GAS PEDAL FLY??S OFF THE FLOOR AND LANDS IN THE PASSENGER SEAT NEXT TO ME.  IT IS  THE GAS PEDAL ITSELF (I STILL HAVE THIS PIECE IN MY POSSESSION FOR PROOF).   -  I AM NOW LOOSING POWER INTO ONCOMING TRAFFIC WHILE TRYING TO GET OVER AT THAT VERY MOMENT.  I CAN NOT HIT THE BRAKE DUE TO TRAFFIC WHILE TRYING TO GET OVER.  I SWERVE TO THE RIGHT AND A MACK TRUCK DARTS OVER TO THE LEFT TO AVOID HITTING ME.  I MANAGE TO GET TO THE SHOULDER OF THE ROAD.  MY DAUGHTER IS NOW SCREAMING AND SCARED AND I AM VISIBLY SHAKEN BY THIS EVENT.  -  I WAIT 2 HOURS FOR A TOW TRUCK.  THE DRIVER HIMSELF CANNOT BELIEVE WHAT HE SEES.  THE CAR IS TOWED TO NEIL LINCOLN MERCURY.  I GO INTO THE DEALER AND VINNEY & ADAM ARE BOTH THERE TO TALK TO ME.  THEY TELL ME THEY HAVE NEVER HEARD OF ANYTHING LIKE THIS AND DO NOT BLAME ME FOR WANTING A REFUND.    3.FOLLOW UP WITH NEIL LINCOLN MERCURY  - ON MONDAY; 03/31/03 I CALL NEIL LINCOLN MERCURY.  I AM NOW DEALING WITH FRANK THE SERVICE MANAGER.  I CANNOT DRIVE A CAR I DO NOT FEEL SAFE IN WITH MY FAMILY!  HE AGREES AND SAYS THIS IS A PROBLEM HE HAS NEVER SEEN BEFORE AS FAR AS GAS PEDALS BREAKING WHILE DRIVING. FORDS TRACK RECORD STINKS! THEY WILL WAIT FOR PEOPLE TO DIE BEFORE THEY FIX THE PROBLEM.  THIS IS A SERIOUSLY DEFECTIVE VEHICLE.  *JB",
        "vin": "5LMEU78H53Z"
    }
]