[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2003",
        "dateOfIncident": "04/01/2003",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014026,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "BLAZER",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON RETURNING TO MY TRUCK ON TUES EVENING 4/1/03 (AFTER IT WAS PARKED FOR 1 1/2 HRS) I NOTICED A BURNING SMELL WHEN I OPENED THE DOOR. I HAD ABOUT A 4 MILE RIDE HOME SO I STARTED THE VEHICLE AND ATTEMPTED TO GO HOME. AS I DROVE, THE BURNING SMELL BECAME HORRIBLY WORSE EVEN THOUGH I COULD NOT SEE ANY SMOKE. I DECIDED IT WAS SAFER TO DROP IT OFF AT MY LOCAL DEALER (PATTERSON CHEVROLET IN HAMILTON NJ)SINCE IT WAS ON THE WAY. I DISCONNECTED THE BATTERY AS A PRECAUTION. THE DEALER WORKED ON THE TRUCK ON 4/2. IN THE PROCESS OF TRYING TO LOCATE THE SOURCE OF THE SMELL, THEY HAD TO RECONNECT THE BATTERY. THIS RESULTED IN THE VEHICLE CATCHING ON FIRE!! FORTUNATELY, THEY HAD TRACED THE SOURCE OF THE SMELL TO A WIRE HARNESS UNDER THE PASSENGER SEAT FLOOR BOARD THAT GETS CONNECTED TO A POWER SEAT (WHICH I DO NOT HAVE!) AND THEY HAD REMOVED THE CARPETING AND SEATS BEFORE THE FIRE STARTED. UPON EXTINGUISHING THE FIRE, THEY REMOVED THE DAMAGED WIRE HARNESS AND RE-INSTALLED THE SEATS & CARPETING. THIS LEFT ME WITH A VEHICLE THAT STILL SMELLS ABSOLUTELY HORRIBLE AND A $531 REPAIR BILL. IF I HAD PARKED MY TRUCK IN MY ATTACHED GARAGE LIKE I DO EVERY NIGHT INSTEAD OF RUNNING AN ERRAND, THE TRUCK MOST DEFINITELY WOULD HAVE CAUGHT FIRE IN MY GARAGE AND COULD HAVE KILLED MY ENTIRE FAMILY. I CONSIDER THIS A VERY NEAR TRAGEDY AND THE DESIGN OF THIS WIRE HARNESS NEEDS TO BE LOOKED AT IMMEDIATELY BEFORE SOMEONE ACTUALLY DOES GET KILLED.  WHY DIDN'T A FUSE BLOW THAT AUTOMATICALLY CUT POWER TO THE SHORTING WIRE? IS THIS A RECALL ITEM? COPIES OF THIS E-MAIL ARE BEING FORWARDED TO THE CPSC AND THE NHTSA FOR REVIEW AS WELL.   THERE IS NO WAY A WIRE UNDER A FLOOR BOARD SHOULD SIMPLY CATCH FIRE! SECONDLY, THERE IS NOTHING THAT I COULD HAVE DONE THAT COULD HAVE PREVENTED THIS INCIDENT OR CAUSED IT. THE REPAIR EXPENSE IN THIS INSTANCE SHOULD NOT BE THE BURDEN OF THE CONSUMER. *JB",
        "vin": "1GNDT13W9W2"
    }
]