[
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2003",
        "dateOfIncident": "03/04/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013984,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "RAM 1500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY TOOK MY 1999 DODGE RAM 1500 PICK UP TO MY ALIGNMENT SHOP AND HAD TO PUT A NEW TRACKER BAR ON IT. WHICH I REPLACED ABOUT 8 MONTHS AGO AT ABOUT 40 THOUSAND MILES.. AND NOW  I HAVE TO REPLACE MY STEERING BOX AND MY TRUCK HAS JUST OVER 54,100 MILES ON IT AND I THINK THAT IS A LITTLE RIDICULOUS. EVER SINCE I BOUGHT MY TRUCK NEW IN 1999 I HAVE HAD TO HAVE THE FRONT END ALIGNED IN THE FIRST YEAR, THE SECOND YEAR, IN THE YEAR 2002 AND NOW ON MARCH 3 RD 2003 I HAD TO HAVE IT AGAIN FOR THE REASONS I STATED IN THE BEGINNING. I  HAD SOME ELECTRICAL PROBLEMS UNDER THE DASH AND IN THE STEERING COLUMN. MY ALIGNMENT SHOP SAYS THEY HAVE REPLACED A LOT OF STEERING BOXES AND THE TRACKER BAR EVEN AT 18,000 MILES. I HAVE CALLED CHRYSLER THEMSELVES AND THEY WON'T DO ANYTHING ABOUT IT AND I THINK THEY SHOULD BECAUSE I BELIEVE THAT IT IS A RESULT FROM A BAD PART FROM THE FACTORY. I HAVE DOCUMENTED EVERYTHING I HAVE DONE TO MY TRUCK. I HAVE LOOKED INTO THE PRICE OF A NEW STEERING BOX AND I HAVE FOUND THAT DODGE WANTS OVER $600 AND A PARTS HOUSE IN MY TOWN CAN GET THE SAME DODGE STEERING BOX FOR $205. I BELIEVE THAT I SHOULD NOT HAVE TO PAY FOR THE BOX WHAT EVER THE PRICE, BECAUSE I BELIEVE IT IS NEW ENOUGH THAT THEY SHOULD BE WILLING TO HAVE IT FIXED, TO AT LEAST MAKE A CUSTOMER SOME WHAT HAPPY. I HAVE NEVER HEARD OF A STEERING BOX GOING OUT AT LESS THEN 100,000 MILES. MY FATHER HAD A 1999 RAM 1500 PICK UP AND WITH LESS THAN 25,000 MILES THE MOTOR LOST 4 QUARTS OF OIL ON OUR WAY TO A OLD CAR SHOW IN MONTANA BUT IT NEVER HAPPENED AGAIN SO HE DID NOT WORRY ABOUT IT AND SOLD IT AND GOT A NEW 2002 RAM PICK UP AND HE LIKES IT SO FAR, BUT A FRIEND OF MINE HAS A 2002 RAM AND HE IS HAVING A PROBLEM WITH HIS FRONT END ALIGNMENT. SO I AM WONDERING IF THERE ARE OTHER PEOPLE HAVING SIMILAR PROBLEMS WITH THEIR FRONT ENDS ON DODGE VEHICLES.  *JB",
        "vin": "3B7HF12Y7XG"
    }
]