[
    {
        "components": "ENGINE AND ENGINE COOLING,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014105,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "SEVILLE",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 1997 CADILLAC STS WITH ALL OPTIONS. THE CAR HAD JUST ABOUT EVERYTHING GO WRONG WITH IT, INCLUDING IT REQUIRING A NEW ENGINE. MANY OF THE PROBLEMS EARLY ON WERE UNDER WARRANTY, BUT LATER ONES WEREN'T. HOWEVER, THE MOST DISTURBING PROBLEM WAS THE REAR TAIL LIGHT ASSEMBLIES. THEY DO NOT SEAL PROPERLY AND ALLOW WATER TO SEEP IN. THIS CAUSES CORROSION OF THE BULB SOCKETS AND EVENTUALLY CAUSES A SHORT THAT BLOWS A FUSE, EXTINGUISHING THE TAIL LIGHTS. OBVIOUSLY, THIS IS A MAJOR SAFETY CONCERN AND THE DRIVER HAS NO WAY OF KNOWING THERE IS AN IMPENDING FAILURE. CADILLAC CUSTOMER SERVICE ACKNOWLEDGED TO ME ON SEVERAL OCCASIONS THAT THERE IS NO KNOWN CURE OTHER THAN REPLACEMENT AND THAT THE PROBLEM EXISTS ON SEVERAL YEARS OF THAT MODEL. THE REPLACEMENT COST IS $500 PER SET OF TAIL LIGHTS AND THERE IS NO GUARANTEE IT WILL LAST OR HOW LONG IT WILL LAST. ON E OF THE METHODS PEOPLE HAVE USED IN AN ATTEMPT TO CURE THE ALLEVIATE THE PROBLEM IS TO DRILL HOLES IN THE BOTTOM OF THE LENS TO ALLOW WATER TO ESCAPE. WHEN I LAST TALKED TO THE CADILLAC CUSTOMER SERVICE, THEY WOULD NOT ALLOW ME TO TALK TO THE AVM (ZONE MANAGER FOR THIS DISTRICT), NOR WOULD THEY OFFER TO WORK WITH ME ON REPLACING THE TAIL LIGHT ASSEMBLIES. I BELIEVE THIS IS A CRITICAL SAFETY ISSUE THAT MUST BE ADDRESSED BY GENERAL MOTORS, ESPECIALLY SINCE THE CUSTOMER SERVICE READILY ADMITS IT IS A PROBLEM AND THERE IS NO KNOWN CURE OTHER THAN REPLACEMENT AT THE CUSTOMERS EXPENSE. INCIDENTALLY, THE TAIL LIGHT ASSEMBLIES WERE REPLACED ONCE UNDER WARRANTY WHEN I TOOK THE CAR IN FOR A COMPLETELY UNRELATED PROBLEM. SO, THAT IS EVIDENCE THE PROBLEM WAS WELL KNOWN BY BOTH GM AND THE DEALERSHIP NETWORK.    *NLM",
        "vin": ""
    }
]