[
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "04/07/2003",
        "fire": false,
        "manufacturer": "Britax Child Safety, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014106,
        "products": [
            {
                "manufacturer": "Britax Child Safety, Inc.",
                "productMake": "BRITAX",
                "productModel": "CHILD SAFETY SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "THIS COMPLAINT IS REGARDING MY BRITAX MARATHON CAR SEAT.  I BOUGHT TWO OF THESE CAR SEATS IN NOVEMBER 02 (MANUFACTURED OCTOBER 02).  BOTH HAVE BEEN VERY DIFFICULT TO TIGHTEN THE HARNESS BECAUSE THE ADJUSTER JUST DOES NOT WORK WELL.  I CALLED BRITAX WHEN I RECEIVED THESE CAR SEATS AND WAS TOLD IT WAS JUST A SLIGHTLY DIFFERENT MECHANISM FROM OTHER CAR SEAT ADJUSTERS, BUT WAS FINE.  I HAVE ASKED FOR ADVICE ON HOW TO GET IT TO TIGHTEN, BUT NOTHING THEY SUGGEST WORKS.  I PERSONALLY FEEL THAT IT IS A SAFETY ISSUE BECAUSE IT IS IMPOSSIBLE TO GET THE HARNESS AS TIGHT AS IT SHOULD BE.  I HAVE FOUND OUT THAT MANY PEOPLE WHO OWN THESE CAR SEATS ARE HAVING PROBLEMS WITH THE HARNESS.  MANY PEOPLE HAVE CALLED BRITAX AND GOTTEN SIMILAR RESPONSES (BASICALLY BEING BLOWN OFF BY BRITAX).  WE HAVE NOW FOUND OUT THAT BRITAX IS ROUTING THE HARNESS DIFFERENTLY THROUGH THE ADJUSTER (THUS, THE REALIZED THAT THE ORIGINAL METHOD DID NOT WORK AS IT WAS SUPPOSED TO).  I HAVE CALLED BRITAX NUMEROUS TIMES ONLY TO BE TOLD THAT ROUTING IT EITHER WAY IS FINE.  THEY OBVIOUSLY REALIZED THERE WAS A PROBLEM, SO HOW CAN EITHER WAY BE FINE?  I PERSONALLY DON'T THINK IT IS FINE SINCE IT PUTS A CHILD'S LIFE IN HANDS SHOULD YOU NOT BE ABLE TO PROPERLY TIGHTEN THE HARNESS.   SINCE I HAVEN'T BEEN ABLE TO MAKE ANY HEADWAY WITH BRITAX, I HAVE DECIDED TO REPORT THE PROBLEM DIRECTLY TO NHTSA.  I FEEL THAT THIS \"OLDER ROUTING\" OF THE HARNESS ON THE BRITAX MARATHON CAR-SEATS CREATES A SAFETY ISSUE.  BRITAX IS STILL NOT WILLING TO ACCEPT THAT IT IS (I GUESS THEY DON'T WANT TO HAVE TO PAY THE MONEY TO FIX EVERYONE'S SEATS).  I SUPPOSE IF NHTSA GETS ENOUGH SAFETY COMPLAINTS REGARDING THIS, THEY COULD POSSIBLY CAUSE BRITAX TO ADDRESS THE SITUATION.     *NLM",
        "vin": null
    }
]