[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "04/03/2003",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014139,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "RODEO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THURSDAY, APRIL 3, 2003 MY 1999 ISUZU RODEO BEGAN MAKING UNUSUAL SOUNDS FROM INSIDE THE HOOD AND THE ABS LIGHT LIT UP ON THE DASHBOARD.  UPON LOOKING UNDER THE HOOD, I DISCOVERED THE BRAKE MODULE WAS RUNNING DESPITE TURNING THE CAR OFF AND REMOVING THE KEY.  THE ONLY WAY TO STOP THE MODULE FROM RUNNING WAS TO REMOVE THE NEGATIVE CABLE FROM THE BATTERY.  I IMMEDIATELY CALLED THE CREST ISUZU DEALERSHIP IN PLANO, TEXAS AND SPOKE THE SERVICE DEPARTMENT ABOUT THE PROBLEM.  THE TECHNICIAN'S FIRST RESPONSE WAS THAT I MAY QUALIFY FOR A FREE REPLACEMENT BECAUSE THERE WAS A \"MANUFACTURER'S INSTALLATION PROBLEM\" ON SOME OF THE RODEOS COMING FROM CERTAIN PLANTS.  I GAVE HIM MY VIN NUMBER AND HE CAME BACK AND TOLD ME MY VIN NUMBER WAS NOT ON THE LIST.  I FOUND IT ODD THAT ISUZU WOULD RECOGNIZE THAT SOME PARTS WERE DEFECTIVE, BUT NOT RESPOND TO MINE.  MY NEXT STEP WAS TO CONTACT THE OWNER RELATIONS DEPARTMENT OF AMERICAN ISUZU MOTORS, INC.  I INITIALLY SPOKE WITH DON WHO INFORMED ME THAT IN JULY, ISUZU WAS LAUNCHING A CAMPAIGN TO REPLACE ALL BRAKE MODULES IN 1999 ISUZU RODEOS.  I WAS TOLD THIS WAS A SAFETY UPGRADE AND DID NOT MEAN THAT THE PART HAD ANY PROBLEMS.  I WAS TOLD THAT I WOULD HAVE TO PAY FOR THE REPLACEMENT OF MY MODULE BECAUSE IT WAS NOT YET JULY.  I AM BEING TOLD TWO SEPARATE STORIES FROM ISUZU EMPLOYEES.    I NEED A WRITTEN RESPONSE FROM ISUZU EXPLAINING HOW MY DEFECTIVE BRAKE MODULE IS NOT RELATED TO THE CAMPAIGN TO REPLACE ALL BRAKE MODULES IN JULY.  I DON'T THINK ISUZU WANTS TO BE RESPONSIBLE FOR ANY ACCIDENTS THAT MAY RESULT IN THE NEXT 3 MONTHS BECAUSE MY DEFECTIVE BRAKE MODULE WAS NOT ATTENDED TO.    *NLM",
        "vin": "4S2CM58W8X4"
    }
]