[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "03/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014157,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 1996 FORD WINDSTAR IN SEPTEMBER OF 1998.  IT HAD 15,000 MILES ON IT.  IT HAS THE 3.8L V6 ENGINE.  THE VAN CURRENTLY HAS 84,452 MILES ON THE ODOMETER.  ON MARCH 28, 2003 THE CHECK ENGINE LIGHT APPEARED.  I TOOK THE VEHICLE TO MY LOCAL FORD DEALER TO BE FIXED.    THEY ADVISED THAT THE ENGINE HAD A MISS-FIRE ON CYLINDER NUMBER 1.  THEY CHECKED THE SPARK PLUG, SPARK PLUG WIRE AND COIL.  THEY DID NOT DETERMINE WHY THE ENGINE MISFIRED AND CONCLUDED THAT IT MUST HAVE BEEN A FLUKE.  I PAID FOR THE WORK COMPLETED.  I DROVE APPROXIMATELY ONE HALF MILE AND THE CHECK ENGINE LIGHT AGAIN APPEARED.   ON MARCH 28TH, I WAS INFORMED BY THE SHOP FORMAN THAT THE FUEL INJECTOR ON NUMBER 1 CYLINDER WAS NOT WORKING.  A FUEL INJECTOR WAS ORDERED AND INSTALLED.  ON MONDAY, MARCH 31, 2003  I PAID A BILL FOR $136.31 FOR THE REPAIR OF THE FUEL INJECTOR.  AS I DROVE THE WINDSTAR TO MY HOME THE CHECK ENGINE LIGHT APPEARED.  THE SHOP FORMAN ADVISED ME THAT THE FUEL INJECTOR WAS NOT THE PROBLEM AND THAT AN ALTERNATE ENGINE COMPUTER WAS TRIED.   ON WEDNESDAY, APRIL 2, 2003 I WAS ADVISED THAT AN ENGINE KNOCK HAD DEVELOPED.  IT WAS CAUSED BY ANTIFREEZE LEAKING THROUGH A HEAD GASKET INTO CYLINDER NUMBER 1.  THE WATER IN THE CYLINDER CAUSED THE PISTON ROD TO BEND RUINING THE ENGINE.  A REPLACEMENT ENGINE WILL COST $3400.  I ASKED THE SHOP FORMAN IF AN ENGINE COMPRESSION CHECK HAD BEEN DONE DURING THE ENGINE DIAGNOSIS.  HE ADVISE THAT NO COMPRESSION CHECK WAS DONE SINCE A PRESSURE CHECK OF THE ENGINE HAD BEEN DONE BY THIS SHOP A FEW MONTHS PREVIOUS BECAUSE THE COOLANT LEVEL WAS LOW.  I HAVE FOUND MANY TESTIMONIALS AND COMPLAINTS REGARDING THE 1996 3.8L V6 ENGINE.  I BELIEVE THAT FORD SHOULD PAY FOR THE NEW ENGINE.    *NLM",
        "vin": "2FMDA5143TB"
    }
]