[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2003",
        "dateOfIncident": "04/09/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014184,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2003 SAAB 9-3 LINEAR W/ LAUNCH PACKAGE (STEEL GREY) APPROXIMATELY 2 MONTHS AGO. FOUR DAYS AFTER MY PURCHASE I WAS DRIVING USING THE STEPTRONIC SHIFTING AND THE CAR LOST POWER. WARNING LIGHTS CAME ON AND THE DASH SAID TO PULL OVER AND CONTACT SAAB. WHEN I ATTEMPTED TO ACCELERATE AND PULL OVER, A SEVERE GRINDING NOISE WAS HEARD AND FELT UNDER MY RIGHT FOOT. I CALLED ROADSIDE ASSISTANCE AND THEY BROUGHT IT BACK TO THE DEALERSHIP. AFTER SEVERAL DAYS THE DEALERSHIP SAID THEY SAW A COMPUTER EVENT \"WHEEL SPEED MISMATCH\" BUT WAS NOT SURE WHAT HAPPENED OR HOW THIS WAS CAUSED. THEY SAID WHEN THE CAR DETECTS A PROBLEM IT DISABLES PORTIONS OF THE ENGINE AND COMPUTERS AND ONLY ALLOWS YOU TO GO APPROX 20 MPH TO MAKE A SAFE STOP. THE DEALERSHIP CALLED THIS \"LIMP HOME MODE\" THEY SAID IT WAS SIMILAR TO A WINDOWS \"SAFE MODE\". AS YOU COULD IMAGINE I WAS ANGRY BUT UNDERSTAND SOMETIMES UNEXPLAINABLE THINGS HAPPEN. NOW LESS THAN 2 MONTHS LATER IT HAPPENED AGAIN. THIS TIME THOUGH I WAS ON THE FREEWAY IN RUSH HOUR TRAFFIC. AFTER NEARLY GETTING INTO AN ACCIDENT I MANAGED TO CALL SAAB ROADSIDE AND AGAIN THEY HAD TO TOW ME. ALL OF THE SYMPTOMS WERE THE SAME AND EVEN THE GRINDING.. I SIT HERE WITH A LOANER WAITING FOR INFO ON THE CAUSE. I WAS WONDERING IF ANYONE ELSE HERE HAS EXPERIENCED ANYTHING SIMILAR? OR HAS ANYONE HERE HEARD OF ANYTHING LIKE THIS WITH THE SAAB? ANY INFORMATION OR INSIGHT WOULD BE GREATLY APPRECIATED.*JB",
        "vin": "YS3FB49S531"
    }
]