[
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/09/2003",
        "dateOfIncident": "01/03/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA T",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE 2002 CAMRY SE V6. THE CAR CAME WITH BRIGESTONE TIRES THAT WERE TOTALLY UNCONTROLLABLE UNDER VERY LITTLE SNOW CONDITIONS. DRIVING THIS CAR ON A COUPLE OF SNOW DAYS GAVE ME THE SCARE OF MY LIFE. I TRIED TO CONTACT THE DEALER AND TOYOTA MANY TIMES AND DID NOT GET ANY HELP. I HAVE SPEND $300.00 TRADED MY NEW TIRES TO DIFFERENT TIRES. THE TRACTION OF THE VEHICLE GREATLY IMPROVED. I SIMPLY CAN NOT BELIEVE A 'REPUTED' CAR COMPANY CAN S... CUSTOMER LIKE THIS WHEN THEY SPEND $30,000 ON A BRAND NEW CAR. THE SECOND PROBLEM I HAVE IS THAT THE CAR 'WOBBLES' WHILE DRIVING AT ALL SPEEDS. MAY COMPLAINTS TO THE DEALERS GOT THE SAME RESPONSE: \"THE ROAD ARE TO BE BLAMED, NOTHING WRONG WITH THE CAR\". RECENTLY I GOT THE WHEEL BALANCE/ALIGNMENT DONE. NOT MUCH DIFFERENCE. I DRIVE MY OTHER VEHICLE ON THE SAME ROADS AND NEVER FEEL THIS WAY. DRIVEN OTHER CARS AND NOT FELT LIKE THIS.  THIS DEFINITELY SEEMS SOME DEFECT IN THE SUSPENSION/WHEELS OR FRAME. TOYOTA - YOU BETTER DO SOMETHING ABOUT THIS OR PEOPLE WILL JUST \"TALK\" ABOUT THESE PROBLEMS AND YOU WILL HAVE TO HEAR THEM. JB",
        "vin": "4T1BF30K02U"
    }
]