[
    {
        "components": "SEAT BELTS,CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "04/12/2003",
        "dateOfIncident": "04/12/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014306,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CENTURY PRODUCTS",
                "productMake": "CENTURY",
                "productModel": "2000STE",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "MY HUSBAND AND I JUST RETURNED FROM A CHILD SAFETY SEAT INSPECTION.  WE HAVE A 1999 SUBARU LEGACY.  WE HAD MANY PROBLEMS TRYING TO FIT OUR CENTURY 1000 STE CONVERTIBLE CAR SEAT INTO THE BACK SEAT, AND DECIDED TO TRY THE \"PROFESSIONALS.\"  THE ONLY WAY OUR CERTIFIED CAR SEAT INSPECTORS COULD ENSURE A TIGHT FITTING POSITION FOR THE CAR SEAT WAS ON THE SIDE (NOT CENTER, AS RECOMMENDED) AND WITH THE SEAT BELT TWISTED 6 (YES, I SAID 6) TIMES!  OF COURSE, THE OWNER'S MANUAL OF THE CAR SAYS DO NOT TWIST THE SEAT BELT.  THE INSTRUCTION MANUAL ON HAND FOR THE INSPECTORS SAID THAT BY TWISTING THE SEAT BELT 6 TIMES, WE LOWERED THE IMPACT RESISTANCE 30%.  THIS IS THE ONLY WAY OUR INSPECTORS COULD GET THE SEAT IN, THOUGH.  WE CONTACTED SUBARU AND THEY KINDLY SENT US A LIST OF \"RECOMMENDED\" CAR SEATS FOR THE 1999 SUBARU LEGACY.  THEY WERE ALL BOOSTER SHIELD SEATS, WHICH ARE NOT RECOMMENDED FOR USE WITH A CHILD MY DAUGHTER'S SIZE.  WHAT ARE WE SUPPOSED TO DO?  BUY A NEW CAR?  LET OUR DAUGHTER TRAVEL IN LESS THAN OPTIMAL SAFETY RESTRAINTS?  SUBARU PRIDES ITSELF ( AND SELLS ITSELF) AS BEING A SAFE CAR.  WHAT GOOD DOES ALL WHEEL DRIVE DO ME IF MY LITTLE GIRL IS SERIOUSLY HARMED OR KILLED DUE TO INEFFECTIVE, POORLY PLANNED SEAT RESTRAINTS DESIGNED BY THEIR ENGINEERS?   *NLM",
        "vin": ""
    }
]