[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2003",
        "dateOfIncident": "04/11/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014342,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "APRIL 11TH MY 2000 XTERRA STALLED WHILE DRIVING. I RESTARTED IT AND 5 MINUTES LATER IT STALLED AGAIN. THE THIRD TIME IT DIED AND WOULDN'T START AGAIN. I HAD IT TOWED TO MY HOUSE AND SINCE IT WAS RAINING I FIGURED I WOULD TRY IT AGAIN IN THE MORNING (HOPEFULLY WHATEVER WAS WET WOULD DRY OUT AND IT WOULD BE FINE). THE NEXT MORNING IT DID START AND I WAS ABLE TO MAKE IT TO THE HIGHWAY WHERE IT DIED AGAIN (MIDDLE LANE OF A 5 FOUR LANE HIGHWAY!). THIS TIME I HAD IT TOWED TO THE DEALER. I WAS A LITTLE SURPRISED TO HEAR THE MECHANIC TELL ME WHAT WAS WRONG BEFORE HE EVEN LOOKED AT IT (HE HAD A FUEL SENDER UNIT SITTING ON HIS WORKSTATION THAT HE HAD JUST PULLED OUT OF ANOTHER X WITH THE SAME PROBLEM). APPARENTLY WHEN THE X-TERRA HITS 50K TO 70K MILES THE FUEL SENDER UNITS GO BAD AND NEED TO BE REPLACED. THE CONNECTION FOR THE FUEL PUMP CORRODES (GREEN OXIDE) AND ALSO CRACKS CREATING AN OPEN. THE GUY WORKING IN THE PARTS DEPARTMENT SAID I WAS LUCKY BECAUSE THEY HAD JUST HAD A RUN ON FUEL SENDERS BECAUSE OF THIS PROBLEM AND WERE OUT FOR A WHILE BUT THEY HAD JUST GOT A NEW SHIPMENT IN. I STARTED TO FEEL LIKE THIS WAS A KNOWN MANUFACTURING DEFECT THAT NISSAN IS NOT LETTING ON TO THEIR CUSTOMERS. THE CLINCHER WAS, WHILE I WAS WAITING ANOTHER FLAT BED TOW TRUCK PULLED UP WITH ANOTHER X-TERRA...THAT'S RIGHT, BAD FUEL SENDER!! I PAID $211.00 FOR THE FUEL SENDER PLUS $65 FOR TOWING.  I CHECKED IF OTHERS HAVE HAD THIS SAME PROBLEM ON AN X-TERRA FORUM WEB SITE AND IT APPEARS TO BE ALL TOO COMMON.  HAVING YOUR MOTOR CUT OUT IN THE MIDDLE OF THE HIGHWAY IS A VERY DANGEROUS THING!   *NLM",
        "vin": "5N1ED28Y6YC"
    }
]