[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/14/2003",
        "dateOfIncident": "10/21/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014352,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT SPEAKER POPS ON AND OFF AT A STOP OR MOVING. WHEN YOU USE THE AC BUTTON, WINDSHIELD WIPER, WINDOWS, AND TURN SIGNALS THE SPEAKER EITHER SHUTS OFF OR TURNS ON. THE RADIO WAS REPLACED THREE TIMES, THE SPEAKER TWICE AND THE WIRING AND WIRING HARNESSES WERE REPLACED. THE CAR HAS BEEN IN AND OUT OF THE SHOP WITH AND WITHOUT REPAIRS FOR THE SAME PROBLEM AT LEAST 12 TIMES.  THE PROBLEM STARTED THE FIRST NIGHT WHEN I BOUGHT THE VEHICLE IN OCTOBER OF 2001. THE CAR HAS HAD OTHER PROBLEMS WITH THE POWER WINDOW MOTORS, BATTERY, AND REMOTE DOOR LOCKS. I FEEL AS THOUGH I HAVE SPENT MORE TIME AT THE DEALER TRYING TO GET THE CAR FIXED THEN ACTUALLY ENJOYING THE CAR. I HAVE FILED CASES WITH THE HYUNDAI CORPORATE OFFICE, A FACTORY REPRESENTATIVE LOOKED AT THE CAR, HEARD THE PROBLEM, IN FORMED THE DEALER ON HOW TO FIX IT. I RECEIVED A PHONE CALL 6 DAYS LATER SAYING THE CHIEF MECHANIC COULD NOT DUPLICATE THE PROBLEM SO HE DID NOT TOUCH IT. EVEN THOUGH THE FACTORY REPRESENTATIVE HEARD THE PROBLEM AND TOLD THEM WHAT TO FIX. I HAVE TAKEN THE FIRST STEP IN THE LEMON LAW, I HAVE SENT A CERTIFIED DEFECT COMPLAINT TO THE DEALER. THE RECEIVED IT APRIL 11 2003 AT 12:00 PM. I AM JUST WAITING ON THERE RESPONSE. THIS CAR HAS BEEN A NIGHTMARE TO MY SELF AND MY FAMILY. TWO VISITS AGO THE DEALER HAD THE CAR FOR ONE WEEK. WHEN I RECEIVED THE CAR BACK, THE CAR WAS COVERED WITH AN UNKNOWN SUBSTANCE (MAYBE TREE SAP) ALL OVER THE HOOD, ROOF, AND TRUNK. I BROUGHT THIS TO THE DEALERS ATTENTION WHILE THE FACTORY REP WAS THERE. THE REP TOLD THEM TO COMPOUND THE CAR OUT AND RECTIFY THIS ISSUE. WHEN I PICKED UP THE CAR, THE CAR WAS WASHED BUT THE SUBSTANCE WAS STILL THERE, NOW WITH SWIRL SCRATCHES IN THE PAINT WHERE THEY TRIED TO UP THE SUBSTANCE OFF THE CAR. DEALER AND CORPORATE WILL NOT TAKE RESPONSIBILITY FOR THIS. THIS WILL BE THE FINAL CASE FOR MY LAWYER AGAINST HYUNDAI.   *NLM",
        "vin": ""
    }
]