[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/11/2003",
        "dateOfIncident": "03/03/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014291,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "THUNDERBIRD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE MY 2002 THUNDERBIRD'S ENGINE HAS STOPPED WHILE I AM DRIVING IT.  BOTH TIMES, IT OCCURRED AS I WAS MAKING A LEFT TURN IN FRONT OF ONCOMING TRAFFIC IN A 55 MPH ZONE.  WHEN IT QUIT, I WAS UNABLE TO STEER OR CONTROL THE VEHICLE IN ANY WAY.  I HAD TO PUT IT IN PARK AND RESTART IT BEFORE I COULD LEAVE THE ONCOMING LANE.  FORD HAS AN UNPUBLISHED OASIS SPECIAL SERVICE MESSAGE 16581 WHICH STATES: \"2000-2002 LINCOLN LS & 2002 THUNDERBIRD - INTERMITTENT ENGINE QUIT ON DECEL/STOPS/TURNS.   SOME 2000-2002 LINCOLN LS & 2002 THUNDERBIRD VEHICLES MAY EXHIBIT AN INTERMITTENT ENGINE QUIT CONDITION.  THE ENGINE QUIT MAY OCCUR ON DECELERATION, LOW SPEED/PARKING LOT MANEUVERS OR AGGRESSIVE BRAKING.  THE CONDITION MAY NOT BE EASILY DUPLICATED, TYPICALLY NO DTCS WILL BE PRESENT AND THE ENGINE WILL START NORMALLY AFTER THE EVENT.  THIS IS UNDER INVESTIGATION FOLLOWING THE QUICK SERVICE FIX PROCESS.  UNTIL ROOT CAUSE IS DETERMINED, PLEASE FOLLOW NORMAL PC/ED MANUAL DIAGNOSTICS AND SUBMIT EDSR'S.\"   MY VEHICLE IS IN THE SHOP AND HAS BEEN FOR WELL OVER A MONTH.  I AM CURRENTLY TRYING TO REPLACE IT UNDER OREGON'S LEMON LAW.  I HAVE JUST STARTED THIS PROCESS AND I DON'T KNOW WHAT THE OUT COME WILL BE.  BUT I AM WORRIED THE CONSUMER IS NOT AWARE OF THIS DEFECT.  HAD THERE BEEN ONCOMING TRAFFIC WHEN I WAS MAKING THIS TURN IN A 55 MPH ZONE, I VERY WELL MIGHT BE BEEN EXTREMELY INJURED OR DEAD, AND IT WOULD HAVE BEEN CHALKED UP TO SOMEONE TURNING LEFT UNSAFELY.  OBVIOUSLY, FORD IS AWARE OF THE DEFECT, BUT OWNERS HAVE NOT BEEN NOTIFIED OF THE POSSIBILITY THAT THEIR ENGINE MAY SHUT DOWN UNEXPECTEDLY.  THIS HAS POTENTIAL FOR EXTREMELY SERIOUS CONSEQUENCES.  *JB",
        "vin": "1FAHP60A82Y"
    }
]