[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2003",
        "dateOfIncident": "04/08/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014393,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-150",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE GASOLINE LEAK WHEN FILLING TANK ON FORD 1999 E150 FORD VAN.    WHEN FILLING TANK APPROXIMATELY 1 GALLON OF GAS WOULD LEAK ONTO TOP OF TANK AND ONTO THE GROUND UNDER THE VEHICLE.  BOTH A SAFETY AND ENVIRONMENTAL ISSUE, THIS IS DIFFICULT TO DETECT AS ONE TYPICALLY DOES NOT LOOK UNDER THE VEHICLE WHEN FILLING THE TANK.  FURTHERMORE, SOME LEAKAGE OCCURS WHEN GOING OVER LARGE HILLS AS THE GAS SLOSHES AROUND THE TOP OF THE TANK.    UPON VISUAL INSPECTION OF THE FILL TUBE WITHOUT REMOVING THE TANK, THE ROOT CAUSE OF THE LEAK WAS NOT OBVIOUS. HOWEVER, PROBLEM APPEARED TO BE CAUSED BY A MISALIGNMENT OF THE TANK FILL HOLE AND THE BOTTOM OF THE FILL HOSE ASSEMBLY.  THIS SEEMS LIKELY GIVEN THE SMALL CONNECTORS THAT ARE USED TO HOLD THE TANK AND FILL TUBE CONNECTOR ASSEMBLY TOGETHER.  UPON EXAMINATION OF THE FILL TUBE ASSEMBLY, IT APPEARS RUSTY, BUT IT IS INTACT.  FURTHERMORE, THE HOSE AT THE TOP OF THE ASSEMBLY WAS DRY WHEN FILLING EVEN THOUGH THE TANK WAS LEAKING PROFUSELY.     I DISCOVERED THIS LEAKAGE ON A FAMILY TRIP (WITH MY FAMILY IN THE VEHICLE) HAVING JUST DEPARTED FROM A HIGHWAY.  BY THE TIME I DETECTED THE LEAK, A PUDDLE APPROXIMATELY THREE QUARTERS OF THE SIZE OF THE VEHICLE HAD FORMED UNDER THE VEHICLE. THE LEAK WAS ABSOLUTELY REPRODUCIBLE.   FORD'S NATIONAL CUSTOMER SERVICE REPRESENTATIVES REFUSED TO ACKNOWLEDGE THE SEVERITY OF THE SAFETY ISSUE, AND SIMPLY STATED  THEY RECOMMEND THAT I HAVE THE VEHICLE REPAIRED.  AT THE DEALER I REQUESTED TO SPEAK TO A REGIONAL CUSTOMER SERVICE REPRESENTATIVE.  HOWEVER, I WAS TOLD THE REGIONAL SERVICE REPRESENTATIVES ARE RESOURCES FOR USE BY THE DEALERS, AND NOT AVAILABLE TO THE CUSTOMERS.    I HAD THE DEALER REPLACE THE FILL TANK HOSE ASSEMBLY AT MY EXPENSE.  UNFORTUNATELY, I AM AFRAID THAT THIS MAY BE A PROBLEM THAT IS ENDEMIC TO THE FORD ECONOLINE VEHICLE FLEET, AS THIS PARTICULAR VAN IS RELATIVELY NEW AND HAS EXPERIENCED A VERY MILD SERVICE HISTORY AS A FAMILY VEHICLE.  *JB",
        "vin": "1FDRE14W3XH"
    }
]