[
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,VISIBILITY,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/15/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "MALIBU",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RESEARCHING THE SERVICE BULLETINS SECTION OF THIS WEBSITE, I HAVE COME TO REALIZE THAT I HAVE COMPLAINED/HAD SERVICED ABOUT 85% OF THE SAME PROBLEMS THAT ARE LISTED ON YOUR DATABASE.  I PURCHASED THIS CAR NEW, FROM EVERETT CHEVROLET, WA IN 2000. SINCE THE PURCHASE. DATE, I HAD CHEVY DO THE FOLLOWING:  NEW BRAKES (ALL THE WAY AROUND - ONCE, FRONT ROTORS/PADS - TWICE), ALL NEW PISTONS, TRANSMISSION REPLACED, MISS ON #1 CYLINDER - REPLACED 1 FAILED SPARK PLUG, LEFT REAR DOOR SQUEAKS WHEN OPEN/SHUT - LUBED (HAS HAPPENED 3 TIMES NOW), FRONT LEFT NOISE FROM STRUTS/BRAKES - NOT ABLE TO VERIFY AS OF YET (POSSIBLE STRUT PROBLEM/LUBE), FAN IN DASHBOARD HAS A SOUND IN THE MIDDLE (JUST ABOVE THE CD PLAYER/RADIO) LIKE THERE IS A PIECE OF PAPER CAUGHT IN THE HOUSING (CONFIRMED AFTER 4 COMPLAINTS, FAULTY FAN MOTOR), PASSENGER FRONT SEAT SQUEAKS WHEN OCCUPIED (DEALERSHIPS HAVE NOT BEEN ABLE TO DUPLICATE./FIX), REARVIEW MIRROR RATTLES WHILE DRIVING AT HIGHWAY SPEEDS (TIGHTENED, STILL DOES IT IN HOT WEATHER).  BOTTOM LINE, THIS IS MY FIRST NEW CAR PURCHASE AND I AM HAVING SERIOUS DOUBTS ABOUT KEEPING THE CAR - AS IT ONLY HAS 21,405 MILES ON IT. WITH THE 3/30 WARRANTY. COMING UP IN OCT. 2003, I AM VERY MUCH AFRAID THAT I HAVE PURCHASED A LEMON AND NOT LOOKING FORWARD TO SPENDING ANYMORE TIME/$$$ ON THIS VEHICLE.   ANY SUGGESTIONS?  *JB",
        "vin": "1G1NE52J216"
    }
]