[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/15/2003",
        "dateOfIncident": "04/11/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LESABRE",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "ERRATIC ENGINE PERFORMANCE AND OCCASIONAL \"CHECK ENGINE\" LIGHT REPORTED SEVERAL WEEKS AGO WHEN VEHICLE WAS IN FOR MINOR REPAIR. INDEPENDENT DELCO GARAGE OWNER INDICATED STORED CODES WERE FOR \"O2 SENSOR\" - HOWEVER IT APPEARED TO BE FUNCTIONING NORMALLY AT THAT TIME. ON FRIDAY 4/11/03, ERRATIC ENGINE PERFORMANCE (MISSING, LOSS OF PERFORMANCE) CAUSED ME TO HEAD TOWARDS GARAGE FOR FURTHER INVESTIGATION. EN ROUTE, VEHICLE STALLED OUT, AND REFUSED TO RESTART (AT ONE POINT, A BACK FIRE OCCURRED DURING RESTART ATTEMPT. HAD VEHICLE TOWED TO GARAGE, AND DURING SUBSEQUENT INSPECTION, IT WAS DISCOVERED THE HEAT FROM THE \"EGR\" PIPE FROM THE LOWER INTAKE MANIFOLD HAD DAMAGED THE UPPER COMPOSITE MANIFOLD, CAUSING A COOLANT LEAK INTO THE INTAKE. STORED CODES AT THIS TIME INDICATED O2 SENSOR, MISFIRE AND CATALYTIC CONVERTER. OWNER INDICATED THESE READINGS WERE CONSISTENT WITH HIS EXPERIENCE, AND INFORMED ME THAT THEY HAVE REPLACED AT LEAST A DOZEN TO 18 UPPER INTAKES IN PAST 18 MONTHS. QUOTING HIM \"WE'RE JUST A SMALL GARAGE\".  I HAVE ALSO BEEN TOLD THAT WHEN HE CALLED LOCAL GM DEALERSHIP (TO INQUIRE ON AVAILABILITY OF PARTS) HE WAS TOLD \"WE HAVE SO MANY OF THESE IN STOCK THAT WE CAN'T EVEN PUT THEM UP ON THE SHELVES  THEY ARE STACKED IN THE AISLE.\"  WHAT IS MOST DISCONCERTING IS WHEN I CALLED BUICK DIVISION GENERAL MOTORS CORP CUSTOMER ASSISTANCE CENTER I WAS TOLD BY KEVIN DAM (SP?) AND DARLENE VEGA (SP?) THAT THERE WAS NO KNOWN COMPLAINTS, INVESTIGATIONS OR RECALLS  REGARDING THIS PROBLEM. AFTER REVIEWING THIS SITE AND YOUR INVESTIGATION(S) - SOMEONE IS GROSSLY MISINFORMED! AND IT APPEARED THE MANUFACTURER MAY EVEN BE PARTICIPATING IN DENIAL AND/OR MISREPRESENTATION IN THIS MATTER. MY INQUIRY (COMPLAINT OR WHATEVER THEY CALL IT) WAS GIVEN THE NUMBER 1-89860067. IT SEEMS TO ME THAT WE ALL HAVE A TICKING BOMB ON OUR HANDS ... UNFORTUNATELY, I DRIVE IT TO WORK EACH DAY! CAN YOU HELP ME?. *JB",
        "vin": "1G4HP52K0VH"
    }
]