[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/16/2003",
        "dateOfIncident": "02/11/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014440,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "COUGAR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1999 MERCURY COUGAR 2.5L DURATEC V6 (VIN L) CURRENTLY WITH 55,000 MILES.  AT 49,135 MILES, I HAD THE OIL CHANGED AT ITS REGULAR INTERVAL (3,000 MI) AT MIDAS SERVICE.  AT CLOSE TO 52,000 MILES, UPON EXITING A SWEEPING RIGHT-HAND OFF-RAMP, THE 'OIL' LAMP FLICKERED ON AND OFF FOR A FEW SECONDS.  SEVERAL WEEKS LATER, THE ENGINE DEVELOPED A LIGHT 'TICKING' NOISE THAT GREW INTO 'KNOCKING.'  THE LOCAL FORD DEALER, INDEPENDENCE FORD, CHARGED $60 TO TELL ME SEVERAL HUNDRED DOLLARS WORTH OF TESTS WOULD BE REQUIRED TO DETERMINE THE SOURCE OF THE NOISE.  I ASKED THE SERVICE MANAGER, [XXX], IF HE OR FORD WAS AWARE OF PROBLEMS CONCERNING OIL STARVATION DUE TO 'CRANK WHIP' OR  PRESSURE LOSS DURING RIGHT-HAND CORNERING.  HE BEGAN LISTING EXISTING KNOWN PROBLEMS WITH COUGARS.  BEING FAMILIAR WITH THE TECHNICAL SERVICE BULLETINS, I SUGGESTED HE WAS READING THE LIST OF TSB'S TO ME.  HE BECAME EVASIVE AND SAID THERE WAS NO PROBLEM WITH THE ENGINES.  I HAD SPENT SEVERAL HOURS RESEARCHING THE OIL STARVATION PROBLEM KNOWN TO EXIST WITH THE DURATEC ENGINES, INCLUDING CHANGES FORD MADE IN 1999 AND IN 2003 TO REDUCE THE OCCURRENCE OF BEARING FAILURE DUE TO OIL STARVATION AS A RESULT OF CRANK WHIP AND POOR OIL CIRCULATION.  I READ OF OWNERS WITH FAILURES AS LOW AS 3,000 AND 11,000 MILES.  I HAVE CONTACTED BOTH FORD AND MERCURY VIA MAIL EXPLAINING THE SYMPTOMS AND PROBLEM WITH MY VEHICLE, BUT HAVE NOT RECEIVED RESPONSE.  IN THE MEANTIME, MY VEHICLE WAS DIAGNOSED BY AN INDEPENDENT REPAIR FACILITY AS HAVING DAMAGED CONNECTING ROD BEARINGS.  I MUST NOW ABSORB THE EXPENSE OF ENGINE FAILURE AT LESS THAN 55,000 MILES.  FORD HAS MADE PRODUCTION CHANGES TO REDUCE THE INCIDENCE BUT REFUSES TO OFFER REPAIR AND REPLACEMENT FOR EXISTING OWNERS OF THE FAULTY ENGINES.  A MARKET HAS DEVELOPED, INCLUDING REVISED OIL PANS INCORPORATING BAFFLES, TO OFFER POSSIBLE REMEDY TO THE PROBLEM.  I SINCERELY APPRECIATE ANYTHING NHTSA CAN DO TO HELP OWNERS LIKE MYSELF WHO ARE THE VICTIMS OF THIS FAULTY DESIGN.   *NLM    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1ZWFT61L3X5"
    }
]