[
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/15/2003",
        "dateOfIncident": "04/14/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEB. 2003 I HAD SURGERY AND DID NOT DRIVE MY CAR FOR ABOUT A WEEK. WHEN I FINALLY DROVE MY CAR, MY DRIVERS SIDE WINDOW WOULD NOT ROLL DOWN. A COUPLE OF DAYS LATER IT STARTED WORKING AND NOW HAS A GRINDING NOISE TO IT. RECENTLY MY HORN STOPPED WORKING COMPLETELY. I REPLACED THE RELAY SWITCH AND IT STILL WILL NOT WORK.  NOW, MY TURN SIGNALS WORK WHENEVER THEY WANT TO. THE ONLY WAY I CAN GET THEM TO WORK IS TO PRESS MY HAZARD SWITCH AND NOW IT IS GETTING TO WHERE IT WILL NOT WORK. AND LAST BUT NOT LEAST MY AIR CONDITIONER IS NOT BLOWING PROPERLY. ON THE 2 FIRST SETTINGS IT BARELY BLOWS, IF I PRESS ON MY BRAKES IT FEELS AS IF IT COMPLETELY QUITS. I HAVE ALSO NOTICED THAT WHEN I ROLL DOWN MY WINDOWS THE INTERIOR LIGHTS WILL DIM AND THE CAR ENGINE POWER WILL DECLINE. I HAVE HAD MY CAR FOR 1 YR. I PURCHASED IT USED WITH LESS THAN 25,000 MILES. I FEEL THESE ISSUES SHOULD BE ADDRESSED BECAUSE THEY CAN LEAD TO SAFETY ISSUES. I WAS CHANGING LANES AND MY BLINKERS FAILED AND WAS ALMOST HIT BY ANOTHER CAR, AT THAT TIME AND STILL DO NOT HAVE A HORN TO BLOW TO WARN THEM THAT I WAS CHANGING LANES ALSO.  THE DEALER I PURCHASED THE CAR FROM THINKS THAT I AM CRAZY. THAT I AM A HYPOCONDRIAC. THEY ARE UNCOOPERATIVE AND BASICALLY REFUSE TO HELP ME. I FEEL I SHOULD NOT HAVE TO PAY FOR SOMETHING THAT  APPARENTLY A LOT OF ALERO OWNERS ARE GOING THROUGH.  *JB",
        "vin": "1G3NL52TX1C"
    }
]