[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/19/2003",
        "dateOfIncident": "04/06/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016202,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM IT MAY CONCERN:  WE BOUGHT OUR NEW VOLVO V70 GLT WAGON IN 1999 FROM KRAMER MOTOR, SANTA MONICA, CALIFORNIA.  JUST RECENTLY THE AIRBAG SAFETY LIGHT (SRS) WENT OFF AND I WAS TOLD BY THE AUTHORIZED VOLVO SERVICE DEALER (RUSNAK, PASADENA) THAT IT MEANT SOMETHING WAS WRONG IN THE AIRBAG SYSTEM AND  VOLVO WOULD REPLACE THE AIRBAG.  ON THE DAY OF THE REPAIR THE DEALER CALLED AND TOLD ME THERE WAS SOMETHING WRONG WITH MY SEAT COVERS - THE COVERS WERE NOT AUTHORIZED VOLVO SEAT COVERS (DRIVER AND PASSENGER) AND THEREFORE THE VOLVO AIRBAG FEATURE MIGHT NOT WORK.  SINCE WE BOUGHT THIS CAR NEW FROM A VOLVO DEALER, WE DID NOT UNDERSTAND HOW THIS SITUATION COULD HAPPEN.   VOLVO INFORMED US THAT DEALERS WILL SOMETIMES CHANGE FACTORY PARTS, IF THEY WANT TO, AND THAT VOLVO CAN NOT DO ANYTHING ABOUT IT AND DOES NOT ACCEPT ANY RESPONSIBILITY FOR WHAT THEIR DEALERS DO.  SINCE THIS DEALER CHANGED A FEATURE THAT HAS SERIOUS SAFETY ISSUES, AGAIN WE COULD NOT BELIEVE THIS SITUATION IS CORRECT.  HOW IS A CONSUMER PROTECTED IN SUCH A MATTER?  WE BOUGHT FROM AN AUTHORIZED DEALER AND HOW ARE WERE WE SUPPOSED TO KNOW OR EVEN SUSPECT THAT CRITICAL SAFETY ELEMENTS MIGHT NOT BE FUNCTIONING?  VOLVO AMERICA AND THEIR LOCAL REPRESENTATIVE, MICHAEL LAFATA, SEEM TO FEEL THAT IT IS JUST A CASE OF LET THE BUYER BEWARE.  THE VOLVO AMERICA CUSTOMER SERVICE SUPERVISOR, KATHLEEN NATALE, WAS MORE UNDERSTANDING AND TRIED TO HELP BUT SHE HAD TO DEFER TO MR. LAFATA'S DECISION THAT VOLVO WOULD NOT REPLACE THESE SEAT COVERS TO RETURN THE AIRBAG SAFETY FEATURE TO AN OPERATING CONDITION. RATHER, RUSNAK VOLVO PUT MY CAR BACK TOGETHER WITH THE NON-VOLVO SEAT COVERS AND SENT ME ON MY WAY WITH A STACK OF PAPERWORK THAT CLEARLY SAYS THAT MY CAR MAY NOT BE SAFE BECAUSE THE AIRBAG FEATURE MAY NOT WORK WITH THE CURRENT SEAT COVERS.   AS YOU CAN SEE BELOW, NO ONE HAS BEEN INJURED OR DIED YET, BUT CLEARLY THIS IS A SAFETY PROBLEM THAT WE BELIEVE VOLVO AMERICA SHOULD QUICKLY ADDRESS. *JB",
        "vin": "YV1LW56D0X2"
    }
]