[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/18/2003",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016146,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "RANGER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS ABOUT A FORD RANGER EDGE SUPERCAB 4X4.    I HAVE HAD THIS TRUCK BARELY OVER 2 YEARS AND IT HAS 45,000 MILES ON IT.  ABOUT ONE YEAR AFTER PURCHASING THE VEHICLE I STARTED HAVING TRANSMISSION PROBLEMS, THE \"OVERDRIVE OFF\" LIGHT FLASHING AND FUNNY SHIFTS FROM FIRST INTO SECOND AS WELL AS A HESITANT ACCELERATION FOLLOWED BY A SMALL JERK.  I TOOK IT IN TO HAVE IT FIXED AND APPARENTLY IT WAS.  ABOUT 3 MONTHS LATER THE TRANSMISSION STARTED ACTING UP AGAIN IN THE SAME FASHION. I TOOK IT IN AND ONCE AGAIN THOUGHT IT WAS FIXED UNTIL A FEW MONTHS LATER IT STARTED DOING THE SAME THING. BY THIS TIME SINCE I THOUGHT THE TRUCK WAS FINALLY FIXED I DECIDED TO ADD A 4\" SUSPENSION LIFT AND 33\" TIRES.  WHEN I TOOK IT IN THEY TOLD ME I NEED EITHER A NEW TRANSMISSION OR TO HAVE THIS ONE REBUILT AND THAT THE WARRANTY WOULD COVER THE COST.  AFTER ABOUT A WEEK IN THE SHOP AND TORN APART THEY CALLED AND TOLD ME THE WARRANTY CO. DID NOT WANT TO PAY FOR THE REBUILT TRANSMISSION BECAUSE OF THE \"EXTENSIVE SUSPENSION MODS\" AND LARGER TIRES.  LET ME REMIND YOU, I HAD IT IN 2 TIMES BEFORE THE LIFT WAS PUT ON FOR THIS SAME PROBLEM THAT HAS NOT YET BEEN FIXED. AFTER A BIT OF ARGUING I DECIDED THAT I WASN'T GOING TO WIN AND THAT I NEED A TRUCK.  SO I AM NOW PAYING $150 A MONTH FOR THE $3000+ FOR THE WORK AND REBUILT TRANSMISSION.  NOW, AFTER ABOUT 4 MONTHS AFTER THE WORK, I AM EXPERIENCING THE SAME PROBLEM YET AGAIN...CAN SOMEONE PLEASE ADVISE ME ON HOW TO TAKE CARE OF THIS PROBLEM ???  THANKS, AARON.    *NLM",
        "vin": "1FTZR15E81P"
    }
]