[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,POWER TRAIN,ELECTRICAL SYSTEM,STRUCTURE,LATCHES/LOCKS/LINKAGES,SEATS",
        "crash": true,
        "dateComplaintFiled": "04/21/2003",
        "dateOfIncident": "02/06/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND AM",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN IN THE SHOP REPEATEDLY FOR THE BRAKES GRINDING AND SHAKING WHEN I BRAKE. THE ROTORS HAVE BEEN REPLACED TWICE FOR RUSTING AND WARPING AND THE BRAKES ONCE, UNDER WARRANTY. I HAVE HAD WATER LEAKS, MY DASH HAS BEEN REPLACED FOR WARPING, 2 DOOR PANELS HAVE BEEN REPLACED FOR WARPING. I HAVE 2 MORE THAT NEED TO BE REPLACED, BUT THE DEALERSHIP SAYS \"IT'S A COMMON PROBLEM, BUT IT'S NOT COVERED UNDER THE EXTENDED WARRANTY\". I HAVE LOTS OF WIND NOISE. A ROTTEN EGG SMELL IN MY CAR WHEN DRIVING IT. I TOOK MY CAR TO THE DEALER LAST WEEK AND THEY REPLACED A GASKET/SEAL FOR A INTAKE GASKET LEAK. I WENT TO PICK UP MY CAR AND IT REEKED OF GASOLINE. THEY KEPT IT ANOTHER DAY AND HAD TO REPLACE MY FUEL REGULATOR. NOW I CANNOT KEEP MY WINDOWS CLOSED BECAUSE THERE IS A ODOR OF GAS IN MY CAR, WHICH CAUSES MY EYES TO BURN AND WATER AND MY THROAT TO BURN. MY HAZARDS/BLINKERS HAVE GONE OUT ONCE ALREADY. TWO OTHER TIMES I HAD IT IN THE SHOP FOR A CLICKING NOISE IN MY DASH AREA AND IT WAS SOMETHING WITH MY HAZARDS THAT HAD TO BE REPLACED. MY PASSENGER SEAT WOULD NOT ADJUST, THEY SAY THEY FIXED IT? THE TRANSMISSION SLIPS ON OCCASION AND THAT HAS BEEN SINCE I TOOK POSSESSION OF THE LEMON. MY HORN QUIT WORKING AND WAS FINALLY FIXED AFTER REPEATEDLY TAKING IT INTO THE DEALER. IT IS HESITANT TO START AT TIMES AND WHEN IT FINALLY STARTS THE FRONT END SHAKES, LIKE THE MOTOR MOUNTS ARE BAD. *JB",
        "vin": "1G2NV52E3YM"
    }
]