[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "04/22/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016341,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 OLDSMOBILE BRAVADA - FRONT LEFT CONTROL ARM BALL JOINT BROKE.  RESULT IN FRONT SUSPENSION COLLAPSING.  TOP OF TIRE WENT INWARD.  MY VEHICLE WAS BUILT IN MAY 1999 AT GENERAL MOTORS PLANT IN MORIANE, OHIO.   RESEARCH ON THE INTERNET SHOW THIS PROBLEM HAS EXISTED ON THIS AND SIMILAR GM VEHICLES SINCE 1996.  A RECALL WAS DONE ON THEM. (GM RECALL BULLETIN ? SUBJECT 01048A ? UPPER BALL JOINT SEPARATION ISSUED OCTOBER, 2001) (ALSO REFERENCE ODI ACTION NUMBER RQ02-012)   HOWEVER I CALLED OLDSMOBILE (1-800-222-1020) AND THEY SAID NO RECALL ON MY CAR WAS ISSUED.   I WAS TOLD RECALLS ARE DONE ON INDIVIDUAL CARS, NOT LOTS OF CARS, AS I WOULD HAVE EXPECTED.   FURTHER RESEARCH SHOW CARS IN THIS PART OF THE COUNTY WHERE SALT IS USED ON ROADS IN THE WINTER HAVE A HIGH PROBABILITY OF THIS PROBLEM DEVELOPING.    SINCE THIS PROBLEM HAS EXISTED FOR 8 YEAR I FEEL THIS SHOULD BE THE RESPONSIBILITY OF THE MANUFACTURER TO ENGINEER A SOLUTION, ESPECIALLY SINCE THIS IS A KNOWN PROBLEM.   NHTSA NEEDS TO DO A COMPLETE INVESTIGATION FOR THE PUBLICS SAFETY.    HAD I BEEN TRAVELING ON A HIGHWAY WHEN THIS BROKE THIS COULD HAVE BEEN ANOTHER FORD EXPLORER ROLLOVER FIASCO.  WHEN I CALLED OLDSMOBILE AND ASKED IF I COULD TALK TO THE REGIONAL MANAGER FOR THIS AREA THE PERSON I TALKED TO SAID THE REGIONAL MANAGERS DO NOT TALK TO THE GENERAL PUBLIC.  WHAT KIND OF PUBLIC RELATIONS IS THAT?     *NLM",
        "vin": "1GHDT13W7X2"
    }
]