[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/25/2003",
        "dateOfIncident": "04/23/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016484,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300M",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST EVENING, I LOST STEERING POWER.  I WAS BACKING OUT OF A PARKING SPACE! I HAVE A 1999 CHRYSLER 300M. THE STEERING RACK WAS REPLACED BY THE MANUFACTURER IN JULY 2000 WHEN I COMPLAINED OF NOISE IN THE STEERING AND I WAS TOLD THEN BY THE DEALER THERE WERE PROBLEMS WITH THE STEERING RACK ON THE 1999 300M - APPARENTLY THERE WAS A DESIGN FLAW IN THE PART, AND BECAUSE IT WAS BEING REPLACED WITH THE SAME MODEL PIECE, THE DEALER COULD NOT GUARANTEE IT WOULD NOT HAPPEN AGAIN.  AT THE TIME MY CAR HAD 23,482 MILES ON IT.  THE DEALER TOLD ME LAST NIGHT THAT THE STEERING RACK HAS NOW BEEN REDESIGNED.   THE COST TO REPLACE IT WILL BE $1,156.95 PLUS TAX.  MY CAR NOW HAS APPROXIMATELY 51,200 MILES ON IT.    I CALLED CHRYSLER AND REQUESTED, THAT SINCE THIS WAS NOT ORDINARY WEAR AND TEAR, AND SINCE THE PART WAS DEFECTIVE FROM THE BEGINNING, THEY SHOULD PAY FOR IT.  THEY ARGUED THAT SINCE THEY PAID FOR THE FIRST REPLACEMENT BECAUSE THE CAR WAS UNDER WARRANTY, THEY ARE NOT OBLIGATED TO PAY IT AGAIN.  I WAS TOLD THERE HAD BEEN NO RECALL AND SINCE I DID NOT HAVE AN EXTENDED WARRANTY THERE WAS NOTHING THEY COULD DO.  I VERY NICELY TOLD THEM THAT IN MY OPINION, THE FACT THAT THE PART WAS DEFECTIVE IN THE FIRST PLACE, AND THE SAME PART WAS PUT BACK IN, IT MOST CERTAINLY IS THEIR PROBLEM AND THEY ARE EXTREMELY LUCKY THAT I WAS NOT DRIVING ON THE ROADS OR A SEVERE ACCIDENT WOULD CERTAINLY HAVE TAKEN PLACE, AND A LAWSUIT WOULD BE FILED AGAINST THEM.    THEY TOLD ME THE ONLY RECOURSE I HAD WAS TO ASK FOR A DISCOUNT FROM THE SERVICE MANAGER.  IS THERE ANYTHING YOU CAN DO?  THIS IS A VERY DANGEROUS SITUATION AND DON'T UNDERSTAND WHY CHRYSLER DID NOT RECALL IT.  I CERTAINLY AM NOT THE TYPE TO COMPLAIN FOR THE SAKE OF COMPLAINING.  I BELIEVE I HAVE A LEGITIMATE COMPLAINT AGAINST CHRYSLER AND WOULD LIKE TO PURSUE THIS ISSUE FURTHER. I WOULD LIKE TO BE REIMBURSED FOR THE COST AND ANY GUIDANCE YOU CAN GIVE ME WILL BE MOST APPRECIATED.    *JB",
        "vin": "2C3HE66G5XH"
    }
]