[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2003",
        "dateOfIncident": "04/20/2003",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016498,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW 2002 NISSAN XTERRA VEHICLE IN NOVEMBER 2001. THE VEHICLE WAS PURCHASED AT THE PACIFIC NISSAN DEALERSHIP IN SAN DIEGO, CALIFORNIA. MY WIFE AND CHILDREN WENT ON AN OUTING ON EASTER SUNDAY. WHILE AT LUNCH, 5-15 MINUTES GO BUY AND A PERSON INQUIRES ABOUT A PARKED XTERRA ON FIRE. TO MY WIFE'S HORROR IT WAS OUR XTERRA WITH THE WIDOWS UP AND FLAMES/SMOKE COMING FROM THE DASH/STEERING COLUMN AREA. MY INSURANCE AND THE FIRE MARSHAL DETERMINED THE FIRE APPEARED TO BE AN ELECTRICAL SHORT/ARCHING AND NO OTHER APPARENT SOURCES OF IGNITION WERE PRESENT. THE VEHICLE WAS DETERMINED TO BE A TOTAL LOSS. I HAD THE VEHICLE TOWED TO PACIFIC NISSAN WHERE I PURCHASED IT AND HAVE MAINTAINED THEIR RECOMMENDED ROUTINE SERVICE. THE SERVICE MANAGEMENT QUESTIONED WHY THE VEHICLE WAS BROUGHT OVER TO THE SERVICE DEPARTMENT AND NOT TO THEIR BODY SHOP. I EXPLAINED THE BODY SHOP SENT US OVER TO THE SERVICE DEPARTMENT. HE EXPLAINED TO HE COULD NOT DO ANYTHING AND THAT I WOULD HAVE TO CONTACT MY INSURANCE. I QUESTIONED HIM WHY I HAVE TO SUFFER GOING THROUGH MY INSURANCE WHEN THIS WAS OBVIOUSLY A MANUFACTURER DEFECT AND MY VEHICLE WAS STILL UNDER THE BASIC WARRANTY. KNOWING I WAS NOT GETTING ANYWHERE WITH THIS GUY, I REQUESTED A PHONE NUMBER FOR CUSTOMER SERVICE AND HE EXPLAINED TO ME THAT THEY WOULD ONLY REFER ME BACK TO HIM. I AM CONFUSED ON WHAT I SHOULD DO. SHOULD I PAY THE DEDUCTIBLE AND HOPE MY INSURANCE WILL PAY THE WHOLE AMOUNT OWED ON MY VEHICLE? SHOULD I GET A LAWYER? NO MATTER WHAT I AM STILL OUT A VEHICLE AND HAVE TO, IN ONE WAY OR ANOTHER, PAY FOR SOME OUT OF POCKET EXPENSES. I HAVE CONTACTED THE NISSAN CONSUMER AFFAIRS DEPART. AND THEY EXPLAINED TO ME THEY WOULD HAVE TO LOOK INTO IT. THE CUSTOMER AFFAIRS REP. DID INFORM ME THAT THERE WAS A RECALL ON THEIR AIR BAG MODULE, BUT HE WAS NOT SURE WHAT COULD HAPPEN. I HAVE ALSO, IN THE PAST, TAKEN IN THIS VEHICLE IN TO THE SERVICE DEPARTMENT TO REPLACE A GASKET IN THE AXLE AREA BECAUSE IT WAS DRIPPING FLUID.              *JB",
        "vin": "5N1ED28T02C"
    }
]