[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/24/2003",
        "dateOfIncident": "04/07/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016462,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CONTOUR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 FORD CONTOUR W/ 2 LIT. ENGINE AND FACTORY INSTALLED/AUTHORIZED 8\" BRAKE SYSTEM.  SAFETY HAZARD: POTENTIAL LOSS OF CONTROL DUE TO IMPROPERLY DESIGNED AND/OR FACTORY INSTALLED BRAKES.  TRYING TO STEER THE CAR THROUGH EVASIVE MANEUVERS WHILE APPLYING  BRAKES IS CAUSING THE CAR TO SHUDDER EXCESSIVELY.  ON APX APRIL 7 I WAS IN THE LEFT LANE TRAVELING NORTHBOUND ON I-71 APX 1 MILE NORTH OF I-270.  ACCIDENT APX 1/4 OF A MILE AHEAD FORCED EVERYONE TO SLAM ON BRAKES.  CAR BEGAN TO SHUDDER EXCESSIVELY.  HAD ANOTHER CAR CLOSE ON MY TAIL AND BEGAN TO POSITION MYSELF TO THE LEFT TO BAIL OUT INTO MEDIAN IF NECESSARY AND ANY STEERING ACTION OTHER THAN PERFECTLY STRAIGHT AHEAD CAUSED THE SHUDDERING TO BECOME EVEN MORE EXTREME.  HAVEN'T EXPERIMENTED WITH RADICAL MANEUVERS WHILE APPLYING THE BRAKES BUT I DON'T THINK IT WOULD BE PRETTY.   STARTING IN MARCH, 2003 I HAD NOTICED SLIGHT VIBRATION DRIVING.  TOOK CAR IN TO FIRESTONE FOR ROUTINE BALANCE, ALIGNMENT AND ROTATION.  AFTER WORK DONE THE CAR SHUDDERED NOTICEABLY WHENEVER BRAKES APPLIED, PARTICULARLY SLOWING DOWN THROUGH 45 MPH TO 30 MPH.  RETURNED CAR TO SHOP AND THEY WORKED ON ROTORS AND DRUMS.  THERE WAS NO IMPROVEMENT.  TOOK CAR TO 2ND FIRESTONE AND HAD SENIOR MECHANIC INSPECT.  REPLACED REAR DRUMS WITH NEW BUT PROBLEM PERSISTED, SO HE PUT OLD DRUMS BACK ON AND SUGGESTED TAKING TO FORD DEALER.  TOOK CAR TO KRIEGER FORD.  THEY REPEATED EXPERIMENT WITH NEW DRUMS WITH SAME RESULT.  THEY CALLED FORD HOTLINE AND WERE TOLD THAT THIS WAS A KNOWN PROBLEM WITH 8\" BRAKES.  THE ONLY WAY TO FIX THIS IS TO INSTALL FACTORY AUTHORIZED 9\" BRAKE SYSTEM PER FORD SERVICE BULLETIN 0009007.  IN OTHER WORDS FORD KNOWS IT HAS A PROBLEM WITH THE 8\" BRAKES AS DESIGNED AND INSTALLED BY FORD BUT WANTS ME TO PAY TO ELIMINATE THIS SAFETY HAZARD.  ALSO THIS PROBLEM APPEARS TO HAVE CAUSED ALL OF MY RIMS TO BECOME SOMEWHAT WARPED, WITH ONE EXCESSIVELY WARPED.  TOTAL COST IS $523 FOR PARTS, $323 FOR LABOR, $100 FOR NEW RIM.  *NLM",
        "vin": "3FAFP6636XM"
    }
]