[
    {
        "components": "SUSPENSION,AIR BAGS,TIRES",
        "crash": true,
        "dateComplaintFiled": "04/24/2003",
        "dateOfIncident": "07/06/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016450,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE STEEL PROD. CO.",
                "productMake": "FIRESTONE",
                "productModel": "FIRESTONE",
                "productYear": "2003",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE HAD NOTHING BUT TROUBLE WITH THIS CAR SINCE I HAVE HAD IT.  THE REAR END MAKES LOUD NOISE, I HAVE BROUGHT IT BACK TO THE DEALERSHIP NUMEROUS TIMES, AND THEY ALWAYS TELL ME NOTHING IS WRONG.  IT MAKES A ROARING NOISE IN THE REAR END, AND SOMETHING IS SCRAPPING ON THE TIRE ON THE REAR DRIVER SIDE.  IN JULY, I WAS TRAVELING ON THE HIGHWAY WITH MY 3 KIDS, AND THE TIRE ON THE REAR DRIVER'S SIDE JUST WENT TO PIECES.  WE WERE IN A TERRIBLE ACCIDENT.  WE WENT OFF THE HIGHWAY INTO THE WOODS WHERE THE TREES STOPPED OUR ACCELERATION.  THE AIRBAGS DID NOT COME OUT.  I WAS SO THANKFUL TO BE ALIVE, AND MY KIDS ALSO.  WE SUSTAINED ABOUT 8000 DOLLARS WORTH OF DAMAGE.  THE CAR WAS REPAIRED, AND NOW THE SAME TIRE THAT BLEW OUT, AND WAS REPLACED BY THE REPAIRMAN IS WORN AGAIN.  I AM AFRAID EVERYTIME I DRIVE.  I CAN'T AFFORD ANOTHER CAR, AND NO ONE WANTS TO TAKE IT AS A TRADE-IN BECAUSE OF THE BOTCHED DEAL UPON PURCHASE OF THIS CAR.  THIS IS THE CAR FROM \"HECK\".  NOW MY WARRANTY HAS EXPIRED, AND THE ROARING NOISE IN THE REAR IS GETTING LOUDER AND LOUDER.  I HAVE HAD THE MOST HORRIBLE EXPERIENCE IN MY LIFE WITH THIS CAR.  IT IS A LEMON ON WHEELS, AND THE DEALERSHIP ALWAYS SAYS NOTHING IS WRONG.  I HAVE HAD A CONVERSATION WITH ANOTHER FOCUS OWNER, AND SHE HAS DESCRIBED SOME OF THE SAME PROBLEMS.  I HAVE ALSO HAD CONVERSATIONS WITH MECHANICS AT THE DEALERSHIP, AND THEY SPEAK OF ALL THE FOCUS' THEY SEE AS TROUBLE.  PLEASE HELP.    *NLM",
        "vin": "1FAFP38371W"
    }
]