[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/23/2003",
        "dateOfIncident": "09/20/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10016409,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70XC",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A 1999 VOLVO V70XC AND ENTERING AN INTERSECTION FROM A STOPPED POSITION.  I WAS HIT BY A DODGE DURANGO, WHICH WAS MOVING AT APPROXIMATELY 40 MPH.  THE DURANGO HIT THE VOLVO V70XC AT THE LOCATION OF THE DRIVER SIDE FRONT DOOR.  THE HIT WAS DISPLACED OVER THE ENTIRE DRIVERS DOOR OF THE VOLVO, BOTH \"A\" & \"B\" PILLARS WERE COMPROMISED.  THE VOLVO IS EQUIPPED WITH SIDE IMPACT AIR BAGS AND THE DRIVER SIDE AIR BAG DID NOT DEPLOY, BUT THE FRONT AIR BAG DID, WITH NO HIT TO THE FRONT OF THE VEHICLE.  THE VOLVO'S DRIVER SIDE DOOR WAS CRUSHED AND PUSHED APPROXIMATELY 6 TO 8\" TOWARD THE DRIVER SEAT OF THE VEHICLE.  FURTHERMORE, A TECHNICIAN SPECIALIST REPRESENTING VOLVO NORTH AMERICA, AFTER MUCH DELAY, RECENTLY EXAMINED THE VEHICLE AT A LOCAL VOLVO DEALERSHIP.  AFTERWARDS, VOLVO NORTH AMERICA FORMALLY RESPONDED, IN WRITING, THAT THE 1999 VOLVO V70XC PERFORMED ACCORDING TO DESIGN.  MY COMPLAINT IS THAT I PURCHASED THE VOLVO FOR IT'S PROMOTED SAFETY FEATURES AND I AM DISAPPOINTED THE SIDE AIR BAG DID NOT DEPLOY UNDER THE CIRCUMSTANCES DESCRIBED ABOVE.  I WOULD ALSO LIKE VOLVO TO SUBSTANTIATE THE VALIDITY OF CLAIM AND DESCRIBE, IN DETAIL, UNDER WHAT CIRCUMSTANCES A CONSUMER COULD EXPECT THE AIR BAG TO DEPLOY.  IT WOULD ALSO BE EXPECTED THAT VOLVO INTRODUCE THIS INFORMATION INTO THEIR SALES AND MARKETING PROGRAM SO THAT PROSPECTIVE BUYER WOULD HAVE A BETTER UNDERSTANDING THAT THE PROMOTED SIDE-AIR BAG ONLY RESPONDS UNDER CONDITIONAL CIRCUMSTANCES. *JB",
        "vin": "YV1LZ56D7X2"
    }
]