[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/26/2003",
        "dateOfIncident": "04/12/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016525,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 12, 2003 WHILE DRIVING MY 1997 FORD F 150 SUPER CAB PICKUP VIN [XXX] I NOTICED A NOISE COMING FROM THE REAR OF THE VEHICLE.  AFTER STOPPING TO INVESTIGATE I DISCOVERED THE MIDDLE LEAF OF THE REAR LEAF SPRING HAD BROKEN IN HALF AND THE FORWARD HALF WAS DANGLING IN THE AIR HELD THERE BY THE CLAMP THAT WAS INSTALLED AT THE DEALER (BONNELL MOTORS) WHERE I PURCHASED THE TRUCK AS PART OF NHTSA RECALL 98V16000. UPON FURTHER EXAMINATION I NOTICED THE MIDDLE LEAF ON THE LEFT REAR LEAF SPRING APPEARS TO HAVE SHIFTED AS IT IS NO LONGER EVEN WITH THE OTHER TWO LEAFS.   I ALSO TOOK A CLOSER LOOK AT THE BROKEN MIDDLE LEAF FROM THE RIGHT SIDE AND IT APPEARS THAT A MAJOR FRACTURE EXISTED FOR SOME TIME BEFORE THIS FINALLY DECIDED TO FAIL.   MY FIRST ACTION WAS TO CALL FORD CUSTOMER RELATIONS TO INFORM THEM AND TO FILE A COMPLAINT OF WHAT HAPPENED AND TO SEE IF THIS TYPE PROBLEM HAD BEEN REPORTED AND IF SO WHAT IS GOING TO BE DONE.  I ADVISED THEM OF THE RECALL ISSUED BY NHTSA (98V16000).  HOWEVER I WAS TOLD THAT RECALL WAS ISSUED BY A THIRD PARTY NOT FORD AND THERE HAVEN'T BEEN COMPLAINTS RECEIVED OR RECALLS ISSUED FOR THIS TYPE OF PROBLEM BY FORD.  NEXT I WAS ADVISED BY FORD CUSTOMER RELATIONS TO TAKE THE VEHICLE TO BONNELL MOTORS AND TALK THEM ABOUT THE PROBLEM.  ALTHOUGH THEY WOULDN'T MAKE ANY ASSURANCES FORD WOULD PAY FOR THE REPAIR AS THEY WORK ON A CASE BY CASE BASIS  BETWEEN FORD AND DEALERS TO DETERMINE IF THE SITUATION WARRANTS IT.  UPON MEETING WITH A SERVICE WRITER AT BONNELL MOTORS I WAS ADVISED THEY NEVER SAW THIS TYPE OF PROBLEM BEFORE, IN FACT THEY HAVE NEVER HAD TO ORDER LEAF SPRINGS BEFORE.  THE SERVICE WRITER ADVISED ME THAT FORD'S STATEMENT ON SPRINGS WAS IF THE VEHICLE IS OVERLOADED OR UNDER LOADED CAN RESULT IN LEAF SPRINGS BREAKING. THE SERVICE WRITER LOOKED UP HOW MUCH IT WOULD COST TO REPLACE BOTH RIGHT AND LEFT LEAF SPRINGS.  THAT COST WOULD BE $615.00, AND IF HAD 2,000 FEWER MILES FORD WOULD HAVE PAID ALL BUT A $250.00 DEDUCTIBLE.    *NLM    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2FTDX08WXVC"
    }
]