[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/27/2003",
        "dateOfIncident": "04/26/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF FORD MOTOR CO. TO MAKE HEAD GASKET REPAIRS IN ACCORDANCE WITH SERVICE PROGRAM 00M10. ON 6/27/00 I BROUGHT MY 1995 FORD MUSTANG IN FOR REPAIR IN ACCORDANCE WITH 00M10 AND FRONT COVER LEAKING. THE REPAIRS WERE NOT MADE BY THE DEALERSHIP. I CALLED FORD & GOT NOWHERE. I THEN CALLED THE WORLD OFFICE OF FORD  AND ASKED TO SPEAK WITH [XXX]  DIRECTOR, ISSUER OF THE EXTENDED WARRANTY. I WAS TOLD  THAT \"[XXX].  IS IN THE HEIRACHY AND UNAVAILABLE TO YOU.  I KNOW WHAT YOUR COMPLAINT IS. I HAVE DENIED IT, THE REPAIR WILL NOT BE MADE BY FORD. \"   NOW JUST AS FORD PREDICTED WOULD HAPPEN IN ITS SERVICE PROGRAM LETTER HAS HAPPENED. THE GASKET HAS FAILED AND THE ENGINE IS SEVERELY DAMAGED. THE VEHICLE HAS ONLY 65,000 MILES ON IT. WELL WITHIN THE 100,000 MILES THE SERVICE BULLETIN SAID FORD WOULD COVER. I HAVE CONTACTED FORD AND AS USUAL THEY REFUSE TO PAY FOR THE REPAIRS. THE CAR IS NOW IN SOBH FORD IN DECATUR, GEORGIA, PHONE # 1-404-633-4005.   THEIR MECHANICS SAID THE DAMAGE TO THE ENGINE IS DUE TO THE GASKET FAILURE. THIS IS THE SAME GASKET THAT SHOULD HAVE BEEN REPLACED BY FORD BACK IN JUNE 2000, WHEN I BROUGHT THE CAR IN FOR REPAIR IN ACCORDANCE WITH FORD'S SERVICE PROGRAM 00M10. NOW FORD REFUSES TO PAY FOR THE REPAIR CITING THE 7 YEAR TIME LIMIT. TIME DOES NOT WEAR OUT A CAR USAGE DOES. LIKE I HAVE SAID PREVIOUSLY THERE IS 65,000 MILES ON THE CAR, WELL WITHIN THE 100,000 MILES SET IN THE SERVICE BULLETIN. I BELIEVE THAT THERE SHOULD HAVE BEEN NO TIME LIMIT SET ON THE REPAIRS ONLY MILEAGE.  IN ADDITION THE CAR SHOULD HAVE BEEN FIXED WHEN I BROUGHT IT IN FOR REPAIR BACK ON JUNE 27, 2000. IT WAS WELL WITHIN THE 7 YEAR TIME LIMIT AND IS STILL RIGHT NOW AS I WRITE THIS LETTER WELL WITHIN THE 100,000 MILE LIMIT SET IN THE WARRANTY.  FORD IS RESPONSIBLE IN THIS MATTER. THEY SHOULD HAVE MADE THE REPAIR WHEN I BROUGHT THE CAR TO THEM ON 6/27/2000.  THE VEHICLE IS A 1995 MUSTANG, VIN #[XXX] AND I PURCHASED IT NEW BACK IN APRIL 1995.    *NLM    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FALP4043SF"
    }
]