[
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/27/2003",
        "dateOfIncident": "02/17/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016587,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "626",
                "productYear": "1995",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I OWN A 1995 MAZDA 626.  I RECENTLY BOUGHT IT USED OFF OF ONE PRIVATE OWNER AT AROUND 57K MILES.  AT AROUND 62,700K MILES THE O/D LIGHT STARTED FLASHING AND APPARENT PROBLEMS COULD BE SEEN IN THE SHIFTING.  I TOOK THE CAR TO MAZDA AND THEY TOLD ME I NEEDED TO REPLACE THE TRANSMISSION.  I THEN WENT TO AAMCO AND THEY SAID THEY WOULD REBUILD IT FOR A MORE REASONABLE PRICE THAN MAZDA HAD OFFERED.  IT HAS BEEN 8 MONTHS SINCE I GOT THE TRANSMISSION REBUILT AND LAST NIGHT THE CAR STARTED SMOKING FROM THE TRANSMISSION AND TRANSMISSION FLUID WAS LEAKING EVERYWHERE.  THE CAR TODAY WONT EVEN STAY INTO ONE GEAR IT CONSTANTLY SHIFTS INTO NEUTRAL.  MY COMPLAINT IS THAT THE TRANSMISSION PART ON MAZDAS FROM NOT ONLY 1995 BUT FROM 1994 TO 1997 SHOULD ALL BE RECALLED.  I HAVE BEEN ON A SITE (HTTP://WWW.CARTRACKERS.COM/FORUMS/LIVE/YOUR LEMON/189.HTML)  WHERE THERE ARE SO MANY CASES OF THE SIMILAR TYPE.  FOR EXAMPLE, CALBEARONE WRITES: \"PURCHASED A USED 97 MAZDA 626 LX 4-CYL AUTO TRANS WITH 37K ON IT. I JUST HIT 59K ON IT THIS MONTH.  GUESS WHAT.    TRANSMISSION FAILED. GOT IT REPLACED AT A COST OF $2300.    THESE AREN'T ISOLATED INCIDENTS. I HAVE YET TO READ ABOUT A 626 OWNER THAT'S HAD NO PROBLEMS WITH THEIR TRANSMISSION.\"  THERE ARE AT LEAST 150 COMPLAINTS OF THE SAME PROBLEM ON THAT SITE ALONE!  MAZDA CONTINUES TO IGNORE THE CONTINUAL PRESS BY THE CONSUMER FOR A RECALL BY MAKING A RIDICULOUS STATEMENT THAT THERE ARE NOT ENOUGH COMPLAINTS!  SOMETHING HAS TO BE DONE ABOUT THIS I, MYSELF FEAR THAT I AM ABOUT TO BE ON MY 3RD TRANSMISSION.  PLEASE INVESTIGATE INTO A RECALL ON THIS PART.  THE PART FOR THE TRANSMISSION IS CD4E.  THANK YOU.  TIM R.      *NLM",
        "vin": "1YVGE22C1S5"
    }
]