[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2003",
        "dateOfIncident": "04/23/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016560,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1999 KIA SPORTAGE.  ON 23 APRIL, 2003 I ACCELERATED AFTER STOPPING AT A STOP SIGN AT AN INTERSECTION AND ALL OF A SUDDEN I HEARD A \"CLUNK\" SOUND COMING FROM MY TRANSMISSION, MY VEHICLE STALLED IN THE MIDDLE OF THE INTERSECTION AND THE \"HOLD\" LIGHT AND THE \"CHECK ENGINE\" LIGHT CAME ON.  I WAS ABLE TO GET THE VEHICLE MOVING AGAIN AFTER A FEW SECONDS AND AFTER CHECKING THINGS OUT IN A LOCAL PARKING LOT AND NOT SEEING ANYTHING WRONG UNDER THE HOOD I TOOK IT TO A LOCAL DEALER TO GET FIXED.  THE VEHICLE WAS PUT ON THE DIAGNOSTICS MACHINE AND IT SHOWED THE P0101 CODE.  THE FIX FOR THIS PROBLEM IS AROUND $500 AND MY WARRANTY DOESN'T COVER THIS PROBLEM.  KIA HAS A BULLETIN ON HOW TO FIX THIS PROBLEM, SO THEY ARE AWARE THAT THIS PROBLEM EXISTS.  I CALLED KIA ABOUT THE PROBLEM AND THE PERSON I SPOKE WITH WAS VERY RUDE AND REFUSED TO LISTEN TO MY COMPLAINT AND TOLD ME IT'S MY PROBLEM, THERE'S NOTHING THEY CAN DO AND THIS PROBLEM ISN'T A RECALL BECAUSE IT'S NOT A SAFETY CONCERN.  I DON'T SEE HOW IT'S NOT A SAFETY CONCERN WHEN MY VEHICLE STALLED IN THE MIDDLE OF AN INTERSECTION!  ALSO, $500 IS A LOT OF MONEY ESPECIALLY WHEN WARRANTY'S DON'T COVER IT.  EVERYBODY FROM THE WARRANTY COMPANY AND THE DEALER HAVE ALL TOLD ME THAT THIS SHOULD BE A SAFETY CONCERN, THUS SHOULD BE A RECALL.  THE FOLKS AT THE WARRANTY COMPANY SAID THAT ABOUT 95% OF THE PEOPLE THAT CALL IN WITH THIS TYPE OF VEHICLE ARE CALLING IN ABOUT THIS TYPE OF PROBLEM.  THANK YOU FOR YOUR TIME.   *NLM",
        "vin": "KNDJB7232X5"
    }
]