[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2003",
        "dateOfIncident": "11/04/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016547,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:DODGE GRAND CARAVAN SE, L996       CONTINUAL PROBLEMS WITH ELECTRICAL SYSTEM.  SUDDEN LACK OF POWER WHEN DRIVING ON FREEWAY, NARROWLY AVOIDING SERIOUS ACCIDENTS.  IN RESEARCHING ON VARIOUS WEB SITES, THIS SEEMS TO BE A RECURRING PROBLEM FOR OTHER OWNERS AS WELL.  THE DEALER HAS KEPT THE CAR TWICE SO THEY COULD 'DUPLICATE THE PROBLEM', THEY REPLACE ONE SENSOR OR ANOTHER.  LAST REPLACEMENT SEEMS TO HAVE WORKED BUT STILL DON'T TRUST THE CAR AND WON'T DRIVE ON FREEWAY OR FAR FROM HOME. NOW HAVE TROUBLE STARTING THE CAR, THE DEALER SAID IT'S PROBABLY THE CRANK SENSOR. THEY SAY SINCE I ONLY HAVE 33,000 MILES ON THE CAR, IT SHOULDN'T BE THE STARTER.  ALSO, I HAVE HISTORY OF THE WIPERS TURNING ON AND OFF WHENEVER THEY FEEL LIKE IT. THEY ALSO ESTABLISH THEIR OWN RHYTHM WHEN WORKING.  THE WIPER SENSOR HAS BEEN REPLACED 3 TIMES.  THE COMPUTER NEVER SHOWS AN ERROR CODE SO OBVIOUSLY, IT ISN'T WORKING EITHER.  THE SPEEDOMETER WILL FLOAT AND SOMETIMES WILL SHOW 0 MILES AN HOUR WHEN I'M MOVING.  THEY REPLACED THE SPEEDOMETER SENSOR TWICE AND NOW IT SEEMS TO BE WORKING.    I HAVE SEEN ALL OF THESE COMPLAINTS LISTED ON VARIOUS WEB SITES.  THE DEALER ACTS LIKE I'M CRAZY AND THEY HAVE NEVER HEARD OF THESE PROBLEMS BEFORE.    MY MAIN CONCERN IS THE SUDDEN LACK OF POWER, THE ENGINE JUST TURNS OFF, NO POWER STEERING  EITHER WHEN THIS HAPPENS.  I WONDER HOW MANY ACCIDENTS HAVE BEEN A RESULT OF THIS OBVIOUS DEFECT... AS SOON AS I CAN AFFORD IT, I WILL BE REPLACING THIS VAN WITH A NON-DODGE VEHICLE.   *NLM",
        "vin": "2B4GP44R5TR"
    }
]