[
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/26/2003",
        "dateOfIncident": "04/13/2003",
        "fire": true,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10016521,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "MERCEDES BENZ",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AIRBAG SYSTEMS, INC.",
                "productMake": "AIRBAG",
                "productModel": "SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DEPLOYED AIRBAGS INJURE 2 PA. FIREFIGHTERS  DAVE SOMMERS, STAFF WRITER APRIL 24, 2003   EDGELY, PA. FIREFIGHTERS FACE A LOT OF HAZARDS EVERY TIME THEY SUIT UP.  BUT THEY DON'T EXPECT TO BE STRUCK BY AUTOMOBILE AIRBAGS SUCH AS WHAT OCCURRED ON TUESDAY WHEN EDGELY FIRE COMPANY FIREFIGHTERS RESPONDED TO A CAR FIRE IN THE 3M INDUSTRIAL PARK IN BRISTOL TOWNSHIP. IN FACT, OFFICIALS SAID ANDY TAGGART, 25, WAS KNOCKED OUT WHEN THE DRIVER-SIDE AIRBAG ON A 2002 MERCEDES BENZ INEXPLICABLY DEPLOYED AS THE VETERAN FIREFIGHTER WAS CHECKING THE DASH FOR DAMAGE.  A SECOND FIREFIGHTER, RYAN FLANAGAN, 18, WAS SLIGHTLY INJURED WHEN HE WAS STRUCK IN THE HEAD BY A PARTIALLY DEPLOYING AIRBAG AS HE WAS CHECKING THE RIGHT SIDE OF THE FRONT DASH, OFFICIALS SAID.  BOTH WERE RUSHED TO ST. MARY MEDICAL CENTER IN LANGHORNE WHERE THEY WERE KEPT FOR OBSERVATION AND THEN RELEASED EARLY YESTERDAY.  FLANAGAN SAID EDGELY RESPONDED TO THE FIRE SCENE AROUND 9:38 P.M. AFTER LEARNING THAT A 2002 MERCEDES BENZ WAS ON FIRE IN FRONT OF A&Z AUTOMOTIVE ON MANNING BOULEVARD.  WHEN FIREFIGHTERS ARRIVED, THEY SAW SMOKE COMING FROM UNDER THE DASH AND BEGAN TO GET THE SITUATION UNDER CONTROL. THE DRIVER SIDE AIRBAG BLEW WITH SUCH FORCE IT KNOCKED TAGGART UNCONSCIOUS WHILE THE PASSENGER SIDE BAG, WHICH ONLY PARTIALLY DEPLOYED, STRUCK A GLANCING BLOW OFF THE SIDE OF RYAN FLANAGAN'S HEAD.  BOTH FIREFIGHTERS WERE WEARING HELMETS, WHICH LIKELY SAVED THEM FROM FURTHER INJURY. AEROSTAR, THE SECURITY COMPANY WHICH ELECTRONICALLY MONITORS LUXURY CARS SUCH AS THE MERCEDES, HAD AUTOMATICALLY CALLED 911 WHEN IT DETECTED A FIRE UNDER THE DASHBOARD.  THE AEROSTAR SYSTEM ALSO AUTOMATICALLY UNLOCKED THE CARS DOORS AND CONTACTED THE OWNER, WHO WAS NOT WITH THE VEHICLE AT THE TIME.  THE FIRE INSIDE THE MERCEDES WAS EXTINGUISHED BEFORE IT COULD CAUSE MUCH DAMAGE.   *NLM",
        "vin": ""
    }
]