[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2003",
        "dateOfIncident": "04/03/2003",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016656,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "C CLASS",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOV 6, 2001, I TOOK MY CAR TO THE DEALERSHIP FOR ROUTINE SERVICE. THE CAR HAD 115,633 MILES AND THE 120,000 MILE SERVICE COST $743.39. THE DEALER ADVISED ME THAT THE VEHICLE HAD A DEFECTIVE WIRING HARNESS DUE TO POOR QUALITY INSULATION AND RECOMMENDED THE PART BE REPLACED.  SINCE THE PART WAS A KNOWN DEFECT, THE MANUFACTURER WOULD PAY FOR THE PART IF I WOULD PAY FOR THE LABOR. I THANKED THE DEALER FOR THE INFORMATION AND SAID I WOULD HAVE THE PART REPLACED AT MY NEXT VISIT. MY NEXT VISIT WAS OCTOBER 29,2002 AND THE MILEAGE WAS 136,544. THE WIRING HARNESS WAS NOT GIVING ME PROBLEMS AT THAT POINT, HOWEVER, SINCE IT DID NEED REPLACING, I REQUESTED THE PART TO BE REPLACED UNDER THE STATED AGREEMENT. I WAS TOLD THAT THEIR OFFER HAD BEEN WITHDRAWN AND THE MANUFACTURER WOULD NOW ONLY PAY FOR 25% OF THE PART. I WAS APPEALING THE DECISION WHEN THE PART FAILED ON APRIL 3, 2003. AFTER MUCH NEGOTIATION, NEITHER THE MANUFACTURER OR DEALER WOULD STAND BEHIND THEIR STATEMENT THAT THE PART WOULD BE REPLACED AND THE PART COST $895 PLUS $62.65 TAX AND $225 IN LABOR FOR A TOTAL OF $1,182.65.  I HAVE SINCE LEARNED THROUGH INTERNET RESEARCH THAT THIS IS A SERIOUS PROBLEM WITH THIS MODEL AND MANY OWNERS HAVE REPORTED PROBLEMS INCLUDING THREE ON THIS WEBSITE. THIS ISSUE IS A KNOWN MANUFACTURER'S DEFECT AND MAY CAUSE SERIOUS SAFETY ISSUES SHOULD THE ENGINE FAIL SUDDENLY BY THE HARNESS SHORTING OUT DUE TO THE DEFECTIVE INSULATION.  PLEASE SEE ODI 10016302, 10014643, AND 552493. I DID NOT CHECK YOUR SITE FOR OTHER YEARS OF THIS MODEL.  THE MANUFACTURER SHOULD BE HELD RESPONSIBLE FOR REPLACING ALL THESE DEFECTIVE HARNESSES, REGARDLESS OF AGE OR MILEAGE.    *NLM",
        "vin": "WDBHA28E2SF"
    }
]