[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "03/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016846,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1 MAY 03   UPDATE FROM LETTER BELOW  (SENT KIA ADDRESSES-SIDE NOTE: WITHOUT \"OUTLOOK\" YOU CANNOT CONTACT KIA SUPPORT VIA E-MAIL, LETTER CUT TO NOTHING TO MEET WORD REQUIREMENT)   KIA CUSTOMER AFFAIRS (STEVE LAREZ 800 225-3193) CONTACTED ME SAID THEY WOULD LOOK INTO IT  (21 APR 03).  STEVE CALLS ME BACK (22 APR 03) TO INFORM ME THAT HE HAS TALKED TO THE DISTINCT REP AND THAT THE BEST THEY WOULD DO WAS OFFER A WINDSHIELD AT WHOLESALE COST.    TODAY, I WRITE TO YOU FOLKS AFTER SEEING A SIMILAR COMPLIANT IN YOUR DATABASE (FILED 30 AUG 2001), NOTE OTHER SIMILAR 2002 SEDONA WINDSHIELD COMPLAINTS MAY BE FOUND AT   WWW.CARSURVEY.ORG    I AM VERY CONCERNED ABOUT REPLACING THE WINDSHIELD (AGAIN!) AND HAVING THE SAME THING HAPPEN (AGAIN!).    THREE WINDSHIELDS CRACKED IN 18 MONTHS IS NOT REASONABLE.    OR AT LEAST NOT TO THE PRUDENT MAN.    KIA FOLKS: 16 APR 03     I REALLY NEED SOME HELP.    BOTTOMLINE:  I HAVE HAD 2002 KIA SEDONA FOR LESS THAN 18 MONTHS THE WINDSHIELD HAS CRACKED FOR THE THIRD TIME     * SEPT 01 (LATE) - BOUGHT THE SEDONA.   * OCT 01 (~ MID) - WINDSHIELD #1 CRACKED. NO PARTS IN THE SYSTEM FOR A 2002; KIA DID NOT COVER THE REPLACEMENT   * DEC 01 - WINDSHIELD, #2 INSTALLED    * FEB 02 - I-65 OUTSIDE OF LOUISVILLE, WINDSHIELD #2 CRACKS.   * APR 02 '' KIA BILL PENNY GOODWILLS  WINDSHIELD #3   * MAR 03 - I-565 TOWARDS DECATUR  WINDSHIELD #3 CRACKS   ON ALL THE WINDSHIELDS THE CRACKS STARTED IN THE BLACK AREA NEAR RUBBER SEAM.   SOME POINTS:     * OUR SEDONA IS A GREAT CAR, EXCEPT THE WINDSHIELD    * THE INTERNET HAS OTHER 02 SEDONAS WITH THE SAME WINDSHIELD PROBLEMS    * THREE WINDSHIELDS CRACKING INSIDE OF 18 MONTHS IS EXCESSIVE         - OUR SEDONA IS OUR FOURTH VAN OVER 15 YEARS. THE OTHER VANS HAD ONE CRACKED WINDSHIELD IN 14 YEARS.  A COUPLE OF POTENTIAL PROBLEMS:        - MOUNTING PROCEDURES/TECHNIQUES AND OR THE DESIGN        - WINDSHIELD ROBUSTNESS (NOT DESIGNED TO ACCEPTED INDUSTRY STANDARD)        - MY OTHER KIA''S (2) HAVE NO WINDSHIELD PROBLEMS",
        "vin": ""
    }
]