[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "04/24/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016812,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY SENT THIS LETTER TO CHRYSLER IN AN E-MAIL. I AM CONTACTING THIS AGENCY TO SEE IF I CAN GET SOME JUSTICE.  MY VEHICLE WAS UNSAFE.  HOWEVER, I STILL DO NOT FEEL THAT IT IS PERFORMING CORRECTLY.  I WOULD LIKE ASSISTANCE AND DIRECTION.  THANKS.   RECENTLY MY 2001 NEEDED THE RACK AND PINION, LOWER AND UPPER CONTROL ARM AND COMPLETE FRONT SUSPENSION REPAIR AT ANTWERPEN DODGE IN RANDALLSTOWN, MD.  THEY REALLY GAVE ME A PROBLEM WITH THE TIME TO COMPLETE THE JOB AND THEY KEPT SAYING THAT THE RACK AND PIN WAS A \"STAR PART\".   I THEN TOOK IT BACK TO THE DEALER, AND THEY COULD NOT BE DEFINITIVE. HOWEVER, THERE WAS NO CHARGE, THEREFORE NO WORK ORDER.  ALL I WANT IS A SMOOTH RIDING VEHICLE THAT'S NOT SHAKING RATTLING AND ROLLING DOWN THE STREET.  I DRIVE 50 MILES ONE WAY TO WORK AND MOST OF THE DRIVE IS HIGHWAY DRIVING.  YOU CAN FEEL EVERY LITTLE BUMP.I FOUND THIS ARTICLE IN USA TODAY.  IT READS:   \"APRIL 25, 2001 '' THE CHRYSLER ARM OF DAIMLERCHRYSLER ANNOUNCED WEDNESDAY A VOLUNTARY RECALL OF SOME NEW MINIVANS, CITING A POSSIBLE FRONT SUSPENSION PROBLEM. NEARLY 11,000 CUSTOMERS ARE AFFECTED BY THE RECALL OF THE 2001 CHRYSLER TOWN & COUNTRY, CHRYSLER VOYAGER, DODGE CARAVAN AND DODGE GRAND CARAVAN MINIVANS BUILT BETWEEN MARCH 22 AND APRIL 21 OF 2001. OWNERS OF RECALLED VEHICLES ARE URGED NOT TO DRIVE THEM. THE AUTOMAKER SAID A BOLT ON THE LOWER CONTROL ARM OF THE FRONT SUSPENSION CAN BREAK, RESULTING IN A LOSS OF VEHICLE CONTROL.\"  NO ONE MENTIONED THAT THIS WAS A RECALL ITEM.  SO I AM STILL TRYING TO FIX THIS SHAKE RATTLE AND ROLL PROBLEM.  THIS 2001 SUSPENSION IS TRULY JUNK. NOW THE BOTTOM-LINE OR SHOULD I SAY \" BOTTOM OUT\" IS WHAT CAN I DO TO GET A SMOOTH RIDE? I HAVE AN EXTENDED WARRANTY, BUT THE MECHANICS NEED TO KNOW WHAT TO DO AND BE RIGHT.   THIS COULD BE A FLUKE IN THE ASSEMBLY LINE, BUT I DOUBT IT.  THERE ARE TOO MANY OTHER OWNERS WITH THE SAME COMPLAINT.  IF YOU HAVE ANY INFLUENCE WITH ANTWERPEN DODGE IN RANDALLSTOWN, MD, PLEASE HELP ME TO SOLVE THIS PUZZLE.",
        "vin": "2B8GP44301R"
    }
]