[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "04/25/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016882,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND AM",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 PONTIAC GRAND AM. I PURCHASED MY VEHICLE IN DECEMBER OF 2000 OR JANUARY OF 2001. NEVERTHELESS, I HAVE 26K MILES ON MY CAR AND I HAVE BROUGHT IT IN TWICE FOR MAJOR ENGINE REPAIR. THE FIRST TIME I BROUGHT IT IN WAS APPROXIMATELY 8-9 MONTHS AGO WHEN MY ENGINE WAS KNOCKING LOUDLY AND GRINDING DURING ACCELERATION. IN ADDITION IT WOULD NOT ACCELERATE OR KICK INTO OVERDRIVE IT JUST GRINDED. I BROUGHT MY CAR INTO GAY PONTIAC IN DICKINSON TX WHERE IT WAS PURCHASED. THEY WERE NOT AUTHORIZED BY GMC TO REPLACE MY ENGINE BUT TO REPLACE CERTAIN PORTIONS OF MY ENGINE I.E. RODS AND MAIN BEARING. LAST FRIDAY ON APRIL 25TH MY ENGINE BEGAN TO DO THE EXACT SAME THING AS I WAS DRIVING HOME. I BEGAN TO ACCELERATE AND THE CAR STARTED GRINDING EVERY TIME THE RPM METER REACHED 2200 RPM. I TEND TO ACCELERATE FAST WHEN I DRIVE HOWEVER I DO NOT CONSIDER THIS GROUNDS FOR THE DAMAGE THAT APPEARS TO BE HAPPENING TO MY VEHICLE. I HAVE NOT ADDED ANY COMPONENTS TO MY VEHICLE SINCE PURCHASING IT.  I TOOK MY VEHICLE BACK TO THE SAME DEALERSHIP, AND THIS TIME THEY CALLED OUT A GMC REP WHO SUGGESTED AGAIN THAT ONLY CERTAIN PARTS OF MY ENGINE ARE REPLACED. I AM IN THE PROCESS OF TRYING TO GET THIS CHANGED.  I BELIEVE AT THIS POINT PARTS THAT WERE NOT ORIGINALLY REPAIRED OR REPLACED HAVE SINCE SUSTAINED ADDITIONAL DAMAGE AND I BELIEVE THAT THERE IS A PROBLEM OUTSIDE OF MY ENGINE THAT IS CALLING FOR THE ENGINE TO SUSTAIN THIS DAMAGE. I AM VERY CONCERNED THAT MY VEHICLE IS A LEMON AND THE FAILURE OF GMC TO INVESTIGATE AND REPAIR MY VEHICLE WILL EVENTUALLY CAUSE ME ADDITIONAL HARM. I WOULD HATE TO BE IN RUSH HOUR TRAFFIC AND HAVE AN ENGINE FAILURE OR BE UNABLE TO ACCELERATE TO THE FLOW OF TRAFFIC.",
        "vin": "1G2NE12T31M"
    }
]