[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "04/24/2003",
        "fire": false,
        "manufacturer": "ROCKWOOD INCORPORATED",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016851,
        "products": [
            {
                "manufacturer": "ROCKWOOD INCORPORATED",
                "productMake": "ROCKWOOD",
                "productModel": "WILDWOOD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "CARLISLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON APRIL 24, 2003 WE WERE PULLING OUR ROCKWOOD TRAVEL TRAILER FROM ATLANTA TO SOUTH GEORGIA.  AFTER ABOUT 100 MILES, THE LEFT FRONT TRAILER TIRE BLEW OUT (SIDEWALL BLOWOUT AND SUBSEQUENT DELAMINATION).  I CHANGED THE TIRE, OBTAINED A NEW SPARE AND WENT ON.  ON APRIL 27, 2003 ABOUT 150 MILES AFTER THE FIRST BLOW OUT, THE LEFT REAR TIRE BLEW OUT (SAME FAILURE AS BEFORE).  AGAIN, CHANGED THE TIRE, BOUGHT TWO NEW TIRES.  ABOUT 70 MILES FURTHER DOWN THE ROAD, THE RIGHT REAR TIRE BLEW OUT (AGAIN, SAME FAILURE MODE).  THE LAST TWO FAILURES CAUSED SIGNIFICANT DAMAGE TO THE TRAILER STRUCTURE.    ALL TIRES WERE ORIGINAL EQUIPMENT WITH THE TRAILER WHEN PURCHASED IN MARCH 2000.  THEY HAD APPROXIMATELY 6000 TO 8000 MILES ON THEM (MAYBE LESS).  KEPT THEM COVERED.  RELIGOUSLY CHECKED THE AIR PRESSURE (50 PSI), KEPT THE SPEED NO MORE THAN 60 MPH AND VERIFIED THAT THE TRAILER WAS NOT OVERLOADED.  THE TIRES WERE CARLISLE ST175/80R13.  CARLISLE INFORMED ME THAT THESE WERE MADE BY GOODYEAR.  GOODYEAR INFORMS ME THEY WERE MADE BY DUNLOP WHICH WAS BOUGHT BY GOODYEAR.  OF COURSE CARLISLE AND GOODYEAR STATE THAT THEY WILL NOT HELP WITH THE EXPENSES SINCE THE TIRES WERE OUT OF WARRANTY AND I DID NOT KNOW TO KEEP THE FAILED TIRES.",
        "vin": ""
    }
]