[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "05/04/2003",
        "dateOfIncident": "01/06/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017000,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "STRATUS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 DODGE STRATUS SXT SEDAN 2.4L. WHEN I BOUGHT THE CAR I HAPPENED TO NOTICE THAT THERE WAS RUSTING ON THE AXLES & BRAKES TO THE FRONT END OF THE CAR. THE SECOND DAY I HAD THE CAR IT COMPLETELY SHUT ITSELF DOWN AND WOULDN'T START, IMMEDIATELY MY CAR DEALERSHIP PICKED UP THE CAR AND SAID IT WAS BECAUSE THE BATTERY \"DIED\". I DID NOT TAKE NOTE OF THE RUSTING BECAUSE THE DEALERSHIP SAID \"ALL DODGE CARS ARE RUSTED...*ALL*\"A MONTH LATER MY CAR STARTED MAKING NOISES TO THE FRONT END OF THE CAR SLIGHTLY, THEN IT WAS PROGRESSING TOWARDS JANUARY WITH VIBRATION OF THE CAR PAST 50 MPH, I DECIDED TO CALL THE DEALERSHIP WHEN IT BECAME OUT OF HAND AND THEY WERE CLOSED, THEN THE MONDAY THE CAR SHUT ITSELF DOWN AND THE STEERING WHEEL LOCKED INTO PLACE WHILE I WAS TURNING A CORNER AND IT HIT PROBABLY A 5 INCH HIGH CURB..OF COURSE THE \"RUSTED\" RIGHT FRONT END \"AXLE\", CONTROL BAR & GEAR CONTROLS BROKE OFF. FOUND IT INTERESTING THAT ALL OF THESE INCIDENTS I HAD TO PAY OUT OF POCKET FOR BECAUSE THIS DEALERSHIP SAYS IN OTHER WORDS THAT WE'RE LYING AND IT ISN'T THEIR FAULT NOR WAS IT A MECHANICAL DEFECT. ALSO I HAVE NOTED THAT MY DOORS DOESN'T CLOSE PROPERLY & MY WINDOWS SLIP OUT OF PLACE. AFTER THE INCIDENT OF MY CAR LOCKING UP AND MY AXLE BEING BROKEN I HAD TO TAKE OUT OF POCKET ONCE AGAIN $1,800 AND THEY FIXED IT..BUT THERE WAS STILL PROBLEMS..THE VIBRATION WAS STILL THERE AND NOW THERE WAS A KNOCKING/CRACKING SOUND TO THE FRONT & REAR ENDS OF THE CAR, AND I MEAN IT WAS LOUD..TOOK THE CAR BACK FOR THE OIL CHANGE AND THEY SAID THEY HEARD NOTHING NOR WAS THERE A VIBRATION!.A MONTH LATER I TOOK THE CAR BACK I SAID THIS WAS RIDICULOUS THAT THIS NOISE IS STILL THERE AND YES OF COURSE WHEN YOU HAVE A HUGE BRAWL AND FIGHT THEY DO FIND THE SO CALLED \"PROBLEM\"....THE PINS TO HOLD MY BRAKE PADS IN PLACE WEREN'T EVEN THERE!...AND VIBRATION AGAIN? NONE TO BE FOUND...YES I AM THE DRIVER AND THE VIBRATION IS STILL THERE.*JB",
        "vin": "1B3EL46X93N"
    }
]