[
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/02/2003",
        "dateOfIncident": "04/22/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016925,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "CATERA",
                "productYear": "1997",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I PURCHASED A 1997 CADILLAC CATERA ON JAN 31, 2001 FROM UNITED AUTOMAX IN MEMPHIS, TN.  FROM THE DATE OF PURCHASE I HAVE HAD EXTENSIVE PROBLEMS WITH THIS CAR.  BEGINNING WITH ELECTRICAL PROBLEMS WITH THE LIGHTS. SINCE THEN I HAVE HAD PROBLEMS WITH TIRES WEARING OUT PREMATURELY, HEATER CORE REPLACED, ROTORS REPLACED AND WEARING OUT AGAIN WITHIN A YEAR'S TIME.  FUSES HAVE BLOWN, RADIATOR FAN ALONG WITH OTHER PROBLEMS.  NUMEROUS RECALLS AND ETC.  ON APRIL 14, 2003 I TOOK MY CAR TO BUD DAVIS CADILLAC IN MEMPHIS AND REPORTED THAT I COULD SMELL OIL BURNING.  THEY STATED THAT I NEEDED VALVE  COVERS RESEALED AND TO REPLACE REAR MAIN SEAL.  (THE WORK WAS DONE THRU MY EXTENDED WARRANTY COMPANY).  I RETURNED TO THE DEALER AND TOLD THEM ABOUT NOISE COMING FROM THE RIGHT FRONT END.  THEY IN RETURN REPLACED RIGHT AND LEFT LOWER CONTROL ARM.  WHEN I WENT TO PICK UP THE CAR FROM DEALER I NOTICED THAT THE NOISE STILL EXISTED AND INFORMED SERVICE AGENT BEFORE I LEFT THE DEALER'S LOT.  THEY INFORMED ME THAT IT WAS A BAD STRUT LINK TO WHICH MY EXTENDED WARRANTY DID NOT COVER.  AFTER DISCUSSING THE MATTER WITH ANOTHER MACHANIC (NOT DEALER), HE STATED THAT THE NAME OF THE PART WAS A STABILIZER NOT STRUT. AND NOT ONLY DID THE NOISE EXIST IN THE FRONT END, BUT THERE WAS A HISSING SOUND COMING FROM UNDER THE HOOD AND THAT THE OIL LIGHT BEGAN TO COME ON AND STAY ON. THE MECHANIC SUGGESTED THAT THE HISSING NOISE CAME FROM A PART THAT WAS PROBABLY DAMAGED BY BUD DAVIS CADILLAC WHEN REPAIRING VALVES AND SEALS. I THEN RETURNED TO THE DEALER.  I INFORMED THE  DEALER THAT MY WARRANTY COMPANY DID COVER THE STABILIZER LINKAGE AND THEY STATED THAT THE SERVICE AGENT USED THE WRONG TERMINOLOGY.  THEY AGREED TO FIX IT AND DID, BUT REFUSED TO CHECK THE SOURCE OF THE HISSING SOUND WITHOUT ME PAYING FOR IT.   IT SEEMS THAT EACH WEEK OR MONTH THERE ARE EXTENSIVE REPAIRS NEEDED.       *TT",
        "vin": "W06VR52R6VR"
    }
]