[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/02/2003",
        "dateOfIncident": "11/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016933,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "S10",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A CHEVY TRUCK BACK IN NOVEMBER OF 2002 FROM THE J.D. BYRIDER STORE IN ST. PETERSBURG, FL AND HAVE HAD NOTHING BUT PROBLEMS WITH THE TRUCK.   THE RADIATOR WAS ALWAYS RUNNING HOT AND FOUND THAT THE WATER WAS SO RUSTY THAT THE WHOLE RADIATOR WAS IN NEED OF REPAIR AS WELL AS THE WATER PUMP.  I TRIED TO EXCHANGE THE TRUCK FOR SOMETHING BETTER, BUT THE STAFF FROM THE ST. PETERSBURG, FL STORE WOULD NOT DO IT. CLAIMING I WAS LOCKED INTO A CONTRACT WITH THEM THAT COULD NOT BE BROKEN.    I EXPLAINED THAT THE TRUCK HAD BEEN APPARENTLY NEGLECTED BEFORE I WAS SUCKERED INTO GETTING IT AND THAT I WAS NOT HAPPY.   I STILL CONTINUED TO PAY PAYMENTS ON TIME EVEN THOUGH I HAD TO PAY FOR OTHER REPAIRS MYSELF.   I COULD NOT AFFORD TO PAY RIGHT AWAY $500.00 DOLLARS FOR A RADIATOR AND $400.00 DOLLARS TO HAVE A NEW WATER PUMP INSTALLED SO I MADE DO UNTIL I COULD.    THEN, I WAS RECENTLY LAYED OFF FROM MY JOB AND THE D.J. BUSINESS HAD ALSO BEEN SLOW FOR MY ROOMMATE/CO-PARTNER AND ASKED IF THE ST. PETESBURG STORE WOULD WORK WITH US FOR A COUPLE OF WEEKS UNTIL WE GOT THE MONEY TOGETHER AND WHILE I SEEK ANOTHER EMPLOYER.   AT FIRST THE MANAGER OVER THE FINANCE DEPARTMENT SAID HE WOULD WORK WITH US SINCE THE LAST THING THEY LIKE TO DO IS TO REPOSSESS OUR TRUCK, THEN THE NEXT DAY I RECEIVED A NASTY MESSAGE FROM A STAFF MEMBER OF THE ST. PETESBURG, FL STORE BY THE NAME OF BRETT BOWEN WHO SAID THAT THE TRUCK WAS GOING TO BE REPOSESSED BECAUSE WE HAD MOVED WITHOUT LETTING THEM KNOW FIRST.   I E-MAILED BRETT BACK SAYING THAT THIS WAS WRONG AND THAT I HAD ALREADY MADE ARRANGEMENTS WITH HIS BOSS AND THAT I WOULD PREFER TALKING TO HIS BOSS FOR NOW ON.   NO ONE WOULD CONTACT ME BACK, SO I CONTACTED THE MAIN HEADQUARTERS ONLINE AND LET THEM KNOW MY PROBLEM WITH ST. PETERSBURG.   NO ONE EVEN CONTACTED ME BACK FROM THERE, SO I SENT ANOTHER ON-LINE MESSAGE AND WAS AGAIN IGNORED.   THEN ON 04/30/03 I FOUND MY TRUCK MISSING, WITHOUT ANY NOTICE.    *TT",
        "vin": ""
    }
]