[
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,POWER TRAIN,VISIBILITY,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/05/2003",
        "dateOfIncident": "11/24/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "BLAZER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2000 BLAZER 11/24/00. MANY PROBLEMS SINCE. TRANSMISSION COOLER LINE, WARRANTY REPAIR. OIL COOLER LINES, UPPER AND LOWER, WARRANTY REPAIR. WARRANTY EXPIRED AND THEY ARE LEAKING STILL. PROBLEM NEVER REALLY FIXED. IDLER ARM, WARRANTY REPAIR. DRIVER SIDE RECLINE HANDLE DRIVER SEAT FELL BACK WOULD NOT RETURN TO UPRIGHT POSITION, WARRANTY REPAIR. BOTH FRONT WHEEL BEARINGS AND ROTORS, WARRANTY REPAIR. FROM DAY 1 NUMEROUS RATTLES AND SQUEAKS. DOOR PANELS RATTLE CONSTANTLY. PASSENGER SEAT RATTLES AND SQUEAKS. WINDSHIELD WIPER ENTIRE ARM CAME OFF, REPAIRED AT MY EXPENSE. OUT OF WARRANTY, AT 41,699 MILES BUT NOT EVEN (2) YEARS OLD, TRANSMISSION HAD TO BE REBUILT AT MY EXPENSE. CHEVY CUSTOMER SERVICE IS A JOKE! COST OF TRANSMISSION $2,442 AND THE COST OF A TWO WEEK CAR RENTAL. EVEN WHEN TRANSMISSION LINE HAD TO BE REPAIRED WE HAD TO RENT A CAR AT OUR EXPENSE BECAUSE LOCAL DEALER REFUSED TO SUPPLY A LOANER. AGAIN CHEVY CUSTOMER SERVICE A JOKE! CALLED CHEVY HOT LINE/HELP LINE AND WAS JUST GIVEN THE RUN AROUND. I WILL NEVER BUY CHEVY AMERICAN MADE AUTO AGAIN. WHY IS IT YOU CAN BUY ANY ITEM AT MOST DEPARTMENT STORES AND TAKE IT BACK AND RECEIVE SATISFACTION, BUT SPEND $25,000+  FOR A CHEVY PRODUCT AND YOU ARE SCREWED WHEN YOU SIMPLY WANT THE RELIABILITY AND SERVICE YOU WERE PROMISED. I TELL EVERY PERSON I MEET NOT TO BUY A CHEVY. SOLID LIKE A ROCK? WHAT A LIE!         *JB",
        "vin": "1GNDT13W8Y2"
    }
]