[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/05/2003",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017040,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "HEARD A NOISE COMING FROM THE REAR OF THE CAR TOOK IT INTO THE SHOP AND WAS TOLD THAT IT WAS THE REAR DIFFERENTIAL, AND I WAS ALSO INFORMED THAT MY TRANSMISSION WAS SLIPPING IN 1ST & 2ND GEAR. I HAD THE DIFFERENTIAL REPAIRED AND THE TRANSMISSION SERVICED.  WE GOT SNOW THIS YEAR WHERE YOU WOULD NEED THE 4 WHEEL DRIVE, WELL BEING I NEVER HAD THE NEED TO USE THE 4 WHEEL DRIVE MODE I WAS SURPRISED TO FIND OUT THAT MINE DIDN'T WORK. TOOK IT INTO THE SHOP AND WAS TOLD THAT THE TRANSFER CASING AND TRANSMISSION NEED TO BE REPLACED. SO I TOOK IT TO THE  DEALER I BOUGHT THE JEEP FROM.  I LET THEM REPAIR MY TRANSFER CASING AND WAS TOLD BECAUSE I DIDN'T HAVE THE EXACT SAME TIRES ON THE VEHICLE THAT IS WHAT CAUSED THE TRANSFER CASING TO FAIL.  THE TIRES WERE THE SAME SIZE ON THE FRONT AND REAR JUST DIFFERENT BRANDS.  THEY TOLD ME THAT I DIDN'T HAVE A PROBLEM WITH THE TRANSMISSION.  I THEN PICKED THE JEEP UP AND THE ROARING SOUND CAME BACK SO I TOOK IT TO THE DEALER TO SEE WHAT THEY THOUGHT THE NOISE WAS I WAS TOLD AT THAT TIME THAT MY FRONT DIFFERENTIAL WAS BAD AND NEEDED TO BE REPAIRED AND THAT THE REAR DIFFERENTIAL WAS ALSO BAD, BUT BEING I HAD THAT WORK DONE AT A INDEPENDENT SHOP I HAD TO TAKE IT BACK TO THEM TO FIX THE REAR AND THEN TOOK THE JEEP BACK TO THE DEALER TO HAVE THEM DO THE WORK ON THE FRONT.  I AM IN THE PROCESS OF TAKING THE JEEP BACK TO THE DEALERSHIP BECAUSE MY JEEP IS NOW PULLING TO THE RIGHT. I WAS ABLE TO DRIVE MY JEEP FOR A WEEK.  I REALLY HAVE NOT HAD MY JEEP SINCE JANUARY  I REALLY THINK THAT DAIMLER CHRYSLER KNOWS THERE IS A PROBLEM WITH THE 1998 JEEP GRAND CHEROKEE AND I HOPE THAT SOMETHING WILL BE DONE ABOUT. *JB",
        "vin": "1J4GZ58S2WC"
    }
]