[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "04/26/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018340,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 FORD FOCUS WITH 45,000 MILES ON IT HAD BEEN EXPERIENCING DRAMATIC HESITATION PROBLEMS AROUND HIGHWAY EXIT CURVES/CORNERS. THIS HAPPENED ABOUT 4 SEPARATE TIMES, WITH IT FINALLY JUST STALLING AND BREAKING DOWN THE LAST TIME. THANK GOD THE CARS BEHIND ME WERE NOT SPEEDING AND DIDN'T CRASH INTO MY REAR END. I WAS ABLE TO ROLL SAFELY A FEW FEET AWAY TO A SMALL SHOULDER AREA. I TURNED THE CAR OFF AND WAITED A SECOND BEFORE STARTING IT AGAIN. IT STARTED RIGHT UP WITH NO PROBLEM.  ALSO A FEW WEEKS EARLIER THE CAR WOULDN'T START ONE MORNING. I HAD IT TOWED TO MY LOCAL FORD DEALER, WHO SAID IT SIMPLY NEEDED TRANSMISSION FLUID, THEY ADDED IT AND IT STARTED UP.  BUT IN THE NEXT TWO WEEKS IS WHEN IT BEGAN HESITATING ON CURVES AND FEELING LIKE IT WAS GOING TO CUT OFF.  BUT IT HAD HAPPENED ONCE PRIOR TO THAT, IT HESITATED AFTER THE CURVE AND WOULDN'T ACCELERATE EVEN THOUGH I WAS STEPPING ON THE GAS. WHEN I TOOK IT BACK TO FORD, THEY DID A FULL INSPECTION AND TOLD ME I NEEDED A NEW FUEL DELIVERY MODULE, A NEW FUEL FILTER AND INJECTION CLEANING (THE LATTER 2 BEING REGULAR MAINTENANCE).  BUT THIS FUEL DELIVERY MODULE WAS MAJOR. AND MY EXTENDED WARRANTY (NOT THROUGH FORD, BUT WITH GM MAJOR GUARD) ALMOST DIDN'T COVER IT, BUT DECIDED TO COVER MOST OF IT.  THE FORD DEALER TOLD ME THAT THE CAUSE FOR THE FUEL DELIVERY MODULE GOING BAD WAS JUST BASIC WEAR AND TEAR OVER TIME. I FIND THIS HARD TO BELIEVE, ESPECIALLY AFTER READING OTHER CUSTOMER'S COMPLAINTS OF THE SAME PROBLEM ON THIS WEB SITE AND AN ARTICLE ON WWW.CARTALKS.CARS.COM. PLEASE RECOMMEND TO FORD TO ADDRESS THIS PROBLEM BEFORE SOMEONE IS SERIOUSLY INJURED.   *JB",
        "vin": ""
    }
]