[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "02/25/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018329,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WILDERNESS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "HI,  ON FEBRUARY 25, 2003 WHILE DRIVING ON THE HIGHWAY MY LEFT REAR FIRESTONE TIRE ON MY SUBARU OUTBACK BLEW UP.  I WAS VERY LUCKY THAT NO ONE WAS NEXT TO MY CAR AT THE TIME THE TIRE BLEW AND I WAS ABLE TO PULL TO THE SIDE.  THE TIRE WAS FIRESTONE WILDERNESS 225 60-16  H-RATED.  PART # 074772.  THE CAR IS A SUBARU 2001 AND IT HAD ONLY 21000 MILES WHEN THE TIRE BLEW.  I CONTACTED FIRESTONE CUSTOMER SERVICE DEPT. AND THE FIRESTONE SHOP ON DEMPSTER IN SKOKIE, ILLINOIS AND WAS INFORMED THAT I WILL HAVE TO PURCHASE 4 NEW TIRES BECAUSE IF I REPLACE ONLY THE TIRE THAT BLEW, IT WILL DAMAGE MY TRANSMISSION.  I ASKED WHY THE TIRE BLEW WITH ONLY 21,000 MILES ON IT AND THEY COULD NOT EXPLAIN BUT SAID THEY WILL SEND IT BACK TO THEIR FACTORY FOR INVESTIGATION.  THEY WERE WILLING TO PRORATE ONLY THE TIRE THAT BLEW, NOT ALL 4 NEW TIRES.  I HAD TO PAY CLOSE TO $400 FOR 4 NEW TIRES.    I CONTACTED YOUR OFFICE BY PHONE THE SAME WEEK AND EXPLAINED MY PROBLEM TO A LADY IN YOUR OFFICE.  I WAS TOLD THAT I WILL GET A FORM IN THE MAIL TO BE FILLED OUT BY ME BUT I DID NOT GET IT SO I DECIDED TO CONTACT YOU BY E-MAIL.  A FEW WEEKS LATER, WHEN I CHANGED MY OIL AT THE SUBARU DEALER ON GRAND AVENUE IN NAPERVILLE ILLINOIS, AN EMPLOYEE IN THE SERVICE DEPARTMENT STATED THAT HE WAS AWARE OF ANOTHER INCIDENT ABOUT A MONTH EARLIER THAT A LADY CAME INTO THE SHOP WITH A SIMILAR BLOW OUT ON THE SAME FIRESTONE TYPE WILDERNESS TIRE AND SHE HAD TO BUY 4 TIRES ALSO.  I AM CONCERNED THAT THERE MIGHT BE MORE SUCH INSTANCES AND SOMEONE NEEDS TO INVESTIGATE THIS ISSUE BEFORE SOMEONE GETS KILLED.     THE TIRE SEPARATED 360 DEGREES ON ITS SIDE AROUND WHERE THE WHITE CIRCLE IS ON THE SIDEWALL.  I TOOK A NUMBER OF DIGITAL PICTURES OF THE TIRE THAT BLEW BEFORE FIRESTONE TOOK IT.  I WOULD LIKE TO SEND THEM TO YOU EITHER BY E-MAIL OR I CAN MAKE PRINTS.   *JB  PLEASE ADVISE.  ZELIG",
        "vin": ""
    }
]