[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2003",
        "dateOfIncident": "05/06/2003",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018417,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "C230",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1998 MERCEDES C230 WITH A DEFECTIVE TRANSMISSION.  FOR THE PAST 3 MONTHS I'VE BEEN TRYING TO GET THE MERCEDES REGIONAL MANAGER (MACINTOSH) TO ADDRESS THE PROBLEM, WHICH HAS BEEN PRESENT SINCE THE VEHICLE WAS NEW, BUT ONLY BECAME DANGEROUS IN THE LAST SEVERAL MONTHS.  MACINTOSH IS AWARE OF THE PROBLEM AND ITS SERIOUS NATURE, BUT REFUSES TO RETURN MY CALLS.  I'VE BEEN TOLD BY THE MERCEDES DEALER THAT I CANNOT ESCALATE THE SITUATION FURTHER.  THE PROBLEM IS THAT THE TRANSMISSION CAUSES THE CAR TO LURCH FORWARD A FEW SECONDS AFTER A HARD STOP.  FOR EXAMPLE, IF I HAD TO BREAK SUDDENLY IF A CHILD CAME OUT IN FRONT OF THE CAR, IT COULD LURCH FORWARD A FEW SECONDS AFTER I HAD STOPPED WITH DISASTROUS RESULTS.  THE VEHICLE ALSO HAS DELAYED ACCELERATION, LURCHING FORWARD AT A MUCH FASTER RATE THAN INTENDED.  THE TRANSMISSION HAS NEVER FELT RIGHT SINCE I TOOK DELIVERY IN 98, BUT AT THE TIME I WAS ENSURED THAT IT WAS NORMAL.  I SPOKE WITH ONE OF MERCEDES?? TOP MECHANICS AT FOREIGN MOTORS WEST RECENTLY WHO TOLD ME THIS IS COMMON FOR C CLASS VEHICLES MANUFACTURED FROM 1997 TO EARLY 1998.  THE SERVICE MANAGER ALSO SAID MY PROBLEMS ARE COMMON WITH TODAY??S VEHICLES.  MERCEDES HAS APPARENTLY KNOWN ABOUT THIS TRANSMISSION ISSUE FOR YEARS.  MERCEDES INSTALLED DIFFERENT COMPONENTS IN LATER MODELS TO CORRECT THE PROBLEM.  SINCE THE TRANSMISSION OFTEN LASTS FOR ABOUT 100,000 MILES BEFORE THE PROBLEM OCCURS, DEALERS ARE OFTEN ABLE TO CHARGE THE $8,000 FOR A NEW TRANSMISSION AND SHIRK RESPONSIBILITY.  I'M SURE THERE HAVE BEEN SITUATIONS WITH DISASTROUS CONSEQUENCES WITH LESS KNOWLEDGEABLE DRIVERS THAN I.  THIS IS MY THIRD MERCEDES AND CLEARLY THEY'VE ADOPTED A LOWER-QUALITY APPROACH TOWARD BUILDING AND RECALLING VEHICLES IN THE LAST 5 YEARS.  HOPEFULLY YOU CAN DO SOMETHING TO PROTECT CONSUMERS.  I DON'T KNOW A LOT OF PEOPLE WITH AN EXTRA $8,000 LAYING AROUND TO FIX A PROBLEM THAT YOU WOULDN'T EXPECT IN A CAR LIKE THIS.   *NLM",
        "vin": "WDBHA23G0WA"
    }
]