[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/08/2003",
        "dateOfIncident": "02/19/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018400,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "NEW BEETLE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 65 MPH, ENGINE SPEED 2200 RPM, VEHICLE SUDDENLY DECELERATES TO ENGINE SPEED 1200 RPM (35 MPH).  APPROX 5-10 SECONDS LATER THE MIL (\"CHECK ENGINE\") LIGHT COMES ON SOLID AND THE GLO-PLUG LAMP BLINKS.  OBD-II DIAGNOSTIC CODE \"P0226\" (THROTTLE POSITION SENSOR) CODE WAS SUBSEQUENTLY READ.  THROTTLE CONTROL MAY BE MOMENTARILY REGAINED BY TURNING VEHICLE IGNITION OFF AND BACK ON IN ORDER TO MAINTAIN SPEED (OBSERVING CARE THAT ROAD IS STRAIGHT SO THAT STEERING WHEEL LOCK DOES NOT LOCK UP).   FAILURE MAY RE-OCCUR WITHIN 50-100 YARDS, REPEATEDLY REQUIRING IGNITION TURN-OFF/TURN-ON SEQUENCING FOR 'BURSTS' OF THROTTLE FUNCTION BETWEEN FAILURES BEING CAREFUL TO TRY TO AVOID STEERING WHEEL LOCK.  ALTERNATIVE TO RECOVERY FROM LOSS OF FOOT THROTTLE IS TO QUICKLY ENGAGE CRUISE CONTROL (LIMITING ACCELERATION IS LIMITED TO 1 MPH 'CLICKS').   VW OF AMERICA ([XXX]  3-MAR-03, 1210 PST, - CUST. CARE #30108450) DENIES KNOWLEDGE OF A PROBLEM WITH THROTTLE POSITION SENSORS AND VEHICLE DEFAULTING TO 1200 RPM 'LIMP MODE'.  LITHIA MOTORS (MEDFORD, OR - VW SALES & SERVICE) HAS ALSO NOTED THE P0226 (\"THROTTLE POSITION SENSOR\") CODE WHEN VEHICLE WAS TAKEN TO SERVICE DEPARTMENT FOR DIAGNOSTIC TROUBLE INVESTIGATION BUT UNABLE TO CORRELATE THE \"THROTTLE POSITION SENSOR\" CODE WITH 1200 RPM ENGINE LIMITATION AND LOSS OF THROTTLE FUNCTION.  INDEPENDENT SERVICE SHOP SAYS THAT THROTTLE POSITION SENSORS HAVE BEEN MODIFIED AND ARE ON BACK ORDER AND THAT THE TPS IN THIS VEHICLE (VIN # [XXX]) FAILS TO PROVIDE PROPER SIGNAL (\"DRIVE-BY-WIRE\" THROTTLE) AT BETWEEN 7% AND 17% OF FOOT THROTTLE ACTUATION.    PROBLEM HAS OCCURRED APPROX. 100-200 TIMES SINCE FIRST NOTED ON 19-FEB-2003.  VERY CURIOUS THAT PARTS HAVE BEEN MODIFIED AND ARE BACK-ORDERED WHEN THERE IS \"NO KNOWN PROBLEM\" AND VW AND THEIR DEALERS CANNOT CORRELATE AN OBD-II \"P0226\" CODE WITH THIS HAZARDOUS VEHICLE CONTROL FAILURE.  *NLM    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3VWCP21C61M"
    }
]