[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "Kawasaki Motors Corp., U.S.A.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018383,
        "products": [
            {
                "manufacturer": "Kawasaki Motors Corp., U.S.A.",
                "productMake": "KAWASAKI",
                "productModel": "KLR650",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I HEARD ABOUT A FLAW OF THE ENGINE BALANCER SYSTEM OF THE KAWASAKI KLR650, I ASSUMED THAT MY ENGINE WAS OKAY, AS IT SEEMED TO BE RUNNING FINE, BUT THEN GAVE IN TO MY CURIOSITY, OPENED THE ENGINE CASES AND INSPECTED THE BALANCER MECHANISMS.  SURE ENOUGH, JUST AS MANY OTHER KLR OWNERS HAD REPORTED, THE IDLER SHAFT WAS BROKEN.  I HAD AN AFTER MARKET IDLER SHAFT THAT IS FORGED FROM ONE PIECE OF HIGH GRADE STEEL AND INSTALLED IT.  THE ENGINE RUNS QUIETER NOW AND PRESUMABLY IS LESS PRONE TO FAILURE OF THIS TYPE.  THE MANUFACTURER, KAWASAKI HEAVY INDUSTRIES, APPARENTLY HAS CHOSEN TO CUT COSTS BY USING A CHEAP TWO PIECE WELDED IDLER SHAFT OF RELATIVELY CHEAP STEEL (AFTER ONLY 10,000 MILES, MY 1998 KLR 650'S IDLER SHAFT, WHICH WAS ALREADY BROKEN, CRUMPLED IN MY HAND).  THIS DESIGN FLAW HAS BEEN WIDELY RECOGNIZED BY COMPETENT ENGINEERS WHO OWN KLRS, AND WHO HAVE REPORTED THE PROBLEM TO KAWASAKI, BUT THESE REPORTS HAVE GONE UNANSWERED.  ALTHOUGH THE RISK OF PERSONAL INJURY FROM THIS DESIGN FAILURE IS PROBABLY LOW, THERE IS STILL A CHANCE THE BROKEN PARTS COULD CAUSE THE ENGINE TO SEIZE AT SPEED AND RESULT IN A CRASH.  CERTAINLY THE ECONOMIC COSTS TO KLR OWNERS COULD BE SUBSTANTIAL IF THE ENGINE FAILED DUE TO THIS DESIGN FLAW.  I HEARD OF CASES OF VERY HIGH COSTS (OVER $1000) TO REBUILD THE ENGINE AFTER THIS PART FAILED.    IT IS A SERIOUS PROBLEM OF AN OTHERWISE FINE PRODUCT, AND I HOPE THAT THIS REPORT, AND OTHER SIMILAR REPORTS, WILL RESULT IN THE MANUFACTURER TAKING STEPS TO ENSURE THAT ITS PRODUCT IS AS SAFE AS POSSIBLE.          *JB",
        "vin": ""
    }
]