[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/09/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018482,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2001 GMC YUKON XL 06/15/01.   IN THE EARLY 40K MILE PERIOD ON MY 2001 I STARTED HEARING A ROAD NOISE THAT I THOUGHT WAS MY NEW TIRES. I TOOK MY VEHICLE IN TO MARLOW-WERNER PONTIAC GMC IN PUNTA GORDA, FLORIDA ON 3/06/03 AT 44,792 MILES AND TOLD THEM I HAD SOME SORT OF TIRE NOISE IF THEY COULD CHECK OUT. THEY REPORTED NO PROBLEM. THE NOISE KEPT GETTING LOUDER DURING A 6 HOUR TRIP. UPON RETURNING TO TOWN WE TOOK IT INTO TUFFY AUTO SERVICE CENTER IN PORT CHARLOTTE. WE TOLD THEM WE THOUGHT IT WAS A BEARING  NOISE AND TO PLEASE CHECK IT OUT. THEY HAD THE KNOWLEDGE TO PUT IT ON THE LIFT AND PUT IN GEAR AND REALIZED IT WAS THE REAR END. WE IMMEDIATELY TOOK IT TO MARLOW-WERNER AND TOLD THEM WHAT TUFFY HAD SAID. THEY CHECKED OUT THE VEHICLE AND TOLD US THE COMPLETE REAR END NEEDED TO BE REDONE. THE BEARINGS WERE SCORED AND THEY HAD TO REPLACE ALL THE REAR DIFFERENTIAL BEARINGS, PINION, AND SIDE BEARINGS. I HAVE HAD MY VEHICLE SERVICED AT THE DEALER EVERY 3K MILES AS PER MANUFACTURER RECOMMENDATIONS. I HAVE NEVER KNOWN A NEW VEHICLE WITH 40K MILES HAVE THE REAR END GO OUT THIS WAY. I FEEL THERE IS A MANUFACTURER DEFECT AND THEY SHOULD HAVE REPAIRED IT AT NO COST TO ME. THEY CHARGED ME 50% OF THE REPAIR COST UNDER THE GOODWILL WARRANTY. I FEEL THIS IS A PROBLEM THAT NEEDS TO BE CHECKED INTO FURTHER AND SHOULD HAVE NOT HAPPENED WITH THE LOW MILEAGE AND IS A SAFETY CONCERN. I CALLED GMC ON 4/2/03 AND SPOKE WITH DARREN CHRISTENSEN  WHICH IS A CONSUMER RELATIONS MANAGER. THE FILE NUMBER IS #1-867-42264. HE SAID HE DIDN'T KNOW HOW I DROVE MY VEHICLE AND IF I HADN'T DROVE ON IT FOR SO LONG THE REPAIR WOULDN'T HAVE BEEN SO EXTENSIVE. I WAS FURIOUS. I TOLD HIM THAT I USE MY VEHICLE TO TAKE MY TWO KIDS TO SCHOOL AND ON VACATIONS AND WAS NOT A HARD DRIVER. HE TOLD ME HE COULDN'T HELP ME ANY FURTHER AND THAT THEY WOULD ONLY COVER THE 50%. I JUST WANT THIS NOTED IN CASE THERE ARE OTHER CONSUMERS THAT ARE HAVING THE SAME PROBLEM WITH THE REAR PINION/BEARINGS.  *JB",
        "vin": "3GKEC16T21G"
    }
]