[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/09/2003",
        "dateOfIncident": "05/05/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018453,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "LUMINA",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER PAST FEW MONTHS VEHICLE HAS EXHIBITED CONSIDERABLE PLAY IN STEERING WHEN WHEELS ARE TURNED HALF-WAY TO THE LEFT.  WHEN HELD IN THIS POSITION THE STEERING WHEEL WOULD OSCILLATE LEFT TO RIGHT 1 TO 2 INCHES.  THIS MORNING WHILE DRIVING THE VEHICLE I SUDDENLY FOUND IT DIFFICULT TO TURN THE WHEEL TO THE RIGHT.  IT WAS SIMILAR TO A POWER STEERING FAILURE.  AFTER A SUBSEQUENT LEFT TURN THE STEERING WHEEL RE-CENTERED ITSELF TO THE LEFT APPROXIMATELY. 20 DEGREES OFF-CENTER.  DURING THE REMAINDER OF THE DRIVE THE STEERING WAS ERRATIC IN TURNS.  ALIGNMENT IS FINE. POWER STEERING PUMP WAS REPLACED DUE TO LEAKING 1 YEAR AGO.  VEHICLE RECEIVES REGULAR MAINTENANCE PER MANUFACTURER'S GUIDELINES.  THE STEERING FAILURE IS CONSISTENT WITH DEFECT DESCRIBED IN RECALL 02-V-286-000.  REPORTED THIS TO GM AND WAS INFORMED THAT BY THE VIN THE VEHICLE IS NOT SUBJECT TO THIS RECALL, AND THAT DUE TO THE AGE AND MILEAGE THERE IS NO REIMBURSEMENT FOR REPAIR COSTS.  I WORK WITH THE AUTO INDUSTRY AND I AM FAMILIAR WITH THE COMMON PRACTICE OF PARTS SUBSTITUTION OR \"APPROVED ENGINEERING DEVIATIONS\".  WHILE GM MAY NOT SHOW THE DEFECTIVE RACK & PINION BEARING ASSEMBLY ON THE BILL OF MATERIAL FOR THE 1997 LUMINA, IT IS EVIDENT FROM THE NUMBER OF COMPLAINTS REPORTED THAT SEVERAL OF THE MODEL YEAR '97 LUMINA'S WERE MANUFACTURED WITH THE DEFECTIVE ASSEMBLY.  AT THE LEAST GM SHOULD RECALL THE 1997 LUMINA'S FOR DEALER INSPECTION AND REPAIR THOSE WITH DEFECTIVE BEARING ASSEMBLIES.  *JB",
        "vin": "2G1WL52M1V1"
    }
]