[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/09/2003",
        "dateOfIncident": "05/08/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER ST",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I JUST BOUGHT A C1500 REGULAR CAB SHORT BED TRUCK. I WAS APPALLED TO FIND OUT THAT THE TIRES ARE RATED AT 950 LBS. AT MAX LOAD OF 44PSI.  THE TRUCKS DRY CURB WEIGHT IS LISTED AT 4142 LBS. AND MAX PAY LOAD IS 1958. THESE NUMBERS INDICATED THAT THE TRUCK CHEVROLET SUPPLIED IS ON TIRES THAT ARE NOT EVEN RATED TO HOLD THE TRUCK EMPTY!  I CAN'T USE MY TRUCK TO HAUL OR CARRY ANYTHING WITHOUT EXCEEDING THE TIRE MANUFACTURES RATING.  THE TIRES ARE GOODYEAR WRANGLER ST P235/75R16  (PASSENGER CARE TIRES?)  I DO NOT THINK I SHOULD DRIVE THIS TRUCK ON THESE TIRES. I WANT GM TO REPLACE THEM WITH TIRES THAT ARE RATED TO THE CAPACITIES OF THE TRUCK THAT I BOUGHT ON THE ASSUMPTIONS GIVEN IN THE CHEVY TRUCK BROCHURES SUPPLIED AT THE DEALERSHIPS.  THE TIRES ON THE TRUCK ARE NOT EVEN LT (LIGHT TRUCK) AND ARE A SAFETY ISSUE.  THIS IS A COPY OF WHAT I SUBMITTED TO THE CHEVROLET.COM WEBSITE.  I DO NOT FAULT THOROBRED CHEVROLET DEALERSHIP FOR THIS BUT DO EXPECT SOME CORRECTIVE ACTION. THIS TRUCK WAS SOLD TO ME IN AN UNSAFE CONDITION.    *JB  THERE HAS NOT BEEN AN INCIDENT  THANKS FOR YOUR TIME PLEASE RESPOND ASAP  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GCEC14X83Z"
    }
]