[
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/11/2003",
        "dateOfIncident": "12/20/2001",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018524,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FOUND AN EXCELLENT AND INFORMATIVE WEBSITE AGAINST DAILMLER CHRYSLER AT WWW.DAIMLERCHRYSLERVEHICLEPROBLEMS.COM FOR ANYONE WHO WOULD LIKE MORE INFORMATION MAINLY IN REGARD TO INTREPID, 300M, CONCORDE, LHS PREMATURE ENGINE, STEERING, TRANSMISSION AND OTHER COMMON FAILURES. I HAVE EXPERIENCED MANY OF THESE PROBLEMS MYSELF AND DAILMER CHRYSLER SIMPLY DOES NOT CARE, I COULD HAVE EVEN BEEN KILLED IN ONE INSTANCE. AFTER OWNING ANOTHER VEHICLE AND PUTTING NEARLY 30,000 MILES ON IT I HAVE NOT HAD ANY OF THE RIDICULOUS PROBLEMS EXPERIENCED WITH CHRYSLER'S DODGE BRAND OF VEHICLES. THERE IS A LOT OF INFORMATION CONSUMERS NEED TO KNOW THAT DAILMER CHRYSLER DOES NOT WANT YOU TO KNOW ABOUT THESE VEHICLES AND THEIR COMMON PROBLEMS CHRYSLER IGNORES, SOME OF WHICH ARE POTENTIAL SAFETY CONCERNS SUCH AS THE DEFECTIVE SEAT BELT DESIGN CHRYSLER CONTINUES TO USE AND DEFECTIVE STEERING DESIGN AND OR COMPONENTS THAT CAN CAUSE SUDDEN LOOSENESS OR CHANGE OF RESPONSE IN STEERING, WHICH CAN LEAD TO A SERIOUS ACCIDENT. THESE GUYS HAVE BEEN RECEIVING COMPLAINTS DAILY ABOUT THESE PROBLEMS AND HAVE BEEN REFERRING CONSUMERS TO THE NHTSA, I HOPE THAT IN TURN THE NHTSA WILL ADD THIS TO THE LIST OF THEIR COMPLAINTS SO OTHERS WILL ALSO KNOW ABOUT THIS. THANK YOU VERY MUCH FOR YOUR TIME.    *NLM",
        "vin": "2B3HD56JXXH"
    }
]