[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/13/2003",
        "dateOfIncident": "04/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018613,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "-2000 FORD FOCUS LX - BOUGHT USED ON APRIL 14TH. BOTH INTERIOR AND EXTERIOR OF CAR IN EXCELLENT CONDITION, RAN EXTREMELY WELL, ONE OWNER REPO, CLEAN TITLE.  -WAS REAR-ENDED IN VERY LOW SPEED, LOW IMPACT COLLISION, NO FRAME BUCKLING, BENDING, OR DAMAGE TO CAR OTHER THAN SCRATCHED REAR BUMPER - TRUCK LID WILL NOT LATCH NOW. MULTIPLE MECHANICS AND APPRAISERS - UNABLE TO FIND PROBLEM.  -WHILE DRIVING, DASH GAUGES AND CAR SPEAKERS WILL SUDDENLY STOP WORKING (SPEEDOMETER GOES TO 0, ODOMETER GOES BLANK, FUEL GAUGE GOES TO 0) AND THEN SPONTANEOUSLY COME BACK ON WITH NO AFTER EFFECTS. CAR STALLED WHILE STOPPING AFTER ONE OF THESE EPISODES. OCCASIONALLY WHEN CAR IS STARTED, THE ODOMETER WILL SPONTANEOUSLY RESET WITHOUT PROMPTING (NOT THE MAIN ONE, THE RESETABLE ONE).  -RANDOM CODES BEING THROWN TO COMPUTER - CAR HAS HAD TWO DIAGNOSTICS RUN IN TWO WEEKS, THE FIRST FOR TWO CODES: 1. A MECHANICAL ISSUE, 2. FOR ELECTRICAL DIFFICULTIES IN THE DASHBOARD - THE CAR WAS THOROUGHLY INSPECTED AND NO DEFECTS WERE FOUND. SEVEN DAYS LATER THE COMPUTER REPORTED AN \"EVAPORATIVE SYSTEM LEAK\" - ONCE AGAIN THE CAR WAS THOROUGHLY INSPECTED AND NO DEFECTS WERE FOUND. AFTER THE FIRST DIAGNOSTIC, A REAR BRAKE LIGHT WENT OUT - AFTER REMOVING THE LIGHT AND \"FIDDLING\" WITH THE WIRING, THE MECHANIC GOT ITS NORMAL FUNCTION TO RESUME.  -THE CAR HAS 36,000 MILES, I HAD THE BRAKES INSPECTED THE DAY AFTER THE CAR STARTED SHAKING VIOLENTLY WHEN I PRESSED THE BRAKE PEDAL. THE ROTORS ARE WARPED TERRIBLY AND I WILL HAVE TO HAVE THE ENTIRE BRAKE SYSTEM REPLACED, INCLUDING THE REAR DRUMS - I DO NOT CONSIDER THIS NORMAL, ESPECIALLY IN SUCH A YOUNG CAR.  -IT HAS HAD TWO RECALLS FILLED IN THE LAST MONTH, ONE FOR A PINCH BOLT AND THE OTHER FOR A WHEEL BEARING. NO OTHER RECALL CAMPAIGNS WERE OPEN. THESE PROBLEMS HAVE CONTINUED SINCE THE RECALLS WERE COMPLETED.  -I'VE OWNED THIS CAR FOR LESS THAN A MONTH. THE CARS PRE-PURCHASE INSPECTION CAME UP CLEAN. THE CAR IS NO LONGER UNDER ANY KIND OF FACTORY WARRANTY.*JB",
        "vin": ""
    }
]