[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/12/2003",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018573,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "626",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE.  WHEN STOPPING, TRANSMISSION DOWN-SHIFTS SO HARD THAT ALL PASSENGERS FEEL AS IF THEY WILL BE THROWN THROUGH THE WINDSHIELD, LIKE BEING REAR-ENDED.  ALSO, THE TRANSMISSION IS VERY SLOW TO SHIFT.  WHEN IT FINALLY DOES, IT \"KICKS\" LIKE HAVING BEEN HIT BY ANOTHER CAR.  TRANSMISSION TAKES ITSELF OUT OF CRUISE CONTROL AND OUT OF O/D.  MAZDA DEALER SERVICE MANAGER HAS DRIVEN THE VEHICLE AND HAS EXPERIENCED THESE PROBLEMS FIRST HAND, BUT BECAUSE THE CAR IS NOT GENERATING A \"CODE\", MAZDA'S OFFICIAL POSITION IS THAT THERE IS NO PROBLEM.  THIS IS EXTREMELY UPSETTING AND UNACCEPTABLE, SINCE I COMPLAINED OF THIS PROBLEM (AND OTHERS) SEPT. 2002.  THE CAR WOULD NOT ACCELERATE AT ALL BUT WOULD SPUTTER, THEN JOLT FORWARD INTO TRAFFIC.  I MADE THREE SEPARATE TRIPS TO THE DEALERSHIP AND THE FIRST TWO TIMES WAS AGAIN TOLD \"THERE IS NO PROBLEM, SINCE WE CAN'T FIND A CODE\" - EVEN THOUGH THE ENGINE LIGHT WAS ON!  FINALLY, ON THE THIRD TRIP, THEY WERE ABLE TO DIAGNOSE THE PROBLEM - SPARK WIRES AND PLUGS.  RECENTLY, WHEN THEY WEREN'T ABLE TO FIND THE CURRENT PROBLEM, THEY SUGGESTED THAT IT WAS AN ENGINE MOUNT PROBLEM, SO I PAID NEARLY $700.00 (AND HAD A RENTAL CAR FOR NEARLY THREE WEEKS WAITING FOR PARTS) TO HAVE THAT FIXED.  WHEN I GOT THE CAR BACK, THE TRANSMISSION PROBLEM WAS ACTUALLY WORSE!  FURTHER, THE CAR SEEMS TO HAVE SOME SORT OF ELECTRICAL PROBLEM, AS OCCASIONALLY, ALL THE DASH LIGHTS WILL COME ON WHEN I DEPRESS THE BRAKE PEDAL, AND THE LEFT OR RIGHT TURN SIGNAL WILL REMAIN ON, STATIC - NOT BLINKING.  I HAVE REPORTED ALL THE ABOVE ON MORE THAN ONE OCCASION TO THE DEALERSHIP AND TO MAZDA CORPORATION.  THIS VEHICLE HAS ONLY 63,000 MILES AND IS JUST NOW PAID OFF.  I COMPLAINED ABOUT THIS PROBLEM WHILE THE CAR WAS STILL UNDER WARRANTY AND WAS TOLD THERE IS NO PROBLEM.  NOW, THE CAR IS OUT OF WARRANTY, AND SINCE MAZDA SAYS THERE IS NO PROBLEM, I WILL HAVE TO PAY ALL COSTS INVOLVED IN TRANSMISSION REPLACEMENT.  I INTEND TO RETAIN LEGAL COUNSEL.  *NLM",
        "vin": ""
    }
]