[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/13/2003",
        "dateOfIncident": "05/09/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018618,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "G35",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 G35 CP 6 SPD  I WAS DRIVING ON THE 60 FWY GOING WEST @ 2:30 AM, TRAVELING ABOUT 65 MPH & ALL OF A SUDDEN, THE CAR SPIN OUT & SKIDDED ACROSS THE FREEWAY ONTO THE DIRT ALMOST HIT THE CENTER DIVIDER. I WAS SHOCK! I WAS THINKING MAN... WHAT DID IT JUST HAPPEN? FIRST I THOUGHT THERE WERE STUFF LIKE GREASE ON THE FWY THAT CAUSE THE SPIN OUT. BUT I WALK TO THE FREEWAY & THERE WAS NOTHING ON THE FWY. SO I GOT BACK INTO MY CAR TRY TO MOVE THE CAR, BUT IT WOULD NOT MOVE. IT SEEMS LIKE THE REAR-WHEEL BRAKE IS LOCKED, THE CAR WILL NOT MOVE.   SO I CALL THE TOW TRUCK & TOW MY CAR TO THE DEALER IN RIVERSIDE. THEN WHEN THE CAR GOT TO THE DEALER, THE MECHANIC WENT UNDERNEATH AND FOUND OUT THERE WERE PLASTIC GOT CAUGHT AROUND THE DRIVESHAFT. THEN THEY JACKED UP THE CAR TO REMOVE THE PLASTIC, THEY'VE FIND OUT THAT THE BRAKE LINES ARE TWISTED, THAT'S WHY THE REAR BRAKE LOCKED UP.   SO AFTER THE DEALER GAVE ME A QUOTE TO REPLACE THE BRAKE LINES. AND I ASK THEM ISN'T THAT A DEFECT FROM MANUFACTURE? THEY TOLD ME NO, THEY BLAME ON ME THAT I RAN OVER THE PLASTIC & CAUSE THE BRAKE TO LOCKED.   DOES IT MAKE SENSE TO YOU? BRAKE IS CONTROL BY THE DRIVER, NOT ANY OBJECTS ON THE ROAD. LUCKY THERE WAS NO CARS AROUND AT THAT TIME. AND ALSO THERE WAS NOT A FREEWAY DIVIDER RIGHT NEXT TO ME, OR ELSE WHO KNOWS WHAT COULD OF HAPPEN. I COULD CAUSE A BIG ACCIDENT. SO TO ME, THIS IS A VERY MAJOR SAFETY ISSUE & NOW I DO NOT FEEL SAFETY & COMFORTABLE DRIVING THAT CAR ANYMORE, AFTER I HAD ALMOST LOST MY LIFE. THIS INCIDENT HAPPEN ONCE & IT WILL HAPPEN AGAIN. AND IM NOT DOWN TO GO THROUGH IT AGAIN.   SO NOW, I AM REQUESTING THE DEALER TO TAKE BACK THE CAR. THE CAR IS ONLY 9 DAYS OLD AND ONLY HAVE A FEW HUNDRED OF MILES ON IT. I SPOKE TO THE DEALER, BUT THEY SAID THEY WILL NOT TAKE BACK THE CAR. CAN YOU GUYS HELP ME OUT HERE? *JB",
        "vin": "JNKCV54EX3M"
    }
]