[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "05/12/2003",
        "dateOfIncident": "05/11/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "MALIBU",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1998 CHEVROLET MALIBU.  I HAVE HAD NUMEROUS FRONT BRAKE PROBLEMS...FROM THEM WEARING OUT PREMATURELY TO THE ROTORS WARPING.  AT AROUND 5,000 MILES I WENT TO THE DEALER BECAUSE THE ROTORS WERE WARPED AND THEY WERE SUBSEQUENTLY RESURFACED.  AT AROUND 13,000 MILES I HAD TO HAVE THE ROTORS REPLACED BECAUSE THEY WERE WARPED (THE WERE REPLACED WITH AFTER MARKET ROTORS).  ALTHOUGH WARPING DID OCCUR AFTER THE ROTORS WERE REPLACED WITH A NON OEM PART, IT DID NOT OCCUR AS OFTEN AND AS BADLY.  ABOUT ONE MONTH AGO I HAD THE FRONT BRAKES RESURFACED AND BENDIX PADS PLACED.  WARPING STARTED AFTER A FEW DAYS THAT THE BREAKS WERE DONE.  THE MECHANIC INFORMED ME THAT IT WAS NOT THE ROTOR THAT WAS AT FAULT.  IT WAS THE ENTIRE BRAKE DESIGN OF THE MALIBU.  THE BRAKES SIMPLY CANNOT HOLD BACK THE WEIGHT OF THE CAR ON SUCH SMALL ROTORS.  BECAUSE OF THE RELATIVELY SMALL SURFACE AREA OF SUCH SMALL ROTORS, THEY TEND TO HEAT UP WAY TO EARLY CAUSING SEVERE BRAKE FADING....THE REASON WHY I BROUGHT THE CAR TO THE MECHANIC TO HAVE THE BRAKES DONE TO BEGIN WITH.  TODAY, AS I WAS DRIVING IN LIGHT TRAFFIC, AS I APPLIED THE BRAKES AT AROUND 25 MILES AN HOUR, IT FELT AS IF I WASN'T PRESSING THE BRAKE AT ALL AND I REAR ENDED A VEHICLE CAUSING A LOT OF DAMAGE TO MY VEHICLE...SOMEWHERE AROUND $2,500 WORTH.  AFTER ALLOWING THE CAR TO SIT FOR ABOUT A HALF HOUR I DECIDED TO TEST THE BRAKES BY APPLYING THEM IN THE SAME MANNER AS BEFORE...AND THE VEHICLE STOPPED AS IT SHOULD.  THE ONLY POSSIBLE EXPLANATION IS BRAKE FADE DO TO THE ROTORS OVERHEATING.  I'M EXTREMELY UPSET AT CHEVROLET AND AT NHTSA BECAUSE THEY HAVE NOT DONE ANYTHING TO REMEDY THIS MAJOR WELL KNOWN ISSUE WITH THIS VEHICLE.  THESE VEHICLES NEED TO RECALLED IMMEDIATELY IN ORDER TO PREVENT SERIOUS ACCIDENTS FROM OCCURRING.  WHAT IF THE OBJECT IN FRONT OF MY VEHICLE WAS A PERSON AND NOT JUST ANOTHER CAR.   *NLM",
        "vin": ""
    }
]