[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/14/2003",
        "dateOfIncident": "05/14/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018687,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LESABRE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING YOU BECAUSE I DO NOT KNOW WHERE TO TURN TO.  I PURCHASED A 2000 BUICK LASABRE FROM BROWN PONTIAC IN AMARILLO TEXAS AT THE END OF 2000.   ALL  4 WINDOWS HAVE STOPPED WORKING, BECAUSE OF ONE LITTLE PLASTIC PART THAT HAS BROKEN ON THE WINDOW REGULATOR, RENDERING THEM USELESS, AND POSES A PROBLEM IN CASE OF CARBON MONOXIDE POISONING, OR OTHER EMERGENCY SITUATION WHERE THE WINDOWS NEEDED TO BE OPERABLE.  IT IS CLEARLY A DEFECT IN MATERIAL USED, WHICH IS A LITTLE PLASTIC BALL, WHICH HOLDS THE ELECTRIC WIRE IN PLACE THROUGH A TENSION SYSTEM.  THE ONLY WAY TO FIX THE PROBLEM AS IT IS, IS TO PURCHASE AND REPLACE THE ENTIRE WINDOW REGULATOR AND MOTOR, WHICH IS ABOUT $300 EACH, AND STILL THE SAME POTENTIAL PROBLEM EXISTS.  ACCORDING TO USED PARTS PLACES AROUND THE COUNTRY, THAT HAVE TOLD ME THIS IS A FREQUENT PROBLEM WITH  THIS VEHICLE.  WHEN MY TWO REAR WINDOWS STOPPED, I TOOK IT BACK TO THE DEALER, AND BECAUSE I HAD NOT PURCHASED AN EXTENDED WARRANT ON THE VEHICLE, THEY ESSENTIALLY LAUGHED AT ME.   I JUST HAD MY MECHANIC IN PAMPA TEXAS FIX THEM SO THEY WOULD AT LEAST STAY UP, AND SO MY CHILDREN WOULD NOT GET HURT ON THEM, OR ANYONE ELSE FOR THAT MATTER.  NOW MY FRONT TWO WINDOWS HAVE DONE THE EXACT SAME THING, AND NO LONGER WORK, AND THE ONLY WAY TO FIX THEM IS TO REPLACE THE WINDOW REGULATORS AND MOTORS IN ALL FOUR WINDOWS WHICH IS ABOUT $1200.  THIS TO ME IS ABSURD WHEN THE PROBLEM IS ONE LITTLE PLASTIC BALL WHICH HOLDS THE TENSION SPRING IN PLACE SO THE ELECTRIC WINDOWS CAN GO UP AND DOWN.  I AM HOPEFUL YOU CAN HELP ME TO GET BUICK AND GM TO FIX THIS PROBLEM, BEFORE SOME LITTLE CHILD IS INJURED OR FALLS OUT A WINDOW BECAUSE IT NO LONGER WORKS, OR SOMEONE DIES OF CARBON MONOXIDE POISONING BECAUSE THE WINDOWS NO LONGER GO UP AND DOWN.  I APPRECIATE ANY HELP YOU MAY BE ABLE TO GIVE ME IN GETTING THIS UNFORTUNATE DANGEROUS SITUATION RESOLVED, AND MY WINDOWS REPAIRED.  I AM VERY APPRECIATIVE OF YOUR TIME AND CONCERN FOR DEALING WITH THIS MATTER.    *NLM",
        "vin": "1G4HP54K1Y4"
    }
]