[
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/13/2003",
        "dateOfIncident": "04/28/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018655,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ECLIPSE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIMS ON MY 2000 MITSUBISHI ECLIPSE HAVE BECOME DENTED UNDER WHAT WOULD BE CONSIDERED LESS THAN NORMAL WEAR AND TEAR.  I HAVE TAKEN EXCEPTIONAL CARE TO PROTECT THIS CAR FROM DAMAGE.  AS AN EXAMPLE, AFTER THREE YEARS OF OWNERSHIP, THERE IS STILL NOT A SINGLE DOOR DENT OR CHIP, DUE TO THE FACT THAT I EXERCISE THE EXTRA EFFORT TO PARK FAR AWAY FROM OTHER VEHICLES AND WALK THE EXTRA DISTANCE TO MY DESTINATION.  THEREFORE IT'S REASONABLE TO ASSUME THAT I WOULD ALSO STEER CLEAR OF POTHOLES, ETC., AND I HAVE THE PAPER WORK TO PROVE THAT I HAVE MAINTAINED MY CAR ACCORDING TO STANDARDS SET BY MITSUBISHI.  YET DESPITE THIS LEVEL OF CARE, THE RIMS HAVE BECOME DAMAGED.  IRONICALLY, AS THIS IS MY FIRST NEW CAR, I TAKE BETTER CARE OF IT THAN ANY CAR I HAVE EVER OWNED, AND YET IT IS THE FIRST CAR I HAVE HAD THIS ISSUE WITH.  WHEN I BROUGHT IT TO THE DEALERSHIP, THE FACTORY REP SAID IT WAS BECAUSE THE AIR PRESSURE MUST HAVE BEEN LOW AND I HIT A POTHOLE.  BUT YET HE WON'T TELL ME HOW HE CAME TO THAT DETERMINATION.  AT THE SAME TIME I BROUGHT THE CAR I FOR THE RIMS, I HAD BROUGHT THE CAR IN FOR THE CLUTCH NOISE ISSUE, AND NOWHERE ON THE REPAIR ORDER IS IT MENTIONED THAT I REQUESTED TO HAVE THE RIMS REPLACED AND THAT MY REQUEST WAS DENIED.  NOR CAN I GET IT FROM MITSUBISHI IN WRITING.  ALSO, IT IS MY UNDERSTANDING FROM THE DEALERSHIP THAT THE TIRES WERE NEVER REMOVED FROM MY CAR DURING THE \"INSPECTION\", SO I QUESTION ITS SINCERITY.  I HAVE LEFT TWO MESSAGES WITH THE FACTORY REP TO EXPLAIN TO ME HOW HE ARRIVED AT HIS DETERMINATION, AND HE HAS STILL NOT RETURNED MY CALL.  I DON'T UNDERSTAND WHY MITSUBISHI HAS SPENT THE TIME AND MONEY MAKING A ONE-PIECE RIM TO REPLACE THE TWO-PIECE RIM IF THEY DON'T RECOGNIZE THAT THE RIMS AREN'T AN ISSUE, AND WHY THEY ARE REPLACING SOME PEOPLE'S RIMS AND NOT OTHERS.  HOPEFULLY THE CLASS ACTION LAWSUIT CURRENTLY UNDERWAY WILL HELP ME OUT, BECAUSE MITSUBISHI IS NOT BEING VERY RESPONSIVE.   *JB",
        "vin": "4A3AC54L6YE"
    }
]