[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2003",
        "dateOfIncident": "05/13/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DEVILLE",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEED THE CAR SUDDENLY LOST ALL POWER, INCLUDING POWER STEERING, POWER BRAKES AND ALL INSTRUMENT PANEL INFORMATION.  WHEN THE CAR WAS FINALLY STOPPED, THE DOORS COULD NOT BE UNLOCKED BECAUSE THEY ARE AUTOMATICALLY LOCKED WHEN THE CAR IS PUT INTO DRIVE AND THERE ARE NO DOOR LOCK KNOBS AVAILABLE TO MANUALLY UNLOCK THE CAR FROM THE INSIDE.  ALSO, NO WINDOWS COULD  BE OPERATED BECAUSE THERE WAS NO ELECTRICAL POWER AVAILABLE TO OPERATE THEM.  THE END RESULT WAS THAT PASSENGERS WERE TRAPPED INSIDE THE CAR WITH NO WAY TO GET OUT OTHER THAN BREAKING THE GLASS OF ONE OF THE WINDOWS AND UNLOCKING THE CAR FROM THE OUTSIDE.  THERE ARE NO OVERRIDE OPTIONS AVAILABLE FROM WITHIN THE PASSENGER COMPARTMENT FOR THIS PROBLEM.  A PERSON WHO IS NOT STRONG ENOUGH TO CONTROL THE CAR ONCE THE POWER STEERING IS LOST (E.G. A SMALL WOMAN, AN ELDERLY PERSON) COULD VERY EASILY HAVE AN ACCIDENT BECAUSE OF THIS DEFECT AND IF THE CAR IS IN AN ACCIDENT RESULTING IN A FIRE, THERE IS NO WAY FOR THE OCCUPANTS TO ESCAPE FROM THE CAR.  DIAGNOSIS OF THE PROBLEM REVEALED THE BATTERY CABLES HAD APPARENTLY WORKED LOOSE OR HAD NOT BEEN SUFFICIENTLY TIGHTENED AFTER REPLACEMENT OF A CAM SENSOR AT A LOCAL GM DEALERSHIP A FEW DAYS PRIOR TO THIS EPISODE.  THE SUDDEN LOSS OF ALL POWER WHILE DRIVING IS SIGNIFICANTLY DANGEROUS IN THIS VEHICLE AND SERIOUSLY THREATENS THE LIVES OF PASSENGERS AND PUTS THEM IN A VERY HIGH RISK SITUATION.  HAD THIS EPISODE HAPPENED ON AN INTERSTATE HIGHWAY IT WOULD HAVE RESULTED IN AN ACCIDENT.  THIS DEFECT IS A LIFE THREATENING DESIGN DEFECT AND REQUIRES AN IMMEDIATE PRIORITY FIX BY GM.   *NLM",
        "vin": "1G6CD53BXN4"
    }
]