[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/15/2003",
        "dateOfIncident": "02/28/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018755,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE CANNOT READ THE INSTRUMENT PANEL OF OUR 2002 TOYOTA HIGHLANDER IN THE BRIGHT ARIZONA SUN WHEN WEARING SUNGLASSES (A SAFETY AND MEDICAL REQUIREMENT IN ARIZONA \u0013 THAT IS TO WEAR SUN GLASSES IN THE VERY BRIGHT LATE SPRING TO EARLY FALL SUN).  WE HAVE DRIVEN AT LEAST 100 DIFFERENT CARS AND TRUCKS (MANY OF THEM RENTAL VEHICLES) OVER THE YEARS AND NEVER EXPERIENCED NOR EXPECTED THIS PROBLEM WHEN WE PURCHASED OUR 2002 HIGHLANDER.  DURING THE BRIGHT SUNNY DAYS IN CENTRAL ARIZONA (IT IS SUNNY HERE OVER 300 DAYS A YEAR), IT IS IMPOSSIBLE TO READ ANY INSTRUMENTS (SPEEDOMETER, TEMP GAGE, FUEL GAGE, ODOMETER, AND TACHOMETER) WHEN THE SUN IS COMING IN THE WINDSHIELD AND THE DRIVER IS WEARING SUNGLASSES.  OBVIOUSLY THIS IS A SEVERE SAFETY HAZARD.    I HAVE REPEATEDLY CONTACTED THE DEALER, THE DEALER SERVICE DEPARTMENT, AND TOYOTA ON THIS EXTREME SAFETY HAZARD SINCE ACQUIRING THE VEHICLE IN FEBRUARY 2002.  IN CONSIDERATION FOR TOYOTA AND ITS REPUTATION, I AVOIDED CONTACTING CU AND THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION TO ALLOW TIME FOR TOYOTA TO RESPOND TO THIS SAFETY ISSUE.  MY PATIENCE ENDED WITH THE BEGINNING OF ANOTHER SEASON OF VERY BRIGHT SUNSHINE IN ARIZONA.  THE DEALER AND TOYOTA FACTORY REPRESENTATIVES TOLD ME AS RECENTLY AS MAY 14, 2003 THAT THERE IS NOTHING THAT TOYOTA CAN DO, SINCE THERE ARE NOT ENOUGH COMPLAINTS  OR PERHAPS ANY OTHER THAN MINE (PERHAPS MANY PEOPLE DON'T LOOK AT THEIR DASH INSTRUMENTS WHEN THEY DRIVE).  HOWEVER, THE SERVICE MANAGER AT A LOCAL DEALERSHIP TELLS ME THAT OTHER ARIZONA HIGHLANDER OWNERS HAVE COMPLAINED, BUT THAT THERE IS NOTHING THAT HE CAN DO ABOUT THE REPORTED PROBLEM.  HE AGREES WITH MY ASSESSMENT OF THE PROBLEM.  HOW CAN HE NOT AGREE WHEN IT IS SO EVIDENT BY SETTING IN THE VEHICLE WITH THE BRIGHT ARIZONA SUN COMING THROUGH THE WINDSHIELD WHILE WEARING SUNGLASSES?*JB",
        "vin": "JTEGF21A820"
    }
]