[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2003",
        "dateOfIncident": "04/07/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018726,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "CHRYSLER",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "1/16/03 , CAR WOULD NOT START WAS CRANKED ABOUT 5 MINUTES LATER 1/2/037:00 PM CAR CUT OFF WHILE DRIVING 7:30 PM WENT BACK AT 8:15 PM AND IT CRANKED RIGHT UP AND DROVE HOME 3/5/03 VAN WOULD NOT CRANK. AFTER ABOUT 5 MINUTES OF TRYING IT CRANKED  7:30 A.M. AND 48 DEGREES. LEFT HOME  VAN CUT OUT IN THE MIDDLE OF THE ROAD, I GOT TO THE SIDE OF THE ROAD AND AGAIN TRIED FOR ABOUT 5 MINUTES TO CRANK IT,10 MIN. LATER IT CUT OUT AGAIN MOTOR JUST CUT OFF WITHOUT WARNING GOT TO DEALER THEY SAID IT HAD BEEN RESET AND THERE WHERE NO CODES 3/6/03  VAN SHUT OFF ON (WET AND RAINY TODAY) 3/7/03 VAN WOULD NOT CRANK THIS MORNING. I TRIED FOR 30 MINUTES BEFORE IT FINALLY CRANKED 7:30 A.M. 3/14/03  WOULD NOT CRANK  TRIED FOR 10 MINUTES THEN IT CRANKED 7:30 3/15/03 VAN ACTED LIKE IT WAS GOING TO CUT OFF. CAR HESITATED ABOUT 3 TIMES IN 5 MINUTES. ALL THE GAUGES DROPPED IMMEDIATELY TO ZERO!!! CAR KEPT RUNNING THE FIRST THREE TIMES THIS HAPPENED FINALLY IT CUT OFF.  5 MIN. LATER CRANKED UP. 4/7  VAN WOULD NOT START. 5 MIN. LATER DROVE TO WORK WITH NO OTHER PROBLEMS.  4/8  LEAVING WORK THE VAN CUT OFF, WAITED FOR ABOUT 5 MINUTES, THEN THE VAN CRANKED. THIS IS WHAT I HAVE BEEN DEALING WITH SINCE THE PURCHASE OF THE CAR. I CANNOT DRIVE IT BECAUSE I HAVE SMALL CHILDREN AND I THINK THAT CARS THAT SHUT OFF AT 65 MILES AN HOUR ON THE INTERSTATE NEED TO BE INVESTIGATED!EVEN IF YOU CAN'T IDENTIFY THE PROBLEM YOU NEED TO ENCOURAGE THE MANUFACTURER TO FIND THE PROBLEM!IN A LETTER FROM NHTSA SENT TO MY STATE REP CASS BALLENGER IT WAS STATED THAT THERE WHERE NUMEROUS COMPLAINTS \"ALLEGING\" STALLING LIKE THIS BUT THAT NO INVESTIGATION WAS BEING DONE SINCE IT WAS OF UNDETERMINED CAUSE!! I NEED HELP NOW!!!ANYONE THAT HAS AN IDEA WHAT IS WRONG PLEASE E-MAIL ME KELLISIG@BELLSOUTH.NET.   *NLM",
        "vin": "2B4GP45B1TR"
    }
]