[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2003",
        "dateOfIncident": "03/17/2003",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018783,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HYDROGEN SULFIDE TOXIC FUME,  IN 2003 JAGUAR XJ8.  I HAVE LEASED 8 JAGUARS NO PROBLEM UNTIL 2002 JAGUAR XJ8.  SHORTLY AFTER LEASE I NOTICED A SULFUR SMELL.  I WAS INFORMED IT COULD BE GAS OR EXHAUST FUMES FROM ANOTHER VEHICLE.   THE CAR CONTINUED TO SMELL, THANKSGIVING A GUEST IN CAR  BECAME PHYSICALLY ILL. THE CAR WAS TAKEN FOR SERVICE.   AFTER NEGOTIATION, PLUS THE ADDITIONAL CORPORATE LEASED AUTO, DEARLERSHIP RELEASED ME FROM 2002 LEASE. I SIGNED A NEW LEASE FOR A 2003 JAGUAR FOR 3 YEARS.      IN MARCH WITH LESS THAN 2700 MILES I HAVE THE SAME PROBLEM WITH SULFUR SMELL.   MAGGIE HARLOW, GENERAL MANAGER JAGUAR LOU, SHARED WITH ME A ONE PAGE DIRECTIVE FROM JAGUAR STATING HOW TO COPE WITH THIS PROBLEM IN 2002.  I WENT DIRECTLY TO JAGUAR THROUGH EMAIL.  MR. MANNY BELTRAN RESPONDED.        MR. BELTRAN SET UP AN APPOINTMENT FOR SERVICE AT JAGUAR LOU.  JAGUAR AREA SERVICE MANGER, JOHN ZIMMERMAN, WOULD BE THERE TO INSPECT THE CAR.  ON 4/17/03, I SENT MR. BELTRAN ANOTHER EMAIL HIS RESPONSE DEALERSHIP WAS TRYING TO FIND A SOLUTION TO THE PROBLEM.      ON 4/21/03, ELLIOTT, JAGUAR LOU SERVICE MANAGER, STATED THE SULFUR PROBLEMS USUALLY WENT AWAY AFTER 6,00 TO 10,000 MILES.  THIS WAS THE FIRST THIS INFORMATION HAD BEEN REVEALED TO ME; ELLIOTT SUGGESTED THAT HE REMOVE THE CATALYTIC CONVERTER FROM AN OLDER JAGUAR.  AFTER REQUESTION CONFIRMATION OF PROBLEM WITH CATALYTIC CONVERTER, MAGGIE PHONED ME.   MAGGIE CONCURRED THERE WAS AN ODOR THAT I BASICALLY HAD TO LIVE WITH IT, JAGUAR WOULD NOT REPLACE THE CATALYTIC CONVERTER. I  REQUESTED JOHN ZIMMERMAN PHONE ME.  AFTER 3 DAYS NO ONE HAD RETURNED CALL.    I PURCHASED A NEW BMW ON 4/28/03.  ON 4/29/03, MY ATTORNEY RECEIVED A LETTER FROM MAGGIE WITH THE OFFER TO EXCHANGE THE CATALYTIC CONVERTER.  THE 2003 JAGUAR IS AT JAGUAR LOUISVILLE.  I FEEL THE FAIR RESPONSIBLE SOLUTION IS THAT I BE RELEASED  WITHOUT CHARGE FROM THE LEASE.  I LEASED THIS CAR, PLUS ADDITIONAL CORPORATE CAR IN GOOD FAITH.  *NLM",
        "vin": "SAJDA14C73L"
    }
]