[
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2003",
        "dateOfIncident": "05/16/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018815,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1999 DODGE DURANGO. I HAVE HAD ALOT OF TROUBLE WITH IT. AT FIRST WHEN I WOULD CALL OR TAKE IT BY THE DEALERSHIP, THEY WOULD TELL ME THAT NOTHING WAS WRONG. THE FIRST PROBLEM WAS WITH THE STEERING WHEEL MAKING A RATTLING NOISE BETWEEN 20-30 MPH. THEY FIRST TOLD ME NOTHING WAS WRONG IT WAS TIRE NOISE. THEN I BROUGHT IT BACK A WEEK LATER AND THEY REPLACED THE CATALYTIC CONVERTER. WHEN IT WAS STILL DOING IT A WEEK LATER, I TOOK IT TO ANOTHER DEALER AND THE STEERING COLUMN WAS FOUND TO BE BENT AND REPLACED. NOT LONG AFTER THAT I HAD TROUBLE WITH THE ENGINE, WHEN I WOULD STOP, THE ENGINE WOULD IDLE DOWN AND ALMOST STALL. I STOPPED AT A GAS STATION AND FOUND I HAD NO OIL. I PUT IN TWO QUARTS AND CALLED THE DEALER. THEY FOUND THE PLENUM GASKET HAD A LEAK.  I HAD THAT REPLACED FOR OVER $450. SHORTLY AFTER THAT I WAS TRAVELING HOME ON THE HIGHWAY AND IT HESITATED AND THE CHECK ENGINE LIGHT CAME ON. I TOOK IT INTO THE DEALER AND THEY RAN A DIAGNOSTICS TEST AND COULDN'T FIND ANYTHING WRONG. I NOTICE THAT THE RPM'S HAD STARTED REVVING UP AND DOWN WHILE YOU WERE DRIVING RIGHT AFTER THIS HAPPEN. I CALLED AND QUESTIONED ABOUT IT AND THEY SAID TO CHANGE THE OIL. IT STILL DID IT AFTER AN OIL CHANGE.  WHILE ON OUR WAY HOME TO NY, WE HAD STOPPED AND IT STALLED IN THE MIDDLE OF THE ROAD AND THE CHECK ENGINE LIGHT CAME ON AGAIN. WHEN WE GOT HOME I TOOK IT IN AND HAD ANOTHER  TEST DONE ON IT. THEY REPLACED THE OUTPUT SPEED SENSOR AND SAID THAT WAS GOING TO FIX IT.  IT STILL DID THE RPM THING AFTER THAT, AND THEY TOLD ME THAT I WOULD HAVE TO PAY FOR ANOTHER DIAGNOSTICS TEST. I HAVE SINCE, GOTTEN A TUNE UP AND OIL CHANGE, AND IT STILL DOES IT.  THE CHECK ENGINE LIGHT KEEPS COMING ON AND GOING OFF. I AM SORRY THAT THIS IS SO LONG, BUT I FEEL LIKE I HAVE TRIED EVERYTHING AND NO ONE WILL HELP. MY QUESTIONS ARE, HAVE YOU HEARD OF ANYTHING LIKE THESE PROBLEMS BEFORE, ARE THERE ANY RELATED RECALLS, AND IS THERE ANYTHING YOU CAN DO TO HELP GET THIS RESOLVED? I WOULD APPRECIATE ANY HELP!   *NLM",
        "vin": "1B4HS28Y7XF"
    }
]