[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2003",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018787,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "RAM 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CUP HOLDER IN MY 1997 DODGE RAM 3/4 TON PICKUP IS NOT PROPERLY DESIGNED. AS SUPPLIED THE CUP HOLDER HAS CUT OUTS ON THE SIDES.  THE CUP HOLDER ALSO HAS A BASE PLATE THAT SUPPORTS THE BOTTOM OF THE CUP. THE  BASE PLATE DOES NOT ALLOW  CUPS TO FIT LOW ENOUGH INTO THE HOLDER TO ENABLE THE FRONT AND BACK PORTIONS OF THE CUP HOLDER TO MAKE GOOD CONTACT. TALLER CUPS LIKE THE TYPICAL FAST FOOD DRINK CUP  IS ONLY SUPPORTED BY THE BOTTOM WITH NO SIDE SUPPORT OR JUST AROUND THE RING WHERE THE CUP CHANGES SIZES IN THE CASE OF THE LARGER CUPS. WITH THE MAJORITY OF COFFEE CUPS THE CUP HOLDER PROVIDES SUPPORT IN ONLY A COUPLE OF LOCATIONS. THE PROBLEM IS WHEN THE CUP HOLDER IS IN USE AS DESIGNED AND THE DRIVER MAKES A RIGHT OR LEFT TURN AT NORMAL DRIVING SPEEDS THE CUP WILL FLIP OUT OF THE CUP HOLDER SPILLING THE CONTENTS ON THE OCCUPANTS AND THE ELECTRONIC SYSTEMS OF THE VEHICLE. THIS HAS HAPPENED A NUMBER OF TIMES IN MY VEHICLE. I HAVE NOT HAD A MOTOR VEHICLE ACCIDENT INVOLVING OTHER VEHICLES BUT HAVE SUSTAINED COMPREHENSIVE DAMAGE DUE TO A SOFT DRINK BEING SPILLED IN THE RADIO/CD/TAPE PLAYER. I HAVE NOT MET ANYONE YET WHO OWNS OR OWNED A DODGE PICKUP OF THIS BODY STYLE THAT HAS NOT EXPERIENCED THIS SAME PROBLEM. AN EMPLOYEE AT THE DEALERSHIP I PURCHASED THIS VEHICLE FROM IN 1998 AGREED THAT THE CUP HOLDER WAS UNSAFE AND POORLY DESIGNED WHEN I BROUGHT THE VEHICLE IN THE FIRST TIME THIS HAPPENED TO ME RESULTING IN THE DESTRUCTION OF THE SOUND SYSTEM. WHEN I TRIED TO INFORM PEOPLE ABOUT THE PROBLEM THE DEALER THREATENED TO SUE ME. THE DODGE CORPORATION COMPLAINT HOT LINE INDICATED THAT I WAS THE ONLY PERSON WHO HAD EVER CALLED AND COMPLAINED WHEN I CALLED IN THE SPRING OF 1999.   *NLM",
        "vin": "3B7KF23DXVG"
    }
]