[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2003",
        "dateOfIncident": "04/30/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018822,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTOMATIC TRANSMISSION FAILED AT APPROXIMATELY 57,000 MILES ON MY 2001 INTREPID R/T.  I WAS AT A STOPLIGHT AND IT WAS LIKE I HIT SOMETHING.  I COULD ONLY MOVE IN 3RD GEAR AT THAT POINT.  I TOOK MY CAR TO A TRANSMISSION SHOP, AND THEY PROCEEDED WITH REPAIRS.  AFTER REMOVING AND COMPLETELY TEARING DOWN MY TRANSMISSION, I WAS OFFERED TWO OPTIONS.  THE FIRST WAS A STOCK REBUILD, JUST AS IT CAME FROM THE MANUFACTURER.  IT WAS THE OPTION I CHOSE AND COST ME $1800 AFTER TAXES.  THE OTHER OPTION WAS REPLACING THE SAME PARTS, BUT WITH UPDATES THAT ARE RECOMMENDED BY DAIMLER CHRYSLER.  THAT OPTION WAS $2200 BEFORE TAXES.  THE INTERESTING THING IS THAT DAIMLER CHRYSLER KNOWS ABOUT THE PROBLEMS IF THEY RECOMMEND THE UPDATES.  THE TRANSMISSION SHOP KNEW OF THE PROBLEMS BECAUSE THE OPTION I CHOSE CARRIED A 6 MONTH/6,000 MILE WARRANTY.  THE OTHER (UPDATED) OPTION CARRIED A 3YR/36,000 MILE WARRANTY.  THEY KNOW THAT THOSE PARTS ARE MOST LIKELY TO FAIL AGAIN, HENCE THE SHORT 6 MONTH WARRANTY.  I HAVE A FEW OF THE PARTS SAVED FROM THE REPAIRS.  ONE OF THE PLANETARY GEARS IS COMPLETELY DESTROYED, IN MANY PIECES.  THE GEARS ARE WORN SEVERELY.  I CAN SUPPLY PICTURES OF THESE IF NEEDED.  I HAVE BEEN IN CONTACT WITH DAIMLER CHRYSLER THROUGH THEIR CUSTOMER ASSISTANCE WEBSITE AND HAVE COMPLETE DOCUMENTATION OF OUR DISCUSSIONS, WORD FOR WORD.  THEY BLAMED IT ON EVERYTHING EXCEPT THEMSELVES.  THE REPRESENTATIVE EVEN TOOK A CONDESCENDING TONE TOWARDS ME IN HIS LAST REPLY.  THIS IS OBVIOUSLY A PROBLEM THEY ARE AWARE OF, OTHER CUSTOMERS ARE HAVING, AND WILL CONTINUE TO BE A PROBLEM AS LONG AS THEY USE THE 42 LE TRANSMISSION.   *NLM",
        "vin": "2B3HD76VX1H"
    }
]