[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/19/2003",
        "dateOfIncident": "10/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018916,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A VIBRATION IN THE REAR OF MY TRUCK WHEN BRAKING FROM HIGHWAY SPEED...USUALLY AROUND 45 MPH IT FEELS LIKE THE RIGHT REAR TIRE IS BOUNCING.  I  HAD THE REAR DRUMS REPLACED PER THE MOST RECENT TSB, I HAD THE FRONT END ALIGNED AND TIRES BALANCED.  THE BOUNCE IS STILL THERE.    THE LOCAL TOYOTA DEALER TRIED TO CONVINCE ME THAT THERE IS NO PROBLEM.  HE WANTS ME TO BELIEVE WHAT I FEEL IS NORMAL ABS SENSATIONS.  THIS DOESN'T HOLD WATER BECAUSE THE VIBRATION IS THERE WHEN APPLYING THE PARKING BRAKE AND ALLOWING IT TO SLOW THE TRUCK FROM HIGHWAY SPEED.    I CALLED TOYOTA AND FILED A COMPLAINT ON MARCH 3.  AFTER TWO MONTHS OF NOT HEARING ANYTHING (NOTHING...NOT A WORD), I CALLED TOYOTA BACK AND WAS TOLD THAT THE DEALER RESPONDED TO THEM.  THE DEALER SAID THERE WAS NO PROBLEM THAT WHAT I WAS FEELING IS ABS.    I EXPLAINED TO TOYOTA THAT THIS COULDN'T BE THE CASE....THE BOUNCE EXISTS WHEN BRAKING FROM HIGHWAY SPEED USING THE PARKING BRAKE.  THEY SENT ANOTHER INQUIRY TO THE DEALER BECAUSE THE DEALER INDICATED THEY WOULD CALL ME AND HAVE ME RIDE WITH THE DISTRICT MANAGER.    ELEVEN DAYS LATER AND I STILL HAVEN'T HEARD ANYTHING.  I CALLED TOYOTA AGAIN TODAY.  I WAS TOLD THAT THE DEALER INDICATES THAT THEIR MASTER MECHANIC HAS DRIVEN THE TRUCK AND CAN'T FIND ANYTHING WRONG WITH MY TRUCK.  MY TRUCK HASN'T BEEN TO THE DEALER SINCE FEBRUARY WHEN THE SERVICE MANAGER FIRST TOLD ME THE PROBLEM WAS ANTI-LOCK BRAKES.  THE CUSTOMER SERVICE REP WITH TOYOTA OFFERED TO ESCALATE THE COMPLAINT FURTHER UP THE LADDER TO TOYOTA REGIONAL...WHATEVER THIS MEANS.  HE SAID SOMEONE SHOULD CONTACT ME WITHIN THE NEXT 3-4 DAYS.    THE REAR END OF THE VEHICLE BOUNCES ENOUGH TO CONCERN ME ABOUT THE SAFETY OF THE VEHICLE.  I AM PARTICULARLY CONCERNED ABOUT BRAKING ON WET ROADS GOING AROUND CURVES.    I JUST WANT THE NHTSA TO BE AWARE OF THIS ISSUE.  *JB",
        "vin": "5TBBT48141S"
    }
]