[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/17/2003",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018858,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK DELIVERY OF NEW ACURA 2003 3.2TL TYPE S ON MAY 10, 2002.  WITH ABOUT 7,000 MILES ON VEHICLE STARTED TO NOTICE SLIGHT \"SHIMMY\" / \"SHUTTER\" WHEN APPLYING BRAKES...GREATER IMPACT AT SPEEDS 40 - 70MPH.  THIS INDICATES WARPED BRAKE ROTORS.  FINALLY INSISTED THAT DEALER ADDRESS ISSUE.  DEALER FIRST OFFERED TO \"TURN\" ROTORS; I DECLINED AND ASKED THAT THEY CONTACT HONDA FOR REPLACEMENT OF ROTORS.  HONDA AGREED ON, \"GOOD-WILL ONE TIME BASIS.\"  FURTURE WARRANTY COVERAGE WILL BE BY \"TURNING\" ROTORS.   ROTORS AND BRAKE PADS REPLACED AT 9,675 MILES.  I HAVE BEEN TOLD THAT THE CAUSE IS \"OWNER DISTINCTIVE DRIVING HABITS.\"  WHEN ASKED FOR A DEFINITION, I WAS TOLD THAT I MUST LIVE ON AND OR DRIVE ON LONG - STEEP HILLS WHICH NECESSITATES EXTENED USE OF BRAKES.  THIS IS TOTALLY INCORRECT AND THEY WERE ADVISED OF THAT. IF NORMAL USE OF THE BRAKES WILL CAUSE WARPING, THEN THE BRAKES ARE NOT FIT FOR THEIR IMPLIED USAGE AS DEFINED UNDER THE UNIFORM COMMERICAL CODE-IMPLIED WARRANTY MECHANTABILITY.  IN DISCUSSION WITH A MEMBER OF THE ACURA STAFF, IT WAS DISCLOSED THAT ABOUT 50% OF THE VEHICLES EXPERIENCE THIS PROBLEM.  HONDA/ACURA TECHNICAL SERVICE BULLETINS HAVE BEEN MADE UNAVAILABLE TO CONSUMERS; HOWEVER, I HAVE BEEN ADVISED THAT THE TSB ADDRESSING THIS ISSUE CALLS FOR ROTOR REPLACEMENT OR \"TURNING\" ROTORS.  IT IS CLEAR THAT HONDA/ACURA IS IN IT'S NORMAL MODE OF DENIAL OF A PROBLEM.  A PROBLEM  WHICH IS MOST LIKELY CAUSED BY ENGINEERING DESIGN DEFECT AND/OR IMPROPER HEAT TREATMENT/HARDENING OF THE ROTOR MATERIAL IN CONJUNCITION WITH THE COMPOSITION OF THE BRAKE PAD MATERIAL.  THIS IS A SERIOUS DEFECT AND SAFETY HAZARD.",
        "vin": "19UUA568X3A"
    }
]