[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "05/08/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "98",
                "productYear": "1993",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING TO ENTER A HIGHWAY, THERE WAS A LOUD \"CLUNK\" AND ALL CONTROL WAS LOST AS I ENTERED THE HIGH SPEED LANE.  THE ENGINE QUIT, NO BRAKES AND THE STEERING WHEEL JUST TURNED FREELY AND THE CAR ROLLED TO A STOP IN THE HIGH SPEED LANE.  IT TURNED OUT THAT THE REAR FRAME BOLTS UNDER THE ENGINE FAILED AND FRAME AND ENGINE FELL DOWN, DISCONNECTIONS THE STEERING.  LUCKILY, NO ONE WAS HURT AS OTHERS STOPPED TO DIRECT TRAFFIC AND PUSH THE CAR TO THE SIDE OF THE ROAD.  THE CAR IS IN NEAR PERFECT CONDITION, NO VISIBLE RUST, NO FLUID LEAKS AND HAS ONLY 140,000 MILES.  IT APPEARS THAT THE DESIGN MECHANISM TO MAKE THE ENGINE DROP IN A CRASH(TO PROTECT THE DRIVER) FAILED (RUSTED) WAY BEFORE IT SHOULD HAVE.  THE OLDSMOBILE HOTLINE SAID THE CAR WAS PAST THE 100,000 RUST WARRANTY, WHAT DID I EXPECT?  I HAVE HAD 3 OTHER OLDSMOBILES AND PUT OVER 250,000 MILES ON EACH ONE AND CERTAINLY EXPECTED SIMILAR RESULTS FROM THIS ONE. I BELIEVE THAT THE FRAME SHOULD NOT RUST OUT AND HAVE THE ENGINE FALL OUT BEFORE ANY OF THE NORMAL HIGH MILEAGE FAILURES SUCH AS TRANSMISSION, ENGINE, RADIATOR OR EVEN THE FAILURE OF THE BATTERY IN THE REMOTE LOCKING DEVICE.  I BELIEVE THAT OLDSMOBILE SHOULD BEAR THE COST OF SOME OR ALL THE CHARGES TO REPAIR THIS.  HAD IT HAPPENED 5 MINUTES LATER, I WOULD HAVE BEEN TRAVELING AT 70 MPH AND THERE WOULD HAVE BEEN A TRAGEDY.  IF THERE IS A GENERAL DEFECT, ALL OTHER OWNERS SHOULD BE NOTIFIED.    *NLM",
        "vin": "1G3CV531XP4"
    }
]