[
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "05/20/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019010,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "SPORT UTILITY",
                "productYear": "1979",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE HAD MY VEHICLE INTO TWO PLACES FOR UNDERBODY INSPECTIONS AND M-59 DODGE TOLD ME MY BALL JOINTS (UPPER & LOWER) AND CONTROL ARMS WOULD NEED TO BE REPLACED.  I HAD M-59 DODGE REPLACE THEM ONCE AT 44,000 MILES ON MY '99 DURANGO AND NOW AT 77,000 THEY SAY THEY NEED IT AGAIN?  SO, I TOOK IT INTO ANDERSON DODGE FOR A SECOND OPINION AND THEY SAID THEY WERE FINE (GOOD) ACTUALLY.  SO, I CHECKED DEFECTS OFF THE NHSTA WEBSITE AND SAW SEVERAL INSTANCES OF BALL JOINTS FAILING AT EVERY 30,000 MILES.  SO, I CALLED A DODGE PARTS DEPARTMENT AND ASKED WHAT THE PART #S WERE FOR BALL JOINTS AND CONTROL ARMS FOR A '99 DURANGO AND FOR A '99 DAKOTA (4X4) AND GUESS WHAT THEY ARE THE SAME NUMBERS?????  LET ME GUESS, DESIGN THE 4X4 DAKOTA AND JUST ADD ALL THAT WEIGHT AND MOMENT ARMS OF THE BACK OF THE SUV TOP AND LIFT GATE AND NOT EXPECT THE EQUATIONS TO CHANGE FOR WEAR AND TEAR OF THE FRONT SUSPENSION??????  AND THEN I FOUND OUT THAT THE SUSPENSION WAS MODIFIED IN THE 2000 MODEL YEAR.  WHAT A SURPRISE???  I WONDER IF NHSTA WOULD BE INTERESTED IN MY FINDINGS??????  NOW I AM GOING TO A THIRD DODGE DEALER FOR ANOTHER INSPECTION TO SEE IF I REALLY DO HAVE A PROBLEM WITH BALL JOINTS AND CONTROL ARMS.  IF THESE BALL JOINTS I HAVE NOW ARE OK, I WANT TO KNOW IF I CAN TAP THEM AND PUT IN A GREASE FITTING IN ORDER TO EXTEND THE LIFE OF THEM.  IF HOWEVER, THEY ARE NOT OK, I AM GOING TO FILE A COMPLAINT WITH NHTSA AND SHOW THEM MY FINDINGS.  I BELIEVE A DESIGN FLAW SHOULD BE A RECALL.   *NLM",
        "vin": "1B4HS28Z8XF"
    }
]