[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "04/30/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019003,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 1998 NISSAN PATHFINDER, WITH NO WARNING, THE VEHICLE BEGAN BUCKING AND STALLING UNTIL IT WOULD NOT DRIVE.  THE CAR WAS TOWED TO THE LOCAL NISSAN DEALERSHIP.  THE NEXT DAY, WE RECEIVED TELEPHONE CALL FROM THE SERVICE DEPT WHO INFORMED US THAT THE TRANSFER CASE WAS DAMAGED.  THE SERVICE REP TOLD ME THAT THERE WAS AN INTERNAL DEFECT ON THE PART AND THAT THE PROBLEM WAS VERY UNCOMMON.  THE TRANSFER CASE IS ASSOCIATED WITH THE FOUR WHEEL DRIVE ON THE PATHFINDER - WHICH IS SOMETHING WE HAVE PROBABLY USED LESS THAN 10 TIMES IN THE 4 1/2 YEARS THAT WE HAVE DRIVEN THE CAR.  PARTS AND LABOR ON THIS REPAIR WOULD BE APPROXIMATELY $2,500.  I ASKED FOR NISSAN'S CUSTOMER SERVICE NUMBER AND CONTACTED THEM IMMEDIATELY.  WE WERE TOLD THAT THE PART HAD TO BE SPECIALLY ORDERED AND WOULD  NOT BE FIXED FOR 4-5 DAYS.  ON THE 4TH DAY, WE WERE CONTACTED BY THE SERVICE DEPT TO INFORM US THAT THEY HAD REPLACED THE PART, BUT THAT THE TRANSFER CASE HAD APPARENTLY DAMAGED THE TRANSMISSION AND THAT HAD TO BE REPLACED.  THIS WOULD BE THE TOTAL OF REPAIRS TO  APPROX $5,000.  AGAIN, I CONTACTED THE NISSAN'S CUSTOMER SERVICE BECAUSE I HAD NOT GOTTEN A TELEPHONE CALL FROM MY ORIGINAL CALL.  WHEN WE FINALLY REACHED SOMEONE AT THE CUSTOMER SERVICE DEPT WE EXPLAINED THAT WE HAD GOTTEN ALL THE RECOMMENDED PREVENTATIVE MAINTENACE ON THE PATHFINDER.  THIS WAS ALSO THE 3RD NISSAN WE HAD PURCHASED AND UP UNTIL NOW HAD BEEN VERY SATISFIED WITH THEIR RELIABILITY.  GIVEN OUR PURCHASE AND MAINTENANCE HISTORY,WE WERE LED TO BELIEVE FROM THE SERVICE DEPT THAT NISSAN WOULD GIVE US A BREAK ON THE REPAIRS.  IN ADDITION, WE ALSO BELIEVE THAT THE DEFECT SHOULD HAVE BEEN DETECTED DURING OUR REGULAR PREVENTATIVE MAINTENANCE (WHICH TOTALS IN THE THOUSANDS OF DOLLARS) AND THAT WHAT WAS AN OTHERWISE WELL MAINTAINED TRANSMISSION WAS RUINED BY A DEFECTIVE PRODUCT.  NISSAN'S FINAL RESPONSE WAS THAT WE WERE OUT OF WARRANTY AND THEY WOULD DO NOTHING FOR US.  WHY WAS A DEFECTIVE PRODUCT NOT RECALLED?  *NLM",
        "vin": "JN8AR05Y8WW"
    }
]