[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "05/19/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018995,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "1996",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "ATX II",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE TRAVELING ON I-10 WESTBOUND, JUST WEST OF TALLAHASSEE FL, THE TREAD SUDDENLY SEPARATED FROM MY LEFT REAR TIRE, CAUSING ME TO LOSE CONTROL FOR A FEW SECONDS. BECAUSE THERE WAS NO OTHER TRAFFIC NEARBY, AND I DIDN'T USE MY BRAKES TO SLOW DOWN, DAMAGE WAS CONFINED TO MY LEFT REAR FENDER AND WHEEL WELL. MY SPEED WAS AROUND 75 MPH,  THE HIGHWAY WAS STRAIGHT, MY TIRE PRESSURE WAS 32 PSI (COLD). I WASN'T SURE WHAT HAD HAPPENED, BUT WHEN THE THUMPING ON THE UNDERCARRIAGE OF MY TRUCK STOPPED, I CHECKED  BEHIND ME AND SAW A TIRE TREAD BELT ON THE HIGHWAY. NOT SURE IF IT WAS MY OWN, OR ALREADY ON THE HIGHWAY, USING A LOWER RATE OF SPEED, I PROCEEDED TO THE NEXT REST AREA, (37 MILES), WHERE I VERIFIED WHAT HAD HAPPENED. UNABLE TO BREAK LOOSE THE LUG NUTS, I PROCEEDED TO THE NEAREST EXIT WHERE I COULD HAVE THE TIRE CHANGED, (ABOUT 20 MILES?) DRIVING 50-55 MPH. THIS TIRE IS A FIRESTONE ATX II, SIZE 215/75R/15, ONE OF A PAIR I HAD PURCHASED AS REPLACEMENT TIRES ON 08/19/99. I HAD INQUIRED FOUR TIMES SINCE THE RECALL HAD BEGUN IN 2000 THROUGH 2001, ABOUT HAVING THEM REPLACED BUT WAS TOLD THIS SIZE WAS NOT ON THE LIST. ON THE LAST TRY, THE TIRE DEALER TRIED TO CONVINCE ME THAT FIRESTONE HAD NEVER MADE SUCH A TIRE, UNTIL I ASKED HIM TO CHECK HIS RECORDS FOR AUGUST OF 1999! MY TRUCK: 1996 DODGE DAKOTA SPORT, MILEAGE: 87000. VIN # 1BFL26XOTW700488. TIRES: ATX II SIZE 215/75R15, MILES 38,000, DOT# W2------. I AM IN THE PROCESS OF CONTACTING A FIRESTONE DEALERSHIP OR THE FIRESTONE CO. CONSUMER LINE.  *NLM",
        "vin": "1B7FL26X0TW"
    }
]