[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "05/19/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2003 YUKON XL HAS AN ABSOLUTELY INTOLERABLE CAB REVERBERATION PROBLEM ! THIS DEFECT CAUSES THE DRIVER AND PASSENGERS A THUMPING EAR PAIN ! I LITERALLY CANNOT DRIVE 1 BLOCK WITHOUT A THUMPING SENSATION IN MY EARS. THIS VEHICLE WAS LEFT AT THE DEALER FOR 4 DAYS, ONLY TO BE TOLD THAT THE SERVICE DEPARTMENT COULD NOT FIX THE PROBLEM ! OF COURSE, I WAS NOT SATISFIED ! THIS VEHICLE WAS ONLY TWO WEEKS OLD ! I WAS INFORMED BY THE SERVICE DEPARTMENT THAT I WOULD HAVE TO LIVE WITH THIS UNTIL THE GM ENGINEERS COULD FIND A FIX. I WAS ALSO INFORMED THAT THIS WAS NOT HIGH ON THE LIST OF PROBLEMS TO SOLVE ! THE DEALERSHIP REFUSED TO HELP ME AT ALL. THE SALES DEPARTMENT WOULD NOT TAKE THE VEHICLE BACK. I CALLED GM WHO HAS SENT ME TO ONE DEPARTMENT AFTER ANOTHER FOR THE PAST TWO WEEKS. STILL NO RESOLUTION! UPON NOTIFYING GM THAT I NEEDED TO SEEK A DOCTORS CARE FOR THE UNBEARABLE EAR PAIN WHEN DRIVING THIS VEHICLE, I WAS SENT TO THE DEPARTMENT FOR COMPLAINT ALLEGATIONS. THIS DEPARTMENT SIMPLY WANTED TO ACCESS THEIR RISKS OF LOSS ! STILL NOTHING RESOLVED. I HAVE ASKED GM TO SIMPLY \" DO THE RIGHT THING \". I DON'T THINK THAT THIS ISSUE SHOULD COME DOWN TO ANY TYPE OF LAW SUIT. HOWEVER, IT APPEARS AT THIS POINT, THAT A LAW SUIT MAY INDEED BE THE ONLY WAY TO GET THE MATTER RESOLVED. I PROPOSE TO THE NHTSA THAT THIS DEFECT ( IN ALL 2003 SUBURBAN AND YUKON XL MODELS ) SHOULD WARRANT AN INVESTIGATION AS TO POSSIBLE RECALL.  AS YOU CAN TELL, I AM VERY UPSET AT THE POOR QUALITY OF CUSTOMER SERVICE I HAVE RECEIVED FROM BROWN AND WOOD DEALERSHIP IN GREENEVILLE, NC AND  GM. IT APPEARS THAT NEITHER PARTY WISHES TO BE RESPONSIBLE.  CYNDI BOWEN .    *NLM",
        "vin": "1GKEC16ZX3J"
    }
]