[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "05/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD LEAKS CAN LEAD TO ANY NUMBER OF VERY SERIOUS, AND EXPENSIVE, PROBLEMS. WHILE THE PART ITSELF ISN'T COSTLY, THE LABOR TO REPAIR IT IS VERY INTENSIVE, AND HAS BEEN QUOTED AROUND $800 USD (GIVE OR TAKE A COUPLE HUNDRED DEPENDING ON THE VEHICLE). THIS IS IN ADDITION TO ANY OTHER COSTLY PROBLEM(S) THE INTAKE MANIFOLD GASKET LEAK MAY HAVE PRODUCED.   WE ARE DEMANDING ACCOUNTABILITY FROM GENERAL MOTORS. A NATIONWIDE BACKORDER SHOULD BE REASON ENOUGH FOR GM TO ASSEMBLE A RECALL. WE CAN ONLY HOPE THAT THE WORLD'S LARGEST VEHICLE MANUFACTURER\u001d WHO \u001cHAS BEEN THE WORLD'S AUTOMOTIVE SALES LEADER SINCE 1931\u001d WILL STAND UP AND CLAIM RESPONSIBILITY FOR A PROBLEM THAT IS SO PREVALENT AMONG THEIR VEHICLES. RECALLS SHOULD BE MANDATED IN ALL CASES OF INCOMPETENCE, NOT SOLELY WHEN IT AFFECTS PUBLIC SAFETY.  WHILE SOME OF US HAVE BEEN FORTUNATE ENOUGH TO HAVE THIS PROBLEM OCCUR WITHIN OUR WARRANTY, THERE ARE MANY OTHERS OF US THAT HAVE HAD TO PAY FOR THESE EXPENSIVE REPAIRS JUST AFTER THE WARRANTY EXPIRES. BECAUSE GM HAS REFUSED TO ADMIT LIABILITY ON THIS ISSUE, WE FEEL THAT THIS WILL BE A REPETITIVE PROBLEM. ONCE THIS GASKET HAS BEEN REPLACED, AND CUSTOMERS POCKETS DRAINED, GM SERVICE CENTERS EVERYWHERE CAN EXPECT TO SEE CONSUMERS RETURNING, FOR THIS SAME PROBLEM THAT HASN'T BEEN RECTIFIED DUE TO A DESIGNING FLAW ON GM'S PART. THIS ERROR SHOULD HAVE BEEN CORRECTED, NOT THE FIRST TIME IN FOR SERVICE, BUT BEFORE ENTERING MASS PRODUCTION IN MILLIONS OF VEHICLES.  CAN ONE PRESUME THIS IS ONE WAY OF KEEPING GENERAL MOTORS PATRONS COMING BACK TIME AFTER TIME?  *NLM",
        "vin": ""
    }
]