[
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/22/2003",
        "dateOfIncident": "10/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "1996",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD MOTOR COMPANY",
                "productModel": "AFTERMARKET TRAILER HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE ENGINE IN THE 1996 LINCOLN TOWN CAR IS FAULTY AND SHOULD BE INVESTIGATED. I HAD 80,000 MILES ON MY ENGINE WHEN THE ENGINE THREW A ROD.  I HAVE SPOKEN TO SEVERAL MECHANICS, WHO STATED THAT THE ENGINE IS THE SAME AS THE ENGINE PLACED INSIDE OF 1995 THROUGH PRESENT FORD CROWN VICTORIA'S.  ON PERSON TOLD ME NO MATTER HOW WELL I TOOK CARE OF MY VEHICLE THE ENGINE WAS MADE TO FAIL.  I CHANGED THE OIL IN THE VEHICLE EVERY 3,000 MILES AND WITHOUT FAIL.  WHAT EVER MY MAINTENANCE BOOK RECOMMENDED, I DID.  I HAD AN EXTENDED WARRANTY UNTIL 75,000 MILES.  THE VEHICLE ENGINE FAILED AT EXACTLY 80,000 MILES.  I CONTACTED LINCOLN MERCURY DIVISION AND WAS TOLD, \"OH WELL, YOUR VEHICLE HAS 80,000 MILES.   THIS MAY SEEM LIKE A LOT OF MILES, BUT I SHOULD STILL BE ABLE TO DRIVE THE VEHICLE FOR ANOTHER 80,000 WITHOUT THE ENGINE FAILING.  I SPOKE TO A MECHANIC THAT INSTALLS ENGINES FOR YELLOW CAB IN SAN FRANCISCO.  HE ADVISED ME THAT THEY HAVE CRATES OF ENGINE BLOCKS FOR THE FORD CROWN VICTORIA'S, BECAUSE THE ENGINE FAILS BETWEEN 75,000 AND 80,000 MILES.  THIS IS RIDICULOUS.",
        "vin": "1LNLM82W1TY"
    }
]