[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/21/2003",
        "dateOfIncident": "05/20/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019063,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST FEW WEEKS, MY 1999 TOYOTA COROLLA VE HAS BEEN MAKING A SQUEAKING NOISE UNDERNEATH THE CAR WHENEVER I DRIVE OVER BUMPS IN THE ROAD, OR UNEVEN PATCHES IN THE ROAD, OR WHENEVER I AM DRIVING AROUND A SHARP CURVE.  WHEN I TOOK THE CAR FOR ITS 40,000 MILE OIL CHANGE AND MAINTENANCE YESTERDAY (MAY 21, 2003) THE SERVICE DEALER TOLD ME THAT IT WAS THE STEERING RACK END, ALSO KNOWN AS THE LOWER CONTROL ARMS.  THIS IS PART OF THE SUSPENSION.  I TOOK IT TO TOYOTA OF CLEVELAND IN CLEVELAND, TN.  THE MAN IN THE SERVICE DEPARTMENT TOLD ME THAT TOYOTA HAD ISSUED A TECHNICAL SERVICE BULLETIN WHICH STATED THAT THIS HAD BEEN A PROBLEM IN COROLLA'S.  HE SAID IT WAS NOT TECHNICALLY CONSIDERED A \"RECALL\" AND THAT APPARENTLY THE MANUFACTURER DID NOT CONSIDER IT ENOUGH OF A PROBLEM TO ISSUE A RECALL.  ALTHOUGH HE TOLD ME THAT IT HAS BEEN A PROBLEM IN A LOT OF COROLLAS.  HE CLAIMED THAT IT WAS MERELY COSMETIC, THAT IT WOULD JUST MAKE NOISE, AND THAT IT DID NOT REALLY NEED TO BE FIXED.  HE SAID THEY WOULD FIX IT FOR FREE ONLY IF THE MANUFACTURER ISSUED A RECALL.  ALTHOUGH HE DID TELL ME THAT IF I WANTED TO FIX IT, IT WOULD COST ABOUT $600 TO HAVE IT FIXED.  I ASKED HIM IF THEY WERE GOING BAD AND HE SAID, \"OH, NO.  IF THEY WERE GOING BAD YOU WOULD KNOW IT.  THEY WOULD START RATTLING REALLY LOUD AND SHAKING.\"  SO DOES THAT MEAN THAT EVENTUALLY THEY WILL GO BAD AND THAT I WILL HAVE TO PAY $600 OUT OF POCKET TO REPLACE THE STEERING RACK END ON A CAR THAT IS ONLY 4 YEARS OLD AND SUPPOSED TO BE ONE OF THE MOST RELIABLE BRANDS?  IF THIS IS SUCH A PROBLEM, I THINK TOYOTA SHOULD ISSUE A RECALL OF THIS PART AND FIX IT FOR FREE.*JB",
        "vin": "1NXBR12E9XZ"
    }
]