[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/23/2003",
        "dateOfIncident": "05/07/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019206,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "BLAZER",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "GM/CHEVROLET COVER-UP    ON MAY, 07, 2003 OUR 1997 CHEVY BLAZER WAS TAKEN IN FOR \"RECALL\" WORK. WIPERS,  ELECTRONIC MIRRORS AND BALL JOINTS. I MIGHT POINT OUT THAT THE CAR ONLY HAD 51,057 MILES ON IT AND BALL JOINTS NORMALLY LAST 100,000-150,000 MILES EASILY, WITH PROPER CARE. MY HUSBAND DAVID, WORKS AT PARKLAND NAT\u0019L AUTO AS THEIR MACHINIST (28 YEARS) AND OVERSEES THE 'SHOP', HENCE THAT IS WHERE MY VEHICLE GETS ITS LUBE, OIL AND FILTER WORK.     GM/CHEV COVERED ALL REPAIRS, EXCEPT THE LOWER BALL JOINTS. THEY\u0019VE REFUSED RESPONSIBILITY, UNUSUAL SINCE UPPERS AND LOWERS ALL WORK TOGETHER. THE UPPER BALL JOINTS WERE SHOT AND THE LOWER ONES WERE ABSOLUTELY THRASHED. SINCE THE CAR HAD BARELY 51,000 MILES ON IT, WE FELT THAT GM/CHEVROLET SHOULD COVER ALL COSTS DUE TO THE USE OF INFERIOR PARTS.    A WEEK AFTER REQUESTING COMPENSATION, WE WERE DENIED A REFUND.  GM INFORMED US THAT SERVICE MANAGER AT GILCHRIST CHEV IN TACOMA, TOLD THEM WE NEGLECTED SERVICE AND BECAUSE OF HIS STATEMENT THEY WOULD NOT HELP COMPENSATE US.    WE INSPECTED THE WORN OUT PARTS THAT GILCHRIST CHEVROLET HAD LEFT IN MY BLAZER. THE PARTS WERE GREASABLE AND STILL FULL OF GREASE! THE NEXT DAY (TUES. 5/20/03) I WENT INTO GILCHRIST CHEV TO SPEAK DIRECTLY WITH THE SERVICE MGR BOB CORNET. HE PERSONALLY, THAT TOLD GM, THAT REGARDLESS OF WHETHER OR NOT THE BALL JOINTS HAD BEEN MAINTAINED, THEY WERE SHOT AND REQUIRED REPLACEMENT. HE CLAIMED HE NEVER TOLD THEM THAT WE NEGLECTED MAINTENANCE. GM IS COVERING UP THEIR USE OF POOR QUALITY COMPONENTS IN THEIR VEHICLES, EXPECTING PEOPLE LIKE US TO FOOT THE BILL.    THEY ARE CLEAR TO STATE THAT THIS IS NOT A \u0018RECALL\u0019, HOWEVER THEY ARE MAKING REPAIRS FOR FREE.  IIF YOU\u0019VE ALREADY PAID FOR COVERED ITEMS THEY WILL REIMBURSE. STILL THEY  MAINTAIN THAT THE LOWER BALL JOINTS ARE NOT COVERED! IT'S A CASE OF INFERIOR PARTS BEING USED IN THE MANUFACTURING PROCESS AND THE COSTS BEING PASSED ALONG TO THE CONSUMER.    THE PUBLIC SHOULD KNOW OF GM/CHEVROLET\u0019S CURRENT PRACTICE.",
        "vin": "1GNDT13WXVK"
    }
]