[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/22/2003",
        "dateOfIncident": "05/21/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "MONTANA",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE MORNING OF MAY 21, 2003 AT APPROXIMATELY 11:25 A.M. EST, MY  PREGNANT WIFE OF NINE MONTHS, AND TWO CHILDREN AGES 3 AND 6 WERE DRIVING OUR 1999 PONTIAC MONTANA MINIVAN SOUTHBOUND ON US-131 IN THE GRAND RAPIDS, MI AREA.  AT APPROXIMATELY MILE MARKER 85 THE VEHICLE SUDDENLY DIED FOR NO APPARENT REASON AND WITH NO APPARENT WARNING.  SHE WAS TRAVELING 60 MPH IN THE FAR LEFT LANE OF A 6 LANE STRETCH OF WHAT IS KNOWN AS THE S-CURVE IN THIS AREA.  WITH NO POWER TO THE VEHICLE SHE SOMEHOW MANAGED TO SAFELY MANEUVER THE VAN ACROSS THREE LANES OF TRAFFIC AND EXIT AT FRANKLIN STREET.  WITH THE HELP OF A STATE TROOPER WE WERE ABLE TO MOVE THE VEHICLE (WHICH WAS BLOCKING THE EXIT RAMP) TO A SAFE PLACE UNTIL IT COULD BE TOWED.  UPON FURTHER INSPECTION BY A QUALIFIED GM DEALERSHIP TECHNICIAN THE FOLLOWING DAY, IT WAS DETERMINED THAT THE ENGINE COMPLETELY FAILED DUE TO A PROBLEM WITH A FAULTY INTAKE GASKET WHICH ALLOWED DEXCOOL COOLANT TO SEEP INTO THE ENGINE AND DESTROY CRITICAL COMPONENTS.  THIS IS APPARENTLY A PROBLEM THAT IS MORE THAN COMMON ON VEHICLES WITH THE SAME ENGINE AS OURS. GM HAS BEEN AWARE OF FOR SOMETIME, BUT HAS FAILED TO CORRECT VIA RECALL OR OTHER MEASURES.  HAD MY WIFE NOT BEEN SWIFT AND CALM IN HER CONTROL OF THE VEHICLE THERE IS LITTLE DOUBT THAT A SERIOUS AND POSSIBLY FATAL ACCIDENT WOULD HAVE OCCURRED GIVEN THE LOCATION OF THE INCIDENT.  VEHICLES TRAVELING AT 60+ MPH COME OUT OF A BLIND CURVE JUST BEFORE THIS LOCATION AND WOULD HAVE BEEN UNLIKELY TO STOP IN TIME.  I WOULD LIKE TO REITERATE THAT A STATE TROOPER WAS ON THE SCENE AND DOCUMENTED THE INCIDENT AS WELL.   *NLM",
        "vin": "1GMDX03E6XD"
    }
]