[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/22/2003",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DAKOTA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN TO SMELL HORRIBLE ANTIFREEZE/MUSTY SMELL (TRUCK HAD ALWAYS HAD MUSTY SMELL, BUT THIS WAS MUCH WORSE).  IT WAS SO BAD THAT I HAD TO TURN THE HEAT OFF AND ROLL THE WINDOWS ALL THE WAY DOWN AND KEEP THEM THAT WAY THROUGH THE DEAD OF WINTER BECAUSE THE FIRST TIME I TOOK IT IN, I WAS TOLD NOTHING WAS WRONG.  THE SECOND TIME I TOOK IT IN, I SPECIFICALLY ASKED THEM TO LOOK FOR AN ANTIFREEZE LEAK.  SEEING AS HOW THEY ARE MECHANICS, THEY SHOULD KNOW THIS WAS A HEATER CORE PROBLEM.  I OBVIOUSLY DIDN'T KNOW AT THE TIME.  THEY TOLD ME NOTHING WAS WRONG.  THE THIRD TIME I TOOK IT IN (BY THIS TIME IT HAD GOTTEN TO WHERE HEAVY MIST WOULD COME OUT OF VENTS AND FOG UP THE ENTIRE CAB), THEY TOLD ME IT WAS MILDEW AND CHARGED ME TO CLEAN AND DEODERIZE.  WHAT A RIPOFF SINCE THAT WAS NOT THE PROBLEM, MY VEHICLE IS UNDER WARRANTY, AND IT STILL STINKS!  I NOW HAVE ANOTHER APPOINTMENT WITH A DIFFERENT (HOPEFULLY BETTER) DEALER SINCE MY WARRANTY EXPIRES IN THREE WEEKS AND CHRYSLER \"CUSTOMER SERVICE\" TOLD ME I HAVE TO GET IT FIXED BEFORE WARRANTY EXPIRES OR I WILL HAVE TO PAY...EVEN THOUGH THE PROBLEM HAS BEEN GOING ON FOR 10 MONTHS AND IT IS CHRYSLERS FAULT IT IS NOT ALREADY FIXED.  FROM WHAT I UNDERSTAND, THIS IS A HUGE PROBLEM WITH NEW DAKOTA'S.  ALL YOU HAVE TO DO IS SEARCH HEATER CORE DAKOTA ON THE INTERNET AND YOU'LL COME UP WITH MANY COMPLAINTS, MOST OF WHICH SAY THAT IF CHRYSLER FINALLY ADMITS THERE IS A PROBLEM, THEN THE PERSON IS STILL OUT OF A VEHICLE FOR WEEKS AT A TIME.  HONORING WARRANTY ALSO SEEMS TO BE A HUGE PROBLEM WITH CHRYSLER.  I'LL NEVER BUY ANOTHER UNLESS THEY CHANGE THEIR ATTITUDE.  *NLM",
        "vin": "1B7FL26X3YS"
    }
]