[
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/23/2003",
        "dateOfIncident": "05/10/2002",
        "fire": false,
        "manufacturer": "COUNTRY COACH INC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019150,
        "products": [
            {
                "manufacturer": "COUNTRY COACH INC",
                "productMake": "COUNTRY COACH",
                "productModel": "INTRIGUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ODI ID NUMBER : 10018204 IS INCORRECT AND NO PAPERWORK HAS ARRIVED FOR ME TO SIGN OR EDIT- THIS IS A LIFE THREATENING CONDITION THAT PUTS ALL DRIVERS AND NEARBY CARS ETC. AT RISK.   COMPLANT SHOULD READ:WHILE DRIVING THE CARBON MONOXIDE ALARM ACTIVATED DUE THE CARBON MONOXIDE IN THE COACH PRODUCED BY THE REFRIGERATOR. THE DEALER INSPECTED THE VEHICLE AND COULD DUPLICATE THE PROBLEM.  TO DATE THE DEALER AND FACTORY HAVE BEEN UNABLE TO FIX THE PROBLEM.  CO ENTERS THE COACH WHILE DRIVING AND REFRIGERATOR IS RUNNING ON LP GAS. IF STOPPED FOR NIGHT SLEEPING THE COACH FILLS WITH CO IF DINNING AREA SLIDE IS NOT IN THE OUT POSITION, AND THE COACH IS NOT PLUGED INTO AC POWER.  THIS CONDITION WILL KILL... FALLING ASLEEP AS THE WHEEL OF A 33000LB MOTOR COACH DUE TO CO GAS IS NOT A SAFE WAY TO DRIVE OR GOING TO SLEEP WONDERING IF YOU WILL BE GASED AND NEVER WAKEUP IS NO WAY TO LIVE.  I THINK THIS SHOULD BE AT THE TOP OF YOUR LIST FOR ISSUES BEFORE THE SUMMER RV SEASON KILLS.  COUNTRY COACH TOLD US TO DISCONECT THE CO DETECTOR AND BRING THE COACH IN FOR REPAIR. ISSUE REMAINED FOR ONE FULL YEAR THAT INCLUDED TWO TRIPS TO THE FACTORY IN OR FOR FACTORY REPAIR AND TWO TRIPS TO INDEPENDENT DEALERS, AND NOW IT IS SITTING AT THE SELLING DEALER WAITING FOR?  PUT SOME ONE ON THIS ASAP.",
        "vin": "4U7B6DY1421"
    }
]