[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/24/2003",
        "dateOfIncident": "02/01/2003",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10019237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "RANGER",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "1997 FORD RANGER XLT EXTENDED CAB.   WHEN I APPLIED MY BRAKES, INSTEAD OF STOPPING AT THIS  \"T\" HWY INTERSECTION, I RAN PAST IT, AND HIT A 12\" DIAMETER TREE HEAD ON.  ICE ON THE ROAD.  I WAS WEARING MY SEAT BELT.  NEITHER THE DRIVER'S SIDE NOR THE PASSENGER SIDE AIR BAGS DEPLOYED.  THE INDENTATION ON THE FRONT BUMPER WAS OVER TWO FEET DEEP.  MY HEAD AND RIGHT SIDE OF MY BODY SMASHED AGAINST THE STEERING WHEEL, AND MY I BROKE MY LEFT COLLAR BONE, FRACTURED AND BRUISED SEVERAL RIBS ON MY RIGHT SIDE, BROKE MY RIGHT FOOT HEEL BONE, CUT MY NOSE, PLUS NUMEROUS OTHER MINOR CUTS, BRUISES AND ABRASIONS.  AFTER ABOUT 45 SECONDS, A HUGE BALL OF FIRE ERUPTED FROM UNDER THE CRUMPLED HOOD.  I FELT THE SUDDEN HEAT ON MY FACE, SINCE THE WINDSHIELD WAS GONE AND THERE WAS A HUGE GAP BETWEEN THE HOOD AND THE TRUCKS BODY.   A LADY, AN ANGEL OF GOD REALLY, HELPED ME OUT OF THE TRUCK AND INTO THE BACK SEAT OF HER CAR.  SHE DROVE ABOUT 100 YARDS TO WAIT FOR THE AMBULANCE TO ARRIVE.  BEFORE WE CAME TO A STOP, I HEARD THE TWO FRONT TIRES OF MY TRUCK BLOW UP.  ALL I COULD SEE WAS A BALL OF FIRE BURNING ABOUT 20 FEET HIGH.  TWO THINGS SEEM TECHNICALLY WRONG:  THE AIR BAGS DIDN'T DEPLOY, AND THE FUEL PUMP MUST HAVE KEPT PUMPING FUEL, FOR THE FIRE TO SPREAD SO RAPIDLY AND BURN THE FRONT OF THE TRUCK SO VERY COMPLETELY.  THIS WOULD SEEM TO INDICATE THE POSSIBLE FAILURE OF THE AIR BAG CRASH SENSORS AND THE FUEL PUMP SAFETY CUTOFF SWITCH.  MY TIRES WERE ONE MONTH OLD MICHELINS, SO THEY WEREN'T A FACTOR.  THE TRUCK WAS IN EXCELLENT SHAPE AND IT WAS CAREFULLY MAINTAINED AND GARAGED.  EVERYTHING WORKED ON IT AND NO MALFUNCTION INDICATOR LIGHTS OF ANY KIND WERE ON PRIOR TO THE ACCIDENT.  I HAVE VERY GOOD MAINTENANCE RECORDS ON IT.  I CONTACTED FORD BY TELEPHONE AND VIA E-MAIL, TO LET THEM KNOW OF WHAT I THOUGHT COULD BE A POTENTIAL COMPONENT DEFECT AFFECTING OTHERS ALSO.  I ALSO CONTACTED THEIR LEGAL OFFICE VIA PHONE, AND THEY NEVER RETURNED MY CALL.  *NLM",
        "vin": "1FTCR14X1VP"
    }
]