[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "02/02/2004",
        "dateOfIncident": "01/27/2004",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019829,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "RODEO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 ISUZU RODEO 2WD- CHRONIC INTERMITTENT PROBLEMS W/IGNITION STICKING IN ON POSITION ON COLD START AND ENGINE REVVING HIGH AND HANGING HIGH 1700-2000 RPM'S, WITH COOLER DAMPER WEATHER, INTERMITTENT AND MORE FREQUENT IGNITION STICKING PROBLEMS GRADUATING TO IGNITION LOCK UP AFTER ENGINE STARTED: IGNITION LOCKS, CAN'T SHUT DOWN AND  ENGINE CONTINUES TO REV AT HIGH RPM'S 2000-2200, UNANTICIPATED ENGINE POWER AND PROPULSION.  1/27/04, COLD START LATE AM, IGNITION STICKING IN ON POSITION, ENGINE REVVING HIGH, THEN DROPS SLOWLY, DROVE 45 MINS, PARKED ON WARM START MID-DAY, IGNITION LOCKED UP, CONTINUED GRINDING ON A STARTED ENGINE AND ENGINE CONTINUED TO REV TO 2200 RPM'S AND HANG HIGH, WITH EXCESSIVE POWER TO ENGINE. RPM DROPPED SLOWLY, ENGAGED IN REVERSE, TOOK FOOT OFF BRAKE AND IMMEDIATELY PROPELLED BACKWARD AT UNEXPECTED SPEED ABOUT 1+ CAR LENGTHS INTO FENCE AND TREE. EXCESSIVE DAMAGE TO REAR OF VEHICLE.  IZUSU DEALER, ROYAL OF TUCSON, AZ, ALLEGEDLY UNABLE TO DUPLICATE ON BOTH SERVICES, (683 MI & 4747 MI)SINCE INCEPTION BEFORE 683 MILES; UNWILLING TO WARRANTY REPAIR W/O DUPLICATION DESPITE EQUIPMENT FAILURE AND SAFETY ISSUES. OWNER SUSPECTS FAULTY ELECTRICAL/ELECTRONICS FAILING TO TRANSMIT FROM IGNITION TO MAIN COMPUTER, AND POSSIBLY IN BETWEEN. SYMPTOMS EXPERIENCED BY IZUZU W/ AUTO'S MANUFACTURED IN 1989-1993 IN AN ATTEMPTED RECALL EFFORT BY NAT'L HWY SAFETY COUNCIL- IGNITION/ECU DEFECTS CONFIRM SYMPTOMS CUSTOMER REPORTED TO ROYAL IZUSU DEALER.  *JB",
        "vin": "4S2CK58W234"
    }
]