[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/28/2003",
        "dateOfIncident": "02/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020618,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A FORD ESCAPE 2002 IN APRIL OF LAST YEAR FROM THE ABLE FORD DEALERSHIP IN ROCKVILLE CENTRE. THE PROCESSOR (COMPUTER PART OF THE ENGINE) FAILED IN MARCH 2003 AND WAS REPLACED IT'S NOW MAY 2003 I AM STILL HAVING ISSUES WITH THE PROCESSOR. THEY TOOK THE CAR IN ON FRIDAY MAY 16, 2003 AND PUT A HORNEST ON THE ENGINE (PROCESSOR) AND GAVE ME THE CAR BACK THAT DAY. AN HOUR AFTER I GOT MY CAR BACK FROM THE ABLE FORD DEALERSHIP SERVICE DEPARTMENT IN ROCKVILLE CENTER, NY  THE VEHICLE WAS HAVING THE SAME PROBLEM THAT WAS SUPPOSE TO BE CORRECTED THAT DAY. THEY CURRENTLY HAVE MY CAR IN THEIR POSSESSION NOW. THIS IS THE THIRD TIME I'M BRINGING MY VEHICLE TO THEM FOR THE SAME PROBLEM. THEY CAN'T TELL ME WHY THIS VEHICLE IS MALFUNCTIONING AND I'VE CALLED AND MADE COMPLAINTS TO THEIR CUSTOMER SERVICE DEPARTMENT SEVERAL TIMES WITHOUT ANYONE CONTACTING ME OR PROVIDING ME WITH ANSWERS. I CALLED THE SALESMAN MARK DEMARTINI WHO SOLD ME THE CAR. HE WAS ALSO RUDE AND TOLD ME TO CALL LAURA THE SERVICE DEPARTMENT MANGER. I CALLED LAURA AND LEFT HER A MESSAGE. SHE NEVER CALLED BACK. I HAVE A BRAND NEW VEHICLE THAT SPENDS MORE TIME AT FORD THAN WITH ME DRIVING IT AND I DON'T FEEL SAFE IN MY OWN VEHICLE. AT ANY TIME BECAUSE OF THIS PROBLEM MY CAR COULD SHUT DOWN WHILE DRIVING. I AM BEING GIVEN THE RUN AROUND AND FORD IS NOT PROVIDING ANSWERS AS TO THE MALFUNCTIONING OF MY NEW VEHICLE AND I FEEL CHEATED AND VIOLATED. THEY ARE CURRENTLY TELLING ME THAT THEY CAN NOT FIND ANYTHING WRONG WITH MY VEHICLE AND THEIR NY SERVICE REPRESENTATIVE JAMES WELCH (201) 529-7267, TOLD ME BASICALLY THIS IS ALL IN MY HEAD AND LIED ABOUT FACTS ON MY WORK ORDER SHEETS THAT I HAVE COPIES OF. HE SAID I AM TRYING TO BUILD A LEMON LAW CASE AGAINST THEM AND THEY ARE NOT GOING TO HELP ME DO THIS. NOW WITH ALL OF THIS SAID AND HE RUDENESS AND DISHONESTY HOW AM I TO BELIEVE HE EVEN LOOKED AT MY VEHICLE THAT HAS BEEN THERE FOR FIVE DAYS. THIS IS TRULY A SAFETY HAZARD.",
        "vin": "1FMYU02102K"
    }
]