[
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/27/2003",
        "dateOfIncident": "05/26/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020543,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 JEEP GRAND CHEROKEE LIMITED. ONLY 45,000 MILES. VEHICLE STALLED WHEN MAKING TURNS AND NOW STALLS WHEN OPERATING AT HIGH SPEEDS. LAST TIME VEHICLE WAS TRAVELING APPROXIMATELY 65 MILES AN HOUR AND STALLED.  USUALLY THE VEHICLE WILL START BACK UP AS SOON AS IT IS PUT IN NEUTRAL AND YOU TURN THE KEY. BUT ON SOME OCCASIONS VEHICLE HAS HAD TO SIT FOR APPROXIMATELY 15 MINUTES BEFORE STARTING AGAIN. VEHICLE HAS BEEN TOWED TO A DEALERSHIP ON 2 OCCASIONS AND EACH TIME WHEN IT ARRIVES AND IS CHECKED BY MECHANICS IT STARTS UP. MECHANICS AND COMPUTER CHECKS REVEALED NO PROBLEM AT THE DEALERSHIP. PEOPLE HAVE SAID THAT IS POSSIBLY A COMPUTER PROBLEM IN THE VEHICLE AND THE REASON THE DEALERS FOUND NOTHING WRONG IS THE COMPUTER RESETS ITSELF EACH TIME THE JEEP IS RESTARTED. NOT SURE BUT THE DEALERSHIPS CANNOT GIVE ME ANY ADVICE ON WHAT TO DO TO FIX THE PROBLEM. I CANNOT AFFORD ANOTHER VEHICLE AND I AM WORRIED THAT VEHICLE STALLING AT HIGH SPEEDS IS GOING TO RESULT IN AN ACCIDENT. PLEASE LET ME KNOW IF THIS IS A PROBLEM YOU HAVE FOUND IN OTHER JEEPS AND IF YOU KNOW A REMEDY. JEEP HAS ALSO HAD ELECTRICAL PROBLEMS IN THE PAST SUCH AS TWO AUTO DOOR LOCKS GOING BAD, AIR CONDITIONER WENT BAD, AND THE BATTERY FAILED.  NOT SURE IF THIS IS RELATED SOMEHOW OR NOT.  CHECK OF PAST OWNER RECORDS SHOWS MAINTENANCE FOR CHECK ENGINE LIGHT AT 21418 MILES (2/19/01) AND 33488 (2/28/02) AND AUTOMATIC TRANSMISSION PROBLEMS AT 33488 MILES.     *TT",
        "vin": "1J4G268S8XC"
    }
]