[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/29/2003",
        "dateOfIncident": "08/08/2002",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020701,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "XL883",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 HARLEY DAVIDSON 883 C  BOUGHT THE BIKE BRAND NEW AUG 08, 2002 (1ST HARLEY) AND IMMEDIATLEY NOTICED AFTER RIDDING HOME UPON DELIVERY THAT THE BIKE WOULD STALL 3 OUT OF 4 TIMES WHEN TRYING TO ACCELERATE. CALLED THE SELLING AGENT AT THE DEALERSHIP AND WAS TOLD ALL SPORSTER HAD THIS PROBLEM DUE TO HAVING TO MEET EPA STANDARDS THE BIKE CARB WAS SET AT A VERY LEAN CONDITION CAUSING THE BIKE TO STALL UNDER ACCELERATION.  THE SELLING AGENT THEN AT THAT POINT SAID IT COULD BE FIXED FOR AN ADDITIONAL FEE OF ANYWHERE BETWEEN $250.00 - $300.00 ALSO COMMONLY KNOWS AS THE \"HARLEY TAX\" ON MANY HARLEY CHAT SITES ON THE WEB.  THE \"HARLEY TAX\" IS PAYING THE DEALER AND ADDITIONAL FEE TO GET THE BIKE TO RUN RIGHT LIKE IT SHOULD FROM THE FACTORY IN THE 1ST PLACE.  I CONTACTED THE MOTOR COMPANY IN MILWAULKEE AND SENT A LETTER IN HOW UN HAPPY I WAS SINCE I HAD SAVED FOR THIS BIKE MANY YEARS AND NOW HAD THIS PROBLEM.  I EXPLAINED THE PROBLEM TO THE CUSTOMER SERVICE REP AND WAS TOLD THAT THEY COULD NOT FIX IT DUE TO EPA STANDARDS. I WAS THEN TOLD TO TAKE THE BIKE BACK TO THE DEALER AND THEY WOULD LOOK AT IT.  TOOK THE BIKE BACK THEY DID SOME WORK ON THE CARB BUT STILL HAVE THE PROBLEM, NOT AS BAD BUT IT IS STILL THERE, COUGHING, STALLING ETC.  I TOLD THE MOTOR COMPANY IN MILWAULKEE THAT IF I GOT HIT BY A CAR BECAUSE OF THIS I WOULD TAKE LEGAL ACTION.  AFTER READING THE WEB SITE \"HARLEY TECH TALK\" OR \"SPORSTER HOME PAGE.ORG\" I FOUND THAT THERE IS A WIDE PROBLEM WITH THE SPORSTER 883 / 1200 AND THE STALLING CONDITION.  I WOULD LIKE THE PROBLEM REMEDIED BY THE MOTOR COMPANY WITHOUT COST TO ME OR FOR THE MOTOR COMPANY TO TAKE THE BIKE BACK AND SUPPLY ME WITH A DIFFERENT MODEL THAT DOES NOT HAVE THIS PROBLEM.",
        "vin": "1HD4CJM102K"
    }
]