[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/30/2003",
        "dateOfIncident": "05/22/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020753,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 5/22/03 I WAS DRIVING DOWN THE HIGHWAY AND EXPERIENCED A SUDDEN FEELING THAT THE FRONT END OF MY VEHICLE DROPPED AND HEARD SOME OF THE WORST NOISES I HAD EVER HEARD.  UPON DRIVING THE VEHICLE HOME (SLOWLY) MY HUSBAND CAME HOME AND TOOK OFF THE TIRE.  WE DISCOVERED THAT THE FRONT COIL SPRING OVER THE STRUT HAD COLLAPSED AND THE VEHICLE COULD NOT BE DRIVEN. WE PAID OUT OF OUR POCKETS TO GET THE VEHICLE FLAT BEDDED TO THE LOCAL FORD DEALERSHIP.  THE PARTS HAVE BEEN ON NATIONAL BACK ORDER AND IT'S BEEN OVER A WEEK.  I AM PERSONALLY IN JEOPORDY OF LOOSING MY JOB BECAUSE I HAVE ONLY BEEN ABLE TO WORK 1/2 DAY.(1 VEHICLE LEFT, 2 WORKING PARENTS WITH 3 KIDS) NOW I AM BEING TOLD THAT THE TIRE ON THAT SIDE IS DAMAGED AND CAN NOT BE TRUSTED TO BE DRIVEN ON, AND THE VAN NEEDS A FRONT END ALIGNMENT.  FORD IS SAYING THIS IS NOT COVERED AND REFUSES TO DO ANYTHING ABOUT IT.  WE RECEIVED THE RECALL NOTICE 6 DAYS AFTER THE SPRING COLLAPSED.  IT IS FOR SPRING SHIELDS, AT THE FORD CUSTOMER SERVICE NUMBER TOLD ME THE SHIELDS ARE TO BE INSTALLED SO THAT IF THE SPRING COLLAPSES IT DOESN'T DAMAGE THE REST OF THE FRONT END AND CAUSE AN ACCIDENT.  IS THIS ALL FORD IS RESPONSIBLE TO DO?  THERE ARE THOUSANDS OF THESE VANS ON THE ROAD THAT ARE A POTENTIAL DANGER.  THEY KNOW THAT THESE SPRINGS ARE A HAZARD AND THEY DON'T COVER TOWING, REPLACE OR REPAIR OF TIRES ETC THAT GET DAMAGED DUE TO THEIR DEFECTIVE PARTS.  MY TIRE IS ONLY 1 MONTH OLD.  I JUST REPLACED IT.  THEIR ONLY RESPONSIBILITY IS TO TRY TO MAKE SURE NO ONE GETS KILLED IN AN ACCIDENT CAUSED BY A DEFECTIVE PART ON THEIR VAN.  WHY ARE THEY ABLE TO SAY THE GET THE 5 STAR SAFETY RATING FROM THE GOVERNMENT, THAT MAKES PEOPLE THINK THESE VEHICLES ARE SAFE.  MY COLLAPSED DOING 50 MPH GOING HOME FROM MY MORNING RUN AS A SCHOOL BUS DRIVER.  I HAD JUST DROPPED MY SON OFF TO DAYCARE 10 MINUTES BEFORE.  THIS COULD HAVE BEEN A MUCH WORSE INCIDENT.  *AK",
        "vin": "2FMDA5147WB"
    }
]