[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/04/2003",
        "dateOfIncident": "05/30/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021002,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "ALERO",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE BRAKES ON THE OLDS ALERO HAVE A DESIGN FLAW IN THE BRAKES.    THE ROTORS TEND TO OVERHEAT UNDER NORMAL DRIVING USE.  IT WEARS THE PADS DOWN FASTER THAN THEY SHOULD, WARPS THE ROTORS SO THAT THEY HAVE TO BE TURNED EVERY SINGLE TIME YOU REPLACE THE PADS... AND I DO MEAN HAVE TO BE.  THE ROTORS WILL QUICKLY LOSE THICKNESS, AND THE THINNER THEY ARE AFTER EACH TURN THE QUICKER THEY WILL WARP UNDER NORMAL USE.  CONTACTING GENERAL MOTORS HAS ACCOMPLISHED NOTHING... DESPITE THE FACT THAT UNDER THE 2000 MODEL THEY HAD A TECHNICAL SERVICE BULLETIN (FRONT DISC BRAKE PULSATION (NEW ROTOR RUN-OUT SPECIFICATION AND CORRECTION METHOD) #00-05-23-002A) ISSUED FOR THE CAR.  TO MY KNOWLEDGE GENERAL MOTORS HASN'T ALTERED THE DESIGN OF THE CAR SINCE IT'S INCEPTION WITH EXCEPTION OF COSMETIC CHANGES.  THEY REFUSE TO ADMIT THERE'S A DESIGN FLAW IN THE BRAKES THAT FORCES THE CONSUMER TO EITHER PAY OUTRAGEOUS PRICES EACH AND EVERY TIME THEY NEED BRAKE PADS... OR DISCARD THE MANUFACTURERS WARRANTY AND PURCHASE AFTERMARKET BRAKE SOLUTIONS TO ELIMINATE THE ISSUE ENTIRELY.  *NLM",
        "vin": "1G3NF52E71C"
    }
]