[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/03/2003",
        "dateOfIncident": "06/03/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020962,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1999 HONDA ACCORD EX SEDAN WITH APPROXIMATELY 84,000 MILES ON ODOMETER HAS WARPED FRONT ROTORS.  I HAVE ALWAYS TAKEN GOOD CARE OF MY VEHICLES, HOWEVER, I ALMOST ALWAYS BOUGHT TOYOTA'S IN THE PAST (AND KEPT MOST TO THE 100,000-MILE MARK).  THIS IS MY FIRST HONDA.  I'VE REVIEWED ALL OF THE COMPLAINTS FILED WITH REGARD TO THIS VEHICLE, AND CONCUR WITH OTHERS THAT THERE IS NO LOGICAL REASON FOR WARPED ROTORS AT THIS POINT.  FRONT AND BACK BRAKES WERE REPLACED LAST YEAR (ON SEPARATE OCCASIONS), BRAKES HAVE BEEN INSPECTED ROUTINELY, AND I HAVE NOT BEEN DRIVING ROUTINELY IN CONGESTED TRAFFIC, NOR DO I TAKE MY CAR TO CAR WASHES WHEN IT IS BITTER COLD OUTSIDE (AS THE HONDA REP INDICATED COULD BE THE CAUSE).  IN ADDITION TO PAYING FOR PM SERVICE AT HONDA, I NOW HAVE TO PAY AN ADDITIONAL $138+ FOR ROTOR REPAIRS.  MY DRIVE TO WORK IS PRETTY EASY, ESPECIALLY COMPARED TO YEARS WHEN I DROVE TO DOWNTOWN MINNEAPOLIS DAILY.  IF I WAS EVER GOING TO HAVE \"ROTOR WARP\" ISSUES, IT SHOULD HAVE BEEN ON THE VEHICLES THAT DROVE THE CITY MILES.  THEREFORE, IT WAS A SURPRISE TO BE HIT WITH \"WARPED ROTORS.\"  I WAS ALREADY A HONDA OWNER A WHEN I HEARD ABOUT HOW \"SECRETIVE\" THEY ARE WITH THEIR QUALITY ISSUES.  WHY DO THEY FEEL THE NEED TO HIDE THEIR PARTS, SERVICE, AND DESIGN FLAWS, AND TRY TO EVADE CUSTOMER CARE OPPORTUNITIES?  HONDA SHOULD BE UPFRONT AND ACCOUNTABLE FOR THE SAFETY AND RELIABILITY OF THE VEHICLES THEY MANUFACTURE, DISTRIBUTE, AND PROFIT FROM IN THIS COUNTRY.  AFTER ALL, THESE WERE \u001cGENUINE HONDA PARTS\u001d THAT WARPED.  I APPRECIATE THE OPPORTUNITY TO REGISTER THIS COMPLAINT AND HOPE THE INVESTIGATION OF THIS PART OR DESIGN FAILURE YIELDS SOME GOOD NEWS IN RECOUPING SOME OF THE COST.  HAVING MADE MY LAST CAR PAYMENT YESTERDAY, I WAS HOPING TO HAVE A BREAK FROM PAYMENTS AND REPAIRS FOR A WHILE.  HOWEVER, THIS SOUNDS LIKE IT WILL BE A REPEAT PROBLEM, AND IF SO, I MAY NEED TO LOOK AT NEW VEHICLES.  A LOT DEPENDS ON WHAT HONDA DOES, OR DOES NOT DO, TO REMEDY THE SITUATION.   *NLM",
        "vin": "1HGCG5654XA"
    }
]