[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/03/2003",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020951,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "RAM 2500",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WANDERS ALL OVER THE PLACE. 2001 RAM PICKUP 2500   WITH ONLY 19,224 MILES ON IT PROBLEM FIRST SURFACED AROUND 15,000 MILES.  DEALER SERVICED AT 17,207 MILES AS A LICENSED INSPECTION MECHANIC, THIS VEHICLE WILL FAIL THE STATE INSPECTION STICKER TEST WHEN IT IS DUE. THE AMOUNT OF PLAY AT THE STEERING WHEEL IS CURRENTLY AT 5+ INCHES AND GETTING WORSE. INSPECTION PROCEDURES REQUIRE THE PLAY TO BE MEASURED WHILE OBSERVING THE TIRE MOVEMENT. ( EXAMPLE : TURN THE STEERING WHEEL TO THE LEFT UNTIL VISABLE MOVEMENT OF THE TIRE IS SEEN, MARK A REFERENCE POINT ON THE STEERING WHEEL, NOW TURN THE STEERING WHEEL TO THE RIGHT UNTILL VISABLE MOVEMENT OF THE TIRE , NOW MEASURE THE DISTANCE THE MARK ON THE STEERING WHEEL HAS TRAVELED. ANYTHING OVER A 2 1/2 \" TRAVEL IS CAUSE FOR FAILING THE STATE VEHICLE INSPECTION STICKER. DEALER HAS ALREADY REPLACED THE TRACK BAR BUT THIS DID NOT SOLVE THE PROBLEM. AM AWAITING ANOTHER APPOINTMENT. MY WIFE REFUSES TO DRIVE THIS VEHICLE BECAUSE OF THE STEERING ISSUES. THE VEHICLE ALWAYS NEEDS TO BE \" CHASED \" LEFT AND RIGHT TO KEEP IT TRACKING STRAIGHT AHEAD.IT IS MY OPINION THAT IT IS A PROBLEM WITH THE STEERING BOX. THE STAE OF MAINE FISH AND WILDLIFE DIVISION FORCED A BUYBACK OF THESE SAME TRUCKS BECAUSE OF SIMILAR PROBLEMS WITH THE STEERING. IF THEY ARE NOT SAFE FOR OUR LOCAL GOVERNMENT THEN THEY ARE SURE NOT SAFE FOR THE AVERAGE CONSUMER. PLEASE LOOK INTO THIS AS IT IS A SAFETY ISSUE THAT CAN NOT BE IGNORED. THANK YOU.  CONCERNED CITIZEN IN MAINE.  *AK",
        "vin": "3B7KF26Z11M"
    }
]