[
    {
        "components": "FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/03/2003",
        "dateOfIncident": "06/03/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020970,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "LEGACY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SYSTEM ISSUE.  I HAVE OWNED MY VEHICLE FOR APPROXIMATELY 9 MONTHS. I BOUGHT IT AS A USED CAR FROM SLOANE IN PHILADELPHIA.   IT HAS APPROXIMATELY 17000 MILES ON IT AND IS CONSIDERED STILL UNDER WARRANTY.  I HAVE HAD TO TAKE IT IN FOR SERVICE 4 TIMES FOR THE VEHICLE HESITATING UPON ACCELERATION. THE SERVICE CENTER FIRST SAID THE HESITATION CAME FROM A BAD BATTERY, SECOND INCIDENT THEY STATED THEY COULD NOT FIND ANYTHING WRONG, THIRD INCIDENT, WHEN I ALMOST GOT IN AN ACCIDENT BECAUSE THE VEHICLE STARTED TO STALL UP ENTERING THE FREEWAY TRAFFIC, I BROUGHT IT BACK IN FOR SERVICE.  THEY DID A THOROUGH CHECK AND SAID IT WAS THE OXYGEN SENSOR.  THEY REPLACED IT.  APPROXIMATELY 2 WEEKS LATER, THE VEHICLE BEGAN HESITATING ONCE AGAIN!  AGAIN, AT A CRUCIAL POINT IN A TRAFFIC SITUATION.  I RETURNED THE VEHICLE AGAIN FOR SERVICE, THEY STATED IT WAS THE CODES, THEY JUST NEEDED TO BE CLEARED.  THE VEHICLE IS STILL HESITATING AND IS CAUSING A POTENTIAL FOR SERIOUS INJURY UPON DRIVING UNDER CRUCIAL SITUATIONS.  I HAVE NOW RESORTED TO PUBLIC TRANSPORTATION.  AUDIO SYSTEM ISSUE:  VEHICLE'S RADIO WILL DISPLAY ALL IT'S FEATURES, BUT WILL NOT PLAY ANY SOUND THROUGH SPEAKERS.  THIS HAS BEEN ADDRESSED WITH THE SERVICE TEAM ON 3 PAST OCCASIONS, BUT IT HAS NOT BEEN REMEDIED.  LAST KNOW PROBLEM WAS THE SPEAKER AMPS AND GROUNDING MECHANISM FOR SPEAKER, ALSO THE RADIO, WHEN IT DOES WORK GETS INTERFERENCE WHEN THE REAR DEFROST IS ON.   *NLM",
        "vin": "4S3BE645617"
    }
]