[
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2003",
        "dateOfIncident": "12/24/2002",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021054,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I PURCHASED A 2003 HONDA ACCORD IN DECEMBER OF 2002. ALMOST IMMEDIATELY THE CAR PUT OUT THIS HORRIBLE (ROTTEN EGG SMELL). I KNOW THIS IS COMING FROM THE CATALYTIC CONVERTER AND  I PROCEEDED TO TELL THE SERVICE PEOPLE THAT THIS WAS THE PROBLEM. I MADE AN APPOINTMENT SO THEY COULD FIX THE PROBLEM.  THEIR RESPONSE WAS THAT THE GAS I WAS USING HAD A HIGH SULFUR CONTENT AND  WE MUST SWITCH GAS STATIONS IMMEDIATELY TO GET RID OF THE SMELL. SO I TRIED EVERY GAS STATION IN THE AREA AND THE PROBLEM GOT WORSE. THE CAR STARTED TO SHAKE AND SEEMED TO BE DRAWING POWER FROM THE ENGINE. THE IDLE WOULD ALSO RISE AND FALL WHEN THIS SHAKING IS HAPPENING. THE ODOR BECAME WORSE WHEN THE SHAKING WOULD START. THIS SMELL IS GIVING ME A BIG HEADACHE AND WHO KNOWS WHAT OTHER HEALTH PROBLEMS. SO I CALLED HONDA SERVICE TO PUT THE CAR IN FOR SERVICE AGAIN. HONDA DID NOT EVEN WANT TO LOOK AT IT AGAIN, BUT WITH MUCH YELLING I GOT AN APPOINTMENT. THEY HAD THE CAR ALL DAY AND WHEN MY WIFE CALLED TO SEE IF THEY FIXED THE PROBLEM THEY SAID THERE WAS NOTHING WRONG WITH THE CAR. THEY CONTINUED TO EXPLAIN THAT IT IS (THE NATURE OF THE BEAST) AND ALL CARS PUT OFF THIS SMELL TO SOME DEGREE.  I ALSO NOTICED THE GAS MILEAGE IS NOT WHAT HONDA STATED IT SHOULD BE. SO I CALLED HONDA DIRECTLY TO FILE A COMPLAINT AND FOUND OUT THAT HONDA IS AWARE OF THIS PROBLEM, BUT HAS NO SOLUTIONS TO FIX IT. HONDA ASSURES ME THAT AFTER 10,000 TO 15,000 MILES GOES BY THAT THE SMELL WILL DECREASE AND GO AWAY. THIS SMELL STARTED AT 50 MILES AND IS GETTING MUCH WORSE AT 4,500 MILES. I WILL NEVER BUY ANOTHER HONDA CAR OR THEIR PRODUCTS AGAIN AS LONG AS I LIVE.  I AM ALSO RESEARCHING INFORMATION ABOUT OTHER 2003 HONDA ACCORDS WITH THE SAME PROBLEMS AND FOUND MANY WITH THE SAME PROBLEM. I AM GOING TO GET A LAWYER INVOLVED TO FIGHT THEM. WE THE CONSUMERS SHOULD NOT LET HONDA TAKE ADVANTAGE OF US. HONDA SHOULD BE ASHAMED TO SELL THE CONSUMERS SUCH A ROTTEN EGG.    *NLM",
        "vin": "1HGCM56413A"
    }
]