[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/05/2003",
        "dateOfIncident": "05/27/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021113,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 5, 2003    TO:MR. WILLIAM CLAY FORD, JR.VIA FAX \u0013 313-845-6073     FROM:JUDY HARDIN (281-272-2845)    RE:OUTRAGED OVER SCAM FORD MOTOR IS PULLING ON CUSTOMERS WHO OWN A FORD SUV!!!!!!    WE WILL MAKE SURE THIS SCAM STOPS HERE AND NOW!!!!! YOU KNEW WHEN YOU DESIGNED THE FORD SUV VEHICLES THAT THE INTAKE VALVES WERE A PIECE OF JUNK!!!!!!!!!!!!!      MY HUSBAND AND I WENT TO ARKANSAS IN OUR 99 FORD EXPLORER. THE 2ND DAY WE ARRIVED THE VEHICLE STOPPED AT THE HOTEL.  IT WOULD NOT START. WE CONTACTED A FORD DEALERSHIP\u0019S SERVICE DEPARTMENT AND BEFORE I COULD EXPLAIN EXACTLY WHAT WAS GOING ON, THE SERVICEMAN INFORMED ME HE KNEW EXACTLY WHAT TE PROBLEM WAS. HE STATED THEY HAD SEVERAL VEHICLES IN THE SHOP PRIOR AND AT THAT TIME WITH THE SAME PROBLEM. WHEN WE ARRIVED AT THE SERVICE AREA, THERE WERE 7 INDIVIDUALS BESIDES MY HUSBAND AND I, WITH FORD EXPLORERS, WAITING TO HAVE THEIR VEHICLES REPAIRED DUE TO THE SAME PROBLEM, THE INTAKE VALVE. A COINCIDENCE???? I THINK NOT!!!!! THAT REPAIR COST MY HUSBAND AND I OVER $300.00.  THE SERVICEMAN EVEN INFORMED US HE WOULD NEVER BUY A FORD SUV AND HE WORKS FOR YOUR COMPANY!!!!!    MY BROTHER, ALFRED ANDERSON, WHO PURCHASED AN AMERICAN MADE VEHICLE FOR THE 1ST TIME IN 15 YEARS. MADE THE BIGGEST MISTAKE OF HIS LIFE WHEN HE PURCHASED THE FORD EXPEDITION\u0013EDDIE BAUER. THE VEHICLE WAS PLACED IN THE SHOP LAST WEEK AND GUESS WHAT THE PROBLEM WAS, OH YEAH, THE INTAKE VALVE!!!! HE HAD TO PAY OVER $300.00 ALSO FOR A PROBLEM YOU KNEW ABOUT ALL ALONG!!!! NOT ONLY THAT, SEVERAL OF HIS CO-WORKERS, OF WHICH ARE STARTING A PETITION, PLACED THEIR FORD SUVS IN SERVICE FOR THE SAME EXACT ISSUE. MY BROTHER\u0019S SUV OVERHEATED YESTERDAY, WHICH COST HIM OVER $400.00 TO HAVE REPAIRED.  THIS IS YET ANOTHER WAY FORD IS MAKING MONEY FROM CUSTOMERS !!!!       THIS WILL NOT CONTINUE!!! I AM OUTRAGED AND DISAPPOINTED BECAUSE MY HUSBAND AND I PURCHASED ONLY FORD VEHICLES (TRUCKS) IN THE PAST BUT, THIS IS THE FIRST AND LAST TIME WE WILL PURCHASE A FORD SUV!!!",
        "vin": ""
    }
]