[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/05/2003",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021068,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "S2000",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY HONDA S2000, WHICH WAS PURCHASED NEW IN JUNE OF 2002 CAME WITH BRIDGESTONE POTENZA SO-2 TIRES FRONT AND REAR. THIS VEHICLE IS USED AS A THIRD VEHICLE IN A TWO DRIVER HOUSEHOLD, AND IS USED ONLY AS A DAILY COMMUTER CAR TO TRAVEL 15 MILES TO WORK (ROUND TRIP). I TOOK THE VEHICLE IN FOR MY STATE INSPECTION, AND AT 6100 MILES, THE REAR TIRES WERE DOWN BELOW 2/32 OF TREAD DEPTH AND THE FRONT TIRES WERE FEATHERED BADLY ON THE INSIDE EDGES (BOTH) AND TREAD WAS BELOW 5/32 OF DEPTH. I HAVE SEEN MANY POSTS OF PEOPLE WITH THESE TIRES WHO HAVE HAD TREAD LIFE WELL BELOW 10K MILES UNDER LITE DRIVING CONDITIONS, WHILE OTHERS CLAIM UP TO 20K, EVEN UNDER HEAVY CONDITIONS. THE TIRES WERE UNACCEPTABLE IN THE RAIN AFTER ABOUT 4000 MILES ON IT AS THE REAR WOULD FISHTAIL EVEN UNDER THE LIGHTEST OF CORNERING. I HAVE BROUGHT THIS TO THE ATTENTION OF HONDA AND BRIDGESTONE/FIRESTON, AND NO ONE SEEMS TO WANT TO FESS UP TO A POSSIBLE PROBLEM WITH CERTAIN BATCHES OF THE TIRE HAVING TOO SOFT A COMPUND, OR DESIGN SPEC ISSUES. THIS IS A SERIOUS POTENTIAL PROBLEM. IF I HAD DRIVEN THE VEHICLE MORE OFTEN, I WOULD HAVE RUN THE RISK OF HAVING A TIRE PROBLEM (BLOWOUT OR LOSS OF CONTROL) DUE TO UNACCEPTABLE TIRE WEAR ON THE DRIVE WHEELS. *AK",
        "vin": "JHMAP11472T"
    }
]