[
    {
        "components": "SEAT BELTS,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/06/2003",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021166,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOWING HITCH KIT",
                "productYear": "1998",
                "type": "Equipment"
            }
        ],
        "summary": "WE CURRENTLY HAVE A 1999 TOY EX CAB AND ARE NOT ABLE TO GET THE BACK SEAT BEAT TIGHT ENOUGH. I READ THE MANUAL THAT STATES FLIP SEAT UP AND PUT CUP HOLDER UP. WITH THE CUP HOLDER UP AND SEAT CARPET THE SEAT SLIDES AROUND A LOT.  . WHERE THE SEAT BELT COME OUT OF THE FLOOR AND BUCKLES I HAVE TRIED AND TRIED TO GET IT TIGHT AND HAVE NOT BEEN ABLE. NOT IN THE BACK OF THOSE TRUCKS THE SEAT IS STRAIGHT UP AND DOWN. I HAVE TRIED A STRAIGHT BACK AND A SEAT AT A SLANT IT STILL DOES NOT WORK. I HAVE TAKEN IT TO TOYOTA AND THEY DON'T KNOW WHY IT WILL NOT WORK.  I THEN TOOK IT TO A MARY BRIDGE CAR SEAT CHECK AND THEY STRAIGHT THAT THE BELT IS TO FAR APART.  WHEN YOU SIT IN A REGULAR SEAT THE BELT THE COME OUT OF THE FLOOR AND THEN CLICKS TOGETHER IS CLOSE TO YOU HIPS.  NOT IN THE BACK OF THE TOYOTA'S THEY ARE FAR APART. TOYOTA DOESN'T SEEN TO BE HELPING ME AT ALL, AND AM WONDERING HOW MANY PEOPLE HAVE BEEN PUTTING THERE CHILDREN IN THE BACK SEAT UNSAFE.  I WOULD HATE TO SEE A CHILD GET KILLED DUE TO THIS. PLEASE LET ME KNOW IF THERE IS A SECRET TO THIS THAT NOT MANY PEOPLE KNOW ABOUT. PLEASE HELP.  *AK",
        "vin": "4TAWM72N4XZ"
    }
]