[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": "12/16/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000198,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COIL PACK HAS FAILED ON MY VW 2002 PASSAT 1.8T.  I HAD IT TOWED TO THE DEALER WHO STATED THAT IT SHOULD NOT BE DRIVEN IN ITS CONDITION.  THE DEALER ALSO STATED THAT IT WAS A PART FAILURE AND HE WASN'T SUPRISED.  THERE HAVE BEEN A LOT OF THEM LATELY AND THE PARTS ARE ON BACK ORDER.  LATER THAT NIGHT I DID A LITTLE RESEARCH AND I FIND OUT THAT HUNDREDS OF OTHER PEOPLE WITH THE 2002 1.8T ENGINE ARE HAVING THE SAME ISSUE.  (VWVORTEX.COM OR GOOGLE.COM \"VW COIL PACKS\") SOMETHING WITH THE COLD WEATHER AFFECTS THE COIL PACKS.  VW SHOULD RECALL THESE PARTS AND REPLACE THEM WITH WORKING COIL PACKS.  LUCKILY WHEN MINE WENT I WAS TWO BLOCKS FROM MY APARTMENT.  IT DID HAPPEN HOWEVER IN THE MIDDLE OF AN INTERSECTION.  THE LIGHT TURNED GREEN AND I ACCELERATED.  ABOUT 2 SECONDS LATER I EXPERIENCED AN EXTREME LOSS OF POWER AND A RUMBLING FEELING.  THE CAR SHUTTERED AND I PULLED OVER TO STOP.  SINCE THE DEALER STATED IT WAS NOT DRIVABLE I AM LUCKY I WAS NOT STRANDED ON THE FREEWAY AS I GENERALLY COMMUTE 30 MINUTES TO WORK EVERY DAY.  I WORRY THAT MYSELF AND OTHER OWNERS OF THE 1.8T ENGINE WILL EXPERIENCE THE SAME ISSUE ONLY FURTHER FROM A SAFE PLACE CAUSING ACCIDENTS OR BEING STRANDED ON THE SIDE OF THE ROAD.  SINCE IT IS A KNOWN FAILURE AMONG VW MECHANICS ITS CLEAR THAT A RECALL IS IN ORDER.  VW HAS SOLD THE 1.8T AS A QUALITY ENGINE ABOVE OTHERS IN ITS CLASS AND SHOULD STAND BEHIND IT.",
        "vin": "WVWPD63B52P"
    }
]