[
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/06/2003",
        "dateOfIncident": "06/03/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021178,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMARY:ON THE 2000 HONDA ACCORD AFTER HAVING PROBLEMS WITH THE ALTERNATOR THE AIR BAGS WOULD BE USELESS IN A CRASH UNLESS HONDA SERVICES THE VEHICLE AND ERASES THE FAILURE CODE THE COMPUTER IS REPORTING.  *AK    I RECENTLY HAD THE ALTERNATOR IN MY 2000 ACCORD EX V6 REPLACED BECAUSE IT WAS NOT WORKING.  AFTER IT WAS REPLACED THE SRS (AIR BAG) LIGHT WAS ON AND WOULD NOT TURN OFF.  I THEN WENT TO THE LOCAL HONDA SERVICE CENTER AND THEY TOLD ME THAT BECAUSE THE ALTERNATOR WAS NOT POWERING THE COMPUTER THAT CONTROLS THE AIRBAGS WITH THE CORRECT VOLTAGE IT TRIGGERED THE FAILURE LIGHT.  I WAS THEN TOLD THAT WHILE THE LIGHT IS ON THE AIR BAGS ARE DISABLED AND WOULD NOT BE DEPLOYED IN THE EVENT OF A CRASH.  I THEN TOLD THE EMPLOYEE THAT THIS WAS THE STUPIDEST THING I HAVE EVER HEARD, AND IS THERE ANY WAY TO RESET THE SYSTEM.  I WAS TOLD THE CAR WOULD HAVE TO BE SERVICED AND HOOKED UP TO THEIR COMPUTER SYSTEM TO RESET THE CARS INTERNAL COMPUTER (AT A COST OF $89.00).  I SET UP AN APPOINTMENT TO HAVE THIS DONE NEXT WEEK BUT GOT TO THINKING HOW THIS IS TRULY A SAFETY ISSUE.  THE SYSTEM SHOULD  RESET ITSELF WHEN EVERYTHING IS NORMAL  SO THE CONSUMER DOES NOT HAVE TO  DRIVE AROUND IN A CAR WITH AIR BAGS THAT DO NOT DEPLOY IN THE EVENT OF A CRASH.  TO HAVE THE CAR DISABLE THIS VITAL PART OF ITS SAFETY FEATURES BECAUSE THE VOLTAGE DROPPED BELOW A CERTAIN POINT MAKES NO SENSE.  I CAN SEE IT DETECTING AN ERROR BUT THEN WHEN EVERYTHING IS BACK TO NORMAL IT SHOULD RESET.  NOW THE CAR IS WORKING PERFECTLY BUT BECAUSE THE COMPUTER DETECTED THAT ONE ERROR NOW THE AIR BAGS WILL NOT WORK AT ALL UNTIL HONDA RESETS IT (AND TAKES $89.00).",
        "vin": ""
    }
]