[
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/10/2003",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021372,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "JAMBOREE",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "LT22575R16E",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 1999 JAMBOREE RV(CLASS C). I HAVE HAD SEVERAL INCIDENTS WITH FLAT TIRES ON THE INSIDE REAR TIRE. THESE FLATS HAVE RESULTED IN SEVERE DAMAGE TO THE COACH. IN THE PAST 18 MONTHS WE HAVE HAD FIVE FLAT TIRES ON THE INSIDE REAR. I HAVE INSTALLED TIRE INFLATORS THAT MAKE CHECKING THE PRESSURE AND MAINTAINING THE PRESSURE EASIER (THINKING THIS WAS THE PROBLEM). I CHECK THIS PRIOR TO EVERY USE. WE USE THE COACH OFTEN AND USUALLY STAY WITHIN A 80 MILE RADIUS. I HAVE GONE ON THREE TRIPS WHEN THE MILAGE HAS EXCEEDED 250 MILES ONE WAY. IT IS ON THESE TRIPS THAT I HAVE THE PROBLEMS. A FEW WEEKS AGO ON A TRIP TO PHENIOX AZ. I HAD THREE FLATS, ONE ON THE WAY AND TWO ON THE WAY BACK. THE TIRE BLOWS AND THE TREAD COMES OFF. THE WHIPPING OF THE TREAD AND THE VIOLENT SHAKING HAS DESTROYED OUR RV. I CONTACTED THE SALES PERSON AT THE DEALERSHIP WHO TOLD ME THAT THE JAMBOREE HAS A WEIGHT AND BALANCE AND/OR SUSPENSION PROBLEM. THE RESULT OF THIS DEFECT IS THE FLAT TIRES. HE SUGGESTED I CONTACT JAMBOREE WHO TELLS ME THAT THEY ARE NOT AWARE OF ANY PROBLEM WITH THIS MODEL AND THE DEALER SAYS IT'S NOT THERE RESPONSIBILITY.*AK",
        "vin": "1FDXE40S3XH"
    }
]