[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2003",
        "dateOfIncident": "09/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021400,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LESABRE",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE COOLANT DESTROYED ENGINE DUE TO THE DEGRADATION OF UPPER INTAKE MAINIFOLD MATERIALS AROUND THE EGR STOVE PIPE.  WITHOUT WARNING(NO WARNING LIGHTS WENT ON)  WHILE ON THE ROAD COOLANT ENTERED THE PISTONS THROUGH THE DEGRADATED UPPER INTAKE MANIFOLD AND CAUSED ENGINE FAILURE.  THIS COULD HAVE CAUSED A MAJOR ACCIDENT AS POWER WAS LOST AND SPEED DRAMATICALLY DROPPED.  SEEMS TO BE OBVIOUS ENGINE DESIGN FLAW IN 3800 V-6 ENGINES PRODUCED BY GM IN BUICK LASABRES, RIVERAS, REGALS, OLDSMOBILE 98S, 88S. INTRIGUE, PONTIAC BONNEVILLES, GRAND PRIX, & CHEVROLET LUMINAS, MONTE CARLOS OVER A PERIOD OF YEARS DATING FROM 1995-1998 WHEN THEY CHANGED THE MANIFOLD DESIGN.  A SERVICE BULLETIN BY GM #01-06-01-007A IN JULY 18, 2001 INDICATED THE GM IS AWARE OF DEFECT AND HAS SINCE PRODUCED A DIFFERENT MANIFOLD TO REPLACE AND REPAIR PROBLEM BUT WILL NOT STAND BEHIND THESE ENGINES WHEN THEY FAIL WITHOUT WARNING.  GM HAS BEEN UNCOOPERATIVE IN THIS MATTER. ALL REPAIRS TO THIS CAR ARE DOCUMENTED WITH BILIINGS, ETC BY CERTIFIED GM SERVICE DEPT. INCLUDING OIL CHANGES AND PREVENTITIVE MAINTENANCE.  THIS WAS A WELL MAINTAINED VEHICLE WITH A SERVICE HISTORY THAT CAN BE DOCUMENTED.  I HAVE PICTURES OF THE INSIDE OF THE ENGINE WHERE DAMAGE OCCURRED.THE GM SERVICE DEPT. THAT REPLACED DAMAGED ENGINE INDICATED THAT THEY HAD 3 OTHER VEHICLES WITH THE SAME ENGINE DAMAGED BECAUSE OF COOLANT LEAK THROUGH THE DEGRADATION OF THE INTAKE MANIFOLD IN THAT ONE MONTH TIME FRAME.  THIS IS A SMALL DEALERSHIP AND THEY INDICATED THAT THIS WAS A INDICATOR OF A MAJOR PROBLEM WITH THIS COMPONENT. *AK",
        "vin": "1G4HP52K6VH"
    }
]