[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2003",
        "dateOfIncident": "04/07/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021432,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE TO WORK THAT MORNING AND EVERYTHING WAS FINE. I WENT TO MY TRUCK TO LEAVE WORK THAT EVENING AND WHEN I CRANKED MY VEHICLE IT MADE A LOUD POP LIKE A BACK FIRE IN THE ENGINE COMPARTMENT AND STARTED RATTLING IMMEDIATELY. I SHUT MY TRUCK OFF AND OPENED THE HOOD TO SEE IF I NOTICED ANYTHING OUT OF THE ORDINARY AND FOUND NOTHING OUT OF PLACE. I HAD MY TRUCK TOWED TO A LOCAL DEALERSHIP AND WAS TOLD I HAD SUFFERED INTERNAL ENGINE DAMAGE AT START UP AND WOULD NEED A NEW ENGINE. THE COST WOULD BE ALMOST $4000.00. I GOT A SECOND OPINION FROM ANOTHER MECHANIC WHO WORKED AT ANOTHER FORD DEALERSHIP IN MY AREA AND WAS TOLD THAT THESE PARTICULAR ENGINES (THE 4.2L IN THE 1997 MODEL YEAR) HAD A PROBLEM WITH THE GASKETS ALLOWING WATER TO LEAK INTO THE CYLINDER (WATER CANNOT BE COMPRESSED SO IT KICKED BACK AND BENT THE ROD) CAUSING INTERNAL ENGINE DAMAGE. I WAS TOLD BY THE MECHANIC THAT THERE WAS A RECALL THAT ADDRESSED THIS PROBLEM AND THAT FORD HAS SINCE CORRECTED IT IN SUBSEQUENT MODEL YEARS. IT IS APPARENT THAT FORD KNOWS OF THIS PROBLEM, BUT CHOOSES NOT TO DO ANYTHING TO HELP THE AFFECTED CUSTOMERS. I DID CALL FORD'S CUSTOMER SERVICE HOTLINE AND WAS TOLD THAT THE RECALL DID NOT INCLUDE MY VEHICLE EVEN THOUGH IT HAD THE SAME PROBLEM BECAUSE IT WAS NOT MANUFACTURED AT THE PLANT THAT THE RECALL COVERED. I ASKED WHY THE RECALL WAS NOT BROADENED TO INCLUDE ALL 4.2L ENGINES SINCE THIS IS EVIDENTLY A WIDESPREAD PROBLEM. I ALSO WANTED TO KNOW IF I HAD ANY RECOURSE AT ALL AND WAS TOLD THAT I COULD HAVE THE ENGINE REPLACED AT MY EXPENSE AND IF FORD DECIDED TO BROADEN THE SCOPE OF THE RECALL I MAY BE ELIGIBLE FOR A REFUND IN THE FUTURE. IF THE RECALL WOULD HAVE INCLUDED MY VEHICLE I WOULD NOT BE LODGING THIS COMPLAINT NOW. IF YOU KNOW THERE IS A MANUFACTURING DEFECT THE RIGHT THING TO DO IS TO CORRECT IT AND KEEP YOUR CUSTOMER BASE. DO YOU KNOW OF ANY RECOURSE THAT I MAY HAVE IN TRYING TO GET THIS PROBLEM CORRECTED? ANY HELP WOULD BE GREATLY APPRECIATED.     *JB",
        "vin": "1FTDX1728VN"
    }
]