[
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/12/2003",
        "dateOfIncident": "05/30/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "AURORA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE STRUTS AND/OR STRUT MOUNTS HAVE BEEN REPLACED 4 TIMES IN THE PAST YEAR.  ALTHOUGH COVERED BY WARRANTY, ABOUT EVERY 3 MONTHS ONE BREAKS, THEN A COUPLE WEEKS LATER, THE OTHER BREAKS.  LITERALLY, THE STRUT PUSHES OUT OF THE TOP OF THE ENGINE COMPARTMENT, RUBBING ON THE UNDERSIDE OF THE HOOD.  THE DEALER DID NOT HONOR THE WARRANTY WITH THE LEFT STRUT THE LAST TIME, AND CHARGED ME $250-.  SAYING I \"HIT\" SOMETHING.  WHEN THE RIGHT STRUT WENT IN THE SAME MANNER ABOUT 3 WEEKS LATER...I INSISTED THAT THE DEAL NOT REPAIR THE VEHICLE, BUT RATHER, DISCOVER WHAT IS CAUSING THE STRUT MOUNTS TO BREAK.  DESPITE TELLING THEM NOT TO REPAIR THE VEHICLE UNTIL I GAVE APPROVAL...THEY REPAIRED IT, BUT WITHOUT MY APPROVAL.  THE DEALER AGAIN CITED IT WAS OUR DRIVING HABITS CAUSING THE PROBLEMS.      WE HAVE NOT HIT, OR RUN OVER ANYTHING WITH THE CAR...FOR THE REASONS THAT THE STRUTS WERE \"WEAK\"..WE GO SLOW OVER RR TRACKS, SLOW DOWN FOR POTHOLES, ETC.   I HAVE REQUESTED, AND RECEIVED ALL THE REPAIR RECORDS FROM THE DEALER.  THE CAR HAD THE SAME PROBLEM BEFORE I BOUGHT IT.    THE SAME PROBLEM HAS BEEN FIXED ON THIS CAR 4 TIMES IN THE PAST YEAR (AS I STATED EARLIER), AND I DO NOT BELIEVE, AT THIS POINT, THAT THE CORE PROBLEM OF CAUSE HAS BEEN IDENTIFIED.  I THEREFORE WANT TO EXPLORE MY OPTIONS UNDER BREACH OF WARRANTY LAW, OR CONSUMER SAFETY PROBLEMS, WITH YOUR ORGANIZATION.       I'M VERY UPSET THAT THEY REPAIRED THE VEHICLE WITHOUT MY CONSENT, AND WANT TO KNOW WHAT RECOURSE I CAN TAKE.  I ASKED FOR THE \"BROKEN\" PART THEY REPLACED, EVEN OFFERED TO PAY FOR IT...BUT THEY DIDN'T HAVE IT.  I'M SUSPECTING THEY ARE COVERING SOMETHING UP.I.E. WORKMANSHIP, INSTALLATION, ETC.        THE DEALER STATED THAT THE STRUT MOUNT BREAKING WAS A \"SERIOUS\" SAFETY HAZARD, AND THAT THE CAR SHOULDN'T BE DRIVEN.  MY CONCERN IS THAT THE MOUNT(S) WILL BREAK AT HIGH SPEED, AND THERE WILL BE SERIOUS INJURY OR DEATH TO MYSELF, OR MY WIFE THE MOUNTS BOTH \"BROKE\" IN TOWN LAST TIME, AT LOW SPEED. *JB",
        "vin": "1G3GS64C414"
    }
]