[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2003",
        "dateOfIncident": "05/25/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021451,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND AM",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1996 PONTIAC GRAND AM WITH A QUAD 4 ENGINE IN IT. THE ENGINE HAS 100,050 MILES ON IT, I TOOK VERY GOOD CARE OF IT, OIL CHANGES ON TIME DID ALL OF THE MAINTENANCE ON IT REQUIRED IN THE BOOK, ETC, ETC. I STARTED THE CAR THE OTHER DAY AND THE WHOLE THING JERKED FORWARD, MADE A LOUD BANG THEN WOULD NOT DO ANY THING BUT TURN OVER REALLY FAST. I HAD IT TOWED IN TO MY MECHANIC AND FOUND OUT THAT MY ENGINE NEEDS TO BE REPLACED BECAUSE THE EXHAUST VALVES SMASHED INTO THE PISTONS AND DID A LOT OF DAMAGE. FROM WHAT I WAS TOLD BY THREE DIFFERENT MECHANICS IS THAT THE QUAD 4 ENGINE MADE BY GM IS THE WORST ENGINE EVER DESIGNED AND SHOULD NOT HAVE BEEN PUT OUT ON THE MARKET. I WAS ALSO TOLD THAT ON THIS TYPE OF CAR OVER 100,000 MILES WAS LUCKY AND THAT KIND OF MILES ON THIS ENGINE IS CONSIDERED HIGH MILEAGE. I WAS TOLD ONE OF TWO THINGS COULD HAVE CAUSED THIS AND THAT BOTH PROBLEMS ARE COMMON IN THIS CAR. THE FIRST CAUSE COULD HAVE BEEN THE HYDRAULIC FLUID THAT CAUSES THE MANIFOLD GASKET TO OPEN WHEN THE CAR IS SHUT OFF SLUDGED UP AND THIS CAUSED THE TIMING TO MIS ALIGN AT START UP AND CAUSED THE VALVES AND PISTONS TO SMASH TOGETHER. THE SECOND COMMON CAUSE FOR THIS IN THIS TYPE OF ENGINE IS THE PIN IN THE CAM SHAFT SNAPPED OFF AT START UP AND CAUSED THE TIMING TO JUMP AND CRASH THE PISTONS AND VALVES TOGETHER. BOTH PROBLEMS ARE KNOWN BY GM, YET THE CONSUMER IS NOT ALERTED SO THEY CAN GO IN AND GET THE CAM PIN CHECKED OR HAVE THE FLUID CHECKED FOR SLUDGING.   *JB",
        "vin": "1G2NE52T0TM"
    }
]