[
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/12/2003",
        "dateOfIncident": "06/12/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021495,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CONTOUR",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "AIR BAG SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I AM AN ORIGINAL OWNER OF A 1999 FORD CONTOUR SE SPORT. ABOUT 2 YEARS AGO THERE WAS A MAINTENANCE RECALL FOR THE CONTOUR'S DASH COMING UP DUE TO BAD GLUE. I TOOK MY VEHICLE TO THE NEAREST FORD DEALERSHIP AND FOUND THAT MY DASH WAS SO BAD IT HAD TO BE REPLACED. MY CAR WAS STILL UNDER WARRANTY AT THIS TIME ALSO. NOW MY DASH IS COMMING UP JUST LIKE IT DID BEFORE, EVIDENTLY THE DASH THEY REPLACED IT WITH STILL HAD THE DEFECTIVE GLUE IN IT. I CONTACTED FORD EXPLAINING THIS TO THEM AND FINDING OUT THAT THE MAINTENANCE ORDER HAD ENDED LAST YEAR. I TOLD THEM ABOUT IT BEING REPLACED AND DOING THE SAME THING IT DONE BEFORE WHILE ALSO EXPLAINING MY CONCERN ABOUT THE PASSENGER SIDE AIRBAG RELEASING AT ANY GIVEN TIME. THIS COULD VERY WELL HURT SOMEONE LIKE MYSELF WHO HAS HAD OPEN HEART SURGERY AND THEN HAD TO HAVE MY CHEST REWIRED DUE TO MY STERNUM NOT FUSING BACK TOGETHER CORRECTLY NOT TO MENTION WHAT THIS COULD DO TO ONE OF MY CHILDREN. THEY REFUSE TO REPAIR MY DASH EVEN THOUGH I DID WHAT THE LETTER TOLD ME AND COULDN'T HAVE AVOIDED THIS PROBLEM FROM HAPPENING AGAIN. I DIDN'T MAKE THE DASH NOR DID I  MAKE THE GLUE, BUT I UPHELD MY RESPONSABILITIES. THIS IS A SAFETY CONCERN AND SHOULD BE REPAIRED BY FORD AT THERE EXPENSE NOT MINE.  *JB",
        "vin": ""
    }
]