[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/18/2002",
        "dateOfIncident": "12/09/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000204,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "1993",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN AN AUTOMOBILE ACCIDENT WHILE DRIVING A 1993 DODGE INTREPID.  SEVERAL VEHICLES AHEAD OF ME STOPPED QUICKLY AND I WAS UNABLE TO COME TO A COMPLETE STOP BEFORE HITTING THE VEHICLE IN FRONT OF ME, A SMALL FORD PICKUP TRUCK.  I ESTIMATE I WAS GOING ABOUT 15 TO 20 M.P.H. AT IMPACT.  THE IMPACT OF THE CRASH CAUSED A MINIMUM OF $3500 TO $4000 IN DAMAGE TO MY INTREPID AND EXCEEDED ITS CURRENT VALUE.  THE FRONT END OF THE INTREPID WAS EXTENSIVELY DAMAGED:  THE HOOD WAS SEVERELY CRUMPLED BACK, THE RADIATOR WAS BENT BACK AT AN ANGLE AND PUSHED BACK INTO THE ENGINE, BOTH HEADLIGHTS WERE DESTROYED, AND BOTH FRONT QUARTER PANELS WERE DAMAGED.  IN ADDITION, THERE WAS A VARIETY OF ADDITIONAL MECHANICAL DAMAGE TO THE COMPONENTS OF THE ENGINE COMPARTMENT.    MY COMPLAINT IS THIS:  NEITHER THE DRIVER'S SIDE AIRBAG NOR THE PASSENGER'S SIDE AIRBAG DEPLOYED!  THE POLICEMEN WHO RESPONDED TO THE ACCIDENT WERE BOTH AMAZED.  FORTUNATELY, I WAS WEARING MY SEAT/SHOULDER BELT AND WAS NOT VISIBLY INJURED.  HOWEVER, I WONDER IF I WOULD HAVE SUSTAINED VISIBLE INJURY, POSSIBLE SEVERE, IF THE ACCIDENT HAD BEEN WORSE AND THE AIRBAGS HAD STILL NOT DEPLOYED.  HAVE I BEEN DRIVING THIS VEHICLE SINCE APRIL 30, 1994 WITHOUT AIRBAG PROTECTION, WHEN ALL THAT TIME I THOUGHT I WAS PROTECTED?  IT'S A SCARY THOUGHT!    THE POLICE ACCIDENT REPORT IS FILED UNDER CASE NUMBER 02-21834 OF THE   JACKSON TOWNSHIP POLICE DEPARTMENT,   5570 FULTON ROAD NW  CANTON, OHIO 44718  (330) 497-7440    THE INSURANCE CLAIM  IS BEING HANDLED BY:  ERIE INSURANCE GROUP  4690 MUNSON STREET N.W.  CANTON, OHIO   44718  (330) 433-1925  (800) 362-6541    THIS VEHICLE WAS PURCHASED (USED) ON MAY 2, 1994.  IT HAD 24,972 MILES ON IT WHEN I PURCHASED IT.    THE ORIGINAL IN-SERVICE DATE WAS FEB. 16, 1993.  IT WAS ORIGINALLY TITLED TO:   KARS DAILY RENTAL  1501 CLEVELAND AVE. NW  CANTON, OHIO   44703",
        "vin": "2B3ED46T4PH"
    }
]