[
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, OTHER,POWER TRAIN,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/03/2003",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022912,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "ML320",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEFECT STATED IN RECALL 03 V 121 000 FOR THE POWER STEERING HOSE CLAMP HAPPENED WHILE THE CONSUMER WAS WAITING TO BE NOTIFIED.   *AK   THE CONSUMER EXPERIENCED THE FOLLOWING:  THE ENTIRE INSTRUMENT CLUSTER LIT UP AND FLASHED AND BEEPED, LOST THE SPEEDOMETER, TACHOMETER, GAS/GAS TEMPERATURE GAUGE, AND THE VEHICLE HAD GONE INTO SECOND GEAR AND DID COME OUT FOR SOME TIME(DISCOVERED IT WAS IN LIMP-HOME MODE).  THE SERVICE DEALER ADVISED THE CONSUMER THAT THE PROBLEM WAS THE GEAR SELECTOR.  THE INSTRUMENT CLUSTER LIGHTS HAD GONE OFF, EXCEPT FOR THE BAS/BRAKE ASSIST SYSTEM LIGHT, THE GAUGES, SPEEDOMETER, AND TACHOMETER HAD RESUMED.  THERE WAS AN INCIDENT WHERE HALF OF INSTRUMENT CLUSTER DISPLAY ON THE LEFT LIT UP, ALTHOUGH THE VEHICLE CONTINUED TO RUN.  THE SERVICE DEALER THOUGHT THE PROBLEM MAY HAVE BEEN THE BATTERY.  DURING A RAINSTORM, THE ENTIRE INSTRUMENT PANEL LIT UP, THE TACHOMETER, SPEEDOMETER, AND THE GAS GAUGE STOPPED AND THE INSTRUMENT PANEL KEPT BEEPING INTERMITTENTLY BUT DID NOT GO INTO LIMP MODE.  THERE WAS A CRACK IN ONE OF THE D-PILLARS, AND THE REAR HATCH LOCK DID NOT WORK.  THE IGNITION LOCK SEEMED LOOSE SINCE THE GEAR SHIFT ASSEMBLY HAD BEEN REPLACED, THE WINDSHIELD WASHER RESERVOIR LEAKED.  THE BAS/ESP CONTROL MODULE HAD BEEN CHANGED, BUT THE PROBLEM PERSISTED.  THE CONSUMER WAS TOLD THE VEHICLE NEEDED A NEW BATTERY.  THE BRAKE PAD WEAR LIGHT DISPLAYED, THE POWER STEERING HAD FAILED AGAIN.  THE CONSUMER WAS ADVISED THE VEHICLE NEEDED FRONT AND REAR BRAKES THEN WAS TOLD THAT IT WAS A CLAMP PROBLEM.  ALSO THE DRIVER'S WINDOW SWITCH HESITATED.  THE SAFETY RECALL NOTICE THAT RELATED TO THE FAILURE OF THE HOSE CLAMP FOR THE POWER STEERING FLUID WHICH APPARENTLY CAUSED THE COMPLETE LOSS OF POWER STEERING IN THE VEHICLE AS WELL AS DAMAGE TO THE HYDRAULIC FLUID PUMP WHICH RESULTED IN REPAIRS PERFORMED ON THE VEHICLE.  THE CONSUMER REQUESTED FULL REIMBURSEMENT FOR THE CHARGES RELATED TO THE REPAIRS.  RECALL# 03V121000   *SCC      *JB",
        "vin": "4JGAB54E91A"
    }
]