[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2003",
        "dateOfIncident": "06/11/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023058,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "I WISH I HAD KNOWN EARLIER THAT THIS COMPLAINT  TO THE NHTSA WAS POSSIBLE.  FOR YEARS, I DID NOT KNOW WHAT TO DO ABOUT A SERIOUS PROBLEM WITH MY 1989 HONDA ACCORD.  SINCE THE FIRST YEAR OF OWNERSHIP THE CAR OVERHEATED AND REVVED VERY HIGH WHENEVER I HAD TO WAIT IN TRAFFIC FOR MORE THAN 15 MINUTES ON A 70 DEGREE OR HIGHER DAYS.  I'VE TAKEN THE CAR TO SEVERAL REPAIR FACILITIES AND DESPITE MY SPENDING NEARLY $3,000 ON \"REPAIR-WORK\", THE PROBLEM CAUSED THE CAR'S DEMISE AT 116,000 MILES ON JUNE 11, 2003.  THE GEAR WOULD NOT ENGAGE DESPITE CLUTCH REPLACEMENTS  IN JAN OR FEB. 2003 AND  IN 1999. I HAD TO HAVE IT TOWED HOME.  I HAVE TAKEN VERY GOOD CARE OF MY CAR, WITH REGULAR OIL CHANGES EVERY 3 TO 6 MONTHS HOPING TO KEEP IT TILL AN ODOMETER READING OF AT LEAST 160,000 MILES.  THIS PROBLEM STARTED WITHIN A YEAR OF OWNERSHIP AND I FELT THAT I HAD NO RECOURSE BUT TO TRY TO GET IT REPAIRED.  I DID NOT TAKE IT TO MY HONDA DEALER BECAUSE I FELT THAT THEIR CHARGES FOR OIL CHANGES WERE EXCESSIVE COMPARED TO REGULAR GAS STATIONS CHARGES AND TO MY MIND, DELIVERED INEFFECTUAL REPAIRS AND SUSPECT SUGGESTIONS FOR REPAIR AS WAS THE PRACTICE IN OTHER DEALERSHIPS IN THE EARLY 90'S.   MY HONDA EXPERIENCE WAS NOT A GOOD ONE AND HAS COST ME HALF THE PRICE OF THE CAR IN REPAIRS.  I DON'T KNOW IF YOU CAN SEEK ANY REDRESS FOR ME SINCE I PURCHASED THE CAR SO LONG AGO BUT I THINK I'VE BEEN DEALT A BAD DEAL.  THINKING BACK ON IT ALL, I BELIEVE I WAS SOLD A LEMON.  I DIDN'T THINK THIS WAS POSSIBLE IN A HONDA BUT WHEN I READ THE COMPLAINTS SECTION OF THIS WEBSITE, MANY OF THEN TO DO WITH ENGINE COOLING PROBLEMS, MY FAITH IN HONDA IS QUESTIONABLE.  I HAD INTENDED TO BUY A HONDA THE SECOND TIME AROUND BUT I WILL THINK TWICE NOW AND CONSIDER INSTEAD THE HIGHLY-RATED VW PASSAT OR A TOYOTA.   *NLM",
        "vin": "1HGCA5527KA"
    }
]