[
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,SEAT BELTS,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/13/2003",
        "dateOfIncident": "06/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023003,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WILDERNESS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "RE 2000 CHEVROLET SUBURBAN 4X4.  VEHICLE HAS STEERING DIFFICULTIES (VEHICLE CAN COMPLETELY CHANGE LANES WITHIN 2 LINES ON THE ROAD, LOOSE STEERING AT TIMES, STEERING WHEEL JUMPS WHEN TURNING CURVES) WHICH WERE REPORTED TO DEALER SEVERAL TIMES.  DEALER BLAMED TIRES WHICH WERE NOT RECALLED.  THE JUMP/POP IN STEERING WHEN ROUNDING CURVES WAS SAID TO BE DUE TO LACK OF LUBRICATION UPON CONSTRUCTION OF VEHICLE-SOMEWHAT IMPROVED.  STEERING COLUMN STILL MOVES (FEELS LOOSE AT TIMES) AND FEELS AS THOUGH WILL DISCONNECT OR TIRE ROD WILL BREAK WHEN THIS HAPPENS WHILE DRIVING.  AT 43,000 MILES FRONT END DIFFERENTIAL HAD TO BE REPAIRED, JUST OVER EVERY 20,000 MILES BRAKE DISC SEEMS TO NEED REPLACED.  VEHICLE DOES NOT GO COMPLETELY INTO PARK OR GEAR AND SOMETIMES POPS OUT (THOUGHT TO NEED LINKAGE ADJUSTMENT, BUT VEHICLE HAS CABLE SO CANNOT BE ADJUSTED ACCORDING TO REPAIR PERSON).  SOMETIMES (FAIRLY FREQUENTLY) SEAT BELTS STILL DO NOT COMPLETELY BUCKLE, THEY WILL POP OUT AT VARIOUS TIMES IF THEY BUCKLE AT ALL(NOT ONLY WITH CHILDREN, BUT WITH ADULTS).  VEHICLE SEEMS VERY LOOSE TO DRIVE AND WE FREQUENTLY FEEL AS THOUGH WE DON'T HAVE CONTROL OF OUR VEHICLE WHEN DRIVING (INTERMITTENTLY).  WE FEEL VERY UNSAFE IN THE VEHICLE.  *NLM",
        "vin": "3GNFK16T1YG"
    }
]