[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2003",
        "dateOfIncident": "06/13/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023071,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "QUEST",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW QUALITY MATERIALS CAUSING A FIRE HAZARD THAT WERE NOTICED BY INSPECTING EQUIPMENT. THE PASSENGER HEADLIGHT MALFUNCTIONED AND THE ELECTRICAL SYSTEM WENT OUT AND CAME BACK ON INCLUDING ALL DASH ELECTRICAL EQUIPMENT WHILE THE VAN WAS IN MOTION. THE RIGHT HEADLIGHT WAS NOT OPERATING EVERY TIME IT WAS NEEDED. I PURCHASED THE VAN AND I NOTICED THE HEADLIGHT WAS COMING ON AND GOING OFF. I INSPECTED THE HEADLIGHT ASSEMBLY AND NOTICED THAT THE CONNECTOR THAT SNAPS THE HARNESS TO THE BULB HAD MELTED WIRES. THE CONNECTOR HAS THREE WIRES (LOW BEAM POSITIVE,HIGH BEAM POSITIVE, AND GROUND.) THE CONNECTOR IS MADE OF MOLDED PLASTIC AND THE WIRES TRAVEL THROUGH THE CONNECTOR AND CLIP ON THE BULB ASSEMBLY. THE VAN IS 3 YEARS OLD AND THE CENTER GROUND WIRE HAS MELTED THE CONNECTORS SO BAD THAT IS HAS COME INTO CONTACT WITH THE OTHER POSITIVE LEADS CASING A SYSTEM SHORT AND A FIRE HAZARD. I INSPECTED THE OTHER HEADLIGHT WIRING HARNESS AND FOUND THE CENTER GROUND TO BE BADLY MELTED AS WELL.  THE VEHICLE IS A 1999 NISSAN QUEST AND IT ONLY HAS 32,000 MILES. THE LOAD ON THE HARNESS AND WIRES IS TOO MUCH. THE HEADLIGHTS WERE FACTORY INSTALLED AND WERE NEVER REPLACED SO THIS IS A PROBLEM FORM THE DESIGN. I HAVE REMOVED THE DEFECTIVE CONNECTOR AND REPLACED IT WITH A BETTER DESIGNED ONE FROM ANOTHER VEHICLE MANUFACTURER. THE DEFECTIVE CONNECTOR IS AVAILABLE FOR INSPECTION.   *NOLM",
        "vin": "4N2XN11T4XD"
    }
]