[
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "06/06/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023241,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY BEARINGS REPLACED, MY REAR HUB BEARINGS. NOW IT IS MAKING TO SAME NOISE AND THEY NOW SAY IT IS NOT THE BEARINGS-THEY DO NOT KNOW WHAT IT IS! MY CAR IDLE SOUNDS LIKE IS GOING TO STALL ALL THE TIME WHEN I AM STOPPED. THE CAR PULLS AROUND 5,20 AND 50 MPH LIKE IT JUST CANNOT GET GAS OR THE TRANSMISSION IS BAD. I BROUGHT IT IN 2XS. THEY SAY THEY DO NOT KNOW WHAT IT IS AND CANNOT GET ANYTHING ON THE DIAG MACHINES. NOW I AM PASSED 60,000 MILES. AFTER HAVING MY CAR FOR 2 DAYS (GIVING ME NO LENDER OR RENTAL) THEY FOUND A PROBLEM AT THE LAST MINUTE. OIL LEAKED FROM THE VALVES INTO THE SPARK PLUG WIRES INTO THE COIL PACK AND THAT IS THE CAR PULLING PROBLEM. THEY SAY I HAVE TO PAY $600 TO FIX IT. THIS WAS ON JUNE 6,2003. I BROUGHT THE CAR IN FOR THE IDLE WHICH WAS NOT FIXED AND BROUGHT IT IN FOR THIS ENGINE HESITATION 2XS. BOTH TIMES THEY DID NOT AND COULDNOT FIX THESE PROBLEMS. I HAVE THE RECEIPTS THAT THEY COULD NOT FIX NOR REPEAT THESE PROBLEMS, BUT THEY ARE NOTED. I SHOULD NOT HAVE TO PAY FOR THESE REPAIRS!!!! THIS IS NOT DAILY UPKEEP!! THIS MUST BE DEFECT!! I HAVE A REAL PROBLEM WITH THIS CAR! I NEED TO BE CONTACTED ON THIS MATTER FOR HYUNDAI TO PAY FOR THESE REPAIRS! I AM HAVING A DIFFICULT TIME ON THIS MATTER. THESE PARTS NEED TO BE REPLACED NOW AND I CANNOT AND SHOULDN'T HAVE TO PAY FOR THESE PARTS OR LABOR!   I ALSO  HAVE HAD MY FRONT DRIVER WINDOW REGULATOR FIXED 4 TIMES, MY FRONT PASSENGER SIDE REGULATOR FIXED ONCE, MY REAR REGULATOR FIXED ONCE. I HAD TO BUY A NEW BATTERY FOR MY CAR AND A NEW HEADLIGHT IN THE FIRST YEAR(HYUNDAI SAID I HAD TO SUBMIT PAPERWORK TO SEE IF THEY WOULD VOTE TO REPAY ME FOR MY COST OF THE BATTERY). I HAD MY AIR BAG LIGHT GOING OFF(WHICH NOW I NEVER TRUST FOR IT TO GO OFF WHEN NEEDED OR EVEN GO OFF WHEN NOT ). MY PAINT IS CHIPPING EVERYWHERE! MY FRONT PASSENGER WINDOW LEAKS ALL OVER MY CARPET INSIDE FLOOR. AND MANY MORE PROBLEMS!   *JB  THANK YOU,  DARLENE LIDDANE  DLIDDANE@EARTHLINK.NET  941-637-0802",
        "vin": "KMHWF25S5YA"
    }
]