[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/16/2003",
        "dateOfIncident": "06/14/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023164,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2000 DODGE INTREPID IN FEB. 2003 WITH 37,295 MILES ON IT. STARTED TO NOTICE THE CAR PULLING TO THE RIGHT AND A LOT OF PLAY IN THE STEERING WHEEL. I TOOK THE CAR TO KEYSTONE CHRYSLER TO BE SERVICED ON MAY 15, 2003. STEVE HALLER(REP.) SAID IT SOUNDS LIKE AN ALIGNMENT PROBLEM. WHEN I CALLED MR. HALLER TO CHECK HOW THINGS WERE GOING, HE SAID THEY WERE HAVING SOME TROUBLE TRYING TO ALIGN THE CAR, BUT THEY WILL GET IT DONE. I DROPPED THE CAR OFF AT 7 A.M. AND THE CAR WAS NOT FINISHED UNTIL 2:30 THAT AFTERNOON. THAT SEEMS LIKE A LONG TIME FOR AN ALIGNMENT. WHEN I PICKED THE CAR UP, I STILL NOTICED A LOT OF PLAY IN THE STEERING WHEEL AND THE DRIFTING TO THE RIGHT. IT WAS AS IF I HAD NO CONTROL OVER WHICH DIRECTION THE CAR WAS GOING. I THEN TOOK THE CAR BACK TO THE DEALERSHIP AND THEY SAID THEY WOULD CORRECT THE PROBLEM. MR. DOOLITTLE(ANOTHER REP.) THEN CALLED ME AT HOME THAT AFTERNOON TO TELL ME THAT THERE IS NO ALIGNMENT PROBLEM, BUT THERE IS A PROBLEM WITH THE RACK AND PINION. HE SAID IT NEEDS TO BE REPLACED SOON, BUT WILL COST $1200. HE ALSO TOLD ME THAT THE CAR IS UNSAFE TO DRIVE AND HE RECOMMEND THAT I DO NOT DRIVE IT HOME. WELL, I HAD NO OTHER CHOICE BUT TO GO PICK UP THE CAR AND DRIVE IT HOME. I DID NOT HAVE $1200 TO FIX THE RACK AND PINION. ON JUNE 14, 2003, MY CAR LOST CONTROL. IT PULLED TO THE LEFT AND WOULD NOT BUDGE. IT NOW SITS IN MY DRIVEWAY COLLECTING DUST. I RECENTLY BEEN INVESTIGATING INTO THIS RACK AND PINION PROBLEM WITH INTREPID'S AND I REALIZE I AM NOT THE ONLY ONE WITH THIS PROBLEM. YET THE PROBLEM IS SO COMMON THAT THE PART IS ON BACK ORDER BECAUSE OF HIGH DEMAND. DOESN'T THAT SAY ANYTHING TO THE CHRYSLER CORPORATION?  THE STEERING PROBLEMS WITH THE DODGE INTREPID IS SO SERIOUS, IT IS TAKING LIVES AND INJURING MANY PEOPLE. I FEEL THE RACK AND PINION SHOULD BE RECALLED AND FIXED BEFORE IT INJURES OR KILLS ANYONE ELSE.   *NLM",
        "vin": "2B3HD46RXYH"
    }
]