[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/16/2003",
        "dateOfIncident": "05/31/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023204,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2003 KIA SORENTO 4X4 ON 5/26/03.  ON 5/31/03 (ODOMETER 600 MILES)WHILE DRIVING AND MAKING A RIGHT HAND TURN THE POWER STEERING FAILED, ALMOST STRUCK ANOTHER VEHICLE, TRIED TO REGAIN CONTROL OF VEHICLE AND PULLED TO SIDE OF ROAD. A FRIEND WAS IN THE VEHICLE WITH ME AND CAN ATTEST TO THE POWER STEERING FAILURE BECAUSE HE TRIED TO STEER THE VEHICLE ALSO.  6/2/03  DEALERSHIP REPLACED POWER STEERING RACK, GEAR AND ASSEMBLY. ON 6/10/03 (ODOMETER 830) POWER STEERING FAILED AGAIN WHILE I WAS EXITING DOWN IN A PARKING GARAGE; HAD TO FIGHT WITH THE STEERING WHEEL TO GAIN CONTROL. ON 6/12/03 (ODOMETER 850) POWER STEERING PUMP WAS REPLACED AND LATER THAT EVENING WHILE PULLING OUT OF A PARKING STALL FROM THE RESTAURANT THE POWER STEERING WENT OUT AGAIN. DEALERSHIP SAID A TEAM OF 3 KIA SERVICE TECHS NOW FOUND OUT THERE WAS A PROGRAM ERROR ON THE VEHICLES COMPUTER; THEY CAME TO THE CONCLUSION THEY(KIA OR THE DEALERSHIP) DIDN'T HAVE A CLUE. MONDAY 6/16/03 ENGINEER TEAM FROM KIA WAS TO EVALUATE THE VEHICLE. THEY COULD NOT FIGURE THE PROBLEM OUT. AFTERNOON OF 6/16/03 DEALERSHIP SAID KIA'S FIELD INSPECTOR WILL BE OUT WEDNESDAY 6/18/03 TO EVALUATE THE VEHICLE FURTHER. I COULD HAVE KILLED SOMEONE OR MYSELF DRIVING THIS VEHICLE WHILE THE POWER STEERING REPEATED FAILED. NOW I'M DEATHLY TERRIFIED DRIVING THE VEHICLE, I'M IN A RENTAL CAR UNTIL WEDNESDAY 6/18/03 WHILE THE KIA FIELD INSPECTOR EVALUATES THE VEHICLE. IN MY OPINION KIA NEEDS TO RECALL THIS VEHICLE AND GIVE MY MONEY BACK. I DON'T NEED TO RISK MY LIFE IN ORDER TO MAKE THE COMPANY LOOK GOOD. KIA CONSUMER AFFAIRS WERE KEPT IN THE LOOP FROM DAY ONE BUT NO ONE CARES HOW SERIOUS THIS IS, PLEASE HELP.   *NLM",
        "vin": "KNDJC733535"
    }
]