[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/20/2004",
        "dateOfIncident": "06/12/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON 6/12/03 I EXPERIENCED COMPLETE TREAD SEPARATION ON A FIRESTONE STEELTEX LT 265/75R16E TIRE WHILE TRAVELING NORTHBOUND ON I-75 NEAR RIVERVIEW, FL.  THE TIRE WAS MOUNTED ON THE FRONT LEFT OF MY 2001 FORD F250.  AS THE TREAD SEPARATED IT DAMAGED THE TRUCK BODY AROUND THE WHEEL WELL, AND CAUSED ME TO MOMENTARILY LOSE CONTROL OF THE VEHICLE.  ONCE I BROUGHT THE VEHICLE TO A STOP, I DISCOVERED THAT THE TIRE WAS STILL INFLATED, BUT THAT THE TREAD HAD COMPLETELY PEELED OFF. THE TIRE WAS ORIGINAL WITH THE NEW VEHICLE, AND HAD APPROXIMATELY 44650 MILES ON IT.  THE TIRE WAS IN GOOD CONDITION, WITH CONSIDERABLE TREAD LIFE REMAINING.  ON 6/13/03 I DELIVERED THE TRUCK TO THE BODY SHOP AT BRANDON FORD (9090 ADAMO DR., TAMPA) FOR REPAIR.  THE ESTIMATE TO REPAIR DAMAGE TO THE FRONT BUMPER,  THE LEFT FRONT FENDER, THE LEFT FRONT DOOR, AND TO BLEND PAINT ONTO THE HOOD AND REAR DOOR IS $2353.72.  THIS ESTIMATE DOES NOT INCLUDE REPLACEMENT OF THE DECALS OR REPLACEMENT OF THE TIRES.  THE SERVICE REPRESENTATIVE AT BRANDON FORD INDICATED THAT FIRESTONE MAY PAY TO REPAIR DAMAGE CAUSED BY TREAD SEPARATION ON ONE OF THEIR TIRES.   *JB   *SC  *JB",
        "vin": "1FTNW21F01E"
    }
]