[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/18/2003",
        "dateOfIncident": "01/18/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10023337,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE HEAD AIRBAG (AIR CURTAIN) OF A 2003 VOLKSWAGEN PASSAT W8 SEDAN DEPLOYED SPONTANEOUSLY WHILE I WAS DRIVING THE CAR...A FEW MINUTES LATER, WHEN THE CAR WAS STOPPED, THE STEERING WHEEL AIRBAG DEPLOYED SPONTANEOUSLY...I SUFFERED A PERMANENT WRIST INJURY AND AM SUFFERING FROM POST TRAUMATIC STRESS SYNDROME...THE INCIDENT, WHICH HAPPENED DURING A TEST DRIVE, WAS REPORTED TO THE MANAGEMENT OF THE VW DEALERSHIP FOR WHICH I WAS WORKING AND TO VW OF AMERICA BY THE MANAGEMENT...I SENT A DETAILED INCIDENT REPORT TO BOTH VW OF AMERICA AND VW AG (GERMANY) CEOS...  A VW CUSTOMER SERVICE REPRESENTATIVE ADMONISHED ME TO NOT MAKE A FUSS ABOUT THE INCIDENT, SAYING IT WAS A ONCE-IN-A-LIFETIME OCCURRENCE UNLIKELY TO HAPPEN AGAIN, AND ADVISED ME THAT MY LETTER TO THE VWOA CEO HAD BEEN RECEIVED BUT THAT HE HAD NOT READ IT...  THE OWNER OF THE DEALERSHIP ADVISED ME IN A SPECIAL MEETING THAT HE HAD BEEN CONTACTED BY A VWOA MANAGEMENT REPRESENTATIVE WHO WAS UNHAPPY WITH THE COMPLAINTS I HAD MADE TO THE CUSTOMER SERVICE REPRESENTATIVE ABOUT THE LACK OF FOLLOW-UP BY VW AND THE MEANS OF ALERTING VW OWNERS ABOUT THE INCIDENT I WAS CONSIDERING... I LEFT THE MEETING BELIEVING MY JOB AND FUTURE IN THE CAR BUSINESS, AT LEAST SELLING VW PRODUCTS, WOULD BE IN JEOPARDY IF I TOOK ANY AFFIRMATIVE ACTION SUCH AS FILING THIS COMPLAINT. A PROMISE THAT I WOULD BE INFORMED BY VWOA OF THE REASON FOR THE SPONTANEOUS DEPLOYMENT HAS NOT BEEN FULFILLED AND I HAVE NOT BEEN CONTACTED BY ANY VW REPRESENTATIVE IN ALMOST FOUR MONTHS... RECENTLY, I WAS FIRED BECAUSE OF AN INCIDENT, I CONSIDER, RELATED DIRECTLY TO THE INCIDENT... I AM FILING THIS REPORT BECAUSE I HAVE JUST LEARNED THAT ANOTHER PERSON HAS, REPORTEDLY, EXPERIENCED THE SPONTANEOUS DEPLOYMENT OF AN AIRBAG IN A VW CAR AND I AM NOW CONFIDENT THAT WHAT I EXPERIENCED WAS NOT A FREAK OCCURRENCE.   *NLM",
        "vin": ""
    }
]