[
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/18/2003",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023331,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "STRATUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2001 DODGE STRATUS IN FEBRUARY 2003.  THE CAR HAD A  TOTAL OF 48702 MILES.  WITHIN THE FIRST WEEK, THE CAR WAS TAKEN BACK TO THE DEALER FOR BRAKE PROBLEMS.  THE FRONT BRAKES WAS MISSING SOME TYPE OF BRAKES CLIPS.  THIS WAS REPAIRED BY THE DEALERSHIP.  THEIR WAS ALSO A NOISE FROM THE STEERING COLUMN.  THE DEALERSHIP STATED THAT THEIR WAS NO PROBLEM LOCATED AND THAT IT WAS JUST THE TIRES RUBBING THE PAVEMENT WHEN TURNING.  WITHIN 85 DAYS, THE CAR LOST SPEED WHILE DRIVING AND WOULD NOT MOVE.  IT TOOK ONE HOUR TO COAST 2.5 MILES TO HOME.  I  LATER HAD THE CAR TOWED TO THE DEALERSHIP.  THEY CALLED THE NEXT DAY TO TELL US THAT WE NEED A COMPLETE OVERHAUL OF THE TRANSMISSION AND NEEDED TO REPLACE THE PUMP AND CONVERTER. A COST OF $2000.  I HAVE NEVER HAD ANY PROBLEMS WITH ANY OTHER BRAND OF USED CARS EVEN WITH HIGH MILEAGE.  THIS CAR WAS DRIVEN LESS THAN 90 DAYS.  THE DEALERSHIP SAID THAT HAD THE CAR MALFUNCTION WITH THE FIRST 60 DAYS, THEN THEY WOULD HAVE REPAIR IT.  THE CAR HAS 55225 MILES AS OF TODAY'S DATE.  THIS IS A MAJOR REPAIR THAT IS WELL DOCUMENTED AS A PROBLEM WITH DODGE/CHRYSLER VEHICLE.  WE CALLED THE CHRYSLER CONSUMER SERVICES HOTLINE AND WAS TOLD THAT WE HAD TO WORK SOMETHING OUT WITH THE DEALERSHIP AS TO THE REPAIRS.  THE DEALERSHIP IS CURRENTLY WORKING WITH US TO RESOLVE THIS PROBLEM AT OUR EXPENSE.  WE ARE NOT AGREEING TO THIS ARRANGEMENT AND IS WAITING FOR HIGHER MANAGEMENT TO INTERVENE..   *NLM",
        "vin": "1B3EJ46X71N"
    }
]