[
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "06/18/2003",
        "dateOfIncident": "10/07/2002",
        "fire": false,
        "manufacturer": "TRAIL KING",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023284,
        "products": [
            {
                "manufacturer": "TRAIL KING",
                "productMake": "TRAIL KING",
                "productModel": "TRAILER",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "ON  7 OCTOBER 2002 I WAS TRAVELING DOWN A HIGHWAY NEAR DENVER  WHEN AN AIR HOSE COUPLING RELEASED AND CAUSED THE EMERGENCY PARKING BRAKES TO APPLY .ON 15 JUNE 2003 THE SAME AIR HOSE COUPLING RELEASED AND CAUSED THE EMERGENCY PARKING BRAKES TO APPLY. WHEN THIS HAPPENS THE TRACTOR TRAILER COMES TO A SUDDEN AND COMPLETE STOP ON THE HIGHWAY.  THE FAILURE OCCURS DUE TO A QUICK RELEASE COUPLING USED TO CONNECT THE TRAILER AIR HOSE SUDDENLY RELEASES AND THE RESULTS ARE A LOCKING OF ALL TRAILER WHEEL BRAKES.  THE AIR HOSE HAVE A QUICK DISCONNECT FITTING COMMONLY REFERRED TO AS A \"SCHRADER FITTING OR COUPLER .THIS COUPLER IS USED SO THAT THE TRAILER GOOSE NECK CAN BE REMOVED TO CONVERT THE LOWBOY TRAILER TO ALLOW THE LOADING OF VEHICLES OR EQUIPMENT SUCH AS BULL DOZERS..THE COUPLER IS IN A NON PROTECTED AREA UNDER THE TRAILER GOOSENECK JUST BEHIND THE REAR DRIVE WHEELS OF THE TRACTOR .  I CALLED TRAIL KING INDUSTRIES IN MITCHELL SOUTH DAKOTA, ON 17 JUNE 2003 AND SPOKE WITH DON (LAST NAME UNKNOWN) AND DISCUSSED THE RECURRING PROBLEM WITH HIM.  HE TOLD ME HE KNEW OF AT LEAST 4 OTHER OCCASIONS OF THIS PROBLEM OCCURRING AND THAT IT WAS NOT A TRAIL KING PROBLEM NOR WAS THERE ANY DEFECT IN THE COUPLERS... THIS COUPLE IS NOT A \"GLAD HAND\" TYPE AIR HOSE COUPLER SUCH AS THE KIND USED TO CONNECT THE TRACTOR AIR HOSE TO THE FRONT OF THE TRAILER..IT IS A COUPLE COMMONLY USE TO CONNECT AIR TOOLS SUCH AS AN IMPACT WENCH TO A AIR HOSE USED IN A MECHANICS SHOP. THIS PROBLEM HAS ALSO OCCURRED TO A TRAIL KING TRAILER OWNED BY REDMOND HEAVY HAUL IN PORTLAND,OREGON.  AFTER THE FIRST OCCURRENCE I HAVE ALWAYS TRIPLE CHECKED THE BRAKE HOSE  CONNECTIONS TO MAKE SURE THAT THE CONNECTIONS WERE SECURE..THE LAST FAILURE OCCURRED 700 MILES SINCE THE LAST TIME I REMOVED AND RECONNECTED THE BRAKE AIR HOSES . THE LAST FAILURE CAUSED ONE TIRE TO EXPLODE AND CAUSED MY TRACTOR TRAILER TO COME TO A SUDDEN AND COMPLETE STOP ON A HIGHWAY.    *NLM",
        "vin": "1TKJ04825XM"
    }
]