[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "07/01/2002",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023265,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "626",
                "productYear": "1993",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER OWNING MY 1993 MAZDA 626 LX FOR OVER TWO YEARS I FIND OUT THAT THE CAR IS DESTINED TO BAD TRANSMISSION PROBLEMS. I HAD THE TRANSMISSION REPAIRED DUE TO THE ELECTRICAL TRANSMISSION PROBLEMS CAUSING THE CAR TO GET WORSE. I STARTED HAVING THE NOTORIOUS FLASHING HOLD LIGHT THUS CAUSING MY TRANSMISSION TO FAIL. BEING SOMEONE OF AVERAGE INCOME IT IS VERY DIFFICULT TO KEEP REPAIRING MAZDA'S INEVITABLE PROBLEMS. I NOW FEEL INSECURE OF MY LIFE, THE LIFE OF MY WIFE AND OUR NEWBORN BABY. AFTER REPAIRING THE TRANSMISSION THE PROBLEM AROUSED A FEW MONTHS LATER. UNFORTUNATELY, THE WARRANTY ON THE TRANSMISSION REPAIR IS OVER.    I WISH AND HOPE TO REPLACE THE MAZDA 626 UNFORTUNATELY I BUDGETED TO HAVE THE MAZDA 626 FOR YEARS TO COME. IT WAS STUPENDOUS WHEN I FIRST PURCHASED THE MAZDA 626. HOWEVER, IF I WOULD HAVE KNOWN ABOUT THE COMMON TRANSMISSION PROBLEMS THE MAZDA 626 LX HAS I WOULD HAVE PASSED ON PURCHASING THE CAR. OWNING THIS CAR HAS EVEN PUT ME IN A FINANCIAL DOWN   SPIRAL. I PUT MONEY INTO THIS MAZDA 626 THAT I SHOULDN'T BE PAYING FOR. IF THE MAZDA 626 LX HAS MECHANICAL AND ELECTRICAL PROBLEMS WHY THEN ARE THEY SOLD AND PUT OUT ON THE ROAD TO EVENTUALLY SUBJECT MOTORISTS TO ACCIDENTS DUE TO FAULTY CRAFTSMANSHIP OF THE CAR. I HAVE DONE RESEARCH, UNFORTUNATELY TOO LATE, ABOUT THE MAZDA 626'S AND HAVE READ REPORTS AND FORUMS FROM CONSUMERS AND EXPERT MECHANICS AND PASSED MAZDA EMPLOYEES ABOUT THE INEVITABLE DECLINE OF THE MAZDA 626 TRANSMISSION. I TRUSTED THE MAZDA NAME AND WAS HORRIFIED TO FIND OUT THAT THEY ALLOW A AUTOMOBILE AS SUCH TO BE STANDARD DRIVING VEHICLES. PLEASE HELP ME AND FUTURE VICTIMS ON CORRECTING THIS WRONGFUL DECISION. IF MAZDA KNOWS THAT THEY HAVE A FAULTY CAR IN PRODUCTION AND PUT THEM OUT ON THE ROAD, THEN WHY ARE WE PAYING MORE MONEY TO OWN AND KEEP THE MAZDA 626 LX? IT IS A MONEY PIT, AN UNPREDICTABLE FUTURE ROAD HAZARD AND A CONSUMERS WORST NIGHTMARE. ANY HELP WOULD BE GREATLY APPRECIATED. THANK YOU FOR YOUR TIME.    RAUL SANCHEZ.   *JB",
        "vin": "1YVGE22A1P5"
    }
]