[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/20/2003",
        "dateOfIncident": "06/18/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023445,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO-CHARGER BROKE DOWN. IT SHOULD NOT HAVE HAPPENED AT 68000 AS IT IS NOT A WEARABLE PART.  THE CAR STARTED STALLING, PRESSED GAS PEDAL BUT THERE WAS NO MOVEMENT. SCALE OF THE RPM'S ON THE DASH BOARD WENT ALL THE WAY TO 5500 RPM'S, WHEN I PRESSED A GAS PEDAL, BUT THE CAR DID NOT MOVE. SUDDENLY, I WAS ENGULFED IN HUMUNGOUS AMOUNT OF WHITE SMOKE. BROUGHT CAR TO DON ROSEN AUDI SERVICE CENTER AND THEY ARE SAYING THAT REPAIR WILL COST ME SOME $1,600 AT LEAST.  BUT, I BROUGHT MY CAR IN, MONTH AGO TO DON ROSEN AUDI AUTHORIZED SERVICE CENTER WITH COMPLAINT THAT THERE WAS WHITE SMOKE COMING OUT OF THE EXHAUST AND THAT VEHICLE WAS RUNNING AT 60% OF ITS POWER. THEY LOOKED AT IT AND SAID THEY DID NOT SEE ANY PROBLEM, PARTICULARLY THAT THE TURBO-CHARGER WAS JUST FINE. I SAID, MAYBE THERE IS NO SMOKE COMING OUT RIGHT THIS MOMENT, BUT IT IS HAPPENING EVERY SINGLE DAY, FEW TIMES A DAY, AND PLEASE TO LOOK AT IT BETTER. THEY'VE JUST SENT ME HOME TELLING ME THERE WAS NO PROBLEM.   I TOLD THEM THAT IT WAS THEIR MISTAKE BY NOT LISTENING ME WHEN I COMPLAINED ON TIME TO FIX IT. BUT THEY DID NOT WANT TO HEAR MY ARGUMENT. NOW, I HAVE TO PAY FOR THE REPAIR I'VE TOLD THEM MONTH AND A HALF AGO TO FIX. PLUS, THIS BRAKE-DOWN SHOULD NOT HAVE HAPPENED AT FIRST PLACE AT THIS MILEAGE.  ALSO, WHEN I VISITED THEM MONTH AGO THEY'VE TOLD ME THAT I NEED TO CHANGE A TIMING BELT ONLY. I SEE THAT TIMING BELT, AS A PART COSTS ONLY $40, BUT THEY WANT TO CHARGE $1,000 TO FIX IT. I DO NOT THINK THAT THE LABOR COSTS $960 TO REPLACE A TIMING BELT.   *NLM",
        "vin": "WAUCB28D5XA"
    }
]