[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/19/2003",
        "dateOfIncident": "12/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023430,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "ES300",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2002 LEXUS ES300 HAS A SIGNIFICANT FLAW IN THE NEW ELECTRONICALLY CONTROLLED TRANSMISSION SYSTEM.  THIS FLAW HAS BEEN RECOGNIZED BY MULTIPLE DEALERSHIPS AND BY LEXUS CUSTOMER SERVICE.  I HAVE BEEN WAITING FOR A RESOLUTION TO THIS PROBLEM SINCE DECEMBER 2002 WHICH IS SHORTLY AFTER I PURCHASED THE VEHICLE.  THERE ARE THREE VERY OBVIOUS SYMPTOMS THAT HAVE BEEN OCCURRING EVER SINCE I PURCHASED THE VEHICLE.  DEPENDING UPON FUEL AND DRIVING CONDITIONS, THE CAR WILL DEVELOP A NECK JERKING SHUTTER AS IT VIOLENTLY SHIFTS BETWEEN GEARS.  THIS USUALLY OCCURS ANYWHERE BETWEEN 40 AND 50 MPH, BUT MOST OFTEN WHEN YOU ARE TRYING TO MAINTAIN A CONSTANT SPEED.  THE SECOND CONDITION OCCURS WHEN YOU GO FROM A SLOWING SITUATION INTO AN ACCELERATION SITUATION.  DURING THIS TIME, THE CAR OFTEN GOES INTO A NEUTRAL CONDITION AND TAKES A COUPLE SECONDS BEFORE POWER IS RETURNED TO THE WHEELS.  THIS CONDITION IS VERY DANGEROUS WHEN MOVING INTO TRAFFIC OR TURNING A CORNER.  WHEN TURNING, YOU WILL NEARLY COAST AROUND THE CORNER UNTIL THE POWER IS RETURNED TO THE WHEELS.  WHEN THE POWER IS RETURNED, IT IS VERY ABRUPT AND LUNGES THE CAR FORWARD.  THE THIRD CONDITION OCCURS DURING FULL THROTTLE ACCELERATION.  THIS IS MOST EVIDENT WHEN ACCELERATING ONTO A HIGHWAY.  THE CAR SEEMS TO SHIFT INTO A VERY LOW GEAR WHERE RPM IS NEARLY RED-LINE AND POWER IS ALMOST NON-EXISTENT.  THE CAR THEN JERKS INTO A DIFFERENT GEAR WHERE YOU MAY GET MORE POWER, BUT IT DOESN'T USUALLY STAY IN THAT GEAR EITHER.  IT THEN SHIFTS BACK TO THE LOW GEAR, RED-LINES AGAIN AND REPEATS THE PROCESS.  THIS WILL OFTEN OCCUR 2 OR 3 TIMES BEFORE A GOOD GEAR IS FOUND AND YOU CAN THEN PROCEED WITH NORMAL DRIVING.  AT THIS POINT, LEXUS DID MAKE A COUPLE LEASE PAYMENTS FOR ME IN EXCHANGE FOR WAITING A FEW MORE MONTHS FOR THE FIX.  UNFORTUNATELY, THAT WAS NEARLY A YEAR AGO AND I'M STILL WAITING.  WE NEED TO GET THIS FIXED BEFORE SOMEONE GETS INJURED, NOT AFTER!   *NLM",
        "vin": ""
    }
]