[
    {
        "components": "SUSPENSION,SEAT BELTS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "08/11/2003",
        "dateOfIncident": "06/17/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10023416,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4 RUNNER",
                "productYear": "1997",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lotus Cars Limited",
                "productMake": "SEAT BELT ASSEMBLY",
                "productModel": "SEAT BELT ASSEMBLY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "MY DAUGHTER WAS INVOLVED IN A ROLLOVER ACCIDENT WITH A 1997 TOYOTA 4-RUNNER.  SHE WAS EJECTED FROM THE VEHICLE AND THE POLICE  HAVE EVIDENCE TO SUGGEST THAT SHE WAS WEARING HER SEAT BELT.  I HAVE TAKEN THE VEHICLE IN TO TOYOTA TWICE TO REPLACE THE REAR SUSPENSION FOR A TOYOTA RECALL.  BOTH BEFORE THE RECALL AND AFTER THE RECALL THE REAR END WAS SAGGING AND WAS NOT STABLE.  IT IS MY OPINION THAT THE SEAT BELT WAS DEFECTIVE AND THE REAR SUSPENSION WAS DEFECTIVE.  BOTH CONDITIONS CONTRIBUTED TO HER DEATH.   *NLM    IN SPEAKING WITH INVESTIGATIVE SHERIFF THE VEHICLE WAS TRAVELING ABOUT 38-51 MPH WHEN THE VEHICLE DROVE OFF AN EMBANKMENT.  THE VEHICLE ROLLED 2-3 TIMES DOWN A 50-70 FOOT DROP.  THE DRIVER'S SEAT WAS DAMAGED REARWARD AND THE DRIVER SLID OUT OF THE SEAT BECAUSE OF THIS DAMAGE.  UPON INSPECTION THE SEAT BELT WAS STILL FASTENED.  THE INVESTIGATIVE OFFICER STATED THAT DUE TO THE SEVERITY OF THE CRASH AND DAMAGE TO THE SEAT THE DRIVER WAS EJECTED FROM THE DRIVER'S SIDE REAR WINDOW.  THERE DID NOT APPEAR TO BE A VEHICLE DEFECT WITH THE SEAT BELT OR SEAT.   CW",
        "vin": "JT3HN86R1V0"
    }
]