[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/20/2003",
        "dateOfIncident": "06/13/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10023440,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GTI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2002 VW GTI VR6 ON A SEMI-ROUGH SECTION OF THE PARKS HIGHWAY IN ALASKA AT APPROX. 30-35 MPH WHEN THE PASSENGER SIDE AIRBAGS SUDDENLY DEPLOYED. THE ROAD WAS NO WORSE THAN A MAINTAINED GRAVEL ROAD, THERE WAS NO \"CRASH\" OR ACCIDENT, AND I DIDN'T HIT A POTHOLE. THE DEALER LOOKED AT MY OTHERWISE MINT CONDITION AND UNDAMAGED CAR AND SAID THAT THE COMPUTER HAD \"CRASH DATA\" AND POSSIBLE GRAVEL DINGS ON THE UNDERCARRIAGE (WHICH COULD HAVE OCCURRED AT ANYTIME IN THE PAST 10 MONTHS I HAVE OWNED THIS VEHICLE AS I FREQUENTLY DRIVE ON MAINTAINED GRAVEL ROADS). IT WAS THE TECHNICIAN'S BELIEF THAT THESE MINOR GRAVEL DINGS ON THE UNDERCARRIAGE SHOULD NOT HAVE CAUSED THE AIRBAGS TO RELEASE AND THAT THE AIRBAG REPLACEMENTS WOULD MOST LIKELY BE COVERED UNDER WARRANTY, BUT IT WAS VW'S ULTIMATE DECISION. MY INSURANCE ADJUSTOR SAID BASICALLY THE SAME THING AS MINOR DINGS TO THE UNDERCARRIAGE ARE EXPECTED AS NORMAL WEAR AND TEAR AND TOLD THE DEALERSHIP THAT THEY WERE STRETCHING IT WHEN THEY CAME UP WITH A POSSIBLE EXPLANATION. VW HEADQUARTERS CAME BACK AND SAID SINCE THERE IS \"CRASH DATA\" IN THE COMPUTER AND THE CAR HAS SMALL DINGS ON THE UNDERCARRIAGE, IT WAS NOT COVERED UNDER WARRANTY AS IT WAS A CRASH. I THINK VW IS MISSING THE POINT BY SAYING THAT SINCE THERE IS \"CRASH DATA\" IN THE COMPUTER, THE AIRBAGS ARE MY PROBLEM. THE REAL QUESTION IS SHOULD THE AIRBAGS HAVE DEPLOYED UNDER THESE CONDITIONS? THE DEALER TECHS SAY NO, MY PASSENGER AND I SAY NO, AND MY INSURANCE AND THEIR INVESTIGATOR SAYS NO. THIS AIRBAG DEPLOYMENT ALMOST CAUSED AN ACCIDENT AND RESULTED IN MY PASSENGER BEING BRUISED.   *NLM",
        "vin": "9BWPG61J524"
    }
]