[
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2003",
        "dateOfIncident": "07/19/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND AM",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW PONTIAC GRAND AM GT1 IN JULY 2002.  SHORTLY AFTER, I NOTICED THAT IT WAS HARD STARTING.  USUALLY THE THIRD TIME STARTED IN ONE DAY, IT WOULD SOUND LIKE IT WAS TURNING OVER BUT NOTHING HAPPENED.  I WOULD SHUT IT OFF AND TRY AGAIN AND IT WOULD WORK.  TOOK IT TO THE DEALER WHERE I PURCHASED IT, THEY KEPT IT FOR 4 HOURS WHILE I WAITED.  TOLD ME NOTHING WAS FOUND.  IMMEDIATELY WENT TO MY CAR TO START IT AND IT DID THE SAME THING.  WENT BACK IN, TOLD THE MECHANIC IT JUST HAPPENED.  THEY CHECKED IT AGAIN AND CAME UP WITH NOTHING.  NO REPAIRS DONE.  THE FOG LAMPS STAY ON WHEN THE CAR IS OFF.  AT LEAST ONCE A WEEK MY NEIGHBOR CALLS ME TO TELL ME MY LIGHTS ARE ON.  I HAVE TO START THE CAR AND TOGGLE THE SWITCH UNTIL THEY GO OUT.  A FEW HOURS LATER THEY ARE BACK ON AND THE SWITCH IS IN THE OFF POSITION.   WHEN CLOSING THE WINDOWS, THERE IS A SCRATCHING SOUND.  BOTH WINDOWS IN THE REAR ARE SCRATCHED.  THE CAR IS CLEAN AND WAS CHECKED BY ANOTHER MECHANIC WHO FOUND NOTHING INSIDE THE DOOR THAT WOULD CAUSE THE SCRATCHES.  THERE IS ALSO A HIGH PITCHED SOUND COMING FROM THE FRONT OF THE CAR.  IT SOUNDS LIKE THE WHEEL ON THE DRIVER'S SIDE.  IT SEEMS TO GO AWAY WHEN I APPLY THE BREAK BUT COMES BACK.  AFTER IT RAINS, THERE IS A GURGLING SOUND COMING FROM THE FRONT PASSENGER'S SIDE DOOR.  CAN'T TELL IF ITS THE SPEAKER OR WHAT.  JUST LITTLE THINGS THAT BOTHER ME CONSIDERING THIS IS A BRAND NEW CAR ONLY OWNED BY ME AND WELL TAKEN CARE OF.  THERE ARE JUST UNDER 16,000 MILES ON THE CAR.  SO FAR, NO REPAIRS DONE.   *NLM",
        "vin": ""
    }
]