[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/22/2003",
        "dateOfIncident": "06/21/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10023535,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS PORTIONS OF A LETTER SENT TO THE CUSTOMER COMPLAINT SECTION OF THE WWW.VW.COM WEBSITE ON JUNE 22, 2003.    I AM WRITING TO REPORT A POTENTIALLY SERIOUS PASSENGER SAFETY ISSUE REGARDING THE ELECTRIC FRONT SEATS IN THE 2003 VOLKSWAGEN PASSAT GLX ON A RAINY AFTERNOON, MY SIX YEAR OLD SON AND I GOT INTO THE CAR IN A PARKING LOT.  I PUT HIM INTO THE REAR PASSENGER SIDE OF THE CAR AND HE SECURED HIMSELF WITH THE SEAT BELT. I WENT AROUND TO THE DRIVER'S DOOR AND ENTERED, PUTTING THE UMBRELLA INTO THE FOOT WELL OF THE FRONT PASSENGER SEAT, WITH THE HANDLE RESTING ON THE FRONT SEAT EDGE.  AS I STARTED THE CAR, WITHOUT MY NOTICING, THE UMBRELLA HANDLE FELL BETWEEN THE SEAT AND INSIDE DOOR, ACTIVATING THE LEVER TO RECLINE THE FRONT PASSENGER SEAT BACK.  MY SON YELLED SOMETHING ABOUT THE SEAT AND I TURNED TO SEE THE SEAT BACK LOWERING TOWARD HIS LEGS.  HE COULD NOT MOVE OUT OF THE WAY BECAUSE OF THE SEAT BELT.  WITHOUT KNOWING WHAT HAD HAPPENED, I COULD NOT IMMEDIATELY FIND A WAY TO STOP THE SEAT FROM RECLINING FURTHER.  I TURNED OFF THE IGNITION AND PULLED THE KEY OUT, BUT THE SEAT CONTINUED DOWNWARD ONTO HIS LEGS.  AT THE LAST SECOND I REALIZED WHAT HAD HAPPENED AND PULLED THE UMBRELLA HANDLE OFF THE SEAT LEVER AS THE SEAT BACK LOWERED ONTO MY SONS KNEES, PINNING HIM INTO THE REAR SEAT.  AFTER I RAISED THE SEAT, MY SON COMPLAINED OF PAIN IN BOTH OF HIS KNEES.    IN CHECKING OUT THE SEAT LATER, I FOUND THAT THE FRONT SEAT BACK HAS NO STOP, RATCHET OR RELEASE TO PREVENT IT FROM LOWERING FORCIBLY INTO THE REAR SEAT CUSHION.  THE SEAT CONTINUES DOWNWARD INTO THE CUSHION UNTIL THE MOTOR STRAINS TO A STOP.  * NLM",
        "vin": "WVWRH63B13P"
    }
]