[
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2003",
        "dateOfIncident": "04/24/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAVALIER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED MY USED  2000 CHEVROLET CAVALIER  IN APRIL 2003 ABOUT 1 MONTH I STARTED HAVING PROBLEMS. AFTER PUTTING GAS IN MY CAR I WOULD DRIVE A LITTLE AND THEN THE GAS GAUGE WOULD GO DOWN TO APPEAR THAT THE CAR WAS ALMOST EMPTY BUT IT WASN'T.  WHILE DRIVING ONE DAY THE CAR JUST SHUT OFF  IT HAD GAS IN IT I HAD JUST PUT GAS IN IT BUT THE GAUGE DROPPED TO APPEAR TO BE ALMOST EMPTY. I HAD  TO GET MY CAR TOWED TO THE SHOP    I WAS TOLD MY  FUEL INJECTION WENT OUT.  NOT EVEN A MONTH AFTER THAT MY CAR STALLED AT A RED LIGHT AND MY TEMPERATURE GAGE WENT IN THE HOT ZONE MY CAR WOULDN'T START I HAD TO GET IT TOWED  AGAIN TO THE SHOP BUT THEY COULD NOT FIND THE PROBLEM.   NOW HERE IT IS JUNE 2003 MY CAR IS SITTING IN THE DRIVE WAY RIGHT NOW AS I AM TYPING THIS INFORMATION.  MY SON WAS DRIVING HOME AT 1:00 A.M. THIS MORNING FROM WORK WHEN THE CAR OVERHEATED AGAIN AND STARTED SMOKING. HE SAID  SMOKE WAS ALSO COMING OUT OF THE BATTERY AND HE ALSO HEARD NOISE COMING FROM THE REAR OF THE CAR TODAY IS SATURDAY AND MY CAR HAS TO SIT IN THE DRIVEWAY UNTIL MONDAY MORNING THAT WHEN THE DEALER OPENS.  I FEEL THAT SOMETHING SHOULD BE DONE.  I DON'T THINK IT IS FAIR FOR DEALERS TO BE ABLE TO SALE CARS THAT ARE IN THIS KIND OF CONDITION AND THE CAR IS SUPPOSE TO BE CERTIFIED.  I AM MAKING PAYMENTS ON THE CAR AND I AM HAVING ALL THESE PROBLEMS.  IT IS DANGEROUS TO BE DRIVING AND THE CAR DECIDES TO CUT OFF ESPECIALLY AT 1:00 A.M.  I HAVE TO BE AT WORK AT 3:45 A.M. AND MY SON GETS OFF WORK AT 1:00 A.M. THIS IS VERY, VERY DANGEROUS FOR THE BOTH OF US.   *NLM",
        "vin": "3G1JC1242YS"
    }
]