[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/23/2003",
        "dateOfIncident": "06/22/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023584,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VENTURE",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HUTCHINSON RIVER PARKWAY AT ABOUT 2:30 PM WITH MY FAMILY, MY WIFE HEARD A NOISE FROM THE BOTTOM OF THE CAR.  TO OUR HORROR, WE SAW CARS BEHIND US SWERVING TO AVOID A TIRE WHICH WAS SKIDDING ALONG THE ROAD.  WE IMMEDIATELY EXITED AND, UPON LOOKING UNDER OUR 1998 CHEVROLET VENTURE MINIVAN, SAW NEITHER OUR SPARE TIRE, NOR THE PLATE THAT HELD IN  PLACE.  IT APPEARED AS IF THE CABLE THAT HELD THE TIRE IN PLACE HAD COMPLETELY AND CATASTROPHICALLY FAILED, RESULTING IN A POTENTIALLY DEADLY SITUATION.  FORTUNATELY FOR EVERYONE INVOLVED THE PAVEMENT WAS (FOR THE MOMENT) DRY, IT WAS DAYTIME, THE DRIVERS BEHIND WERE NOT TAILGATING (AS IS CUSTOMARY ON THE HUTCH) AND THE TIRE CAME TO REST ON THE MEDIAN, OUT OF THE LANES OF TRAFFIC.  WE LOOPED BACK AND FOUND THE WHEEL ON THE MEDIAN AND, WHILE WE WERE TRYING TO DECIDE WHOM TO CALL TO REPORT THE INCIDENT (AAA, LOCAL POLICE, ETC) A WESTCHESTER COUNTY POLICE OFFICER STOPPED TO HELP US.  HE BRIEFLY STOPPED TRAFFIC AND REMOVED THE WHEEL SO THAT NO ONE WOULD HIT IT.  AS FAR AS WE COULD TELL, NO ONE WAS INJURED AND THERE WAS NO MAJOR PROPERTY DAMAGE AS A RESULT OF THE INCIDENT (WE HAVE YET TO DETERMINE HOW MUCH IT WILL COST TO REPAIR THE WHEEL AND THE SPARE TIRE HOUSING).  UPON SEARCHING THIS SITE, WE HAVE NOTICED THAT A VERY SIMILAR PROBLEM HAS ALREADY BEEN REPORTED (A SPARE TIRE CABLE THAT HAS BECOME VERY CORRODED) AND BELIEVE OUR EXPERIENCE NOT TO BE AN ISOLATED EVENT, ESPECIALLY IN AREAS WHERE SALT IS COMMONLY USED IN THE WINTER TO KEEP THE ROADS CLEAR OF ICE.  WE RECOMMEND THAT GENERAL MOTORS DEVISE AND IMPLEMENT A SOLUTION TO THIS PROBLEM BEFORE LIVES ARE LOST (AND LIABILITIES ARE INCURRED) AS A RESULT OF THIS FAULTY DESIGN.   *NLM",
        "vin": "1GNDX06E5WD"
    }
]