[
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2003",
        "dateOfIncident": "04/19/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023631,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "PLYMOUTH",
                "productModel": "NEON",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED A NUMBER OF MECHANICAL FAILURES TO MY 1997 PLYMOUTH NEON WHICH I PURCHASED TWO YEARS AGO. ONE MONTH AFTER PURCHASING THE CAR  BEGAN HAVING ELECTRICAL PROBLEMS; RADIO STOPPED WORKING, CLOCK DISPLAY WOULD BLACKOUT. THE MOST RECENT WAS EXPERIENCING A BLOWN HEAD GASKET AT THE TIME THE CAR WAS IN OPERATION. I WAS ABLE TO BRING THE CAR TO A SAFE STOP. HOWEVER, HAD THE GASKET BLOWN WHEN I WAS ON THE EXPRESSWAY JUST MINUTES BEFORE THEN, THE SCENE MAY HAVE BEEN MORE SERIOUS. I DISCOVERED OIL IN MY ANTIFREEZE.  MY HUSBAND AND I HAVE RESEARCH AND LOCATED A WEBSITE THAT INFORMED CONSUMERS OF MANUFACTURE DEFECTS THAT HAVE BEEN REPORTED ON THE NEONS FROM THE 1995 TO 1998. A NUMBER OF COMPLAINS HAVE BEEN BROUGHT TO THE ATTENTION OF CHRYSLER CORPORATION BY OTHER CONSUMERS. HOWEVER, THEY DO NOT SEE IT AS A PROBLEM. I HAVE NOTIFIED CHANNEL 5 TARGET INVESTIGATION NEWS TEAM IN CHICAGO, IL AND THEY ARE INVESTIGATING THESE PROBLEMS AS WELL. TARGET 5 INVESTIGATION MADE ME AWARE OF A CLASS ACTION LAW SUIT AGAIN THE CHRYSLER CORPORATION AND I THINK THESE MANUFACTURER DEFECTS WARRANT YOUR INVESTIGATION AS WELL, HOPEFULLY, PROMPTING A NATIONAL RECALL. REPAIRING A BLOWN HEAD GASKET AND POSSIBLY A CRACKED SEAL ON THE ENGINE, IS A VERY COSTLY PROCEDURE. PLEASE LOOK INTO THIS PROBLEM. I WOULD BE INTERESTED IN YOUR FINDINGS.   *JB",
        "vin": "1P3ES27C8VD"
    }
]