[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/23/2003",
        "dateOfIncident": "04/30/2003",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023583,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "RODEO",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "PISTON ROD FAILURE.  THE FIRST INCIDENT OCCURRED IN OR ABOUT JANUARY, 2003.  THE ENGINE ON MY 1998 ISUZU RODEO BEGAN MAKING A LOUD CLANKING NOISE AND THE \"CHECK OIL\" LIGHT CAME ON.  I ADDED A QUART AND THE NOISE SUBSIDED.  I HAD THE OIL CHANGED THE NEXT DAY.    A FEW MONTHS LATER, THE NOISE RETURNED AND I ADDED TWO QUARTS OF OIL.  THE NOISE DID NOT SUBSIDE AND I TOOK THE VEHICLE IN FOR ITS REGULARLY SCHEDULED OIL CHANGE THE NEXT DAY.  THE OIL CHANGE MECHANIC TOLD ME THAT THERE WERE ONLY TWO QUARTS OF OIL IN THE ENGINE.  I TOOK THE VEHICLE TO ANOTHER LOCAL MECHANIC TO REPAIR THE PROBLEM AND HE TOLD ME THE NO. 1 PISTON ROD HAD FAILED.  WHEN HE CALLED HIS PARTS DISTRIBUTOR FOR A QUOTE ON A NEW OR REBUILT ENGINE, THE DISTRIBUTOR SAID, \"'98 RODEO ENGINE?  LET ME GUESS, IT'S THE NO.1 ROD\" AND STATED THAT THIS WAS A VERY COMMON PROBLEM.  I HAD THE CAR TOWED TO THE ISUZU DEALER WHERE I HAD PURCHASED THE CAR AND HAD ALMOST ALL REGULAR MAINTENANCE AND REPAIRS PERFORMED.  THE DEALER WAS UNABLE TO GET THE ISUZU DISTRICT MANAGER TO OFFER ANY \"GOOD FAITH\" ASSISTANCE.    THE CAR HAS APPROXIMATELY 64,000 MILES ON IT.  I HAVE GENERALLY CHANGED THE OIL EVERY 3,000 MILES, ALTHOUGH ISUZU RECOMMENDS CHANGING IT EVERY 5,000 MILES.  I HAVE FULL SERVICE RECORDS AND ALMOST ALL MAINTENANCE (EXCEPT FOR SOME OIL CHANGES) WAS DONE AT THE DEALER.   *NLM",
        "vin": "4S2CM58WXW4"
    }
]