[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/24/2003",
        "dateOfIncident": "06/21/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023703,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED FOUR NEW BRIDGESTONE \"POTENZA RE900\" TIRES FOR MY 1999 TOYOTA CAMRY LE SEDAN FROM COSTCO WHOLESALE  (72800 DINAH SHORE DR, PALM DESERT, CA 92211 (760) 202-1362) IN EARLY MAY.   TWO WEEKS LATER WHILE DRIVING TO MORNING CHURCH (APPROX. 45 MPH) I HEARD A LARGE \"BOOM\" AND DISCOVERED THE LEFT REAR TIRE HAD EXPLODED.  I DROVE TO THE NEAREST GAS STATION WHERE THEY INSTALLED THE SAME MODEL SPARE TIRE.  I RETURNED TO COSTCO AND THEY REPLACED THE SPARE WITH A NEW BRIDGESTONE POTENZA RE900 TIRE.  LAST SATURDAY EVENING ABOUT 6:00PM (JUNE 21, 2003) WHILE DRIVING HOME TO PALM SPRINGS ON HIGHWAY 10 AT APPROXIMATELY 55 MPH, I HEARD ANOTHER LOUD NOISE AND DISCOVERED ANOTHER BRIDGESTONE POTENZA RE900 TIRE HAD EXPLODED.   LUCKILY, SOMEONE STOPPED AND REPLACED IT WITH THE SPARE SO I COULD GET HOME.   AGAIN, I RETURNED TO COSTCO WHERE THEY REPLACED IT WITH ANOTHER BRIDGESTONE POTENZA RE900 TIRE.  IN MY OPINION, COSTCO'S MANAGER, AWARE OF THE PROBLEMS WITH THIS PARTICULAR TIRE SHOULD HAVE:  1. IMMEDIATELY PULLED THEM FROM THE INVENTORY SO THAT THIS MODEL COULD NOT BE SOLD TO OTHER CUSTOMERS  2. REPORTED THIS COSTCO MANAGEMENT... WHO, IMMEDIATELY, SHOULD HAVE PULLED THEM FROM THE INVENTORY OF EVERY STORE  3. REPORTED THIS INCIDENT TO BRIDGESTONE/FIRESTONE   4. REPORTED THIS INCIDENT TO THE NHTSA.    WHAT SHOULD BE MY NEXT RECOURSE OF ACTION?    I LOOK FORWARD TO RECEIVING A PROMPT RESPONSE CONCERNING THIS VERY SERIOUS MATTER.    SINCERELY,    MILDRED MADSEN.   *JB   1370 ADOBE WAY  PALM SPRINGS, CA 92262    EMAIL: MADSENEM@AOL.COM  PHONE: (760) 323-4683.   *JB",
        "vin": ""
    }
]