[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2003",
        "dateOfIncident": "06/21/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023753,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCORT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 21, 2003,  I WAS OPERATING THE VEHICLE AT APPROX. 30 MPH. I ATTEMPTED TO SPEED UP AND FOUND THAT THE ACCELERATOR WAS NO LONGER FUNCTIONING. DUE TO THE FACT THAT THE CAR FAILED TO ACCELERATE I WAS FORCED TO COAST TO THE SIDE OF THE ROAD, WHERE A TOW TRUCK PICKED IT UP AND TOWED IT TO THE DEALERSHIP. APPROX. 6 MONTHS PRIOR TO THIS TIME I BEGAN NOTICING A \"SPASMODIC HESITATING MOTION\" IN THE CAR WHENEVER I ATTEMPTED TO ACCELERATE FROM AN IDLE POSITION. I ASSUMED THAT A TUNE-UP WAS NEEDED AND TOOK IT TO A FORD DEALERSHIP FOR INSPECTION. I WAS TOLD THAT THE HESITATION COULD NOT BE DETECTED, NOTHING WAS WRONG WITH THE VEHICLE,   AND BASED ON THE MAKE AND MODEL OF THE VEHICLE I WAS NOT REQUIRED A TUNE-UP UNTIL 100,000 MILES HAD BEEN REACHED. I CONTINUED TO DRIVE THE VEHICLE AND THE PROBLEM PERSISTED. FOR A WHILE I EVEN RELENTED AND DECIDED THAT PERHAPS THE PROBLEM WAS IN MY HEAD. FINALLY, FEBRUARY 2003  I TOOK THE VEHICLE INTO ANOTHER FORD DEALERSHIP DUE TO THE PROBLEM AND THE MECHANICS RE-CALIBRATED THE CAR'S COMPUTER SYSTEM UNDER THE BELIEF THAT THIS WOULD FIX THE PROBLEM. I WAS ALSO ADVISED THAT A ROUTINE INSPECTION OF THE VEHICLE TOOK PLACE AND EVERYTHING WAS OPERATING AS NORMAL, AND IN FACT AT THAT TIME THE TRANSMISSION FLUID WAS EVEN TOPPED OFF. THE \"SPASMODIC HESITATING MOTION\" OF THE VEHICLE UPON ACCELERATION CONTINUED UP UNTIL THE ABOVE DATE WHEN THE TRANSMISSION FAILED COMPLETELY. AT THIS TIME, THE MECHANIC ADVISOR AT THE DEALERSHIP DOES NOT BELIEVE THE HESITATION OF THE CAR UPON ACCELERATION AND THE COMPLETE FAILURE OF THE TRANSMISSION ARE RELATED.   *NLM",
        "vin": "3FAKP1130YR"
    }
]