[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CONTOUR",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLED ON ME BACK IN MARCH OF THIS YEAR, AND WHEN IT WAS LOOKED AT A GARAGE, THEY TOLD ME IT WAS A FAULTY ENGINE WIRING HARNESS ON MY 1995 FORD CONTOUR. I LOOKED AROUND ON THE INTERNET, AND SAW THAT THERE WAS INDEED A RECALL ON THIS SAME HARNESS. I NEVER RECEIVED A NOTICE FROM FORD ABOUT IT. I CONTACTED THE LOCAL FORD DEALER, AND THEY VERIFIED THAT THERE WAS INDEED A RECALL ON IT, AND TO BRING IT IN TO HAVE THE WORK DONE. I THEN HAD THE CAR TOWED THERE TO HAVE IT FIXED. AFTER THEY HAD IT FOR ABOUT THREE OR FOUR DAYS, I WENT BACK TO CHECK ON IT, AND THEY SAID THAT THEY COULDN'T WORK ON IT, BECAUSE IT WAS FIVE THOUSAND MILES OVER THEIR \"RECALL WARRANTY\". I HAD THE CAR TOWED BACK HOME, AND CALLED FORD THEMSELVES. I GOT THE SAME RUNAROUND FROM THEM ALSO. I NOTIFIED THEM THAT I NEVER RECEIVED THE RECALL NOTICE ON IT, AND THEY BASICALLY TOLD ME SORRY, IT WASN'T THEIR FAULT. I HAVE FOUND SEVERAL MESSAGE BOARDS ON THE INTERNET, THAT PEOPLE COMPLAIN OF THE SAME PROBLEM, AND IT SEEMS THAT FORD, KNOWING THERE IS A SAFETY PROBLEM WITH IT, SHOULD FIX IT NO MATTER WHAT. THE WIRING HARNESS ON THE CAR IS COMPLETELY BURNED THROUGH, AND MOST ALL OF THE WIRES ARE BARE, AND EXPOSED. I WAS TOLD FROM A DEALERSHIP, THAT IF I WANTED TO HAVE THE WORK DONE MYSELF, THE HARNESS WOULD COST AROUND $1200, JUST FOR THE PART. I FOUND THIS WEBSITE, AND WAS HOPING, MAYBE I COULD GET SOMEONE TO HELP ME OUT IN GETTING FORD TO FIX A KNOWN PROBLEM ON THEIR VEHICLE. THANK YOU.  *JB",
        "vin": "3FALP66L6SM"
    }
]