[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2003",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023730,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 DODGE INTREPID 2.7 VIN#[XXX],   43,913 MILES, TRANSMISSION SENSOR WENT OUT, $132.84.  9/14/00  75,085 MILES, WATER OUTLET AND TRANSMISSION LINES NEEDED REPLACED.  MECHANIC INFORMED ME THE TRANSMISSION LINES  WERE FACTORY INSTALLED DEFECTIVE.  $582.24.  12/14/01  86,992 MILES, TIMING CHAIN BROKE, REPLACED WATER PUMP.  $1,188.79.  6/14/02.  91,324 MILES, TRANSMISSION SPEED SENSOR BROKE.  $350.60.  8/2/02  96,828 MILES, DASH LIGHTS WENT OUT.  MECHANIC INFORMED ME THE DASH LIGHTS WERE AN INTERNAL WIRING DEFECT.  $223.30. 10/2/02  98,003 MILES, COOLING FAN WENT OUT.  MECHANIC INFORMED ME THIS WAS A FACTORY DEFECT.  CHRYSLER HAD CHANGED THE DESIGN OF THE FANS SO I COULD NOT JUST REPAIR ONE SIDE OF THE FAN SINCE IT WAS NO LONGER AVAILABLE. $680.35.  10/24/02.  109,754 MILES, ENGINE BLEW, TAKING STARTER WITH IT.  TOLD BY MECHANIC THAT CHRYSLER DESIGNED THE 2.7 ENGINE TO BE A DISPOSABLE ENGINE (COMPARED TO THE 3.2 THAT YEAR).  REPLACED WITH USED ENGINE.  $4174.49.  5/21/03    I HAD OVER $7000 IN REPAIRS IN UNDER A YEAR AND A HALF.  WHILE I\u0019M GRAVELY DISAPPOINTED IN THE MECHANICS OF THIS VEHICLE, I FEEL THAT THE FAN ASSEMBLY, TRANSMISSION LINES, AND ELECTRICAL WIRING ARE THINGS THAT WERE OBVIOUSLY DEFECTIVE FROM THE START AND SHOULD BE REPAIRED FREE OF CHARGE.  ADDITIONALLY, THE TRANSMISSION SENSOR GOING OUT AT ONLY 43,913 MILES SHOULD HAVE BEEN REPLACED FREE AS WELL.  WHILE IT IS DIFFICULT TO PROVE THAT I TOOK CARE OF THE ENGINE, I HAVE OIL CHANGE RECEIPTS.   *NLM      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2B3HD46R7XH"
    }
]