[
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "06/06/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023805,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD PROBLEMS WITH THE TURN SIGNALS, BRAKE LIGHTS, AND WINDSHIELD WIPERS ON MY 1999 FORD F-150.  ON A RECENT TRIP TO INDIANA I NOTICED THAT WHEN THE STEERING WHEEL WAS TILTED DOWN SO THAT MY WIFE COULD DRIVE, THE TURN SIGNALS STOPPED WORKING.  WHILE IN INDIANA A MAN WAS NICE ENOUGH TO FLAG ME DOWN TO LET ME KNOW THAT MY BREAK LIGHTS WERE NOT WORKING.  I TOOK THE TRUCK TO EBY FORD SALES (JUNE 6, 2003) IN GOSHEN FOR REPAIR.  THEY INDICATED THAT THE MULTIFUNCTION SWITCH DISCONNECTED WHEN THE STEERING WHEEL WAS TILTED DOWN.  SO THEY LENGTHENED THE CONNECTOR ASSEMBLY WIRES AND THAT SEEMS TO HAVE SOLVED THE PROBLEM. ON DECEMBER 17, 2001, I TOOK MY TRUCK INTO PRINCE FORD IN DOUGLAS GEORGIA AND TOLD THEM THAT MY WINDSHIELD WIPERS WOULD JUST COME ON FOR NO REASON.  THEY REPLACED THE MULTIFUNCTION SWITCH BUT DID NOT LENGTHEN THE WIRES.ACCORDING TO THE SERVICE DEPARTMENT AT EBBY FORD, THIS MULTIFUNCTION SWITCH CONTROLS SEVERAL VITAL FUNCTIONS ON THE TRUCK - BRAKE LIGHTS, TURN SIGNALS, WIPERS, ETC. *AK     SEVERAL THINGS ARE WORTH NOTING HERE:    FIRST, I CALLED AND TALKED WITH PRICE FORD IN GEORGIA AND ASKED WHY THE MULTIFUNCTION SWITCH WIRES WERE NOT LENGTHENED WHEN THE SWITCH WAS REPLACED BY THEM THE FIRST TIME (DECEMBER 17, 2001).  THEY HAVEN'T EVEN CALLED ME BACK.    SECOND, I CALLED FORD MOTOR COMPANY AND INFORMED THEM OF THE PROBLEM.  THEY SAID THAT THEY WOULD NOTE THE PROBLEM BUT THAT THERE WAS NO RECALL AT THIS TIME.    FINALLY, IT SEEMS TO ME THAT THERE IS A POTENTIAL FOR SERIOUS CRASHES RESULTING FROM THE FACT THAT THE SWITCH WIRES ON THE MULTIFUNCTION SWITCH ASSEMBLY IS NOT LONG ENOUGH AND THAT THE SWITCH DISCONNECTS WHEN THE STEERING WHEEL IS TILTED DOWN.  IT WOULD BE A TRADGEDY IF JUST ONE PERSON LOST THEIR LIVES BECAUSE THE BREAK LIGHTS OR TURN SIGNALS FAILED DUE TO THIS PROBLEM.     THANKS FOR LOOKING INTO THIS FOR ME.",
        "vin": "1FTRX17L3XN"
    }
]