[
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,STRUCTURE,WHEELS,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/25/2003",
        "dateOfIncident": "06/24/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023794,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND AM",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 PONTIAC GRAND AM 2.4 L AUTO  SEVERE BRAKE FAILURE---REPLACEMENT OF PADS 8 TIMES, ROTORS 3 TIMES AND CALIPERS 2 TIMES IN 80,000 MILES.  BRAKES OCCASIONALLY LOCK UP AND MAKE LOUD GRINDING AND SQUEALING NOISES STEERING SHUDDERS AND VEHICLE PULLS TO LEFT..  PARTICIPATING PONTIAC DEALER FAILED TO FIX THIS PROBLEM SINCE PURCHASE AT 11,000 MILES. UNDER WARRANTY REPLACEMENT IT HAS HAD 6 DOOR PANELS DUE TO PEELING LEATHER ON TOP OF PANEL, 5 GEAR SHIFTERS DUE TO DEALERS IMPROPER INSTALLATION, 2 FACTORY CD/RADIO FAILURES, 1 RACK AND PINION UNIT, 2 FRONT STRUT ASSEMBLIES DUE TO KNOCKING NOISE FROM FRONT OF CAR (WENT BAD AFTER 10,000 MILES USE), PROBLEM WITH HESITATION AT IDLE-COLD START(UNSUCCESSFULLY DIAGNOSED BY DEALER) CARPET LOOSE IN TRUNK AROUND LATCH ASSEMBLY(TOO SHORT FOR TRUNK AND WAS HOT GLUED  TO BACK WALL OF CAR BY DEALER INSTEAD OF REPLACEMENT). TURN SIGNALS STILL OCCASIONALLY FAIL TO WORK(DEALER SAID THEY WORKED JUST FINE)  BATTERY CONNECTION IN FACTORY BATTERY BROKE LOOSE SPILLING CORROSIVE BATTERY ACID ALL OVER AROUND BATTERY TRAY AREA.  ALL FOUR WHEEL COVERS HAVE BEEN REPLACED BECAUSE OF \"PIE PAN\" NOISE WHEN YOU HIT A BUMP (NEW ONES DID NOT FIX PROBLEM).  AFTER WARRANTY WAS UP PONTIAC' CARE HOTLINE OR THE DEALER COULD \"CARE \" LESS THAT AFTER DOZENS OF TRIPS FOR REPAIRS THE DEALER STILL DIDN'T FIX THE CAR WHILE IT WAS STILL UNDER WARRANTY.  SINCE THEN,BESIDES THE UNREPAIRED ITEMS ON MY CAR, THE ALTERNATOR WENT BAD AT 60,000 MILES ($120), GLASS IN INTERIOR REAR VIEW MIRROR BROKE WHILE ADJUSTING, BOTH OUTSIDE REAR VIEW MIRRORS HAVE BROKE OFF IN TWO DIFFERENT AUTOMATIC CAR WASHES (HELD INTO DOOR BY A STUD MOUNTED INTO 1/4 INCH OF PLASTIC IN THE MIRROR). AND THE IGNITION SWITCH FAILED AT 75,000 MILES($300). FOG LIGHTS AND BACKUP LIGHTS HAVE WATER CONDENSATION IN THEM SHORTING OUT BULBS.  SURPRISINGLY ,THIS CAR IS \"BABIED\" ,BUT BY IN MY DESCRIPTION YOU SURE COULDN'T TELL IT.    *NLM",
        "vin": "1G2NE52T1XM"
    }
]