[
    {
        "components": "STEERING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "06/20/2003",
        "fire": false,
        "manufacturer": "GM DAEWOO AUTO & TECHNOLOGY COMPANY",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023801,
        "products": [
            {
                "manufacturer": "GM DAEWOO AUTO & TECHNOLOGY COMPANY",
                "productMake": "DAEWOO",
                "productModel": "NUBIRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING COMPLAINT PERTAINS TO SPEED CONTROL AND STEERING CONTROL SYSTEMS OF 2000 DAEWOO NUBIRA. SPEED CONTROL:  (RECURRING, UNPREDICTABLE).  *AK    PROBLEM OCCURRED WHILE ATTEMPTING TO PARK.  PULLED INTO A PARKING SPACE WITH FOOT ON BRAKE PEDAL, ENGINE SUDDENLY RACED (AS IF I\u0019D FLOORED THE ACCELERATOR) AND CAR SURGED FORWARD (FOOT STILL PRESSING BRAKE).  HAD TO TURN IGNITION OFF TO STOP CAR.  HAPPENED AGAIN (SAME DAY) AT A TRAFFIC SIGNAL.  WOULD HAVE REAR-ENDED VEHICLE IN FRONT OF ME IF I HAD NOT ALLOWED FOR DISTANCE OF TWO CAR LENGTHS BETWEEN IT/MYSELF.  MY 62-YEAR-OLD MOTHER OWNS THIS VEHICLE.  SAYS SHE USES EMERGENCY HAND BRAKE WHEN THIS HAPPENS, AND INITIALLY COMPLAINED OF SAME PROBLEM OVER A YEAR AGO.  DEALER (HILLSIDE AUTO-MALL, HILLSIDE, NJ) SAID NO PROBLEM WAS FOUND!  ASKED IF PROBLEM COULD POSSIBLY BE DUE TO A MANUFACTURING DEFECT?  DEALER STATED, \u001cTHAT\u0019S AN ISSUE YOU WILL HAVE TO TAKE UP WITH THE MANUFACTURER.  WE JUST SELL THE CARS!\u001d    STEERING CONTROL:  (RECURRING, UNPREDICTABLE)    WHILE DRIVING AND/OR ACCELERATING VEHICLE WILL UNEXPECTEDLY PULL (SHARPLY) TO THE RIGHT AND BECOME DIFFICULT TO CONTROL.  BEHAVIOR EXTREMELY PRONOUNCED IN WET WEATHER AND WHEN ACCELERATING!  NO NOTICEABLE PROBLEM FOUND, BUT SIMILAR COMPLAINTS ARE ON FILE!    NOTIFICATION OF RECALL:    DID NOT RECEIVE VEHICLE RECALL, NHTSA CAMPAIGN ID NUMBER 02V257000, ADDRESSING VEHICLE SAFETY STANDARD NO. 106, \u001cBRAKE HOSES\u001d.  WILL SEEK ASSISTANCE OF THE DEALERSHIP TO ADDRESS THIS ISSUE.    FOR THE RECORD: VEHICLE IS ONLY THREE YEARS OLD, AND (CURRENTLY) HAS REGISTERED LESS THAN 20,000 MILES.  OF THE MANY COMPLAINTS ON RECORD AT THIS SITE, THOSE CONCERNING SPEED CONTROL AND STEERING CONTROL ARE THE MOST TROUBLING.  ARE THEY COINCIDENTAL!!!  MY MOTHER WILL TRY (AGAIN) TO GET THESE ISSUES RESOLVED AT THE DEALERSHIP WHERE VEHICLE WAS PURCHASED.  GUT FEELING, HOWEVER, IS THAT CONCERNS WILL NOT BE ADDRESSED UNTIL SOMEONE IS SERIOUSLY INJURED, OR WORSE.  I PRAY IT DOES NOT COME TO THAT!",
        "vin": "KLAJC52Z8YK"
    }
]