[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "06/26/2003",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023836,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "RODEO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "LEASE IS COMPLETE ON JULY 9, 2003.  ON JUNE 26, 2003 WITH ONLY 43,947 MILES, WHILE SLOWING DOWN TO TURN A CORNER, THE HEAD GASKET BLEW.  THIS IN TURN CAUSED THE RADIATOR TO FAIL, WHICH CAUSED THE FOLLOWING NEEDED REPAIRS:  REPLACEMENT OF THE HEAD GASKET, MANIFOLD GASKET, RADIATOR, VALVE GRIND GASKET, PCM MODULE AND VARIOUS SMALL TICKET ITEMS SUCH AS THE OIL FILTER AND COOLANT.  HAD VEHICLE TOWED TO LOCAL MECHANIC WHO CALLED FOR WARRANTY INFORMATION AND WAS TOLD THAT ONLY A 3 YR, 50,000 MILE WARRANTY WAS AVAILABLE.  I THEN CALLED ISUZU CUSTOMER SERVICE AND TOLD ABOUT THE 5 YR, 60,000 MILE POWER TRAIN WARRANTY.  CONTACTED OUR LOCAL ISUZU DEALER WHO STATES THAT ONLY THE HEAD GASKET IS COVERED UNDER THE POWER TRAIN WARRANTY AND THE REMAINING REPAIRS WOULD BE SUBJECT TO EVALUATION TO DETERMINE WHETHER THE VEHICLE WAS NEGLECTED.  UNTIL JUNE 26, 2003, THE ONLY MAINTENACE REQUIRED BY THIS VEHICLE WAS ROUTINE OIL CHANGES AND COMPLETION OF RECALLS, WHICH WE WERE ONLY NOTIFIED ABOUT ONE OF THE THREE RECALLS.  ALL THREE RECALLS WERE COMPLETED WHEN THE VEHICLE WAS TAKEN IN.  WE HAVE BEEN TOLD BY VARIOUS MECHANICS, THAT ALL THE DAMAGE TO THIS ENGINE IS  DIRECTLY RELATED TO THE FAILURE OF THE HEAD GASKET.  IF THE HEAD GASKET HAD NOT FAILED, NONE OF THESE SYSTEMS WOULD HAVE TO BE REPAIRED.  WE HAVE SPOKEN WITH OUR ISUZU DEALERSHIP WHO COMFIRMED THAT THE HEAD GASKET FAILURE IS A COMMON PROBLEM IN THE 1999 ISUZU RODEO.  IF THE WARRENTY COVERS THE HEAD GASKET REPLACEMENT, IT SHOULD ALSO COVER THE REPAIR AND/OR REPLACEMENT OF ALL SYSTEMS DAMAGED BY THIS FAILURE.  THERE SHOULD NOT BE A QUESTION AS TO WHETHER OR NOT THIS WILL BE COVERED UNDER WARRAQNTY.  THE VEHICLE IS CURRENTLY BEING TOWED FROM OUR LOCAL MECHANIC TO A LICENSED ISUZU DEALER FOR REPAIRS, WHO WILL NOT BE ABLE TO EVALUATE THE VEHICLE UNTIL JULY 3, 2003 AT THE EARLIEST.  *AK",
        "vin": "4S2CK58D0X4"
    }
]