[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "06/13/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023814,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "325I",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COMPUTER FIRST FAILED ON MY 2003 BMW 325I ON JUNE 15, 2003, (THREE WEEKS AFTER I PICKED IT UP FROM THE DEALERSHIP, BMW OF MANHATTAN), CAUSING ME TO LOSE ACCELERATION WITHOUT WARNING.  I WAS TRAVELLING AT 60-65 MILES PER HOUR IN THE FAR LEFT LANE OF THE GARDEN STATE PARKWAY.  I WAS BARELY ABLE TO MANUEVER THE CAR TO THE SHOULDER OF THE ROAD AND I WAS LUCKY THAT THERE HAPPENED TO BE A VERY SMALL SHOULDER ON THE LEFT SIDE OF THE ROAD, AS I WOULD HAVE NEVER BEEN ABLE TO MAKE IT TO THE SHOULDER ON THE RIGHT HAND SIDE OF THE ROAD AND TRAFFIC WAS VERY HEAVY.  THIS SUDDEN LOSS OF ACCELERATION COULD HAVE EASILY CAUSED A FATAL ACCIDENT; PARTICULARLY, BECAUSE THE CARS BEHIND ME HAD NO WAY TO DETECT THAT MY CAR WAS ONLY COASTING.  THE NJ STATE TROOPERS HAD TO SHUT DOWN NORTHBOUND TRAFFIC IN ALL 4 LANES OF THE GARDEN STATE PARKWAY IN ORDER TO REMOVE MY CAR FROM THE PARKWAY.  THE CAR WAS TOWED TO THE DEALERSHIP.THE DEALERSHIP WAS UNABLE TO SUCCESSFULLY REPROGRAM THE COMPUTER, SO THEY SENT IT TO MONTVALE, NJ TO BE REPROGRAMMED.  THE DEALERSHIP RETURNED THE CAR TO ME ON JUNE 20, 2003.  ON JUNE 25, 2003, THE COMPUTER FAILED AGAIN, CAUSING THE CAR TO LOSE ACCELERATION WITHOUT WARNING.  THIS TIME, I WAS EXITING A PARKING GARAGE AND ANOTHER CAR NEARLY SLAMMED INTO ME ON THE EXIT RAMP.  WHEN I RESTARTED THE CAR, I WAS ABLE TO REACH THE TOP OF THE RAMP AND PULL TO THE SIDE OF THE ROAD, (NOT AN EASY TASK DURING RUSH HOUR IN MIDTOWN MANHATTAN!), BUT THE CAR LURCHED REPEATEDLY AND WAS UNABLE TO GO MORE THAN 5 MPH.  THE CAR WAS TOWED TO THE DEALERSHIP.BMW OF MANHATTAN HAS BEEN UNRESPONSIVE TO MY TELEPHONE CALLS.  THE CAR CLEARLY HAS A VERY SERIOUS DEFECT, WHICH COULD EASILY CAUSE FATALITIES.*AK",
        "vin": "WBAAZ33413P"
    }
]