[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "06/14/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023847,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002, HONDA, ODYSSEY EXHIBITS WHISTLING NOISE AROUND THE WINDSHIELD AT VARYING COMBINATIONS OF CAR SPEED, WIND SPEED AND WIND INTENSITY. *AK    LARRY HOPKINS HONDA WAS NOT ABLE TO DUPLICATE. LARRY HOPKINS HONDA RECOMMENDED THAT I CALL THE HONDA CUSTOMER SERVICE NUMBER AND SEE IF THEY COULD ASSIST WITH A RECOMMENDED SOLUTION.     I CALLED THE HONDA CUSTOMER SERVICE NUMBER 1-800-999-1009 AND SPOKE TO TONY YUN. CASE# NO[XXX]. MR. YUN SAYS THAT I MUST TAKE THE CAR TO A DEALER AND BE ABLE TO REPLICATE THE NOISE BEFORE ANYTHING CAN BE DONE TO FIX THE CAR. SINCE THE NOISE CAN ONLY BE REPLICATED UNDER CERTAIN WIND AND SPEED CONDITIONS, I ASKED THAT HE SEARCH THE HONDA DATA BASE FOR OTHER CUSTOMERS WITH SIMILAR PROBLEMS AND SEE IF THERE IS A RECOMMENDED SOLUTION. MR. YUN TOLD ME THAT HONDA DOESN'T WORK THIS WAY THAT EVERY CASE IS HANDLED SEPARATELY AND THAT THERE COULD BE NO ACTION UNTIL THE NOISE WAS REPLICATED.    I NEED HELP TO PRESS THIS CASE WITH HONDA. I BELIEVE THAT THEY MUST HAVE A FILE OF SIMILAR INCIDENTS SINCE I FOUND THE SAME PROBLEM POSTED ON HONDA NEWSGROUPS.    I DON'T BELIEVE IT IS FAIR OR REALISTIC TO HAVE TO WAIT FOR A COMBINATION OF THE RIGHT DRIVING CONDITIONS, MY AVAILABILITY AND THEIR SERVICE ADVISER AVAILABILITY BEFORE HONDA ADDRESSES THIS PROBLEM.    THE CONSUMER ATTEMPTED TO CONTACT THE DEALER TO HAVE THE AIRBAG RECALL REPAIR PERFORMED BUT, WAS UNABLE TO REACH ANYONE BY PHONE OR EMAIL. *JS     'PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'",
        "vin": "2HKRL18972H"
    }
]