[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/28/2003",
        "dateOfIncident": "06/27/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023943,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C COMPRESSOR DOES NOT DISENGAGE WHEN THE MANUAL SELECTOR SWITCH IS MOVED FROM THE DEFROST POSITION.  THIS IS COVERED BY A SERVICE BULLETIN NTB03-048 DATED 5-6-03 FROM NISSAN CONCERNING THIS PROBLEM.  THIS IS NOTED AS A CHANGE IN OPERATION FROM EARLIER MODELS AND I FEEL IT IS DANGEROUS.  THE ONLY WAY TO DISENGAGE THE COMPRESSOR AFTER USING THE DEFROSTER IS TO STOP THE CAR, MOVE THE SELECTOR SWITCH TO ANY FUNCTION THAT IS NOT DEFROSTER RELATED, TURN OFF THE IGNITION AND RESTART THE CAR.  IF YOU DON'T THERE IS AT LEAST A 10% LOSS IN MILEAGE DUE TO THE FACT THAT THE A/C COMPRESSOR IS OPERATING AND THE TEMP SELECTOR MUST BE ADJUSTED UP OR THE OCCUPANTS OF THE VEHICLE WILL FREEZE.  THIS WAS DISCOVERED BY MY WIFE AND I ON OUR WAY THROUGH CHICAGO ON I-94.  I THOUGHT IT WAS A SIMPLE WARRANTY PROBLEM THAT I WOULD BE ABLE TO GET FIXED UPON MY RETURN TO WAUKESHA.  THE SERVICE BULLETIN MAKES IT SEEM THAT THIS IS NORMAL AND THE CONSUMER WILL JUST HAVE TO LIVE WITH THE PROBLEM.  NOW THAT I KNOW WHAT IS GOING ON I FEEL THIS IS NOT ONLY DANGEROUS AND ENVIRONMENTALLY UNFRIENDLY BUT JUST ANOTHER WAY THE CAR MANUFACTURER HAS DECIDED TO CUT CORNERS AND NOT MAKE TWO DIFFERENT RELAYS FOR THE MANUAL AND AUTOMATIC CLIMATE CONTROL VEHICLES.  I DO NOT FEEL THAT I SHOULD HAVE TO CARRY BLANKETS AROUND IN MY CAR TO KEEP ME WARM IN JUNE AND JULY BECAUSE MY A/C WILL NOT SHUT OFF UNLESS I RESTART MY ENGINE.  WHAT FOOL WOULD DO THAT ON A BUSY INTERSTATE HIGHWAY.  THIS IS NOT A DEALER PROBLEM, THIS WAS IN THE VEHICLE WHEN I BOUGHT IT AND THAT THE WAY NISSAN DESIGNED IT.  I UNDERSTAND THAT THE VEHICLES WITH AUTOMATIC CLIMATE CONTROL CAN HIT THE \"AUTO\" CONTROL AND THE PROBLEM STOPS.  I DON'T HAVE THAT BUTTON IN MY \"MANUALLY\" CONTROLLED HEATER/AIR CONDITIONER.  I HOPE THAT YOU WILL ADDRESS THIS WITH NISSAN.  ACCORDING TO THE SERVICE BULLETIN THIS PROBLEM STARTED WITH MOST OF THE 2003 MODELS.  THANKS FOR YOUR TIME.   *NLM",
        "vin": "1N4AL11D23C"
    }
]