[
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/05/2003",
        "dateOfIncident": "09/05/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "RAM 1500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH IN MY DODGE RAM 1500 TRUCK BEGAN WITH A HAIRLINE CRACK AT ABOUT 40,000 MILES.  I BEGAN BY TAKING IT TO THE DODGE DEALER, WHO SAID THE REGIONAL SERVICE MANAGER WOULD CALL ME.  NO ONE EVER CALLED BACK.  SINCE THEN, THE DASH AS LITERALLY FALLEN APART.  THE IMMEDIATE SAFETY ISSUES ARE (1) THE AIR BAG AND ITS ABILITY TO DEPLOY, AND (2) PIECES OF THE DASH FLYING APART AND INTO OCCUPANTS IN THE EVENT OF A MOTOR VEHICLE ACCIDENT.    I HAVE EMAILED CHRYSLER; AFTER CHRYSLER'S 2ND REPLY, NO ONE WOULD RESPOND VIA EMAIL.    I HAVE CALLED CHRYSLER'S TOLL FREE CUSTOMER SUPPORT PHONE LINE.  I SPOKE WITH A VERY YOUNG AND ADAMANT YOUNG MAN, WHO REFUSED TO BUDGE ON THE REPLY I OBTAINED VIA EMAIL.  HE EVENTUALLY TERMINATED THE CONVERSTATION BY HANGING UP ON ME.    NEITHER PARTY (EMAIL OR TOLL FREE SUPPORT LINE) WERE INTERESTED IN ACTUALLY SEEING DIGITAL PHOTOS OF THE PROBLEM.  THE PHONE SUPPORT REP, WHEN TOLD OF MY SAFETY CONCERNS, SIMPLY RESPONDED THAT IF I THOUGHT IT WAS SUCH A BIG DEAL THAT I SHOULD GO AHEAD AND REPLACE THE DASH MYSELF.  SOME ANSWER!    I DID STOP BY THE DEALER (AGAIN) THIS AFTERNOON AND GAVE ME A PIECE OF THE DASH IN THE ERSTWHILE HOPE THAT THE NEW SERVICE MANAGER WILL BEGIN TO WORK THIS PROBLEM.    PLEASE HELP.  I AM VERY FRUSTRATED AND QUITE SURPRISED AT THE TOTAL LACK OF CHRYSLER CUSTOMER CARE.  I CAN AFFORD TO REPLACE THE DASH AT MY EXPENSE (LUCKILY), BUT AM TORN BECAUSE OF CHRYSLER'S REFUSAL TO \"DO THE RIGHT THING\" AND REPLACE THIS UNSAFE DEFECTIVE PART.WHAT DO YOU SUGGEST I DO?IF YOU WANT THE DIGITAL PHOTOS, I CAN SEND THESE AS WELL.*AK",
        "vin": "3B7HC13Z5XG"
    }
]