[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/16/2003",
        "dateOfIncident": "09/08/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039014,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: 1999 HONDA ACCORD EX (VIN: JHMCG667XXXXXXXXX). OPTED NOT TO DRIVE ON FREEWAY THAT EVENING DUE TO RUSH HOUR TRAFFIC, TOOK BACK STREETS (PROBABLY WOULD HAVE BEEN KILLED ON FREEWAY).  SUDDENLY ENGINE STARTED TO MAKE LOUD NOISES & ENGINE DIED; LOST POWER STEERING.  CHECK ENGINE LIGHTS & ALL PANEL LIGHTS CAME ON. TOW TRUCK ARRIVED, DRIVER DISCOVERED BELTS CAME OFF & THE PULLEY WAS BROKEN.  BOLT ATTACHING IT WAS SHEARED OFF & BROKEN IN HALF, TOO.  SUBMITTED ANOMALY TO HONDA CORPORATE (CASE # N012003-09-1001253)(PH # (800) 999-1009) TO REVIEW CASE ONCE OUR LOCAL HONDA DEALER COMPLETES REPAIRS.  CORPORATE HONDA OFFERED \"GOODWILL ASSISTANCE\" IF CASE DEEMED VALID ENOUGH FOR THEM TO PAY FOR SOME IF NOT ALL OF THE COSTS.  HAVE NOT HEARD FROM THEM YET.  HONDA DEALERSHIP NOTICED PULLEY WAS ALSO WARPED.  THEY HAVE NEVER SEEN ANYTHING LIKE THIS BEFORE. REPORTED CAR HAD 56K MILES, BUT MISTAKEN; SHOULD BE APPROX. 65K.  I THINK THIS IS A SAFETY ISSUE AND NOT JUST \"WEAR & TEAR\"; MORE LIKE A DESIGN FLAW OR SOMETHING!  WE HAVE AN 1987 HONDA WITH NO PROBLEMS & ITS PULLEY DOES NOT EVEN WOBBLE LIKE IT IS DOING NOW IN THE 1999 SINCE IT HAS BEEN REPAIRED.  IT'S STILL ON A TRIAL BASIS FOR 1 WEEK STARTING 9/15/2003.  TO CONTINUE FURTHER MAY COST US AN ADD'L $3K OUT OF POCKET WITH NO GUARANTEES FROM THE DEALERSHIP.  *JB",
        "vin": "JHMCG6671XC"
    }
]