[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2004",
        "dateOfIncident": "01/04/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052814,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN A 1998 FORD WINDSTAR.  I HAVE HAD THIS VAN FOR TWO YEARS.  I BOUGHT IT WITH 38000 MILES ON IT AND NOW HAVE 66000 MILES ON IT.  UP TILL ABOUT A MONTH AGO, I HAD NO PROBLEMS AS I HAVE LOVED THIS VAN.  BUT I DID RUN INTO A PECULIAR PROBLEM THAT SEEMS THAT MOST PEOPLE ARE HAVING WITH THIS VAN AS I HAVE CHECKED NUMEROUS WEBSITES AND WEB POSTS ON THE INTERNET AS WELL AS MY FRIENDS THAT HAVE FORMERLY OWNED THIS VEHICLE.  THE DOOR AJAR CENSOR INSIDE THE DOORS WEAR, CAUSING THE COMPUTERS  TO RECOGNIZE THE CAR DOORS TO BE SHUT.  THIS EMITS A BEEPING SOUND THAT STEADILY BEEPS TILL YOU RISE ABOVE 15 MPH.  ALSO, THE LIGHTS STAY ON AND SINCE FORD BUILT THESE VANS ALL THE SAME WAY, YOU CANNOT SIMPLY FIX IT WITHOUT SPENDING AT LEAST 500 DOLLARS IF YOUR LUCKY.  ALSO, ANOTHER PROBLEM HAS RISEN JUST RECENTLY.  MY TRANSMISSION HAS STARTED TO SLIP.  I EXPECTED NORMAL WEAR-AND-TEAR, BUT IT SEEMS THAT WHEN YOU REACH A CERTAIN THRESHOLD, AS MANY OF OTHER PEOPLE HAVE EXPERIENCED ONCE HITTING 65000 MILES ON THIS PARTICULAR VAN, THE TRANSMISSION GOES COMPLETELY.  I WOULD LIKE TO SEND AN AWARENESS TO FORD TO FIX THIS PROBLEM IN THEIR NEWER VANS, IF A PROBLEM EMERGED AND TO FUTURE BUYERS OF THIS YEAR OF VAN.  THIS HAS COST ME OVER 2500 DOLLARS AND I MUST ADMIT, IS NOT WORTH IT.  THIS VAN IS BY FAR THE WORST INVESTMENT I HAVE EVER MADE, AND I DO NOT RECOMMEND BUYING ONE.  THANK YOU.*AK",
        "vin": ""
    }
]