[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/08/2003",
        "dateOfIncident": "11/20/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MYSTIQUE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TO DATE HAD 4 STARTERS REPLACED IN MY 99 MERCURY MYSTIQUE 2.5L V6. I HAVE HAD CONCURRENT IDLING PROBLEMS/SURGING THAT LEADS TO JERKING AND STALLING. DASH WARPAGE WHICH IS NOW CAUSING A BLOCKAGE OF THE VENTING SYSTEM CAUSING A DEFROST PROBLEM. PROBLEMS WHEN DRIVING IN THE RAIN (LOSS OF POWER STEERING). ALL OF THESE ISSUES HAVE BEEN BROUGHT TO THE DEALERSHIPS/SERVICE DEPT.'S ATTENTION. AS WELL I HAVE CONTACTED THE FORDS CUSTOMER RELATIONS CENTER AND THEY WILL NOT HONOR THEIR RECALLS FOR MY VEHICLE. HERE IS WHAT HAPPENED THE 4TH TIME THE STARTER WENT OUT.    ON NOVEMBER THE 20TH  AT 7:00AM (DURING RUSH HOUR TRAFFIC) MY CAR STARTED MAKING A HORRIBLE WHIRRING NOISE BEHIND THE STEERING WHEEL COLUMN.  AS I WAS TURNING LEFT AT A BUSY INTERSECTION I CAN HEAR THE CAR STARTING TO DIE FROM THE BATTERY BEING DRAINED.  UPON TRYING TO TURN THE CAR OFF THE STARTER WOULD NOT DISENGAGE. EVENTUALLY AFTER REPEATED ATTEMPTS TO TURN IT OFF THE CAR DIED FROM THE BATTERY BEING DRAINED. THE CAR WAS TOWED TO 32 FORD IN BATAVIA, OH. I ONCE AGAIN EXPLAINED TO THEM THE SYMPTOMS THAT LED UP TO THE PROBLEM WITH THE RAMPANT IDLING/SURGING AND THE WHIRRING NOISE BEHIND THE STEERING COLUMN. THE SAME DAY THEY CALLED AND TOLD ME THE CAR WAS READY FOR ME TO PICKUP AND THAT THEY HAD REPLACED THE STARTER AGAIN. I ASKED ONCE AGAIN IS THERE ANY EXPLANATION AS TO WHY THIS IS HAPPENING. THEIR RESPONSE WAS IT WAS A MANUFACTURER DEFECT. I SAID 4 TIMES A MANUFACTURER DEFECT?? HOW IS THAT POSSIBLE. SOMETHING MUST BE CAUSING THIS PROBLEM. I WANT FORD TO ACKNOWLEDGE THAT THERE IS A PROBLEM WITH THIS MAKE AND MODEL AND MAKE AN ATTEMPT TO RESOLVE IT. I WANT CONSUMERS TO KNOW THAT 32 FORD AND FORD MOTOR COMPANY HAS ACTED IN CALLOUS DISREGARD TO MY REQUEST FOR HELP IN RESOLVING THIS ISSUE.*AK",
        "vin": "1MEFM66LXXK"
    }
]