[
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2004",
        "dateOfIncident": "01/12/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND COMPLAINT I HAVE HAD TO FILE.  THIS CAR KEEPS BREAKING DOWN ON ME AND IT IS NOT EVEN ONE YEAR OLD!  ON 1/12/04 I NEEDED TO DRIVE TO ROCKY MOUNT, NC THEN ON TO ROANOKE RAPIDS, NC SCHOOL.  AFTER ARRIVING IN ROCKY MOUNT, MY CAR WOULD NOT GO INTO GEAR, BUT STARTED FINE.  WHEN I ATTEMPTED TO PUT THE CAR IN GEAR THE CARE STALLED AND TURNED OFF.  I THEN ATTEMPTED TO START MY CAR AGAIN AND PLACE IT INTO GEAR ONE MORE TIME.  IT STARTED AND WENT INTO GEAR AND SEEMED TO DRIVE FINE.  I CALLED SATURN OF GREENVILLE AND THEY TOLD ME THAT THE BATTERY IS LIKELY TO BE THE PROBLEM AND TO NOT TURN MY CAR OFF FOR ONE HOUR, I THEN STATED THAT I WOULD CONTINUE TO DRIVE TO ROANOKE RAPIDS.  AFTER ARRIVING AT MY FINAL DESTINATION, MY CAR AGAIN STALLED AND TURNED OFF WHEN I PLACED IT INTO GEAR.  I HAD TO GET MY CAR TOWED AND GET A RENTAL CAR WHICH WERE BOTH HUGE INCONVENIENCES TO ME.  FINALLY, ON 1/16/04, I CALLED SATURN TO FIND OUT WHAT WAS WRONG WITH MY CAR AND THEY SAID THAT AIR WAS TRAPPED IN THE TRANSMISSION LINE AND THAT DURING THE REPAIR PROCESS, DAMAGE WAS DONE TO A DRAIN BOLT (\"STRIPPED\").  I WAS THEN TOLD I COULD PICK MY CAR UP ON 1/17/04.  AFTER GETTING MY CAR BACK, IT IS STILL MAKING A GRINDING NOISE IN THE STEERING COLUMN WHEN I TURN THE STEERING WHEEL, IT MAKES WEIRD NOISES CONSTANTLY, AND THE RPMS ARE MESSED UP.  THEY REV UP WHEN I TAP THE PEDAL, BUT WHEN I NEED TO ACCELERATE, THEY DO NOTHING.  SOMETHING IS SERIOUSLY WRONG WITH THE SATURN VUE AND THEIR TRANSMISSIONS NEED TO BE RECALLED!  *LA",
        "vin": "5GZCZ33D63S"
    }
]