[
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/03/2004",
        "dateOfIncident": "05/22/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10060314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A USED 2000 DURANGO SPORT APPROXIMATELY 5/2002 FROM THE JEEP DEALER IN ONTARIO, CALIFORNIA.  THEY SAID IT WOULD HAUL OUR 19 FEET TRAVEL TRAILER.  WE HAD SLOOPY STEERING ISSUES. WHEN GOING OVER A BUMP WHILE TRAVELING ON THE FREEWAY THE STEERING WOULD WOBBLE AS IF TO ALMOST LOSE CONTROL.  WHEN TRAVELING ON ALL OVER PASSES WITH THE STEERING WHEEL TURNED, IT WILL LOSE TRACTION FOR A SHORT PERIOD CAUSING THE STEERING WHEEL TO TURN BY ITSELF WHICH RESULTS IN ALMOST LOSE CONTROL.  WHEN YOU ARE TURNING FREEWAY \"CORNERS\" AT HIGHER SPEEDS IT FEELS TOP HEAVY AS IF YOU COULD ROLL OVER DUE TO INSTABILITY OF SUSPENSION & STEERING.  IT MAKES CLICKING NOISES FROM THE REAR END.  WE HAVE BOUGHT 2 COMPLETE SETS OF TIRES NEW TIRES AND 3 FRONT END ALIGNMENTS SINCE WE HAVE HAD THIS DURANGO.  SEARS SAID THE ALIGNMENT WAS COMPLETED AS BEST AS POSSIBLE, IT WAS ALMOST OUT OF SCOPE AS IT WAS, THE CASTER AND CAMBER BEARLY MEETS THE SPECIFICATIONS.  WHILE TOWING OUR WE FLIPPED AND ROLLED OUR 19FT TRAVEL TRAILER OVER, JUST ABOUT A HALF MILE FROM OUR HOME.  MY HUSBAND AND 12 YEAR OLD DAUGHTER WERE NOT PHYSICALLY INJURED IN THE ROLL OVER CRASH, BUT HAVE BEEN TRAMATIZED TO THIS DAY.  THE TRAILER JACKNIFED AND DISCONNECTED ITSELF OFF THE BALL AND ANTI-SWAY ARMS; RESULTING IN NO DAMAGE TO THE DRANGO.  HOWEVER, THE TRAILER AND PERSONAL ITEMS INSIDE WERE A COMPLETE LOSS, NOT TO MENTION THE CRANE AND THE FLATBED TOWING.  MY HUSBAND TOOK THIS DURANGO INTO A PRIVATE MECHANIC SHOP FOR AN ESTIMATE OF THE STEERING/SUSPENSION ISSUES AND WAS ADVISED TO HAVE THE RACK & PINION KNUCKLES REPLACED.  WE TOOK THE DURANGO INTO MOSS BROTHERS DODGE IN SAN BERNARDINO, CALIFORNIA AND HAD THEM CHECK THE FRONT SUSPENSION AND SPECIFICALLY ASKED THEM TO CHECK THE RACK & PINION KNUCKLES ALL DUE TO STEERING ISSUES AS DESCRIBED ABOVE.  THE COST WAS ABOUT $800 FOR REPLACMENT OF HUBS, BREAK MASTER CYLINDER AND FRONT END ALIGNMENT.  MOST OF OUR COMPLAINTS STILL EXIST WHILE DRIVING THIS 2000 DURANGO TODAY.*AK",
        "vin": "1B4HR28Y3YF"
    }
]