[
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/09/2004",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065814,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "AUTOMATIC EQUIPMENT",
                "productModel": "AUTOMATIC EQUIPMENT",
                "productYear": "1985",
                "type": "Equipment"
            }
        ],
        "summary": "MY 2001 ACCORD HAS HAD A PROBLEM WITH THE ACCELERATOR STICKING SINCE IT WAS NEW.  WHILE IT HASN'T YET STUCK OPEN IT DOES STICK EVERDAY.  IT SEEMS WORSE WHEN IT IS FIRST CRANKED IN THE MORNING, HOWEVER, LETTING IT WARM UP HAS NOT EFFECT. THIS IS ESPECIALLY DANGEROUS IN PARKING GARAGES AND LOTS.  I HAVE HAD THIS AUTO TO APPLE TREE HONDA ON AT LEAST SIX OCCASIONS AND THEY TELL ME THEY CAN'T DUPLICATE THE PROBLEM.  I HAVE LEFT IT OVERNIGHT FOR THEM TO SERVICE THE NEXT DAY AND THEY INSIST IT DOESN'T DO THIS WITH THEM.  I HAVE COMPLAINED TO THEM ON AT LEAST 6 OCCASIONS AND PAID FOR THREE FUEL INJECTION CLEANINGS.  THE ACCELERATOR STILL STICKS.  I UNDERSTAND FROM DOING INTERNET RESEARCH THAT THIS IS A COMMON PROBLEM WITH MY YEAR AUTOMOBILE, YET HONDA OBVIOUSLY DOESN'T WANT TO ADDRESS THE ISSUE.    IN ADDITION, MY TRANSMISSION IS GETTING WORSE DAY BY DAY.  IT NOW DOESN'T ENGAGE PROPERLY ESPECIALLY AFTER DRIVING, STOPPING AND TAKING OFF AGAIN ON A GRADE.  WHILE THIS CAR HAS A GRADE LOGIC SENSOR THE SENSOR APPARENTLY DOESN'T DO IT'S JOB BECAUSE I LIVE IN THE MOUNTAINS AND IT NEVER ENGAGES.  APPLE TREE ALSO TELLS ME THAT THEY JUST CAN'T SEEM TO DUPLICATE ANY TRANSMISSION PROBLEM. I AM AWARE THAT THERE IS AN EXTENDED WARRANTY DUE TO A RECALL BUT APPLE TREE HAS NEVER MENTIONED ANY REPAIR TO ME.  IN ADDITION, FROM INTERNET RESEARCH, WHEN YOU TAKE YOUR ACCORD FOR THIS WARRANTY REPAIR THEY USE A \"USED\" TRANSMISSION UNDER THE EXCUSE THAT IT WILL TAKE TO LONG TO GET A NEW ONE.     I HAVE WRITTEN A DETAILED LETTER TO AMERICAN HONDA TO SEE IF THEY WILL ASSIST ME, OTHER THAN ANOTHER TRIP TO APPLE TREE, WHOSE SERVICE IS SUBSTANDARD AND HAS BEEN FOR YEARS.  WHEN I OWNED MY FIRST ACCORD I DROVE OVER AN HOUR FOR SERVICE TO ANOTHER STATE BECAUSE APPLE TREE ACTUALLY DAMAGED BY CAR DURING SERVICE, LEFT ME SITTING THREE HOURS DURNING A 10 MINUTE OIL CHANGE BECAUSE THEY COULDN'T \"FORGOT\" I WAS WAITING, ETC.  THIS IS MY SECOND ACCORD BUT DEFINITELY MY LAST UNLESS HONDA DEALS WITH THE ISSUES.*AK",
        "vin": "1HGCG56631A"
    }
]