[
    {
        "components": "STEERING,AIR BAGS,TIRES",
        "crash": true,
        "dateComplaintFiled": "05/30/2004",
        "dateOfIncident": "04/26/2004",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10074514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-V",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "DUELER 684",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS DRIVING ON THE HUTCHINSON RIVER PARKWAY IN NEW YORK AT MODERATE SPEED, EVERYTHING WAS FINE, AND SUDDENLY AND COMPLETELY LOST STEERING. EVERY OUNCE OF MY BEING WAS DIRECTED AT TRYING TO STEER, TO NO AVAIL. THE CAR WAS LIKE A BAD CARNIVAL RIDE CONDUCTED BY DEMONS.  I SMASHED INTO THE GUARD RAIL ON THE RIGHT SIDE OF THE HIGHWAY, CAROMED OFF IT, VEERED TO THE LEFT AND SMASHED INTO THE CONCRETE MEDIAN JERSEY BARRIER ON THE LEFT.  I WAS ABSOLUTELY CERTAIN I WAS ABOUT TO DIE.  THANKS TO THE BARRIER AND MY SEATBELT AND AIRBAGS (I HAVE SIDE-IMPACT AIRBAGS WHICH DID NOT DEPLOY, ONLY THE FRONT ONES DID - THERE WAS NO PASSENGER IN MY CAR), I DID NOT GO INTO ONCOMING TRAFFIC AS I BELIEVED I WAS ABOUT TO, WALKED AWAY FROM MY CAR AND AM SITTING HERE WRITING TO YOU NOW, QUITE BANGED UP AND BRUISED AND WITH A FRACTURED VERTEBRA BUT MIRACULOUSLY ALIVE.  MIRACULOUSLY ALSO, NO OTHER CARS WERE INVOLVED.  ***     SOMETHING FAILED IN MY CAR TO CAUSE THIS AND I WANT TO KNOW WHAT.  THERE WAS EITHER A TIRE OR MECHANICAL FAILURE OF SOME KIND.  (THE TIRES STILL HAD DECENT TREAD ON THEM.)  MY INSURANCE COMPANY SAYS THE CAR AND TIRES ARE SO DAMAGED FROM THE IMPACT THAT THEY CAN'T TELL WHAT CAUSED IT AND THEY SHOW NO INTEREST IN PURSUING IT. (IT DOES NOT APPEAR TO HAVE BEEN A BLOWOUT.)  I'M SURE SOMEONE WHO KNEW HOW COULD INVESTIGATE THE CAR AND FIND OUT WHAT FAILED.  IT SEEMS TO ME IT SHOULD BE OF INTEREST TO HONDA AND EVERYONE ELSE WHAT WENT WRONG HERE.  I HAVE NOTIFIED AMERICAN HONDA ABOUT THE ACCIDENT AND WAS ASSIGNED A CASE NUMBER, BUT THEY HAVE NOT GOTTEN BACK TO ME.   (P.S.  THE CAR HAS CRUISE CONTROL BUT I WAS NOT USING IT.)  *LA",
        "vin": "JHLRD77862C"
    }
]