[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "05/04/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GX 470",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE TWINS AND HAVE TO USE TWO CAR SEATS.  CHILD SAFETY RESTRAINT LATCH SYSTEM ON THE SECOND ROW SEAT OF A LEXUS GX470 BEHIND THE DRIVER SIDE OF THE VEHICLE IS NOT POSITIONED ACCORDING TO FEDERAL GUIDLINES.  ONE LATCH IS IN THE MIDDLE OF THE BIGHT OF THE SEAT AND THE OTHER LATCH IS IN THE MIDDLE SEAT JUST ON THE OTHER SIDE OF THE SEAT BELT RECEPTICLES FOR THE MIDDLE PASSENGER AND PASSENGER BEHIND THE DRIVER.  WHEN INSTALLING A CHILD SEAT BEHIND THE DRIVER SIDE, THE SEAT SITS AT AN ANGLE AND THE REAR OF THE CARSEAT CLOSEST TO THE DRIVER SEAT IS OFF THE SEAT ABOUT 3 INCHES ALLOWING IT TO BOUNCE UP AND DOWN.  ADDITIONALLY, THE SEAT CAN BE MOVED, EVEN WHEN TIGHTENED WITH A MIGHTY TIGHT, MORE THAN AN INCH(WHICH IS THE MAXIMUM ALLOWED)  BECAUSE OF THE POSITIONING OF THE LATCHES BEING ON AN UNEVEN SURFACE.  A CHILD SEAT CANNOT BE INSTALLED USING THE LATCH SYSTEM BEHIND THE DRIVER IN A WAY TO BE SIGNED OFF AS SAFE BY NHTSA CERTIFIED TECHNICIANS.  THIS PROBLEM HAS BEEN PRESENTED TO LEXUS LOCAL DEALERSHIP, REGIONAL REPRESENTATIVE, CORPORATE SUPERVISOR, CORPORATE EXECUTIVES.  I HAVE WRITTEN DOCUMENTATION OF ALL CONVERSATIONS WITH THEM.  THERE WERE TALKS ABOUT THEM BUYING BACK THE VEHICLE.  THE REGIONAL REPRESENTATIVE TOLD US TO GO FIND TWO CARSEATS THAT COULD BE SAFELY INSTALLED AND LEXUS WOULD BY US TWO NEW ONES.    THE TECHNICIAN AT THE STORE WE WENT TO IS NHTSA CERTIFIED AND SAID THERE IS NOT A WAY TO SAFELY INSTALL ANY CAR SEAT USING THE LATCH SYSTEM ON THAT SIDE OF THE CAR AS WELL.  A NHTSA CERTIFIED MS FIREFIGHTER CONCURRED THAT USING THE LATCH ON THE DRIVER SIDE WAS NOT SAFE.   LEXUS OFFERED $2,000 TOWARD THE PURCHASE OF ANOTHER LEXUS PRODUCT.    I HAVE SPOKEN WITH STEVEN BERETZKY AT NHTSA IN DETAIL ABOUT THIS SITUATION.  WE WERE TOLD THAT NOTHING COULD BE DONE TO CHANGE WERE THE LATCHES WERE PLACED.*AK",
        "vin": "JTJBT20X640"
    }
]