[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/19/2004",
        "dateOfIncident": "03/24/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066514,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 1999 SUBARU FORESTER S LESS THAN 2 YEARS AGO. IN DECEMBER 2003, AT APPROX. 71,200 MILES, THE CAR BEGAN LOOSING ANTIFREEZE. I DISCOVERED THAT I NEEDED A HEAD GASKET JOB. NOW I FIND THEY HAVE A RECALL ON THIS. SHORTLY THEREAFTER I DISCOVERED THE MYSTERIOUS \"VANISHING OIL\" PROBLEM WITH THIS ENGINE. AT 75,775, I CHECKED THE OIL AND FOUND IT MOSTLY GONE! I RETURNED TO MY MECHANIC, WHO FOUND NO EXTERNAL LEAK AND NO SIGN OF OIL BURNING ON THE SPARK PLUGS. AFTER DOING SOME RESEARCH (SEE NHTSA COMPLAINTS), THIS APPEARS TO BE A CHRONIC PROBLEM WITH THESE ENGINES. I CONTINUED TO MONITOR THE SITUATION AND ADD OIL AS NECESSARY. I SEEM TO NEED 1 QUART PER 1500 MILES, APPROXIMATELY.    NOW, THE FINAL PROBLEM. ON 3/24/04, AT 77,848, I WAS DRIVING AT 65 MPH, HEARD A STRANGE NOISE AND THE CHECK ENGINE LIGHT CAME ON. I IMMEDIATELY TURNED OFF THE ENGINE AND COASTED TO A SAFE TURN OUT.  AFTER TOWING THE CAR TO MY MECHANIC, HE DISCOVERED THAT THE TOP OF THE TIMING BELT TENSIONER HAD POPPED OFF, RELEASING THE HYDRAULIC AND OF COURSE THE TIMING BELT. HE HAS NEVER SEEN A TENSIONER FAIL, AND OUT OF THE HUNDREDS OF NEW TIMING BELTS HE HAS DONE, HE ONLY HAD TO REPLACE ABOUT A DOZEN THAT WERE OUT OF SPECS. WE DEBATED A COURSE OF ACTION AND, SINCE IT IS A NON-INTERFERENCE MOTOR, I DECIDED TO REPLACE THE TENSIONER AND NOT THE ENTIRE MOTOR. HE ALSO DID A HAND CRANK TO CHECK FOR RESISTANCE OR OTHER HEAD DAMAGE. AFTER WAITING NEARLY 2 WEEKS FOR PARTS (DUE TO SUBARU'S PART ORDERING METHOD), HE REPLACED THE TENSIONER. WHEN TESTING THE ENGINE, IT DID NOT SOUND RIGHT. HE DID A COMPRESSION TEST AND FOUND NO COMPRESSION ON 3 CYLINDERS! SO NOW I HAD THE SHOCKING PROSPECT  OF NEEDING A NEW ENGINE!I DECIDED I BETTER GET HELP FROM THE DEALER, AS THIS ALL APPEARS TO BE A QUALITY ISSUE THAT SHOULD NOT BE HAPPENING TO THIS ENGINE AT THIS MILEAGE. THE CAR IS NOW AT STOHLMAN SUBARU IN VIENNA, VA.  *AK",
        "vin": "JF1SF6554XG"
    }
]