[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069914,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "DIAMANTE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2000 MITSUBISHI DIAMANTE WITH 32K MILES ON IT. CAR IS STILL UNDER FACTORY WARRANTY ALONG WITH AN EXTENDED WARRANTY WE HAVE PURCHASED. AFTER THE FIRST COUPLE OF THOUSAND MILES WE NOTICED A &#34;PULSING&#34; FEELING IN THE BRAKES AS WELL AS AN INTERMITTENT ABS WARNING LIGHT FLASH.  WE MADE THE DEALER AWARE OF THIS SO THEY REPLACED ALL 4 AT APPROX. 11K.  LESS THAN 10K AFTER THAT WE NOTICED THE SAME PROBLEM AND TOOK IT INTO A CLOSER DEALER TO WHERE WE LIVE, THEY REPLACED THE BRAKES AGAIN. NOW AGAIN ABOUT 10K THE BRAKES ARE HAVING THE SAME PROBLEM. THE VEHICLE ABS LIGHT CAME ON A COUPLE OF TIMES AND THE CAR IS ?PULSING? WHEN APPLYING THE BRAKES AND IS WORN OUT AGAIN.  I SPOKE TO MITSUBISHI CUSTOMER SERVICE AGENT WHO IS THE DEALER REP. DEBBIE KRUMBOLTZ. SHE ORIGINALLY AGREED TO TAKE CARE OF THE BRAKES AFTER I MET WITH HER ABOUT THE ISSUE. WHEN I MADE THE APPOINTMENT TO HAVE THE REPAIR DONE SHE DENIED AGREEING TO THE REPAIR? I IN TURN CALLED MITSUBISHI MOTORS AND SPOKE TO A PERSON IN THE ESCALATED COMPLIANT DIVISION NAMED LISA, SHE WOULD NOT GIVE HER LAST NAME AND BASICALLY TOLD ME THAT THE CASE IS CLOSED AND MITSUBISHI IS NOT GOING TO DO ANYTHING ABOUT IT. I EXPLAINED TO HER THAT THIS HAS BEEN AN ON-GOING PROBLEM AND THE ABS LIGHT IS STILL AN ISSUE AND THAT THE BRAKES ATE WEARING OUT TOO FAST AND IT IS A SAFETY ISSUE. SHE DID NOT CARE SHE AGAIN TOLD ME THAT THERE IS NOTHING THAT THEY ARE GOING TO DO, SHE WOULD NOT LET ME TALK TO A SUPERVISOR OR ANYONE ABOVE HER AT MITSUBISHI AND TOLD ME THAT THAT IS THE FINAL ANSWER AND HUNG UP ON ME TWICE. THIS IS A SAFETY ISSUE. WE FEEL THAT WE ARE BEING IGNORED BY MITSUBISHI AND WHEN I TOLD THEM AS A CUSTOMER THAT HAD DROPPED 30+ THOUSAND DOLLARS ON A CAR THAT IS STILL UNDER FACTORY WARRANTY TO HAVE THIS TYPE OF PROBLEM AND A SAFETY ISSUE AT THAT TO BE TOLD ?CASE CLOSED?? IS THE WORST SERVICE AND RESOLVE I HAVE EVER EXPERIENCED. PLEASE HELP? THANK YOU",
        "vin": "6MMAP67P9YT"
    }
]