[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/08/2004",
        "dateOfIncident": "06/23/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "JIMMY",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DELCO ELECT. DIV., GM",
                "productMake": "DELCO",
                "productModel": "DELCO",
                "productYear": "2003",
                "type": "Equipment"
            }
        ],
        "summary": "ON WEDNESDAY JUNE 23, 2004, I WENT TO RED HOLMAN PONTIAC TO REPLACE A HUB AND BEARING ASSEMBLY ON THE FRONT LEFT WHEEL OF MY GMC JIMMY 2000. A GRINDING AND METALLIC NOISE WAS COMING FROM THE FRONT OF THE VEHICLE AND I HAD TO HAVE DONE AT THE DEALER. TWO YEARS AGO, THIS SAME HUB AND BEARING ASSEMBLY WAS REPLACED AT 48000 MILES. NOW, THIS VEHICLE HAS 75000 MILES AND I HAVE TO REPLACE THE RIGHT HUB AND BEARING ASSEMBLY. THIS MEANS THAT THIS PART ONLY LASTED 48000 MILES AND THE REPLACEMENT PART LESS THAN 27000 MILES. ON BOTH INSTANCES, THERE WAS ALSO A FAILURE OF THE ABS BRAKE SYSTEM. I HAVE OWNED OVER THE YEARS MORE THAN 11 GM CARS WITH VARIOUS MILEAGES AT TRADING TIME AND I NEVER HAD TO REPLACE A BEARING. WHEN THE FIRST REPLACEMENT ASSEMBLY WAS PUT IN, THE DEALER TOLD ME THAT IT WAS A HAZARD AND FOR THE OTHER WHEEL, THE DEALER ACKNOWLEDGED THE FACT THAT IT IS A SAFETY HAZARD ON MY INVOICE  IF THESE PARTS POSE A THREAT TO THE SAFETY OF GMC OWNERS, WHY IS GMC INSTALLING PARTS WITH MATERIAL DEFECTS?   I WAS ALSO INFORMED THAT THE REPLACEMENT PART CARRIES ONLY A 12000 MILES WARRANTY AND THE PRICE IS ABOUT $460 AND LABOR $124.00. LUCKILY, THE FIRST REPAIR WAS UNDER WARRANTY, BUT THIS TIME I HAD TO NEGOTIATE WITH THE DEALER AND I HAD TO PAY $284.00.  I BELIEVE THAT THESE PARTS SHOULD LAST LONGER SINCE THERE IS NEITHER MAINTENANCE NOR ANY FACILITY TO DISASSEMBLE THE UNIT. I SEE NO FAULT WITH THE DEALER; RATHER I SEE A MANUFACTURER DEFECTIVE PRODUCT.  THIS REPAIR SHOULD HAVE BEEN THE GMC RESPONSIBILITY DUE TO THE SHORT LIFE SPAN OF THIS PRODUCT.*AK    SINCERELY,    CLAUDE DURAND",
        "vin": "1GKDT13W4Y2"
    }
]