[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/06/2004",
        "dateOfIncident": "05/25/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCORT",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT SEAT RETRACTOR MOTORS/TRACKS HAVE FAILED, RESULTING IN FRONT SEAT BELTS INOPERABLE. BELTS STUCK IN PARTIAL RETRACTED MODE RESULTING IN SHOULDER BELTS NOT CORRECTLY POSITIONED TO PROPERLY RESTRAIN DRIVER OR FRONT PASSENGER. ONE BELT IS POSITIONED IF USED WOULD COME ACROSS THE SEATED PERSON'S NECK. IF THIS WHERE A MANUAL SEATBELT SYSTEM THERE WOULD NOT BE A PROBLEM, BUT THERE IS NO WAY TO MANUALLY LOCK THE SHOULDER BELT IN THE PROPER POSITION DUE TO THE ELECTRIC SYSTEM EMPLOYED IN THIS VEHICLE AND IT'S FAILURE. WHEN THE VEHICLE WAS PURCHASED USED IT HAD 90158 ACTUAL MILES. THE USED CAR DEALER INFORMED ME THAT THE PROBLEM COULD BE RESOLVED WITH THE INSTALLATION OF \"SALVAGE\" PARTS SINCE THE EXPENSE OF REPAIRING THE SEAT BELTS BY \"FORD\" WOULD EXCEED THE VALUE OF THE VEHICLE. I HAVE BEEN ABLE TO CONFIRM THIS BY TALKING WITH THE REPAIR DEPARTMENTS AT SEVERAL FORD DEALERS IN THE AREA. TALKING WITH A NUMBER INDEPENDANT AUTO REPAIR SHOPS IN THE AREA THIS IS A \"COMMON PROBLEM\" WITH THESE VEHICLES, HOWEVER FORD WILL NOT HONOR REPAIR OF THIS \"SAFETY\" ISSUE. RESEARCH ON THE INTERNET I HAVE FOUND THIS IS ALSO A COMMON PROBLEM. I HAVE OBSERVED THAT YOUR SITE HAS AN NUMBER OF THE SAME OR SIMILAR COMPLAINTS. I WOULD LIKE TO KNOW IF NHTSA CONSIDERS THIS A \"PASSENGER SAFETY ISSUE\" REQUIRING A RECALL, OR DOES DEATH OR SERIOUS INJURY HAVE TO OCCUR BEFORE AN ACTION IS TAKEN? SEVERAL COMMENTS HAVE BEEN MADE ON LINE THAT BECAUSE HIS IS A \"PASSENGER SAFETY ISSUE\" INVOLVING A \"REQUIRED SAFETY COMPONENT\" THAT FORD IS OBLIGATED TO REPAIR THE SEAT BELT WHTHER OR NOT UNDER WARRENTY WITHOUT CHARGE TO THE VEHICLE OWNER AS LONG AS THE ITEM WAS NOT DAMAGED IN AN ACCIDENT OR SUBJECTED TO IMPROPER USE OR REPAIR. THIS VEHICLE ACCORDING TO CARFAX HAS NEVER BEEN INVOLVED IN AN ACCIDENT AND AT THE TIME OF PURCHASE WAS UNDER 100000 MILES, THE LIMIT OF FORD'S GENERAL WARRANTY.*AK",
        "vin": "3FASP15J6SR"
    }
]