[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2004",
        "dateOfIncident": "07/24/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "RADIAL X",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "AUGUST 2002, I REPLACED ALL FIVE TIRES ON MY 01 NAVAGATOR WITH 17\" MICHELIN XROSS TERRAIN TIRES DUE TO A SAFETY RECALL ON THE OEM CONTENINTALS.  SINCE THE REPLACEMENT DATE, THREE OF THE TIRES HAVE ALL SUFFERED SIDEWALL FAILURES ON THE HIGHWAY, IN THE SUMMER AND WITH NORMAL LOADING.  ALL THREE WERE ON THE REAR AND ALL WERE CATASTROPHIC FAILURES.    THE FIRST HAPPENED ABOUT LAST SEPTEMBER 2003 WITH APPROXIMATELY 12,000 MILES ON THE TIRES.  THE TIRE HAD A NAIL IN IT AND THE CAUSE FROM THE DEALER WAS MY FAULT, UNDER INFLATED TIRE.  THE SECOND WAS THE FIRST WEEK OF JULY 2004, SAME PROBLEM AND EXACTLY THE SAME CIRCUMSTANCES.  LOCAL HIGWAY DRIVING AT SPEED AND ON A HOT DAY WITH A NAIL IN THE TREAD.  AGAIN, IT WAS MY FAULT DUE TO UNDER INFLATION.      IT HAPPENED A THIRED TIME YESTERDAY AT SPEED, COOL HIGHWAY TEMPS, OVERCAST SKIES AND ABOUT 75 DEGREES, PRESSURE IN THE TIRE WAS SET THE DAY BEFORE AT 36 PSI AND CONFIRMED THAT MORNING BY AIR CAPS (36 PSI UNITS).  NO NAILS IN THE TIRE, JUST A CATROSTROPHIC FAILURE.    I AM CONVINCED THE FIRST TWO TIRES WERE DEFECTED AS IS THIS THIRD ONE.  THESE THREE TIRES ARE FROM THE ORGINAL BUNCH OF FIVE THAT WERE INSTALLED.  I HAVE THE FORTH TIRE ON THE GROUND NOW AS A SPARE AND THE REMAINING ORIGINAL IS ONE OF THE FRONT TIRES.  NOT SURE WHICH.    I AM GOING TO PRESS FOR A MEETING WITH THE HOUSTON AREA TIRE REPRESENTATIVE THIS WEEK AND BRING UP MY CONCERNS WITH HIM DIRECT.  I HAVE HAD TO CHANGE TWO TIRES IN MY ADULT LIFE (44 YEARS OLD).  ONE WAS 6 YEARS AGO WHEN A VALVE STEM FAILED, THE FIRST WAS IN 1980 WITH A BAD TIRE ON THE HIGHWAY, LOADED UP AND HEADING TO COLLEGE.  SINCE THIS TRUCK WAS BOUGHT, I HAVE HAD 4 TIRE FAILURES, ALL ON THE REAR AND ALL AT HIGWAY SPEED AND DURING THE SUMMER.        I AM KEEPING THE LATEST DAMAGED TIRE JUST IN CASE IT NEEDS TO BE STUDIED.  I AM GOING TO CHANGE OUT ALL FIVE TIRES TO ANOTHER BRAND AND TRY SOMETHING NEW TO TRY AND SOLVE THIS PROBLEM.  *AK",
        "vin": "5LMEU27RX1L"
    }
]