[
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/24/2004",
        "dateOfIncident": "08/24/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088514,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE TWO MAJOR PROBLEMS WITH MY 1996 DODGE GRAND CARAVAN.  FIRST THERE IS A SERIOUS VIBRATION IN THE FRONT WHEEL/TIRES.  I HAVE REPLACED 8 TIRES (IN 30000 MILES!), BOTH FRONT AXLES, ALL THREE MOTOR MOUNTS, AND HAD THE TRANSMISSION OVERHAULED, AS WELL AS HAVING THREE ALIGNMENT CHECKS.  THE VIBRATION IS STILL THERE.  THE SECOND PROBLEM INVOLVES THE WINDSHIELD WIPERS.  THE FRONT WIPERS WERE, FOR A TIME, COMING ON ANY TIME THEY FELT LIKE IT; THIS WAS REMEDIED BY REPLACING THE MULTI FUNCTION SWITCH ON 09/21/01.  SINCE THEN, THE REAR WIPER WILL OCCASIONALLY COME ON FOR ONE SWIPE WHEN I FIRST START THE VEHICLE - ANNOYING, BUT NOT AN IMMEDIATE HAZARD.  BUT TODAY, MY WINDSHIELD WIPERS QUIT WORKING AT ALL.  THEY WILL ONLY WORK IF I PUT THE WIPERS ON INTERVAL - IN WHICH CASE THEY DO NOTHING FOR A TIME, THEN MAKE TWO TO FOUR SWIPES, THEN WAIT A WHILE, MAKE ONE OR TWO SWIPES, WAIT A WHILE, ETC.  THEY WILL MAKE ONE HIGH SPEED SWIPE ACROSS THE WINDSHIELD IF I PRESS THE WASHER BUTTON IN.  I SPENT $80 TODAY SO THE DODGE DEALER COULD TELL ME THIS WAS CAUSED BY A BODY CONTROL MODULE FAILURE.  THIS REPAIR COSTS OVER $400...AND RESEARCHING A USED PART ONLINE, I LEARNED THAT BOTH THE WHEEL SHIMMY PROBLEM AND THE WINDSHIELD WIPER PROBLEMS ARE NOT UNIQUE TO MY CAR BUT ARE VERY COMMON ISSUES WITH THE DODGE CARAVAN/CHRYSLER TOWN & COUNTRY/PLYMOUTH VOYAGER FAMILY.  LOSING YOUR WIPERS, HAVING THEM COME ON AT RANDOM WHEN THEY TAKE A NOTION TO, AND A NON-STOP SHIMMY IN THE FRONT ARE EACH, BY THEMSELVES, SERIOUS SAFETY ISSUES WARRANTING A RECALL.  COLLECTIVELY, THEY SPELL OUT A LACK OF CONCERN THAT DAIMLER CHRYSLER HAS FOR THE SAFETY OF THOSE WHO DRIVE THEIR PRODUCTS.  IT IS MY UNDERSTANDING FROM MY ONLINE RESEARCH THAT CHRYSLER WAS AWARE OF THE PROBLEM AS LONG AGO AS 1998 BUT DELIBERATELY IGNORED ITS OWN INFORMATION.  IT IS APPARENT THAT THE ONLY WAY THESE SAFETY ISSUES ARE GOING TO BE ADDRESSED IS IF THE FEDERAL GOVERNMENT TAKES THEM TO TASK.*AK",
        "vin": "1B4GP54R9TB"
    }
]