[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/01/2004",
        "dateOfIncident": "06/20/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VENTURE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACEMENT OF REAR LEFT HAND WHEEL CYLINDER DUE TO FAILURE OF OEM (2001 CHEVROLET VENTURE VAN REAR LEFT HAND WHEEL CYLINDER).  WHEN I REPLACED THE ABOVE CYLINDER, I TOOK THE VAN FOR A TEST DRIVE AND 3 MILES LATER FOUND THE WHEEL TO BE SMOKING AND EXTREMELY HOT (I HAD NOT BACKED THE DRUM BRAKES OFF TO ACCOUNT FOR THE SIZE OF THE NEW BRAKES).  WHEN I PULLED THE DRUM BACK OFF OF THE AXLE, I FOUND THAT THE NEW WHEEL CYLINDER HAD A WHOLE IN IT.  I THOUGHT THAT THIS WOULD BE A FLUKE, SO I REPLACED IT WITH ANOTHER OF THE SAME BRAND AND BOUGHT FROM THE SAME STORE.  UPON CLOSER INSPECTION, I FOUND THAT THE 2ND NEW WHEEL CYLINDER HAD A DIVIT IN THE SAME LOCATION AS THE 1ST NEW CYLINDER HAD.  I TOOK ONE BACK TO THE STORE AND ASKED THEM FOR ANOTHER ONE, WE (THE CLERK AND I) EXAMINED IT AND FOUND THAT IT ALSO HAD THIS DIVIT IN IT.  WE INSPECTED A COUPLE MORE OF THEM AND WAS ABLE TO PULL ONE OF THE RUBBER BOOTS OFF OF ONE THAT DID NOT LOOK DEFECTIVE, AND COMBINED IT WITH A CYLINDER THAT HAD A SECOND BOOT ON IT THAT WAS NOT DEFECTIVE GIVING ME A GOOD CYLINDER TO INSTALL ON MY VAN.  THERE WERE 3 OR MORE OF THESE DEFECTIVE WHEEL CYLINDERS THAT WERE BAD.  THE PRODUCT WAS BOUGHT FROM ADVANCE AUTO PARTS AND THE PART # IS W37855  ITEM # 3643344 AND IT COSTS $22.76.  ADVANCE AUTO PARTS WAS VERY HELPFUL AND CONCERNED WHEN I PRESENTED THEM WITH THE ISSUE AND THEY FOUND A WAY TO MAKE IT WORK FOR ME.  I HAVE A 22 HOUR DRIVE TO MAKE FROM NORTH CAROLINA TO ILLINOIS IN 2 DAYS WITH MY FAMILY AND THIS IS A MAJOR CONCERN FOR ME.  THANKS AGAIN FOR YOUR TIME AND ASSISTANCE IN THIS MATTER, LUCKILY THERE WERE NO INCIDENT(S), CRASH(ES), OR INJURY(IES) BEFORE I FOUND THIS PROBLEM, I HOPE THAT ADVANCE AUTO PARTS WILL PUT AN IMMEDIATE RECALL ON THIS PART SO THAT NO ONE HAS A BRAKE FAILURE WHILE DRIVING ON THESE WHEEL CYLINDERS.  *JB",
        "vin": ""
    }
]