[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/29/2004",
        "dateOfIncident": "05/12/2001",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "PLYMOUTH",
                "productModel": "VOYAGER",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A PLYMOUTH VOYAGER AND WE HAVE HAD STEADY PROBLEMS WITH THE WINDSHIELD WIPERS. EITHER THEY STOP IN THE MIDDLE OF A PATH AND JUST QUIT WORKING. TWO YEARS AGO THEY STOPPED WORKING AT ALL, LUCKILY WE LIVED IN WYOMING WITH LITTLE RAIN. LAST YEAR WE MOVED TO FLORIDA AND THEY WORKED FOR A WHILE AND NOW STOPPED AGAIN. WE HAVE REPLACED THE SWITCH ( AS THE DEALERSHIP SUGGESTED) BUT IT DID NOT HELP, ( 89.00) THEN WE WERE TOLD IT WAS A MOTOR SO WE REPLACED THAT AT 110.00,  NO DIFFERENCE, THE RELAYS ARE GOOD AN NOW THEY THINK IT IS THE COMPUTER. 600.00.           WINDSHIELD WIPERS  SEEM TRIVIAL, BUT WHEN YOU LIVE IN FLORIDA AND CANNOT SAFELY EVACUATE FOR HURRICANES ( AND WE HAVE SEEN 4 IN THE LAST MONTH) BECAUSE DRIVING THE FAMILY VEHICLE IN THE RAIN ENDANGERS LIVES EITHER WAY. ONE OF MY BIG COMPLAINTS IS JUST THAT A 600.00 COMPUTER IS USED TO CONTROL WIPERS THAT SHOULD BE ABLE TO BE USED IN EMERGENCY, THERE IS NO WARNING OR BYPASS THEY JUST WILL NOT WORK. MINIVANS CARRY WHOLE FAMILIES, AND CAN CARRY THEM ALL TO THEIR DEATHS  IF THIS HAPPENS IN A DOWNPOUR AND THE WIPERS STOP WITHOUT WARNING. IT IS AN OUTRAGE THAT COMPANIES LIKE DODGE ARE ALLOWED TO PRODUCE VEHICLES LIKE THIS AND NOT OFFER SUPPORT IN FIXING THEM OR EVEN KNOW WHAT IT IS FOR SURE. AND SINCE WE JUST SPENT SO MUCH PAYING THIS VAN OFF WE HAVE VERY LITTLE LEFT TO PUT INTO ANY MORE REPAIRS AND NOTHING LEFT FOR THE PURCHASE OF ANOTHER VEHICLE.    IS THERE ANYONE I CAN WRITE TO PUT PRESSURE ON DODGE TO QUIT PRODUCING THESE TYPES OF VEHICLES AND TO MAYBE COME UP WITH A BETTER ANSWER TO OUR WIPER PROBLEMS SO THAT THEY ARE NOT COMPUTER CONTROLLED AND OUR LIVES ARE HANGING IN THE BALANCE OF A GLITCH IN SOMETHING SO SIMPLE AS WIPERS BUT SOMETHING SO BASIC AND SO NEEDED?      I WILL KEEP LOOKING FOR SOME JUSTICE SOMEWHERE AND SEE IF THERE IS ANYONE OUT THERE WHO CAN HELP MAKE THIS RIGHT BEFORE SOMEONE DIES AS A RESULT. THANK YOU ! TAMMY KANE   *AK",
        "vin": "1P4GP44R2TB"
    }
]