[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/22/2004",
        "dateOfIncident": "08/09/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096214,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "RX-8",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A MAZDA RX8 6 SPEED (5/11/04).  THIS CAR HAS HAD MORE PROBLEMS THAN I CAN EXPLAIN IN A SHORT MESSAGE. ABOUT A MONTH AFTER PURCHASING THE VEHICLE IT WOULDN'T START ONE MORNING.  I LATER GOT IT STARTED AND TOOK IT IN TO THE DEALER.  THEY DID A FLASH UPDATE ON MY PCM AND EVERYTHING WAS FINE AFTER THAT. APPROXIMATELY THREE MONTHS LATER I BEGAN HAVING TROUBLE WITH MY TRANSMISSION. I WAS ON VACATION IN CARLISLE, AR WHEN THE CAR BROKE DOWN THE FIRST TIME (8/9/2004).  MY CAR WAS TOWED IN TO NORTH POINT MAZDA IN NORTH LITTLE ROCK, THEN GOT TOWED TO CRAIN MAZDA IN LITTLE ROCK, WITHOUT EVEN INFORMING ME.  AFTER REPLACING APPROXIMATELY 87 PARTS IN THE TRANSMISSION, I GOT MY CAR BACK 40 DAYS LATER (9/18/2004).  IMMEDIATELY AFTER DRIVING THE VEHICLE I KNEW IT WASN\u0019T RIGHT.  IT WAS MAKING NOISES, WOULDN\u0019T SHIFT IN TO 2ND, 3RD OR REVERSE WITHOUT GRINDING.  I TOOK MY CAR TO TOWN NORTH MAZDA IN RICHARDSON AS SOON AS I GOT A CHANCE (9/27/2004).  I WAS TOLD \"2ND AND 3RD GEARS ARE FRIED\" AND THEY WOULD REPLACE THE TRANSMISSION AND CLUTCH. AFTER REPLACING THE CLUTCH AND TRANSMISSION I GOT THE CAR BACK 11 DAYS LATER (10/7/2004).  I KNEW THE CAR STILL HAD A PROBLEM SO I SCHEDULED TO HAVE THE CAR TAKEN BACK IN ON 10/12/2004.  I DROVE ABOUT 2 MILES FROM THE HOUSE ON THE WAY TO THE DEALER WHEN IT WENT OUT AGAIN.  THE CAR STILL TO THIS DAY REMAINS IN THE SHOP AGAIN.  MY CAR HAS BEEN IN FOR REPAIRS FOR 58 DAYS SINCE 8/9/2004.  I GOT A CALL ON 10/20/04 FROM THE DEALERSHIP THAT HAS MY CAR.  THEY TOLD ME MAZDA DECLINES COVERAGE BECUASE OF NEGLECT OR ABUSE.  I ABSOLUTELY \"BABIED\" THAT CAR BECAUSE I KNEW IT WASN'T RIGHT! ANY SUGGESTIONS?*AK",
        "vin": "JM1FE173340"
    }
]