[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126914,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "CHEROKEE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2001 JEEP CHEROKEE SPORT IN NOVEMBER, 2004.  IN THE PAST 3 MONTHS, I EXPERIENCED A SEVERE SHAKING OF THE VEHICLE; MOST OFTEN AFTER HITTING A SMALL BUMP IN THE ROAD.  IT WAS EXTREMELY DIFFICULT TO GET THE VEHICLE UNDER CONTROL.  TOOK IT TO DEALERSHIP WHERE PURCHASED AND WAS TOLD THERE WAS NOTHING WRONG WITH IT.  KEPT HAPPENING, AT SPEEDS OF 35-45 MPH.  DIAGNOSED AT BELLE TIRE AS A BAD TRACK BAR.TOOK IIT TO ANOTHER JEEP DEALERSHIP; TRACK BAR LOWER CONTROL ARMS REPLACED.  SAID PROBLEM WAS FIXED BUT 2 DAYS LATER, WHILE  ON FREEWAY (65 MPH) IN  RIGHT-HAND LANE, EXTREMELY VIOLENT SHAKING OCCURRED.  I BARELY GOT THE CAR TO THE SIDE, BECAUSE THE STEERING WASS UNCONTROLLABLE.   I HAVE NO DOUBT THAT HAD I BEEN IN ANY BUT THE RIGHT HAND LANE, I WOULD HAVE HIT ANOTHER CAR.  I WAS ABLE TO RE-ENTER THE RIGHT HAND LANE BUT KEPT MY SPEED AT 35 MPH AND EXITED IMMEDIATELY.  CAR WENT BACK TO THE DEALER WHO SAID THEY DIDN'T KNOW WHAT WAS WRONG WITH IT.  THEY SAID IT COULD BE CAUSED BY 10-15 DIFFERENT THINGS AND THE ONLY WAY TO FIX IT WOULD BE TO REPLACE EVERYTHING, STARTING WITH STEERING DAMPNER (NOT COVERED UNDER WARRANTY) BUT HAD NO IDEA IF THAT WOULD FIX IT.  I HAVE ONLY OWNED THE CAR FOR 6 MONTHS AND HAVE ALREADY SPENT ALMOST $1,000 ON TRYING TO HAVE IT FIXED (INCLUDING NEW TIRES AND A WHEEL ALIGNMENT).  THE DEALER WAS COMPLETELY INDIFFERENT TO THE PROBLEM.  THE SERVICE DIRECTOR SAID IT WOULD COST ME A LOT OF MONEY TO HAVE EVERYTHING REPLACED, AND EVEN THEN, COULD NOT GUARANTEE THE PROBLEM WOULD BE FIXED.  NEEDLESS TO SAY, THESE EXPERIENCES, ESPECIALLY THE ONE ON THE FREEWAY, WHICH I WOULD RATE A 10 ON A SCALE OF 1-10 (THE OTHERS RANGING FROM 1-4), HAVE SHAKEN ME TO THE VERY CORE; I COULD HAVE BEEN KILLED.  I CAN NEVER AGAIN DRIVE THAT CAR AND FEEL SAFE, ESPECIALLY WHEN THE DEALER HAS NO IDEA WHAT THE PROBLEM IS OR HOW TO FIX IT.  I CHECKED THE INTERNET AND FOUND 38,000 WEBSITES DEALING WITH THIS PROBLEM; PREVALENT IN JEEPS.  THE PROBLEM IS APTLY DUBBED \"DEATH WOBBLE\".",
        "vin": "1J4FF48SX1L"
    }
]