[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2005",
        "dateOfIncident": "06/02/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126614,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS BACK MY CAR'S CHECK ENGINE LIGHT CAME ONE (THIS WAS WHEN THE MILEAGE WAS AROUND 40,500). SINCE IT WAS OUT OF WARRANTY SO I TOOK IT TO A AAA CERTIFIED REPAIR  SHOP FOR INVESTIGATION. I LATER CAME TO KNOW THAT THE ENGINE LIGHT WAS DUE TO CHARCOAL CANISTER FAILURE. SINCE THE CHARCOAL CANISTER CAN ONLY BE OBTAINED FROM THE DEALER SO I LATER INQUIRED ABOUT THE REPAIR COST. THE TOTAL REPAIR ESTIMATE WAS TOLD TO ME AROUND $480 WHICH PROMPTED ME TO SEARCH THE WEB ABOUT SIMILAR REPAIR ISSUES. I CAME ACROSS SEVERAL SIMILAR COMPLAINTS RELATED TO CHARCOAL CANISTER FOR MANY TOYOTA VEHICLES.    I HAVE ALWAYS TAKEN THE CAR TO THE LOCAL TOYOTA DEALER FOR REGULAR OIL-CHANGES,ETC. I WAS ALARMED THAT SUCH AN IMPORTANT PART OF THE CAR WOULD FAIL JUST A COUPLE THOUSAND MILES AFTER THE WARRANTY EXPIRATION. SO I CALLED THE TOYOTA ASSISTANCE AT 800-331-4331 ON 6/3/2005 (REFERENCE # [XXX]). I WAS TOLD THAT THE DEALER WOULD CONTACT ME SOME TIME WITHIN THE NEXT 3-4 DAYS BUT THAT NEVER HAPPENED. UPON CALLING THE TOYOTA ASSISTANCE CENTER TODAY AGAIN (6/16/05) I CAME TO KNOW THAT THE DEALER HAD NEVER BOTHERED CALLING ME AND HAD INSTEAD JUST LEFT A NOTIFICATION IN THE ELECTRONIC SYSTEM THAT THE REGIONAL CENTER HAD REFUSED TO PROVIDE ANY INFORMATION IN THIS REGARD.     MY OTHER CAR IN THE HOUSEHOLD IS AROUND 70,000 MI AND IT HAD NEVER HAD ANY SUCH PROBLEM. I WOULD APPRECIATE IF THE TOYOTA LOOKS INTO THE CHARCOAL CANISTER FAILURE ISSUES MORE SERIOUSLY AND PROVIDES RELIEF IN THAT REGARD. A PART OF SUCH IMPORTANCE AND COST SHOULD NOT FAIL WITHIN SUCH LOW MILES.     I HAVE CONTACTED THE WISCONSIN DEPARTMENT OF AGRICULTURAL,TRADE AND CONSUMER PROTECTION IN THIS REGARD AS WELL.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1NXBR12E72Z"
    }
]