[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2005",
        "dateOfIncident": "07/30/2005",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131814,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "320",
                "productYear": "1994",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS HAD INTERMITTENT ELECTRICAL PROBLEMS FOR AWHILE, BUT NONE OF THEM VERY SERIOUS. FOLLOWING RECENT SCHEDULED MAINTENANCE, THE ENGINE DEVELOPED A FAILED SPARK PROBLEM. AFTER REPLACING PLUG WIRES AND CONNECTORS AND A COIL ASSEMBLY ATTEMPTING TO RESOLVE THE PROBLEM, IT WAS OBSERVED THAT THE WIRING FEEDING THE FRONT COIL ASSEMBLY HAD LOST THE INSULATION AND WAS SHORTED OUT. UPON FURTHER INSPECTION, THE WIRING TO THE OTHER COIL ASSEMBLIES ALSO EXHIBITED THE SAME PROBLEM. THE WIRING WAS TRACED BACK TO WHERE IT JOINED UP WITH THE REST OF THE HARNESS, AND IT WAS FOUND TO HAVE BRITTLE, CRACKED OR MISSING INSULATION EVERYWHERE IT WAS CHECKED. UPON DOING RESEARCH ON THE INTERNET, I FOUND THIS IS A VERY COMMON PROBLEM AND FOUND OTHER VERY SIMILAR COMPLAINTS ON THE NHTSA WEBSITE AS WELL. IN CHECKING THE COST OF THE PART FROM THE LOCAL DEALER, I FOUND THAT THEY HAD ONE IN STOCK (A SIGN THAT THEY MUST REPLACE QUITE A FEW OF THESE) AND THE PRICE FOR THE NEEDED PART WAS $1033, THIS DIDN'T INCLUDE LABOR WHICH WAS ESTIMATED AT 5 HOURS. I AM PURSUING THE LEAST EXPENSIVE OPTION FOR SUITABLE REPAIR, BUT I AM EXPECTING NEARLY A $1500 REPAIR COST. I HAVE OWNED MANY VEHICLES IN EXCESS OF 10 YEARS OF AGE, AND THIS IS THE MOST CATASTROPHIC WIRING FAILURE I HAVE SEEN. I SHOULD CONSIDER MYSELF LUCKY THAT THIS PROBLEM DIDN'T MANIFEST ITSELF WITH A MORE SERIOUS PROBLEM SUCH AS A FAILURE AT HIGHWAY SPEEDS OR AN ENGINE FIRE, WHICH UNDER THE CIRCUMSTANCES SEEMED QUITE LIKELY. I WILL SAVE THE WIRING HARNESS FOLLOWING REPLACEMENT SHOULD IT BE NEEDED FOR FUTURE REFERENCE.  *JB",
        "vin": "WDBEA92E8RF"
    }
]