[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/19/2005",
        "dateOfIncident": "09/13/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 FORD EXPLORER WITH 52,000 MILES. I HAVE AN EXTENDED WARRANTY THROUGH FORD ESP. IN AUGUST, A SPARK PLUG BLEW OUT OF THE LEFT HEAD. THE VEHICLE WAS TOWED BACK TO THE DEALER FOR REPAIR. THE DEALER AUTHORIZED WARRANTY WORK THAT WOULD REPLACE THE HEAD ON THE LEFT SIDE. I HAD THE VEHICLE BACK FOR 2 WEEKS AND THE SAME THING HAPPENED ON THE RIGHT HEAD. I TOOK THE VEHICLE IN AND THE DEALER SAID THAT THEY WOULD NOT COVER THE FAULT. THEIR REASON IS THAT THERE WERE AUTOLITE SPARK PLUGS IN THE VEHICLE INSTEAD OF MOTORCRAFT SPARK PLUGS. I WAS TOLD THAT THEY DID THE PREVIOUS REPAIR WITHOUT REALIZING THAT. FURTHERMORE, THEY ONLY REPLACED THE ONE PLUG ORIGINALLY THAT BLEW OUT, RE-USING THE OTHER 3 PLUGS (AUTOLITES) THAT WERE IN THE VEHICLE. I HAVE TALKED WITH FORD IN MICHIGAN AND THEY ARE LOOKING INTO IT. FIRST, THE FACT THAT THEY ARE NOT HONORING THE EXTENDED WARRANTY BECAUSE OF SPARK PLUG BRAND IS SOMETHING I CANNOT FIND WRITTEN ANYWHERE. SECOND, IF THOSE PLUGS ARE SO BAD, THEN ARE THEY NEGLIGENT IN PUTTING THOSE PLUGS BACK IN. THIRD, THE FACT THAT THIS HAPPENED AND COULD HAVE PIERCED A FUEL LINE IS VERY HAZARDOUS. MY WIFE WAS DRIVING THE VEHICLE FOR HALF DAY TRIP IN A DESOLATE AREA. SHOULD SOMETHING LIKE THIS HAVE HAPPENED WHILE SHE WAS OUT THERE, IT WOULD HAVE BEEN HORRIBLE. DOES FORD HAVE THE RIGHT TO DENY COVERAGE WITH EXTENDED WARRANTY FOR THIS REASON? IS IT NEGLIGENT ON FORD'S PART TO SIMPLY TELL ME AFTER THE FACT THAT THE PLUGS THAT ARE IN THERE ARE NON-STANDARD AND THAT THEY WOULD NOT COVER THE WORK?*JB",
        "vin": "1FMZU73W22Z"
    }
]