[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/13/2005",
        "dateOfIncident": "08/06/2005",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139614,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT PURCHASED A 1992 TIGER CX MADE BY PROVAN INDUSTRIES.  WHILE DRIVING THERE WAS A SWAY IN THE REAR SUSPENSION AT 60 MPH OR BY STRIKING BUMPS IN THE ROAD.  THE CONTACT THOUGHT THAT THIS WAS CAUSED BY POOR TIRES, AND THE REPAIR SHOP REPLACED THE TIRES AND SHOCKS, AND ADDED AN AIR SUSPENSION SYSTEM .  ALL OF THESE CORRECTIONS DID NOT SOLVE  THE PROBLEM.  AGAIN WHILE DRIVING AT 60 MPH OR HITTING BUMPS THE REAR OF THE VEHICLE SWAYED TO THE LEFT OR RIGHT, DEPENDING ON THE DIRECTION.  THE VEHICLE WAS TAKEN BACK TO  THE  REPAIR SHOP TO INSPECT THE SUSPENSION.  THE REPAIR SHOP COULD NOT DETERMINE THAT THERE WAS ANYTHING MECHANICALLY WRONG.  THE CONTACT  WAS REFERRED TO  OWNERS MANUAL INFORMATION PAGE WHICH STATED THAT  GROSS WEIGHT RATIO OF THE FOUR WHEEL DRIVE HAD A LIMIT OF 8600 POUNDS, AND THE TWO WHEEL DRIVE HAD A LIMIT OF 7200 POUNDS.  THIS VEHICLE WAS A FOUR WHEEL DRIVE.  THE CONTACT CONTACTED THE MANUFACTURER, WHO SAID THEY HAD NO SUCH PROBLEMS.  THE MECHANIC SUGGESTED THAT THE CONTACT TAKE THE VEHICLE TO A TRUCK SCALE AND WEIGH IT.   THE CONTACT TOOK THE  VEHICLE TO  A TRUCK SCALES AND WEIGHED IT,  THE TOTAL WEIGHT WAS  7080 POUNDS WITH FUEL IN THE TRUCK.  THE CONTACT CALLED CHEVROLET BECAUSE   THE CHASSIS WAS MADE BY CHEVROLET.  CHEVROLET PROVIDED A GROSS WEIGHT LIMIT OF 7200 POUNDS AFTER THE CONTACT GAVE THE VIN OF THE VEHICLE. *AK",
        "vin": "1GCFK24K5NE"
    }
]