[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2005",
        "dateOfIncident": "07/27/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "LS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE MONTH OF JULY 2005, WHILE DRIVING MY 2001 SATURN L300, I NOTICED STRONG GASOLINE FUMES ENTERING THE INTERIOR OF THE CAR AND ALSO ON THE EXTERIOR. THE MILEAGE HAD DROPPED DRASTICALLY AND I WAS USING HALF TANK OF FUEL TO DRIVE 120 MILES. THINKING IT COULD BE A TORN OR LOOSE FUEL LINE, I TOOK IT TO MY MECHANIC OF TRUST FOR AN INSPECTION. HE FOUND THE FUEL TANK LEAKING AND ADVISED ME TO REPLACE IT. I CONSENTED BECAUSE I NEEDED THE CAR TO COMMUTE TO WORK IN TAMPA ON A DAILY BASIS. HE REMOVED THE TANK AND FOUND THE FUEL PUMP MODULE CRACKED AND NEEDED REPLACEMENT. AGAIN I CONSENTED TO REPAIRING THE VEHICLE. MY WIFE CALLED MITSUBISHI MOTORS OF HERNANDO, WHERE I HAD PURCHASE THE VEHICLE AND REPORTED THE PROBLEM. SHE WAS TOLD THAT WE NEEDED TO CONTACT SATURN OF PORT RICHEY DEALER. I CALLED THAT DEALER AND EXPLAINED THE PROBLEM AND WAS REFERRED TO GM SATURN (1-800-553-6000) AND SPOKE TO MARY FROM CUSTOMER SERVICE. I TOLD HER THAT I HAD INFORMATION ON A RECALL FOR THE SATURN FOR THAT PARTICULAR PROBLEM. I EVEN READ HER THE CAMPAIGN NUMBER AND THE DATE (00V309000 - 2000 OCT 12). SHE PUT ME ON HOLD AND AFTER A FEW MINUTES SHE TOLD ME THAT SHE COULD NOT FIND ANY RECALL FOR THAT MODEL BUT SHE WOULD CHECK AND CALL ME BACK WHEN SHE DID FIND IT. SHE HAS NOT DONE SO TO THIS DATE.  THE REPAIRS (REPLACEMENTS, PARTS, AND LABOR TOTALED $1,010.71. I AM SENDING THE NHTSA COPIES OF THE RECALLS AND THE REPAIR ESTIMATES. I WOULD LIKE FOR GM SATURN TO REIMBURSE ME FOR THE UNNECESSARY EXPENSES INCURRED DUE TO THE FAILURE OF THE FUEL TANK AND FUEL PUMP ASSEMBLY. *JB",
        "vin": "1G8JW52R81Y"
    }
]