[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/16/2005",
        "dateOfIncident": "07/04/2005",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136814,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "RODEO SPORT",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2001 ISUZU RODEO SPORT AT QUALITY ONE AUTOS ON 03/05/2005. I BOUGHT THE CAR WITH NO WARRANTY BECAUSE I WAS TOLD THAT THE CAR WAS FINE. THE CHECK ENGINE LIGHT WAS ON BUT THEY PROMISED TO REPAIR THAT IN WHICH THEY DID. BUT IT WAS REPAIRED A MONTH AND A HALF LATER WHICH RESULTED IN ME GETTING A TICKET FOR DRIVING WITH NO TAG BECAUSE I STILL HAD THE TEMPORARY TAG AFTER 30 DAYS. I WENT THROUGH 3 TEMPORARY TAGS. IT TOOK AWHILE FOR THE DEALERSHIP TO PURCHASE THE PART TO TAKE CARE OF THE CHECK ENGINE LIGHT. I CALLED UP THERE EVERY WEEK TRYING TO GET MY CAR FIXED AND THEY ALWAYS TOLD ME THAT THEY HAD TO FIND THE PART AND THEN IT WENT TO WE ORDERED THE PART AND WE WILL CALL YOU WHEN WE GET IT. SO FINALLY MY DAD AND I WENT UP THERE BECAUSE THEY DID CALL ME AND TOLD ME THAT THE PART CAME IN AND WHEN I GOT HALF WAY UP THERE THEY TOLD ME THAT THEY DIDN'T HAVE IT. SO MY DAD AND I WENT TO THE DEALERSHIP AND THE GUY HADN'T ORDERED THE PART SO WE SAT THERE WHILE HE ORDERED THE PART IN FRONT OF US. AROUND 7/05 MY CAR STARTED TO CUT OFF WHILE I WAS DRIVING AND ALSO WHEN I WAS IDLE IT WOULD STALL AND CUT OFF SEVERAL TIMES AND THE CHECK ENGINE LIGHT WOULD COME ON. THIS WOULD HAPPEN 5-10 TIMES A DAY. I ALMOST GOT INTO A ACCIDENT MULTIPLE TIMES SO I AM SCARED TO DRIVE IT NOW. SO I TOOK IT TO THE ISUZU DEALERSHIP FOR THEM TO LOOK IT AND THEY TOLD ME THAT THE WIRES WERE CROSSED AND THEY CORRECTED THE PROBLEM BUT AS SOON AS I GOT HOME IT CUT OFF AGAIN. I CALLED THE DEALERSHIP AND THEY TOLD ME TO BRING THE CAR BACK AND NOW THEY ARE TELLING ME THAT THE PCM WENT OUT AND IT WILL COST ME $900.00 TO FIX. I WENT ONLINE TO SEE IF THERE WERE OTHER CONSUMERS THAT WERE HAVING OR HAD THE SAME PROBLEMS I AM EXPERIENCING. DATING FROM 94-04 THERE ARE MULTIPLE COMPLAINTS WHICH I HAVE PRINTED OUT ABOUT THE SAME PROBLEMS. ALSO THE KEY STICKS IN THE IGNITION AND SOMETIMES IT WONT COME OUT AND THERE ARE ALSO COMPLAINTS ABOUT THAT.   *NM",
        "vin": "4S2CK57W414"
    }
]