[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/16/2005",
        "dateOfIncident": "09/14/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "MAGNUM",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 5 MONTH OLD DODGE MAGNUM RT WITH 20K MILES. THE TIRES NEED REPLACING AND ARE DOWN TO THE WEAR BARS. THE TIRE MANUFACTURER AND CHRYSLER ARE BLAMING EACH OTHER. THE CAR HAS A NOTED ALIGNMENT PROBLEM, WHICH CHRYSLER FAILS TO ADDRESS. I HAVE COLLECTED MANY POST FROM WEBSITES WITH PEOPLE HAVING THE SAME PROBLEMS. JUST TRYING TO BE PROACTIVE BEFORE SOMETHING BAD HAPPENS.     2005 DODGE MAGNUM | SERVICE BULLETIN NUMBER: 0200304  DATE OF BULLETIN: 20040525  CODE OF FAILING COMPONENT: 020000 SUSPENSION  VEHICLE LEADS TO THE RIGHT. *TT   005 DODGE MAGNUM | SERVICE BULLETIN NUMBER: 0200304  DATE OF BULLETIN: 20050312  CODE OF FAILING COMPONENT: 020000 SUSPENSION  RIGHT LEAD/REVISED ALIGNMENT SPECIFICATIONS. 2005-2006 CHRYSLER 300/CHARGER/MAGNUM. *SC   2005 DODGE MAGNUM | SERVICE BULLETIN NUMBER: 0200404  DATE OF BULLETIN: 20040615  CODE OF FAILING COMPONENT: 020000 SUSPENSION  SUSPENSION/TOWING/LIFTING DAMAGE. *TT     #1531 OF 1572  RE: ANYONE ELSE NOTICE THIS PROBLEM WITH THEIR MAGNUM RT? [ALXS] BY TURBINEBEN   AUG 29, 2005 (2:46 PM)   BOOKMARK | REPLY | E-MAIL MSG   REPLYING TO: ALXS (AUG 22, 2005 9:49 AM)  I HAVE A 2005 MAGNUM WITH 4000 MILES ON IT, AND HAVE BEEN EXPERIENCING THE SAME ISSUES. I HAVE BEEN BACK TO THE DEALERSHIP MANY TIMES, THREE FOR THE TIRES BEING WAY OUT OF BALANCE WHEN THE CAR WAS DELIVERED. TWO TIMES FOR ALIGNMENT ISSUES, WHICH HAVE NOW BEEN CORRECTED AND THE CAR TRACKS STRAIGHT. THREE TIMES FOR A POPPING SOUND COMING FROM THE RIGHT FRONT DASH AREA, NEAR THE SPEAKER....THEY HAVE REPLACED THAT FRONT DASH PIECE, BUT THE PROBLEM STILL HAPPENS. EVERYTHING ELSE IS GREAT WITH THE CAR. I JUST NEED TO GET THE POPPING SOUND FIXED SOMEHOW. IT SOUNDS TO ME LIKE TI IS ONE OF THE MANY PLASTIC SNAPPY THINGS THAT DODGE USES TO HOLD THE INTERIOR TOGETHER, BUT I AM NOT SURE.  *JB",
        "vin": "2D8GV58225H"
    }
]