[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "04/08/2004",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137614,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "MALLARD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I BOUGHT A 2003 MALLARD 30E TRAILER IN JULY 2003.  NEXT APRIL, 2004, WENT OUT TO PREPARE TRAILER FOR SEASON, FOUND SOAKED FLOOR AND SLIDE OUT INOPERATIVE.  WENT TO DEALER TO REPAIR LEAKS ON SLIDE OUT. DEALER CALLS 2 WEEKS LATER AND TELLS ME \"YOUR FRAME IS BENT\" I GO AND INSPECT THE FRAME AND IT HAS COLLAPSED (TWISTED)SIDEWAYS AT THE SPRINGS ON THE LEFT FRAME  BEAM, AND THAT BEAM HAD A SEVERE BOW FORE AND AFT.  WHEELS AND AXLES WERE SHIFTED OVER ABOUT 5 INCHES.  NO SIGNS OF SCUFFING ON TIRES OR RIMS.  THE TRAILER WAS TOO DANGEROUS TO CONTINUE TO USE, AS FURTHER COLLAPSE WOULD MOST ASSUREDLY OCCURRED.   THE FRAME MANUFACTURER, LIPPERT,  SENT A TEAM TO REPAIR IT IN PLACE UNDER WARRANTY. LIPPERT DID NOT REPLACE THE FRAME OR THE H BEAM, THEY BENT THE FRAME BACK INTO POSITION. THEY CERTIFIED IT.  THIRD YEAR 7/2004 -CURRENT  FINALLY CONVINCED THE WIFE TO GO FOR A WEEKEND AUGUST 5TH 2005.   AFTER UN-HITCHING THE TRAILER AT CAMPSITE, FOUND FRAME BOWED AGAIN. CAREFULLY TOWED THE TRAILER BACK TO DEALER SLOWLY.  TRAILER WENT TO DEALER ON AUGUST 8TH, 2005, AND THE FLOOR, FRAME, AND BOX WERE INSPECTED BY ME AND THE SERVICE MANAGER.  NO OTHER VISIBLE SIGNS OF DAMAGE WERE EVIDENT.    UPDATE 9/20/05 I WENT TO THE DEALER TO SEE THE TRAILER YESTERDAY TO CHECK ON THE TRAILER AND TO PULL THE BATTERIES.  THERE IS NOW A 1/2\" STEP ABOVE THE AXLES AT THE FLOOR WHERE THE SUBFLOOR HAS BROKEN ALONG A SEAM THE ENTIRE WIDTH OF THE TRAILER.    THIS INDICATES THAT THE BOX IS SEPARATING AND COULD COME APART ON THE HIGHWAY.  IF IT WAS NOT CAUGHT, , THE TRAILER FRAME COULD CONTINUE THE COLLAPSE, AND EITHER CAUSE THE WHEELS TO GO SO FAR OUT OF ALIGNMENT AS TO THROW THE TRAILER SIDEWAYS, OR CAUSE THE ENTIRE BOX TO DISINTEGRATE WHILE TRAVELING.  EITHER SITUATION WOULD PRESENT SEVERE DANGER TO MY OCCUPANTS AND ANY OTHER VEHICLE IN RANGE.  I BELIEVE THAT THIS WAS CAUSED BY EITHER TOO LIGHT A DESIGN OF THE FRAME FOR ITS INTENDED USE, POOR METALLURGY OF THE FRAME, OR BOTH. *JB",
        "vin": "1EF1E302132"
    }
]