[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134814,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "RSX",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SUSPENSION SAFETY DEFECTS.  NEW 2005 ACURA RSX REQUIRED  FRONT STRUT ASSEMBLY REPLACEMENTS DUE TO CLUNKING NOISE WHEN TURNING AT SLOW SPEEDS.  STRUT ASSEMBLIES BOTH ON BACK ORDER, TAKING THREE (3) WEEKS FOR REPAIRS.   AMERICAN HONDA MOTORS CO., INC., ORIGINALLY CLAIMED THAT \"THE FIX\" FOR THE PROBLEM, (\"NOT A SAFETY ISSUE\") WAS TO APPLY A \"SPECIAL LUBRICANT\" COMING FROM JAPAN, AS DETERMINED BY \"OUR ENGINEERS.\"  TEN (10) DAYS LATER, HONDA SAYS THAT THE \"SPECIAL LUBRICANT\" WAS NOT \"THE FIX\" BUT THAT \"SHAVING DOWN THE LOWER SPRINGS WAS \"THE FIX.\"  WITHIN AN HOUR, AMERICAN HONDA MOTORS CO., INC., BY ITS LEGAL TEAM, CLAIMED THAT \"SHAVING DOWN\" THE SPRINGS WAS \"NOT ENTIRELY ACCURATE\" FOR THE CURRENT FIX, BUT RATHER THEY WOULD \"TWEAK\" THE SUSPENSION.  NO FURTHER DESCRIPTION OF THIS \"TWEAKING\" WAS PROVIDED.  FINALLY, AFTER DECIDING NOT TO REPURCHASE THE CAR WITH DEFECTIVE STRUT ASSEMBLIES, HONDA CLAIMS THAT ITS ENGINEERS HAVE DETERMINED THAT THE STRUTS WERE BENT IN SHIPPING.  THE CURRENT \"FIX\" IS TO BEND THE STRUT IN THE OPPOSITE DIRECTION, I.E., AWAY FROM THE SPRING, AND THAT ALL WILL BE WELL.  NO CONSIDERATION WAS GIVEN TO ANY METALLURGICAL DEFECTS FROM BENDING THE STEEL IN OPPOSITE DIRECTION, NOR ON ANY OTHER PART OF THE SUSPENSION SYSTEM AS A RESULT OF THIS \"TWEAKING.\"   THE IDENTICAL SUSPENSION DEFECTS HAVE BEEN REPORTED TO THIS WEBSITE AS EARLY AS APRIL 6, 2005, AND TO VARIOUS ACURA DEALERS IN THE WASHINGTON METROPOLITAN AREA.  A SINGLE DEALER REPLACED STRUTS ON FOUR (4) 2005 RSX CARS.  MOREOVER, HONDA HAS KNOWN ABOUT THE DEFECT AT LEAST SINCE MID-JULY, 2005, IF NOT BEFORE, YET REFUSES TO REPLACE THE CAR OR TO DEFINITIVELY DETERMINE THE PRECISE PROBLEM AND A UNIFORM AND PROPER CORRECTION SINCE THE REPLACEMENT STRUTS HAVE THE SAME DEFECT AS THOSE INSTALLED ORIGINALLY.   INDEED,  HONDA ADMITS THAT ALL 2005 RSX BASE MODEL CARS HAVE THE PROBLEM BECAUSE A NEW STRUT SUPPLIER HAS BEEN PROVIDING THE STRUTS AND SPRINGS THAN HAS DONE SO PREVIOUSLY.  *JB",
        "vin": "JH4DC53825S"
    }
]