[
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/31/2005",
        "dateOfIncident": "07/30/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10131514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING OUR 2004 MERCURY GRAND MARQUIS (PRE-CERTIFIED, BOUGHT OFF THE SHOWROOM FLOOR AUGUST 2004); OUR THREE TEENAGE FOSTER CARE CHILDREN AND I WERE PASSENGERS.  OUR MARQUIS ENTERED THE PARKING LOT OF CONVENIENCE STORE SO THAT WE COULD INSTALL AIR IN LEFT FRONT TIRE. WE DID A U-TURN IN PARKING LOT TO PROCEED TO AIR COMPRESSOR.  WITH HER RIGHT FOOT ON BRAKE PEDAL, MY WIFE STEERED THE CAR THROUGH THE U-TURN, HEADING TOWARD AIR COMPRESSOR.  SUDDENLY, WITHOUT ANY WARNING, THE CAR ACCELERATED UNCONTROLLABLY.  THE BRAKE WOULD NOT WORK - BRAKE PEDAL WAS PUSHED ALL THE WAY DOWN; CAR CONTINUED TO ACCELERATE AND TRAVELED OVER A LARGE CONCRETE BARRIER AND CRASHED INTO BUILDING.  THE CAR COULD NOT BE STEERED WHILE CAR SPED FORWARD.  THE AIR BAGS DID NOT DEPLOY. WE WERE WEARING OUR SEAT BELTS AND SHOULDER HARNESSES.  THANKFULLY, THE AUTO HIT THE BUILDING INSTEAD OF THE GASOLINE PUMPS IN PARKING LOT.  AFTER CRASHING INTO BUILDING, THE ENGINE CONTINUED TO ACCELERATE OR \"REV\" AT HIGH RATE. A LADY WHO WAS PUMPING GAS INTO HER CAR RUSHED OVER TO ASSIST US. SHE INSISTED THAT MY WIFE KEEP HER FOOT ON BRAKE PEDAL AND ASSISTED IN GETTING THE DRIVER'S DOOR OPEN AND INSTRUCTING FOR MY WIFE TO AVERT HER FACE AND INCH OVER IN SEAT TOWARD DOOR AFTER RELEASING THE SHOULDER HARNESS/SEAT BELT.  I WAS ABLE TO GET THE CAR IN PARK AND TURN IGNITION OFF. MY WIFE WAS TRANSPORTED BY AMBULANCE TO ER FOR TREATMENT OF INJURIES.  HIGHWAY PATROL OFFICER MADE ACCIDENT REPORT.  AUTO WAS TOWED TO PRIVATE REPAIR FACILITY FOR EVALUATION.  *NM  *NM",
        "vin": "2MEFM75W24X"
    }
]