[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2005",
        "dateOfIncident": "08/07/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10132714,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "1) WE PURCHASED A 2004 FORD MUSTANG CONVERTIBLE. THE VEHICLE WAS PARKED IN OUR GARAGE.  THE EXHAUST TAIL PIPE HAS A POOR DESIGN DUE TO THE DESIGN CUT ON THE END WHICH LEAVES TWO SHARP POINTED EDGES LIKE THE END OF KNIVES.  THE POINTS ARE LOCATED APPROXIMATELY 1 INCH PAST THE BUMPER.  ALL OTHER VEHICLES WE HAVE SEEN HAVE ROUNDING TAIL PIPE ENDS AND THE ENDS ARE FLUSH WITH THE BUMPER OR UNDER THE VEHICLE.  2) THE FAILURE OF THE DESIGN OF THE EXHAUST TAIL PIPE  WITH THE SHARP RAZOR CUTS LEAVING TWO POINTED KNIFE LIKE ENDS AND PLACED PAST THE BUMPER IN THE MANUFACTURING PROCESS RESULTED IN MY THREE YEAR OLD HAVING A MASSIVE UPPER ARM INJURY REQUIRING SURGERY AFTER FALLING BEHIND THE 2004 FORD MUSTANG.  AS HE FELL HIS RIGHT SHOULDER SLID DOWN PAST THE BUMPER AND THE POINTED SHARP EDGE STICKING PAST THE END OF THE BUMPER TORE INTO HIS ARM ABOVE THE ELBOW TO THE VERY TOP OF HIS SHOULDER.  THE INJURY REQUIRED MANY HOURS OF SURGERY AND WE HOPE NO OTHER CHILD WILL HAVE TO GO THROUGH THIS MEANINGLESS DESIGN FLAW BY FORD MOTOR COMPANY AND THEIR OEM MANUFACTURE 3) WE HAVE TRIED TO CORRECT THE PROBLEM BY ASKING THE FORD DEALER FOR ASSISTANCE WHICH WAS REFUSED AND REPORTED THE INJURY TO FORD EXECUTIVE OFFICES IN MICHIGAN.  DUE TO NON-RESPONSE BY FORD WE HAVE PLACED A NORMAL SAFE ROUNDED TAIL PIPE EXTENSION ON THE VEHICLE.  THE ROUNDING TAIL PIPE IS USED IN ALL OTHER VEHICLES THAT WE HAVE SEEN.  THE EXHAUST TAIL PIPE HAS NOT BEEN RECALLED AT THIS TIME ON THE FORD MUSTANGS FOR 2004 AND 2005 WHICH ARE THE SAME DESIGN AND PLACEMENT. *JB",
        "vin": "1FAFP44664F"
    }
]