[
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,VISIBILITY,LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/18/2005",
        "dateOfIncident": "07/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143114,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PROBLEM.  AT ABOUT 2000 TO 3000 MILES BREAKS STARTS TO SQUEAL AND GRIND.  TOOK IT IN TO SERVICE AT DEALER COMPLAINING ABOUT PROBLEM, AS IT GOT WORSE AND WAS NOT NORMAL IN 6,000 MILES.  WAS TOLD NO PROBLEM, ROUTINE BREAK IN.  THEN AT 12,000 MILES STILL A PROBLEM.  WENT TO ANOTHER DEALER, SAID THE SAME THING.  NOW WITH NEARLY 18,000 MILES, ROTORS ARE GROOVED VERY BAD.  EVIDENCE AND WARNING WAS EVIDENT IN THE EARLIER MILES AS WELL.  FORD HAS DONE NOTHING TO HELP.  I FEEL THEY OWE ME A NEW PAIR OF ROTORS AND PADS. ALSO, COMPLAINED OF CLUTCH NOISE PROBLEM.  I HAVE HEARD OF A TSB CLAIMING CERTAIN 2004 FOCUS HAVE A TRANSAXLE MISALIGNMENT CAUSING PRE-MATURE CLUTCH WEAR AND NOISE.  WIPER SWITCH HAS BEEN REPLACED BY RC LACY FORD, BETTER SERVICE, BUT THEY WON'T SERVICE ME ANYMORE, SINCE I DID NOT BUY IT THERE, AND RAVENA IS SO CLOSE.  I NEED TO CONTACT CROSSROADS ABOUT ALL FUTURE WARRANTY ISSUES AND COMPLAINTS. DOORS IN THE REAR ALSO STICK, AND WEAR OF DOOR STRIKER IS EVIDENT.  TIRES HAVE ALSO BEEN WORN PRETTY BAD PIRELLI 195/60 R15.  BACK PAIR ARE TOTALLY BALD, AND ONLY HAVE HAD LIKE 18,000 MILES, I THINK IT WAS A ALIGNMENT ISSUE, WHICH FOR A CAR 17 MONTHS OLD SHOULD NOT BE AN ISSUE.  I NOTICED WEAR AT AROUND 13,000 MILES.  DURING MY SECOND TIRE ROTATION.  HAVE HAD TOO MANY PROBLEMS WITH THIS NEW VEHICLE.  ALSO ISSUES WITH EXTREME CHIPPING AROUND THE REAR WHEEL WELL.  ALSO HAVE HAD A HESITATION PROBLEM AT ABOUT 25 MPH.  #RD GEAR USED TO BE DIFFICULT TO ENGAGE.  PLEASE HELP ME RESOLVE THESE ISSUES.  I GOT NOWHERE WITH THE DEALERS MYSELF.  THE VIN IS NOT THE APPROPRIATE VIN.  MY CAR IS A 2004 ZX5 DURATEC 2.3E 5 SPD.  ALMOST ALL OPTIONS INCLUDED. THANK YOU.  *NM",
        "vin": "3FAFP37Z73R"
    }
]