[
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/09/2006",
        "dateOfIncident": "07/26/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147214,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MONTERO",
                "productYear": "1995",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "DIAMOND CARE",
                "productModel": "DIAMOND CARE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE MECHANIC THE OWNER OF AN INDEPENDENT SHOP, COMPLETED A TUNE UP OF THE 3.0 LITER ENGINE, THAT WAS RUNNING FINE WHEN BROUGHT TO HIM. THE ENGINE WAS RUNNING AND THEN THE ENGINE HAD A LOUD GRINDING AND SOUNDED LIKE IT WAS BLOWING UP. THE MECHANIC TOOK THE SPARK PLUGS OUT AND USED A LIGHT TO DETERMINE THE CYLINDER HEAD WAS CRACKED AND RUINED FROM A LOOSE PIECE OF METAL THE SIZE OF A MANS TOE NAIL. THE ENGINE IS COMPLETELY RUINED AND MUST BE REPLACED. THE MECHANIC DISPUTES THE FACT HE DID ANYTHING TO CAUSE THE DAMAGE BUT WAS WILLING TO INSTALL ANOTHER ENGINE IF I PURCHASED IT.   THIS IS THE THIRD ENGINE THAT THIS HAS OCCURRED ON AND THE LAST TIME WAS WHILE I OWNED THE VEHICLE TOO. I HAD THE VEHICLE INTO A REPUTABLE MECHANIC FOR A TUNE UP. THEY DID A TUNE UP FOR $625, WHICH THEY FIRST CALLED AND QUOTED $350 THEN CALLED BACK AND CHANGED IT TO THE $625. THEY COMPLETED THE TUNE UP MOVED THE CAR OUT TO SEE HOW IT RAN. THE VEHICLE RAN FINE BUT ABOUT FIVE MINUTES AFTER IDLING THAT LENGTH OF TIME A PIECE OF METAL THE SIZE OF A SPARK PLUG ELECTRODE WAS LOOSE IN A CYLINDER AND RUINED THE ENGINE. THE SHOP DID NOT WANT TO REPLACE THE ENGINE BECAUSE THEY INSIST THE FAILURE IS NOT THEIR FAULT, BUT SINCE IT HAPPENED UNDER THEIR CARE THEY ACTUALLY FOUND A WRECKED MONTERO WITH A60,000 MILE ENGINE AND INSTALLED IT FOR THE PRICE OF THE TUNE UP. THE CAR WAS OUT OF COMMISSION FOR THREE WEEKS AND WE WERE NOT REIMBURSED FOR TIME AND EXPENSE BUT THE SHOP DID A PRETTY GOOD JOB OF REPLACING. THE ENGINE BLOCK OF THE OLD ENGINE WAS SITTING ON THE FLOOR OF THE SHOP WHEN I PICKED UP THE CAR. THE CYLINDER THAT WAS RUINED WAS SCRATCHED AND SCOURED COMPLETELY OVER THE WHOLE THING. SHOULD I FIND AND INSTALL AN ENGINE IT WILL BE NUMBER FOUR, THE ORIGINAL OWNER HAD TO REPLACE AN ENGINE WHEN HE OWNED IT.  *JB",
        "vin": "1GNEV18HXHF"
    }
]