[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2005",
        "dateOfIncident": "12/02/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TACOMA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "#1. 2004 TACOMA DBL CAB TRD: I'M ON MY 3RD SET OF ROTORS AND DRUMS AT JUST 40,000 MILES.  EACH SET OF ROTORS WARPED AT JUST OVER 10,000 MILES CAUSING THE EXPECTED PULSING AND BOUNCING.  I'M EXPECTING THE 3RD SET TO DO THE SAME.      #2.  SINCE ABOUT 10,000 MILES, I HAVE EXPERIENCED A \"THUMPING\" WITH A CORRESPONDING JOLT OF THE GEAR SHIFT UPON FINISHING A BREAKING CYCLE.  THIS ALSO HAPPENS OCCASIONALLY WHEN RELEASING THE FOOT BRAKE.  SOMETIMES IT IS QUITE LOUD AND VIOLENT.  I AM AWARE THAT ALL THE LATE MODEL AUTOMATICS DO THIS.  THE FACTORY HAS ACKNOWLEDGED THAT THERE IS A PROBLEM BECAUSE THEIR \"FIX\" WAS TO DRILL A HOLE IN THE TWO-PIECE DRIVE SHAFT TO \"VENT\" THE TRAPPED AIR.  THIS VERY TEMPORARILY SOLVED THE PROBLEM.  AGAIN TODAY, THE DEALER ACKNOWLEDGED THE \"THUMP\" AND TOLD ME THAT THIS IS \"THE WAY THE TRUCK IS SUPPOSED TO OPERATE\" AND THAT I SHOULD \"CHANGE MY BRAKING HABITS\".  ON A 15 MINUTE TEST DRIVE IT PROBABLY DOESN'T SEEM TOO BAD.  BUT I HAVE TO DRIVE THE VEHICLE ALL THE TIME AND IT IS VERY ANNOYING (AND THIS WAS NOT HAPPENING WHEN I TEST DROVE THE VEHICLE BEFORE I PURCHASED IT).  PERHAPS THIS IS NOT A \"SAFETY\" ISSUE, BUT IT IS INSULTING TO BE TOLD THAT THIS IS \"NORMAL\".  THEY MUST THINK I'M AN IDIOT OR SOMETHING.  JUST BECAUSE ALL THE LATE MODEL TACOMAS DO IT, DOES NOT MAKE IT RIGHT!  IT'S SO ARROGANT FOR THEM TO EXPECT US TO LIVE WITH THIS DEFECT IN DESIGN.  I ALSO BELIEVE THAT THIS SAME PROBLEM IS RELATED TO THE SOMETIMES VIOLENT SHIFTS ESPECIALLY FROM 1ST TO 2ND GEAR.      #3.  THERE IS ALSO A VIBRATION THAT COMES UP THROUGH THE STEERING WHEEL AT ABOUT 40 MILES PER HOUR.  IT IS THE FREQUENCY OF THE DRIVE SHAFT, NOT THE TIRES.  I CAN ALWAYS TELL WHEN I'M AT 40 MPH WITHOUT EVEN LOOKING AT THE SPEEDOMETER.  *JB",
        "vin": "5TEGN92N34Z"
    }
]