[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/15/2005",
        "dateOfIncident": "10/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142814,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ETM BAD/ ELECTRONIC THROTTLE MODULE  THIS HAS BEEN A NIGHTMARE AND IT'S NOT RESOLVED YET!    I BOUGHT MY USED VOLVO S-80 T6 OCTOBER 20 TH WITH 76,000 MILES.  WITHIN THE DAY OF OWNERSHIP THE SERVICE ENGINE REQUIRED LIGHT CAME ON, AND I FAILED MASS INSPECTION.  I TRIED TO GET MY MONEY BACK, BUT I BOUGHT OUT OF STATE, AND THEY REFUSE TO RETURN CALLS.    I RESEARCHED THE PROBLEM AND FOUND IT WAS THE ETM.  ON WEDNESDAY NOV 10TH 2005, I CALLED MY LOCAL DEALER  PIONEER VOLVO IN SOUTH DEERFIELD MASS 1 800 680 2140, AND WAS INFORMED THAT THE ETM WARRANTY EXPIRED AT 70,000 MILES, AT 76,000 MILE, THERE WAS NO WARRANTY.  I ASKED HIM ABOUT KNOWN PROBLEMS WITH THE ETM, AND DENIED THAT HE WAS AWARE OF ANY!    I ASKED HIM FOR AN APPOINTMENT, EXPLAINED THAT HE IS THE CLOSEST DEALER AT 47 MINUTES AWAY, AND THAT I NEEDED HELP ASAP DUE TO FAILED EMISSIONS.  HE TOLD ME \"BRING IT IN...AT 9 30 AM AND MAYBE I'LL LOOK AT IT....WHEN I ASKED HIM FOR A GUARANTEED TIME....HE SAID  ...\"MAYBE IN 2 WEEKS\"    I DECIDED TO FIX THE PROBLEM MYSELF BY CLEANING THE ETM, WHICH I UNDERSTAND HELPS TEMPORARILY.  I HAD NO CHOICE  BEING I AM EXTREMELY BUSY IN AN UNFLEXIBLE JOB AND FINANCIALLY STRAPPED.  HOWEVER, WHEN REINSTALLING THE ETM, THE BOLTS ARE DESIGNED TO SHEER.   THE BOLT SNAPPED AND I HAVE BEEN UNDER MY CAR FOR 3 DAYS....STILL CAN'T EXTRACT IT.   I NEED MY CAR! I NEED IT TO PASS INSPECTION!  WHY WON'T VOLVO COVER THIS?  *NM",
        "vin": ""
    }
]