[
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/12/2005",
        "dateOfIncident": "12/06/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10145014,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE INVESTIGATION # PE05029:    MY TOYOTA PRIUS 2003 [XXX] GASOLINE/ ELECTRIC HYBRID VEHICLES THAT CAN BE OPERATED IN GASOLINE OR ELECTRIC MODE. ON 4 SEPARATE OCCASIONS, THE GASOLINE ENGINE SHUT DOWN SUDDENLY WITHOUT WARNING.  EACH TIME I WAS DRIVING WITH THE SPEED OF HIGHWAY TRAFFIC.   THE THREE PREVIOUS TIMES THE VEHICLE CONTINUED TO OPERATE USING THE ELECTRIC MODE FOR A PERIOD OF TIME AFTER THE GAS ENGINE STALLED.  THIS LAST AND 4TH TIME THE VEHICLE SHUT DOWN AT THE SAME TIME THAT THEY FELT THE GAS ENGINE STALLED.  I WAS ABLE TO RESTART THE VEHICLE AFTER 3 IMMEDIATE ATTEMPTS TO TURN THE CAR ON.  I WAS ABLE TO SLOWLY DRIVE THE CAR OFF THE HIGHWAYS AND TO PARK.  AS WITH THE LAST 3 TIMES, I AGAIN HAD THE VEHICLE TOWED. EACH OF THE 4 STALLING INCIDENTS, I WAS ALERTED BY AN AUDIBLE SOUND AND VARIOUS WARNING LIGHTS. AFTER THE CAR STALLED THE BRAKE AND STEERING OPERATION CONTINUED TO FUNCTION AS THE CAR DRIFTED TO A STOP. EACH TIME THE REASON WAS FOR THE FAILURE TO OPERATE WAS CAUSED BY SOMETHING DIFFERENT, AS I AM TOLD BY THE SERVICE CENTER.    THIS LAST TIME, (4TH) THE DEALERSHIP SAID THE CAR IS \"FINE\" ASKED ME TO PAY THE TOW AND IS SENDING ME ON MY WAY.  NOTHING WAS DONE.  I DRIVE ABOUT 90 MILES A DAY WITH MY 8 YR OLD DAUGHTER AS MY PRIMARY PASSENGER.  THIS IS A VERY DANGEROUS SITUATION THAT HAS NOT BEEN CORRECTED BY TOYOTA.  MY DEALERSHIP (KINGS TOYOTA CINCINNATI OHIO).  *NM UPDATED 07/17/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "JT2BK18U330"
    }
]