[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/15/2005",
        "dateOfIncident": "11/21/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145414,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "350Z",
                "productYear": "2004",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I OWN A 2004 NISSAN 350Z AND RECEIVED A RECALL NOTICE FOR FRONT TIRE ROAR WHICH EVENTUALLY WILL DAMAGE THE TIRES AND MISALIGN THE FRONT END.  THE WARRANTY HAD BEEN EXTENDED TO OCT 30 2005 AND I HAD TAKEN IT BACK TO THE DEALER ON OCT 28TH.  AFTER THE CAR WAS CHECKED THE TIRES WERE FOUND DEFECTIVE AND THE SERVICE MANAGER SAID HE WOULD ORDER NEW TIRES.  AFTER TWO WEEKS HAD PASSED AND I DID NOT HERE FROM THE DEALER, I CALLED TO INQUIRE.  IT SEEMED AS THOUGH THE PARTS WERE NEVER ORDERED AND THEY WOULD ORDER THEM AND CALL ME WHEN THEY WERE IN.  FINALLY ON NOV 21ST I HAD THE CAR SERVICED.  WHEN I TOOK THE CAR TO THE DEALER THEY TOLD ME AT THIS TIME THAT I HAD TO PAY FOR THE TIRES.  THIS WAS A SURPRISE TO ME BECAUSE NOTHING WAS SAID TO ME AT THE ORIGINAL DATE OF SERVICE.  I AGREED TO HAVE THE TIRES REPLACED BECAUSE OF THE MIS-HANDLING OF THE CAR AND A POTENTIAL SAFETY PROBLEM.  AFTER WAITING APPROXIMATELY 3 HOURS FOR MY CAR A FEE OF $449.00 WAS PAID.  DO TO THE FACT THAT THIS WAS A RECALL BY THE MANUFACTURER AND THE NOTICE STATED THAT THE TIRES WILL BE REPLACED AT NO CHARGE, I FEEL THAT I AM DO A REFUND BY NISSAN.  I HAVE ALL PERTINENT DOCUMENTATION FOR YOUR REVIEW.  *JB",
        "vin": ""
    }
]