[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2006",
        "dateOfIncident": "11/12/2005",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND PRIX",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "10/31/05 CAR CLEANED AT CAR WASH.  11/01/05 NOTICED A WINDOW CLEANER SMELL, WHILE DRIVING COMING THROUGH THE AIR VENTS FOR A MINUTE.  11/12/05, 12:45 P.M. DROVE THE CAR 6 MINUTES TO A HAIR SALON.  1:45 P.M. STARTED FOR HOME, PARKED AT CONVENIENCE STORE, LEFT CAR RUNNING WITH MY PERMANENTLY DISABLED HUSBAND INSIDE.  PROCEEDED HOME NOTICED THE WINDOW CLEANER SMELL AGAIN.  1:58 P.M. PARKED IN CONDOMINIUM PARKING LOT.  2:20 P.M. OUR NEIGHBOR TOLD ME OUR CAR IS ON FIRE.  THERE WERE FLAMES 10' HIGH COMING OFF THE FRONT OF MY CAR.  A LOUD EXPLOSION OCCURRED AND THE POLICE AND FIREMEN WERE SHOUTING TO GET BACK DOWN THE HILL AND GET THE CHILDREN ALL THE WAY DOWN THE HILL!  I TOLD THE OFFICER THAT I WAS THE OWNER OF THE BURNING CAR.  OUR NEIGHBOR TOLD ME HER TOYOTA WAS PARKED ON THE RIGHT OF MINE AND IT WAS ON FIRE TOO.  WHEN THE FIRE WAS OUT, THE POLICE OFFICER TOLD ME THE HONDA CR-V ON THE LEFT OF MY CAR WAS ALSO BURNED, AND THEY WOULD NOTIFY THE  OWNER.  2:35 P.M. A FIREMAN GOT THE REGISTRATION AND PERSONAL BELONGINGS OUT FOR ME.  BEFORE MY CAR WAS TOWED AWAY, I TOOK PICTURES AND ASKED THE TOW TRUCK OWNER, IF HE COULD GIVE A REASON MY CAR BURNED UP.  HE SAID IT LOOKS ELECTRICAL TO ME.  SUNDAY, 11/13/05, 3:00 P.M. OUR SON-IN-LAW, A FIRE INSPECTOR FOR THE CLIFTON FIRE DEPARTMENT CAME TO THE UNOFFICIAL CONCLUSION THAT, IT LOOKS ELECTRICAL DUE TO THE BURN PATTERN.  I REPORTED THE FIRE TO MY INSURANCE CARRIER AND GENERAL MOTORS CORPORATION.  I WAS CONTACTED BY ESIS FOR GMC, AND SUPPLIED ALL THE DETAILS, PICTURES AND COPIES OF REPAIR ORDERS.  THIS IS A POTENTIAL FOR FATALITIES AND MANY MORE OF THESE ENGINE FIRES WILL OCCUR IF THE CAUSE IS NOT FOUND.   *JB",
        "vin": "1G2WR52162F"
    }
]