[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/15/2006",
        "dateOfIncident": "04/07/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "GRAND MARQUIS",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:  OBJECTION TO PROPOSED SETTLEMENT ON SUSAN CHAMBERLAN ET AL. V. FORD MOTOR COMPANY, CASE NO.[XXX]    TO WHOM IT MAY CONCERN:    I AM THE OWNER OF A 1997 MERCURY GRAND MARQUIS, [XXX], THAT EXPERIENCED CATASTROPHIC FAILURE OF THE INTAKE MANIFOLD IN QUESTION.  I OBJECT TO THE PROPOSED SETTLEMENT BECAUSE THERE IS NO PROVISION FOR THE ADDITIONAL DAMAGE THAT IS LIKELY TO OCCUR WHEN THERE IS CATASTROPHIC FAILURE OF THIS PART.   AFTER HAVING THE INTAKE MANIFOLD REPLACED WE EXPERIENCED ABNORMAL PERFORMANCE, WHICH INCLUDED ABNORMALLY HIGH COOLANT TEMPERATURES DURING A ROAD TRIP, WHICH CAUSED US TO HAVE TO HAVE THE CAR TOWED FROM OUT OF THE AREA TO THE LOCAL MERCURY DEALER. THEY DISCOVERED NO PROBLEM WITH THE REPLACEMENT OF THE INTAKE MANIFOLD, BUT THE HEADS AND BLOCK HAD WARPED AT THE TIME OF THE FAILURE REQUIRING A COMPLETE ENGINE REPLACEMENT.  IF THE VEHICLE HAD BEEN UNDER WARRANTY THEN THE TOTAL COST OF ENGINE REPLACEMENT AND THE INTAKE MANIFOLD WOULD HAVE BEEN COVERED.  FOR THIS REASON THE PROPOSED SETTLEMENT OF JUST RETROACTIVELY PROVIDING AN EXTENDED WARRANTY ON THE MANIFOLD ALONE IS NOT ACCEPTABLE.  IF THE VEHICLE WARRANTY HAD BEEN IN EFFECT AT THE TIME OF THE FAILURE THEN ALL REPAIR COSTS WOULD HAVE BEEN COVERED.  AS A RESULT OF POOR ENGINEERING, DESIGN, AND LACK OF NOTIFICATION OF THE DEFECT BY FORD MOTOR COMPANY IT HAS COST ME $6082.00, NOT INCLUDING THE AGGRAVATION, TOWING, AND OTHER FEES ASSOCIATED WITH FORD'S NEGLIGENCE.  PLEASE ADVISE ME HOW I CAN GET THE REIMBURSEMENT I DESERVE.  *NM   UPDATED 07/16/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "2MELM75W8VX"
    }
]