[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/02/2006",
        "dateOfIncident": "07/27/2006",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164214,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-V",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR REVIEWER OF MY COMPLAINT PLEASE TAKE A LOOK AT THE IS WEBSITE TO BETTER GET A UNDERSTANDING OF WHERE I AM GOING WITH THIS.    HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.F0D3FB5/0. I OWN A 95 ACCORD WITH 130K AND NEVER HAD TO GET THE COMPRESSOR FIXED....MY WIFE'S 2003 HONDA CR-V  49,000 MILES JUST WENT...HONDA TOLD ME $1400.00+TAX. I HAVE A 1 YEAR OLD DAUGHTER. YOU KNOW HOW THE WEATHER GETS HERE ON THE EAST COST IN THE SUMMER? ALSO I DRIVE MY 80 YEAR OLD GRANDMOTHER TO THE MARKET AND PLACES SHE NEEDS TO GO. WHAT ABOUT WHEN THE WINDOWS FOG UP IN THE WINTER. HOW CAN YOU DRIVE IF YOU CAN'T SEE. I COULD SEE IF THIS WAS MY 95 ACCORD A/C THAT WENT. I FOUND THAT WEBSITE OF HUNDREDS OF COMPLAINTS OF 02, 03 AND 04 HONDA CR-V OWNERS THAT THE SAME THING HAPPENED TO THEM. SOME WITH ON 20K MILES.  THIS SHOULD BE A RECALL FOR A BAD COMPESSOR . MAYBE BECAUSE PEOPLE DON'T SEE IT AS A SAFETY ISSUE. I CAN DRIVE WITHOUT A/C AND LIVE, BUT WHEN YOU NEED TO TRANSPORT A BABY OR 80 YR OLD GRANDMOTHER IN 100 DEGREE WEATHER EVEN HOTTER IN THE CAR WITH THE WINDOWS DOWN. MAYBE IT'S THE FACT THAT THEY CAN PUT A CRAPPY COMPRESSOR IN THE CAR AND HAVE PEOPLE COME BACK AND PAY ANYWHERE UP TO $2000.00 IF THERE WARRANTY EXPIRED. THEN THEY TELL YOU, YOU SHOULD OF BOUGHT THE EXTENDED WARRANTY OR THAT YOU SHOULD TRADE THE CAR IN AND GET A NEW ONE.  YOU USE THE A/C JUST SAY 1/2 YEAR. IF THIS WAS THE ABS, SRS OR SEAT BELTS, THERE WOULD BE A RECALL TO FIX IT .BUT FOR A BAD PART OF THE A/C NOTHING IS DONE, A/C NOT A SAFETY PROBLEM. FROM THAT WEBSITE ABOVE \"WHEN DRIVING DOWN THE ROAD MY COMPRESSOR BLEW-UP AND PARTS WHERE BEING SPREAD ALL OVER THE HIGHWAY!. WHEN WINDOWS FOG UP WHAT ARE YOU TO DO. HAVE A RAG NEXT TO YOU AT ALL TIMES TO WIPE YOUR WINDOWS. I CALLED HONDA AND THEY GAVE ME A CASE NUMBER THEY KNOW ABOUT THIS PROBLEM. JUST DON'T WANT TO MAKE IT PUBLIC. WHY WOULD THEY BE WILLING TO PAY FOR THE PARTS AND REPAIR TO OTHER OWNERS WHO CALLED CUSTOMER RELATIONS. *JB",
        "vin": "SHSRD78813U"
    }
]