[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/10/2006",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173114,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "3 DEATHS.  BET I'VE GOT YOUR ATTENTION NOW!  I HAVE BEEN READING ABOUT THE CHECK ENGINE LIGHT FAILURES, AND MY VAN HAS THE SAME PERSISTENT PROBLEM.  I UNDERSTAND THERE IS AN ENGINE DESIGN DEFECT AND THAT ALTHOUGH GASKET REPLACEMENT IS RECOMMENDED BY THE TECHNICAL SERVICE BULLETIN, IT SEEMS CUSTOMERS WHO HAVE PAID TO GET THE TSB FIX STILL HAVE THE SAME PROBLEM.  I PERSONALLY HAVE SPENT OVER $5000 IN THE LAST TWO YEARS TRYING TO GET THE ISSUE RESOLVED.  AT 103K, MY VAN'S BLUE BOOK VALUE IS MUCH LESS.  THIS IS NOT EVEN TO MENTION WHAT I'VE SPENT ON EXTRA GAS AT TODAY'S HIGH PRICES DUE TO INEFFICIENT ENGINE OPERATION RESULTING FROM THIS DESIGN DEFECT. THE STALLING OF THE ENGINE WHICH IS BEING REPORTED BY A LOT OF CONSUMERS IS ALSO DUE TO THE LONG TERM EFFECTS OF RUNNING THE VAN WITH THIS SAME DESIGN DEFECT.  IT IS JUST A MATTER OF TIME UNTIL SOMEONE DOES DIE BECAUSE OF THIS DEFECT, ESPECIALLY WITH THE ENGINES CUTTING OFF ON THE HIGHWAY.  FORD SHOULD RECALL THE VEHICLE FOR THIS PROBLEM AND FIX IT AT NO COST TO CONSUMERS.  THERE ARE ENOUGH INDIVIDUALS ON THIS WEBSITE ALONE TO ORGANIZE INTO A CLASS ACTION LAWSUIT, AND I AM JUST THE ONE TO TAKE THE LEAD ON IT.  OF COURSE, I DO NOT PLAN TO KEEP THIS VEHICLE.      I HAVE ALSO HAD A PERSISTENT PROBLEM WITH THE ENGINE COMPARTMENT GETTING TOO HOT AND BURNING UP MY ALTERNATOR.  I PURCHASED THIS VAN IN 2000 AND HAVE ALREADY REPLACED THE ALTERNATOR SIX TIMES (AVERAGING ONCE PER YEAR).    THIS IS THE FIRST FORD VEHICLE I HAVE EVER OWNED AND I AM LESS THAN IMPRESSED.  I WILL NOT BUY ANOTHER FORD PRODUCT AGAIN.   I HAVE OWNED DODGE CARAVANS AND CHEVROLET VEHICLES WHICH WERE DESIGNED PROPERLY AND GAVE ME NO WHERE NEAR THIS AMOUNT OF PROBLEMS.  I AM GOING TO PURCHASE A DODGE CARAVAN.  *NM",
        "vin": ""
    }
]