[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/27/2006",
        "dateOfIncident": "11/22/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "1991",
                "type": "Vehicle"
            }
        ],
        "summary": "COPY OF LETTER TO FMC:    I OWN A 1991 FORD EXPLORER 4WD XLT [XXX].  I PURCHASED THIS VEHICLE ON 11/9/96, FROM CROWN DODGE,  VENTURA, CALIFORNIA.   THE SELLING DEALER ASSURED ME AT THE TIME THAT NO RECALLS WERE OUTSTANDING ON THIS VEHICLE.    ON NOVEMBER 11/22/06, AS I CLOSED THE HATCH ON THIS VEHICLE, THE BRACKET THAT ATTACHES THE RIGHT-SIDE LIFTGATE GAS ASSIST CYLINDER TO THE HATCH TORE AWAY FROM THE HATCH.    I HAVE JUST LEARNED THAT A SAFETY IMPROVEMENT CAMPAIGN (NUMBER 95I007000) WAS ISSUED IN OCTOBER 1995 TO REINFORCE THIS BRACKET.  THE CAMPAIGN STATED THAT \"IF A BRACKET AND GAS ASSIST CYLINDER WERE TO DETACH COMPLETELY FROM THE LIFTGATE AND NO LONGER BEAR AGAINST THE LIFTGATE AS INTENDED, THE REMAINING CYLINDER WOULD NOT HOLD THE LIFTGATE IN AN OPEN POSITION.  PERSONAL INJURY COULD OCCUR.\"  THE CORRECTIVE ACTION WAS FOR FORD DEALERS TO REINFORCE THE BRACKET ATTACHMENTS.    MY LOCAL FORD DEALER SERVICE REPRESENTATIVE STATED TODAY THEY COULD NOT HONOR THIS SAFETY IMPROVEMENT CAMPAIGN.  REBECCA (#6048) AT THE FORD CUSTOMER SERVICE CALL CENTER TOLD ME THE CAMPAIGN HAD EXPIRED, AND COULDN'T OFFER ASSISTANCE.    YOUR COMPANY'S RESPONSE TO DATE IS NOT ACCEPTABLE.  THE BRACKET WAS ATTACHED TO THE HATCH BY ONLY TWO SMALL SPOT WELDS, AS IS THE LEFT-SIDE BRACKET.  THE FAILURE STILL HAS THE POTENTIAL FOR CAUSING SERIOUS INJURY, ESPECIALLY IF THE LEFT-SIDE BRACKET WERE TO FAIL.  THE VEHICLE WAS APPARENTLY NOT REPAIRED UNDER THIS SAFETY IMPROVEMENT CAMPAIGN.  I WAS NOT NOTIFIED OF THE CAMPAIGN NOR OFFERED AN OPPORTUNITY TO HAVE THIS DEFECT REPAIRED.    SINCE THE SAFETY HAZARD THAT THIS SAFETY IMPROVEMENT CAMPAIGN SOUGHT TO RESOLVE STILL EXISTS ON MY VEHICLE, I REQUEST THAT THE BROKEN BRACKET BE REPAIRED AND THE REMAINING BRACKET REINFORCED AT NO CHARGE TO ME, PER THE INTENT OF THE SAFETY IMPROVEMENT CAMPAIGN.    THANK YOU FOR YOUR ASSISTANCE.    [XXX]  *NM  UPDATED 07/12/2012  *JS  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FMDU34X0MU"
    }
]