[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/30/2006",
        "dateOfIncident": "10/26/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172114,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "QUEST",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A CERTIFIED PRE-OWED NISSAN QUEST 2004 10/25/06 FROM PORTER NISSAN 600 OGLETOWN ROAD,NEWARK DE.   ON 10/26/06 I DROVE THE CAR TO NEW YORK TO SEE MY DAUGHTER AND I BECAME VERY SICK. I HAD HEADACHE, NAUSEA AND FELT ILL WHILE I DROVE THE CAR. I GOT IN THE CAR RETURN BACK TO DELAWARE, THE MORE I DROVE THE CAR   THE SICKER I BECAME, HEADACHE ,NAUSEA,DIZZINESS, I HAD TO PULL OVER 3 TIMES PRIOR TO ARRIVING TO DE. I REALIZED THAT THE CAR WAS MAKING ME ILL AND CONTINUE MY JOURNEY TO RETURN  THE CAR TO THE DEALER 10/27/06 APPROX 9-10 AM. I ALSO INFORMED THE DEALER  THAT THE REAR FLOOR RUGS CONTINUE TO BE WET! THEN I PROCEEDED TO EMERGENCY ROOM FOR TREATMENT. LATER PORTER NISSAN FOUND A CRACK IN EXHAUST SYSTEM AND THE FUMES MADE ME SICK. I COULD HAVE DIED OR HURT SOME ON THE ROAD.  I BELIEVE THAT BUYING A CERTIFIED CAR  SHOULD PREVENT A CONSUMER FROM BUY A LEMON.  I AFRAID TO DRIVE THE CAR AGAIN, MY HEADACHE COME AND GOES. JUST THE THOUGHT OF GETTING THAT CAR MAKE FEEL ILL. PORTER NISSAN IS TRYING TO MAKE ME TAKE THAT CAR BACK. AND I TRULY DON'T FEEL SAFE IN THE CAR. HOW EVER I DO WANT ANOTHER NISSAN QUEST BECAUSE I AM MINI-VAN DRIVER AND IT IS THE CAR THAT I WANTED. BUT I DON'T WANT TO DIE TRYING TO FIND OUT IF THE CAR IS SAFE. I DRIVE 1 HOUR TO WORK AND I AM LONG DISTANCE DRIVER , I SPEND MORE HOURS IN MY CAR THAN I DO AT HOME. A CERTIFIED PRE-OWED IS SUPPOSE TO BE SAFE!!!!!!!!!  HELP ME PLEASE I HAVE A APPOINT WITH PORTER NISSAN APPROX 5-6PM 10/30/06  TRY TO CONTACT ME.  HIGHLY CONCERN",
        "vin": "5N1BV28UX4N"
    }
]