[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/23/2007",
        "dateOfIncident": "01/23/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179514,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "ECLIPSE",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR TODAY AND OUT OF NOWHERE ALL OF MY WHEELS LOCK UP AND I LOSE CONTROL OF THE CAR.  LUCKILY I STOPPED AND DIDN'T HIT ANYTHING BUT IT COULD HAVE BEEN MUCH MUCH WORSE IF OTHER CARS WOULD HAVE BEEN AROUND.  THIS PROBLEM WAS SUPPOSEDLY FIXED SEVERAL YEARS AGO BUT IT OBVIOUSLY WASN'T. THE RECALL SAYS THAT FLUID LEAKS OUT OF THE TRANSFER CASE AND CAUSES LOCK UP, THIS IS EXACTLY WHAT HAPPENED. THERE IS A RECALL THAT NEVER EXPIRES FOR THIS UNTIL IT IS FIXED ONCE.   SINCE IT SHOWS AS FIXED THE RECALL NO LONGER SHOWS AS OPEN FOR MY VIN, MITSUBISHI REFUSES TO ADMIT THERE IS A PROBLEM. A TRANSMISSION SHOP ADVISED ME THAT THIS FLUID SHOULD NEVER LEAK OUT ONCE, SO SURELY NOT TWICE IN 84,000 MILES. I WENT TO THE DEALER AND CALLED MITSUBISHI DIRECTLY AND NOBODY CARES THAT IT COULD POSSIBLY HAPPEN AGAIN AND SOMEONE COULD BE HURT.  I DO NOT HAVE THE MONEY TO FIX IT AND I HAVE NO CHOICE BUT TO REFILL IT WITH FLUID AND DRIVE IT AGAIN. THIS IS THE SECOND TIME IT HAS HAPPENED IN THIS CAR SINCE WE PURCHASED IT BRAND NEW IN 1995. IT ALSO HAPPENED TO ME IN MY EAGLE TALON TSI THAT IS THE SAME CAR AS THIS AND IT WAS FIXED UNDER THE RECALL SO I KNOW THIS ISSUE WELL AND ALL OCCURRENCES ARE IDENTICAL. THIS IS AN EXTREMELY DANGEROUS ISSUE AND I NO LONGER FEEL COMFORTABLE RIDING IN A MITSUBISHI IF THEY ARE UNWILLING TO ADMIT WHEN THERE IS A PROBLEM. I BELIEVE MY TRANSFER CASE SHOULD BE REPLACED SINCE THE ISSUE OBVIOUSLY WASN'T FIXED CORRECT THE FIRST TIME SINCE THE EXACT SAME THING HAPPENED AGAIN.  *JB",
        "vin": "4A3AL54F5SE"
    }
]