[
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,SEAT BELTS,STRUCTURE,WHEELS,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/12/2007",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ENVOY",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 GMC ENVOY WITH A LIST OF PROBLEMS **NAR**CC  THE CONSUMER BEGAN TO HEAR A KNOCKING AND PINGING IN THE ENGINE ON COLD STARTS AND FELT A HESITATION WHEN THE AUTOMATIC TRANSMISSION SHIFTED INTO GEAR. AFTER MANY COMPLAINTS, IT WAS FINALLY DISCOVERED THE ENGINE KNOCK WAS DUE TO SHORTER PISTONS IN THE RE-DESIGNED ENGINE AND THE HESITATION IN THE TRANSMISSION SHIFTING REQUIRED REPROGRAMMING. THE CONSUMER WAS TOLD HE WOULD HAVE TO LIVE WITH THE ENGINE KNOCK, BECAUSE IT COULD BE MORE TROUBLE TAKING THE ENGINE APART. ON A SEPARATE OCCASION, THE ENGINE STALLED DUE TO THE BATTERY DYING.  FROM APRIL 2004 TO OCTOBER 2004 THE BATTERY FAILED SEVERAL TIMES AND HAD TO BE RE-CHARGED. DURING THAT SAME TIME THE ENGINE LIGHT ILLUMINATED AND EACH TIME IT HAPPENED, THE DEALER WOULD HAVE TO REPROGRAM THE ENGINE COMPUTER.  THE RADIO WAS NOT FUNCTIONING PROPERLY WHICH PRIMARILY CONSISTED OF STATIC.  THE DRIVER INFORMATION CENTER CONTROL KNOBS AS WELL AS THE RADIO KNOBS WORE OUT.  THE FRONT CENTER CONSOLE WAS LOOSE.  IT WAS DISCOVERED THAT THE ENGINE LIGHT WAS COMING ON BECAUSE THE THIRD STOP LIGHT THAT'S ON THE TOP OF THE LIFTGATE MALFUNCTIONED. THERE WAS A SHORT CIRCUIT IN THE STOP LIGHT. THE COOLING FAN BROKE, THE BRAKES AND THE LEFT FRONT HEAD LAMP HAD TO BE REPLACED. THE REAR TAIL LIGHTS, DIRECTIONAL AND SIGNAL LIGHTS HAVE BEEN REPLACED SEVERAL TIMES. THE LUG NUT BROKE WHILE A REPLACEMENT TIRE WAS BEING MOUNTED ON THE VEHICLE. THE FRONT STABILIZER LINKAGE WAS REPLACED.  THE GAS TANK HAD TO BE REPLACED ALONG WITH THE FUEL LINES AND A SEAL ON THE TANK DUE TO A LEAK. THE SEAT BELT WAS DESIGNED POORLY AND THE BELT CUTS INTO THE CONSUMERS NECK. THE DRIVERS SIDE DOOR DIDN'T CLOSE PROPERLY, THE WINDSHIELD WIPERS WERE REPLACED WITHIN THE FIRST 2 YEARS.  *JB",
        "vin": "1GKDT13S932"
    }
]