[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "01/12/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002620,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "PLYMOUTH",
                "productModel": "GRAND VOYAGER",
                "productYear": "1990",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1990 GRAND VOYAGER MINIVAN THAT THAT HAS DEVELOPED A FUEL LEAK ON THE 3.3 LITER V6.  THE LEAK IS FROM THE SEAL ON THE FUEL RAIL CROSSOVER TUBE THAT GOES FROM THE FRONT HEAD TO THE REAR HEAD OF THE ENGINE.  I DISCOVERED IT LEAKING FUEL AT A RATE OF SEVERAL DROPS PER SECOND.    ON THE NHTSA WEB SITE, RECALL CAMPAIGN 00V268000 DESCRIBES THE FOLLOWING:    ''DEFECT SUMMARY:   VEHICLE DESCRIPTION: MINI VANS BUILT WITH 3.3L AND 3.8L ENGINES HAVE FUEL RAILS WITH NITROLE RUBBER O-RING SEALS THAT CAN DEGRADE OVER TIME. FUEL LEAKAGE FROM THE UNDERHOOD FUEL INJECTION FUEL RAIL COULD RESULT, INCREASING THE LIKELIHOOD OF A VEHICLE FIRE.   CONSEQUENCE SUMMARY:   FUEL LEAKAGE IN THE PRESENCE OF AN IGNITION SOURCE CAN RESULT IN A FIRE.   CORRECTIVE SUMMARY:   DEALERS WILL INSTALL A SEAL ON THE VEHICLE FUEL RAILS TO PREVENT EXTERNAL LEAKAGE OF FUEL FROM THE FUEL RAIL CROSSOVER TUBE, SHOULD THE EXISTING O-RINGS CONTINUE TO DEGRADE. OWNER NOTIFICATION BEGAN ON JANUARY 25, 2002. DUE TO THE LARGE QUANTITY OF VEHICLES INVOLVED IN THIS CAMPAIGN, THE OWNER NOTIFICATION WILL BE PHASED OVER THE NEXT SEVERAL MONTHS. HOWEVER, IF A VEHICLE IS LEAKING FUEL FROM THE O-RINGS, THE VEHICLE SHOULD BE TAKEN INTO A DEALER TO HAVE THIS REPAIRED AS SOON AS POSSIBLE. OWNERS WHO TAKE THEIR VEHICLES TO AN AUTHORIZED DEALER ON AN AGREED UPON SERVICE DATE AND DO NOT RECEIVE THE FREE REMEDY WITHIN A REASONABLE TIME SHOULD CONTACT DAIMLERCHRYSLER AT 1-800-853-1403.   ''    THE 00V268000 RECALL PRECISELY DESCRIBES THE FAILURE I AM EXPERIENCING ON THE SAME VEHICLE TYPE AND ENGINE.  HOWEVER, THE RECALL DOES NOT COVER THE 1990 MODEL YEAR OF MY VEHICLE. CAN ANYONE EXPLAIN TO ME WHY THE EARLIER YEARS WERE EXCLUDED?  THE DEALER QUOTES A PRICE OF $768 FOR REPAIRS.  FORTUNATELY I CAUGHT IT BEFORE A FIRE STARTED.",
        "vin": "1P4FH44R3LX"
    }
]