[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/22/2007",
        "dateOfIncident": "03/12/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185914,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING IN RESPONSE TO RECALLS THAT HAVE BEEN ISSUED FOR MY TYPE OF   VEHICLE (2005 JEEP LIBERTY).  I WAS NEVER NOTIFIED OF THE RECALL ISSUED FOR   LOWER BALL JOINTS FOR MY VEHICLE.  WHEN I CALLED CUSTOMER SERVICE AT DAIMLER   CHRYSLER TO INQUIRE WHY I WAS NOT NOTIFIED, I WAS MADE TO FEEL UNIMPORTANT.  I   THEN CALLED MY LOCAL DEALERSHIP AND SPOKE TO THE SERVICE MANAGER.  HE WAS AWARE   OF THE RECALL, HOWEVER NEVER NOTIFIED ME THAT IT NEEDED TO BE REPAIRED.  I TAKE   MY VEHICLE THERE FOR SERVICE EVERY MONTH OR SO SINCE PURCHASING IN JUNE 2005.    HE CLAIMED THAT THE PARTS WERE BACK ORDERED AND HE WOULD LET ME KNOW WHEN THEY   WOULD BE IN.  THAT WAS ON 3-12-07 AND TODAY IS 3-22-07 AND HE HAS NOT RETURNED   MY CALL.  I AM A NEW MOTHER OF A BABY BOY (3 MONTHS) AND IT DOES NOT MAKE ME OR   MY HUSBAND HAPPY THAT WE ARE RIDING IN A VEHICLE WITH A DEFECT.  I AM BEING TO   THINK THAT THE JEEP LIBERTY IS A \"LEMON\".  AFTER CALLING AND COMPLAINING, I   RECEIVED A RECALL NOTICE POSTMARKED 3-16-07.  WHAT ACTIONS CAN I TAKE FROM THIS   POINT?  I AM VERY UNHAPPY.  I HAVE MAILED A LETTER OF COMPLAINT TO THE   DEALERSHIP AND DAIMLER CHRYSLER.  PLEASE LET ME KNOW HOW TO PROCEED FROM THIS   POINT.  I AM AWAITING YOUR RESPONSE.  THE DEALERSHIP I PURCHASED FROM IS AS   FOLLOWS:     GALEANA JEEP   180 GREYSTONE BLVD.  COLUMBIA, SC 29210     THANK YOU FOR YOUR ASSISTANCE.     SINCERELY,     ROBIN TIDWELL",
        "vin": "1J4GK58K35W"
    }
]