[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "12/24/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002624,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I NEED TO REPORT  MY 2001 TOYOTA SEQUIOA AFTER AN INCIDENT THAT NEARLY BECAME A DEADLY ACCIDENT THAT NO ONE COULD HAVE FOUND OUT THAT IT WAS BECAUSE OF A MANUFACTURER'S TRANSMISSION DEFAULT HAD I NOT SURVIVED THAT INCIDENT.ON DEC. 24, 2002, I WAS DRIVING MY 2001 TOYOTA SEQIOUA IN FWY 5 WHEN SUDDENLY THE ENGINE STOPPED IN THE MIDDLE OF THE FWY 5.I WAS ABLE TO START THE ENGINE, BUT IT DIED DOWN AFTER I CHANGED THE (AUTOMATIC) GEAR TO DRIVE.I, TOGETHER WITH TWO PASSENGERS: ONE ADULT AND A 4-YR OLD TODDLER,WAS STUCK IN THE VEHICLE WAITING FOR THE INEVITABLE.TO CUT THE STORY SHORT,I GOT MY CAR TOWED TO THE NEAREST TOYOTA DEALERSHIP, FRONTIER TOYOTA IN VALENCIA.AFTER THEY CHECKED THE CAR ON 12/26, THE SERVICE REP INFORMED ME THAT THE AUTOMATIC TRANSMISSION NEEDS TO BE REPLACED.I BOUGHT MY 2001 TOYOTA SEQUIOA IN NOV OF 2000 WHEN IT FIRST CAME OUT IN THE MARKET.I'VE MAINTAINED MY SUV WITH TOYOTA DEALERSHIPS (MCPHERSON IN TUSTIN, AND SUNNYVALE TOYOTA). I HAD IT SERVICED FOR ITS 30,000 MILE MAINTENANCE. ON MAY 2002 WHICH IS JUST 7 MONTHS PRIOR TO THE INCIDENT ON DEC 24, 2002.  I TRIED CONTACTING TOYOTA'S CORPORATE OFFICE, BUT THEY DON'T WANT TO COVER THE SERVICE UNDER THE 60,000 MILE WARRANTY BECAUSE THE MILEAGE AT THE TIME OF THE INCIDENT IS 3,000 OVER.IT DOESN'T MAKE ANY SENSE TO ME THAT AN AUTOMATIC VEHICLE I BOUGHT BRAND NEW, WHICH I HAVE MAINTAINED AT THEIR DEALERSHIP ALL THROUGH OUT INCLUDING THE REQUIRED 30,000 MILE SERVICE, WILL JUST BREAK DOWN AND NEEDS ITS AUTOMATIC TRANSMISSION REPLACED AT 63,000 MILEAGE THAT NEARLY CAUSED MY LIFE AND TWO OTHER PASSENGERS. I AM CONCERNED THAT I MAY HAVE GOTTEN THE DEFAULT VEHICLE FROM THE FIRST BATCH OF THIS SUV THAT CAME OUT IN THE MARKET IN NOV OF 2000.AND I AM CONCERNED THAT A MANUFACTURER'S DEFAULT CAN BE OVERLOOKED AND COULD HAVE BEEN THE CAUSE OF MY LOSS AND OTHERS.I FEEL RESPONSIBLE TO INFORM TO PREVENT ANY POSSIBLE LOSS/ES.I NEED TO BE HEARD BECAUSE I NEARLY LOST MY LIFE, INCLUDING TWO MORE, RIGHT BEFORE CHRISTMAS.",
        "vin": "5TDZT34A91S"
    }
]