[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/02/2007",
        "dateOfIncident": "07/06/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201714,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SEDONA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY FATHER'S 2003 KIA SEDONA TO NAPLETON KIA IN ELMHURST SEVERAL TIMES FOR LOSS OF ENGINE POWER WHEN THE AIR CONDITIONER IS TURNED ON AND THE RADIATOR FANS BEING ON CONSTANTLY WHEN THE OUTSIDE TEMP REACHES 80 DEGREES OR MORE ALSO WHEN AIR CONDITIONER IS ON. THIS WAS NEVER A PROBLEM WHEN MY FATHER FIRST BOUGHT THIS VEHICLE BUT THE DEALER SAYS IT'S NECESSARY FOR THE FANS TO BE ON WHEN THE AIR IS TURNED ON TO PROTECT THE ENGINE FROM OVERHEATING. I BELIEVE THAT UP TO A CERTAIN POINT BUT THE FANS NEVER TURN OFF WHEN THE AIR IS ON. I HAVE A PROBLEM WITH THAT LOGIC. ANOTHER PROBLEM IS THE VEHICLE SOMETIMES BUCKS AND BACKFIRES FOR NO APPARENT REASON. IT'S FINE ONE MINUTE AND BAD THE NEXT THIS OCCURS A LEAST ONCE A MONTH, THEN IT'S FINE LIKE NOTHING EVER HAPPENED, UNTIL NEXT MONTH. THE DEALER MY DAD TAKES IT TO SEEMS LIKE THEY ARE NOT INTERESTED IN GETTING TO THE PROBLEMS THIS VEHICLE HAS, BUT WAITING UNTIL SOME OTHER PROBLEM OCCURS LIKE A CHECK ENGINE LIGHT COMES ON, THEN MAYBE THEY'LL SPEND SOME TIME ON IT. BUT THE VEHICLE COMES OUT OF THE DEALERSHIP FINE BUT WITHIN A DAY OR TWO IT'S THE SAME OLD PROBLEMS. MY DAD FEELS LIKE HE'S WASTING HIS TIME TRYING TO EXPLAIN THE PROBLEMS TO THE DEALERSHIP BECAUSE THEY MAY SEEM INTERESTED BUT HAVE NO INCENTIVE TO FIND THE REAL REASON THESE PROBLEMS OCCUR IN THE FIRST PLACE. THEY EITHER DON'T KNOW OR DON'T CARE. I'M BEGINNING TO THINK THAT THE MECHANICS DON'T KNOW AND THE DEALERSHIP DOESN'T CARE.  *TR",
        "vin": ""
    }
]