[
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "12/13/2002",
        "dateOfIncident": "06/12/2002",
        "fire": false,
        "manufacturer": "NATIONAL R.V. INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000025,
        "products": [
            {
                "manufacturer": "NATIONAL R.V. INC.",
                "productMake": "NATIONAL RV",
                "productModel": "SEA BREEZE",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "PLEASE REFERENCE # 567343    GM VEHICLES OVER 16,500LBS  HAS THE \"AUTO PARK BRAKE\" SYSTEM  INSTALLED.  IN THIS SYSTEM THE BRAKE  IS HELD OFF BY HYDRO PRESSURE AND IS ACTIVATED BY A STRONG SPRING WHICH SLAMS THE BRAKE ON EVEN AT HIGHWAY SPEEDS.  ANY MALFUNCTION WHICH ALLOWS A LOSS OF HYDRO PRESSURE WILL CAUSE THE BRAKES TO BE ACTIVATED.  THIS SYSTEM FAILED ON MY VEHICLE AND I TOOK IT TO A CHEV SERVICE CENTER FOR REPAIR.  THEY REPLACED THE PUMP AND ANNOUNCED THE SYSTEM FIXED.  I DROVE BACK HOME (150 MI) AND THE SYSTEM LOCKED UP.  MANAGED TO GET IT UNLOCKED AND TOOK IT BACK TO THE CENTER.  THEY REPLACED JUST ABOUT EVERYTHING IN THE SYSTEM, SWITCHES, RELAYS, PUMP, ADJUSTED CABLES, ETC.. ANNOUNCED THE SYSTEM REPAIRED. IT STILL DOES NOT WORK PROPERLY.  THE LIGHT STILL FLASHES, THE PUMP STILL RUNS EXCESSIVELY AND I CANNOT BE SURE THAT THE SYSTEM WILL NOT LOCK UP AGAIN AT ANY TIME.  THE SERVICE CENTER CONTACTED GM TECH SUPPORT FOR ASSISTANCE BUT COULD NOT FIND ANYONE IN THE SYSTEM THAT COULD EXPLAIN HOW TO PROPERLY REPAIR THE UNIT.  THIS SYSTEM IS VERY UNSAFE AND SHOULD BE RECALLED.  IF ANYONE THERE IS INTERESTED IN PERFORMING A SEARCH TO SEE OTHER COMPLIANTS PLEASE GO TO:  WWW.RV.NET/FORUM THEN CLICK ON THE MAGNIFYING GLASS IN THE UPPER RIGHT TO DO A WORD SEARCH.  TYPE IN \"AUTO PARK BRAKE\" AND SEARCH FOR THE PAST 12 MONTHS.  I FOUND 15 SEPERATE COMPLIANTS AND OTHER COMMENTS REGARDING PROBLEMS WITH THE SYSTEM.   CHEV SOLD THIS CHASSIS TO WORKHORSE AND THEY REPLACED THE SYSTEM, INDICATING THAT THEY AT LEAST WERE NOT SATISFIED WITH IT.  THE SYSTEM SHOULD BE RECALLED AND GM SHOULD BE REQUIRED TO REPLACE IT WITH A SAFE PARK BRAKE SYSTEM.  I WOULD BE VERY GLAD TO ASSIST IN RESEARCHING THE NUMBER OF FAILURES OF THIS SYSTEM IF THAT SHOULD BE NECCESSARY OR DESIRED BY NHTSA.",
        "vin": "1GBLP37J8W3"
    }
]