[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/23/2007",
        "dateOfIncident": "11/19/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THE FRONT RIGHT TIRE WAS WEARING EXTENSIVELY ON THE OUTSIDE.   FIRST I CHECKED THE TIRE PRESSURE AND IT WAS AT THE PROPER AMOUNT.  THEN I WENT TO HAVE THE TIRES ROTATED AND WAS TOLD TO HAVE THE ALIGNMENT CHECK BY THE TIRE SERVICEMAN.  THEN I WENT TO HAVE THE TIRES ALIGNED AND THE TECHNICIAN SAID THE TIE ROD ENDS HAD TO BE REPLACED BECAUSE THEY WERE WORN OUT AND LOOSE. I PERSONALLY OBSERVED THE FRONT WHEELS AND THEY BOTH WERE EXTREME LOOSE.  THE CAR HAS BEEN REGULARLY SERVICED BY THE CHEVROLET LOCAL DEALER AND ONLY HAD 37,500 MILES ON IT. I HAD IT SERVICED AT APPROXIMATELY 35,500 MILES BY THE CHEVROLET DEALER.  I TOOK THE CAR TO THE CHEVROLET DEALER, WHO AGREED  THAT BOTH THE TIE RODS ENDS NEEDED REPLACING AND THAT HE THOUGHT THEY COULD BE REPLACED WITH CHEVROLET PAYING FOR THEM.  BOTH THE ALIGNMENT TECHNICIAN AND THE CHEVROLET DEALER SERVICE PERSON TOLD ME THAT THE REASON THE TIE ROD ENDS WERE WORN OUT WAS THAT THEY CONTAINED NO GREASE FITTINGS AND FURTHER THAT THE ONES CHEVROLET FINALLY REPLACED THE WORN OUT ONES THEY DO NOT HAVE GREASE FITTINGS.  THIS CAR IS A 2006 CHEVROLET IMPLA.   I STILL AM GOING TO HAVE TO REPLACE WHAT WAS THE FRONT TIRE(S) BEFORE THIS DISCOVER DUE TO THIS MANUFACTURING DEFECT.  FURTHER,I AM EXPECTING TO HAVE TO REPLACE THE CURRENT NEW ONES WHICH HAVE NO GREASE FITTINGS WITHIN 30,000 OR AGAIN RISK MY SAFETY AND EXCESSIVE AND UNNECESSARY TIRE WEAR.  I AM TOLD BY SERVICE PEOPLE AND TECHNICIANS  THAT I CAN PURCHASE AFTERMARKET (NON-GENERAL MOTORS TIE ROD ENDS) THAT WOULD HAVE GREASE FITTINGS.     THIS LACK OF GREASE FITTINGS IS OBVIOUSLY A VERY SERIOUS MANUFACTURING DEFECT, THAT ENDANGERS THE LIVES OF HUNDREDS OF THOUSANDS OF CHEVROLET IMPALA OWNERS AND THEIR PASSENGERS AND OTHERS ON THE ROADS.   I AM CONCERNED ABOUT THIS WHAT APPEARS TO ME TO BE A MANUFACTURING DEFECT. *TR",
        "vin": "2G1WT55K769"
    }
]