[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/08/2007",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SKY",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS STARTED (COLD START) THE BRAKES DO NOT WORK AT FIRST. IF ONE SITS THERE FOR 2-3 MINUTES AND LETS THE VACUUM BUILD UP - THEN THEY WORK. THE MANUFACTURER FAILS TO MENTION THIS TO THE BUYERS. I HAVE HAD THIS OCCUR SEVERAL TIMES.  *TR  I MUST MENTION THAT MY CAR IS A 5-SPEED STICKSHIFT.   SHORTLY AFTER PURCHASE, I STARTED MY CAR - THE EMERGENCY BRAKE WAS ON, MY FOOT WAS ON THE BRAKE, AND AS SOON AS I STARTED TO LET UP ON THE CLUTCH THE CAR JUMPED FORWARD & MY FOOT WAS STILL ON THE BRAKE.  SINCE THEN, I ALWAYS PLACE MY CAR IN NEUTRAL BEFORE STARTING.  THEN APPROXIMATELY A MONTH AGO:  I WENT TO MOVE MY CAR OUT OF THE GARAGE TO THE DRIVEWAY - I STARTED THE CAR, AFTER APPROXIMATELY 45 SECONDS TO 1 MINUTE I PUT IT INTO REVERSE, SLOWLY BACKED OUT, AND WHEN I WENT TO STOP I HAD NO BRAKES - THANKFULLY I HAD THE PRESENCE OF MIND TO THROW IT INTO NEUTRAL AND GRABBED THE EMERGENCY BRAKE.  JUST MISSED GOING  ACROSS THE STREET TO WHERE CHILDREN WERE WALKING TO SCHOOL.  THEN ON MONDAY OF THIS WEEK, I STARTED THE CAR, LET IT IDLE FOR OVER 2 MINUTES, PUT INTO REVERSE TO BACK OUT OF THE GARAGE AND HAD THE SAME THING HAPPENED AGAIN.  I DISCUSSED THIS WITH MY DEALER AND WAS TOLD TO \"JUST LET THE CAR WARM UP PROPERLY\".  THIS IS WORRISOME BECAUSE I CANNOT LET ANYONE VALET PARK OR DRIVE MY CAR FOR FEAR THAT SOMEONE COULD GET HURT.    IT IS MY UNDERSTANDING THAT GM DID AWAY WITH AN AUXILIARY VACUUM BOOSTER ON THE ENGINE SO NOW IT TAKES TIME FOR SUFFICIENT VACUUM TO BUILD UP FOR THE BRAKING SYSTEM TO WORK.  AND I HAVE DISCOVERED THAT A NUMBER OF PEOPLE ARE HAVING THIS SAME PROBLEM WITH THE 2008 MODEL YEAR OF THE SATURN SKY BY PERUSING THE SKYROASTER.COM WEBSITE.  SEEMS TO HAVE BEEN A BIG MISTAKE    THIS IS A DISASTER WAITING-TO-HAPPEN AS NOT ONLY IS THERE GOING TO BE PROPERTY DAMAGE CAUSED BUT THERE IS GOING TO END UP WITH PEOPLE BEING INJURED OR KILLED.  AND I DO NOT BELIEVE THAT IT SHOULD WAIT FOR SOMEONE TO BE MAIMED OR INJURED FOR THIS TO BE LOOKED INTO.  *TR",
        "vin": "1G8MG35X18Y"
    }
]