[
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/14/2008",
        "dateOfIncident": "01/12/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY 1/12/08 THE ACCELERATOR ON MY 2007 TOYOTA CAMRY STUCK TO THE FLOOR!!  I PUMPED THE PEDAL A FEW TIMES BUT THAT DIDN'T FREE IT.  I HAD TO SLIP IT INTO NEUTRAL AND CUT THE ENGINE.  I WAS ABLE TO SAFELY COAST INTO A PARKING LOT BUT WAS HIGHLY UPSET!  I LOOKED DOWN AND DID NOT SEE ANYTHING INTERFERING WITH THE PEDAL, SO I PLACED THE VEHICLE INTO PARK AND STARTED IT UP AND PUMPED THE PEDAL AGAIN.  IT SLOWLY CAME OUT. (IT FELT AS THOUGH HYDRAULIC PRESSURE HAD BEEN RELEASED.)  I PUT IT INTO DRIVE AND SLOWLY PULLED FORWARD.  IT SEEMED OK SO I DROVE IT SLOWLY STRAIGHT TO THE DEALER.  WHEN I GOT THERE I TOLD THEM WHAT HAPPENED.  (IF THIS HAD HAPPENED WHEN MY 68 YR. OLD MOTHER IN LAW WAS DRIVING MY CHILDREN TO SCHOOL IN THIS CAR AS SHE USUALLY DOES,  I DON'T THINK SHE WOULD HAVE REACTED AS I DID!) THE DEALERSHIP CALLED ME LESS THAN TWO HOURS LATER AND TOLD ME THAT THEY HAD ALREADY CHECKED MY CAR AND THAT THERE WAS NOTHING WAS WRONG WITH IT.  THEY SAID THEY THOUGHT MY CAR MAT HAD GOTTEN STUCK ON THE ACCELERATOR (NOT ONE OF THEIRS, BUT A VERY HEAVY THICK RUBBER ONE.)  I EXPLAINED I HAD LOOKED DOWN TO SEE IF ANYTHING WAS STUCK ONCE I HAD THE VEHICLE SAFELY STOPPED AND COULD SEE NOTHING INTERFERING WITH THE PEDAL! THEY TOLD ME THEY WERE BASING THIS ASSUMPTION ON THE FACT THAT THERE WAS AN OUTLINE FOR MY CAR MAT NEAR THE GAS PEDAL.  I TOLD THEM, ADAMANTLY, THAT I DIDN'T CARE WHERE THE OUTLINE WAS, THAT I HAD VISUALLY INSPECTED IT AND THAT NOTHING WAS STUCK!  THEY INFORMED ME THAT, THAT WAS THEIR POSITION ON THE MATTER AND BASICALLY THE EXPLANATION THEY WERE STICKING TO.  I DON'T FEEL THIS CAR IS SAFE!  I HAVE LOST MY CONFIDENCE IN TOYOTA AND SERIOUSLY DOUBT I WILL EVER PURCHASE ANOTHER.  *TR",
        "vin": "JTNBE46KX73"
    }
]