[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217514,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "SV1000S",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A SUZUKI SV1000S E-33 (CA VERSION) FROM THE YEAR 2003. THIS MODEL BIKE HAD A FACTORY RECALL FOR DEFECTIVE FUEL TANK. THE DEFECT WAS THAT DUE TO VIBRATION THE FUEL VAPOR SEPARATOR WELD INSIDE THE FUEL TANK WOULD CRACK, AND FUEL WOULD LEAK TO THE CHARCOAL CANISTER, CAUSING IT TO FLOOD AND DRIP FUEL. THIS REPRESENTS A FIRE HAZARD SINCE IT IS LOCATED RIGHT ABOVE THE EXHAUST. I TOOK MY BIKE TO A SUZUKI DEALER TO HAVE THE DEFECT CORRECTED BECAUSE OF THE RECALL. THE BIKE NOW, WITH ITS NEW, AND IN THEORY IMPROVED, FUEL TANK IS HAVING THAT EXACT PROBLEM. WHEN THE FUEL TANK IS FULL, FUEL LEAKS OUT TO THE CANISTER AND ON TO THE EXHAUST. ALSO, ENGINE RUNS VERY RICH, AND EXCESS FUEL IN THE CYLINDERS MIGHT EVEN GET THE ENGINE TO STUCK. THIS EXCESS FUEL FIND ITS WAY TO THE EXHAUST MANIFOLD AND WHEN THE ENGINE STARTS THIS TUBES GETS SO HOT THAT THEY START SMOKING AND MIGHT CAUSE THE  BELLY COVER TO BURN. THERE IS ABUNDANT EVIDENCE THAT THIS IS NOT JUST AN ISOLATED FAILURE: I HAVE FOUND NUMEROUS PEOPLE WITH SAME BIKE AND EXACT SAME PROBLEM. I HAVE A RECALL LETTER FROM SUZUKI EXPRESSING THAT THIS WAS IN FACT A DEFECT ON THE BIKE'S DESIGN, BUT SUZUKI MAY NOT KNOW THAT IT IS STILL A DEFECT IN THE NEW VERSION OF THE FUEL TANK. I HAVE CONTACTED A LOCAL DEALER AND THEY TOLD ME TO BRING THE BIKE IN TO GET IT CHECKED. I WILL ALSO INFORM SUZUKI OF AMERICA DUE TO THE DANGER THAT THIS DEFECT REPRESENT TO ME AND ANY OTHER SUZUKI SV1000S RIDER.  *TR",
        "vin": "JS1VT54A032"
    }
]