[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/14/2003",
        "dateOfIncident": "01/13/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002649,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MARK VIII",
                "productYear": "1993",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON MY 1993 LINCOLN MARK VIII ARE VIRTUALLY USELESS. WITH THE STANDARD REPLACEMENT BULBS I HAVE ABOUT TEN FEET VISIBILITY FROM THE DRIVER'S SEAT. THIS IS WITH THE LOW BEAMS AND I HAVE ABOUT TWENTY TO THIRTY FEET VISIBILITY WITH THE HIGH BEAMS. I UPGRADED THE HIGH BEAMS TO A ONE HUNDRED WATT BULB TO GET UP TO ABOUT FIFTY FEET VISIBILITY. THIS GIVES ME ABOUT TWO AND A HALF CAR LENGTHS VISIBILITY AT NIGHT. WHEN I AM MEETING ON COMING TRAFFIC AT NIGHT, ALL I CAN DO IS TO TRY AND NOT HIT THE HEADLIGHTS THAT ARE IN THE OTHER LANE. THE PROBLEM WITH THE HEADLIGHTS IS THAT THE REFLECTIVE MATERIAL INSIDE THE LIGHT ASSEMBLY BURNS AWAY AFTER ABOUT SIX MONTHS OF USE. NOW, I CAN NOT AFFORD TO REPLACE THE ASSEMBLIES TWICE A YEAR AND SHOULDN'T HAVE TO. I HAVE PURCHASED ADDITIONAL DRIVING LIGHTS TO AID IN BEING ABLE TO SEE THE ROAD. THEY ARE NOT VERY ATTRACTIVE ON MY CAR, BUT WHAT CHOICE DO I HAVE? IT APPEARS THAT I HAVE PURCHASED A \"DAYTIME DRIVING ONLY\" CAR. I CURRENTLY USE A MESSAGE BOARD ON THE INTERNET THAT IS TAYLORED TO THE MARK VIII. IT'S WEB SITE IS: WWW.MARKVIII.ORG .THERE ARE THOUSANDS OF MEMBERS ON THIS BOARD THAT ALL COMPLAIN ABOUT THE SAME PROBLEM. PLEASE GO TO THE MESSAGE BOARD AND DO A SEARCH FOR \"HEADLIGHTS\". I AM AFFRAID OF BEING CAUGHT OUT IN THE DARK FOR FEAR OF CAUSING AN ACCIDENT OR RUNNING OVER SOMEBODY. BY THE WAY, ALL OF THE PEOPLE FROM THE MARKVIII SITE THAT HAVE WRITTEN FORD ABOUT THIS PROBLEM ALWAYS GET A REPLY SAYING THAT \"WE HAVE NEVER HEARD OF THIS PROBLEM\". I ALSO WANT TO POINT OUT THAT STARTING THE FOURTH YEAR THAT THE MARK VIII WAS MANUFACTURED, FORD STARTED USING THE HID LIGHTS ON THESE CARS. IN MY OWN OPINION, I THINK FORD RECOGNIZED THE PROBLEM AND APPLIED A FIX. NOW THEY DON'T WANT TO OWN UP TO IT.    THIS FORM ASKES ME FOR AN \"INCIDENT DATE\". THERE HAS NOT YET BEEN AN INCIDENT RELATED TO MY VERY OWN CAR. I'M SURE THAT SOMEBODY OUT THERE HAS HAD AN ACCIDENT RELATED TO POOR VISIBILITY. SO I AM JUST GOING TO PUT IN TODAY'S DATE.",
        "vin": "1LNLM91V6PY"
    }
]