[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/06/2008",
        "dateOfIncident": "02/05/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217314,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "PROTEGE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ALLIANCE TIRE & RUBBER CO",
                "productMake": "ALLIANCE",
                "productModel": "ALLIANCE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON JANUARY 22, 2008 I BROUGHT A MAZDA PRETEGE5 YEAR 2002 58,000 MILES   $ 12,000.00 FROM CITY WORLD 3305 BOSTON ROAD BRONX, NEW YORK 10469 (718) 655-7000.     THE SALE MANAGERS TOLD ME THIS CAR IS EXCELLENT FOR ME. ?NICE, GOOD AND EVERYTHING SO I SETTLE FOR THE MAZDA PRETEGE5.?  HOWEVER, SINCE I BROUGHT THE CAR I FIND MYSELF GOING TO THE USED AUTOMOBILE DEALER EVERY OTHER DAY BECAUSE THERE A PROBLEM WITH THE CAR. DURING THE WEEK I GOT TO SEXUALLY HARASSED, BY SALES INDIVIDUAL, THEY WERE TOUCHING ME.   FIRST, SUN ROOF ALL OF A SUDDEN STOPS WORKING.  BROUGHT IT TO TOYOTA SERVICE IN THE BRONX. THEY TOLD ME TWO DAYS LATER THEY DON'T HAVE THE BUDGETARY PARTS. I MISS MY CLASS THAT WEEKEND BECAUSE I DIDN'T HAVE A CAR TO GET TO CLASS. SECONDLY, THE CAR WAS GETTING OVER HEATING ALL OF A SUDDEN. I DON'T KNOW WHY, I DON'T EVEN DRIVE MUCH SCHOOL AND WORK IS 10 MINUTES AWAY FROM EACH OTHER. I BROUGHT THE CAR BECAUSE I HAVE A CLASS AT DOBBS FERRY.   THIRDLY, TODAY FEBRUARY 05, 2008 THE CAR COULDN'T START NEXT TO MY JOB IN NEREID AVENUE, SO I CALLED THEM, THEY TOLD ME TO CALL THE TOWING GUY I CALL THEM. THE TOWING GUY TOLD ME MY TIRE IS FLAT. MY POINT IS I ONLY BROUGHT THE CAR FOR TWO WEEKS NOW. I ONLY DRIVE FOR TWO DAYS ONLY IN GENERAL. MOST OF THE TIME THEY HAVE THE CAR IN THEIR POSSESSION. I AM PAYING INSURANCE  FOR THE CAR, WHEN I DON'T EVEN DRIVE IT. WHY THAT HAVE TO HAPPEN TO ME. I M A STUDENT TRYING TO GET BY IN SCHOOL. I AM A SINGLE WOMAN ALL ALONE TRYING TO SURVIVE. I DON'T HAVE ANYONE TO CALL TO GENEROUSLY HELP ME. CAN SOMEONE PLEASE HELP ME? NOW THE CAR DEALER PLACE REFUSES TO DO ANYTHING. I TOLD THEM. I CANNOT DRIVE THE CAR ANYMORE. THEY REFUSE TO TALK TO ME. THEY GIVE ME A RUN AROUND. PLEASE, I CAN'T TAKE THIS ANYMORE I WORK AT NIGHT TRYING TO MAKE A DECENT LIVING. I PRESENTLY WORK WITH THE MENTALLY RETARDED CHILDREN, AND I DO NOT HAVE TO COME TO THE CAR DEALER PLACE EVERY OTHER DAY, BECAUSE THEIR SOMETHING WRONG WITH THE CAR, IT JUST NOT FAIR.  *TR",
        "vin": "JM1BJ246921"
    }
]