[
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/28/2008",
        "dateOfIncident": "03/28/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225914,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"MEMORY DRIVE FEATURE\" ON THIS VEHICLE IS A HAZARD AND SKEWS GAS MILEAGE. I OWN A 2007 TOYOTA RAV4.  I SHOPPED AND COMPARED VEHICLES, PRICES AND CONSUMER GUIDES FOR MORE THAN 2 YEARS.  I WAS NOT INFORMED OF THE \"DRIVING MEMORY FEATURE\" IN THE COMPUTER ON THE VEHICLE WHEN CONSIDERING BUYING.  VEHICLE HAS LAG TIME BETWEEN THE ABILITY TO ACCELERATION OR TAKE EVASIVE CAPABILITY TO AVOID ACCIDENT OR GET OUT OF THE WAY TO AVOID BEING HIT.  THE MEMORY FEATURE, ELECTRONICS/COMPUTER SYSTEM DEVELOPS A MEMORY AS TO A PERSON'S DRIVING \"HABIT\". IT THEN BECOMES CONFUSED BECAUSE EVERY TIME I DRIVE CONDITIONS CHANGE, MINUTE TO MINUTE, DAY TO DAY, CAUSING THE SYSTEM TO BECOME CONFUSED WHEN I ASK THE CAR TO RESPOND TO AN EXCEPTION IN DRIVING CONDITIONS.   MY GAS MILEAGE  EPA IS LISTED AS 19 TO 28 MPG, AND I AM YET TO GET  18 MPG ONCE IN CITY DRIVING.  I CAN'T EVEN GET CLOSE TO AN AVERAGE OF 19 I GET 17.5. ONE HIGHWAY TRIP I GOT 24.9 MPG, AND I AM AN AVERAGE DRIVER, NOT A LEAD FOOT.  I TOOK IT TO A TOYOTA DEALER HERE IN TUCSON AND THEY \"ERASED\" THE MEMORY IN THE DRIVE COMPUTER.  IT DROVE WELL FOR 2 DAYS THEN HAS RETURNED BACK TO THE PREVIOUS ERASED MEMORY.  MY GAS MILEAGE IS WORSE.    I TALKED WITH ANOTHER OWNER AND HE TOLD ME TO TAKE IT OUT OF OVERDRIVE FOR IN-TOWN DRIVING.  IF I DO THAT THE ENGINE WILL RPMS WILL NOT DROP IF OVER 40 MPH THEREBY ,SKEWING GAS MILEAGE AND WILL DAMAGE THE ENGINE.    SO, HERE I AM, PAID $26,000 FOR A CAR AND AM SO UNHAPPY WITH THE RIP OFF. I WOULD BE HAPPIER IF IT WAS AVAILABLE IN A STICK SHIFT SO I COULD TAKE THE CONTROL, BUT AMERICANS ARE LAZY, SO TOYOTA DOESN'T OFFER THIS MODEL IN A STICK SHIFT.(MY PREFERENCE)  THE FACT THAT TOYOTA IS NOT FOURTH COMING WITH THIS FEATURE IS GROUNDS FOR FRAUD.  BUT THE NEW AMERICAN WAY IS LIE BY OMISSION.  I DID CALL THE TOYOTA COMPLAINT LINE, NATIONAL NUMBER AND THEY TOOK A REPORT AND WILL GET BACK WITH ME.   I DO NOT THINK I SHOULD HAVE TO SPEND MY TIME OFF GOING TO THE DEALER ONLY TO BE TOLD THE SAME STORY.   *TR",
        "vin": "JTMBK32V776"
    }
]