[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2008",
        "dateOfIncident": "07/15/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234914,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2003 MINI COOPER IN 3/03 AT MINI STERLING IN VA. MOVED TO PA, SERVICING CAR UNDER WARRANTY AT THE NEAREST DEALERSHIP, OTTO'S MINI IN WEST CHESTER (50 MI AWAY). MINOR ISSUES CORRECTED UNDER WARRANTY, WHICH EXPIRED IN LATE 2005. IN JULY 2007, AT 78,000 MILES, WHILE DRIVING ON LOCAL EXPRESSWAY CAR SUDDENLY LOST ABILITY TO DRIVE IN GEAR AND I PULLED OVER (LUCKILY SAFE - TRAFFIC WAS MOVING AT 60-70 MPH). ENGINE RAN BUT CAR WOULD NOT GO INTO GEAR. ALL SIGNS POINTED TO MAJOR TRANSMISSION PROBLEM. CAR TOWED TO TRANSMISSION SHOP IN YORK (NEAREST RECOMMENDED SHOP) WHO CONFIRMED TRANSMISSION ISSUE. CALLED MINI OF TOWSON (NEAREST DEALER) FOR QUOTE ON REPLACING TRANSMISSION - IT WAS $7800! CAR WAS ONLY WORTH $12,000-$13,000 AT THAT TIME - REPAIR WAS OVER 50% OF CAR VALUE. LOCAL SHOP TRIED FIX IT WITH REBUILT TRANSMISSION. TURNED INTO 7 MONTH NIGHTMARE AS MULTIPLE REBUILT TRANSMISSIONS DIDN'T WORK DUE TO COMPUTER CODE ISSUES, SO CAR TOWED TO MINI OF TOWSON TWICE TO SEE IF THEY COULD CORRECT ISSUES, BUT EACH TIME DEALER ONLY OFFERED TO FIX WITH NEW TRANSMISSION FROM THEM AT $7800. TRIED TRADING CAR TO THEM FOR NEW MINI, BUT THEY ONLY OFFERED ME $4000 FOR THE CAR, SAYING THEIR COST TO FIX WAS STILL $6000. LOCAL SHOP FINALLY GAVE UP, REFUNDING MY DEPOSIT AND RETURNING CAR WITH REBUILT TRANSMISSION THAT WILL ONLY DRIVES IN LOW GEAR AT 20 MPH. NOW HAVE MINI IN MY GARAGE (WITH BALANCE ON CAR LOAN) THAT SHOULD BE WORTH $10,000 BUT IS UNUSABLE. MINI IS REFUSING TO DO ANYTHING ABOUT THIS DESIGN FLAW (NEW CARS HAVE DIFFERENT TRANSMISSION), WHICH IS UNSAFE AT ANY SPEED, AS THEY SAY. NETSCAPE SHOULD ORDER RECALL OF THESE CARS AND REPAIR AT MINE'S COST. I HAVE INFORMED MY CONGRESSMAN BROTHER ABOUT THIS ISSUE (HE SITS ON HOUSE TRANSPORTATION COMMITTEE) - HE IS AWAITING WORD ON HOW NETSCAPE AND MINI RESPOND TO MY COMPLAINT (OBVIOUSLY SHARED MY MANY OTHERS).    THANK YOU.  *TR",
        "vin": "WMWRC33453T"
    }
]