[
    {
        "components": "STEERING,SUSPENSION,FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM,SERVICE BRAKES, ELECTRIC,INTERIOR LIGHTING,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/06/2008",
        "dateOfIncident": "04/15/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "UPLANDER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2006 CHEVY UPLANDER LT AND I STARTED TO HAVE PROBLEMS AROUND 3,000 MILES OF OWNERSHIP. IT STARTED WITH ELECTRICAL ISSUES (HARD DRIVE ENTERTAINMENT SYSTEM, GAS GAUGE, DIMMING LIGHTS, RADIO LOSING SETTINGS, HARD STARTS, SERVICE ABS, AND SERVICE TRACTION CONTROL) AND GRADUALLY MOVED TO MECHANICAL ISSUES (CLUCKING NOISES ? FRONT END, VIBRATIONS ? FRONT END, STEERING BINDING, AND GRINDING NOISES FROM THE FRONT END).    WHAT HAS BEEN REPLACED IN HOPES OF FIXING THE ISSUES ARE THE HARD DRIVE TO THE ENTERTAINMENT SYSTEM, MAIN COMPUTER MODULE (TWICE AND REPROGRAMMED SEVERAL TIMES), STEERING COLUMN, STEERING BOX, RACK AND PINION, FRONT STABILIZING CONTROL ARMS, FRONT BRAKE, FRONT ROTORS RESURFACED, ABS CONTROL MODULE (NEVER FIXED THE SERVICE ABS AND SERVICE TRACTION CONTROL).    THE DEALER STILL CAN?T EXPLAIN THE GRINDING NOISE AND IS TRYING TO CONVINCE ME THAT IT IS NORMAL CHARACTERISTICS OF THE VAN (THEY ACTUALLY WROTE THAT IN THE SERVICE REPORT). THEY CAN NOT RESOLVE THE SERVICE ABS AND TRACTION CONTROL ERRORS. THEY CAN?T RESOLVE THE HARD STARTS. THE DEALER HAS TAKEN A POSITION THAT NO MORE DIAGNOSTIC WORK WILL BE PERFORMED TO THE FRONT END UNTIL I REPLACE A CUPPED TIRE (THEIR OPINION).    I HAVE HIRED A LEMON LAW ATTORNEY TO HELP WITH MY PROBLEM.  *TR",
        "vin": "1GNDV33L36D"
    }
]