[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2008",
        "dateOfIncident": "06/03/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233714,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MPV",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT MAY NOT BE ABOUT A SAFETY ISSUE OF MY 2002 MAZDA MPV VAN. HOWEVER, IT'S DEFINITELY ABOUT PART DESIGN DEFECTS. OVER YEARS, I WAS STRUGGLING TO SOLVE ENGINE LIGHT-ON WHICH TOOK PLACE EVERY ONCE WHILE.  RECENTLY, THE THING GOT WORSE - ENGINE IDLE ROUGH, ENGINE LACK OF POWER, JERKING AT SPEED HIGHER THAN 40 MPH OR AT UP-SLOPE. AFTER LONG TIME STRUGGLE, I'VE FINALLY FOUND THE PROBLEM, WHICH WAS CAUSED BY A PCV HOSE FAILURE.    I'VE NEVER THOUGHT IT WAS A PCV HOSE PROBLEM, BECAUSE THE ORIGINAL PCV HOSE (PART # AJ51-13-89) HAS BEEN RECALLED BY MAZDA AND REPLACED BY NEW ONE (PART # AJ51-13-89YA, IT LOOKS LIKE REVISION A) BACK TO YEARS AGO. I'VE THOUGHT MAZDA HAS SOLVED THE PROBLEM. OBVIOUSLY, IT?S NOT YET. THIS TIME THE PCV HOSE HAS FAILED AGAIN, AND IT'S SO WEAK THAT THE HOSE COLLAPSED AGAIN UNDER VACUUM PRESSURE. TO FIX THE PROBLEM, I ORDERED A NEW HOSE, PART # AJ51-13-89YB. IF YOU LOOK AT THE PART # CAREFULLY, YOU CAN INFER THAT MAZDA HAS REALIZED THAT THEIR REVISION A HOSE DIDN?T WORK, WHICH WAS USED TO REPLACE THE ORIGINAL UNDER RECALL # 2204H, BECAUSE THEY HAVE RE--DESIGNED REVISION B HOSE. IT?S CLEARLY THAT THE ORIGINAL HOSE AND REVISION A HAD DESIGN DEFECTS. HOWEVER, THEY HAVEN?T ISSUE A RECALL TO REPLACE REVISION A YET THIS TIME. MAZDA SHOULD REALLY RECALL THIS PCV HOSE AGAIN.    THE THING IS EVEN BAD TO CUSTOMERS. BECAUSE THE DESIGN DEFECTS AND UNCERTAINTY OF THE PART MAKE THE HOSE REALLY SPECIAL, NO RETAIL STORES CARRY THIS HOSE. THE ONLY PLACE YOU CAN FIND IT IS AT MAZDA DEALERSHIP, AND IT COSTS $67, MUCH MORE EXPENSIVE. IT?S JUST A RUBBER HOSE, USUALLY A COUPLE OF DOLLARS.  *TR",
        "vin": "JM3LW28J620"
    }
]