[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/30/2008",
        "dateOfIncident": "10/29/2008",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247314,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING MY DRIVE TO WORK THE OTHER MORNING MY CAR SUDDEN JERKED BACK AND FORTH ON THE FREEWAY.  IT WAS VERY SUDDEN AND IT WAS VERY SCARY, I HAD NOT CONTROL OVER THE VEHICLE. THE TIRES WERE SCREECHING DURING THE JERKS AND I WAS AFRAID I WAS GOING TO CRASH.  A CHECK ENGINE LIGHT CAME ON AS WELL AS A VSC LIGHT AND MY SHIFTER LIKE D5 WAS BLINKING.  I MADE IT TO WORK AND CALLED MY BOYFRIEND TO COME LOOK AT THE VEHICLE.  HE DROVE IT AROUND THE BLOCK AND NOTICED NOTHING WRONG,  BETTER SAFE THAN SORRY WE SWITCHED CARS.  ON HIS DRIVE HOME HE FELT THE SAME THING I DID, VERY SUDDEN JERK AND UNCONTROLLABLE CAR ON THE FREEWAY.  HE MENTIONED IT WAS LIKE THE TRANSMISSION LOCKING UP AND THEN THE TRACTION CONTROL GRABBING.  THE CAR WOULD NOT SHIFT GEARS. HE IMMEDIATELY DROVE IT STRAIGHT TO ACURA AND FOUND SOMEBODY TO LOOK AT IT.  THE DEALERSHIP SAID THAT IT WAS A COMMON PROBLEM WITH THESE CARS AND ITS A TICKING TIME BOMB AND THERE WAS A RECALL AND EXTENDED WARRANTY ISSUED OUT BY ACURA, THE DEALERSHIP ALSO SAID THAT THE VIN NUMBER OF MY VEHICLE WAS OUT OF THE RANGE OF THE WARRANTY. THEY ARE OFFERING TO COVER 60% OF THE COST FOR THE TRANSMISSION REPLACEMENT AND I PAY 40%.  I DO NOT THINK ITS FAIR BECAUSE WHILE I WAS THERE,  THERE WAS ANOTHER VEHICLE EXACTLY LIKE MINES AND I CURIOUSLY ASKED WHAT THAT CAR WAS GETTING FIXED AND THEY TOLD ME THE EXACT SAME PROBLEM BUT THAT CAR IS BEING COVERED COMPLETELY.  THIS IS UNFAIR AND NOT RIGHT THAT JUST BECAUSE OF THE VIN BEING OUT OF RANGE I AM OUT OF LUCK.  THIS IS A COMMON PROBLEM AND ACURA SHOULD TAKE OF ALL NOT JUST SOME. *TR",
        "vin": "19UUA56993A"
    }
]