[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/19/2008",
        "dateOfIncident": "08/22/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246014,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "TITAN",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY OF '08, MY WIFE CALLED TO TELL ME SHE WAS HAVING A PROBLEM WITH OUR TRUCK. SHE WAS AFRAID TO DRIVE IT, AS SHE REPORTED A BRAKE FAILURE THAT AND WAS NEARLY IN AN ACCIDENT. SHE WAS EXITING A PARKING LOT TO A BUSY ROAD. AS SHE APPROACHED THE END OF THE PARKING LOT, SHE BRAKED TO WAIT FOR A CLEARING IN TRAFFIC. SHE SAID THE BRAKE PEDAL WENT TO THE FLOOR, THE TRUCK MADE A LOUD RUMBLING NOISE, AND THE TRUCK ROLLED OUT TO THE EDGE OF THE BUSY STREET UNTIL SHE PUMPED THE BRAKE PEDAL AND STOPPED THE TRUCK. SHE LEFT IT THERE AND WAITED FOR ME, AFRAID TO MOVE IT. I INSPECTED THE TRUCK AND FOUND NO MECHANICAL PROBLEMS. I FIGURED THAT THERE WAS A FAULT WITH THE ABS SYSTEM, WHICH WENT AWAY AFTER THE TRUCK WAS TURNED OFF AND THE SYSTEM WAS REBOOTED/SELF TESTED. ON AUGUST 22, 2008, THE FAULT RETURNED. MY WIFE BACKED THE TRUCK OUT OF OUR DRIVEWAY, AND THE TRUCK DISPLAYED THE SAME SYMPTOMS WHEN SHE TRIED TO STOP AT THE BOTTOM OF THE DRIVEWAY. SHE AVOIDED HITTING A PARKED VEHICLE ON THE OTHER SIDE OF THE STREET. SHE LEFT THE ENGINE RUNNING SO AS TO NOT RESET THE ABS COMPUTER, AND CALLED ME OUT TO CHECK THE TRUCK. I COULD FIND NO MECHANICAL FAULT, AND FOUND THE ABS FULLY ENGAGING WHEN PRESSING THE BRAKES, RESULTING IN VERY LITTLE STOPPING POWER. PUMPING THE BRAKES CAUSE NEAR FULL APPLICATION OF BRAKING FORCE, EVEN AT LIGHT PEDAL PRESSURE.  I DETERMINED THAT IT WAS AN ABS ISSUE. BOTH TIMES THE FAULT OCCURRED, THE \"BRAKE\" LIGHT ILLUMINATED. TURNING OFF THE TRUCK AND RESTARTING RESOLVED THE PROBLEM, CONFIRMING MY SUSPICION OF A SOFTWARE FAULT. I SEARCHED ON LINE AND FOUND A NISSAN TSB THAT ADDRESSED THE ISSUE. I BROUGHT THE TRUCK TO DIRITO BROTHERS NISSAN IN CONCORD, CA TO HAVE THE TSB APPLIED, WHICH INVOLVED A ABS SOFTWARE UPDATE. I WAS SURPRISED AND UPSET TO LEARN THAT THE REPAIR WAS NOT COVERED UNDER WARRANTY, AS THE SOFTWARE UPDATE WAS CONSIDERED AN \"ADJUSTMENT.\" I WAS CHARGED $150 FOR THIS SERVICE. THE SERVICE WRITER STATED HE SAW A NUMBER OF TRUCKS WITH THE PROBLEM.  *TR",
        "vin": "1N6AA07A24N"
    }
]