[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/09/2008",
        "dateOfIncident": "11/09/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "COUGAR",
                "productYear": "1989",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS NOW TOAST.  IT WAS ABOUT 100 MILES PAST ITS SCHEDULED OIL-CHANGE/TUNE UP BUT OTHERWISE HAS BEEN WELL-CARED-FOR AND WAS RUNNING SMOOTHLY.  I WAS DRIVING, AND A BEEPING STARTED.  IT SOUNDED LIKE IT'S COMING FROM THE CENTER OF THE CAR, AND THE BATTERY LIGHT CAME ON WARNING OF VERY LOW BATTERY, BUT NO OTHER WARNING LIGHTS.  I SAW SMOKE COMING OUT THE BACK (REARVIEW AND SIDE MIRRORS) AND IT SMELLS LIKE SOMETHING SYNTHETIC IS BURNING (THIS ALL HAPPENS IN SECONDS TIME); SO, I PULL OVER, PARK, TURN THE CAR OFF.  MY FRIEND AND I GOT OUT OF THE CAR.  WITH THE CAR STOPPED I REALIZED THE SMOKE WAS COMING FROM UNDER THE HOOD.  I CALLED AAA FOR A TOW-TRUCK AND THE SMOKE WAS DYING DOWN.  THEN THE SMOKE PICKED UP AGAIN AND I SAW WHAT I CAN ONLY DESCRIBE AS SMALL DROPS OF FIRE COMING FROM UNDER THE HOOD (PROBABLY DRIPPING, BURNING OIL).  I THEN CALLED THE FIRE DEPARTMENT.  BY THE TIME THE FIRE DEPARTMENT ARRIVED, THE FRONT OF THE CAR WAS ABLAZE WITH A MASSIVE DARK SMOKE PLUME GOING WHAT MUST HAVE BEEN EASILY 100 FEET INTO THE AIR.  THEY PUT OUT THE FIRE BUT NOT BEFORE THE EVERYTHING UNDER THE HOOD WAS TOTALLY BURNED OUT AND THE TWO FRONT TIRES (WHICH ARE NOW MELTED ONTO THE FRAME) HAD EXPLODED RATHER DRAMATICALLY.  WHILE SMOKE GOT INTO THE COCKPIT, THE FLAME DID NOT BREACH IT NOR DID THE GAS TANK EXPLODE, BUT THE FUEL LINE MUST HAVE BEEN BREACHED.  I'M CALLING A WRECKER TOMORROW MORNING TO TAKE THE CAR TO A SCRAP YARD (NO ONE OPEN SUNDAY EVENING).  I'M WONDERING IF THIS IS THE SORT OF THING THE MANUFACTURER REIMBURSES SOMEONE FOR.  I HAVE LIABILITY INSURANCE, BUT NOT COMPREHENSIVE.  NO ONE WAS HURT, SAVE FOR WHAT I AS A LAYMAN WOULD CHARACTERIZE AS MINOR SMOKE INHALATION WHILE MY FRIEND AND I WERE IN/VACATING THE CAR (I FELT NAUSEOUS I WHILE AFTERWARD, BUT THAT COULD HAVE BEEN THE SHOCK OF SEEING MY CAR TURN INTO A FIREBALL AS MUCH AS IT WAS THE SMOKE I INHALED). *TR",
        "vin": "1MEPM6049KH"
    }
]