[
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "01/18/2009",
        "dateOfIncident": "10/19/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10255514,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "INFINITI",
                "productModel": "Q45",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES IN THIS VEHICLE MALFUNCTIONED AND BY SUCH CAUSED A VERY SERIOUS ACCIDENT. THE DEALER, NISSAN OF THE EASTSIDE IN BELLEVUE WA WAS SUPPOSED TO FIX SAID BRAKES AS I NOTED THAT THEY WERE NOT OPERATING CORRECTLY IN MY TEST DRIVE OF THE VEHICLE AND I WROTE THE CONTRACT SUBJECT TO THE BRAKES BEING FIXED. WHEN THEY DIDN'T FIX THE BRAKES THEY WERE COMMITTING FRAUD AND ALSO IN BREECH OF CONTRACT.. THEY DID NOT FIX THE BRAKES AS AGREED. INFINITI OF FIFE THEN SUPPOSEDLY DID SAID BRAKE WORK. A FEW DAYS LATER THE CAR IS IN AN ACCIDENT DUE TO BRAKE FAILURE. COME TO FIND OUT, BOTH DEALERSHIPS ARE OWNED BY THE SAME PEOPLE THUS MAKING COLLUSION TO HIDE THIS SAFETY ISSUE A VERY EASY ROAD TO TRAVEL. THE CAR IS NOW CURRENTLY OFFERED FOR SALE AGAIN AT INFINITI OF FIFE THIS TIME AND THE ACCIDENT ISN'T DISCLOSED, IN FACT THE CAR IS SAID TO HAVE A CLEAN CARFAX HISTORY. THIS CONSTITUTES FRAUD. I HAVE NOT AS YET BEEN COMPENSATED FOR MY LOSS. MY INSURANCE PAID TO FIX THIS VEHICLE WHICH THE NISSAN DEALER PROMPTLY REPO-ED (5 MINUTES AFTER I PAID TO GET IT OUT OF THE SHOP) WHEN I REFUSED TO PAY FULL RETAIL DUE TO THE AFOREMENTIONED ISSUES. THE DEALERSHIP OWNERS AND ALL INVOLVED SHOULD BE BROUGHT UP ON FELONY RECKLESS ENDANGERMENT CHARGES AS WELL AS FRAUD CHARGES. I DO EXPECT TO BE COMPENSATED FOR THIS AS WELL AS DOES MY INSURANCE COMPANY, WHICH PAID OVER $10,000 TO FIX THIS DEATH TRAP OF A CAR. I HOPE YOU CAN HELP AS I AM IN DIRE NEED OF ASSISTANCE. *TR",
        "vin": "JNKBF01A63M"
    }
]