[
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "03/16/2009",
        "dateOfIncident": "03/05/2009",
        "fire": false,
        "manufacturer": "UNKNOWN MANUFACTURER",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262014,
        "products": [
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dorel Juvenile Group",
                "productMake": "DOREL",
                "productModel": "EDDIE BAUER 3-IN-1",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "WHEN I WENT TO CHANGE THE HEIGHT OF THE HARNESS ON MY CAR SEAT I FOLLOWED THE INSTRUCTIONS WHICH SAID \"FROM THE FRONT , INSERT THE HARNESS STRAP, HARNESS RETAINER, BUCKLE PLATE, AND \"S\" CLIP THROUGH THE SHOULDER HARNESS SLOT IN THE SEAT PAD AND SHELL.\"  I WAS ABLE TO GET ALL OF THE PIECES THROUGH THE SHELL, THE BUCKLE PLATE IS EXTREMELY DIFFICULT TO GET THROUGH THE HOLE IN THE SHELL, REQUIRING AN EXTREME AMOUNT OF FORCE.  WHEN I TRIED TO PUT ALL OF THE PIECES BACK THROUGH THE SHELL I WAS UNABLE TO PUT THE BUCKLE PLATE BACK THROUGH.  WE TRIED POSITIONING THE BUCKLE PLATE EVERY WHICH WAY WE COULD BUT WERE STILL UNSUCCESSFUL.  WE EVEN TRIED TO HAMMER IT BACK THROUGH THE HOLE IN THE SHELL.  THE HARNESS PLATE IS WIDER THAN THE HOLE IN THE SHELL.    I TRIED TO CALL THE MANUFACTURER BUT THEY WERE AT LUNCH UNTIL 12:30PM. 10:30AM MY TIME.  MY DAUGHTER HAD A DOCTOR'S APPOINTMENT SO WE HAD TO CUT THE PLASTIC SOME TO GET THE BUCKLE PLATE BACK THROUGH.  I CALLED THE MANUFACTURER AND TRIED TO EXPLAIN TO THEM WHAT HAD HAPPENED BUT THEY JUST CONTINUED TO SAY THAT THE BUCKLE PLATE WOULD FIT THROUGH IF I TURNED IT THE CORRECT WAY.  THE MANUFACTURER DIDN'T DO ANYTHING WITH MY CONCERN SINCE WE DAMAGED THE SEAT. *TR",
        "vin": ""
    }
]