[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER SPORT TRAC",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE LAST YEAR OR SO, I HAVE DEALT WITH A \"CHECK FUEL CAP\" LIGHT THAT CONSISTENTLY TURNS ON AND OFF. IN ADDITION, WHENEVER I TRY TO PUMP GAS, IT USUALLY COMES SPEWING OUT. NOW IT HAS GOTTEN TO THE POINT THAT WHENEVER I DO TRY AND PUMP GAS, IT WILL ONLY LET ME PUT IN ABOUT 10 CENTS AT A TIME BEFORE THE LATCH MAKES ME STOP. I GET VERY NERVOUS AFTER PUMPING MY GAS, KNOWING THAT THE LEFT SIDE OF MY CAR HAS GASOLINE SPILT ALL OVER IT. WHAT IF I WAS TO DRIVE BEHIND SOMEBODY THAT THROWS A CIGARETTE OUT AND IT JUST SO HAPPENS THAT IT TOUCHS THE GASOLINE ON THE SIDE OF MY CAR? IN ORDER TO GET THE PROBLEM CORRECTED, I TOOK IT TO D&D COLLISION, AND ACCORDING TO THEM THEY SAID IT IS THE EVAP CHARCOAL CANISTERS THAT ARE CAUSING THIS REACTION FOR THE GAS TO COME BACK OUT OF THE GAS TANK. IT JUST SO HAPPENS, THAT USUALLY MOST CARS ONLY HAVE ONE CANISTER, BUT MINE HAS TWO. THE TOTAL COST TO FIX IS APPROXIMATELY $500 AND THAT IS NOT INCLUDING THE FACT THAT THEY SAID ONCE THEY CHANGE THE CANISTERS THEY WILL BE ABLE TO SEE IF THEIR ARE MORE PROBLEMS. THEY BELIEVE THAT THEY ARE ABOUT 95% CORRECT ABOUT THE PROBLEM, BUT THEY SAID THERE IS ABOUT A 5% CHANCE THAT THEIR COULD MORE TO THE PROBLEM. THIS CAR IS COMPLETELY UNSAFE FOR THE ROAD WITH GASOLINE ALL OVER THE LEFT SIDE. THE PROBLEM IS, IS THAT I HAVE NEVER BEEN IN ANY ACCIDENT, OR ANYTHING, SO I DON'T UNDERSTAND WHERE THIS RANDOMLY CAME FROM. I HAVE SPENT THOUSANDS OF DOLLARS ON MY SPORTS TRAC EXPLORER AND IT JUST SEEMS THAT ALL TOGETHER, THE CAR WAS PUT TOGETHER IN POORLY CONDITION. *TR",
        "vin": "1FMZU67K15U"
    }
]