[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2009",
        "dateOfIncident": "11/06/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258114,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE ON 10/20/08. UPON PURCHASE, PRIVATE DEALER NOTIFIED ME OF A RECALL ON THE VEHICLE. VEHICLE WAS TAKEN IN TO THE LOCAL KIA DEALERSHIP ON 10/24/08  AND RECALL SC037 WAS PERFORMED. UPON PICKUP OF VEHICLE, I WAS NOTIFIED BY KIA DEALERSHIP OF RECOMMENDATIONS LISTED ON SERVICE INVOICE.  ON 11/06/08 VEHICLE WAS TAKEN TO MY REGULAR MECHANIC FOR INSPECTION AND SERVICE FOR ITEMS ON THE RECOMMENDATION LIST FROM KIA DEALERSHIP. UPON LIFTING THE VEHICLE UP IN THE AIR TO RESEARCH ONE OF THE KIA DEALERSHIPS RECOMMENDATIONS A SOFTBALL SIZE HOLE WAS FOUND RUSTED IN THE SUB FRAME WHERE THE LOWER CONTROL ARM IS TO BE ATTACHED. WHEN KIA DEALERSHIP WAS NOTIFIED ABOUT THE HOLE AND SAID THEY WOULDN'T HAVE LIFTED CAR UP. KIA MOTORS AMERICA WAS PHONED AND TOLD ABOUT SITUATION AND TREATMENT BY KIA DEALERSHIP. KIA MOTORS AMERICA TOLD ME TO TAKE VEHICLE BACK IN TO DEALERSHIP TO HAVE A DIAGNOSIS ON VEHICLE AND TO CALL BACK AND I WAS GIVEN A NAME, EXTENSION NUMBER AND A CASE NUMBER. I HAD TO TOW THE VEHICLE BACK IN TO THE KIA DEALERSHIP AND THEY LOOKED AT IT AND SAID THEY NEVER SAW THE HOLE PREVIOUSLY BUT HERE'S AN ESTIMATE FOR US TO FIX IT. I CONTACTED MY MECHANIC AND ASKED WHAT HIS ESTIMATE WOULD BE TO FIX IT AND HOW MUCH THE PART WOULD BE, AND IF THIS WAS SOMETHING THAT COULD BE GOTTEN FROM A SALVAGE YARD. THE LOCAL SALVAGE YARDS WERE ALREADY PHONED AND THE SAME THING WAS WRONG WITH THOSE PARTS AND THIS IS A COMMON PROBLEM WITH KIA VEHICLES. I ORDERED THE PART FROM THE KIA DEALERSHIP, IT IS CALLED A CROSSMEMBER. I HAVE HAD MY MECHANIC REPLACE IT, I HAVE HAD TO GET TWO NEW TIRES, A FRONT END ALIGNMENT AND HAVE ASKED KIA MOTORS AMERICA TO REIMBURSE ME FOR THIS. THEY ARE NOW SAYING THEY HAVE NO RECORD OF MY PURCHASE OF THE PART ALTHOUGH I HAVE GIVEN THEM MY INVOICE NUMBER. I STILL HAVE THE OLD PART AND THE ORIGINALS OF ALL MY INVOICES. *TR",
        "vin": "KNAGD124415"
    }
]