[
    {
        "components": "FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/16/2009",
        "dateOfIncident": "04/10/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265614,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S40",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "PURCHASED A VOLVO OVERSEAS IN 2005 AND IT RECENTLY BROKE DOWN LAST WEEK IN THE MIDDLE OF AN INTERSECTION.  I HAD IT TOWED TO THE VOLVO DEALER IN FORT WALTON BEACH AND THEY TOLD ME MY PART WAS FAULTY AND WILL HAVE IT RUNNING BY THE NEXT DAY.  I CALLED MY WARRANTY COMPANY AND THEY TOLD ME THAT PART HAD BEEN RECALLED AND VOLVO SHOULD PAY FOR IT BUT  THEY DENIED THERE WAS A RECALL AND CALLED IT AN EXTENDED WARRANTY. MY WARRANTY COMPANY AMERICAN GUARDIAN SENT A 3RP PARTY MECHANIC TO VOLVO AND VERIFIED IT WAS CORRODED.  THE RECALL IS ALL OVER THE WEBS/INCLUDING YOURS NHTSA CAMPAIGN ID #08V033000 SO I CALLED VOLVO AND THEY SAY THERE IS NO RECALL.  THE PART AND LABOR WAS $800.00.  MY VIN WASN'T LOADED IN THE US SYSTEM UNTIL THIS WEEK.  CURRENTLY THE VOLVO DEALER REPLACE THE PART AND MOVED IT TO A DIFFERENT LOCATION AND  SAYS IT CAN'T COVER IT UNLESS VOLVO PUT THAT SPECIFIC VIN NUMBER AND LOAD IT AGAINST IT (EXTENDED WARRANTY) BUT HOW IF THERE IS NO RECALL.  NEITHER VOLVO OR THE WARRANTY COMPANY WILL PAY FOR THE PART.  IF ITS AN OFFICIAL RECALL AND IT HAPPENED JUST LIKE THE DESCRIPTION ON THE RECALL STATES THEY SHOULD BE OBLIGATED TO COVER IT. ITS ONLY GOT 53000 MILES ON IT WHICH IS 3000 OVER THE MANUFACTURE WARRANTY.  I FEEL VOLVO NEEDS TO ADD MY VIN TO THE LIST BECAUSE OBVIOUSLY ITS A PROBLEM TO MINE ALSO.  I HAVE REFUSED TO PICK UP THE CAR THE LAST WEEK UNTIL I HEARD BACK FORM VOLVO BUT THEY SAID THERE IS NOTHING THEY CAN DO AND I HAVE TO PAY FOR IT. *TR",
        "vin": "YV1MS382052"
    }
]