[
    {
        "components": "STRUCTURE,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/02/2009",
        "dateOfIncident": "11/25/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE 11/08, WE NOTICED THE OVERHEAD CONSOLE LIGHT WOULD LEAK WATER AFTER VARIOUS RAINFALLS.  ON 12/1/08 WE TOOK THE SUV TO THE DEALER FOR SERVICE OF THIS MATTER.  IT WAS RELEASED TO US ON 12/3/08.  THE CORRECTION WAS: INSTALLED UPDATED DRAIN TUBES, AS PER 07-20-6.    ON 3/2/09 WE BROUGHT THE SUV TO THE DEALER FOR SERVICE, FOR THE SAME - OVERHEAD CONSOLE, DOME LAMP LEAKING, & FULL OF WATER, AND ROOF (HEADLINER) ABOVE REAR SEAT ON DRIVER'S SIDE LEAKING AND SOAKED WITH WATER AFTER VARIOUS RAINFALLS.  THE CORRECTION THIS SECOND TIME WAS: CLEARED DRAINS.  ON 3/30/09 WE BROUGHT THE SUV IN FOR SERVICE AGAIN.  IT HAD RAINED THROUGH THE NIGHT, AND THE MORNING OF 3/29/09.  THE DOME CONSOLE LIGHTS WERE LEAKING & HAD WATER INSIDE, THE ROOF HEADLINER ON THE REAR DRIVER SIDE WAS SOAKED & LEAKING WATER WELL INTO THE TRUNK AREA, AND THE RIGHT SIDE REAR BEHIND THE PASSENGER SIDE WAS SOAKED & LEAKING WATER WELL INTO THE TRUNK AREA AS WELL.  WE RECEIVED A PHONECALL FROM THE TECHNICIAN ON 3/31/09, STATING THAT NO LEAKS HAD BEEN FOUND, NO WATER STAINS VISIBLE.  WE WENT IN TO SPEAK WITH THE SERVICE MANAGER THAT EVENING, AND SHOWED THE PICTURES TAKEN BY US ON 3/29/09 - SHOWING EXTENSIVE WATER LEAKAGE.  THEY KEPT THE SUV TO FURTHER INVESTIGATE FOR LEAKS.  ON 4/2/09 WE RECEIVED A CALL FROM THE TECHNICIAN, STATING THE DRAINS WOULD BE REPLACED AGAIN.  THE CONSEQUENCES OF THESE EVENTS IS THAT I AM AFRAID TO ALLOW THE CHILDREN TO TURN ON THE DVD PLAYER, SUNROOF, & EVEN FEAR OF DRIVING THE VEHICLE FOR POSSIBLE FIRE HAZARD/ELECTRICAL SAFETY ISSUES.  MY HUSBAND HAS LOST DAYS @ WORK WHILE THE TRUCK IS IN SERVICE.  MY ASTHMATIC CHILD HAS NOT FELT WELL FOR MONTHS NOW, WHICH LEADS US TO SUSPECT IF DUE TO THE LEAKAGE, THUS WETNESS, IF MOLD IS PRESENT SOMEWHERE IN THE VEHICLE.  ALSO, THE DRIVER HEATED SEAT HAS NOT WORKED SINCE 12/09, WHICH LEADS US TO SUSPECT IF THE WATER DAMAGE HAS STARTED CAUSING ELECTRICAL PROBLEMS. *TR",
        "vin": "1FMEU65E96U"
    }
]