[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/14/2003",
        "dateOfIncident": "01/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002699,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAVALIER",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 1997 CHEVROLET, CAVALIER WHICH I TOOK DELIVERY ON JULY 28, 1997.  THE CAR IS NOW UNDRIVEABLE.  I WENT ON LINE TO THE GENERAL MOTORS RECALL LIST AND LOCATED A RECALL FOR CARS BUILT BETWEEN JANUARY 1, AND OCTOBER 31, 1997.   THE RECALL INVOLVES THE LOWER PINION BEARING IN THE POWER STEERING GEAR MAY SEPARATE, PERMITTING MOVEMENT OF THE PINION SHAFT.  REPORT INDICATE LOSS OF POWER STEERING.  THERE HAVE BEEN 15 REPORT OF CRASHES AND THREE INJURIES THAT MAY BE RELATED TO THE CONDITION, BUT NO FATAL INJURIES.    I CALLED GENERAL MOTORS, DESCRIBED TO THEM THE PROBLEM WITH THE CAR, WHICH I HAD TO HAVE TOWED TO MY HOUSE.  I GAVE THEM MY VIN # AND THE REPLY I GOT WAS THAT I AM NOT INVOLVED IN THE RECALL.  I HAVE RECALLS FOR MINOR REPAIRS BUT I AM NOT ON THIS RECALL LIST.  I AM A BIT DISTURBED WITH THIS REPLY.  MY VEHICLE WAS BUILT WITHIN THE TIME FRAME OF WHICH WAS DESCRIBED.  DUE TO THIS PROBLEM I WAS NEARLY IN A FATAL ACCIDENT.  I WAS TOLD TO HAVE THE REPAIRS DONE AND THEN IF MY CAR FELL UNDER THE RECALL I COULD FIGHT TO BE REIMBURSED.  SO WHAT THEIR TRYING TO TELL ME IS DRIVE THE CAR, WHICH CANNOT BE DRIVEN AT THIS POINT,  GET IN AN ACCIDENT THEN THEY DON'T HAVE TO PUT ME THE RECALL LIST BECAUSE THE CAR HAS BEEN TOTALED.  THIS IS A VERY POOR WAY OF TAKING CARE OF A PERSON'S LIFE WHEN THEY KNOW THERE IS SOMETHING WRONG WITH THE CAR. MEANWHILE WE HAVE NO MEANS OF TRANSPORTATION FOR WORK.    I FIRST HEARD ABOUT THIS RECALL ON THE NEWS ON TV BACK IN NOVEMBER 2002.    CAN YOU HELP?  PLEASE!!!!!!",
        "vin": "1G1JF5245V7"
    }
]