[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/20/2009",
        "dateOfIncident": "04/22/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS APRIL 22, 2009 AROUND 3PM WHEN I PULLED INTO THE LAUNDRY BASKET ON BROADWAY IN BANGOR, ME. I OPENED THE REAR PASSENGER DOOR TO TAKE THE DIRTY LAUNDRY OUT OF THE BACK AND THEN CLOSED THE REAR PASSENGER DOOR. I OPENED THE FRONT PASSENGER SIDE DOOR WHERE MY COUSIN WAS SITTING AND ASKED HIM TO HAND ME SOME MONEY FOR LAUNDRY. WHEN I SHUT THE FRONT PASSENGER DOOR ALL OF THE PASSENGER SIDE AIR BAGS WENT OFF STRIKING MY COUSIN IN THE HEAD. MY COUSIN AND I DROVE THE VEHICLE OVER TO DARLING'S HONDA IN BANGOR WHERE THEY WERE VERY HELPFUL. AFTER COMING TO AN AGREEMENT I WAS GIVEN A RENTAL CAR AND MY VEHICLE WAS TO BE INSPECTED AT NO COST TO ME. I REPORTED THE INCIDENT TO MY INSURANCE COMPANY AS WELL. AN ADJUSTER FROM MY INSURANCE COMPANY TOOK A LOOK AT THE CAR AND DETERMINED THAT IT WAS A MECHANICAL DEFECT IN THE CAR SO MY INSURANCE WILL NOT COVER THE REPAIRS. AFTER HONDA TOOK A LOOK AT THE CAR THEY WERE UNABLE TO DETERMINE WHY THE AIRBAGS WENT OFF AND HONDA AMERICA IS REFUSING TO COVER THE COST OF THE DAMAGES. MY COUSIN THAT WAS SITTING IN THE PASSENGER SEAT WHEN THE AIRBAG WENT OFF HAS A PREVIOUS HEAD INJURY THAT CAUSES HIM TO HAVE SEIZURES AND AFTER HE WAS STRUCK IN THE HEAD BY THE AIRBAGS, HE HAD A COUPLE OF SEIZURES THAT NIGHT. HONDA TOLD ME THEY ARE REFUSING TO FIX THE VEHICLE BECAUSE THAT WOULD BE ADMITTING FAULT AND THEY ARE AFRAID OF A LAWSUIT FROM MY COUSIN OR MYSELF. I HAD NO INTENTIONS ON FILING A LAWSUIT, I JUST WANT MY CAR FIXED. AFTER I GO MY CAR BACK FROM HONDA ALL OF THE WEATHER STRIPPING IS COMING OFF THE VEHICLE. THANK YOU FOR TAKING THE TIME TO READ THIS. *TR",
        "vin": "1HGCP26488A"
    }
]