[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/14/2003",
        "dateOfIncident": "01/07/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE END OF A 1320 MILE (ROUND) TRIP FROM FAIRFAX, VIRGINIA TO BRUNSWICK, GEORGIA AND BACK, THE LEFT FRONT WHEEL HUB SUDDENLY DISASSEMBLED, LOCKING UP THE WHEEL AND SENDING MY 2000 CHEVROLET SUBURBAN OUT OF CONTROL.  FORTUNATELY, I HAD LEFT I-95, WHER I HAD BEEN TRAVELLING FOR 10 1/2 HOURS AT 70 MPH, AND WAS TRAVELLING ON A SIDE ROAD.  THERE WAS NO WARNING.  THE WHEEL MADE A LOUD, GRINDING NOISE AND THEN IMMEDIATELY LOCKED UP.  UPON HAVING THE VEHICLE TOWED TO THE LOCAL CHEVROLET DEALER FOR REPAIR, THE TECHNICIANS EXAMINED THE WHEEL AND FOUND NO APPARENT REASON WHY THE WHEEL SHOULD HAVE DISASSEMBLED ITSELF.  I SEE NO OTHER OPTION OTHER THAN A DEFECT IN THE PRODUCT.  CONSIDERING THE WAY THAT THE VEHICLE HANDLED WHEN THIS HAPPENED, I AM SURE THAT IF IT HAD HAPPENED 10 MINUTES EARLIER, WHILE I WAS TRAVELLING ON I-95 AT 70 MPH, THE VEHICLE WOULD HVE CAREENED OUT OF CONTROL CAUSING MAXIMUM DAMAGE TO THE VEHICLE AND SERIOUS INJURY TO MYSELF AND FAMILY.  COINCIDENTIALLY, I HAD THE VEHICLE SERVICED JUST THE DAY BEFORE AT THE LOCAL CHEVROLET DEALER IN BRUNSWICK, GEORGIA, AND HAD REQUESTED THAT THE FRONT END BE EXAMINED PRIOR TO THE LONG DRIVE AHEAD AND DUE TO A RATTLE THAT I HAD NOTICED.  IT HAD ALSO BEEN CHECKED APPROXIMATELY 3 WEEKS PRIOR.  I WAS ADVISED THAT THERE WAS NOTHING OTHER THAN LUBRICATION THAT NEEDED TO BE DONE IN THE DRIVE SHAFT.  THERE WAS NOTHING UNUSUAL NOTICED WITH THE WHEELS, ETC.  THE FINAL NOTE IN THIS SITUATION IS THAT I HAVE PAID $570.80 FOR THIS DEFECT TO BE REPAIRED, AND BEEN WITHOUT MY VEHICLE FOR A WEEK.  AGAIN, THIS WAS A VERY DANGEROUS OCCURANCE, EVEN AT A SLOWER SPEED THAN I HAD TRAVELLED AT ALL DAY LONG.",
        "vin": "3GNEC16T3YG"
    }
]