[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2009",
        "dateOfIncident": "04/30/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "MAGNUM",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A COMPLAINT AGAINST THE CITY OF MONTGOMERY,AL, THE COUNTY OF MONTGOMERY, AL, THE STATE OF AL ETC..  I BEEN HAVING PROBLEMS WITH MY MAIL RUNNING 6 TO 20 DAYS NOT DELIVERED.  NOW I'M HAVING PROBLEMS WITH MY CAR.  HONESTLY I DON'T TRUST THE DEALER AND THERE SERVICE DEPARTMENT WHEN IT COMES TO MY SAFETY.  FURTHERMORE I MADE A COMPLAINT WITH THE DEPARTMENT OF JUSTICE WHEN IT CAME TO MY PRIVACY WHICH PERTAINS TO A GPS SYSTEM I FEEL WAS ATTACHED BY ALABAMA GOVERNMENT OFFICIALS BECAUSE OF THE CURRENT COMPLAINTS I HAVE AGAINST THEM.  I TOOK MY CAR IN ON 04/30/09 AT 1:00 PM FOR REPAIR AT THE BREWBAKER SERVICE DEPARTMENT. I WAS TOLD BY RONNIE A SERVICE REPRESENTATIVE THAT I WOULD GET MY CAR BACK THAT DAY AFTER A PART CAME IN.  I CHECKED ON MY CAR EVERYDAY UP TO KNOW 05/04/09.  RONNIE STILL UP TILL THIS DAY IS STATING HE IS WAITING ON A PART.  I SERIOUSLY THINK SOMETHING IS WRONG.  IT DON'T TAKE 5 DAYS TO REPAIR A CAR OR WAIT ON A PART FOR MINOR SERVICE WHICH RONNIE SAID WOULD TAKE AN HOUR TO REPAIR.  MORE IMPORTANTLY MY CAR HAS BEEN SITTING AT THIS SHOP FOR 5 DAYS FOR MINOR REPAIR AND I QUESTION THE SAFETY OF THE CAR BEING THAT I HAVE A COMPLAINT AGAINST ALABAMA GOVERNMENT OFFICIALS AND THE FACT MY PRIVACY IS BEING INVADED.  PLEASE LOOK INTO MY COMPLAINT AND JUST CONSIDER THIS A PREDETERMINATION IF I HAVE PROBLEMS WITH THIS CAR 2005 DODGE MAGNUM IN THE FUTURE.  THE COMPANY'S INFO IS BREWBAKER MOTORS CHRYSLER DODGE ETC DEALER, 300 EASTERN BYPASS, MONTGOMERY, AL 36117 (334)279-0174. *TR",
        "vin": ""
    }
]