[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2009",
        "dateOfIncident": "08/28/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAILBLAZER EXT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GOING OUT TO MY SUV WHICH IS A 2003 CHEVY TRAILBLAZER EXT TO OPEN THE BACK IT WAS COLD OUTSIDE BUT NO ICE WAS VISIBLE ON MY TRUCK OR ANYTHING I HEARD A CRACK I THOUGH IT WAS ICE EVEN THOUGH I DIDN'T SEE ANYTHING BUT NOTICED MY TAIL LIGHT COVER ON TOP LOOKED BROKE SO TOOK IT TO LOCAL CHEVROLET DEALERSHIP TO GET CHECKED THEY SAID YES IT IS CRACKED IT WILL COST YOU 1800 DOLLARS TO FIX I DID NOT HAVE THAT KIND OF MONEY FOR A LITTLE PIECE BUT GUY SAID YOU WILL BE FINE AS LONG AS THE LIFTGATE LIFTS WHICH IT DID IT SEEMED FINE THEN ON THE WAY TO OUR DESTINATION ONE DAY ON A MAJOR HIGHWAY THE PIECE FLEW HALF WAY OFF FLAPPING BEHIND US FREAKING OUT WE PULLED OVER TO THE SIDE WE HAD TO RIP IT OFF NO CHOICE OR WE WERE STUCK THEIR AND THE PIECE WOULD OF FLEW OFF AND CAUSED A MAJOR ACCIDENT. WELL IT IS STILL OFF UNTIL IT GETS REPAIRED BUT THIS JUST IN THE LAST WEEK  I SEEN 2 MORE TRAILBLAZER EXT WITH THE SAME PIECE MISSING JUST IN MY SMALL TOWN OF POTTSVILLE WHICH HAD ME THINKING THERE IS SOMETHING WRONG. BUT WHAT CONCERNED ME THE MOST WAS THE THIRD TRAILBLAZER EXT IN A WAL-MART PARKING LOT WITH THE PIECE BROKE BUT STILL ATTACHED.THAT PERSON  PROBABLY HAS NO IDEA THAT THE PIECE WILL PROBABLY FALL OFF WILL ON THE HIGHWAY WHICH COULD CAUSE A MAJOR ACCIDENT. I DID TALK TO THE LADY DOWN THE STREET FROM ME WHICH WAS ONE OF THE TRAILBLAZERS I SEEN AND ASK SHE SAID THE SAME THING THAT IT CRACKED WHEN OPENING THEN TOOK IT TO SHOP THEY SAID YOUR LUCKY THIS PIECE COULD HAVE FLEW OFF WHILE DRIVING. SO PLEASE INVESTIGATE THE 2003-2006 CHEVROLET TRAILBLAZER EXT. *TR",
        "vin": "1GNET16S036"
    }
]