[
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/02/2009",
        "dateOfIncident": "01/19/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "SABLE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 MERCURY SABLE IN SEPTEMBER, 2006. ON JANUARY 19, 2007 WHILE TURNING INTO MY DRIVEWAY GOING 3-5 MILES AN HOUR BOTH FRONTAL AIRBAGS DEPLOYED CAUSING AN ESTIMATED $3,000.00 TO $4,000.00 IN DAMAGES. THE DEALER HAS REFUSED TO ASSIST ME SAYING I BOUGHT THE CAR \"AS IS\".  THEY TOLD ME TO FILE THE CLAIM WITH MY INSURANCE COMPANY. THE INSURANCE COMPANY SAID THEY COULD DO NOTHING \"THERE WAS NO IMPACT\". FORD MOTOR COMPANY SAID THERE WAS A 50,000 MILE WARRANTY. YOUR DEPARTMENT SENT ME A SERVICE TECHNICAL BULLETIN STATING THAT FORD KNEW OF THIS PROBLEM IN MAY, 2002. I HAVE BEEN UNABLE TO GET ANYONE (IE: DEALER, INSURANCE  COMPANY, FINANCE COMPANY, OR MANUFACTURER)  TO HELP ME WITH THIS ISSUE.    IN FEBRUARY OF THIS YEAR 2009, THE FUEL PUMP, DRIVER, COMPUTER, AND TRANSMISSION WENT OUT IN THIS CAR. I HAVE SPENT OVER $1,600.00 IN REPAIR OF THIS VEHICLE .  DUE TO THE DEPRECIATION OF THE CAR, THE MECHANICAL FAILURES, AND THE SAFETY ISSUE OF NO AIRBAGS THE VEHICLE IS WORTH NOTHING. I STILL OWE THE FINANCE COMPANY $6,000.00 AND HAVE NOT BEEN ABLE TO DRIVE THE CAR FOR THE LAST 10 MONTHS. I WAS RECENTLY DIRECTED TO RESEARCH THE  CONSUMER RIGHTS ACT OF 1974, THE MAGNUSON-MOSS WARRANTY ACT, SALE OF GOODS ACT 1979, ALABAMA LEMON LAWS, BUYERS  REMORSE LAW, TRADE COMMISSION ACT, UNIFORM COMMERCIAL CODE, AND CONSUMER RIGHTS WHEN BUYING A USED CAR BY THE BBB.  I HAVE BEEN DENIED MY RIGHTS. NO CONSUMER SHOULD HAVE TO EXPERIENCE WHAT I HAVE. EVERY CONSUMER HAS THE RIGHT TO EXPECT A CAR THEY PURCHASE TO MEET REASONABLE STANDARDS. THERE WAS A GRAVE ISSUE OF SAFETY FOR ME  AND MY GRANDDAUGHTER WHEN THE AIRBAGS DEPLOYED. THANK GOD WE WERE NOT INJURED.    ALL OF THESE FAILURES HAVE SIGNIFICANTLY IMPAIRED THE USE, VALUE, AND SAFETY OF THIS VEHICLE!  THEY AROSE OUT OF THE ORDINARY USE OF THE VEHICLE AND NOT AS A RESULT OF ABUSE. THE MOTOR VEHICLE IS OUT OF SERVICE AND IN THE CUSTODY OF  THE DEALER DUE TO REPAIR ATTEMPTS, ONE OF WHICH OCCURRED DURING THE LEMON LAW RIGHTS PERIOD. *TR",
        "vin": "1MEFM50U52G"
    }
]