[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2009",
        "dateOfIncident": "04/20/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281314,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST READ THAT SOME VW'S ARE BEING RECALLED FOR A DSG TRANSMISSION DEFECT; I HAVE A 2009 JETTA SPORTSWAGEN THAT DOES NOT HAVE THE DSG AUTOMATIC TRANSMISSION, BUT I HAVE EXPERIENCED HESITATION AND A PERCEPTION OF STALLING WITH THE TRANSMISSION IN MY CAR ON SEVERAL OCCASIONS.  USUALLY WHEN I AM TAKING OFF FROM A QUICK STOP, THE CAR WILL HESITATE ALMOST AS IF IT WERE STALLING; USUALLY I LIFT UP ON THE GAS PEDAL AND WHEN I REAPPLY IT, THEN THE CAR WILL MOVE.  I HAD THE VW DEALER LOOK AT THIS AND THEY TOLD ME THAT IT WAS DUE TO THE ELECTRONIC CONTROLS OF THE TRANSMISSION GEARING AND THAT SOMETIMES THE TRANSMISSION DOESN'T \"KNOW\" WHAT GEAR TO CHOOSE TO MOVE FORWARD; THEY RESET THE TRANSMISSION MODULE SO THAT IT WOULD \"RELEARN\" MY DRIVING STYLE.  THIS IS A DANGEROUS PROBLEM IN THAT IF YOU'RE PULLING OUT INTO TRAFFIC, AND THE CAR HESITATES OR \"STALLS\" THIS CAN BE HIGHLY PROBLEMATIC.  THEREFORE, I ASK THAT YOU LOOK INTO A SIMILAR TRANSMISSION ISSUE WITH THE NON DSG AUTO TRANSMISSIONS ON THE JETTA. BY THE WAY, THE DEALER SAID THAT I WAS NOT THE FIRST PERSON TO COMPLAIN OF THIS PROBLEM.  I ALSO TEST DROVE A TIGUAN RECENTLY WHICH I WAS CONSIDERING BUYING AND ON THE WAY OUT OF THE DEALERSHIP, THE CAR LITERALLY STARTED TO SLOW DOWN JUST AS IF IT WERE STALLING - SO THIS PROBLEM DOESN'T SEEM TO BE RESTRICTED JUST TO MY CAR. *TR",
        "vin": "3VWTM71K69M"
    }
]