[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/02/2009",
        "dateOfIncident": "10/30/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290714,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NAME IS EARLENE BELSEY AND I AM A 79 YEAR OLD WIDOW. I OWN A 2001 HONDA ACCORD. IN 2002, THE HONDA MOTOR COMPANY SENT OUT A NOTICE NOTIFYING ALL HONDA ACCORD OWNERS THAT THERE IS A DEFECT IN THIS MODEL'S TRANSMISSION AND THE COMPANY WAS GOING TO EXTEND THE WARRANTY FOR AN ADDITIONAL \"SEVEN YEARS OR 100,000 MILES, WHICH EVER COMES FIRST.\" THEY DID NOT RECALL THIS MODEL CAR TO OBVIOUSLY SAVE MONEY.THEY STATED THAT \"IF YOU HAVE ANY PROBLEMS WITH YOUR TRANSMISSION DURING THIS EXTENDED WARRANTY PERIOD,JUST BRING YOUR CAR AND THEY WOULD REPLACE IT AT NO COST.\"  PROBLEMS THAT COULD OCCUR ARE  \" ABNORMALLY LOUD NOISES...EXTREMELY SLOW OR DELAYED GEAR ENGAGEMENT...ABNORMAL GEAR SHIFTING...ERRATIC HARSH SHIFTING...HARD SHIFTS WHEN ENGINE IS COLD\" WHICH IS JUST A FEW OF THE ISSUES LISTED. I ALWAYS KEPT THIS IN THE BACK OF MY MIND AND HOPED THAT NOTHING WOULD OCCUR.  SINCE THEY DID NOT TAKE ACTION TO RECALL THE CAR, I JUST HOPED A SAFETY ISSUE WOULD NOT ARISE. EVEN THOUGH THE MANUFACTURE SUGGESTS YOU DUE TRANSMISSION SERVICE AT 60,000 MILES, I ACTED CONSERVATIVELY KNOWING THERE COULD BE A POTENTIAL PROBLEM IN THE FUTURE, SO I SERVICED THE TRANSMISSION AT 30,000 MILES, AND AGAIN, HOPED THERE WOULD NOT BE AN ISSUE. ABOUT A WEEK AGO, MY TRANSMISSION STARTED SHIFTING ERRATICALLY.  I HAVE JUST 66,000 MILES ON THIS CAR, BUT THE SEVEN YEAR PART OF THE WARRANTY HAS EXPIRED ON THIS DEFECTIVE PRODUCT.  I ASKED MY SON IF HE COULD RESPOND TO THIS PROBLEM WITH MY CAR.  HE AGREED AND WAS DRIVING MY CAR TO THE HONDA DEALER AND WAS ALMOST KILLED ON THE FREEWAY BY A SEMI-TRUCK WHEN THE CAR FAILED TO SHIFT.  HE TOOK THE CAR TO THE HONDA DEALER AND THEY SUGGESTED TO FILE A CLAIM WITH CORPORATE WHICH HE DID ON FRIDAY, OCT 30TH. ON MONDAY NOV 2, 2009 CORPORATE OFFERED A \"HYPOTHETICAL OFFER OF A 25% DISCOUNT ON THE REPLACEMENT OF THE TRANS, WHICH WILL COST $3,000. I WANT 100%, REPLACEMENT AND THEY REFUSED. CAN YOU PLEASE HELP ME?  MY CASE # WITH HONDA IS N012009-10-3000303. PH 800 999-1009. *TR",
        "vin": "JHMCG66871C"
    }
]