[
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/17/2009",
        "dateOfIncident": "09/15/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "2008",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "C BODY",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "THE DODGE GRAND CARAVAN IS A GOOD CAR WHEN IT WANTS TO BE. WE BOUGHT IT THINKING IT WOULD BE A GOOD CAR FOR THE KIDS AND TURNED OUT TO BE A LEMON. TWO WEEKS AFTER WE BOUGHT THE VEHICLE BRAND NEW, THE ENGINE SHUT OFF WHILE RUNNING MID DAY. I HAD IT TOWED TO THE DODGE DEALER BECAUSE EVERYTIME I STARTED THE CAR AND PUT IT IN DRIVE IT WOULD STALL. THE DEALER INSPECTED THE VEHICLE THE NEXT MORNING AND FOUND NOTHING WRONG WITH IT. I PICKED IT UP AND TOOK IT HOME. ON THE WAY HOME IN THE HOT PART OF THE DAY, THE VEHICLE STALLED ON ME ON THE HIGHWAY. I IMMEDIATELY TOOK IT TOO THE DEALER AND TOLD THEM THEY NEEDED TO FIX IT. THEY CALLED ME A DAY LATER AND ACCUSED ME OF PUTTING ETHANOL IN THE VEHICLE. I TOLD THEM  TO GO '!@#$% THEMSELVES BECAUSE THERE ISN'T A GAS STATION WITH ETHANOL WITHIN 60 MILES OF MY HOUSE. I TOLD THEM TO DO WHAT THEY HAD TO DO TO FIX IT. THEY DRAINED THE FUEL SYSTEM AND TOOK OUT THE NEXT MORNING WITH NO PROBLEMS. I TOLD THE MANGER TO LET IT GOT HOT AND DRIVE IT TO AND FROM THE DEALERSHIP. HE DID JUST THAT AND TO HIS SURPRISE HE DIDN'T MAKE IT BACK TO THE DEALERSHIP. IT TURNS OUT IT WAS A COMPUTER CONTROL MODULE THAT WAS '!@#$% UP. WE HAVE TAKEN THE VEHICLE BACK TO THE DEALER FOUR TIMES BECAUSE OF BROKE LINKAGES AND ELECTRICAL PROBLEMS IN THE VEHICLE. IT HAS NOW BEEN 6 MONTHS SINCE THE VEHICLE HAS BEEN IN THE DEALER. IT HAS BEEN WORKING FINE \"KNOCK ON WOOD\". *TR",
        "vin": ""
    }
]