[
    {
        "components": "PARKING BRAKE,ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "11/25/2009",
        "dateOfIncident": "09/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY TRUCK TO THE LAIRD NOLLER FORD DEALERSHIP FOR A CAM SENSOR RECALL IN NOVEMBER 2008. THEY COULD NOT MAKE THE REPAIR THAT DAY AND MY APPOINTMENT WAS RESCHEDULED FOR AFTER CHRISTMAS 2008. THE DEALERSHIP TOLD ME THAT THERE WAS A RECALL ON THE PARKING BRAKE MODULE AND THEY WOULD REPLACE IT AT THE SAME TIME THEY REPLACED THE CAM SENSOR. APPROXIMATELY A WEEK AFTER CHRISTMAS (IT WAS A WEDNESDAY) I TOOK IT BACK IN FOR THE REPAIRS.  THEY TOLD ME THEY WOULD HAVE IT DONE AT THE END OF THE DAY, BUT AT THE END OF THE DAY THEY CALLED BACK AND SAID IT WOULD NOT BE DONE UNTIL THE NEXT WEEK. SO, THAT NEXT MONDAY (JANUARY 3RD ISH 2009) THEY CALLED, I WENT TO PICK UP MY TRUCK AND ALL THE RECALL REPAIRS WERE MADE.  EVERYTHING WAS GOOD UNTIL SEPTEMBER 17TH 2009. I HAD MY TRUCK PARKED IN MY DRIVEWAY, THE EMERGENCY BRAKE SET (IT HAS A MANUAL TRANSMISSON), SO IT WOULD WARM UP THAT MORNING. I WAS WALKING BACK TO MY HOUSE WHEN I HEARD A LOAD POP, I TURNED TO SEE WHAT WAS HAPPENING, AND MY TRUCK BEGAN ROLLING OUT OF MY DRIVE WAY AND SMASHED INTO A TREE.  CALLED MY INSURANCE COMPANY, TOLD THEM MY PARKING BRAKE MODULE BROKE AND THAT FORD HAD JUST REPLACED IT EARLIER IN THE YEAR. THEY TOWED MY TRUCK TO A BODY SHOP. I CALLED FORD NEXT, AND TOLD THEM ABOUT THE CRASH. THEY SAID THAT THEY WOULD GATHER ALL MY PAPER WORK AND MY INSURANCE COMPANY WOULD GET A HOLD OF THEM, AND THEY WOULD TALK WITH THEM ABOUT WHO WOULD PAY FOR THE DAMAGES. THEN I CALLED MY INSURANCE COMPANY, AND TOLD THEM WHO TO TALK TO. MY INSURANCE DECIDED THE PARKING BRAKE HAD FAILED, AND THAT I NEEDED TO TAKE IT TO FORD TO GET IT CHECKED OUT. FORD LOOKED AT IT, AND AGREED THAT YES THE PART (FACTORY RECALLED AND REPLACED PART) HAD FAILED, AND PROCEEDED TO PRICE ME A NEW ONE. THEY TOLD ME MINE WAS OUT OF WARRANTY. THE REPLACEMENT PART ALLEGEDLY HAD ONLY A 12 MONTH 12,000 WARRANTY, AND I WAS AT 10 MONTHS, 14,000 ON A PART THAT DOESN'T WEAR BECAUSE OF MILEAGE. THE PARKING BRAKE WAS NOT REPLACED AND FAILURE OCCURS DURING EVERY USE. *TR",
        "vin": "1FTWW32F1XE"
    }
]