[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/20/2004",
        "dateOfIncident": "01/09/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002727,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "BONNEVILLE",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1998 PONTIAC BONNEVILLE WHICH WAS BROUGHT INTO THE DEALER FOR REPAIR DUE TO NOT HAVING ANY HEAT IN THE CAR.  I EXPECTED A FAULTY THERMOSTAT OR SOME OTHER MINOR PROBLEM.  IT TURNED OUT THAT ENGINE COOLANT LEAKED OUT FROM THE PLENUM, WATER PUMP AND GASKETS REQUIRING REPLACEMENT OF THE WATER PUMP, WATER PUMP BELT, AND MANIFOLD (WITH THE VARIOUS GASKETS) MANIFOLD WAS ACTUALLY ROTTING FROM THE INSIDE DUE TO COOLANT LEAK INTO IT.  THIS REPAIR COST OVER $1,000.  UPON TALKING TO THE DEALER AND MY OWN INTERNET RESEARCH THIS IS A COMMON PROBLEM WITH THE GM 3800 ENGINE WHICH IS IN BONNEVILLES, GRAND PRIX AND BUICK LESABRE.  I REFERENCE NHTSA CONSUMER COMPLAINTS LISTED UNDER BONNEVILLE AND GRAND PRIX COMPLAINTS OF \"ENGINE COOLING SYSTEMS\" AND \"ENGINE.\" I ALSO DIRECT YOU TO EDMUNDS.COM \"TOWN HALL\" SECTION(BONNEVILLE AND GRAND PRIX)  THAT IS A CHAT ROOM THAT SHOWS NUMEROUS COMPLAINTS ABOUT THE EXACT SAME PROBLEM.  I GUESS I WAS LUCKY IN THAT AT LEAST MY ENGINE DIDN'T COMPLETELY SEIZE AS IS ALSO COMMON WHEN THE ANTIFREEZE COOLANT LEAKS INTO THE COMBUSTION CHAMBER.  GM WILL NOT REIMBURSE ME A DIME ON THE COST.  THIS CAR HAS JUST 36K MILES ON IT BUT IT IS 4 1/2YRS OLD AND THUS OUT OF WARRANTY. THE CAR HAS BEEN PROPERLY MAINTAINED, INCLUDING A DEALER OIL CHANGE JUST 2 MONTHS PRIOR TO THIS PROBLEM.  MY RESEARCH HAS SHOWN THAT THE ENGINE COOLANT LEAKAGE FROM THE PLASTIC GASKETS AND PLENUM INTO THE MANIFOLD AND COMBUSTION CHAMBER IS NOT AN ISOLATED INCIDENT AND NEEDS THE NHTSA TO INVESTIGATE THIS ISSUE FURTHER.  GM CUSTOMER SERVICE IS OF NO SERVICE AND THEY HAVE BASICALLY TOLD ME TO BUY JAPANESE FROM NOW ON.  *SC  *JB",
        "vin": "1G2HX52K7W4"
    }
]