[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "02/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COBALT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2006 CHEVY COBALT, NEAR 58,000 MILES, RECENTLY HAD THE POWER STEERING GO OUT ON IT. WHILE DRIVING, THE POWER STEERING SUDDENLY BECAME TIGHT AND DIFFICULT TO TURN. I LOOKED DOWN AND SAW \"POWER STEERING\" DISPLAYED ON THE DISPLAY. I WAS ABLE TO STEER IT HOME AND IMMEDIATELY BEGAN MY ONLINE RESEARCH. I READ THAT OFTEN TIMES TURNING THE CAR OFF AND THEN BACK ON WILL \"RESET\" IT. I WENT OUT AND TRIED IT AND IT WORKED. UNFORTUNATELY, IT ONLY LASTED ABOUT 10 MINUTES BEFORE I GOT THE MESSAGE AGAIN AND THE POWER STEERING CLICKED OFF. LUCKILY THERE IS A BIT OF A WARNING RIGHT BEFORE IT GOES OUT, YOU CAN HEAR A CLICK AND THEN 3 DINGS AND THEN IT LOCKS UP. IT HAS BEEN A WEEK NOW SINCE I FIRST STARTED HAVING THE ISSUE AND IT HAS PROGRESSIVELY GOTTEN WORSE WITH EACH DAY OF DRIVING, GOING FROM LASTING 10 MINUTES BEFORE FAILURE, TO LASTING ONLY 15-30 SECONDS. AFTER THE 3RD DAY I FINALLY GAVE UP ON IT AND BEGAN DRIVING MY OLDER MUCH MORE RELIABLE, DEPENDABLE CHEVY CAVALIER. TODAY I AM TAKING THE COBALT TO THE DEALERSHIP FOR REPAIRS. I WAS QUOTED A PRICE BETWEEN $450-$600 TO REPAIR. I FILED A COMPLAINT WITH GM AS WELL. THE MECHANIC AT THE DEALERSHIP INFORMED ME THAT THEY WERE WELL AWARE OF THE ISSUE AND HE SEES AT LEAST ONE IN PER MONTH WITH THE SAME ISSUE. THIS IS NOT VERY SAFE AND IS OBVIOUSLY A MAJOR ISSUE. I AM LUCKY TO BE ABLE TO HANDLE THE CAR WHEN THE STEERING GOES OUT, BUT WHAT ABOUT THOSE WITH DISABILITIES OR THE ONES WHO LACK THE UPPER BODY STRENGTH? THIS ISSUE NEEDS TO BE RESOLVED WITH GM BEFORE THEY HAVE A MUCH MORE FATAL ISSUE ON THEIR HANDS. THE CHEVY COBALT IS BY FAR THE WORSE VEHICLE I HAVE EVER OWNED WITH ALL IT'S ISSUES AND I HAVE LOST COMPLETE FAITH IN THE CHEVY NAME BECAUSE OF IT.  *TR",
        "vin": "1G1AK15F167"
    }
]