[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/18/2010",
        "dateOfIncident": "11/05/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/5/09 IN MID-AFTERNOON I WAS DRIVING MY 2005 PRIUS NORTH ON CALVERT ST. IN BALTIMORE CITY, JUST ABOVE SARATOGA ST., AT ABOUT 25 MPH WHEN THE TRAFFIC IN FRONT OF ME SLOWED.  AT THE TIME I WAS SPEAKING TO MY BOSS ON MY VERIZON CELL PHONE USING MY BLUETOOTH HEADSET.  I APPLIED MY BRAKES AND THE CAR WAS BRAKING AS USUAL SLOWING DOWN NORMALLY UNTIL ABOUT 10 MPH, OR SO, AT WHICH POINT I FELT THE CAR BOUNCE VERY SLIGHTLY AND GENTLY AS IF THERE WAS A SMALL GRADUAL DIP AND RISE IN THE ROADWAY SURFACE.  MY FOOT WAS STILL APPLYING LIGHT PRESSURE ON THE BRAKE PEDAL AS I INTENDED TO COME TO A NEAR CRAWL AS I NEARED THE CAR IN FRONT OF ME, BUT AFTER THE SLIGHT BUMP THE BRAKE PEDAL GRADUALLY WENT TO THE FLOOR AND MY CAR PROCEEDED WITHOUT ANY BRAKING IN EFFECT.  AFTER THE PEDAL WAS DEPRESSED TO A POINT NEAR THE FLOOR I PUMPED THE BRAKE PEDAL ONCE AND PRESS ON IT AS HARD AS POSSIBLE.  AT THIS POINT THE RIGHT REAR WHEEL BRAKE APPLIED AND THE RR TIRE SQUEALED AS IT APPEARS IT WAS THE ONLY ONE BRAKING.  I CONTINUED PRESSING UNTIL THE CAR CAME TO A STOP AT WHICH POINT I NOTICE THAT SEVERAL OF THE INSTRUMENT PANEL LIGHTS WERE NOW ON, INCLUDING THE ONES FOR THE BRAKE, THE ABS, AND VSC.  I THEN CONTINUED DRIVING SLOWLY HOME, ABOUT 2 MI., BECAUSE IT APPEARED THAT ONLY THE RR BRAKE WAS WORKING AND THAT THERE WAS NOT POWER ASSIST WITH THE BRAKING.  WHEN I GOT HOME I TURNED THE CAR OFF AND THEN BACK ON TO SEE IF THE PROBLEM PERSISTED, AND UPON RESTART THE BRAKES APPEARED TO WORK PROPERLY AND SOME OR PERHAPS ALL OF THE WARNING LIGHTS WERE OFF.    I TOOK THE CAR TO BILL KIDD TOYOTA IN TIMONIUM, MD ON 11/9/09 AND THEY REPORTED THAT SCAN CODE C1357 WAS PRESENT.  THEY REPORTEDLY CONTACTED TOYOTA TECH ASSISTANCE WHO INSTRUCTED THEM TO CLEAR THE SCAN CODES AND PERFORM LINEAR SOLENOID CALIBRATION.  THEY ROAD TESTED THE CAR AND SAID IT WAS OK TO DRIVE.  MY BOSS WAS ON THE PHONE WITH ME DURING THE ENTIRE INCIDENT AND HEAR THE RR TIRE SQUEALING AND WE DISCUSS WHAT WAS GOING ON.  I AM A MECHANICAL ENGINEER. *TR",
        "vin": "JTDKB20U850"
    }
]