[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "11/20/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    TO ADD SOME ADDITIONAL FUEL TO THE TOYOTA FIRE STORM.....I AM THE OWNER OF A 2005 TOYOTA COROLLA THAT RECENTLY HAD A \"COMPUTER PROBLEM\" DIAGNOSED AS A SHIFT SOLENOID PROBLEM.  THIS PROBLEM WAS A KNOWN ISSUE TO TOYOTA AND IT WAS SUCH AN ISSUE, THERE WAS A TSB (TECHNICAL SERVICE BULLETIN) WRITTEN TO HELP MECHANICS DIAGNOSE THE PROBLEM.  I STOPPED BY THE DEALERSHIP WHERE I PURCHASED THE VEHICLE (NEW) AND THEY TOLD ME TO CALL TOYOTA CUSTOMER SERVICE - WHICH I DID.  ALTHOUGH THEY ADMITTED TO AND RECOGNIZED THE PROBLEM, THEY SAID THEY WOULD ONLY PARTIALLY REIMBURSE PEOPLE WHO HAD LESS  THAN 80,000 MILES ON THE VEHICLES.  I HAD OVER THAT AMOUNT.  MY MECHANIC SAID IF I WERE TO TAKE IT TO A TOYOTA GARAGE, THEY WOULD JUST HAVE FIXED THE PROBLEM WITHOUT TELLING ME ABOUT IT, RATHER THAN HAVE A RECALL. THAT IS THE WAY THEY CIRCUMVENT THE SYSTEM AND HAVE HIGH QUALITY NUMBERS. THEY FIX THINGS WHILE THEY ARE IN THE SHOP FOR OTHER ROUTINE MAINTENANCE.  SINCE I DO ALL OF MY OWN MAINTENANCE - EXCEPT FOR MAJOR ITEMS - THEY  DIDN'T HAVE THE OPPORTUNITY TO FIX MY CAR.  I WOULD LIKE THIS TO BE ADDED TO THE EXPANDING FILE ON TOYOTA.  PERSONALLY, I THINK I SHOULD HAVE BEEN REIMBURSED FOR THE ALMOST $2000 IT COST TO REPLACE ONE OF THE FOUR SHIFT SOLENOID VALVES IN THE  TRANSMISSION AND THEN HAVE THE FAULTY COMPUTER REPLACED.  ESPECIALLY CONSIDERING THE FACT THAT THIS WAS A KNOWN AND DOCUMENTED PROBLEM WITH BOTH COROLLA'S AND  MATRIX'S.  THEY HAVE DONE THIS A LOT IN THE PAST AND SHOULD BE NAILED  FOR THIS AND OTHER EPISODES.  I CAN TELL YOU AS I TOLD THE LADY IN CUSTOMER SERVICE - THIS WAS THE  FIRST AND LAST TOYOTA VEHICLE I WILL EVER PURCHASE.  I PURCHASED THIS  PARTICULAR VEHICLE BECAUSE I DROVE FROM PEORIA TO INDIANAPOLIS WEEKLY FOR WORK AS A CONSULTANT AND IT HAD DECENT GAS MILEAGE.  I WILL PURCHASE A GM OR FORD PRODUCT GOING FORWARD.    [XXX] *TR",
        "vin": "1NXBR32E95Z"
    }
]