[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2010",
        "dateOfIncident": "04/02/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2004 CORVETTE WITH 27,630 MILES SUDDENLY BEGAN LEAKING GAS FUMES SO SEVERELY IN OUR GARAGE THAT WE WERE CONCERNED WE COULD HAVE AN EXPLOSION. WE ALSO COULD NOT SLEEP IN OUR BEDROOM AT THE OPPOSITE END OF OUR HOUSE DUE TO THE GAS FUMES. WE HAD NOT HIT ANYTHING OR HAD ANYTHING UNUSUAL HAPPEN TO OUR VEHICLE AND WE HAD A GM DEALER IN CHANDLER, AZ DETERMINE THERE WAS NO DAMAGE TO THE UNDERCARRIAGE OF THE CAR. THE DEALER DETERMINED THAT THE DRIVER'S SIDE GAS TANK HAD CRACKED NEAR THE TOP OF THE TANK. WE CONTACTED GM CUSTOMER SUPPORT AND AFTER WE WAITED A WEEK, WITH THE CAR AT THE DEALER'S LOT, GM DETERMINED THEY WOULD DO NOTHING! THEY REFUSED TO EITHER RECALL THE CORVETTE, ADMIT THERE IS A DEFECT IN THEIR GAS TANKS OR ASSIST FINANCIALLY IN REPLACING THE GAS TANK. WE THEN HAD THE GM DEALER REPLACE THE TANK AT A COST OF $1,991. THIS PRICE IS AFTER THE DEALER REDUCED THE COST BY GIVING US A 10% GOODWILL PRICE REDUCTION. DUE TO THE SERIOUS SAFETY DEFECT IN GM'S GAS TANK AND CROSSOVER SYSTEM, WE BELIEVE GM SHOULD IMMEDIATELY RECALL THE 2004 CORVETTES AS VARIOUS OTHER OWNERS HAVE REPORTED THAT THEIR DRIVER SIDE GAS TANK HAS CRACKED AND LEAKED FUEL AND GAS FUMES. THIS IS A SAFETY RECALL AND DEFINITE EPA ISSUE. THE VEHICLE AND OUR GARAGE CERTAINLY COULD HAVE EXPLODED AND THE VEHICLE WAS UNDRIVEABLE WHILE LEAKING FUMES. IT CERTAINLY COULD NOT HAVE PASSED AN EMISSIONS TEST. IS GM WAITING FOR AN EXPLOSION BEFORE THEY ACT? *TR",
        "vin": "1G1YY22G045"
    }
]