[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2003",
        "dateOfIncident": "12/17/2002",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002746,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 250 MILES AFTER THE 15,000-MILE MAINTENANCE, AT APPROXIMATELY 70 MILES PER HOUR ON I-95, THE ODYSSEY BEGAN JERKING, LUNGING AND CLUNKING. WE IMMEDIATELY PULLED OFF THE ROAD AND TELEPHONED AMERICAN HONDA MOTOR COMPANY CUSTOMER CARE. WE WERE TOLD TO PROCEED TO THE NEAREST HONDA DEALERSHIP IN FAYETTEVILLE, NC. A MECHANIC TOOK A FIVE-MINUTE TEST RIDE. THE VAN DID NOT REPLICATE THE JERKING AND CLUNKING AND WE WERE TOLD THERE WAS NOTHING THEY COULD DO AND WE SHOULD PROCEED ON OUR WAY. WE WERE ALSO TOLD THAT IF THERE WERE ANY PROBLEMS A INDICATOR LIGHT WOULD HAVE ILLUMINATED. THE SERVICE DEPARTMENT DID NOT LOOK UNDER THE HOOD OR CHECK ANY SYSTEMS.    TEN MINUTES LATER ON I-95, AT 60 MILES PER HOUR, THE JERKING AND CLUNKING RESUMED. WE CALLED AHMC CUSTOMER SERVICE AGAIN. AT SPECIFIC REQUEST (THE REPRESENTATIVE HAD NO CLUE WHICH DEALERS WERE CLOSE TO US) WE WERE GIVEN PHONE NUMBERS FOR OTHER DEALERSHIPS FURTHER ALONG OUR ROUTE, BUT, WHEN WE CALLED THREE DIFFERENT DEALERS, THEIR SERVICE DEPARTMENTS WERE CLOSED. WE STOPPED AT A GAS STATION AND CHECKED UNDER THE HOOD. THERE WAS NO TRANSMISSION FLUID ON THE DIPSTICK.     WE CALLED EAST COAST HONDA AND SPOKE WITH GUY EMERSON. WE ASKED GUY WHAT WAS DONE TO THE TRANSMISSION. ''WE DIDN''T TOUCH THE TRANSMISSION'' WAS GUY''S RESPONSE. WE CALLED AHMC CUSTOMER SERVICE AGAIN AND WERE TOLD THERE WAS NOTHING THEY COULD DO TO HELP US THOUGH WE WERE 70 MILES FROM HOME. THE GAS STATION DID NOT HAVE THE AUTOMATIC TRANSMISSION FLUID RECOMMENDED IN THE OWNER''S MANUAL AND AHMC CONCLUDED THAT WE COULD USE ''TYPE A'' TRANSMISSION FLUID AS A TEMPORARY REPLACEMENT. WE PUT IN SOME OF THE TRANSMISSION FLUID THE STATION STOCKED, AND GOT BACK ON THE ROAD. SOON THE VAN CONTINUED TO JERK, LUNGE AND CLUNK UNTIL WE GOT OFF I-95 AND PROCEEDED ON BACK ROADS IN THIRD GEAR (D3). WE MADE OUR WAY SLOWLY HOME AND, THE NEXT MORNING, WE CALLED THE DEALERSHIP THAT HAD SERVICED OUR ODYSSEY LESS THAN 48 HOURS AND 400 MILES EARLIER.",
        "vin": "5FNRL18952B"
    }
]