[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/15/2010",
        "dateOfIncident": "05/22/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336414,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AN UPDATE TO COMPLAINT # 10314227    I HAVE HAD TWO MORE SUA'S.  ONE WAS IN MAY WHEN I WAS PARKED AT A FAST FOOD RESTAURANT ON A SLIGHT UPWARD SLANT.  THE CAR WAS SLIGHTLY WARM.  IT WAS A DRY, COOL DAY.  WHEN I SHIFTED INTO REVERSE AND BEGAN TO ROLL BACKWARD, I PUT MY FOOT ON THE BRAKE TO PAUSE TO LOOK FOR TRAFFIC.  THEN THE MOTOR BEGAN TO RACE AS IF SOMEONE HAD FLOORED THE ACCELERATOR AND WAS HOLDING IT THERE.  AS MY FOOT REMAINED ON THE BRAKE, WHICH FORTUNATELY HELD, I LOOKED AROUND TO SEE IF ANYONE WAS WITNESSING THE EVENT SO I WOULD HAVE SOMEONE TO BACK ME UP, BUT NO ONE WAS NEAR.  IT STOPPED RACING AFTER A FEW SECONDS, THEN ABRUPTLY STARTING RACING AGAIN FOR A FEW SECONDS.  ALL THIS TIME I WAS IN REVERSE AND HAD MY FOOT ON THE BRAKE.  THEN IT SUDDENLY STOPPED.  I PUT IT INTO PARK FOR A WHILE TO SEE WHAT IT WAS GOING TO DO, BUT WHEN NOTHING HAPPENED I WENT INTO REVERSE AGAIN AND THE ENGINE DID NOT RACE.   THE SECOND OCCURRENCE WAS IN THE FIRST PART OF JUNE WHEN I HAD JUST GONE ABOUT 1/8 OF A MILE AND THE CAR WAS STILL COLD.  IT WAS A WARM, DRY DAY.  I WAS SITTING AT A LIGHT WAITING TO GET ON THE BELTLINE WHEN I HEARD WHAT SOUNDED LIKE A MOTORCYCLE NEARBY RACING ITS ENGINE.  MY RADIO WAS ON PLAYING MUSIC.  I  HEARD IT FOR A FEW SECONDS AND THEN IT STOPPED.  I LOOKED AROUND FOR THE MOTORCYCLE.  THEN IT STARTED AGAIN.  BY THIS TIME I REALIZED THAT IT WAS MY ENGINE THAT WAS RACING.  BY THE TIME I CUT THE RADIO OFF, IT HAD AGAIN STOPPED.  SO THIS WAS THE SECOND TIME THE SUA HAPPENED WHEN THE ENGINE WAS RELATIVELY COLD AND WITH TWO SHORT EPISODES OF THE RACING ENGINE.  I  DID NOT THINK TO LOOK AT THE TACHOMETER.  IT WAS TOO QUICK.  AGAIN, MY FOOT NEVER LEFT THE BRAKE.  WHEN THE LIGHT CHANGED I DROVE ON THROUGH THE TRAFFIC WITHOUT FURTHER INCIDENT.  PLEASE REFERENCE THIS COMPLAINT NUMBER TO MY OTHER COMPLAINT.  THANK YOU. *TR",
        "vin": "1NXBR32E18Z"
    }
]