[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/28/2010",
        "dateOfIncident": "06/17/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2003 LINCOLN NAVIGATOR. ON JUNE 17, 2010 WHILE DRIVING ON THE 605 FREEWAY, WE HEARD A LOUD NOISE AND THE CAR STARTED TO SHAKE TREMENDOUSLY THEN LOOSE POWER. THE CAR IS STILL RUNNING BUT COULD NOT PICK UP SPEED. A HUGE MACK TRUCK BEHIND US WAS BRAKING HARD TO AVOID HITTING OUR CAR. WE PULLED TO THE SIDE WITH THE CAR SHAKING AND RATTLING. LUCKILY, IT HAD ENOUGH POWER TO MAKE AN EXIT. A PRIVATE AUTO MECHANIC AT AUTO SHOP ARTESIA FOUND THAT THE SPARK PLUGS HAD BLOWN AND COMPLETELY DAMAGED THE CYLINDERS HEAD. MECHANIC STATED THAT HE HAD SEEN THIS MANY TIMES ON FORD VEHICLES. MECHANIC INSISTS THAT VEHICLE MUST BE TOW TO FORD DEALERSHIP FOR EXTENSIVE MAJOR REPAIR. MECHANIC RECOMMENDS NOT DRIVING THE VEHICLE AS IT MAY IGNITE IN FLAMES DUE TO FUEL LEAK. WHEN CAR ARRIVED AT CERRITOS FORD DEALERSHIP, LEAD TECHNICIAN CONFIRMED THAT IT IS A BLOWN SPARK PLUGS ISSUE WHICH DAMAGED THE CYLINDERS HEAD. REPAIR BILL IS QUOTED AT $4,500. CERRITOS FORD ALSO CONFIRMED THAT THIS IS AN A KNOWN DEFECTS ON FORD VEHICLES AND CAN NOT ASSIST WITH REPAIR COST DUE TO THE FACT THE FORD MOTOR COMPANY UNABLE TO COMPENSATE DEALERSHIP FOR THIS TYPE OF REPAIR.  WE CONTACTED FORD MOTOR COMPANY AND THEY REFUSED TO ASSIST WITH THIS MATTER.   MY CASH RESERVE IS FOR MY SON'S MONTHLY SCHOOL TUITION. I CAN NOT AFFORD TO HAVE THE EXPENSIVE REPAIR. PLEASE SOMEONE HELP US. THIS IS A KNOWN DEFECT ON FORD VEHICLES, BUT WE ARE NOT GETTING ANY ASSISTANT FROM FORD REGARDING THIS MATTER. *TR",
        "vin": "5LMFU27R53L"
    }
]