[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "07/22/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346214,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R SERIES",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW MOTORCYCLE FINAL DRIVE FAILURES. IN 2001 I PURCHASED A NEW BMW R1100RT. APPROXIMATELY ONE YEAR INTO OWNERSHIP 25K MILES THE FINAL DRIVE FAILED WHILE I WAS RIDING. I THOUGHT THE REAR WHEEL WAS FALLING OFF. I WAS ABLE TO GET THE BIKE STOPPED WITHOUT INCIDENT. I WAS TRAVELING APPROXIMATELY 70 MPH. THIS WAS A VERY DANGEROUS SITUATION, NOT ONLY WAS THE REAR WHEEL LEANING TO ONE SIDE THE WHOLE REAR HALF OF THE MOTORCYCLE WAS COVERED WITH OIL, RESULTING IN NON WORKING REAR BRAKE AND A OIL COVERED TIRE AND WHEEL. BIKE WAS REPAIRED . BUY THE TIME I MADE IT HOME FROM MY TRIP THE REAR DRIVE WAS FALLING APART AGAIN. FINALLY IT WAS REPAIRED AGAIN. AFTER THAT I LOST ALL CONFIDENCE IN THAT BIKE, THINKING HOW UNSAFE THE SITUATION WAS. IN 04 I TRADED THE BIKE IN ON A NEW BMW GS1150 ADVENTURE. WAS ON A EXTENSIVE TRIP THROUGHOUT THE WESTERN UNITED STATES. JUST LAST WEEK 7/21/10. HEADING HOME. WHILE NEAR STURGIS SD. I FELT A STRANGE VIBRATION WHICH WAS GETTING WORSE BY THE SECOND. I EXITED THE FREEWAY AT THE NEAREST EXIT, PULLING INTO A PARKING LOT I GOT OFF THE BIKE TO FIND THE WHOLE REAR HALF OF THE MOTORCYCLE COVERED IN OIL AND OIL RUNNING OUT OF THE FAILED FINAL DRIVE. ONCE AGAIN THIS A VERY DANGEROUS SITUATION ON A MOTORCYCLE. AFTER  A FEW DAYS IT WAS REPAIRED AND I MADE IT HOME OK. BMW KNOWS THERE IS A DESIGN FLAW IN THEIR FINAL DRIVE DESIGN RENDERING THEM SUSCEPTIBLE TO A FINAL DRIVE FAILURE. BUT THEY WILL NEVER ADMIT IT. WHEN THIS HAPPENS IT CREATES A VERY DANGEROUS SITUATION FOR THE RIDER, AS THERE IS USUALLY OIL ALL OVER THE BIKE, THE REAR WHEEL AND TIRE AND THE REAR BRAKES WHICH RENDER THEM USELESS. SOMETHING NEEDS TO BE DONE TO GET BMW TO ADMIT THIS VERY DANGEROUS PROBLEM AND FIGURE OUT HOW TO FIX IT. *TR",
        "vin": "WB10492A74Z"
    }
]