[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2010",
        "dateOfIncident": "12/03/2009",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2007 HONDA CIVIC HYBRID WOULD LOSE ITS BATTERY CHARGE AND IT WOULD TAKE 2 TO 3 MILES OF DRIVING TO RECHARGE THE BATTERY. DURING THIS RECHARGING TIME THERE IS NO ASSIST FROM THE ELECTRIC MOTOR WHICH IS SUPPOSE TO AID THE GAS ENGINE WHEN MORE POWER IS NEEDED SUCH AS MERGING INTO TRAFFIC OR MAKING A LEFT TURN WITH ON COMING TRAFFIC. THE OFFICIAL NAME OF THE BATTERY LOSING ITS CHARGE IS CALLED A RECALIBRATING. IT HAD HAPPENED TO ME ABOUT EVERY 5 TO 8 MILES OF DRIVING BUT IT IS RANDOM AND CAN HAPPEN AT THE MOST INOPPORTUNE TIME. THE BATTERY PACK IS CAUSING THE PROBLEM AS IT IS DETERIORATING. EVEN THOUGH I STILL HAD WARRANTY COVERAGE IN THE 3YR/36000 COVERAGE, HONDA REFUSED 5 TIMES TO REPLACE THE BATTERY.THE HONDA CIVIC HYBRID SHOULD NOT BE SOLD WHEN THIS IS HAPPENING TO SO MANY OWNERS. YES, THE CAR OPERATES WITHOUT THE ELECTRIC MOTOR ASSIST BUT WHEN YOU ARE EXPECTING MORE POWER FOR THE MANEUVER YOU ARE GOING TO DO AND THE RECALIBRATING KICKS IT IN IT CAN BE VERY DANGEROUS! I USED THE BETTER BUSINESS BUREAU AUTO LINE AND HAD MY PROBLEM ARBITRATED AND THE DECISION WAS MY CAR WAS A LEMON AND HONDA HAD TO REPURCHASE IT. THE ARBITRATOR RULED THE CAR A LEMON AND ONE REASON WAS IT WAS NOT SAFE TO DRIVE IN ALL NORMAL DRIVING SITUATIONS! GET THIS CAR OFF THE ROAD. THIS IS MY SECOND COMPLAINT ABOUT THIS MATTER. FOR THE FIRST COMPLAINT I DID NOT HAVE THE LEMON LAW DECISION BUT NOW I DO AND THIS CAR IS OFFICIALLY DECLARED A LEMON. *TR",
        "vin": ""
    }
]