[
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/30/2010",
        "dateOfIncident": "05/13/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10346314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COBALT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE RIGHT LANE ON TACONIC PKWY IN NEW YORK THE STEERING FAILED ON MY MOTHER'S CHEVY 2005 COBALT ON MAY 13, 2010.  SHE FELT A LOSS OF POWER OVER ALL AND  COULD NOT STEER TO KEEP THE CAR ON THE CURVED ROAD - CAR WENT OFF THE ROAD INTO THE WOODS AND CRASHED HEAD ON INTO A TREE.  PASSENGER WAS 81 YEAR OLD WOMAN.  EMS/FIRE HAD TO CUT HER OUT OF THE CAR AND SHE WAS TAKEN TO ST. FRANCIS HOSPITAL IN POUGHKEEPSIE WHERE SHE WAS IN THE IC UNIT FOR DAYS.  IT WAS HOURS BEFORE SHE COULD EVEN SPEAK TO ADVISE DOCTORS TO SEND FOR HER FAMILY.   SHE SUFFERED FROM BROKEN RIBS, CRUSHED CHEST, DISLOCATED SHOULDER, FACIAL AND BODY WOUNDS.  THE CAR WAS RECALLED THE MONTH PRIOR BUT CHEVY DEALER (YONKERS) ADVISED THEY HAD NOT GOTTEN THE OK FROM GM TO PAY FOR THE REPAIR (STEERING) ON 2005 CHEVY COBALTS.  GM KNEW OF THIS STEERING PROBLEM FOR YEARS - EVEN WHEN THE RECALL WAS OFFICIAL THE CHEVY DEALER WOULD NOT MAKE THE REPAIR.  GM IS RESPONSIBLE FOR THIS.  MY MOTHER WAS INJURED BADLY AND NEARLY KILLED.  I HAVE CALLED THIS DEALER MORE THAN ONCE SINCE THE MAY 13, 2010 ACCIDENT AND THE LAST CALL IN JUNE THEY WERE STILL STATING THEY DID NOT GET WORD FROM GM TO PAY FOR THE STEERING DEFECT ON THE CHEVY 2005 COBALT!!!  SOMETHING NEEDS TO BE DONE WHEN THERE IS A RECALL AND THE DEALERS REFUSE TO MAKE THE REPAIRS.  THE CHEVY 2005 COBALT SHOULD HAVE BEEN RECALLED IN 2006 OR 2007 NOT APRIL OF 2010.    I WILL DO EVERYTHING IN MY POWER TO WORK WITH NHTSA TO INVESTIGATE THIS MATTER.  I AM RESPECTFULLY ASKING FOR HELP FROM NHTSA TO HAVE ONE OF THEIR ENGINEERS CHECK THE CRASHED (TOTALED) REMAINS OF MY MOTHERS CAR.  I HAVE NOT SIGNED TITLE OVER.  PLEASE HELP ME WITH THIS. *TR",
        "vin": "1G1AK52F957"
    }
]