[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2010",
        "dateOfIncident": "07/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2005 CHEVY IMPALA AND FOR THE LAST YEAR MY SPEEDOMETER HAS FAILED ON SEVERAL OCCASIONS. THE SPEEDOMETER WILL JUMP WITHOUT WARNING LEADING TO UNSAFE TRAVELING CONDITIONS ESPECIALLY WHILE TRAVELING ON HIGHWAYS. CYCLING THE IGNITION WILL TEMPORARILY FIX THE ISSUE BUT THIS HAS BECOME A HASSLE. WHEN I STARTED TO RESEARCH THE ISSUE ON THE INTERNET I FOUND HUNDREDS OF COMPLAINTS ON THE SAME ISSUE. I ALSO FOUND WHERE THERE WAS A CLASS ACTION LAW SUIT THAT FORCED THE REPAIR OF THE SAME PROBLEM ON OTHER VEHICLES FOR THE SAME MODEL YEAR RANGE. WHY DO WE AS CONSUMERS HAVE TO PAY FOR AND FIX THE PROBLEM WHEN IT IS AN OBVIOUS DEFECT IN MANUFACTURING? WHY DIDN'T THE CLASS ACTION LAWSUIT ALERT THE NHTSA THAT THIS IS POTENTIALLY A BIGGER PROBLEM? DO WE HAVE TO WAIT FOR DEATHS LIKE THE TOYOTA RECALL BEFORE SOMEONE TAKES THIS SERIOUSLY? IMAGINE THAT YOU THINK YOU ARE TRAVELING AT A SAFE RATE OF SPEED ON ICE COVERED ROADS WHEN IN REALITY YOU ARE NOT BECAUSE OF DEFECTIVE ELECTRONICS' HMMM. I REFUSE TO PAY FOR A KNOWN DEFECT, US CONSUMERS ARE ENTITLED TO PROTECTION FROM A BLATANT DISREGARD TO MANUFACTURING STANDARDS AND SAFETY. I WELCOME YOUR RESPONSE. HTTP://WWW.TOPIX.COM/FORUM/AUTOS/CHEVROLET-IMPALA/TJSMIQPD8J0FT5DK8    HTTP://WWW.CARCOMPLAINTS.COM/CHEVROLET/IMPALA/2005/ACCESSORIES-INTERIOR/SPEEDOMETER_CLUSTER_GAUGES_GONE_HAYWIRE.SHTML   HTTP://WIKI.ANSWERS.COM/Q/HOW_DO_YOU_CHANGE_THE_SPEEDOMETER_ON_A_2005_CHEVY_IMPALA    HTTP://WWW.JUSTANSWER.COM/QUESTIONS/JHFU-I-HAVE-A-2005-CHEVY-IMPALA-THE-SPEEDOMETER-WORKS-CORRECTLY   HTTP://WWW.2CARPROS.COM/FORUM/2005-CHEVY-IMPALA-SPEEDOMETER-DOES-NOT-WORK-ALL-THE-TIME-VT115821.HTML   HTTP://WWW.ARFC.ORG/COMPLAINTS/2005/CHEVROLET/IMPALA/?Q=&PAGE=5    HTTP://TOWNHALL-TALK.EDMUNDS.COM/DIRECT/VIEW/.EE9E83D/13472    HTTP://WWW.GMSPEEDOMETERRECALL.COM/. *TR",
        "vin": "2G1WF52E659"
    }
]