[
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "12/19/2002",
        "dateOfIncident": "12/18/2002",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000263,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL STICKS RANDOMLY, CAUSING UNWANTED RAPID ACCELERATION. HAPPENS ANYTIME, ANYWHERE WITHOUT WARNING. I HAVE COME VERY CLOSE TO HITTING MANY CARS IN PARKING LOTS AND WHILE DRIVING IN STOP-AND-GO TRAFFIC. I FIRST NOTICED IT A COUPLE MONTHS AFTER I PURCHASED THE CAR, BUT THE DEALER SERVICE REP TOLD ME IT WOULD GO AWAY IN TIME. A YEAR LATER, I WAS STILL HAVING THE SAME PROBLEM. I HAD MOVED BY THEN SO I CONTACTED A DIFFERENT DEALER, WEIR CANYON HONDA IN ANAHEIM HILLS, AND I HAD TO FIGHT WITH THE GUY AT SERVICE TO REPAIR IT UNDER WARRANTY. AFTER GETTING THE RECEIPT, I NOTICED THAT THEY HAD ONLY COMPLETED ONE OF THREE PROCEDURES THAT THEY EXPLAINED TO ME AND TRIED TO CHARGE ME FOR. AS I DROVE OUT OF THE SERVICE CENTER, IT GOT STUCK AGAIN AND I ALMOST HIT ONE OF THEIR NEW CARS (IF I HAD, MAYBE THEY WOULD BELIEVE ME). I PUT UP WITH IT FOR A COUPLE MORE MONTHS AND FINALLY TOOK IT BACK AGAIN. THEY TOLD ME THERE WOULD BE A CHARGE, ALTHOUGH THEIR SERVICE IS UNDER WARRANTY FOR 12 MONTHS OR 12000 MILES. I EXPLAINED THAT THE SERVICE MANAGER WAS AWARE OF THE ISSUE AND HAD PROMISED TO DO WHATEVER NECESSARY TO RESOLVE THE PROBLEM. THEY GRUDGINGLY AGREED TO PERFORM ALL THREE STEPS OF THEIR NORMAL SERVICE FOR THIS PROBLEM BUT TOLD ME IT WAS JUST A 'ONE TIME COURTESY' AND THAT FUTURE PROBLEMS WOULD BE MY RESPONSIBILITY. THE SERVICE REP INSISTED THAT 'HONDA DOES NOT MAKE PARTS THAT CAUSE SUCH PROBLEMS' AND ACCUSED ME OF CAUSING THE PROBLEM BY THE WAY I DRIVE. I HAVE MY CAR BACK, BUT I'M WONDERING IF AND WHEN IT WILL START HAVING PROBLEMS AGAIN, AND IF SO, WHETHER THEY WILL HONOR THEIR SERVICE WARRANTY.",
        "vin": ""
    }
]