[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/02/2010",
        "dateOfIncident": "08/25/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353514,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE PERIOD OF AUGUST 17-27, I RENTED A 2011 TOYOTA CAMRY.  I RENTED IT FROM HERTZ AT THE DENVER INTERNATIONAL AIRPORT.  ON AUGUST 25, WHILE TRAVELING EAST ON US 70, ABOUT 10 MILES WEST OF FRISCO, COLORADO, THE CAR'S ENGINE STOPPED AND THE DASH WENT BLANK, NO WARNING OR ANYTHING.  THIS WAS VERY ANNOYING FOR MY PASSENGERS AND ME, GOING FROM 65-70 MPH TO -0- IN A MATTER OF SECONDS.  FORTUNATELY I WAS ABLE TO PULL ON TO THE BERM AND OUT OF THE WAY OF ONCOMING SEMIS, MOST OF WHOM WERE ABLE TO PULL INTO THE PASSING LANE.     I THOUGHT THAT MAYBE THE CAR OVERHEATED AS I HAD BEEN DRIVING FOR SEVERAL HOURS WITH THE AC ON AND THE ROAD IS A MOUNTAINOUS ROAD.  I LET THE CAR COOL FOR A FEW MINUTES, MADE SURE THE AC WAS OFF.  I STARTED THE CAR AND 'EVERYTHING' CAME TO LIFE.  I DROVE UP THE REMAINDER OF THE HILL, KEEPING THE SPEED AT APPROXIMATELY 55MPH, DOWN THE NEXT AND STARTED UP WHEN THE SAME THING HAPPENED ' COMPLETE LACK OF POWER.  AGAIN VERY ANNOYING!!!    AFTER THIS LAST EPISODE WE CALLED YOUR OFFICE AND WERE TOLD TO WAIT ON THE SIDE OF THE ROAD FOR A REPLACEMENT. AS WE HAD A SCHEDULED ENGAGEMENT IN FRISCO, AND A FRIEND WHO COULD DRIVE OUT 10 MILES TO PICK US UP, THE AGENT TOLD US TO LEAVE THE CAR ON THE SIDE OF THE ROAD.  THE AGENT SAID A CAR WOULD BE DELIVERED TO OUR HOTEL IN FRISCO.  THE CAR WAS DELIVERED TWO AND A HALF HOURS LATER.      AND ONE MORE THING.  I AM NOT SURE BUT I THINK THE BRAKES DID NOT WORK THE FIRST STALL TIME.  I THINK THE CAR STARTED TO ROLL BACKWARD BEFORE I GOT IT FROM DRIVE TO PARK I WAS CAUGHT BY SURPRISE THE FIRST TIME AND A LITTLE SLOW TO REACT TO THE STALL.  THE SECOND TIME AS SOON AS IT STALLED I PULLED OVER TO THE SIDE AND PUT IT INTO PARK.     HERTZ VEHICLE INFO:  VEHICLE   [XXX]   2011 CAMRY  LIC CO [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": ""
    }
]