[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "09/19/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356614,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "335I",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS 2007 MODEL BMW 335I COUPE.  I WAS ON THE FREEWAY 405 GOING APPROXIMATELY 70 MILES PER HOUR. THEN SUDDENLY AN ENGINE WARNING LIGHT \"ENGINE MALFUNCTION\" SIGN COMES UP WHICH LOWERS THE RPM AND THE SPEED OUTPUT OF THE ENGINE TO AROUND 30~ 40. I HAVE TO QUICKLY MERGE THE VEHICLE FROM THE INNER LANES TO THE RIGHT GOING ONTO THE CURB SINCE THERE WAS NO CURB ON THE INNER LANES. AFTER APPROXIMATELY 3 MINUTES AS I SLOWLY GUIDED MY VEHICLE TO THE SIDE, THE ENGINE SHUTS OFF ON ITS OWN WITH STUTTERING SOUND AND ENGINE CRANKING. I RESTARTED THE ENGINE SEVERAL TIMES TO NO AVAIL. I WAS EXTREMELY DANGEROUS AS THE SUDDEN SLOW DOWN AND ENGINE SHUT OFF MIGHT HAPPEN WHEN I AM IN THE MIDDLE OF THE FREEWAY AND THE CARS BEHIND OR NEXT TO ME MIGHT EASILY HIT ME WITH TYPICAL FREEWAY SPEED OF 70 MPH.   I CALLED THE TWO TRUCK AND HAD THE VEHICLE TOWED TO A BMW CENTER. THEY INSPECTED THE VEHICLE AND BELIEVED THAT THE HIGH PRESSURE FUEL PUMP IS BAD AND WILL REPLACE THE FUEL PUMP FOR ME. IT APPEARS TO BE THAT THIS VERY SAME ISSUE APPEARED QUITE OFTEN TO A NUMBER OF 335I OR OTHER BMW MODELS USING THE SAME ENGINE, IN PARTICULAR TO THE 07 AND 08 MODELS. MORE OVER, A LOT OF THE CAR OWNERS HAVE THE SAME ISSUE HAPPENED TO THEM EVEN AFTER THEIR FUEL PUMP REPLACED ONCE OR EVEN TWICE. IT SEEMS LIKE THERE IS NO ABSOLUTE FIX FOR SUCH ISSUE AND IT POSES AS A TREMENDOUS DANGER FOR BMW DRIVERS WITH THIS SPECIFIC ENGINE SINCE YOU CANNOT BE CERTAIN WHEN HE PROBLEM WILL RE-OCCUR.    SIMILAR COMPLAINS HAVE BEEN FILED AND THE ACTION CAN BE REFERRED HERE NHTSA ACTION NUMBER: PE08032. *TR",
        "vin": "WBAWB735X7P"
    }
]