[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "09/14/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CELICA",
                "productYear": "1998",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "LIFELINER TOURING SLE",
                "productYear": "9999",
                "size": "205/55R15",
                "type": "Tire"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS COOPER LIFE LINER SLE TIRES P205/55R 15 ON A 1998 TOYOTA CELICA.  THE CONTACT STATED WHILE DRIVING 65 MPH THE VEHICLE STARTED SHAKING RANDOMLY, SO THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD.  THE CONTACT LOOKED AT THE TIRES AND SAW NO DAMAGES.  THE CONTACT RUBBED HER HAND ON THE FRONT DRIVER'S SIDE TIRE AND NOTICE A BUBBLE HAD DEVELOP ON THE INSIDE TREAD.  THE CONTACT REPLACED THE TIRE WITH THE SPARE AND TOOK THE VEHICLE TO A DEALER.  THE DEALER NOTICE THE TREAD SEPARATION ON THE FRONT DRIVER'S SIDE TIRE AND RECOMMENDED THE TIRE BE REPLACED.  THE DEALER INFORMED THE CONTACT THEY DO NOT SUPPLY A WARRANTY ON COOPER TIRES DUE TO THE PROBLEMS THEY HAVE AND THEY DO NOT SALE THAT BRAND.  THE CONTACT CALLED THE  MANUFACTURER REGARDING THE TIRES AND THE MANUFACTURER STATED THEY WILL ONLY COVER WHAT IS LEFT OF THE TREAD ON THE TIRES. THE CONTACT STATED THE MANUFACTURER SHOULD REPLACED THE TIRES SINCE THIS IS A MANUFACTURER DEFECT AND DOES NOT FEEL SAFE DRIVING WITH THE THREE REMAINING TIRES ON THE VEHICLE.  THE FAILURE MILEAGE WAS 24,000.",
        "vin": "JT5FG02TXW0"
    }
]