[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/23/2010",
        "dateOfIncident": "09/21/2010",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357114,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN VISORS (BOTH DRIVERS AND PASSENGER ) SPLIT AT THE TOP SEAMS WHERE THEY ARE GLUED TOGETHER, MAKING IT IMPOSSIBLE FOR VISORS TO STAY UP; THUS OBSCURING THE VISION OF BOTH THE DRIVER AND PASSENGER. THIS IS THE SECOND TIME THE PASSENGER SUN VISOR HAS BEEN REPLACED FOR THE SAME DEFECT WHICH IS A MANUFACTURING, DESIGN, AND ENGINEERING DEFECT.   I WAS ADVISED BY SEVERAL HONDA EMPLOYEES THAT NUMEROUS SUN VISORS ARE REPLACED ON A WEEKLY BASIS FOR THE IDENTICAL DEFECT, JUST AT ONE DEALERSHIP. THIS IS NOT A DEALERSHIP ISSUE BUT A HONDA ISSUE. IT IS TO BE NOTED THAT THE SUN VISORS WERE IN NO WAY ABUSED OR EVEN USED THAT MUCH BUT THE SEAMS JUST SPLIT.  I HAVE BEEN IN LAW ENFORCEMENT FOR OVER THIRTY YEARS AND CAN ASSURE YOU THAT THIS DEFECT NOT ONLY AFFECTS THE INDIVIDUALS IN THE HONDA WITH THE DEFECTIVE SUN VISORS BUT OTHER DRIVERS AND PEDESTRIANS AS WELL, RESULTING FROM THE OBSCURED VISION,  I WAS ADVISED THAT HONDA IS AWARE OF THE DEFECT BUT CONTINUES TO USE THE SAME SUN VISORS IN NEW VEHICLES AND THAT THEY CONTINUE TO FAIL BY SPLITTING AT THE SEAMS  THERE WAS NO RESULTING ACCIDENT, I WAS ADVISED THAT THE SUN VISORS WOULD HAVE TO BE RETURNED TO HONDA BUT I DID PHOTOGRAPH THEM AND THE PHOTOS ARE AVAILABLE. IT IS TO BE NOTED THAT THE SERVICE DEPARTMENT AT THE DEALERSHIP WAS EXCELLENT AND THAT HONDA DID REPLACE THEM AT A REDUCED COST EVEN THOUGH THE VEHICLE HAD APPROXIMATELY 51,000 MILES ON IT AND WAS OUT OF WARRANTY. *TR",
        "vin": "1HGFA16827L"
    }
]