[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2010",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COBALT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON EXITING VEHICLE, NOTICED EXTREMELY STRONG SMELL OF GAS ON 9/1/10.  GAS SMELL DID NOT DISSIPATE, AND IN FACT GOT STRONGER OVER THE PERIOD OF ONE WEEK.  NOTICEABLE INSIDE AND OUTSIDE THE CABIN.  MILEAGE AT TIME OF FAILURE WAS APPROXIMATELY 72500.  SPOKE WITH DEALER ABOUT PROBLEM, TOLD THAT IT DID NOT FALL UNDER CURRENT RECALL CONDITIONS AND THERE WAS NOTHING THEY COULD DO.  HAD MECHANIC LOOK AT IT, WHO CONFIRMED THAT THE FUEL PUMP MODULE NEEDED REPLACED THE LINES ATTACHED TO IT HAD CRACKED AND WAS LEAKING FUEL ON THE TOP OF THE TANK.  EXTREME FIRE HAZARD.  REPAIRS WERE $760.  FUEL PUMP MODULE WAS REPLACED AFTER DIAGNOSTICS AND HAVING THE TANK DROPPED.  PART AVAILABLE.  EXACT DESCRIPTION OF PROBLEM FALLS UNDER THE NHTSA CAMPAIGN 09V419000 RECALL.  CAR IS NOT IN RECALL STATE, BUT ISSUE HAS BEEN INDICATED TO BE RELATED TO HIGH HEAT.  HEAT IN CURRENT STATE (WV) HAS BEEN 90+ DEGREES FOR MORE THAN 2 MONTHS.  DEALER DID NOT LOOK AT RECALL, ONLY AT THE VIS WHICH DID NOT INCLUDE MY CAR'S VIN, APPARENTLY.  THIS IS AN EXTREME SAFETY ISSUE, AND SHOULD BE EXPANDED TO INCLUDE ALL 2006 CHEVY COBALTS WHO HAVE SIMILAR PARTS IN THEIR CAR.  THE STATE SPECIFIC RECALL HAS BEEN INDICATED IN NUMEROUS COMPLAINTS ABUNDANT ON THE INTERNET TO BE A FALSE, AS PEOPLE ARE AFFECTED NATIONWIDE.  GM CLAIMS THAT SAFETY IS THEIR NUMBER ONE CONCERN, BUT THEY DO NOT (ACCORDING TO THE REP I SPOKE WITH ) HAVE AN ONGOING INVESTIGATION INTO WHETHER THEY SHOULD EXPAND THIS RECALL INTO OTHER STATES.  THIS IS APPALLING AND NEEDS LOOKED INTO BY SOMEONE WHO HAS THE CONSUMER'S SAFETY IN THEIR BEST INTEREST. *TR",
        "vin": "1G1AK55F867"
    }
]