[
    {
        "components": "ELECTRICAL SYSTEM,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/30/2010",
        "dateOfIncident": "09/22/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363014,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "COMMANDER 4X4",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "FORTERA HL (P)",
                "productYear": "9999",
                "size": "P225/60R17",
                "type": "Tire"
            }
        ],
        "summary": "MY 2007 COMMANDER, RECENTLY KEEPS ALARMING ME SERVICE PARK ASSIST WHILE LIGHTING UP ALL THE DRIVE BOXES, WHILE IM DRIVING.  WHEN IT DOES THIS I CANNOT GIVE THE CAR GAS SO I HAVE TO PULL OVER, SHUT THE CAR OFF AND TURN IT BACK ON.  ITS BEEN DOING THIS ON AND OFF FOR THE PAST COUPLE OF MONTHS.  USUALLY THE CHECK ENGINE LIGHT COMES ON, I WILL TAKE IT TO THE REPAIR SHOP AND WHEN THEY HOOK IT UP TO THE TESTER, IT DOESN'T TELL THEM ANYTHING IS WRONG AND THEY MANUALLY SHUT THE CHECK ENGINE LIGHT OFF.  THE LATEST INCIDENT I WAS DRIVING ON THE TURNPIKE AND IT DID THIS, I WAS TERRIFIED BECAUSE MY TWO KIDS WERE WITH ME AND I HAD TO CUT OVER THREE LANES, PULL OFF AND SHUT THE CAR DOWN AND RESTART IT.  TODAY ALL THE DRIVE OPTIONS WERE BOXED IN WHILE I WAS DRIVING BUT THE ENGINE LIGHT NEVER EVEN CAME ON, IT JUST WOULDN'T LET ME GAS AND I HAD TO DO THE SAME THING PULL OVER, SHUT OFF AND RESTART.  MY TIRES ARE ALSO SHOWING UP FOR LOW PRESSURE, AND THE TIRE DEALER TOLD ME THE TIRES ON THIS MODEL ARE KNOWN FOR SMALL HOLES AROUND THE OUTSIDE RING OF THE TREAD, WHICH OF COURSE CANNOT BE FILLED. *TR",
        "vin": "1J8HG48K97C"
    }
]