[
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/15/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360714,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER 32,000 MILES MY 2007 NISSAN MURANO DOOR LOCKS BEGAN OPENING A CLOSING WHILE DRIVING. THIS BEGAN AFTER REPLACEMENT OF BATTERY BY DEALER.   THE DOOR LOCKS OPEN AND CLOSE WITH NO WITH NO SPECIFIC TIMING. SOMETIMES CLICKING OCCURS IMMEDIATELY OTHER TIMES AFTER A HALF HOUR OF DRIVING. WENT TO DEALER AND THEY COULD NOT DUPLICATE. NOW PASSENGER DOOR AND REAR DOOR LOCKS DO NOT UNLOCK UNLESS DOUBLE CLICK OF THE DOOR SWITCH ON DRIVERS DOOR.   DEALER SUGGESTED I RETURN TO REPLACE THE ACTUATOR. I AM CONCERNED THIS MAY BE VERY EXPENSIVE. THIS SHOULD BE A VEHICLE RECALL DUE TO THE LOW MILES YEAR AND MAKE OF VEHICLE. SO WHY IS IT A SAFETY ISSUE?     1. HAVING A SECURE ENVIRONMENT IS PARAMOUNT IN CERTAIN NEIGHBORHOODS. WHEN LOCKING THE DOORS IT'S IMPERATIVE NOBODY CAN GAIN ACCESS AT WILL BY WALKING UP TO THE CAR. IF ANYONE CAN SIMPLY OPEN THE DOOR TO GAIN ACCESS, CARJACKING, INJURY, OR EVEN MURDER IS EASIER. IF THE DOORS LOCKED PROPERLY THIS PROVIDES A MORE SECURE ENVIRONMENT FOR THIS TYPE OF SCENARIO.   2. NISSAN KNOWING THERE IS A SECURITY PROBLEM WITH THEIR LOCKING MECHANISM AND NOT RECALLING THEM FOR SAFETY CONCERN IS NEGLIGENT. IT'S AN OPEN DOOR TO A LAWSUIT IF SOMEONE WERE TO BE MURDERED DUE TO A DOOR THAT DIDN'T LOCK, ALTHOUGH THE DRIVER PUSHED THE LOCK BUTTON AND HEARD THE LOCKING NOISE. REMEMBER, IN THIS CASE THERE'S NO OBVIOUS INDICATION THE DOOR ISN'T LOCKED UNLESS SOMEONE WALKS UP AND OPENS IT FROM THE OUTSIDE. THE DRIVE \"THINKS\" THE DOOR IS LOCKED, WHEN IN REALITY IT'S AN \"OPEN DOOR\" FOR CARJACKING OR ROBBERY.    THIS FAILURE IS AN INTERMITTENT OF OPERATION. SOMETIMES THE DOORS LOCK OK, OTHER TIMES THEY DON'T. IN ADDITION, SOMETIMES THE DOORS UNLOCK OK, OTHER TIMES THEY DON'T.    IN EMERGENCIES IT'S IMPORTANT TO BE ABLE TO UNLOCK DOORS QUICKLY. SINCE 99% OF THE TIME WE ALL USE THE BUTTON TO LOCK AND UNLOCK DOORS, USING THE MANUAL LOCKING LEVER IS UNFAMILIAR. *TR",
        "vin": "JN8AZ08T47W"
    }
]