[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2010",
        "dateOfIncident": "08/21/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363514,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2005 NISSAN PATHFINDER. IN AUGUST OF 2009, WHEN THE VEHICLE WAS 4 YEARS OLD, IT STARTED STALLING RANDOMLY EVERY 15-30 MILES. EVENTUALLY, AFTER SEVERAL TRIPS TO THE DEALERSHIP, IT WAS DETERMINED THAT THE IPDM MODULE WAS DEFECTIVE, AND WAS REPLACED. THIS TOOK CARE OF THE PROBLEM.    I TALKED TO THE DEALERSHIP AND NISSAN, AND WAS TOLD THIS ONLY AFFECTED MY VEHICLE. HOWEVER, A RECALL WAS JUST ISSUED FOR THIS PROBLEM.     THIS IS AN EXTREMELY DANGEROUS PROBLEM. THE FIRST TIME IT HAPPENED TO US, I WAS DRIVING BACK HOME WITH MY FAMILY FROM A CAMPING TRIP IN BIG BEAR, CALIFORNIA. OUR VEHICLE WAS FULLY LOADED DOWN WITH PASSENGERS AND CAMPING GEAR ON A LARGE DOWNHILL GRADE WHEN IT STALLED. SINCE THE POWER BRAKES WENT OUT, IT TOOK A LONG TIME TO GET THE VEHICLE TO STOP BY HOLDING THE BRAKES AND THE EMERGENCY BRAKE, AND FINALLY COMING TO A PORTION OF THE ROAD THAT WAS NO LONGER DOWNHILL. IF THIS HAPPENS IN THE WRONG PLACE, THIS FAILURE COULD CAUSE A CRASH, SERIOUS INJURY, OR DEATH.    ALSO, WHEN THE PROBLEM OCCURS WHEN YOU ARE DRIVING, THE VEHICLE CANNOT BE RESTARTED WHILE ROLLING BY PLACING THE VEHICLE IN NEUTRAL AND TURNING THE KEY FOR THE STARTER. THE KEY MUST BE FULLY TURNED TO THE OFF POSITION FOR A FEW SECONDS,AND THEN BACK ON. ONCE THE KEY IS OFF, THE STEERING WHEEL LOCKS, SO YOU PROBABLY WON'T BE ABLE TO RESTART IT WHEN ROLLING.    PLEASE MAKE SURE NISSAN CORRECTS ALL OF THE VEHICLES THAT ARE AFFECTED!!!!!!! *TR",
        "vin": "5N1AR18W55C"
    }
]