[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374814,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "GS 350",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY, TOYOTA HAS OFFICIALLY FILED A GOVERNMENT RECALL ON OVER 138,000 LEXUS MODELS DUE TO ENGINE PROBLEMS. THE RECALL AFFECTS 2007-2008 LEXUS GS 350/450H, 2008 LEXUS GS 460, 2006-2008 LEXUS IS 350, 2007-2008 LEXUS LS 460/460L, AND 2008 LEXUS LS 600HL MODELS.         THE PROBLEM STEMS FROM FOREIGN MATERIAL THAT MAY HAVE CONTAMINATED THE VALVE SPRING CAUSING IT TO DEGRADE AND POSSIBLY BREAK. IF THAT OCCURS, THE ENGINE COULD FAIL AND STOP WHILE THE VEHICLE IS IN MOTION INCREASING THE RISK OF A CRASH. (ARTICLE FROM ASSOCIATED PRESS DEC. 23, 2010: LOS ANGELES ' TOYOTA MOTOR CORP. AGREED TO PAY $10 MILLION TO THE FAMILY OF FOUR PEOPLE KILLED IN A RUNAWAY LEXUS CRASH THAT LED TO RECALLS OF MILLIONS OF THE AUTOMAKER\\\\\\'S VEHICLES, AN ATTORNEY SAID THURSDAY.    THE AMOUNT WAS RELEASED THURSDAY BY ORANGE COUNTY LAWYER LARRY WILLIS, WHO REPRESENTS THE DEALERSHIP THAT LENT THE LEXUS TO THE FAMILY, ATTORNEY JEAN-PAUL JASSY SAID. JASSY SPOKE WITH WILLIS AND REPRESENTED SEVERAL MEDIA ORGANIZATIONS, INCLUDING THE ASSOCIATED PRESS, THAT FILED A MOTION OPPOSING EFFORTS TO KEEP THE DETAILS SEALED.)                   I LEASED A LEXUS GS350 SEVERAL YEARS AGO (4/12/2007).  MY LEASE DOES NOT EXPIRE UNTIL 4/12/2012.         I WROTE LEXUS A LETTER STATING THAT I WOULD LIKE TO RETURN MY LEXUS GS350 TO THE LOCAL DEALER AND END MY LEASE BEFORE THE EXPIRATION DATE OF  4/12/2012.  LEXUS RESPONDED BY INDICATING THAT IT WOULD NOT LET ME RETURN MY CAR.         PLEASE ASSIST ME AND ORDER LEXUS TO END MY LEASE DUE TO THE UNSAFE VEHICLE THEY PROVIDED ME.  *TR",
        "vin": "JTHBE96S370"
    }
]