[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2003",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002788,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION SWITCH FAILURE CAUSES SWITCHED DEVICES TO LOOSE POWER WHILE DRIVING.  THE DEVICES I HAVE PERSONALLY IDENTIFIED THAT LOOSE POWER ARE: HEADLIGHTS, DRL, ABS, WINDSHIELD WIPERS, INTERIOR FAN, FOG LIGHTS.  WITH THE IGNITION SWITCH IN THE ON POSITION, IT IS POSIBLE TO ROTATE IT SLIGHTLY TO THE LEFT AND TURN THE ABOVE MENTIONED DEVICES OFF WHILE THE CAR CONTINUES TO RUN.  THIS CAN EASILY HAPPEN (AND DOES HAPPEN) WHILE DRIVING.  SEARCHING YOUR DATABASE OF OTHER COMPLAINTS OF THIS AND OTHER SIMILAR MODELS WHICH PROBABLY USE THE SAME IGNITION SWITCH REVEALS 15 SWITCH FAILURES (865957, 897162, 876280, 899086, 608861, 609016, 758101, 888070, 8014837, 733016, 607392, 8021547, 869601, 750653, 743422) AND 5 POSSIBLE SWITCH FAILURES (733430, 9002207, 861456, 754763, 750545).  THIS FAILURE HAS BEEN IDENTIFIED AS RECURRANT ENOUGH BY MEMBERS OF WWW.VR6.ORG FOR ONE MEMBER TO ISSUE A STEP-BY-STEP PROCEDURE FOR REPLACING THE IGNITION SWITCH.  I FEEL THIS IS A SEVERE SAFETY HAZARD AS HEADLIGHTS AND FOG LIGHTS TURN COMPLETELY OFF WHILE DRIVING (INCLUDING DRL'S) RENDERING THE DRIVER BLIND AT NIGHT.  IF FAILURE OCCURS DURRING DAYLIGHT, THE FAILURE IS NOT AS OBVIOUS BUT RENDERS THE ABS SYSTEM DISABLED AND COULD CAUSE THE DRIVER TO LOOSE CONTROL IF REQUIRED TO STOP QUICKLY WHILE THINKING THE CAR IS EQUIPTED WITH AN ABS SYSTEM.  VOLKSWAGON USA HAS BEEN INFORMED OF THIS VIA THEIR WEBSITE AND I AM WAITING FOR A REPLY.  OTHER MEMBERS OF WWW.VR6.ORG AND SIMILAR SITES ARE BEIGN ENCOURAGED TO FILE SIMILAR COMPLAINTS.",
        "vin": ""
    }
]