[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/2011",
        "dateOfIncident": "04/10/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395414,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 3 MAJOR CONCERNS REGARDING MY 2002 AUDI A6 3.0 QUATTRO. I WILL START WITH THE MOST DANGEROUS PROBLEM FIRST...1) THE ANTI-LOCK BRAKES THAT KICK IN UNEXPECTEDLY. THE ABS/ESP PROBLEM STARTED IN MAY, 2007, WITH THE ABS/ESP LIGHT COMING ON INTERMITTENTLY, RESULTING IN US REPLACING THE BRAKE LIGHT SWITCH. THE PROBLEM DIDN'T HAPPEN AGAIN UNTIL THE ANTI-LOCK BRAKES KICKED IN, IN AUG., 2009. WITH NO DEFINITE, INEXPENSIVE FIX FROM THE DEALER, WE DECIDED TO SEE IF THE PROBLEM PERSISTED. IT DID, BRINGING THE CAR BACK IN SEPT., 2009 & AGAIN IN JUNE, 2010. AT THIS TIME, I HAD A PRIVATE IMPORT GARAGE REPLACE THE ROTATION RATE SENSOR, WHICH WAS WHAT THE DEALER SAID THE PROBLEM COULD BE. THE PROBLEM PERSISTED FURTHER, WITH THE LIGHT COMING ON EVERY FEW MONTHS, UNTIL THE BRAKES KICKED IN WHILE GOING 60 MPH, MAKING THE CAR SKID & JERK TO A STOP, PULLING ME OFF THE ROAD IN LATE SEPT, 2010. IT WAS ABSOLUTELY TERRIFYING! I HAD THE CAR BACK TO THE DEALER IMMEDIATELY, WHERE THEY WERE UNABLE TO VERIFY THE CONCERN.  SINCE THEN, I HAVE NOT HAD PROBLEMS WITH IT AGAIN UNTIL APRIL, 2011, WHEN THE LIGHT STARTING COMING BACK ON AT RANDOM MOMENTS & NOW YESTERDAY, THE ANTI-LOCK BRAKES KICKED IN WHILE THE CRUISE WAS SET ON 60 MPH. I AM TERRIFIED TO CONTINUE TO DRIVE THIS VEHICLE. I CONTACTED AUDI OF AMERICA IN OCTOBER 2010 WITH NO HELP AVAILABLE! NOW ON TO PROBLEM #2)THE FLOODING IN THE INTERIOR FLOORBOARD CAUSING THE TRANSMISSION MODULE TO HAVE TO BE REPLACED. I SPENT THOUSANDS IN OCT, 2010 TO FIX PROBLEMS CAUSED BY A WATER LEAK IN THE CAR. THE DEALER REPLACED THE RIGHT REAR WINDOW & DOOR CHANNELS & SEALS, SAYING THIS WAS THE PROBLEM. I FOUND THE FLOORBOARD WET AGAIN IN MARCH, 2011 & HAD TO PAY FOR THE CRACKED POLLEN FILTER HOUSING TO BE FIXED. A LITTLE HELP FROM AUDI ON THAT, BUT THESE WELL-DOCUMENTED PROBLEMS WITH MY CAR CONTINUE TO BE UN-FIXABLE. I'VE FOUND COMPLAINTS OF THESE PROBLEMS FROM OTHERS, AM CONTACTING A LAWYER ABOUT MY STATE'S LEMON LAW, & AM SO DISAPPOINTED IN AUDI!  *TR",
        "vin": "WAULT64BX2N"
    }
]