[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/28/2011",
        "dateOfIncident": "05/28/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW 2012 FORD MUSTANG BOSS 302, 5.0L, MT82 6-SPD TRANSMISSION. MY UNDERSTANDING IS THIS CAR HAS A REVISED CLUTCH MECHANISM VS. THE 2011 MODEL YEAR. REGARDLESS, I'VE BEGUN TO EXPERIENCE THE SAME ISSUES 2011 MODEL YEAR OWNERS REPORT. I'VE OWNED THE CAR LESS THAN TWO WEEKS AND WITH LESS THAN 200 MILES ON THE CAR AT A STOP LIGHT THE TRANSMISSION FAILED TO ENGAGE INTO FIRST GEAR FULLY. THIS RESULTS IN A GRINDING COMING FROM THE TRANSMISSION. NEARLY REAR ENDED, VEHICLE WAS AT A LIGHT AT THE END OF A FREEWAY RAMP AND WAS UNABLE TO ACCELERATE UNTIL THE CAR WAS PLACED INTO NEUTRAL AND RE-SHIFTED TO 1ST. 1ST TO 2ND AND 2ND TO 3RD SHIFTS TEND TO BE HARD, ROUGH OR CLUNKY. ON OCCASION SHIFTS TO 5TH EXHIBIT A CLUNKY SENSATION AS WELL. AT 295 MILES WAS UNABLE TO SHIFT INTO 2ND GEAR, YOU COULD HEAR THE SYNCHROS WINDING UP IN THE TRANSMISSION DURING THE ATTEMPT. LIKEWISE MOVING BACK TO FIRST, EVEN AT SPEEDS OF LESS THAN 5MPH IN THIS INSTANCE, RESULTED IN A ROUGH ENGAGEMENT AND SYNCHRO WHINE FROM THE TRANNY. DRIVING IN 2ND GEAR AT 20MPH AND PUSHING THE CLUTCH IN TO COAST RESULTS IN A RATTLING NOISE INTERMITTENTLY. THIS RATTLING JUST STARTED WITHIN THE LAST 50 MILES OF DRIVING. THE BUILD DATE ON THE VEHICLE WAS 3/31/2011. I'VE NOT YET REPORTED  THIS ISSUE TO MY FORD DEALER BUT INTEND TO SHORTLY! VERY VERY WORRIED AT OVER $42,000 THIS IS THE MOST EXPENSIVE VEHICLE I'VE EVER PURCHASED AND AM GRAVELY CONCERNED I MAY HAVE A LEMON ON MY HANDS. MY PREVIOUS MUSTANG WITH A 5 SPD MANUAL NEVER EXHIBITED THESE TENDENCIES. FORD MUST RESOLVE THE ISSUES THE MT-82 6 SPEED TRANSMISSION IMMEDIATELY OR REPLACE IT WITH A PROPERLY DESIGNED ALTERNATE UNIT. I WON'T ENTERTAIN HAVING MY SPECIAL EDITION VEHICLE DAMAGED DUE TO A FAULTY TRANSMISSION. LIKEWISE I UNDERSTAND THE FIX OFFERED TO 2011 OWNERS ONLY MAKES MATTERS WORSE, I REFUSE TO TRY ANYTHING THAT WILL WORSEN THE CURRENT SITUATION. DEEPLY FEARFUL THAT CONTINUED USE OF MY 2012 VEHICLE WILL RESULT IN CONSIDERABLE DRIVETRAIN DAMAGE OR ACCIDENT.  *TR",
        "vin": "1ZVBP8CU7C5"
    }
]