[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/05/2011",
        "dateOfIncident": "05/22/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404514,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT STARTED TO ROCK UNDER ACCELERATION AND BRAKING ON MY WIFE'S 2007 (BUILT IN 2008) WHICH AT TIMES MAKES THE VEHICLE HARD TO CONTROL. THIS WAS INITIALLY REPAIRED BY BUSAM NISSAN UNDER WARRANTY ON AUG. 3RD, 2010.  THE WARRANTY EXPIRED IN MARCH OF 2011. TWO (2) MONTHS AFTER THIS THE SEAT BEGAN TO ROCK JUST LIKE BEFORE. I TOOK IT TO BUSAM AND THE SERVICE MANAGER SAID $1,400 TO REPAIR. YOU CAN GUESS MY REACTION. A NISSAN REPAIR BY THE DEALER SHOULD BE COVERED FOR AT LEAST A YR. AND SINCE THIS IS THE 2ND OCCASION IN LES THAN A YR. ONE WOULD THINK THEY MIGHT BE CONCERNED. I WAS ADVISED TO CALL NISSAN CUSTOMER SERVICE AND TALKED TO [XXX] IN TN.. SHE DID LVM 3 DAYS LATER SAYING TO CONTACT HER. I CALLED NUMEROUS TIMES AND LVMS FOR HER. 5 DAYS LATER SHE CALLED AND GOT MY WIFE. SORRY, NISSAN IS NOT RESPONSIBLE. THAT'S IT. I HAVE BEEN TRYING TO CONTACT HER FOR 2 WEEKS NOW TO NO AVAIL. THERE ARE 20 PAGES OF COMPLAINTS ON EDMUNDS.COM ALONE PLUS NUMEROUS COMPLAINTS ON THE NISSAN FORUM AND ALSO ON THIS SITE. THE PARTS USED TO REPLACE THE SEAT ARE NOW COMBINED INTO AN $800 COMPLETE PART WHICH INCLUDES THE TWO (2) PARTS REPLACED IN AUGUST, 2010. THE PART #'S ' HAVE BEEN CHANGED BUT I HAVE FOUND A CROSS REFERENCE AND THEY ARE INCLUDED IN THE NEW ASSEMBLY. THIS MUST OF CONCERN TO NISSAN AS THIS MAKES IT EASIER FOR A DEALERSHIP TO DIAGNOSIS AND REPAIR. THIS IS NOW GETTING TO BE A DANGEROUS SITUATION AND I EXPECTED BUSAM TO STAND BESIDE ME BUT THEY WOULD NOT.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*TR",
        "vin": "JN8AZ08W77W"
    }
]