[
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/04/2011",
        "dateOfIncident": "07/20/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE (MIL) LIGHT TURNED ON, CAR ALL OF A SUDDEN IDLES AT A HIGHER RPM WHILE WE WERE DRIVING!!!  VEHICLE WAS TAKEN INTO THE DEALERSHIP.  CAR IS ONLY UNDER WARRANTY FOR 36,000 MILES OR 3 YEARS!  DEALERSHIP RAN DIAGNOSTIC, CAME UP WITH:  CODE P0123 (THROTTLE HIGH INPUT), P0299 (TURBO UNDER BOOST), P0456 (EVAP LEAK), P1098 (INTAKE TURNING VALVE SHORT TO B+), CODE P2004 (INTAKE RUNNER STUCK), CODE P3237 (INTAKE RUNNER BASIC SETTINGS).  DEALER RECOMMENDED INTAKE RUNNER MOTOR REPLACEMENT & REPLACEMENT OF TURBO & N80 VALVE, ALSO CV BOOT NEEDS REPLACEMENT.  TOTAL COST OF REPAIRS OVER $1200!!!  WE ALWAYS TAKE CARE OF OUR VEHICLES AND HAVE THEM SERVICED AT THE DEALERSHIP.     VEHICLE HAS ALSO HAD DEFECTIVE INTERIOR PARTS.  INTERIOR TRIM (ALL SWITCHES - LOCK, WINDOW & RADIO ARE BUBBLING AND CHIPPING).  DOOR PANEL TRIM (RUBBER IS PEELING).  SHIFT KNOB - METALLIC PIECE ON SHIFT KNOB, PEELED AND DUG INTO SKIN AND CAUSED INJURY.  CARBON FIBER DASH IS PEELING APART.      CONTACTED VW OF AMERICA, PER THEIR CUSTOMER SERVICE REP, THEY ARE UNABLE TO MAKE ANY REPAIRS DUE TO THE AGE AND MILEAGE OF THE VEHICLE.  CAR IS A 2006 - 67,000 MILES.  LESS THAN 5 YEARS OLD.  I WOULD HAVE NEVER PURCHASED A VOLKSWAGEN HAD I KNOWN THEY WERE NOT RELIABLE VEHICLES.      UNKNOWLEDGABLE SALES REPS, OR JUST AFTER CUSTOMERS TO MAKE A BUCK.  SELLING PEOPLE UNRELIABLE VEHICLES AND VOLKSWAGEN CLEARLY DOES NOT TAKE CARE OF THEIR CUSTOMERS NOR DO THEY CARE ABOUT CUSTOMER LOYALTY OR SAFETY.   *TR",
        "vin": "WVWEK73C36E"
    }
]