[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/19/2011",
        "dateOfIncident": "07/18/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "WRANGLER SAHARA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING @ APPROXIMATELY 55MPH ON RT 50 NEAR RT 28 IN FAIRFAX CO VA I FELT A SLIGHT VIBRATION IN THE FRONT END WHICH IMMEDIATELY BECAME A VIOLENT VIBRATION TO THE POINT I HAD TROUBLE STEERING THE VEHICLE WHILE APPLYING THE BRAKES TO SLOW DOWN AND NEARLY CRASHED.  I PULLED OFF TO THE SIDE OF THE ROAD AND GOT OUT TO INSPECT THE VEHICLE, FULLY EXPECTING TO FIND A FLAT TIRE OR WORSE, THINKING MAYBE A TIRE ACTUALLY FELL OFF.  I FOUND NOTHING WRONG WHICH WAS PERPLEXING.  I CONTINUED ON MY WAY WITH NO FURTHER INCIDENT THAT DAY.  SINCE THAT DAY I'VE HAD AT LEAST FIVE MORE INCIDENTS OF THE SAME NATURE WITH VARYING DEGREES OF NEAR MISSES REGARDING AN ACCIDENT.  IT'S FRIGHTENING AND CLEARLY SOMETHING IS WRONG WITH THE VEHICLE.  I'VE RESEARCHED THE ISSUE AND IT'S APPARENT THE PROBLEM IS WIDELY KNOWN AS THE \"DEATH WOBBLE\" WITH MANY SUGGESTED FIXES.  THE DEALER WITH WHOM I HAVE MY JEEP SERVICED HAS ACKNOWLEDGED HEARING ABOUT A FRONT END SHIMMY BUT NO DEATH WOBBLE (FAIROAKS CHRYSLER, DODGE JEEP).  THEY SUGGEST REPLACING THE FRONT STABILIZER BAR WITH A \"HEAVY DUTY\" ONE AND SAID IT WILL FIX THE ISSUE ($660.00).  IRONICALLY, THE  \"HEAVY DUTY\" STABILIZER APPEARS TO BE STOCK ON MODELS BEG. WITH THE 2010 MODEL YEAR OR AT A MINIMUM THEY HAVE CHANGED THE CONFIGURATION AND PLACEMENT OF THE STABILIZER WHICH INDICATES TO ME THEY (CHRYSLER/JEEP) CLEARLY RECOGNIZED THERE IS A SERIOUS ISSUE WITH THE SAFETY OF THE VEHICLE.  I IMPLORE YOU TO INVESTIGATE THIS MOST SERIOUS DEFECT BEFORE SOMEONE IS KILLED BECAUSE OF THIS ISSUE.  *KB",
        "vin": "1J8GA59167L"
    }
]