[
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2011",
        "dateOfIncident": "02/14/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423214,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS MILEAGE ON MY VEHICLE IS 14 MPG CITY DRIVING; TOTAL HIGHWAY DRIVING IS 18MPG AND COMBINED 15- 16 MPG. I AM A VERY CONSERVATIVE DRIVER AND HAVE DRIVEN FOR 47 YEARS.  MY MILEAGE IS SO POOR I CONTACTED THE HYUNDAI CORP. REPEATEDLY ON THIS.  I'VE SPOKEN ON A FEW OCCASIONS WITH THE CEO[XXX], AND CORRESPONDED WITH HIM AS WELL VIA EMAIL AFTER GETTING NO SATISFACTION/HELP FROM THE REGIONAL PERSON.  THE CEO'S WIFE GREW UP IN MY AREA (LAKE OSWEGO, OR.) AND THAT IS WHY HE CALLED ME PERSONALLY.  HOWEVER, THE BOTTOM LINE WAS NOTHING HAS HAPPENED AS A RESULT OF THIS CALL.  HE OFFERED ME THE FOLLOWING: HE OFFERED TO EXCHANGE MY VEHICLE WHICH HAD ABOUT 8,000 MILES ON IT BY THE TIME HE GOT IN TOUCH WITH ME FOR A NEW 2009 SONATA FWD AND IT WAS THE OLD MODEL AS HYUNDAI WAS COMING OUT WITH A TOTALLY REVAMPED 2010 SONATA MODEL.  I BOUGHT MY SANTA FE AWD  BECAUSE I WANTED A SUV WITH AWD!  IF I WANTED A SEDAN, I WOULD HAVE BOUGHT ONE!  I BEGGED HIM TO GIVE ME ANOTHER COMPARABLY EQUIPPED SANTA FE AS THEY COULD FIND NO REASON MECHANICALLY WHY MY MILEAGE WAS SO LOW AND I ALWAYS DOUBLE CHECK IT MANUALLY IN ADDITION TO THE COMPUTER OUTPUT.  SO, I REFUSED TO ACCEPT THIS OFFER AND I SPEND A HUGE AMOUNT ON GAS AND I LIVE ON A SMALL FIXED INCOME AND CANNOT AFFORD TO BUY ANOTHER SANTA FE!  OTHERS I'VE QUESTIONED WITH THE SAME VEHICLE AND EQUIPPED COMPARABLY GET 20 MPG OR MORE CITY DRIVING. READING HYUNDAI HAS DONE NOTHING ABOUT SO MANY ISSUES BROUGHT UP IS ABOMINABLE.  SOMEONE NEEDS TO DO SOMETHING ABOUT THIS SO LIVES AREN'T LOST AND PEOPLE AREN'T PAYING AT ALMOST $4/GALLON FOR ALL THIS GAS I HAVE TO KEEP BUYING IN MY CASE.  THERE IS DEFINITELY SOMETHING MAJOR WRONG WITH MY ENGINE OR SOMETHING THAT PREVENTS ME FROM GETTING THE MILEAGE I SHOULD.  AS I SAID, I AM A VERY CONSERVATIVE DRIVER.  PLEASE INTERVENE WITH THE MANUFACTURER ON ALL THESE MATTERS.THEY TRULY DON'T CARE ABOUT CONSUMERS.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5NMSH73E58H"
    }
]