[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/23/2011",
        "dateOfIncident": "05/18/2011",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432514,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHTK",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED VEHICLE IN MAY OF 2011. IMMEDIATELY EXPERIENCED AT INTERMITTENT SPEEDS AND NON-SPECIFIC CONDITIONS THE FRONT END WILL START TO WOBBLE IN EVER INCREASING INTENSITY, IF HANDS ARE OFF THE HANDLE BARS. WITH HAND ON THE BARS, THE CONDITION CAN BE FELT BUT IS KEPT UNDER MORE CONTROL OF THE RIDER. HAT HIGH SPEEDS IT IS MORE PRESENT EVEN WITH HANDS ON THE HANDLE BARS.  THIS CONDITION DID NOT EXIST IN HARLEY MOTORCYCLES UNTIL THE FRAME ENGINEERING AND MAJOR REDESIGN CHANGE IN THE 2009, 2010 AND 2011 (AND PRESUMABLY UP) MOTORCYCLES. I HAVE EXPERIENCED THIS ON MY 2010, AND MY FRIENDS 2011 TOURING HD MOTORCYCLES.ANOTHER FRIEND HAS A 2009 AND EVERYONE I KNOW WHO HAS A 2009 UP COMPLAINS OF THE SAME ISSUE. EVERY IS TOLD BY HD DEALERS THAT \"YOU ARE THE FIRST PERSON TO COMPLAIN IF THIS\" AND IS USUALLY TOLD IT IS PERHAPS DO TO UNDER INFLATED TIRES WHICH THEN SCALLOP. CHICKEN AND EGG. HOWEVER AFTER REPLACING MY REAR TIRE, AND CHECKING MY FRONT END \"FLOP\" SWING TOLERANCES - I STILL HAVE THE PROBLEM. ANOTHER FRIEND SAID HE WAS GOOD FRIENDS WITH A HARLEY TECH, WHO REPLACED HIS NECK BEARINGS AND SUPPOSEDLY FIXED THE ISSUE. MANY THINGS CAN CAUSE A RIDER TO REMOVE HANDS FROM THE BARS - SOME TIMES EMERGENCIES, SOMETIMES JUST HABIT FROM YEARS OF BEING ABLE TO RIDE BRIEF PERIODS LIKE THIS. WHATEVER - IT IS DANGEROUS AND SHOULD BE FIXED.  *TR",
        "vin": "1HD1KEM16AB"
    }
]