[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/22/2012",
        "dateOfIncident": "02/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE MANY OTHERS THE EPS (ELECTRONIC POWER STEERING) SYSTEM GAVE OUT ON MY 2008 ESCAPE (106,000 MI.). IT STARTED WITH THE STEERING WHEEL OCCASIONALLY CLUNKING AND SHAKING BOTH WHEN DRIVING AND WHEN THE CAR WAS IDLE (AS LONG AS IT WAS STARTED). AS SOON AS THE WHEEL WAS TURNED TO THE LEFT OR RIGHT THE POWER STEERING WOULD ENGAGE AND IT WOULD BE FINE. THE PROBLEM QUICKLY GOT WORSE TO THE POINT WHERE THE CLUNKING/SHAKING WAS HAPPENING AT ALL TIMES UNTIL THE POWER STEERING JUST FLAT OUT FAILED WHILE DRIVING. LUCKILY I WAS IN A POSITION TO REACT AND MANUALLY STEER WITHOUT INCIDENT BUT I WAS DEFINITELY WORRIED AS IT COULD HAVE BEEN MUCH WORSE. WITH THE ELECTRONIC POWER STEERING THERE IS NO FIX WITHOUT SWAPPING OUT THE ENTIRE STEERING COLUMN. $1250 PARTS+LABOR+TAX. I CALLED FORD DIRECTLY AND THEY JUST TOSSED ME AROUND SAYING THAT THEY WILL LOOK INTO IT AND SEE IF THEY CAN FIX IT AS MANUFACTURER DEFECT. AFTER FINDING THIS WEBSITE I REALIZED THAT THERE ARE SEVERAL OTHERS EXPERIENCING THE EXACT SAME PROBLEM. ALSO, THE PART IS ON BACK ORDER EVERYWHERE IN THE COUNTRY WHICH LEADS ME TO BELIEVE THAT THE PROBLEM IS MUCH BIGGER THAN INDICATED ON THIS FORUM. I AM FRUSTRATED IN TRYING TO HOLD FORD ACCOUNTABLE. FORD EXPLAINED THAT RECALLS ARE JUSTIFIED BY CRASH DATA AND THERE IS NO WAY TO GET ONE STARTED PRIOR. THIS IS CRAZY, SO NOT ONLY IS SOMEONE GOING TO NEED TO CRASH, BUT SEVERAL PEOPLE ARE GOING TO NEED TO CRASH IN ORDER FOR ANYTHING TO GET DONE.  *TR",
        "vin": "1FMCU02Z88K"
    }
]