[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/03/2012",
        "dateOfIncident": "11/24/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453914,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ARMADA",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2008 NISSAN ARMADA.  I AM HAVING A ISSUE WITH THE BRAKE BOOSTER.  THE BRAKES LOCK AND THERE IS A SCREECHING NOISE.  I TOOK THE VEHICLE TO THE NISSAN STORE AND THEY SAID THIS WAS THE PROBLEM.  IT COST $120.00 FOR THEM TO TELL ME IT WOULD TAKE $900 TO FIX IT.  I KNOW THERE IS A RECALL ON THE 2008 NISSAN ARMADA BUT WHEN I CALLED NISSAN THEY TOLD ME MY VIN NUMBER WAS NOT INCLUDED IN THE RECALL.  THIS A MAJOR SAFETY ISSUE FOR MY FAMILY.  WE WERE DRIVING DOWN THE INTERSTATE.    THIS HAS HAPPEN TWICE PRIOR.  ONCE DURING THANKSGIVING HOLIDAYS 2011 AND ANOTHER TIME IN JANUARY.  IF I KILL THE CAR AND RE-START IT, IT SEEMS TO BE OK.  THOSE TWO TIMES WEREN'T MAJOR BUT THIS LAST TIME WE WERE TRAVELING DOWN THE INTERSTATE.    WHEN I TALK TO THE NISSAN REP, SHE TOLD ME MY VIN NUMBER WAS NOT INCLUDED IN THE RECALL AND THE CASE WAS CLOSED.  I AM FURIOUS WITH NISSAN AND THEIR LACK OF CONCERN FOR OUR SAFETY.  THIS IS THE THIRD NISSAN I HAVE OWNED AND IT WILL BE THE LAST.  I HAD HEARD THAT THEIR CUSTOMER SERVICE WAS TERRIBLE AND NOW I UNDERSTAND WHY.    THERE IS A LAWSUIT IN THE WORKS FOR THIS REASON WHICH I AM ABOUT TO JOIN IF SOMETHING ISN'T DONE.  I JUST WANT MY BREAK BOOSTER FIXED AND FOR NISSAN TO TAKE THE RESPONSIBILITY THAT IT IS A MANUFACTURE DEFECT AND THEY ARE RESPONSIBLE.  THAT IS ALL I AM ASKING.  I WANT MY ARMADA TO BE PART OF THE RECALL.  PLEASE, PLEASE HELP ME IF YOU CAN.  *TR",
        "vin": "5N1BA08D78N"
    }
]