[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2012",
        "dateOfIncident": "05/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459714,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "R1200 RT",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BEGAN STALLING FREQUENTLY AT END OF RIDING SEASON (FALL 2011) WHEN THE ENGINE WAS AT ITS NORMAL OPERATING TEMPERATURE.  ENGINE STALLING OCCURRED WHEN DECELERATING WITH CLUTCH ENGAGED OR AT IDLE, ENGINE WOULD NOT RETURN TO NORMAL IDLE SPEED WITHOUT STALLING. THE ENGINE WAS SERVICED/MAINTAINED BY AN AUTHORIZED LOCAL BMW MOTORCYCLE DEALER ON 3/10/2012 ? 3/13/2012 WITH HOPES THAT ENGINE WOULD RETURN TO NORMAL OPERATING BEHAVIOR FOR THE FOLLOWING RIDING SEASON (2012).  THIS SERVICE/ MAINTENANCE INCLUDED BUT WAS NOT LIMITED TO BMW INSPECTION WITH ANNUAL SERVICE, INCLUDES ALL FLUIDS AND VALVE ADJUSTMENT AND THROTTLE BODY SYNCHRONIZATION.    BUT ON 5/6/2012 THE BIKE WAS RIDDEN ON ITS FIRST LONG RIDE OF THE SEASON.  AFTER RIDING APPROXIMATELY 65 MILES THE BIKE BEGAN TO HAVE THE SAME SYMPTOMS AS DURING THE LAST RIDE IN THE FALL OF 2011.  ON 5/8/2012 THE BIKE WAS TAKEN TO THE SAME LOCAL BMW MOTORCYCLE DEALER THAT PERFORMED THE ANNUAL MAINTENANCE IN MARCH.  DURING THE WEEK OF 5/15/2012 THE BIKE WAS DIAGNOSED, REPAIRED AND AVAILABLE TO BE PICKED UP ON 5/18/2012.  THE DIAGNOSIS FROM THE DEALER'S SERVICE TECHNICIAN IS STATED ON THE SERVICE INVOICE AS FOLLOWS:  PLASTIC FUEL CONNECTOR HAD HAIRLINE CRACK CAUSING FUEL CUT RELAY TO NOT ACTIVATE WHEN DECELERATING CAUSING ENGINE TO STALL.  UPGRADED PLASTIC FUEL CONNECTOR WITH METAL CONNECTOR.  PARTS REPLACED WERE BMW PART NUMBERS:  16 12 1 176 918:HOSE CLAMP  13 53 7 700 800:PLUG (METAL FUEL LINE MALE CONNECTOR)  N/A:FUEL HOSE CUT 1FT.  *TR",
        "vin": "WB10388096Z"
    }
]