[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/04/2012",
        "dateOfIncident": "07/18/2006",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460514,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "JOURNEY",
                "productYear": "2007",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Norcold Inc.",
                "productMake": "NORCOLD",
                "productModel": "1201LRIM",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A NORCOLD REFRIGERATOR, MODEL NUMBER: 1201LRIMWPM WHICH WAS HOUSED IN A 2007 WINNEBAGO JOURNEY MOTOR HOME.  THE CONTACT STATED THAT THE REFRIGERATOR WAS LEAKING AMMONIA.  THE REFRIGERATOR WAS LOCATED IN THE REAR CENTER OF THE VEHICLE. A DEALER WAS CONTACTED WHO ADVISED THAT THE REFRIGERATOR WAS NOT UNDER RECALL AND OFFERED NO FURTHER ASSISTANCE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 38,000.  UPDATED 07/10/12*LJ  THE CONSUMER STATED THE REFRIGERATOR WAS HOT, SINCE THE FIRST DAY OF PURCHASE. ON SEPTEMBER 16, 2006 THE REFRIGERATOR COMPLETELY STOPPED WORKING. THE DEALERSHIP REPAIRED IT, BUT IT NEVER FUNCTIONED PROPERLY. THE REFRIGERATOR STOPPED WORKING AGAIN FOR THE SECOND TIME. THE CONSUMER OBTAINED THE PARTS AND WAS ABLE TO FIX IT, BUT THE EXTERIOR WAS STILL TOO HOT.  ABOUT A WEEK LATER, THE CONSUMER PULLED THE REFRIGERATOR OUT AND DISCOVERED THAT BOTH COOLING FANS WERE NOT WORKING PROPERLY AND PART OF THE THERMAL INSULATION WAS MISSING. NORCOLD DIDN'T WANT TO DO ANYTHING ABOUT THE ISSUE, UNTIL WINNEBAGO BECAME INVOLVED. AFTER WINNEBAGO BECAME INVOLVED, NORCOLD REPLACED THE FANS AND SENT ADDITIONAL INSULATION.  UPDATE 07/11/12. *JB  THE CONSUMERS LAWYER WROTE IN ON BEHALF OF THE CONSUMER. UNDER THE RECALL, THE COOLING UNIT WAS RETROFITTED WITH A THERMAL SWITCH KIT THAT WAS SUPPOSED TO PROTECT THE COOLING UNIT FROM LEAKING. UNFORTUNATELY, THE REPAIR WAS INEFFECTIVE AS THE UNIT CONTINUED TO LEAK REFRIGERANT. UPDATED 08/09/12",
        "vin": "4UZACJDC86C"
    }
]