[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/18/2012",
        "dateOfIncident": "03/19/2012",
        "fire": false,
        "manufacturer": "Fisker Automotive Incorporated",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455714,
        "products": [
            {
                "manufacturer": "Fisker Automotive Incorporated",
                "productMake": "FISKER",
                "productModel": "KARMA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS DELIVERED MARCH 19TH, 2012 WITH ENGINE WARNING LIGHTS.  DEALER REFUSED TO HAVE VEHICLE EVALUATED, OR INSPECTED.  DEALER DID NOT RETURN MY CALL AND FISKER MOTORS DID NOT RETURN MY CALLS. CAR LOST ALL POWER, WHILE DRIVING ON THREE OCCASIONS IN FIRST 60 MILES.  IN ONE INSTANCE HEADLIGHTS AND CONTROLS TURNED OFF AT APPROXIMATELY 60 MILE PER HOUR AT NIGHT AND TWICE AROUND 40 MILE PER HOUR, WITHIN 1/4 MILE OF A STOP LIGHT.  DEALER HAS HAD CAR RETURNED IN LESS THAN 3 DAYS AND IS UNABLE TO DIAGNOSE AND FIX PROBLEM, DUE TO THE FACT THAT MANY FISKER CARS DO NOT STORE ENGINE LIGHT CODES.  SOFTWARE PROBLEMS AND A SAFETY RECALL ON THE MAIN POWER SYSTEM ARE CURRENTLY UNAVAILABLE FOR MONTHS.  RADIO, AND OTHER ELECTRONIC SYSTEMS FAIL ROUTINELY, INCLUDING THE HANDSFREE PHONE AND THE AUDIO HAS LOUD POPS.  THE DEALER HAS TRIED MULTIPLE SOFTWARE UPDATES OVER SEVERAL MONTHS WITH NO IMPROVEMENT ON PRIOR DELIVERIES AND IS WAITING LIKE MANY OTHERS FOR THE DEFECTIVE BATTERY PACKS TO BE REPLACED.  I DO NOT FEEL THAT THIS CAR SHOULD BE ON THE ROAD.  FISKER HAS EXPLAINED THAT THE CAR MAY FAIL, BUT THEY ARE UNABLE TO REPLACE ALL THE BATTERIES RECALLED FOR SEVERAL MONTHS.  MANY COMPLAINTS ON FISKER BUZZ AND OTHER SEARCHES FOR PROBLEMS WITH FISKER.  I FEEL MOST ARE UNSAFE AND THE MANUFACTURER IS UNWILLING TO TAKE THEM OFF THE ROAD DUE TO FINANCIAL PROBLEMS.  I FEEL THE COMPANY IS UNABLE TO MAKE ETHICAL DECISIONS, BASED UPON IT'S PRODUCTION GOALS TIED TO THE DEPARTMENT OF ENERGY LOAN.  A GREAT DEAL HAS BEEN IN THE NEWS ABOUT HOW BAD THE QUALITY AND MULTIPLE SERIOUS FAILURES OWNERS EXPERIENCE.  I FEEL THE CARS ARE UNSAFE AND NEED TO BE REMOVED FROM THE STREETS.  IT IS ONLY A MATTER OF TIME UNTIL SOMEONE IS INJURED OR WORSE, DUE TO THE MULTIPLE DEFECTS AND QUALITY CONTROL ISSUES.  I HAVE BEEN WAITING A MONTH FOR FISKER TO BUY BACK OR FIX THE CAR.  MY  WIFE IS AFRAID TO DRIVE IT.  IS IT SAFE? *JS",
        "vin": "YH4K14AA1CA"
    }
]