[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/17/2012",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAVALIER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST DECEMBER MY 2005 CAVALIER EXPERIENCED A SPEEDOMETER MALFUNCTION WHILE I WAS TRAVELING ON THE HIGHWAY.  I WAS IN AN AREA WHERE THE SPEED ZONE CHANGED FROM 50 MPH TO 65 MPH.  THE SPEEDOMETER REGISTERED MY INCREASE IN SPEED FINE.  WHEN I SLOWED DOWN, THE SPEEDOMETER STAYED IN PLACE.  OVER THE PAST 7 MONTHS MY DASHBOARD GAUGES (FUEL, TEMP, SPEED, RPM) ALL MALFUNCTION.  SOMETIMES THEY RESET THEMSELVES.  MOST OF THE TIME I'M NEVER SURE HOW FAST I'M GOING OR HOW MUCH GAS I HAVE.  MY ENGINE TEMP WILL READ OFF THE CHARTS EVEN ON A COOL MORNING AFTER IT HAS SAT STILL ALL NIGHT.  ALTHOUGH THIS STARTED LAST DECEMBER, THE PROBLEMS CONTINUE TO THIS DAY.     I HAVE POURED SO MUCH MONEY INTO OTHER ELECTRICAL ISSUES WITH THIS CAR ALREADY, I'M CONVINCED IT IS NOT WORTH ONE MORE DIME TO FIX THE INSTRUMENT CLUSTER.  I'VE SPENT HUNDREDS ON POWER WINDOW MOTORS THAT CONTINUOUSLY MALFUNCTION.  THE REAR RIGHT BLINKER HAS CONSISTENTLY GONE HAYWIRE AS WELL.    I HAD RESIGNED MYSELF TO THE FACT THAT I WAS ONE IN A THOUSAND WHO HAPPENED TO GET AN ELECTRICAL LEMON.  AFTER READING ALL THE COMPLAINTS FROM OTHER CAVALIER OWNERS, HOWEVER, I REALIZE THAT CHEVROLET IN 2005 PLAYED A SICK JOKE ON THE WHOLE LOT OF US.  I HAVE OWNED SEVERAL IMPORTED CARS, MOSTLY HONDA'S AND TOYOTA, AND HAVE NEVER BEEN AS DISPLEASED.  GM SHOULD BE ASHAMED.  THE CAR DRIVES GREAT.  I WAS VERY EXCITED ABOUT IT WHEN I BOUGHT IT AS I LIKED THE LOOK AND FEEL OF IT ON THE ROAD.  I'LL NEVER BUY ANOTHER CHEVROLET.   *TR",
        "vin": "1G1JC52F957"
    }
]