[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/01/2012",
        "dateOfIncident": "05/21/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MARINER HYBRID",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "ON I-66W VEHICLE LOST ENGINE POWER AT HIGHWAY SPEED.  DISPLAYED STOP SAFELY NOW AND MASTER VEHICLE ELECTRICAL HAZARD WARNING LAMP.  THE INCIDENT WAS EXTREMELY HARROWING FOR THE DRIVER AS THE POWER CUTOFF WAS UNEXPECTED AND IMMEDIATE.  COASTED TO SHOULDER.  A RESTART, PER THE OWNER MANUAL, WAS ATTEMPTED BUT DID NOT WORK.  TRANSPORTED ON FLATBED TO FORD DEALERSHIP.  DEALERSHIP STATED HYBRID BATTERY HARNESS, HYBRID COOLING FANS, AND THROTTLE BODY NEEDED TO BE REPLACED AND PCM REPROGRAMMED FOR $1900 TO 'FIX ISSUE.  OWNER REQUESTED A NEW 12V FRONT BATTERY AND WARNING CEASED.  OWNER DECIDED TO DO SOME RESEARCH AND TEST DRIVE SHORT DISTANCES.  ON 5/24 THE ENGINE CUT OFF IN AN OFFICE PARKING LOT.  VEHICLE WAS ABLE TO BE RESTARTED AND GO 4 MILES BACK TO RESIDENCE AFTER THE CARPET COVERING THE HYBRID BATTERY WAS PULLED UP AND THE CABIN A/C TURNED TO HIGH IN AN EFFORT TO COOL THE BATTERY AREA (IT DID NOT FEEL HOT BUT THE OWNER BELIEVED IF A TEMP READING WAS THE CAUSE A FEW DEGREES COOLER MIGHT HELP).  A WEALTH OF INFO WAS FOUND INDICATING THIS WAS A KNOWN PROBLEM AND HAD MULTIPLE FORD TECHNICAL SERVICE BULLETINS ISSUED (09-18-6 SEP 09  HYBRID SYSTEMS - RED TRIANGLE ON/DTC P0A27 SET').   THE OWNER COMPILED A LIST OF 88 COMPLAINT NUMBERS ON THE NHTSA SITE THAT INDICATE SUBSTANTIALLY SIMILAR EXPERIENCES FROM 2005-2008 FORD ESCAPE HYBRID / MERCURY MARINER HYBRID OWNERS.  BELIEVE ROOT CAUSE IS A DESIGN FLAW IN THE PCM S/W THAT REMOVES ENGINE POWER WHEN A MINOR DEVIATION FROM THE NOMINAL BATTERY TEMP RANGE IS SENSED.  LIKELY CONTRIBUTING ISSUE IS A POORLY DESIGNED HYBRID BATTERY COOLING SYSTEM (BATTERY HARNESS, BATTERY COOLING FANS, MEC PUMP, BLEND DOOR, RELAYS).  THE NHTSA IS URGED TO OPEN AN INVESTIGATION INTO THE STOP SAFELY NOW/MASTER VEHICLE ELECTRICAL HAZARD ENGINE SHUTDOWNS.  VEHICLE IS NOT REPAIRED AND CAN BE MADE AVAILABLE FOR INSPECTION.  *TR",
        "vin": "4M2CU98HX6K"
    }
]