[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/21/2012",
        "dateOfIncident": "07/14/2011",
        "fire": false,
        "manufacturer": "Suzuki Motor USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471814,
        "products": [
            {
                "manufacturer": "Suzuki Motor USA, LLC",
                "productMake": "SUZUKI",
                "productModel": "VZR1800",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A M109R L.E. SUZUKI 2011 SAW THAT HANDLEBARS WERE OBVIOUSLY CROOKED AND ASKED THAT THEY BE SERVICED. 10 MONTHS LATER AND A CONCAVED FRONT TIRE THEY WERE \"ADJUSTED.\"BRAND NEW TIRES WERE PUT ON AT THIS TIME AND THE STEERING WAS STILL OFF. I HAD A FALLOUT W/THE SAID DEALERSHIP &THE CONTACTED AMERICAN SUZUKI CORP. AND ASKED IF THERE WAS A RECALL OR ISSUE PERTAINING TO THE M109R.I WAS TOLD TO RIDE SIDEWAYS TO COMPENSATE FOR THE STEERING. I APPROACHED ANOTHER DEALERSHIP AND POINTED OUT THEY HAD A BRAND NEW DEFECTIVE UNIT ON THEIR SHOWROOM FLOOR AND UPON INSPECTION THEY CONFRONTED SUZUKI WITH ME. THEY WERE GIVEN AUTHORIZATION TO FIX MY PROBLEM AND DURING THIS MY SHIFTER LINKAGE HAS GONE OUT AND FIXED TWICE ALONG W/ A TEMP SENSOR FOR THE FAN LEAKING COOLANT WHICH HAS ALSO GONE OUT TWICE, ALL BEFORE THE CYCLE WAS A YEAR OLD. THE STEERING WAS REMEDIED BY REPLACING THE RISERS.  THE DEALERSHIP STATED THAT\" THE BAR MOUNTS ON THE TOP OF THE TRIPLE TREE WERE MEASURED &THE LINE BORE MAY BE OFF OR THE MOUNTS ARE MADE INCORRECTLY AT THE FACTORY.\" THIS DEALERSHIP VERBALLY ADMITTED THAT THE STEERING WAS NOT FIXED AND THE ORIGINAL DEALERSHIP WHO FIXED IT FIRST SIGNED OFF ON THE REPAIR ORDER STATING\" RESOLUTION ADJUSTED HANDLEBARS.\" THAT'S ALL THEY DID WAS MOVE THE HANDLEBARS CAUSING ABNORMAL WEAR ON MY BRAND NEW TIRES. THE 2NDA DEALERSHIP WAS TOLD BY SUZUKI TO JUST REPLACE THE RISERS WHICH WERE SET BACK IN THE OUT OF LINE BORE HOLES AND NOT FIXING THE WHOLE PROBLEM...THE STEERING THE DOESN'T IT HOLD IN CORNERS AND SKIPS AND WOBBLES AND SHAKES DURING NORMAL RIDING.IT MOVES THE BIKE WITHOUT WARNING CAUSING ME TO SWERVE.  SUZUKI WILL NOT ACKNOWLEDGE MY PLEA AND MY TIRES HAVE TO BE REPLACED NOW AFTER 5000 MILES.  I AM STUCK WITH AN UNSAFE BIKE THAT WAS SOLD BRAND NEW AND THERE ARE OTHERS BRAND KNEW STILL BEING SOLD WITHOUT ME WARNING OR RECALL. IS THIS WHAT CONSUMERS HAVE AS RIGHTS?  *TR",
        "vin": "JS1VY53AXB2"
    }
]