[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2012",
        "dateOfIncident": "06/25/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465914,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY MY VEHICLE HICCUPED INTERMITTENTLY THREE TIMES AND THEN THE ELECTRONIC PANEL, WINDOWS, LOCKS, RADIO, A/C, SIGNALS, HAZARDS ALL SHUT DOWN AND A MESSAGE ABOUT THE BRAKES CAME ON. I WAS NEAR THE DEALERSHIP SO I STOPPED IN AND DESCRIBED THE PROBLEM.  WITH A SMIRK ON HIS FACE THE SERVICE CONSULTANT SAID IT WOULD COST $85.00 FOR DIAGNOSTICS AND THEN HE WOULD GIVE ME A COST ESTIMATE OF THE REPAIR.  THEY WERE BUSY AND HE SAID THAT HE DIDN'T THINK THAT THEY COULD GET TO IT THAT DAY SO I DECIDED TO TAKE MY CHANCES AND DRIVE TO MY OWN MECHANIC. TO MY SURPRISE WHEN I STARTED MY CAR ALL POWER CAME BACK ON AND A MESSAGE TO GET MY AIR BAG CHECKED.  WHEN I ARRIVED AT MY SERVICE STATION THE MECHANIC PUT IT ON DIAGNOSTICS (FREE) AND COULDN'T FIND ANY ERROR CODES SO HE RESET THE CAR COMPUTER.  EVERYTHING WAS FINE UNTIL JULY 12 WHEN THE SAME THING HAPPENED AGAIN. THIS TIME I WAS DRIVING AT NIGHT ON THE HIGHWAY ABOUT 65MPH, MY WIFE WITH ME, WHEN WE GOT QUITE A SCARE WHEN THE CAR HICCUPED.  WE LOST ALL POWER AGAIN BUT FORTUNATELY OUR HEADLIGHTS AND REAR LIGHTS STAYED ON. WE DROVE SLOWLY AND ARRIVED SAFELY HOME. WHAT A SCARE!  OUR MECHANIC PUT IT ON DIAGNOSTICS AGAIN, FOUND NOTHING AND RESET THE CAR COMPUTER AGAIN.  HE DOESN'T KNOW WHAT'S CAUSING THE PROBLEM (PROBABLY A COMPUTER ISSUE) AND TOLD ME I SHOULD TAKE IT TO A DEALER.   CHECKING SIMILAR COMPLAINTS ON THE INTERNET THIS SEEMS TO BE QUITE A PROBLEM WITH NO FIX.  WE FEAR FOR OUR SAFETY DRIVING THE CAR AND GOING ANY LONG DISTANCE. HELP!  *TR",
        "vin": "YV1CY59H641"
    }
]