[
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2012",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "RANGER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON I75 WHEN ENGINE STOPPED. I LOST ALL POWER. WAS ABLE TO COAST OFF THE ROAD AND ONTO THE SHOULDER. AFTER FIVE MINUTES, TRUCK STARTED AND DROVE HOME WITHOUT ANY FURTHER PROBLEM. CONTINUED TO HAVE SAME PROBLEM, DIDN'T MATTER WHAT SPEED I WAS DRIVING OR IF I WAS STOPPED AT A LIGHT, AND IT WOULD STOP REPEATEDLY IN ONE WEEK OR GO FOR MONTHS WITHOUT A PROBLEM. TRUCK WOULD STOP AND WOULD EVENTUALLY RESTART WITHIN A COUPLE MINUTES OR UP TO 30 MINUTES AFTER IT HAD STOPPED. I REPEATEDLY HAD TO COAST OR PUSH THIS TRUCK FROM THE ROADWAY WITHOUT ANY POWER STEERING. IN EARLY 2011, THE TRUCK STOPPED THREE TIMES IN ONE DAY. THE THIRD TIME, IT STOPPED IN FRONT OF FRIENDLY FORD, MONROE, MI. THEY KEPT IT FOR TWO WEEKS BUT IT ONLY STOPPED RUNNING FOR THEM ONE TIME AND IT REPAIRED ITSELF BEFORE THEY COULD FIND THE PROBLEM. IN MAY OF 2012, IT BEGAN STOPPING MULTIPLE TIMES IN ONE DAY. IT STOPPED AND WOULD NOT RESTART AND I HAD IT TOWED TO CREST FORD IN FLAT ROCK, MI. THEY DISCOVERED THE FUEL SHUTOFF INERTIA SWITCH HAD FAILED AND REPLACED IT AND THE PIG TAIL WIRING HARNESS.  IT APPARENTLY HAD OVERHEATED FOR SOME TIME AND HAD MELTED THE WIRING HARNESS INTO THE SWITCH. I PAID $367.94 FOR THESE REPAIRS. AT THIS TIME THE TRUCK ONLY HAD 28,370 MILES ON IT. THE TRUCK WAS USED VERY LITTLE AND WAS ALWAYS KEPT INSIDE MY GARAGE. THE DEALER TOLD ME TO CONTACT FORD FOR POSSIBLE REIMBURSEMENT. FORD TOLD ME THEY DID NOT HAVE A RECALL FOR THIS PROBLEM AT THIS TIME BUT TO KEEP MY RECEIPT IN CASE OF A FUTURE RECALL. I FEEL THIS IS A SAFETY PROBLEM. THIS SWITCH IS DESIGNED TO SHUT OFF THE FUEL PUMP DURING A CRASH SO AS NOT TO FEED A FIRE. I GOOGLED FOR \"FORD RANGER DEFECTIVE INERTIA SWITCH,\" AND FOUND THOUSANDS OF SIMILAR COMPLAINTS WHERE THEIR RANGER WOULD SUDDENLY STOP AND EVENTUALLY WOULD REQUIRE THE INERTIA SWITCH TO BE REPLACED AND IN SOME INSTANCES, IT WAS REPLACED AS MANY AS THREE TIMES DURING OWNERSHIP.  *JB  UPDATED 07/19/12",
        "vin": "1FTYR10DX5P"
    }
]