[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/03/2012",
        "dateOfIncident": "07/10/2012",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473614,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "SLK350",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE JERK AS VEHICLE DECELERATED AROUND 10-12 MPH. TOOK VEHICLE TO DEALERSHIP AND TEST DROVE WITH TECHNICIAN WHO VERIFIED THE PROBLEM. THERE WERE NO WARNING LIGHTS OR CODES FOUND. I WAS NOTIFIED BY THE DEALERSHIP THAT THERE WAS A SNAP RING FAILURE WITHIN THE GEAR BOX. INVOICE INDICATES \"RETAINING CLIP FAILURE INSIDE TRANSMISSION, VERIFIED SEVERE 3-2 DOWN SHIFT, SHORT TEST NO CODES.CHECK OF ADAPTATION DATA FOUND 3-2 DOWN SHIFT AT NEGATIVE LIMIT. REMOVED TRANSMISSION AND INSPECTED, FOUND B1 RETAINING CLIP FAILURE. REPLACE B1 AND B3 TENSIONING SPRINGS AND RETAINING CLIPS\". MB CORPORATE WAS NOTIFIED WITH NO ASSISTANCE. I WAS APPALLED AT THE STATEMENTS MADE BY CUSTOMER COMPLAINT MANAGER WHO STATED \"THE CAR HASN'T BEEN IN FOR SERVICE SINCE 2009\", I RESPONDED BY SAYING THE VEHICLE WASN'T DUE FOR SERVICE UNTIL 26K MILES, MAINTENANCE IS DETERMINED BY MILEAGE, NOT YEARS, IF I'M CORRECT. SHE ALSO INDICATED THAT \"RECALLS WERE ALWAYS VIN SPECIFIC\" AND MY CAR WASN'T ONE OF THEM. I BELIEVE THERE'S A PROBLEM WITH THE TRANSMISSION THAT'S BEING CONCEALED BECAUSE MOST OF THE FAILURES ARE OCCURRING AT LOW MILES WHILE THE VEHICLES ARE STILL UNDER WARRANTY. MY VEHICLE WAS OUT OF WARRANTY DUE TO AGE BUT HADN'T TURNED 26K MILES YET. THE DIAGNOSIS WAS CLASSIFIED AS A FAILURE WHICH SHOULD HAVE BEEN TAKEN CARE OF BY THE MANUFACTURER. THERE NEEDS TO BE AN INVESTIGATION INTO HOW MANY REPAIRS HAVE BEEN MADE ON THE 7G TRANSMISSION. THERE IS A PROBLEM.  *TR",
        "vin": "WDBWK56F76F"
    }
]