[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2012",
        "dateOfIncident": "09/14/2005",
        "fire": false,
        "manufacturer": "Triumph Motorcycles America, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481214,
        "products": [
            {
                "manufacturer": "Triumph Motorcycles America, Ltd.",
                "productMake": "TRIUMPH",
                "productModel": "SPEED TRIPLE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF A 1999 TRIUMPH SPEED TRIPLE, VIN# [XXX], COLOR ROULETTE GREEN PURCHASED AT FREEHOLD TRIUMPH OF FREEHOLD, N.J., CURRENTLY WITH 11,356 MILES. THIS HAS BEEN A PAMPERED AND EXCELLENTLY MAINTAINED MOTORCYCLE THAT HAS ONLY BEEN STORED INSIDE CLIMATE CONTROLLED ENVIRONMENTS SINCE PURCHASE. I WRITE TO YOU DUE TO A PROBLEM I AM HAVING WITH THE PAINT SEPARATING FROM THE GAS TANK IN BUBBLE FORMATIONS THROUGHOUT THE TANK. I FIRST NOTICED THIS IN 2005 ON ONE PART OF THE TANK THAT WAS HIDDEN AND WAS NOT ON THE FINISHED SURFACE. THE ISSUE WAS BOUGHT TO THE ATTENTION OF THE AUTHORIZED DEALER I WAS HAVING DO 12K MILEAGE SERVICE AT THAT TIME. HE DID NOT TAKE IT TOO SERIOUSLY AND SAID AT THAT TIME TRIUMPH WOULD NOT COVER THIS AS A WARRANTY ISSUE. CURRENTLY I AM EXPERIENCING THE PAINT SEPARATING IN BUBBLE FORMATIONS THROUGHOUT ON EXPOSED FINISHED SURFACES OF THE GAS TANK. AS OF THIS DATE AFTER PIERCING THE VARIOUS LOCATIONS THERE HAS NOT BEEN GAS LEAKING, THOUGH THE GAS TANK HAS BEEN EMPTIED OF GAS DUE TO HAVING BEEN STORED LONG TERM. SO I CANNOT SAY 100% THAT THE TANK IS NOT LEAKING AT THOSE LOCATIONS ALSO. I AM AWARE THAT CURRENTLY THERE IS A CLASS ACTION LAWSUIT AGAINST THE MAKER OF GAS TANKS MANUFACTURED FOR DUCATI & APRILIA MOTORCYCLES. MY GAS TANK IS ALSO MADE BY THE SAME MANUFACTURER, ACERBIS.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "SMT500FM6XJ"
    }
]