[
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2012",
        "dateOfIncident": "11/21/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILLED MY GAS TANK AT A HOLIDAY GAS STATION/STORE IN ESCANABA, MI ABOUT 6 P.M., NOVEMBER 21 WHILE TRAVELING. I FILLED THE TANK, LOCKED THE VEHICLE, AND WENT INTO THE STORE FOR A SNACK. WHEN I RETURNED TO THE VEHICLE, AN EMPLOYEE WAS SWEEPING UP GLASS FROM MY BACK WINDOW WHICH SHE HEARD EXPLODE. THE WINDOW WAS COMPLETELY GONE. THERE WAS NOTHING AGAINST THE BACK WINDOW OR THE HATCH BACK THAT WOULD CAUSE STRESS. FISHING EQUIPMENT WAS LYING FLAT ON THE FLOOR. I DROVE 200 MILES HOME WITH NO WINDOW. BESIDES THE EMPLOYEE WITNESS, I FILED A POLICE REPORT WITH THE ESCANABA POLICE.    I CONTACTED A FORD DEALERSHIP AND WAS TOLD TO TAKE PICTURES. I SENT DOCUMENTATION ALONG WITH THE PICTURES TO THE DEALERSHIP. THAT WAS NOT GOOD ENOUGH FOR FORD. I WAS TOLD TO TAKE THE CAR TO THE DEALERSHIP WHERE THE BODY REPAIR MANAGER TOOK PICTURES AND SENT THEM TO FORD WHO CAME BACK DENYING THE WARRANTY COVERAGE ON THE GLASS \"BECAUSE IT CANNOT BE PROVEN THAT THIS WAS A FORD GLASS DEFECT. I DROVE 200 MILES ROUND TRIP WASTING AN AFTERNOON OF MY TIME.     I HAVE CONTACT AND TALKED WITH FORD CUSTOMER RELATIONS A HALF DOZEN TIME. I ASKED THE WITNESS TO CALL FORD CUSTOMER RELATIONS TO VERIFY THAT I WAS NOT EVEN IN THE VEHICLE AT THE TIME OF THE GLASS EXPLOSION. GLASS FEW FROM 10 TO 15 FEET IN SMALL, DEADLY PIECES. LUCKILY, I OR SOMEONE ELSE WAS NOT STANDING BEHIND THE CAR.     I HAVE NOT OPENED THE BACK WINDOW FOR MONTHS FINDING IT EASIER TO REMOVE ITEM BY LIFTING THE HATCHBACK DOOR.  IN CONTACTING FORD CUSTOMER RELATIONS, I WAS TOLD THAT ONCE A DECISION HAS BEEN MADE, IT COULD NOT BE REVERSED. I ASKED TO SPEAK TO SOMEONE IN AUTHORITY AND WAS TOLD THAT ONCE A DECISION WAS MADE BY FORD, IT COULD NOT BE REVERSED AND WAS GIVEN AN ADDRESS TO WRITE MY COMPLAINT.  *TR",
        "vin": "1FMCU9E71BK"
    }
]