[
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/17/2003",
        "dateOfIncident": "11/20/2001",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10002868,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VT750CD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH DEFECTIVE RIMS ON HONDAS SHADOW SPIRIT 750  MOTORCYCLES!  AFTER 500 MILES I NOTICED THAT MY MOTORCYCLE \"BOUNCED\" HORRIBLY FROM  20-60MPH.    WHEN I BROUGHT MY BIKE TO A DEALERSHIP TO HAVE THE WHEELS BALANCED, WE  NOTICED THERE WERE ALREADY 6 LEAD WEIGHTS ON THE REAR WHEEL RIGHT FROM  THE FACTORY SINCE IT WAS NEW! MY BIKE CONTINUED TO BOUNCE!    THIS BOUNCING CAUSED ME TO CRASH MY MOTORCYCLE ON NOV 20, 2001. I WAS TURNING LEFT, GOING THE SPEED LIMIT, WHEN I LOST CONTROL OF THE REAR END. THE REAR TIRE SLID OUT FROM UNDER ME AND THE BIKE CRASHED AND SLID ON ITS LEFT SIDE. MY LEFT HAND AND LEFT LEG WERE INJURED. A FEW MONTHS LATER I HAD MY BIKE REPAIRED.    AT APROX 6000 MILES I PURCHASED A NEW REAR TIRE AND HAD IT  PROFESSIONALY BALANCED AT CHAPARRAL MOTORSPORTS IN SAN BERNARDINO, CA  (A LARGE, WELL-RESPECTED MOTORCYCLE DEALERSHIP).    WHEN I RODE AWAY, I NOTICED THE REAR END BOUNCING AGAIN! THEY SAID THAT THEY  BALANCED IT ON THE BEST EQUIPMENT AVAILABLE.    I AM A MEMBER OF THE SPIRIT 750 DISCUSSION BOARD...  HTTP://FORUMS.DELPHIFORUMS.COM/SPIRIT750/MESSAGES    WE FOUND OUT FROM OTHER FELLOW SPIRIT 750 OWNERS THAT  THIS \"BOUNCING\" PROBLEM WAS VERY PREVALENT AND WAS CAUSED BY DEFECTIVE  RIMS ON OUR NEW BIKES RIGHT FROM THE FACTORY!    I CALLED HONDA'S MOTORCYCLE CUSTOMER SERVICE DEPT AT (310) 532-9811.  AT FIRST THE CUSTOMER SERVICE REP WAS RELUNCTANT AND TRIED TO DISMISS  MY BOUNCING PROBLEM AS A MAINTAINCE ITEM OR HE BLAMED IT ON MY TIRES.  BUT WHEN I INFORMED HIM THAT I HAD BEEN THROUGH TWO SETS OF TIRES AND  BALANCING, AND THAT I KNEW FOR A FACT THAT OTHER SPIRIT 750 OWNERS WERE  HAVING THE SAME PROBLEM AS I WAS, HE INFORMED ME OF A \"SECRET GOODWILL\"  PROGRAM FROM HONDA! BUT THAT I FIRST HAD TO TAKE MY BIKE TO A DEALER TO  HAVE IT SERVICED ON MY OWN!    HONDA IS ALREADY AWARE OF THE DEFECTIVE RIMS ON THESE MOTORCYCLES!  THIS KIND OF BOUNCING WILL CAUSE TRAFFIC ACCIDENTS AND DEATH OR SERIOUS  INJURY TO SPIRIT 750 OWNERS AND THEIR RIDERS!",
        "vin": "JH2RC44142M"
    }
]