[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/08/2013",
        "dateOfIncident": "11/29/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DTS",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2006 CADILLAC DTS WAS PURCHASED USED IN NOVEMBER OF 2011. AT THE TIME OF PURCHASE THE VEHICLE ONLY HAD 30,743 MILES, WAS LIGHTLY USED AND NEVER INVOLVED IN ANY ACCIDENTS. THE VEHICLE CURRENTLY HAS APPROXIMATELY 69,000 MILES. A COUPLE OF MONTHS AGO, I NOTICED THE RIGHT SIDE HID HEADLIGHT FLICKERING AND GOING OUT WHILE DRIVING.  THINKING IT WAS A BULB, I SPOKE TO THE DEALER BY PHONE WHO ADVISED IT MAY BE A BULB, BALLAST OR LOOSE CONNECTION. FROM RESEARCH AND DEALER CONVERSATION, I LEARNED IT WAS A COSTLY AND TIME CONSUMING REPAIR JUST TO REPLACE THE BULB, DUE TO DESIGN ISSUES REQUIRING REMOVAL OF THE ENTIRE BUMPER COVER JUST TO ACCESS THE HEADLIGHT. I TOOK IT TO THE DEALER FOR REPAIR, BUT WAS TOLD THAT THEY COULD NOT DUPLICATE THE PROBLEM. SINCE THEN, THE FLICKERING HAS GOTTEN WORSE, NOW AFFECTING BOTH HEADLIGHTS. THEY RANDOMLY FLICKER OFF AND ON WHILE DRIVING PROVING TO BE A DISTRACTION TO ME, AS WELL AS DRIVERS OF OTHER VEHICLES.  IT IS ALSO A SAFETY ISSUE AS THERE IS NO WARNING WHEN THEY ARE GOING TO GO OUT. A SEARCH OF THIS ISSUE VIA GOOGLE REVEALS THIS IS NOT AN ISOLATED INSTANCE WITH MY VEHICLE, BUT IN FACT, IS VERY WIDESPREAD WITH MANY DOCUMENTED CASES MIRRORING MY SITUATION. CADILLAC / GM TO MY KNOWLEDGE HAS NOT OFFERED ANY RELIEF TO AN ISSUE THAT IS OBVIOUSLY A DEFECT. PER THE DEALER, REPAIR OF THE BALLAST COULD BE WELL OVER $1000. HOWEVER, REVIEWING OTHER'S EXPERIENCE, THERE HAS BEEN LITTLE SUCCESS IN FINDING OR REPAIRING THE ISSUE.  CADILLAC IS SUPPOSED TO BE A FLAGSHIP FOR GM AND A PREMIUM AUTOMOBILE. I WOULD THINK RELIABLE, SAFE AND FUNCTIONAL HEADLIGHTS WOULD BE A MINIMUM THRESHOLD FOR SAFETY. I ASK YOUR ASSISTANCE IN REVIEWING THE DOCUMENTED ISSUES FROM MANY FRUSTRATED CADILLAC OWNERS WHO EXPERIENCE THE SAME ISSUES THAT I AM HAVING AND EXERT SOME PRESSURE ON GM / CADILLAC TO RECTIFY THIS KNOWN ISSUE.  *TR",
        "vin": "1G6KD57Y86U"
    }
]