[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/19/2012",
        "dateOfIncident": "08/20/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "TOWN AND COUNTRY",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY VEHICLE HAD ABOUT 16000 MILES ON IT, I NOTICED THAT WHEN BREAKING DURING HIGHWAY SPEEDS, THE VEHICLE WOULD VIBRATE.  I TOOK THE VEHICLE TO MY DEALER AT ABOUT 17000 MILES AND WAS INFORMED THE ISSUE WAS CAUSED BY WARPED ROTORS.  THE BRAKE PADS WERE FINE, BUT THE ROTORS WOULD NEED TO BE MACHINED OR REPLACED.  I OPENED A TICKET WITH CHRYSLER SINCE THE BRAKES WERE OUT OF WARRANTY AT 12000 MILES.  THE AGREED TO COVER THE REPAIR.  I ASKED FOR NEW ROTORS, BUT WAS INFORMED THAT THEY WERE ON A 4 MONTH BACK ORDER.  I HAD HEM MACHINED INSTEAD, THOUGH I KNEW I WOULD BE BACK IN THE SAME BOAT SOON.  ON 12-19-12, FOUR MONTHS LATER WITH 6000 MORE MILES, I TOOK THE VAN BACK INTO THE DEALER WITH THE SAME VIBRATING ISSUE, AND WAS AGAIN INFORMED THAT MY ROTORS WERE WARPED.  THE BRAKES WERE FINE WITH 7/32 LEFT ON THEM.  THE ROTORS WOULD NEED TO BE REPLACED THIS TIME.  AT 23000 MILES, THIS WOULD BE THE 2ND ROTOR ISSUE.  I WAS INFORMED THE REPAIR WOULD COST $248, BUT CHRYSLER WOULD SPLIT IT WITH ME, WITH MY PART DOWN TO $124.  THE SERVICE MGR STATED HE FELT THE ROTORS WEREN'T MADE WELL.  THE TECH TOLD ME THIS KEEPS HAPPENING, AND THE CHRYSLER REP INFORMED ME THE NEW ROTORS WERE DIFFERENT, SO I SHOULDN'T HAVE THIS ISSUE AGAIN.  IN MY MIND, THIS IS THE DEFINITION OF A DEFECT.  I DO NO THINK I SHOULD HAVE TO PAY ANYTHING TO FIX A DEFECT.  SOME 2011 TOWN AND COUNTRY VANS HAVE BEEN GRANTED AN EXTENDED WARRANTY ON THE BREAKS, BUT MINE IS NOT COVERED.  I WAS ACTUALLY TOLD BY THE CHRYSLER REP THAT IT WOULD BE A GOOD IDEA TO POST THIS WITH THE NHTSA IN THE HOPES OF TRIGGERING A RECALL.I PLAN ON GETTING THE ROTORS NEXT WEEK, AS THEY ARE ON SPECIAL ORDER, BECAUSE THEY AREN'T AVAILABLE LOCALLY.  IN 18 YEARS OF DRIVING, I HAVE NEVER REPLACED ROTORS BEFORE 60,000 MILES.  THANK YOU FOR YOUR TIME.  *TR",
        "vin": "2A4RR8DGXBR"
    }
]