[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/24/2013",
        "dateOfIncident": "02/23/2011",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509414,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2005",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "ASSURANCE TOURING",
                "productYear": "9999",
                "size": "235/65R16",
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED 4 GOODYEAR ASSURANCE TOURING P235/65R16 TIRES THAT WERE INSTALLED ON 2005 HONDA ODYSSEY LX. VEHICLE WAS ALIGNED AND TIRES ROTATED,  BALANCED, AND PRESSURE CHECKED REGULARLY.  THE TIRE WAS ADVERTISED WITH A 70,000 MILE TREAD LIFE WARRANTY. AT APPROXIMATELY 17,300 MILES I NOTICED THE TREAD ON ALL 4 TIRES APPEARED TO BE SEPARATING FROM THE TIRE WHEN VIEWED FROM THE SIDE. I TOOK IT TO ORIGINAL TIRE DEALER WHO TOLD ME IT WAS NORMAL AND THERE WAS NOTHING TO WORRY ABOUT. AT THE NEXT ROTATION, I AGAIN NOTED THAT THE SEPARATION APPEARED TO BE GETTING WORSE.  AGAIN I WAS TOLD THAT THIS IS NORMAL.  AT 24,000 MILES, AND WITHIN 400 MILES OF A ROTATION AND BALANCE, THE TIRES DEVELOPED A VERY MILD VIBRATION, WHICH HAS NEVER COMPLETELY GONE AWAY, EVEN WITH FURTHER ROTATION AND BALANCE.  AT 45,000 MILES, THERE WERE CRACKS (POSSIBLY DRY ROT) BEGINNING TO FORM ALL OVER THE SIDEWALLS OF THE TIRES.  ADDITIONALLY, THE TREAD HAD NOTICEABLE SEPARATION FROM TIRE. LASTLY, THE TIRES HAD WORN TO THE 2/32 MINIMUM TREAD DEPTH.  THE TIRE DEALER REFUSED SERVICE OR EVEN PRORATE THE TIRE TOWARDS NEW ONES. I CALLED GOODYEAR, BUT THEY INSTRUCTED ME TO DEAL WITH THE TIRE DEALER, AS THAT TIRE WAS MADE SPECIFICALLY FOR THEM.  THE TIRE DEALER REFUSES TO ACKNOWLEDGE ANY PROBLEM, THOUGH THEY HAVE NOW OFFERED A MINIMAL PREPORATION AMOUNT WHICH ISN'T ENOUGH TO OFFSET THE COST OF THE INSTALLATION OF NEW TIRES.  THE DEALER REFUSES TO PRORATE BASED ON ACTUAL MILEAGE VS WARRANTED MILEAGE, ALTHOUGH THEIR WRITTEN WARRANTY POLICY STATES THAT IS THE WAY THE WARRANTY SHOULD BE HANDLED.  *TR",
        "vin": "5FNRL38235B"
    }
]