[
    {
        "components": "STEERING,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/18/2013",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10508714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND BOUGHT MY 2005 COROLLA AS A WEDDING GIFT. IT WAS SLIGHTLY USED BUT BOUGHT FROM ONE OF THE BEST TOYOTA DEALERSHIPS IN OUR TOWN. IT HAD APPROX. 18000 MILES WHEN I GOT T IN FEB OF 2007. IT WAS VERY BASIC AND A STANDARD. THE SHIFTING/CLUTCH NEVER SEEMED RIGHT FROM THE START BUT I LEARNED HOW TO DEAL WITH IT. IN FEB OF 2010, I WAS LEAVING WORK AND WAS A FEW MILES FROM HOME. I HAD NEVER IN MY MANY YEARS OF DRIVING HAD A WRECK. THE TRUCK AHEAD OF ME CAME TO AN ABRUPT STOP AND AS I TRIED TO BRAKE,MY CAR SEEMED TO SPEED UP AND WENT RIGHT UP UNDER THE TRUCK. THE WHOLE FRONT END SMASHED RIGHT UP TO THE WINDSHIELD YET THE AIRBAG DID NOT DEPLOY. INSURANCE DEEMED IT A TOTAL LOSS BUT IT WAS RIGHT AT THE POINT WHERE I STILL OWED AS MUCH AS THE PAY OFF SO THEY WENT AHEAD AND FIXED IT. I WAS OUT A LOT OF MONEY. THE SECOND WRECK JUST OCCURRED ON MARCH 15,2013. I WAS DRIVING HOME FROM A FAMILY MEMBERS RESIDENCE IN THE COUNTRY AND WAS TRAVELING ON DESERTED ROADS AT ABOUT 3:30 AM. I WENT AROUND AN S CURVE THAT I GREW UP DRIVING SO IT I WAS VERY FAMILIAR. I TRIED TO SLOW DOWN,BUT AGAIN SEEMED TO ACCELERATE. I OVER CORRECTED AND RAN THRU A DITCH AND COMPLETELY THREW A METAL FENCE. AGAIN. THE AIRBAG,WHICH ALWAYS HAD THE LIGHT ON AS IF READY TO DEPLOY,DID NOT GO OFF. I WAS HURT VERY BADLY AND APPARENTLY BLACKED OUT FOR A GOOD WHILE. THIS TIME THE INSURANCE DEEMED IT A TOTAL LOSS AND WE ARE WAITING ON A SETTLEMENT FROM OUR INSURANCE PLUS I HURT MY KNEE AND AM MEETING WITH A SURGEON NEXT WEEK. THAT CAR WAS NOTHING BUT TROUBLE AND I AM HAPPY TO B RID OF IT BUT FEEL WE ALL DESERVE JUSTICE FOR ALL THE MANY ERRORS TOYOTA HAS GIVEN THIS VEHICLE.  *TR",
        "vin": "1NXBR32E55Z"
    }
]