[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/30/2013",
        "dateOfIncident": "05/30/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM IN THE PROCESS OF TRYING TO FIGURE OUT WHAT IS GOING ON. WHILE DRIVING ON THE INTERSTATE (WITH CRUISE CONTROL ON) I NOTICED THE OD LIGHT STARTED FLASHING AND THE CHECK ENGINE LIGHT CAME ON. I PULLED OVER AND THE BRAKES WERE SMOKING TO THE POINT I WAS AFRAID THERE WOULD BE A FIRE. I HAD TO SIT ON THE SIDE OF THE ROAD WITH MY TODDLERS AND WAIT FOR IT TO STOP SMOKING. I WAS STILL ABOUT 20 MILES FROM HOME. I AM NOT SOMEONE WHO IS FORTUNATE ENOUGH TO HAVE FAMILY NEARBY OR FRIENDS WHO COULD HELP. WE ARE ON A TIGHT BUDGET WITH A CHILD WHO HAS SPECIAL NEEDS AND ONLY ONE WORKING PARENT SO COULD NOT AFFORD A TOW. THE 'CHECK ENGINE' LIGHT STAYED ON BUT THE OD WAS OFF UPON STARTING THE VEHICLE. THE OD CAME ON 2X IN THE 20 MILES IT TOOK TO ARRIVE. EACH TIME IT CAME ON I PULLED OVER, TURNED THE VAN OFF AND BACK ON. WHEN THE OD WAS FLASHING WHEN I LET OFF THE ACCELERATOR, EVEN ON AN INCLINE, IT WAS SLOWING ME DOWN SO I FIGURED THE BRAKES WERE ENGAGED. WITH THE CRUISE CONTROL ON I WAS UNABLE TO TELL SO I WAS PUSHING IT UP TO 70MPH WITH THE BRAKES GOING AGAINST IT. ON THE WAY HOME I DID NOT USE CRUISE CONTROL BUT IT KEPT HAPPENING ONLY IT WAS VERY NOTICEABLE THAT THE BRAKES WERE RUBBING. THERE IS NOW BRAKE DUST ALL OVER MY TIRES AND THE SIDE OF THE VAN. THIS COULD HAVE CAUSED AN ACCIDENT, THIS COULD HAVE CAUSED A FIRE! MY DAUGHTER IS DISABLED AND IN A COMPLEX CHILD RESTRAINT SYSTEM WITH STRAPS AND POSITIONERS. I ALSO HAVE A 1 YR OLD AND IF SOMETHING HAD HAPPENED I AM NOT CONFIDENT I COULD HAVE GOTTEN THEM BOTH OUT IN TIME HAD A FIRE STARTED. I NEED THIS VAN TO CARRY MY DAUGHTERS WHEEL CHAIR AROUND. I AM EXTREMELY IRATE. WE BOUGHT THIS VEHICLE 3 MONTHS AGO (SECOND HAND)!!!! SOMETHING NEEDS TO BE DONE ABOUT THIS ISSUE SINCE I HAVE READ ONLINE THAT IT IS ACTUALLY COMMON!!! THEY ARE SAYING THE CODE IS P1744 TORQUE CONVERTER CLUTCH SYSTEM STUCK IN OFF POSITION. $3000 TO FIX!!!   *TR",
        "vin": "2FMZA50401B"
    }
]