[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2003",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002883,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN THE FIRST 1000 MILES CAR WAS SHAKING HEAVILY ON STARTUP.  HAD TO HAVE VEHICLE TOWED TO DEALERSHIP WHERE IT WAS NOT EVEN LOOKED AT FOR 24HRS.  DIAGNOSISED AS COIL ISSUE AND WAS WITHOUT THE CAR FOR ALMOST 1 WEEK.  8 MONTHS LATER WIFE AND DAUGHTER WERE DRIVING ON FREEWAY WHEN CAR SHOWS SAME SYMPTOMS.  HAD TO PULL OVER AND WAIT 90 MIN FOR TOW TRUCK.  DIAGNOSISED AS COIL #3 ISSUE.  WITHOUT THE CAR FOR 10 DAYS.  LESS THAN A MONTH LATER, LEAVING WORK AND GOING OVER A BRIDGE, VEHICLE ACTED THE SAME WAY AGAIN.  GOT THE CARE HOME (BARELY) AND THEN HAD TOW TRUCK COME AGAIN.  THIS TIME CONTACTED VM CUSTOMER CARE TO TRY AND GET SUPPORT FOR REPLACEMENT OF 4TH COIL TO TRY AND AVOID A 4TH BAD EXPERIENCE.  NO LUCK, 3 REPRESENTITIVES AND 1 SUPERVISOR LATER, NO PROGRESS.  EVEN THOUGH 3 OF THE 4 HAVE GONE BAD, THEY INSIST ON ONLY REPLACING THE PARTS THAT HAVE SHOWN THE DEFECT.  THE PROBLEM WITH THIS IS THAT IT CANNOT BE PREDICTED AND THE 4TH COIL IS OF THE SAME LOT THAT HAS ALREADY GONE BAD.    ON TOP OF ALL THIS, THE FIRST TIME WE HAD THIS TROUBLE, THEY HAD THE NERVE TO PUT ME AND MY FAMILY IN A GEO METRO AS A LOANER (NO OFFENSE TO GEO OWNERS).  WITH THIS LAST TIME, I AM FINALLY IN A NICER, COMPARABLE VEHICLE.    VW HAS ACKNOWLEDGED THE PROBLEM TO ME BUT REFUSES TO STEP UP AND DO THE RIGHT THING.  THIS A $70 PART...$70.  I WOULD THINK THAT IS WORTH THE EXPENSE TO ENSURE THE SATISFACTION AND SAFETY OF THEIR CUSTOMERS.",
        "vin": "WVWVD63B62E"
    }
]