[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/18/2003",
        "dateOfIncident": "12/19/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002898,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING, VEHICLE WILL PULL TO LEFT, RIGHT & SOMETIMES TO BOTH DIRECTIONS.  THIS DEGREE OF PULLING WILL VARY DEPENDING UPON VEHICLE RUN TIME AND TEMPERATURE. SOMETIMES THIS PULLING IS EXTREME OTHER TIMES ONLY MODERATE OR SLIGHT. WHEN PULLING A TRAILER WITH ANY WIEGHT, IT IS GREATLY ACCENTUATED. I HAVE ARGUED WITH THE FORD DEALERSHIP REGARDING THIS COMPLAINT WITHOUT A SATISFACTORY CONCLUSION. THE DEALERSHIP BROUGHT IN AN ENGINEER WHO SAID THIS WAS A \"NORMAL\" CONDITION AND YOUR DEPARTMENT HAD INVESTIGATED THIS COMPLAINT AND FOUND NO FAULT WITH THIS ISSUE. MY VEHICLE HAS HAD THIS PROBLEM SINCE DAY ONE OF OWNERSHIP.  THIS VEHICLE WILL PULL/CHATTER CONSTANTLY FOR DAYS AND OTHER DAYS IT WILL NOT.  SINCE 20 DEC 2002, MY FAMILY HAS TRACKED THE ISSUE EVERYTIME THE VEHICLE IS DRIVEN ALL FOR THE PUROPOSES OF ASSISTING THE DIAGNOSTIC REPAIR OF THIS ISSUE.  IT APPEARS THE MORE THE VEHICLE IS DRIVEN OR THE WARMER THE VEHICLE GETS, THE MORE IT ACTS UP.  IF FOMOCO SAYS THIS IS NOT AN ISSUE, WHY THEN HAVE THEY REPLACED MY FRONT SPRINGS, BALL JOINTS AND INSTALLED SPECIAL EXPENSIVE BRAKE PADS?  I FIRMLY BELIEVE THIS VEHICLE AND MANY OTHERS HAVE A BRAKING ISSUE FOMOCO REFUSES TO DEAL WITH EITHER BY NOT HAVING PROPER DIAGNOSTIC TOOLS AND KNOWLEDGE TO REPAIR THIS PROBLEM.  I HAVE 20+ YEARS OF EXPERIENCE WORKING ON MILITARY VEHICLES AND WAS ASE CERTIFIED IN 1987 ON BRAKE SYSTEMS.  PLEASE REVIEW THIS COMPLAINT CAREFULLY AS I BELIEVE ACCIDENTS WILL OCCUR WITH MANY SERIOUS INJURIES. AS OF THIS DATE, WE ARE STILL MONITORING THIS VEHICLE IN HOPES YOU CAN AND WILL INVESTIGATE THIS AND CONCLUDE THERE IS A PROBLEM SO FORD WILL FIX IT.  THIS INFORMATION IS AVAILABLE FOR YOUR REVIEW.",
        "vin": "1FTSX31F31E"
    }
]