[
    {
        "components": "STRUCTURE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/02/2013",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522814,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DURANGO",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FILLING GAS TANK TO CAPACITY, THE GAS PUMP SHUTS OFF AND GAS SPEWS FROM THE VEHICLE OUT ONTO THE VEHICLE AND GROUND.  I WOULD ESTIMATE MAYBE 1/2 TO 1 GALLON OF GAS IS INVOLVED.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP, SHERWOOD, OF SALISBURY, MD IN 2011 TO HAVE PROBLEM ADDRESSED.  WAS TOLD THAT THERE WAS NO PROBLEM TO BE FIXED.  RECEIVED LETTER DATED 2/1/2013 FROM CHRYSLER GROUP LLC STATING THAT THE WARRANTY ON THE FUEL TANK INLET CHECK VALVE HAS BEEN EXTENDED TO LIFETIME COVERAGE FOR MY VEHICLE. IT GOES ON TO STATE THAT \"IF YOU ARE EXPERIENCING THIS CONDITION NOW OR IN THE FUTURE, TO SIMPLY CONTACT YOUR DEALER TO HAVE THE REPAIRS PERFORMED.  TOOK CAR TO SHERWOOD DEALERSHIP AND WAS GIVEN THE  RUN AROUND. WAS TOLD IN JUNE 2013 THAT THERE WAS A SHORTAGE OF PARTS AVAILABLE TO FIX MY VEHICLE AND THEY WOULD CALL IN A FEW MONTHS TO SCHEDULE THE REPAIR. CALLED THE CHRYSLER CUSTOMER CARE ASSISTANCE CENTER AND REPORTED THE INCIDENT ON 6/4/2013. DECIDED TO FILE A GRIEVANCE HERE WITH THE NHTSA AS THIS IS AN EPA ISSUE AND SAFETY ISSUE DUE TO THE GASOLINE SPILLAGE. AS A RESULT OF THE GASOLINE SPILLAGE, THE PAINT UNDER THE FUEL FILLING AREA OF THE VEHICLE HAS BUBBLED AND HAS NOW RUSTED IN THAT AREA.  HAVE REQUESTED THAT THIS PROBLEM ALSO BE TAKEN CARE OF AS IT IS A DIRECT RESULT OF A MALFUNCTION OF THE VEHICLE.  HAVE BEEN TOLD THAT THEY WOULD MAKE THE REPAIR(WHENEVER THE PARTS ARE AVAILABLE) BUT, WILL NOT TAKE CARE OF THE RUST ISSUE.  WOULD LIKE TO HAVE FEEDBACK AS TO HOW TO GET THIS TAKEN CARE OF. IT IS ABSOLUTELY RIDICULOUS THAT CHRYSLER ACKNOWLEDGES THERE IS A PROBLEM, HAS SENT A LETTER FOR INSTRUCTION ON HOW TO ADDRESS THE PROBLEM, BUT HAS NOT ACTUALLY FIXED THE PROBLEM 5 MONTHS FROM THE DATE OF THE LETTER!!!!  *TR",
        "vin": "1D4HB48N06F"
    }
]