[
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2013",
        "dateOfIncident": "05/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS A 2001 CHEVROLET CORVETTE. UPON DRIVING THE STEERING COLUMN LOCKED PREVENTING THE CAR FROM BEING CONTROLLED AT SPEED. AFTER RESEARCHING THE ISSUE AND INVESTIGATING THE MATTER WITH CHEVROLET CUSTOMER SERVICE I FOUND THAT THIS STEERING LOCK ANTITHEFT DEVICE WAS FOUND TO BE DANGEROUS AS I DESCRIBED. THE NHTSA FORCED GM TO RECALL VEHICLES, MINE IN 2003, RECALL NUMBER 4006. SUBSEQUENTLY GM CONCLUDED THAT THIS RECALL WAS NOT EFFECTIVE AND ISSUED TWO MORE RECALLS HOWEVER CUSTOMERS WERE NEVER NOTIFIED BY MAIL. RECALL NUMBER 4006C ISSUED IN FEB 08 2006 SUPERSEDES ALL PREVIOUS RECALLS INSTRUCTING DEALERS AND SERVICE TECHNICIANS TO REMOVE THE LOCKING MECHANISM. HOWEVER GM FAILS TO TAKE RESPONSIBILITY TO ASSURE THAT THIS LATTER RECALL IS PROVIDED TO MY VEHICLE. AFTER NUMEROUS CALLS TO CUSTOMER SERVICE 866 790 5700 THEY WILL NOT AUTHORIZE REPAIR OF MY VEHICLE. AFTER $1700 OUT OF POCKET EXPENSES MY CAR IS STILL IN A SITUATION THAT THE STEERING COLUMN CAN LOCK WHILE BEING DRIVEN AND GM FAILS TO RESPOND. I HAVE BEEN BOUNCED AROUND TO 8 TO 9 REPRESENTATIVES IN CUSTOMER SERVICE FROM PERU , TEXAS AND DETROIT ALL WITH NO ACTION. ALL OWNERS OF 1999 TO 2004 CORVETTES WHOSE THEFT DETERRENT SYSTEM IS STILL IN OPERATION, MEANING THE STEERING COLUMN LOCKS WHEN THE KEY IS REMOVED SHOULD BE AWARE THAT THE CAR MAY LOCK WHEN DRIVING AND CRASH. THIS IS FROM GM'S OWN SERVICE RECALL NUMBER 4006C. THESE VEHICLE SHOULD NOT BE DRIVEN.  *TR",
        "vin": "1G1YY22G315"
    }
]