[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2013",
        "dateOfIncident": "07/07/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "HHR",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK AND AS I WAS MAKING A RIGHT TURN THE POWER STEERING WENT OUT. THIS HAS HAPPENED PREVIOUSLY BUT LUCKILY I WAS AT A STOP SIGN. I THOUGHT THE CAR HAD STALLED SO I CUT IT OFF AND RESTARTED AND IT WAS FINE. I DROVE TO WORK THE NEXT MORNING AND STILL NO PROBLEM UNTIL I WAS MAKING THE RIGHT TURN AND THEN HAD DIFFICULTY CONTROLLING THE CAR. ONCE I MANAGED TO GET IT IN MY DRIVE, SHUT IT OFF AND THEN RESTARTED- THE POWER STEERING MESSAGE WENT AWAY AND ONCE AGAIN THE CAR WAS FINE. SAME THING NEXT MORNING CAR FINE- I WORK ABOUT 5-7 MILES FROM HOME. AGAIN ON THE WAY HOME WITH NO WARNING IN RUSH HOUR TRAFFIC- POWER STEERING GOES OUT AS I AM CHANGING LANES. I MANAGE ONCE AGAIN TO GET HOME. MY CAR HAS THE SAME PART THAT THE CHEVY COBALT HAS AND CHEVY HAD RECALLED THE COBALT TO MAKE REPAIRS BUT NOT THE HHR. I HAVE SEEN NUMEROUS COMPLAINTS FILED ABOUT THIS AND FEAR THAT  THEY DO NOT TAKE OUR SAFETY SERIOUSLY WHOM OWN THE HHR- I HAVE CONTACTED CHEVY AND ASK WHO TO LODGE COMPLAINT WITH SINCE THEY WERE NOT HELPFUL. THEY DID NOT GIVE ME THE INFORMATION. I HAD TO FIND ON GOOGLE. I DID TELL THEM THAT THE INTERNET IS FULL OF THIS SAME COMPLAINT REGARDING THE POWER STEERING ON THE HHR AND THE RESPONSE WAS I  CANNOT LOOK AND UNAPPROVED GM SITES(WHATEVER THAT MEANS). THANK YOU FOR YOU CONCERN AND HOPE YOU CAN HELP SOMEONE FROM HAVING A SERIOUS INJURY DUE TO THIS MALFUNCTION.  *TR",
        "vin": "3GNCA13B39S"
    }
]