[
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/20/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525914,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-V",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "IN APRIL OF THIS YEAR (2013), THE 2008 HONDA CRV-EX THAT I PURCHASE CERTIFIED, PRE-OWNED IN OCTOBER 2012, BEGAN HAVING PROBLEMS WITH THE DOOR LOCKS. AS I WAS DRIVING, THE LOCKS WOULD AUTOMATICALLY UNLOCK AND LOCK THEMSELVES EVERY TIME I CAME TO A STOP AND STARTED DRIVING AGAIN. THE PROBLEM STOPPED AFTER A FEW DAYS, THEN A FEW WEEKS LATER, STARTED OCCURRING AGAIN. BEFORE I CALLED TO HAVE IT CHECKED, IT STOPPED, BUT THEN I WOULD HEAR A SQUEALING SOUND IMMEDIATELY AFTER THE DOORS WERE LOCKED UPON ACCELERATION. ALL OF THESE ISSUES STOPPED, BUT THEN ABOUT A WEEK AGO (JULY 2013), BOTH DOORS ON THE PASSENGER SIDE STARTED RELOCKING THEMSELVES WITHIN 3 SECONDS OF BEING UNLOCKED BY EITHER THE KEY FOB OR FROM THE DRIVER SIDE DOOR. THEY CANNOT BE LOCKED OR UNLOCKED MANUALLY, EVEN WITH AUTO LOCK OFF. THEY ALSO CANNOT BE OPENED FROM THE INSIDE BY THE PASSENGER. THIS IS A SERIOUS SAFETY ISSUE FOR MY CHILD, WHO WOULD NOT BE ABLE TO OPEN HIS DOOR AND EXIT IMMEDIATELY IN THE CASE OF AN EMERGENCY.    IN ADDITION TO THIS PROBLEM, THE TIRE PRESSURE MONITORING SYSTEM (TPMS) LIGHT IS ON PERMANENTLY ON MY DASHBOARD. ACCORDING TO THE DEALER TECHNICIAN I SPOKE WITH, THIS MEANS THE TPMS HAS STOPPED COMMUNICATING WITH THE SENSORS ON AT LEAST ONE OF MY TIRES. THIS IS A HAZARD IN THAT I COULD HAVE DANGEROUSLY LOW TIRE PRESSURE AND WOULD NOT KNOW IT, WHICH COULD LEAD TO A BLOW OUT AT HIGH FREEWAY SPEEDS. THIS SAME TECHNICIAN REPORTED HE HAS SEEN \"QUITE A FEW\" 2007 AND 2008 CRVS COMING IN WITH THIS ISSUE. I CAN WORK AROUND THIS ISSUE BY FREQUENTLY CHECKING TIRE PRESSURE MYSELF, BUT IT REMAINS THAT I SHOULD NOT HAVE TO DO THIS, WHEN I PAID FOR A VEHICLE THAT SHOULD BE DOING IT FOR ME. *TR",
        "vin": ""
    }
]