[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/18/2013",
        "dateOfIncident": "09/14/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544214,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY USED 04 HONDA ACCORD EX V6 FROM MIDLANDS HONDA IN OCTOBER 2007 WITH APPROX. 35,000 MILES ON IT.  NEVER HAD ANY REAL MECHANICAL ISSUES AND ALWAYS GOT IT SERVICED BY THE DEALER.  LOW AND BEHOLD I RECENTLY ENCOUNTERED AN ISSUE WITH MY TRANSMISSION THAT GAVE ME NO WARNING.  I APPEARED TO BE SLIPPING OR SOMETHING, SO I HAD IT SERVICED AND TO NO SURPRISE, IT IS NOT FIXED.  THE SHOP HAS ADVISED THAT WITH ONLY 118,000 MILES THAT MY TRANSMISSION IS SHOT.  I RESEARCHED A PAST RECALL ON MY VEHICLE AFTER THIS HAPPENED AND FOUND THAT OTHER CONSUMERS HAS THE SAME ISSUE WITH THEIR ACCORDS AND HAD TO REPLACE THE TRANSMISSION.  I FEEL THAT HONDA HAS MISLED THEIR CONSUMERS AND THAT THEIR PRODUCTS ARE NOT LIVING UP TO THEIR MARKETING AND SUGGESTED QUALITY.  I USED TO OWN 5 DIFFERENT NISSAN VEHICLES, BUT THE LAST PURCHASE WAS REPURCHASED BY THE DEALER AS A LEMON BECAUSE IT WAS A NEW VEHICLE WITH NUMEROUS ISSUES FROM SUDDEN STALLING TO ELECTRONIC ISSUES, BUT NO RECALLS B/C IT WAS TOO NEW.  I LEFT NISSAN AND WELCOMED HONDA INTO MY FAMILY AT THAT TIME, BUT I FEEL THAT MY KIDS AND ARE NOT SAFE.  I HAVE TO REPLACE A TRANSMISSION THAT SHOULD HAVE LASTED AS LONG AS MY ENGINE, WHICH RECEIVED HER NEW TIMING BELT AT 100,000 MILES.  I MAY BE SUBMITTING MY ISSUE WITH ABSOLUTELY NO RESOLUTION, SINCE HONDA DID AND IS NOT REALLY TAKING RESPONSIBILITY IN THEIR MALFUNCTION.  I JUST WANT OTHER HONDA OWNERS TO KNOW THAT THIS PROBLEM WITH THE TRANSMISSION STILL EXISTS AND PROBABLY WILL FOR YEARS TO COME.  I GUESS AFTER THIS REPAIR IS DONE, I MAY SEEK TO INVESTIGATE TOYOTA OR EVEN AND AMERICAN MADE CAR.  THE AMOUNT OF MONEY IT IS COSTING ME TO REPIAR THIS USED CAR IS SENSELESS AND THE TRANSMISSION ISSUE SHOULD HAVE BEEN CORRECTED A LONG TIME AGO.  I PRAY THAT NO ONE GETS HURT OR WORSE FROM THIS PROBLEM.  THANKFULLY MY CHILDREN AND I WERE ABLE TO MAKE IT HOME OK.",
        "vin": "1HGCM665X4A"
    }
]