[
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/17/2013",
        "dateOfIncident": "09/02/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS AN ISSUE WITH STABILITY ABOVE 65 MPH. (YES THEY ARE INFLATED TO PROPER PRESSURE) I TOOK A 550 MILE TRIP RIGHT AFTER I BOUGHT IT AND THE CAR WAS EXTREMELY UNSTABLE AT 65MPH+ ON ALL SURFACES INCLUDING:  SMOOTH CONCRETE, GROOVED CONCRETE, OLD PAVEMENT, BRAND NEW PAVEMENT, PAVEMENT WITH NO TIRE WEAR OR TIRE GROOVES, IN WIND OR NO WIND.  THE PROBLEM IS WHEN YOU TRY TO KEEP THE CAR IN A STRAIGHT LINE.  IT WILL NOT TRACK STRAIGHT.  IT WILL GO LEFT OR RIGHT, BUT NOT STRAIGHT.  HAD ALIGNMENT CHECKED AND IT WAS CORRECT.  THE CAR ALSO TENDS TO DRIFT TO THE RIGHT A LITTLE NO MATTER IF YOUR ON THE DOWN OR UPSLOPE OF THE CREST ON THE ROAD.  IT IS BORDERLINE DANGEROUS BECAUSE IN TRAFFIC I FOUND THE CAR WANTING TO DART TOWARDS THE LEFT AND RIGHT LANE.  IF YOU DON'T CONSTANTLY FIGHT THE STEERING EVERY SECOND, YOU WILL HIT A CAR NEXT TO YOU.  I HIGHLY SUSPECT IT IS THE 17\" HANKOOK TIRES THAT COME ON THE CAR AS MANY HAVE REPORTED THE SAME PROBLEMS WITH THESE TIRES AND HAVE HAD ISSUES FROM BEING DANGEROUS IN SNOW AND WATER TO THE WANDERING LEFT AND RIGHT WHEN TRYING TO DRIVE STRAIGHT.  SOME HAVE EVEN REPORTED THE SIDEWALLS RUPTURING.  THIS IS AN ISSUE THAT PUTS ME IN FEAR FOR THE SAFETY OF MY FAMILY AND I WILL BE REPLACING THE TIRES AS SOON AS I CAN AFFORD IT.  HOPEFULLY MORE PEOPLE WILL COMPLAIN HERE INSTEAD OF JUST ON FORUMS.  I URGE YOU TO RESEARCH THESE TIRES AND THE VW PASSAT FORUMS AND YOU WILL FIND TONS OF COMPLAINTS ABOUT THESE TIRES. ANOTHER NOTE:  I HAVE DRIVEN TRUCKS, FAMILY SEDANS, SPORTS CARS, SUV'S, AUDIS, VW, MERCEDES, BMW, FORD, CHEVY, DODGE, AND I HAVE NEVER FELT THE STEERING REFUSING TO STAY ON THE CENTER LINE UNTIL THIS CAR.  *TR",
        "vin": "1VWBN7A38DC"
    }
]