[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/02/2013",
        "dateOfIncident": "09/25/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538414,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ELANTRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS GARAGE KEPT IN SOUTHWEST VIRGINIA, NOT A NORTHERN SALTY CLIMATE. TAKEN IN FOR MUFFLER REPAIR AND WHEN PUT ON LIFT THE REAR CROSSMEMBER FELL OUT. IT HAD COMPLETELY RUSTED THROUGH FRAME ! LIKE I SAID THIS CAR IS BARELY DRIVEN AND WE USUALLY DON'T EVEN GET SNOW IN THE WINTER SO THERE IS NOT MUCH SALT IF AT ALL !  I HAVE HAD MY GRANDKIDS IN THE BACK OF THIS CAR !   IT'S NOT JUST WHERE THE REAR CROSSMEMBER IS THAT'S RUSTED EITHER ! TALKING ABOUT A RUST BUCKET, YOU CAN PEEL LAYERS AND CHUNKS OF RUSTED METAL OFF WITH YOUR HANDS ! THESE CARS SHOULD NOT EVEN BE ALLOWED ON THE ROADS !  SOMEBODY IS GOING TO DIE FROM THESE ! AFTER TALKING TO SOME OTHER ELANTRA OWNERS THEY WERE NOT AWARE OF THIS SITUATION EITHER BUT HAVE FOUND ISSUES TO BE THE SAME ! THE FRONT CRADLE WAS ALREADY REPLACED DUE TO RUST RECALL AND CRASHES ! I GUESS HYUNDAI WON'T DO ANYTHING CAUSE OUR GOVERNMENT WON'T MAKE THEM !  I MEAN SERIOUSLY THINK ABOUT IT LIKE THIS- WOULD YOU PUT YOUR KIDS OR GRANDKIDS IN THIS CAR ?  I SURE HOPE YOU DON'T HAVE TO ! I WILL NEVER OWN ANOTHER KOREAN VEHICLE AS MY KIA WAS THE SAME WAY !  DANGEROUSLY RUSTED AND NEWER THAN THE HYUNDAI !   PLEASE, PLEASE. PLEASE SAVE SOMEBODY'S KIDS FROM FAILING THROUGH A RUSTY FLOOR. MINE IS SO EATEN UP WITH RUST I'M OBLIGATED TO SEND IT TO THE CRUSHER. FOR GODS SAKE IF YOU OWN A KOREAN VEHICLE CHECK MORE THAN YOUR OIL. I JUST WISH WE WOULD HAVE THOUGHT TO !    *JS",
        "vin": "KMHDN45D81U"
    }
]