[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/12/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543214,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY I HAD MAJOR REPAIRS TO MY 2002 JEEP LIBERTY.  THE CHECK ENGINE LIGHT WAS ON AND IT WAS DIAGNOSED WITH CODE PO442. THROUGH THE PROCESS OF ELIMINATION IT WAS FOUND THAT THE TOP SIDE OF THE FUEL TANK HAD DETERIORATED TO THE POINT WHERE HOLES HAD FORMED, CAUSING AN UNSAFE CONDITION DUE TO FUEL AND FUEL FUME RELEASE.  THE TANK WAS REPLACED WITH A REFURBISHED ONE SINCE JEEP NO LONGER MANUFACTURERS THE FUEL TANK. THE REPAIRS WERE MADE AT A CERTIFIED JEEP DEALERSHIP.  THE VEHICLE WAS IN THE SHOP FROM AUGUST 1 THRU AUGUST 7. I CONTACTED JEEP TO INFORM THEM OF THE UNSAFE CONDITION WITH THE VEHICLE AND WAS GIVEN A CASE NUMBER. I REQUESTED ASSISTANCE WITH THE COST OF THE REPAIRS. I SENT JEEP ALL REQUESTED INFORMATION WITH THE UNDERSTANDING A CUSTOMER CARE AGENT WOULD CONTACT ME WITH THEIR FINDING.  3 WEEKS PASSED AND I DID NOT RECEIVE A CALL, I CONTACTED JEEP REQUESTING RESOLVE.  A SUPERVISOR RETURNED MY CALL AND INFORMED ME THAT THE AGE OF THE VEHICLE WAS THE REASON NO ASSISTANCE WOULD BE OFFERED. MY COMPLAINT WITH JEEP IS THEY DISMISSED THE REQUEST BECAUSE OF THE AGE OF THE VEHICLE.  I PURCHASED THE VEHICLE IN 2008 WITH 29000 MILES. CURRENTLY THE VEHICLE HAS 69000 MILES.  I FIND IT UNACCEPTABLE THAT JEEP PLACES A TIME LIMITATION ON THE SAFETY OF THEIR VEHICLES THAT ARE MAINTAINED TO THE STANDARD SET FORTH IN THE OWNERS MANUAL.  JEEP DOES NOT BACK THEIR VEHICLES.  I WILL NEVER BUY ANOTHER JEEP! *TR",
        "vin": "1J4GL58K42W"
    }
]