[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2013",
        "dateOfIncident": "04/30/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA MATRIX",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A VERY DANGEROUS ISSUE. CAR ENGINE RANDOMLY SHUTS OFF WHILE DRIVING. CHECK ENGINE LIGHT WILL NOT GO OFF. I CANNOT DRIVE CAR BECAUSE I CANT PASS SMOG EITHER (DUE TO CHECK ENGINE LIGHT). I HAVE FILED TWO FORMAL COMPLAINTS WITH TOYOTA. TOYOTA REFUSES TO TAKE RESPONSIBILITY FOR THE MANUFACTURING. DEFECT. I AM EXPECTED TO PAY OVER $2000 TO REPLACE A CATALYTIC CONVERTER THAT THEY KNOW IS DEFECTIVE.    (EXCERPT FROM ONE COMPLAINT I FILED)  THERE WAS A RECALL ON MATRIX AND COROLLA: TOYOTA ISSUED A RECALL FOR 2005 TO 2008 MODEL YEAR COROLLA'S AND MATRIXES, EQUIPPED WITH THE 1ZZ-FE ENGINE AND TWO-WHEEL DRIVE. THE RECALL NOTICES STATES THAT AN IMPROPERLY MANUFACTURED ENGINE CONTROL MODULE (ECM) CAN DEVELOP A CRACK IN ITS CIRCUITRY, POTENTIALLY CAUSING THE \"CHECK ENGINE\" LIGHT TO ILLUMINATE, HARSH SHIFTING, AND STALLING AND/OR FAILURE OF THE ENGINE TO START.    I HAVE A 2003 MATRIX XRS WITH A 2ZZ-GE ENGINE WITH A CONTINUOUS CHECK ENGINE LIGHT, HARSH SHIFTING, STALLING AND RANDOM FAILURE OF THE ENGINE TO START.  I HAVE HAD MULTIPLE DIAGNOSTICS AND REPAIRS DONE ON THE VEHICLE TO PASS SMOG INSPECTION OVER THE PAST 5 OR 6 YEAR AND HAVE SPENT THOUSANDS OF DOLLARS. THE LIGHT STAYS OFF JUST LONG ENOUGH TO PASS THE SMOG TEST AND IS THEN RETURNED TO ME WITH THE LIGHT STILL ON. I HAVE PAID A TOYOTA DEALER $95 TO RUN DIAGNOSTIC ALSO. THEY SAID THE ECM IS CORRUPT AND CAN'T BE FLASHED AND THE CAT HAS TO BE REPLACED FOR OVER 2K!    I WOULD LIKE INFORMATION FROM YOU'RE QUALITY DEPARTMENT AS TO WHY TOYOTA WILL NOT REPLACE THE ECM BEING REPLACED ON THE ENGINES STATED IN YOUR RECALL NOTICE AND NOT ON MY TYPE OF ENGINE. WHICH HAS THE EXACT SAME PROBLEM AS DETAILED IN THE RECALL LISTED ON YOUR SITE. TOYOTA STATED AFTER BOTH COMPLAINTS THAT THEY CANNOT HELP ME OR FIX THE PROBLEM. I MUST PAY FOR SOLUTION MYSELF. DOES SOMEONE NEED TO DIE IN A CRASH BEFORE THIS IS ADDRESSED? *JB",
        "vin": "2T1KY32E13C"
    }
]