[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "07/30/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537814,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGINNING THE EVENING OF JULY 30, I EXPERIENCED ISSUES WITH STARTING MY GRAND CHEROKEE.  THESE ISSUES WERE SPORADIC, HOWEVER ONCE EVERY THREE OR FOUR TIMES I ATTEMPTED TO START THE ENGINE, THE ENGINE WOULD CRANK BUT FAIL TO START.  ON JULY 31, I SCHEDULED AN APPOINTMENT WITH MY LOCAL JEEP DEALERSHIP (VIDEON CHRYSLER DODGE JEEP IN NEWTOWN SQUARE, PA) FOR AUGUST 5.  BY AUGUST 2, THE JEEP WAS NOT DRIVABLE AS STARTING IT WOULD TAKE 20-30 MINUTES EACH TIME.  I WAS FORCED TO RENT A CAR AT MY OWN EXPENSE FOR THE WEEKEND OF AUGUST 3-4.    ON AUGUST 5 THE DEALERSHIP DIAGNOSED THE ISSUE AS PERTAINING TO TSB 08-053-11 AND REPROGRAMMED THE TOTALLY INTEGRATED POWER MODULE.  ON AUGUST 7, I EXPERIENCED THE NO START ISSUE AGAIN AND SCHEDULED A SECOND APPOINTMENT WITH THE DEALERSHIP FOR AUGUST 8.  ON AUGUST 8, THE TIPM WAS IDENTIFIED AS NEEDING TO BE REPLACED.  I WAS INFORMED BY THE DEALERSHIP THAT THE NECESSARY PART WAS ON BACKORDER WITH AN ESTIMATED ARRIVAL TIME OF WITHIN ?A FEW WEEKS?.  THE DEALERSHIP ADVISED THAT IT WAS OK FOR ME TO CONTINUE DRIVING THE VEHICLE IN THE MEANTIME DESPITE THE ISSUE.    ON THE EVENING OF AUGUST 16, WHILE DRIVING THE VEHICLE AT A SPEED OF APPROXIMATELY 40 MILES PER HOUR, THE ENGINE STALLED, CAUSING THE VEHICLE TO LOSE ALL POWER NEAR THE INTERSECTION [XXX]  GIVEN THE NATURE OF THE ROAD AS WELL AS THE TRAFFIC AROUND ME, THIS SITUATION POSED A SERIOUS SAFETY HAZARD TO MYSELF, MY PASSENGER, AND OTHERS NEAR MY VEHICLE, AND SINCE THAT POINT I NO LONGER FEEL SAFE OPERATING THE VEHICLE IN ITS CURRENT CONDITION.  AS SUCH, I HAVE BEEN ENTIRELY UNABLE TO OPERATE THIS VEHICLE SINCE AUGUST 16.  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)  *TT",
        "vin": "1J4RR6GT7BC"
    }
]