[
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/22/2013",
        "dateOfIncident": "02/23/2013",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536614,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TL",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM SUBMITTING MY COMPLAINT HERE BECAUSE, ALL NORTH AMERICAN ACURAS ARE BUILT SAME AND HAS SAME SAFETY/PROBLEMS. PLEASE EXCUSE MY INFO ON ADDRESS SINCE THERE WAS NO ENTRY FOR ONTARIO, CANADA. ===========ENCOUNTER WITH THE PROBLEM  CLICK OR POP SOUND COMES OUT OF STEERING WHEEL COLUMN WHEN STEERING IS ON CENTER AND WHEN I START TO STEER A LITTLE BIT TO LEFT OR RIGHT.  PLEASE SEE THE VIDEO - HTTP://YOUTU.BE/EVPAHLXXV5Y  OR FOR DETAILED FOLLOW UPS PLEASE SEE - HTTP://TL.ACURAZINE.COM/FORUMS/SHOWTHREAD.PHP?T=881249================2ND - I COMPLAINED TO ACURA CANADA  THEY SAID ELEVATING THE PROBLEM TO HIGHER LEVEL WILL START BY REPORTING TO DEALERSHIP. =================3RD - DEALER VISIT ABOVE PROBLEM WAS PRESENTED  TECHNICIAN WHO WENT ON THE TEST DRIVE WITH ME TO REPLICATE THE PROBLEM STATED ALTHOUGH, HE SEES WHAT THE PROBLEM IS, IT IS NORMAL AND THE PROBLEM IS EFFECTING ALL ACURAS SO, HE REFUSE TO DO ANY WORK ON IT BECAUSE IT IS NORMAL ============================4TH FAILED ATTEMPT, I HAVE CALLED ACURA CANADA AGAIN  THE PERSON (CLIENT SERVICES) SAID  - HE SUGGESTED VISITING OTHER DEALERSHIP IN VICINITY TO GET SECOND OPINION AND SEE IF THEY WILL AUTHORIZE THE REPLACEMENT (I DO NOT WISH TO TRAVEL AROUND WHOLE CITY TO BEG FOR WARRANTY)  - THERE IS NOTHING HE CAN DO TO AUTHORIZE THE REPLACEMENT SINCE DEALERSHIP (HANDS AND LEGS OF ACURA CANADA) THINKS IT IS NORMAL AND REPLACING THEM WOULD NOT RELIEVE THE ISSUE  - HE WOULD PASS THE INFO ALONG SO, IT WILL BE KNOWN TO FUTURE DEV. OF ACURAS    BOTTOM LINE - WHO AM I RELYING ON HERE FOR WARRANTY? WHERE SHOULD I BE CONTACTING NOW? OR SHOULD I JUST SHUT UP AND LIVE WITH IT LIKE THE DEALERSHIP AND ACURA CANADA SAID?  *TR",
        "vin": "19UUA9F76CA"
    }
]