[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2013",
        "dateOfIncident": "08/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544914,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING DOWN THE HIGHWAY AS A FAMILY WITH 4 TOTAL PEOPLE IN THE CAR. THE ENGINE AND MOTOR LOST TOTAL POWER. YOU COULD PUT YOUR FOOT TO THE FLOOR ON THE GAS PEDAL AND THE ENGINE WOULD HAVE NO POWER AND NOT REV UP WITH NO RPM. WE ALMOST GOT REAR ENDED AND BLASTED FROM BEHIND BY A SEMI-TRUCK. THE SEMI-TRUCK HAD TO TAKE EVASIVE ACTION AND IF THE OUTSIDE LANE HAD BE BLOCKED AND HE WAS NOT ABLE TO CHANGE LANES THEN HE WOULD OF HIT US AS HE SHOWED HIS DISPLEASURE BY BLASTING HIS HORN AT ME AND MY FAMILY AS HE SKATED BY. WE HAD TO COAST OVER TO THE SHOULDER OF THE HIGHWAY. ONCE ON THE SHOULDER WITH CARS ZIPPING BY AND CHILDREN SCARED IN THE CAR WE WAS ABLE TO TURN THE VEHICLE OFF. THEN RESET IT AND RE-START THE CAR AND EVERYTHING WOULD BE FINE AGAIN FOR A WHILE. THE CHECK ENGINE LIGHT COMES ON BUT AFTER YOU RESET AND RESTART THE CAR THE LIGHT GOES OFF TILL THE NEXT TIME. THIS STARTED AS A RANDOM THING BUT HAS DEVELOPED INTO A DAILY DEAL AND BECOME VERY DANGEROUS IN THE MIDDLE OF TRAFFIC. THIS HAPPENS DAILY NOW WHILE DRIVING AT A SPEED OF 25 MPH PLUS AND HAS NO WARNING SIGN. BEING TOLD IT IS A FAULTY CIRCUIT BOARD IN THE THROTTLE BODY BY THE DEALERSHIP AND A $500 PLUS DEAL TO FIX. THIS OCCURRENCE IS RISKING THE HEALTH, LIVELIHOOD AND SAFETY OF MY FAMILY AND KIDS. WEAR AND TEAR MAINTENANCE ON A VEHICLE I AM OK WITH FIXING BUT A FACTORY FAULTY CIRCUIT BOARD IS NOT ONE OF THOSE PARTS AND IS ON THE LIABILITY OF FORD MOTOR COMPANY AS A MANUFACTURE DEFECT.",
        "vin": "1FMCU0DG9AK"
    }
]