[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "08/13/2013",
        "dateOfIncident": "05/05/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535214,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "2008 JEEP LIBERTY: I HAVE HAD THE WINDOW REGULATOR LIFT PLATES ON ALL WINDOWS FAIL.....AGAIN, ALL 4 WINDOWS HAVE FAILED A TOTAL OF 7 TIMES COMBINED SINCE I PURCHASED THE CAR IN 2006. ONE WAS WITHIN WARRANTY PERIOD. THE 6 OTHER FAILURES HAVE OCCURRED WHILE OUT OF WARRANTY. OF THESE 6 OUT OF WARRANTY INSTANCES, JEEP HAS COVERED 4 OF THESE UNDER AN EXTENDED WARRANTY THEY ISSUED REGARDING THIS PROBLEM BECAUSE THEY KNOW THE PLASTIC LIFT PLATE PART IS DEFECTIVE AND \"NOT ADEQUATELY DESIGNED FOR THE WEIGHT OF THE GLASS AND POWER OF THE WINDOW MOTOR\". THE SERVICE MANAGER AT MY DEALERSHIP TOLD ME THIS WORD FOR WORD! THIS WARRANTY HAS NOW EXPIRED AND THE REGULATORS/LIFT PLATES CONTINUE TO FAIL. 1ST ONE FAILED IN MAY OF 2008 REAR DRIVER, 2ND MARCH 2010 PASSENGER, 3RD AUGUST 2010 PASSENGER REAR, 4TH JANUARY 2012 PASSENGER REAR, 5TH SEPTEMBER 2012 DRIVER REAR, 6TH APRIL 2013 DRIVER REAR, AND NOW ANOTHER (7TH) JUST FAILED AUGUST 11TH 2013 DRIVER SIDE WINDOW. THIS IS A SAFETY ISSUE AS IT STARTLES DRIVERS WHEN A WINDOW SUDDENLY FALLS AND SLAMS INTO THE DOOR. I HAVE SWERVED ON MORE THAN ONE OCCASION, LUCKILY NOT HITTING ANOTHER VEHICLE. THIS IS ALSO ANOTHER SAFETY ISSUE AS THE VEHICLE CAN NOT BE PROPERLY SECURED/LOCKED. AN INTRUDER CAN EASILY GAIN ACCESS TO THE VEHICLE, HIDE IN THE BACK AND THEN ATTACK THE DRIVER OR OCCUPANTS. THEY CAN ALSO STEAL THE VEHICLE OR ITS COMPONENTS OR PERSONAL BELONGINGS. ON THE INTERNET THERE ARE TENS OF THOUSANDS OF COMPLAINTS ACROSS VARIOUS MESSAGE BOARDS, AND CONSUMER COMPLAINT WEBSITES REGARDING THIS VERY ISSUE. JEEP HAS ADMITTED TO USING FAULTY/DEFECTIVE PARTS, BUT REFUSES TO REPLACE THEM AT WILL. THEY WILL ONLY REPLACE AND COVER THE COST OF THIS REPLACEMENT IF, AND ONLY IF, IT IS EITHER IN WARRANTY OR THE EXTENDED WINDOW WARRANTY WHICH IS 7 YEARS FROM VEHICLE IN SERVICE DATE. FOR THE 2006 JEEP LIBERTY, THIS WARRANTY IS EXPIRING EVERY DAY DURING 2013.  *TR",
        "vin": "1J4GL48K86W"
    }
]