[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2010 CHEVY EQUINOX (PURCHASED 05/2010) HAS CONTINUOUSLY HAD ISSUES WHEN IDLING OR AT LOW SPEEDS IN THE CITY OR IN HEAVY HIGHWAY TRAFFIC, SINCE ABOUT A YEAR AFTER I PURCHASED IT.  SOMETIMES THIS WILL CAUSE THE CAR TO STALL.  THIS HAS BEEN PARTICULARLY SCARY AND PROBLEMATIC ON THE HIGHWAY IN RUSH HOUR TRAFFIC AND ON THE BAY BRIDGE DURING RUSH HOUR TRAFFIC.  WHAT IS PARTICULARLY FRUSTRATING IS WHAT I AM TOLD BY THE DEALERSHIP SERVICE TEAM - \"IT'S BECAUSE YOU'RE LOW ON OIL.\" WHEN I EXPLAIN THAT I JUST HAD AN OIL CHANGE 1,500 MILES AGO AND TOPPED OFF THE OIL A WEEK BEFORE, THEY SAID, \"WELL THIS CAR BURNS A LOT OF OIL, AND YOU WERE DOWN A QUART.  YOU SHOULD JUST CHECK IT EVERY WEEK AND KEEP TOPPING IT OFF.\"  NO CONCERN FOR THE FACT THAT I AM DOING THIS, AND IT IS STALLING.  NO CONCERN FOR THE FACT THAT THIS CAR IS 3 YEARS OLD AND BURNING THAT MUCH OIL.  WHEN I ASK WHAT TYPE OF ENGINE PROBLEM WOULD RESULT IN THIS TYPE OF OIL CONSUMPTION, THEY QUICKLY CHANGE THE SUBJECT AND SAY THEY HAVE FOUND \"NOTHING WRONG\" OR THAT THEY ARE JUST \"GOING BY WHAT GM SAYS TO DO, SINCE WE ARE ONLY THE SERVICE TEAM, NOT THE MANUFACTURER.\"  AT THIS POINT, I BRING MY CAR IN ANYWHERE FROM ONCE EVERY OTHER MONTH TO MULTIPLE TIMES PER MONTH.  SOMETIMES THE OIL IS LOW; SOMETIMES THE CHECK ENGINE LIGHT IS ON.  JUST LAST WEEK (10/15), AFTER I STARTED A CLAIM WITH GM AND TOLD THE SERVICE TEAM THAT I WAS FILING A COMPLAINT, THEY FINALLY AGREED TO RUN AN OIL CONSUMPTION TEST.  WE DID NOT GET THAT FAR, THOUGH, AS MY CAR HAS BEEN ROUGH IDLING ALL WEEK AND MY CHECK ENGINE LIGHT IS BACK ON - IT'S BACK WITH THE SERVICE FOLKS... JUST 5 DAYS AFTER BEING THERE LAST.  *TR",
        "vin": "2CNALDEW7A6"
    }
]