[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/08/2013",
        "dateOfIncident": "10/07/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SEAT SHAKES OVER ANY ROUGH SURFACE. IN WATCHING THE HEADREST FOR THE REAR SEAT IN THE REAR VIEW MIRROR WHILE DRIVING THERE IS ABOUT A 2-INCH SIDEWAYS TRAVEL. HAVE TRIED THE SEAT IN VARIOUS POSITIONS AND THE PROBLEM REMAINS. BY ROUGH I DON'T MEAN POTHOLES...THINGS LIKE CHANGING LANES OVER REFLECTOR BUTTONS, FREEWAYS WITH RAIN GROOVES, THINGS LIKE THAT. MY 12 YEAR OLD JEEP GRAND CHEROKEE'S REAR SEAT DOESN'T SHAKE AT ALL IN THESE CONDITIONS, BUT THIS RAV4 REAR SEAT MOST CERTAINLY DOES. THE SHAKING IS SO BAD SOMETIMES THAT IT RATTLES. I AM VERY CONCERNED ABOUT AN INFANT CAR SEAT STRAPPED INTO THIS BACK SEAT AS THE INFANT MY BE EXPOSED TO EXCESSIVE SHAKING OR VIBRATION.    I TOOK IT TO THE DEALERSHIP (TOYOTA CARLSBAD, CARLSBAD CA) ON OCTOBER 7TH 2013 AND THEY VERIFIED THE ISSUE. RATHER THAN TAKE STEPS TO CORRECT IT THEY TESTED ANOTHER RAV4 IN THE SAME WAY AND FOUND THAT IT TOO HAD THE SAME CONDITION AS MINE. BASED ON THIS THEY TELL ME THAT IT IS A 'NORMAL CONDITION'. I BELIEVE IT IS A DESIGN FLAW. NEVER HAVE I SEEN A CAR WITH A SEAT SHAKE SUCH AS THIS.     IN TESTING FURTHER I FIND THAT IF SOMEONE SITS IN THE FRONT PASSENGER SEAT THE REAR SEAT SHAKING SEEMS TO REDUCE. IF SOMEONE SITS IN THE REAR SEAT AND THEY WEIGH 150 POUNDS OR SO THERE IS A MINOR VIBRATION FELT AND THE SHAKING IS ALMOST NON-EXISTENT. HOWEVER, IF ONLY THE DRIVER IS IN THE CAR THE SHAKING RESUMES OR ANY LESS-THAN-PERFECT ROAD CONDITION.    I FEEL AS THOUGH TOYOTA NEEDS TO ADDRESS THIS ISSUE PRIMARILY FOR THE RISK OF INJURY TO INFANTS STRAPPED IN THE SEAT AS WELL AS COCKPIT NOISE (RATTLE). IT IS A FLAW IN THE DESIGN OF THE VEHICLE TO BE SURE. *TR",
        "vin": "2T3YK4DV9CW"
    }
]