[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/06/2013",
        "dateOfIncident": "05/29/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10551214,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "PATHFINDER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS PURCHASED NEW IN DECEMBER OF 2012.  IN LESS THAN 12 MONTHS, I HAVE LOST COMPLETE CONFIDENCE IN THE MANUFACTURING OF THE VEHICLE AND ITS ABILITY AS A RELIABLE, SAFE AND ACCEPTABLE OPTION TO MEET THE NEEDS OF ME AND MY FAMILY.  THE DETAILS OF EACH INCIDENT TO DATE ARE LISTED BELOW.  THE VEHICLE IS NOW UNDER REVIEW FOR REPURCHASE BY THE CORPORATION, AND WILL SIT IN THE DEALERSHIP'S PARKING LOT UNTIL A RESOLUTION IS REACHED THAT MAINTAINS MY SAFETY.    12/13 - 10 MILES - PURCHASED.  5/29/13 - 9,874 MILES - DROPPED OFF FOR SERVICE, EXPERIENCING 'SHUDDER' WHEN ACCELERATING AFTER COASTING, ISSUE OCCURRED AT VARIOUS OF DRIVING BETWEEN SPEEDS OF 25-40MPH AND 1000-1500RPM.  DEALER UNABLE TO REPLICATE ISSUE, CAR RETURNED.  7/16/13 - 12,645 MILES - DROPPED OFF FOR SAME ISSUE, ABLE TO DUPLICATE, REPLACED TORQUE CONVERTER PER BULLETIN NTB13-064A.  7/19/13 - 12,655 MILES - CAR RETURNED FOR CHECK ENGINE LIGHT AND PASSENGER SIDE FRONT WHEEL NOISE.  O2 SENSOR FAILED AND WAS REPLACED.  SUPPORT BEARING ON DRIVE AXLE FROZEN, PASSENGER SIDE FRONT DRIVE AXLE REPLACED.   9/9/13 - 15,825 MILES - DROPPED OFF FOR CONTINUED 'SHUDDER', SIMILAR DRIVING CONDITIONS.  ENTIRE TRANSMISSION REPLACED AS REQUIRED PER NTB 13-086.  10/29/13 - 16,930 MILES - RETURNED FOR AGAIN EXPERIENCING 'SHUDDER' WHEN ACCELERATING AFTER COASTING, ISSUE OCCURRED AT SLIGHTLY LOWER SPEEDS, SIMILAR RPMS.  DEALER UNABLE TO REPLICATE ISSUE, CASE OPENED FOR POTENTIAL REPURCHASE.  *TR",
        "vin": "5N1AR2MM8DC"
    }
]