[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2013",
        "dateOfIncident": "09/29/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10546414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 30 MPH, VEHICLE JERKED (AS THOUGH THE TRANSMISSION SLIPPED REAL HARD) AND THEN LOST POWER. I MANAGED TO COAST FOR ABOUT 25 YARDS TO GET OFF THE MAIN ROAD. A \"YELLOW WRENCH\" AND THE CHECK ENGINE LIGHT APPEARED ON THE CONSOLE. SHUT ENGINE OFF, WAITED A MINUTE AND RESTARTED. PROCEEDED ON ROAD FOR APPROXIMATELY 1 1/2 MILES REACHING SPEED OF APPROXIMATELY 55 MPH. VEHICLE JERKED AGAIN AND NO POWER. ONCE AGAIN, I MANAGED TO COAST ABOUT 50 FEET TO GET OFF OF THE MAIN ROAD. SAME LIGHTS APPEARED ON THE CONSOLE. SHUT OFF ENGINE. RESTARTED. DROVE 2 MILES BACK TO HOUSE, THE VEHICLE HAD MINIMAL POWER AND WAS SPUTTERING THE WHOLE WAY. THE NEXT MORNING, TRIED TO TAKE VEHICLE TO DEALERSHIP. STARTED VEHICLE, DROVE ACROSS THE STREET, AGAIN NO POWER. CALLED DEALERSHIP, THEY ARRANGED TO HAVE IT TOWED TO A NEIGHBORING DEALERSHIP BECAUSE THEY WOULD NOT BE ABLE TO GET TO EVEN LOOK AT IT FOR ABOUT TWO WEEKS. ERROR MESSAGE ON VEHICLE ACCORDING TO DEALERSHIP WAS P2112. UNABLE TO REPAIR AT THIS TIME DUE BACK ORDER OF PART. HAD THERE BEEN ANYONE BEHIND ME ON THE FIRST TWO OCCASIONS OR SOMEONE COMING IN THE OPPOSITE DIRECTION WHILE TRYING TO CROSS ROAD, SURELY I WOULD HAVE BEEN HIT. FORTUNATELY, I WAS NOT ON THE INTERSTATE WHEN THIS OCCURRED OR THE POTENTIAL FOR HARM WOULD HAVE BEEN HIGH! THIS IS POSES AN UNSAFE SITUATION!!! I PURCHASED THIS CERTIFIED VEHICLE ONLY FOUR MONTHS AGO, WITH 50,271 MILES ON IT. I AM NOT CERTAIN IF I WILL FEEL CONFIDENT DRIVING THIS VEHICLE AGAIN. THE DEALERSHIP WANTS TO REASSURE THAT THE REPLACEMENT PART WILL FIX THE SITUATION, BUT I HAVE MY DOUBTS FOR A LONG TERM RESOLUTION.  *TR",
        "vin": "1FMCU9EG1AK"
    }
]