[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/28/2013",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549914,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "CHRYSLER MANUFACTURE IS AWARE AND HAS ACKNOWLEDGED THE SAFETY ISSUE PERTAINING TO THE LIGHTING OR RATHER THERE THE LACK OF LIGHTING. WHAT IS IT GOING TO TAKE FOR SOMETHING TO BE DONE ?? FATALITIES . I  WAS ASSURED THAT THEY WOULD RESOLVE THE ISSUE HOWEVER I AM STILL DRIVING A CAR THAT I PAID GOOD MONEY FOR AND CAN'T DRIVE AT NIGHT.  I TOOK MY CAR BACK TO THE DEALERSHIP ON THREE OCCASIONS FOR THEM TO ADJUST THE HEADLIGHTS AS THERE IS NO LIGHTING TO THE LEFT OR RIGHT SIDES IN RURAL AREAS. AFTER THE 2ND ATTEMPT TO CORRECT THE PROBLEM UNSUCCESSFULLY ONE OF THE TECHNICIANS THAT WORKED AT THE DEALERSHIP MET ME THE NEXT EVENING AT NIGHT AND SAW FOR HIMSELF AND HE REPORTED TO HIS BOSSES THAT THERE WAS A VERY SERIOUS PROBLEM. THE DEALERSHIP ADVISED AND GAVE CONTACT INFO TO DIRECTLY CONTACT CHRYSLER THIS WAS ON 6/27/13  THE FOLLOWING DAY RECEIVED EMAIL AND A PH. CALL STATING THAT THE DESIGN TEAM AT CHRYSLER EXAMINED THE IDENTICAL MODEL AND ACKNOWLEDGED THERE WAS A DEFINITE SAFETY ISSUE ASSIGNED A CASE# AND QUOTE \" THERE IS IN FACT A FACTORY DEFECTIVE FLAW/CHARACTERISTIC IN THE DESIGN OF THE CAR PERTAINING TO ITS HEADLIGHTS\" UNQUOTE . I HAVE ALMOST RAN OVER A MOTHER AND CHILD OUT WALKING, I HAVE BEEN IN 2 DITCHES AND A INCH FROM GOING INTO THE RIVER NOT TO MENTION THE ANIMALS. THERE IS NO EXCUSE FOR DRAGGING THEIR  FEET IT WAS EXPLAINED TO ME THAT WITH IT BEING A LUXURY CAR THEY DIDN'T HAVE ENOUGH COMPLAINTS AS LUXURY CARS WERE SELDOM ON RURAL ROADS ESPECIALLY AT NIGHT . I AM A DISABLED VETERAN BEEN THRU A LOT AND IT WOULD BE A SHAME TO MEET MY MAKER DUE TO THE SELF ABSORBED EXEC'S AT CHRYSLER . I FILL CERTAIN THAT THEY WOULDN'T FOR A SECOND PAY FOR A VEHICLE THAT COULDN'T BE SAFELY DRIVEN AT NIGHT. I HAVE ALL OF THE DATES AND P.O.C.'S  THE CASE # ASSIGNED BY CHRYSLER PLEASE RESOLVE THE ISSUE BEFORE IT TAKES AN INNOCENT LIFE IF IT HASN'T ALREADY..   *TR",
        "vin": ""
    }
]