[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2013",
        "dateOfIncident": "03/27/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300C",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2006 CHRYSLER 300C NEW FROM THE DEALERSHIP IN MAY OF 2006. AT APPROXIMATE 25,000 MILES IT BEGAN TO SHUT OFF AFTER FILLING UP THE GAS TANK COMPLETELY AT THE GAS STATION.  I'VE ALWAYS PUT THE CORRECT FUEL IN MY CAR AS RECOMMENDED BY THE MANUAL AND THE DEALERSHIPS I'VE TAKEN HER TO FOR ROUTINE MAINTENANCE. AT INTERMITTENT INTERVALS THROUGHOUT THE OWNERSHIP OF MY CAR, IT HAS SHUT OFF, STRANDED ME ON DARK ROADS AND HAVE ALMOST CAUSED ACCIDENTS ON HIGHWAYS, BUSY STREETS WITH MY CHILDREN IN THE CAR. THIS CAR HAS BEEN DEALERSHIP MAINTAINED & I'VE ADAMANTLY FOLLOWED THE MAINTENANCE SCHEDULES. HAVE TAKEN IT TO THE DEALERSHIP AND HAD SPARK PLUGS, FUEL PUMP, WATER PUMP, THERMOMETER CHANGED ALL NEEDLESSLY. I'VE SPENT CLOSE TO $4000 IN REPAIRS AND NEEDLESS PARTS.THE DEALERSHIP HAS RAN VARIOUS DIAGNOSTICS AND HAVEN'T FOUND ANYTHING WRONG. THE CAR NOW HAS CLOSE TO 76,000 MILES ON IT AND WILL SHUT OFF IF THE GAS TANK GOES TO THE QUARTER OF TANK MARK OR WHEN IT'S FULL. I NEVER TOP IT OFF BECAUSE I'VE BEEN WARNED NOT TO TOP OFF MY GAS INTAKE. I'VE SOUGHT SECOND OPINIONS ON WHY THIS MIGHT BE HAPPENING AND THE DEALERSHIPS IN NY, NJ AND FL HAVE INFORMED ME THAT THIS IS A COMMON COMPLAINT THEY RECEIVE FOR ALL OF THE CHRYSLER 300 SERIES. THIS IS A DANGEROUS MALFUNCTION THAT COULD POSSIBLY COST LIVES PLUS COST AN EXPENSIVE LOSS FOR THIS CAR. I'VE SPOKEN TO OTHER OWNERS PLUS RESEARCHED OTHER FORUMS, AND THERE ARE HUNDREDS OF THE SAME COMPLAINTS ABOUT WHEN THE CAR IS FUELED ESPECIALLY AFTER THE CAR REACHES 50,000 MILES ON IT. THE LAST INCIDENT WAS OCT. 30, 2013 IN WHICH I WAS ALMOST IN AN ACCIDENT DUE TO THE FACT THAT MY CAR SHUT OFF AT A STOP LIGHT AFTER THE LIGHT TURNED GREEN. THE CARS BEHIND ME STARTED TO MOVE AND THE CAR DIRECTLY BEHIND ME HAD TO SWERVE TO KEEP FROM HITTING ME. THIS IS A DANGEROUS PROBLEM.  *TR",
        "vin": ""
    }
]