[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2014",
        "dateOfIncident": "02/25/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565914,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDASPEED6",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2006 MAZDA SPEED6 WITH 96,600 MILES, PURCHASED DECEMBER 2005. MY SPEED6 HAS ALWAYS HAD A TURBOCHARGER SMOKING PROBLEM.  AT ONE POINT, IT LOOKED LIKE A MOSQUITO SPRAYING TRUCK GOING DOWN THE ROAD.  BUT THAT ISSUE SEEMED TO ABATE, AND APPEARED TO BE UNDER CONTROL ON ITS OWN.  NOW THE CAR IS BURNING A QUART OF OIL EVERY 300 MILES.   THAT IS NOT ACCEPTABLE, AND AFTER A YEARLONG ATTEMPT TO WATCH THE PROBLEM, TO SEE IF IT COULD BE CONTROLLED, I FINALLY CAME TO THE CONCLUSION, THAT IT COULD NOT, AND THAT THE TURBOCHARGED HAD TO BE REPLACED.  I THUS MADE AN APPOINTMENT WITH THE MAZDA DEALER CLOSEST TO MY CURRENT RESIDENCE, PADUCAH MAZDA, IN PADUCAH, KY.  I TOOK THE CAR IN YESTERDAY, AND IT WAS CONFIRMED THAT OIL WAS LEAKING FROM MY TURBOCHARGER SEALS.    THIS PROBLEM HAS BEEN WELL KNOWN AND PREVALENT, SUBJECT TO A NHTSA INQUIRY #10043874.  AND AS A RESULT MAZDA ISSUED A LETTER EXTENDING THE WARRANTY FOR THIS PROBLEM TO 84 MONTHS OR 70,000 MILES.  I DO NOT RECALL RECEIVING THIS LETTER, OR IF I DID, AT THAT TIME DID NOT BELIEVE I HAD A PROBLEM WORTHY OF A NEW TURBOCHARGER.    SO YESTERDAY, THE MAZDA CONFIRMED THE PROBLEM, AND GAVE ME AN ESTIMATE OF $2500 TO REPLACE THE TURBOCHARGER.  SINCE THIS ISSUE HAS BEEN WELL KNOWN, DOCUMENTED, AND SUBJECT OF A MAZDA WARRANTY CONSIDERATION, I CALLED MAZDA CONSUMER SERVICE TO SEE IF MAZDA COULD OFFER ANY ASSISTANCE ON THIS SERVICE ISSUE.  I OFFERED TO WORK WITH THEM, TO PAY SOME PORTION OF THE REPAIR, MEET THEM IN THE MIDDLE IF POSSIBLE.  MY REQUEST WAS DENIED IN TOTAL; ?NO ASSISTANCE?.    NATURALLY, I AM DISAPPOINTED WITH THIS RESULT, GIVEN THAT I HAVE BEEN A LOYAL MAZDA OWNER.  I AM VERY SURPRISED WITH THIS ABRUPT AND NEGATIVE TREATMENT FROM MAZDA, GIVEN THE HISTORY OF THIS PROBLEM.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JM1GG12L261"
    }
]