[
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/04/2014",
        "dateOfIncident": "11/07/2012",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562814,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I FIRST PURCHASED MY 2013 HONDA ACCORD, THE HONDA HAS INTERMITTENT HESITATIONS AFTER STOPPING AT TRAFFIC LIGHTS, STOP SIGNS, PARKING AND SO FORTH.  FOR INSTANCE, FOR THE SECOND TIME IN THE LAST FIVE DAYS, I STOPPED, WENT INTO A STORE, RETURNED, CRANKED HONDA ACCORD, BACKED OUT, AND THE CAR WOULD NOT \"GO.\"  IT  SIMPLY \"STALLED\" , FEBRUARY 03, 2014.  THIS WAS MENTIONED IN 2012 TO SERVICE MANAGER, [XXX], AT HONDA DEALERSHIP SERVICE CENTER; IN MOBILE, AL, HE HAD ONE OF HIS TECHNICIANS TO TEST DRIVE MY HONDA.  TECHNICIAN RETURNED AND CLAIMED, AFTER TESTING, AND TEST DRIVE, THAT HE COULD FIND NOTHING WRONG.  I DID NOT RECEIVE ANY PAPERWORK OTHER THAN A VERBAL ASSURANCE THAT I WAS PROBABLY JUST GETTING ADJUSTED TO THE \"NEW CAR.\"  AFTER THAT, EVERY TWO WEEKS OR SO, I WOULD HAVE A \"WHOLE WEEK OF INTERMITTENT\" HESITATIONS AND STALLINGS.  THIS IS VERY DANGEROUS WHEN TRYING TO GET THROUGH A TRAFFIC LIGHT - I HAVE TO REALLY PRESS DOWN ON THE ACCELERATOR FOR THE CAR TO FINELY DECIDE TO \"GO\".    THIS PROBLEM WAS VERBALLY REPORTED AGAIN TO [XXX], SERVICE MANAGER, AND TECHNICIANS, JANUARY 10, 2013 - MILES 5,384.   THE REPORT WAS, \"GIVE IT SOME TIME, THE CAR IS STILL NEW.\" - NOW, AT 24,200 MILES, THIS 2013 HONDA ACCORD STILL SCARES ME.  YESTERDAY (2/3/2014), AT A FOUR-WAY STOP, MY HONDA STALLED, THE ENGINE DID NOT \"TURN OFF\", BUT THE CAR WOULD NOT \"GO.\" FOR ABOUT 15 SECONDS WHICH IS DANGEROUS WHEN IN THE MIDDLE OF THE ROAD.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1HGCR2F74DA"
    }
]