[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "12/28/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566214,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M5",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A RED LIGHT. THE CAR HAD NUMEROUS SAFETY MALFUNCTIONS ON AT THE TIME OF THE INCIDENT. THE I-DRIVE SCREEN PROMPT ADVISED TO DRIVE IN A CAUTIOUS MANNER. WHILE STATIONARY AT THE RED LIGHT THE CARS REV COUNTER WAS BOUNCING UP AND DOWN FROM 500RPM-1500RPM. MY DESTINATION WAS ROUGHLY ONE MILE AWAY. THE LIGHT TURNED GREEN AND I GAVE THE CAR THROTTLE, BUT THERE WAS NO FORWARD MOVEMENT, THE CAR REMAINED STATIONARY (THE REVS ALSO REMAINED BELOW 900RPM). I GAVE THE CAR A BIT MORE THROTTLE ROUGHLY 30% (THE REVS REMAINED BELOW 900RPM AND THEN I TOOK MY FOOT OFF THE THROTTLE), AS I DID THIS THE CAR JUMPED FORWARD AND BUCKED VIOLENTLY WITH THE THROTTLE BEING ULTRA SENSITIVE. I PROCEEDED TO MANUALLY ENGAGE SECOND GEAR AND LUCKILY THE BUCKING MOTION STOPPED. I AM UNSURE IF THE ISSUE IS A SOFTWARE OR MECHANICAL ISSUE. THIS HAS ALSO OCCURRED A FEW TIMES AFTER THIS FIRST INCIDENT. THE DEALER FOUND  SEVERAL SPORADIC DSC FAULTS IN THE CAR, BUT COULDN'T TRACE IT TO A MECHANICAL CAUSE. I RESET THE SMG ADAPTATION, BUT THIS HAS DONE NOTHING TO CURE THE ISSUE. IN CERTAIN SITUATIONS SUCH AS HEAVY TRAFFIC THIS COULD CAUSE THE CAR TO REAR END ANOTHER VEHICLE. THE CAR BECAME UNPREDICTABLE TO DRIVE AND THE FAULTS COME AND GO RANDOMLY. THE CAR CAN BE PERFECT TO DRIVE ONE MINUTE, AND THE NEXT MINUTE ITS LIKE A WILD BUCKING BRONCO.  *TR",
        "vin": "WBSNB93587C"
    }
]