[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "02/15/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "ION",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING BETWEEN 70-75MPH ON I-35 SOUTHBOUND BETWEEN 2ND ST. MERGE AND 15TH STREET EXIT IN EDMOND OK, WE WENT TO CHANGE LANES (MIDDLE LANE TO RIGHT LANE) AND THERE WAS A SUDDEN BOOM, THE CAR LOST CONTROL, BEGAN TO SPIN OUT OF CONTROL (NUMEROUS SLIDES AND 2-360 DEG TURNS AND BEING FLUNG IN A BACKWARDS MOTION).     AS WE ATTEMPTED TO GET TO THE SIDE OF THE ROAD, OUR CAR BEGAN TO SPIN OUT OF CONTROL - WE SPUN INTO A 360 DEGREE TURN, CAR CAUGHT FIRE AS THE OIL WAS DUMPED FROM MY CAR AND SPRAYED ALL ALONG THE UNDERNEATH OF MY CAR AND TIRES, WE SLID SIDEWAYS TOWARDS CONCRETE BARRIER SEPARATING N-S BOUND TRAFFIC, WENT INTO A SECOND 360 DEGREE TURN, SLID SIDEWAYS - AS WE STARTED HEADING ONCE AGAIN FORWARD TOWARDS ONCOMING TRAFFIC THE VEHICLE SUDDENLY STARTED GOING BACKWARDS (EVEN THOUGH CAR WAS IN DRIVE)... WE FINALLY STOPPED FACING ONCOMING TRAFFIC IN SIDEWAYS MOTION.    TOW/MECHANIC INSPECTED THE CAR AND FOUND 3-4INCH HOLE IN THE ENGINE BLOCK - DIAGNOSIS - THAT PUSH PIN BROKE WITHOUT WARNING AND BLEW THE HOLE.    NO WARNING WAS GIVEN OF ANY KIND OF ENGINE MALFUNCTION ISSUE - NO WARNING LIGHTS, NOTHING.    WE COULD OF / SHOULD OF BEEN KILLED (PER THE EYE WITNESSES WHO STOPPED TO HELP US), OUR ONLY SAVING GRACE WAS THE OIL WHICH SPRAYED THE ROAD AND OUR TIRES KEEPING US UPRIGHT AND NOT ROLLING.    THIS NEEDS TO BE INVESTIGATED, RECALLED AND FIXED BEFORE SOMEONE IS NOT AS LUCKY AS US.  *TR",
        "vin": "1G8AJ55F86Z"
    }
]