[
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560314,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/6/14  I WENT OUTSIDE AND STARTED UP VEHICLE AND LET IT WARM UP FOR A BIT AND THEN I DROVE ABOUT 2MILES AND CAR WAS ACTING FUNNY AS I DROVE IT. IT DIDN'T WANT TO GO SO I GAVE IT SOME GAS AND RPM'S REVVED UP BUT ODOMETER WAS MOVING UP AND DOWN ALL CRAZY. I LEFT VEHICLE CRANKED AS I WENT INTO STORE AND DROVE IT BACK HOME. DIDN'T WANT TO TURN IT OFF IN CASE IT DIDN'T START BACK UP.  ON 1/8/14 I WENT OUT AND CRANKED CAR TO WARM UP FOR A MINUTE AND THEN PUT CAR INTO DRIVE AND HEARD A LOUD POP. I THEN PUT CAR BACK INTO PARK. CAR ACTED AS IF IT DIDN'T WANT TO STAY STARTED SO I GAVE IT SOME GAS AND THEN A BUNCH OF SMOKE CAME OUT  FROM EXHAUST PIPES. TURNED CAR OFF AND LET ALL SMOKE CLEAR AND TRIED TO RESTART CAR BUT IT WOULDN'T TURN OVER. HAD CAR TOWED TO IMPORT SPECIALTY AND 2 DAYS LATER THEY INFORMED ME THIS IS A COMMON ISSUE WITH MAKE & MODEL THAT THE DIAPHRAGM BUST AND THE TCC VALVE BREAKS AND THROWS OIL EVERYWHERE. THANK GOODNESS I BOUGHT A EXTENDED WARRANTY THAT COVERS POWER TRAIN BUT NOT THIS ISSUE $1,725.00 ON THE LOW SIDE TO JUST CLEAN OIL OUT AND THEN WE WILL BE ABLE TO LOOK FURTHER INTO CAR TO SEE IF ENGINE IS SALVAGEABLE OR NOT. I AM IN A RENTAL CAR PAYING FOR THAT, REPAIRS TO START ARE JUST $1.725.00 PLUS.... CAR PAYMENT. WE DON'T KNOW IF WARRANTY WILL COVER THIS AFTER THEY FIND OUT WHAT HAPPENED PER MGR AT IMPORT SPECIALTY.  I HAVE CALLED BMW NASHVILLE FOR GOODWILL ASSISTANCE BECAUSE OF  YEAR OF CAR PER [XXX] THEY CAN'T HELP. THIS IS A KNOW ISSUE WITH THIS CAR AND BMW NEEDS TO REIMBURSE CONSUMERS WHO HAVE HAD TO SHELL OUT MONIES TO FIX THIS ISSUE AND OTHER REPAIRS BECAUSE OF THIS ISSUE.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5UXFA13515L"
    }
]