[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/30/2013",
        "dateOfIncident": "12/30/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557814,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "WE NOTICED A HIGHER PITCH NOISE FROM THE VEHICLE IN AUGUST 2013 DURING ALL RUNNING TIMES (COLD START, WARM RUNNING, ETC) IN MY PREGNANT WIFE'S CAR WITH ABOUT 90,000 MILES ON VEHICLES (INSPECTED FLUIDS, BELTS, AND ENGINE AREA WITHOUT NOTICE TO ANY ISSUES- ASSUMED IT WAS THE SUB-FREEZING TEMPERATURES ~5-16*F). REGULAR MAINTENANCE HAS BEE CONDUCTED ON THE VEHICLE SINCE PURCHASE (ORIGINAL OWNERS), HAD THE HEATER CORE REPAIRED AND VEHICLE INSPECTED AT NISSAN DEALER IN TEXAS IN 2011 WITHOUT KNOWLEDGE OF TRANSMISSION PROBLEMS (HEATER CORE IS LEAKING AGAIN 2YRS LATER). THERE WAS NO IMPACT TO DRIVING AT THE TIME. FIGURED IT WOULD ONLY NEED A TUNE-UP BACK FROM COLORADO TO GEORGIA BEFORE FINALLY GETTING IT CHECKED AND WAS DIAGNOSED WITH TRANSMISSION AND ENGINE COOLANT CROSS CONTAMINATION REQUIRING $4,500+ IN REPAIRS (NOW AT 103,000 MILES -DEC 2013). AUTOMATIC TRANSMISSION WAS COMPLETELY FLOODED/CONTAMINATED WITH ENGINE COOLANT RUINING THE INTERNAL COMPONENTS. MECHANICS STATED THAT IS A KNOWN PROBLEM WITH NISSAN XTERRA'S AND OTHER MODELS, THAT THEY DIDN'T KNOW HOW OUR TRANSMISSION DIDN'T ALREADY FAIL WITH THE AMOUNT OF EXPOSURE, AND IT WOULD BE A SHORT TIME BEFORE THE TRANSMISSION BECOMES COMPLETELY IN-OPERATIONAL. AFTER SOME RESEARCH, WE HAVE DISCOVERED THAT MANY PEOPLE HAVE HAD A SIMILAR ISSUE ACROSS NISSAN MODELS, AND WE DO NOT QUALIFY FOR THE CLASS ACTION LAW SUIT (WHICH YOU HAD TO CLAIM BY JUN 2013 AND HAVE DOCUMENT/DIAGNOSED TRANSMISSION CONTAMINATION >100,000 MILES). NISSAN SHOULD BE REQUIRED TO RECALL/FIX THEIR DESIGN FLAW AND SAFETY HAZARDS FOR PROTECTION OF THE CONSUMER!  *TR",
        "vin": "5N1AN08U76C"
    }
]