[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/15/2014",
        "dateOfIncident": "01/15/2014",
        "fire": false,
        "manufacturer": "FIAT MOTORS OF N.A., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560114,
        "products": [
            {
                "manufacturer": "FIAT MOTORS OF N.A., INC.",
                "productMake": "FIAT",
                "productModel": "500",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC THROTTLE CONTROL (ETC) LIGHT CAME ON AFTER SLOWING DOWN AND THEN HAVING TO ACCELERATE FAST TO AVOID AN ONCOMING CAR AT AN INTERSECTION CROSSING. AT THE SAME TIME THE CAR LOST SPEED AND ACCELERATION. WE CONSULTED THE MANUAL IMMEDIATELY AND DID WHAT IT SAID, THAT IS TO RESTART THE CAR. WE DID THIS AND THE LIGHT WENT OFF. TO DO THIS WE HAD TO PULL OFF THE INTERSTATE AND PARK AND THEN GET BACK ON. WHEN GETTING BACK ON I HAD TO SLOW DOWN AND AGAIN ACCELERATE QUICKLY AGAIN TO PROPERLY MERGE WITH ONCOMING TRAFFIC ON THE 4 LANE WE WERE TRAVELING. THE ECT LIGHT CAME ON AGAIN AND WE AGAIN STOPPED AND RESTARTED THE CAR AND THE ECT LIGHT WENT OUT. ABOUT 4 MILES LATER AT AN INTERSECTION I SLOWED THEN ACCELERATED AFTER MAKING A RIGHT HAND TURN (THE LIGHT WAS GREEN).THE ECT LIGHT CAME ON AGAIN AND THIS TIME I IMMEDIATELY LOST POWER AND ACCELERATION AND COULD NOT GET THE CAR ABOVE ABOUT 40 TO 45 MILES AN HOUR.WE HAPPENED TO BE TRAVELING TO THE CAR DEALERSHIP ON ANOTHER MATTER (PHONE PAIRING) AND WE WERE ONLY A HALF A MILE FROM THE DEALERSHIP SO WE TOOK IT IN TO HAVE THEM LOOK AT IT. THEY GAVE US THE SAME MAKE AND MODEL AS A LOANER.WE WENT A FEW MILES THE ECT LIGHT CAME ON IN THIS CAR (FIAT 500) SO WE WENT BACK TO THE DEALERSHIP TO SEE WHAT MIGHT BE CAUSING THIS IN TWO CARS. THE SERVICE TECHNICIAN FOUND THAT I HAD TOUCHED OR PRESSED THE BRAKE PEDDLE AND THE ACCELERATOR AT THE SAME TIME AND THIS CAUSES THE ECT SYSTEM TO ACTIVATE AN ECT LIGHT TO COME ON. HOWEVER, IT APPEARS THAT IF YOU EVEN TOUCH THE BRAKE FOR EVEN A SECOND WHILE THE ACCELERATOR IS ENGAGED OR ESPECIALLY IF IT IS TRYING TO INCREASE SPEED TO THE TIRES THE ECT WILL ENGAGE AND LIGHT WILL COME ON AND TO RESET YOU HAVE TO IMMEDIATELY STOP THE CAR TURN IT OFF SO THE SYSTEM WILL RESET.  THIS WHOLE EXPERIENCE TO ME WOULD INDICATE A SAFETY PROBLEM OR A DESIGN DEFECT. SIMILAR PROBLEMS SEEN ON INTERNET WITH THE ECT.  *TR",
        "vin": "3C3CFFAR7DT"
    }
]