[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2014",
        "dateOfIncident": "01/13/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560914,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "CVT TRANSMISSION MAKING ERRATIC RATIO CORRECTIONS WHEN CAR WAS BEING DRIVEN AT LOW SPEED WHICH MADE THE CAR LITERALLY JUMP AT SOME SPEEDS (0-30 MPH)   MAKING IT DIFFICULT TO DRIVE FOR IN EX. A TRAFFIC JAM (STOP AND GO) AND LOOSE POWER WHEN CLIMBING FOR IN EX. PARKING PLACES THAT HAD RAMPS (0-5 MPH) DUE TO ERRATIC UPSHIFT  RATIO CORRECTIONS THAT FORCES PRESSING THE ACCELERATOR PEDAL TO BE ABLE TO KEEP THE CAR CLIMBING THE RAMPS CAUSING ERRATIC JUMPS/SPEEDS/PULLS AND SOMETIMES THE ENGINE TO BACKFIRE WHEN CLIMBING.  CAR ALSO HAD NOTICEABLE  JUMPS WHEN BRAKING TO A FULL STOP CONDITION FROM ANY SPEED.  TESTED BY DEALERSHIP, DIAGNOSED AND REPLACED THE CVT TRANSMISSION WITH A REMANUFACTURED UNIT, GOT IT BACK AFTER 4 DAYS. RIGHT AFTER DRIVING IT OUT OF THE DEALER WHO SUPPOSEDLY TOOK CARE OF THE 5K MILES MAINTENANCE  AS WELL, MAINTENANCE REQUIRED SOON INDICATOR STARTED TO LIGHT EVERY TIME THE CAR IS STARTED.   THIS CONDITION COULD INCREASE THE CHANCE OF AN ACCIDENT WHEN DRIVEN UNDER THOSE CIRCUMSTANCES DUE TO ERRATIC/UNEXPECTED SPEED VARIATIONS. TRAC OFF  & CHECK ENGINE LIGHT CAME ON BARELY  FOR A DAY EVEN THOUGH THE MALFUNCTION WAS PRESENT AND WERE OFF WHEN THE CAR WAS LEFT FOR THE REPAIR IN THE DEALER, EVEN THOUGH THE CONDITION STARTED AT LEAST 10 DAYS BEFORE AS AN INTERMITTENT SITUATION, GETTING WORSE AT DAYS, NOT PRESENT DURING NORMAL TO HARD ACCELERATION BUT HAD TO BE TAKEN TO THE DEALERSHIP BEFORE THE APPOINTMENT DUE TO WORSENING OF THE DRIVABILITY, BUT THE GAUGES NEVER LIGHTED UP, BUT FOR A WHILE, THE DAY BEFORE IT WAS TAKEN TO THE DEALER, WHICH MAY INDICATE THAT DUE TO THE NATURE OF THE PROBLEM THE ON BOAD DIAGNOSTICS SYSTEMS MAY NOT ALERT A DRIVER OF THE MALFUNCTION, EVEN THOUGH IS PRESENT, WHICH MAY BE CAUSING THOSE CARS BEING DRIVEN BY UNEXPERIENCED OWNERS/DRIVERS WITH THAT FAULT BEING PRESENT INCREASING CHANCES OF HAVING A ACCIDENT, FORTUNATELY AT LOW SPEEDS.  *TR",
        "vin": "2T1BURHE9EC"
    }
]