[
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/10/2014",
        "dateOfIncident": "03/10/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568314,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "M5",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SEAT AIR BAG SEAT OCCUPANCY SENSOR MAT, THE PASSENGER RESTRAINT SYSTEM MALFUNCTION WARNING LAMP ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED ON ANY RECALLS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 62,000.   PASSENGER AIR BAG LIGHT ON, SHOWING AIR BAG OFF. \"IMPORTANT SAFETY RECALL\" NOTE: FOR CURRENT RECALL JANUARY 2014, BMW STATES: \"THE RECALL INVOLVES THE FRONT PASSENGER AIR BAG SEAT OCCUPANCY SENSOR MAT, OVER TIME, DUE TO THE FREQUENCY OF FRONT PASSENGER SEAT USAGE, THE SENSOR CAN BECOME DAMAGED. IF THIS WERE TO OCCUR, DEACTIVATION OF THE FRONT PASSENGER AIR BAG COULD RESULT, INCREASING THE RISK OF INJURY IN THE EVENT OF A CRASH. IF THE FRONT PASSENGER AIR BAG BECAME DEACTIVATED, THE AIR BAG WARNING LAMP ON THE INSTRUMENT CLUSTER AND THE FRONT \"PASSENGER AIR BAG OFF\" LAMP IN THE OVERHEAD CONSOLE ARE ILLUMINATED AT THE SAME TIME.\" NOTE 2: THIS IS EXACTLY WHAT'S SHOWING. IT WAS OFF YESTERDAY AND NOW ITS ON. THE 2006 E60 M5 IS NOT INCLUDED, BUT THE OTHER 2006-2007 5 SERIES ARE, AND THERE ARE NUMEROUS CASES OF THE ERROR OCCURRING WITH THIS VEHICLE. WAS TOLD BY THE DEALER ITS A SEAT SENSOR AND THE WHOLE SEAT WOULD NEED TO BE REPLACED FOR $2000+. I THINK BMW SHOULD TAKE RESPONSIBILITY, IN ENSURING THE ISSUE IS RESOLVED FOR OWNERS OF THESE OTHER AFFECTED VEHICLES, BY THIS SEAT SENSOR ISSUE. CAR WAS MANUFACTURED PRIOR ON OR BEFORE NOV/2005.  *TR",
        "vin": "WBSNB93526B"
    }
]