[
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,SEATS",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "09/11/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10575914,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "SRT",
                "productModel": "VIPER",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK ON SEPTEMBER 11, 2013 AT APPROXIMATELY 5:45 A.M., IN MY BRAND NEW DODGE VIPER GTS THAT I PURCHASED FOR AROUND $150,000 IN LATE AUGUST 2013, FROM AUTO NATION DODGE/CHRYSLER/JEEP/RAM IN SPRING, TX, WITH LESS THAN 1000 MILES ON IT, I MADE A NEWSPAPER STOP AT A CONVENIENCE STORE IN DAYTON, TX, THEN I CONTINUED ON HIGHWAY 90 WEST HEADED TO WORK. AFTER COMING OUT OF THE STORE FOG HAD DEVELOPED ON MY WINDSHIELD AND MY REAR GLASS SO I TURNED ON THE FRONT DEFOGGER TO DEFOG THE WINDSHIELD. AFTER THE WINDSHIELD WAS CLEARED I TURNED OFF THE FRONT DEFOGGER. NEXT, I TURNED ON THE REAR GLASS DEFOGGER TO DEFOG THE REAR GLASS. DURING THE DEFOGGING OF THE REAR GLASS I NOTICED SMOKE/SPARKS THAT I MISTAKEN FOR FOG EVAPORATING. AFTER ABOUT TWO MINUTES OF DEFOGGING AND TWO MILES OF DRIVING DOWN HIGHWAY 90 WEST THE REAR GLASS EXPLODED LIKE A BOMB, SLINGING HOT GLASS TO THE BACK OF MY HEAD AND EVERYWHERE ELSE IT COULD GO. I QUICKLY TURNED OFF THE REAR GLASS DEFOGGER AND SLOWED DOWN TO GAIN CONTROL OF THE CAR THINKING SOMEONE HAD SHOT OUT THE GLASS OR THREW A BOWL OR ROCK ETC. THROUGH IT. THIS WAS VERY SCARY AND DANGEROUS BECAUSE I COULD HAVE EASILY PANICKED AND LOST CONTROL OF THE CAR. ALSO, THE SEATS AND THE ENTIRE INSIDE OF THE COCKPIT HEATED UP TREMENDOUSLY, CAUSING ME TO PULL OVER AND LET THE INSIDE COOL OFF BEFORE I DROVE THE CAR BACK HOME (6 MILES EAST ON HIGHWAY 90 TO LIBERTY, TX.... I WAS VERY LUCKY TO BE CLOSE TO MY HOME). \"I RECEIVED SMALL CUTS IN THE BACK OF MY HEAD FROM THE GLASS THAT I LATER CLEANED WITH PAPER TOWELS\". I CALLED DODGE AND THE DEALERSHIP TO ARRANGE FOR THE CAR TO BE EXAMINED. DODGE SENT A TRUCK TO TRANSPORT THE CAR BACK TO AUTO NATION. DODGE AND AUTO NATION CLAIMS THE CAR WAS REPAIRED BUT THERE ARE SOUNDS THAT THE BACK GLASS MAKES WITH OR WITHOUT THE REAR GLASS DEFOGGER ON. \"THIS ELECTRICAL PROBLEM WILL BECOME DEADLY IF NOT TAKEN SERIOUSLY\"....UPDATED 04-10-14 *BF",
        "vin": "1C3ADEBZ6DV"
    }
]