[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2014",
        "dateOfIncident": "07/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EQUINOX",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED THIS AUTO, WHICH I PURCHASED FROM A CHEV. DEALER IN ATMORE, AL DEC 2011; FIRST SIGN OF TROUBLE WAS NOTICE TO REPLACE ELECTRONIC BOARD, AND BATTERY WHICH WAS RUN DOWN & ALLEGED DUE TO FAIL., REPLACED UNDER BANK SERVICE WARRANTY, PLUS $110. FROM THAT POINT ONTHE CAR WOULD START UNATTENDED, AND PARKED, LOCKED WITH ALARM ON. ATTEMPTS TO CORRECT MEANT FIGHTING TO GET LOCK TO STAY OPEN WITH KEY, AND INSERTING SAME INTO IGNITION. CAR HAS ALSO STOPPED FOR NO REASON AT ALL,.COMPLAINT TO GN/CHEVY TWO WEEKS AGO, COMPLAINING OF BROKEN KEY AS BUTTONS HAD DROPPED OFF AND SECOND SET DID NOT WORK AT ALL. MILTON CHEVROLET AT MILTON, FL ALLEGED CORRECTED PROBLEM BY MAKING SECOND (NON-WORKING) KEY WORK. A WEEK LATER CAR PARKED, LOCKED AND ALARM SET, STARTED IN MID AFTERNOON, NO ONE NEAR AUTO OR KEYS AND ALARM RAN OFF. WE HAD TO GET KEY, ENTER AUTO AND TURN OFF IGNITION.  THE DEALER WANTS THE COST OF TWO NEW KEYS TO \"FIX\" THE PROBLEM. I THINK THAT THE PROBLEM IS A FAULTY IGNITION SYSTEM ENTIRELY. IF CAR STOPPED RUNNING ON INTERSTATE FOR NO REASON, BRAKES, ALARM, AIR BAGS WOULD BE INOPERATIVE. THIS HAS BEEN REPORTED TO GM/CHEVROLET ABOUT 6 TIMES, A LATE AS YESTERDAY WHEN THEY DEMAND COST OF KEYS TO REPAIR PROBLEM.AT TIMES WE HAVE GONE INTO STORES AND HEARD THE ALARM GO OFF WITH NO ONE AROUND. THIS IS NOT THE INTENT OF CHEVROLET TO MEET RECALL.  PLEASE ADVISE AS TO HOW THIS CAN BE RESOLVED. I HAVE NO DOUBT THAT THE KEY SYSTEM AND THE KEY AND IGNITION AND ENGINE ARE ALLINKED AND ARE FAULTY WITH PROBLEMS YET TOBE REVEALED. CURRENT MILEAGE, 60,700 TOTAL MILEAGE.  *TR",
        "vin": "2CNALPEW2A6"
    }
]