[
    {
        "components": "ENGINE AND ENGINE COOLING,TIRES",
        "crash": false,
        "dateComplaintFiled": "01/19/2003",
        "dateOfIncident": "07/01/2001",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002934,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "AMIGO",
                "productYear": "1998",
                "type": "Vehicle"
            },
            {
                "manufacturer": "PEUGEOT, INC.",
                "productMake": "ALL",
                "productModel": "ALL",
                "productYear": "1974",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SUNFOOF - CLAMP HAS BROKEN OFF. SEATBELTS- DRIVER SIDE LATCHES AND COMES UNLATCHED WHILE DRIVING, PASSANGER SIDE LOCKS WHEN PUTTING ON AND WHILE IN A SITTING POSITION WITH OUT CAR MOVING. STEERING & CONTROL- CAR VIBRATES, DRIVES ROUGH, PULLS AND CONSUMES A LOT OF GAS WHEN AT HWY MILES. GAS GAUGE- NOT ACCURATE, GIVES FALSE READINGS DURING DRIVES.  ELECTRICAL SYSTEM- SEVERAL SWITCHES NOT WORKING OR HAVE STOPED WORKING SUCH AS THE DOME LIGHT STAYING ON WHEN IN THE MIDDLE POSITION AND THE BULB IS NOT BLOWN, INTERIOR LIGHTS DIM WHILE DRIVING AND WHEN AC/HEAT SWITCHES ARE CHANGED ALONG WITH THE STEREO LIGHT THAT NO LONGER WORKS BUT OTHER BUTTONS DO.  ENGINE/TRANSMISION- LIGHT COMES ON AND GOES OFF DURING DRIVES, STARTED BLINKING AFTER CAR WAS STARTED WHILE CAR WAS MOVING, CAME ON A COUPLE WEEKS AGO AND HASN'T GONE OFF YET. COOLING & ENGINE- LOSING RADIATOR FLUIDS, OVERHEATING AFTER 2 DAYS OF REFILING SYSTEM.   HAVE HAD A TUNE UP, OIL CHANGE AND SYSTEMS CHECK AND NOTHING WAS FOUND? MAKING AN APPOINTMENT WITH ISUZU ASAP! SOME OF THESE PROBLEMS I CAN LIVE WITH BUT SOME COULD BE VARY DANGEROUS AND I WANT THEM FIXED FOR MY SAFTY AND AS WELL AS OTHERS.",
        "vin": "4S2CK57D4W4"
    }
]