[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/08/2014",
        "dateOfIncident": "08/13/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10567914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COBALT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS SUBMISSION IS AN ADDENDUM TO THE REPORT THAT I SUBMITTED ON AUG 15, 2011; REFERENCE NUMBER 10419491 WITH THE ATTACHMENTS THAT INCLUDE THE POLICE REPORT, MAY STATEMENT AND PHOTOS.   I SUBMITTED MY REPORT TWO DAYS AFTER THE ACCIDENT.  NOW, AFTER READING THE NEWS ARTICLES AND THE GM STATEMENTS REGARDING THE FAULTY IGNITION SWITCH, IT IS APPARENT THAT WHAT I THOUGHT WAS A STEERING MALFUNCTION (PER THE RECALLS I RECEIVED AND THE STATEMENTS MADE TO ME BY GM REPRESENTATIVES) WAS CLEARLY THE IGNITION SWITCH.  WHILE DRIVING DOWN THE FREEWAY AT 60 MPH MY DASH LIGHTS TURNED ON, I IMMEDIATELY LOST STEERING CONTROL (I COULD NOT TURN MY STEERING WHEEL) AND SWERVED HAD TO THE LEFT CRASHING INTO THE GUARD RAIL.  THE ACCIDENT REPORT SHOWS MY SKID MARKS ACROSS THREE TRAFFIC LANES THAT CLEARLY INDICATE THAT MY ABS SYSTEM ALSO WAS NOT WORKING.  MY AIRBAGS DID NOT DEPLOY EVEN THOUGH MY FRONT END WAS CRUSHED AND THE CAR TOTALED.  NOTHING ON MY CAR WORKED BECAUSE THE IGNITION SWITCH HAD TURNED OFF.   MY ORIGINAL REPORT SHOULD INDICATE THAT MY CAR SUFFERED AN IGNITION SWITCH MALFUNCTION THAT CAUSED THE ACCIDENT.  I WAS BELTED IN SO AFTER BEING RELEASED FROM THE HOSPITAL EMERGENCY ROOM (I WAS TAKEN BY AMBULANCE FROM THE CRASH SITE) I WAS DIAGNOSED WITH A CERVICAL SPRAIN, MULTIPLE CUTS AND BRUISES, SPRAINED ANKLE AND KNEE.  MY HEAD IMPACTED THE WINDSHIELD EVEN THOUGH I HAD MY SEAT BELT ON.   *TR",
        "vin": "1G1AK14FX57"
    }
]