[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/30/2014",
        "dateOfIncident": "05/27/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595214,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "300",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED IN PUBLIC ROADWAY FOLLOWING FILLING GAS TANK. STRUGGLED TO GET ENGINE RESTARTED. KEPT DYING. MANAGED TO GET RPMS UP BUT COULD NOT ENGAGE TRANSMISSION. AFTER SOME DELAY TRANSMISSION ENGAGED AND WAS ABLE TO DRIVE VEHICLE OUT OF TRAVELED WAY. I WAS BLOCKING TRAFFIC. THE ENGINE WOULD CONTINUE TO REPEAT DYING AND I WOULD HAVE TO PULL OVER AND PERFORM RESTART SEQUENCE. THIS CONTINUED FOR SEVERAL MILES. AT FIRST, THOUGHT ENGINE WAS EXPERIENCING VAPOR LOCK. ALSO HAD THOUGHT I HAD PURCHASED A BAD TANK OF GAS AND MY FUEL FILTER WAS PLUGGED. I WAS OUT OF TOWN AND TOOK THE CAR INTO LOCAL CHRYSLER DEALER AT THAT TIME. THEY TOLD ME IT WAS MY BATTERY AND CHARGED ME FOR A NEW ONE PLUS INSTALLATION. WHEN I RETURNED HOME THE NEXT DAY SOME 250 MILES AWAY I FOUND THE CAR ACTED UP AGAIN AFTER I FILLED IT UP WITH GAS. I CONTACTED MY LOCAL CHRYSLER DEALER WHO INDICATED THERE COULD BE A PROBLEM WITH THE FUEL DELIVERY SYSTEM AND BEING MY CAR WAS OUT OF WARRANTY ALL COST FOR INVESTIGATING TO DETERMINE THE PROBLEM AND THE ACTUAL WORK TO MAKE THE REPAIR WOULD BE ON ME. THEY COULD NOT GIVE ME ANY IDEA AS TO THE POSSIBLE TOTAL COST. I OPTED NOT GIVE THEM A BLANK CHECK AND DID NOT HAVE THEM DISMANTLE THE CAR. I FOUND THAT I CAN AVOID THE STALLING IF I DON'T FILL THE TANK FULL. A SAD SOLUTION TO A FAULTY FUEL DELIVERY SYSTEM. I'M THE ORIGINAL OWNER OF THE CAR AND HAVE RELIGIOUSLY CARED FOR IT. I HAVE NEVER RECEIVED ANY DOCUMENTATION FROM CHRYSLER REGARDING OFFERING TO CORRECT THE FLOAT (WHICH NOW THEY HAVE CONCLUDED IS THE PROBLEM). TO SET A DEADLINE ON JANUARY 2014 WITHOUT NOTIFICATION OF THE OWNERS IS POOR BUSINESS. IF THAT IS THEIR POSITION THAN I WILL DO MY BEST TO DISCOURAGE ANYONE FROM BUYING THEIR VEHICLES. THEY SHOULD HAVE HAD A RECALL BY NOTIFYING ALL THE OWNERS. I DO GET MAILERS FROM SEVERAL CHRYSLER DEALERSHIPS AND THEY HAVE ALL MY RECORDS!!  SHAME ON YOU, CHRYSLER!!!  *TR",
        "vin": "2C3KA73WX6H"
    }
]