[
    {
        "components": "STEERING,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2014",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586814,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "C350",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST DAY WHEN RECEIVING MY KEYS FOR A BRAND NEW MERCEDES C350 2009 AT THE DEALERSHIP...ENGINE LIGHT TURNS ON. LATER FINDING OUT IT WAS THE FUEL SYSTEM NEEDED TO BE REPLACED. A MONTH LATER OF GETTING A BRAND NEW CAR CORROSION WAS FOUND IN THE TAILLIGHTS. THEN FINDING OUT CORROSION ON THE BRAKE PADS.  MONTHS AFTER THIS THE POWER TRAIN WAS SLIPPING UP... THE RPMS OF THE CAR WOULD SURGE UP HIGH AND REMAIN STUCK AT HIGH RPMS. IF I ACCELERATED THE GAS IT WOULD SHOOT UP HIGHER TO HIGHER RPMS AND THE CAR WOULD MAKE THE NOISE BUT IT WOULDN'T MOVE. I THOUGHT IF I LET GO OF THE GAS THINKING THE RPMS WOULD RETURN BACK DOWN... BUT IT WOULDN'T...HUGE SAFETY ISSUE WHEN YOUR IN THE MIDDLE OF THE FREEWAY AND HAVE NO CONTROL TO DRIVE YOUR CAR. I WOULD HAVE TO PULL OVER SOME HOW AND TURN OFF THE CAR FOR THE RPMS TO COME BACK DOWN SO I CAN DRIVE IT AGAIN. I BROUGHT THE CAR BACK SEVERAL TIMES TO THE DEALERSHIP BUT THEY COULD NEVER DUPLICATE THE ISSUE. THEREFORE, NOTHING GOT FIXED OR REPLACED JUST CONSTANT SOFTWARE UPDATES WERE STATED WERE DONE. SOON AFTER TAKING MY CAR OVER 5+ TIMES FOR THIS SAME ISSUE, MY SRS STEERING MALFUNCTIONED. I GOT THAT REPLACED AND PAID FOR IT A YEAR AGO. NOW BACK TODAY EXACTLY 12 MONTHS LATER REPAIRING IT AGAIN - SRS MALFUNCTION...AGAIN STRANDED IN THE MIDDLE OF NO WHERE WAITING FOR A TOW TRUCK ALL ALONE. I HAVE BEEN TO THE DEALERSHIP REPAIRING MY CAR FOR SO MANY DIFFERENT THINGS, GETTING STRANDED, TOWING MY CAR, PAYING FOR ALL REPAIRS AND GIVING UP WEEKENDS AND WORK TIME TO GO TO THE DEALERSHIP. I HATE THIS CAR! THAT I'M ABSOLUTELY HAVE NO PEACE OF MIND, I DON'T FEEL SAFE, CAR IS NOT RELIABLE, HAS EXTREMELY POOR QUALITY. NOT WORTH IT AT ALL!  *TR",
        "vin": ""
    }
]