[
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/08/2014",
        "dateOfIncident": "07/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "HHR",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME WITH MY 2 CHILDREN IN MY VEHICLE AND HIT AND SLIGHT BUMP IN THE ROAD AND THE SERVICE AIR BAG NOTIFICATION CAME ON. THIS STARTLED ME AND I BECAME VERY SCARED BECAUSE I HAVE NEVER HAD A VEHICLE SAY SERVICE AIR BAG? I AM VERY CONCERNED ABOUT THIS ISSUE THAT IF I AM IN AN ACCIDENT GOD FORBID THAT THE AIRBAGS WILL NOT DEPLOY IF NEEDED        I TOOK MY VEHICLE IN TO BE SERVICED FOR IGNITION RECALL TODAY AFTER WAITING ALMOST 5 MONTHS FOR PART AND INFORMED SERVICE TECHNICIAN ABOUT WHAT HAD OCCURRED AND THE RESPONSE I RECEIVED WAS\" WE CAN DO A DIAGNOSTIC ON THE ISSUE FOR $89.00? \"        I DO NOT FEEL THAT I SHOULD HAVE TO PAY TO HAVE THIS DEFECT TO  RESEARCHED AND FIXED DUE TO DANGER THAT THIS POSES TO THE SAFETY OF MYSELF AND MY CHILDREN. I AM REQUESTING THAT AUTHORIZATION BE GIVEN TO HAVE THE ISSUE WITH THE SERVICE AIR BAG LIGHT TO BE RESEARCHED AND REPAIRED AT NO CHARGE DUE TO ALL THE INCONVENIENCE THESE ISSUES ARE CAUSING ME AND THE TIME THAT I HAVE TO BE WITHOUT A VEHICLE IN ORDER TO HAVE NECESSARY REPAIRS COMPLETED SO THAT MY FAMILY AND I CAN HAVE A SAFE VEHICLE. ALSO, THE DRIVER SIDE DOOR HANDLE JUST BROKE UPON OPENING DOOR AND I AM REQUESTING ASSISTANCE WITH DISCOUNT TO HAVE THIS PART REPLACED.        I AM A SINGLE PARENT AND I HAVE LIMITED INCOME AND CANNOT AFFORD TO KEEP MAKING REPAIRS ON THE VEHICLE DUE TO FAULTY OR DEFECTIVE PARTS. PLEASE ASSIST ME AS SOON AS POSSIBLE.  [XXX]  [XXX]  SAN DIEGO, CA[XXX]  [XXX]  [XXX]  [XXX]   VIN: 3GNBABFW9BS[XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)        UPDATED 3/18/2015 *JS",
        "vin": "3GNBABFW9BS"
    }
]