[
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-550 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PURPOSE OF THIS IS TO SHED LIGHT ON A DEFECTIVE PARKING BRAKE SYSTEM DESIGNED BY FORD. THE SYSTEM WILL AFFECT SEVERAL MODEL YEARS OF FORD LIGHT AND MEDIUM DUTY TRUCKS. THE PARKING BRAKE PEDAL ASSEMBLY DOES NOT WITHSTAND REGULAR USE IT TENDS TO FALL APART. THE LAST ASSEMBLY INSTALLED IN MY F-500 IS A FORD NEW ASSEMBLY AND HELD UP FOR 18000 MILES, FORD NOW REFUSES TO PROVIDE A REPLACEMENT UNDER WARRANTY. THE FAILURE OF THE SYSTEM HAS CAUSE THIS TRUCK TO ROLL AND HIT PARKED CARS.   *JS  THE ENTIRE DESIGN IS A FAILURE AS IT CAN NOT SAFELY HOLD THE WEIGHT OF AN EMPTY VEHICLE. MY TRUCK WEIGHS 14000 EMPTY AND IS RATED AT 19000 GVW. THE ASSEMBLY EVEN WHEN ADJUSTED PROPERLY CAN NOT HOLD THE VEHICLE ON AN INCLINE. THE INSIDE THE ROTOR HAT DESIGN FOR PARKING BRAKES IS A COPY FROM THE LIGHT SUV'S FORD PRODUCES. THIS IS NOT AN ADEQUATE DESIGN FOR HEAVIER VEHICLES. THE SURFACE AREA CONTACT OF SHOES TO THE INSIDE OF THE ROTOR HAT IS NOT GREAT ENOUGH TO PRODUCE THE FRICTION NEEDED TO HOLD THE VEHICLE.   I KNOW OF SEVERAL OTHER PEOPLE THAT HAVE THE SAME PROBLEM WITH THEIR FORDS IN THE SAME MODEL YEARS. AT 360749 MILES THE ENTIRE PARKING BRAKE SYSTEM HAS BEEN REBUILT ON THIS SPECIFIC TRUCK. THE SHOES ARE ADJUSTED UP MANUALLY (IT HAS NO SELF ADJUST FEATURE) TIGHT WITH THE ROTOR HAT AND THE SYSTEM WILL NOT HOLD THE VEHICLE ON AN INCLINE. THE SYSTEM WITH NORMAL WEAR BECOMES A GREATER HAZARD AS THE PARK BRAKE SYSTEM WEAKENS QUICKLY.  *JS",
        "vin": "1FDAF56F1YE"
    }
]