[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/13/2014",
        "dateOfIncident": "05/25/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610114,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "CROSSFIRE ROADSTER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS SERVES AS AN ADDENDUM TO OUR (AND MANY OTHERS') COMPLAINTS. THE CHRYSLER TSB THAT YOU HAVE ON FILE, ONLY LISTS THE AFFECTED SYSTEMS AS \"VISIBILITY\", AND IT CALLS FOR REPAIR (?) WHEN IT ACTUALLY SPECIFIES REPLACEMENT AS THE ONLY RECOMMENDED REMEDY, AT A TYPICAL COST OF $2,500; TO BE PROVIDED OR REIMBURSED TO A SMALL SELECT GROUP OF OWNERS, EVEN THOUGH THIS FAILURE CONTINUES TO OCCUR NATIONWIDE. THIS IS ABSURD. WE SHOULD NOTE THAT THE TERM \"STRUCTURE\" AS AN  \"AFFECTED PART\" NO LONGER APPEARS IN YOUR E-MAIL COMPLAINT FORM (WE WONDER WHY?) ALL MODERN CONVERTIBLE ROOF TOPS AND WINDOWS ARE INTENDED AND DESIGNED FOR SAFE, LONG TERM USE IN ANY EXPECTED DRIVING CONDITIONS, THUS THE USE OF DOT APPROVED SAFETY GLASS AND ELECTRONIC REAR WINDOW DEFROSTERS, ESPECIALLY WHEN CONDITIONS REQUIRE THE ROOF TOP TO BE IN THE \"UP\" POSITION. THE NEGATIVE RESULTS OF ANY WINDOW DETACHMENT, VISIBILITY, STABILITY OF THE VEHICLE, SAFE REACTION BY THE DRIVER, WEATHER PROTECTION, ELECTRICAL MALFUNCTION ETC.,  BOTH IMMEDIATE AND POTENTIAL LONG TERM, IN A CASE WHERE THE VEHICLE MUST STILL BE DRIVEN ANY UNKNOWN DISTANCE UNPROTECTED FROM WHATEVER CONDITIONS POSSIBLE, MAY WELL PROVE CATASTROPHIC AND MUST BE CONSIDERED COMPLETELY UNACCEPTABLE BY ANY STANDARD, ESPECIALLY THAT OF OUR U.S. GOVERNMENT. YOUR PUBLICATION (DOT HS 808 795) STATES: \"SIMILARLY A PERSON MAY.. PETITION (REQUEST)  NHTSA TO HOLD A HEARING ON WHETHER A MANUFACTURER HAS REASONABLY MET ITS OBLIGATION TO NOTIFY AND/OR REMEDY A SAFETY DEFECT OR NONCOMPLIANCE WITH A FEDERAL MOTOR VEHICLE SAFETY STANDARD. IF THE PETITION IS GRANTED, A HEARING IS HELD TO ASSESS THE MATTER AND DECIDE WHAT CORRECTIVE ACTION SHOULD BE TAKEN. IF THE PETITION (REQUEST) IS DENIED, THE REASONS FOR THE DENIAL ARE PUBLISHED IN THE FEDERAL REGISTER\". AT THE VERY MINIMUM, CHRYSLER HAD AN OBLIGATION TO NOTIFY ALL OF THE POTENTIAL (& INEVITABLE) FAILURE! PLEASE HELP.  *TR",
        "vin": "1C3AN65L65X"
    }
]