[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "06/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WED, JUNE 25TH APPROXIMATELY 11:30 PM I HAD TO STOP QUICKLY DUE A STOP LIGHT CHANGING ON ME AND I FELT MY BRAKE PEDAL GET \"SQUISHY\" WHEN TRYING TO STOP.  I VERIFIED THIS WHEN I TRIED STOPPING AT THE NEXT LIGHT AND THE PEDAL SUNK EVEN FURTHER AND IT TOOK EVEN LONGER TO STOP.  BY THE TIME I GOT HOME MY BRAKES WERE ABOUT USELESS FOR ANY SPEED OVER AN IDLE AS THE PEDAL WENT ALL THE WAY TO THE FLOORBOARDS WHEN PRESSED.  LUCKILY IT WAS LATE AT NIGHT AND THERE WERE VERY FEW CARS ON THE ROAD, SO I DID NOT NEED TO STOP QUICKLY.  I THEN LOOKED UNDER MY TRUCK AND FOUND BOTH OF THE BRAKE LINES HEAVILY CORRODED/RUSTED IN A SPOT JUST BEHIND MY FRONT DRIVER'S SIDE WHEEL.  I HAD MY WIFE PRESS ON THE BRAKE PEDAL WHILE I WAS WATCHING THE LINES AND AT LEAST ONE OF THEM HAD BLOWN OPEN AND WAS SQUIRTING FLUID.  I SUBSEQUENTLY HAD TO GET MY TRUCK TOWED TO MY MECHANIC AS IT WAS NOT DRIVE-ABLE.  AND TO TOP IT ALL OFF, THE REQUIRED PARTS HAD TO BE ORDERED DIRECTLY FROM THE DEALER INCREASING MY REPAIR BILL.  AND AFTER TALKING WITH MY MECHANIC, HE STATED THAT WHEN HE CALLED THE DEALER FOR THE PARTS, THEY KNEW EXACTLY WHAT WAS NEEDED AS THEY HAVE HAD TO DO THESE SAME REPAIRS NUMEROUS TIMES.    LUCKILY THIS DID NOT HAPPEN WHILE MY DAUGHTER WAS USING MY TRUCK TO HAUL HER HORSES AROUND AS I DO NOT THINK SHE WOULD HAVE BEEN ABLE TO STOP AT ALL WITH THAT EXTRA WEIGHT BEHIND HER TRAILER BRAKES OR NOT.  *TR",
        "vin": "1GCEK19T93Z"
    }
]