[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/10/2014",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597414,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "C230",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING STOPPED IN TRAFFIC WITH THE ENGINE OFF, AND THE FRONT DRIVERS' SIDE OF MY VEHICLE JUST SPONTANEOUSLY DROPPED AS IF THAT PART OF THE VEHICLE HAD FALLEN INTO A SINK HOLE. I WAS WAITING FOR A DRAW BRIDGE TO COME DOWN AFTER A SAILBOAT PASSED, SO THE CAR WAS TURNED OFF. WHEN I GOT OUT OF THE VEHICLE TO INSPECT WHAT HAD HAPPENED, I COULD SEE THAT THE FRONT SPRING HAD SEPARATED FROM ITS TOP MOUNT IN WHAT I ASSUME WAS THE FRAME OF THE VEHICLE. WHEN I SEARCHED ON-LINE I FOUND THAT THIS IS SOMETHING THAT HAPPENS ALL THE TIME WITH VARIOUS MODELS OF MERCEDES BENZ. IF I HAD BEEN DRIVING AT HIGHWAY SPEED I AND ANYONE ELSE IN THE CAR COULD HAVE EASILY BEEN KILLED, NOT TO MENTION OTHER VEHICLES, SINCE THE VEHICLE STEERING IS ALSO COMPROMISED WITH THE WHEEL BOTTOMING-OUT ON THE INSIDE OF THE FRONT OF THE VEHICLE. THE CAR IS A '98, BUT WITH ONLY 148,000, THIS SHOULD NOT HAVE HAPPENED. CLEARLY IT'S A DESIGN FLAW. WHY DOES NHTSA LET MERCEDES BENZ GET AWAY WITH THIS WITHOUT DEMANDING A RECALL? WHEN YOU LOOK ON THE WEB, YOU CAN SEE THAT THIS IS HAPPENING TO MANY PEOPLE, AND NOT ONLY IS MERCEDES REFUSING TO FIX IT FOR FREE, DEALERS ARE CHARGING CUSTOMERS THOUSANDS OF DOLLARS TO FIX THE DESIGN FLAW. I JUST GOT A QUOTE OF $2,000 FROM ONE DEALER OVER THE PHONE TO FIX BOTH FRONT SPRING PERCHES, AND IT COULD BE MORE IF ANYTHING IS DAMAGED OTHER THAN THE PERCH ITSELF. HE SAID OTHER DEALERS ARE CHARGING $5,000 FOR THE REPAIR TO BOTH SIDES. WHAT COULD BE MORE DANGEROUS THAN HAVING YOUR FRONT-END SUSPENSION DISINTEGRATE SPONTANEOUSLY WITHOUT WARNING?  *TR",
        "vin": "WDBHA23G0WA"
    }
]