[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2014",
        "dateOfIncident": "06/24/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "ION",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GMC RECALL FOR FAULTY IGNITION SWITCH FOR 2003 SATURN ION.     DEALERSHIP _________, IL HAD RECEIVED THE PART IN STOCK ON 06-02-14.    WHEN I LEFT THE CAR MY BATTERY WAS IN GREAT WORKING ORDER WITH NO PREVIOUS ISSUES.    RADIO CD CASSETTE UNIT WAS IN GREAT WORKING ORDER WITH NO PREVIOUS ISSUES.     SERVICE CONSULTANT ADVISED ME THE IGNITION LOCK SWITCH HOUSING ALSO HAD TO BE REPLACED AND ON BACK ORDER WITH GM.     SERVICE CONSULTANT SAID I MUST BUY NEW BATTERY FOR THEM TO CONTINUE REPLACEMENT OF NEW IGNITION SWITCH AND TO FIX FOR THE HOUSING (WHICH WAS STILL ON BACK ORDER BY GM) AS MY BATTERY WAS DEAD AND CAR WOULD NOT  START FOR THE COMPLETION OF REPAIR.    MY BATTERY WAS IN EXCELLENT WORKING ORDER WHEN I LEFT THE CAR ON 06-02-14  I HAVE COPY OF INVOICE DATED 06-02-14 NOTATING BATTER FAILED TEXT NO CRANK TO START REPL. BATTERY.    UNDER DURESS AND DESPARATION AND IN ORDER TO RETURN TO WORK SAME DAY, I CHARGED BATTERY TO MY CREDIT CARD IN THE AMOUNT OF $173.42.     WHEN CAR WAS BROUGHT TO ME IT SMELLED LIKE BURNED WIRING.      THE RADIO UNIT WOULD NOT COME ON.  MIKE MANNING SAID THE ELECTRICAL NEEDED DIAGNOSIS AND COULD BE EXTENSIVE ELECTRICAL REPAIRS AND TO BRING BACK  ANOTHER TIME.     I REFUSED TO TAKE MY CAR AND WAS PROVIDED ANOTHER RENT CAR. MY BANK TRIED TO DISPUTE THE $173.42 CHARGE FOR BATTERY.  THAT AMOUNT IS STILL OUTSTANDING ON MY ACCOUNT.    SERVICE MANAGER DEMANDED I PAY $173.42 CASH BEFORE IN ORDER FOR ME TO GET MY CAR OUT OF THE SHOP.    THEY DID NOT INSTALL A NEW IGNITION LOCK HOUSING AND USED THE ORIGINAL ONE ON MY CAR.    COPY OF SHOP WORK ORDER  DATED 06-02-14 IS NOTATED \"BATTERY FAILED TEST, NO CRANK TO START.  REPL. BATTERY.    I WAS NOT INFORMED THE BATTERY WAS DEAD UNTIL APPROXIMATELY 3 WEEKS LATER WHEN I WENT TO PICK UP MY CAR.   *JS",
        "vin": ""
    }
]