[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/25/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616414,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO BRING TO YOUR ATTENTION AN ISSUE THAT IS HAPPENING WITH MY 2007 VOLKSWAGEN PASSAT 2.0T.  THE CARS AIRBAG FAULT INDICATOR LIGHT IS ON INDICATING THAT THE AIR BAG WILL NOT DEPLOY IF IN AN ACCIDENT.  I HAD AN INDEPENDENT CAR MECHANIC INVESTIGATE THE ISSUE AND HE INFORMED ME THAT THE AIR BAG FAULT IS INDICATIVE OF A BAD SENSOR.  I HAVE AN APPOINTMENT WITH KEFFER VOLKSWAGEN IN HUNTERSVILLE NORTH CAROLINA TO ACCURATELY DIAGNOSE THE ISSUE ON 8/1/2014.  I CALLED VOLKSWAGEN (703-364-7000) ON 7/25/2014 AND SPOKE WITH A CUSTOMER ADVOCATE TO FILE A FORMAL COMPLAINT AND ASK THEM IF THEY WOULD COVER THE COST OF THE REPAIRS.  SINCE IT IS A SAFETY ISSUE AND THE ISSUE HAS CLOSE PROXIMITY TO THE HARNESS RECALL FROM 3 YEARS AGO I EXPECTED THEM TO COVER IT.  (I HAD THE HARNESS REWIRED WITH THE NEW HARNESS AS A PART OF THAT RECALL.)  VOLKSWAGEN TOLD ME THAT THEY WOULD NOT COVER THE COST OF THE DIAGNOSIS OR REPAIRS DUE TO THE AGE OF THE VEHICLE. CASE # [XXX].   I HAVE CONCERNS BECAUSE I KNOW THIS IS A BIGGER ISSUE AND NOT JUST A PROBLEM WITH MY CAR.  I HAVE PROVIDED SOME SCREEN PRINTS OF OTHER VOLKSWAGEN OWNERS COMPLAINING OF THE SAME PROBLEMS.  SEVERAL DRIVERS HAVE BEEN IN ACCIDENTS WHERE THE AIRBAGS DID NOT DEPLOY.  DRIVERS ARE CONCERNED ABOUT THE AIRBAG NOT DEPLOYING DURING AN ACCIDENT AND OF THE AIR BAG DEPLOYING WHILE DRIVING.  I ALSO HAVE THE SAME CONCERNS AND I BELIEVE THAT THIS ISSUE SHOULD BE INVESTIGATED AS A DESIGN FLAW / DEFECT THAT COULD LEAD TO A LARGER SAFETY RECALL.  IF VOLKSWAGEN IS TO FIX THE ISSUE WITH THE SAME PARTS WILL THE ISSUES CONTINUE TO PERSIST?  THIS IS DEEPLY CONCERNING, ESPECIALLY WHEN AN EMPLOYEE AT HUNTERSVILLE NORTH CAROLINA INFORMED ME THAT PARTS AND LABOR ARE ONLY COVERED UNDER WARRANTY FOR ONE YEAR AFTER THE REPAIRS.  WILL I BE PAYING FOR THIS SAME REPAIR OVER AND OVER AGAIN?  YOUR URGENT ATTENTION AND RESPONSE IS EXPECTED.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WVWEK73CX7P"
    }
]