[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "06/15/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "IMPALA",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST PURCHASED THIS CAR IN JANUARY OF 2007 AND I HAD NOTICED THE TRANSMISSION HAVING ISSUES WHEN SHIFTING GEARS.  I FIRST NOTICED THIS ISSUE WHEN BACKING OUT OF MY DRIVEWAY AND PULLING THE CAR INTO GEAR (DRIVE) THERE WOULD BE A HESITATION AND A \"CLUNK\" NOISE.  I WAS NOT SURE WHAT THE ISSUE WAS AT FIRST SO I WAITED UNTIL IT HAPPENED AGAIN AND CALLED THE LOCAL CHEVY DEALER TO INSPECT IT, AS IT WAS UNDER WARRANTY.  THE MECHANIC COULD NOT REPLICATE THE PROBLEM AND TOLD ME THERE WAS NO ISSUE.    THE TRANSMISSION HAD CONTINUED TO HAVE ISSUES OVER THE PAST 6-7 YEARS.  I ALSO HAD THE TRANSMISSION ACT UP WHEN I WOULD BE DRIVING IN TOWN FROM A STOP UP TO HIGHWAY SPEEDS.  AT A FULL STOP THE CAR WOULD HESITATE TO SHIFT INTO GEAR ALMOST CAUSING MULTIPLE ACCIDENTS.  MANY TIMES I WOULD NEED TO DOWN SHIFT TO FIRST GEAR AND UP SHIFT IN ORDER TO GET MY VEHICLE GOING.  IN THE PAST THREE YEARS I HAVE PERSONALLY ALMOST BEEN IN ABOUT 12 OR MORE POTENTIAL ACCIDENT SITUATIONS BECAUSE OF THE TRANSMISSION ISSUE.    I HAVE READ IN MANY ONLINE FORUMS THAT THIS IS A SERIOUS AND KNOWN ISSUE WITH THE CHEVY IMPALA TRANSMISSION.  THIS IS AN ISSUE THAT NEEDS TO BE RESEARCHED AND RESOLVED WITH A RECALL CAMPAIGN.  FROM WHAT I HAVE RESEARCHED ONLINE THERE IS AN ISSUE WITH A MODULE WITH THE TRANSMISSION.    PLEASE RESEARCH THIS ISSUE AS I WILL BE CONTACTING GM AS WELL OVER THIS FAULTY PART/DESIGN OF TRANSMISSION.  *TR",
        "vin": "2G1WT58K869"
    }
]