[
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2014",
        "dateOfIncident": "06/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "COBALT",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 18, 2014 WHILE DRIVING 45 MILES PER HOUR I SUDDENLY LOST POWER STEERING IN THE VEHICLE AND THE ENGINE KEPT CUTTING OUT LIKE IT WAS GOING TO SHUT OFF.  I PULLED INTO A STORE PARKING LOT AND THE SHIFTER WOULD NOT WORK PROPERLY WHEN TRYING TO GET IT INTO PARK.  POWER STEERING LIGHT, ENGINE LIGHT AND SEVERAL OTHER LIGHTS APPEARED ON MY DASHBOARD.  .  I CALLED THE DEALERSHIP ON JUNE 18, 2014 TO NOTIFY THEM OF MY POWER STEERING GOING OUT AND THE OTHER ISSUES DESCRIBED ABOVE.  THEY TOLD ME PARTS WERE STILL NOT AVAILABLE.  I DID RECEIVE A CALL BACK THAT THEY DID IN FACT HAVE THE PART AND TO BRING IN THE VEHICLE ON JUNE 19, 2014.  MY HUSBAND DROVE THE VEHICLE 35 MILES TO THE DEALERSHIP WITH NO POWER STEERING, THE ENGINE WANTED TO DIE EVERY TIME HE CAME TO A STOP AND ACTED ERRATICALLY THE WHOLE DRIVE THERE.  ACCORDING TO THE INVOICE RECEIVED THE DEALERSHIP MILEAGE ON MY VEHICLE WAS 114, 340 AND THEY PERFORMED RECALL 10023 V220 REMOVED AND REPLACED POWER STEERING MOTOR WITH MOTOR KIT 1 19257875 MOTOR KIT.  ON JUNE 20, 2014 THE CAR WAS DRIVEN 320 MILES.  ON JUNE 21, 2014 I   HAD NO POWER STEERING.  ON JUNE 23, 2014 I HAD TO HAVE A WRECKER SERVICE TOW MY VEHICLE BACK TO THE DEALERSHIP..  ON JULY 18, 2014 I PICKED UP MY VEHICLE.   ACCORDING TO THE INVOICE RECEIVED THE DEALER PERFORMED RECALL 13454 (F-CYLINDER KIT ), PERFORMED RECALL 14113 (REMOVED AND REPLACE IGNITION CYLINDER AND PROGRAMMED 2 NEW KEYS PER RECALL 14113).    THE MILEAGE THEY SAY WAS ON MY VEHICLE ON THIS INVOICE DATED 7/18/14 WAS 114, 292.  DON'T KNOW HOW MY MILEAGE WENT BACKWARDS???   ON JULY 28, 2014 DRIVING TO WORK AT 4:30 AM GOING 60 MPH MY POWER STEERING LIGHT COMES ON, THE ENGINE IS CUTTING OUT, THE DASHBOARD LIGHTS UP, THE SPEEDOMETER NEEDLE IS FLICKERING UNCONTROLLABLY AND I HAVE NO WHERE TO PULL OVER.  THIS IS THE 3RD TIME POWER STEERING PROBLEM DUE TO GM RECALL.  HELP!!!  *TR",
        "vin": "1G1AK52F557"
    }
]