[
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "07/21/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SIENNA",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "IT APPEARS THAT TOYOTA HAS CREATED ARTIFICIAL OBSTACLES TO PREVENT MY OBTAINMENT OF AN ELIGIBLE REIMBURSEMENT FOR RECALL (SAFETY RECALL A9E - TIRE CARRIER CABLE) REPAIRS. IN RESPONSE TO THE RECALL NOTICE I HAD THE CABLE INSPECTED THEN CONTACTED TOYOTA IN ACCORDANCE WITH THE RECALL LETTER BUT I WAS DENIED REIMBURSEMENT. ON OCTOBER 2, 2013 I WROTE TO TOYOTA FOLLOWING THE INSPECTION AND ATTACHED THE ORIGINAL WORK ORDER FROM A TOYOTA DEALER FOR THE REPLACEMENT OF PART NUMBER \"51900-08010\" AS REQUIRED. I RECEIVED AN OCTOBER 17TH RESPONSE SAYING I NEEDED TO PROVIDE ANSWERS TO THREE QUESTIONS:REASON THE VEHICLE BROUGHT INTO THE REPAIR FACILITY; THE REPAIR FACILITY DIAGNOSES, AND THE REPAIR PERFORMED IN ORDER TO CORRECT THE CONCERN. AFTER SEVERAL TELEPHONE CALLS TO TOYOTA CUSTOMER SERVICE AND AGAIN HAVING THE CURRENT CABLE REINSPECTED, OBTAINING AND FORWARDING COPIES OF THE REPAIR ORDER, PROOF OF PAYMENT, AND OWNERSHIP OF THE VEHICLE FOR REPAIR WORK PERFORMED BY A TOYOTA DEALERSHIP USING AN IDENTICAL PART NUMBER FOR REIMBURSEMENT ELIGIBILITY, I WAS DIRECTED TO CONTACT THE MANAGER AT THE DEALERSHIP AND OBTAIN WRITTEN INFORMATION ON THE CAUSE OF THE BREAKAGE THAT OCCURRED NEARLY TEN YEARS EARLIER AND THAT I NEEDED TO CONTACT HIM BECAUSE HE WAS NOT RESPONDING TO THE CORPORATE CUSTOMER SERVICE OFFICE.  I SENT A LETTER, DATED JANUARY 20, 2014, TO HIM BUT NEVER EVEN RECEIVED AN ACKNOWLEDGEMENT. ALTHOUGH I'VE DONE EVERYTHING REQUIRED, SOMETIMES MORE THAN ONCE, HAD REPAIRS COMPLETED USING THE PROPER PART NUMBER, AS SHOWN ON THE REPAIR WORKSHEET ISSUED BY A TOYOTA DEALER, I'VE BEEN DENIED REIMBURSEMENT DUE TO TOYOTA'S OWN DEALERSHIP REPAIR MANAGER'S LACK OF COOPERATION. IF THE REPAIRS WERE NOT DUE TO THE CABLE BREAKAGE AND IF THE REPLACEMENT PART WAS NOT NEEDED, WHY DID THE TOYOTA DEALERSHIP DO THE REPAIR AND CHARGE ME FOR IT? COPIES - LETTERS AND RECEIPTS WILL BE PROVIDED, IF NEEDED.  *TR",
        "vin": "4T3ZF13C0WU"
    }
]