[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/10/2014",
        "dateOfIncident": "06/27/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 27,2014 APPROX. 6:30PM MY BRAKE PEDAL  WENT ALL THE WAY TO THE FLOOR AS I WAS BACKING UP TO TURN MY TRUCK AROUND IN THE DRIVEWAY.  I PROCEEDED TO  PUT THE TRUCK IN DRIVE AND PUSHED THE BRAKE AGAIN AND THE PEDAL WENT TO THE FLOOR. I PUT THE TRUCK IN PARK AND GOT OUT AND LOOKED UNDER THE TRUCK AND NOTICED THAT BRAKE FLUID WAS POURING OUT FROM UNDER THE DRIVER SIDE CAB. I GOT A CLOSER LOOK AT WHAT WAS GOING ON AND THAT IS WHEN  I NOTICED THAT THE BRAKE LINE HAD BURST. I ALSO NOTICED HOW EXTREMELY RUSTY THE BRAKE LINES WERE. THE BRAKE LINES WERE IN SUCH BAD SHAPE FROM RUST THAT REPAIRING IT WAS NOT AN OPTION. THE LINES NEEDED TO BE COMPLETELY REPLACED. I HAD THE TRUCK TOWED TO SHELOR MOTOR MILE  IN CHRISTIANSBURG, VA ON 7/3/14.  I TOLD  THEM TO REPLACE THE BRAKE LINES BECAUSE THEY WERE TOO RUSTED TO REPAIR AND I DID NOT FEEL SAFE DRIVING IT WITH THE BRAKE LINES IN SUCH BAD SHAPE. I PICKED UP MY TRUCK  ON 7/10/14  AND I ALSO GOT MY OLD BRAKE LINES THAT WAS REMOVED FROM THE TRUCK. AFTER I GOT HOME I GOT UNDER THE TRUCK AND LOOKED AT THE NEW BRAKE LINES AND NOTICED THEY HAD A BLACK COATING ON THEM.  I WAS TOLD THAT THE COATING WAS TO RUST PROOF THE BRAKE LINES WHICH THE OLD LINES DID NOT HAVE.   I FELT  VERY FORTUNATE THAT THIS HAPPENED WHILE I WAS IN MY DRIVEWAY AND NOT ON THE HIGHWAY  BECAUSE IT COULD HAVE BEEN REAL BAD ACCIDENT.   *TR",
        "vin": "1GCEK14V94Z"
    }
]