[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/23/2014",
        "dateOfIncident": "09/21/2014",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638514,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS INCIDENT IS CONCERNING MY 2005 HONDA ACCORD EX V6, VIN  (GIVEN ABOVE) . I AM THE FIRST OWNER AND CAR HAS 85000 MILES ON IT. ON 21ST SEPTEMBER 2014 AUTOMATIC TRANSMISSION FAILED WITHOUT ANY WARNING WHILE I WAS DRIVING ON FREEWAY TODAY.  CHECK ENGINE LIGHT NEVER TURNED ON .THE CAR JUST STOPPED ON A CROWDED INTERSTATE, WHICH WAS VERY FRIGHTENING. THIS VEHICLE HAS BEEN PROPERLY MAINTAINED AND I'VE NEVER MISSED AN OIL CHANGE, TIMING BELT, ETC. I'VE NEVER HAD ANY MAJOR PROBLEMS WITH THIS CAR, NO LEAKS, NO ENGINE ISSUES AND THIS LEADS ME TO BELIEVE THERE IS SOME SORT OF DEFECT WITH THIS AUTOMOBILE WHICH NEEDS TO BE RECALLED. MY SITUATION WITH THE TRANSMISSION IS OBVIOUSLY NOT AN ISOLATED INCIDENT AND HONDA NEEDS TO STEP-UP TO THE PLATE. THE MECHANIC SAID THAT HE HAS SEEN THIS SAME PROBLEM TIME AND TIME AGAIN WITH HONDA'S ESPECIALLY WITH 2005 ACCORD V6 TRANSMISSION FAILURES.   ON FURTHER RESEARCH ON NHTSA WEBSITE, I FOUND NHTSA CAMPAIGN ID NUMBER : 11V395000 ADDRESSING SIMILAR PROBLEM AND AS OF 23RD SEPTEMBER 2014,  1.5 MILLION (1512107) VEHICLES HAS BEEN RECALLED FOR SIMILAR ISSUE.THE HONDA RECALL NUMBER IS R89  AND THE RECALL WAS PLACED ON AUGUST 27TH 2011, FOR HONDA ACCORDS 2005-2010 FOR THE TRANSMISSION. I TOOK MY CAR TO, GROSSINGER HONDA, MY LOCAL HONDA DEALER. THE DIAGNOSIS WAS THAT THE TRANSMISSION HAD COMPLETELY FAILED ALTHOUGH FLUID LEVELS WERE NORMAL. DTC CODES  WERE P0741, P0746, AND P0777.  HONDA OPENED A CASE AND GAVE ME A CASE NO:N012014-09-22-02450.  MORE THAN 1.5 MILLION VEHICLES ARE AFFECTED FROM THIS RECALL AND THEY TELL ME MY CAR ISN'T ONE? I STRONGLY FEEL THAT MY CASE IS GENUINE AND WITH REFERENCE TO NHTSA CAMPAIGN ID NUMBER : 11V395000, MY VEHICLE SHOULD BE CONSIDERED FOR THIS RECALL BY AMERICAN HONDA .  *TR",
        "vin": "1HGCM66845A"
    }
]