[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2014",
        "dateOfIncident": "09/03/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639814,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I USED A PREMIUM OIL FILTER (NOT KIA), AND A FEW WEEKS LATER HAD A KNOCKING IN THE ENGINE. I TOOK THE CAR TO A SHOP UP THE STREET AND WAS TOLD THAT SINCE WE USED AN OIL FILTER THAT WAS NOT KIA, THE FILTER CAUSED METAL IN THE ENGINE WHICH NOW NEEDS TO BE REPLACED. I CALLED KIA CONSUMER AFFAIRS AND EXPLAINED THE ISSUE. WITH ALL THE INFORMATION THAT WAS SENT TO ME IN 6 YEARS, NOT ONE PIECE STATED THAT YOU ARE REQUIRED TO USE A KIA OIL FILTER. THE SHOP THAT I ORIGINALLY TOOK THE CAR TO HAD TO DO SOME RESEARCH AND STATED THAT THERE ARE BULLETINS OUT THAT ARE ONLY AROUND 2 YEARS OLD. WHILE SPEAKING WITH CONSUMER AFFAIRS, I WAS TOLD THAT THE CAR NEEDED TO GO TO A KIA DEALER TO BE DIAGNOSED. I THEN HAD THE CAR TOWED TO A LOCAL DEALER WHICH STATED THE SAME THING. NOW, THE KICKER, THEY WILL NOT HELP IN FIXING THE ENGINE BECAUSE I AM OVER THE 100,000 MILE MARK. ON TOP OF THAT, I AM NOW CHARGED A TOW BILL AND MORE DIAGNOSTIC FEES ON TOP OF WHAT I ALREADY PAID IN WHICH THEY WILL NOT PAY FOR EITHER (SINCE THEY REQUIRED THE CAR TO BE AT A DEALER FOR ASSISTANCE). I CALL  THE CONSUMER AFFAIRS LADY THAT I HAVE BEEN WORKING WITH, AND SHE WILL NOT RETURN MY CALL UNTIL I CALL THE 800 NUMBER AND TELL THEM I NEED TO SPEAK TO SOMEONE OR I WILL BE GOING TO THE LOCAL MEDIA AS WELL AS ANY SOCIAL MEDIA AVENUE I CAN. THE DEALER THAT I PURCHASED THE CAR FROM WILL ALSO NOT HONOR THE \"ENGINE FOR LIFE\" THAT I SIGNED UNLESS I CAN PROVIDE ALL RECEIPTS FROM THE LAST 5 YEARS ON ANY MAINTENANCE THAT I DID ON THE CAR OUTSIDE OF A DEALER (AIR FILTER, ETC). I HAVE RECENTLY BEEN MARRIED AND THE ACCOUNT CLOSED. AND - WHO KEEPS THEIR RECEIPTS FOR 5 YEARS ON AIR FILTERS?? THIS IS NOT ONLY POOR CUSTOMER SERVICE FOR A LOYAL CONSUMER, BUT THE LACK OF FOLLOW THROUGH WITH WHAT YOU \"AGREED\" TO AND SIGNED UPON PURCHASE NOT BEING HONORED.   *TR",
        "vin": ""
    }
]