[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR AJAR (DRIVER'S SIDE) INDICATOR ILLUMINATES WHEN DOOR IS CLOSED. MULTIPLE OCCURRENCES OF THIS ISSUE ARE DOCUMENTED ON INTERNET. WHEN THIS OCCURS THE FOLLOWING SYSTEMS ARE AFFECTED:  * DOOR LOCKS - CANNOT BE LOCKED FROM DRIVER OR PASSENGER AUTOMATIC DOOR LOCK BUTTON. WHEN ATTEMPTED ALL DOOR LOCKS AUTOMATICALLY UNLOCK AGAIN. AUTO LOCKING SAFETY FEATURE IS EFFECTIVELY DISABLED. WORK AROUND IS TO MANUALLY LOCK ALL DOORS.  * INTERIOR LIGHTING - DOME LIGHTS (INTERIOR LIGHTING) WILL NOT TURN OFF UNTIL VEHICLE IS MOVING AT 10 MPH OR FASTER WHEN DOOR AJAR ISSUE OCCURS. VISIBILITY WHILE MANEUVERING AT LOW SPEEDS AT NIGHT IS IMPAIRED AND INCREASES POTENTIAL FOR ACCIDENTS IN AREAS SUCH AS PARKING LOTS. NO KNOWN WORKAROUND. ADDITIONALLY, WHEN REMOTELY LOCKING CAR, MARKER LIGHTS AND INTERIOR LIGHTS REMAIN ON, UNKNOWN IF EXCESSIVE BATTERY DRAIN MAY OCCUR.  * SECURITY SYSTEM - KEYLESS (TOUCH) LOCKING OF AUTOMOBILE DOES NOT WORK WHEN THIS ISSUE OCCURS. USING REMOTE LOCK ACTIVATES THE ALARM SYSTEM. THIS CAUSES RANDOM FALSE ALARM ACTIVATIONS. SECURITY SYSTEM CANNOT BE USED EFFECTIVELY. WORK AROUND IS TO KEEP CAR UNLOCKED.  DUE TO THE NUMBER KNOWN SYSTEMS AFFECTED BY OPEN OR CLOSED STATE OF THE CAR DOORS, IT IS POSSIBLE THAT OTHER SYSTEMS INCLUDING SAFETY SYSTEMS COULD BE AFFECTED BY INTERMITTENT DOOR AJAR SENSOR FAILURE WHILE THE VEHICLE IS IN USE.  *TR",
        "vin": "2LMDJ6JK8BB"
    }
]