[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "10/06/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A PROXIMITY STARTING SYSTEM. NO INSERTION OF A KEY IS NEEDED TO START THE CAR. THE CAR IS SUPPOSED TO RECOGNIZE THE ELECTRONIC KEY TO YOUR VEHICLE. AFTER SHOPPING I CAME OUT GOT INTO MY CAR AND PUSHED THE START BUTTON WITH MY KEY FOB IN MY POCKET. MY WIFE HAPPENED TO BE SITTING BESIDE ME IN THE CAR WITH A KEY FOB IN HER PURSE.  THE CAR WOULD NOT START AND A MESSAGE SAYING \"KEY NOT RECOGNIZED\". I TRIED MULTIPLE TIMES TO PUSH THE START BUTTON TO TRY TO START THE CAR. IT WOULD NOT START. THE KEY FOBS WOULD HOWEVER LOCK AND UNLOCK THE CAR WHICH MEANT THE CAR WAS IN FACT RECOGNIZING THEM BUT THE CAR WOULD NOT START. I CALLED MY SELLING DEALERSHIP FOR ADVICE ON HOW TO START THE CAR. THEY COULD OFFER NONE. THEY SAID ALL I COULD DO WOULD BE TO HAVE THE VEHICLE TOWED TO THEM FOR INSPECTION. L CALLED TO ARRANGE FOR THE TOW. BUT THEN WAITING FOR THE TOW TRUCK I TRIED ONE LAST TIME TO START THE CAR BY PUSHING THE START BUTTON. AMAZINGLY AND FOR NO REASON I COULD FIGURE OUT AS I HAD DONE NOTHING DIFFERENT THE CAR DID FINALLY START THAT TIME. I DOVE OVER TO THE DEALERSHIP. AFTER OVER TWO HOURS THEY COULD NOT FIND ANY PROBLEM WITH THE CAR THAT MIGHT HAVE CAUSED IT TO NOT RECOGNIZE MY KEY FOBS AND NOT START. THEY KEPT MY CAR OVERNIGHT BUT BY NOON STILL FINDING NO PROBLEM OR CURE TO IT THEY SAID I COULD COME AND PICK UP THE CAR. WHEN I GOT THERE THEY SAID THEY HAD CONTACTED FORD AND FORD HAD NO INFORMATION TO GIVE THEM ABOUT THE PROBLEM. I DID SOME RESEARCH MYSELF HOWEVER ON THE INTERNET AND FOUND A NUMBER OF COMPLAINTS ON FORD'S OWN WEBSITE IN THE \"FORUM\" SECTION SAYING OTHER CUSTOMERS HAD REPORTED THE VERY SAME \"KEY NOT RECOGNIZED\" AND NONE STARTING PROBLEMS WITH THEIR VEHICLES. FORD SEEMS TO BE STONEWALLING ON THIS ISSUE. AND WHILE A CAR NOT STARTING WHEN YOU NEED IT TO CAN BE A REAL INCONVENIENCE IT COULD ALSO BE A REAL SAFETY CONCERN UNDER THE RIGHT CIRCUMSTANCE.   *TR",
        "vin": "3FA6P0K91ER"
    }
]