[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/04/2014",
        "dateOfIncident": "10/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10652414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL 1500",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD 2 INCIDENTS WITH MY 02 GMC YUKON WHERE THE BRAKE LINES HAVE FAILED DUE TO EARLY AND UNEXPECTED/UNREASONABLE CORROSION WHERE THEY FAILED WITHOUT WARNING ALMOST CAUSED SERIOUS ACCIDENTS.  THE FIRST INCIDENT OCCURRED WITH ABOUT 76,000 MILES ON THE CAR AND I WAS DRIVING ON THE HIGHWAY AND APPLIED THE BRAKES AS I APPROACHED THE EXIT RAMP AND THE PEDAL WENT STRAIGHT TO THE FLOOR WITHOUT THE VEHICLE STOPPING. WITH MY FAMILY IN THE CAR I DRIFTED PAST THE EXIT AND APPROXIMATELY ANOTHER 1 MILE BEFORE FINALLY COMING TO A STOP ON THE SHOULDER. AFTER GETTING THE CAR TOWED TO A LOCAL MECHANIC, THEY INFORMED ME THAT THE REAR BRAKE LINES RUSTED THROUGH AND THIS WAS A COMMON PROBLEM THEY SEE ON GM VEHICLES. THEY WERE SURPRISED I WAS NOT IN A SERIOUS ACCIDENT AND I PAID $500 TO HAVE THE REPLACEMENT LINES FABRICATED.  ABOUT A YEAR LATER WITH ABOUT 85,000 MILES ON THE VEHICLE AND AGAIN WITHOUT WARNING AS MY WIFE WAS DRIVING MY CHILDREN ACROSS A BRIDGE AND ATTEMPTED TO BRAKE AND AGAIN THE PEDAL WENT STRAIGHT DOWN TO THE FLOOR NOT STOPPING THE VEHICLE AND SHE HELD DOWN THE HORN TO WARN PEDESTRIANS AND OTHER CARS. THE VEHICLE FINALLY STOPPED AFTER RUNNING 2 RED LIGHTS. THE MECHANIC INDICATED THAT ALL THE LINES COMING OUT OF THE MASTER CYLINDER/BOOSTER WERE RUSTED THROUGH AND BRAKE FLUID WAS POURING OUT. AGAIN HAVING TO FABRICATE AND REPLACE ALL THE LINES OUT OF THE MASTER CYLINDER WAS EXPENSIVE, THIS TIME COSTING $1,500.  THE NHTSA NEEDS TO DO A FULL INVESTIGATION OF THIS PROBLEM AS I HAVE HEARD MANY TIMES THAT THIS IS A FAULTY DESIGN AND EXTREMELY DANGEROUS REQUIRING A RECALL. I TAKE GOOD CARE OF MY CARS, HAVE THE UNDERCARRIAGE CLEANED FREQUENTLY AND ASK MY MECHANIC TO INSPECT EVERYTHING ON THE CAR ON A BI-ANNUAL BASIS AND THESE INCIDENTS HAPPEN WITHOUT WARNING.  I HOPE GM WILL REIMBURSE ALL THOSE LIKE ME WHO SPENT THOUSANDS FIXING THE VEHICLE AFTER A VERY DANGEROUS SITUATION.  *TR",
        "vin": "3GKFK16Z22G"
    }
]