[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650314,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5 SAV",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF A 2006 BMW X5, VIN: [XXX]. IN THE EARLY YEARS OF OWNERSHIP  THE PASSENGER SEAT OCCUPANCY DETECTION MAT WAS FAULTY AND WAS REPLACED.  THIS AUGUST THE AIRBAG LIGHT ON THE INSTRUMENT DISPLAY WENT ON AGAIN AND AS A RESULT MY VEHICLE FAILED THE MASSACHUSETTS STATE INSPECTION SAFETY INSPECTION.  IN SEPTEMBER OF THIS YEAR I BROUGHT MY X5 TO BMW TO HAVE BMW REVIEW THE AIRBAG ISSUE .  THE TECHNICIANS AT BMW DIAGNOSED THE PROBLEM AS A FAILING PASSENGER SEAT OCCUPANCY MAT.  THE TOTAL COST TO ME FOR REPLACEMENT OF THE FAILED PASSENGER SEAT  OCCUPANCY MAT WAS $1,460.89 + MA SALES TAX OF $39.15.   I RECENTLY FOUND THAT ON 11/18/2013 BMW ISSUED A RECALL RELATING THE FRONT PASSENGER SEAT OCCUPANT DETECTION MAT. THE RECALL CAMPAIGN FOR THE X5 PASSENGER SEAT OCCUPANCY DETECTION MAT IS IDENTIFIED AS #13V564000    I NEVER RECEIVED NOTIFICATION OF THIS SAFETY RECALL IN JANUARY OF 2014. I CALLED BMW THIS MORNING TO EXPLAIN MY ISSUE AND THEY ADVISED THAT THE NHTSA DID NOT INCLUDE THE VIN OF MY VEHICLE IN THE RECALL AND THEREFORE THEY WOULD NOT REIMBURSE ME.  MY RESPONSE WAS THAT PERHAPS THE REPLACEMENT PASSENGER SEAT OCCUPANCY MAT THAT FAILED MANY YEARS AGO THAT BMW INSTALLED AS A REPLACEMENT WHEN MY VEHICLE WAS UNDER WARRANTY WAS IN FACT A PART THAT WOULD HAVE BEEN INCLUDED IN THE RECENT RECALL.  THEY TOLD ME THAT I HAD A VERY GOOD POINT, AND THAT MAY BE THE CASE, BUT I WOULD HAVE TO WRITE TO NHTSA TO REQUEST THAT MY VEHICLE BE INCLUDED IN THE RECALL, OTHERWISE THEY WOULD NOT REIMBURSE ME.    SINCE THE PASSENGER SIDE OCCUPANCY MAT HAS FAILED TWICE IN THIS VEHICLE IT IS QUITE OBVIOUS TO ME THAT THERE IS AN ISSUE WITH THIS PART IN MY VEHICLE.  IT IS AN INTEGRAL PART OF THE SAFETY SYSTEM OF MY VEHICLE AND WITH THIS E-MAIL REQUEST THE CONSIDERATION AND ASSISTANCE OF NHTSA IN CONNECTION WITH THIS MATTER.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5UXFA13506L"
    }
]