[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/20/2003",
        "dateOfIncident": "12/20/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002997,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CADILLAC",
                "productModel": "DEVILLE",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS IN REGARDS TO THE FAILURE OF THE BRAKE SYSTEM ON A 1997 CADILLAC.  WHE THE SYSTEM FAILED THE VEHICLE WAS UNABLE TO PERFORM AN EMERGENCY STOP.  THERE WAS NO BACKUP SYSTEM UNDER THIS CONDITION.     AT A LITTLE LESS THAN 90,000 MILES THE BRAKES FAILED.  THERE WAS NO BACKUP.  WHEN THE PEDAL WAS DEPRESSED IT WOULD BLEED DOWN UNTIL IT BOTTOMED OUT.  IT WAS DURING THE 2002 HOLIDAY SEASON AND I WAS UNABLE TO GET THE CAR SERVICED.  I INVESTIGATED THE PROBLEM AND FOUND IT TO BE A BRAKE LINE IN THE LEFT REAR WHEEL WELL HAD A HOLE RUBBED IN IT.  IT WAS OBVIOUS THAT THIS PROBLEM WAS THE RESULT OF POOR DESIGN AND DUE TO THE POINT OF FAILURE CAUSED THE ENTIRE BRAKE SYSTEM TO FAIL.  I REPAIRED THE LINE WITH A SPLICE.    I CALLED THE CADILLAC DEALER IN SAN ANTONIO, TX AND WAS TOLD THERE WAS NO SERVICE BULLETIN, HOWEVER THE SERVICE MANAGER SAID THAT THEY HAD SEEN THIS PROBLEM IN THE PAST AND REFERRED ME TO CUSTOMER SERVICE.  CUSTOMER SERVICE SAID THERE WERE NOT ANY SERVICE BULLETINS RELATED TO THIS PROBLEM.    I HAVE PHOTOGRAPHS OF THE BRAKE LINE AREA WHERE THE HOLE WAS CREATED.  IF YOU ARE INTERESTED PLEASE LET ME KNOW.    THE PROBLEM APPEARS TO HAVE BEEN THE RESULT OF POOR DESIGN IN THE ROUTING OF THE REAR BRAKE LINE AND I WOULD SUSPECT THAT THE SAME PROBLEM WOULD OCCUR ON LIKE MODELS.  MY INTEREST IN REPORTING THIS INCIDENT IS TO HOPEFULLY PREVENT ACCIDENTS RESULTING FROM THIS FAILURE OCCURRING ON ANOTHER VEHICLE.      REGARDS,  DAVID MASON",
        "vin": "1G6KD52Y6VU"
    }
]