[
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "12/27/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669214,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING PURCHASED THE CAR ON 12/11/14 MY DAUGHTER DID NOT HAVE MUCH EXPERIENCE DRIVING THE CAR.... ON DECEMBER 27 SHE \"LOST CONTROL\" OF THE CAR, AND RAN INTO THE WALL ON A BUSY HIGHWAY IN CHICAGO. THE ACCIDENT OCCURRED ON A DRY EVENING, AND SHE EMPHATICALLY STATES THAT SHE DOES NOT KNOW HOW SHE LOST CONTROL OF THE CAR, AND THAT IT WAS PULLING TO THE LEFT. THE ONLY RATIONALE CONCLUSION WAS THAT SHE MIGHT HAVE HAD A TIRE BLOW OUT. THAT IS, UNTIL A FRIEND RECOMMENDED I CHECK THE WEB, AND CHECK IF OTHERS MAY HAVE BEEN OR ARE EXPERIENCING THE SAME THING.    ALTHOUGH I HAD DONE MY DUE DILIGENCE WHEN RESEARCHING THE CAR E.G. RECALLS, KNOWN PROBLEMS, ETC. PRIOR TO PURCHASING THIS CAR, I DID NOT CHECK SPECIFICS SUCH AS STEERING. LONG OF THE SHORT, TWO DAYS AFTER THE ACCIDENT AND WHEN I GOOGLED STEERING PROBLEMS, THIS SITE HTTP://WWW.CARCOMPLAINTS.COM/KIA/OPTIMA/2013/STEERING/STEERING.SHTML  WAS ONE OF THE FIRST TO SHOW UP. I WAS AMAZED TO FIND 35 COMPLAINTS IN REFERENCE TO THE SAME STEERING ISSUE.  AFTER READING THE COMPLAINTS I AM I CONVINCED THAT THIS STEERING ISSUE IS THE CONTRIBUTOR TO MY DAUGHTER'S ACCIDENT. IT IS THE ONLY LOGICAL EXPLANATION OTHER THAN A BLOW OUT.  I THINK THIS MAY BE A RESULT OF THE STEERING PROBLEMS ASSOCIATED WITH THE 2013 OPTIMAS.      I WONDER HOW MANY ACCIDENTS OR DEATHS IT IS GOING TO TAKE FOR KIA TO ADMIT SOMETHING IS NOT RIGHT AND DO THE RESPONSIBLE THING? IT SOUNDS AS THOUGH THERE NEEDS TO BE A MANUFACTURERS' RECALL BEFORE A FATAL ACCIDENT OCCURS, IF IT HASN'T ALREADY .... *JS",
        "vin": "5XXGM4A75DG"
    }
]