[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/20/2003",
        "dateOfIncident": "01/19/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003000,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LEAVING MY AUTO, I RETURNED TO FIND THE REAR WINDOW SHATTERED, BUT IN TACT/IN PLACE.  THERE NO SIGNS OF ANY IMPACT OR ATTEMPTED ENTRY.  THE POLICE WERE CALLED AND THEY SAID THEY COULD NOT FIND ANY EVIDENCE OF ANYTHING STRIKING THE WINDOW AND APPEARED IT MIGHT BE A FAULTY WINDOW.      UPON BRINGING IT TO THE DEALER'S SEVICE SHOP, THE MANAGER SAID HE WOULD NOTIFY HIS FORD REP OF THIS PROBLEM.  HE SAID NORMALLY THEY WOULD NOT DO ANYTHING BUT SINCE THE AUTO WAS SO NEW, HE WOULD TRY TO SEE WHAT HE COULD DO.      UPON INVESTIGATING IF THERE WAS A FORD RECALL OR SIMILAR REGARDING THIS PROBLEM, I CAME ACCROSS AT LEAST ONE OTHER OCCASSION WHERE THE WINDOW JUST SHATTERED AND WAS REPLACED BY FORD UNDER WARRANTY.  THE INDIVIDUAL SAID FORD CLAIMED IT WAS DUE TO WELDING IRREGULARITIES AND SUCH.      WHEN I WAS SPEAKING TO THE SERVICE MANAGER AT FORD, HE CLAIMED THAT THE 2003 FORD FOCUS REAR DEFROSTER WAS CHANGED AND THEY HAD GIVEN IT A HIGHER AMP TO MAKE IT HOTTER.  SINCE IT HAS BEEN ABOUT 6 DGREES OUTSIDE, IT COULD HAVE BEEN HOT AND SHATTERED WHEN COOLING QUICKLY - HE DID NOT KNOW AND WAS JUST SEARCHING FOR ANSWERS.    REGARDLESS, THE AUTO HAD 440 MILES ON IT AND WAS ONLY ABOUT 10 DAYS OLD WHEN THIS OCCURRED.  IT COULD HAVE BEEN SERIOUS IF THIS WINDOWED SHATTERED AND BLEW OUT WHILE DRIVING, POSSIBLY CAUSING HARM TO ANY PASSENGERS IN THE BACK - OR ANYWHERE FOR THAT MATTER.    I BELIEVE THIS NEEDS TO BE CHECKED OUT TO PREVENT ANY POSSIBLE HARM TO ANYONE.    THE AUTO IS A 2003 FORD FOCUS SE SEDAN.",
        "vin": "1FAFP34P73W"
    }
]