[
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": false,
        "dateComplaintFiled": "11/24/2014",
        "dateOfIncident": "03/28/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660714,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "530I",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2004 BMW 530I HAS BOTH THE SEATBELT AND AIRBAG LIGHT ON DISPLAY AT ALL TIMES ON MY DASHBOARD.   THESE LIGHTS ON ARE CAUSED BY A FAULTY FRONT PASSENGER SEAT OCCUPANT DETECTION MAT WHICH BMW HAS AN EXTENDED WARRANTY ON.      AFTER DROPPING MY CAR TO THE BMW DEALERSHIP TO GET THIS REPAIRED, I WAS INFORMED MY EXTENDED WARRANTY EXPIRED ROUGHLY 2 MONTHS PRIOR AND I CANNOT HAVE THIS WORK PERFORMED UNDER WARRANTY.  THEY CHARGED ME $140 FOR THE DIAGNOSTICS AND SAID I WOULD HAVE TO PAY $1050 OUT OF POCKET TO GET REPAIRED.      I IMMEDIATELY REACHED OUT TO BMW OF NORTH AMERICA AND INFORMED THEM OF MY SITUATION AS THIS OCCURRED   WHILE MY VEHICLE WAS STILL UNDER WARRANTY.  I WAS HOPING THEY COULD FIX MY CAR IN GOOD FAITH AS THIS IS A KNOWN ISSUE OR EVEN PROVIDE ME WITH A DISCOUNTED REPAIR.  UNFORTUNATELY TWO MONTHS WENT BY WITH NO RESPONSE.  WHEN I REACHED OUT AGAIN THEY SAID NO THIS IS NOT THEIR HEADACHE AND I AM RESPONSIBLE FOR ALL COSTS AND REPAIRS RELATED TO THIS.    THIS IS A SERIOUS MALFUNCTION WHICH I AM SURPRISED IS NOT CONSIDERED A RECALL.  IN THE SAFETY RECALL NOTICE IT  SPECIFICALLY STATES IF BOTH WARNING LAMPS ARE ILLUMINATED SIMULTANEOUSLY, BMW RECOMMENDS NOT TO USE THE FRONT PASSENGER SEAT UNTIL THE VEHICLE HAS BEEN SERVICED.  ALSO, THE SAFETY RECALL NOTICE SAYS THAT THE FRONT PASSENGER AIRBAGS WILL NOT DEPLOY EVEN IF A SUFFICIENTLY SEVERE ACCIDENT WOULD OCCUR AND OCCUPANT PROTECTION PROVIDED BY THE SYSTEM WILL NOT BE POSSIBLE.  OBVIOUSLY THIS IS A HUGE SAFETY ISSUE WHICH BMW NEEDS TO ADDRESS.  AN EXTENDED WARRANTY ON SUCH A SENSITIVE MATTER IS NOT SUFFICIENT AND A RECALL SHOULD BE ISSUED.  *TR",
        "vin": "WBANA735848"
    }
]