[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/20/2003",
        "dateOfIncident": "12/28/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003007,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "S10",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ARE THE OWNERS OF A 1995 CHEVY S10 LS VIN NUMBER [XXX].  WE HAVE HAD SEVERAL MINOR PROBLEMS AND A FEW MAJOR PROBLEMS WITH THE TRUCK IN THE THREE YEARS OF OWNERSHIP. THE MOST RECENT PROBLEM IS SERIOUS AND CAUSED A POTENTIALLY FATAL SITUATION, ALL WHICH HAVE MADE US UNHAPPY WITH THE TRUCK.    I APPROACHED A STOPLIGHT, WHERE OTHER VEHICLES WERE STOPPED AND I PROCEEDED TO SLOW DOWN. THAT'S WHEN I NOTICED THAT MY BRAKES WERE NOT RESPONDING AND THAT MY VEHICLE WAS NOT SLOWING DOWN. I CONTINUED TO APPLY THE BRAKE IN DISBELIEF BUT STILL MY TRUCK CAREENED ON. THIS ALL OCCURRED IN LESS THAN 5 SECONDS. BEFORE I KNEW IT I WAS GIVEN A CHOICE OF EITHER SLAMMING MY TRUCK INTO THE CAR IN FRONT OF ME AT 40MPH, OR TAKING MY CHANCES ON THE SIDEWALK, THAT TO MY BLESSING WAS EMPTY. DESPERATELY, I VEERED MY TRUCK TO THE RIGHT OVER THE SIDEWALK, OVER BLOCK BARRIERS ONTO A PARKING LOT PRAYING THAT THE IMPACT WOULD SLOW MY TRUCK DOWN. MY TRUCK FINALLY ROLLED TO A STOP.     UPON INSPECTION OF THE TRUCK, IT TURNS OUT THAT THE BRAKES FAILED BECAUSE A PLASTIC PART THAT CONNECTS A VACUUM LINE TO THE BRAKE BOOSTER BROKE. I AM SHOCKED AND OUTRAGED THAT SOMETHING LIKE THIS COULD HAPPEN. IF THIS PART FAILS AT ANY TIME, THERE ARE NO POWER BRAKES TO SLOW THE VEHICLE. ACCORDING TO THE OWNER''S MANUAL, THE PART IN QUESTION NEVER NEEDS SERVICING AND HAS NO REPLACEMENT INTERVAL. WHAT EVEN SCARIER IS THAT WE HAVE HAD OUR BRAKES SERVICED TWICE IN THE PAST TWO YEARS.   QUESTION TO GM AND OTHER  WHY DID THIS PART BREAK?  WHAT COULD WE HAVE DONE TO PREVENT THIS INCIDENT? HAVE THERE BEEN SIMILAR INCIDENTS OF THIS NATURE WITH OTHER GM TRUCKS? IS THIS A RECALL ITEM?    OVER THE COURSE OF OWNING OUR GM TRUCK WE HAVE HAD OTHER MECHANICAL FAILURES, THE FIRST WAS WHEN THE INSIDE REAR VIEW MIRROR FELL TO THE FLOOR AND NOW THIS''BRAKE FAILURE. WE HAVE BECOME MORE AND MORE DISSATISFIED WITH THIS GM TRUCK. IT HAS PROVEN TO BE UNRELIABLE AND UNSAFE.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GCCS19Z4S8"
    }
]