[
    {
        "components": "SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2015",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10682014,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS BEEN GOING THROUGH OIL SINCE THE CATALYTIC CONVERTER RECALL WAS DONE IN FALL OF 2013. FIRST NOTICED AROUND FEBRUARY OF 2014 WHEN OIL LIGHT CAME ON AND NO OIL IN ENGINE.  I COMPLAINED TO DEALER AND THEY FOUND NOTHING.  I KEPT COMPLAINING ON MY OIL CHANGE OR OTHER APPOINTMENTS BUT THEY FOUND NOTHING WRONG.  THE CAR WAS GOING THROUGH 2-3 COURTS EVERY 2-3 MONTHS, WITH \"BURN\" TIME GETTING CLOSER TOGETHER - EVENTUALLY CHECKED OIL EVERY 3 WEEKS BY SUMMER AND EVERY WEEK BY OCTOBER. WHEN THE CAR WOULD NOT RUN I EVENTUALLY BYPASSED THE DEALER AFTER NO SOLUTION AND COMPLAINED TO SUBARU.  I HAD A DIFFICULT TIME FINDING A DEALER WILLING TO TAKE THE CAR (SO DID SUBARU).  FEELING IT WAS A DEALER WORKMANSHIP ISSUE I PAID FOR THE WORK AND SUBARU REIMBURSED ME TO REPLACED THE HEAD GASKETS IN DECEMBER 2014 - STATING IT WAS OUT OF WARRANTTEE SO THAT IS HOW IT HAS TO BE DONE.  THE OTHER DAY (FEBRUARY 6, 2015) ENGINE LIGHT CAME ON AGAIN AND NO OIL WAS IN THE ENGINE - THIS IS 2 MONTHS AFTER WORK DONE.  THIS CAR HAS HAD ISSUES SINCE THE BEGINNING AND I FEEL AS A FIRST YEAR REDESIGNED MODEL IT IS A SUBARU DEFECT.  I HAVE HAD TO REPLACE THE BRAKES 3 TIMES IN A SHORT SPAN - FEW YEARS (3 MAYBE).  IT HAS NEVER HAD GOOD PICK-UP AND SINCE CATALYTIC CONVERTER RECALL WAS DONE THE GAS MILEAGE DROPPED - WAS 22/28 NOW 19/23.  THE DEALER WHO REPLACED HEAD GASKETS MADE A NOTATION ON MY BILL (WITHOUT TELLING ME DIRECTLY) THAT THE SWAY BARS NEED ATTENTION.  MY BROTHER HAS A 2007 FORESTER AND HAS HAD TO REPLACE ALL OF THESE ITEMS AS WELL WITHIN THE LAST FEW YEARS.  I NEEDS A RELIABLE VEHICLE TO EARN A LIVING.   *JS",
        "vin": "JF2SH64679H"
    }
]