[
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "01/22/2015",
        "dateOfIncident": "12/27/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 27 DECEMBER 2013, I RETURNED HOME FROM WORK SOMETIME BETWEEN 5-6PM.  I PARKED THE VEHICLE IN THE DRIVEWAY JUST AS I HAD EVERY DAY SINCE I HAVE OWNED THE VEHICLE.  I PUT THE VEHICLE IN PARK, AND EXITED THE VEHICLE AND WALKED TO THE PASSENGER SIDE TO RETRIEVE BAGS THAT I HAD TO TAKE INTO THE HOUSE. I OPENED THE PASSENGER SIDE DOOR, TOOK OUT THE BAGS, CLOSED THE DOOR, AND PRESSED THE LOCK BUTTON ON THE KEY FOB AS I WALKED INTO MY HOUSE.  I REMEMBER IT WAS A WINDY DAY AND AS I RECENTLY RESEARCHED, GUSTS WERE UP TO 27 MILES PER HOUR DURING THE TIME IN QUESTION.    APPROXIMATELY 45 MINUTES AFTER I WENT INTO THE HOUSE, THE NEIGHBOR WAS AT THE DOOR AND TOLD ME THAT MY TRUCK HAD ROLLED DOWN THE HILL.  IN PANIC AND DISBELIEF I RAN OUTSIDE TO SEE THAT MY TRUCK HAD ROLLED DOWN MY DRIVEWAY, BUT SINCE THE WHEELS WERE SLIGHTLY TURNED, IT STOPPED IN MY YARD AFTER RUNNING INTO THE MAILBOX.  I QUICKLY RAN DOWN TO THE VEHICLE AND TRIED TO OPEN THE DOOR BUT IT WAS LOCKED.  I PUT IN THE CODE AND UNLOCKED THE TRUCK.  I THEN RAN INTO THE HOUSE TO GET THE KEYS.  I HAD NOT BROUGHT THEM OUT THE FIRST TIME I RAN OUT.  WHEN I GOT BACK IN THE CAR, I NOTICED THAT THE GEAR SELECTOR IN THE DASHBOARD DID NOT HAVE THE ORANGE LINE IT USUALLY DOES WHEN IN PARK.  IT LOOKED LIKE A SMALLER LINE, ALMOST AS IF IT WAS SOMEHOW BETWEEN PARK AND REVERSE.    WHEN I ASSESSED THE DAMAGES THE TRUCK RAN INTO THE MAILBOX AND BUSTED THE DRIVER'S SIDE TAIL LIGHT.  T    THE NEXT DAY, I TOOK THE TRUCK TO THE DEALERSHIP.  THEY SAID THEY COULD NOT FIND ANYTHING WRONG WITH THE VEHICLE, AND STATED THAT THEY WOULD NOT PAY FOR THE VEHICLE DAMAGE EVEN THOUGH IT WAS STILL UNDER FACTORY WARRANTY.  THEY SUGGESTED A FILE A CLAIM WITH MY INSURANCE.  I FILED A CLAIM WITH FORD, BUT THEY STATED THAT MY INFORMATION DID NOT SUBSTANTIATE MY CLAIM OF A MANUFACTURING OR DESIGN DEFECT.  *TR",
        "vin": "1FTFW1ET0CF"
    }
]