[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/06/2015",
        "dateOfIncident": "07/13/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "MILAN",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 25% OF THE REAR PASSENGER-SIDE BRAKE LIGHTS ON MY CAR PERMANENTLY WENT OUT WHEN I FIRST DISCOVERED THIS PROBLEM IN JULY 2014.  DURING THE FOLLOWING MONTH, ADDITIONAL LED LIGHTS IN THE REAR LIGHT ASSEMBLY FAILED UNTIL, FINALLY, NONE OF THEM WOULD LIGHT UP.  THIS WAS OUTRAGEOUS IN THAT MY CAR, BOUGHT BRAND NEW IN AUGUST 2009 AND CONSISTENTLY HOUSED IN A GARAGE, WAS FEWER THAN 5 YEARS OLD AND HAD YET TO REACH THE 30,000-MILE MARK.  A LICENSED PENNSYLVANIA CAR INSPECTION STATION REPRESENTATIVE TOLD ME THAT MY CAR WOULD NOT PASS ITS SAFETY INSPECTION UNLESS THE REAR BRAKE LIGHT ASSEMBLY WAS REPLACED.  CONSEQUENTLY, I WAS FORCED TO DO SO; THE BILL CAME TO $445 FOR ITS REPLACEMENT.  BECAUSE THE LIGHT ASSEMBLY CONSISTS OF LED LIGHTS, THE ENTIRE ASSEMBLY SHOULD HAVE LASTED FOR THE LIFE OF THE AUTOMOBILE, IN MY OPINION.  OBVIOUSLY, THIS IS A GLARING SAFETY DEFECT SINCE ITS MALFUNCTION ALONE RESULTS IN A FAILURE TO PASS AN ANNUAL  PENNSYLVANIA AUTOMOBILE SAFETY INSPECTION.  NOT TO MENTION THAT ITS REPLACEMENT COST IS ASTONISHING.  I FEEL STRONGLY THAT FORD MOTOR COMPANY SHOULD ADDRESS THIS SITUATION SINCE OTHER MERCURY MILAN OWNERS, AS WELL AS OWNERS OF ITS TWINS -- THE FORD FUSION AND THE LINCOLN MKZ -- HAVE REPORTED ON THIS DATABASE NEARLY IDENTICAL SAFETY FAILURES.  OWNERS OF THESE VEHICLES SHOULD BE COMPENSATED FOR A SAFETY PROBLEM THAT IS REPEATEDLY REPORTED ON THIS WEBSITE.  FORD CERTAINLY CAN NO LONGER VALIDLY CLAIM THAT IT IS UNAWARE OF THIS SAFETY DEFECT; IT SHOULD ISSUE A RECALL ON ITS OWN AND FIX THIS DESIGN PROBLEM IMMEDIATELY.    *TR",
        "vin": "3MEHM0JA7AR"
    }
]