[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2015",
        "dateOfIncident": "02/20/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "FOLLOW UP TO COMPLAINT LISTED BELOW (BEGINNING WITH SUMMARY):  IT SHOULD BE NOTED THAT THIS INCIDENT DID NOT OCCUR IN HUMID OR RAINY CONDITIONS.  THIS INCIDENT DID NOT OCCUR WHILE TRAVELING AT HIGHWAY SPEED OR WIDE OPEN THROTTLE.  THIS INCIDENT OCCURRED WHILE STARTING FROM A COMPLETE STOP UNDER LIGHT ACCELERATION TURNING LEFT ACROSS TRAFFIC.  VEHICLE LOST ALL POWER AND WOULD NOT MOVE.  PUSHING THE GAS PEDAL DID INCREASE ENGINE RPM BUT VEHICLE WOULD NOT MOVE.  THE BEHAVIOR EXHIBITED BY THE VEHICLE SOUNDS VERY SIMILAR TO THE CONDENSATION PROBLEM I HAVE BEEN MADE AWARE OF WITH THE 3.5 V6 ECOBOOST.  HOWEVER NONE OF THE CIRCUMSTANCES FORD CLAIMS CAUSES THE ISSUE EXISTED.  THIS IS AN EXTREMELY DANGEROUS CONDITION.  WEATHER WAS APPROXIMATELY 15 DEGREES AND SUNNY.  I HAVE EXPERIENCED THE PROBLEM WHEN THE VEHICLE HAS BEEN COLD AND AFTER IT HAS BEEN RUNNING FOR A WHILE.      SUMMARY:  WHILE ATTEMPTING TO CROSS ONCOMING TRAFFIC LANES TO ACCESS INTERSTATE VEHICLE BEGAN TO MOVE THEN SUDDENLY LOST ALL POWER. RPM'S WENT UP TO 4000 RPM BUT VEHICLE WOULD NOT MOVE. VEHICLES WERE APPROACHING IN EXCESS OF 50MPH. I MANAGED TO BARELY AVOID BEING STRUCK BY ONCOMING TRAFFIC AND PULLED TO SIDE OF RAMP. VEHICLE THEN BEGAN TO MOVE AGAIN. TOOK VEHICLE IN FOR SERVICE. DEALERSHIP PERFORMED TWO FIXES INVOLVING SOME FORM OF AIR DAM. ON 02/24 VEHICLE DID THE SAME THING LUCKILY IN A PARKING LOT THIS TIME. THIS IS AN EXTREMELY DANGEROUS CONDITION WHICH LEAVES NO ERROR CODES SO FAR. I AM SEEING MANY SIMILAR COMPLAIN TS ONLINE. TAKING VEHICLE IN FOR SERVICE AGAIN ON 3/3/15 AS THE ISSUE OCCURRED AGAIN TODAY 3/2/15.   *TR",
        "vin": "1FTFW1ETXBF"
    }
]