[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ENTERING THE HIGHWAY AND MERGING INTO THE PASSING LANE TO PASS A SEMI TRUCK, CAR LOST ALL TRANSMISSION GEARS AND ENTERED \"TRANSMISSION FAULT MODE\" RESEMBLING A NEUTRAL TRANSMISSION SELECTION. THE CAR IMMEDIATELY DECELERATED TOWARDS A CLOSELY FOLLOWING SEMI TRUCK IN THE FAST LANE. THIS HAS OCCURRED TO ME, A FEW MONTHS PRIOR, AT AN INTERSECTION (FROM A STOP) IN WHICH I HAD TO PLACE THE TRANSMISSION IN PARK-THEN BACK TO DRIVE, WHICH SEEMED TO CALIBRATE THE COMPUTER IN SELECTING A GEAR (QUITE HARSHLY I MIGHT ADD) AND ALLOWED ME TO TRAVEL IN TRANSMISSION FAULT MODE UNTIL I REACHED HOME. IN THIS INSTANCE ON THE HIGHWAY, I ATTEMPTED PLACING THE TRANSMISSION IN NEUTRAL THEN BACK TO DRIVE, WHICH ONCE AGAIN APPEARED TO ALLOW MY TRANSMISSION TO ROUGHLY SELECT A GEAR AT A DECELERATING HIGHWAY SPEED AND SLOWLY REMOVE MY CAR OUT OF THE PASSING LANE OUT OF THE WAY OF FAST-MOVING TRAFFIC. UPON LEAVING THE HIGHWAY, I WAS STOPPED AT A STOP SIGN AND LEARNED THAT I HAD LOST ALL GEARS ONCE AGAIN. AFTER ROLLING SOME MANY FEET, IT ENGAGED INTO GEAR AND SLAMMED THROUGH MULTIPLE GEARS UNTIL I ARRIVED AT THE CAR DEALERSHIP, AT WHICH I HAD PURCHASED THE CAR. I LATER FOUND THAT THE CAR HAD LOST REVERSE CAPABILITIES AS WELL. THE DEALERSHIP SUBSEQUENTLY (4/3/15) REPLACED THE TRANSMISSION CONTROL MODULE (TCM) ON THE CAR FOR THE SECOND TIME AND UPDATED THE SOFTWARE. AFTER RECEIVING THE CAR, THE SAME SITUATION OCCURRED ON THE HIGHWAY ON 4/6/15. NOW I AM AWAITING THE DEALERSHIP'S COURSE OF ACTION. AM TOLD WARRANTY WILL ONLY COVER THE CLUTCH AND TCM. TRANSMISSION HAS BEEN DEFECTIVE SINCE I PURCHASED THE VEHICLE. HAVE SPOKE TO FORD CUSTOMER SERVICE REPRESENTATIVES AND HAVE BEEN TOLD THAT THE TWO EXTENDED WARRANTIES ARE ALL THEY ARE WILLING TO PROVIDE FOR TRANSMISSION RELATED ISSUES. I FEAR DRIVING THIS CAR, AS I HAVE NOW BEEN PLACED IN THREE SEPARATE INCIDENTS WHICH PUT MYSELF IN IMMEDIATE DANGER.   *TR",
        "vin": "1FADP3K24DL"
    }
]