[
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/22/2015",
        "dateOfIncident": "02/06/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689814,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE IN NOVEMBER FROM CHRYSLER STATING THAT THERE WAS A RECALL ON MY VEHICLE. RECALL #P57, AN ISSUE WITH THE IGNITION. THIS COULD CAUSE LOSE OF ELECTRICAL FEATURES WHILE DRIVING, INCLUDING LOSE OF POWER, STEERING, BRAKES, AND COULD INCREASE THE RISK OF CRASH. THE CATCH IS THERE IS NO PART AVAILABLE TO FIX THE PROBLEM. LUCKILY MY CAR DIDN'T CRASH, HOWEVER IT DID FAIL TO START. AFTER HAVING IT TOWED (80 MILES) TO MY LOCAL DEALERSHIP THEY DIAGNOSED THE PROBLEM AS THE RECALL. I HAVE SPOKEN WITH BOTH THE DEALERSHIP AND CHRYSLER AND THERE IS NOTHING ANYONE CAN DO TO HELP ME. MY CAR, THAT I TAKE VERY GOOD CARE AND KEEP ON TOP OF ALL MAINTENANCE, IS NOW A SITTING DUCK. NO ONE CAN GIVE ME ANY INFORMATION ON WHEN A PART MAY BE AVAILABLE AND NO ONE CAN HELP ME TO GET A CAR SO THAT I CAN GET TO AND FROM MY JOB AND LIVE MY DAILY LIFE.  I HAVE BEEN INFORMED REPEATEDLY THAT CHRYSLER  IS \"WORKING DILIGENTLY\" TO COME UP WITH A SOLUTION. TO ME IT SEEMS CRAZY THAT THEY CAN'T COME UP WITH A PART TO FIX AN IGNITION! THERE ARE IGNITIONS IN EVERY CAR! AT THIS POINT I CONSIDER THIS SITUATION GROSS NEGLIGENCE AND CHRYSLER COULD BE PUTTING SOMEWHERE AROUND 300,000 DRIVERS AT RISK OF DEATH BECAUSE THEY CANNOT AND WILL NOT FIX THIS PROBLEM. I DON'T LIVE VERY CLOSE TO MY WORK AND THERE IS NO PUBLIC TRANSPORTATION. MY CAR IS A NECESSITY IN MY LIFE AND CHRYSLER HAS TAKEN THAT AWAY FROM ME AND OFFERS ME NO SUPPORT. CORPORATE GIANTS NEED TO BE HELP ACCOUNTABLE FOR THEIR PRODUCT.   *TR",
        "vin": "1J8GR48K48C"
    }
]