[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "01/20/2003",
        "dateOfIncident": "05/23/2001",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10003016,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "VFR800",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I WANT TO FILE A COMPLAINT ABOUT STUCK/RACING THROTTLE/FUEL INJECTION PROBLEMS OCCURING ON 99-00' HONDA VFR INTERCEPTOR 800FI MOTORCYCLES.  I AM SURE THAT MY BIKE HAD THIS PROBLEM.  THIS PROBLEM ALMOST COST ME MY LIFE AND MADE ME GET INTO A SERIOUS ACCIDENT.  AFTER DOING FURTHER RESEARCH ACROSS THE INTERNET, I HAVE COME ACROSS TWO OTHER REPORTED INCIDENTS OF THIS PROBLEM.  ONE IS ALMOST EXACTLY THE SAME AS THE REPORT THAT I GAVE HONDA INSURANCE ADJUSTERS.  I HAVE CONTACTED HONDA AND THEY SENT TWO GENTLEMEN TO MY HOUSE TO INVESTIGATE MY REPORT.  I ORGINALLY THOUGHT IT WAS A STUCK THROTTLE, HOWEVER, AFTER LOOKING INTO THE INCIDENT FURTHER, I HAVE COME TO THE CONCLUSION THAT IT MUST BE SOMEWHERE IN THE FUEL INJECTION BECAUSE IN BOTH MINE, AND THE OTHER REPORTED PROBLEMS, THE THROTTLE INSPECTED OUT OK.  I WANT TO FILE THIS COMPLAINT BECAUSE I DO BELIEVE THAT THESE BIKES HAVE THE POTENTIAL TO CONTINUE TO DO THIS.  I BELIEVE THIS PROBLEM NEEDS TO BE ADDRESSED AND SO FAR HONDA HAS DONE NOTHING TO ADDRESS IT. I BELIEVE IT COULD BE A SERIOUS SAFETY PROBLEM, EVEN THOUGH THERE HAVEN'T BEEN A LOT OF REPORTED CASES YET.  HERE IS THE URL TO BOTH OF THE REPORTED FINDINGS I HAVE COME ACROSS SO FAR:     HTTP://WWW.CS.WISC.EDU/~LISTS/ARCHIVE/VFR/200004/MSG00553.HTML    HTTP://WWW.CS.WISC.EDU/~LISTS/ARCHIVE/VFR/200107/MSG01911.HTML    MY STORY IS ALMOST EXACTLY LIKE THE SECOND POSTED FINDING, HOWEVER, IT HAPPENED TO ME AT THE WRONG TIME AND I WASN'T ABLE TO REACT DUE TO THE CIRCUMSTANCES.  I WOULD APPRECIATE IF SOMEONE COULD CONTACT ME ON THIS MATTER.  I HONESTLY BELIEVE THAT THERE MAY BE LIVES AT RISK, ESPECIALLY AS THESE BIKES AGE.  I AM ALSO IN THE PROCESS OF CONTACTING THE MAN THAT WROTE THIS POSTING SO THAT I CAN SEE IF HIS BIKE HAS HAD THE PROBLEM SINCE.  I LOOK FORWARD TO HEARING FROM SOMEBODY SOON.",
        "vin": "JH2RC4603XM"
    }
]