[
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/26/2015",
        "dateOfIncident": "03/26/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702014,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR USED IN 2010 AND BY 2011 THE SEAT HAD LOCKED IN POSITION AND BROUGHT IT IN TO A NISSAN DEALERSHIP TO GET IT REPAIRED SINCE I BOUGHT THE EXTENDED WARRANTY. I WAS TOLD THAT THE PROBLEM WAS NOT COVERED IN THE WARRANTY BUT THEY WOULD FIX IT FOR $1300 AND I CHOSE AT THAT TIME NOT TO GET IT FIXED, NOT KNOWING THAT THERE WAS A DEFECT IN THE SEAT FRAME DESIGN BY NISSAN. UPON RESEARCH LATER, I FOUND OUT THAT YEAR MODEL AND MAKE HAD A DEFECTIVE SEAT FRAME AND IT WOULD EVENTUALLY BREAK ON ONE SIDE. SOMETIME IN 2013 IT SURE ENOUGH BROKE AND WHEN I WENT TO RENEW MY INSPECTION STICKER LAST WEEK I WAS TOLD THAT I WAS REJECTED BECAUSE OF THE SEAT MOVEMENT. I CALLED NISSAN CONSUMER AFFAIRS AND ASKED IF THEY COULD HELP ME OUT IN ANY WAY TO HELP FIX THE SEAT FRAME (WHICH IS NOW ESTIMATED AT OVER $1500 TO FIX) BECAUSE IT IS THEIR FAULTY DESIGN, AND WAS DENIED ANY ASSISTANCE WHAT SO EVER. SO NOW I HAVE A BROKEN SEAT AND AN OUT OF DATE INSPECTION STICKER AND NISSAN WILL NOT OFFER ME ANY ASSISTANCE FOR THE COST OF REPAIR AND DENIES ANY KNOWLEDGE OF ANY PROBLEMS WITH THE SEAT FRAME FOR THAT YEAR MODEL. THE MAN AT THE INSPECTION STICKER PLACE TOLD ME IT IS AN UNSAFE DRIVING CONDITION DRIVING LIKE IT IS WHICH IS WHY HE WOULD NOT GIVE ME THE INSPECTION STICKER BECAUSE WHEN HE APPLIES THE BREAKS, THE LEFT SIDE OF THE SEAT SLIDES FORWARD. HOW CAN A AUTOMOBILE DEALERSHIP AS BIG AS NISSAN DENY THIS AND NOT OFFER ANY HELP TO FIX THE PROBLEM IS BEYOND ME. I WANT TO TELL THIS TO ALL NISSAN OWNERS AND I WOULD NOT OWN ANOTHER NISSAN IF I GOT ONE FOR FREE. I DO NOT HAVE THE MONEY TO GET THE SEAT FRAME REPAIRED AND I USE THE VEHICLE EVERY DAY TO GO TO AND FROM WORK, I AM NOT SURE WHAT OTHER OPTIONS I HAVE OTHER THATN TO DRIVE UNSAFE AND WITH AN OUT OF DATE STICKER.  *TR",
        "vin": "JN8AZ08T36W"
    }
]