[
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2015",
        "dateOfIncident": "02/19/2015",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692914,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSAT BEGAN TO ACCELERATE UNDER NO PRESSURE TO PEDAL. PASSAT STARTED TO ACCELERATE FAIRLY SLOWLY BUT STEADILY AT FIRST, THEN IT INCREASED. IT WASN'T POSSIBLE TO DECELERATE/NO PRESSURE ON THE BRAKE PEDAL STOPPED THE ACCELERATION. IT BEGAN TO REACH AN UNSAFE SPEED THEN I BEGAN TO DOWNSHIFT AND TO APPLY THE BRAKE IN SEQUENCE TO SLOW THE PASSAT, THEN I TRIED TO SLOW THE VEHICLE TO COAST IT ONTO THE SHOULDER, BUT THE SPEED REMAINED TOO HIGH TO HALT THE CAR. HAVING NO OTHER WAY TO SLOW THE VEHICLE, I STARTED TO DOWNSHIFT AND TO APPLY EXTREME PRESSURE TO THE BREAKS, AND WAS ABLE TO SLOW THE VEHICLE ENOUGH AFTER SEVERAL MILES OF DOWNSHIFTING AND RIDING THE BREAKS TO REACH A POINT AT WHICH I COULD SHIFT THE CAR INTO NEUTRAL, THEN BEGAN COASTING IT UP A LONG DRIVEWAY WHILE THE ENGINE CONTINUED TO RACE AND REV. I THEN DROPPED THE CAR INTO NEUTRAL AND ENGAGED THE EMERGENCY BREAK, THEN FORCED THE TRANS INTO PARK AND SHUT THE PASSAT OFF. THE FRONT BREAKS WERE BOTH GLOWING, WITH THE DRIVER'S SIDE HAVING BURST INTO FLAMES AS A RESULT OF THE FRICTION AND HEAT FROM HAVING RIDDEN THEM FOR SEVERAL MILES. SHOP THAT EXAMINED THE PASSAT ASSESSED THAT THE THROTTLE BODY CONTROL MODULE HAD FAILED AND WASN'T COMMUNICATING WITH THE MAIN ON-BOARD COMPUTER, AND THAT THIS TYPE OF PROBLEM HAD BEEN SEEN BEFORE ON OTHER VOLKSWAGEN MODELS OF THE SAME ERA. TECHNICIAN INDICATED THAT THIS WAS THE THIRD TIME THAT HE'D SEEN THIS FAILURE. IT APPARENTLY USUALLY RESULTS IN THE CAR COMING TO A STOP ALTHOUGH THERE ARE OTHER CASES CUSTOMERS REPORTED THAT RESULTED IN THE UNCONTROLLED ACCELERATION THAT I EXPERIENCES. THE BREAKS AND OTHER INTERNAL COMPONENTS WERE SIGNIFICANTLY DAMAGED AS A RESULT OF THE ACCIDENT/THROTTLE BODY FAILURE, AND THE VEHICLE HAD TO BE SCRAPPED. SOMEONE SHOULD RESEARCH THIS FURTHER AS THIS IS A POTENTIALLY FATAL ISSUE. PLEASE CONTACT ME IF ANY FURTHER INFORMATION IS REQUIRED TO INVESTIGATE.  *TR",
        "vin": "WVWPD63B9XE"
    }
]