[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "03/21/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703914,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "RAV4",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY RAV4 NEW IN 2008.  OVER THE YEARS OCCASIONALLY WHEN BRAKING THE VEHICLE WOULD NOT SLOW DOWN LIKE IT SHOULD AND A REALIZED THAT MY FOOT WAS DEPRESSING BOTH THE BRAKE PEDAL AND THE ACCELERATOR PEDAL AT THE SAME TIME.  I DIDN'T LIKE IT VERY MUCH THAT THIS COULD OCCUR BUT NEVER DID ANYTHING ABOUT IT.  RECENTLY WHEN BRAKING AT A 4-WAY STOP SIGN IT HAPPENED AGAIN BUT THIS TIME IT CAUGHT ME OFF-GUARD AND I NEARLY BROADSIDED A VEHICLE THAT HAD JUST PULLED OUT FROM THE OTHER DIRECTION.  FORTUNATELY I REALIZED WHAT HAD HAPPENED AND WAS ABLE TO MOVE MY FOOT FROM THE ACCELERATOR IN TIME TO STOP.  THIS TIME IT SCARED ME SINCE I WAS SO CLOSE TO HITTING THE OTHER VEHICLE.  THIS TIME I WENT TO MY DEALERSHIP AND TOLD THEM ABOUT THE ISSUE BUT WAS TOLD I HAD TO CONTACT TOYOTA ABOUT THE ISSUE.  I DID THIS AND WAS TOLD TO HAVE THE VEHICLES COMPUTER UPDATED TO CORRECT THE PROBLEM.  I HAD THIS DONE BUT IT DOES NOT CORRECT THE ISSUE.  THE DEALERSHIP INFORMED ME THAT THE UPDATE IS DESIGNED TO NOT ALLOW THE ENGINE TO OVERPOWER THE BRAKES BUT IT WILL STILL ALLOW THE ENGINE TO PUT POWER TO THE WHEELS WHEN BRAKING.  I CONTACTED TOYOTA ABOUT THIS ISSUE AGAIN BUT WASN'T GIVEN ANY SATISFACTION AS TO HOW THIS ISSUE COULD BE CORRECTED.  I SPOKE WITH MY BROTHER WHO HAS A 2009 RAV4 AND SAYS HE HAS THE SAME PROBLEM WITH HIS VEHICLE.  THIS IS A SAFETY ISSUE AND IF THERE ARE 2 PEOPLE IN OUR FAMILY WITH THIS ISSUE, I'M SURE THERE ARE A LOT MORE PEOPLE OUT THERE WHO ALSO EXPERIENCE THE PROBLEM.  ISN'T THERE SOMETHING THAT CAN BE DONE ABOUT THIS PROBLEM??",
        "vin": "JTMBK31V386"
    }
]