[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "CENTURY",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD OUR 2005 BUICK LACROSSE FOR ABOUT SIX MONTHS NOW AND WANT TO REPORT THIS LIGHTING SAFETY CONCERN. THIS HEADLIGHT INCIDENT WITH OUR BUICK HAS ACTUALLY HAPPENED TO US, THREE TIMES SINCE MID APRIL.  THE FIRST TIME IT HAPPENED, WE WERE DRIVING ONE EVENING, SUDDENLY OUR LOW BEAM HEADLIGHTS WENT OFF.  THIS WAS VERY FRIGHTENING AS IT WAS A DARK STRETCH OF ROAD, WITH TRAFFIC.  I SLOWED AND FOUND A REASONABLE SAFE SPOT TO PULL OVER. I TRIED TURNING THE HEADLIGHT SWITCH IN SEVERAL POSITIONS WITH NO SUCCESS.  WE NORMALLY KEEP THE HEADLAMP SWITCH IN THE AUTO POSITION.  OUR LOW BEAM HEADLIGHTS STILL WERE NOT COMING ON.  I THEN FOUND I COUND TURN MY HIGH BEAMS ON, SO I DID TO ILLUMINATE THE ROAD AND BE ABLE TO DRIVE HOME.  DRIVING WITH ONLY HIGH BEAMS IS BOTH DANGEROUS AND ILLEGAL.  IT CAN BE BLINDING TO ON COMING TRAFFIC AND I COULD HAVE BEEN CITED IF I HAD BEEN PULLED OVER BY THE POLICE.   FROM WHERE MY LOW BEAMS WENT OUT, TO HOME WAS ABOUT 4.5 MILES.  RIGHT BEFORE PULLING IN AT HOME MY LOW BEAMS CAME BACK ON.  I TURNED OFF THE HIGH BEAMS AND STILL HAD THE LOW BEAMS.  QUITE UNUSUAL.   THEN WITHIN A 2 TO 3 WEEK STRETCH, MY LOW BEAM HEADLIGHTS WENT OUT TWICE AGAIN.  RIGHT AWAY, I TURNED ON MY HIGH BEAMS AND WITHIN 15 - 20 MINUTES, LOW BEAMS CAME BACK ON. WHILE I'M ABLE TO LIGHT UP THE ROAD USING THE HIGH BEAMS IF THIS HAPPENS AGAIN - IT STILL IS NOT A SAFE ALTERNATIVE.   THERE IS AN ISSUE.   I DON'T KNOW IF IT'S A MODULE PROBLEM, BAD WIRING, I JUST DON'T KNOW.  I DID FIND OUT ON THE INTERNET, OTHER SAME YEAR, MAKE AND MODEL DRIVERS HAVE EXPERIENCED THIS SAME ISSUE.     LIGHTS GOING OUT FOR NO REASON WHILE DRIVING AT NIGHT NEEDS TO BE ADDRESSED.   THANK YOU FOR RESEARCHING AND GETTING GM TO DO THE RIGHT THING AND HAVE THEM FIX THIS SAFETY ISSUE.",
        "vin": "2G4WD562051"
    }
]