[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/20/2015",
        "dateOfIncident": "07/17/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717514,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2009 MURANO HAS HAD AN ONGOING PROBLEM WITH THE PASSENGER SIDE AIRBAG. MY PASSENGER AIRBAG SHUTS OFF AND SHUTS DOWN THE WHOLE AIRBAG SYSTEM IN MY CAR. THE DEALERSHIP HAS EXPLAINED TO ME THAT WHEN THE AIRBAG LIGHTS ARE FLASHING THAT I HAVE NO AIRBAG PROTECTION. I HAVE BROUGHT MY VEHICLE BACK TO THE DEALER A COUPLE OF TIMES TO HAVE THEM LOOK AT IT. THEY SAID THAT THEY WERE ABLE TO TURN OFF THE FLASHING AIRBAG LIGHT EACH TIME BUT THEY SAID THAT THEY WOULDN'T BE ABLE TO DO IT ANYMORE. THEY TOLD ME THAT THERE IS A PROBLEM WITH THE PASSENGER SEAT SENSOR AND PASSENGER SIDE AIRBAG. IT DOES NOT RECOGNIZE THAT THERE IS SOMEONE SITTING IN THE SEAT AND DOES NOT ACTIVATE.  THEY SAID THAT I WOULD NEED TO REPLACE BOTH AT A COST OF $5000 AND THAT THERE WAS A PROBLEM WITH THE SENSOR AND THE AIRBAG. I CONTACTED NISSAN AND WAS TOLD THAT ITS NOT UNDER WARRANTY AND THAT THERE IS NOTHING THAT THEY COULD DO FOR ME. I WOULD JUST HAVE TO REPLACE IT.  I HAVE RESEARCHED OTHER PASSENGER SIDE AIRBAG PROBLEMS AND RECALLED AIRBAGS FOUND THAT EACH OF THE SITUATIONS WERE SIMILAR TO MINE. I PURCHASED THIS 2009 MURANO AFTER I WAS INVOLVED IN AN ACCIDENT WITH MY OTHER 2006 NISSAN MURANO. THE AIRBAGS IN THE 2006 MURANO WORKED AND MY FAMILY AND I WERE ABLE TO WALK AWAY WITH ONLY A FEW SCRATCHES BECAUSE THE AIRBAGS WORKED. NOW I HAVE A VEHICLE THAT MAY OR MAY NOT HAVE A WORKING AIRBAG SYSTEM. I WORRY EACH TIME I GET INTO THE VEHICLE. WILL MY AIRBAGS DEPLOY OR NOT? THE SITUATION NEEDS TO BE ADDRESSED. LISTENING AND READING ABOUT OTHER AIRBAG RECALLS MAKES ME BELIEVE THAT MY VEHICLE IS EXPERIENCING THE SAME PROBLEMS. WHAT DOES NISSAN WANT TO HAPPEN? SHOULD I END UP IN A COLLISION AND HAVE NO AIRBAGS ON THE PASSENGER SIDE AND SOMEONE DIES BEFORE THEY LOOK AT THIS AIRBAG SITUATION? THIS VEHICLE WITH THIS ONGOING PROBLEM IS NOT WORTH ITS FAIR MARKET VALUE I'M FACING A SIGNIFICANT LOSS AT NO FAULT OF MINE.",
        "vin": "JN8AZ18UX9W"
    }
]