[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2015",
        "dateOfIncident": "11/14/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713514,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOV 2014 AS I WAS DELIVERING MAIL IN MY RHD JEEP LIBERTY 06, MY HEAT WAS ON AND MY BLOWER FAN \"BLEW UP\", BLOWING BLACK SMOKE INTO THE JEEP FROM THE VENTS AND A BURNING SMELL CAME FROM THE DASH BOARD. I TOOK THE JEEP TO MY LOCAL GARAGE IN WHICH TIME THEY TORE THE DASH APART AND FOUND IT HAD IN FACT \"BLEW UP\". IT NOW ONLY RUNS ON ONE SPEED (HIGH). DURING THE NEXT FEW MONTHS (WINTER) EVERY TIME I RUN MY HEATER WITH THE FAN OR THE DEFROST MY DASH BOARD GOES HAYWIRE. MEANING GAUGES SHUT DOWN, ALL ALERT LIGHTS GO ON AND/OR FLASH AND ALL BEEPS, BUZZERS AND NOISES SOUND. IT CONTINUES UNTIL I TURN THE HEAT/DEFROST OFF. I TOOK IT BACK TO THE GARAGE ON NUMEROUS OCCASIONS IN WHICH THEY RAN THE SCANNER WITH 7 CODES COMING UP. AFTER A FEW HOURS OF SITTING IT WOULD JUST RESET ITSELF AND CODES WOULD DISAPPEAR. EVERYTIME IT RAINS NOW THE DASH BOARD DOES THE SAME THING. I HAVE HAD 2 GARAGES AND SEVERAL DIFFERENT MECHANICS LOOK AT IT AND CAN'T FIGURE OUT THE PROBLEM. ON APRIL 25 I CALLED CHRYSLER TO GET MY JEEP IN FOR THE N46 RECALL AND ASKED ABOUT THE ELECTRICAL ISSUE AND EXPLAINED THE SITUATION. I TOLD HER IT WAS A KNOWN PROBLEM IN THE JEEP LIBERTYS. HER RESPONSE TO ME WAS \"IN THE LAST 25 YRS I'VE WORKED HERE, I HAVE NEVER HEARD OF THIS PROBLEM.\" SO I SAID I'D LIKE IT LOOKED AT WHILE ITS THERE FOR THE RECALL ISSUE. HER RESPONSE AGAIN WAS \" YOU NEED TO TAKE IT BACK TO THE GARAGE THAT LOOKED AT IT THE FIRST TIME, AND YOU DO KNOW THAT WE AUTOMATICALLY CHARGE $98 AN HOUR FOR DIAGNOSTIC CHECKS.\" I WAS LOOKING OVER MY PAPER SENT IN THE MAIL TO ME ABOUT THE N46 RECALL TODAY AND FOUND AT THE BOTTOM OF THE PAPER IT READS............\"ASK YOUR DEALER ABOUT THE FOLLOWING NOTIFICATION. OUR RECORDS INDICATE THAT YOUR VEHICLE ALSO REQUIRES REPAIR FOR NOTIFICATION G03\" I GOOGLE SEARCHED JEEP LIBERTY 06 RECALL G03 AND FOUND.........THIS IS A BLOWER FAN ISSUE. AND CHRYSLER WON'T EVEN LOOK AT IT.  *TR",
        "vin": "1J4GL48K06W"
    }
]