[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "04/05/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 2012 FORD F350 6.7L  AND TOWING A 28 FOOT TRAVEL TRAILER.  WE WERE SOUTHBOUND ON INTERSTATE 5 IN ENCINITAS, CA WHEN ALL OF THE SUDDEN THE TRUCK POWERED DOWN AND AN ALERT APPEARED ON THE DASH: \"STOP SAFELY NOW\".  I HAD VIRTUALLY NO POWER DESPITE DEPRESSING THE GAS PEDAL.  I WAS FORCED TO THE RIGHT SHOULDER OF THE ROAD WHERE I AS ABLE TO PARK WITH ONLY INCHES SEPARATING MY VEHICLE/TRAILER AND THE FREEWAY TRAFFIC.  AS SOON AS I PLACED IT IN PARK, THE VEHICLE COMPLETELY SHUT DOWN.      MY WIFE AND TWO YOUNG CHILDREN WERE WITH ME AND FOUND MYSELF IN A HELPLESS AND DANGEROUS SITUATION.      I KNOW FROM READING OTHER POSTS THAT SOME WHO EXPERIENCED THE SAME EQUIPMENT FAILURE FOUND THEMSELVES UNABLE TO MOVE TO A SAFE LOCATION AND WERE LEFT STRANDED IN THE MIDDLE OF THE ROADWAY.    MY COMPLAINT STEMS FROM THE KNOWLEDGE THAT FORD IS AWARE AND HAS BEEN AWARE FOR SOMETIME OF THE ISSUE OF BAD EGT SENSORS WHICH WHAT WAS ULTIMATELY DIAGNOSED AND REPAIRED ON MY VEHICLE.  HOWEVER THERE ARE FOUR SUCH SENSORS AND FROM READING OTHER COMPLAINTS REPLACING ONLY ONE (WHICH IS ALL FORD WOULD DO UNDER WARRANTY) ONLY DELAYS THE INEVITABLE FAILURE OF ANOTHER OF THE REMAINING SENSORS.      I'M AWARE OF A RECENT RECALL OF AMBULANCES BY FORD FOR THE EXACT SAME REASON.  I ONLY SPECULATE THAT FORD SAW THE LIABILITY IN HAVING AN AMBULANCE STALL IN A PRECARIOUS SPOT WITH A PERSON IN NEED OF MEDICAL ATTENTION ON BOARD.    I FEEL MY EXPERIENCES AS WELL AS COUNTLESS OTHERS WOULD RISE TO THE LEVEL OF A SERIOUS SAFETY CONCERN AND ARE NO DIFFERENT THAN THAT OF THE AMBULANCES WHICH FORD HAS ACCEPTED RESPONSIBILITY FOR.     MY REQUEST IS THAT FORD TAKE RESPONSIBILITY FOR THIS KNOWN ISSUE AND AGREE TO REPLACE ALL SENSORS WITH WHEN ONE GOES BAD OR REPLACE ALL OF THEM REGARDLESS.    *TR",
        "vin": "1FT8W3BT8CE"
    }
]