[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2015",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731014,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "CHEROKEE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE LUNGES AFTER YOU STOP AS IF IT IS DOWN SHIFTING.  SOMETIMES IT BANGS AND JUMPS SUDDENLY WHEN TAKING OFF FROM A STOP.  THE TRANSMISSION SEEMS TO HAVE NOT DOWN SHIFTED AND IS IN TOO HIGH A GEAR CAUSING THE ENGINE TO PAUSE BEFORE SUDDENLY DOWNSHIFTING AND SUDDENLY ACCELERATING WHICH SOMETIMES IT TO ABRUPT AND YOU HAVE TO SLAM ON THE BRAKES TO KEEP FROM HITTING TRAFFIC.  WE HAVE HAD SEVERAL REPROGRAMS OF THE TRANSMISSION WITHOUT ANY RESOLUTION.  THE LAST CAUSED THE CAR TO SUDDENLY LUNGE AND JUMP OUT INTO TRAFFIC WHILE SITTING AT A STOP WITH THE BRAKE ON AND NO GAS APPLIED.  WE COULD HAVE CAUSED AN ACCIDENT...  THE MOTOR HAS STARTED LEAKING OIL FROM THE OIL FILTER AND COOLER ASSEMBLY ON TOP OF THE 3.2 LITER V6.  IT APPEARS IT HAS A BAD GASKET OR SEAL OR IT MAY BE CRACKED.  I SEE SEVERAL OTHER OWNERS COMPLAINING OF THIS BE CAUSE YOU CAN SMELL BURNING OIL, WE REMOVED THE TOP ENGINE COWL AND CARRY A FIRE EXTINGUISHER JUST IN CASE IT CATCHES FIRE.  IT APPEARS THAT YOU COULD EASILY LOSE MOST OF THE OIL AND SEIZE THE MOTOR NOT TO MENTION CATCH ON FIRE.  THE REAR HATCH CAMERA AND CONTROLS MALFUNCTION IN WET WEATHER.  THE CAMERA TURNS TO SNOW OR MOVING OBJECTS APPEAR FRAME BY FRAME AND NOT IN REAL TIME.  THE CONTROLS FAIL TO ALLOW GATE OPERATION.  I CONTACTED JEEP TODAY AND AM TAKING IT IN FOR THE OIL ISSUE AND WILL TRY TO GET THEM TO FIX THE TRANSMISSION AND REAR GATE ISSUES.  THIS IS A DANGER TO DRIVE WHEN IT CAN LAUNCH INTO TRAFFIC OR LEAK OIL CAUSING A FIRE OR SHORT OUT THE GATE FROM AN ELECTRICAL FIRE.  JEEP NEEDS TO GET THESE ISSUES ADDRESSED.",
        "vin": "1C4PJMDS2EW"
    }
]