[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2015",
        "dateOfIncident": "04/22/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "MALIBU",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MY 2011 CHEVY MALIBU IN APRIL OF 2012 WITH 56K MILES, IN APRIL OF 2013 WITH 70K+ MILES, MY TRANSMISSION FAILED AND I WAS INFORMED BY THE NEARBY CHEVY DEALERSHIP THAT IT REQUIRED A TOTAL REBUILD AND ALL PARTS NEEDED TO BE REPLACED. MY CAR WAS STILL UNDER THE WARRANTY AND THEREFORE, I DID NOT PAY FOR THE SERVICES. AROUND MAY 5 2014, I RECEIVED A RECALL NOTICE FOR ISSUES WITH THE ELECTRICAL SYSTEM/ ABS SYSTEM/ BODY CONTROL MODULE, ETC. I TOOK MY CAR BACK TO THE SAME SHOP FOR REPAIRS, IN WHICH MY CAR WAS KEPT FOR 30 DAYS & RETURNED. UPON RECEIVING MY CAR BACK I'VE NOTICED MY CAR HAVING ISSUES WITH THE ELECTRICAL SYSTEM SUCH AS THE HEADLIGHTS KEEPS GOING OUT WHEN THE BULB IS STILL GOOD. MY RADIO CONSTANTLY SHUTS OFF ON ITS OWN & RANDOMLY SWITCHES TO THE AUX. THE INTERIOR LIGHTING IS CONSTANTLY FLICKERING! NOT ONLY DO I HAVE ELECTRICAL MALFUNCTIONS, IT MAKES THIS ODD NOISE & THE BRAKES LOCK UP WHENEVER I SLOW DOWN TO AROUND 20MPH & OR TURNING A CORNER AND THIS ESC ICON APPEARS. I CONTACTED CHEVY & ASKED IF THERE ARE ANY RECALLS FOR THIS MATTER & I WAS TOLD NO, THAT MY CAR WAS FIXED FOR ALL RECALLS FOR MY MODEL. THIS ISSUE CONTINUES TO OCCUR TODAY. ON/ AROUND JUNE 19 2015 W/ 115000 MILES, MY CAR SUDDENLY STOPPED ACCELERATING IN THE MIDDLE OF I95 HWY & I COULD NOT PUT IT INTO ANY GEAR! I KNEW IT WAS MY TRANSMISSION. I HAD IT TOWED TO THE SAME SHOP AND WAS TOLD THAT I HAVE NO WARRANTY & I WOULD HAVE TO PAY $4,106.45 FOR A NEW TRANS! I HAVE BEEN SEEKING ASSISTANCE FOR THIS MATTER, ITS UNFAIR THAT I HAVE HAD THIS CAR FOR 3/4 YEARS AND ITS ON ITS 2ND TRANSMISSION!! I WAS QUOTED FOR THIS $ AMOUNT AND THEY HAVEN'T EVEN OPENED THE TRANS YET! I WAS THEN TOLD TO COME TO THE DEALERSHIP & THEY WOULD TRY TO GET ME A NEW CAR AND IT WAS A COMPLETE WASTE OF TIME. I WAS TOLD TO LET MY CAR GET REPOSSESSED BECAUSE IT WAS NO GOOD AND CANNOT BE FIXED! I LEFT IN TEARS!! UNPROFESSIONAL!!",
        "vin": "1G1ZC5EU3BF"
    }
]