[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2015",
        "dateOfIncident": "07/25/2015",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10745614,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DEPARTING MY HOME, AND DRIVING APPROXIMATELY 23 MILES, I HAD A BRIEF SMELL OF SOMETHING BURNING, HOWEVER, ALL THE WINDOWS WERE OPEN AND I WAS ON A HIGHWAY OF 12 LANES OF TRAFFIC, AND FELT IT COULD BE FROM ANY WHERE, NOT NECESSARILY MY VEHICLE.  MOMENTS LATER, I CAUGHT A FLASH IN MY RIGHT EYE, THAT DREW MY ATTENTION TO THE PASSENGER SIDE FLOOR BOARD, BUT WHEN I LOOKED I THOUGHT PERHAPS IT WAS A SUN REFLECTION.  DIRECTING MY ATTENTION BACK TO THE HIGHWAY, SECONDS LATER, I CAUGHT A SECOND FLASH AND THIS TIME WHEN LOOKING TO THE PASSENGER SIDE FLOOR BOARD, THERE WAS FLAMES INSIDE THE CAR NEAR THE GLOVE COMPARTMENT TOWARDS THE FLOOR AND DOOR, AND BLACK SMOKE.  I IMMEDIATELY GOT OFF THE HIGHWAY SAFELY, TURNED OFF THE CAR, EVACUATED WITH MY BELONGINGS, AS THE CAR BECAME TOTALLY ENGULFED IN FLAMES.  I IMMEDIATELY CALLED 911 AND ASSISTANCE ARRIVED TO INCLUDE THE STATE POLICE AND FIRE DEPARTMENT, AND TURNPIKE STAFF.  THE CAR WAS PICKED UP ON CAMERA BY THE TURNPIKE DISPATCHER ONCE I CALLED IN.  NOTE:  THIS VEHICLE HAD JUST BEEN SERVICED 35 DAYS PRIOR FROM THE VW DEALER WHERE PURCHASED 4 YEARS AGO! I HAVE NEVER RECEIVED A RECALL NOTICE AT ALL, AND HAVE A CAR FAX THAT WAS GIVEN TO ME WHEN PURCHASED THAT SHOWS NO PREVIOUS RECALL EITHER.  SOMETHING WENT SERIOUSLY WRONG ON 25 JUL 2015.  THIS COULD HAVE RESULTED IN MY MORE TRAGIC DAMAGE, TO INCLUDE MY LIFE, OTHER VEHICLES, AND POSSIBLY OTHER LIVES.",
        "vin": "3VWRF31Y87M"
    }
]