[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2015",
        "dateOfIncident": "07/06/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10743414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE MY VEHICLE FOR ABOUT 30 MILES, UPON ARRIVING HOME AND REMOVING MY CHILDREN FROM THE CAR I SMELT SOMETHING BURNING. I COULDN'T LOCATE WHERE THE SMELL WAS COMING FROM AND JUST DECIDED TO KEEP AN EYE ON IT. ON THE 21ST OF JULY AGAIN AFTER DRIVING A DECENT AMOUNT, MAYBE 25 MILES, AND REMOVING MY CHILDREN FROM THE CAR I SMELT BURNING. WHEN GOING TO THE PASSANGER SIDE OF MY VEHICLE THE SMELL WAS STRONGER, AT THAT TIME I NOTICED SMOKE COMING FROM MY REAR PASSANGER TIRE AREA. I HAVE TAKEN MY VEHICLE TO TWO SEPERATE MECHANICS, INCLUDING THE DEALERSHIP WHERE I PURCHASED MY CAR AND HAVE BEEN TOLD DIFFERENT THINGS AS TO WHAT EXACTLY IS WRONG. I ALSO HAPPEN TO BE 4 DAYS AWAY FROM MY WARRANTY EXPIRING AND HAVE A FEELING THAT MAY BE CAUSING THE DIFFERENCE IN DIAGNOSIS. I HAVE SPOKEN WITH CHRYSLER DIRECTLY AND ALSO HAVE BEEN TOLD THAT MY WARRANTY WILL NOT COVER ANYTHING IF THE DEALERSHIP DOES NOT FIGURE OUT THE ISSUE BY TUESDAY (THE 28TH AND LAST VALID DAY OF MY WARRANTY) EVEN THOUGH THE COMPLAINT AND DIAGNOSIS HAD BEEN MADE TODAY. I HAVE BEEN AWARE OF A RECALL ON OTHER 2012 DODGE JOURNEY'S BUT ACCORDING TO VARIOUS RECALL INFORMATION SITES MY VEHICLE DOES NOT FALL IN THE MANUFACTURING DATE RANGE WHICH I DO NOT BELIEVE SHOULD BE EXCLUDED SINCE IT IS HAVING THE SAME ISSUES AS WHAT THE RECALL WAS PUT OUT FOR. BETWEEN BOTH MECHANICS I HAVE BEEN TOLD BRAKE PADS NEED REPLACED, ROTORS NEED RESURFACED AND/OR REPLACED, AND ONE OF THE MECHANICS EXPRESSED THAT THERE WAS EITHER A CALIPER ISSUE OR BRAKE LINE ISSUE WHICH WOULD BE CAUSING THE BURNING AND SMOKING (MY VEHICLE IS ONLY 3 YEARS OLD AND ONLY HAS 24K MILES ON IT.) DODGE HAS REFUSED TO ACKNOWLEDGE THIS ISSUE WHICH IS COVERED BY MY WARRANTY AND THE WARRANTY WILL NOT PAY FOR THE REPLACEMENT UNLESS DODGE SAYS THE CALIPER/BRAKE LINE HAS AN ISSUE.",
        "vin": "3C49DCAB9CT"
    }
]