[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/20/2003",
        "dateOfIncident": "01/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "LESABRE",
                "productYear": "1977",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM TRYING TO GET BUICK TO ACT ON THE RECALL NHTSA CAMPAIGN ID NUMBER: 76V175000.  THEY CLAIM THAT THEY DON'T HAVE A RECORD OF IT.  THE PIN KEEPS COMING OUT OF MY TURN SIGNAL AND THE SWITCH WON'T WORK.  IT REALLY IS A SAFETY ISSUE.  HOW DO I GET THEM TO FIND THIS RECALL ON THEIR SYSTEM??  I SPOKE TO A MANAGER AT THE GM HOTLINE...AND SHE REFUSED TO DO ANYTHING (EVEN AFTER I SHOWED HER THE SERVICE BULLETIN ON YOUR WEB SITE...SHE SAID, UNLESS SHE CAN FIND IT ON THE GM SYSTEM, THEY CAN'T DO ANYTHING).  PLEASE HELP!  THANKS.  JIM  HERE IS THE INFO I'VE FOUND ON TEH SERVICE BULLETIN.  I HAVE A 77 BUICK LESABRE WITH THE EXACT SAME PROBLEM AS YOUR BULLETIN DESCRIBES BELOW:    COMPONENT: LIGHTING:SWITCH:BUTTON:RING:TURN SIGNAL LIGHTS   MANUFACTURER: GENERAL MOTORS CORP.     YEAR: 1977   MAKE: BUICK   MODEL: LESABRE   YEAR OF RECALL: '76   TYPE OF REPORT: VEHICLE   POTENTIAL NUMBER OF UNITS AFFECTED: 66632   SUMMARY:     GENERAL MOTOR CAMPAIGN NO (CHEVROLET) 77C02 (PONTIAC) 77-C-4 (BUICK) 77-C-5.POSSIBILITY THAT THE TURN SIGNAL OPERATING UNIT OR VEHICLES WITH TILT STEERINGCOLUMNS MAY NOT COMPLY WITH FEDERAL MOTOR VEHICLE SAFETY STANDARD NO. 108.THE TURN SIGNAL LEVER ACTUATOR PIVOT PIN WHICH MAY WORK OUT OF THE   PIVOT,RESULTING IN NOT BEING ABLE TO USE TURN SIGNAL TO ALERT OTHER DRIVERS OF YOURINTENTIONS TO CHANGE LANES OR TURN, CAUSING POSSIBLE VEHICLE CRASH.   (CORRECTBY INSPECTING AND INSTALLING A RETAINER TO PRECLUDE PIVOT PIN DISENGAGEMENT).PASSENGER VEHICLE",
        "vin": "4P69R7X1463"
    }
]