[
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/29/2015",
        "dateOfIncident": "11/27/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807314,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "CUBE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC STEERING COLUMN LOCK (ESCL) WAS MALFUNCTIONING, AS DIAGNOSED BY A NISSAN DEALER. THE CAR WAS PARKED ON THE SIDE OF THE ROAD, AND IT WOULD NOT START, NO ENGINE, OR INTO ACC MODE BECAUSE THE ESCL DID NOT SENSE THE BRAKE PEDAL BEING PRESSED OR THE WHEEL IN LOCKED POSITION. PUSHING THE BRAKE PEDAL TOO START THE CAR DID NOTHING, AND ENGINE START BUTTON DID NOT WORK BUT A SOLID AMBER KEY ICON ON THE DASH BOARD WOULD COME UP AND DISAPPEAR. THE CAR HAD TO BE TOWED TO THE DEALERSHIP. DID SOME RESEARCH, AND IT TURNS OUT THAT NISSAN HAD PROBLEMS W 2009 SAME ESCL PART = STEERING LOCK PART# ON MY UNIT - WE HAVE PHOTOS -487001FA0B MANUFACTURE DATE 09-30-09 THE SAME AS THE ONLY CUBE MODEL YEAR RECALLED.-  FROM 2009-2010 INCLUDING CUBE 2009 AND ALTIMA/MAXIMA 2010 WHICH SEEMED TO SHARE THE SAME ESCL PART USED MY CUBE 2010 WHICH IS NOT PART OF THE RECALL. DEALER WANTS OVER 800.00 TOO FIX A KNOW DEFECT. THERE ARE MANY RESOURCES ONLINE (FACEBOOK, YOUTUBE, WEB FORUMS) WHERE PEOPLE DRIVING MODELS OTHER THAN ALTIMA AND MAXIMA EXPERIENCE THE EXACT SAME PROBLEM, YET ALTIMA AND MAXIMA OWNERS GET WARRANTY EXTENSIONS AND EVERYONE ELSE GETS SADDLED WITH A $800 REPAIR BILL OR MORE. NISSAN SHOULD BE HELD ACCOUNTABLE FOR EVERY MODEL AFFECTED BY THIS PROBLEM, NOT JUST TWO MODELS AND JUST ONE MODEL YEAR WHEN THE 2010'S HAVE THE SAME ISSUE AND PART . OUR CUBE HAS 47,000 MILES -",
        "vin": "JN8AZ2KR7AT"
    }
]