[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/16/2016",
        "dateOfIncident": "01/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2012 FORD FOCUS. I BOUGHT THE CAR USED IN JANUARY 2015. IN THE FALL OF 2015 MY CAR BEGAN JOLTING EVERY TIME I PUT PRESSURE ON THE GAS, THIS WAS ALARMING. WHEN IT BECAME WORSE, I BOUGHT THE CAR TO A FORD DEALERSHIP, AND CAME TO FIND THAT THE TRANSMISSION WAS RECALLED. TO FIX THIS FORD HAD A STRICT PROTOCOL TO FIX THE TRANSMISSION IN A 3 STEP PROCESS. THE MECHANICS ARE ONLY TOLD TO DO STEP 1, AND THEN IF THE PROBLEM PERSISTS MONTHS AFTER THE REPAIR, CONTINUE WITH STEP 2 AND SO ON. THE TRANSMISSION STARTED JOLTING AGAIN A FEW MONTHS LATER, THIS TIME WORSE. I HAVE BEEN WAITING A MONTH FOR THE FORD DEALERSHIP TO GET THAT PART THAT WILL \"FIX\" MY PROBLEM, WHILE I WAS ASSURED THE PROBLEM WOULD NOT GET WORSE. IN THAT TIME A PIECE IN THE EXHAUST HAS ALSO BEEN RECALLED, NEITHER ONE OF MY WINDOWS IN THE FRONT TWO SEATS WILL GO DOWN, AND THE JOLTING HAS BECOME INCREDIBLY UNSAFE. THERE HAVE BEEN TWO OCCASIONS WHERE MY CAR HAS JUST COME TO A COMPLETELY ALARMING STOP WHILE DRIVING UP TO 20 MPH, ON A BUSY TWO LANE STREET. I TAKE THIS STREET EVERYDAY TO AND FROM WORK. THERE IS NO OTHER OPTION. I AVOID THE HIGHWAY COMPLETELY NOW. I FEEL COMPLETELY UNSAFE AND ON GUARD AT ALL TIMES WHILE I AM DRIVING THIS VEHICLE. BECAUSE OF MY EXPERIENCE WTH THIS CAR IN ONLY A YEAR I WILL NEVER PURCHASE A FORD VEHICLE EVER AGAIN. I REGRET EVER DRIVING IT OFF OF THE LOT. I AM ONLY 25 YEARS OLD, AND CAN'T AFFORD TO TRADE THIS IN RIGHT NOW, AND THAT IS ALL I WANT TO DO. IT IS NOT A NICE FEELING TO HAVE A PIT IN YOUR STOMACH EVERY TIME YOU BUCKLE YOUR SEATBELT.",
        "vin": "1FAHP3F27CL"
    }
]