[
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2015",
        "dateOfIncident": "12/17/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811214,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "3 DAYS AGO WITH THE CAR ALARM SOUNDING IN EARLY MORNING. I WENT OUTSIDE TO SEE WHAT HAD HAPPENED AND THERE WAS NOTHING THERE TO BE CONCERNED ABOUT. THEN A FEW MINUTES LATER THE CAR JUST STATED RANDOMLY HONKING IT HORN ON ITS OWN! NOW THIS IS ALL HAPPENING WHILE CAR WAS PARKED IN DRIVEWAY. I THOUGHT THAT MAYBE MAYBE IT WAS PART OF THE SECURITY ON THE CAR AND THEN IT STOPPED ABOUT 5 MINS LATER. WHILE STILL PARKED. LATER ON IN THE DAY I TOOK THE CAR OUT TO DO SOME THINGS WHEN IT STARTED RANDOMLY HONKING IT OWN HORN. THIS WAS ALL HAPPENING WHILE I WAS ON A MAJOR ROAD. THIS THEN CREATED A VERY DANGEROUS MOMENT BECAUSE I GOT DISTRACTED BECAUSE I COULDN'T FIGURE OUT WHY THE HELL MY CAR JUST STARTED RANDOMLY HONKING IT HORN AND IT WOULDN'T STOP FOR ABOUT 5 MINUTES. MULTIPLE PEOPLE STOPPED BECAUSE THEY THOUGHT I WAS HONKING AT THEM WHICH CAUSED THINGS TO GET VERY CRAZY. SO NOW I KNOW SOMETHING ISN'T RIGHT, SO I DECIDED TO TAKE THE CAR BACK HOME FOR EVERYONE'S SAFETY AND WELL BEING.SO NOW THE CAR IS BACK HOME AND THE RANDOM HONKING HAS STOPPED. WE ALL WENT TO BED, AND AT 12:00 PM THURSDAY NIGHT. IT HAPPENED AGAIN WHILE PARKED IN DRIVEWAY,IT WOULD BEEP AND BEEP AND THEN STOP AND BEEP AGAIN AND THEN IT WOULDN'T STOP BEEPING AND THEN IT WOULDN'T STOP. NOW I THEN GOT REALLY NERVOUS BECAUSE THIS JUST ISN'T SAFE AND IS ANNOYING FOR THE POOR NEIGHBORS TRYING TO SLEEP. SO LUCKILY ABOUT 10 MINS LATER THE HONKING HAD STOPPED. I WENT BACK TO SLEEP HOPING IT WOULDN'T CONTINUE TO HAPPEN. NOW ITS FRIDAY THERE HASN'T BEEN ANY HONKING FOR THE LAST FEW HOURS WHILE ITS BEEN PARKED IN DRIVEWAY ALL NIGHT. NOW THROUGH THE WHOLE FRIDAY NOTHING SEEMED TO HAPPEN UNTIL ABOUT 7:00 PM, IT HAPPENED AGAIN THE CAR STARTED BEEPING ITS HORN AND THIS TIME FOR ABOUT 10 MINS RANDOMLY DURING THAT TIME WHILE IT WAS PARKED. KNOWING THAT THIS WASN'T GOING TO STOP I TOOK OUT HORN FUSES FOR NOW,BUT NOW I HAVE NO HORN!",
        "vin": ""
    }
]