[
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/21/2003",
        "dateOfIncident": "01/19/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003085,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "SABLE",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MOST RECENT PROBLEMS ARE ELECTRICAL IN NATURE. FIRST, ALL OF THE PASSENGER POWER WINDOWS HAVE FAILED. THEY CAN ONLY BE CONTROLLED BY THE DRIVER SIDE PANEL. SECOND, EVEN THOUGH ALL OF THE DOORS ARE SECURELY CLOSED, THE INTERIOR DOME LIGHT WILL REMAIN ON BETWEEN 20 SECONDS AND SEVERAL HOURS. THERE WERE OCCASIONS WHEN THE LIGHT WOULD COME ON BY ITSELF WHILE I WAS DRIVING DOWN THE HIGHWAY TO WORK. AN AUDIBLE CLICKING NOISE COULD BE HEARD FROM UNDER THE DASH. THE CLICK IS SIMILAR TO THE SOUND MADE WHEN MANUALLY OPERATING THE SWITCH. THIRD, THIS STARTED ON SUNDAY, 01/19/03, THE HEADLIGHTS WILL TURN ON AND OFF BY THEMSELVES WHILE THE VEHICLE IS OFF AND THE HEADLIGHT SWITCH IS OFF. ADDITIONALLY, WITH THE CAR RUNNING AND THE DAYTIME LIGHTS ONLY, THE HIGHBEAM INDICATOR CAME ON. WHEN I TURNED THE HEADLIGHTS ON, THE INDICATOR WENT OFF. WHEN I TURNED THE HEADLIGHTS OFF, THE HIGHBEAM INDICATOR CAME BACK ON. THE HIGHBEAM INDICATOR EVENTUALLY TURNED OFF ON ITS OWN WITHIN 5 OR 10 MINUTES. PREVIOUS PROBLEMS HAVE INCLUDED FRONT END SUSPENSION RELATED FAILURES AND AN OIL PAN THAT SPRUNG A LEAK IN DECEMBER 2001 AT AROUND 78K MILES. THE OIL PAN SPRUNG ANOTHER LEAK IN DECEMBER 2002. THE SERVICE DEALER ATTRIBUTED THE LEAK TO THE SAME PROBLEM AND ANOTHER FAILURE WITH THE OIL PRESSURE SWITCH. I AGREED TO THE OIL PRESSURE SWITCH REPAIR AND TOLD THEM THAT IF THE OIL PAN GASKET FAILED A 2ND TIME (ORIGINAL CAUSE OF LEAK IN 2001), THAT IT WAS DUE TO POOR REPAIR WORK. THEY TIGHTENED THE BOLTS TO THE OIL PAN. THE WINTER WEATHER HAS HAMPERED MY EFFORTS TO CHECK FOR THE LEAK. ALTHOUGH I NO LONGER SMELL BURNING OIL.",
        "vin": "1MELM50U1VG"
    }
]