[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "05/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SPARK",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM MAY 2015 TO SEPT. 2015, MY VEHICLE HIGH-REVVED AND DIED ON THE HIGHWAY THREE TIMES... THE SAME THREE LIGHTS WOULD COME ON: TRACTION CONTROL, CHECK ENGINE, REDUCED ENGINE POWER. DUE TO THE TIMING OF INCIDENTS, AUTONATION REFUSED TO ACCEPT THE VEHICLE ALTHOUGH IT WAS WARRANTIED. I CALLED GM CORPORATE AND EXPLAINED THAT THIS WAS A DANGER TO THE SAFETY OF OTHERS AND JEOPARDIZED MY LIFE, AND THEY MADE ATTEMPTS TO REMEDY THE SITUATION AT HAND.. AUTONATION CALLED AND APOLOGIZED FOR THE LACK OF CUSTOMER SERVICE, BUT THEY DID NOT SCHEDULE AN APPOINTMENT TO FIND THE PROBLEM. ON A DAY OFF FROM WORK, I TOOK IT TO THE SAME AUTONATION TO HAVE THEM RUN DIAGNOSTICS, AND THE TURNED ME AWAY. THIS HAPPENED A DOCUMENT THREE TIMES. I TOOK IT TO ANOTHER CHEVY HOUSE, AND THEY ALSO REFUSED THE CAR. DRIVING IT ENDANGERED MY LIFE AS WELL AS OTHER DRIVERS. FAST FORWARD A COUPLE MONTHS, I FIND OUT THE THROTTLE BODY IS BAD, AND NO RECALL HAS BEEN PUT OUT. ON A SEPARATE OCCASION, CONDENSATION HAD BEGUN ON THE INTERIOR OF MY VEHICLE. UPON FURTHER INSPECTION, MY FLOORBOARDS WERE SOPPING WET, AND WATER BEGAN TO FILL THE CAB OF MY CAR. AUTONATION DID FIND THAT A HOSE HAD BEEN CUT AND HAD BEEN LEAKING FLUID THROUGHOUT THE CAB. TODAY, 2-9-16 AT APPX. 0426, MY VEHICLE BEGAN FILLING THE CAB WITH NOXIOUS FUMES AND SMOKING UPON PARKING FROM UNDERNEATH THE HOOD FOR NO OBVIOUS REASON. NO LIGHTS OR CHIMES INITIATED INSIDE THE VEHICLE. THIS VEHICLE COULD HAVE SET FIRE AT ANY MOMENT HAD I KEPT DRIVING. THIS VEHICLE IS VERY DANGEROUS TO MYSELF AND THOSE AROUND, AND NO ONE AT AUTONATION TAKES IT SERIOUSLY. I HOPE BY ADVANCING MY PROBLEMS WITH THE 2014 CHEVY SPARK WILL STEER POTENTIAL BUYERS THE OTHER WAY, AND I ALSO HOPE THAT GM WILL DO THE RIGHT THING AND BUY THE CAR BACK. WHEN A CAR DIES ON THE MOST DANGEROUS HIGHWAY IN TEXAS FOR NO REASON AND STARTS SMOKING, THERE IS OBVIOUSLY SOMETHING WRONG.",
        "vin": "KL8CF6S91EC"
    }
]