[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/06/2016",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824614,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SONATA",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD BECOME A FREQUENT OCCURRENCE THAT UPON TURNING THE STEERING WHEEL WHETHER AT HIGH, LOW OR EVEN NO SPEED THAT YOU WOULD HEAR A CLICKING/CLUNKING NOISE. THIS WAS ANNOYING, BUT THEN AT HIGH SPEEDS (INTERSTATE DRIVING) WHEN BRAKING THERE BEGAN TO BE AN OCCASIONAL CONSIDERABLE VIBRATING THAT WENT THROUGH THE STEERING WHEEL. I ORIGINALLY THOUGHT IT MIGHT BE MY ROTORS CAUSING THE VIBRATING WHEN BRAKING AND THOUGHT THE CLICKING NOISE WAS FROM A WEAR IN MY AXLE ROD WHICH A MECHANIC HAD PREVIOUSLY MENTIONED WOULD CAUSE CLICKING NOISE WHEN TURNING (AND DIDN'T NEED IMMEDIATE CARE). HOWEVER WHEN I TOOK MY CAR IN FOR THE 132 AND 136 RECALLS THE HYUNDAI SERVICE TECH IMMEDIATELY KNEW IT WAS THE STEERING COUPLER BY TURNING MY WHEEL BECAUSE HE SEES IT SO OFTEN. HE EVEN HAD EXAMPLES PINNED UP ON THEIR BOARD TO EXPLAIN IT. HE EXPLAINED THE SAFETY RISK OF NOT GETTING IT FIXED AS IT COULD CAUSE SHAKING OF THE WHOLE STEERING COLUMN (ALREADY WAS), LOOSENESS IN THE STEERING MAKING IT LESS RESPONSIVE TO TURNS, AND COULD EVEN CAUSE THE STEERING WHEEL NOT TO RESPOND TO A SUDDEN TURN INCREASING THE RISK OF A CRASH. I OF COURSE WENT AHEAD AND HAD IT REPAIRED, SINCE MY 3 KIDS RIDE IN IT EVERY DAY. DURING MY WAIT IN THE LOBBY I GOOGLED THE ISSUE TO SEE IF THE $266 I WAS BEING CHARGED WAS REASONABLE (IT WAS) BUT I FOUND SO MANY POSTS ABOUT THIS ISSUE AND SOME PEOPLE SEEMED ABLE TO HAVE THE REPAIR COST COVERED EVEN WHEN OUTSIDE OF THEIR WARRANTY, SO I CALLED HYUNDAI ASKING FOR A REFUND OF THE COST. THEY SAID SINCE MY CAR HAD OVER 60,000 MILES THEY COULDN'T HELP ME WITH ANY COMPENSATION. I DO HAVE OVER 100,000 MILES ON MY CAR, BUT CONSIDERING THE WIDESPREAD ISSUE WITH THIS PART AND THE SAFETY CONCERN I BELIEVE HYUNDAI SHOULD TAKE RESPONSIBILITY. THE MECHANIC HAD REASSURED ME THE REPLACEMENT PART IS IMPROVED, WHICH ALSO SHOWS HYUNDAI KNOWS ITS A PROBLEM. (DATE WILL BE ESTIMATE OF HIGHWAY VIBRATING)",
        "vin": "5NPEB4AC6BH"
    }
]