[
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/30/2016",
        "dateOfIncident": "04/29/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "SEQUOIA",
                "productYear": "2004",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF THIS VEHICLE, IT CURRENTLY HAS 155,600 MILES ON IT.  I HAVE BEEN VERY HAPPY WITH TOYOTA AND THIS VEHICLE UNTIL MY RECENT INCIDENTS INVOLVING INABILITY TO STOP WHILE AT SLOW SPEEDS, FOLLOWED BY A LOUD NOISE AND SHAKING AND THREE LIGHTS ILLUMINATE WHEN THIS OCCURS: BRAKE, VSC, AND TRAC CONTROL.  AFTER READING THE MANY REPORTS, I REALIZE THAT THIS IS QUITE COMMON AND AM UPSET THAT TOYOTA HAS DONE NOTHING ABOUT IT!  I HAD MY CAR TOWED TO THE DEALER AFTER THE FIRST INCIDENT AS IT WAS SO FRIGHTENING THAT I WOULD NOT DRIVE IT.  THE SENSORS WERE NO LONGER ON AND TOYOTA TOLD ME THERE WAS NOTHING WRONG (MY FRONT BRAKES AND ROTORS WERE REPLACED BY THEM A FEW MONTHS PRIOR).  IT HAPPENED AGAIN A FEW WEEKS LATER, THIS TIME I TURNED THE CAR OFF AND BACK ON AND GOT THE LIGHTS TO GO OFF, THEN I DROVE IT DIRECTLY TO MY MECHANIC.  HE FOUND THREE ERROR CODES ASSOCIATED WITH THE ABS SYSTEM.  HE SAID IT'S EXPENSIVE TO REPLACE SO HE RESET THE SYSTEM AND WE DECIDED TO SEE IF THAT WORKS.  NOW, A WEEK OR SO AFTER THE RESET, IT HAPPENED TO ME AGAIN IN TRAFFIC.  AFTER READING ALL OF THE OTHER VERY SIMILAR REPORTS, I NO LONGER FEEL SAFE TO DRIVE MY CAR!  PLEASE MAKE TOYOTA BE RESPONSIBLE FOR THEIR NEGLIGENCE TO THEIR CUSTOMER'S SAFETY!  I FOUND REPORTS ON THIS DATING BACK TO 2004 AND I KNOW THERE WAS A RECALL DONE ON THE 2003 MODELS.",
        "vin": "5TDZT38A84S"
    }
]