[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2016",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855214,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE 2ND OWNER OF THIS CAR , AND I HAVE LOVED IT UNTIL THE DAY THE ACCELERATOR    DIDN'T WORK. I WAS DRIVING DOWN A MOUNTAIN, NOT USING THE ACCELERATOR UNTIL I REACHED THE BOTTOM OF THE HILL.  WHEN I TRIED TO ACCELERATE THE PEDAL WOULD NOT MOVE.  I COASTED INTO THE NEAREST TURNOFF.  THE CAR WAS RUNNING , I PUT IT INTO\" PARK\", WHILE STILL RUNNING I CHECKED TO SEE IF THERE WAS SOMETHING (FLOORMATS) BLOCKING THE PEDAL.  THERE WAS NOTHING.  I TRIED MASHING IT AS HARD AS I COULD, NO MOVEMENT.  I TURNED THE ENGINE OFF,  WAITED A FEW MINUTES AND RESTARTED.  THE PEDAL WAS OK,  ACCELERATED JUST FINE.  I BELIEVE I REBOOTED THE COMPUTER.  I CAREFULLY DROVE TO MY MECHANIC, HE CHECKED THE \"PLATES\" AND OTHER POSSIBLE PROBLEMS AND COULD FIND NOTHING WRONG.   I CALLED  TOYOTA CUSTOMER SERVICE , THEY ADVISED TAKING IT TO THE NEAREST DEALER.  I WAS TOLD IT WAS NOT ON THE RECALL LIST  BUT I COULD BRING IT IN TO BE CHECKED.  I WAS AFRAID TO DRIVE THE CAR THAT DISTANCE OVER 200 MILES ROUNDTRIP.  I LATER RECEIVED A SMALL CHECK FROM \"TOYOTA ECONOMIC LOSS SETTLEMENT ADMINISTRATOR \" FOR A CLASS ACTION LAWSUIT SETTLEMENT.  I DID NOT CASH IT.  I WAS ADVISED BY MY INSURANCE COMPANY NOT TO DRIVE THE CAR.  I WOULD LIKE TO SELL IT BUT ETHICALLY CAN NOT BECAUSE I DON'T WANT SOMEBODY KILLED OR INJURED IN IT.  I HAVE TRIED SEVERAL TIMES AT THE DEALERSHIP TO FIND A SOLUTION. BUT THEY CLAIM THIS PROBLEM COULDN'T HAPPEN AND WERE NOT HELPFUL.  IT COULD BE SOLD TO A JUNK YARD AT A LOSS BUT AGAIN, IT COULD BE SOLD FROM THERE  AND DRIVEN.  ANY ADVICE?",
        "vin": "4T1BG22K21U"
    }
]