[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "03/17/2016",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851914,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "300E",
                "productYear": "1993",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN AN ARDENT SUPPORTER OF THE MERCEDES-BENZ LINE FOR MANY YEARS AND MODELS. CURRENTLY I OWN A 1993 300SE AND MY \"SUMMER CAR,\" A 1978 450SL. BOTH OF MY CARS ARE MAINTAINED TO THE HIGHEST OF STANDARDS, IT IS NOT A EXAGGERATION TO SAY THAT YOU COULD EAT OFF THE ENGINE COMPARTMENT OF EITHER CAR. WHICH IS WHY I AM EXTREMELY DISAPPOINTED IN THE FOLLOWING CHAIN OF EVENTS:    PROBLEM: 1993 MERCEDES BENZ 300SE ENGINE WIRING HARNESS AND THROTTLE ACTUATOR WIRING .     THE WIRE INSULATION USED ON THE ENGINE WIRING HARNESS AND THE THROTTLE ACTUATOR IN MY CAR HAS BADLY DEGRADED, AND IS CRUMBLING! THIS CAUSES SHORTS IN THE ELECTRONICS OF THE VEHICLE AND PROBLEMS WITH THE ELECTRIC THROTTLE SYSTEM. I HAVE RESEARCHED THIS SITUATION ACROSS THE UNITED STATES (VIA THE INTERNET) AND I HAVE FOUND WEB FORUMS THAT ARE FULL OF THE SAME COMPLAINTS. WHAT IS CLEAR IS THAT FROM 1991-1997 MERCEDES BENZ USED A BIO-DEGRADABLE INSULATION ON THE WIRING OF THESE VEHICLES. IT WAS SUPPOSED TO BE ENVIRONMENTALLY FRIENDLY BUT IT DIDNT STAND UP TO THE HEAT OF THE ENGINE BAY. EVERY ONE OF THESE CARS (91-97) WILL EVENTUALLY HAVE THE SAME PROBLEMS WITH THERE ENGINE WIRING HARNESS DUE TO THIS \"DESIGN FLAW\" BUILT INTO THESE CAR'S. NOTHING HAS DONE BY MERCEDES TO CORRECT THIS PROBLEM EXCEPT TO OFFER TO SELL ME A NEW WIRING HARNESS FOR $1000 DOLLARS!!!.. THIS VERY DANGEROUS PROBLEM NEEDS TO BE A MANUFACTURERS RECALL BY MERCEDES BEFORE SOMEBODY'S THROTTLE GETS STUCK AND THEY GET HURT/KILLED, OR BEFORE THEIR CAR AND THEY CATCH ON FIRE.",
        "vin": "WDBGA32E6PA"
    }
]