[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2016",
        "dateOfIncident": "04/23/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAD APPROX 2400 AT THE TIME OF INCIDENT. MY WIFE AND I WERE DRIVING THE CAR DOWN A STEEP GRADE ON 4/23/16 THE CAR CHIMED 4 0R 5 TIMES . I ASKED MY WIFE IF SHE KNEW WHAT THE SOUND WAS AND SHE SAID NO. ABOUT 5 TO 10 SECONDS LATER I TOLD MY WIFE THAT THE CAR WAS NOT RUNNING. AND I LOOKED AT THE DASH AND IT WAS BLANK. I QUICKLY PUT THE CAR IN NEUTRAL AND STARTED THE CAR. IT TURNED ON. I CONTINUED DRIVING ABOUT 300 MILES AFTER THIS INCIDENT. I BROUGHT THE CAR TO MADISON FORD IN OHIO TO BE LOOKED AT. THEY COULDNT FIND ANY CODES. THEY SENT ME HOME WITH THE CAR. THEY CALLED ME BACK ON TUES AND SAID BRING THE CAR BACK . THIS TIME THEY FOUND 6 CODES. BUT TO MY KNOWLEDGE NOTHING STATING THE PROBLEM. THEY DROVE THE CAR 60 MILES OR SO AND SAID THE CAR WAS FINE. I CALLED CLASSIC FORD IN MENTOR OH AND TALKED TO THE SERVICE ADVISOR AND INFORMED HIM I WAS BRINGING THE CAR THERE TO BE SERVICED. THE ADVISOR SAID HE WOULDNT BE WORKING 4/29 AND HE WOULD INFORM THE SERVICE MGR OF THE PROBLEM. ICALLED FRIDAY AND SPOKE TO MARK THE MGR. HE SAID HE TALKED TO THE PEOPLE AT MADISON FORD . HE TOLD ME TO BRING THE CAR IN MONDAY MAY 2 BUT WE ARE GOING TO DO THE SAME THING AND IF WE CANT FIND ANYTHING THEN THERES NOTHING WE CAN DO FOR YOU. WELL I ASKED HIM IF MADISON TOLD HIM THE CAR SHUT DOWN GOING DOWN A HILL AND HIS REPLY WAS  UH NO. TODAY MAY 1 I STARTED THE CAR AND LET IT RUN FOR 3 MINS AND WITH MY WIFE IN THE CAR PULLED DOWN THE DRIVEWAY AND IT SHUT OFF AGAIN. NO CHECK ENGINE WARNING OR ANYTHING. AFTER THE FIRST INCIDENT MY WIFE SAID I WOULDVE BEEN KILLED BECAUSE I WOULDNT HAVE KNOWN TO DO WHAT YOU DID. THESE ARE SERIOUS LIFE THREATENING ISSUES AND MY WIFE AND DO NOT FEEL SAFE IN THIS CAR. ESPECIALLY WHEN THEY TELL ME THERES NOTHING WRONG WITH THIS CAR.",
        "vin": "3FA6POH70GR"
    }
]