[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/21/2016",
        "dateOfIncident": "03/14/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "JOURNEY",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I WILL DESCRIBE THE 'PROBLEM' TO THE BEST OF MY ABILITY: AT COMPLETELY RANDOM TIMES IF THE CAR HASN'T WARMED UP EXTENSIVELY IT LOSES POWER AND THE FEELING IS AS IF YOU HAVE BEEN REAR-ENDED BY ANOTHER CAR. YOUR FOOT IS STILL ON THE GAS AND THE CAR DOESN'T REV IT JUST HAS NOTHING. I WAS ALMOST HIT MANY TIMES. I ACTUALLY HAD TO PULL OUT OF TRAFFIC AND PUT MY FLASHERS ON TO LET IT WARM UP ANOTHER 7-10 MINUTES. THIS SEEMED TO SOLVE IT, YET I STILL ASKED MANY PEOPLE IF THEY THOUGHT THIS WAS COMMON WITH SUCH A NEW VEHICLE.. I BROUGHT IT IN ON MARCH 14 AT 7PM.  BY 9 AM THE NEXT MORNING I GOT A CALL FROM THE DEALERSHIP AND THEY HAD FOUND NOTHING WRONG WITH MY CAR? THERE WERE 'NO CODES AND NO WARNING LIGHTS, SO THEY COULDN'T FIX WHAT THEY DIDN'T SEE.' I PICKED UP THE VEHICLE AND DROVE HOME. 2 DAYS LATER I DROVE A MILE FROM MY HOUSE TO CVS PHARMACY AND HAD 'THE PROBLEM' OCCUR WHILE I WAS GOING ABOUT 45 MILES PER HOUR. AGAIN, I WAS ALMOST HIT BY A CAR BEHIND ME BECAUSE THE CAR IMMEDIATELY STOPS WITH NO WARNING, NO BRAKING, ETC... IT IS THE SCARIEST FEELING! IT WAS COMPLETELY ODD TO ME BECAUSE IT WAS NOT COLD THIS DAY. I LOOKED THE TEMP GAUGE IN THE CAR AND IT WAS 53 DEGREES. MY HUSBAND TOLD ME TO NOT DRIVE IT THE REST OF THE DAY. WHEN HE GOT HOME HE FOLLOWED ME TO THE DEALERSHIP. THEY HAD THE CAR OVER A MONTH AND FINALLY CALLED ME. THEY CLAIM IT WAS A LOOSE WIRE, BUT GAVE ME SUCH VAGUE INFO..  I TALKED TO THE SERVICE MANAGER AND HE STILL SAID THEY DIDN'T KNOW 100% ACCURACY WHAT WAS WRONG WITH THIS CAR. HE SAID HE WOULD NOT DEEM IT 100% SAFE. I CHOSE TO TURN THE LEASE IN EARLY BECAUSE I WILL NOT RISK MY LIFE OR MY FAMILY'S LIFE IN THIS CAR. I DON'T WANT ANOTHER PERSON TO BUY THIS CAR NOT KNOWING THE CONDITION IT IS IN! IT ONLY HAS 8345 MILES ON IT AND IS A BEAUTIFUL CAR, BUT DANGEROUS!",
        "vin": "3C4PDCEG5FT"
    }
]