[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/02/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC THROTTLE BODY READS THAT THE ACTUATOR IS STUCK OPEN. THIS CAUSES MY CAR TO STALL IN UNPREDICTABLE AND UNSAFE SCENARIOS. MY CAR WILL STILL MOVE WHEN THIS HAPPENS BUT ONLY AT REALLY LOW SPEEDS. ONE TIME THE CAR SLOWED DOWN AND WOULD NOT LET ME GO ABOVE TWENTY MILES PER HOUR AND I WAS ON THE EXPRESSWAY WITH A SPEED LIMIT OF 65 MILES PER HOUR. IT DOES IT OUT OF NOWHERE AND IS PUTTING ME IN THE POSITION TO GET REAR-ENDED. I HAVE TO NOW PAY 300 TO BUY A NEW PIECE TO RESOLVE THIS PROBLEM WHEN IN FACT THIS VEHICLE SHOULD HAVE BEEN RECALLED LIKE THE FORD ESCAPE AND THE FORD FUSION BECAUSE IT IS THE EXACT SAME ISSUE. THIS ISSUE HAS MY LIFE AND MY CHILDREN'S LIVES ON THE LINE EVERY TIME WE GET IN THIS CAR. THIS ISSUE HAPPENS ANYWHERE. IT HAPPENS FREQUENTLY ON CITY STREETS WHERE I WOULD BE GOING 30 MILES PER HOUR AND IT REDUCES MY SPEED TO LIKE TEN MILES PER HOUR AND WONT LET ME ACCELERATE. I HAVE TO SHUT THE ENGINE OFF AND RESTART THE CAR. I HAVE HAD TO PULL OVER INTO PARKING LANES AND GAS STATIONS IN ORDER TO GET OUT OF TRAFFIC FLOW TO SAFELY SHUT MY ENGINE OFF AND RESTART THE CAR. IT HAS DONE THIS TWICE ON THE EXPRESSWAY WHERE IT REDUCED MY SPEED FROM 65 TO 40 MPH AND CONTINUED TO DECREASE IN SPEED. ONE OF THOSE TIMES I WAS NOT BY A SHOULDER AT ALL AND THERE WAS VERY HEAVY TRAFFIC FLOW. I FINALLY WAS ABLE TO PULL INTO THE YELLOW LINES WHERE CARS ARE NOT SUPPOSED TO BE THAT ARE BETWEEN THE LANES WHERE YOU MERGE FROM ONE EXPRESSWAY TO ANOTHER. AND THAT TIME I WAS A SITTING DUCK BETWEEN LANES OF TRAFFIC WITH MY EMERGENCIES ON BECAUSE I WASNT ABLE TO SHUT THE CAR OFF RIGHT AWAY DUE TO MY LANE PLACEMENT ON THE EXPRESSWAY. SO THE CAR WAS SHAKING.",
        "vin": "1FAHP2D89DG"
    }
]