[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/13/2016",
        "dateOfIncident": "05/02/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864714,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 05/03/16 I WENT TO BRING MY 9500LB RV HOME FROM STORAGE. WHILE DRIVING TO THE LOT THE TRUCK BRAKES WERE FINE. AFTER HOOKING UP THE RV TO THE TRUCK AND PULLING OUT OF THE LOT THE BRAKES WERE STILL FINE. BUT AS I APPROACHED A TRAFFIC LIGHT, I PRESSED ON THE BRAKES AND NOTHING WAS THERE, NO BRAKES AT ALL. RED LIGHTS ON THE DASH WAS THE ONLY WARNING I GOT, BUT NOT UNTIL IT WAS TO LATE. IF NOT FOR THE RV HAVING BRAKES I WOULD NOT HAVE BEEN ABLE TO STOP.   I WAS ABLE TO GET THE RV HOME. I PUT FLUID IN THE BRAKE RESERVOIR. I THEN DROVE DOWN THE STREET (WITHOUT RV) WITH BRAKES BUT AFTER THE THIRD STOP I LOST ALL BRAKES. I WAS ABLE TO PULL INTO A LOCAL REPAIR SHOP AND HAD THEM FIX THE ISSUE.   I WAS TOLD THE MASTER CYLINDER WAS LEAKING ALL FLUID INTO THE BRAKE BOOSTER, AND WHEN THE MECHANIC REMOVED THE BOOSTER HE POURED FLUID FROM THE BOOSTER.    BEFORE I LEFT MY HOUSE I FOUND NO WET BRAKES OR FLUID IN THE ENGINE COMPARTMENT OR ON THE GROUND. I WAS TOLD THE SAME BY THE MECHANIC.  I CALLED MY FORD DEALERSHIP AND TOLD HIM OF THE ISSUE AND HE STATED BECAUSE I WAS OUTSIDE MY WARRANTY (45000 MILES) IT WOULD NOT HAVE BEEN COVERED. HE MADE NO MENCHIN OF THE POSSIBLE BRAKE ISSUES.  I WENT ON THE INTERNET TO SEE IF OTHERS HAD A SIMILAR ISSUE AND FOUND OUT ABOUT THE INVESTIGATION.   I'M WRITING YOU TODAY TO LET YOU KNOW THIS IS HAPPENING WITHOUT ANY WARNING.  I HAVE ALL THE PARTS AND THE REPAIR COST ME 873.26.   ALL STREETS WERE LOCAL STREETS. SEVERAL TRAFFIC LIGHTS. AFTER I LOST BRAKING I WAS ABLE TO STOP AND ENTER MY RESIDENTIAL STREET BY USING TRAILER BRAKES AND THE EMERGENCY TRUCK BRAKES.    THANK YOU  *TR",
        "vin": "1FTFW1CT4DK"
    }
]