[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/16/2016",
        "dateOfIncident": "03/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10865114,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUMMARY:  PURCHASED 2001 TOYOTA TUNDRA IN APRIL 2015 FROM FAULKNER BUICK GMC OF WEST CHESTER PA.APRIL 2015 THE DEALER PASSED INSPECTION WHILE ACTIVE RECALLS ON FRAME CORROSION WERE NOT COMPLETE,CORRODED FRAME PRESENT.PER CURRENT INSPECTION FAIL-3-2016-THIS SHOULD NEVER HAVE BEEN PASSED IN 2015 BY DEALER. FAULKNER BUICK GMC OF WEST CHESTER PA, 705 AUTOPARK BLVD,WEST CHESTER, PA 19382 1.THE PRIOR USED CAR DEALER PASSED INSPECTION 2015,SHOULD HAVE FAILED FOR ROTTED FRAME (LEGAL ISSUE);2.PRIOR OWNER,USED CAR DEALER-IGNORED ALL PAST/CURRENT FRAME RECALLS;3.PURCHASED TRUCK 4-2015;4.FAIL INSPECTION-ROTTED FRAME 3-2016;5. TRICOUNTY TOYOTA,LIMERICK, PA,3/15/16 - THEY TOLD MY SON ITS NOT ROTTED ENOUGH, DRIVE A FEW MONTHS AND SEE IF ITS WORSE (EVEN THOUGH THERE IS AN ACTIVE RECALL NOW.;6.WENT TO CONICELLI TOYOTA - CONSHOHOCKEN,PA MARCH17, 2016 - VERY HELPFUL IN TESTING THE CORROSION, THEY AGREE ITS ROTTED THRU, NO WAY TO FIX OTHER THAN COMPLETE REPLACEMENT OF FRAME, SEVERAL TESTS AND PICS GIVEN TO TOYOTA \"FIELD REP.\" ONE MONTH LATER DETERMINES THAT TOYOTA WILL NOT FIX ENTIRE FRAME, ONLY THE SMALL PORTION CURRENTLY UNDER THE ACTIVE RECALL (HOWEVER, THE DEALER SAYS THEY CANT FIX NOR PASS INSPECTION BECAUSE THE REST OF FRAME IS STILL ROTTED - CATCH 22). TOYOTA NOW REFUSES TO FIX THE ENTIRE FRAME - EVEN THOUGH THROUGH PRIOR RECALLS THEY SHOULD HAVE DONE ANYWAY. THEY CANNOT FIX THE PORTION OF FRAME UNDER CURRENT RECALL DUE TO REMAINING CORROSION. I HAVE PASSES ONTO CORPORATE TOYOTA CASE#1604132198, HOWEVER ATTEMPTS TO DISCUSS WERE DISMISSED. DESIRED OUTCOME:1.SINCE TOYOTA SHOULD BE OBLIGATED TO FIX CURRENT FRAME PART, I DEMAND THAT THEY SHOULD HAVE TO FIX THE REMAINING FRAME AS THEY ORIGINALLY CLAIMED THE ENTIRE FRAME TO BE DEFECTIVE.2.USED CAR DEALER FAULKNER OF WEST CHESTER PA SHOULD BE HELD ACCOUNTABLE FOR PASSING STATE INSPECTION W/ RECALLS OUTSTANDING,UNSAFE SOLD TO MY SON.",
        "vin": "5TBRT34111S"
    }
]