[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2016",
        "dateOfIncident": "06/25/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876614,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE FRAME RUST:  2005 4RUNNER SR5 V8 IN STRATOSPHERE MICA BLUE.  VEHICLE HAS BEEN DRIVEN IN MICHIGAN AND OHIO FOR ITS ENTIRE LIFE OF 104,850 MILES AS OF TODAY.  VEHICLE RECEIVED COMPLETE RUSTPROOFING OF UNDERBODY, UNDERHOOD AND BODY PANELS WHEN NEW.  DESPITE UNDERCOATING AND CONSTANT WASHING IN THE WINTER, THE FRAME HAS EXPERIENCED SIGNIFICANT RUST.  FRONT CROSS MEMBER IS RUSTED ALMOST COMPLETELY THROUGH AND IS EXPECTED  TO BREAK THROUGH SOON.  TRAILING ARM BRACKETS ARE BECOMING THIN AND I HAVE BEEN WARNED THAT WHEN THEY BREAK I WILL LOSE CONTROL OF THE VEHICLE.  HOLES ARE STARTING TO RUST THROUGH ON FRAME.  MECHANIC HAS INFORMED ME THAT UNDERBODY COATING CAN NOT PROTECT FROM RUST THAT BEGINS INSIDE POORLY MADE FRAMES AND THAT IT WILL BECOME A SERIOUS SAFETY CONCERN IN THE NEAR FUTURE.   THIS VEHICLE HAS BEEN WASHED RELIGIOUSLY IN WINTER AND ALL INSPECTION/MAINTENANCE RECORDS ARE AVAILABLE.  BODY, INTERIOR AND DRIVELINE ARE IN ABOVE AVERAGE CONDITION, AND VEHICLE HAS BEEN DRIVEN BELOW AVERAGE MILES (9500 PER YEAR).  HOW CAN A CAR MANUFACTURER MAKE A VEHICLE FRAME WHICH RUSTS OUT THIS QUICKLY?  THE VEHICLE STILL LOOKS AND DRIVES LIKE NEW ON THE OUTSIDE BUT WILL LITERALLY FALL APART AT THE SEAMS.  THIS VEHICLE CLEARLY HAS THE SAME ISSUE THAT OTHER TOYOTA'S HAVE HAD WITH FRAME CORROSION BUT I SEE NO CAMPAIGN TO ASSIST OWNERS WITH THIS ISSUE.  I HAVE ALWAYS LOVED MY TOYOTA'S BUT THIS PROBLEM IS SO SEVERE THAT NOT ONLY WILL I AVOID THE BRAND FOREVER BUT IT WILL ALSO CAUSE ME SIGNIFICANT FINANCIAL DISTRESS AS I CANNOT AFFORD A FRAME REPLACEMENT NOR SHOULD I HAVE TO REPLACE THIS VEHICLE AT SUCH A LOW MILEAGE/AGE.  PLEASE HELP.  I DON'T UNDERSTAND HOW CORROSION THIS SEVERE IS POSSIBLE ON A VEHICLE WHICH HAS BEEN CARED FOR THIS WELL.  I HAVE HUNDREDS OF RECORDS FOR THIS VEHICLE GOING BACK TO WHEN IT WAS NEW.",
        "vin": ""
    }
]