[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/30/2016",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891814,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 30TH, 2016 MY FAMILY AND I WERE DRIVING NORTHBOUND ON I-91 IN MASSACHUSETTS BETWEEN EXITS 14 AND 15. THE REAR BRAKES BEGAN TO MAKE A NOISE WHILE DRIVING AT SPEED (~65 MPH) AND NOT DEPRESSING THE BRAKE PEDAL. MINUTES LATER A THUMP WAS HEARD SIMILAR TO WHEN AN OBJECT OR ROADKILL IS RUN OVER. WHEN THE BRAKE PEDAL WAS DEPRESSED, IT WENT TO THE FLOOR. I COULD SEE SMOKE COMING FROM THE REAR PASSENGER WHEEL. WE LATER FOUND OUT THAT ONE BRAKE PAD HAD BROKEN THROUGH/BEEN THROWN FROM THE REAR PASSENGER WHEEL, AND BRAKE FLUID WAS POURING OUT FROM THAT BRAKE ASSEMBLY.  WE EXITED THE HIGHWAY AT EXIT 15 AND DROVE SMALL LOW-TRAFFIC ROADS HOME. DODGE WAS CONTACTED BUT REFUSED TO ASSIST IN TOWING THE VEHICLE TO A DEALER FOR ASSESSMENT. WE REPLACED THE BRAKES, CALIPERS, AND ROTORS IN OUR DRIVEWAY. ATTACHED PHOTOS SHOW THE BRAKE ASSEMBLY BEFORE IT WAS REMOVED FROM THE VEHICLE FOR REPLACEMENT. THE CAR WAS THREE YEARS AND 10 MONTHS OLD, WITH ~48,660 MILES, AND ON ITS SECOND PAIR OF REAR BRAKE PADS. THIS IS AT LEAST THE 21ST COMPLAINT ON NHTSA ABOUT THE SAME COMPONENT (REAR BRAKE PADS ON 2012 GRAND CARAVAN WEARING TOO QUICKLY). DODGE REFUSED ASSISTANCE BOTH AT THE TIME OF THE INCIDENT AND AFTER I FOLLOWED UP WITH OUR DEALER, WITH NO REASON GIVEN FOR THE REFUSAL. (CASE #29615622) GIVEN THE MANY OFFICIAL AND HUNDREDS OF UNOFFICIAL COMPLAINTS ABOUT THE 2012 DODGE GRAND CARAVAN REAR BRAKES, I HOPE THE NHTSA WILL INVESTIGATE FURTHER AND PRESSURE DODGE TO REPAIR OR REPLACE THIS PART. THANK YOU.",
        "vin": "2C4RDGBG9CR"
    }
]