[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/01/2016",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10882614,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING: ON FRIDAY JULY 1, 2016, MY HONDA ACCORD V4 BEGAN TO SHUDDER AND SHAKE AS I BACKED OUT OF THE DRIVEWAY. I STOPPED AND TURNED OFF THE CAR.  AFTER A SHORT WAIT, I RESTARTED THE CAR AND PROCEEDED TO BACK OUT ONTO THE STREET, BUT THE SHAKING OF THE STEERING WHEEL WAS VERY PRONOUNCED  AND I IMMEDIATELY RETURNED TO THE DRIVEWAY. A CHECK OF THE FLUIDS REVEALED VERY LOW POWER STEERING FLUID, BELOW THE MINIMUM LEVEL MARK. AFTER TOPPING UP THE CHAMBER WITH NEW FLUID, THE CAR STARTED AND WAS OPERABLE WITHOUT  SHAKING AND NO STEERING PROBLEMS. HOWEVER, THE LEVEL IN THE CHAMBER SANK IMMEDIATELY BELOW THE MINIMUM LINE AFTER JUST A MINUTE OR TWO OF OPERATION (I BACKED A SHORT DISTANCE DOWN THE DRIVE). THERE WERE A SIGNIFICANT NUMBER OF FRESH FLUID SPOTS ON THE DRIVE. MORE FLUID WAS ADDED AND THE CAR WAS SUCCESSFULLY DRIVEN TO THE DEALERSHIP LOCATED 2 MILES FROM OUR HOME, WHERE IT IS AWAITING REPAIR.  THE DEALER REPORTED THIS MORNING THAT BOTH THE HIGH PRESSURE LINE AND THE RETURN LINE WERE LEAKING. SINCE THE CAR WAS DRIVEN WITH NO PROBLEMS OR SIGNS OF LEAKS THE DAY BEFORE, AND BECAUSE THESE LEAKS APPEARED SUDDENLY, WITHOUT ANY PRIOR PROBLEMS WITH STEERING OR POWER STEERING FLUID LEVELS, WE BELIEVE THIS FAILURE POSES A SIGNIFICANT RISK TO THE DRIVER, PASSENGERS, AND OTHERS ON THE ROAD. THERE WAS ALSO THE POTENTIAL OF AN ENGINE FIRE DUE TO THE LEAKING FLUID. THE CAR HAS REGULAR MAINTENANCE AND VERY LOW MILEAGE (<30000 MILES). THE NHTSA ISSUED A RECALL IN 2012 (12V222000) FOR 2003-2007 ACCORD V6S. BECAUSE THAT RECALL WAS DUE TO DEFECTIVE LINES/HOSES, AND OUR CAR'S HOSES ALSO FAILED IN THE SAME WAY, WE BELIEVE THAT FURTHER INVESTIGATION INTO OTHER ACCORD ENGINE SIZES AND  VIN NUMBERS SHOULD BE CONDUCTED AND INCLUDED IN THE RECALL.",
        "vin": "1HGCM56736A"
    }
]