[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/13/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885514,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "HHR",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "2007 CHEVY HHR WITH MILEAGE OF 63,223. NO PROBLEMS UNTIL 11/05/14 RECALL 14063 IGNITION SWITCH AND 14113 LOCK CYLINDER WERE REPLACED. 20 DAYS LATER AFTER FIGHTING WITH GM AND THE DEALERSHIP FOR 3 WEEKS IT WAS TOWED BACK TO DEALERSHIP BECAUSE VEHICLE WOULD NOT START AND KEY WOULD NOT COME OUT OF IGNITION. TESTED CHARGING SYSTEM AND FOUND BATTERY TO FAIL. REPLACED BATTERY, VEHICLE STARTED AND KEY RELEASED UNTIL THE NEXT TIME I WENT TO START IT ABOUT 2 WEEKS LATER. VEHICLE WOULDN'T START AND KEY WOULD NOT COME OUT OF IGNITION AGAIN. 01/30/15 DIFFERENT DEALERSHIP CAME TO MY HOUSE TO PICK UP THE VEHICLE AND TOOK IT IN FOR RECALL SPECIAL COVERAGE 14632 FLOOR SHIFTER REPLACED. BEFORE I COULD GET THE VEHICLE BACK THE DEALERSHIP CALLED AND INFORMED ME THE NEW BATTERY HAD FROZEN AND WOULD NOT ACCEPT A CHARGE. I REPLACED THAT BATTERY WITH ANOTHER NEW BATTERY. THEIR DIAGNOSIS WAS I NEEDED A NEW BODY CONTROL MODULE ESTIMATED PARTS AND LABOR $600 BEFORE I WOULD EVER BE ABLE TO DRIVE IT. I HAVE NOT DROVE THE VEHICLE IN OVER A YEAR. IT HAS BEEN SITTING IN STORAGE. I AM AUTHORIZING THE DEALERSHIP TO BEGIN WORK ON IT TOMORROW. IF BY REPLACING THE BODY CONTROL MODULE IT CORRECTS ALL THE ELECTRICAL PROBLEMS THIS VEHICLE HAS I WOULD EXPECT GENERAL MOTORS TO ISSUE A RECALL EVENTUALLY AND REIMBURSE ME FOR THE EXPENSE OF PARTS AND LABOR. 06/30/2016 VEHICLE IN FOR BCM REPLACEMENT. RETURNED ON 07/11/2016 WITHOUT NOTIFICATION JUST LEFT IN THE DRIVEWAY WITH KEYS AND SERVICE INVOICE INSIDE VEHICLE. ON 07/11 I MOVED ABOUT IT ABOUT 30 FEET AND POSITIONED IT IN THE TURN AROUND. ON 07/12 I WENT OUT TO PUT THE HHR IN GARAGE BEFORE STORM HIT AND THE VEHICLE WOULD NOT START ONCE AGAIN. KEY FOB WOULDN'T EVEN UNLOCK THE DOORS THIS MORNING. UPDATE..IT WAS THE BCM. DEALERSHIP FAILED TO DISCONNECT BATTERY WHILE WAITING FOR REPAIR PARTS AND KILLED A BRAND NEW BATTERY. BATTERY REPLACED 7/13 STILL STARTING 7/18",
        "vin": "3GNDA23D47S"
    }
]