[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/09/2016",
        "dateOfIncident": "08/01/2015",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894314,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 60 MPH ON THE MARYLAND 495 BELTWAY (HIGHWAY) MY VEHICLE (STEERING WHEEL, BODY OF VEHICLE, MYSELF,  ETC.)  JUST STARTED SHAKING VIOLENTLY AND EXTREMELY HARD TO CONTROL.  I WAS HORRIFIED AND AT THE SAME TIME I HAD TO LOOK OUT FOR OTHER VEHICLES ON ALL SIDES WHILE I SLOWED DOWN TO 45 MPH.  NOW, DOWN THE ROAD AND WITH VERY LIGHT TRAFFIC NEAR, I STARTED INCREASING MY SPEED TO 55-60 TO SEE WHAT WAS WRONG AND AROUND 60 MPH THE VIOLENT SHAKING STARTED.  I REDUCED THE SPEED TO 45 MPH. WHILE TRYING TO DIAGNOSE, I STARTED TO INCREASE MY SPEED AND AT 55 MPH I HIT A BUMP IN THE ROAD AND IT STARTED SHAKING VIOLENTLY AGAIN. I'VE TAKEN MY VEHICLE TO THE RR DEALER SEVERAL TIMES FOR SERVICE AND EXPLAINED THE PROBLEM AT THOSE SPEEDS AND WAS TOLD, I JUST NEEDED AN ALIGNMENT.  NEEDLESS TO SAY THAT WAS NOT SOLUTION.  I CONDUCTED RESEARCH ONLINE AND SAW THAT THERE WERE OTHER RR FOLKS WITH THE SAME COMPLAINT.  FOLLOWING THEIR LEAD, I PURCHASED AND REPLACED THE DRAG LINK AND TRACK ROD & STABILIZER SHOCK.  JUST A TEMPORARY FIX, BECAUSE I HAVE THE SAME VIOLENT SHAKING PROBLEM AT 55-60 MPH AND GOING OVER BUMPS AT THAT SPEED. MOST OF MY DRIVING IS THROUGH CITY STREETS AND NOT ON THE MARYLAND 495 BELTWAY. IT'S BEEN CLOSE TO 2 YEARS AND I NO LONGER TAKE THE BELTWAY BECAUSE I HAVE TO DRIVE IN THE SLOW LANE AND SET MY CRUISE CONTROL AT 50 TO AVOID THE VIOLENT SHAKING. NOBODY AT EITHER RR DEALER I CALLED OR VISITED SEEMS TO KNOW WHAT THE PROBLEM IS.  I HOPE THIS ISSUE CAN BE REVIEWED ASAP.  THANK YOU FOR YOUR TIME AND ATTENTION!  *TR",
        "vin": "SALPM16442A"
    }
]