[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/21/2016",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908514,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "3500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "INTEGRAL TRAILER BRAKE CONTROLLER WORKS CONTRARY TO INDUSTRY STANDARD CONTROLLERS.  THE FUNCTION OF THE ELECTRIC BRAKE \"OVERRIDE LEVER\" DOES NOT OVERRIDE CONTROLLER SETTING AND APPLY FULL POWER TO THE TRAILER BRAKES.  THE INTEGRAL CONTROLLER ON THIS VEHICLE WILL ONLY SUPPLY OVERRIDE VOLTAGE PROPORTIONAL TO THE SENSITIVITY SETTING OF 0 TO 10 AND THE SPEED OF THE VEHICLE.  WHEN STOPPED THE SENSITIVITY VARIES THE OVERRIDE VOLTAGE BETWEEN 0 TO 7 VOLTS DC.  SAFETY ITEM.  AT VERY SLOW SPEEDS LESS THE 10 MPH AND THE SENSITIVITY SET AT MAX 10 THE OUTPUT OF THE CONTROLLER OVERRIDE IS 7.2 VDC AND 7.2 AMPS.  AT 35 MPH THE OUTPUT WAS 10.3 VDC AND 10.9 AMPS.  AT 45 AND 55 MPH THE OUTPUT WAS AT ITS MAXIMUM 11.5 VDC AND 11.5 AMPS. THE BRAKING CURVE WAS ALMOST THE SAME WITH THE SENSITIVITY SET AT 10 AND HEAVY VEHICLE BRAKING PRODUCED THE SAME VOLTAGE AMPERAGE CURVE.  THE SAFETY PROBLEM IS THAT THE \"OVERRIDE FUNCTION\" IS SPEED RELATED WHEREAS INDUSTRY STANDARD HAS THE OVERRIDE SWITCH BYPASS ALL OTHER SETTING AND APPLY FULL BATTERY POWER 12 VDC TO THE BRAKE CONTROL SYSTEM.  I WILL POINT OUT FROM MY 50 PLUS YEARS OF TOWING THE NEED OF FULL EMERGENCY OVERRIDE POWER TO THE TRAILER BRAKE SYSTEM.  SNOW, ICE, OR BLACK ICE, ALL REQUIRE VERY SLOW VEHICLE MOVEMENT AND THEREFORE VERY LITTLE OVERRIDE POWER, CAREFUL USE OF THE OVERRIDE FUNCTION CAN PREVENT A \"JACK KNIFE\" SITUATION.  GOING DOWN A STEEP GRAVEL HILL, LIKE SNOW AND ICE YOU RARELY IF EVER USE THE VEHICLE BRAKE BUT DEPEND ON THE OVERRIDE CONTROL USE TO KEEP EVERYTHING STRAIGHT.  SINCE THE OVERRIDE FUNCTION IS SPEED DEPENDENT FULL OVERRIDE AT LOW SPEEDS WILL NOT APPLY ENOUGH POWER TO CONTROL THE TRAILER.  15MPH IDLE FULL OVERRIDE 200 YEARS TO STOP.  [XXX]  BSME MSME.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3C63RRJL7FG"
    }
]