[
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899014,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS BEEN HAVING STEERING PROBLEMS TO WEAR I GOT IT FIX WITH REPLACING A STEERING RACK WHICH HAS NOT LASTED LONGER THEN A YEAR. 2015-2016 AND I CAN'T SEEM TO GET A REPAIR MAN TO FIGURE IT OUT. THIS HAS HAPPEN DRIVING, AND TURNING. I HAVE HAD EXHAUST PROBLEM TO WERE THE REPAIR MEN HAS TOLD THAT MY CAR COULD CATCH OF FIRE DUE TO THE HEAT SHIELD SO THEY REMOVE ONE. WHICH STILL LEFT MY CAR DEALING WITH OIL SPILLAGE AFTERWARDS AFTER DRIVING IT ANYWHERE. MY OIL NEVER TOUCHES THE GROUND JUST SITS IN EXHAUST PIPE AND BLOW SMOKE SOMETIMES AND IT HAS STARTED BACK UP ONCE AGAIN AFTER PUTTING SO MUCH REPAIRS INTO MY CAR. SERVICE ENGINE LIGHT HAS START POPPING ON AND OFF, EVERYTIME I GET IT TESTED IT SAYS CRANK SENSOR THATS WHEN DRIVING THE CAR OR WHEN THE CAR MOVING. THEN SOME DAYS IT WILL DISAPPEAR. AND IT MESS WITH THE POWER OF MY ENGINE. AND SOMETIMES IT TAKES A WHILE TO CRANK THE CAR.  NOW I HAVE TRIED REPLACING ANOTHER MOTOR IN THE CAR BUT THIS MOTOR THAT I HAVE NOW IS GIVING ME THE SAME PROBLEM AS THE FIRST MOTOR.  AND I THINK THATS BECAUSE THE REPAIR MEN ARE NOT FIXING THE RECALLS ON THE MOTOR OF THE CAR, THEY ARE JUST REPLACING THE MOTOR LIKE MINES GOT REPLACED WITH ANOTHER MOTOR OF THE SAME YEAR MAKE AS MY CAR. BUT I FEEL THAT IF THESE RECALLS ON THESE YEAR MAKE OF MY CAR HAVE BEEN KNOWN THEN THE NISSAN SHOULD REPAIR THE DEFECTS SO PEOPLE WANT HAVE TO KEEP PUTTING SO MUCH MONEY INTO FIXING THE CAR AND ITS NOT THEIR FAULT ITS NISSAN. I HAVE PROBLEMS ALSO OUT OF MY MANIFOLD GASKET AND THE WHOLE PART ITSELF ALL THE TIME THAT CAN BURN ME AND MY CHILDREN UP WHILE DRIVING. AND I'M JUST SO SCARED SOMETHING IS GOING TO HAPPEN WHILE DRIVING MY CAR AND THERE ARE RECALLS ON MY MAKE MODEL CAR.",
        "vin": "1N4AL11EX2C"
    }
]