[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "07/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAPTIVA",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT THE 2014 CAPATIVA AND DROVE IT FOR ABOUT A MONTH. WHEN YOU WOULD BACK UP IT WOULD MAKE A GRINDING NOISE. THEN IN A FEW DAYS YOU COULDN'T HARDLY HOLD IT IN THE ROAD LIKE YOU HAD A TIRE COMING OFF. WE WERE ON THE HIGHWAY AND IF YOU GOT OVER 50 MILES A HOUR TOOK BOTH HANDS TO HOLD IT IN THE ROAD. IF YOU GOT UNDER 50 AND STAYED YOU COULD HOLD IT IN THE ROAD. TOOK IT TO THE DEALER AND THEY CHECKED IT OUT AND FOUND BOTH ROATERS IN FRONT WAS WORPED AND HAD BEEN PUT ON THAT WAY FROM FACTORY. THE WOULD NOT DO ANYTHING ABOUT IT AND THE CAR WAS STILL UNDER WARENTERY. I HAD TO GO BUY BOTH FRONT ROATERS AND PAY FOR HAVING THEM REPLACED. THE MACHINACE TOLD US IF WE HADN'T OF WENT AHEAD AND CHANGED THEM WHEN WE DID THEY COULD OF LOCKED UP OR THE WHOLE WHEEL AND ALL CAME OF GOING DOWN THE ROAD. THIS COULD OF CAUSE A BAD WREACK . THE CAR ONLY HAD 3600 MILES ON IT WHEN IT STARTED MAKING THE NOISE WERE WE COULD HEAR IT. MY POINT IS IF YOU BUY SOMETHING AND IT IS STILL UNDER WARENATY THEY SHOULD OF FIXED THIS PROBLEM AND PAID FOR IT NOT ME.IT COAST US 400.00 FOR ROATORS AND THEN ANOTHER 350.00 FOR THE LABOR NOT COUNTING THE 500.00 FOR THE TIRES THAT IT HAD WORE IN PLACES THAT WAS NOT FIT TO HAVE ON THE CAR. THEY COULD OF BLOWED OUT OR ANYTHING AND CAUSED US TO WREACK. THIS DEALER DIDN'T EVEN ACT LIKE THEY WERE CONCORENED ABOUT IT AT ALL. I HAVE TALKED TO 10 OR 12 PEOPLE THAT OWNS A CAPATIVA 2014 AND THEY HAVE HAD TO DO SAME THING. I THING THE COMPANY SHOULD CHECK IN TO THIS AND PAY THE OWNERS OF THESE VECHIELS THE MONEY THEY ARE OUR FOR BUYING A SUV THAT HAS THIS PROBLEM AND THEY WOULD NOT STAND UP TO THE WAREANTEY LIKE THEY ARE SUPPOSE TO. I LOVE CHEVYS BUT IF THEY NOT GOING TO STAND BEHIND THEIR VEHICLES WHEN YOU HAVE A PROBLEM I GUESS I WILL HAVE TO START DRIVING A FORD.",
        "vin": "3GNAL3EK9ES"
    }
]