[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "11/21/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003153,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPLORER",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "BACKED OUT OF DRIVEWAY AND PROCEEDED DOWN STREET AT ABOUT 10 MPH.  ENGINE MADE A \"THUNK\" NOISE AND  WENT INTO A \"NO START\" CONDITION.  MY '97 EXPLORER WAS TOWED TO THE DEALER WHO DIAGNOSED THE PROBLEM AS A SNAPPED CRANKSHAFT.  AT 103K MILES THE DEALER DID NOT ACKNOWLEDGE THAT THIS WAS ANY SORT OF MANUFACTURING DEFECT AND EMPHATICALLY STATED THAT THEY'D NEVER HEARD OF THIS PROBLEM. THEY REFUSED CUSTOMER REQUEST THAT THEY REVIEW NHTSA WEBISTE FOR HISTORY OF PRIOR REPORTS.  THE DEALER STATED THAT THE ENGINE WAS ONLY DESIGNED TO LAST 100K MILES BUT THAT MIGHT BE EXTENDED WITH REGULAR OIL CHANGES.  THIS CUSTOMER ASKED IF ENGINE REPLACEMENT AT 100K MILES WAS AN EXPECTED EVENT AND THE DEALER REPEATED THAT IT COULD BE.  FORD'S NATIONAL CUSTOMER SERVICE WAS NO HELP. THE ZONE MANAGER WOULD NOT MEET TO DISCUSS THE PROBLEM.  CUSTOMER PAID $4,800 TO REPLACE THE ENGINE.  CUSTOMER KEPT THE BROKEN SHAFT WHICH SHOWS MULTIPLE INTERNAL SURFACE TEXTURES.  TO DATE THERE HAVE BEEN OTHER COMPLAINTS ABOUT THIS SAME PROBLEM WITHOUT A RESPONSE ON THIS SAFETY AND MANUFACTURING ISSUE FROM FORD.  OTHER WEBSITES REPORT FORD EMPLOYEES AWARE OF THIS PROBLEM, LOOSELY REFERRED TO AS A \"STACKING OF TOLERENCES\" WHEREBY THE TOLERENCES EXERT PRESSURE ON THE CRANKSHAFT JUST BEHIND THE KEY WHERE IT ATTACHES TO THE DAMPNER.  THIS IS REPORTEDLY NOT A CONDITION THAT THE OWNER CAN PREVENT, DIAGNOSE OR OTHERWISE BE AWARE OF UNTIL THE CRANKSHAFT BREAKS.  FORD REPORTEDLY CANNOT MAKE A PRIOR DETERMINATION EITHER, SEEMINGLY LEAVING IT TO CHANCE WHETHER A VEHICLE WILL HAVE PROBLEMS.  CERTAIN ENGINE COMPNENTS ARE EXPECTED TO FAIL DURING ENGINE LIFE SUCH AS WATER PUMPS, ALTERNATORS AND SO FORTH BUT MAJOR COMPONENTS SHOULD NOT.  FORD SHOULD ADDRESS THIS ISSUE BY REVEALING THE DESIGN LIFE OF THE CRANKSHAFT.  J.D. POWERS RELAYED TO THIS CUSTOMER THAT CRANKSHAFTS ARE ROUTINELY DESIGNED TO LAST 200 - 250K MILES, CONTRARY TO DEALER ASSERTATIONS.  THE NHTSA NEEDS TO INVESTIGATE THIS ISSUE AND TAKE APPROPRIATE ACTION.",
        "vin": ""
    }
]