[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2017",
        "dateOfIncident": "02/06/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954314,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "IMPREZA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A NEW IMPREZA ON 2/4/17, WITHIN DAYS OF BRINGING THE CAR HOME WE NOTICED THAT ALL THE RADIO PRESETS HAD BEEN WIPED OUT, AND THE XM RADIO HAD REVERTED BACK TO A TRIAL PERIOD. THAT SAME DAY WE RECEIVED AN EMAIL SAYING THAT OUR CAR WAS SENDING A PROBLEM CODE FOR THE STARLINK SYSTEM.  UPON CALLING THE DEALERSHIP WE SPOKE WITH A SERVICE ADVISER WHO OWNS THE SAME CAR AND SHE TOLD US THAT SHE HAS ALL KINDS OF PROBLEMS WITH THE CAR SOFTWARE. INCLUDING BACKUP CAMERA, SCREEN FREEZING, LOSING RADIO PRESETS, CLOCK TIME CHANGING.  AND SHE INDICATED THAT THIS WAS A KNOW ISSUE WITH THE VEHICLE MODEL AND SHE HAD BEEN DEALING WITH IT FOR 2 MONTHS.  SHE TOLD US THAT SHE HAD BEEN TOLD SUBARU HAD NOT IDEA HOW TO FIX IT AND MAYBE IN MAY THEY MIGHT HAVE IT FIXED.  UPON BEING TRANSFERRED TO THE SALES MANAGER, HE HOLD US THAT SUBARU HAD NOT PUT A STOP SELL ORDER ON THE CALL SO THEY KEPT SELLING THEM.  WE WERE NEVER TOLD ABOUT THIS DEFECT PRIOR TO BUYING THE CAR.  RECENT CALLS WITH SUBARU HAVE CONFIRMED THE PROBLEM, BUT NOBODY WILL CALL US BACK.  WE HAVE PUT 3 MILES ON THE CAR SINCE WE PICKED IT UP. WE WANT TO RETURN THE CAR TO THE DEALERSHIP. WE HAVE BEEN DEFRAUDED BY SUBARU.  THIS WAS A KNOW DEFECT!  SUBARU CUSTOMER SERVICE HAS CONFIRMED THAT THEY HAVE THE ISSUE.  MY STARLINK SYSTEM WHICH WARNS IF IN AN ACCIDENT, IS SENDING OUT A PROBLEM CODE AND IT MAKES A LOUD NOISE WHEN I TRY TO CONNECT.  THIS IS OBVIOUSLY RELATED TO THE SOFTWARE ISSUE.  I AM AFRAID TO DRIVE MY CAR.  WE NEED YOUR HELP IN INVESTIGATION THIS. OTHER UNSUSPECTING BUYERS ARE GETTING DUPED EVERY DAY.",
        "vin": "4S3GTAU69H3"
    }
]