[
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2017",
        "dateOfIncident": "03/16/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10966414,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY CAR TO REED NISSAN TO BE DIAGNOSED BECAUSE THE CHECK ENGINE LIGHT WAS ON. THEY DIAGNOSED THE CAR AND SAID THAT A FEW THINGS NEEDED FIXING  AND WHEN FIX THE LIGHT WILL BE GONE. I PAID TO FIX THE CAR AND WHEN I WAS DRIVING HOME THE CHECK EGINE LIGHT CAME BACK. I CALLED BACK AND SPOKE TO MY SERVUCE ADVISOR WHO TOLD ME TO BRING BACK THE CAR TO BE RE DIAGNOSED.  THE FINDING WAS ANOTHER PROBLEM THAT APPARENTLY DIDNT SHOW UP BECAUSE OF HOW LONG THE CAR TOOK TO BE FIX. I AGREE  TO REPLACED WHAT THEY QUOTE ME THE PRICE FOR BUT INSTEAD I GOT THE OPPOSITE. THEY REPLACED WHAT THEY WANTED TO AND DISNT REPLACE EVERYTHING THEY AGREED TO REPLACE BUT I STILL HAD TONPAY ALL THE MONEY THAT WAS AGREED ON EVENTHOUGH I DIDNT GET ALL THE WORK DONE THAT WAS SUPPOSE TO BE DONE. TODAY MY CAR RADIATOR BLEW AND THEY SAY THEY ARE NOT RESPONSIBLE  FOR IT A WEEK AFTWR I FIX MY CAR WITH THEM. THERE WAS ALSO A CRACK IN MY ENGINE COVER AND A SCREW MISSING TO KEEP IT TIGHT. MY RADIATOR COVER SCREWS WERE ALSO MISSING. I APOD MY MONEY AND DIDNT GET THE JOB THAT THEY TOLD ME I WAS SUPPOSED TO GET. WHRN I SPOKE TO THE MANAGER THEY GIVE ME ALL THESE STORIES AND WERE NOT TAKING ANY BLAMES FOR ANYTHING. THE TECH WHO WORKED ON MY CAR SAID HE DIDNT BROKE MY ENGINE  COVER AND THAT THE SCREW WAS MISSING SO HE LEFT IT THE SAME WAY. AS A TECHNICIAN  YOU WORK ON SOMEONE CAR ENGINE AND DID NOT REPLACE THE SCREW AND BROKE MY COVER AND LIED ABOUT IT AND OF COURSE NISSAN BACKS HIM EVENTHOUGH HE WAS WRING AND WAS LYING. THE MANAGER WALKED AWAY WITHOUT EVEN SAYING A WORD TO US ABOUT WHAT WAS GOING TO BE THE OUTCOME AND WHEN I APPROACH HIM ABOUT THIS MATTER HE PRETEND AS IF HE WASNT BEING RUDE BY SAYING HE SAW WE WERE ALREADY BEING TAKEN CARE OF MY THE TECH AND SERVICE MANAGER SO HE EXCUSED HIMSELF. THIS IS HOW THEY OPERATE AT REED NISSAN. THEY ARE REED NISSAN ON WEST COLONIAL DRIVE IN ORLANDO FLORIDA. NASTY.",
        "vin": "JN8AZ08TX7W"
    }
]