[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2017",
        "dateOfIncident": "12/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971414,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR PURCHASED NEW AND SERVICED AT TOYOTA DEALERSHIP EVERY 10,000 MILES USING 0-20W SYNTHETIC OIL.  AT AROUND 106,000 MILES I NOTICED THE DISPLAY FLASHING SOMETHING BUT COULD NOT, AT THAT TIME, READ WHAT THE WARNING WAS.  IT SEEMED TO HAPPEN GOING AROUND CURVES, TURNING ETC. FINALLY, AT MAYBE 107,000 MILES, THE WARNING STAYED ON LONG ENOUGH TO SEE THE LOW OIL WARNING.  TOOK THE CAR IN AT 108,000 (NO OIL ON DIPSTICK AT THAT POINT) AND THE SERVICE DEPARTMENT CHECKED FOR LEAKS AND FOUND NONE.  I WAS LIGHTLY ADMONISHED BY SERVICE FOR DRIVING WITHOUT OIL.  FAIR ENOUGH, I THOUGHT AT THE TIME.  I WAS SLIGHTLY CHAGRINED AS I HAVE ALWAYS RELIGIOUSLY HAD MY OIL CHANGED (OR CHANGED IT MYSELF) ON ALL MY CARS AT THE RECOMMENDED INTERVALS WITH NO SIGNS OF A PROBLEM.  THE TOYOTA SERVICE DEPARTMENT RECOMMENDED THAT I MONITOR OIL USAGE.  I DID, AND TO MY SURPRISE 2,500 HUNDRED MILES LATER, I HAD TO ADD A FULL QUART.  THEN 1950 MILES LATER, ANOTHER QUART.  YESTERDAY, ANOTHER QUART AT 1048 MILES.  VERY DISAPPOINTED AS THE CAR HAS BEEN WITHOUT PROBLEMS UNTIL NOW.  HAVE NOT DISCUSSED THIS WITH THE DEALERSHIP, BUT AM NOT ENCOURAGED BY THE TENOR OF COMMENTS POSTED HERE REGARDING TOYOTA STEPPING UP AND ACCEPTING RESPONSIBILITY.  I SEE NO NEED, AT THIS POINT, TO PAY TO HAVE AN OIL CONSUMPTION TEST DONE BY THE DEALERSHIP AS THE CAR IS OBVIOUSLY USING AN EXCESSIVE AMOUNT OF OIL.",
        "vin": "JTDKN3DU2A5"
    }
]