[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/05/2017",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970714,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "HIGHLANDER",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "LUG NUTS ARE 2-PIECE: STEEL NUTS WITH CHROMED COVERS CRIMPED ON. THE NUTS RUST INSIDE THE CHROME COVERS AND SWELL SO THAT THE LUG WRENCH THAT COMES WITH THE VEHICLE (NOR SOCKETS OR TYPICAL 4-WAY LUG WRENCHES) WILL NOT FIT THE NUT. ONE CAN BE STRANDED ON THE SIDE OF THE ROAD UNABLE TO REMOVE A FLAT TIRE. BESIDES THE WHEEL LOCKS, ALL 16 OF THE REMAINING NUTS WERE AFFECTED. I HAVE ORDERED REPLACEMENT NUTS, ON ADVICE FROM MY LOCAL TIRE SHOP, THAT ARE CHROME PLATED AND NOT 2-PIECE. I INFORMED TOYOTA CUSTOMER SERVICE OF THE PROBLEM AND THEY ACKNOWLEDGED RECEIPT BUTOFFERED NO SOLUTION OR COMPENSATION. THE PROBLEM OCCURRED WHEN I NEEDED TO REMOVE A TIRE, BUT THANKFULLY IT WAS STILL DRIVEABLE.  MY LOCAL TIRE SHOP WAS ABLE TO HAMMER-ON A SOCKET TO REMOVE THE SWOLLEN NUTS, AND I WILL HAVE TO RETURN TO THEM TO HAVE THEM INSTALL THE REPLACEMENT NUTS. I AM RETAINING THE ORIGINAL NUTS IN CASE THEY ARE NEEDED BY NHTSA OR TOYOTA FOR EXAMINATION. THERE ARE MANY REPORTS OF THIS ISSUE ONLINE, AS WELL AS MENTIONS IN PRODUCT QUESTIONS ABOUT REPLACEMENT NUTS ON AMAZON.COM (EG, ARE THESE NUTS ONE-PIECE OR NOT, AND REPORTS OF THIS EXACT PROBLEM WITH MANY VEHICLES). INTERESTINGLY, IT TURNS OUT THAT TOOL MANUFACTURER SNAP-ON MAKES AN 18.5MM AND 19.5MM OVERSIZED SOCKETS TO REMOVE THESE SWOLLEN NUTS. THE PROBLEM IS COMMON ENOUGH FOR SPECIALIZED TOOLS. PLEASE ACT ON THIS TO PREVENT SOME POOR INDIVIDUAL FROM BEING STRANDED!",
        "vin": "1G6RL1E4GU1"
    }
]