[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2017",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 5, 2016, MY SUV FAILED TO START, SO I CHECKED UNDER THE HOOD. THE BATTERY HAD EXTENSIVE CORROSION. I IMMEDIATELY CALLED AAA, AND THE TECHNICIAN REPLAVED THE BATTERY.   OCTOBER 5, 2016, I NOTICED THAT MY SUV WAS HESITANT TO START NORMALLY. AFTER INSPECTING MY BATTERY, A SMALL AMOUNT OF CORROSION WAS AGAIN PRESENT. ASSUMING THIS WAS MORE THAN A SIMPLE BATTERY ISSUE, I MADE AN APPOINTMENT AT MY LOCAL DEALERSHIP ' BRANDON FORD IN TAMPA, FL. I EXPLAINED THE TECHNICIAN MY RECENT HISTORY WITH THE BATTERY AND SHOWED HIM THE PICTURES. I EXPLICITLY INFORMED HIM THAT I DID NOT WANT A 'BAND-AID FIX' FOR THIS ISSUE. AFTER HIS ASSESSMENT, THE TECHNICIAN ADVISED THAT HE WOULD CLEAN THE CONNECTIONS AND INSTALL ANTI-CORROSION PADS AND THAT WOULD SOLVE THE ISSUE.   ON DECEMBER 30 2016, I VISITED BRANDON FORD BECAUSE MY VEHICLE'S 'CHECK ENGINE' LIGHT HAD BEEN ILLUMINATED, AND THE SUV WAS EXPERIENCING STUTTERING WHILE DRIVING BOTH ON MY RESIDENTIAL STREET AND ON THE HIGHWAY. A BIT OF CORROSION WAS PRESENT AGAIN. THE FORD TECH CALLED ME AFTER DIAGNOSING THE PROBLEM AND EXPLAINED TO ME THAT IT WAS GOING TO BE AROUND $400 TO FIX THE ISSUE ' A POOR ELECTRICAL CONNECTION ' BY REPLACING THE ENGINE HARNESS SIGNAL RETURN SPLICES. HE ALSO INFORMED ME THAT THIS WAS NOT COVERED BY WARRANTY. NONETHELESS, I CHOSE TO COMPLETE THE SERVICE.    ON FEBRUARY 9TH, I REACHED OUT TO FORD CUSTOMER SERVICE TO EXPLAIN MY ISSUE. I HAVE ATTACHED ALL CORRESPONDENCE TO AND FROM FORD. THEY DO NOT FEEL IT IS A WARRANTY OR MAJOR SAFETY ISSUE. I WISH TO HAVE THAT RE-EVALUATED.",
        "vin": "1FMCU0J94EU"
    }
]