[
    {
        "components": "STEERING,WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/24/2017",
        "dateOfIncident": "04/15/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10980314,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "RAM 2500",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT LEFT TIE ROD IN MY TRUCK BROKE CAUSING EXTENSIVE DAMAGE. IT PUNCTURED A TIRE IN THE SIDEWALK WHICH IS NOT REPAIRABLE , CRACKED A WHEEL WHICH THEY DO NOT MAKE ANYMORE SO NEED TO REPLACE 4 TO MATCH AND BENT OR BROKE EVERY SINGLE COMPONENT  IN THE STEERING LINKAGE SETUP. I HAVE MADE NUMEROUS ATTEMPTS FOR SOME HELP AND HAVE GOTTEN NONE. I HAVE SENT MULTIPLE EMAILS WITH NO REPLIES, TRIED THE CHAT SYSTEM ON THE MOPAR SITE AND THE PERSON (ALEX AV1129 EMPLOYEE NUMBER) WAS OF NO HELP EITHER. I HAVE PURCHASED A STEERING LINKAGE SETUP FROM LES SCHWAB FOR $649 BEFORE I KNEW THIS WAS A PAST RECALL ISSUE. I NEVER GOT ANY NOTIFICATION FOR THE RECALL OR DID I GET OFFERED THE BUY BACK OPTION. I ALSO CALLED MCCORD DODGE IN LONGVIEW WASHINGTON EXPLAINING MY ISSUE AND WAS TOLD BY A LAVONYA IN THE RECALL DEPT THERE'S NOTHING SHE CAN DO THIS IS AN ISSUE BETWEEN YOU AND CHRYSLER NOT YOU AND MCCORDS. I ALSO ASKED LAVONYA MY ADDRESS ON FILE AND SHE READ IT EXACTLY AND I RECEIVED NO NOTIFICATION FROM THEM EITHER. SHE WAS QUITE RUDE. SHE TOLD ME MOST PEOPLE DO ROUTINE MAINTENANCE AT MCCORDS AND THEY FIND OUT THESE ISSUES. I LET HER KNOW I DO MY OWN MAINTENANCE AND AM NOT REQUIRED TO DO BUSINESS WITH THEM SINCE MY WARRANTY HAS EXPIRED.    PLEASE HELP THANKS     [XXX]  [XXX]  [XXX]  [XXX]  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'*JB",
        "vin": "3D7KS28A48G"
    }
]