[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/13/2017",
        "dateOfIncident": "11/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995014,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "MKX",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE NEW IN 2013 AND 3 OF 4 DOOR SENSORS HAVE MALFUNCTIONED.  THE DOOR AJAR LIGHT IS ALWAYS ON SO MY DOORS WILL NOT LOCK WHILE DRIVING.  THIS IS A VERY SERIOUS CONCERN AS I HAVE SMALL CHILDREN AS PASSENGERS, ALSO GOD FORBID I AM IN A SITUATION WHERE I NEED TO LOCK MYSELF IN MY CAR FOR SOME REASON; I AM SCREWED!  THE ALARM CONSTANTLY GOES OFF IF I LOCK/ARM THE ALARM OR AND LOCK DOORS BECAUSE OF THE DOOR SENSORS.  THE DOME LIGHT ILLUMINATES AT RANDOM TIMES WHILE DRIVING, VERY ANNOYING WHILE DRIVING AT NIGHT, ANOTHER SAFETY ISSUE IN MY OPINION.  WHEN THE FIRST SENSOR STARTED ACTING UP I TOOK THE VEHICLE TO THE DEALER AND THEY QUOTED ME $420! AS IT STANDS RIGHT NOW I WOULD HAVE TO PAY OVER $1200 TO REPAIR FAULTY DOOR SENSORS ON A VEHICLE THAT IS LESS THAN 5 YEARS OLD.  I WAS SIMPLY TOLD BY THE FORD DEALER THAT I SHOULD HAVE PURCHASED AN EXTENDED WARRANTY AND THAT THE ISSUE IS NOT COVERED UNDER A RECALL BECAUSE IT IS NOT A SAFETY ISSUE.  AS A PARENT WITH TWO YOUNG CHILDREN I REFUSE TO ACCEPT THAT NOT BEING ABLE TO LOCK MY DOORS WHILE DRIVING IS NOT A SAFETY ISSUE.  FROM WHAT  I HAVE BEEN READING ONLINE MANY FORD AND LINCOLN MODEL CARS ARE EXPERIENCING THE SAME ISSUES.  SOMEONE NEEDS TO HOLD FORD/LINCOLN ACCOUNTABLE AND MAKE THEM FIX THIS ISSUE AT NO CHARGE TO THE CONSUMER.  I ALREADY PAID THEM A HEFTY PRICE TO PURCHASE THE VEHICLE LESS THAN 5 YEARS AGO.  THERE IS ABSOLUTELY NO REASON ALL OF THESE MECHANISMS SHOULD BE FAILING OR ALREADY FAILED IN SUCH A SHORT AMOUNT OF TIME.  THIS IS UNACCEPTABLE!!!      * 11/01/2015 IS THE APPROXIMATE DATE WHEN SYMPTOMS/ISSUES FIRST BEGAN.",
        "vin": "2LMDJ6JK6DB"
    }
]