[
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10995514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 1, 2017: I TOOK MY 2014 FORD FOCUS ST, WITH ~10,500K MILES ONLY 4 MONTHS OUT OF WARRANTY, TO A DEALERSHIP FOR AN OIL CHANGE AND WARRANTY RECALLS.    JUNE 2, 2017: THE DEALERSHIP INFORMED ME THAT WHILE REPROGRAMMING THE BCM, BODY CONTROL MODULE, THE COMPUTER WAS WIPED AND THE CAR WOULD NOT START. THE DEALERSHIP SAID THEY ATTEMPTED TO REPROGRAM IT AGAIN BUT DID NOT WORK BUT THAT THEY HAD OPENED A TICKET WITH FORD'S TECHNICAL SUPPORT. THE DEALERSHIP PROVIDED A LOANER CAR TO ME FOR THE WEEKEND.     JUNE 6, 2017: THE DEALERSHIP CALLED TO TELL ME THEY STILL HAD NOT RECEIVED A FIX FROM FORD AND THAT FORD KNEW OF THE ISSUE AND HAD REPLIED THAT THEY WOULD PROVIDE AN UPDATE WITHIN 7 BUSINESS DAYS. I WAS TOLD TO KEEP THE LOANER CAR UNTIL THE WORK WAS COMPLETE. I CALLED FORD'S SERVICE LINE TO ATTEMPT TO ESCALATE THE ISSUE. I WAS PROVIDED THE CASE NUMBER, AS REFERENCED, AND TOLD TO TALK TO THE DEALERSHIP'S SERVICE MANAGER. THE SERVICE MANAGER TOLD ME THAT UNFORTUNATELY THERE WAS NOTHING HIS TECHNICIANS COULD DO BUT TO WAIT FOR A FIX FROM FORD.    JUNE 15, 2017: I CONTACTED FORD SERVICE LINE AGAIN AND THE CASE WAS ESCALATED TO A REGIONAL MANAGER. THEY INFORMED ME THAT FORD DOES NOT HAVE A FIX AND THAT FORD HAS NO TIMELINE FOR A FIX.    THE VEHICLE IS STILL NON-FUNCTIONAL. FORD HAS TOLD ME THEY HAVE NO FIX AND NO TIMELINE FOR A FIX. THE DEALERSHIP IS WAITING ON FORD TO PROVIDE A FIX AS IT'S A COMPUTER ISSUE AND THE DEALERSHIP CANNOT DO ANYTHING TO SOLVE IT.",
        "vin": "1FADP3L91EL"
    }
]