[
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "05/05/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10003175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "JIMMY",
                "productYear": "1993",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "PHANTOM A/P",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TREAD SEPERATION IN PHANTOM A/P TIRE THAT WAS MANAUFACTURED WITHIN TIME PERIOD OF NHTSA ACTION #PE02056.  SUBSTANTIAL PHYSICAL INJURY TO 72 YEAR OLD DRIVER AND TOTAL LOSS OF VEHICLE.  RIMKUS CONSUTLING SERVICES EXPERT GARRET MITCHELL MADE THE FOLLOWING CONCLUSIONS:     1.A DEFECT IN THE LEFT-REAR TIRE ON THE CHEVROLET CAUSED THE TREAD TO SEPARATE FROM THE CARCASS.  THE NATURE OF THE FAILURE IS CONSISTENT WITH CONTAMINATION OR IMPROPER VULCANIZATION OF THE TIRE COMPONENTS DURING MANUFACTURING.     2.                 THE SUDDEN FAILURE OF THE TIRE CAUSED THE DRIVER TO LOSE CONTROL OF THE VEHICLE AND SUBSEQUENTLY COLLIDE WITH A SOLID OBJECT.    \"THERE WAS A PRESENCE OF POLISHING AND BLUING ON THE RUBBER CARCASS OF THE TIRE [WHICH INDICATED] OVERHEATING OF THE TIRE. . . . IF EVIDENCE OF OVERHEATING IS OBSERVED AROUND THE ENTIRE CIRCUMFERENCE OF THE TIRE, FLEXING OF THE TIRE DUE TO OVERLOADING OR UNDER-INFLATION IS INDICATED.  IN THIS CASE, HOWEVER, THE EVIDENCE OF OVERHEATING IS LIMITED TO ONE AREA OF THE TIRE, SPECIFICALLY THE AREA WHERE THE TREAD BEGAN TO SEPARATE FROM THE CARCASS.  THIS INDICATES LOCALIZED OVERHEATING DUE TO FRICTION BETWEEN ADJACENT TIRE COMPONENTS WAS TAKING PLACE IN THIS AREA.  FURTHERMORE, THE REMAINING TREAD IN THIS AREA IS UNEVENLY WORN, INDICATING A DISCONTINUITY IN THE TIRE STRUCTURE AT THIS LOCATION.  THESE OBSERVATIONS INDICATE THE COMPONENTS OF THE TIRE WERE NOT PROPERLY BONDED TOGETHER IN THE AREA WHERE THE TREAD SEPARATION BEGAN.\"",
        "vin": ""
    }
]