[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/08/2017",
        "dateOfIncident": "07/08/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11003814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "TERRAIN",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A SNOW STORM IN MARCH MY WINDSHIELD WIPERS JUST STOPPED WORKING WHILE DRIVING! LUCKILY, I WAS ABLE TO RETURN HOME SAFELY SINCE I WAS JUST AROUND THE CORNER. I WENT TO UNION PARK AND GOT THE ISSUE FIXED FOR $110.00. I HAD TO PAY FOR IT SINCE UNION PARK TOLD ME I HAD 38,000 MILES ON MY LEASE AND THE WARRANTY RUNS OUT AT 36,000. THEN DURING A RAIN STORM IN LATE JUNE MY WIPERS STOPPED WORKING AGAIN ON THE BLUE ROUTE. I PULLED OVER UNTIL IT STOPPED RAINING AND MADE IT HOME SAFELY.    I THEN TOOK THE CAR TO SEARS AUTOMOTIVE WHERE THEY TOLD ME THEY COULD NOT TOUCH IT BECAUSE THIS PART WAS RECALLED BY GMC. THE SUBJECT OF THE ALLDATA REPAIR SITE STATES '#15789- WINDSHIELD WIPER MOTOR FAILURE (OCT 26, 2015)'  IN AUGUST OF 2016 GMC RECALLED 368,000 GMC TERRAIN AND CHEVY EQUINOX SOLD IN 2013 DUE TO FAULTY WINDSHIELD WIPERS. THE DEFECT IN THE 2013 MODELS WERE NOT DISCOVERED UNTIL LATE 2015, AND I BOUGHT MY CAR BRAND NEW IN APRIL OF 2015, LEADING ME TO SUGGEST THE SAME ISSUE HAPPENED IN MY MODEL. THE ALLDATA REPAIR REPORT GIVEN TO ME BY SEARS AUTO STATS THAT A SIMILAR RECALL WAS MADE ON OCT 26 OF 2015.  I TOOK THIS INFORMATION TO UNION PARK SERVICE CENTER AND THE ASSISTANT SERVICE DIRECTOR JAMES ASKREN REFUSED TO LOOK AT THE DATA REPORT FROM SEARS AND STATED THAT THE CAR WAS NOT UNDER WARRANTY. WHEN I TOLD HIM TO JUST CHARGE ME AND WE WILL HAVE THE COURTS DECIDE WHO IS LIABLE FOR THE REPAIR COSTS HE REFUSED TO FIX THE CAR, LEAVING ME WITH A CAR THAT HAS NO WINDSHIELD WIPERS UNTIL HIS CALLED ME ON MONDAY.   NO OTHER REPAIR CENTER WILL LOOK AT MY CAR SINCE IT IS UNDER WARRANTY, AND GMC WON'T TOUCH MY CAR BECAUSE I THREATENED LEGAL ACTION.   I AM FORCED TO RENT A CAR TO GET TO AND FROM WORK WHILE GMC REFUSES TO FIX MY CAR.",
        "vin": "2GKALREK8F6"
    }
]