[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "11/11/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK DELIVERY 10/20/15.  LESS THAN ONE MONTH LATER ON 11/11/15, THE TRUCK BEGAN TO HAVE A PRETTY STRONG JERK UPON ACCELERATION AND/OR SLOWING DOWN MAKING IT FEEL LIKE YOU COULDN'T STOP COMPLETELY AND/OR THAT YOU WERE BEING REAR ENDED.  IN FACT ON 4/8/16, IT JERKED ME UP ONTO A CONCRETE STOPPER AT TACO BELL, IN DADE CITY, FL.  ONE YEAR LATER, UPON ACCELERATION A CLUNKING NOISE IN THE REAR END STARTED HAPPENING.  SO ON 10/10/16 (ONE YEAR LATER), 25,000 MILES LATER, AND AFTER NUMEROUS TIMES IN/OUT OF THE SHOP, WHERE THE TECHS CLAIMED THEY COULDN'T DUPLICATE IT OR SAID \"THAT WAS THE WAY THE TRANSMISSION WORKED AND THAT THEY HAD NUMEROUS COMPLAINTS FROM OTHER DODGE RAM TRUCK DRIVERS ABOUT THE SAME THING, INCLUDING EMPLOYEES THAT OWNED THEM\" THEY SAID THE DRIVESHAFT SLIP STICK WAS CAUSING THE CLUNKING, SO THEY REPLACED THE DRIVESHAFT OR PROPELLER SHAFT.  THE CLUNKING AND JERKING STOPPED.  FOUR MONTHS LATER ON 2/23/17 THE SAME STRONG JERKING STARTED AGAIN.  TECHS CONTINUALLY STATED THEY COULD NOT DUPLICATE THE JERKING, BUT THE MINUTE I WOULD LEAVE THE DEALERSHIP IT WOULD JERK.  I HAVE A DISABLED PLACARD AND FREQUENTLY PARK IN A DISABLED SPOT.  UPON PULLING UP, THE TRUCK JERKS FORWARD AND I'VE NEARLY HIT THE DISABLED POLE.  MY FEAR IS THAT IT IS GOING TO JERK FORWARD AND CAUSE ME TO HIT ANOTHER VEHICLE OR WORSE YET, A PERSON IN A CROSSWALK.  PLEASE NOTE:  I DO NOT HAVE A WAY TO UPLOAD ANY DOCUMENTS FROM HOME, BUT WOULD BE HAPPY TO FROM WORK, IF YOU NEED THEM.  I HAVE ALL OF MY RECEIPTS AND HAVE DOCUMENTED EVERYTHING.",
        "vin": "1C6RR6GT5FS"
    }
]