[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/28/2017",
        "dateOfIncident": "08/05/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11020214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FUSION",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD 2 INCIDENTS OF ABS ENGAGEMENT FOLLOWED BY LOSS OF BRAKES, WHERE PEDAL WENT DOWN TO THE FLOOR. FIRST TIME WAS IN FEBRUARY OF THIS YEAR. ROAD CONDITIONS WERE SLICK AND THE CAR SLID SLIGHTLY. ABS WAS ACTIVATED AND THEN THERE WAS LOSS OF BRAKES. HAD THE CAR TOWED TO A LOCAL MECHANIC AND THE WHOLE BRAKE SYSTEM WAS INSPECTED. ALL THAT WAS FOUND WAS SOME AIR IN THE LINES AND BRAKE PRESSURE CAME BACK. ROTORS, PADS, CALIPERS, MASTER CYLINDER WERE FINE.  SECOND INCIDENT HAPPENED AUGUST 5TH WHILE GOING ON VACATION. WAS ABOUT AN HOUR FROM HOME WHEN I SLOWED DOWN TO GO THROUGH A TOLL BOOTH. ROAD WAS WET AND I HIT A SLIGHT BUMP GOING THROUGH THE TOLL. AFTER I GOT THROUGH THE TOLL, BRAKE PEDAL SUNK TO THE FLOOR! I THEN EXITED THE TURNPIKE AND HEADED BACK HOME AND DROVE IT BACK AN HOUR WITH NO BRAKE PRESSURE. FORTUNATELY IT WAS EARLY MORNING AND TRAFFIC WASN'T HEAVY. I GOT HOME, SWITCHED ALL OF THE LUGGAGE INTO MY OTHER CAR AND I CALLED A FRIEND WHO WORKS ON CARS AND HE SAID I COULD DROP IT OFF AND HE WOULD LOOK AT IT WHILE WE WERE ON VACATION. WHILE HE HAD IT, THE BRAKE PRESSURE CAME BACK. BUT AGAIN ENTIRE BRAKING SYSTEM WAS INSPECTED AND NOTHING WRONG WAS FOUND. THERE HAS TO BE A GLITCH IN THE ABS. THE FIRST FIVE YEARS I HAD THE CAR, NOTHING LIKE THIS EVER HAPPENED. OTHER ON LINE POSTINGS I'VE READ DESCRIBE SIMILAR SITUATIONS HAPPENING WHEN THE VEHICLE HAS 60,000 OR MORE MILES ON IT. MY VEHICLE IS AT 60,000. FORD NEEDS TO LOOK INTO THIS! DOES SOMEONE HAVE TO GET SERIOUSLY INJURED OR KILLED BEFORE THEY TAKE ANY ACTION?",
        "vin": "3FAHP07Z19R"
    }
]