[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2017",
        "dateOfIncident": "06/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022514,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ACADIA",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMOBILE STALLED WHILE DRIVING AND WOULD NOT START.  SERVICE COMPLETED AT CHEVROLET DEALERSHIP ON JUNE 12 TO REPLACE FUEL PUMP CONTROL MODULE, WHICH WAS A RECALLED PART ON GMC ACADIA'S.  I CALLED GM AND WAS INFORMED MY VIN WAS NOT PART OF RECALL AND WAS TOLD I WOULD BE CALLED BACK WITH AN EXPLANATION WHY.  I NEVER RECEIVED A RETURN PHONE CALL.  CAR STALLED AGAIN WHILE DRIVING AND WOULD NOT START.  SERVICE COMPLETED AT GMC DEALERSHIP ON AUGUST 12 TO REPLACE FUSE BLOCK THAT CONTROLS FUEL PUMP.    APPROXIMATELY 2 WEEKS LATER CAR STALLED WHILE DRIVING, THEN RESTARTED.  RETURNED CAR TO CHEVROLET DEALERSHIP FOR SERVICE.  THEY HELD CAR 8 DAYS BUT COULD NOT FIND SOURCE OF PROBLEM, THOUGH THOUGHT IT WAS THE FUEL PUMP.  CAR STALLED AGAIN ON SEPTEMBER 8 THEN RESTARTED.  BROUGHT TO CHEVROLET DEALERSHIP FOR SERVICE BUT AGAIN THEY FOUND NO SERVICE CODE.  WAS INFORMED WITH THE NUMBER OF MILES ON VEHICLE, 60,100, I SHOULD NOT BE HAVING THESE ISSUES.  CAR STALLED AGAIN ON SEPTEMBER 10 AND WILL NOT RESTART.  WILL NEED TO, AGAIN, BRING IN FOR SERVICE.  COMPLAINT IS IN REGARD TO VEHICLE RECALL FOR MY YEAR AND MODEL, BUT NOT FOR MY SPECIFIC VIN, EVEN THOUGH RECALL PROBLEM EXISTS WITH MY VEHICLE.  HAVE HAD CAR SERVICED AT GM DEALERSHIPS TWICE AT EXPENSE OF OVER $1,000 FOR THE SAME ISSUE AND ISSUE PERSISTS.  GM HAS NOT RESPONDED AND GM DEALERSHIPS HAVE BEEN UNABLE TO SOLVE PROBLEM.",
        "vin": "1GKKRNED0CJ"
    }
]