[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/12/2017",
        "dateOfIncident": "08/31/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045414,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED SHAKING/VIBRATING HEAVILY WHEN SITTING IN TRAFFIC ON A BUSY HIGHWAY JUST THREE WEEKS AFTER PURCHASE WITH THE CHECK ENGINE LIGHT GOING ON THE SAME DAY.  IT CONTINUE TO HAVE THUMP/SHAKE/VIBRATION WHEN IDLING (PARKED OR STOP LIGHT) AND GOING AT REDUCED SPEEDS (ROLLING OFF THE GAS PEDAL WHEN PARKING OR IN HEAVY TRAFFIC) AFTER MULTIPLE VISITS TO THE DEALERSHIP.  THE VIBRATION SEEMS TO BE ASSOCIATED WITH A CONTINUOUS SUDDEN DIP IN THE RPM AS IT DIPS AND GOES BACK TO TO WHERE IT WAS.  THE DEALERSHIP HAS ADJUSTED THE RPM SETTINGS MULTIPLE TIMES AND THE ISSUE SHIFTS FROM VIBRATION TO THUMPING BUT DOES NOT DISAPPEAR, CLEARLY NOT RESOLVING THE ROOT CAUSE.  CURRENTLY, I'VE OWNED THE VEHICLE FOR 3 MONTHS AND BELIEVE THERE WILL BE A RECALL FOR SOMETHING IN THE NEAR FUTURE AS A NEW CAR SHOULD NOT HAVE THESE SORT OF ISSUES OUT OF THE GATE.     TIMELINE:   PURCHASED:  8/7/2017  CHECK ENGINE LIGHT TURN ON:  8/31/17  1ST DEALERSHIP VISIT: 9/1 (FOUND DTC FOR P0300 BUT COULD NOT REPLICATE ISSUE AND CHANGED NOTHING)  2ND VISIT: 10/2:  READJUSTED IDLE SPEED AS PER BULL # NTB15-048A   3RD VISIT: 10/21: INCREASED IDLE TO 670   VEHICLE NOW OPERATES WITH LESS POWER AND RPM STILL DIPS AND SURGES (LESS FREQUENTLY BUT STILL OCCURS)  CONTACTED NISSAN FOR REPLACEMENT OR RE-PURCHASE AND WAS DENIED PER DEALERSHIP COMMENTS.  THEY RECOMMENDED I TAKE TO A DIFFERENT DEALERSHIP  4TH VISIT:  10/28:  COULD NOT REPLICATE, NO CHANGES MADE     AT THIS POINT, I AM REACHING OUT TO YOU AND BBB.  I BOUGHT THIS CAR WITH THE FULL INTENTION OF KEEPING FOR 10+ YEARS, BUT FEEL UNSAFE DRIVING THIS VEHICLE ESPECIALLY CONSIDERING I LIVE IN THE NYC TRI STATE AREA AND TRAFFIC IS JUST A FACT OF LIFE.",
        "vin": "JN8AT2MV9HW"
    }
]