[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "06/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAVERSE",
                "productYear": "2010",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON IN CAR. CODE STATED THAT IT WAS THE FUEL PUMP CONTROL MODULE. WHEN I RESEARCHED THIS ISSUE I FOUND WHERE GM RECALLED HUNDREDS IF NOT THOUSANDS OF VEHICLES TO INCLUDE CHEVY TRAVERSES DURING THE 2010 MODEL YEAR BECAUSE OF FAULTY FUEL PUMP CONTROL MODULES OR (CHASSIS ELECTRONIC CONTROL MODULES). GM RECALL, BULLETIN # 14515B. I SPOKE TO SEVERAL GM DEALERS IN TOWN WHO GAVE ME THE RUN AROUND ABOUT HOW THIS WAS NOT A SAFETY RECALL BECAUSE OF FAULTY PARTS BUT AN \"INFORMATIONAL BULLETIN\". LONG STORY SHORT I HAD TO PAY 300 DOLLARS TO GET A NEW MODULE PROGRAMMED. THE DAMAGE WOULD HAVE BEEN A LOT WORSE IF I WOULD HAVE LET THEM RUN MORE DIAGNOSTICS PRIOR TO FIXING THE ISSUE. I COMPLAINED TO GM WHO SAID THERE WAS NO RECALL ON MY VEHICLE AND REFERRED ME TO NHTSA.     FROM WHAT I UNDERSTAND THE MODULE CAN BECOME CONTAMINATED BECAUSE OF WET CONDITIONS. ON JUNE 12, 2017 CHEYENNE WY HAD A VERY LARGE HAIL STORM THAT MY VEHICLE WAS CAUGHT IN WHILE DRIVING IN THE CITY AND THE MODULE MAY HAVE GOTTEN WET CAUSING THE PROBLEM.     MY COMPLAINT IS THAT GM RECALLED THIS SAME PART ON ALL THESE OTHER VEHICLES TO INCLUDE 2010 TRAVERSES BUT FOR WHAT EVER REASON MY VIN NUMBER IS NOT INCLUDED. I BELIEVE IT SHOULD BE BECAUSE MY VEHICLE HAD THE EXACT SAME ISSUE AS TO WHY THEY RECALLED ALL THESE OTHERS. I STILL HAVE THE FAULTY MODULE IF ANYONE WANTS TO CHECK IT OUT BECAUSE IT IS THE SAME PART AND PART NUMBER WHICH WAS RECALLED.    MY VEHICLE SHOULD BE INCLUDED IN THIS RECALL AND I SHOULD BE REIMBURSED MY MONEY FOR THIS REPAIR.",
        "vin": "1GNLVFED3AJ"
    }
]