[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "01/18/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003209,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING 30 MILES AT HIGHWAY SPEED, I STOPPED TO EXIT THE HIGHWAY. WHEN I BEGAN TO TURN LEFT,  I HEARD A LOUD CLANK IN THE REAR OF THE VEHICLE.  I CONTINUED FOR ABOUT 5 MORE MILES AND PARKED THE VEHICLE.  AFTER ALLOWING THE VEHICLE TO REST FOR APPROX. 8 HOURS,  I BACKED THE VEHICLE OUT AND BEGAN DRIVING HOME.  THE DRIVE WAS APPROX. 30 MILES AT 75-80 MPH.  IAFTER STOPPING TO EXIT THE HIGHWAY,  THE TRANSMISSION MADE A LOUD WHINNING NOIES AS THOUGH IT WAS SLIPPING, THE ENGINE REVED TO ABOUT 3000RPM BEFOR ETHE TRANSMISSION WOULD SHIFT.  THIS HAPPEN EVER TIME I EXCELLERATED FROM A STOP OR FROM SLOW COASTING (3 MORE TIMES IN 6 MILES).  WHEN I ARRIVED HOME,  I CHECKED THE FLUID LEVEL,  IT WAS FINE AND THERE WAS NO DISCOLORATION OF THE OIL OR ANY ABNORMAL SMELL. WHEN I ATTEMPTED TO BACK THE VEHICLE,  IT WOULD NOT GO INTO REVERSE,  I WOULD DRIVE FORWARD,  BUT THE SLIPPING CONTINUED WHEN IT WAS ROAD TESTED BY THE REPAIR SHOP.  I LOADED THE VEHICLE ON A TRAILER AND TRAILERED IT TO A REPAIR SHOP.  THE FOLLOWING WAS FOUND TO HAVE FAILED.  THE SUNSHELL FAILED CAUSING DEBRIS TO BE CIRCULATED THROUGH THE TRANSMISSION.  THE REVERSE GEAR DID NOT FUNCTION ANYMORE,  THE TORQUE CONVERTER WAS CONTAMINATED WITH DEBRIS AND HAD TO BE REPLACED AS IT COULD NOT BE CLEANED LOCALLY.  SPRAGE AND NUMEROUS GEARS AND BANDS WERE DAMAGED AS A RESULT.  TOTAL COST OF REPAIR WITH LABOR AND TAX....$2453.17.   THERE WAS NO WARNING OR CONDITION THAT LEAD UP TO THE FAILURE.  THE VEHICLE ONLY HAS 65,600 MILES ON IT.  PRETTY SAD PERFORMANCE FOR A TRANMISSION DESIGNED FOR THIS TYPE VEHICLE.",
        "vin": "3GNEK18R5VG"
    }
]