[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2017",
        "dateOfIncident": "06/19/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051514,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G6",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IN MY 2009 G6 FAILED WITHOUT ANY WARNING. I WAS AT AN INTERSECTION AND PULLED ONTO A VERY BUSY ROAD. AFTER GOING ABOUT 200 FEET, THE ENGINE REVVED, BUT THE CAR WAS NOT \"PULLING\". OTHER CARS CAME UP BEHIND ME VERY QUICKLY AND NEARLY CAUSED AN ACCIDENT. THERE WAS NO PLACE FOR ME TO PULL OVER, AND THERE WAS A SLIGHT HILL AHEAD OF ME.  I \"PLAYED\" WITH THE GAS PEDAL TO TRY TO GET THE CAR'S TRANSMISSION TO CATCH, ALL THE WHILE CARS WERE PRACTICALLY PUSHING ME. THEY PROBABLY THOUGHT THAT I HAD PULED OUT AND WAS JUST DRIVING VERY SLOWLY. THEY STARTED TO HONK THEIR HORNS. THE CAR'S TRANSMISSION BUCKED AND BANGED AND I MADE IT TO THE TOP OF THE HILL, AND OVER TO A SPOT ALONG SIDE THE ROAD WHERE I COULD PULL OVER. THE COMPUTER HAD PUT UP TWO ERROR CODES OF P0776 (CONTROL SOLENOID VALVE 2 STUCK OFF), AND P0700 (TRANSMISSION CONTROL MODULE REQUESTED MIL ILLUMINATION). I DID A SEARCH ONLINE AND FOUND THAT THIS LIKELY WAS A FAILURE OF THE \"3, 5, REVERSE PLATE\" INSIDE THE TRANSMISSION. THIS IS A KNOWN DEFECT WITH THIS PARTICULAR CAR AND TRANSMISSION. GENERAL MOTORS IS AWARE OF THIS DEFECT AND HAS EVEN EXTENDED THE WARRANTY ON THIS FAILURE FOR 2007 TO 2009 PONTIAC G6'S FOR UP TO 10 YEARS OR 120,000 MILES. I PURCHASED MY CAR NEW ON 12/20/09, AND IT HAD 100,160 MILES ON IT WHEN THIS HAPPENED. I CALLED GM (CASE #[XXX]) AND THEY CLAIMED THAT MY TRANSMISSION HAS A CODE OF MH8. THEY SAID ONLY TRANSMISSIONS WITH A BUILD CODE OF MH2, MH4, MH6, AND MY9 ARE COVERED. THEY TOLD ME THAT THE TRANSMISSIONS ARE IDENTICAL, BUT \"MORE THAN LIKELY SOMEONE WAS KILLED WHEN THIS FAILURE OCCURRED IN CARS WITH THOSE CODES, AND PROBABLY THIS WASN'T THE CASE FOR MY CODE\". THEY SUGGESTED THAT I CONTACT NHTSA TO FILE A COMPLAINT SO THAT MY TRANSMISSION CODE COULD BE COVERED, AND GET REIMBURSED. I DID HAVE THIS FIXED. IT WAS THE 3, 5, REVERSE PLATE AND IT COST ME $2442.38 (SEE ATTACHED). *LN      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "1G2ZG57B994"
    }
]