[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/13/2017",
        "dateOfIncident": "11/03/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11054614,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "CANYON",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2015 GMC CANYON LOST POWER STEERING TRAVELING APPROXIMATELY 50MPH ON A MOUNTAIN ROAD ON ONE OF THE FIRST RAINY DAYS OF THE SEASON. IT FELT LIKE LOSING MORE THAN JUST STEERING ASSISTANCE, AS EVEN AT THAT RATE OF SPEED THE WHEEL WAS NEARLY IMPOSSIBLE TO TURN. I WAS LUCKY TO BE ON ONE OF THE LIMITED SECTIONS OF STRAIGHT ROAD. REBOOTING THE VEHICLE RETURNED STEERING FUNCTIONALITY.    DEALER FOUND CODE \"C0545 - STEERING TORQUE SENSOR\" AND PERFORMED SAFETY RECALL #15595 WHERE THEY REPLACED THE TORQUE SENSOR COVER. I WAS CHARGED $200 FOR THE REPAIR DESPITE THE RECALL NOTICE EXPLICITLY STATING IT SHOULD BE PERFORMED FREE OF CHARGE. I HAVE NOT EXPERIENCED LOSS OF POWER STEERING IN THE MONTH SINCE THE REPAIR.    I CONTACTED THE GM REGIONAL REP, WHO STATED THAT CARS CAN HAVE THE SAME PROBLEM AS A SAFETY RECALL, AND THE SAME SOLUTION AS A SAFETY RECALL, BUT NOT BE PART OF THE SAFETY RECALL. THAT WAS THE JUSTIFICATION FOR THE $200 CHARGE AND THE DENIAL OF REIMBURSEMENT. GM FURTHER STATED THAT THEY DON'T DETERMINE THE CRITERIA FOR A SAFETY RECALL, IT IS ALL UP TO THE NHTSA. IN OTHER WORDS, THEY WON'T DO THE RIGHT THING UNLESS THE GOVERNMENT FORCES THEM TO.    IN MY OPINION AS AN ENGINEER, SENSOR + RAIN SOUNDS LIKE A PLAUSIBLE MATCH FOR THE SYMPTOMS AND THE PROBLEM IDENTIFIED BY THE SAFETY RECALL THAT THE DEALER PERFORMED. I QUESTION WHETHER THE RECALL IS MISSING SOME VIN NUMBERS, OR IF A VERY SIMILAR BUT INDEPENDENT PROBLEM EXISTS ON THE SAME COMPONENTS, WARRANTING A SEPARATE RECALL.",
        "vin": "1GTG6BE30F1"
    }
]