[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "01/19/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003221,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "LEXUS",
                "productModel": "RX300",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE NOTICED A CHECK ENGINE LIGHT ON AS SHE WAS DRIVING TO WORK. SHE CALLED ME ON THE CELL PHONE AND WE TOOK THE CAR TO LEXUS OF CLEARWATER. I RECIEVED A PHONE CALL SAYING THEY HAD DETECTED SLUDGE IN THE ENGINE AND IT WOULD NEED TO BE FIXED. THEY TOLD ME THEY MIGHT COVER IT UNDER WARRANTY BECAUSE IT WAS A KNOWN ISSUE BUT THEY WOULD CALL ME BACK. I ALSO CHECKED THE WEBSITE AND LEXUS KNOWS OF THE PROBLEM AND SAYS THEY WILL STAND 100% BEHIND THE CUSTOMER FOR 8 YRS AND UNLIMITED MILES. NO OTHER REQUIRENMENT IS LISTED. MELISSA THE SERVICE PERSON SAID SHE WANTED ME TO TALK TO MARK THE REGIONAL GUY FROM LEXUS BECAUSE THEY WERE NOT GOING TO COVER IT AND THE REPAIR WOULD BE FROM 8K-12K!!!! I TOLD THEM THEY WERE CRAZY BECAUSE WE HAVE HAD EVERY MAJOR SERVICE REQUIRED BY LEXUS AND THAT OIL DOES NOT JUST BREAK DOWN IN A 3 YEAR OLD CAR. MARK TOLD ME HE HAD A HARD TIME COVERING THIS BECAUSE WE WERE OVERDUE BY 5K ON THE OIL CHANGE. I EXPLAINED IF THEY HAD KNOW OF A SLUDGE PROBLEM 8,000 MILES AGO WHEN THEY CHANGED THE OIL WHY DID WE NOT GET NOTIFIED. REGARDLESS I TOLD THEM A CARS ENGINE IS NOT RUINED BECAUSE A PERSON DRIVES A FEW THOUSAND EXTRA MILES. I TOLD HIM THE CAR IS 3 YEARS OLD AND WE WERE RETURNING THE CAR IN MARCH 28 AT THE LEASE EXPIRATION. HE TOLD ME HE COULD GET IT WAIVED FOR ME IF I SPOKE TO THE SALES MANAGER ABOUT PURCHASING ANOTHER LEXUS. I TOLD HIM I WAS NOT READY TO PURCHASE ANOTHE CAR AND DID NOT WANT THE PRESSURE OF HAVING TO BUY A NEW CAR TO GET SOMETHING FIXED THAT SHOULD BE FIXED FOR FREE. I THEN CALLED LEXUS CUSTOMER SERVICE AND NOTED A COMPLAINT. THE GIRL I BELIEVE DENISE TOLD ME SHE WAS GOING TO LOOK AGAIN OVER THE FILE AND ASK MARC FOR A CUSTOMER GOOD FAITH REPAIR. I CALLED YESTERDAY AND LEFT A MSG FOR MARC AND CALLED LEXUS AGAIN TODAY. SO FAR I HAVE NO RESPONSE. I WAS A LEXUS FAN BUT THIS HAS RUINED MY DAY",
        "vin": "JT6GF10U4Y0"
    }
]