[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2018",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064214,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X3",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-CONTACT OWNS A 2011 BMW X3 . VEHICLE WAS BOUGHT USED LAST YEAR. CONTACT WENT ONLINE AND SAW TWO RECALLS ON VEHICLE. CONTACT CALLED BMW AND BMW DEALERSHIP STATED THEY ARE NOT RESPONSIBLE FOR A PREVIOUS RECALL. CONTACT HAD A VACCUM OIL LEAK IN CAR DUE TO PCV VALVE LEAK. BMW DEALERSHIP STATED PCV VALVE WAS ALREADY REPLACED ON VEHICLE. RECALL STATES REMEDY NOT YET AVAILABLE.    CONTACT GIVEN NUMBER TO BMW .     2 RECALLS ASSOCIATED WITH THIS VIN    MAY 19,2016   MANUFACTURER RECALL NUMBER NA  NHTSA RECALL NUMBER 16V333  RECALL STATUS RECALL INCOMPLETE  SUMMARY ISOFIX BRACKET: VEHICLES HAVE BEEN EQUIPPED WITH LOWER ANCHOR BARS FOR USE IN ATTACHING CHILD RESTRAINT SYSTEMS WHICH, IF SPECIFICALLY USED WITH EUROPEAN-ISOFIX-TYPE RIGID-STYLE CONNECTOR CHILD RESTRAINT SYSTEMS, COULD BECOME DAMAGED DURING VEHICLE OPERATION.     SAFETY RISK IF THE LOWER ANCHOR BAR(S) BECOME DAMAGED DURING VEHICLE OPERATION, THIS WOULD INCREASE THE RISK OF INJURY TO A CHILD IN A CHILD RESTRAINT SYSTEM ATTACHED TO THE LOWER ANCHOR BARS IN A CRASH.    REMEDY THE REMEDY IS AVAILABLE. A REINFORCING BRACKET WILL BE WELDED TO THE LOWER ANCHOR BARS AND THE VEHICLE BODY.         OCT 30,2017   MANUFACTURER RECALL NUMBER NA  NHTSA RECALL NUMBER 17V683  RECALL STATUS RECALL INCOMPLETE, REMEDY NOT YET AVAILABLE  SUMMARY POSITIVE CRANKCASE VENTILATION (PCV) VALVE HEATER : THIS RECALL INVOLVES AN ENGINE COMPONENT KNOWN AS THE POSITIVE CRANKCASE VENTILATION (PCV) VALVE HEATER. THE PCV VALVE HEATER MAY NOT HAVE BEEN PRODUCED TO SPECIFICATIONS. OVER TIME, IT COULD DETERIORATE AND, IN RARE CASES, COULD LEAD TO OVERHEATING.     SAFETY RISK IF OVERHEATING OCCURS, THEN IN RARE CASES, THIS COULD LEAD TO MELTING OF THE PCV VALVE. IN EXTREMELY RARE CASES, THIS COULD LEAD TO A FIRE.",
        "vin": "5UXWX5C51BL"
    }
]