[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/23/2018",
        "dateOfIncident": "02/07/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11074514,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TAURUS",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING VEHICLE WHEN ALL OF A SUDDEN THE DASHBOARD LIGHTS STARTED FLASHING AND DISPLAYING ERRORS LIKE \"STEERING ASSIST FAULT...SERVICE REQUIRED\" ETC.  ALSO AT THIS TIME THE POWER STEERING WENT COMPLETELY OUT AND THE VEHICLE WAS VERY HARD TO TO STEER WHICH ALMOST RESULTED IN BAD ACCIDENT.  THE CAR WAS TAKEN TO FORD AND THEY ARE STATING THAT THE FIX FOR THIS IS REPLACING THE WHOLE STEERING RACK DUE TO A CODE (U300) THEY PULLED FROM THE CAR'S COMPUTER.  THIS IS A $2000 REPAIR!!!  I DID SOME RESEARCH MYSELF AND FOUND WHERE THIS ISSUE HAS BEEN GOING ON FOR SOME TIME NOW AND FORD HAD ISSUED A RECALL (15S18) BUT THE DEALER STATES THAT THIS VEHICLE IS NOT COVERED BY THE RECALL DUE TO IT'S BUILD DATE (FEB 3 2013).  NOW IF THIS ISSUE WAS SUPPOSEDLY CORRECTED FOR LATER MODEL CARS..... WHY IS THIS CAR AMONG OTHERS I HAVE RESEARCHED STILL EXPERIENCING THE SAME ISSUES AS NOTED BY THE RECALL??  COULD IT BE THAT A GENERATION ONE STEERING RACK WAS USED DURING THE BUILD OF THIS LATER MODEL CAR INSTEAD OF A GEN 2, 3, ETC?  I EVEN ASKED THE SERVICE MANAGER COULD HE GUARANTEE THAT THE NEW STEERING RACK HE'D INSTALL WOULD PREVENT US FROM HAVING A VERY CLOSE CALL ACCIDENT AS BEFORE AND HE STATED THAT HE COULDN'T.  THIS IS HORRIBLE!!!  HTTP://WWW.FORDPROBLEMS.COM/TRENDS/EPAS/.  HTTPS://STATIC.NHTSA.GOV/ODI/RCL/2015/RCMN-15V340-1276.PDF.  AND READ SOME OF THE COMMENTS HERE ON OTHERS THAT HAVE HAD THE SAME OR SIMILAR ISSUES WITH OTHER FORD VEHICLES.  HTTPS://WWW.YOUTUBE.COM/WATCH?V=ROULANY5DMI",
        "vin": "1FAHP2E8XDG"
    }
]