[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/06/2018",
        "dateOfIncident": "02/06/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11067314,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE OWNING MY F250, IT HAS RANDOMLY EXPERIENCED A SEVERE VIBRATION \"DEATH WOBBLE\" AFTER HITTING BUMPS AT HIGHWAY SPEED. SO BAD, THAT I INSTALLED A STEERING STABILIZER TO HELP MITIGATE THE ISSUE (FORD DIDN'T SEEM TO HAVE A BETTER FIX).  I ALWAYS KEEP MY LOAD \"E \"RATED TIRES INFLATED PER RECOMMENDED PRESSURES YET THE PROBLEM PERSISTED. ON SEVERAL OCCASIONS I THOUGHT THAT I WAS GOING TO LOSE CONTROL OF THE VEHICLE WHEN THE VIBRATIONS HAPPENED. FORD HAS YET TO ADDRESS THIS ISSUE OTHER THAN TO SAY SLOW DOWN WHEN THE SEVERE VIBRATION OCCURS. FOR NEARLY 10 YEARS THIS HAS BEEN AN ACCIDENT WAITING TO HAPPEN FOR MANY F250 OWNERS AND FORD'S ANSWER IS WHEN IT HAPPENS ,\" SLOW DOWN\"? THIS IS NOT AN ISOLATED OCCURRENCE UNIQUE TO MY VEHICLE; THERE ARE LITERALLY THOUSANDS WHO HAVE EXPERIENCED THE ABOVE ISSUE. NUMEROUS POST, BLOGS AND VIDEOS ARE AVAILABLE ON LINE, YET FORD CONTINUES TO BLAME THE OCCURRENCE ON LOW TIRE PRESSURE AND PASS THE RESPONSIBILITY FOR CONTROLLING A VERY HAZARDOUS \"DEATH WOBBLE\"  TO THE VEHICLE OWNERS. THIS IS AN ISSUE THEY HAVE  KNOWN ABOUT FOR MANY YEARS, YET HAVE FAILED TO TAKE RESPONSIBILITY AND CORRECT THE HIGHLY DANGEROUS CONDITION FORD CREATED. ANY DATA ON HOW MANY ACCIDENTS CAN BE ATTRIBUTED TO THEIR POOR ENGINEERING/DESIGN ELEMENTS THAT OBVIOUSLY CONTRIBUTE TO THE UNSAFE HANDLING OF THEIR 7000 LB PLUSS TRUCKS?",
        "vin": "1FTSW21R28E"
    }
]