[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "01/22/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003226,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "ACCENT",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 17, 2003 THE AIR BAG LIGHT ILLUMINATED ON THE VEHICLE WHEN IT TRAVELED OVER A MINOR BUMP IN A PAVED ROAD.  THE VEHICLE IS UNDER WARRANTY.  I STARTED AND DROVE THE VEHICLE TO THE DEALER 1-22-03.  THE DEALER STATED THE BATTERY WAS DEFECTIVE AND I DECLINED TO BUY THEIR BATTERY BUT BOUGHT A NEW BATTERY FOR THE CAR WHICH EXCEEDED THE SPECIFICATIONS OF THE OEM BATTERY.  THE BATTERY WAS INSTALLED.  UPON TRAVELING BACK TO OREILLY'S AUTO PARTS TO RETURN THE OLD BATTERY FOR A CORE EXCHANGE, I HIT A MINOR BUMP IN THE PAVEMENT AND THE AIR BAG LIGHT HAS ILLUMINATED AGAIN.   THE PROBLEM OCCURRED WITH THE NEW BATTERY AND RECURRED FOR A SECOND TIME WHEN THE CAR HIT A MINOR BUMP.  I NOTE THAT OTHER 1999 HYUNDAI'S HAVE BEEN RECALLED FOR A DEFECT IN THE WIRING HARNESS THAT CAUSES THIS LIGHT TO ILLUMINATE.  I DO NOT KNOW IF ALL ACCENTS HAVE THIS PROBLEM BUT THIS ONE DEFINETLY DOES AND IT CAN BE RECREATED.  DON CAVENAUGH MOTORS IS DISCOURAGING REPAIRS BY ALLEGING AN OLD BATTERY CAN CAUSE THE LIGHT TO ILLUMINATE WHICH IS FALSE, AND BY NOT FIXING THE PROBLEM.  NOW I MUST TAKE THE CAR BACK FOR A SECOND REPAIR MEANWHILE I AM HAVING TO DRIVE IT WITH THE AIR BAG LIGHT ON.  I BELIEVE THAT HYUNDAI AND THEIR DEALING ARE FALSIFYING SERVICE RECORDS SO THAT THEY DO NOT REFLECT A PROBLEM WITH THE AIR BAG LIGHT AS THIS IS A SAFETY DEFECT.    MY REPAIR TICKET SAYS \"AIR BAG LIGHT\" AND STATES CUSTOMER DECLINED RECOMMENDED REPAIRS AND STATED HE WOULD GET A BATTERY FROM WAL-MART.  THIS REPAIR TICKET MISS STATES THE FACT THAT THERE IS A DEFINITE PROBLEM WITH THE AIR BAG.  ALSO, WHEN HYUNDAI CUSTOMER SERVICE WAS CONTACTED THEY MADE A BLANKET DENIAL THAT THERE WERE OTHER CUSTOMERS WITH THIS PROBLEM.  EVEN WITH GOOD QUALITY, IT WOULD BE NORMAL FOR A FEW CARS TO MALFUNCTION.  I BELIEVE OTHER HYUNDAI ACCENTS HAVE DEFECTIVE AIR BAG WIRING HARNESSES JUST AS THE OTHER 1999 HYUNDAI MODELS ALREADY RECALLED AND THIS DEFECT POSES A SIGNIFICANT RISK OF INCREASED BODILY INJURY SHOULD AN ACCIDENT OCCUR.",
        "vin": "KMHVD34N5XU"
    }
]