[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/18/2018",
        "dateOfIncident": "02/15/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11080014,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "MAZDA6",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEED (55-65MPH) THE STEERING WHEEL BEGAN PROGRESSIVELY ROTATING COUNTER-CLOCKWISE WITH THE VEHICLE REMAINING STRAIGHT.  THE DYNAMIC STABILITY CONTROL TURNED OFF AS IF THE VEHICLE WAS OUT OF CONTROL AND THE VEHICLE ACTED AS IF IT WERE ON ICY/SLICK SURFACES NO LONGER PROVIDING SUPPORT TO THE DRIVER.  THE BRAKING SYSTEM BEGAN TO STRUGGLE NEARLY CAUSING AN ACCIDENT ON THE OFF RAMP OF THE EXPRESSWAY CAUSING A FISHTAIL WITH THE ABS ATTEMPTING TO ENGAGE.  AT THIS POINT THE STEERING WHEEL WAS REGISTERING STRAIGHT' WITH THE STEERING WHEEL TURNED APPROXIMATELY 30 DEGREES LEFT.  SOMEHOW AT SPEEDS LESS THAN 15 MPH THE VEHICLE WAS DRIVEN TO THE LOCAL MAZDA DEALERSHIP WHERE IT HAS A SERVICE HISTORY FOR AN EMERGENCY SERVICE INSPECTION.  A TEST DRIVE WITH A SERVICE REPRESENTATIVE SUPPORTED THE OWNER'S COMPLAINTS OF A SEVERE SAFETY CONCERN WITH RIGHT TURNS CAUSING A SIGNIFICANT 'GRINDING'/METALLIC DRAGGING SOUND AS IF THE VEHICLE'S RIGHT  UNDER-SIDE WAS CONTACTING THE GROUND.  AFTER INSPECTING THE VEHICLE IN THE LIFT THE MECHANIC DETERMINED THERE  WAS FRONT PASSENGER FRAME METAL CORROSION WHICH WAS BREAKING OFF IN CHUNKS.  THE DEALERSHIP VOICED AWARENESS OF ANOTHER 2009 MAZDA6 WITH SIMILAR MILES (APPROXIMATELY 15,000 FEWER)  HAVING NEARLY THE SAME ISSUE LAST FALL/WINTER. THE VEHICLE IN THIS REPORT HAS APPROXIMATELY 189,000 PRIMARILY HIGHWAY MILES AND IS OTHERWISE IN EXCELLENT CONDITION FOR ITS YEAR/MAKE/MODEL.  THE AFOREMENTIONED FRAME FAILURE SHOULD NEVER HAPPEN AND IS BELIEVED TO BE A MANUFACTURER DEFECT WHICH SHOULD NOT BE THE RESPONSIBILITY OF THE OWNER.  FORTUNATELY IN THIS CASE THERE WAS NOT AN AUTOMOBILE ACCIDENT/COLLISION, INJURY, OR DEATH THOUGH THIS COULD HAVE EASILY HAPPENED.  I DO BELIEVE THERE IS AN EXTREMELY SERIOUS PROBLEM HERE AND NEEDS TO BE INVESTIGATED AS HUMAN LIVES ARE AT STAKE.",
        "vin": "1YVHP82A295"
    }
]