[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/16/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2012",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK STALLS WHEN SLOWING FOR A STOP OR IDLING AROUND A CORNER. THAT IS A SAFETY ISSUE BECAUSE THE STEERING AND BRAKES ARE LOCKED UP AT THAT POINT. WHETHER IT'S IDLING IN A TRAFFIC JAM, COMING TO A STOP, OR IDLING AROUND THE CORNER, YOU WILL SUDDENLY HAVE NO POWER BUT EVERYTHING ELSE IS ON. NOT THE ENGINE AND IT WAS SO SMOOTH THAT YOU DON'T NOTICE UNTIL YOU CAN'T BRAKE OR STEER. THERE ARE HUNDREDS OF PEOPLE WITH THIS YEAR MAKE AND MODEL THAT ARE HAVING THE SAME PROBLEM. I UNDERSTAND THERE WAS AN INVESTIGATION BUT IT WAS CLOSED WITHOUT RESOLUTION. CASE NUMBER EA05018. THIS IS A GROWING PROBLEM AND WE THE PEOPLE ARE SPENDING HUNDREDS OF DOLLARS TO REPLACE PARTS THAT ARE JUST PART OF A TROUBLE SHOOTING ISSUE AND MOST OF US STILL HAVE THE PROBLEM. AND IT'S THE SAME FOR ALL OF US. PLEASE RELOOK AT THIS PROBLEM. IF I WERE THE ONLY ONE I COULD UNDERSTAND BUT I AM NOT. WE LOVE OUR TRUCKS BUT THIS IS A SERIOUS PROBLEM. LAST NIGHT I WAS IN A DOUBLE TURN INTERSECTION WHEN IT SHUT OFF. THANKFUL I WAS IN THE OUTER LANE AND DID NOT CRASH OR HIT THE MEDIAN. IF YOU READ ON CAR COMPLAINTS. COM UNDER 2005 DODGE RAM 1500 STALLS/SHUTS DOWN WHILE DRIVING, YOU WILL SEE THAT THIS IS A SERIOUS PROBLEM AND THERE ARE LOADS OF PEOPLE. THEY THINK THE REPAIR FIXES BUT IT DOES NOT AND THE ISSUE DOES NOT HAPPEN ALL THE TIME. IT STARTED OCCASIONALLY BUT NOW IT'S ALMOST DAILY AND MULTIPLE TIMES A DAY. THE TRUCK AND HAS PROGRESSIVELY GOTTEN WORSE. I HAVE TAKEN IT TO MULTIPLE REPAIR SHOPS AND NO ONE CAN FIGURE OUT THE PROBLEM SINCE IT IS DIFFULT TO PINPOINT WHEN IT WILL OCCUR TO SHOW WHAT THE VEHICLE IS ACTUALLY DOING. I'VE HAD TO REPLACE MULTIPLE PARTS TO HELP RESOLVE THE ISSUE TO INCLUDE A NEW STARTER FROM CONSTANT RESTARTING IN THE NEUTRAL POSITION WHILE VEHICLE IS STILL IN MOTION. THE VEHICLE IS ALWAYS IN MOTION WHEN IT RANDOMLY STALLS COMING TO A SLOW, IDLE OR A TURN ESPECIALLY.",
        "vin": "1C6RD7KT9CS"
    }
]