[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/04/2018",
        "dateOfIncident": "05/04/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091914,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "VERSA",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "BETWEEN NOTICE FOR THE PASSENGER SIDE AIR BAG RECALL AND THEN THE RECALL FOR THE DRIVER'S SIDE AIR BAG, THIS PROCESS HAS BEEN UNREASONABLY LONG AND REQUIRED FAR TOO MUCH EFFORT ON MY PART TO RESOLVE. AT EVERY STEP THIS HAS REQUIRED FAR TOO MUCH OF MY PERSONAL ATTENTION AND TIME. THE ONLY WAY I'VE BEEN ABLE TO MAKE THIS RECALL PROCESS WORK FOR ME IS BY SETTING UP A GOOGLE ALERT ABOUT NISSAN RECALLS TO REMIND ME TO CALL THEM PERIODICALLY. OTHERWISE THEY WOULD NEVER INFORM ME ABOUT ANY DEVELOPMENTS WITH THIS RECALL. WHEN I FINALLY CALLED THEM AGAIN THEY REQUIRED FAR TOO MUCH INFORMATION FROM ME JUST TO GIVE ME INFORMATION ABOUT THE RECALL. IT'S LIKE THEY JUST WANT TO PUT SO MANY ROADBLOCKS ON THIS PROCESS TO MAKE SURE THAT MOST PEOPLE JUST GIVE UP AND DRIVE UNSAFE CARS INSTEAD OF GETTING THEM FIXED. AND THAT'S AT EACH STEP. I GIVE ALL THIS INFORMATION WHEN I TALK TO ONE PERSON THEN I TALK TO SOMEONE ELSE AND HAVE TO GIVE THEM THE SAME INFORMATION AND THEN THE NEXT AND SO ON. I CAN'T BELIEVE HOW MUCH TIME THIS PROCESS WASTES. AND FINALLY THE DEALERSHIP IS READY TO REPLACE THE DRIVER SIDE AIR BAG. I SHOULD BE GRATEFUL AND HAPPY THAT THE PROCESS IS FINALLY OVER BUT THEY TELL ME THAT THEY'VE HAD THE PARTS SINCE FEBRUARY AND ASK WHAT MY PROBLEM IS GETTING THIS FIXED. FEBRUARY. THEY DIDN'T SEND ME ANY NOTICE ABOUT THIS AND THE RECALL HASN'T BEEN UPDATED TO SHOW THAT PARTS ARE AVAILABLE, AND IT'S MY FAULT SOMEHOW? NISSAN HAS TO BE HELD TO ACCOUNT FOR THIS INEFFICIENT AND WASTEFUL PROCESS. I DON'T IMAGINE MOST PEOPLE WOULD STICK THROUGH THIS PROCESS THE WAY I HAVE AND THAT MOST PEOPLE WOULD END UP SIMPLY NOT GETTING THEIR CAR'S FIXED. THERE WILL ONLY BE MORE AND MORE CASUALTIES IF NISSAN ISN'T FORCED TO MAKE THEIR RECALL PROCESS REASONABLE AND SANE.",
        "vin": "3N1BC11E39L"
    }
]