[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2018",
        "dateOfIncident": "06/30/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11091114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER MY VOLKSWAGEN 3 YEARS 36K WARRANTY WAS OVER I STARTED HAVING PROBLEMS REMOVING MY KEY FROM THE IGNITION.  I HAD MENTIONED IT TO THE SERVICE ADVISOR WHO STATED THAT MY WARRANTY WAS ALREADY LAPSED AND I WOULD BE RESPONSIBLE FOR THE REPAIR. IN APRIL 2018, I RECEIVED A NOTICE FROM VOLKSWAGEN OF AN EXTENDED WARRANTY ON THE STEERING COLUMN LOCK HOUSING MAY DEVELOP A PROBLEM OF HARD TO REMOVE THE KEY OR NOT BEING ABLE TO REMOVE IT ALL.  THIS IS THE EXACT PROBLEM THAT I HAVE BEEN HAVING SINCE THE MANUFACTURES WARRANTY EXPIRED IN JUNE OF 2016. IN THE ATTACHED LETTER IT STATES THAT THE WARRANTY EXTENSION EXTENDED TO ADDRESS THIS PROBLEM WAS FOR 10 YEARS OR 100K WHICHEVER COMES FIRST.  I CURRENTLY HAVE ABOUT 104K ON MY VEHICLE, BUT NONE THE LESS TOOK IT INTO VOLKSWAGEN OF THE WOODLANDS IN TEXAS TO HAVE IT DIAGNOSED FOR THIS DEFECTIVE STEERING HOUSING ON 04/28/2018.  I WAS ADVISED THAT THE STEERING HOUSING WAS IN FACT DEFECTIVE BY THE TECHNICIAN AT THIS DEALERSHIP. I WAS UNABLE TO GET RESOLUTION FROM VOLKSWAGEN CUSTOMER SERVICE AND CONTACTED KATHRENE FOX AT VW EXECUTIVE OFFICE TO SEE IF VOLKSWAGEN WOULD COVER THIS DEFECTIVE PART SINCE I WAS 4K OVER THERE 100K EXTENDED PART WARRANTY WHICH SHOULD BE A SAFETY RECALL NOT A EXTENDED WARRANTY AS OUTLINED IN THERE LETTER.  I WAS TOLD BY MS. FOX THAT VW COULD NOT COVER THE STEERING HOUSING WHICH IS WITHOUT DOUBT A SAFETY HAZARD BECAUSE I WAS NOT A LOYAL CUSTOMER AND I WAS OVER THERE WARRANTY EXTENSION FOR THIS DEFECTIVE STEERING COLUMN HOUSING BY 4K. I AM WILLING TO ASSIST YOU IN YOUR INVESTIGATION IN ANY WAY TO RESOLVE THIS SAFETY ISSUE THAT INVOLVES NUMEROUS VEHICLE.  THANK YOU",
        "vin": "3VWDX7AJ1DM"
    }
]