[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/31/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115014,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS BOUGHT IN MARCH 2018. AROUND 1 MONTH INTO DRIVING THE CAR THE RADIO AND DASH DISPLAY STARTING DOING ITS OWN THING. ONE WOULD SAY RADIO ON, THE OTHER RADIO OFF. AT TIMES, THE CONNECTION MENU WOULD COME AND FREEZE. GOT INTO THE CAR AND STARTED IT AND THE CD STARTED PLAYING LOUDLY, WHICH WAS STRANGE AS WHEN I PARKED AND GOT OUT OF THE CAR I ALWAYS TURN THE RADIO OFF. BLIND SPOT INDICATOR FAILED SEVERAL TIMES WHEN PASSING A TRACTOR TRAILER. WHILE DRIVING AT NIGHT WITH A STORM COMING THE HEADLIGHTS AND DASH LIGHTS WENT OUT ALONG WITH LIGHTS GOING DIM FOR NO REASON SEVERAL OTHER TIMES. HAD ONE INSTANCE WHEN PULLED THE WIPERS TO CLEAN THE WINDSHIELD, THE SPRAYER WORKED BUT THE WIPERS DID NOT. ALOT OF ELECTRICAL ISSUES. TOOK TO DEALER 4 TIMES IN A MONTH SO THEY COULD \"DUPLICATE\" THE PROBLEMS, I ADVISED THAT THERE IS NO PATTERN TO THESE PROBLEMS. THEY TOLD ME TO CALL NISSAN USA IN TENNESSEE, I DID AND WENT BACK AND FORTH AND THEY SENT A NISSAN TECH TO THE DEALERSHIP. HE DIDN'T DRIVE THE CAR AND ADVISED WE DELETE ALL PHONES FROM THE CAR AND DRIVE IT THAT WAY FOR A FEW WEEKS. ALL PROBLEMS STILL GOING ON. NISSAN USA CALLED TODAY AND SAID TO GO BACK TO THE DEALER, THE CASE IS CLOSED AND THE DEALER MAYBE CAN WORK WITH US ON IT. THEY REASSURED ME THAT WE STILL HAVE THE WARRANTY SO THESE PROBLEMS ARE STILL COVERED. ALL INSTANCES HAPPENED WHETHER DRIVING, STARTING OR PARKING THE CAR. SO 4 TRIPS, 2 RENTAL CARS AND 2 DAYS OF MISSED WORK IN A MONTH AND DRIVING WHAT WE FEEL IS AN UNSAFE CAR.",
        "vin": "5N1AT2MV7JC"
    }
]