[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/15/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CRUZE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR FIRST STARTED HAVING ISSUES WITH SWITCHING GEARS. GOING INTO AND OUT OF DRIVE SPECIFICALLY. WOULDN'T EVEN BUDGE. DEALERSHIP SAID IT MUST BE SOMETHING STICKY SPILLED IN GEARS. HAVE HAD NO SPILLS IN THAT AREA. SOON AFTER THIS VISIT MY CAR WOULD TURN OFF IN STOP AND GO TRAFFIC. DEALERSHIP SAID THEY COULDN'T REPLICATE THE ISSUE SO THEY COULDN'T TELL ME WHAT IT WAS. NOW, NOT MUCH LATER THAN THE LAST VISIT, MY CAR IS SHUTTING OFF ON THE INTERSTATE, EVERY LIGHT INSIDE CAR (DOOR OPEN LIGHTS, RADIO LIGHTS, A/C LIGHTS, DASH LIGHTS) ARE DIMMING AND BRIGHTENING OR TURNING ON AND OFF ON THEIR OWN, WINDOWS ROLL UP AND DOWN ON THEIR OWN, A/C SHUTS ON AND OFF OR WILL CHANGE VENTS ON ITS OWN, BURGLAR SYSTEM DETECTION GOES OFF WHEN TRYING TO START THE CAR, AND CAR WON'T START AFTER BEING OFF FOR 20-30 MINUTES WITHOUT A JUMP. THREE DIFFERENT PLACES HAVE USED BATTERY AND CODE READERS AND CANNOT FIND AN ISSUE. MY BATTERY, STARTER, AND ALTERNATOR ARE IN GREAT CONDITION. EVERY PLACE EXCEPT THE DEALERSHIP HAS TOLD ME IT'S A \"MAJOR ELECTRICAL ISSUE THAT NEEDS TO BE FIXED ASAP.\" CAR IS STILL UNDER WARRANTY. HAS HAD ALL WORK ASIDE FROM THE READINGS DONE AT DEALERSHIP. THEY SAY THEY CAN'T FIND OUT THE ISSUE. THIS IS THE THIRD TIME WITHIN 4 MONTHS THAT MY CAR ISSUES HAVE BEEN AVOIDED BY THE DEALERSHIP AND I HAVE BEEN TOLD THEY CAN'T REPLICATE WHAT I'M DEALING WITH WHEN THEY TEST DRIVE IT SO THEY CAN'T HELP ME. IT IS A DANGER TO ME AND ANY OTHER DRIVER AROUND ME WHEN MY CAR SUDDENLY SHUTS OFF AT 70 MPH AND I HAVE TO TRY TO PULL OVER TO PARK MY CAR TO TRY TO START IT AGAIN. CLICKING AND ZAPPING SOUNDS CAN ALSO BE HEARD FROM UNDER OR BEHIND MY ENGINE THAT SHOULD NOT BE THERE. WAS TOLD AT THE DEALERSHIP IF THEY CAN'T FIGURE IT OUT THEY WOULD HAVE TO SEND ME HOME WITH MY VEHICLE... STILL DOING ALL THESE THINGS. I HAVE BEEN THE ONLY OWNER AND DRIVER, UNDER 20K MILES ON VEHICLE, NO MODS ADDED.",
        "vin": "1G1PC5SH7G7"
    }
]