[
    {
        "components": "SERVICE BRAKES, AIR,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/23/2003",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TAHOE",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS OCCURS EVERY DAY, ALL DAY. IT IS A WELL KNOWN FACT WITH JUST ABOUT ALL LATE MODEL CHEVY/GMC TAHOE/SUBURBAN OWNERS, DEALERS, MECHANICS & MANY IN THE AUTO PUBLISHING INDUSATRY, THAT THESE VEHICLES HAVE EXTREMELY INADEQUATE BRAKING SYSTEMS, BORDERING ON FAILURES & EXTREME FADING & WARPING & PREMATURE WEAR ON THE FRONT MECHANICALS/PADS/ROTORS ESPECIALLY. YOU CAN ASK JUST ABOUT ANY MECHANIC & GM/CHEVY DEALER& THEY WILL ACKNOWLEGE THIS FACT. THEY EVEN TOUT THAT THE NEWER MODELS HAVE SUCH AN IMPROVED BRAKING SYSTEM OVER THE PREVIOUS YEARS. I OWN A 97 TAHOE 1500 & THE PREVIOUS OWNER & EVERYONE I MEET WHO OWNS A LATE MODEL GM TRUCK HAS THE SAME PROBLEMS. THERE ARE EVEN SOME INDEPENDENT MECHANICS WHO REFUSE TO WARRANTY THEIR WORK & PARTS WHEN THEY DO BRAKE JOBS ON THESE VEHICLES. I AM TALKING MOSTLY ABOUT THE FRONT DISC BRAKES. HAVE COME CLOSE TO ACCIDENTS QUITE A FEW TIMES DUE TO WARPED ROTORS & FADED BRAKES, ESPECIALLY WHEN COMING DOWN AN INCLINE, EVEN IF IT IS A SLIGHT TO MODERATE DESCENT FOR NOT A LONG DISTANCE. THE BRAKES NEED TO BE REPLACED MORE OFTEN THAN ANY VEHICLE IHAVE EVER OWNED & FOR THE TECHNOLOGY THAT IS OUT THERE. SOMETIMES EVERY YEAR!!! I CANNOT BELIEVE THAT THESE BRAKES WERE EVER CERTIFIED SAFE BY THE NTSB OR ??? AND THAT THERE ARE NO RECALLS ON THIS EXTREME SAFETY HAZARD TO THE PUBLIC.  ALSO.. THE WIPER MOTOR ON THESE VEHICLES IS PRONE TO FAILURE (INTERMITTENT OR COMPLETE,) AND IS ALSO A WELL KNOWN PROBLEM IN THESE CIRCLES & A SERIOUS SAGETY HAZARD AS YOU MIGHT EXPECT. THANK YOU.",
        "vin": "1GNEK13RXVJ"
    }
]