[
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/20/2018",
        "dateOfIncident": "06/30/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11121014,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "TERRAIN",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2013 GMC TERRAIN. WHILE DRIVING 45 MPH, THE CENTER CONSOLE LOST POWER INDEPENDENTLY. THE VEHICLE WAS TAKEN TO IG BURTON LEWES AUTOMALL (17861 COASTAL HWY, LEWES, DE 19958), BUT THE FAILURE COULD NOT BE DUPLICATED. THE CAUSE OF THE FAILURE WAS UNDETERMINED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE PERSISTED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE RADIO MODULE ASSEMBLY WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 33,956.   **TR  CONSUMER STATED TOOK VEHICLE TO I.G., BURTON 8/15/2018 VEHICLE'S CONTROLS AND DISPLAYS WERE NOT WORKING CAUSING THE HEATING, AIR CONDITIONING,DEFROST, NAVIGATION SYSTEM, RADIO CONTROLS AS WELL AS THE PANEL ILLUMINATION TO BECOME INOPERATIVE. THIS WOULD HAPPEN INTERMITTENTLY. THEY COULD NOT DUPLICATE PROBLEM. WENT TO PICK IT UP ON THE 16TH AND IT WAS NOT WORKING. THEY KEPT THE VEHICLE AND REPLACED THE RADIO CONTROL MODULE. INVOICES ATTACHED. RECEIVED THE VEHICLE BACK 8/21/2018. TOOK VEHICLE TO I.G, BURTON SAME ISSUES AS BEFORE. THIS TIME THEY REPLACED THE RADIO CONTROL DISPLAY AND INFO SCREEN, THE RADIO CONTROL ASSEMBLY, PROGRAMMED THE RADIO AND THE HVAC MODULE. INVOICE ATTACHED. RECEIVED THE VEHICLE BACK 9/6/2018. 9/24/18 TOOK VEHICLE TO I.G., BURTON, DROPPED THE VEHICLE OFF WITH THE SAME ISSUES. TODAY IS THE OCT.3RD AND WE STILL DON'T HAVE OUR VEHICLE BACK, NOR HAVE WE HEARD ANYTHING. UPDATED 10/29/18*JB",
        "vin": "2GKFLVE32D6"
    }
]