[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "TRANSIT CONNECT",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS EQUIPPED (STANDARD EQUIPMENT, NOT AN OPTION) WITH AUTOMATIC FOLDING SIDE VIEW MIRRORS ON DRIVERS DOOR AND PASSENGER DOOR.  SAFETY FAULT IS THAT VEHICLE CAN BE STARTED AND DRIVEN WITH THE VEHICLE IN FOLDED POSITION.  FORD DEALERSHIP AND FORD'S CUSTOMER HOTLINE ARE CLAIMING THAT THIS IS NORMAL OPERATION OF THESE MIRRORS.  HOWEVER, COMMON SENSE DICTATES THAT A VEHICLE SHOULD NOT BE ABLE TO BE DRIVEN WITH THE MIRRORS FOLDED.  LEGALLY, THIS APPEARS TO BE IN VIOLATION OF US DOT REGULATION CFR 571.111 S5.2.1 WHICH RELATES TO THE FIELD OF VIEW REQUIREMENTS FOR THE OUTSIDE REARVIEW MIRROR - DRIVER'S SIDE.  IF THE MIRROR IS FOLDED, IT DOES NOT MEET THAT REGULATION.  AS SUCH, THE MANUFACTURER CODING OF THE FOLDING SYSTEM'S HARDWARE SHOULD ALWAYS DEFAULT TO FULL OPEN POSITION WHEN THE VEHICLE IS RUNNING OR IN MOTION.  THE DEALERSHIP SERVICE DEPARTMENT HAS INDICATED THAT THERE IS NO SETTINGS IN THEIR CONTROL RELATED TO CHANGING OR DISABLING THE FUNCTION OF THE AUTOMATIC FOLDING MIRRORS.  THEY HAVE SEEN THE PROBLEM BUT CONSIDER IT NORMAL OPERATION OF THE VEHICLE.    THE SCENARIO TO PRODUCE THIS PROBLEM IS SIMPLY:  - UNLOCK AND ENTER THE VEHICLE (MIRRORS UNFOLD TO OPEN POSITION)  - LOCK THE VEHICLE USING THE BUTTON ON THE ELECTRONIC KEY/FOB.  (MIRRORS FOLD)  - START VEHICLE. (MIRRORS REMAIN FOLDED AND WILL REMAIN FOLDED AS LONG AS VEHICLE IS BEING OPERATED)  -----  IF PROBLEM IS SPECIFIC TO MY VEHICLE, IT REQUIRES REPAIR.    BUT IT APPEARS THAT PROBLEM IS RELATED TO EVERY SIMILARLY EQUIPPED VEHICLE OF THIS YEAR/MODEL AND MAY EXTEND TO OTHER FORD MODELS.  IF SO, THIS REQUIRES A RECALL AND RESOLUTION TO COMPLY WITH REGULATIONS AND BASIC SAFETY FUNCTION.",
        "vin": "NM0GE9F79J1"
    }
]