[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2018",
        "dateOfIncident": "08/16/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11130514,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ROGUE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING UP A HILL MY ENGINE WOULD ESSENTIALLY  VAPOR LOCK AND I COULDN'T GO PAST 45 TO 50 MPH. I WOULD BE FLOORING THE GAS PEDAL AND MY CAR WOULD BE GOING 45 TO 50 MPH UP A HILL.  I TOOK IT TO MY MECHANIC AND FOUND IT TO BE THE INTAKE MANIFOLD RUNNER CODE P2004. THAT PART COMES WITH A NEW INTAKE MANIFOLD ON MY CAR. HE DID SOME RESEARCH AND FOUND THERE WAS A FLAW ON THE P2004. IT  WAS MADE OF PLASTIC AND IT WOULD CAUSE PART OF THE MANIFOLD TO BE STUCK AND NOT RECEIVE AIR.     WHILE  HE WAS DOING HIS RESEARCH TO ORDER THE PART I NEEDED, HE FOUND THAT NISSAN KNEW ABOUT THIS FLAW AND HAD TO REDESIGN THE ENGINE FOR THE ROGUE.  THIS PART WAS NO LONGER MADE.  THIS IS HAPPENING TO SO MANY ROUGE OWNERS THAT THE PART NEEDED IS BACK ORDERED. THE SUPPLY IS SO LOW AND THE DEMAND IS HIGH RIGHT NOW THAT THE  NISSAN DEALERSHIP IN IRVINE CA, RAISED THEIR PRICE FOR A INTAKE MANIFOLD FROM $300 TO $550. ON TOP OF THE FACT THAT NISSAN IS AWARE OF THE ISSUE THEY ARE PRICE GOUGING CUSTOMERS. I FIRMLY BELIEVE THIS NEEDS TO BE A RECALL ISSUE AND NISSAN NEEDS TO TAKE RESPONSIBILITY.  NO CAR THAT IS MADE IN 2014 SHOULD HAVE AN ISSUE THAT IT CANT GO UP A HILL AT 45 MPH.    THIS IS A SAFETY ISSUE THAT NEEDS TO BE ADDRESSED ASAP. I CALLED THE DEALERSHIP AND THE NISSAN CONSUMER AFFAIRS AND THEY ARE NOT RESPONSIBLE FOR WHAT HAPPENS TO THE CAR. ANY CAR ON THE ROAD THAT CANT GO ABOVE 45 MPH IS A TICKING TIME BOMB FOR AN ACCIDENT TO HAPPEN ON THE  FREEWAY.      .",
        "vin": "5N1AT2MT0EC"
    }
]