[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "01/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151214,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EDGE",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL - I RECEIVED NOTIFICATION IN JANUARY 2018 FROM MY CREDIT KARMA ACCT THAT MY VEHICLE WAS A PART OF THE TAKATA RECALL. UPON RESEARCH WITH NHTSA, I FOUND THAT THERE WAS NO REMEDY FOR THE RECALL. A FEW MONTHS LATER I RECEIVED A NOTICE THAT FORD WAS OFFERING TO COVER RENTAL CAR EXPENSES FOR THOSE EFFECTED BY THE RECALL WITH NO REMEDY. BUT WHEN I CALLED MY LOCAL DEALERSHIPS TO ASK FOR THE RENTAL, I WAS TOLD THAT THE RENTAL COMPANY THAT FORD DEALS WITH, ENTERPRISE, WAS REFUSING TO HONOR  THE OFFER. IT IS NOW NOVEMBER 2018, AND NO REMEDY HAS BEEN ESTABLISHED. MY CAR IS IN GROUP 5, OF WHICH ONLY A VERY SMALL PERCENTAGE OF EFFECTED VEHICLES HAVE BEEN FIXED. IT IS ALSO MY UNDERSTANDING THE REMEDY PARTS MANUFACTURER IS BASED IN MEXICO. WITH THE CURRENT STATE OF AFFAIRS BETWEEN POTUS AND MEXICO, THAT MEANS THE EXPORTING AND DISTRIBUTION OF GOODS WILL TAKE LONGER. I FIND THAT THE PRUDENT THING FOR FORD TO DO IS MOVE MANUFACTURING TO THE US. I UNDERSTAND THIS MAY BE MORE EXPENSIVE FOR FORD IN THE SHORT TERM. BUT IT WOULD BENEFIT THEM MORE IN THE LONG RUN BY GETTING THESE PARTS MADE QUICKER AND DISTRIBUTED QUICKER, RATHER THAN A CLASS ACTION LAW SUIT OR INDIVIDUAL LAW SUITS FOR THOSE WHO HAVE BEEN INCONVENIENCED OR WORSE, HURT OR DIED. I FEEL LIKE IT WILL BE YEARS BEFORE MY CAR IS FIXED. AT THIS TIME, I DO NOT ALLOW ANYONE TO SIT IN MY FRONT PASSENGER SEAT. I CANT EVEN USE THIS VEHICLE AS THE FAMILY CAR AS INTENDED WHEN WE BOUGHT IT. IM HIGHLY FRUSTRATED BY THE LACK OF PROGRESS. IT IS MY HOPE THAT THE NHSTA CAN HELP FACILITATE PROGRESS BY FORD & TAKATA.",
        "vin": "2FMDK38C19B"
    }
]