[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/18/2018",
        "dateOfIncident": "12/05/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11162264,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE (2009 D. CARAVAN) WAS BEING DRIVEN ON A CITY STREET.  AFTER HAVING STOPPED AT A 4-WAY INTERSECTION,  DRIVER PROCEEDED INTO INTERSECTION AT VERY LOW SPEED AND WAS STRUCK BROADSIDE ON THE RIGHT  WHEN A 1999 CHEV. TAHOE FAILED TO STOP. TAHOE SPEED ESTIMATED AT 30-35 MPH.  RT. SIDE AIR BAGS DEPLOYED AT WHICH TIME FRONT SEAT PASSENGER (FEMALE, APPROXIMATELY 5' 1\" ) WAS STRUCK ON HEAD BY AIRBAG WHICH MOVED TO HER LEFT CAUSING PASSENGER'S HEAD TO HIT SIDE WINDOW.  AIRBAG REMAINED ON THE LEFT SIDE OF HER HEAD UNTIL HER HUSBAND, THE DRIVER, FORCIBLY MOVED IT OVER TO HER RIGHT IN ORDER FOR EMT SERVICE TO TAKE HER OUT THRU LEFT FRONT DOOR.  PASSENGER HAD ABRASIONS OVER TOP OF HEAD AND ON LEFT ARM, NONE WERE OF A SERIOUS NATURE; HOWEVER SHE EXPERIENCED IMMEDIATE SIGNIFICANT HEARING LOSS.  TRIP TO ER AND CT SCAN REVEALED NO CONCUSSION, NO RUPTURED EARDRUMS AND NO OTHER SERIOUS INJURIES.  ACCIDENT OCCURRED 13 DAYS AGO AND THERE HAS BEEN NO IMPROVEMENT IN HER HEARING, THE LOSS OF WHICH IS MORE PRONOUNCED IN LEFT EAR AND INCLUDES A CONSTANT RINGING.  SHE IS AWAITING A JAN. 2019 APPT. WITH ENT DOCTOR FOR EVALUATION.  THERE WERE NO REAR SEAT PASSENGERS AND THE OTHER TWO PERSONS INVOLVED IN THE ACCIDENT WERE NOT INJURED.   IN THIS ACCIDENT THE SIDE AIRBAG DID NOT PROTECT THE PASSENGER AS IT SHOULD,  AND IN ADDITION CAUSED A SIGNIFICANT HEARING LOSS. *DSY *DT*JB *JS *BF *TR",
        "vin": "2D8HN54X49R"
    }
]