[
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "12/17/2018",
        "dateOfIncident": "12/14/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11161964,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2011",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WHEELS/BRAKES ON MY 2011 TOYOTA CAMRY LOCKED UP AND CAUSED ME TO LOOSE CONTROL OF THE CAR.  I CRASHED INTO A TREE. THE FOLLOWING A DETAILED DESCRIPTION OF THE EVENT.     I EXITED MY COMMUNITY, BY MAKING A LEFT TURN ON A COUNTY ROAD.  THE WEATHER WAS CLOUDY, AND THE ROAD WAS DAMP DUR TO RECENT RAIN.  I WAS ACCELERATING TO 40 MPH, WHICH IS THE SPEED LIMIT ON A COUNTY ROAD (A TOTAL OF 2 LANES), UNTIL I NOTICED THAT I WAS ABOUT TO EXCEED 40 MPH.  WHEN I REMOVED MY FOOT FROM THE GAS PEDAL, THE BACK OF THE CAR STARTED TO LOOSE TRACTION.  I STARTED TO APPLY VERY LIGHT PRESSURE TO THE BRAKES TO CORRECT THE DIRECTION OF THE CAR.      I LOOKED WHERE I WANTED TO GO AND MADE SMALL ADJUSTMENTS TO THE STEERING WHEEL, UNTIL THE CAR WOULD STOP DRIFTING FROM LANE TO LANE.  THE SMALL ADJUSTMENTS DID NOT HELP, AND I LOST COMPLETE CONTROL OF THE CAR.       THE REAR END OF THE CAR WENT TO THE LEFT SIDE OF THE ROAD.  I TRIED TO CORRECT THE DIRECTION TO ENSURE I STAYED IN MY LANE.  THE REAR END OF THE CAR STARTED SLIDING TO THE RIGHT SIDE WITHIN MY LANE AND CONTINUED TO SLIDE/DRIFT.  AS THE CAR CONTINUED SLIDING THE RIGHT, IT WENT OUTSIDE MY LANE, HIT THE DIRT \"SHOULDER\", AND HIT A DITCH COVERED WITH ROCKS, WHICH CAUSED THE CAR TO SWING TO THE LEFT.  WHEN THE CAR HIT THE ROCKS, I FELT MY BODY LIFTED FROM MY SIT, BUT THE SEAT BELT HELD IT BACK.  I NOTICED THAT THE RPMS OF THE CAR WENT UP FROM 1,500 RPM TO (ABOUT) 6,000 RPM.  I WAS ALSO ABLE TO REGAIN SOME CONTROL OF THE CAR, WHICH WAS COMPLETELY OFF THE ROAD AT THIS POINT IN THE EVENT.    THE CAR WAS HEADED TOWARDS A SMALL RAVINE LOCATED BEHIND THREE TREES.  I STEERED THE CAR TO HIT THE TREE INSTEAD OF RUNNING INTO A SMALL RAVINE.",
        "vin": "4T1BF3EK0BU"
    }
]