[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/27/2019",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11172364,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "ACURA",
                "productModel": "TSX",
                "productYear": "2006",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY EXPERIENCED A COMPLETE FAILURE OF THE POWER STEERING RACK DUE TO A MAJOR LEAK OF FLUID TO THE POINT I COULDN'T MOVE THE STEERING WHEEL. THANK GOD IT HAPPENED RIGHT AFTER I GOT HOME FROM DRIVING ON THE HIGHWAY.  JUST WHEN I PULLED TO PARK IN THE DRIVEWAY AND FOUND OUT THE FLUID IN THE RESERVOIR WAS COMPLETELY DRAINED AND EMPTY. I ADDED NEW POWER STEERING FLUID AND WITHIN AN HOUR IT LEAKED ALL OUT. TOOK IT TO AN INDEPENDENT SHOP A FEW DAYS LATER DUE TO THE HOLIDAYS AND FOUND OUT THE RACK AND PINION NEEDED TO BE REPLACED DUE TO THE BREAKDOWN OF THE SEAL ON BOTH SIDES. A WEEK BEFORE THIS HAPPENED, I TOOK MY CAR ON A 1200 MILES ROAD TRIP. I CONSIDER MYSELF LUCKY THAT IT DIDN'T BREAK DOWN WHILE I'M DRIVING ON THE FREEWAY AS THE RESULT COULD HAVE BEEN FATAL. CONTACTED ACURA CLIENT SERVICE MANAGER AND I WAS TOLD THERE WAS A RECALL ISSUED FOR THE POWER STEERING BUT IT WAS FOR A DIFFERENT PART, A HOSE, AND THAT MY REQUEST FOR REIMBURSEMENT FOR A DIFFERENT PART WOULD NOT BE COVERED. EVEN THOUGH IN MY OPINION THIS IS THE SAME SAFETY ISSUE FROM THE SAME COMPONENT, THE POWER STEERING. I QUESTIONED THE LOGIC OF THE MANAGER'S REASON FOR DENIAL AS THE BOTTOM LINE IS THE SAFETY OF THE PERSON DRIVING THE VEHICLE SHOULD THE POWER STEERING FAILS, REGARDLESS OF WHICH PART WITHIN THAT COMPONENT WAS RECALLED. UNFORTUNATELY, SHE DIDN'T SEEM TO UNDERSTAND THE SERIOUSNESS AND THE GRAVITY OF THIS PROBLEM. THEREFORE, I AM HERE WRITING THIS COMPLAINT SO HOPEFULLY, SOMEONE CAN UNDERSTAND AND RELATE TO WHAT HAS HAPPENED IN MY CASE.",
        "vin": "JH4CL96876C"
    }
]