[
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2019",
        "dateOfIncident": "11/07/2018",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11170264,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CR-V",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST 2018 I BROUGHT VEHICLE TO PRIVATELY OWNED SHOP THAT I TRUST TO RESEARCH A NOISE COMING FROM THE ENGINE BAY WHEN STARTING THE VEHICLE. MECHANIC FOUND THROUGH INSPECTION/RESEARCH THAT TIMING CHAIN LIKELY NEEDED TO BE REPLACED ($1000 JOB) ON 2014 CR-V'S. AT THAT TIME MY VEHICLE WAS LESS THAN 5 YEARS OLD WITH LESS THAN 60,000 MILES, SO IT WAS WITHIN THE POWER TRAIN WARRANTEE PERIOD (5YRS/60KMI). THE MECHANIC ALSO FOUND THAT THE ENGINE WAS LEAKING QUITE A BIT OF OIL FOR SUCH A NEW CAR AND HE SAID IT HAD A CONSUMPTION ISSUE. I CALLED HONDA IN AUGUST 2018, AND STARTED A CASE REGARDING OIL CONSUMPTION AND NOISE RELATED TO TIMING CHAIN. THEY TOLD ME TO BRING VEHICLE TO HONDA DEALERSHIP TO BEGIN OIL CONSUMPTION TEST AND TO HAVE NOISE LOOKED AT. I IMMEDIATELY BROUGHT THE VEHICLE TO LIA HONDA WHO TOLD ME TO WAIT UNTIL OIL NEEDED TO BE CHANGED TO START CONSUMPTION TEST B/C THE OIL WAS RECENTLY CHANGED AND IT WOULD BE A WASTE OF NEW OIL. I BROUGHT THE CAR INTO KEELER HONDA IN NOVEMBER OF 2018 TO COMPLETE THE OIL CONSUMPTION TEST WHEN THE OIL NEEDED TO BE CHANGED AND TO HAVE THE NOISE CHECKED OUT. THEY CHANGED THE OIL AND COULDN'T FIGURE OUT THE NOISE, STATING THE CAR WAS FINE. AS I DROVE THE CAR OVER THE NEXT FEW MONTHS THE NOISE GOT WORSE. I BROUGHT THE CAR TO THE DEALERSHIP WHERE I BOUGHT THE CAR AND THEY STATED I SHOULD BRING THE CAR BACK TO HONDA BECAUSE IT SHOULD'VE BEEN UNDER WARRANTEE AND SOMETHING WAS DEFINITELY WRONG. I CALLED HONDA MANUFACTURER AND REFERENCED MY CASE FROM AUG OF 2018- THEY AGREED TO DOCUMENT THAT MY CAR WAS COVERED B/C THESE ISSUES STEM FROM WHEN IT WAS UNDER WARRANTEE (NOW HAS 62KMI). KEELER HONDA FOUND A SERVICE BULLETIN TO REPLACE VTC ACTUATOR RELATED TO NOISE. THIS WAS REPLACED AND COVERED BY HONDA. THE CAR STILL HAS OIL CONSUMPTION ISSUE! 2015 CR-V'S WERE RECALLED DUE TO OIL CONSUMPTION TO REPLACE THE ENGINE, BUT NOT 2014'S? SAME ISSUE!!!!!",
        "vin": "5J6RM4H71EL"
    }
]