[
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2019",
        "dateOfIncident": "02/13/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181564,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "ESCAPE",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "2016 ESCAPE WITH NO HISTORY OR PROBLEMS PRIOR TO EVENTS HERE. DURING A TRIP FROM HOME APPROXIMATELY 50 MILES AWAY VEHICLE OPERATED JUST FINE. AFTER A 5 MIN STOP, I RE-ENTERED AND STARTED THE VEHICLE. AFTER ABOUT 2 MILES AND WHILE ON THE HIGHWAY TRAVELING 70 MPH VEHICLE SUDDENLY SHUTTERED AND ACCELERATION AGGRAVATED THIS SITUATION. POWER LOSS WAS PRESENT, AND VEHICLE STALLED OUT. I COASTED TO SHOULDER. ATTEMPTED NUMEROUS RESTARTS THAT WOULD SEEM TO CATCH BUT SOON STALL OUT. EVENTUALLY GOT THE VEHICLE TO RUN ENOUGH TO LIMP OFF THE HIGHWAY. VERY LOW POWER. PARKED FOR 20 MIN AND RESTARTED WITH NO APPARENT ISSUE. ENGINE LIGHT WAS PRESENT SINCE FIRST STALL. DROVE ABOUT 1 MILE AND SYMPTOMS RETURNED. LOW POWER AND STALLED OUT. VEHICLE RESTARTED AND I AGAIN LIMPED OFF HIGHWAY. EVENTUALLY GOT TO EXIT AND OFF INTO A PARKING LOT. NUMEROUS STALLS AND NEVER ANY REAL POWER.  WAITED FOR A TOW FROM THERE AND VEHICLE RESTARTED WITH NO ISSUES WHEN DRIVING IT ONTO THE TOW TRAILER. FUEL PRESSURES WERE NORMAL, AND CODES WERE P06A7, P0106 AND P0236 WERE PRESENT AND PERMANENT WHICH WAS ALSO A NEW DEVELOPMENT. PERMANENT CODES HAVE BEEN ELUSIVE. A PREVIOUS RECALL ON 2013-2014 ESCAPES FITS THIS ISSUE EXACTLY. AFTER NUMEROUS HOURS OF RESEARCH, I AM CONVINCED THIS IS THE SAME ISSUE INVOLVED IN THE PREVIOUS FORD TSB 13-12-12 AND THE PREVIOUS TSB  13-7-5. I WAS IN GREAT DANGER WHEN THIS VEHICLE STALLED ON THE HIGHWAY WITHOUT WARNING. RUSH HOUR TRAFFIC ON 70 PLUS MPH ROAD WITH ALMOST NO SHOULDER. BECAUSE OF THIS AND THE DISABLING OF THE AIRBAGS WHEN THIS FAILURE OCCURS ALONG WITH THE SEAT BELT ACTUATORS, I THINK IT'S REASONABLE TO ASSUME THIS IS A SAFETY ISSUE. I'M CONFIDENT THIS ISSUE CAN BE REPLICATED.",
        "vin": "1FMCU0J97GU"
    }
]