[
    {
        "components": "STEERING,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "12/31/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181464,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2016",
                "type": "Vehicle"
            }
        ],
        "summary": "AN UNSAFE, ROAD HAZARD, A BOOBY TRAP F150 TRUCK.   THIS IS WHAT I GOT FROM A FORD DEALER IN COVINGTON. AN UNSAFE TRUCK.WHOSE FAULT THAT THE TRUCK IS ON THE ROADS? WOULD LIKE TO FIND OUT. FORD COMP. OR THE DEALER? WE ARE AN OLDER, SENIORS, MINORITY COUPLE JUST TRYING TO BUY OUR FIRST F150 TRUCK.    ON DEC. 31ST 2018, BOUGHT A 2016 F150 FORD  TRUCK FROM THIS DEALER. I WAS TOLD THAT THIS TRUCK IS COVERED BY A SPECIAL FORD COMP. TAKE BACK THE TRUCK. I HAVE HIS MESSAGE ON MY VOICE MAIL.  THEY WILL TRY TO FIX IT FULL WARRANTY BEING A BUY BACK TRUCK,INCLUDING EVEN THE LIGHT BULBS, ON TOP OF THE REGULAR WARRANTY. . SAID THAT VIBRATION CAME FROM THE WHEELS   NO, CALLED THEM AGAIN, SENT THEM FEW EMAILS. I TOLD THEM THAT I WILL GO ON A HUNGER STRIKE IN FRONT OF THEIR DEALER. FINALLY, THE OWNER,MATH, CALLED ME TO OR THEY WILL GIVE ME ANOTHER TRUCK. THEY KNEW THAT THE TRUCK IS NOT SAFE TO DRIVE ON THE STREETS. IT'S ROAD HAZARD. AND NOT TALKING ABOUT THE SMOKE INSIDE THE CABIN. YOU CAN DIE OF SUFFOCATION. DROVE ANOTHER OUR OR SO TO THEIR DEALER. HAD ERDDYN, THE SELLER GUY TO DRIVE TEST THE TRUCK. AFTER FEW MINUTES OF DRIVE, WE NOTICED THE VIBRATION. HE SAID IS NORMAL. THEN IT STARTED TO VIBRATE EVEN WORST. I ASKED HIM ABOUT THE STRONG SMOKE SMELL. DID NOT SAY ANYTHING. GOT BACK TO THE DEALER, INSPECTED THE TRUCK.THE TRUCK WAS IN GOOD SHAPE. AFTER 2 HOURS OF TALK WITH THE OWNER, THEY OFFER ME GET ME ANOTHER TRUCK. OLDER YEAR MODEL, INFERIOR CLASS. DID NOT ACCEPTED, SO, THEY SAID HIT THE ROAD. AND LEFT AFTER WASTING OVER 3 HOURS. SO, HERE I AM WITH A VERY UNSAFE TRUCK DRIVING ON THE ROADS. SOONER OR LATER AN ACCIDENT IS GONNA HAPPEN, OR ME DYING OF SUFFOCATION IN THE CABIN. NO. I'M GONNA PROTEST IN FRONT OF THEIR DEALER , AND THEN I'M GONNA DO THE SAME IN FRONT FORD MOTOR COMPANY HEADQUARTER. IS THEIR FAULT TOO. PUTTING BACK ON THE ROADS A UNSAFE CAR? AND COVINGTON FORD TO SELL IT.",
        "vin": "1FTEX1CP7GK"
    }
]