[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/13/2019",
        "dateOfIncident": "02/08/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11179764,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: 2007 NISSAN ALTIMA - CVT TRANSMISSION: I WAS ON THE PENNSYLVANIA TURNPIKE AND MORE THAN HALFWAY TO MY DESTINATION, AS I INCREASED ACCELERATION FROM 55 TO 65 MPH, THE ENGINE BEGAN STRAINING AND THE TACHOMETER INCREASED TO 3500 RPMS. THE AUTOMATIC TRANSMISSION WOULD NOT AUTO SHIFT. I BACKED OFF THE ACCELERATOR AND MAINTAINED A SPEED OF 55 MPH. EVENTUALLY, I ARRIVED AT MY DESTINATION. ON MY RETURN TRIP, THE PROBLEM OCCURRED AGAIN, THIS TIME ONLY WORSE. AGAIN, I DIDN'T PUSH THE VEHICLE TO HIGH SPEEDS. BY THE TIME I EXITED THE PENNSYLVANIA TURNPIKE, I COULD NOT ACCELERATE THE CAR BEYOND 45-50 MPH WITHOUT THE TACHOMETER ONCE AGAIN CLIMBING TO ALARMINGLY HIGH LEVELS. THE ENGINE WHINED AS IF IT WERE STRAINING MIGHTILY TO SHIFT INTO THE PROPER HIGH GEAR. I IMMEDIATELY DROVE THE CAR TO MY QUALIFIED MECHANIC WHO RAN A DIAGNOSTIC TEST. SEVERAL CODES INDICATED TRANSMISSION FAILURE. MY NISSAN HAS THE CVT TRANSMISSION WHICH I NOW UNDERSTAND IS DEEPLY FLAWED TRANSMISSION. I WAS UNAWARE OF THE PROBLEMS WITH THIS TRANSMISSION UNTIL I DID EXTENSIVE RESEARCH OF MY OWN AND LEARNED THAT MANY NISSAN OWNERS HAD EXPERIENCED SITUATIONS IDENTICAL TO MINE. I CALLED NISSAN AND A CASE WAS CREATED (#34468600). I WAS INFORMED THAT NISSAN HAS COMPLETELY ABSOLVED ITSELF OF ALL RESPONSIBILITY SINCE MY VEHICLE HAS 153K MILES ON THE ODOMETER. AT NO TIME SINCE I'VE OWNED THIS VEHICLE HAVE I RECEIVED A RECALL NOTIFICATION FROM NISSAN INDICATING THIS PROBLEM. THIS IS UNACCEPTABLE. WHEN A MULTINATIONAL CORPORATION ABSOLVES THEMSELVES OF ALL RESPONSIBILITY AFTER CREATING AND SELLING A PRODUCT THAT IS WELL DOCUMENTED AS BEING DEFICIENT, IT BECOMES EERILY REMINISCENT OF VOLKSWAGEN'S EMISSION SCANDAL AND AUDI'S SUDDEN ACCELERATION PROBLEM.",
        "vin": "IN4AL21E67N"
    }
]