[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2019",
        "dateOfIncident": "12/29/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11189914,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC90",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY NEW 2019 VOLVO XC90 ON DECEMBER 15, 2018. ON THE MORNING OF DECEMBER 29, 2018 I WAS WITH MY TWO CHILDREN WHEN THERE WAS A MALFUNCTION WITH THE VEHICLE KEY RECOGNITION SYSTEM WHICH ALLOWS FOR THE VEHICLE TO START. MY VEHICLE GAVE ME THE ERROR 'VEHICLE KEY NOT FOUND. SEE OWNER'S MANUAL'. THIS LEFT MYSELF, MY 4 YEAR OLD AND MY 4 MONTH OLD STRANDED. THE LOCAL FORT MYERS DEALER SAID THEY REPLACED THE FOB ANTENNA. MY VEHICLE THEN HAD THE SAME PROBLEM FEBRUARY 14, 2019 LEAVING MYSELF AND MY TWO CHILDREN STRANDED BECAUSE THE VEHICLE WOULDN'T START. VOLVO CLAIMED TO FIX THE ISSUE BUT THE VEHICLE AGAIN MALFUNCTIONED WHILE IN THE POSSESSION OF MCGRATH VOLVO OF FORT MYERS. AGAIN ON FEBRUARY 23, 2019 MY VEHICLE WOULDN'T RECOGNIZE MY KEYS AND WOULDN'T START, YET AGAIN LEAVING MYSELF AND MY TWO CHILDREN STRANDED. AFTER VOLVO TOLD ME THEY FIXED WHAT THEY THOUGHT WAS A DEFECTIVE WIRE, I RECEIVED MY VEHICLE BACK. ON MARCH 6, 2019 I WAS DRIVING WITH MY THEN 6 MONTH OLD BABY WHEN MY VEHICLE SHUT OFF TWICE. AS I WAS DECELERATING, MY VEHICLE ENGINE SHUT OFF BY ITSELF AND ALL SCREENS IN THE VEHICLE WENT BLANK. THIS OCCURRED TWICE WHILE DECELERATING. VOLVO HAS HAD MY CAR SINCE MARCH 6, 2019 PROVIDING ME NO UPDATES AS OF TODAY, MARCH 19. I HAVE ONLY OWNED THE VEHICLE 94 DAYS AND IT HAS BEEN IN THE SHOP 35 DAYS, WITH ONLY 2387 MILES ON IT.",
        "vin": "YV4102CK3K1"
    }
]