[
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "03/03/2019",
        "dateOfIncident": "02/24/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11183764,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "ALFA ROMEO",
                "productModel": "STELVIO",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "IT IS DISGUSTING THAT AUTO MANUFACTURERS DON'T GIVE A SPARE OR RUN FLATS ON A CAR TODAY. I WAS ON I95 WITH MY FAMILY WHEN MY NEW ONE DAY OLD CAR HAD BLOWOUT AT 10PM AT NIGHT. ALFA ROADSIDE TOOK 6 HOURS TO FIND US. THIS IS SAFETY ISSUE BECAUSE I WAS STUCK SIDE OF THE BLACK DARKEN HIGHWAY WITHOUT SPARE. THE SEMI TRUCK PASSING 12 INCHES AWAY FROM MY CAR DOING 80+ MPH. HOW IS IT IN 2019 MANUFACTURERS CAN SELL A CAR WITHOUT A SPARE OR EVEN FLARES. THE WORST PART ALFA OFFER SPARE AS OPTION BUT SINCE MY CAR CAME WITHOUT IT I CAN'T ORDER A SPARE NO WHERE. ALFA DON'T OFFER TO SENT A SPARE AFTERMARKET. TIRE RACK TOLD ME THAT THEY DON'T HAVE OR ARE AVAILABLE SPARES THAT FIT MY ALFA STELVIO. A SPARE TIRE KIT WEIGH 20 LBS AND HOW MUCH GAS CAN A PERSON SAVE. I WAS TOLD IT IS MPG THING. I AM IN THE DOGHOUSE WITH MY FAMILY AND I HAVE TO BUY ANOTHER FULL SIZE WHEEL AND TIRE TO USED AS MY SPARE. THE CAR HAS 20 INCH WHEELS AND TAKES UP 1/2 TRUNK SPACE. IF I PUT ON ANOTHER ALFA SMALLER RIM LIKE 18 TO SAVE SPACE I WAS TOLD BY MANUFACTURERS MY WARRANTY IS VOID!  I HAVING MY COUSIN IN ITALY SENT ME A DONUT SPARE FOR EMERGENCY. THE SPARE IS FROM ALFA ROMEO STELVIO TI MADE IN ITALY WHEEL THAT HAS SPARES INCLUDED AND SELL AFTERMARKET. THE DEALER SAYS IF I USED I LOSE MY WARRANTY. SAFETY ISSUES BEING STRUCK ON I95 WITHOUT A SPARE. HOW CAN NHTSA MAKE MANUFACTURERS GET AWAY WITH THIS IN 2019. SPARES ARE MORE IMPORTANT THAN ANY OTHER SAFETY FEATURES",
        "vin": "ZASFAKBNXJ7"
    }
]