[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/25/2019",
        "dateOfIncident": "03/15/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191464,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "CHEROKEE",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE FLAT TOWED OUR JEEP ACCORDING TO MANUAL SINCE WE PURCHASED IN 2014.  ON A FEW OCCASIONS WE HAD INTERMITTENT WOBBLING OF THE MOTORHOME WHICH WE THOUGHT WAS DUE TO WATER IN THE MOTORHOME'S HOLDING TANKS.  ON RECENT TRIP WE HAD TRAVELED LESS THAN TEN MILES ON THE HIGHWAY WHEN OUR JEEP TOW CAR BEGAN TO SWERVE VIOLENTLY FROM SIDE TO SIDE.  WE WERE DRIVING STRAIGHT BETWEEN 55-60 MPH WITH NO ON-BOARD WATER.  A DRIVER BEHIND US STOPPED AND SAID THERE WAS SOMETHING WRONG WITH OUR JEEP SINCE IT WAS SWERVING VIOLENTLY FROM SIDE TO SIDE, NOT THE MOTORHOME. WE INSPECTED EVERYTHING AND THERE WERE NO FLAT TIRES AND CONTINUED SLOWLY. THE EVENT OCCURRED REPEATEDLY AFTER WE  CROSSED A BRIDGE OR PATCH OF ROUGH HIGHWAY. WE EVENTUALLY UNHITCHED THE JEEP AND MY WIFE FOLLOWED BEHIND THE MOTORHOME WITHOUT INCIDENT.  MY WIFE LATER LEARNED THROUGH SOCIAL MEDIA THAT MOPAR ISSUED A WIRING HARNESS TO REPAIR THE LACK OF POWER TO THE STEERING SYSTEM WHEN THE JEEP IS FLAT TOWED. WE WERE NEVER WARNED OF THIS ISSUE BY MOPAR AND COULD HAVE HAD A SERIOUS ACCIDENT IF WE WERE TOWING WITH A SMALLER MOTORHOME.  WE CALLED MOPAR AND THEY CONFIRMED A REPAIR KIT WAS AVAILABLE BUT THAT IT MAY VOID OUR EXTENDED WARRANTY. WE PURCHASED THE WIRING HARNESS BUT HAVE NOT SCHEDULED THE REPAIR.  ALSO, WE WERE TOLD WE MUST PAY OUR $100 DEDUCTIBLE FOR THE REPAIR.  THIS IS A SAFETY ISSUE FOR ALL JEEP OWNERS THAT ARE UNKNOWINGLY TOWING A JEEP THAT COULD GO OUT-OF-CONTROL AT ANY MOMENT.  PLEASE RESPOND ON ACTIONS BEING TAKEN TO WARN OTHER OWNERS AND MAKE MOPAR ACCOUNTABLE FOR THEIR DEFECTIVE DESIGN.  I AM AN ENGINEER BY TRADE AND DESIGN PROCESSES THAT PREVENT SAFETY AND QUALITY ISSUES.  MOPAR IS NOT BEING TRANSPARENT WITH THIS DANGEROUS PROBLEM LURKING UNDER THE HOOD. I MAY BE REACHED AT [XXX] FOR MORE INFORMATION OR [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TT",
        "vin": "1C4PJMBS0EW"
    }
]