[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/26/2019",
        "dateOfIncident": "03/23/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191764,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2008",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUNK LATCH ON THIS MODEL IS FAULTY AND DANGEROUS.  THE MATERIAL USED FOR THE LATCH IS TOO SUSCEPTIBLE TO TEMPERATURE AND EITHER BECOME ROCK HARD IN THE WINTER COLD OR MELTY AND GOOEY IN THE SUMMER HEAT.  IT IS ALMOST IMPOSSIBLE TO GET INTO MY TRUNK THROUGH THE BACK LATCH IN THE WINTERTIME.  I TRY AND MAYBE IF THE WEATHER IS WARM ENOUGH AND IT'S JUST RIGHT, I CAN GET INTO MY TRUNK ABOUT 10 PERCENT OF THE TIME, IF THAT.  RECENTLY, I TRIED TO OPEN MY TRUNK UNSUCCESSFULLY.  IT OPENED ENOUGH TO NOT BE SECURELY SHUT, BUT NOT ENOUGH TO POP OPEN.  I WAS THEN ALSO UNABLE TO SHUT THE TRUNK.  WHAT ENDED UP TRANSPIRING WAS A TRUNK THAT WOULD REGISTER AS OPENING AND SHUTTING, WITHOUT THE ACTUAL ABILITY TO FULLY OPEN IT OR SHUT IT.  SO THE CAR DOOR LIGHT MUST HAVE COME ON AT SOME POINT AND DRAINED MY BATTERY WHICH THEN LEFT ME STRANDED ON A WINTER DAY IN A COLD PARKING LOT AWAY FROM HOME.  ALL BECAUSE TOYOTA EFFED UP AND USED A VERY POOR CHOICE IN MATERIALS FOR THEIR TRUNK LATCHES.  THIS IS SOMETHING THAT THEY SHOULD CORRECT SO OTHER PEOPLE DON'T HAVE TRUNK ISSUES THAT END UP CAUSING PROBLEMS.  IF SOMEONE NEEDS TO OPEN THEIR TRUNK IN THE WINTER TIME TO RETRIEVE MEDICINE, LIKE AN EPI-PEN, THEN THEY ARE SCREWED.  IF SOMEONE NEEDS TO OPEN THE LATCH TO HELP REMOVE AN ANIMAL OR CHILD OUT OF A CAR FOR WHATEVER REASON, THEY ARE SCREWED.  IF THEY JUST SIMPLY WANT TO HAVE TRUNK FUNCTIONALITY FOR HAULING GROCERIES, THEY ARE SCREWED.  AND IF THEY ARE LIKE ME AND MANAGE TO UNFORTUNATELY FIND THAT SWEET SPOT WHERE THE TRUNK ONLY PARTIALLY OPENS, BUT NOT FULLY, AND THEIR BATTERY ENDS UP BECOMING DRAINED AND THEY ARE STRANDED IN THE MIDDLE OF NOWHERE, THEY ARE ALSO SCREWED.  TOYOTA MADE A MISTAKE, AND THEY SHOULD DO SOMETHING TO FIX IT.  I LOVE MY PRIUS, BUT THIS ONE TRUNK LATCH ISSUE IS ENOUGH TO MAKE ME RECONSIDER OTHER CARS WITH FUNCTIONAL DOOR LATCHES.",
        "vin": "JTDKB20U287"
    }
]