[
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/23/2019",
        "dateOfIncident": "03/09/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11191064,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X2",
                "productYear": "2018",
                "type": "Vehicle"
            }
        ],
        "summary": "2018 BMW X2.  THE CAR HAS THE PARKING ASSIST FUNCTION, WHICH IS SUPPOSED TO PARALLEL PARK THE CAR.  AT DELIVERY, I WAS TOLD HOW TO USE THE SYSTEM, THE SYSTEM FINDS A SPACE, STEERS AND BRAKES.  THE VIDEO ON THE DEALERSHIP WEBSITE SAYS IT BRAKES FOR YOU.    HTTPS://WWW.PASSPORTBMW.COM/BLOGS/846/MARLOW-HEIGHTS-BMW-DEALER/WATCH-HOW-TO-ACTIVATE-THE-PARKING-ASSISTANT-FEATURED-ON-YOUR-BMW/.  THE VIDEO MAKES NO DISTINCTION BETWEEN MODELS AND IS UP AS OF 3/23/19.    THE VEHICLE MANUAL SAYS NOTHING ABOUT THE DRIVER BRAKING DURING THE PROCESS. SEE ATTACHED PICTURES OF MANUAL.    PARKING ASSIST FUNCTION BACKED INTO A CAR THE FIRST TIME I TRIED IT, DAMAGING THE BUMPER.      THE SCREEN IN THE CAR DOES SAY TO USE BRAKES, BUT THAT IS INCONSISTENT WITH THE SALES PEOPLE, THE MANUAL, AND THE VIDEO.  MOREOVER, IT IS A FLAW IN THE SYSTEM IF IT REQUIRES YOU TO BRAKE BUT WILL OPERATE WITHOUT USING THE BRAKES.  IMPOSSIBLE TO READ SCREEN AND BACK UP AT SAME TIME.    SYSTEM SERVICED, THE DEALERSHIP WAS CONFUSED ABOUT HOW IT FUNCTIONED ON DIFFERENT MODELS - THE \"BMW GENIUS\" AT THE DEALERSHIP THOUGHT IT SHOULD BRAKE FOR YOU, THE MECHANICS DID NOT.  WHEN THE \"BMW GENIUS\" TESTED IT BY TRYING TO PARK 3 TIMES, HE THEN AGREED DRIVER SHOULD BRAKE - SOMETHING HE WAS PREVIOUSLY UNFAMILIAR WITH -  BUT FOUND THAT THE SYSTEM WAS STEERING INTO OTHER CARS AS IT PARKED - ATTEMPTING TO SIDE SWIPE THE CARS IT WAS PARKING NEXT TO.  HE SAID HE THOUGH THE SYSTEM WAS MISALIGNED, AND IN HIS WORDS \"WOULD NOT BE COMFORTABLE USING IT.\"      THIS SYSTEM IS GOING TO INJURE SOMEONE OR SOMETHING. THE INSTRUCTIONS ARE CONFUSING AND INCONSISTENT.   CLEARLY THE SALESMAN, \"GENIUSES,\" AND SERVICE PEOPLE DO NOT UNDERSTAND THE DIFFERENCES BETWEEN THE MODELS.  THE MANUAL OMITS ANY REFERENCE TO USING THE BRAKES DURING THE PROCESS WHICH IS COMPLETELY INCONSISTENT WITH OTHER MODELS AND THE BMW VIDEO ON HOW TO OPERATE THE SYSTEM.",
        "vin": "WBXYJ5C34JE"
    }
]