[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/22/2019",
        "dateOfIncident": "06/04/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11202864,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MAXIMA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RADAR OBSTRUCTION: FRONT DISTANCE/RADAR SENSOR DEACTIVATES LEAVING THE VEHICLE WITHOUT THE COLLISION SAFETY FEATURES (FORWARD COLLISION WARNING, AUTOMATIC EMERGENCY BRAKING AND INTELLIGENT CRUISE CONTROL).  THE SYSTEM WILL DEACTIVATE EITHER WHILE DRIVING OR WHEN STOPPED AT A LIGHT.  THE CAUSE SEEMS TO BE WHEN A VEHICLE IN THE LANE IN FRONT OF MY CAR MOVES INTO OR OUT OF THE LANE, I CHANGE LANES WITH A VEHICLE IN FRONT OF ME, OR SOMETIMES WHEN THE VEHICLE IN FRONT HAS MOVED OUT OF RANGE.  THE SYSTEM FAULTS ARE MORE PREVALENT DURING RAINING WEATHER, BUT HAS BEEN GETTING WORSE EVEN ON CLEAR SUNNY DAYS.  THE NISSAN DEALERSHIP HAS REPLACED THE DISTANCE/RADAR SENSOR AND OTHER ABS MODULES BUT HAS NOT REMEDIED THE SYSTEM FAULTS.  THE DEALERSHIP CONTACTED THE NISSAN MOTOR CORPORATION ENGINEERING DEPARTMENT WHICH DOES NOT HAVE A CURRENT FIX FOR THE PROBLEM AND INSTRUCTED THE DEALERSHIP TO 'TELL THE CUSTOMER THAT NISSAN WOULD CONTACT ME ONCE THE PROBLEM WAS FIXED'.  AFTER 10 MONTHS, I AM STILL WAITING FOR NISSAN TO CALL, AND TO DELIVER A VERIFIED FIX TO THE COLLISION SAFETY FEATURES ON THE 2017 NISSAN MAXIMA.  BY THE WAY, DURING MY MULTIPLE VISITS TO THE DEALERSHIP, I HAVE DRIVEN MULTIPLE LOANER VEHICLES (VARIOUS MODELS) WHICH EXHIBIT THE SAME OR SIMILAR SAFETY ISSUES WITH THE COLLISION SAFETY FEATURES ON NISSAN VEHICLES FROM 2016 THROUGH 2018.",
        "vin": "1N4AA6AP2HC"
    }
]