[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/06/2019",
        "dateOfIncident": "05/01/2019",
        "fire": true,
        "manufacturer": "Tesla, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205764,
        "products": [
            {
                "manufacturer": "Tesla, Inc.",
                "productMake": "TESLA",
                "productModel": "MODEL 3",
                "productYear": "2019",
                "type": "Vehicle"
            }
        ],
        "summary": "HI,    ACCORDING TO THE FOLLOWING ARTICLE:    HTTPS://WWW.BUSINESSINSIDER.COM/TESLA-MODEL-S-CATCHES-FIRE-IN-SAN-FRANCISCO-GARAGE-2019-5    TESLA CEO ELON MUSK HAS SAID THE COMPANY'S VEHICLES ARE LESS LIKELY TO CATCH FIRE THAN GAS-POWERED ONES, BUT DATA FROM THE NATIONAL FIRE PROTECTION ASSOCIATION SUGGESTS THE OPPOSITE.[XXX] HAS MADE A FRAUDULENT CLAIM. HE HAS COMMITTED A CRIME. WHAT IS NHTSA GOING TO DO ABOUT THIS SERIOUS ISSUE? I BELIEVE NHTSA HAS A FIDUCIARY OBLIGATION TO THE WORLD TO HANDLE THIS SITUATION IN A RIGHT WAY. I BELIEVE IMMEDIATE ACTION IS NEEDED, INCLUDING REQUIRING TESLA INC. TO DO A RECALL IF WARRANTED. I HOPE NHTSA WOULD DO THE RIGHT THING. I BELIEVE TIME IS OF THE ESSENCE. I HOPE TO HEAR FROM YOU GUYS. THANKS.    ALSO, PLEASE CONSIDER THE FOLLOWING TWO CONCERNING ARTICLES AND VIDEOS AS WELL:     1)HTTPS://KTLA.COM/2019/04/22/VIDEO-APPEARS-TO-SHOW-TESLA-EXPLODING-IN-SHANGHAI-PARKING-LOT-PROMPTING-INVESTIGATION/TESLA IS INVESTIGATING WHY A MODEL S APPEARED TO EXPLODE IN A SHANGHAI PARKING GARAGE    2)HTTPS://ABC7NEWS.COM/5283936/ TESLA MODEL S CATCHES FIRE IN SAN FRANCISCO GARAGE     AREN'T THESE TWO RECENT EVENTS EXTREMELY CONCERNING? THANKS.    IF YOU GUYS CAN'T DO ANYTHING ABOUT THIS SERIOUS ISSUE, CAN YOU PLEASE PROVIDE ME WITH THE NAMES OF SOME GOVERNMENT AGENCIES WHO MIGHT BE ABLE TO HELP ME?    REGARDS,    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    }
]