[
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/16/2019",
        "dateOfIncident": "04/11/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196714,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "MURANO",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THE CAR HANDLED VERY POORLY IN SNOW/ICE/WET CONDITIONS OVER THE WINTER.  THE CAR WAS IN THE SHOP FOR AN OIL CHANGE AND THE MECHANIC NOTICED BOTH REAR TIRES WERE WORN DOWN TO NOTHING ON THE INSIDE OF THE TIRE.  UPON FURTHER INSPECTION, HE FOUND THAT THE REAR SUBFRAME HAD RUSTED THROUGH AND BROKEN INTO TWO.  THE VEHICLE WAS DECLARED UNSAFE TO DRIVE.  I BOUGHT THE CAR USED THIS PAST SUMMER, BUT I HAVE THE SERVICE RECORDS AND I KNOW IT WAS PROPERLY MAINTAINED.  THE ESTIMATED COST OF REPAIRS IS MORE THAN I CAN AFFORD ($5,000).  I CONTACTED NISSAN TO SEE IF THEY WOULD PROVIDE ANY ASSISTANCE WITH REPAIRS AND I SPOKE WITH 3 DIFFERENT PEOPLE (FIRST CONSUMER AFFAIRS, THEN A SUPERVISOR, AND FINALLY A MANAGER), WHO ALL TOLD ME THAT THEY ARE \"NOT IN A POSITION TO ASSIST BECAUSE THE VEHICLE IS OUT OF WARRANTY\".  THE LAST PERSON (MANAGER, CONSUMER AFFAIRS) WOULDN'T EVEN LET ME SPEAK BEFORE HE TOLD ME THEY WOULDN'T OFFER ANY ASSISTANCE.  WHEN I ASKED IF THERE WAS SOMEONE ELSE I COULD SPEAK WITH, I WAS TOLD NO - THERE ISN'T ANYONE ELSE WHO WOULD TALK TO ME AND THEY WILL NOT BE ABLE TO ASSIST ME.  THIS IS AN EXTREMELY DANGEROUS SITUATION AND I AM FORTUNATE THAT BOTH OF  THE TIRES DID NOT BLOW OUT WHILE I WAS DRIVING ON THE EXPRESSWAY.   I AM SHOCKED THAT THERE HAS NOT BEEN A RECALL ISSUED AS I SEE OTHERS HAVE COMPLAINED ABOUT THE SAME ISSUE.",
        "vin": "JN8AZ08W07W"
    }
]