[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/24/2019",
        "dateOfIncident": "05/20/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209664,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "2006",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Zhaoqing Junhong Co., Ltd.",
                "productMake": "ANTARES",
                "productModel": "COMFORT A5",
                "productYear": "9999",
                "size": "LT225/75R16 118/116S 10PR",
                "type": "Tire"
            }
        ],
        "summary": "I RECENTLY EXPERIENCED A BLOWOUT OF A TIRE STILL IN LIKE NEW CONDITION. I MAINTAIN ACCURATE AIR PRESSURE AT ALL TIMES AND CHECK THEM OFTEN. I ALSO HAD NOT DAMAGED THE TIRE IN ANY WAY. NO HOLES. NO REPAIRS. IT WAS LIKE NEW IN EVERY RESPECT. I WAS TRAVELING AT THE RATED SPEED LIMIT OF 70MPH ON AN INTERSTATE WHEN AT FIRST I HEARD A NOISE AND THEN FELT VIBRATIONS, AND THEN THE BACK OF VEHICLE SWAYED A LITTLE FROM SIDE TO SIDE. I BACKED OFF THE ACCELERATOR AND PULLED OVER OFF THE ROAD SAFELY. I FOUND THAT THE TREAD SECTION OF THE TIRE HAD TORN AWAY FROM THE SIDEWALL. AND UPON FURTHER EXAMINATION I COULD CLEARLY SEE WHY. THE THICKNESS OF THE RUBBER CONNECTING THE TREAD TO THE SIDEWALL WAS LESS THAN A 1/4\" THICK ON ONE SIDE OF THE TIRE, WHILE DIRECTLY ACROSS 180 DEGREES ON THE OTHER SIDE IT WAS CLOSER TO A HALF INCH IN THICKNESS. THE THINNER PORTION OF RUBBER ON THE ONE SIDE WAS SIMPLY NOT THICK ENOUGH, NOR STRONG ENOUGH TO HOLD THE TIRE TOGETHER AT HIGHWAY ROTATIONAL SPEEDS AND IT SIMPLY CAME APART. WALMART SAID THEY WOULD REPLACE THE TIRE, BUT I AM STILL VERY CONCERNED NOW ABOUT THE OTHER 3 TIRES ON MY SUV PURCHASED AT THE SAME TIME AS THIS DEFECTIVE TIRE. ***ADDED: I TRIED CALLING NHTSA AND THE PERSON WHO ANSWERED THE PHONE WAS VERY CONTROLLING, UNPLEASANT, RUDE, AND HUNG UP WHEN I TOLD THEM THEY WERE NOT LISTENING TO WHAT I SAID. SHE INSISTED I USE A PRINTER OR GO GET ONE, OR RUN TO THE LIBRARY AND JUMP THROUGH A BUNCH OF HOOPS FOR THEM. I TOLD HER THAT WILL NOT BE HAPPENING. THIS WEBSITE SHOULD BE RUN CORRECTLY SO WE THE PEOPLE CAN PUT THE CORRECT INFORMATION INTO IT RATHER THAN BE TOLD TO PUT INCORRECT INFORMATION INTO IT. I TRIED TYPING IN THE CORRECT BRAND AND TIRE SERIES, AND THIS WEBSITE WILL ONLY ACCEPT THE INCORRECT INFORMATION WHICH MAKES NO SENSE, BUT IT IS GOVERNMENT AFTER ALL AND THAT MEANS INCOMPETENT AND AUTHORITARIAN EVEN WHEN WRONG AND RUDE! A DISSERVICE TO CITIZENS. CORRECT TIRE FOR THIS COMPLAINT: ANTARES SMT A7, AND NOT COMFORT A5.",
        "vin": "JTEZU14R868"
    }
]