[
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/21/2019",
        "dateOfIncident": "04/29/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11209114,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "CADENZA",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CUPPED TIRES AROUND 17000 MILES.  DEALER BLAMED ME FOR CAR NOT BEING ALIGNED AND NOT ROTATED FREQUENTLY ENOUGH  I.E. 7500 MILES.  I DISAGREED WITH DEALER FILED COMPLAINT WITH KIA AND THEY MADE A COMPROMISE AND I PAID FOR 2 TIRES AND KIA PAID FOR 2 TIRES, DIFFERENT TIRE BRAND THAN PREVIOUS TIRES.  CAR AGAIN CUPPED TIRES AROUND 44000 MILES.  I HEARD SOUND IMMEDIATELY AFTER TIRE ROTATION BACK TO FRONT.  TOOK CAR TO KIA SEAN THE SERVICE MANAGER CONFIRMED FRONT TIRES WERE CUPPED.  TOOK CAR TO KIA DEALER A WEEK OR SO LATER TO DIAGNOSE PROBLEM. THEY LOOKED AT CAR IT WAS WITHIN ALIGNMENT SPECS AND TIRE ROTATIONS DONE APPROX. EVERY 7500 MILES. KIA DEALER THEN TOLD ME THAT THEY BELIEVED THAT THE TIRES WERE AT FAULT AND WERE GOING TO CONTACT TIRE MANUFACTURER TO REPLACE TIRES.  I STRONGLY DISAGREED WITH THIS POSITION AND SAID THAT ACCORDING TO EVERYTHING I HAVE READ AND BEEN TOLD THE MOST LIKELY CAUSE IS A SUSPENSION PROBLEM I.E. SHOCKS OR STRUTS.  IT IS ALSO NOT GOOD FOR THE CAR TO BE DRIVEN WITH A SUSPENSION PROBLEM AND OR CUPPED TIRES.  CUPPED TIRES ARE CAUSED BY POOR CONTACT WITH THE ROAD WHICH MAY ALSO BE DANGEROUS.  I DON'T BELIEVE THE PROBLEM IS CAUSED BY THE TIRES (2 SETS TIRES DIFFERENT BRANDS) SO CAN NOT WITH A GOOD CONSCIOUS SUPPORT A TIRE WARRANTY CLAIM.  I BELIEVE AND THERE IS A PROBLEM WITH THE SUSPENSION OF THIS CAR NOT SURE IF IT IS A DESIGN PROBLEM OR A PROBLEM WITH A CERTAIN SUSPENSION PART SHOCKS, STRUTS OR BOTH?  ON 5/17/19 I FILLED ANOTHER COMPLAINT WITH KIA AND AM CURRENTLY WAITING ON A RESPONSE.  I AM FILLING THIS COMPLAINT IN CASE OTHERS ARE HAVING THE SAME PROBLEM.",
        "vin": "KNALB4J17H5"
    }
]