[
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "06/05/2019",
        "dateOfIncident": "06/02/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11218214,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "RENEGADE",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNDAY, 2 JUN 2019 @ APPROXIMATELY 1900 ME AND MY FRIEND WERE RETURNING HOME FROM FISHING, GOING APPROXIMATELY 30 MPH ON A LIGHT GRAVEL ROAD INSIDE A WILDLIFE STATE PRESERVE. WHILE MAKE STARTING TO MAKE A RIGHT TURN, MY STEERING WHEEL LOCKED UP ON ME WHICH MAKE IT IMPOSSIBLE TO TURN. I SLAMMED THE BRAKES AND WAS ABLE TO FREE THE STEERING WHEEL IN TIME TO TURN HARD RIGHT CAUSING THE VEHICLE TO SLIDE AND COMING TO A STOP INCHES BEFORE GOING INTO THE RIVER. MY CAR WAS HANGING OFF THE BANK WITH THE POSSIBILITY OF ROLLING OVER INTO THE RIVER, MY FRIEND AND I HAD TO EXIT OUT OF THE PASSENGER DOOR FOR THE FEAR OF A POSSIBLE ROLLOVER. I WAS UNABLE TO SEE ANY WARNING LIGHTS (HILL ASSIST, ABS WARNING, ETC) AS EVERYTHING HAPPENED VERY FAST. I CURRENTLY HAVE A ACCIDENT CLAIM IN WITH MY INSURANCE AND THE JEEP DID SUSTAIN DAMAGE TO THE DRIVER FRONT TIRE. I WILL NOT KNOW THE RESULTS UNTIL TOMORROW OR THE NEXT DAY BUT FROM THE INITIAL LOOK, IT APPEARS THAT MY POWER STEERING FUILD IS LEAKING OUT AND ONTO MY AXLE AND ROTOR. AT THIS TIME IT IS UNCLEAR IF THIS ISSUE WAS CAUSED BEFORE OR AFTER THE IMPACT INTO THE RIVER BANK. AFTER THE TOLL TRUCK PULLED ME OUT I WAS ABLE TO DRIVE BACK HOME HOWEVER I WAS HEARING A FLIPPING NOISE COMING FROM MY DRIVER FRONT TIRE. I AM NOW VERY UNCOMFORTABLE WITH DRIVING THIS VEHICLE, AS THIS INCIDENT COULD HAVE CAUSED SERIOUS BODILY HARM. PICTURES WILL BE UPLOADED LATER AS I HAD LOST MY PHONE IN THE RIVER A D HAVE NOT RECEIVED THEM FROM MY FRIEND YET.",
        "vin": "ZACCJBBB1HP"
    }
]