[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/20/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11221564,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "G6",
                "productYear": "2009",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL STARTED TURNING / SHIMMYING BY ITSELF JUST WHEN STANDING STILL, RANDOMLY. STARTED DOING IT WHILE DRIVING A FEW WEEKS LATER.  SHIMMY/TURNING WHEEL HAPPENED MORE OFTEN AS TIME PASSED, WHILE PARKED, DRIVING, BACKING UP, DRIVING SURFACE STREETS AND FREEWAYS,  AND NOW MY POWER STEERING LIGHT IS ON!?!  IT TURNS LOOSLY TO THE RIGHT AND TIGHT TO THE LEFT. I AM BEYOND PERTURBED, AS THIS SHOULD HAVE BEEN RECALLED WITH OTHER YEARS THIS MODEL WAS MADE THAT DID HAVE RECALLS.  ALL GM OFFERED WAS A $100 VOUCHER TO USE TOWARD DIAGNOSTIC FEE. THEY TOLD ME THAT ANY EXTENDED COVERAGE I HAD THAT COULD HAVE BEEN COVERED WITH THIS REPAIR/FIX EXPIRED THE BEGINNING OF THE MONTH, BUT MAYBE I COULD GET A DEARLER-ASSISTED REPAIR??!?!  I'M AFRAID TO DRIVE ANYWHERE, LET ALONE THE FREEWAYS.  I'D LIKE TO ADD, I ONLY HAVE JUST OVER 62K MILES ON THIS VEHICLE AND HAVE NEVER HAD A CAR HAVE STEERING FAILURE, EVER., LET ALONE IMAGINE THIS AT SUCH LOW MILEAGE!    I SWEAR, THAT IF THEY DON'T RESOLVE THIS AND FIX IT  IT'LL BE MY LAST GM CAR.  SAD, AFTER MY DAD POURED HIS BLOOD SWEAT AND TEARS INTO THIS COMPANY FOR SO MANY YEARS.  SMH.  MAYBE A CLASS ACTION LAWSUIT?  HOW CONVENIENT TO CUT OFF A RECALL OF THIS PARTICULAR PROBLEM BY MANUFACTURING DATES, WHEN THIS RECALL WASN'T EVEN ISSUED UNTIL 2014!!  MY MECHANIC IS FINDING THROUGH HIS RESEARCH THAT 'AFTER MARKET' PARTS ARE NOT NECESSARILY FIIXNG THE ISSUE EITHER. WHAT THE HECK?!  62K MILES ON A 10 YEAR OLD CAR  AND I NEED A NEW CAR? THIS ISN'T RIGHT!",
        "vin": "1G2ZG57B894"
    }
]