[
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/14/2019",
        "dateOfIncident": "02/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11220014,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2007",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2007 CAMRY IN 2006 AND IT HAS BEEN GREAT TILL THE LAST 6 MONTHS WHEN THE DASH BOARD STARTED TO GET STICKY AND IS NOW FULLY STICKY AND GLOSSY TO THE POINT WHERE THE SUN REFLECTS OFF IT AND IS BLINDING. TOYOTA SAID THEY HAD A RECALL WHICH I WAS NEVER NOTIFIED. THE ADDRESS WHEN I BOUGHT MY CAR IS THE SAME IN MY DRIVER'S LICENSE AND I NEVER CHANGED IT. I LIVE IN BUENA PARK SINCE 1991 AND MY DRIVERS LICENSE HAS THAT ADDRESS SINCE I WAS 18 (18 YEARS AGO). I CALLED TOYOTA AND THEY SAID THE RECALL NEEDED AND ITS. OT THEIR CONCERN. I FIND IT IRRESPONSIBLE THAT TOYOTA TAKES NO ACTION FOR FAULTY MANUFACTURING OF THEIR PRODUCTS AND SHIFTS THE FAULT TO THE CONSUMER WHEN I HAD NO IDEA THERE WAS ANY ISSUES. SECONDLY WHEN THEY HAD THE GAS PEDAL RECALL I TOOK MY CAR IN FOR MAINTENANCE AND WHEN I GOT IT BACK THEY CUT THE PEDAL WITHOUT MY KNOWLEDGE AND SAID A REPLACEMENT WAS ON BACK ORDER. I HAVE SINCE 2010 REQUESTED THE REPLACEMENT TILL 2011 AND THEY ALWAYS SAID IT IN BACK ORDER. I GAVE UP ASKING BECAUSE I GOT EXCUSES. WHEN I'M DRIVING MY FOOT SLIPS OFF THE GAS PEDAL BECAUSE ITS SHORTER. ITS HAZARDOUS WHEN YOUR MAKING A TURN AND THE CAR LOSES ACCELERATION AND YOU HAVE TO QUICKLY HIT THE GAS AGAIN. THIS IS DANGEROUS WHEN THE ROAD IS SLIPPERY IN A FRONT WHEEL DRIVE. I HAVE CONTACTED TOYOTA WITH THESE CONCERNS AND ALL THEY SAY IS THAT THERE ISNT ANYTHING THEY CAN DO.",
        "vin": "4T1BK46K37U"
    }
]