[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "06/20/2019",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11222264,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "BRZ",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I PICKED UP MY CAR FROM GETTING A RECALL DONE (NHTSA ID 18V-772, SUBARU RECALL WTY-84) ON THE VALVE SPRINGS A FEW DAYS AGO. MY MOTOR WAS RUNNING GREAT AND I DIDN'T HAVE ANY PROBLEMS BEFORE THE RECALL. SINCE I GOT MY CAR BACK FROM THE RECALL, THERE HAVE BEEN SEVERAL NOISES COMING FROM THE ENGINE AND A BURNING SMELL ONCE THE CAR GETS UP TO TEMPERATURE. THERE IS A NOISE BRIEFLY UPON STARTUP WHICH LEADS ME TO BELIEVE IT IS OIL PRESSURE RELATED. THERE IS ALSO A HIGH PITCHED WHINING SOUND WHILE ACCELERATING. WHEN I'M CRUISING ON THE HIGHWAY, THERE IS AN OCCASIONAL, SPORADIC CLATTER THAT SOUNDS LIKE SOMEONE IS PLAYING A SNARE DRUM UNDER MY HOOD. THE DEALER CLAIMS THAT THE REPAIR WAS PERFORMED CORRECTLY.     MANY PEOPLE HAVE HAD PROBLEMS WITH THEIR MOTORS AFTER THIS RECALL! IN FACT, THERE ARE MORE CARS THAT HAVE HAD PROBLEMS AFTER THE RECALL THAN WERE AFFECTED BY FAULTY VALVE SPRINGS TO BEGIN WITH! SOME PEOPLE HAVE BEEN RIPPED OFF BY THE DEALERS AND IT IS TOTALLY UNACCEPTABLE! ONE CAR BURNED TO THE GROUND TWO WEEKS AFTER THE RECALL! I LIVE IN THE MOUNTAINS AND IT'S SUMMER IN SOUTHERN CALIFORNIA AND I DON'T WANT TO START THE NEXT WILD FIRE FROM MY CAR CATCHING FIRE. I HAVEN'T BEEN DRIVING IT THE LAST FEW DAYS.     SOMEONE HAS TO DO SOMETHING! I UNDERSTAND SUBARU AND TOYOTA (THE OTHER MANUFACTURER INVOLVED WITH PRODUCING THIS VEHICLE) HAVE MADE STATEMENTS ABOUT THIS BUT THAT IS NOT GOOD ENOUGH! THEY NEED TO BE HELD ACCOUNTABLE FOR THIS MISTAKE. THESE CARS ARE NOT SAFE AFTER THE RECALL AND SOME OF THEIR CUSTOMERS ARE LOSING A LOT OF MONEY. THERE IS A PROBLEM WITH THE RECALL PROCEDURE OR THE TECHNICIANS ARE NOT BEING CAREFUL ENOUGH.",
        "vin": "JF1ZCAC12D1"
    }
]