[
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/14/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231764,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "SCION",
                "productModel": "TC",
                "productYear": "2005",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A RED 2005 SCION TC FOR MY DAUGHTER IN FEBRUARY, 2019 FROM TOYOTA AUTO NATION IN DAVIE, FL.  THEY HAD IT PRICED IN GOOD CONDITION, SO I EXPECTED TO GET SOME USE OUT OF IT.  I PAID ALMOST $6,000. MONTH LATER IT OVERHEATED ON THE HIGHWAY (595) AND MY DAUGHTER HAD TO PULL OVER LATE AT NIGHT ON THE HIGHWAY AND I HAD TO HAVE IT TOWED TO MY HOME. VERY SCARY AND UNSAFE SITUATION FOR A TEEN.   HAD IT TOWED BACK TO THEIR SERVICE STATION  AND IT TURNED OUT TO BE A PROBLEM, THAT COST ME $600. I FIND IT HARD TO BELIEVE THAT THIS COMPANY WOULD NOT HAVE SEEN ANY DAMAGE UNDER THE HOOD.  SHAME ON THEM FOR SELLING ME A CAR THAT BROKE DOWN IN ONE MONTH. I HAVE CALLED THEM AND THEY WILL NOT HELP WITH THE PAYMENT.  IT IS 'AS IS'   I CALLED AND TEXT THE SALES GIRL AND NEVER RECEIVED A CALL BACK OR RESPONSE.   FINALLY PUT A BAD REVIEW ON THEIR WEBSITE AND RECEIVED AN E-MAIL TO CONTACT MANAGER TO HELP WITH THE SITUATION, ONLY TO FIND OUT THAT WAS AN AUTOMATED EMAIL AND AGAIN TOLD 'TOO BAD'. IT IS NOW JULY AND YET AGAIN IT BROKE DOWN ON MY DAUGHTER AS SHE WAS AT THE GAS STATION.  IT WOULD NOT START UP AFTER SHE TURNED IT OFF.  TRIED TO JUMP IT AND NOTHING.    ONCE AGAIN HEADED TO GO TO THE DEALERSHIP SERVICE STATION. AT FIRST WAS TOLD IT WAS ONLY THE BATTERY, SO I SAY GO AHEAD, I WILL PAY THE $140 AND REPLACE IT AND WE WILL GO FROM THERE. ONLY TO GET ANOTHER CALLBACK FROM THE MANAGER STATING THAT THERE IS MORE WRONG WITH THE CAR, THAT AFTER THE $89 FIVE POINT CHECK ON THE VEHICLE AND REPLACING THE BATTERY THAT IT STILL DID NOT START.  THEY WOULD HAVE TO KEEP IT OVER THE WEEKEND.  IT IS COSTING ME AN ARM AND A LEG AND I NEED HELP WITH THIS.  I FEEL LIKE THEY LIED ABOUT THIS VEHICLE AND ALLOWED A CAR THAT IS NOT SAFE TO BE BOUGHT AT THEIR BUSINESS.  I AM CONCERNED FOR MY CHILD'S SAFETY AND ONLY WANT WHAT IS FAIR.",
        "vin": "JTKDE177350"
    }
]