[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/12/2019",
        "dateOfIncident": "07/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231464,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-150",
                "productYear": "2015",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCED AN EGREGIOUS SAFETY ISSUE WITH MY VEHICLE WHEREAS THE BRAKING SYSTEM HAS FAILED. THIS MORNING WHILE ON THE INTERSTATE TO BRING MY TWO KIDS (3 YRS OLD AND 12 MONTHS OLD) TO DAYCARE, MY DASHBOARD INDICATED \"BRAKE FLUID LEVEL LOW.\" WHILE I CONTINUED TO DRIVE, I ASSUMED PERHAPS THE BRAKE FLUID MAY NEED TO BE TOPPED OFF FOR WHATEVER REASON. HOWEVER, TO MY SURPRISE- ABOUT A MILE FURTHER I DISCOVERED THAT THE BRAKES WERE INOPERABLE AND I IMMEDIATELY PANICKED. I TOOK IT UPON MYSELF TO GET TO THE SHOULDER OF THE HIGHWAY AND ALLOW THE VEHICLE TO COME TO A ROLLING STOP AND INCH TOWARD THE NEAREST EXIT. FEARING FOR THE LIVES OF MYSELF AND TWO CHILDREN, I FURTHER INCHED TOWARD THE NEAREST PARKING LOT (BURGER KING) WHERE I COULD HAVE MY FAMILY REMOVED FROM HARM'S WAY.     THE BRAKES ARE TOTALLY UNUSABLE AND WHEN APPLYING THE BRAKE PEDAL, THE PEDAL GOES ALL THE WAY DOWN TO THE FLOORBOARD. THERE IS NO PRESSURE OR RESISTANCE AS THE BRAKES WOULD PRESENT THEMSELVES WHEN WORKING PROPERLY. I REFUSE TO DRIVE THIS VEHICLE WITH THIS ISSUE AND AM NOW DEMANDING SAFETY RECALL.    MY VEHICLE WAS TOWED TO BUTCH OUSTALET FORD OF GULFPORT, MS ON 7/12/2019. MY SERVICE ADVISOR, ZACH KUNZ, ADVISED THAT THE BRAKING SYSTEM HAS INDEED FAILED. SPECIFICALLY, THE SEAL ON THE MASTER CYLINDER BECAME DEFECTIVE AND CAUSED THE BRAKE FLUID TO SPILL INTO THE BRAKE BOOSTER. THIS WAS A SUDDEN AND TOTAL FAILURE OF THE BRAKING SYSTEM. I WAS FURTHER ADVISED THAT THIS IS NOT COVERED UNDER ANY WARRANTY AND THAT TEH REPAIR COSTS WERE UPWARDS OF $900.     I AM NOW STUCK PAYING $900 FOR A PROLIFIC SAFETY DEFECT WHERE FORD'S FAILURE ALMOST CAUSED FATALITY OF MYSELF AND CHILDREN. I AM DEMANDING THAT THIS BE PLACED ON MANDATORY RECALL, AT THE EXPENSE OF FORD MOTOR COMPANY.     CURRENT MILEAGE: 90758",
        "vin": "1FTEW1EG7FF"
    }
]