[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/20/2002",
        "dateOfIncident": "12/19/2002",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000322,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "ML320",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 MERCEDES-BENZ ML320 SUV.  ON THURSDAY, DECEMBER 19, MY WIFE WAS DRIVING THE VEHICLE WHEN SUDDENLY THE \"HARMONIC BALANCER\" FAILED (BECAME DETACHED), CAUSING A COMPLETE LOSS OF POWER TO THE VEHICLE, RESULTING IN A DISABLED VEHICLE AND LEAVING MY WIFE AND FAMILY STRANDED.  THE \"HARMONIC BALANCER\" IS THE MAIN PULLEY WHEEL WHICH IS ATTACHED TO THE CRANKSHAFT.  THIS PULLEY WHEEL IN TURN DRIVES ALL OTHER BELT-DRIVEN ITEMS, SUCH AS POWER STEERING PUMP, AC, ALTERNATOR, WATER PUMP, ETC.      FIRST, THIS ITEM SHOULD BE SO RESILIENT THAT FAILURE IS NEARLY IMPOSSIBLE, AND SECOND, BOTH THE TOW TRUCK DRIVER AND THE DEALER WHO IS REPAIRING IT STATED THAT THIS TYPE OF FAILURE IS \"NOT AT ALL SURPRISING OR UNCOMMON\" ON THE MB ML320 SUV.  WHILE NO INJURIES OR DEATHS OCCURRED IN THIS CASE, IT SEEMS THAT IF THIS CRITICAL COMPONENT WERE TO FAIL AT HIGHWAY SPEEDS, THE RESULTING LOSS OF POWER COULD CAUSE A LOSS OF CONTROL OF THE CAR.    I WILL ALSO ADD THAT WE HAVE VERY CAREFULLY FOLLOWED ALL OF THE ROUTINE MAINTENANCE RECOMMENDED BY THE MANUFACTURER.  IF THIS CRITICAL COMPONENT IS SUBJECT TO FAILURE, A CHECK SHOULD BE PART OF THE SCHEDULED MAINTENANCE.    BUT TO BE DIRECT, THE DESIGN OF THE \"HARMONIC BALANCER\" IS FAULTY, AND CLEARLY SHOULD BE RECALLED.  THE REPAIRS ARE EXPENSIVE (UPWARDS OF $1500) AND THE RESULTS ARE POTENTIALLY DEADLY.  LET'S NOT WAIT FOR AN INJURY OR DEATH TO RESULT BEFORE SOME ACTION IS TAKEN ON THIS! TS",
        "vin": "4JGAB54E3XA"
    }
]