[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/23/2019",
        "dateOfIncident": "07/23/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11234114,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SORENTO",
                "productYear": "2013",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE ONLY HAD THIS USED VEHICLE FOR ONE YEAR AND WITHIN THAT ONE YEAR OF HAVING TO HEAR SORRENTO I'VE HAD TO CHANGE MY HEADLIGHTS AND BRAKE LIGHTS MORE THAN THREE TIMES EACH. I TOOK IT TO MY  LOCAL KIA DEALER AND SHOWED THEM FOUR DIFFERENT LIGHTBULBS THAT WERE BURNT ON THE BOTTOM OF THE BULB THAT YOU PUT INTO THE PORT. PORT WERE NOT BURNT JUST THE BOTTOM PART OF THE LIGHTBULB NOT THE PRONG JUST THE BOTTOM PART OF THE LIGHTBULB WAS BURNT. I ASKED FOR THEM TO DO AN ELECTRICAL DIAGNOSTIC FOR ME TO SEE WHAT WAS WRONG AND WHY MY LIGHT BULBS KEPT BURNING ON THE BOTTOM WHICH IN RESULT MADE MY HEADLIGHTS AND BREAK LIGHTS NOT WORK. (NOT ALL AT THE SAME TIME. I REPLACE ONE THEN A FEW WEEKS TO A MONTH LATER A DIFFERENT ONE WOULD THE SAME.)  BUT ALL THEY DID WAS CHARGE ME OVER $100 TO REPLACE THE LIGHTBULBS  THAT WE'RE NOT WORKING AT THE TIME SO THEY CAN HAVE IT ON FILE WHICH ONE WERE REPLACED AND HOW LONG IT TAKES FOR THEM TO BURN OUT AGAIN. MIND YOU THESE LIGHTBULBS DO NOT HAVE ANY WARRANTY AND I DID ASK FOR THEM TO DO A DIAGNOSTIC ELECTRICAL DIAGNOSTIC TO FIND OUT WHAT THE PROBLEM WAS AND THEY DID NOT DO IT THEY SAID THEY NEEDED TO SEE IF THESE ONES WOULD BURN OUT. SO BASICALLY I HAD TO PAY OVER $100 FOR SOME LIGHTBULB THAT WON'T BE REPLACED BECAUSE THERE'S NO WARRANTY ON THEM WITHIN TWO WEEKS TO A MONTH FROM NOW EVEN THOUGH I SHOWED THEM WHEN I HAD PURCHASED THE LIGHTBULBS THAT WAS ON MY CAR ALREADY THAT NEEDED TO BE REPLACED AND THE LIGHTBULB BEFORE THE LIGHTBULB AND THAT THEY ALL HAD THE SAME EXACT MARKINGS ON THEM. WHY THEY WOULD NOT DO A DIAGNOSTIC I DON'T KNOW THEY JUST PROBABLY WANT MORE MONEY.",
        "vin": "5XYKT3A63EG"
    }
]