[
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/16/2019",
        "dateOfIncident": "07/11/2019",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11232614,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "RAM",
                "productModel": "1500",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2014 RAM 1500 WITH A 3.0L ECO DIESEL. THERE WAS A FEDERAL CLASS ACTION LAWSUIT THAT WAS HANDED DOWN AND THE OUTCOME WAS AN APPROVED ENGINE MODIFICATION (AEM). THE AEM WAS A REFLASH OF THE ECM AND TCM. AFTER THE RECALL WAS PERFORMED, THE PERFORMANCE OF MY TRUCK DANGEROUSLY IMPACTED. IF I DRIVE MY TRUCK BEFORE THE ENGINE REACHES OPERATING TEMPERATURES OVER 150DEGREES, THERE IS SIGNIFICANT ACCELERATION DELAYS. IT USUALLY TAKES ME 5-10MINUTES OF DRIVING OR MORE THAN 20MINUTES OF IDLING (WARMING UP) TO GET THE ENGINE UP TO OPERATING TEMPERATURES. I CAN PUSH ON THE ACCELERATOR PETAL AND WAIT 3-5 SECONDS BEFORE THE TRUCK REACTS, THEN I GET PUSHED BACK INTO MY SEAT AND SOMETIMES SPIN THE DRIVE TIRES. THIS IS EXTREMELY DANGEROUS, ESPECIALLY WHEN I AM TURNING INTO ONCOMING TRAFFIC, OR TRYING TO OVERTAKE ANOTHER VEHICLE ON THE HIGHWAY.     ALSO, PRIOR TO THE ENGINE REACHING OPERATING TEMPERATURES, I NOW EXPERIENCE 'TURBO FLUTTER' THIS IS WHERE TOO MUCH AIR IS FORCED INTO THE INTAKE MANIFOLD AND THE AIR IS PUSHED BACK THROUGH THE TURBO. THE TRUCK ACTS AS IF THE BREAKS ARE PULSING. SIMILAR TO THE ABOVE, IT HAPPENS WHEN I AM ACCELERATING, NOT WITH THE ACCELERATOR PUSHED TO THE FLOOR, JUST NORMAL, CONSERVATIVE DRIVING.    A FEW OTHER CHANGES I HAVE FOUND AFTER THE AEM, I HAVE LOST SIGNIFICANT FUEL ECONOMY, GREATER THAN 10%, AND DIESEL EXHAUST FLUID (DEF) CONSUMPTION IS SIGNIFICANTLY HIGHER. THESE LAST 2 ITEMS DO NOT DIRECTLY EFFECT THE DRIVABILITY OF MY TRUCK BUT IF I HAD KNOW THESE THINGS WOULD HAVE HAPPENED AFTER THE RECALL, I WOULD NOT HAVE HAD THE RECALL PERFORMED.     THANK YOU,   [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1C6RR7NM7ES"
    }
]