[
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/25/2003",
        "dateOfIncident": "01/23/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003380,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "AVALANCHE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY, I NOTICED THAT THE TWO REAR INTERIOR PLASTIC PANELS THAT COVER THE METAL AND OUTER TOP SEAT BELT MOUNTS (OR PIVOT POINTS) IN THE INTERIOR REAR OF THE VEHICLE HAVE AN APPROXIMATELY  INCH SLOT WORN INTO THEM FROM THE SEATBELTS; ITS APPARENT CAUSE, THE PULLING OF THE SEATBELTS IN AN OUTWARD MOTION TO PLACE OVER THE SHOULDER OF THE PASSENGER SITTING IN THE SEAT.  I BROUGHT IT TO MY DEALER''S ATTENTION ON 01/23/03 AND WAS INFORMED THAT THERE IS NO FIX FOR THE PROBLEM AND THAT NEW PANELS WOULD ONLY WEAR OUT AGAIN DUE TO CONSTANT SEAT BELT USAGE AND THAT ONLY A RE-DESIGNED OR MODIFIED PART WOULD PERMANENTLY CORRECT THE PROBLEM.  SINCE THIS WAS BEYOND THE DEALER''S CAPABILITY, THEY RECOMMENDED THAT I CONTACT GM CUSTOMER ASSISTANCE AND NOTIFY THEM OF THE PROBLEM AND ATTEMPT TO RESOLVE THE ISSUE WITH THEM.  THIS IS CURRENTLY BEING DONE.  SINCE MY VEHICLE WAS ONE OF THE FIRST ON THE LOT, I BELIEVE THAT THIS COMPLAINT MIGHT ALSO BE ONE OF THE FIRST OF ITS TYPE.  I AM PARTICULARLY CONCERNED BECAUSE MY CHILDREN ARE PRIMARILY THE REAR SEAT PASSENGERS AND I NOW QUESTION THE SEATBELT STRENGTH, PARTICULARLY KNOWING THAT THE EDGES OF THE BELTS HAVE BEEN CONSTANTLY RUBBING AND ABRADING THE HARD PLASTIC TRIM PANELS THAT SURROUND THEM.  TO DATE, THIS VEHICLE HAS NOT BEEN IN ANY ACCIDENTS AND I AM CALLING THIS PROBLEM TO YOUR ATTENTION JUST FOR INFORMATIONAL PURPOSES AND TO INSURE A FOLLOWUP BY GM.",
        "vin": "1GKFK16R6XJ"
    }
]