[
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2019",
        "dateOfIncident": "10/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245564,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DART",
                "productYear": "2014",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR OVER 2 YEARS MY DODGE DART 2014 BOUGHT BRAND NEW OFF A CAR LOT HAS BEEN HAVING PROBLEMS WITH THE TRANSMISSION. MULTIPLE TIMES WHILE DRIVING IT WOULD SHIFT INTO 1 ST GEAR AND READLINE THE RPM TACH METER AND WOULD NOT SHIFT BACK UP TO ITS PROPER GEAR. I HAVE TO RESET THE BATTERY AFTER DISCONNECTING IT FOR 15MINS AND THEN SOMETIMES IT WILL CONTINUE TO OPERATE PROPERLY. THIS HAS BEEN GOING ON FOR OVER 2 YEARS. MY CAR HAS LESS THAN 40,000 MILES ON. DODGE IS JUST NOW DOING RECALLS FOR THIS PROBLEM WHICH IS RELATED TO THE TRASMISSION BUSHING CABLE. JUST NOW AFTER ITS BEEN HAPPENING FOR OVER 2 YEARS THEY ARE TRYING TO OFFER RECALLS. I STILL HAVE YET TO BE NOTIFIED OFFICIALLY REGARDING THIS MATTER THRU THE MAIL OR A PHONE CALL, EMAIL EVEN. I HAD TO CALL CORPORATE TO ASK. CORPORATE TOLD ME SOMETHING WOULD COME IN THE MAIL NEAR THE END OF AUGUST. ITS THE END OF AUGUST NOW AND STILL NOTHING. THEN THEY SAID TO CONTACT LOCAL DODGE DEALERSHIPS AND INQUIRE ABOUT PARTS IF THEY HAD ANY IN STOCK. THEY DIDN'T. I DON'T EVEN DRIVE THE CAR BECAUSE OF THIS ISSUE. DODGE NEEDS TO COMPENSATE ME BACK IN FULL AND BUY BACK THE CAR OR BE SUED AND SHUT DOWN AND NO LONGER ALLOWED TO MANUFACTURE THESE PIECES OF [XXX]. THIS IS INSANITY. I WILL NEVER BUY ANOTHER AMERICAN BRAND CAR EVER AGAIN. ALSO THE GAS CAP FELL OFF THE CAR AND THE ELECTRONIC MOTOR IS STRIPPED OR DEFECTIVE. EVERY TIME I PRESS THE BUTTON ON THE DRIVER SIDE OF THE DOOR TO OPEN THE GAS CAP TO REFILL IT MAKES A LOUD NOISE FOR THE ENTIRE DURATION OF HOLDING DOWN THE BUTTON. DODGE SAID THERE IS NO RECALL ON THAT. THE FRONT WINDOWS ALSO FOG UP FOR NO REASON WHEN ITS COLDER. I'M TALKING ABOUT ON THE INSIDE OF THE CAR. SHODDY CRAFTSMENSHIP AND SHOULD BE SUED. TY FOR READING THIS.  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "1C3CDFBB1ED"
    }
]