[
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/30/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11252414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250",
                "productYear": "2017",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS, OUR FORD F-250 STARTED TO VIOLENTLY SHAKE IN THE FRONT END AFTER GOING ONTO AN OVERPASS ON THE HIGHWAY.  THIS IS A VIOLENT WOBBLE OF THE FRONT END.  IT FEELS LIKE THE ENTIRE FRONT SUSPENSION IS GOING TO SELF DESTRUCT.  THIS HAPPENED ONE TIME AT A SPEED OF 65 MPH AND ANOTHER TIME AT A SPEED OF 75 MPH.  IN ORDER TO GET THE FRONT END SHAKING TO STOP, THE VEHICLE HAD TO BE SLOWED DOWN TO APPROXIMATELY 35 MPH.  DURING BOTH EPISODES, THE STEERING WHEEL WAS VIOLENTLY SHAKING AND IT FELT LIKE THE FRONT TIRES WERE WOBBLING.  THE FIRST TIME THIS HAPPENED, IT WAS SO VIOLENT THAT THE FRONT WINDSHIELD CRACKED.  THE FIRST EPISODE OCCURRED WITH APPROXIMATELY 21,000 MILES ON THE VEHICLE.  AFTER THAT EPISODE, WE TOOK THE TRUCK INTO THE FORD DEALERSHIP AND THEY REPLACED SOME PARTS IN THE FRONT SUSPENSION AND INDICATED IT WAS FIXED.  THE SECOND EPISODE OCCURRED WITH ABOUT 29,000 MILES ON THE VEHICLE.  WE AGAIN TOOK THE VEHICLE INTO THE FORD DEALERSHIP AND THEY CHANGED THE CASTER SETTING ON THE VEHICLE TO AN OUT OF SPEC CONDITION AND TOLD US THAT THE FORD REGIONAL SERVICE REP TOLD THEM THAT WOULD FIX THE PROBLEM.  AFTER GETTING THE VEHICLE BACK FROM THAT SERVICE VISIT, THERE WAS A VIBRATION IN THE STEERING AT SPEEDS BETWEEN 72 MPH AND 76 MPH.  THE STEERING WHEEL WOULD VIBRATE BACK AND FORTH AT A RELATIVELY HIGH SPEED.  THE VEHICLE IS AT THE DEALERSHIP FOR A THIRD TIME TO ADDRESS THIS NEWEST PROBLEM.  THE VEHICLE NOW HAS RIGHT AT 36,000 MILES ON IT AND IS AT THE END OF THE WARRANTY MILEAGE.  THE FIRST INSTANCE WAS APPROX OCTOBER 1, 2018 AND THE SECOND INSTANCE WAS APPROX MARCH 1, 2019.",
        "vin": "1FT7W2B68HE"
    }
]