[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2003",
        "dateOfIncident": "01/26/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003428,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "BLAZER",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BROUGHT 96 BLAZERLS WITH 82,000 IN DEC.02.  WAS TOLD THAT THE ONLY PROBLEM WAS THEY HAD TO HAVE THE TRANSMISSION REPLACED AT 20,000. WELL,83,000 MILES THE HEATER WAS ON HOT BLOWING WHEN I NOTICED THAT IT TURN COLD AND THE GAGE WENT TO THE RED ZONE. I IMMEDIATELY TURN SWICHES OFF ON THE BLOWER IT WENT BACK TO NORMAL.  TWO DAYS LATER IT HAPPEN AGAIN BUT I TURN OFF THE HEATER AND BLOWER COMPLETELY IT WENT BACK TO NORMAL.  WE THOUGHT THE TERMOSTACT GOT STUCK AND REPLACED IT .  AT THAT TIME WE NOTICE THAT IT WAS GEL UP OVER THE TERMOSTACT, AFTER REPLACING IT , WE TESTED DROVE IT AND IT STILL DID THE SAME THING AGAIN.  WE LOOKED AT THE RADIATOR AND FOUND THAT IT WAS GEL UP AND LOOK LIKE RUBBER.  WE THEN DECIDED TO CHECK THE FLUID IN THE TRANSMISSION WE NOTICED THAT THE DIPPED STICK WAS RUSTED ON THE OUTSIDE AND WAS RUSTED THE LENGTH OF THE STICK THE FLUID WAS RUSTED. WE WILL NOW HAVE TO FLUSHED THE RADIATOR AND TRANSMISSION.  I HAD CHECKED YOUR SITE AND FOUND NO RECALLS OR SERVICE BULLETINS ON THE GELING AND TRANSMISSIONS BEFORE BUYING.  TELL TODAY WHEN I DECIDED TO CHECKED OUT COMPLAINTS AND FOUND THAT THERE WAS 54 AND COUPLE WITH THE SAME PROBLEMS OF GELING AND TRANSMISSION PROBLEMS.  SO I DECIDED TO CHECK OUT 98 BECAUSE MY SISTERINLAW HAD JUST BROUGHT ONE AND NO RECALLS OR SERVICE BULLETINS BUT THEY ARE COMPALINTS OF COOL HEATING (PROBABLY FROM GELING ANITIFREEZE) AND TRANSMISSIONS BEING REPLACED ONCE ,TWICE AND I GUY 3 TIMES.  SO I CHECK 2001 AND THEY WAS SOMEONE ELSE REPLACING A TRANSMISSION.  SOMETHING IS VERY WRONG WHEN THERE IS GELING OF ANTIFREEZE FROM 96 TO 98 AND REPLACING TRANSMISSIONS LEFT AND RIGHT SINCE 96. TO ME CHEVROLET HAS A BAD TRANSMISSION PROBLEMS AND GELING PROBLEMS IN THESE BLAZERS GETTING AWAY WITH IT.  FROM NOW ON I'LL CHECK OUT COMPLAINTS BEFORE RECALLS OR SERVICE BULLETINS THERE'S THE CONSUMERS EYES AND EARS.",
        "vin": "1GNDT13W6T2"
    }
]