[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2003",
        "dateOfIncident": "01/23/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003451,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "NEW BEETLE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COIL PACK FAILURE IIN VW NEW BEETLE WITH 1.8T ENGINE -- LAST WEEK, I HAD MY 2ND COIL PACK FAILURE (THE FIRST BEING IN NOVEMBER 2002) WHILE COMMUTING TO WORK ON THE GEORGE WASHINGTON PARKWAY AT ABOUT 45 MPH.  THE CAR SUDDENLY BEGAN TO SHAKE VIOLENTLY, AND I NARROWLY AVERTED AN ACCIDENT WHEN I HAD TO SLOW DOWN TO 30.  FORTUNATELY, I WAS ABLE TO EXIT SAFELY, AND I FOLLOWED SURFACE STREETS TO THE DEALER, WITH THE CAR SHUDDERING WHENEVER MY RPM EXCEEDED 2,500.  THE DEALER (ALEXANDRIA VW) REPLACED THE COIL PACK THE SAME DAY, BUT, AFTER CHECKING WITH VW OF AMERICA AT MY INSISTENCE, THEY REFUSED TO REPLACE THE REMAINING TWO DEFECTIVE COIL PACKS DESPITE THEIR ADMISSION THAT THE OTHER TWO WOULD ALMOST CERTAINLY FAIL IN THE FUTURE.  I CALLED VW'S COMPLAINT LINE THE NEXT DAY AND WAS TOLD THAT VW COULDN'T ISSUE A RECALL BECAUSE OF INSUFFICIENT SUPPLY OF THE REPLACEMENT PARTS.  VW DOESN'T, APPARENTLY, CONSIDER THIS A SAFETY ISSUE -- PLEASE SEE THE COMMENTS ATTRIBUTED TO VW'S REPRESENTATIVE IN THIS BOSTON GLOBE STORY FROM YESTERDAY: HTTP://WWW.BOSTON.COM/DAILYGLOBE2/026/AUTO/NO_EASY_FIX_FOR_FAILING_IGNITION_COILS_IN_AUDIS_VWS+.SHTML  I WOULD SUBMIT (1) THAT, BASED ON MY PERSONAL EXPERIENCE, THE COIL PACK PROBLEM IS A SERIOUS SAFETY ISSUE AND THAT VW SHOULD BE REQUIRED TO REPLACE ALL DEFECTIVE PARTS WHETHER OR NOT THEY HAVE ALREADY FAILED AND (2) THAT THIS IS AN EPIDEMIC ISSUE, INVOLVING POTENTIALLY 500,000 AUTOMOBILES, WHICH VW CANNOT BE ALLOWED TO CONTINUE TO SWEEP UNDER THE TABLE.  PLEASE INVESTIGATE AND FORCE VW TO AMEND ITS IRRESPONSIBLE BEHAVIOR AND TO ISSUE A RECALL.",
        "vin": "3VWED21CX1M"
    }
]