[
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/27/2003",
        "dateOfIncident": "10/22/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003470,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND PRIX",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 PONTIAC GRANT PRIX GT BOUGHT IN AUGUST 2000, PROBLEMS INCLUDE:  1) 22-JULY-2002, (36,040 MILES), TIE ROD WORN BADLY, HAD EXCESSIVE CLEARANCE AND NEEDED TO BE REPLACED.    2) 30-SEPTEMBER-02, (38,697 MILES), SERPENTINE BELT (I UNDERSTAND GENERAL MAINTENANCE FOR THIS PARTICULAR PROBLEM).    3)  21-OCT-2002, (39,181 MILES), REPLACED INTAKE MANIFOLD.    IN THE 3 INCIDENTS ABOVE, I UNDERSTAND CHANGING A SERPENTINE BELT WHEN NEEDED, BUT FOR MY TIE ROD TO BE WORN AND REPLACED WITHIN 2 YRS OF OWNING THIS VEHICLE IS NOT A NORMAL MAINTENANCE ITEM FOR A PRACTICALLY BRAND NEW CAR. THE INTAKE MANIFOLD BEING REPLACED AROUND THE SAME TIME IS JUST UNHEARD OF. THE INTAKE MANIFOLD'S FROM WHAT I UNDERSTAND FROM THE GM DEALER ARE MADE OF PLASTIC, WHICH THEN I WAS TOLD THAT PLASTIC IS A BETTER \"HEAT SINK\" THAN METAL IS! I AM AN ENGINEER AND WORK WITH METALS AND PLASTICS ALL THE TIME AND KNOW FOR SURE THAT METAL IS A MUCH BETTER HEAT SINK THAN PLASTIC IS. PLASTIC MELTS WITH HEAT! MY CAR REPEATABLY STALLS AT RED LIGHTS, STOP SIGNS, TURNING CORNERS, AND SOMETIMES JUST STALLS WHEN I'M DRIVING DOWN THE ROAD.  I REALLY SHOULDN'T HAVE TO KEEP BRINGING MY CAR FOR REPAIRS, IT'S PRACTIALLY BRAND NEW AND I PAY NEARLY $400/MONTH TO HAVE THESE ON GOING PROBLEMS! CURRENTLY MY DRIVER SIDE REAR BRAKE CALIPER IS BENT AND WAS TOLD THAT IT'S GOING TO COST ME $500 TO REPLACE 2 CALIPERS (BECAUSE I GUESS ONE JUST CAN'T BE REPLACED WITHOUT REPLACING THE OTHER BACK ONE) . I TAKE GOOD CARE OF MY CAR, WITH REGULAR CLEANINGS, OIL CHANGES AND GENERAL MAINTENANCE. I'M WEARY OF TAKING MY CAR ON EXTENDED TRIPS OUT OF TOWN FOR THE FEAR THAT IT'S GOING TO LEAVE ME STRANDED. IF THERE IS ANY WAY, I COULD GET A RESPONSE FROM YOU ASAP, IT WOULD BE VERY MUCH APPRECIATED. THANKS VERY MUCH FOR  YOUR TIME AND CONSIDERATION.    SINCERELY,    ROBERT SWEENEY",
        "vin": "1G2WP12K4YF"
    }
]