[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES, AIR,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/28/2003",
        "dateOfIncident": "12/01/2002",
        "fire": false,
        "manufacturer": "Isuzu Technical Center of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003542,
        "products": [
            {
                "manufacturer": "Isuzu Technical Center of America, Inc.",
                "productMake": "ISUZU",
                "productModel": "N SERIES",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Brake Parts Inc.",
                "productMake": "BRAKE PARTS",
                "productModel": "DISC BRAKE ROTOR",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A 2000 ISUZU PICK-UP HOMBRE AND I WAS HAVING PROBLEMS WITH THE FRONT DISC BRAKES THAT DID NOT WORK PROPERLY.  IT SEEMED THAT EVERYTIME I PRESSED ON THE BRAKES, I HAD A HARD PUSH THEN SHORTLY AFTWARDS, THE BRAKES GAVE STOPPED THE VEHICLE.  THIS FELT LIKE THE ABS WAS KICKING IN.    AFTER TAKING THE VEHICLE TO AN ISUZU DEALER, THEY SAID THE BRAKES ARE A \"WEAR\" ITEM AND NOT COVERED BY THE WARRANTY.  I KNOW A LITTLE ABOUT BRAKES AND TRUCKS AND CHANGED MANY DISC'S, SO I LOOKED TO SEE IF I COULD FIND WHAT WAS CAUSING THE PROBLEM.    TO MY SURPRISE, THE DISC'S (ALL FOUR) WERE LARGER THAN THE ROTOR AND ALTHOUGH I HAVE OVER 30,000 MILES ON THE VEHICLE, I FOUND THAT BEING OVERSIZED, THE TOP OF EACH BRAKE PAD LAPPED OVER THE ROTOR APPROXIMATELY 1/8 TO 1/4 INCH.  THIS WEAR PATTERN CAUSED THE TOP OF EACH DISC TO OVERLAP THE TOP OF EACH ROTOR AND THIS TOP WAS ENGAGING PRIOR TO THE DISC MAKING CONTACT WITH THE ROTOR, WHICH LEAD TO THE DELAY OF ENGAGEMENT OF THE FULL DISC ON THE ROTOR.  THIS ALSO MADE THE HARD CONTACT THEN ENGAGEMENT OF THE REST OF EACH DISC WHICH FELT LIKE THE ABS ACTIVATING.  THE AMOUNT OF WEAR TO THE NON-WEAR ON THE TOP OF THE BREAK WAS APPROXIMATELY 1/4 INCH.  I FILED OFF THE TOP OF EACH DISC TO GIVE A CLEAN SURFACE AND ROTOR CONTACT AND THE PROBLEM WENT AWAY.  NOW THE ABS COMES ON INTERMITENTLY.    THIS OVERHANG ON THE ROTOR TOP DUE TO THE OVERSIZE OF THE DISC'S IS A STRANGE SENSATION WHICH COULD GIVE A FALSE SENCE OF SECURITY, ESPECIALLY IF A SUDDEN STOP OCCURRED.  IT ALSO GIVES A LOSS OF CONTROL ALONG WITH THE FALSE SENCE OF SECURITY.    I BELIEVE THIS SHOULD BE INVESTIGATED AND IT SURELY IS A SUBSTANTIAL HAZARD FOR THE CONSUMER.  I CONTACTED ISUZU, BUT THEY BLEW IT OFF AS A \"FREEK OCCURANCE\".  SOUNDS FAMILIAR AS A CPSC INVESTIGAOR WHO HAS RECALLED A LOT OF PRODUCTS THAT THE MANUFACTURER ATTRIBUTE TO A FREEK OCCURRANCE.      THIS IS A POSSIBLE LIFE THREATING DEFECT.    SINCERELY",
        "vin": "1GGCS1443Y8"
    }
]