[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2003",
        "dateOfIncident": "12/30/2002",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003551,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY THREE DAYS AFTER HAVING PURCHASED A NEW 2003 ACCORD, I NOTICED THAT THE CONSOLE WAS OVERHEATING.  WHEN I PUT MY FINGERS UNDER THE CONSOLE, IT WAS SO HOT THAT IT COULD BLISTER SKIN.  THERE WAS ALSO A HORRIBLE INTERMITTENT BURNING SMELL.  AFTER THE CAR MAKES THIS TERRIBLE BURNING SMELL, I GET A HEADACHE.  THIS BURNING SMELL IS AN INDICATION OF AN EXTREMELY DANGEROUS PROBLEM, THAT COULD CAUSE THE VEHICLE TO CATCH ON FIRE.  UPON MY SECOND VISIT, THE DEALERSHIP ACKNOWLEDGED THE PROBLEM AND REPLACED THE CONSOLE.  ON THE WAY HOME, THE NEW CONSOLE OVERHEATED AGAIN.  ALSO, THE HORRIBLE INTERMITTENT BURNING SMELL IS STILL PRESENT.  HONDA AMERICA HAS REFUSED TO REPLACE MY VEHICLE OR GIVE ME A REFUND.  THE SALES MANAGER AT THE DEALERSHIP, HENDRICK'S HONDA CARS OF HICKORY, HAS GIVEN ME MISINFORMATION ABOUT MY STATE'S LEMON LAW BY TELLING ME THEY ARE ENTITLED TO 10 REPAIR ATTEMPTS WHEN THE NC LEMON LAW SAYS THEY ARE ONLY ENTITLED TO 4.  THE DEALERSHIP NOW SAYS THAT THEY ARE TRYING TO REDUPLICATE THE PROBLEM.  FURTHER, EVEN THOUGH THREE PEOPLE AT THE DEALERSHIP, INCLUDING A MECHANIC, HAVE WITNESSED THE OVERHEATING AND BURNING SMELL, THE \"MASTER MECHANIC\" HAS TOLD ME THAT IF SOMETHING WAS BURNING OR OVERHEATING THAT I WOULD HAVE EQUIPMENT FAILURE.  THIS IS NOT TRUE AND ANY GOOD MECHANIC SHOULD KNOW THIS.  IT APPEARS TO ME THAT THEY ARE TRYING TO DENY THAT THE PROBLEM STILL EXISTS.  THE COMPANY CLAIMS THAT NO ONE ELSE HAS REPORTED THIS PROBLEM.",
        "vin": "1HGCM563X3A"
    }
]