[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/25/2002",
        "dateOfIncident": "12/24/2002",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000360,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNED MY TRIBUTE FOR A YEAR BEFORE THE PROBLEMS BEGAN.  ON 3/15/02 I TOOK IT IN BECAUSE THE LOW COOLANT LIGHT KEPT COMING ON.  THE DEALERSHIP COULDN'T FIND A PROBLEM, BUT I HAD THEM DO A 30K MILE SERVICE AND CHECK EVERYTHING FROM FRONT TO BACK.  HAD A RENTAL FOR TWO DAYS.  ON 6/10/02 I TOOK IT IN BECAUSE IT SUDDENLY STARTED STALLING DEAD AT STOPS AND YIELDS.  I ALMOST WRECKED DUE TO THIS.  CAUSE: INTERNAL FAILURE.  THE DEALERSHIP REPLACED THE CONTROL UNIT, IDLE AIR VALVE, COOLANT FAN RELAY.  I HAD A RENTAL FOR THREE DAYS.  ON 8/5/02 IT HAD TO BE TOWED BECAUSE THE IGNITION SWITCH COMPLETELY LOCKED UP AND WOULDN'T TURN.  DEALERSHIP PUT IN A NEW IGNITION SWITCH AND CYLINDER.  MY KEYS HAD TO BE REPROGRAMMED.  I HAD A RENTAL FOR TWO DAYS.  ON 11/13/02 I TOOK IT IN BECAUSE THE CHECK ENGINE LIGHT KEPT COMING ON AND THE ENGINE DID NOT IDLE SMOOTHLY.  THE DEALERSHIP COULD NOT DUPLICATE THE PROBLEM AND I USED THEIR RENTAL FOR THREE DAYS.  ON 12/24/02 THE ENGINE LIGHT CAME BACK, THE ENGINE IDLED ROUGH AND THE ENTIRE VEHICLE WAS VISIBLY SHAKING.  THE DEALERSHIP TOLD ME THAT ONE OF THE SIX COILS WAS BAD AND NEEDS TO BE REPLACED OR ONE WRONG SPARK COULD RUIN THE WHOLE ENGINE.   LOOKS LIKE I HAVE THE RENTAL FOR AT LEAST A WEEK.  IT JUST WENT OVER 50K MILES, SO MY BASIC WARRANTY IS UP, HOWEVER THE EMISIONS CONROL SYSTEM (ENGINE) IS WARRANTED UNTIL 80K MILES.  IT SEEMS A SHAME THAT MAZDA WOULD PUT OUT SUCH POOR QUALITY AND PROBLEMATIC VEHICLES TO THEIR LOYAL CUSTOMERS.  MAYBE THEY SHOULD ADD THAT TO THEIR \"ZOOM, ZOOM\" COMMERCIALS.",
        "vin": "4F2YU09161K"
    }
]