[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/27/2002",
        "dateOfIncident": "12/16/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "MALIBU",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2001 CHEVROLET MALIBU IN APRIL 2001 VIN [XXX] AND HAVE HAD THE FOLLOWING WORK/PROBLEMS WITH THE BRAKE SYSTEM REPAIRED AT CAPITAL CHEVROLET WHERE I PURCHASED THE VEHICLE.      DATEPROBLEM/REPAIRSMILEAGE  NOV 2001ABS WARNING LIGHT ON, BRAKE PADS, ROTORS 7,754  JAN 2002FRONT SUSPENSION9,080  MAR 2002FRONT SUSPENSION12,000  MAY 2002BRAKE PADS & ROTORS14,555  JULY 2002ABS WARNING LIGHT ON17,170  OCT 2002BRAKE PADS & HUB21,055  NOV 2002ABS WARNING LIGHT ON, ROTOR, HUB KIT22,005  OCT 2002ROTORS21,310  DEC 2002CALIPER & BRAKE PADS24,066    FROM THE INFORMATION ABOVE, I CAN GENERALLY GET ABOUT 7,000 MILES ON THE BRAKE PADS.  I HAVE CONTACTED GENERAL MOTORS CUSTOMER SERVICE DEPARTMENT (REQUEST # [XXX]) AND WAS ABLE TO GET AN EXTENDED WARRANTY ON THE VEHICLE IN JUNE 2002 AFTER SEVERAL COMPLAINTS, HOWEVER THE BRAKES HAVE NEEDED REPAIR SEVERAL TIMES SINCE MY ORIGINAL CONCERNS.   I AM CONCERNED ABOUT WHAT HAPPENS IF THERE IS A CATASTROPHIC BRAKE FAILURE?  MY RECENT CONVERSATIONS WITH GM CUSTOMER SERVICE DEPARTMENT HAVE BEEN LESS THAN CORDIAL.  I HAVE CONSIDERED TRADING IN THE MALIBU AND PURCHASING ANOTHER VEHICLE, BUT THE TRADE IN VALUE OFFERED FOR THE MALIBU IS NOT ACCEPTABLE.     MY QUESTION IS: WHAT KIND OF ASSISTANCE DOES YOUR OFFICE OF DEFECTS INVESTIGATION OFFER?   I FIRMLY BELIEVE THERE IS A SERIOUS SAFETY ISSUE WITH THE BRAKE SYSTEM ON MY VEHICLE AND GENERAL MOTORS BEARS THE RESPONSIBILITY FOR CORRECTING THE DEFECT OR REPLACING THE VEHICLE.    THANK YOU. TS      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1G1NE52J516"
    }
]