[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/29/2002",
        "dateOfIncident": "08/29/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10000415,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "PASSAT",
                "productYear": "1993",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING FROM CT TO WASH, D.C., I WAS PARKING MY 1993 VW PASSAT.  I HEARD A \"POP\" SOUND, AND IN < 5 SECONDS, THE CAR FILLED WITH ANTIFREEZE STEAM & SCALDING ANTIFREEZE POURED INTO THE DRIVER SIDE COMPARTMENT.  AS THE CAR WAS NEARLY PARKED, WE WERE ABLE TO JUMP OUT OF THE CAR.  I TOOK MY CAR TO THE WHEATON SERVICE CENTER IN WHEATON, MD.  VIA PHONE, THE MECHANICS IMMEDIATELY SUSPECTED THE HEATER CORE.  IRONICALLY, THERE WAS ANOTHER 1993 PASSAT GETTING FIXED FOR THE SAME PROBLEM WHEN I GOT THERE.  ONCE INVESTIGATED, MY HEATER CORE HAD CRACKED.    THEY NOTED THAT THIS WAS A RECURRING PROBLEM IN VWS.  I CALLED THE VW CONSUMER CARE LINE.  AFTER LENGTHY NEGOTIATION, VW AGREED TO REIMBURSE ME FOR THE $788 REPAIR, IF I BROUGHT THE BROKEN PART AND THE NEW PART'S PACKAGING TO THE CAR'S HOME DEALERSHIP, RIVERSIDE MOTORS, IN CT.  I WAS REIMBURSED SEVERAL MONTHS LATER, AFTER WEEKLY FOLLOW UP PHONE CALLS TO \"REMIND\" VW OF THEIR REIMBURSEMENT COMMITTMENT.  I AM UPSET AND CONCERNED ABOUT THIS MATTER FOR SEVERAL REASONS:  1) I BOUGHT THE CAR USED IN 1998.  THE ONLY ISSUE WITH THE CAR WAS THAT THE WINDOWS TENDED TO \"FOG UP\", PARTICULARLY WHEN THE A/C OR HEAT WAS ON, WHICH HAD BEEN LOGGED AT SERVICE VISITS.  AT NO TIME WAS THE HEATER CORE LOOKED AT.  BUT, THERE ARE NUMEROUS HEATER CORE AND \"DEFOGGING\" CONSUMER COMPLAINTS.  FURTHER, I BEGAN THE REVIEW OF COMPLAINTS AFTER LISTENING TO A RECENT NPR CAR TALK SHOW, B/C THEY REFERENCED THE PROBLEM WITH VW HEATER CORES.  WHAT IS CONSPICUOUSLY MISSING IS A SAFTEY BULLETIN FOR THIS KNOWN PROBLEM.  2) AS MANY OF THE COMPLAINTS NOTED, (SEE OID ID 755858 FOR EXAMPLE), THEY COULD HAVE BEEN KILLED OR SERIOUSLY INJURED, AS WAS THE CASE FOR ME.  30 MINUTES EARLIER & I WOULD HAVE BEEN DRIVING 65MPH ON THE HIGHWAY. WHILE I UNDERSTAND THAT EVERY COMPLAINT CANNONT BE INVESTIGATED, THIS IS A FAILURE THAT CAN RESULT IN A LIFE-OR-DEATH SITUATION.  I EXPECT THAT YOU WILL INVESTIGATE THIS PROBLEM FURTHER, AND AT MINIMUM ISSUE A SAFETY BULLETIN.",
        "vin": "WVWJD4312PE"
    }
]