[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/29/2002",
        "dateOfIncident": "12/28/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000416,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TUNDRA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ROTATING THE TIRES AND TIGHTENING THE LUG NUTS WHEN SIX  BROKE.        MY TORQUE WRENCH WAS SET AT 80 POUNDS, BELOW THE 82 RECOMMENDATION.   TWO LUG NUTS ON THE RIGHT REAR ON ONE ON THE RIGHT FRONT WOULD NOT TIGHTEN AND JUST KEPT TURNING.  EVENTUALLY EACH OF THE LUG NUTS FELL OFF, BREAKING THE STUD.  THE STUDS DID NOT \"SNAP\" LIKE A CLEAN BREAK.  THE LUGS THAT BROKE WERE POSSIBLY NOT HARDENED OR WERE MADE FROM SOME VERY SOFT METAL.    THE LEFT SIDE PRODUCED SIMILAR RESULTS ON THE LEFT REAR.  THE LEFT FRONT SECURED ALL SIX LUG NUTS PROPERLY WITH THE 80 # TORQUE SETTING.  ON THE LEFT REAR, THREE OF THE STUDS, ALL ADJACENT TO ONE ANOTHER BROKE JUST LIKE THE THREE DID ON THE RIGHT SIDE.      I HAVE BEEN CHANGING TIRES FOR 35 YEARS AND HAVE ONLY BROKEN ONE STUD PREVIOUSLY.   EIGHTY FOOT POUNDS OF TORQUE IS NOT VERY MUCH TO BREAK OFF A STUD.  CHEVROLET CURRENTLY SETS LUG NUTS AT 145 FOOT POUNDS OF TORQUE.      I FEEL SOMETHING IS WRONG WITH THE LUG STUDS ON THIS VEHICLE, OR AT LEAST THE SIX THAT MERELY BROKE.  THIRTY OF THE LUG STUDS HELD AND TIGHTENED ACCORDING TO PROCEDURES.  HOWEVER, THE SIX THAT BROKE DID SO BEFORE EVER CAUSING THE TORQUE WRENCH TO REACH A MERE 80 FOOT POUNDS, WHICH WAS ACTUALLY TWO POUNDS UNDER THE RECOMMENDED SETTING. IN LOOKING AT THE STEEL STUD WHERE IT TWISTED APART, THE METAL HAS THE APPEARANCE OF CAST POT METAL, NOT COLD HARD STEEL.        SO FAR, I HAVE RECEIVED NO HELP FROM THE TOYOTA DEALER.  THEY SAY, \"YOU CAUSED THEM TO BREAK, IT IS NOT OUR FAULT.  WE CHANGE TIRES ALL DAY WITH OUR AIR IMPACT WRENCHES AND WE ARE NOT BREAKING THEM.\"  A \"DIGITORQUE\" TORQUE WRENCH IS MUCH MORE ACCURATE THAN AN IMPACT WRENCH.  THAT IS WHY I OWN ONE BECAUSE I REALIZE THE IMPORTANCE OF SETTING NUTS AND LUGS AT THE RIGHT SETTING.  FOR THESE REASONS, I FEEL THAT SOME LUG NUT STUDS THAT MAY HAVE NOT BEEN HARDENED, ETC., WERE INSTALLED ON MY VEHICLE SINCE THEY BROKE OFF UNDER VERY LITTLE PRESSURE.",
        "vin": "5TBBT441X2S"
    }
]