[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/29/2003",
        "dateOfIncident": "01/24/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004880,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS LIGHT CAME ON 1/24/03 AND STAYED ON. TOOK TO DEALER, MANCHESTER HONDA, ON 1/28/03 FOR SERVICE AND WAS TOLD SRS UNIT FAILURE CODE 7-2. I HAVE A 1997 HONDA CIVI WITH 71,464 MILES ON IT. THE PART THAT NEEDS REPLACEMENT IS #77960-S04-N81. THE PART COSTS $368.70 AND THE INSTALLATION CHARGE QUOTED FOR ME WAS $72.00. IT COST ME 85.86 TO HAVE THE PROBLEM DIAGOSED. THE SERVICE REPAIR MAN INSISTED THIS WAS NOT A DEFECTIVE PART, I WOULD HAVE TO PAY FOR REPAIRS. I'VE RESEARCHED YOUR WEB SITE AND FOUND NUMBEROUS BULLETINS DETAILING FAILURE OF THE SRS SYSTEM WITH THE 1997 HONDA CIVIC. I ALSO FOUND RECENT SIMILAR COMPLAINTS REGARDING THE SRS SYSTEM FOR 2003 HONDA CIVICS AND 2002 HONDA ACCORDS. CLEARLY THIS IS A SAFETY DEFECT THAT HONDA AND NHTSA HAS KNOWN ABOUT FOR SOME TIME AND THERE HAS YET TO BE A RECALL. THIS POSES A THREAT TO MY PERSONAL SAFETY. I WAS EXPLICITY TOLD THAT UNTIL I HAVE THIS REPAIR DONE, THE CONTROL SYSTEM FOR THE SRS WOULD NOT DEPLOY THE AIRBAGS IN MY CAR SHOULD I GET INTO AN ACCIDENT. I AM FORCED TO MAKE AN EXPENSIVE REPAIR TO A DEFECTIVE HONDA COMPONENT THAT THE DEALER SHOULD BE PAYING FOR AND CORRECTING. AND YET THEY ARE OBVIOUSLY IGNORING THE PROBLEM AND SELLING 2003 MODELS THAT OBVIOUSLY HAVE THE SAME DEFECTIVE COMPONENTS. HONDA NEEDS TO BE ORDERED TO BEGIN A RECALL IMMEDIATELY, SINCE THEY OBVIOUSLY ARE NOT INTERESTED IN FIXING THE PROBLEM VOLUNTARILY.",
        "vin": "JHMEJ6524VS"
    }
]