[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2003",
        "dateOfIncident": "09/11/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004932,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN THE MIDDLE OF AN INTERSECTION WHEN MY CAR BEGAN TO IDLE IRREGULARLY.  I MANAGED TO GET TO THE SIDE OF THE ROAD.  I WAS TOWED TO AN AUDI DEALERSHIP.  THREE DAYS LATER MY CAR WAS REPAIRED.  ALL THAT I WAS TOLD WAS THAT MY #2 COIL PACK FAILED.  I WAS NOT GIVEN ANY INFORMATION THAT THE OTHER 3 WOULD MOST LIKELT FAIL ALSO.  UPON DOING RESEARCH ON MESSAGE BOARDS I REALIZED THAT THIS WAS AN ENORMOUS PROBLEM.  I CALLED AUDI CLIENT RELATIONS AND TOLD THEM THAT I FELT LIKE I WAS DRIVING A TICKING TIME BOMB AS I COULD NEVER BE SURE WHEN THE OTHER COIL PACKS WERE GOING TO FAIL.  THE WOMAN THAT I SPOKE WITH TOLD ME TO TAKE THE CAR BACK TO THE AUDI DEALERSHIP AND \"DEMAND THAT THE OTHER 3 BE REPLACED.\"  WHEN I TOOK MY CAR BACK TO ANOTHER DEALERSHIP BECAUSE OF THE TERRIBLE SERVICE I RECEIVED AT THE 1ST DEALER,  THEY LAUGHED IN MY FACE.  THEY TOLD ME THAT THEY WERE AT A \"CRISIS STATE\" WITH THE COIL PACKS, THAT THEY DID NOT HAVE ANY TO SWITCH OUT FOR ME, AND THAT I WOULD JUST HAVE TO WAIT FOR MY CAR TO DIE WHILE IN OPERATION.  AND WHEN THAT HAPPENED, THAT THEY COULD ONLY REPLACE THE COIL PACK THAT FAILED!  IF THIS ISN'T GROSS NEGLIGENCE I DO NOT KNOW WHAT IS!  ADDITIONALLY, I HAVE HAD  A CAM TENSIONER REPLACED, THE ELECTRONIC SENSOR REPLACED, AND NOW IT APPEARS THAT MY STEERING RACK IS GOING BAD.  I HAVE 38K MILES WITH ONLY 12K LEFT ON MY WARRANTY.  I CANNOT BELIEVE THE TERRIBLE RELIABILITY OF THIS CAR ON TOP OF AUDI'S RELUCTANCE TO ISSUE A RECALL CAMPAIGN ON THE COIL PACKS.  UNFORTUNATELY,  IT IS PROBABLY GOING TO TAKE A PERSON DYING BEFORE ANYONE ADDRESSES THIS VERY SERIOUS ISSUE.",
        "vin": "WAUKC68D41A"
    }
]