[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/30/2003",
        "dateOfIncident": "07/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004956,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "MERCURY",
                "productModel": "TRACER",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN HAVING ENGINE TROUBLE LAST JULY.  WHJEN I TURNED THE INGNITION THE ENGINE BEGAN TO BUCKLE AND MAKE A LOUD NOISE.  I WOULD HAVE TO ATTEMPT STARTING IT A FEW TIMES TO GET A CLEAN START.  THEN THE ENGINE WOULD MAKE A TAPPING NOISE AND THE ENGINE LIGHT WOULD COME ON. I TOOK IT TO THE DEALER - THEY SAID IT WAS A DIRTY CYLINDER AND THAT IT NEEDED TO BE CLEANED.  THEY CLEANED IT BUT A FEW MONTHS LATER THE SAME STRING OF EVENTS OCCURRED -- BUT THE ENGINE LIGHT WENT OFF BEFORE I COULD GET IT TO THE DEALER.  THE DEALER TOOK THE CAR ANYWAY -- THEY KEPT IT FOR ALMOST 3 WEEKS AND THE CAR WOULD NOT \"ACT UP\" FOR THEM.  THEY RE-SEALED SOME WIRES AND GAVE IT BACK TO ME BECAUSE THEY COULDN'T FIND ANYTHING WRONG WITH THE ENGINE.  WELL, NEEDLESS TO SAY THE CAR KEPT HAVING TROUBLE STARTING AND THE ENGINE LIGHT KEPT COMING ON AND AND GOING OFF BY ITSELF.  I BECAME FED UP -- SO I TOOK IT TO PRECISION TUNE INSTEAD OF THE DEALER.  THEY TOLD ME THE WIRES THAT WERE SEALED ACTUALLY NEEDED TO BE REPLACED AND THAT'S WHAT THE PROBLEM WAS.  I PAID THEM $318 TO DO IT.  I PICKED UP MY CAR -- AND DROVE TO WORK -- AND WHAT DO YOU KNOW -- THE ENGINE LIGHT CAME BACK ON AGAIN AND I HAD TROUBLE STARTING IT.  I TOOK IT BACK TO THE SHOP -- I TURNED THE CAR OFF AND TURNED IT BACK ON FOR THE MECHANIC AND THE CAR MADE A HIDIOUS SOUND AND DIED RIGHT THERE IN FRONT OF US.  APPARENTLY ONE OF THE  CYLINDERS STOPPED WORKING AND SOMETHING WAS LOOSE IN THE ENGINE IS WHAT I WAS TOLD.  NOW I HAVE ANOTHER CAR -- IT WASN'T WORTH FIXING.  I ALSO HAD A COOLANT ISSUE WITH THE CAR -- I HAD TO REPLACE THE RADIATOR.  THAT WASN'T FUN EITHER.",
        "vin": ""
    }
]