[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/31/2003",
        "dateOfIncident": "01/27/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAVALIER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN LOOSE/TENSIONER WEARING OUT.  FIRST HAPPENED AROUND 60,000 MILES, AT THIS TIME THE CHAIN, TENSIONER, AND GEARS WERE CHANGED.  WORKED FINE FOR A WEEK AND A HALF, THEN SLOWLY STARTED TO RATTLE AGAIN UNTIL THE NOISE WAS WORSE THAN BEFORE IT WAS FIXED.  BROUGHT TO CHEVY DEALERSHIP, CAR STAYED THERE FOR 5 DAYS, SAID THEY COULDN'T FIND ANYTHING WRONG, CHARGED ME $250 FOR DIAGNOSTIC LABOR AND TOLD ME IT WAS A NORMAL NOISE.  THEN I CALLED GM CUSTOMER SERVICE, THE WOMAN I SPOKE TO WAS ALL READY TO HELP ME OUT UNTIL SHE SPOKE WITH THE DEALERSHIP THEN CAME BACK ON THE LINE WITH ME AND JUST AGREED WITH WHAT THEY SAID ABOUT IT BEING A \"NORMAL\" NOISE.  THEN BROUGHT IT TO ANOTHER CHEVY DEALERSHIP, SERVICE MANAGER LISTENED AND SAID IT WAS DEFINITELY NOT A NORMAL NOISE, AGREED IT WAS COMING FROM THE TIMING COVER AREA, CALLED BACK CUSTOMER SERVICE, SAID I'D HAVE TO PAY FOR ANOTHER DIAGNOSIS BEFORE THEY COULD EVEN TELL ME IF THEY WOULD ASSIST ME IN GETTING IT FIXED.  I'M FINISHED WITH IT, I'VE SPENT OVER $1000 ON THIS CAR IN THE LAST 2 MONTHS AND IT'S STILL NOT FIXED, PLUS I'M OUT $250 FOR A DEALERSHIP TELLING ME THERE'S NOTHING WRONG.  THIS DEALERSHIP WAS NOT THE ONE I PURCHASED THE CAR FROM.....THE ORIGINAL DEALER MESSED UP MY ROTORS AT 10,000 MILES AND WERE VERY RUDE ABOUT IT SO I VOWED NEVER TO GO THERE AGAIN.....NOW I'VE BEEN BURNED BY TWO DEALERSHIPS...",
        "vin": "1G1JC1249Y7"
    }
]