[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/31/2003",
        "dateOfIncident": "01/02/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005032,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 1995 FORD WINDSTAR VA N THAT HAD A RECALL FOR BAD HEADS & HEAD GASKETS. IN 2001 THE ENGINE BLEW UP,AND FORD SAID THEY WOULD FIX IT FOR FREE. AFTER NEARLY THREE TO FOUR WEEKS THEY GAVE THE VAN BACK WITH A NEW SHORT BLOCK AND SAID IT WAS FIXED. IT RAN ALRIGHT FOR ABOUT 1 YEAR, THEN IT STARTED NOT PEFORMING LIKE IT SHOULD.I CHANGED THE SPARK PLUGS AND THAT SEEMED TO WORK. THEN IT GOT COLD THIS WINTER, AND MY WIFE  SAID SHE HAD NO HEAT. I ADDED RADIATOR FLUID AND IT HEATED UP. THREE DAYS LATER , SHE SAID SHE HAD NA HEAT AGAIN! I LOOKED UP RECALLS AND NOTICED HOW MANY PROBLEMS FORD HAS HAD WITH THIS MODEL YEARS HEAD GASKETS! I CALLED FORDS 800 NUMBER AND WAS TOLD YOU HAVE NO WARRANTY LEFT ON YOUR VAN! THEY TOLD US IT EXPIRED AFTER 1 YEAR! I AM A RETIRED ON DISABILTY,AND CANNOT AFFORD THOUSANDS OF DOLLARS IN MAJOR REPAIRS. WHAT MAKES IT WORSE IS THAT FORD KNEW ABOUT THE PROBLEMS THEY HAD WITH THE HEAD GASKETS IN THIS MODEL YEAR.I FEEL TOTALY RIPPED OFF ,BECAUSE AN ENGINE SHOULD LAST LONGER THAN JUST UNDER TWO YEARS! I HAVE ALREADY PUT MORE THAN A THOUSAND DOLLARS INTO TRANSMISSION REPAIRS INTO THIS VEHICLE! FORD SHOULD MAKE GOOD ON A PROBLEM THEY KNEW ABOUT,BUT DID NOT RECTIFY,BUT RATHER JUST REPAIRED THE DAMAGED PARTS,AND SENT ME ON MY WAY! THE SAME PROBLEM HAPPENED AGAIN, BUT NOW FORD REFUSES TO FIX IT!I AM WITHOUT A CAR NOW BECAUSE OF THIS.",
        "vin": "2FMDA5147SB"
    }
]