[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/31/2003",
        "dateOfIncident": "01/31/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005041,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "CONCORDE",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/11/96 I PURCHASED A NEW CHRYSLER CONCORDE FROM A LOCAL AUTHORIZED DEALER HERE IN MONTGOMERY, AL. (VIN [XXX]) ON JAN 2001, I REPORTED TO THE CHRYSLER DEALER ABOUT THE FRONT END SUSPENSION WAS POPPING AND CRACKING WHEN YOU TURNED THE STEERING WHEEL.  THE DEALER CLAIMED IT WAS TIE ROD BUSHINGS AND LOWER ARM. I ALSO TOLD THEM THAT THE STEERING WHEEL WAS NOT STRAIGHT ANYMORE WHEN DRIVING ON A STRAIGHT ROAD.  THE DEALERSHIP MADE THE REPAIRS. (SOMEWHAT BETTER @$577.00 / MILEAGE WAS 36430)   ON 31 JAN 03, I TOOK THIS VEHICLE TO THE AUTOMOTIVE SERVICE CENTER, HERE IN MONTGOMERY, AL. (MILEAGE IS 51758) FOR A FRONT END ALIGNMENT AND TIRE BALANCE.  (THE CAR'S STEERING LATELY SEEMED TO HAVE A LOT OF PLAY)  ON THIS DATE, AT APPROX 9:30 AM, I RECEIVED A CALL FROM THE MONTGOMERY SERVICE CENTER ([XXX]   / SERVICE MANAGER/ PHONE NR. 334-281-2886) INFORMING ME THAT THE \"RACK AND PINION \"  STEERING NEEDED TO BE REPLACED ASAP, AS THIS CONDITION GOOD BE A SAFETY FACTOR IN DRIVING THE CAR. HE SAID THE \"WHOLE\" RACK AND PINION STEERING ASSEMBLY WAS MOVING WHEN THE STEERING WHEEL WAS BEING TURNED, AN UNSAFE CONDITION.  [XXX]  ALSO TOLD ME THAT HE HAS SEEN AND REPAIRED SEVERAL CHRYSLER PRODUCT VEHICLES WITH THE SAME PROBLEM. (PREMATURE FAILURE OF THE RACK AND PINION STEERING ASSEMBLY)  CHRYSLER IS AWARE OF THIS PROBLEM AS [XXX]  SHOWED ME A CHRYSLER \"TECHNICAL SERVICE BULLETIN\": NR. 19-001-01/GROUP: STEERING/DATED 23 MARCH 2001.    THIS ALSO COVERED VEHICLES  FROM 1993-2001 CHRYSLER, DODGE, AND EAGLE.  IF THIS STEERING PROBLEM AND CONDITION IS UN SAFE, WHY HASN'T CHRYSLER RECALLED THESE VEHICLES FOR THE REPAIRS AT THEIR COST? (APPROX. $2400.00)   DOES SOMEONE NEED TO GET KILLED BEFORE ANYTHING IS DONE?  YOUR INQUIRY INTO THIS MATTER WOULD BE HIGHLY APPRECIATED.  (NAMES AND REPAIR RECEIPTS TO OTHER VEHICLES IN THE MONTGOMERY AREA FOR THE SAME PROBLEM, ARE AVAILABLE)    THANK YOU.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2C3HD56T3TH"
    }
]