[
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/03/2003",
        "dateOfIncident": "01/16/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005184,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "NEW BEETLE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 16, 2003 WHILE DRIVING MY VW NEW BEETLE TDI (DIESEL) ON THE INTERSTATE WITH A HALF OF A TANK OF NO. 1 DIESEL FUEL WITH THE TEMPERATURE BELOW 0 DEGREES F AND WIND CHILL IN THE -40 TO -50 F RANGE, MY VEHICLE DIED SEVERAL TIMES AND TOOK SEVERAL MINUTES TO RESTART EACH TIME.  BY THE TIME I GOT IT TO AN INDEPENDENT REPAIR SHOP 12 MILES FROM MY RESIDENCE 5 DAYS LATER (I LIVE OVER 100 MILES FROM THE NEAREST DEALERSHIP) THE VEHICLE WOULD STALL UNDER LIGHT LOAD (ANY SPEED ABOVE 20-40 M.P.H.) OR TRYING TO DRIVE UP A HILL AND, AFTER STALLING 4 TIMES THE BATTERY WAS BECOMING DRAINED.  THE REPAIR SHOP MADE SEVERAL CALLS TO A DEALERSHIP IN BURNSVILLE, MN. (WHICH HAD 4 OR 5 OTHER VWS WITH THE EXACT SAME PROBLEM) AND WAS TOLD THAT VOLKSWAGON RECOMMENDED TO THE DEALERSHIP SERVICE DEPARTMENT TO REMOVE (NOT REPLACE) THE ANTI-SIPHON FLAP IN THE FUEL TANK BECAUSE MOISTURE WAS FREEZING ON IT THUS LETTING AIR INTO THE FUEL LINES.  WHILE AT THE REPAIR SHOP I TOOK MY VEHICLE TO THERE WERE ALSO 3 OR 4 OTHERS COME IN OR BE TOWED IN WITH THE EXACT SAME PROBLEM.    SINCE THIS WAS NOT AN ISOLATED INCIDENT ON JUST MY VEHICLE AND VOLKSWAGON RECOMMENDED TO THE DEALERSHIP TO REMOVE THIS PART, I WOULD CONSIDED THIS TO BE A DESIGN FLAW AND AM EXPECTING TO BE REIMBURSED.  THE VW CUSTOMER CARE CENTER IN ROCHESTER HILLS, MI. DOES NOT AGREE.  SO, I AM NOT CONTACTING YOU NECESSARILY TO HELP ME BE REIMBURSED FOR THIS $200 EXPENSE BUT MORE IMPORTANTLY TO INFORM YOU OF THE SEVERITY OF THIS PROBLEM.  NOT ONLY HAS IT COST ME AND OTHERS HUNDREDS OF DOLLARS IN TOWING AND REPAIR COSTS BUT IS LEAVING PEOPLE STRANDED IN VERY DANGEROUS WEATHER CONDITIONS WHERE FROSTBITE WILL SET IN LITERALLY IN A COUPLE OF MINUTES.  IT SEEMS APPARENT THAT VW HAS NO PLAN TO CORRECT THIS PROBLEM IN SPITE OF THEM KNOWING THERE IS A PROBLEM SO I HOPE YOU CAN HELP OR AT LEAST INVESTIGATE THIS.    THANK YOU FOR YOUR TIME AND EFFORTS.",
        "vin": "3VWCF21C6YM"
    }
]