[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/03/2003",
        "dateOfIncident": "01/28/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005212,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND PRIX",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE, 1997 PONTIAC GRAND PRIX ON 5/5/01 WITH 50,768 MILES.  I TOOK MY CAR TO THE LOCAL DEALER FOR A RECALL ON THE FRONT STEERING PINION.  I HAD ASKED THEM TO REPLACE THE COOLANT SINCE THE MANUAL CALLED TO REPLACE AT 5 YEARS OR 150,000 MILE.  I WAS INFORMED THAT THE INTAKE MANIFOLD WAS LEAKING AND WAS TURNING MY ANTIFREEZE INTO MUD.  I ASKED THE SERVICE MANAGER WHAT CAUSED THE MANIFOLD TO LEAK.  HE TOLD ME THAT IT WAS WARPED AND WOULD HAVE TO BE REPLACED.  THE COST TO REPLACE IT WOULD BE $400.00.  MY CAR HAS APPROXIMATELY 13,000 MILES ON IT SINCE I BOUGHT IT.  IT IS MAINLY USED LOCALLY WITH THE LONGEST ROUND TRIP DRIVEN TO DATE AT APPROXIMATELY 100 MILES.  I HAVE MY OIL CHANGED AT REGULAR INTERVALS WITH THE DEALER, AND MAINTAIN ALL OTHER FLUIDS, WIPERS ETC.  I ASKED THE MANAGER HOW LONG IT WOULD TAKE TO REPLACE THE INTAKE MANIFOLD.  HE SAID IT WOULD TAKE LONGER TO FIND ONE THAN REPLACE IT.  HE SAID THAT THEY HAVE REPLACED A LOT OF THESE ON THIS ENGINE, AND THEY ARE IN SHORT SUPPLY.  I HAVE CHECKED YOUR WEB SITE FOR ANY TYPE OF RECALL AND HAVE FOUND NONE.  I DID FIND ONE COMPLAINT REPORT THAT A FIRE HAD OCCURED BECAUSE OF A CRACKED INTAKE MANIFOLD.  DO I RUN THE RISK OF A FIRE WITH MY VEHICLE BEFORE THEY REPLACE THE MANIFOLD?  ALSO, IF THIS PIECE IS SO PRONE TO FAILURE, WHAT IS CAUSING IT?  COULD SOMEONE PLEASE RESPOND BACK TO ME WITH SOME ANSWERS?",
        "vin": "1G2WJ52KXVF"
    }
]