[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": "01/04/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005299,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 33,000 MILES, OCT 2002 -APPROXIMATELY 55MPH, ACTED LIKE IT WAS NOT IN GEAR THEN THE TRANSMISSION FLUID HOT LIGHT CAME ON.  IMMEDIATELY PULLED OFF TO SIDE OF ROAD - CHECKED TRANSMISSION FLUID, IT CHECKED OK AND THE LIGHT WENT OFF.  PULLED BACK ONTO HIGHWAY - IT WAS FINE.  IMMEDIATELY TOOK TO LOCAL DEALERSHIP; THEY HOOKED IT UP TO THE COMPUTER AND DIDN'T FIND ANYTHING WRONG.  IN JAN 2003, UPON ACCELERATION, AROUND 25-30MPH, IT ACTED AS THOUGH IT WOULDN'T GO INTO 3RD & 4TH GEAR.  SAME AS OCT 2002, BUT NOTHING REGISTERED ON THE TRUCK'S MESSAGE CENTER THIS TIME.  AND THIS TIME, THE PROBLEM DIDN'T GO AWAY.  I TOOK TO ANOTHER LOCAL DEALER - MECHANIC DROVE VEHICLE AND NOTED THE PROBLEMS.  STILL, NOTHING REGISTERED ON THE TRUCK'S MESSAGE CENTER.  MECHANIC EVEN HOOKED UP THE TRUCK TO HIS COMPUTER AND DROVE IT WHILE IT WAS STILL FAILING.  TO HIS SUPRISE, NOTHING REGISTERED ON HIS COMPUTER EITHER.  THEY OVERHAULED THE TRANSMISSION - REPLACED 3RD & 4TH GEAR.  THEY ADJUSTED THE BILL - AS IF I PURCHASED EXTENDED WARRENTY.  CONTACTED GM - THEY REPORT THERE HAVE NOT BEEN ANY PROBLEMS LIKE THIS WITH THESE TRUCKS.  \"SOMETIMES THIS HAPPENS WHEN PEOPLE MAKE THINGS -IT'S UNFORTUNATE THAT IT HAPPENED TO YOU\".  AFTER THAT CALL - I FOUND THIS SITE AND FOUND A TECHNICAL BULLETIN REFERRING TO THIS SAME PROBLEM.  VERY DISAPPOINTED WITH ONLY HAVING 36,000 MILES SINCE MARCH 1999.",
        "vin": "2GCEK19T2X1"
    }
]