[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": "02/04/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005303,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY REPORTED THE FOLLOWING DEFECT TO DODGE: \"THE HEAD LIGHT ASSEMBLIES ON MY 1996 GRAND CARAVAN HAVE BECOME FOGGED OVER.  I'VE NOTICED REDUCED NIGHT VISIBILITY AS A RESULT.  I'VE NOTICED THE SAME DEGRADATION IN HEAD LIGHT ASSEMBLIES ON OTHER CARAVANS IN OUR NEIGHBORHOOD.  I TOOK THE VEHICLE TO OUR LOCAL DEALER WHO ACKNOWLEDGE THE PROBLEM BUT SAID DODGE HADN'T ISSUED ANY RECALL AS OF YET.  THIS LOSS OF CLARITY IN THE HEADLIGHT ASSEMBLY MATERIAL WILL LEAD TO NIGHT TIME ACCIDENTS IF NOT CORRECTED.  IS DODGE AWARE OF THIS DEFECT AND IF SO ARE THERE PLANS TO CORRECT THIS MANUFACTURING SHORTCOMING IN THE SAME MANNER YOU CORRECTED THE RECENT CLOCKSPRING DEFECT?\".  DODGE REPLIED: \"THANK YOU FOR YOUR RECENT E-MAIL TO DAIMLERCHRYSLER MOTORS CORPORATION REGARDING THE HEADLIGHTS ON YOUR 1996 GRAND CARAVAN.\"  THERE ARE NO INCOMPLETE RECALLS OR PENDING RECALLS INVOLVING YOUR VEHICLE FOR THE PROBLEM YOU HAVE DESCRIBED.   YOUR CONCERNS, PARTICULARLY IN VIEW OF THE EXPENSE AND INCONVENIENCE INVOLVED IN THIS ISSUE, ARE UNDERSTANDABLE. HOWEVER, YOUR REQUEST FOR CONSIDERATION IN THIS MATTER MUST BE DECLINED, BECAUSE THE VEHICLE IN QUESTION HAS EXCEEDED THE TIME OR MILEAGE LIMITATIONS OF THE MANUFACTURER'S WARRANTY AT THE TIME THE EXPENSE WAS INCURRED.  ALTHOUGH A MORE FAVORABLE REPLY COULD NOT BE PROVIDED, SHARING YOUR CONCERNS WITH US IS APPRECIATED.    SINCERELY,     NICOLE KALISH  SENIOR STAFF REPRESENTATIVE  DAIMLERCHRYSLER CUSTOMER ASSISTANCE CENTER    I FEEL THE RESPONSE IS IN ADEQUATE AND DOES NOT ADDRESS THE ISSUE.  THERE ARE SEVERAL INDENTICAL COMPLAINTS FOR THE CARAVAN LISTED ON THE NHTSA WEB SITE.  I AM CERTAIN AN EXTENSIVE SEARCH OF ALL CHRYSLER MINIVAN PRODUCTS WOULD FIND NUMEROUS IDENTICAL COMPLAINTS.  THIS MATERAIL DEFECT NEEDS TO BE INVESTIGATED AND CORRECTED.  IT WILL, IF IT HASN'T ALREADY, KILL OR INJURY INNOCENT PEOPLE DUE TO REDUCED NIGHT LIGHTING CAPABILITY.",
        "vin": "1B4GP54R4TB"
    }
]