[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2003",
        "dateOfIncident": "01/27/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005329,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON XL",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY WITH THE CRUISE CONTROL SET AT 72MPH, WHICH HAD BEEN ON AND IN PLACE FOR ABOUT 20 MINUTES, I LOOKED DOWN AND SAW THAT THE CAR WAS NOW GOING 85 - EVEN THOUGH I HAD NOT TOUCHED THE ACCELERATOR.  I DECIDED THAT I WOULD HIT THE BRAKE A LITTLE TO DEACTIVATE THE CRUISE AND RESET IT.  AFTER TOUCHING THE BRAKE, BUT BEFORE I PUT MY FOOT ON THE ACCELERATOR THE CAR WAS BACK UP TO 80 - 85.  I PLAYED AROUND WITH THE CRUISE CONTROL SWITCH, HOPING TO STOP THE PROBLEM.  NOTHING WORKED IN THAT REGARD, SO I THOUGHT I WOULD JUST GET OFF THE HIGHWAY, TURN THE CAR OFF (WHICH WOULD RESET EVERYTHING), AND START OVER.  WHILE TRAVELING TO THE EXIT, WHICH WAS ABOUT TWO MILES, I HAD TO KEEP SIGNIFICANT PRESSURE ON THE BRAKES TO KEEP THE CAR AT AN ACCEPTABLE HIGHWAY SPEED.  ONCE I PULLED OFF ONTO THE EXIT RAMP, I REALIZED THAT THE CAR WOULD NOT STOP.  I WAS STANDING ON THE BRAKE WITH BOTH FEET TO GET IT SLOWED DOWN TO MAKE THE TURN OFF THE RAMP.  SINCE THE CAR WOULD NOT STOP, I TRIED PUTTING THE CAR INTO NEUTRAL TO GET THE PULL OFF THE WHEELS, AT WHICH TIME THE RPMS RED-LINED.  I TRIED ALL THE DIFFERENT GEARS, WHICH HAD THE SAME RESULT.  I BRACED MYSELF FOR THE JOLT AND THREW THE CAR INTO PARK, NO JOLT - THE RPMS WENT TO RED-LINE.  AT THIS POINT I WAS HEADED FOR A GAS STATION AND I TURNED THE CAR OFF.  UPON SHUTTING THE CAR OFF, A HUGE PUFF OF BLACK SMOKE CAME OUT FROM UNDER THE HOOD, AND EVERYTHING SMELLED LIKE BURNING RUBBER.  A TOW TRUCK TOWED US BACK TO THE DEALERSHIP, WHERE THEY HAVE BEEN OF NO HELP WHAT SO EVER.",
        "vin": "1GKFK16T7YJ"
    }
]