[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/05/2003",
        "dateOfIncident": "09/20/2001",
        "fire": false,
        "manufacturer": "Porsche Cars North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10005332,
        "products": [
            {
                "manufacturer": "Porsche Cars North America, Inc.",
                "productMake": "PORSCHE",
                "productModel": "911 TURBO",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 21, 2001, I WAS HIT ON THE DRIVER'S SIDE BY A LARGE PASSENGER VEHICLE OR SUV, WHILE DRIVING A BRAND-NEW 2001 911 PORSCHE TURBO, SUPPOSEDLY EQUIPPED WITH SIDE IMPACT AIR BAGS. THE VEHICLE THAT HIT  ME RAN A STOP SIGN AND THE DRIVER DID NOT APPLY HIS BRAKES. I HAD NO STOP SIGN. I WOULD ESTIMATE THAT THE OTHER VEHICLE WAS TRAVELING IN EXCESS OF 25 MILES AN HOUR WHEN IT IMPACTED ME AND MY TWO YOUNG CHILDREN IN THE PORCH.  THE VEHICLE THAT HIT ME, HIT THE PORSCHE DIRECTLY IN THE DRIVER'S SIDE, IT RIPPED THE SIDE MIRROR OFF THE PORSCHE, BLEW OUT ALL THE DRIVER'S SIDE WINDOW GLASS, AND SEVERELY DAMAGED THE DRIVER'S SIDE DOOR.  THE AIR BAGS DID NOT OPERATE OR DEPLOY  AND THE DOOR FLEXED AND HIT ME (THE DRIVER) IN THE LEFT SIDE. THE SIDE AIR BAG, ACCORDING TO PORSCHE LITERATURE, IS SUPPOSED TO INFLATE AND PROVIDE A PROTECTIVE CUSHION BETWEEN THE DRIVER AND THE DOOR. THE DAMAGE TO THE PORSCHE WAS SIGNIFICANT, COSTING WELL OVER $15,000 TO REPAIR. WHILE FOLLOWING UP WITH PORSCHE CARS NORTH AMERICA AS TO WHY THE SIDE AIR BAGS DID NOT DEPLOY, TWO REPRESENTATIVES OF PCNA, IN POSITIONS OF IMPORTANCE AND KNOWLEDGE WITHIN THE COMPANY, TOLD ME THAT THE SIDE AIR BAGS DO NOT OPERATE AT ALL (OR DEPLOY)  WHEN THE PORSCHE IS IMPACTED BY AN SUV,  OR OTHER PASSENGER CAR THAT HAS A HIGHER FRAME THAN THE PORSCHE. I WAS TOLD BY THESE SAME GENTLEMEN FROM PCNA THAT THE REASON FOR THIS WAS THAT THE TRIGGERING DEVICES ON THE PORSCHE WERE SET VERY LOW IN THE FRAME OF THE VEHICLE. I WAS ALSO TOLD BY THESE SAME GENTLEMEN THAT THE DEALER THAT LEASED ME THE VEHICLE, CHAMPION MOTORS IN POMPANO BEACH, FLORIDA, HAS A HISTORY OF EVEN LOWERING THE PORSCHE VEHICLES  FURTHER BEFORE THEY ARE SOLD. AFTER I LEARNED THESE FACTS, I TELEPHONED SEVERAL REPRESENTATIVES OF THE NHTSA  AND  I WAS ROLLED THAT THIS IS NOT THE WAY SIDE AIR BAG SYSTEMS ARE DESIGNED, OR SUPPOSED TO BE DESIGNED, TO OPERATE.  PLEASE INVESTIGATE THIS DEFECT.  *NLM",
        "vin": "WP0AB29951S"
    }
]