[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/05/2003",
        "dateOfIncident": "12/31/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "ENVOY",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND LETTER TO YOUR COMPANY GMC.  PLAIN AND SIMPLE ALL I AM LOOKING FOR IS THE VALUE OF MY INVESTMENT.  I HAVE NO DESIRE TO GET ANYTHING FREE NOR AM I JUST TRYING TO GET A NEW VEHICLE.  THE 2002 ENVOY I PURCHASED FROM YOU A YEAR AND A HALF AGO WOULD BE FINE IF I DID NOT HAVE SO MANY PROBLEMS WITH IT.  ABOUT A MONTH AGO IT HAD TO HAVE A NEW MOTOR AND THIS PAST WEEK IT HAD TO GO BACK TO THE SHOP TO HAVE A FAN REPLACED AT A COST OF $800.   I EXPECT THAT NEXT MONTH I WILL BE PAYING $500 PLUS DOLLARS FOR SOME OTHER REPAIR.  I KNEW THAT ONCE THIS REPAIR WAS DONE TO THE MOST IMPORTANT SYSTEM OF THE VEHICLE I WOULD HAVE MAJOR PROBLEMS FOR AS LONG AS I HAVE THIS ENVOY.  I AM NOT GOING TO ALLOW THIS COMPANY TO KEEP ME IN THIS SITUATION.       THIS IS MY FINAL ATTEMPT TO REASON WITH GMC TO WORK OUT SOME WAY FOR ME TO GET A DEPENDABLE VEHICLE THAT AFFORDS ME THE YEARS OF SERVICE ANY REASONABLE PERSON WOULD EXPECT FOR A 30K INVESTMENT. MY GMC SR # IS 1-5521-9927.      I AM QUITE AWARE OF YOUR ASSERTION THAT YOU REPLACED THE ENGINE OUT OF WARRANTY FREE OF CHARGE.  I WOULD COUNTER THAT CLAIM BY SAYING THAT THE PROBLEMS WITH THE ENGINE STARTED LONG BEFORE THE WARRANTY EXPIRED.  I HAVE THE SERVICE CONTRACT TO SHOW THIS.   MY POINT IS I AM STILL STUCK WITH A 2002 GMC TRUCK THAT HAS SUFFERED A MAJOR ENGINE FAILURE AND ALL THE PROBLEMS THAT COME WITH THAT FAILURE AND THIS IS JUST 2003.   I WOULD ALSO SAY THAT THE VERY FACT THAT THE ENGINE FAILED SO SOON DOES NOT SPEAK WELL OF THIS VEHICLE OR YOUR COMPANY.  I HOPE THIS IS NOT THE STANDARD YOU HAVE ESTABLISHED FOR YOUR VEHICLE.  NOW ONLY A FEW WEEKS AFTER THE ENGINE IS REPLACED I AM FACED WITH THE TRUCK GOING BACK TO THE SHOP FOR A MAJOR REPAIR.  I STILL HAVE NOT MENTIONED THE OTHER PROBLEMS I HAVE HAD WITH THE ENVOY.    LETTERS TO THE BETTER BUSINESS BUREAU,AND CONSUMER PROTECTION AGENCY WILL ALSO BE WRITTEN.      PLEASE SEND ME A WRITTEN RESPONSE TO THIS LETTER.    KELVIN ONEAL BUCK, CUSTOMER",
        "vin": "1GKDS13S122"
    }
]