[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/05/2003",
        "dateOfIncident": "03/22/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005354,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEEL RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON TWO SEPERATE OCCASIONS WITHIN THE LAST TWO YEARS, I HAVE HAD TWO FIRESTONE TIRES CAUSE DAMAGE TO MY VEHICLE VIA COMPLETE BLOW OUT AND SEPERATION. I AM ONE OF THE FORTUNATE ONES THAT ARE HEAR TO TELL OF MY NEAR CATASTROPHES INVOLVING FIRESTONE TIRES. FARMER INSURANCE REPAIRED MY VEHICLE THE FIRST TIME AND SENT THE BLOWN TIRE ( WHAT WAS LEFT ) TO FIRESTONE AND A LETTER WAS SENT TO FARMERS INDICATING THAT LOW TIRE PRESSURE WAS THE CAUSE.  THE SECOND TIRE WAS SEPERATED IN MARCH OF 02 AND ONCE AGAIN DAMAGED MY VEHICLE.  ONCE AGAIN, I RECEIVED THE RESPONCE BACK. IT WAS THE SAME OLD STORY. IMPROPER AIR PRESSURE. MY VEHICLE IS DRIVEN AN AVERAGE OF 700 MILES PER WEEK. MY TIRES ARE MAINTAINED BY FLYIN J TRUCK CENTERS AND MY AIR PRESSURE IS DOCUMENTED FREQUENTLY AS REQUIRED. I AM UNDER THE BELIEF THAT INSUFFICIENT AIR PRESSURE IS THE STANDARD ANSWER GIVEN BY FIRESTONE TO NEGLECT COMPENSATION FOR DAMAGES WHICH OCCUR BY THEIR FAULTY TIRES. THIS TREND IS VERY ALARMING AND I AM HOPING THAT YOUR DEPARTMENT CAN GET INVOLVED INTO A RESOLUTION. I AM VERY DISTURBED BECAUSE FIRST OF ALL, FIRESTONE IS ABLE TO INSPECT THEIR OWN TIRES WITH NO INDEPENDANT AGENCY OVERSEEING THE PROCESS. ALSO HAVING A PARALEGAL ON STAFF TO SIGN THE DOCUMENTS SO THE GENERAL PUBLIC IS THWARTED FROM RESPONDING. I WILL BE HAPPY TO FORWARD VIA FAX, ALL DOCUMENTATION REGARDING THIS MATTER. I HAVE CONTACTED ALL AGENCIES INCLUDING, FOX NEWS, NEVADA ATTORNEY GENERAL, PRIVATE COUNCIL, SENATORS HARRY REID AND JOHN ENSIGN, AND THE U.S. DEPT. OF TRANSPORTATION. I AM NOT GOING TO STOP MY CAMPAIGN UNTIL FIRESTONE STANDS UP AND TAKES THE RESPONCIBILITY FOR THE DAMAGES DUE TO FAULTY WORKMANSHIP OF THEIR TIRES. I BELIEVE FIRESTONE INTENDS TO SEE IF THIS ISSUE GETS SWEPT UNDER THE CARPET. PLEASE ADVISE ME OF YOUR RECEIPT OF THIS COMPLAINT AND A FAX NUMBER WHERE I CAN FORWARD ANY CORRESPONDENCE. THANK YOU FOR YOUR ATTENTION IN THIS MATTER AND I WILL WAIT TO HEAR BACK.",
        "vin": "1FTNW21F6YE"
    }
]