[
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/06/2003",
        "dateOfIncident": "02/02/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005400,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "CIVIC",
                "productYear": "1997",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "AUTOMATIC EQUIPMENT",
                "productModel": "AUTOMATIC EQUIPMENT",
                "productYear": "1984",
                "type": "Equipment"
            }
        ],
        "summary": "I PURCHASED AN AUTOMATIC 1997 HONDA CIVIC EX FROM COSTA MESA HONDA IN COSTA MESA, CA ON MARCH 11, 2000.  I PURCHASED THE VEHICLE WITH 27,000 MILES ON IT.  TODAY (2/6/03) THE CAR HAS A TOTAL OF 50,734 MILES ON IT.  I HAVE PERSONALLY ONLY DRIVEN 24,000 MILES IN A TOTAL OF 3 YEARS.  THE TRANSMISSION IS TOAST AND NEEDS TO BE REPLACED.  THERE HAVE BEEN TRANSMISSION RECALLS/ WARRANTY EXTENSIONS ON OTHER HONDA MAKES AND MODELS.  THE '97 CIVIC UNFORTUNATELY IS NOT ONE OF THEM.    I HAVE TAKEN MY CAR TO A MECHANIC NOT AFFILIATED WITH HONDA FOR A \"SECOND\" OPINION AND THE MECHANIC HAS STATED THAT THIS SHOULD NOT BE HAPPENING TO SUCH A \"YOUNG\" CAR WITH ONLY 50,000 MILES.  HE SAID THAT MOST VEHICLES DON'T EXPERIENCE TRANSMISSION PROBLEMS UNTIL THEY HAVE REACHED AN EXCESS OF 90- 100,000 MILES.    BASED ON THE INFORMATION HE HAS GATHERED FROM MY SERVICE RECORDS AS WELL AS THE INFORMATION PROVIDED FROM OTHER SOURCES, HE BELIEVES THAT THIS IS NOT A PROBLEM WHICH I HAVE CAUSED.      I FEEL THAT HONDA SHOULD REPLACE/FIX THE TRANSMISSION FREE OF CHARGE OR FOR MINIMAL COST TO ME.  THEY ARE STATING THAT BECAUSE I DID NOT PURCHASE AN EXTENDED WARRANTY (WHEN I PURCHASED MY VEHICLE IT STILL HAD THE NORMAL FACTORY 3 YEAR... 36,000 MILE WARRANTY IN PLACE).  I FEEL THAT HONDA IS RIPPING ME OFF BY NOT WORKING WITH ME ON THIS ISSUE.    PLEASE NOTE THAT I WILL NEVER PURCHASE ANOTHER HONDA AND I WILL BE SURE THAT NO ONE IN MY FAMILY OR ANY OF MY CLOSE FRIENDS EVER PURCHASE A HONDA.  I WOULD HATE FOR OTHER PEOPLE TO GO THROUGH THE SAME THING I AM.",
        "vin": "1HGEJ824XVL"
    }
]