[
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/08/2003",
        "dateOfIncident": "07/24/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10005511,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MONTERO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR ACCIDENT OCCURED WHILE TOWING A POP UP TRAILER.  WE ARE EXPERIENCED DRIVER'S AND HAVE BEEN TOWING A TRAILER FOR MORE THAN 12 YEARS.  WHILE TRAVELING AT APPROXIMATELY 55 MPH, SUDDENLY AND WITHOUT WARNING I WAS UNABLE TO CONTROL THE CAR.  WE WERE TRAVELING ON A STRAIGHT SECTION OF HIGHWAY IN THE RIGHT LANE. THE ROAD CONDITIONS AND WEATHER CONDITIONS WERE GOOD. THERE WERE NO TIRE FAILURES ON THE CAR OR THE TRAILER.  THE STEERING WHEEL STARTED ROCKING AND SOON WE HAD NO CONTROL OF THE CAR.  THE FRONT END FELT AS THOUGH IT WAS NOSE PLOWING.  THE CAR SWERVED INTO THE LEFT LANE.  THE FIRST IMPACT WAS TO THE TRAILER; IT BRUSHED AGAINST THE CONCRETE MEDIAN DIVIDER. THE CAR THAN PULLED TO THE RIGHT.  THE SECOND IMPACT WAS TO THE DRIVER'S SIDE FRONT END OF THE CAR THAT HIT THE METAL GUARDRAIL ON THE RIGHT SIDE OF THE ROAD.  THE WEIGHT OF THE TRAILER PULLED US BACK ONTO THE ROAD.  THE TRAILER AT THIS POINT JACK KNIFED AND FLIPPED ONTO IT'S ROOF PROCEEDING NORTH ON THE HIGHWAY FOR ABOUT 50 FEET.  THE THIRD IMPACT WAS TO THE DRIVERS SIDE REAR OF THE CAR, AGAIN HITTING THE GUARDRAIL AS THE TRAILER PULLED THE CAR BACKWARD.  WE FEEL THAT IF WE WERE NOT TOWING THE TRAILER WE WOULD HAVE BEEN ANOTHER VICTIM OF A SUV ROLL OVER ACCIDENT. AFTER EXAMINING THE CAR AFTER THE ACCIDENT IT WAS DISCOVERED THAT THE LEFT TIE ROD WAS SNAPPED IN HALF. THE LEFT FRONT TIRE WAS TURNED OUTWARDS WHILE THE RIGHT FRONT TIRE WAS FACING FORWARDS.  MITSUBISHI HAS YET TO BE ABLE TO EXPLAIN WHAT HAPPENED WITH THE CAR.  TO DATE THERE HAVE BEEN OVER $21,000 IN REPAIRS TO THE VEHICLE.  THEY STILL HAVE OUR CAR!",
        "vin": "JA4MW31R42J"
    }
]