[
    {
        "components": "SERVICE BRAKES, AIR,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,INTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/05/2003",
        "dateOfIncident": "12/16/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10000534,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "SUNFIRE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I FILED A COMPLAINT ON A 2002 GRAND AM GT VIN [XXX] CONCERNING STEERING PROBLEMS.  I CANNOT FIND IT IN YOUR CONSUMER COMPLAINT DATA BASE, NOR ANY OTHER INFORMATION RELATED TO THIS VEHICLE OR RECALLS, SAFETY ISSUES, ETC ON 2002 GRAND AM GT IN GENERAL.  AM I LOOKING IN THE WRONG PLACE?  PLEASE HELP.  ALSO, I NOW OWN A 2002 PONTIAC SUNFIRE VIN [XXX].  I TOOK DELIVERY ON 10.31.02 AS PART OF LEMON LAW BYBACK BY GM ON ABOVE DISCUSSED GRAND AM.  I AM HAVING SEVERAL PROBLEMS WITH THIS NEW CAR I CONSIDER SAFETY HAZARDS.  GM SO FAR HAS HAD THE CAR MORE THAN I HAVE.  HOW CAN I FILE A COMPLAINT AND FIND OUT MORE INFORMATION ON THE AREAS OF CONCERN WITH THIS VEHICLE.  SO FAR, IT WENT OF PARK INTO REVERSE AND HIT ME IN THE HEAD CAUSING INJURY MY DOC IS LOOKING INTO, THE CAR ON THE SAME TRIP COMPLETELY SHUT DOWN, LOSING ALL POWER EXCEPT RADIO, AND THE ABS OFF LIGHT WENT ON.  YET TWO DEALERS, MIDWAY IN PHOENIX ON 12.16.02 AND COURTESY IN LAS VEGAS SAY NO PROBLEMS EXIST.  COURTESY SILL HAS CAR BECAUSE IT WAS NOT FULLY REPAIRED PER WORK ORDER.  I FEEL LIKE I AM IN THE SAME BLACK HOLE I WAS IN WITH THE GRAND AM GT EXCEPT NO SERIOUS ACCIDENTS TO THE VEHICLE LIKE THE ONE I HAD WITH THE GT HAS OCCURRED.  PLEASE GUIDE ME ON WHAT TO DO IF YOU CAN.  MY WIFE AND I ARE DISABLED AND THIS IS VERY TRYING ON US.  ALSO, I AM WAITING PER MY DOCTOR FOR THE FIRST WEEK IN FEBRUARY TO RVIEW X-RAYS AND CAT SCAN F MY NECK.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).   *TR",
        "vin": "1G2JB524727"
    }
]