[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/10/2003",
        "dateOfIncident": "11/27/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005624,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-250 SD",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE EXPERIENCED A FRONT WHEEL BEARING MALFUNCTION WHICH JUST ABOUT RESULTED IN A POTENTIAL CRASH IF I HAD BEEN ON THE HIGHWAY AT THE TIME. LUCKILY I HAD STOPPED FOR GAS. I WAS TOLD BY FORD THERE WAS NO RECALL AND THEY WERE UNAWARE OF THE PROBLEM. THE INDEPENDENT SHOP THAT FIXED THE PART SAID IT WAS SEALED AND WAS A MANUFACTURE DEFECT. I CALLED FORD BACK TO REPORT IT AND THEY INSIST THERE IN NO PROBLEM EVEN THOUGH I HAVE 5 FRIENDS WHO HAVE EXPEREINCE THE EXACT PROBLEM IN THEIR F250 TRUCKS. I ALSO REFERRED FORD TO A WEBSITE CHAT THAT INDICATED OVER 200 OF THE SAME PROBLEM ALL AT DIFFERENT POINTS OF THE OWNERSHIP (10K, 25K, 50K MILES) SOME UNDER WARRANTY SOME NOT. I BELIEVE THIS TO BE ENOUGH FOR FORD TO TAKE OWNERSHIP. THEY REFUSED TO PAY FOR MY REPAIRS AS WELL AS LOOK INTO THE MATTER. THEY CONTINUE TO PUT THIS PART ON THE TRUCKS KNOWING THEY ARE DEFECTIVE AND CANNONT FUNCTION ONT HE SUPERDUTY TRUCK FRONT ENDS. I HAVE ALSO SPOKEN WITH DIFFERENT FORD MECHANICS WHO ADMIT IT IS A \"KNOWN PROBLEM\" AND THEY KEEP THE PART IN STOCK BECAUSE THEY REPLACE THEM SO MUCH. THE WORD FROM FORD ABOVE IS \"IF IT IS IN WARRANTY FIX IT, IF IT IS OUT CHARGE, AND IF THEY COMPLAIN COMPENSATE\" WHEN ASKED ABOUT POTENTIAL ACCIDENT IT WAS SAID \"THEY WOULD DEAL WITH IT AS THEY ARISE\". I THINK THIS NEED TO BE LOOKED INTO. I AM ONLY OUT $500 BUT SOMEONE ELSE MAY BE OUT ALOT MORE IF THAT FRONT END LOCKS UP GOING 70 DOWN A HIGHWAY.",
        "vin": "1FTNX21F71E"
    }
]