[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/11/2003",
        "dateOfIncident": "02/08/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "MUSTANG GT",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "UNPREDICTABLE PROBLEM. OCCASIONALLY, 5 TO 15 SECONDS AFTER I FIRST START MY 1999 MUSTANG GT, THE ENGINE WILL RAPIDLY INCREASE IN RPM AND THEN RETURN TO NORMAL. IF THE CAR IS IN DRIVE OR REVERSE AND  I DO NOT HAVE MY FOOT FIRMLY ON THE BRAKE, THE CAR WILL JUMP FORWARD OR BACKWARD. I NOTICE THE PROBLEM MOSTLY WHEN I FIRST PUT THE CAR IN REVERSE. IT MAY HAPPEN 3 OR 4 TIMES IN ONE MONTH AND MAY NOT HAPPEN AGAIN FOR 2 OR 3 MONTHS. IF YOU DO NOT HAVE THE BRAKE APPLIED FIRMLY, I THINK THE CAR COULD EASILY JUMP 5 FEET BEFORE GETTING A FOOT ON THE BRAKE. I CURRENTLY HAVE 29,000 MILES ON MY CAR. I PURCHASED IT NEW IN THE MIDDLE OF 1999. THIS HAS BEEN A PROBLEM SINCE THE CAR WAS NEW. DURING A PREVIOUS IN WARRANTY REPAIR, I TOLD THE DEALER ABOUT THIS PROBLEM AND THAT SOMETIMES IT ALSO HAD A ROUGH IDLE. THEY COULD NOT REPRODUCE EITHER OF THE PROBLEMS DURING TESTING. NOW THE CAR HAS A SPORADIC COLD IDLE PROBLEM WHICH HAS GOTTEN WORSE. I DO NOT KNOW IF IT IS RELATED. I WOULD GUESS THE \"RAPID RPM INCREASE AT IDLE PROBLEM\" HAS OCCURED BETWEEN 25 AND 50 TIMES WHILE I WAS DRIVING THE CAR. AT FIRST, I THOUGHT MAYBE I WAS BUMPING THE GAS PEDAL. AFTER REPEAT OCCURENCES I STARTED PAYING CLOSE ATTENTION. MY FOOT NEVER TOUCHED THE GAS PEDAL WHEN THE CAR JUMPED UNPREDICTABLY. I THINK IT IS IMPORTANT TO NOTE THAT I AM VERY HAPPY WITH THIS CAR. FOR THE MOST PART, I AM A VERY HAPPY CUSTOMER OF FORD MOTOR CO. HOWEVER, THIS PROBLEM CONCERNS ME GREATLY FROM A POINT OF SAFETY BECUASE PEDESTRIANS COULD BE WALKING IN FRONT OF OR BEHIND THE CAR WHEN THE PROBLEM OCCURS.",
        "vin": ""
    }
]