[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2003",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005729,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ODYSSEY",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO-         I DO NOT KNOW WHERE TO GO TO FIND OUT INFORMATION REGARDING MY NEW VEHICLE. I AM HAVING A PROBLEM WITH THE TRANSMISSION \"SLIPPING\" OR \"LURCHING\" WHEN IT DECELERATES. THIS HAPPENS WHEN IT IS SHIFTING AT THE SPEED OF 45 MPH. THE DEALER TOLD ME IT WAS \"NORMAL OPERATION\" THAT THE VEHICLE KNOWS WHEN I NEED TO SLOW DOWN MORE RAPIDLY THEN DOWNSHIFTS FOR ME --- THE DRIVER.          I DO NOT BELIEVE AN AUTOMOBILE CAN KNOW WHEN I NEED TO SLOW MORE RAPIDLY. IT IS UNCOMFORTABLE TO \"LURCH\" FORWARD DUE TO AN EXCESSIVE DOWNSHIFT WHEN I AM BRAKING. WHILE I WAS AT THE DEALER DISCUSSING MY PROBLEM, THE WOMAN NEXT TO ME- WHO ALSO HAS A 2003 ODESSY - WAS HAVING THE SAME ISSUE. SHE WAS ALSO TOLD THIS IS A \"NORMAL OPERATION\" OF THE CAR. THE DEALER STATED THAT THIS SHOULD ONLY HAPPEN WHILE GOING DOWN A HILL/INCLINE. HOWEVER, THIS HAS HAPPENED TO ME ON A STRAIGHT STRETCH OF ROAD.          I AM AFRAID THIS IS A DEFECTIVE TRANSMISSION AND WILL \"SLIP\" OR \"LURCH\" AND CAUSE SERIOUS HARM OR DEATH. THE HONDA DEALER HAS TOLD ME THERE IS NOTHING THEY CAN/WILL DO ABOUT THIS ISSUE. HOW CAN I FIND OUT IF INDEED MY TRANSMISSION IS HAVING PROBLEMS?? I DO NOT KNOW WHERE TO GO FOR HELP OR TO FIND IF ANY TESTING HAS ALREADY BEEN DONE ON THIS PROBLEM.         IF YOU HAVE ANY SUGGESTIONS - OTHER THAN CONTACTING HONDA - ANY INDEPENDANT AGENCIES THAT MIGHT HAVE INFORMATION ON THIS ISSUE, I WOULD APPRECIATE ANY HELP. I AM LOOKING FOR SOME UNBIASED ADVICE FROM A REPUTABLE AGENCY THAT WILL TELL ME IF I HAVE A PROBLEM WITH THIS TRANSMISSION.         THANK YOU IN ADVANCE FOR  YOUR HELP WITH THIS PROBLEM.",
        "vin": "5FNRL18073B"
    }
]