[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/12/2003",
        "dateOfIncident": "12/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK HAS AN AUTOMATIC HEADLIGHT CIRCUIT.  (AT TWILIGHT THE HEADLIGHTS ARE ENERGIZED WITHOUT MANUAL TURN-ON.)   AMONG THE MANY ELECTRONIC FEATURES THERE IS ALSO A ''DOME LIGHT OVERRIDE'' BUTTON.   THIS FEATURE ALLOWS YOU TO CONTROL WHETHER OR NOT THE DOME LIGHT COMES ON WHEN THE DOOR IS OPENED.  ONE CAN EASILY ASSUME IT IS TO TURN ON AND OFF THE DOME LIGHT WITHOUT OPENING THE DOOR.  HOWEVER, THIS IS NOT THE CASE.    IF YOU ARE DRIVING WITH THE HEADLIGHTS ON THE AUTOMATIC CIRCUIT AND YOU PUSH THE ''DOME OVERRIDE'' 3-4 TIMES, ALL THE LIGHTS GO OUT (INCLUDING THE DASHBOARD LIGHTS).  TO RE-ENERGIZE THE HEADLIGHTS YOU MUST DO ONE OF THE FOLLOWING:    1.  TURN IGNITION OFF AND BACK ON.  (IMPOSSIBLE TO DO IF DRIVING.)  2.  HIT THE DOME OVERRIDE BUTTON 3-4 MORE TIMES.  (NOT AN INTUITIVE CORRECTION.)  3.  TURN THE HEADLIGHT MANUAL SWITCH TO ON.  (GOOD IDEA IF YOU KNOW ABOUT THE PROBLEM BEFOREHAND AND HAVE THE PRESENCE OF MIND TO DO IT WHILE DRIVING 60-70 MPH ON A BLACKTOP HIGHWAY. AND IF YOU CAN FIND THE SWITCH KNOB IN TOTAL DARKNESS WHILE STEERING AND BRAKING IN TOTAL DARKNESS.)    THE REALLY BAD:    CHECKING WITH THE DEALER ABOUT THIS DEFECT, I WAS TOLD THIS FEATURE IS DESIGNED INTO THE ELECTRONICS.  THAT IS, ''ITS NOT A DEFECT, ITS SUPPOSED TO DO THIS.''    THE REALLY, REALLY BAD (AND GM''S MAJOR LIABILITY):    NOWHERE IN THE DETAILED INSTRUCTION MANUAL DOES GM WARN, CAUTION, OR EVEN MENTION THIS FEATURE.  APPARENTLY, THIS IS SOMETHING ONLY MR. GOODWRENCH IS  SUPPOSED TO KNOW.    CONCLUSION: BEING AN ENGINEER MYSELF, I FIND THIS BUILT-IN FEATURE (DEFECT) TO BE MIND-BOGGLING.",
        "vin": "1GCGK29UXYZ"
    }
]