[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/12/2003",
        "dateOfIncident": "12/13/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12-13-02 I WAS TOLD BY MILE ONE WHERE I PURCHASED MY WARRANTY  TO HAVE MY VAN TOWED TO A FORD DEALSHIP BECAUSE IT HAD A MECHANICAL BREAKDOWN.THE SERVICE MANAGER JOHN LOCKET SAID THAT THE VAN  HAD WHAT HE CALLED AN INTERMIX IN THE ENGINE,HE SAID THAT COOLANT AND THE OIL HAD SOMEHOW MIXED TOGETHER.I ASKED HIM WHAT CAUSED THAT TO HAPPENED AND HE SAID THAT IT COULD BE A BLOWN HEADGASKET OR A CRACKED CYLINDERHEAD. I CALLED HIM  ON 12-23-02 AND HE SAID TOLD ME THAT THE MECHANIC SAID THAT HE COULDN'T TELL WHAT THE PROBLEM WAS SO I WOULD HAVE TO GIVE MY PERMISSION FOR THEM TO BREAK DOWN THE ENGINE AT MY OWN EXPENSES AND I WAS TOLD THE SAMETHING BY MILE ONE,I AGREED.I CONTACTED THE SERVICE MANAGER SAM STEWARD OF KIA OF GLEN BURNIE WHERE I PURCHASED THE VAN AND HE AGREED TO CALL AND SPEAK TO THE SERVICE MANAGER JOHN LOCKET AT THE FORD DEALERSHIP.HE TOLD HIM THAT HE WOULD HAVE EVERYTHING WORKED OUT AFTER CHRISTMAS. MR.STEWARD TOLD ME TO KEEP IN TOUCH AND TO LET HIM KNOW IF I NEEDED ANYMORE ASSISTANCE.I CONTACTED HIM AGAIN THE FIRST PART OF JANUARY AND I TOLD HIM THAT THEY STILL COULDN'T FIND THE PROBLEM SO I MADE A CONFERENCE CALL TO MR. LOCKET WITH MR.STEWARD'S PERMISSION. MR.LOCKET EXPLAINED TO MR.STEWARD AND MYSELF THAT I WOULD HAVE TO GIVE MY PERMISSION TO HAVE THE ENGINE PULLED OUT TO HAVE THE BLOCKED CHECKED TO SEE IF IT IS CRACKED I AGREED AGAIN. MR.STEWARD ASKED MR.LOCKET WHY WAS IT TAKING SO LONG TO FIND THE PROBLEM AND HE SAID THAT HE WAS SHORT ON HELP.I SPENT OVER 1200 DOLLARS ON A RENTAL VAN AND HAD TO CATCH RIDES WITH FRIENDS TO AND FROM THE BABYSITTERS AND WORK.I AM STRESS OUT AND I FEEL LIKE MILE ONE DO NOT WANT TO HONOR THE WARRANTY.I WAS TOLD TODAY BY THE FORD DEALERSHIP SERVICE MANAGER JOHN LOCKET THAT I HAD TO PAY A 1000 DOLLAR DEDUCTIBLE AND THEY WOULD PAY THE REST TO REPLACE THE ENGINE. THE ENGINE IS COVERED UNDER THE WARRANTY SO WHY DO I HAVE TO PAY A 1000 DOLLAR DEDUCTABLE.",
        "vin": "2FMZA514XYB"
    }
]