[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/13/2003",
        "dateOfIncident": "11/20/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005776,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 CHEVROLET CORVETTE COUPE  STEERING COLUMN LOCK PROBLEMS: TWICE IN TWO YEARS    THE FIRST TIME IT HAPPENED, I FOLLOWED ALL PROCEEDURES SHARED BY FELLOW CORVETTE OWNERS AND THE MANUAL, I HAD TO REPEAT THIS PROCEDURE SEVERAL TIMES BEFORE IT WOULD UNLOCK. I THEN TOOK THE CAR INTO THE DEALER, THEY REPLACED THE STEERING COLUMN LOCK SYSTEM BUT TOLD ME THAT THERE WAS NO OFFICAL RECALL ON THIS.    ONE YEAR LATER, SAME THING HAPPENED AGAIN,  I TRIED AND TRIED TO GET THE STEERING COLUMN TO UNLOCK. IT WOULD NOT, CALLED THE DEALERSHIP, THEY WANTED THE CAR TO BE TOWED IN. THEY TOLD ME THAT SINCE THEY HAD ALREADY REPLACED THE SYSTEM, THEY WOULD NOT REPLACE IT AGAIN. (BY THE WAY THE CAR WAS STILL UNDER GM EXTENDED WARRANTY.)    I DID NOT HAVE THE CAR TOWED RIGHT AWAY, BUT LATER THAT DAY  I TRIED ALL OF THE SAME PROCEDURES AGAIN, WITHOUT SUCCESS.  I WENT ONTO THE INTERNET TO A CORVETTE WEBSITE/DISCUSSION BOARD AND RESEARCHED IF OTHERS HAD THE SAME PROBLEM AND ANSWERS/IDEAS TRIED.    LOCATING SEVERAL POSTINGS SUGGESTING TO PULL A SPECIFIC FUSE, WAIT 1 MINUTE, THEN RE-INSTALLED THE FUSE.  BY DISCONNECTING THIS FUSE, THE COMPUTER BRAIN WOULD RESET ITSELF CONCERNING THIS TASK AND THE PIN SHOULD UNLOCK WHEN THE IGNITION KEY WAS RE-INSERTED.   I TRIED THIS, SEVERAL TIMES, OVER AND OVER WITHOUT SUCCESS.  FINALLY OUT OF FRUSTRATION I RESORTED TO \"SHAKE THE STEERING WHEEL HARD BACK AND FORTH\"UNTIL THE PIN WOULD RELEASE. AFTER A MINUTE OF SHAKING... THE PIN DID LET LOOSE AND THE STEERING COLUMN UNLOCKED.    THE NEXT DAY I TOOK THE CAR INTO THE DEALER AND INSISTED THAT THEY REPLACE THE STEERING COLUMN LOCK SYSTEM AGAIN, EVEN THOUGH THEY TOLD ME A DAY EARLIER THAT THEY WOULDN'T DO THAT, THEY DID CHANGE IT WHEN I CONFRONTED THEM.    IT DOES NOT APPEAR TO ME THAT GM HAS NOT ADDRESSSED THIS PROBLEM OR ACKNOWLEDGE IT AS BEING A PROBLEM.  WELL I AM HERE TO SAY THAT IT IS, THIS IS WHY I AM FILING THIS COMPAINT.    REF. IN EA02-031 *CJS",
        "vin": "1G1YY22GXX5"
    }
]