[
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/13/2003",
        "dateOfIncident": "02/04/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005779,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "14048271",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I AM WRITING TO COMPLAIN ABOUT THE SECOND FAILURE OF THE \"POWER ASSIST\" FEATURE ON MY 2001 CHEVROLET SUBURBAN.  THE FIRST FAILURE OCCURED DURING JANUARY OF 2002, AND THE POWER STEERING PUMP WAS REPLACED AT FOX CHEVROLET DEALERSHIP IN LAUREL, MD.  IN THE 2002 EVENT, I EXPERIENCED A HIGH PITCH WHINING AND VIBRATIONS IN THE STEERING, AS WELL AS THE BRAKE PEDAL.  IN EFFECTING THIS REPAIR, CHEVROLET REPLACED THE POWER STEERING PUMP.   DURING THE LATTER PART OF NOVEMBER 2002, THE HIGH PITCH WHINING AND VIBRATION RETURNED.    I TOOK THE VEHICLE TO BILL SEIDLE'S CHEVROLET IN CLERMONT, FL IN NOVEMBER OF  2002, AND WAS TOLD THAT THERE WAS NOTHING WRONG WITH THE STEERING OR BRAKING  SYSTEM.    UNFORTUNATELY, THEY WERE WRONG.  ON TUESDAY EVENING, 2/4/2003, WHILE DRIVING  WITH MY SEVEN YEAR OLD, THE SAME HIGH PITCH WHINING, AND PULSING IN THE BRAKE  PEDAL RETURNED.  THIS TIME IT RESULTED IN THE TOTAL LOSS OF POWER STEERING AND  BRAKES WHILE EXITING A LOCAL HIGHWAY SYSTEM IN THE ORLANDO AREA.  FORTUNATELY, I  WAS DRIVING AS IT TOOK QUITE A BIT OF STRENGTH, TO STEER AND STOP THE VEHICLE  AFTER THE LOSS OF THE POWER ASSIST SYSTEM.    AT WHAT POINT DOES THE FAILURE OF SUCH A CRITICAL PART OF THIS VEHICLE GET  LABELED AS A DEFECT IN THIS SYSTEM.    THE FAILURE OF THIS SYSTEM, COULD HAVE CAUSED INJURY TO ME AND MY FAMILY (SON).   HAD MY WIFE BEEN DRIVING THIS TRUCK, THE RESULT MAY HAVE BEEN GRAVELY DIFFERENT.   I PURCHASED THIS VEHICLE BECAUSE OF THE REPUTATION FOR DURABILITY IN THE  INDUSTRY, WITH THE EXPECTATION OF PURCHASING A QUALITY VEHICLE.  I AM NOW  FEARFUL OF PUTTING MY FAMILY IN THIS VEHICLE AFTER A SECOND FAILURE OF THIS  CRITICAL SYSTEM.    I AM REQUESTING THAT I BE CONTACTED AS SOON AS POSSIBLE BY SOMEONE THAT CAN  ADDRESS MY CONCERNS.  I AM CONCERNED ABOUT PLACING MY FAMILY IN A VEHICLE THAT HAS HAD THE POWER STEERING/BRAKING SYSTEM FAIL TWICE.",
        "vin": "3GNGK26U51G"
    }
]