[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/13/2003",
        "dateOfIncident": "02/10/2002",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005791,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PASSPORT",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER 2002, THE TRANSMISSION WOULD NOT SLIP INTO FIRST GEAR FROM A COMPLETE STOP AND WHEN I WOULD HAVE TO SLOW DOWN FOR TRAFFIC AND ACCELERATE.  THE TRUCK WOULD JERK INTO FIRST GEAR. ALSO, WHEN I PUT THE TRUCK INTO REVERSE, ONCE I SHIFTED THE GEAR INTO DRIVE, IT WOULD TAKE 8-10 SECONDS BEFORE THE CAR WOULD SLIP INTO FIRST GEAR.  JANUARY 4, 2003, I TOOK THE CAR TO A REPAIR SHOP AND TOLD THEM THE PROBLEM I WAS HAVING AND THEY SERVICED THE TRANSMISSION, TELLING ME THAT I WAS LOW ON FLUID, BUT THAT THERE WEREN'T ANY APPARENT OR VISIBLE PROBLEMS.  I DID NOT HAVE ANY FURTHER PROBLEMS WITH THE TRUCK UNTIL FEBRUARY 5TH OR 6TH, WHEN THE JERKING BEGAN AGAIN.  ON FEBRUARY 10, 2002, ON MY WAY HOME FROM WORK I STARTED THE TRUCK AND IT TOOK ABOUT 20 SECONDS FOR THE CAR TO SLIP INTO FIRST GEAR.  THEN AS I WAS GOING 55-60 MILES AN HOUR UP AN INCLINE ON A MAJOR EXPRESSWAY, THE TRUCK WOULD NOT ACCELERATE AND BEGAN TO MAKE A \"MOANING\" NOISE AND THE CHECK TRANSMISSION LIGHT CAME ON.  THIS WAS THE FIRST TIME THAT THE TRANSMISSION LIGHT HAD EVER COME ON.  I HAD TO QUICKLY PULL OVER ONTO THE SHOULDER TO AVOID BEING HIT BY A SEMI TRUCK THAT WAS BEHIND ME.  I TURNED THE CAR OFF FOR A FEW MINUTES AND STARTED IT AGAIN AN THE TRANSMISSION LIGHT WAS OFF, BUT I COULD NOT ACCELRATE OVER 20 MILES AN HOUR.  I SLOWLY DROVE TO THE NEAREST EXIT.  THE NEXT DAY I TOOK THE CAR TO A TRANSMISSION REPAIR SHOP AND WAS TOLD THAT I WAS 3 QUARTS LOW ON TRANSMISSION FLUID, AND THAT THE CAUSE WAS THAT THE ACCUMALATOR IN THE TRANSMISSION WAS LEAKING.  THIS CAR IS ONLY 2 YEARS OLD! THIS IS RIDICULOUS!",
        "vin": "4S6CK58W214"
    }
]