[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/14/2003",
        "dateOfIncident": "01/01/2000",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005828,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "1990",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "C BODY",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF THE VEHICLE.  AT 48,000 MILES THE TRANSMISSION FAILED.  IT WAS REPLACED BY THE DEALER, GLENN E. THOMAS DODGE IN SIGNAL HILL.  THEREAFTER, EVERY 15,000 TO 25,000 MILES OR SO, THE TRANSMISSION HAS FAILED, PROBABLY 5 TIMES NOW; THE COMPUTER FOR THE TRANS HAS FAILED TWICE, THE MOTOR COMPUTER FAILED 2 TIMES, THE POWER WINDOWS BROKE OFF THEIR TRACKS, THE SLIDING DOOR JAMMED SHUT AND WOULDN'T ALIGN.      NOW THE PAINT JOB ON MY WHITE 1990 DODGE GRAND CARAVAN (WITH WOOD TRIM) IS PEELING OFF, MOSTLY ON THE ROOF (WHERE IT IS ALMOST COMPLETELY GONE, DOWN TO THE PRIMER, RUSTING THROUGH TO THE ROOF METAL) AND ON THE HOOD AND FRONT QUARTER PANELS.  THE PAINT WAS NOT PROPERLY APPLIED TO THE PRIMER UNDERCOAT OR THE PRIMER WAS NOT PROPERLY APPLIED SO AS TO ADHERE TO THE TOP COLOR COAT.  I HAVE SEEN MANY OTHER CARAVAN'S OF THE SAME MODEL WITH THEIR PAINT COMPLETELY OR PARTIALLY PEELED OFF AS I HAVE DRIVEN AROUND.  IT IS A VERY OBVIOUS DEFECT OF THE PAINT--THERE ARE NO OTHER VEHICLES OUT THERE WITH THIS KIND OF PAINT FLAKING AND PEELING PROBLEM TO THIS EXTENT.  THE PLASTIC COATING ON THE WOOD TRIM IS ALL FLAKING AND PEELING OFF AS WELL.  IT MAKES THE CAR LOOK \"SHAGGY!\"  WHAT A MESS. THIS CAR REALLY NEEDS A PAINT JOB TO BE PAID FOR BY THE MANUFACTURER.  I HAVE PAID OUT THOUSANDS OF DOLLARS FOR TRANSMISSIONS TO BE REPLACED.  I AM ON A THREE-YEAR WARRANTY WITH DODGE FOR THE TRANSMISSION AND ON MY THIRD TRANSMISSION FAILURE UNDER THAT WARRANTY!   THE OVERDRIVE UNIT IS FULLY DEFECTIVE AND THE COMPANY WILL NOT UNDERTAKE TO FIX IT.  THE CAR WILL FAIL AND THE TRANS WILL JUST SPIN WITHOUT ENGAGING ANY FORWARD GEAR OR IT WILL NOT SHIFT INTO THIRD OR OVERDRIVE.  THE SPEED SENSOR UNIT IS ALSO DEFECTIVE AND FREQUENTLY NEEDS TO BE REPLACED.  WHAT A MESS OF A TRANSMISSION!  I HAVE IT REGULARLY SERVICED AND I DON'T DRIVE IT HARD OR ABUSE THE TRANS.  HELP.",
        "vin": "1B4GK54R7LX"
    }
]