[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/27/2002",
        "dateOfIncident": "12/09/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000608,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD MOTOR COMPANY",
                "productModel": "AFTERMARKET TRAILER HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I NOTICED AFTER BUYING NEW TIRES AT LOCAL WAL-MART STORE THAT THEY HAD APPLIED COPPER-BASED ANTI-GALLING LUBRICANT TO THE WHEEL STUDS AND LUG NUTS DURING THE RE-INSTALLATION.  IN DISCUSSIONS WITH LOCAL FORD AND GM SERVICE MANAGERS, BOTH SAID THAT THE MANUFACTURERS SPECIFY THAT THESE ITEMS BE MADE UP WITHOUT LUBRICATION OF ANY KIND.  THE FORD MANAGER SAID THAT THE WHEEL LUG NUTS COULD LOOSEN IN SERVICE IF LUBRICATED.  I MADE WAL MART DISASSEMBLE THE LUG NUTS AND CLEAN OFF THE LUBRICANT, WHICH THEY DID, ALBEIT PERFUNKTORILY.  ANOTHER POTENTIAL PROBLEM WITH THIS IS THAT THE ANTI-GALLING LUBRICANTS PRODUCE VERY LOW FRICTION FACTOR, ABOUT HALF COMPARED TO DRY MAKEUP IF I RECALL SOME PAST TESTING THAT WAS DONE FOR OIL FIELD SERVICE BOLTING.  THIS MEANS THAT IF THE LUG NUTS ARE MADE UP TO THE MANUFACTURERS SPECIFICATION (USUALLY ABOUT 100 FT-LB OF TORQUE), THE ASSEMBLY WITH THE LUBRICANT WILL PRODUCE TWICE THE CLAMPING FORCE EXPECTED IN THE DESIGN.  THIS CAN POTENTIALLY LEAD TO YIELDING OF THE STUD AND/OR WARPAGE OF THE BRAKE DISKS.  THE LATTER WOULD PROBABLY NOT OCCUR IF TORQUE WAS APPLIED IN MULTIPLE STAGES, BUT THIS IS NOT THE CASE.  THE FIRST NUT IS USUALLY MADE UP CLOSE TO THE FULL SPECIFIED TORQUE WITH AN AIR IMPACT WRENCH AND LIMITING ROD.  THE BRAKE DRUM OR DISK COULD EASILY WARP UNDER THE EXCESSIVE CLAMPING FORCE BEFORE AN OPPOSING NUT IS MADE UP TO BALANCE FORCES ACROSS THE BOLT CIRCLE.    THIS IS JUST A BAD PRACTICE REPORTEDLY INSTITUTED AT ALL WAL-MART LOCATIONS, AND PROBABLY AT SAMS WHOLESALE CLUB LOCATIONS AS WELL.  THEIR AIM IS PROBABLY  TO ELIMINATE THE OCCASIONAL GALLING PROBLEM ON THE STUDS WHICH NECESSITATES REPLACING THE GALLED STUD.  FOR THE RECORD, BOTH GM AND FORD DO ENDORSE USE OF SMALL AMOUNTS OF ANTI-GALLING COMPOUNDS, BUT ONLY ON THE CENTER OPENING OF THE WHEEL TO PREVENT CORROSION BINDING OF THIS TIGHT-FITTING OPENING ON THE MATING VEHICLE HUB.    HOPEFULLY, NO ONE WILL HAVE TO LOOSE A WHEEL AT 75 MPH AND DIE BEFORE THIS BAD PRACTICE IS STOPPED.",
        "vin": null
    }
]