[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,AIR BAGS,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/13/2002",
        "dateOfIncident": "08/20/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006532,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1)DRIVER'S SIDE WINDOW HAD DIFFICULTY GOING UP SINCE VEHICLE PURCHASE, HAVE TO PUSH WITH HAND TO ASSIST. 2) JUST A FEW MONTHS AFTER PURCHASE SENSOR BEHIND BRAKE PEDAL FAILED, VEHICLE WOULD SHIFT FROM PARK, REPLACED. 3) AIR BAG CAME ON AND THEN ENGINE LIGHT SOON AFTER, CATALYTIC CONVERTER REPLACED. BOTH WARNING LIGHTS OFF AND REPLACED. 4) HEADLIGHTS ARE CONSTANTLY BLOWING OUT, EVIDENCE OF A SHORT WHEN REPLACED. BURN MARKS, AND EXPOSED WIRING BECAUSE PLASTIC ON CONNECTORS GOT BRITTLE AND CRACKED OFF. 5) AIR BAG LIGHT ON AGAIN, TWO WEEKS LATER ENGINE LIGHT ON. TOLD TWO SENSORS ON MASS AIR FLOW  AND SOME OTHERS ARE MALFUNCTIONING AND NOW BEEN REPLACED. TOLD THERE IS A BROKEN CLOCK SPRING IN STEERING COLUMN ALONG WITH BAD WIRING HARNESS, BOTH AFFECTING AIR BAGS. ALSO, TOLD AIR  BAG IS NOW BAD AND NEEDS TO BE REPLACED BECAUSE OTHER DEFECTIVE COMPONENTS HAVE SHORTED  IGNITER IN AIR BAG OUT. I AM A COLLEGE STUDENT AND CANNOT CONTINUE TO FUND REPAIRS TO THIS VEHICLE. CANNOT SELL EITHER BECAUSE OF THESE PROBLEMS, AND NOW REPUTATION OF BEETLE FOR PROBLEMS. VEHICLE HAS  NEVER BEEN IN AN ACCIDENT, EVEN  SO MUCH AS BUMPED. METICULOUSLY MAINTAINED. DIMS 11 IVOQ ENTRY POSTED AFTER 12/12/02 CUT-OVER TO ARTEMIS----------------770755. *AK   *NLM",
        "vin": "3VWCA21C6XM"
    }
]