[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/19/2002",
        "dateOfIncident": "11/10/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006547,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "SPYDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON MY NEW VEHICLE BEGAN PEELING OFF THE HOOD IN QUARTER-SIZED CHUNKS AS I WAS WASHING IT BY HAND. ALTHOUGH THE DEALER INITIALLY ATTEMPTED TO DENY RESPONSIBILITY, THEY RELUCTANTLY AGREED TO REPAINT HOOD, ACKNOWLEDGING THAT THERE WAS AN \"ADHERENCE ISSUE.\" I DISCOVERED  THROUGH A SOURCE IN THE MITSUBISHI FACTORY THAT THERE WAS  A \"LOT\" OF CARS THAT THEY FAILED TO PLACE  AN E-SEAL ON PRIOR PAINTING. WHEN MY VIN WAS CHECKED, MY SOURCE DISCOVERED THAT IT  WAS ONE OF THE VEHICLES IN THAT \"LOT.\" I WAS TOLD TO EXPECT  FURTHER PAINT ISSUES WITH THE DOORS IN THE NEAR FUTURE BY THIS SOURCE. THIS INFORMATION WAS NOT DISCLOSED TO ME PRIOR TO PURCHASE  OR WHEN I TOOK THE VEHICLE IN FOR REPAIR. IN FACT, IT WAS ONLY MY PERSISTENCE THAT RESULTED IN MY VEHICLE'S HOOD BEING REPAINTED. THE VEHICLES IN THE LOT SHOULD BE RECALLED ! I PAID OVER  $31,000.00 FOR THIS VEHICLE, AND I SHOULD NOT HAVE TO BE CONCERNED ABOUT DEFECTIVE AND/OR SHODDY PAINTING AT THE FACTORY.  PLEASE HELP ME FIND THIS INTERNAL MEMORANDA THAT GOVERNS MY VEHICLE SO I CAN FURTHER PURSUE THIS ISSUE WITH THE MANUFACTURER. OR, IF YOU CAN BE  OF ASSISTANCE IN RECTIFYING THIS COVER-UP., I WOULD BE VERY GRATEFUL. MY DREAM CAR HAS TURNED OUT TO BE A REAL DISAPPOINTMENT.   DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT-OVER TO ARTEMIS--------770771.   *AK   *NLM",
        "vin": "4A3AE75H03E"
    }
]