[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/30/2002",
        "dateOfIncident": "12/30/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000637,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "GRAND CHEROKEE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SAFETY ISSUE:  POWER DOOR LOCKS INOPERABLE.  2000 JEEP GRAND CHEROKEE.  ON THREE (3) SEPERATE OCCASSIONS, WE HAVE HAD TO HAVE THREE (3) SEPERATE ELECTRONIC LOCKING SYSTEMS REPLACED ON THREE (3) SEPERATE DOORS/HATCHES ON THIS VEHICLE.  IN ALL THREE INCIDENTS, THE \"ACTUATOR\" HAS FAILED TO EITHER LOCK AND/OR UNLOCK EACH INDIVIDUALLY EFFECTED DOOR.  ON ONE OCCASSION, WE WERE UNABLE TO EXIT THE DRIVER'S DOOR AT ALL, THUS HAVING TO CLIMB OVER TO THE PASSENGER'S FRONT DOOR TO EXIT.  WHEN WE CONTACT THE MANUFACTUER - EACH TIME - THEY TELL US THAT THESE ARE \"NORMAL WEAR ITEMS\".  AFTER SCANNING YOUR SIGHT, I FIND A TOTAL OF TWENTY-ONE SUCH RELATED COMPLAINTS FOR JEEP GRAND CHEROKEES (NOT ALL YEAR 2000 MODELS) AND FOUR SPECIFICALLY RELATED, YEAR 2000 COMPLAINTS.  TO DESCRIBE THE FAILURE:  THE LOCKING MECHANISM SIMPLY FAILS TO ENGAGE AND/OR DISENGAGE AND MAKES A HIGHER PITCHED, LONGER THAN USUAL, WHINING SOUND - AS IF AN ELECTRICAL MOTOR HAS FAILED.  THE COST OF EACH REPAIR HAS BEEN EQUAL TO OR EXCEEDED $150.00 PER INCIDENT. THE FOLLOWING LISTED INCIDENT DATE (ONLINE SUBMISSION FIELD REQUIRED) REFERS ONLY TO THE LATEST/MOST CURRENT DATE OF REPAIR.  ALL SERVICES FOR SUCH REPAIRS - EACH INCIDENT - WERE OBTAINED AT CAPITOL GRAGE, A JEEP/CHRYSLER DEALER, IN WILLIMANTIC, CONNECICUT. THE VEHICLE WAS ORIGINALLY PURCHASED AT A NOW DEFUNCT, JEEP DEALERSHIP IN MANSFIELD, CONNECTICUT, NAMED CHAMPAGNE JEEP/CHEVEROLET.",
        "vin": "1J4GW48S1YC"
    }
]