[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000638,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VENTURE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY OF 2002, THE HEAT IN OUR 1999 CHEVY VENTURE STOPPED WORKING.  THE VAN HAD AROUND 50 OR SO THOUSAND MILES AT THE TIME.  THE DEALER IN BATON ROUGE ALL-STAR CHEVROLET COULD NOT DIAGNOSE THE PROBLEM AND RECOMMENDED A COOLING-SYSTEM FLUSH AS THE COOLANT LEVEL LOOKED LOW IN THE RESERVOIR.  THIS FLUSH WAS DONE AT ANOTHER SHOP IN TOWN.  THIS DID NOT CORRECT THE PROBLEM AND THIS SHOP RECOMMENDED I GO BACK TO THE DEALER.  THE ENGINE WAS ALSO RUNNING HOT, SO TOOK IT INTO THE DEALER WITH THESE PROBLEMS.  THIS DEALER DID AROUND $1,000 IN REPAIRS INCLUDING A WATER PUMP AND THERMOSTAT.  THE PROBLEM WAS NOT FIXED AS I DROVE THE VAN HOME.  I BROUGHT IT BACK TO THE DEALER THE NEXT DAY AND THEY LOOKED AT IT AND SAID THEY COULD SEE NOTHING WRONG AND WOULD NOT DO ANY MORE WORK.  I THEN TOOK IT TO ANOTHER CHEVY DEALER (BRIAN HARRIS CHEVROLET) IN BATON ROUGE WITH MY PROBLEM.  ULTIMATELY THEY DIAGNOSED THE PROBLEM AS A CLOGGED HEATER CORE DUE TO SLUDGED ANTIFREEZE, AND ALSO A BLOWN HEAD GASKET AND OTHER PROBLEMS WITH THE HEAD.  THEY COMPLETELY FLUSHED THE SYSTEM OF THE SLUDGE AND THAT CORRECTED THE PROBLEM WITH THE HEAT NOT WORKING AND THE TEMPERATURE GUAGE RUNNING HOT.  I HAD TO PAY OVER $500 DURING THE TIME OF TAKING IT BACK AND FORTH TO SHOPS FOR DIAGNOSIS, DEDUCTIBLES AND PARTS AND LABOR NOT COVERED UNDER WARRANTY.  I AM VERY CONCERNED THAT I WILL CONTINUE TO HAVE PROBLEMS DUE TO THIS ANTIFREEZE AND SLUDGE PROBLEM THAT CAUSED THE NEED FOR THE REPAIRS.  I AM ALSO CONCERNED THAT THIS OCCURRED ON A VEHICLE WITH ONLY 50K MILES.",
        "vin": ""
    }
]