[
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "12/30/2002",
        "dateOfIncident": "06/12/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000642,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "WINDSTAR",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:1995 FORD WINDSTAR VIN [XXX]    THIS COMPLAINT RELATES TO DAMAGE INCURRED JUST PRIOR TO AN OFFICIAL RECALL NOTICE FOR COLLAPSE OF THIS VEHICLE'S SUSPENSION SYSTEM AND FORD'S REFUSAL TO REIMBURSE ME FOR THE DAMAGE INCURRED AND REPAIRS PERFORMED.  I HAVE CONTACTED THE DEALERSHIP, CALLED FORD'S CUSTOMER CARE RECALL LINE, AND WRITTEN TO FORD'S CEO WITH NO RESPONSE.  IT IS MY UNDERSTANDING THAT FORD IS OBLIGATED TO PAY FOR ALL REPAIRS WHICH RESULTED FROM A SITUATION UNDER WHICH A RECALL IS DECLARED, EVEN IF THEY WERE INCURRED PRIOR TO THE RECALL ANNOUNCEMENT.  ON JUNE 12, 2001 THE DRIVER FRONT END COLLAPSED AND THE VEHICLE CRASHED TO THE GROUND AND LISTED TO THE LEFT.  THE CAUSE WAS THE FAILURE OF THE FRONT SUSPENSION COILS, WHICH ACTED LIKE A HOOK AND COMPLETELY TORE THROUGH AND SHREDDED THE NEW TIRE I HAD JUST PUT ON THE VEHICLE.  I HAVE PHOTOGRAPHS OF THE INCIDENT.    THE FORD DEALERSHIP WAS BOOKED SEVERAL DAYS OUT SO I TOOK THE VEHICLE TO ANOTHER FACILITY, BOCA TIRE WHO IDENTIFIED THE PROBLEM AND SUGGESTED THAT WE HAVE BOTH THE FRONT AND REAR SYSTEMS FIXED FOR SAFETY.    ON AUGUST 24, 2001, THE STARTER FAILED AND WE WERE ADVISED IT IS LIKELY THIS WAS RELATED TO THE SUSPENSION CRASH.  WE SUBSEQUENTLY HAD SUSPECTED TRANSMISSION PROBLEMS.    SHORTLY AFTER THE INITIAL INCIDENT WE  RECEIVED A NOTICE OF AN EXTENDED COVERAGE ANNOUNCEMENT FOR THE FRONT COIL SPRINGS OF THE 1995 WINDSTAR.  I CONTACTED THE CUSTOMER RELATIONSHIP CENTER AND EXPLAINED ALL OF THESE ISSUES AND PROBLEMS AND THAT IT SEEMS HIGHLY UNLIKELY THAT ALL OF THESE PROBLEMS ARE NOT RELATED TO THE INITIAL FAILURE OF THE COIL SPRINGS AND THE COLLAPSE OF THE FRONT END.  WE INCURRED $1,380 IN REPAIRS.  WE TURNED IN MY REPAIR RECEIPTS FOR \"FORD REIMBURSEMENT REVIEW\"  AND RECEIVED A VERY SMALL AMOUNT WHICH NO ONE AT FORD COULD EXPLAIN (DID NOT JUST RELATE TO FRONT END ONLY REPAIRS, ETC).    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2FMDA5140SB"
    }
]