[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2002",
        "dateOfIncident": "12/27/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000662,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED THIS VEHICLE FROM A PRIVATE OWNER WE KNEW VERY WELL AND ALL REGULAR MAINTANCE HAD BEEN PERFORMED ACCORDING TO FORD RECOMENDATIONS.    IN 2001 WITH ONLY 30,000 MILES THE TRANSMISSION HAD TO HAVE O-RINGS REPLACED IN TRANSMISSION BECAUSE OF PROBLEMS WITH THE AUTOMATIC SHIFTING. WE HAD THE TRANSMISSION FLUSHED JUST PRIOR TO THE FOLLOWING INCIDENT AS RECOMMENDED BY THE FORD OWNERS MANUAL.  IN JUNE 2002 WHILE TOWING A TRAILER (WEIGHTS WITHIN LIMITS OF VEHICLE REQUIREMENTS) WE EXPERIENCE A COMPLETE LOSS OF THE TRANSMISSION.  ENGINE WOULD REV WHILE IN GEAR BUT ACTED LIKE IN NEUTRAL.  TRANSMISSION FLUID WAS SPEWING OUT FROM UNDER THE VEHICLE AND SMOKING.  WE PULLED SAFELY TO THE SIDE OF THE RODE BUT HAD TO BE TOWED TO THE NEXT AVAILABLE TOWN.  THIS TRANSMISSION WAS EQUIPPED WITH AN AUXILLARY TRANSMISSION COOLER.  THERE IS ONLY 58,000 MILES ON THE VEHICLE, LESS THAN 30,000 SINCE THE LAST PROBLEM.  WE WERE INFORMED BY THE SERVICE TECH THAT THE TRANSMISSION WOULD NEITHER DRIVE FORWARD OR IN REVERSE AND HAD TO BE REPLACED.  THE TRANSMISSION WAS REPLACED WITH A FORD REBUILT TRANSMISSION.  WITH IN APPROX. 1-2 MONTHS AFTER REPLACEMENT THE SERVICE ENGINE LIGHT CAME ON AND THE SERVICE TECH INFORMED US THAT IT WAS A TRANSMISSION CODE.  AFTER RESETTING THE LIGHT AND WAITING FOR AN APPOINTMENT WITH THE \"TRANSMISSION PERSON\" AT THE DEALERSHIP THE LIGHT DID NOT COME BACK ON AN THE SERVICE TECH ADVISED TO 'WAIT AND SEE'.  IN DEC. 2002  WHILE DRIVING IN THE MOUNTAINS WITH 4 ADULTS AND 3 CHILDREN IN THE CAR NOT PULLING A TRAILER, THE SERVICE ENGINE LIGHT CAME ON AND THE TRANSMISSION WAS SHIFTING \"HARD\" AND AT INAPPROPRIATE TIMES WITH VARYIING RPMS AND SPEEDS.  AFTER WAITING THE WEEKEND FOR THE APPOINTMENT TIME, THE SERVICE TECH INFORMED US THAT THE SOLINOID PACK IN THE TRANSMISSION NEEDED REPLACED.  AT THIS POINT THERE IS ONLY 8,000MILES ON THE 2ND TRANSMISSION. THE SOLINOID PACK WAS REPLACED AND CURRENTLY THE VEHICLE HAS NOT HAD ANYMORE PROBLEMS.",
        "vin": "1FMRU17L7XL"
    }
]