[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2002",
        "dateOfIncident": "08/29/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007058,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FUSES ON THE COOLING SYSTEM FANS FAILED WITHIN THE SAME DRIVE.  I CHECKED THE ONE MARKED IN THE 1998 LEGACY OWNERS MANUAL FOR THE COOLING FAN AND IT WAS NUMBER 13 IN PAGE 11-7.  I CHECKED FOR THE OTHER ONE AND IT WAS UNDER THE HOOD AND IT WAS NIGHT TIME AND I DIDN'T HAVE A FLASHLIGHT OR LIGHT.  I COULD COUNT WHERE THE FUSE WAS AND IN THE BOOK IT STATED IT WAS # 25.  I PULLED THE FUSE 25 AND IT CHECKED OUT GOOD AND I PUT IT BACK IN THE SLOT.  HOWEVER, I CHECKED IN THE DAY TIME UNDER THE FUSE COVER UNDER THE HOOD AND IT INDICATES THAT FUSE #22 IS THE CORRECT ONE.  I CHECKED THAT AND IT WAS BLOWN.  I NOTIFIED SUBARU A MONTH AGO AND HAVE NOT HEARD BACK FROM THEM ABOUT THIS ISSUE.  IT SEEMS THOUGH THAT THERE SHOULD BE A CHANGE IN THE MANUAL AS IT WOULD HAVE PROBABLY MADE A DIFFERENCE IN THIS SITUATION.  THE SAFETY ISSUE IS THAT WITH BOTH FAN FUSES BLOWN THE VEHICLE CAN STOP DUE TO AN OVERHEAT AT AN UNEXPECTED TIME AND CAUSE AND ENGINE FAILURE THAT CAN LEAD TO AN ACCIDENT.  THE NUMBER 25 IS ACTUALLY A SPARE FUSE AREA AND DOES NOT HAVE AN ELECTRICAL CONNECTION BUT THE NUMBER 22 IS A DIFFERENT CONFIGURATION WITH A VEHICLE THAT HAS AN ACCESSORY POWER SOCKET IN SOME VEHICLE.  I AM NOT SURE YOU WOULD CLASSIFY THIS AS A SAFETY PROBLEM BUT I AM INFORMING YOU IF YOU DO.     *NLM      **DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT-OVER TO ARTEMIS*768183",
        "vin": "2S3BG6854W7"
    }
]