[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/02/2003",
        "dateOfIncident": "12/09/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000691,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 DODGE GRAND CARAVAN ES WITH STOCK 17 INCH WHEELS. POWER STEERING GROANS AND VIBRATION IS FELT IN THE STEERING WHEEL AT LOW SPEED. I ORIGINALLY THOUGHT IT REQUIRED NEW BRAKES (DUE TO MILLAGE BEING 42,205)  AND BROUGHT VEHICLE INTO A REPAIR SHOP FOR THAT PURPOSE.  BRAKES WERE DETERMINED TO NOT NEED SERVICING YET. THEN BROUGHT CAR TO LOCAL DODGE DEALER (WHERE PURCHASED) FOR INVESTIGATION.  THE DEALER CHARGED ME $60.00 TO TELL ME THAT IT HAS A TSB  (19-001-02) ON THE POWER STEERING AND REFUSES TO COVER COST OF CORRECTION DUE TO CAR BEING 6,000 MILES OUT OF BASIC WARRANTY.  I CLAIM THIS IS A DESIGN DEFECT AS DODGE WANTS TO REPLACE POWER STEERING RESERVOIR AND POWER STEERING RETURN LINE AS WELL AS CHANGE THE FLUID NORMALLY IN THE RESERVOIR FROM POWER STEERING TO ATF FLUID!!! I CALLED THE CHRYSLER CONSUMER LINE AND ONLY GOT THEM TO AGREE TO SPLIT THE COST (THEY PAY FOR PARTS AND I PAY FOR LABOR).THEY WERE NOT SYMPATHETIC AT ALL BECAUSE THE CAR WAS OUT OF THE BASIC WARRANTY WINDOW. CONSUMER LINE PERSON WENT ON TO SAY THAT IT WOULD BE MY FAULT IF POWER STEERING FAILED FOR NOT ADDRESSING THE PROBLEM.  I CALLED THE DEALER TO DO THE CORRECTIONS AND WAS TOLD THAT THE PARTS WERE NOT AVAILABLE AND I WOULD GET A CALL WHEN THEY GET A CONFIRMATION FOR THE PARTS!.  I FEEL THAT CHRYLSLER IS NOT ADMITTING TO A DESIGN DEFECT AND FORCING THE CONSUMER TO PAY FOR THEIR PROBLEM WHICH COULD LEAD TO SERIOUS INJURY IF THE POWER STEERING FAILED.",
        "vin": "2B8GP54L01R"
    }
]