[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/13/2002",
        "dateOfIncident": "12/05/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000007,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CAMRY",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "TOYO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED A TOYOTA CAMRY 2002 SE IN DECEMBER OF 2001AND DISCOVERED AFTER DRIVING TO AND FROM WORK DURING A SNOW STORM 12/5/02 THAT THE CAR WAS EQUIPED  WITHOUT ALL SEASON TIRES. I NARROWLY AVOIDED SEVERAL ACCIDENTS THAT DAY, AS DID OTHERS I AM SURE.  HOWEVER, I DISCOVERED WHILE SPEAKING WITH THE TIRE MANUFACTURER(TOYO) THAT THE TIRES ARE CONSIDERED \"SUMMER\" TIRES AND ARE NOT MADE FOR SNOW AND/OR ICE.  THEY STATED THE TYPE OF TIRE PLACED ON THE CAR IS DETERMINED BY THE CAR MANUFACTURER NOT TOYO.  I CONTACTED THE DEALER AS I AM EXTREMELY CONCERNED ABOUT OTHER PEOPLE PURCHASING CAMRYS WITHOUT KNOWING THEY NEED TO PURCHASE SNOW TIRES OR ALL SEASON TIRES.  THEY APPARENTLY ARE NOT AS CONCERNED AS I AS THEY STATED THEY WOULD NOT DEBATE ON WHAT I WAS TOLD AT THE TIME OF THE SALE AND THE ONLY THING THEY COULD DO FOR ME IS TO ORDER REPLACEMENT TIRES AT A DISCOUNT.  I THEN PROCEEDED TO CALL THE TIRE MANUFACTURER BACK TO EXPRESS MY CONCERN AND WAS TOLD THEY WOULD PAY 75% OF THE COST OF THE SAME TIRE (TOYO, J33, P21560R 16 94V), TO REPLACE THE EXISTING TIRES.  THEY STATED I COULD REPLACE THE TIRES WITH ANY MAKE OF MY CHOICE. IT WAS THEIR PREFERENCE THAT I USE A LOCAL COMPANY THAT SELLS TOYO TIRES. I STOPPED TO ORDER REPLACEMENT TIRES AND FOUND AFTER INSPECTION, THE TIRES ARE BARE DOWN THE CENTER AND ARE WORN DOWN TO THE WEARBARS. SO NOT ONLY AM I DRIVING, WITHOUT KNOWLEDGE, A CAR THAT DOES NOT HAVE ANY TYPE OF TREAD FOR SNOW/ICE I AM DRIVING WITH MINIMAL TREAD. I UNDERSTAND THE TIRES ARE  HIGH PERFORMANCE TIRES, HOWEVER I DO NOT FEEL THEY SHOULD HAVE WORN IN THE MANNER THEY DID AFTER 14000 MILES.  I HAVE SEVERAL CONCERNS, ONE BEING WITH TOYOTA AND THE FACT THAT THE DEALER OR DEALERS ARE NOT INFORMING THE BUYER OF THE NEED TO PURCHASE ALL SEASON OR SNOW TIRES AT THE TIME OF THE SALE.  HOW MANY CONSUMERS OR INNOCENT VICTIMS WILL BE OR HAVE BEEN INJURED IN ACCIDENTS DUE TO THIS SAME ISSUE. SECONDLY, THE TIRE MANUFACTURER FOR PROCUDING WHAT APPEARS TO ME DEFECTIVE TIRES.",
        "vin": ""
    }
]