[
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "01/03/2003",
        "dateOfIncident": "12/31/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000697,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "GRAND CARAVAN",
                "productYear": "1996",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "CHILD LOVE SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "INTERNAL MECHANICAL FAILURE OF INTEGRATED CHILD SAFETY SEAT, RIGHT HAND SIDE. THE CABLE ASSEMBLY IN THE SEAT MODULE HAS FAILED. THIS CABLE  ASSEMBLY LOCKS THE RETRACTABLE SHOULDER BELTS. THE CABLE HOOKS DIRECTLY TO THE LATCH PLATE AND WHEN THE BELT BUCKLE IS CONNECTED TO THE LATCH PLATE THE PLATE'S FORWARD MOVEMENT PULLS THE CABLE CAUSING THE SHOULDER BELT'S RETRACTOR TO LOCK. THIS CABLE CONNECTION HAS SEPARATED FROM THE LATCH PLATE (CABLE END IS ALSO FRAYED WITH THREE STRANDS LEFT ON IT'S END), RENDERING THE SHOULDER BELTS, RETRACTOR ASSEMBLY UNLOCKABLE. THIS IS A VERY UNSAFE CONDITION FOR ANY CHILDS LIFE IF VEHICLE IS IN AN ACCIDENT AND SHOULDER BELTS DO NOT RESTRAIN THE CHILD IN THE SEAT LIKE IS SUPOSSED TO.    LEFT HAND ICSS ALSO HAS A PROBLEM WITH THE SEAT CUSHION PIVOT FRAME WHICH IS TWISTED AT LEFT ATTACHED POINT.    DEALER SAYS THERE IS NO WARRANTY COVERAGE. THAT THE SEAT MODULES NEED TO BE REPLACED AND COSTS ON AN ESTIMATE OF  $1,300+.  I, REFUSE TO PAY ANY AMOUNT WHEN MY GUT FEELING IS THAT CHRYSLER HAS PUT OUT THESE ICSS WHICH ARE HAVING THE SAME PROBLEM I'M HAVING NOW FOR A FEW YEARS NOW.     CHRYSLER ON 01/02/03 TOLD ME THAT IF I PAY THE FIRST $800+ THAT THEY WOULD PAY THE REMAINING DIFFERENCE. NOW, TO ME THIS IS LIKE SAYING YES, WE KNOW WE HAVE PROBLEMS WITH THESE ICSS SO WE ARE WILLING TO HELP.     WELL, AFTER READING SO MANY LIKE COMPLAINTS ABOUT THESE ICSS, I FEEL THAT CHRYSLER SHOULD REALIZE THAT EVERY TIME A CHILD IS PLACED IN THEIR \"CHRYSLER\" ICSS THAT THE CHILD'S LIFE IS IN THEIR HANDS. THEY NEED TO OWN-UP TO FLAWS OF ENGINEERING AND FIX THESE SEATS SO THAT WE THE CUSTOMER CAN TRUST IN THEIR PRODUCT..    ANY INFORMATION YOU COULD PROVIDE, I WOULD APPRECIATE IT.      RESPECTFULLY,    SEVERINO L. RODRIGUEZ",
        "vin": "2B4GP4433TR"
    }
]