[
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "01/05/2003",
        "dateOfIncident": "01/20/2001",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000735,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "MONACO COACH",
                "productModel": "DIPLOMAT LE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "UNISTEEL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "3RD UPDATE TO OD ID #8005766.  THE GOODYEAR PRODUCT SERVICE BULLETIN (PSB 2002-20), DATED JULY 10, 2002, WAS FOR THE 1999-2001 40 FT. MONACO WINDSOR MOTOR HOME WITH 275/70R22.5 LR H TIRES.  OUR 2001 40 FT. DIPLOMATE LE HAS THE SAME TIRES AND WEIGHS APPROXIMATELY THE SAME.  THE WHEELBASE ON THE 40 FT. WINDSOR IS 270 INCHES, THE WHEELBASE ON THE DIPLOMAT LE IS 256 INCHES, WHICH MAKES IT 12 INCHES SHORTER THAN THE WINDSOR AND WITH MORE WEIGHT TO THE REAR OF THE MOTOR HOME, WHICH COLD BE ONE OF THE CAUSES OF THE STEERING PROBLEM.  I TALKED WITH AN ENGINEER FROM GOODYEAR AND HE SAID OUR MOTOR HOME, WITH 125 LBS. OF AIR IN THE TIRES AND RUNNING AT FREEWAY SPEEDS IN 90+ DEGREE WEATHER, WOULD BE COMPARABLE TO THE \"FIRESTONE FORD ROLLOVER\" PROBLEM, WITH THIS SIZE TIRE AND AIR PRESSURE.  (HE ALSO INDICATED HE WOULD HAVE TO DENY THIS SHOULD HE BE ASKED BY ANY SAFETY AGENCY).  GOODYEAR DOES HAVE A TIRE WHICH IS A SIZE BETWEEN WHAT WE CURRENTLY HAVE AND WHAT THEY ARE PUTTING ON THE WINDSOR (WHICH IS TOO LARGE FOR OUR MOTOR HOME).  I TALKED WITH AN ENGINEER FROM MICHELIN AND HE SAID THE MICHELIN 275/80R22X2A2 WOULD BE A LOT SAFER TIRE ON THE VEHICLE.  THAT TIRE IS 41 INCHES  IN DIAMETER AS COMPARED TO OUR 37 INCHES IN DIAMETER, AND WOULD CAUSE THE VEHICLE TO STEER BETTER.  WE'VE MET A LOT OF PEOPLE AT MONACO RALLYS WHO HAVE HAD SIMILAR PROBLEMS WITH STEERING AND TIRES, BUT THEY SAID MONACO TOLD THEM IF THEY REPORTED ANY PROBLEMS TO THE GOVERNMENT, THEY WOULD NO LONGER TRY TO HELP THEM.  WEIGHT & MEASUREMENT CHARTS FOR MONACO COACHES CAN BE FOUND AT HTTP://WWW.MONACOCOACH.COM.  MONACO ONLY MADE THE DIPLOMAT LE IN 2001 AND 2002 AND THEN STOPPED.   WE FEEL THIS HAD TO DO WITH THE POOR QUALITY OF THE PRODUCT ALTHOUGH THEY DENY THIS.",
        "vin": "1RF12061212"
    }
]