[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2003",
        "dateOfIncident": "09/16/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007700,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 1500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MAJOR GUARD WARRANTY.9/16/02  NEW BATTERY & BULB REPLACED. 10/5/02 REPLACED THE BATTERY. 10/16/02 BATTERY WENT DEAD. LOOSE GROUND CABLE ON ENGINE BLOCK. BATTERY REPLACED. 11/4/02 BATTERY DEAD. VOLT GAUGE FLUXUATING AND BURN SMELL. ALTERNATOR AND ALTERNATOR CONNECTER REPLACED. 11/11/02, BURNT SMELL AND BATTERY IS DEAD. REPLACE BCM & REPROGRAM BCM AND BATTERY. 12/19/02 PCM NOT COMMANDING ALTERNATOR TO CHARGE BATTERY. AT. IDLE ONE MINUTE THE ALTERNATOR IS PUTTING OUT 13 AMPS AND THE NEXT 10 AMPS. REPLACED PCM & REPROGRAM AND REPLACED BATTERY. REPLACED PASSLOCK SENSOR CASE.  PASSLOCK SENSOR READS INVALID WHEN KEY UP MOST OF THE TIME AND VOLTAGE DOESN'T DROP OFF OF 5 VOLT.  IGNITION SWITCH NOT READING PASSLOCK RESISTANCE CORRECTLY. REPLACED IGNITION SWITCH. 1/24/03  ALTERNATOR ONLY PUTTING OUT 58.6 AMPS. REPLACED ALTERNATOR AND BATTERY AND BATTERY INSULATOR. REPLACED LEFT TAILIGHT BULB.BCM NOT POWERING DOWN AT TIMES PER GM REGIONAL TECH.BILL YODE,MINNESOTA DIAGNOSIS. BCM REPLACED & REPROGRAMED. THE GENERATOR VOLTAGE WAS FLUXUATING. 12 HZ ELECTRICAL FEEDBACK FROM THE CHARGING CIRCUIT AFFECTING THE GAUGES. REWIRED CONNECTOR PER BULLETIN # 02-07-30-030. MAKES THE ALTERNATOR EXTERNALLY REGULATED BY PCM INSTEAD OF INTERNALLY REGULATED BY THE REGULATOR. LO# N8505. BILL YODER WAS WORKING ON THE VEHICLE FOR TWO DAYS. 2/3/03. TRANSMISSION NOT SHIFTING PROPERLY, HEADLIGHTS DIM.   SINCE 9/02, CONTACTED JAMES CLARK CUSTOMER RELATIONSHIP MANAGER WITH CHEVROLET DIVISION SEVERAL TIMES, BUT WILL NOT ANSWER MY PHONE CALLS. CONTACTED BBB AND THEY WOULD NOT LOOK INTO THE CASE, AND WOULD NOT RETURN MY CALLS.DATED BACK 1/28/00  HOOD LAMP  REPLACED. 11/13/00 THE POWERTRAIN CONTROLLER REPROGRAM, VEHICLE STALLED,DASH LIGHTS ON. FUEL GAUGE RECEIVING DIFFERNET READINGS. 5/7/01 HOOD LAMP, & BOTH DAYTIME RUNNING LIGHT BULBS REPLACED. 1/16/02  HOOD LAMP REPLACED. 1/18/02 REMOTE CD PLAYER REPLACED. 5/6/02 LEFT FRONT DOOR & LEFT REAR SPEAKERS REPLACED.",
        "vin": "2GCEK19TXX1"
    }
]