[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/05/2003",
        "dateOfIncident": "11/11/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GOODYEAR",
                "productYear": "1982",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BAD SET OF TIRES. I BOUGHT THIS CAR NEW AND HAVE BEEN HAVING PROBLEMS WITH IT MAKING A NOISE. I AM A WOMAN SO I THOUGHT IT WAS COMING FROM THE REAREND OF THE CAR. I KEPT TAKING IT IN ANDHAVING IT CHECKED AND THE DEALERS SAID IT WASN'T THE REAR END OF THE CAR. FINALLY THEY FOUND WHAT WAS MAKING THE NOISE, THE TIRES HAVE BUMPS AND LUMPS ON THEM, THE TIRES AREN'T EVEN ROUND.I HAVE TRIED SINCE NOVEMBER TO GET GM TO HONOR THE WARRENTY ON THE CAR AND REPLACE THE TIRES AND HAVE RECIEVED NOTHING BUT A RUN AROUND. THEY WERE SUPPOSE TO LET ME KNOW SOMETHING DEC. 21ST BUT I HAVE NOT HEARD ANYTHING FROM THEM. THE TIRES ARE NOT SAFE AND WERE NOT ANY GOOD TO BEGIN WITH. YOU CANNOT ROTATE THE TIRES AND THEY ARE SUPPOSE TO BE RATED FOR TOP SPEEDS AND GO FOR A 100 THOUSAND MILES. I AM SACRED TO DRIVE ANYWHERE ON THE TIRES AND I DON'T BELIEVE I SHOULD HAVE TO SPEND 2 THOUSAND DOLLARS TO REPLACE THE TIRES WHEN THEY WEREN'T ANY GOOD TO BEGIN WITH. I HAVE ALREADY PAID FOR TIRES WHEN I BOUGHT THE CAR AND THEY SHOULD HAVE BEEN GOOD.I HAVE BEEN TRYNG TO FIND OUT WHAT THE PROBLEM WAS FOR A YEAR BUT THEY DIDN'T FIND IT UNTIL THIS PAST NOV. THIS IS WHEN I CONTACTED GM. I DON'T WANT TO HAVE A WRECK BECAUSE OF THESE TIRES AND I CAN'T AFFORD ANOTHER CAR AT THIS TIME. I LOVE THE CAR BUT I WANT SOME DEPENDABLE TIRES ON IT. I REMEMBER THE PROBLEMS WITH THE FIRESTONE TIRES CAUSING WRECKS.THESE TIRES ARE GOODYEAR RUN FLAT TIRES 18 INCH IN THE REAR AND 17 IN THE FRONT. THE CAR IS UNDER WARRENTY, CAN YOU HELP ME GET THE CHEVY DIVISON TO HONOR IT?",
        "vin": "1G1YY22GX15"
    }
]