[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/18/2003",
        "dateOfIncident": "12/15/2002",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007707,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "PASSPORT",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS THAT CONTINUE TO EXIST ARE AS FOLLOWS:     1- MILES PER GALLON ARE FAR BELOW WHAT WAS INDICATED.  IN SUCH A SPIRALING COST PER GALLON ENVIRONMENT, USAGE OF GAS IT 30% TO 50% GREATER THAN THE MANUFACTURER SAYS.  I BELIEVE THIS IS DECEPTIVE     2- THE \"ENGINE WARNING LIGHT\" HAS GONE ON SEVERAL TIMES.  THIS LAST TIME THE HONDA DEALER SAYS IT IS A SPECIAL \"BACKORDERED\" ITEM THAT MAY FIX BOTH THE MPG ISSUE AS WELL AS THE \"WARNING\" ISSUE.  THE QUESTION THAT COULD NOT BE ANSWERED WAS, IT IS HARMFUL TO THE CAR OR A DANGER TO ME DRIVING THE CAR.    3- DURING A RECENT ICE STORM MY CAR BUMPED A TELEPHONE POLE AND IT SHATTERED THE BUMPER.  THE SPEED COULD NOT HAVE EXCEEDED 2 TO 3 MPH.  THE ENTIRE BUMBER HAS TO BE REPLACED DUE TO THE EXTENSIVENESS OF THE DAMAGE....COST ~$1000.00.    4- UPON EVALUATING THE ABOVE ISSUE THE REPAIR SPECIALIST (AN INDEPENDENT CAR REPAIR PERSON) ASKED IF I KNEW THAT MY VEHICLE WAS NOT A HONDA BUT AN ISUZU.  I WAS NOT MADE AWARE OF THIS DURING MY PURCHASE!!!  AN ISSUE I CONSIDER TO BE DECEPTIVE AS THIS WILL CONSTITURE MY FOURTH OR FIFTH \"HONDA\".  I WAS LED TO BELIEVE I WAS, AGAIN, PURCHASING A \"HONDA\".  NOT HAPPY ABOUT THAT.  WHAT CAN YOU DO TO HELP ME WITH THE ABOVE ISSUES.  MY WARNING LIGHT HAS BEEN ON FOR ALMOST 3 WEEKS NOW SINCE I TOOK IT TO THE DEALER.  IS THIS TOO LONG AND WHAT IS HAPPENING TO THE ENGINE OF MY CAR?  THANKS FOR YOUR ASSISTANCE!  RAY VAITSAS  1000 PEBBLE DRIVE  GREENSBORO, NC 27410",
        "vin": "4S6DM58W114"
    }
]