[
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/18/2003",
        "dateOfIncident": "09/01/2001",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007721,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "TOWN AND COUNTRY",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "RUNNING BOARD KIT",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "VEHICLE HAS HAD NUMEROUS PROBLEMS. BRAKE PROBLEMS, W/A VIBRATING/SHAKING OF  FRONT OF VEHICLE UPON BRAKING. WAS FIXED BY DEALER TWICE. FRONT HEATED SEATS  HAVE STOPPED WORKING: TWICE ON DRIVER SIDE. DEALER FIXED. NOW ON PASSENGER SIDE,  DEALER WILL NOT FIX UNDER EXTENDED WARRANTY. COST IS EXPENSIVE TO FIX.   ENGINE NOISE PROBLEMS - LOUD WHINING, WITH ROUGH IDLING. HAPPENED W/IN FIRST COUPLE OF MONTH OF OWNERSHIP, DEALER THOUGHT IT WAS THE FAN. REPLACED FAN PARTS. STARTED W/NOISE AND ROUGH-IDYLING AGAIN W/IN A COUPLE OF MONTHS, DEALER COULDN'T FIGURE IT OUT. WENT IN FOR THIRD TIME, DEALER SAID IT WAS THE STEERING FLUID RESEVOIR. DEALER MADE A \"MODIFICATION\" TO THE FLUID RESEVOIR. NOISE W/ROUGH IDYLLING CAME BACK AGAIN A FEW MONTHS AGO, DEALER SAID IT WAS A HOSE. REPLACED HOSE. PROBLEM IS NOW COMING BACK AGAIN, DEALER IS NOT SURE WHAT IT IS, CURRENTLY PROBLEM IS INTERMITTEN, DEALER CAN'T FIND NOISE UPON CHECKING, NOISE IS MOST APPARENT UPON PERIODS @ HIGHER RATES OF SPEED, DEALER WILL NOT DRIVE AT HIGHER RATE OF SPEED TO TEST.  PASSENGER SLIDER DOOR HAS PROBLEM SHIFTING FROM AUTOMATIC MODE TO MANUAL MODE:  STAYS IN AUTOMATIC MODE WHEN PERSON TRIES TO MANUALLY OPEN. DEALER WILL NOT FIX UNDER EXTENDED WARRANTY. COST TO FIX IS EXPENSIVE.  AIR-CONDITIONER COMPRESSOR IN FOR THIRD REPAIR. AIR-CONDITIONER HAD  PRESSURE PROBLEMS, NO COLD AIR COMING OUT, ONLY HOT AIR. WENT TO DEALER TWICE TO BE REPAIRED.  DEALER TOLD US THIS IS A COMMON PROBLEM IN WARMER-CLIMATE AREAS, AND PREPARE TO GET USED TO COLD AIR NOT ALWAYS BEING COLD, DEPENDING ON THE HEAT OUTSIDE. THIS WAS NOT AN ACCEPTABLE RESPONSE TO ME. DEALER FINALLY FIXED PROBLEM. NOW COMPRESSOR HAS GONE OUT. DEALER IS  CURRENTLY  CHECKING PROBLEM.  ALL REPAIRS HAVE BEEN DONE BY NORM REEVES CHRYSLER DODGE IN TEMECULA, CA  UNTIL THE A/C COMPRESSOR PROBLEM. THIS IS BEING DONE AT A DIFFERENT DEALER, BECAUSE I HAVE NOT BEEN HAPPY WITH NORM REEVES' SERVICE.",
        "vin": "2C8GP64L31R"
    }
]