[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/18/2003",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007723,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "626",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 95 MAZDA 626 W/109K MILES ON IT.  I AM RELIGIOUS ABOUT THE MAINTENANCE, OIL CHANGES EVER 3K, FUEL FILTER, WHATEVER MY CAR NEEDS- IT GETS.  A COUPLE OF WEEKS AGO I NOTICED SOMETHING INTERMITTENT HAPPENING W/MY CAR.  I'M NOT A MECHANICAL TYPE, BUT I KNOW THAT IF I CAN'T REPRODUCE THE PROBLEM FOR MY MECHANICE CHANCES ARE HE CAN'T KNOW WHAT IS WRONG TO FIX.  LAST WEEKEND 2/15/03, I WAS OUT RUNNING ERRANDS AND IT WAS NOT JUST AN INTERMITTENT PROBLEM ANYMORE.  MY TRANSMISSION FELT LIKE IT WAS SLIPPING.  I CALLED MY MECHANIC, HE REFERRED ME TO A TRANSMISSION SPECIALIST.  HE SAYS THESE TYPES OF CARS (MAZDA 626) ARE KNOWN FOR THESE PROBLEMS.  AFTER DOING SOME RESEARCH ON THE INTERNET, IT HAS COME TO MY ATTENTION THAT THERE ARE HUNDREDS OF OTHER CONSUMERS OUT THERE WHO HAVE HAD FAILED TRANSMISSIONS EVEN WAY EARLIER THAN ME WHICH INDICATES TO ME THERE IS A NEED FOR A MANUFACTURE RECALL.  I ALSO SAW THERE WERE MANY PEOPLE WHO HAD PROBLEMS WITH THEIR OXYGEN SENSORS, AS DID I.  I HAVE CONTACTED A LAW FIRM IN MICHIGAN WHO I BELIEVE MAY BE FILING A CLASS ACTION LAWSUIT AGAINST MAZDA AND/OR FORD AND DEMANDING A RECALL ON THESE TRANSMISSIONS.  HERE IS THEIR CONTACT INFORMATION  LAW-FIRM OF ROY, SHECTER, AND VOCHT, P.C. IN MICHIGAN - THEY CAN BE REACHED AT (248) 540-7660 FAX AT (248) 540-0321.  ALSO, HERE IS THE INTERNET LINK FOR ALL THE PEOPLE I FOUND COMPLAINING ABOUT THEIR MAZDA 626.  I WONDER HOW MANY PEOPLE THERE REALLY ARE, THAT DON'T KNOW ABOUT THIS FORUM.  HTTP://WWW.CARTRACKERS.COM/FORUMS/LIVE/YOURLEMON/189.HTML",
        "vin": "1YVGE22C4S5"
    }
]