[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/18/2003",
        "dateOfIncident": "03/11/2002",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007740,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "626",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 98 MAZDA 626, I NOTICED SLIPPAGE OF GEARS (IN THE TRANSMISSION).   I WOULD STEP ON MY ACCELERATOR, AND NOTHING WOULD HAPPEN.  I SPOKE WITH MAZDA, AND WAS TOLD THAT SINCE MY MILEAGE IS APPROXIMATELY 100,000, THIS IS NOT UNDER WARRANTY.  I REPLACED THE TRANSMISSION, AT ANOTHER ASE-CERTIFIED FACILITY, FOR $3018.00.  THE MECHANIC ADVISED ME THAT THIS PROBLEM WAS \"TYPICAL\" WITH THE 98 MAZDA'S.  APPARENTLY, MAZDA HAD A JOINT-VENTURE WITH FORD.  THE TRANSMISSION USED FOR THE 98 MAZDA 626 WAS THE SAME TRANSMISSION USED ON THE FORD PROBE.  (FUNNY, YOU DON'T SEE ANY OF THOSE AROUND NOW).  I WAS GIVEN A 12-MONTH, 12,000 MILE WARRANTY.  IT IS ONE YEAR LATER, AND AGAIN THE TRANSMISSION IS INOPERABLE.  DUE TO THE NUMEROUS OTHER COMPLAINTS OF MAZDA TRANSMISSIONS, I ASKED THE MAZDA DEALER IF THE TRANSMISSION IS UNDER RECALL.  THE MAZDA DEALERSHIP STATED THAT THE TRANSMISSION IS NOT UNDER RECALL.   I FIND IT APPAULING THAT A BUSINESS CAN NOT STAND IN GOOD FAITH WITH ITS PRODUCT, ESPECIALLY, IF NUMEROUS DISCREPANCIES ARE NOTED FOR THE RECORD.  HOW MANY OTHER MAZDA OWNERS ARE HAVING THIS PROBLEM, BUT ARE NOT FILING COMPLAINTS?  I BELIEVE MANY.   IF YOU OWN A MAZDA AND HAVE A PROBLEM, ESPECIALLY WITH THE TRANSMISSION, PLEASE FILE A COMPLAINT.  I AM IN THE INSURANCE INDUSTRY, AND HAVE MY PROPERTY AND CASUALTY LICENSE.  WHEN I CONSULT FRIENDS, NEIGHBORS AND RELATIVES ABOUT AUTOMOBILES, I URGE THEM, NO I BEG THEM, NOT TO EVER PURCHASE A MAZDA, BECAUSE THEY DO NOT STAND BY THEIR NAME.",
        "vin": "1YVGF22C9W5"
    }
]