[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/19/2003",
        "dateOfIncident": "01/31/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007777,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 FORD FOCUS THAT I PURCHASED LAST JUNE. I HAD WENT INTO THE WALMART , AND WHEN I CAME OUT I SAW A CAR WHICH I THOUGHT WAS MINE BUT IT DIDN'T SEEM LIKE I HAD PARKED THAT CLOSE TO THE CAR-I PROCEEDED TO THE CAR UNLOCKED THE TRUNK WITH MY KEY-PUT MY GROCERIES IN THE TRUNK AND OPENED THE DRIVERS SIDE DOOR-WHICH THEN I NOTICED SHOES IN THE FLOORBOARD ON THE PASSENGERS SIDE AND REALIZED MY KEYS HAD JUST OPENED THE DOOR AND THE TRUNK TO SOMEONE ELSE'S FORD FOCUS-SO I GRABBED A BUGGY REAL QUICK GOT MY STUFF OUT OF THE CAR-LOCKED THE DOORS AND WENT AND FOUND MY CAR. MY HUSBAND CALLED THE DEALER AND THEY JUST LAUGHED AND SAID THAT YOU HAVE A ONE IN A MILLION CHANCE SOMETHING LIKE THIS WOULD HAPPEN -THEY COULD CHANGE THE LOCKS BUT DIDIN'T THINK IT WAS NECESSARY-WOULD PROBABLY NEVER HAPPEN AGAIN-I EMAILED THE FORD COMPANY. THEY CALLED MY HUSBAND TALKED TO THEM-THEY SAID THEY WOULD MAKE A REPORT AND TO CALL THE DEALER BACK AND SEE WHAT THEY WANTED TO DO ABOUT IT. AFTER MY HUSBAND TALKED TO BOTH OF THESE PARTY'S IT WAS DECIDED THEY WEREN'T GOING TO DO ANYTHING. WE ARE GOING TO HAVE TO GET A BURGULAR ALARM-SO I WON'T HAVE TO WORRY ABOUT SOMEONE GETTING IN MY CAR , STEALING ITEMS IF SHOPPING,ETC,ETC,ETC. MOSTLY WANTED TO MAKE YOU AWARE AND SEE IF YOU HAVE HAD ANY OTHER INSTANCES OF THIS HAPPENING. YOU PAY A LOT FOR A CAR-FOR EVERYONE WHO OWNS ONE LIKE IT TO BE ABLE TO GET IN YOUR CAR. SCARES ME TOO=THAT CAR THIEVES MAY CATCH ON TO THIS",
        "vin": ""
    }
]