[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/19/2003",
        "dateOfIncident": "02/19/2003",
        "fire": false,
        "manufacturer": "Norcold Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007819,
        "products": [
            {
                "manufacturer": "Norcold Inc.",
                "productMake": "NORCOLD",
                "productModel": "N641",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "OKAY.. WHAT SERIAL NUMBERS ARE EFFECTED. I NEED MORE INFO THEN A DATE OF MANUFACTURE.... I CAN'T BELIEVE THE SERIAL NUMBER OF THE UNITS EFFECTED ARE SUPPLYED. THAT'S MY COMPLAINT... HOW CAN I TELL IF THE RECALL EFFECTS MY JAYCO RV..    REPORT DATE :  FEBRUARY 19, 2003 AT 09:17 PM   TYPE :  EQUIPMENT   MAKE :  NORCOLD   MODEL :  N641         RESULTS : 1 | ALL RECORDS DISPLAYED      MAKE : NORCOLD MODEL : N641 BUILD DATES : MAY 01, 1999 - NOV 30, 1999   NHTSA CAMPAIGN ID NUMBER : 02E019000  RECALL DATE : MAR 22, 2002   COMPONENT: EQUIPMENT:RECREATIONAL VEHICLE   POTENTIAL NUMBER OF UNITS AFFECTED : 28144   SUMMARY:    EQUIPMENT DESCRIPTION: REFRIGERATOR COOLING UNITS MODEL NUMBERS N841, N821, N641, AND N621. THESE REFRIGERATORS CAN EXPERIENCE A COOLING SYSTEM LEAK CAUSED BY OPERATION IN THE AC ELECTRIC MODE. IF A LEAK OCCURS, THE COOLING PERFORMANCE OF THE REFRIGERATOR WILL DETERIORATE.   CONSEQUENCE:    EXTENDED OPERATION OF A LEAKING COOLING UNIT IN THE AC ELECTRIC MODE CAN RESULT IN A FIRE.   REMEDY:    NORCOLD WILL NOTIFY ITS CUSTOMERS AND REPLACE THE COOLING UNIT FREE OF CHARGE. OWNER NOTIFICATION BEGAN APRIL 12, 2002. OWNERS WHO TAKE THEIR VEHICLES TO AN AUTHORIZED DEALER ON AN AGREED UPON SERVICE DATE AND DO NOT RECEIVE THE FREE REMEDY WITHIN A REASONABLE TIME SHOULD CONTACT NORCOLD SERVICE CENTER AT 1-800-767-9101.   NOTES:    ALSO, CUSTOMERS CAN CONTACT THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION'S AUTO SAFETY HOTLINE AT 1-888-DASH-2-DOT (1-888-327-4236).        THANKS,    JB",
        "vin": null
    }
]