[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/19/2003",
        "dateOfIncident": "01/09/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007817,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL LAMP CAME ON WHILE SITTING AT A STOPLIGHT, THE ENGINE TACHOMETER READ BELOW 500RPM AND THE VEHICLE WAS UP TO TEMPERATURE. ONCE THE VEHICLE ACCELERATED THROUGH THE LIGHT THE OIL LAMP TURNED OFF. AT THE NEXT STOPLIGHT THE OIL LAMP AGAIN CAME ON UNDER THE SAME CONDITIONS. AFTER THIS THE VEHICLE SEEMED OK. A FEW DAYS LATER THE OIL LIGHT CAME ON UNDER THE SAME CONDITIONS. AN APPOINTMENT WAS THEN MADE TO HAVE THE VEHICLE SERVICED. BEFORE TAKING THE VEHICLE IN TO THE DEALERSHIP THE ENGINE WAS STARTED AND MADE A LIGHT TICKING NOISE. THIS NOISE DID NOT CONTINUE AFTER THE ENGINE WAS SHUT OFF AND ALLOWED TO COOL DOWN OVERNIGHT. THE VEHICLE WAS TOWED TO THE DEALERSHIP FOR FEAR OF DAMAGING THE ENGINE FURTHER. THE DEALERSHIP FOUND THAT THE OIL SENDING UNIT WAS NOT WORKING PROPERLY, AND ALSO WAS LEAKING OIL. THEY FOUND NO PROBLEMS WITH THE OILING SYSTEM AND ASSURED ME THAT THE OIL PRESSURE AND VOLUME WAS WITHIN CHRYSLER'S SPECIFICATIONS. THE DEALERSHIP REPLACED THE OIL SENSOR FOR TIME AND MATERIAL BEING THE VEHICLE WAS OUT OF WARANTY. ON THE WAY HOME FROM THE DEALERSHIP THE ENGINE STARTED MAKING A VERY LOUD KNOCKING SOUND ALTHOUGH THE OIL LAMP WAS NOT ON. THE CAR WAS THEN TAKEN TO A LOCAL REPAIR SHOP AND THE TIMING CHAIN TENSIONER WAS FOUND TO BE STUCK ALLOWING SLACK IN THE TIMING CHAIN. AFTER REPLACING THE TENSIONER WITH A NEW TENSIONER FROM THE DEALERSHIP AND REASSEMBLING THE ENGINE, THE KNOCKING NOISE WAS NOTICIBLY QUIETER BUT STILL INDICATED A PROBLEM. (NOTE: THE ENGINE MADE NO KNOCKING NOISE AT ALL WHEN COLD, IT ONLY KNOCKED WHEN UP TO TEMPERATURE) THE REPAIRMAN CONTACTED A CONTACT AT A DIFFERENT DEALERSHIP AND WAS INFORMED OFF OF THE RECORD THAT THEY ALSO HAD AN INTREPID IN FOR THE SAME THING, AND THEY HAD TO ALSO REPLACE THE TIMING CHAIN AND TIMING CHAIN GUIDES TO RID THE VEHICLE OF THE KNOCKING SOUND WHEN UP TO TEMPERATURE. THE VEHICLE IS CURENTLY AT THE REPAIR SHOP WAITING FOR THE ADDITIONAL PARTS TO SEE IF THIS REMIDIES THE PROBLEM.",
        "vin": "1B7FL23X3NS"
    }
]