[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2003",
        "dateOfIncident": "08/08/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007833,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "BEETLE",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 5TH GEAR IN THE MANUAL TRANSMISSION SLIPPED OUT OF GEAR A NUMBER OF TIMES RENDERING ME HELPLESS IN FREEWAY TRAFFIC.   I HAD MADE AT LEAST 5  ATTEMPTS TO HAVE REPAIRS DONE ON THE TRANSMISSION BUT THE DEALERSHIP WAS UNABLE TO REPAIR THE TRANSMISSION PROPERLY AND WHEN IT WAS REPAIRED IT WAS IMPROPERLY REPAIRED, WITH PARTS LEFT OUT.   BECAUSE THE PROBLEM WAS NOT DUPLICATED BY ANOTHER DEALER NO REPAIRS WERE DONE UNTIL THE CAR WAS SEEN BY A 3RD  DEALER WHO FOUND THE PROBLEM AND CORRECTED IT. THE TRANSMISSION WAS UNDERWARRANTY OF 10 YRS/100,000 MILES.   . WE, THE CONSUMER,  MUST LEARN TO BE AGRESSIVE AND GET PROPER REPAIRS DONE ON OUR AUTOMOBILES AND WE MUST USE EVERYMEANS AVAILABLE TO US TO ENCOURAGE/FORCE THE DEALERSHIPS TO BE MORE AWARE OF CONSUMER SAFTEY.    I COULD HAVE BEEN KILLED OR KILLED OTHERS ON THE FREEWAY DUE TO THE CAR SLIPPING OUT OF GEAR.  I NEED TO USE MY CAR AND I DID TRY TO GET IT FIXED SO IT WOULD BE SAFE ON ALL ROADWAYS AND IN ALL DRIVING CONDITIONS ON ROADWAYS.  IF A CAR CANNOT BE REPAIRED BY A DEALER THEY SHOULD BE HONEST ENOUGH TO ADMIT THEIR LACK OF SKILLS AND KNOWLEDGE AND THE CONSUMER REFERRED TO A PLACE OF REPAIR THAT HAS THE KNOWLEDGE, SKILLS AND TOOLS OF THE TRADE TO ACCOMPLISH THE REPAIR.   A CAR OUT OF GEAR AT FREEWAY SPEEDS ON A FREEWAY IS AS DANGEROUS AS ANY OF THE TOP 3 DANGERS LISTED AND SHOULD BE ADDED TO THE LIST.   SO SHOULD THE NAMES OF THE DEALERS WHO ARE SO LAX IN ACCOMPLISHING LIFE SAVING REPAIRS.",
        "vin": "3VWCC21C8XM"
    }
]