[
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/20/2003",
        "dateOfIncident": "12/30/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007842,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "DODGE TRUCK",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A TOOL & PROCESS ENGINEER WORKING FOR DAIMLERCHRYSLER CORPORATION'S DETROIT AXLE PLANT, 6700 LYNCH ROAD, DETROIT, MI AND WISH TO ABSOLVE MYSELF OF ANY GUILTY KNOWLEDGE CONCERNING THE INCORRECT MANUFACTURE OF AXLE SHAFTS AND SUBSEQUENT DILATORY AND EVASIVE TACICS OF MANAGEMENT PERSONNEL IN HIDING THE ACTIONS.  THE AXLES ARE IN THE FIELD AND THE FEATURES INVOLVED ARE A SAFETY ITEM ON THE BLUEPRINTS.  ONE KNOWN FAILURE HAPPENED RECENTLY IN NEW JERSEY.  THE SPLINED END OF THE AXLE SHAFT HAS NOT BEEN HEAT TREATED CORRECTLY.  FIELD FAILURES SHOULD BE EXPECTED.  SERIOUS INJURY INCLUDING DEATH POSSIBLE.  PROBLEM STILL OCCURRING IN MANUFACTURING PROCESS.    IN A LIKE AND SIMILIAR CASE, ANOTHER SAFETY ITEM OCCURRING APPROXIMATELY THE SAME TIME FRAME (LAST FALL AND THROUGHOUT THIS WINTER) HAS ARISEN.  THE FLANGE WHICH IS WELDED ON THE TUBE HAS FIELD FAILURE.  THE MANUFACTURING FACILITY CHANGED ITS PROCESSING FROM A FLUX CORE WELDING PROCESS TO A GAS-ASSISTED PROCESS.  PRODUCT WAS MADE INCORRECTLY, SHIPPED TO ASSEMBLY PLANTS, AND DELIVERED TO DEALERSHIPS WITHOUT A SYSTEM INSPECT OR PURGE.  THIS IS ANOTHER SAFETY FEATURE ON THE BLUEPRINT.  AGAIN, SUCH FILED FAILURE OF THIS ITEM MAED TO SERIOUS INJURY AND DEATH.  NO ACTION FROM MANUFACTURER FOR  PUBILC INJURY PREVENTION OR MANUFACTURING PROCESSING REMEDY OCCURRING.      THREAT OF RETAILATORY ACTIONS FOR REPORTING THIS INFORMATION TO THE NHTSA IS HIGHKY LIKELY.  I HAVE NO INTEREST IN PARTICIPATING IN ENGINEERING ACTIVITIES WHICH MAY HARM THE PUBLIC AND FEEL I HAVE THE LEGAL OBLIGATION TO DIVULGE ANY SUCH ACTIVITIES TO THE PROPER AUTHORITIES.  PLEASE CONTACT ME FOR FURTHER DOCUMENTATION.",
        "vin": ""
    }
]