[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/20/2003",
        "dateOfIncident": "01/29/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007856,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S60",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY NEW 2002 S60 AWD VEHICLE ON NOVEMBER 17, 2002 WITH 76 MILES ON IT AT BOSTON VOLVO VILLAGE IN BOSTON MA.  SOON AFTER, I STARTED TO NOTICE VIBRATIONS AND HEAR NOISES, WHICH APPEARED TO BE COMING FROM UNDERNEATH THE GAS PETAL. I SCHEDULED MY FIRST OIL CHANGE FOR WEDNESDAY JANUARY 29TH   WITH 3178 MILES ON IT. WHILE MY OIL CHANGE WAS BEING DONE, I ALSO WANTED THESE PROBLEMS INVESTIGATED AND FIXED. ON WEDNESDAY AFTERNOON, I RECEIVED A MESSAGE THAT MY CAR WAS READY TO BE PICKED UP. WHEN MY HUSBAND AND I DROVE DOWN TO BOSTON TO PICK UP THE CAR, MY HUSBAND WAS INFORMED THAT NO PROBLEMS WERE DISCOVERED CONCERNING THE NOISE I WAS HEARING. HOWEVER, THERE IS STRUCTURAL DAMAGE TO THE SUB-FRAME OF THE VEHICLE AND THAT IT THE DAMAGE OCCURRED WHILE THE VEHICLE WAS IN MY POSSESSION. WE KNOW THIS NOT TO BE TRUE SINCE I AM SOLE DRIVER OF THE CAR. THE SERVICE DEPARTMENT PROCEEDED TO CHARGE A $90 PARTS AND LABOR FEE BEFORE WE COULD TAKE THE CAR OF THE LOT. WHAT IS THE WARRANTY FOR? THE FOLLOWING MORNING, WHEN I BEGAN TO PUT MY 7 MONTH OLD BABY''S STROLLER IN MY TRUNK, I WAS EVEN MORE FRUSTRATED TO SEE THAT A PIECE OF MY CAR WAS IN MY TRUNK. I LEFT 2 MESSAGES TO GARY IN THE SERVICE DEPARTMENT EXPLAINING THAT I WAS UPSET THAT THIS PIECE WAS IN MY TRUNK, AND CONCERNED OF THE SAFETY OF DRIVING THE CAR, ESPECIALLY WITH MY BABY.  UNFORTUNATELY, MY CALL WAS NOT RETURNED. I THEN CALLED HANK, CUSTOMER SATISFACTION MANAGER ON SATURDAY MORNING.  AGAIN, HE WAS UNABLE TO ASSIST ME AND OF COURSE, I DID NOT RECEIVE A PHONE CALL BACK. I PURCHASED MY VEHICLE BASED ON THE SAFETY OF THE VEHICLE HOWEVER; I DO NOT FEEL SAFE. I BELIEVE THAT THIS DAMAGE WAS CAUSED PREVIOUS TO MY PURCHASE DUE TO THE CAR BEING USED AS A TEST DRIVE VEHICLE, OR POSSIBLY DONE BY A MECHANIC AT THE DEALERSHIP. WE ARE LOOKING FOR THE DEALERSHIP TO REPLACE THE CAR BUT THEY WILL NOT TALK TO US OR RETURN CALLS.",
        "vin": "YV1RH58D822"
    }
]