[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2003",
        "dateOfIncident": "02/07/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007858,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "626",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "'96 MAZDA 626 (BOUGHT NEW) . TRANSMISSION FAILED AT 83,000+/_ MI.  INITIALLY TOOK CAR TO A DEALER FOR OIL LEAK (REPLACED OIL PRESSURE SWITCH).  THEY BROUGHT CAR TO ME, IT STARTED & DIED REPEATEDLY.  THE SPEEDOMETER NEEDLE JUMPED ALL AROUND THE DIAL AND ODOMETER WOULD SPIN, ADDING MILEAGE.  SERVICE WRITER SAID THE SERVICE TECH. NOTICED THE PROBLEM WHEN WORKING ON IT/THEY COULD CHECK IT OUT FOR ADDITIONAL $75 FEE.  I TOLD HER I HADN'T HAD THAT PROBLEM BEFORE. SHE SAID THEY DIDN'T REPAIR ANYTHING IN THE AREA OF TRANSMISSION OR SPEEDOMETER THAT THEY MIGHT HAVE DAMAGED TO CAUSE THIS.  I SPOKE TO THE TECH. & HE HAD NO IDEA WHAT THE PROBLEM MIGHT BE.  HE OPENED THE HOOD AND CHECKED SOMETHING AS I TALKED TO THE SERVICE WRITER AND STARTED THE CAR AND IT RAN OKAY.  WHILE DRIVING HOME, SPEEDOMETER NEEDLE INTERMITTENTLY DID THE SAME THING, ADDING EXTRA MILEAGE, BUT DROVE OK.      ON ANOTHER DAY, AFTER DRIVING APPROX. 15 - 25 MI. & RETURN HOME, CAR WON'T RUN AFTER STOP AND RESTART TRY. TURNED THE IGNITION/SPEEDOMETER NEEDLE JUMPED ALL AROUND THE DIAL/THE ODOMETER SPUN/ADDED MILEAGE/CAR NOT MOVING.  IT STARTS AND DIES REPEATEDLY.    AFTER SITTING A FEW HOURS, IT STARTS & DRIVES OK. DROVE TO ANOTHER DEALER; THEY SAY PROBLEM WON'T MANIFEST WHILE THEY HAD IT. REPORT: MOISTURE IN SENSOR CONTACTS/DRIED THEM & CAR OK.  DROVE CAR HOME.    THE NEXT TIME THAT I DROVE THE CAR; SAME THING HAPPENED. TOWED IT BACK TO THE DEALER.  THEIR REPORT REPORT: TRANSMISSION SHOT/TORQUE CONVERTER FALLING APART & THAT CAUSED ALL THE PROBLEMS. $2,900 FOR MADZA RE-BUILT TRANS.    WHILE RESEARCHING THIS, I FIND THAT MADZA 626 (& OTHER MODELS) IS NOTORIOUS FOR TRANSMISSION FAILURES.  I FEEL MADZA IS AWARE OF INFERIOR AND APPARENTLY DEFECTIVE TRANSMISSIONS IN THEIR CARS. IT SEEMS THAT THEIR REPLACEMENT TRANSMISSIONS DEVELOP  SAME OR ADDITIONAL PROBLEMS AND HAVE TO BE REPLACED REPEATEDLY. MADZA SHOULD RECALL AND REPAIR/REPLACE THEM.",
        "vin": "1YVGE22C7T5"
    }
]