[
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "02/20/2003",
        "dateOfIncident": "06/01/1998",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "BLAZER",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD A/C: COMPLAINED TO A DEALER APPROXIMATELY 10 MONTHS (SUMMER OF 98) AFTER THE PURCHASE ABOUT WARM AIR BLOWING, INTERMITTENTLY, FROM UNDER THE DASHBOARD.  THE DIAL WAS TURNED TO COLD POSITION AND THE FAN WAS OFF.  DEALER TECHNICIAN COULD NOT RECREATE THE PROBLEM EVEN AFTER THE CAR WAS KEPT OVERNIGHT.  COMPLAINED AGAIN A COUPLE OF MONTHS LATER.  HOWEVER, THE DEALER COULD NOT RECREATE THE PROBLEM, BUT APPARENTLY OPENED THE UNIT AND FOUND NO PROBLEMS.  ABOUT 6 MONTHS LATER (SPRING OF 99), COMPLAINED ABOUT A/C NOT BLOWING COOL ENOUGH AIR.  AGAIN, DEALER FOUND NO PROBLEMS AND STATED THAT IT THE DESIGN DEFECT.  ABOUT 2 YEARS LATER, MOVED TO SC WHERE NO COLD AIR WAS BLOWING - ONLY OUTSIDE AIR (IT WAS COOLER TO OPEN THE WINDOW).  TOOK THE CAR TO PRECISION TUNE AND THEY ADDED FREON AND A DIE TO DETECT LEAKS.  THE FREON SEEMED TO MAKE SOME DIFFERENCE.  NO LEAK WAS FOUND AFTER A REVISIT A COUPLE OF MONTHS LATER.  PLACED A COMPLAINT TO THE CHEVROLET 800 NUMBER SERVICE LAST YEAR (FALL OF 02).  THE OPERATOR WAS SOMEWHAT HESITANT AND QUESTIONED WHY IT TOOK SO LONG TO REPORT THE PROBLEM AND FINALLY MADE AN APPOINTMENT WITH A LOCAL DEALER.  AFTER DIAGNOSIS, THE DEALER DETERMINED THAT THE COMPRESSOR HAD GONE BAD.  THIS PROBLEM WOULD HAVE BEEN DETECTED IF THE PREVIOUS DEALER HAD RUN DIAGNOSTICS.  MADE SEVERAL ATTEMPTS TO TALK TO CHEVROLET POINT OF CONTACT ABOUT WARRANTY COVERAGE.  HOWEVER, THERE WAS NO RESPONSE.  THE INITIAL COMPLAINT WAS AROUND 10,000 MILES AND LAST COMPLAINT WAS AROUND 46000 MILES.  CHEVROLET SHOULD PAY FOR SOME OR ALL OF THE COST ($1000).",
        "vin": "1GNDT13W9V2"
    }
]