[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/20/2003",
        "dateOfIncident": "02/19/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007894,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "STRATUS",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "IMPRESSED WITH THE SPORTY STYLE OF MY SISTER'S 4-DOOR DODGE STRATUS,  I PURCHASED ONE FOR MY WIFE IN 1998 (A 1998 DODGE STRATUS).  IT WASN'T LONG BEFORE MY SISTER BEGAN HAVING PROBLEMS WITH HER CAR.  I BLAMED HER AND TOLD HER THAT SHE WAS TOO ROUGH ON HER CAR (SHE HAS A LEAD FOOT).  MY WIFE AND I TAKE VERY GOOD CARE OF OUR CARS AND I WAS CONFIDENT WE WOULD NOT RUN INTO THE SAME PROBLEMS.  WELL, RECENTLY I NOTICED THE PRESENCE OF A SMALL OIL-PUDDLE WERE MY WIFE KEEPS HER CAR.  I LEARNED THAT THE HEAD GASKET WAS IN NEED OF REPLACEMENT.  I'VE YET TO HAVE THIS DONE BUT WAS QUOTED AND ESTIMATE OF $700-750.  THE MECHANIC INFORMED ME THAT THIS WAS A VERY COMMON PROBLEM FOR THE STRATUS.  SO COMMON THAT HE PREDICTED THE DIAGNOSIS BEFORE EVER LOOKING UNDER THE HOOD.  MY STRATUS ONLY HAS 55,000 MILES ON IT.  ITS BEEN WELL MAINTAINED AND DRIVEN WITH CARE.  TURNS OUT, MY SISTER HAD THE SAME PROBLEM (HEAD GASKET FAILURE) AT/NEAR 65,000 MILES.  IN TYPING THE WORDS \"DODGE STRATUS HEAD GASKET\" IN AN INTERNET SEARCH MANY ARTICLES, COMPLAINTS, AND REVIEWS NOTED THIS ALL-TO COMMON PROBLEM.  I ALSO LEARNED MANY OF THOSE WHO HAVE HAD THIS FAILURE RECEIVED ZERO TO LITTLE COMPENSATION/COMPASSION FROM THE MANUFACTUER FOR THE OBVIOUS DEFECT.  IT APPAERS DODGE HAS IDENTIFIED THIS PROBLEM AND HAS RE-DESIGNED THE GASKET MULTIPLE TIMES.  TWO SEPERATE MECHANICS INFORMED ME THAT I CAN HAVE THE GASKET REPLACED BUT I SHOULD EXPECT THE PROBLEM TO HAPPEN AGAIN SOON AFTER.  THIS DOESN'T SEEM FAIR.  I UNDERSTAND DEFECTS OCCUR BUT FEEL PEOPLE SHOULD BE COMPENSATED WHEN THEY DO.  DODGE NEEDS TO STAND BEHIND THEIR PRODUCT AND ADMIT THEY ARE RESPONSIBLE.  THIS DEFECT HAS LED TO MUCH FRUSTRATION..  A RESPONSE OF WHAT I SHOULD/CAN DO WOULD BE APPRECIATED",
        "vin": "1B3EJ46X0WN"
    }
]