[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/21/2003",
        "dateOfIncident": "02/20/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CELICA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR TO THE DEALER WHERE I PURCHASED THE CAR B/C OF RECENT PROBLEMS.  THE CAR WAS RIDING VERY ROUGH (EVEN ON THE SMOOTHEST OF ROADS), THERE WAS A THUMPING IN THE FRONT END, THE CAR PULLS TO THE RIGHT, AND AT SPEEDS IN EXCESS OF 65 MPH THE STEERING WHEEL SHAKES CONSIDERABLY.  THE SERVICE DEPT. DECIDED THAT IT WAS DEFINATELY AN ISSUE WITH THE TIRES.... WHICH IS FINE, EXCEPT I HAVE ONLY BEEN DRIVING THE CAR FOR 11 MONTHS AND THERE IS ONLY 16,000 MILES ON THE CAR.  I THEN WAITED FOR APPROXIMATELY 25 MINUTES WHILE THEY CHECKED OUT THE CAR, AND THE SERVICE MAN CAME OUT TO THE WAITING ROOM TO INFORM ME THAT THE SPACERS WHERE NEVER REMOVED FROM MY FRONT SHOCKS.  (IE. SPACERS ARE PLACED ON NEW CARS WHEN THEY ARE IN TRANSIT, BEING HAULED ON TRUCKS.  THEY KEEP THE CAR FROM BOUNCING AROUND AND GETTING DAMAGED)  WELL, I HAVE BEEN DRIVING MY CAR ALL THIS TIME WITH THE SPACERS STILL IN PLACE, KEEPING MY CAR FROM HANDLING, DRIVING AND PERFORMING LIKE IT SHOULD.  THIS HAS CAUSED UNDETERMINED AMOUNT OF DAMAGE TO THE ALIGNMENT, THE TIRES, ETC.  I NOW HAVE BEEN INFORMED I MUST REPLACE ALL FOUR TIRES, TWO OF THEM IMMEDIATELY, AND THEY WILL BALANCE THEM FOR A FEE OF $29.95, AND I ALSO WILL NEED AN ALIGNMENT WITHIN THE NEXT TWO MONTHS.  IT SURE IS GREAT TO HAVE A NEW CAR AND IT'S UNDER WARRANTY, RIGHT??   WRONG!  I AM NOW TOLD I AM RESPONSIBLE FOR ALL OF THE PROBLEMS, B/C THEY DON'T KNOW IF I HAVE BEEN PROPERLY ROTATING THE TIRES, WHATEVER THAT HAS TO DO WITH AN ALIGNMENT.  AND I AM ALSO RESPONSIBLE FOR A LABOR FEE OF $15.00 + TAX ($15.94) FOR THEM TO CHECK THE CAR OVER.  DIDN'T THEY DISCOVER A PROBLEM THAT THEY WERE RESPONSIBLE FOR??  I DON'T KNOW, BUT I DO KNOW THAT I WILL BE CONTACTING MY LAWYER REGARDING THE DAMAGE THAT MY CAR HAS ENDURED AND ALSO THE SAFETY RISK THIS ISSUE HAS PUT ME IN.  I WILL LET YOU KNOW OF THE OUTCOME.",
        "vin": "JTDDR32T720"
    }
]