[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/21/2003",
        "dateOfIncident": "06/17/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007941,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "FOCUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2000 (4DR) FORD FOCUS WAGON SE ON 06/17/00 AND I HAVE HAD NOTHING BUT TROUBLE EVER SINCE. HERE IS A LIST OF MY COMPLAINTS     CONSTANT CLICKING AND SCREECHING NOISE WHEN I TURN OR GO OVER A BUMP SOUNDS AS IF THE CAR HAS ARTHITIS PROBLEMS     SOMETIMES MY CAR WILL NOT START UNTIL AFTER 3 OR 4 ATTEMPTS       LEFT BACK WINDOW WILL NOT ROLL DOWN & ALTHOUGH I HAVE NOT HEARD IT SINCE SUMMER THE WINDOWS MAKE NOISE WHEN OPERATED LIKE GLASS RUBBING AGAINST METAL       LUBERICATE ALL OF THE CAR DOORS ONCE A MONTH BECAUSE THEY SCREECH EXTREMELY LOUD WHEN OPENED OR SHUT      I HAVE BEEN IN ALMOST 4 ACCIDENTS BECAUSE OF THE ENORMOUS AMOUNT OF SEVERE BLIND SPOTS ON BOTH THE L & R SIDES OF THE CAR      NIGHT DRIVING BAD - THE CAR SITS AT A DOWNWARD ANGLE WHICH ALLOWS REAR VEHICLES HEADLIGHTS TO BLIND YOU WITH YOUR OWN REARVIEW AND SIDE MIRRORS - THIS MAKES VISIBILITY IMPOSSIBLE & VERY DANGEROUS      A SOUR-VINEGAR LIKE SMELL APPEARS SOMETIMES     ON 02/23/02 @ SEARS AUTO CENTER I HAD TO REPLACE MY TIRES DUE TO BOWED/BUCKLED - ODOMETER WAS AT 22114 - PAID OUT OF MY POCKET TO REPLACE TIRES $508.46 MECHANIC COULD NOT EXPLAIN WHY THIS HAPPENED BUT INSTRUCTED ME TO CALL FORD & GET REIMBURSED FOR THE TIRES - I WAS TOLD IT WAS NORMAL WEAR AND TEAR NO REIMBURSEMENT. I DO NOT FEEL THIS IS A DIRECT TIRE ISSUE BUT A CAUSE ISSUE FROM THE CAR ITSELF SAFTEY RECALL 00S31     EVERYTIME I HIT A PUDDLE AFTER RAIN THE ENGINE MAKES A SCREAMING SOUND & LOSES SOME POWER.      AFTER TAKE THE CAR HESITATES LIKE IT SLIPS INTO NEUTRAL GEAR?     WHAT IS GOING ON? WHY IS FORD NOT HELD RESPONSIBLE FOR A BAD PRODUCT AND A TOTAL RECALL ON THE CAR ITSELF?  THIS CAR HAS NUMEROUS COMPLAINTS, FORD DOES NOT GIVE YOU A LOANER FOR ITS BAD PRODUCT & THE MOST THEY WILL SAY IS WE ARE SORRY TO INCONVENIENCE YOU OR WE APOLOGIZE FOR THIS SITUATION.  I DO NOT WANT THEIR SYMPATHY I WANT A CAR NOT JUST PRICED AT 19,750.97 BUT VALUED AT $19,750.97. I WANT A CAR THAT IS SAFE & RELIABLE!",
        "vin": "1FAFP3635YW"
    }
]