[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2003",
        "dateOfIncident": "02/18/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007953,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VENTURE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2-18-03 MY 2000 VENTURE WAS SERVICED FOR A TOW PACKAGE. THE INVOICE IS CTCS280208. WHEN I PICKED UP THE VEHICLE I NOTICED ON THE JOB SHEET \"NOTE INTAKE GASKETS LEAKING COOLANT APPROXIMATE COST 450.00\"  I MET WITH SERVICE MANAGER ROY STONER TO DISCUSS OTHER ISSUES WHICH I AM HAPPY TO REPORT WERE SATISFACTORILY RESOLVED. I AM METICULOUS ABOUT WATCHING FOR LEAKING FLUID IN MY VEHICLES AND HAVING HAD NONE ON THE VENTURE I ASKED HIM TO SHOW IT TO ME. WHEN WE LIFTED THE HOOD I NOTED THAT MY COOLANT RESERVOIR WAS EMPTY. WITH THE USE OF A FLEXIBLE LIGHT HE SHOWED ME THE PUDDLE ANTIFREEZE ON THE REAR OF THE INTAKE MANIFOLD. I ASKED HIM HOW THIS WAS DETECTED SINCE NONE OF THE WORK INVOLVED THIS PART OF THE ENGINE AND THERE WAS NO DRIP INDICATION. ROY INFORMED ME THAT THEY ROUTINELY CHECK THE INTAKE MANIFOLD GASKET ON THESE VEHICLES BECAUSE THERE HAVE BEEN CHRONIC FAILURES OF THEM. \"I CAN PROBABLY PULL ONE OUT OF THE GARBAGE CAN RIGHT NOW.\" WAS HIS RESPONSE. \"THIS IS A HORRIBLE DESIGN OR A TORQUE PROBLEM.\" HE CALLED OVER ONE OF YOUR MECHANICS WHO SUGGESTED IT BE REPAIRED IMMEDIATELY OR RISK REPLACING THE ENGINE SHOULD THE LEAK BECOME INTERNAL. I HAVE AN APPOINTMENT SCHEDULED FOR THURSDAY FEBRUARY 27. SINCE THEN I HAVE DONE CONSIDERABLE RESEARCH ON THIS ISSUE. I HAVE DISCOVERED A WEB SITE PETITION SIGNED BY OVER 2,000 GM CUSTOMERS WITH THE SAME ISSUE AT HTTP://WWW.PETITIONONLINE.COM/MOD_PERL/SIGNED.CGI?GMCNSMRS  I TRIED CALLING GM CUSTOMER ASSISTANCE CENTER AND WAS GIVEN A SERVICE REQUEST NUMBER OF 1-75030610 AND TOLD TO GET THE TSB NUMBER AND CALL THEM BACK. MY RESEARCH SHOWS THAT MANY CUSTOMERS ARE HAVING THE REPAIR DONE WITH A $100 DEDUCTIBLE OR AT NO COST. IN SEPTEMBER OF 2002 THIS GASKET WAS ON A \"NATIONAL BACK-ORDER.\" IT APPEARS A CLASS ACTION LAWSUIT IS ALSO IN THE WORKS AND THE NTSB HAS LAUNCHED AN INVESTIGATION.  IT ALSO APPEARS A NEW GASKET HAS BEEN OR WILL BE AVAILABLE SOON.",
        "vin": "1GNDX13E5YD"
    }
]