[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2003",
        "dateOfIncident": "12/04/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008094,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "98",
                "productYear": "1992",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO DRIVE TO WORK ON A COLD DAY MY CAR STARTED SLOWING DOWN, EVENTUALLY IT GO TO WERE I HAD TO PULL OFF THE HIGHWAY BECAUSE MY CAR DID NOT HAVE ANY DRIVE FORWARD OR BACKWARD ANY LONGER.  I KEEP MY CAR IN PERFECT CONDITION IT ONLY 105,970 MILES.  ONCE I REALIZED THAT MY CAR WAS NOT GOING TO MOVE I HAD IT TOWED WHICH COST ME OVER$100.00  TO AN OLDSMOBILE DEALER IN CHIEFLAND, IT WAS THE SERVICE DEPARTMENT THAT INFORMED ME THE NEXT WEEK THAT MY TRANSMISSION FLEW APART I THEN HAD TO FORK OUT $2417.39 TO HAVE IT REPLACED WITH A REMANUFACTURED ONE FROM GM.  I FEEL THAT SINCE I HAVE HAD MY CAR SERVICED MANY TIMES BY AN OLDSMOBILE DEALER, THAT SOMEONE SHOULD HAVE THOUGHT SOMETHING WAS WRONG SINCE IT WAS JUST SERVICED AND ADJUSTED ONE WEEK PRIOR. AFTER I HAD BROUGHT IT IN FOR NOT SHIFTING PROPERLY.  I FEEL THAT OLDSMOBILE SHOULD AT LEAST COVER 1/2 THE COST SINCE IT ONLY HAS 105,970 MILES.  TRANSMISSIONS JUST DON'T FLY APART WITH THAT LITTLE MILES.  IT SHOULD BE NOTED THAT WHEN IT WAS CHECKED OUT THE LAST TIME WHEN IT FLEW APART I WAS TOLD THAT THERE WAS NOT MUCH FLUID LEFT IN THE TRANSMISSION, HOWEVER THERE WAS NO LEAK, NOR WERE THERE STAINS IN MY GARAGE, THE PARKING LOT AT WORK OR ANYWHERE ELSE.  THE SERVICE DEPARTMENT SAID THAT THEY COULD NOT INVESTIGATE THE SITUATION ANY FURTHER DUE TO THE FACT THAT THEY NEEDED TO RETURN THE CORE UNTOUCHED.",
        "vin": "1G3CX53L6N4"
    }
]