[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/26/2003",
        "dateOfIncident": "02/18/2003",
        "fire": false,
        "manufacturer": "Honda (American Honda Motor Co.)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008125,
        "products": [
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "ACCORD",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HASN'T BEEN A MAJOR PROBLEM BUT THIS IS THE SECOND TIME I AM DEALING WITH THIS EGR VALVE ON THIS HONDA.  FIRST, ONE YEAR AGO MY CHECK ENGINE LIGHT CAME ON AND THE CAR WAS CUTTING OFF WHEN IT CAME TO A STOP OR WAS IDLING AND THE HONDA DEALER SAID THAT THERE WAS A WARRANTY REPAIR ON THE CAR.  THEY REPLACE THE EGR VALVE AND SAID EVERYTHING WAS FINE.   7 MONTHS LATER MY CHECK ENGINE LIGHT IS BACK ON BUT THE CAR'S PERFORMANCE HAD NOT CHANGED.  HOWEVER, I TOOK MY CAR TO GET AN EMISSIONS TEST AND MY CAR FAILED EMISSIONS WITH THE TROUBLE CODE REPORTING EGR INSUFFICIENT FLOW.   I TOOK IT TO THE HONDA DEALER AND THEY ARE TELLING ME THAT BECAUSE MY CAR HAS 97,000 MILES ON IT THAT THEY CANNOT HELP WITH THIS REPAIR.  ALSO THE EGR CLEANING KIT IS ON BACKORDER FOR 2 WEEKS, WHICH TELLS ME THAT THERE ARE OTHER HONDAS ALL OVER THE COUNTRY THAT ARE HAVING THIS PROBLEM.   I ALSO HAVE AN EXTENDED WARRANTY WITH SMART CHOICE AND THEY ARE SAYING THAT THEY CANNOT COVER EMISSIONS SYSTEMS UNDER THEIR WARRANTY. THE REPAIR AND DIAGNOSTIC FEE IS GOING TO COST ME OVER $300.   HONDA KNOWS THAT THIS IS A MAJOR PROBLEM AND I FEEL LIKE THEY SHOULD BE HELPING ME WITH THIS ISSUE.  THIS CAR WILL CONTINUE TO FAIL EMISSIONS IF THIS EGR SITUATION IS NOT RESOLVED.  I WILL MORE THAN LIKEY SELL THIS CAR THIS YEAR ONCE THIS EMISSIONS SITUATION IS OVER.  *JB",
        "vin": ""
    }
]