[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2003",
        "dateOfIncident": "12/19/2002",
        "fire": false,
        "manufacturer": "Mack Trucks, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000784,
        "products": [
            {
                "manufacturer": "Mack Trucks, Inc.",
                "productMake": "MACK",
                "productModel": "CH600",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 MACK MODEL CH613.  THIS VEHICLE HAS HAD MULTIPLE POWER LOSSES TO ALL THE GAUGES IN THE INSTRMENT CLUSTER. ALL THE POWER TO THE CLUSTER GOES OUT AND THE GAUGES GO BLANK. THIS CONDITION LAST UNTIL YOU PULL OFF THE ROAD, SHUT OFF THE VEHICLE AND RE-START THE VEHICLE. THIS CLUSTER UNIT FAILED THE FIRST TIME ABOUT 6 MONTHS AFTER THE PURCHASE DATE OF 03-06-01. THE DEALER REPLACED THE CLUSTER UNIT. THE PROBLEM STILL OCCURED INTERMITENTLY OVER THE NEXT YEAR. ON 12/10/02 THE MANUFACTURER ISSUED  SERVICE BULLETIN # SB-732-005. THIS SERVICE BULLETIN STATES THE POWER LOSS LAST JUST A MOMENT AND THE DASH GUAGES COME BACK ON BUT THE GAUGES ONLY COME BACK ON IF THE IGNITION KEY IS TURNED OFF FOR A FEW SECONDS. THEN YOU MUST RE-START THE VEHICLE TO GET THE DASH GAUGE CLUSTER TO WORK. THIS SERVICE BULLETIN ALSO STATES THE PROBLEM IS IN THE MANUFACTURERS GROUND WIRING SYSTEM AND RECOMENDS  A WIRE IN THE DASH CLUSTER POWER PLUG BE REMOVED AND TAPED THEN AN ACTUAL JUMPER WIRE BE RUN THROUGH THE FIREWALL TO A GROUND CIRCUIT BREAKER. WE FEEL THIS IS A SERIOUS SAFETY ISSUE FOR A TRUCK WEIGHING 40 TON GOING DOWN THE ROAD AT UP TO 70 MPH IN SOME STATES AND LOOSING ALL DASH GUAGE DATA AND DASH LIGHTS. WE WOULD LIKE THE NHTSA TO ISSUE A MANDITORY RECALL AND ORDER THE MANUFACTURER TO REPAIR ALL THESE VEHICLES AT THE MANUFACTURERS EXPENSE. THIS IS DEFENTENTLY AN ELECTRIAL ENGINERING PROBELM OF THIS MANUFACTURER.",
        "vin": "1M1AA18Y01W"
    }
]