[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/26/2003",
        "dateOfIncident": "02/26/2003",
        "fire": false,
        "manufacturer": "ACCESSORY DIST., INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008145,
        "products": [
            {
                "manufacturer": "ACCESSORY DIST., INC.",
                "productMake": "ACCESSORY",
                "productModel": "HELMET",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "RE: NHTSA CAMPAIGN ID # 03E004000 MAKE: BELL MODEL: SAFETY HAMMER      TO WHOM IT MAY CONCERN:  RELATED TO THIS SAFETY HAMMER, PLEASE BE ADVISED THAT THE SAME PRODUCT HAS BEEN CARRIED BY TEAM PRODUCTS INTERNATIONAL BASED IN BOONTON, NJ:  THIS COMPANY HAS BEEN SELLING THIS PRODUCT AT TARGET, SAM'S CLUB, RADIO SHACK, BJ WHOLESALE CLUB, ... THEY EVEN SELL IT BY USING COLEMAN BRAND - LATELY BECAUSE OF LEGAL ISSUE, THEY EVEN CHANGED THE DESIGN BY GETTING RID OF ONE HEAD OF THE HAMMER AND INCLUDING A FLASHLIGHT INSTEAD:  HOWEVER THE PRODUCT IS STILL MADE WITH THE SAME HAND GRIP MATERIAL. ACCORDING TO OUR RECORD, THIS PRODUCT HAS BEEN AVAILABLE IN THE US FOR THE PAST COUPLE OF YEARS.  OTHER PRODUCTS  THAT MIGHT BE WORTH INVESTIGATING WITH THE SAME QUESTIONABLE FUNCTIONALITY ARE THE FOLLOWING:  \"4-IN-1 SOS EMERGENCY HAMMER\" BY SUN MATE CORPORATION, IN CANOGA PARK, CA AVAILABLE IN MULTITUDE CATALOGS, INTERNET SHOPPING SITES, \"AS SEEN ON TV\" STORES ETC... (WE HEARD FROM CLIENTS THAT THIS PRODUCT BROKE IN HALF WHEN THEY TRIED TO SHATTER A WINDOW) AND ALSO \"SAFETY HAMMER\" BY E & B GIFTWARE, INC., IN YONKERS, NY OFFERED IN ALL KINDS OF GIFT STORES, CATALOGS, DRUGSTORES, CREDIT CARD INSERTS... THEY ARE EVEN SELLING IT USING SANSONITE AND AMERICAN EXPRESS BRANDS.  PLEASE KEEP MY IDENTITY NON DISCLOSED.  I WORK WITH INNOVATION DISTRIBUTING, AN AMERICAN COMPANY, THAT OWNS THE LICENSE RIGHT OF THE LIFEHAMMER, THE ORIGINAL.  WITH 20 YEARS OF EXPERIENCE, LIFEHAMMER IS REGULARLY TESTED BY THE GERMAN LAB T.U.V., ENDORSED BY MANY TRAFFIC SAFETY ORGANIZATIONS, APPROVED BY THE GENERAL SERVICES ADMINISTRATION, USED AND RECOMMENDED BY NUMEROUS POLICE AND FIRE DEPARTMENTS.  FOR THE PAST 5 YEARS WE HAVE BEEN PROMOTING  LIFEHAMMER'S CONCEPT IN THE CONSUMER, CORPORATE, PUBLIC SAFETY, MANUFACTURE AND GOVERNMENTAL AREAS TO EDUCATE THE NATION AND HELP MAKE THE ROAD A BIT SAFER.  I HOPE THAT ABOVE INFORMATION WILL BE TO YOUR INTEREST. LET ME KNOW IF I CAN BE FURTHER TO YOUR ASSISTANCE. THANK YOU!*JB",
        "vin": null
    }
]