[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/07/2003",
        "dateOfIncident": "12/15/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "HUMMER",
                "productModel": "H2",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A RETIRED U.S ARMY TRANSPORATION OFFICER, WITH A DEGREE IN TRANSPORTATION FROM INDIANA UNIVERSITY.  I'M ALSO A CURRENT AIR TRAFFIC CONTROL SPECIALIST IN RENO NEVADA.  ON SEVERAL OCCASIONS (AT LEAST 5) DURING THE PAST 2 MONTHS I HAVE FOLLOWED A POV IN THE HOURS OF DARKNESS WITHOUT ANY TAILIGHTS ILLUMINATED.  THE HEADLIGHTS WERE ON, BUT THE DRIVER WAS UNAWARE OF THE FACT THAT THEIR COMPLETE LIGHTING SYSTEM WAS NOT ON.  THE REASON FOR THIS OVERSIGHT WAS THE FACT THAT THE AUTOMATIC DAYTIME HEADLIGHTS WERE ON, AND THE DRIVER THOUGHT THEY HAD FULL VEHICLE LIGHTING.  I ADDITIONALLY EXPERIENCED THIS WHEN I PURCHASED MY NEW CAR IN MID DECEMBER, WHEN ONCE AT NIGHT I BEGAN TO DRIVE WITH MY HEADLIGHTS ON, BUT LUCKILY SOON NOTED THAT THE REST OF MY LIGHTING WAS NOT ACTIVATED.    THE POINT OF THIS ADVISORY TO YOU IS THAT I BELIEVE THAT MANY TERRIBLE REAR END TYPE ACCIDENTS LIE AHEAD OR MAY HAVE ALREADY OCCURRED, DUE TO THIS POSSIBLE OVERSIGHT OF DRIVERS, AND IT IS NOT REALLY OF THEIR OWN FAULT.    SOLUTION IS TO TAKE IMMEDIATE ACTION TO CORRECT THIS PROBLEM BY ADVISING ALL AUTO MAKERS TO HAVE A LIGHT SENSOR INSTALLED THAT WILL NOT ALLOW THE DAYLIGHT HEADLIGHTS TO AUTOMATICALLY ACTIVATE PAST DUSK.  ADDITIONALLY SEND OUT A NATION WIDE AWARENESS NOTICE TO ALL DRIVERS TO BE ON THE LOOKOUT FOR THIS POTENTIAL PROBLEM, ESPECIALLY THOSE WITH DAYLIGHT SAFETY HEADLIGHTS.",
        "vin": ""
    }
]