[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/26/2003",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10008156,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "ION",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR ADMINISTRATOR:    I PURCHASED A 2003 SATURN ION 2 ON DECEMBER 28, 2002.  I REPORTED TO BOTH THE SATURN CORPORATION AND THE DEALERSHIP THAT SOLD ME THE VEHICLE THAT THE VEHICLE WASN'T SAFE AFTER DRIVING THE VEHICLE FOR 80 MILES.    THE DEALER AGREED TO FIX THE VEHICLE, SO I TOOK THE VEHICLE IN AND THE DEALERSHIP ON 4 SEPERATE OCCASIONS , TWO OF WHICH THE DEALER REFUSED TO ACCEPT MY VEHICLE. ON JANUARY 10, NOT TWO WEEKS AFTER THE PURCHASE OF THE VEHICLE, SATURN KEPT THE VEHICLE FOR NEARLY ONE WEEK.  AFTER THE LOAN WAS APPROVED ON THE VEHICLE, THE DEALERSHIP RETURNED THE VEHICLE TO ME AND SAID THE VEHICLE WAS FREE OF DEFECTS.  AFTER NEARLY BEING KILLED IN THE VEHICLE TWICE BECAUSE THE VEHICLE STALLED ON THE FREEWAY WHEN I ATTEMPTED TO ACCELERATE, I TOOK THE VEHICLE TO THE SATURN DEALERSHIP IN CERRITOS, CALIFORNIA.  THE DEALERSHIP WHERE I PURCHASED VEHICLE REFUSED TO HONOR MY WARRANTY, REFUSED TO ACCEPT THE VEHICLE AND TOLD ME THAT THEY WOULD NOT ACCEPT THE VEHICLE.  I HAD 1,200 MILES ON CAR AND I HAD NOT HAD THE VEHICLE IN MY POSSESSION FOR 30 DAY BECAUSE THE VEHICLE HAD BEEN IN THIS DEALERSHIP'S AUTO REPAIR SHOP FOR 5 DAYS.  WHEN I WAS NEARLY KILLED IN THE VEHICLE FOR THE LAST TIME, I WAS FORCED TO HAVE THE DEFECTIVE VEHICLE TOWED AND LEFT AT THE DEALERSHIP.  SATURN REFUSED ME TOW SERVICE ON THIS VEHICLE, ALTHOUGH I HAVE PURCHASED TOW SERVICE.   SATURN IS NOW IN POSSESSION OF THE VEHICLE AND HAS BEEN SINCE FEBRUARY 1, 2003.  THE SATURN OF CERRITOS, MANAGER, MR. VANCE THREATENED ME ON FEBRUARY 1, 2003, AND TOLD ME THAT I RETURNED THE VEHICLE THAT SATURN WOULD RETURN THE VEHICLE TO AMERICREDIT, THE COMPANY THAT FINANCED THE CAR AND WOULD HAVE MY CREDIT RUINED - IF I DID NOT KEEP THE DEFECTIVE VEHICLE.  THE SATURN CORPORATION MANAGER, DONNA LANSFIELD, ALSO THREATENED ME AND IN AN UNPROFESSIONAL, THREATENING MANNER ATTEMPTED TO FORCE ME TO RETRIEVE SATURN'S DEFECTIVE VEHICLE THAT NEARLY KILLED ME TWICE NOW. *JB",
        "vin": "1G8AJ52F73Z"
    }
]