[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/27/2003",
        "dateOfIncident": "06/04/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "EXPEDITION",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "GRABBER AW",
                "productModel": "P27560R17",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 2000 FORD EXPEDITION.  LAST JUNE, JUST AFTER HAVING THE CAR SERVICED, I NOTICED MY GENERAL GRABBER TIRES DELAMINATING AND COMING APART.  I IMMEDIATELY CALLED MY LOCAL FORD DEALER AND WAS TOLD THERE WAS NO RECALL ON THE TIRES, BUT TO SAVE ANY RECEIPTS WHEN I PURCHASE NEW TIRES IN THE EVENT THERE IS A RECALL.  I REPLACED THE TIRES AND SAVED THE RECEPT.  I RECEIVED A RECALL NOTICE FROM FORD LATER IN THE YEAR.  WHEN I CALLED THEM THEY SAID TO BRING THE VEHICLE IN.  I EXPLAINED THAT I HAD REPLACED THE TIRES.  I WAS TOLD MY CLAIM WAS WITH CONTINENTAL TIRE, NOT FORD, AND THAT CONTINENTAL WOULD BE CONTACTING ME.  THEY NEVER DID CONTACT ME AND I FINALLY HAD THE OPPORTUNITY TO CALL CONTINENTAL TIRE WITH A PHONE NO. GIVEN TO ME BY FORD.  CONTINENTAL TIRE NOW SAYS THAT THE RECALL IS OVER AND THERE IS NO WAY TO RECOUP MY EXPENSES.    I NEED YOUR HELP.  IN MY CASE NO ONE WAS INJURED BECAUSE I MADE A VEHICLE INSPECTION AND HAD THE TIRES REPLACED (BEFORE THE RECALL WAS MADE).  IF THERE HAD BEEN A DEATH, WE'D BE IN COURT RIGHT NOW, BUT BECAUSE THERE WASN'T I'M BEING PENALIZED FOR THE COST OF THE TIRES AND BEING VIGILANT.  *JB",
        "vin": "1FMRU17L4YL"
    }
]