[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/27/2003",
        "dateOfIncident": "12/07/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008220,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "PLYMOUTH",
                "productModel": "NEON",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1996 NEON WHICH I PURCHASED USED IN AUGUST OF 2001 WITH ONLY 35,000  MILES ON IT.  ABOUT 3 MONTHS AGO I TOOK IT IN FOR MY MONTHLY OIL CHANGE/LUBE AND WAS TOLD THAT MY HEAD GASKET WAS CRACKED AND THAT I WOULD NEED TO GET IT REPLACED.  THEY TOLD ME IT WOULD BE A $1200 REPAIR.  I BEGAN TO CALL AROUND AND EACH PLACE, WHEN I MENTIONED THE PROBLEM AND THE YEAR/MAKE/MODEL OF MY CAR, TOLD ME THAT THEY COULD HAVE GUESSED WHAT THE REPAIR WAS THAT I NEEDED JUST BY ME GIVING THEM THE TYPE OF CAR I DRIVE.  I'VE CALLED 5 PLACES NOW TO GET A QUOTE ON THIS REPAIR AND PRICES RANGE ANYWHERE BETWEEN $700 - $1200, DEPENDING ON THE SHOP I USE.  BY THE WAY - I LOSE ABOUT A QUART OF OIL PER WEEK.    I WANTED TO DO A LITTLE RESEARCH TO SEE HOW COMMON OF A PROBLEM THIS IS, SO I WENT ON THE INTERNET AND FOUND SO MANY COMPLAINTS THAT IT BLEW MY MIND!  I FOUND OUT THAT THERE WAS A DEFECT IN THE HEAD GASKET DESIGN IN PRE-99 MODELS AND CHRYSLER KNEW ABOUT IT. IT WAS NEVER RECALLED, BUT AS FAR AS I AM CONCERNED IT IS A HUGE CONSUMER FRAUD ISSUE. I HAVE FOUND THAT 32% OF NEON OWNERS HAVE HAD TO REPLACE THIS PART - WHICH IS OBVIOUSLY EXTREMELY HIGH.  IT REALLY IS TOO BAD THAT CHRYSLER DID NOT STAND UP FOR THEIR PRODUCT RIGHT AWAY BY VOLUNTARILY ISSUING A RECALL OR BY AT LEAST FIXING THE CARS THAT WERE AFFECTED BEFORE THE PART WAS REDESIGNED.     I CANNOT AFFORD A REPAIR LIKE THIS ON MY CAR - I BOUGHT A NEON BECAUSE I THOUGHT THEY WERE RELIABLE CARS WITH GREAT GAS MILEAGE, WHICH I NEED FOR MY LONG COMMUTE TO WORK EVERY DAY.  IF THIS IS A PROBLEM THE MANUFACTURER KNEW ABOUT, I FEEL THAT THEY SHOULD BE PAYING FOR THE REPAIR.  WHAT CAN I DO?! *JB",
        "vin": "1P3ES47C3TD"
    }
]