[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/27/2003",
        "dateOfIncident": "06/08/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008228,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "JETTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO. MY COMPLAINT IS ABOUT THE 2002 JETTA 1.8T. I PURCHASED MINE IN MAY 2002 FROM CURRAN VW IN STRATFORD, CT. WITH JUST 400 MILES ON THE CAR, AN IGNITION COIL MALFUNCTIONED, AND THE SHIFTING PERFORMANCE WAS VERY POOR. IN NOVEMBER, THE SECOND IGNITION COIL MALFUNCTIONED. I WAS PLACED IN A RENTAL FOR ABOUT 10 DAYS. MADE THE TRIP BACK TO MA TO PICK UP THE CAR, GOT BACK TO CT JUST TO HAVE THE THIRD IGNITION COIL MALFUNCTION,  LESS THAN ONE WEEK LATER. THEN, TWO WEEKS AGO THE CAR BEGAN, ONCE AGAIN, TO SHAKE VIOLENTLY AND LOSE POWER ON I-95 AT 6:30AM ON MY WAY TO WORK. I WAS FORCED TO TAKE THE CAR DOWN TO 20MPH. I DROPPED THE CAR OFF AT VW FOR INSPECTION AND WAS TOLD IT WAS FINE AND THAT IT WAS NOT THE IGNITION COIL, BUT THAT THEY RESET THE COMPUTER FOR MY PEACE OF MIND. I WAS ALSO TOLD THAT DESPITE WHAT I'VE READ ABOUT THE RECENT RECALL RE: THE IGNITION COILS THAT I HAD TO WAIT UNTIL THEY FAILED BEFORE HAVING ANY REPLACED. (THE ONE REPLACED LAST MAY WAS REPLACED WITH THE SAME POOR QUALITY COIL.) IT'S ABOUT A WEEK LATER AND THE CAR HAS BEEN TOWED FOR THE 4TH IGNITION COIL FAILURE. I CAN'T TAKE IT. I FEEL TOTALLY UNSAFE IN THIS CAR. I DRIVE IN THE SLOW LANE SO AS TO BE CLOSE TO THE BREAK DOWN LANE. HOW ANYONE CAN SAY THAT THIS IS NOT A SAFETY ISSUE IS BEYOND ME, WHEN THE CAR SIGNIFICANTLY LOSES POWER WITH NO WARNING - AND ON A HIGHWAY WHERE CARS ARE TRAVELING AT 60-80 MPH! THIS IS A VERY SERIOUS ISSUE THAT MUST BE ADDRESSED. THIS CAR WAS A TOTAL WASTE OF $25K+. WHAT A TERRIBLE FIRST NEW CAR BUYING EXPERIENCE.*JB",
        "vin": "3VWSE69M02M"
    }
]