[
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,AIR BAGS,SEAT BELTS,LATCHES/LOCKS/LINKAGES,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/21/2004",
        "dateOfIncident": "12/12/2002",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008249,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "X-TYPE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BOTH DRIVE SHAFTS , FUEL TANK AND  SUNROOF WERE REPLACED, THE SUNROOF  MALFUNCTIONED-3 OR MORE TIMES, THE BLINKERS AND LIGHTS FAILED, TIRES BLEW OUT, AIR BAG LIGHT REMAINED ON, THE PASSENGER FRONT SEAT BELT MALFUNCTION, TRUNK LATCH ISSUES, HEATING AND AC SYSTEM HAD GONE OUT, SURGE IN ENGINE ON ACCELERATION, RUBBING NOISE IN STEERING COLUMN, CONSTANT WHINING NOISE IN ENGINE, FUEL GAUGE NOT WORKING, ODOMETER STOPPED WORKING WHILE ON THE FREEWAY, NO BRIGHT LIGHTS EXCEPT WHEN THE CAR WAS SHUT OFF, INTERIOR LIGHTS REMAINED ON AFTER THE CAR WAS SHUT OFF, SAFETY LATCH ON CONSOLE  FAILED TWICE, BURNING SMELL FROM THE ENGINE 3 TIMES. PROBLEMS HAVE BEEN ONGOING SINCE PURCHASE OF CAR APPROXIMATELY 12/2002.  *JB   THE RUBBING NOISE OCCURRED WHEN THE VEHICLE WAS TURNED LEFT, THE CENTER CONSOLE ARM REST MOVED BACKWARD AND FORWARD WHILE THE VEHICLE WAS IN MOTION, THE DRIVER'S SEAT BELT SHOULDER PIVOT MADE A SQUEAKING NOISE WHEN IN MOTION, THE SEAT BELTS DID NOT RETRACT, THE AIR BAG WARNING LIGHT STAYED ON UNTIL THE KEY AS SWITCHED OFF, AND THE TURN SIGNALS WERE INOPERATIVE.  (THE DEALER REPLACED THE BUCKLE)   *SC  *JB",
        "vin": "SAJEA51C82W"
    }
]