[
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2003",
        "dateOfIncident": "02/10/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008284,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "STRATUS",
                "productYear": "1996",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1996 DODGE STRATUS HAS 37,000 MILES. IN FEBRUARY  2002 I TOOK IT TO SEARS FOR AN OIL CHANGE. ALSO ASKING THEM TO SEE WHERE OIL WAS LEAKING (NOTICED OIL ON CONCRETE IN GARAGE). THEY SAID VALVE COVER GASKET SO I GOT THAT FIXED FOR ABOUT $72.00  ALL ALONG THINKING THAT THERE WERE NOT THAT MANY MILES DRIVEN. AND TO BAD THE WARRANTY HAD JUST EXPIRED. I THINK IT WAS 5 YEARS OR 25,000 MILES. WITHIN THE NEXT 2 MONTHS OIL WAS LEAKING AGAIN. TOOK IT IN AND END UP PAYING $702.00 BECAUSE THE HEAD GASKET WAS BAD. THE MECHANIC SHOWED IT TO ME AND JOKINGLY SAID ISN'T IT FUNNY HOW THIS CAN BE SO CHEAP THAT IT ALMOST WAS DETERIORATED AND THE WARRANTY 5YRS IS UP. EVEN THOUGH I HAD NOT DROVE 25,000 MILES YET. WELL THE FINAL BLOW , ON OCT 10,2002 I KEPT HEARING A CLUNK WHEN I MADE LEFT OR RIGHT TURN. TOOK IT TO THE  RHODEN DODGE. WE WERE TOLD THAT RIGHT & LEFT TIE ROD ENDS WERE LOOSE & SWAY BAR LINKS WORN & LOOSE(2 TIE RODS,& 2 BALL JOINTS) I ASKED THEM TO PERFORM AN ALIGNMENT AND TRANSMISSION FLUSH ,TOTALING $779.00 BECAUSE WHAT ELSE WILL BREAK. WELL IN JAN. 2003 THE BRAKES WERE ON MEDAL ANOTHER $190.00. I'M AFRAID TO TAKE IT IN TO THE GARAGE. THERE IS ONLY  37,000 MILES DRIVEN AND I AM HEARING ANOTHER NOISE WHEN I TURN LEFT AND RIGHT. WHEN THE BRAKES WERE FIXED THEY TOLD ME THEY TEST DROVE IT AND HEARD NOTHING . SOME HOW IT SEEMS THAT 5 YRS OR 25,000 MILES IS TELLING ME THAT I SHOULD HAVE SOLD IT BEFORE THAT BECAUSE I THINK THE COMPANY KNEW THINGS WOULD START HAPPENING. IS THERE ANYTHING YOU CAN DO TO HELP ME. PLEASE, THIS CAR IS A LEMON WITH ONLY 37,000 MILES.*JB",
        "vin": "1B3EJ46X8TN"
    }
]