[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2003",
        "dateOfIncident": "09/19/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "PONTIAC",
                "productModel": "GRAND PRIX",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL ON 1998 GRAND PRIX GT. (RACK & PINION) PONTIAC REFUSES TO REPAIR THEIR RECALL ON THE 98 GRAND PRIX....  HERE IS A LETTER I SENT THEM.....I BECAME AWARE OF THE CURRENT RECALL AND TOOK MY CAR TO THE  DEALER. THE STEERING GEAR CONDITION HAS HAPPENED TO MY CAR. THE RACK AND PINION HAS RELEASED WHICH HAS CAUSED MY CAR TO HAVE NO POWER STEERING TO THE LEFT. THIS OCCURS WHEN DRIVING AT LOW SPEEDS. IT HAS MADE IT VERY DIFFICULT TO DRIVE THECAR. I WAS INFORMED THAT MY VIN NUMBER WAS NOT RECALLED AT THIS TIME. THE SERVICE MANAGER AT COGGIN PONTIAC IS AWARE OF THE CONDITION OF THE CAR. HE WAS ABLE TO DRIVE IT AND STATED THAT THE CAR HAS THE EXACT PROBLEM THAT IS BEING  RECALLED. THE SERVICE MANAGER SAID WE COULD FIX THE PROBLEM AND GET  REIMBURSED FOR THE SERVICE IF THE CAR IS RECALLED. THIS PART IS VERY  EXPENSIVE AND I DO NOT WANT TO TAKE THE CHANCE THAT THE CAR IS NOT ONE OF THE ONES BEING RECALLED. I TALKED TO PONTIAC CUSTOMER SERVICE  MANAGER ON THE PHONE AND SHE REFERRED ME TO EVERIT HOWELL, I HAVE  NOT HAD A CHANCE TO CONTACT HIMYET. SHE DID STATE THAT CAR WOULD  NOT BE FIXED BECAUSE OF THE VIN NUMBER. I FIND IT STRANGE THAT YOU  ARE RECALLING THE SAME CAR I OWN FOR THE SAME PROBLEM I HAVE BUT  BECAUSE MY VIN NUMBER IS NOT REPORTED THE CAR WILL NOT BE FIXED.  I LOVE MY PONTIAC AND I WOULD HATE FOR A PROBLEM LIKE THIS TO  ENCOURAGE ME TO GO TO A DIFFERENT MANUFACTURER FOR MY NEXT CAR.  I THINK THEY NEED TO LOOK MORE INTO THIS RECALL. THERE IS NO TELLING HOW MANY OTHER CARS ARE OUT THERE JUST LIKE MINE.*JB",
        "vin": "1G2WP12K4WF"
    }
]