[
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/02/2003",
        "dateOfIncident": "01/29/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008337,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4 RUNNER",
                "productYear": "1995",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TAKEN TO PRIVATELY OWNED SERVICE AND OWNER WAS TOLD THAT A CYLINDER IS BLOWN AND THAT THE VEHICLE NEEDS A NEW ENGINE, THIS WAS DUE TO HEAD GASKET PROBLEM WITH THE VEHICLE.  THE OWNER HAD THE HEAD GASKET REPLACED DURING THE LIMITED RECALL, BUT HAS SINCE HAD OIL LEAKAGE, ENGINE WAS SLUGGISH, THE ENGINE CHECK LIGHT WAS ON CONTINUOUSLY, WHITE/TOXIC BILLOWING SMOKE FROM EXHAUST AMONG OTHER PROBLEMS.  I DO NOT FEEL THAT IT IS MY FINANCIAL RESPONSIBILITY TO REPLACE ENGINE OR ANY OTHER COMPONENTS INVOLVED DUE TO TOYOTA'S HEAD GASKET PROBLEMS.  I WAS TOLD THAT THE PROBLEM WAS TAKEN CARE OF ON THE FIRST REPLACEMENT OF HEAD GASKET AND NOW I FIND OUT THAT THE PROBLEM IS NOT.  OTHERWISE, VEHICLE IS IN EXCELLENT SHAPE.  ALSO, NEVER RECEIVED RECALL NOTICE, HAPPENED TO RUN INTO ANOTHER RECALL VICTIM AT ENTERPRISE RENTALS AND LOOKED INTO THE MATTER AS A RESULT OF THE CONVERSATION. I AM DEFINITELY NOT RECOMMENDING TOYOTA AS A RELIABLE/CONSUMER SENSITIVE COMPANY ANYMORE.  A SOLUTION TO THIS PROBLEM WOULD CHANGE MY MIND.  AS OF NOW, MY VEHICLE IS FAILING AND I DO NOT FEEL SAFE DRIVING IT.    *JB",
        "vin": "JT3VN39W4S8"
    }
]