[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/03/2003",
        "dateOfIncident": "08/22/2002",
        "fire": false,
        "manufacturer": "Mercedes-Benz USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008357,
        "products": [
            {
                "manufacturer": "Mercedes-Benz USA, LLC",
                "productMake": "MERCEDES BENZ",
                "productModel": "C230",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS BEGAN AT 10,000 MILES AUG 2002.  BROUGHT CAR TO DEALERSHIP 3 TIMES SINCE OCT 2002 AND DEALERSHIP SAY THEIR DIAGNOSTIC TESTS SHOW NO PROBLEM AND THE STALLING/ROUGH IDLE IS NORMAL.  THEY CAN'T FIND ANY ISSUES. *JB  CAR STALLS (DEPENDING ON THE WEATHER)- WORSE ON HUMID DAYS, BUT EVERYDAY RUNS REALLY ROUGH UPON START UP.  50% OF THE TIME WILL COMPLETELY STALL.  OTHER 50% IF I GAS THE CAR, IT RUNS REALLY ROUGH, BUT GETS ME OUT OF MY DRIVEWAY.  CAR ROUGHLY SWITCHES TO DRIVE.  VERY LITTLE POWER WHEN SWITCHING TO DRIVE AND DRIVING DOWN THE ROAD.  THE CAR REDLINES UNTIL I GET TO ABOUT 20 MPH AND DOESN'T SEEM TO SWITCH TO SECOND (I HAVE AN AUTOMATIC) UNTIL I GET TO 20-25.  POWER STEERING IS NOT WORKING ON COLD DAYS- VERY DIFFICULT TO TURN WHEEL UNTIL CAR GETS WARMED UP. EVEN ON DAYS WHEN ITS 40 DEGREES F.  ON SEVERAL OCCASIONS WHEN IT HAS BEEN COLDER THAN 15 DEGREES, THE STEERING WHEEL IS COMPLETELY UPSIDE DOWN AND YOU WOULD THINK THE CAR WOULD NOT DRIVE STRAIGHT- IT DOES!- WHICH MEANS THE STEERING WHEEL AND POWER STEERING IS NOT WORKING OR MY CAR WOULD NOT BE GOING STRAIGHT. THIS IS VERY DANGEROUS AND COULD CAUSE AN ACCIDENT AND I HAVE NO IDEA WHICH WAY MY TIRES ARE FACING!   THE WORST AND MOST DANGEROUS PART OF THIS IS:  ON 4 OCCASIONS SINCE DECEMBER 2002 UNTIL FEBRUARY 2003, WHILE DRIVING ON HIGHWAY AT APPROX 55 MPH, WENT OVER A SLIGHT BUMP IN THE ROAD AND COMPLETELY LOST POWER IN THE VEHICLE AND ALL WARNING LIGHTS (EVERY SINGLE ONE) CAME ON.  CAR IMMIDIATELY HALTED TO ABOUT 3 MPH, THE CAR BEHIND ME ALMOST RAREENDED ME.  I HAD MY FOOT ALL THE WAY DOWN ON THE GAS (I WAS IN THE MIDDLE OF THE ROAD) AND THE POWER CAME BACK ON WITHIN 30 SECONDS, AND I ALMOST RARE-ENDED THE CAR IN FRONT OF ME WHEN MY CAR SURGED FORWARDED.",
        "vin": "WDBRN47JX2A"
    }
]