[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2003",
        "dateOfIncident": "01/07/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000831,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM ONE OF THE MANY AUDI OWNERS THAT HAVE EXPERIENCED A PROBLEM RELATING TO THE IGNITION COILS OF MY 2002 A4 QUATTRO.  LIKE OTHER DRIVERS, I WAS OPERATING MY VEHICLE ON AN INTERSTATE HIGHWAY WHEN MY ENGINE BEGAN TO LOOSE POWER, WHILE SIMULTANEOUSLY THE ENTIRE CARE BEGAN VIBRATING VIGOROUSLY.  AFTER ONE FLATBED TRIP TO THE LOCAL DEALER, AND I WAS INFORMED OF A MALFUNCTION OF ONE OF THE FOUR IGNITION COILS ON MY CAR WITH A TOTAL OF 12,000 MILES OF USE.  THIS PROBLEM WAS NOT NEARLY AS AGGRIVATING AS THE INFORMATION WHICH I HAVE LEARNED FROM THE SERVICE TECH AT TWO SEPARATE DEALERSHIPS AND 3 AUDI ENTHUSIAST WEBSITES: THIS IS A PROBLEM WELL-KNOWN TO AUDI, THIS IS A PROBLEM THAT HAS BEEN OCCURRING WITH FREQUENCY FOR ABOUT A YEAR, THIS IS A PROBLEM THAT AUDI HAS YET TO SUCESSFULLY SOLVE.  I HAVE BEEN TOLD BY MY DEALER THAT AFTER REPLACING JUST ONE OF THE FOUR COILS PER WARRANTY AGREEMENT, WITH A COIL IDENTICAL TO THE ONE THAT HAS FAILED (A REPLACEMENT IS NOT READY/AVAILABLE) THAT I AM LEFT TO OPERATE MY VEHICLE WITH THE FULL PROSPECT OF FUTURE FAILURE FROM THE OTHER THREE COILS THAT AUDI REFUSES TO REPLACE.  THIS SOLUTION STRICKES ME AS ILLOGICAL, UNSAFE AND UNFAIR TO THE CONSUMER.  AUDI HAS CERTAINLY PRIDED ITSELF AS A MANUFACTURER OF PREMIUM AUTOMOBILES.  THE DECISION TO PROVIDE CONSUMERS SUCH AS MYSELF WITH MINIMAL SERVICE SOLUTIONS, AS WELL AS A FUNDAMENTAL LACK OF INFORMATION IN REGARDS TO THIS APPARENTLY WIDESPREAD PROBLEM IS CONTRADICTORY TO THIS FIRM'S INTENTIONS OF ACQUIRING, RETAINING AND SATISFYING CUSTOMERS.",
        "vin": ""
    }
]