[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2002",
        "dateOfIncident": "11/23/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000084,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAILBLAZER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN FOR SERVICE 6 TIMES. VEHICLE PURCHASED IN OCT 01. FIRST INSTANCE WAS JAN 2002. WAS DRIVING THE VEHICLE AT APPROX 65-70 MPH IN A4WD. VEHICLE SHIFTED DOWN INTO 4LO CAUSING LOSS OF POWER & CONTROL. SERVICE 4WD LIGHT CAME ON. VEHICLE WOULD NOT COME OUT OF 4WD UNTIL IT HAD BEEN PARKED & SHUT OFF. MODE SWITCH ON DASH WAS REPLACED FOLLOWING INCIDENT. ONE WEEK LATER, VEHICLE SHIFTED INTO 4HI WHILE DRIVING IN 2HI. MODE SWITCH WAS AGAIN REPLACED. AUGUST 2002, PROBLEMS WERE AGAIN EXPERIENCED AS 4HI AND 4LO LIGHTS WOULD FLASH SIMULTANEOUSLY. DEALER REPLACED TRANSFER CASE SHIFT MODULE. NOV 2002 WHEN SWITCHING INTO A4WD, NO LIGHTS WOULD ILLUMINATE. VEHICLE WAS TAKEN BACK TO DEALER. AUTOMATIC TRANSFER CASE UPDATE WAS INSTALLED. FIVE DAYS LATER WHILE IN A4WD, LIGHTS FLASHED FOR 4HI. SHIFTING WAS COMPLETED. WHILE STOPPED AT A STOPLIGHT, 4LO LIGHT BEGAN FLASHING. WHEN PRESSING GAS LOSS OF POWER WAS EXPERIENCED. LIGHTS CONTINUED TO FLASH UNTIL VEHICLE WAS PUT IN NEUTRAL. VEHICLE SHIFTED TO 4LO. EACH TIME SHIFTING WAS COMPLETED THERE WAS A JERK IN THE REAR OF VEHICLE. SERVICE 4WD LIGHT CAME ON. VEHICLE WOULD NOT SHIFT OUT OF 4LO UNTIL TURNED OFF. DEALER TEST DROVE FOR SEVERAL DAYS & COULD NOT DUPLICATE PROBLEM. UPON PICKING UP THE VEHICLE WAS TOLD THAT THEY HOPED WHATEVER WAS CAUSING THE PROBLEMS WOULD COMPLETELY FAIL & MAKE THE NEEDED CORRECTION OBVIOUS. UPON LEAVING THE DEALERSHIP IN 2HI, WITHIN 2 MILES, 4HI LIGHT BEGAN TO FLASH, SHIFTED DOWN & SERVICE 4WD LIGHT CAME ON. RETURNED TO DEALERSHIP WITHOUT TURNING OFF OR PARKING SO THAT THEY COULD SEE THE EXACT STATE. RAN A TEST & INDICATED THAT THE SWITCH HAD MALFUNCTIONED. SWITCH WAS REPLACED ON SITE.     WE HAVE BEEN IN CONTACT WITH CHEVROLET'S CUSTOMER SERVICE. IT IS ONLY A MATTER OF TIME BEFORE A SERIOUS INCIDENT OCCURS AS A RESULT OF THEIR PRODUCT'S MALFUNCTION. MECHANIC AT THE DEALERSHIP SAID THEY ARE INCREASINGLY SEEING SIMILAR PROBLEMS WITH THE 2002 CHEVROLET TRAILBLAZER & NUMEROUS OTHER MECHANICAL PROBLEMS.",
        "vin": "1GNDT13SX22"
    }
]