[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2003",
        "dateOfIncident": "01/08/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000871,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4RUNNER",
                "productYear": "1990",
                "type": "Vehicle"
            }
        ],
        "summary": "1990 TOYOTA 4-RUNNER INTERMITTANTLY JUMPS IN AND OUT OF OVERDRIVE AT APPROXIMATELY 55 MILES PER HOUR OR HIGHER WHEN HIGHWAY DRIVING, CAUSING INCREASE IN GAS MILEAGE AND HIGH RPMS ON THE ENGINE.  IN 2001 I WENT TO TOYOTA FOR THIS PROBLEM AND THEY TOLD ME I WOULD NEED TO REPLACE THE TRANSMISSION SO I SHOULD DRIVE THE VEHICLE UNTIL I COULD NOT DRIVE IT ANYMORE.  AT THAT POINT I SHOULD HAVE THE TRANSMISSION REPLACED.   AFTER EXTENSIVE RESEARCH I LOCATED TSBS FOR THIS VEHICLE AND FOUND ONE THAT ADDRESSES THIS ISSUE (TSB ATRATB351 DATED JAN 96).  THIS MONTH 1/2003 I RETURNED TO TOYOTA WITH THE SAME COMPLAINT AND THEY TOLD ME IT WOULD COST APPROXIMATELY $150.00 TO PERFORM THIS TSB.  I TOLD THEM IF THEY HAD PERFORMED IT THE PREVIOUS YEAR WHEN I HAD THE HEAD GASKETS REPLACED IT WOULD NOT HAVE COST ME ANYTHING SINCE THE ENGINE WAS ALREADY APART FOR OTHER WORK.  THE SERVICE MANAGER SAID HE COULD NOT ADDRESS THE RECOMMENDATION AND FINDINGS OF THEIR WORK FROM A YEAR AGO.  I CALLED ANOTHER DEALER AND THEY SAID IT WOULD COST $71.00 FOR THE WORK TO BE PERFORMED.  AS FAR AS I AM CONCERNED SINCE A TSB HAS BEEN ISSUED IT IS BASICALLY ADMITTING THAT THE VEHICLE HAS A PROBLEM AND PROVIDES THE DEALER/SERVICE DEPARTMENTS WITH THE FIX, SO WHY ARE THE SERVICE MANAGERS RELUCTANT TO PERFORM THE CORRECTION, BUT INSTEAD RECOMMEND AN TRANSMISSION CHANGE?",
        "vin": "JT3VN39WXL0"
    }
]