[
    {
        "components": "SERVICE BRAKES, AIR,POWER TRAIN,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "01/09/2003",
        "dateOfIncident": "09/21/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10000876,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "C BODY",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "I NOTIFIED THE FIRST INCIDENT TO THE DEALER ABOUT ITS SPEED SENSOR, OVER THE PHONE, WHICH BLEW AWAY JUST AFTER THE TWO WEEKS OF BUYING THIS CAR FROM HIS SHOWROOM.    LAST MONTH, THE BREAK WENT BAD AND WERE NOT COVERED UNDER THE WARRANTY, I HAD TO END UP REPLACING THE ROTOR AND COMPLETE BRAKE SET, PAYING AROUND $300 FROM MY POCKET, FROM A MIDAS IN PENNSYLVANIA.     THE THIRD INCIDENT WAS MOST DANGEROUS, AND DON'T KNOW HOW I SAVED THE LIFE OF MY TWO LITTLE KIDS INCLUDING THE ONE WITH 11MONTHS INFANT BABY, THE AUTOMATIC TRANSMISSION BLEW AWAY WHILE DRIVING NORMALLY AND LOST CONTROL ON THE DOWNHILL, IN THE CITY OF NORRISTOWN, SINCE ITS BREAK AND THE ENTIRE SYSTEM WENT OFF DUE TO THE FAILURE OF AUTOMATIC TRANSMISSION AND I EVENTUALLY TOOK A GREAT RISK OF PULLING THE CAR ALL BE MYSELF ON THE SIDEWALK AND SOMEHOW PROTECTED EACH OF MY FAMILY MEMBERS.    THIS CAR IS PROVEN TO BE VERY UNSAFE AND DOES NOT WORTH THE LIFE OF MY KIDS AND MY FAMILY. I SINCERELY REQUEST TO HELP ME HAVE MY MONEY BACK AT THE EARLIEST. THE DEALER IS VERY RUDE AND ROUGH OVER THE PHONE AND DOES NOT LET ME SPEAK AT ALL. IT TOOK ME SEVERAL YEARS TO SAVE THIS MONEY TO BUY THIS CAR BUT THE DEALER HAS REALLY DECEIVED ME BY GIVING A FAULTY CAR. IT SEEMS TO ME THAT THIS CAR DID NOT UNDERGO FOR ANY KIND OF SAFETY INSPECTION AS LONG AS IT WAS SITTING IN HIS SHOWROOM AND I AM VERY AFRAID OF DRIVING NOW.  *TR",
        "vin": "2B4GP25GXXR"
    }
]