[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2002",
        "dateOfIncident": "11/20/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000009,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "VENTURE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 CHEVROLET VENTURE VAN, WARNER BROTHER'S EDITION, HAD THE TRANSMISSION FAIL AT 47,567 MILES.  I DID NOT HAVE AN EXTENDED WARRANTY PURCHASED AT THE TIME I BOUGHT THE VAN.  I HAD NOTICED WHEN I FIRST ACQUIRED THE VAN, THAT WHEN I PUT THE VAN IN DRIVE FROM REVERSE, THE TRANSMISSION SLIPPED NOTICEBLY.  ALSO, FROM A STOP THE TRACTION DEVICE SIGNAL WOULD COME ON PERIODICALLY AND THE TRANSMISSION SLIPPED AS I ACCELORATED.      I TOOK THE VAN TO THE DEALER, WHICH THEY FOUND THE FLUID WAS BURNT AND THE BANDS OR TORQUE CONVERTER WAS READY TO EXPLODE/COME OFF.  I HAD THE VAN SERVICED EVERY 3,000 MILES AND HAD DONE EVERYTHING ACCORDING TO THE SERVICE MANUAL.  NOTHING WAS SAID ABOUT BURNT FLUID. THE COST FO REPLACEMENT WAS $2710.00 PLUS TAX.  I WAS NOT A HAPPY CAMPER BUT NEEDED A VEHICLE FOR TRANSPORTATION.  THE $33,000.00 + VEHICLE WAS ONLY A LITTLE MORE THAN 2 YEARS OLD AND THE TRANSMISSION FROM THE FACTORY (OEM) WAS WARRANTEED FOR....36K MI.  THE NEW TRANSMISSION WAS WARRANTEED FOR....50K MI.!  WHY WAS THIS, I ASKED?  APPARENTLY, GM IS IN THE PROCESS OF UPGRADING THEIR WARRANTIES FOR POWERTRAIN AND BODY PARTS.  UNFORTUNETLY, I WAS LEFT OUT OF THE LOOP.  AFTER MUCH DISCUSSION WITH BOTH THE SERVICE MANAGER AND SALES REP., THEY WERE ABLE TO HAVE GM PAY HALF THE COST OF $1260.00. NOTICE THE PLUNGE IN COST AFTER GM GOT INVOVLED WITH THE PAYMENT?!?  THE DEALER WAS ABLE TO GET ME A LOANER CAR FOR ONLY \"1 DAY\", AS THEY TOOK \"6 DAYS\" TO GET THE PARTS AND HAVE THE VAN REPAIRED! AFTER RETURNING THE VAN WITH THE NEW AND IMPROVED TRANSMISSION, THE TECHNICIAN ADVISED ME TO KEEP A CLOSE LOOK AT THE COOLANT LEVEL, AS THERE WAS A LEAK COMING FROM THE INTAKE MANIFOLD AREA.  WHAT NEXT RIGHT?  NO MORE GM VEHICLES FOR ME!  THE TECHNICIAN GAVE NO EXPLANATION FOR THE TRANSMISSION FAILURE.  TO MAKE MATTERS WORSE I FOUND OUT THAT IN FORUMS ON THE INTERNET, THAT THERE ARE MANY OTHER VANS WITH SIMILAR AND THE SAME PROBLEMS THAT I HAVE/HAD! BEWARE AMERICA BEWARE!!!!",
        "vin": "1GNDX13E4YD"
    }
]