[
    {
        "components": "SUSPENSION,POWER TRAIN,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/10/2003",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000910,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MONTERO",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2 COMPLAINTS.  FIRST:  I HAVE HAD THE CAR CHECKED SEVERAL TIMES BY THE DEALER TO LOCATE A VERY LOUD NOISE COMING FROM THE FRONT OF THE CAR.  IT HAS TO BE IN SOMETHING THAT HAS TO DO WITH THE STEERING OR I GUESS SUSPENSION.  I HAVE HAD THE RIGHT FRONT HUB ASSEMBLY REPLACED, NEW TIRES AND A BRAKE JOB THAT I WASN'T SUPPOSED TO HAVE DONE ON THE TRUCK AND I STILL HAVE THE NOISE THAT HAS BEEN CONFIRMED BY THE DEALERSHIP TECHNICIAN.  WHEN DRIVING STRAIGHT, THE CAR HAS  LOUD HUM.  WHEN I STEER TO THE RIGHT AND THE WEIGHT OF THE TRUCK SHIFTS TO THE LEFT, THE NOISE GOES AWAY.  WHEN I STEER TO THE LEFT AND THE WEIGHT OF THE TRUCK SHIFTS TO THE RIGHT, THE NOISE GETS LOUDER.  I HAVEN'T NOTICED ANYTHING YET WITH THE STEERING THAT MIGHT SEEM DANGEROUS, BUT I FEEL VERY UNEASY ABOUT THE CAR.  I FEEL LIKE ONE DAY I AM GOING TO BE DRIVING AND SOMETHING WILL JUST SNAP.  THE MAIN THING IS I DON'T HAVE THE MONEY TO KEEP TAKING THE TRUCK TO DEALERSHIPS TO INVESTIGATE WHAT IS GOING ON AND FINDING NOTHING.*JB    SECOND, I WAS WONDERING IF THERE IS A STANDARD FOR THE PLACEMENT OF THE BRAKE AND GAS PEDALS WITH RESPECT TO THE PLACEMENT OF THE SEAT.  WHEN I PURCHASED THE TRUCK I REALIZED THAT THE SEATING WAS KIND OF WIERD BUT I DIDN'T THINK ANYTHING OF IT.  NOW, AFTER HAVING BEEN SEEN BY SEVERAL DEALERS. BECAUSE OF EXTREME PAIN IN MY BACK, BUT PRIMARILY MY HIPS TO THE POINT OF CONSIDERING SURGERY. THEY ASK IF I HAVE BEEN IN AN ACCIDENT OR FALLEN OR HAD ANY TRAUMA AND I HAVEN'T.  THEN I REALIZED THE PAIN DID NOT BEGIN UNTIL I GOT THIS TRUCK AND I PRIMARILY FEEL POORLY WHEN I AM DRIVING AND RIGHT AFTER I DRIVE. SO I REALLY STARTED PAYING ATTENTION TO THE POSITION MY BODY IS IN WHEN I AM DRIVING AND MY LEGS ARE IN A VERY AWKWARD POSITION IN ORDER TO REACH THE PEDALS.  THUS MY QUESTION: DO THESE TYPES OF STANDARDS FOR PEDAL PLACEMENT EXIST AND WHERE MIGHT I TAKE MY TRUCK TO HAVE IT MEASURED OR TESTED FOR COMPLIANCE.*JB",
        "vin": "JA4MW51R71J"
    }
]