[
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "01/19/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009727,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SIERRA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT SURGES, LOSS OF POWER WHILE IN MOTION, TRANSMISSION, LACK OF ACCELERATION.  *MR    AT PURCHASE, THE CHECK ENGINE LIGHT CAME ON THREE TIMES BEFORE LEAVING THE DEALERSHIP LOT. DEALER ADVISED THAT THE DEALER INSTALLED REMOTE STARTER OR ALARM SYSTEM WAS INTERFERING WITH FAULT SENSOR AND WAS NOT A PROBLEM.  HOWEVER  THE LOST POWER WHILE DRIVING,  INTERMITTENT SURGES AND STALL OUTS AT FREEWAY SPEED/85 MPH STILL EXISTED. ON ONE OCCASION CONSUMER WAS ALMOST IN AN ACCIDENT WHEN THE TRANSMISSION CLANGED BETWEEN GEARS AND THERE WAS POOR ACCELERATION.  CONSUMER HAD TO SHIFT INTO 4 WHEEL DRIVE OR MANUALLY DOWNSHIFT, OR TURN THE ENGINE OFF THEN ON AGAIN.  DEALER REPLACED PCM MODULE, FUEL PRESSURE REGULATOR AND GASKETS, FUEL PUMP ASSEMBLY.  HOWEVER PROBLEM STILL EXIST.  DEALERSHIP AGREED TO HOLD THE VEHICLE FOR FURTHER INVESTIGATION.  FURTHER INVESTIGATION REVEALED THAT THE WIRES FROM THE DEALER INSTALLED ACCESSORIES SUCH AS THE ALARM SYSTEM AND REMOTE STARTER OR ANTI-THIEF SYSTEM, AND FACTORY WIRE FROM PCM/VCM TO THE TRANSMISSION BE REPLACED.  DEALER REPLACED ALL IGNITION WIRING, WIRING FROM THE PCM/VCM TO THE TRANSMISSION AND REPLACED THE CONTROL VALVE BODY THAT REGULATES THE CRUISE CONTROL.  CONSUMER HAS BEEN WITHOUT VEHICLE FOR MORE THAN 21 DAYS AND WILL SEEK A REPLACEMENT VEHICLE IF WIRING REPAIRS DOES NOT REMEDY THE PROBLEM(S).    *TT   *NLM",
        "vin": "2GTEK19T721"
    }
]