[
    {
        "components": "EXTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/12/2003",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000964,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL ELECTRIC COMPANY",
                "productMake": "GE LIGHTING",
                "productModel": "HEADLAMP",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "MY COMPLAINT IS ABOUT A PROBLEM THAT I BELIEVE IS GETTING SERIOUSLY OUT OF HAND -- THAT OF INCREASING NUMBERS OF CARS AND SUVS ON THE ROAD WITH EXTREMELY BRIGHT HEADLIGHTS.*JB    I AM 52.  I DON'T BELIEVE IT'S A VISION PROBLEM.  FOR FIFTY YEARS OR SO, I GENERALLY HAD NO PROBLEM WITH ONCOMING HEADLIGHTS.  THEN CARS WITH THESE NEW HIGH-INTENSITY BEAMS STARTED APPEARING ON ROADS.  THESE LIGHTS ARE PAINFUL TO MY EYES.  THEY MAKE IT DIFFICULT FOR ME TO SEE.  I WANT TO AVERT MY EYES BUT I KNOW I MUST KEEP MY EYES ON THE ROAD.  AT FIRST I HOPED THEY WOULD JUST GO AWAY OR BE OUTLAWED, BUT THE PROBLEM HAS ONLY GOTTEN WORSE AS MORE NEW VEHICLES WITH THESE LIGHTS ENTER THE ROAD.  COMBINE HIGH-INTENSITY LIGHTS WITH AN SUV AND IT IS A PAINFUL AND BLINDING EXPERIENCE TO HAVE ONE OF THESE VEHICLES COMING HEAD-ON OR FROM BEHIND, WITH THE LIGHTS REFLECTING IN MY REARVIEW MIRRORS.    I SEE NO SENSE IN MAKING IT EASIER FOR THOSE WITH THESE OFFENSIVE LIGHTS TO SEE BETTER WHEN IT BLINDS EVERYONE ELSE.  BUT SOON EVERYONE WILL BE BLINDED WHEN ALL CARS HAVE THEM -- UNLESS IT IS STOPPED NOW.      PLEASE DO WHAT YOU CAN TO GET THESE BRIGHT LIGHTS OFF THE ROAD AND LET PEOPLE GO BACK TO THE TYPE OF HEADLIGHTS THAT WORKED JUST FINE FOR 100 YEARS.    THANK YOU,  WES COGAN",
        "vin": ""
    }
]