[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/08/2003",
        "dateOfIncident": "11/21/2002",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010129,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "INTREPID",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 INTREPID WITH 29000 ON IT AND  THE ENGINE HAS BLOWN ON IT  (PREMATURE ENGINE FAILURE) AND IT IS STILL UNDER WARRANTY AND DAIMLER CHRYSLER HAS REFUSED TO PAY COSTS RELATED TO THIS BECAUSE I DON'T HAVE ALL MY RECEIPTS FOR OIL CHANGES.  IT IS A 2.7 L ENGINE AND THEY ARE AWARE OF ENGINE SLUDGE PROBLEMS WITH THIS ENGINE AND THEY WILL NOT PAY ANY COSTS TOWARD A REPAIR BILL WHICH  THEY HAVE QUOTED AT $8000.00.  INITIALLY THE ENGINE CAUGHT ON FIRE AND THEY MADE MY INSURANCE COMPANY PAY FOR THE REPAIRS AND THEN 30 MILES LATER THE ENGINE WAS BLOWN AND THEY SAY BECAUSE MY HUSBAND DID THE OIL CHANGES AND WE DON'T HAVE ALL THE RECEIPTS FOR OIL PURCHASES THEY WILL NOT PAY THE BILL. WE HAVE THE RECEIPTS FOR THE WINTER MONTHS( OF WHICH I HAVE ONLY HAD THE CAR FOR ONE WINTER AND I HAVE THAT RECEIPT AND THE RECEIPT FOR OIL AND FLUSHING FLUID AFTER THE FIRE STARTED THEY NOW SAY WE NEED THE RECEIPTS FOR ALL OIL CHANGES.  I HAVE LOOKED AT OTHER WEB SITES FOR PREMATURE ENGINE FAILURE WITH THAT SAME ENGINE SIZE AND THERE ARE MANY UNDER CHRYSLER ENGINE SLUDGE AND I HAVE A FAMILY MEMBER WHO HAS WORKED IN THE AUTO INDUSTRY  FOR 20 YEARS AND KNOWS THAT CHRYSLER IS HAVING A PROBLEM WITH THIS PARTICULAR SIZE HAVING ENGINE SLUDGE AND IT IS WELL KNOWN AMONG THE MECHANICS BUT THEY WILL NOT COME FORWARD FOR FEAR OF LOSING THEIR JOBS.    *NLM",
        "vin": "2B3HD46RXYH"
    }
]