[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/08/2003",
        "dateOfIncident": "06/15/2001",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010141,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "NEON",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK ONE MORNING I CHECKED MY TEMPERATURE GAUGE AND REALIZED MY TEMP WAS EXTREMELY HOT.  THEN THERE WAS A CLOUD OF SMOKE ROLLING FROM UNDER MY HOOD.  BEING 50 MILES FROM HOME AND KNOWING THIS AREA TOO WELL I WAS VERY HAPPY TO SEE A COUNTY SHERIFF PULL UP BEHIND ME AND OFFER ME A RIDE TO WORK.  MY CAR STAYED ON THE SIDE OF THE HIGHWAY FOR 12 HOURS UNTIL I COULD GET SOME ONE TRUST TO COME AND TOW IT THE 50 MILES BACK HOME.  THE CAR SAT FOR A WHILE UNTIL I COULD SAVE THE MONEY TO BET IT REPAIRED.  IT WAS NOT EASY TO CONTINUE TO PAY A MONTHLY LOAN PAYMENT ON A CAR THAT WAS NOT DRIVABLE.  FINALLY WHEN WE GOT THE MONEY I CALLED A LOCAL AND CHEAP MECHANIC TO SEE WHAT THE PROBLEM WAS.  A BLOWN HEAD GASKET THAT IN RETURN CAUSED OIL TO CONTAMINATE THE RADIATOR.   IT WAS ONLY AFTER SPEAKING TO MY COUSIN WHO IS A CLAIMS ADJUSTOR FOR A NATIONAL EXTENDED WARRANTY CO. DID I REALIZED THAT I COULD GET \"ASSISTANCE\" THROUGH CHRYSLER TO FIX MY CAR.  I HAD TO FIGHT TOOTH AND NAIL TO GET THEM TO AGREE THAT THIS WAS AN ONGOING PROBLEM WITH THIS CAR.  FINALLY EIGHT MONTHS LATER MY CAR IS IN THE DEALERSHIP GETTING REPAIRED AT ONLY 50% OF THE COST AT MY EXPENSE.  IF YOU HAVE THIS PROBLEM, CONTACT THE CHRYSLER CORPORATION OFFICE IN MICHIGAN AND TELL THEM YOU WANT A DISTRICT REP TO COME TO YOUR DEALERSHIP AND DETERMINE HOW MUCH \"ASSISTANCE\" THEY WILL PROVIDE YOU.  DO NOT TAKE NO FOR AN ANSWER.  THEY WILL PAY FOR PARTIAL REPAIRS.   *NLM",
        "vin": "1B3ES42C8WD"
    }
]