[
    {
        "components": "SUSPENSION,PARKING BRAKE,ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "01/12/2003",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A 2001 CHEVY SUBURBAN , BRAND NEW. SINCE WE OWNED IT, THE AIR CONDITIONER MOTOR FAILED THE FIRST MONTH, FRONT LEFT SHOCK POPS WHEN TURNING, DRIVER'S SEAT WARMER DOESN'T WORK  (POSSIBLE FAULTY SWITCH), THE 5.3 LITER ENGINE KNOCKS AND PINGS LIKE CRAZY EVEN WHEN USING 93 OCTANE FUEL ON A STEADY BASIS. THE FRONT PASSENGER SEAT WAS FOUND TO HAVE CRACKED SEAT RAILS BUT DEALER HAD NO REPLACEMENT RAILS, HAVE TO ORDER THEM. GAS GAUGE DOESN'T READ RIGHT (WHEN ON THE RED LINE IT STILL HAS 6 GALLONS IN THE TANK OR 20% FUEL LEFT) THE THING IS A PIECE OF CRAP! GM DIDN'T GIVE A DARN EITHER. IF YOU CALL TO COMPLAIN YOU GET THE RUN AROUND. THIS IS THEIR TOP OF THE LINE PASSENGER TRUCK (SUBURBAN LT) AND DEFINITELY NOT SOMETHING THEY SHOULD BE PROUD OF. I DEFINITELY WILL NOT BUY ANOTHER, MY PARENTS JUST BOUGHT A NEW FORD EXPEDITION SINCE THEY SAW ALL THE CRAP BREAKING ON THIS THING. OTHER FRIENDS HAVE ALSO NOT GM AFTER SEEING FIRST HAND MY BRAND NEW LEMON. ANOTHER FRIEND OF MINE IS ON HIS 3RD REPLACEMENT MOTOR FOR HIS CAMARO WINDOW. HE BOUGHT AC DELCO MOTORS EACH TIME AND THEY ALL STOPPED WORKING WITHIN ONE YEAR. ALL OF THESE PRODUCTS, INCLUDING MY SUBURBAN ARE BEING MADE IN MEXICO I JUST FOUND OUT. I THINK THAT THEY MUST HAVE A BIG PROBLEM WITH QUALITY CONTROL DOWN THERE OR THEIR SAMPLING SIZE IS NIL. WELL I HOPE GM HAS MADE A BUNDLE OF PROFITS OFF NAFTA BECAUSE THEY'VE DEFINITELY LOST AT LEAST 7 SALES THAT I KNOW OF DUE TO MY $40,000 PIECE OF CRAP. I WOULDN'T RECOMMEND THIS CAR TO ANYONE. I HAVE HEARD OF OTHERS COMPLAINING OF THE SAME PINGS/KNOCKS IN THEIR 5.3 LITER GM ENGINES. DOES ANYONE KNOW OF A CLASS ACTION LAWSUIT REGARDING THIS? OH AND THE EMERGENCY BRAKE IS WAY TOO LOOSE.",
        "vin": ""
    }
]