[
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/09/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010192,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "CONTOUR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DASHBOARD IS CURLING UP FROM THE WINDSHIELD.  SINCE THIS HAS STARTED THE VENT FOR THE DEFOGGING SYSTEMS HAS POPPED COMPLETELY OUT, THE WARNING BELL FOR THE LIGHTS LEFT ON AND KEY IN IGNITION HAVE STOPPED WORKING AND THE RADIO CUTS IN AND OUT.  I TOOK IT TO MY AUTO REPAIR SHOP WHO CONTACTED MY EXTENDED WARRANTY COMPANY (WHO SUPPOSEDLY COVER ME BUMPER TO BUMPER ACCORDING TO THE DEALER I BOUGHT THE CAR FROM) WHO STATE IF IT IS NOT SAFETY RELATED THEY DON'T COVER IT.  I THEN WENT TO A LOCAL DEALERSHIP WITH THE PROBLEM AS THE CAR IS A 1999 WITH BARELY 40,000 MILES AND EXPRESSED MY CONCERN ABOUT THE THINGS THAT HAVE STOPPED WORKING AS WELL AS THE FACT THAT AS THE DASH ROLLS BACK IT WILL DEPLOY THE PASSENGER SIDE AIR BAG.  THE DEALER STATED IT WAS NOT THEIR PROBLEM EVEN THOUGH THEY STATED THAT THE EARLIER MODELS HAD THE SAME PROBLEM WHICH APPARENTLY WAS NEVER FIXED AND GAVE ME FORD CUSTOMER SERVICE.  I THEN CONTACTED FORD WHO AFTER 5 DAYS INFORMED ME THAT THEY FELT IT WAS NOT THEIR PROBLEM, THAT I SHOULD TAKE IT TO MY LOCAL DEALER AND PAY APPROXIMATELY $1800 TO $2000 FOR A NEW DASH TO BE INSTALLED BUT THAT I SHOULD SAVE MY PAPERWORK AFTER THE REPAIRS ARE DONE IN CASE OF ANY FURTHER TROUBLE.  SINCE THE DASH IS IN PERFECT CONDITION ASIDE FROM THE CURLING, NO CRACKS, DISCOLORATION OR DRYING OUT I DON'T FEEL I SHOULD PAY TO HAVE THIS PROBLEM RESOLVED.  IF YOU CAN ASSIST PLEASE LET ME KNOW.   *NLM",
        "vin": "1FAFP6630XK"
    }
]