[
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "02/04/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10010229,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "TRAILBLAZER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/02 I HAD MY VEHICLE AT THE DEALER FOR SERVICE & IT WAS BROUGHT UP THAT THE 4WD WAS TURNING ON & OFF RANDOMLY.  THE SERVICE PERSON MENTIONED THAT THEY HAVE SEEN A HANDFUL OF THESE & THE COMPUTER IN THE VEHICLE WAS \"ASLEEP\"  HOWEVER, THEY ADVISED THEY COULDN'T CHECK THE PROBLEM BECAUSE IT WAS IN WORKING ORDER AT THE TIME I HAD IT IN.  THEY COULD ONLY CHECK THE PROBLEM IF IT WASN'T WORKING.  THE LAST WEEK OF 1/03, I WAS TRAVELING AT HIGHWAY SPEEDS IN 2WD.  THE VEHICLE AUTOMATICALLY SHIFTED ITSELF INTO 4WD HIGH, MADE A VERY LOUD SOUND & THE LIGHTS ON THE DASH CHANGED FROM 4WD HIGH TO AWD, & 4WD LOW.  WHEN I ARRIVED HOME, ALL THE LIGHTS ON THE DASH FOR 4WD WERE OUT & HAVE NOT COME BACK ON.  THE VEHICLE WAS TURNED OFF. WHEN THE VEHICLE WAS TURNED BACK ON THE FOLLOWING DAY, IT WAS IN 2WD & WOULD NOT ENGAGE INTO AWD OR 4WD HIGH OR LOW.   I CONTACTED MY DEALER WHO SET UP AN APPOINTMENT TO BRING THE VEHICLE IN ON 2/5/03 TO HAVE THE 4WD CHECKED OUT. ON 2/4/03 I HIT A PATCH OF SNOW & ICE WITH MY REAR TIRES.  I WAS TRAVELING APPROXIMATELY 40 MPH ON A 55 MPH ROAD.  DUE TO THE VEHICLE ONLY BEING IN 2WD & THE AWD & 4WD NOT WORKING, THE FRONT WHEELS OF THE VEHICLE HAD NO POWER & THE VEHICLE WENT OUT OF CONTROL & ENDED UP IN A DITCH ON THE SIDE OF THE ROAD CAUSING OVER $4000 IN DAMAGE.  MINOR BRUISING INJURY TO MYSELF WHEN MY KNEES SLAMMED INTO THE DASH. BODY DAMAGE HAS BEEN REPAIRED & THE SERVICE DEPT HAS CONFIRMED THAT THE COMPUTER WAS NOT WORKING AT THE TIME OF THE ACCIDENT IN ORDER FOR THE 4WD TO TURN ON. THE COMPUTER HAS SINCE BEEN \"RESET\" & THE VEHICLE RETURNED TO ME ON 2/27/03. AGAIN ON 3/1/03 & 3/3/03, THE VEHICLE WAS IN 2WD TRAVELING AT HIGHWAY SPEEDS & RANDOMLY TURNED FROM 2WD TO AWD & 4WD. ON 3/10/03, I ADVISED THE DEALER AGAIN OF THE PROBLEM & THE MANAGER IS GOING TO SPEAK W/THE SERVICE DEPT TO FIND OUT IF THERE HAVE BEEN ANY OTHER COMPLAINTS OF THIS NATURE.  AGAIN, THE DEALER SAID THEY COULDN'T DO ANYTHING NOW FOR ME AS THE VEHICLE IS WORKING AT THIS TIME.*JB",
        "vin": "1GNDT13S322"
    }
]