[
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "01/14/2003",
        "fire": false,
        "manufacturer": "Dorel Juvenile Group",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010243,
        "products": [
            {
                "manufacturer": "Dorel Juvenile Group",
                "productMake": "SAFETY 1ST",
                "productModel": "DESIGNER 22",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "SAFETY FIRST DESIGNER 22 INFANT CAR SEAT IS SO DEFECTIVE IN DESIGN AND DIFFICULT TO USE AS TO BE AN INHERENTLY DANGEROUS PRODUCT.  1) THE RELEASES FOR THE CARRYING HANDLE ARE EXCESSIVELY TIGHT, ONE ADULT PRESSING ON EACH SIDE WILL OFTEN NOT RESULT IN RELEASING THE HANDLE.   IT IS EASY TO ACCIDENTALLY STRIKE THE CHILD WHILE TRYING TO MOVE THE CARRYING HANDLE.  THEN,  WHEN THE HANDLE LATCHES INTO PLACE, IT SOUNDS LIKE A GUN SHOT AND MAKES MY BABY JUMP.  QUITE OFTEN, WE DON'T USE THE HANDLE TO TOTE THE CARRIER, WE JUST LUG THE CARRIER WITH BOTH HANDS AS IF WE ARE CARRYING A HEAVY BOX.  2) THE STRAP FOR THE LATCH SYSTEM SOMETIMES COVERS THE BAR, MAKING IT IMPOSSIBLE TO SNAP THE CARRIER TO THE BASE.  3) IT IS VIRTUALLY IMPOSSIBLE TO ASCERTAIN WHETHER THE CARRIER IS SECURELY LATCHED INTO THE BASE.  4) THE CARRIER IS EXCESSIVELY HEAVY, MAKING IT DANGEROUS TO CARRY A CHILD IN.    5)  THE PRODUCT IS SHIPPED WITH THE INSTRUCTION MANUAL CONCEALED IN A SLOT IN THE CAR SEAT.  IT TOOK ME 45 MINUTES TO FIND THE MANUAL.  I BET SOME CONSUMERS NEVER FIND IT.   6) IT IS FANTASTICALLY DIFFICULT TO ADJUST THE STRAPS ON THIS PRODUCT.  THE MANUAL DOES NOT TELL YOU WHICH DIRECTION TO MOVE THE STRAPS IF YOU WANT TO TIGHTEN OR LOOSEN.  IT TOOK FOUR ADULTS (TWO LAWYERS, A NURSE, AND AN EXPERIENCED NANNY) ONE AND ONE HALF HOURS TO SECURE MY INFANTS IN THESE SEATS EVEN THOUGH I HAD ALREADY INSTALLED THE BASES IN THE VAN.   THIS PRODUCT IS IMPOSSIBLE AND WILL EASILY OVER WHELM THE TYPICAL CONSUMER.  IF IT PREVENTS ANY INJURIES AT ALL IT IS BECAUSE CONSUMERS FEAR THIS PRODUCT AND WOULD RATHER STAY HOME THAN WRESTLE WITH IT.  THE HOME COMING OF MY TWINS--WHAT SHOULD HAVE BEEN A JOYOUS EVENT--BECAME A FIASCO DUE TO THE DIFFICULTIES OF USING THIS PRODUCT, DESPITE THE FACT THAT I READ THE OPERATORS MANUAL BEFORE ATTEMPTING TO USE IT. *JB",
        "vin": null
    }
]