[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "04/12/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010250,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "4 RUNNER",
                "productYear": "1995",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD GASKET BLEW CAUSING ANTIFREEZE TO LEAK INTO THE RADIATOR.  AT THE TIME I WAS IN A REMOTE LOCATION IN MONTANA.  BOTH MECHANIC AND MYSELF CALLED TOYOTA AND BOTH WERE TOLD THERE WAS A RECALL ON '95 4-RUNNER, BUT I WAS OFF BY 1 VEHICLE IDENTIFICATION NUMBER, WHICH EXCLUDED ME FROM THE RECALL.  GASKET REPLACED, THEN AT 89,129 MILES. ENGINE ROD BLEW. THE ENTIRE ENGINE HAD TO BE REPLACED.  AT THAT TIME I WAS 30 MILES OUTSIDE MISSOULA, MONTANA, SO VEHICLE WAS TOWED TO TOYOTA DEALER IN MISSOULA.  (PURCHASE WAS FROM CLASSIC TOYOTA IN MENTOR, OH.) I WAS TOLD BY DEALER THAT ONCE AGAIN, MY VEHICLE IDENTIFICATION NUMBER DID NOT FIT RECALL. TOYOTA SERVICE MECHANIC OFFERED TO BUY VEHICLE FROM ME FOR $5000, TOLD ME IT WOULD COST 4,500-4,900 TO FIX.  ONCE AGAIN TOOK BACK TO SAME INDIANA MECHANIC, CALLS WERE AGAIN MADE TO TOYOTA BY HIM AGAIN (ALSO BY MYSELF), TOLD SORRY WRONG VEHICLE IDENTIFICATION NUMBER, OFF BY A DIGIT. ENGINE WAS REPLACED THEN AT 124,096 MILES ENGINE BLEW AGAIN.  NO OTHER PROBLEMS HAVE BEEN ENCOUNTERED WITH THIS CAR-JUST THE SAME ENGINE/GASKET COMPONENT. IT SHOULD ALSO BE NOTED THAT OIL CHANGES AND DEALER RECOMMENDED ROUTINE CARE WAS TAKEN.   I CAN NOT EVEN GIVE THE CAR AWAY, IT HAS BEEN SITTING IN MY DRIVEWAY SINCE SEPTEMBER 2002.  TOYOTA HAS NOT PROVEN TO  BE HELPFUL OR COURTEOUS IN THIS ISSUE.  I WILL NEVER BUY A TOYOTA PRODUCT AGAIN.  *JB",
        "vin": "JT3VN39W2S0"
    }
]