[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/18/2008",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "SAFARI MOTOR COACHES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249177,
        "products": [
            {
                "manufacturer": "SAFARI MOTOR COACHES, INC.",
                "productMake": "BEAVER",
                "productModel": "PATRIOT",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED OUR 1997 BEAVER PATRIOT MOTORHOME USED IN OCTOBER 3, 2006.  ON OUR MAIDEN TRIP THE PASSENGER FRONT WINDSHIELD BROKE DUE TO A BAD FRONT SHOCK ALLOWING THE FRONT OF THE UNIT TO BOTTOM OUT.  TWO MONTHS LATER WE WERE TRAVELING IN ARIZONA ON I-10 AND HEARD A THUMPING NOISE. IT WAS THE PASSENGERS FRONT SHOCK MOUNT - IT HAD TORN FROM THE FRAME A WAS HITTING THE FRAME. AFTER CALL THE MANUFACTURER I WAS TOLD NOTHING THEY COULD DO, TAKE IT TO A FRAME SHOP AND HAVE IT RE-WELDED ON AND REPLACE THE SHOCK.  THREE MONTHS LATER TRAVELING OVER LOVELAND PASS IN COLORADO THE DRIVERS FRONT SHOCK MOUNT TORE FROM THE FRAME AND TOOK OUT THE FRONT BRAKE LINE GOING TO THE CALIPER LEAVING ME WITH NO FRONT BRAKES. AGAIN I WAS TOLD NOTHING COULD BE DONE BY THE MANUFACTURER.  I HAVE DONE A INTERNET SEARCH FINDING OUT THAT THIS HAS BEEN A PROBLEM WITH THIS DESIGN AND TO CORRECT IT A SECOND SET OF SHOCKS WERE ADDED IN MODELS AFTER 1997 (1 SHOCK PER AIR BAG).  OTHERS THAT HAD THE PROBLEM WHILE UNDER WARRANTY THE FACTORY REPAIRED WITH THE SECOND SET OF SHOCKS TO BOTH FRONT AND REAR.  I NOW HAVE HAD TO CHANGE THE FRONT TIRES BECAUSE THE SHOCK HAVE FAILED AGAIN CAUSING THE TIRES TO CUP.  MONROE, BILSTIEN AND KONI (SHOCK MANUFACTURERS) WON'T WARRANTY THEIR SHOCKS BECAUSE THEY SHOW THAT THIS MOTORHOME  NEEDS 4 SHOCKS PER AXLE AND I ONLY HAVE 2, SO IT IS FAILING BECAUSE OF IMPROPER USE.   MONACO PURCHASED BEAVER IN 2000 AND CLAIMS ITS NOT THEIR PROBLEM.  IT IS A SAFETY, HANDLING, BRAKING AND TIRE ISSUE.  ONE COUPLE HAD THEIR FRONT TIRE BLOWN OUT WHEN THE SHOCK MOUNT TORE FROM THE FRAME.  HOPEFULLY NO ONE HAS BEEN INJURED OR KILLED BECAUSE OF THIS.  30,000 LBS OF VEHICLE TRAVELING ON THE HIGHWAY YOU CAN'T CONTROL OR STOP IS A PROBLEM.  SEEMS TO BE A PRODUCT LIABILITY FOR MONACO. *TR",
        "vin": "4SLC0DP33V1"
    }
]