[
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/14/2018",
        "dateOfIncident": "06/14/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11101786,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WIPERS QUIT WHEN IN USE. WORK INTERMITTENTLY. THEY ARE UNPREDICTABLE.  THEY HAVE BEEN THAT WAY FOR YEARS. MY 1999 TAHOE DOES THE SAME THING. MY 1996 SILVERADO DID THE SAME THING AS WELL AND I RECEIVED A RECALL NOTICE AND THE DEALER REPAIRED PROBLEM. THESE TWO VEHICLES ARE VIRTUALLY IDENTICAL TO THE 1996 SILVERADO, AND ARE SHOWING THE SAME SYMPTOMS. THE WIPERS WILL WORK ERRATICALLY ESPECIALLY IF IT'S A HEAVY RAIN AND CAN QUIT IN THE MIDDLE OF OPERATION MAKING THE VEHICLE VERY UNSAFE. PLEASE FIND OUT WHY THE 1996 SILVERADO WAS COVERED UNDER A RECALL AND THE 1997 SILVERADO AND THE 1999 TAHOE WERE NOT COVERED UNDER THE SAME RECALL WHEN THEY ARE SHOWING THE SAME DANGEROUS FAULTY WINDSHIELD WIPER PROBLEMS.  AGAIN THIS PROBLEM HAS BEEN GOING ON FOR YEARS AND I'M FRUSTRATED THAT THE DEALER WILL NOT FIX THIS PROBLEM THAT WAS COVERED UNDER A RECALL FOR THE 96 SILVERADO. THANK YOU",
        "vin": "1GCGC24RXVZ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2015",
        "dateOfIncident": "08/13/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748616,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I LOCKED THE TRUCK USING ELECTRIC DOOR LOCKS THAT EVENING.GOT UP NEXT MORNING DOOR PANNAL HAD COUGHT FIRE.BUT MUST HAD GONE OUT FROM LACK OXGEN INCAB.",
        "vin": "1GCGC29R0VE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/24/2015",
        "dateOfIncident": "03/11/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701321,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPING AT A STOP LIGHT THE BRAKES WENT TO THE FLOOR AND PULLED RIGHT. I WENT INTO THE INTERSECTION AROUND 5 FEET. REQUIRED A MASTER CYLINDER AND LEFT FRONT HUB ASSEMBLY TO FIX PROBLEM.  COST: 808.57    THIS FOLLOWS REAR BRAKE PROBLEMS AT 27,097 MILES THAT REQUIRED PADS, ROTORS, AND CALIPERS AT A COST OF 668.27.   *TR",
        "vin": "1GCHK29UX4E"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2012",
        "dateOfIncident": "01/10/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463886,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A1997 CHEVROLET 6.5T DIESEL, I WAS DRIVING HOME FROM WORK DOING ABOUT 45 MPH CROSSING A STOP LIGHT AND THE TRUCK JUST SHUT OFF FOR NO REASON AND A SEMI WAS BEHIND ME AND ALMOST PLOWED IN TO THE BACK OF MY TRUCK BUT HE WAS ABLE TO GO AROUND AT THE LAST SECOND.  I WAS ON THE FREEWAY DOING 70 MPH AND THE TRUCK DID THE SAME THING JUST SHUT OFF FOR NO REASON AND A CAR ALMOST HIT ME BUT WAS ABLE TO STOP IN TIME. ON ALL OCCASIONS I LOST ALL POWER TO EVERYTHING BRAKES,STEERING AND ENGINE POWER. THIS HAS HAPPENED SEVERAL TIMES BEFORE AND AFTER THE TWO ABOVE. FOUND OUT THAT GM HAD PUT OUT AN UNDER THE TABLE RECALL OF THE PMD AND INJECTOR PUMP ON THE 6.5T DIESEL MOTOR 12YR/100,000MILES BUT DID NOT PUBLICLY SAY ANYTHING. THE OTHER THING THAT I JUST CAN'T GET OUT OF MY HEAD IS WHAT IF I HAD MY FAMILY WITH ME GOING CAMPING AND TOWING MY TRAILER WHEN THE INCIDENT HAPPENED GOING DOWN A STEP MOUNTAIN PASS AND THE TRUCK TO SHUT OFF WITH NO POWER TO STOP. I KNOW THAT CAR MAKERS HAVE A % OF ACCIDENTS BEFORE THEY WILL LOOK AT RECALLS AND DEATHS ARE INCLUDED IN THOSE %'S AND FOR GM TO HIDE THE RECALL IS VERY DISHONEST.   *TR",
        "vin": "1GCGK29FXVE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "04/27/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVY ADMITS A PROBLEM, I THINK MINE HAS SUCH IT STALLS FOR NO REASON AFTER A COMPLETE $700 TUNE UP..SHOP SAYS HAS SYMPTOMS, WHY NOT RECALL?  THIS IS DANGEROUS. $243 LOW TO REPAIR TO $450.. NICE...  *TR",
        "vin": "3GNGK26J5VG"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2010",
        "dateOfIncident": "05/23/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1997 SILVERADO 6.5 DIESEL ENGINE, W/279K MILES, TRUCK WAS RUNNING OK BUT THE LAST FEW MONTHS ENGINE STALLING AND STOP WITHOUT REASON, TOOK IT TO A REPAIR CENTER, DIAGNOSE WITH FUEL INJECTION PUMP FAILURE, DIESEL DEALER EXPLAINED THIS IS A WELL KNOWN DEFECT, FUEL INJECTION PUMP HAS AN ELECTRONIC COMPONENT (PMD) LOCATED ON THE SIDE OF THE PUMP WHEN ENGINE GETS HOT SENT FAILURE SIGNAL TO THE MAIN COMPUTER. CONTACTED GM CUSTOMER SERVICE TO VERIFIED THE ISSUE, ANSWERED THAT YES INDEED THEY AGREED ABOUT THE PROBLEM ALSO SAID THEY HAD 'CAMPAIGN' NOT A RECALL TO FIX THE PROBLEM BUT DIDN'T MAKE  ANNOUNCEMENT TO PUBLIC. I ASKED FOR HELP TO FIX THE PROBLEM WAS TOLD THAT I RUN OUT OF OPTIONS THEY ONLY HONOR THIS PROBLEM FOR 10 YEARS OR 120K MILES? I WAS NOT AWARE AND NEVER RECEIVED A LETTER FROM GMC. THIS IS A ACCIDENT WAITING TO HAPPEN WITH TERRIBLE CONSEQUENCES, IF THE ENGINE STOPS OR STALL GOING DOWN THE HILL IN ANY URBAN OR RURAL AREA; PASSING ANOTHER CAR IN A BUSY HIGHWAY AND STALLING OR JUST THE ENGINE QUIT RUNNING. CROSSING A BUSY INTERSECTION WITH KIDS INSIDE AND NO POWER (HORRIBLE ACCIDENT WITH SERIOUS INJURIES AND CASUALTIES!!) I USUALLY AM TOWING A HORSE TRAILER ON BUSY HIGHWAY AND SUDDENLY STALL OR STOPPING IN FRONT OF A SEMI-TRAILER, CROSSING A RAIL ROAD AND STALLING IN THE MIDDLE WITH PEOPLE INSIDE A TRAIN COMING ITS WAY! THESE ARE A FEW CONSEQUENCES THIS FAILURE CAN CREATE, WHILE THIS IS A FACTORY FAILURE AND POOR DESIGN. I HAD REPLACED THE (PMD) AND AFTER SPENDING OVER $2500.00 STILL HAVE THE SAME PROBLEM. AT THE PRESENT TIME I AM NOT DRIVING THE TRUCK MUCH UNTIL I CAN GET THIS RESOLVED FROM YOUR AGENCY TO SEE THE RESULTS OF YOUR INVESTIGATION.  IS THIS JUST ANOTHER WAY OF SOAKING THE PUBLIC WITH REPAIR BILLS EVERY SINGLE YEAR.  I NOW HAVE HAD THE PMD REPLACED ONE YEAR AFTER THE FIRST INJECTION PUMP SERVICE AND AGAIN ONE MORE YEAR LATER THIS PROBLEM HAS NOW RETURNED AND ANOTHER $2500 IS REQUIRED TO FIX IT YET AGAIN.  WHAT ARE YOU GOING TO DO ABOUT IT? *TR",
        "vin": "1GCGC29F2VE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/12/2010",
        "dateOfIncident": "09/21/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1997 CHEVROLET K2500. THE CONTACT STATED THAT HE EXPERIENCED PROBLEMS WITH THE WINDSHIELD WIPERS BECAUSE THEY WOULD FUNCTION PROPERLY ON AN INTERMITTENT BASIS. THE VEHICLE HAD NOT BEEN INSPECTED OR REPAIRED. BOTH THE DEALER AND MANUFACTURER STATED THAT THE CONTACT WOULD BE RESPONSIBLE FOR REPAIR COSTS AS THE VEHICLE WAS NOT INCLUDED IN A RECALL RELATED TO THE WINDSHIELD WIPERS (COULD NOT FIND THE RECALL IN NHTSA DATABASE). THE CURRENT MILEAGE WAS APPROXIMATELY 55,000. THE FAILURE MILEAGE WAS APPROXIMATELY 54,000.  UPDATED 01/11/2011*LJ  UPDATED 03/28/11",
        "vin": "1GCGK29R9VE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/01/2010",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315233,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1997 CHEVROLET SILVERADO 2500 DIESEL TRUCK. THE SENSOR IN THE ENGINE HAS CAUSED THE VEHICLE TO SHUT OFF UNEXPECTEDLY. THE CONTACT HAD TO DRIVE ONTO THE EMERGENCY LANE, SHUT THE VEHICLE OFF, AND ALLOW IT TO RESET. THE FAILURE HAS OCCURRED AT LEAST TWICE A DAY SINCE THE  FALL OF 2009. THE VEHICLE WAS TAKEN TO THE DEALER AND THE CONTACT WAS TOLD THAT THEY WOULD NOT  REPAIR THE VEHICLE BECAUSE IT EXCEEDED THE 120,000 MILE WARRANTY. HIS VEHICLE CAN BE REPAIRED AT HIS EXPENSE FOR $1200. THE GM MANUFACTURER CONFIRMED THAT THE VEHICLE THE WARRANTY LIMIT HAD EXPIRED. THE FAILURE MILEAGE WAS 143,548.",
        "vin": "1GCGK24F8VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "12/20/2008",
        "dateOfIncident": "06/01/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252329,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES HAVE NOT WORKED PROPERLY SINCE I BOUGHT THE VEHICLE NEW. THE DEALER HAS SAID THEY WORK PROPERLY AND ABS SYSTEMS WORK DIFFERENT THAN THE OLD SYSTEMS. IF I HAVE TO HIT THE BRAKE QUICKLY, THE PEDAL GOES ALMOST TO THE FLOOR AND THE VEHICLE DOES NOT STOP. BRAKES NEED TO BE PUMPED TO STOP EFFECTIVELY BUT THAT IS NOT POSSIBLE AT TIMES, ESPECIALLY IN CITY DRIVING. I HAVE HAD MANY MANY CLOSE CALLS AND HAVE BUMPED THE VEHICLE IN FRONT OF ME ONCE AND SMASHED INTO ANOTHER VEHICLE ONCE. MY INSURANCE RATES WERE RAISED FOR SEVERAL YEARS AS A RESULT. I HAVE TO DRIVE THIS PICK-UP TRUCK VERY CAUTIOUSLY BUT I'M WORRIED THAT SOMETHING MORE SERIOUS COULD HAPPEN TO ME OR MY WIFE WHILE DRIVING. GM HAS A RECALL ON 1999-2002 SILVERADOS FOR THIS TYPE OF BRAKE PROBLEM.  I HAVE THE SAME PROBLEM, BUT THEY DON'T SEEM TO CARE THAT I HAVE THE SAME SAFETY HAZARD WITH MY 1997 SILVERADO WITH 44,000 MILES ON IT. WHY ISN'T MY VEHICLE INCLUDED IN THE RECALL? THESE BRAKES HAVE BEEN DEFECTIVE SINCE DAY 1. *TR",
        "vin": "1GCFC29RXVE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/25/2007",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1997 CHEVROLET C2500.  THE CONTACT HEARD A SQUEALING NOISE WHEN THE STEERING WHEEL WAS TURNED.  THE MECHANIC STATED THAT THE VEHICLE NEEDED A NEW POWER STEERING PUMP.  THE POWER STEERING PUMP WAS REPLACED, HOWEVER, THE FAILURE CONTINUED.  THE MECHANIC THEN STATED THAT THE METAL CRUMBLED FOR THE WORM STEERING SHAFT.  HE MADE THE REPAIR AND THERE HAD BEEN NO FURTHER OCCURRENCES.  THE CURRENT AND FAILURE MILEAGES WERE 90,000.",
        "vin": "1GCGC24R9VE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/11/2006",
        "dateOfIncident": "08/11/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165215,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE WAS HARD TO STEER AT VARIOUS SPEEDS AND SUDDENLY PULLED TO THE RIGHT CAUSING THE DRIVER TO LOSE CONTROL.  THE INCIDENT OCCURRED AFTER AN INDEPENDENT REPAIR SHOP REPLACED THE IDLING ARM AND PITMAN ARM.  THE FRONT END WAS REALIGNED BUT THE PROBLEM PERSISTED.  TWO DIFFERENT INDEPENDENT REPAIR SHOPS DETERMINED THERE WAS A DEFECT.  THE DEALERSHIP WAS NOT CONTACTED.     UPDATED 9/5/2006 - THE FAULTY PART WAS THE STEERING WHEEL SPEED SENSOR.  *NM",
        "vin": "1GCFC29RXVE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/11/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE WINDSHIELD WIPER MOTOR FAILED DUE TO CRACKED SOLDER JOINTS ON THE CONTROLLER CIRCUIT BOARD.  THE WINDSHIELD WIPERS WORKED INTERMITTENTLY OR NOT AT ALL.  THE VEHICLE WAS NOT TAKEN FOR INSPECTION.  THERE IS A NHTSA RECALL, # 03V159000, REGARDING THE WINDSHIELD WIPERS.  THE VEHICLE HAS THE SAME PROBLEMS AS INDICATED IN THE RECALL; HOWEVER IT IS NOT INCLUDED IN THE RECALL DUE TO THE VIN.  UPDATED 05/02/06. *JB",
        "vin": "1GCGK24RXVZ"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/28/2006",
        "dateOfIncident": "03/28/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE DRIVER SIDE DOOR WAS DIFFICULT TO CLOSE DUE TO THE LATCH.  ALTHOUGH THE DEALER WAS ALERTED, NO APPOINTMENT WAS MADE FOR REPAIRS.  *AK",
        "vin": "1GCGK29R1VE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,FUEL SYSTEM, OTHER",
        "crash": true,
        "dateComplaintFiled": "11/24/2005",
        "dateOfIncident": "11/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143593,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "1997 K 2500 TRUCK PROBLEM WITH ENGINE STALLING AND SURGING WILL STALL AT HIGH SPEEDS AND WITH HYDRO BOOST THERE ARE ONLY 10 % BRAKING POWER THIS HAS HAPPENED MANY TIMES WITH EACH TIME A FAILURE OF A PMD BOX ON ENGINE THAT THE DEALER  SAYS IS A MAJOR PROBLEM SINCE 1994 I HAVE HAD REPLACED 4 TIMES WITH THE RESULT THE SAME A DANGEROUSLY CLOSE CALL WHEN THE VEHICLE SURGES IN TO TRAFFIC OR THE BRAKES FAIL WHEN THE ENGINE STALLS AFTER LOOKING THE DEALER WAS PUSHED BUY EXTENDED THE WARRANTY ON THE OEM PART BUT NOTHING HAS BEEN DONE TO REPAIR THE RISK OF DRIVING AFTER I LEAVE THE DEALER AND A FAILURE HAPPENS I HAVE TO BELIEVE THIS IS A PROBLEM ACROSS THE COUNTRY AND ACCIDENT OTHER THAN MINE MUST HAVE HAPPENED THE DEALER AND THE STANADINE DEALER IN TOLEDO ADMIT THESE ARE A CONTINUING PROBLEMS THAT IS NOT GOING AWAY. THE SAFETY CONCERN IS REAL AND MUST BE ADDRESSED BEFORE SOME ONE IF NOT ALREADY GETS KILLED IN AN ACCIDENT.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/12/2005",
        "dateOfIncident": "02/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110419,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "1997 CHEVROLET 6.5 TURBO DIESEL PICKUP. HAD FAILURE OF THE ELECTRONIC INJECTION PUMP. THIS CAUSED THE TRUCK TO UNEXPECTEDLY SHUT DOWN AT VARIOUS POINTS OF A TRIP.  CHEVROLET HAS A RECALL, BUT HAS MILEAGE AND YEAR LIMITATIONS. COMMON PROBLEM AND CHEVROLET WOULD NOT COVER BECAUSE MY VEHICLE HAD 132,000 MI AND RECALL WAS SOMETHING LIKE 10YR/120,000. *JB",
        "vin": "1GCGK24F6VZ"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/04/2005",
        "dateOfIncident": "12/29/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109850,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED THE WINDSHIELD WIPERS ON AND THEY ONLY CAME UP TO THE PARK POSITION FOR INTERMITTENT OPERATION.  POSITIONED THE SWITCH TO LOW AND HIGH AND THE WIPERS DID NOT MOVE ANY FURTHER.  SHUT OFF AND WIPERS SHUT OFF.  WIPERS WOULD NOT RESTART ON REPEATED TRIES.  TRIED LATER AND WIPERS WORKED PROPERLY.  NOW THEY OPERATE SOMETIMES AND SOMETIMES ONLY ON INTERMITTENT AND LOW, NOT ON HIGH.  BUT, SOMETIMES ON HIGH.  I HAVE NOT HAD THE PROBLEM REPAIRED YET, BECAUSE EVERYTIME I GO TO THE DEALER, THEY ARE WORKING.   *JB",
        "vin": "1GCGC29J1VE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/09/2004",
        "dateOfIncident": "07/09/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) ONGOING (2) POWER STEERING SUDDENLY GOES TO TOO MUCH ASSIST TO NORMAL ASSIST, ESPECIALLY IN LEFT HAND TURN (3) DEALERSHIP SAYS ITS \"EVO\" SENSOR, WANTS $280 TO FIX IT. THIS PROBLEM  IN 1997 CHEV C/K PICKUP TRUCKS READS LIKE A RASH IN QUANTITY REPORTS TO NHTSA, YET NHTSA SEEMS TO WANT MANY DEATHS BEFORE REQUIRING A DEALER RECALL. DO SOMETHING!!!*AK",
        "vin": "1GCGK29RXVE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/22/2004",
        "dateOfIncident": "03/22/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064654,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STARTING UP THE VEHICLE  IT WOULD NOT START AT ALL.   CONSUMER HAD  VEHICLE TOWED TO THE DEALER FOR INSPECTION, AND  MECHANIC REPLACED THE FUEL INJECTOR DUE TO WORN  OUT PARTS. *AK",
        "vin": "1GCGK29F0TE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/05/2004",
        "dateOfIncident": "03/05/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061454,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN INCLEMENT WEATHER WINDSHIELD WIPERS CAME ON AND  WENT OFF ON THEIR OWN.  THIS CAUSED POOR VISIBILITY FOR THE DRIVER.  CONSUMER WAS ABLE TO DRIVE THE VEHICLE TO THE DEALER FOR INSPECTION, AND MECHANIC INFORMED  CONSUMER VEHICLE WAS NOT UNDER A RECALL.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/20/2004",
        "dateOfIncident": "01/19/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054468,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PROBLEM IDENTICAL TO KNOWN DEFECTS AFFECTING GM CARS. I HAVE IDENTICAL SYMPTOMS REGARDING SUDDEN ROTATION OF THE STEERING WHEEL IN A LEFT TURN. THE UPCOMING RECALL OF 1996-7 CARS DOES NOT INCLUDE PICKUP TRUCKS BUILT IN THE SAME TIME FRAME. MY '97 3/4 TON CHEVROLET WAS BUILT IN SEPT OF 96, AND HAS THE SAME SYMPTOMS. MY (RENO,NV) CHEVROLET DEALERSHIP IT WILL COST ME APPROX $240 TO FIX IT. PLEASE INVESTIGATE TO EXPAND THE RECALL, AS I'VE HAD A FEW CLOSE CALLS ALREADY! *AK",
        "vin": "1GCGK29RXVE"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/13/2003",
        "dateOfIncident": "11/11/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN TWO 1997 CHEVY DIESEL VEHICLES.  ONE IN A CK3500 AND THE OTHER IS A K2500 SUBURBAN, BOTH ARE CURRENTLY NOT RUNNING.  THEY BOTH ARE DEMONSTRATING THE SAME PROBLEM.  THE CERTIFIED GM DEALERS ARE TELLING US THAT THE PROBLEM IS THE FUEL INJECTION PUMP AND THEY ARE COVERED BY WARRANTY.  THE PROBLEM IS THEY ARE STATING THAT THE INJECTOR IS RUINED DUE TO THE FUEL PUMP AND FILTER.  IN TURN I'M TO PAY FOR REPLACING THE FUEL PUMP, FUEL FILTER, FUEL TANK, ELECTRICAL FILTER HARNESS AND HAVE THE INJECTION CLEANED.  ALL TOTAL $1354.84.  THIS IS CURRENTLY ON THE SUBURBAN ONLY.  THE TRUCK WILL NOT START AND OF COURSE I CAN'S AFFORD THIS ON BOTH AT THE MOMENT.  I CAN NOT GET A STRAIGHT ANSWER FROM THE DEALER ON WHAT CAUSED THE PROBLEM AND WHY GM WILL PAY THE $2000 TO $3000 INJECTION PUMP AND NOT THE ENTIRE SYSTEM.  I HAVE CALLED GM'S HOTLINE TO NO AVAIL.  I FIND IT SURPRISING THAT THE SAME THING IS WRONG WITH BOTH VEHICLES.   *LA",
        "vin": "3GNGK26F3VG"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/04/2003",
        "dateOfIncident": "06/25/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024910,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE  SPARE TIRE FELL OFF DUE TO THE CABLE BREAKING OFF. DEALER NOTIFIED. *AK   THE PROBLEM COULD BE THE VALVE STEM ON THE TIRE WHICH MAY HAVE CAUSED THE CABLE TO BIND.   *SCC  *JB",
        "vin": "1GCGK24R1VE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/26/2003",
        "dateOfIncident": "08/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER IS HAVING THE SAME PROBLEM AS MENTIONED IN RECALL ON  WINDSHIELD WIPERS. RECALL NUMBER UNKNOWN. DEALER WOULD NOT REPAIR BECAUSE THE VIN WAS NOT INCLUDED.*AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/31/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014746,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT COLLAPSED.  *JB",
        "vin": "1GCGK29J2VE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/19/2003",
        "dateOfIncident": "11/10/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010760,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER MOTOR FAILED AT NIGHT, IN HEAVY RAIN CAUSING LOSS OF VISIBILITY.  I PULLED OVER AND MANUALLY MOVED WIPER BLADE TO RESTART WIPERS. MOTOR CONTINUED TO FAIL INTERMITTENTLY UNTIL IT WAS REPLACED    *NLM.",
        "vin": "1GBGC24R8VE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/08/2003",
        "dateOfIncident": "12/01/1998",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001484,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION AND IN A SLOW TURN THE AMOUNT OF FORCE REQUIRED TO TURN THE STEERING WHEEL CHANGES, RESULTING IN SUDDEN AND ABRUPT MOVEMENTS.  THIS SOMETIMES RESULTS IN LOSS OF CONTROL OF THE VEHICLE.  *JG *JB",
        "vin": "1GCFC29R8VE"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "12/05/2002",
        "dateOfIncident": "08/11/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON COMING TO A ROLLING STOP, UNDER DRY ROAD CONDITIONS, THE ANTI-LOCK BRAKES OVER COMPENSATE, MAKE AN 'ELECTRONIC GROAN', AND STIFFEN. THIS CAUSES THE BRAKES TO LOSE EFFECTIVENESS.  DT",
        "vin": "1GCEK19R6VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/07/2002",
        "dateOfIncident": "08/02/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING 60 MPH AND COMING OFF THE RAMP, THE BRAKES WERE APPLIED AND THE VEHICLE FAILED TO STOP AND ALSO MADE A LOUD NOISE.  THE PEDAL WENT TO FLOORBOARD, CAUSING EXTENDED STOPPING DISTANCE.  THE EMERGENCY PARKING BRAKE WAS APPLIED IN ORDER TO STOP VEHICLE.  *AK    *SCC",
        "vin": "2GCE19R3111"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/29/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008741,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "USING WINDSHIELD WIPERS, THEY WILL WORK FOR A COUPLE OF MINUTES,  THEN STOP FUNCTIONING COMPLETELY, RESULTING IN A VISUAL PROBLEM. *AK    CONSUMER HAD TO REPLACE ALTERNATOR AND BATTERY, REPLACING TIRES EVERY 30000 MILES, AND ALSO ENGINE BELT FAILED.    *YD",
        "vin": "1GCGK24R3VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/14/2002",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005692,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL GOES HALF WAY DOWN. TOOK VEHICLE TO DEALER, HAD BRAKES REPAIRED.  DEALER INDICATED THERE WAS NOT ENOUGH ADJUSTMENT TO KEEP BRAKE PEDAL FROM GOING DOWN. *AK  THERE WAS NO BRAKING BY THE REAR WHEELS BECAUSE THERE WAS NO ADJUSTMENT ON THE WHEEL.  *YH",
        "vin": "1GCFG25R4V1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "01/10/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "COVERTER COMPLETLY FAILED. *AK",
        "vin": "1GCGC33J3VF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2001",
        "dateOfIncident": "07/01/1998",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 888440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT ROTORS WARPED  AT  38000 MILES.   HAD THEM TURNED  AND REPLACED.*AK",
        "vin": "1FDU32X6UC8"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/02/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884856,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER GETS UNDER  CARPET WHERE  AIRBAG SENSOR IS LOCATED, CAUSING  LIGHT TO BE ILLUMINATED WHILE  VEHICLE IS IN MOTION.  THE DEALER HAS BAAN NOTIFIED.*AK",
        "vin": "1GCGG299R8V"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2001",
        "dateOfIncident": "12/01/1998",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 880276,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 40,000 MILES  FUEL GAUGE STOPPED OPERATING, UNABLE TO DETERMINE  AMOUNT OF FUEL IN  TANK; DEALER NOTIFIED, AND INFORMED CONSUMER THAT THE PART WAS OUT OF ITS WARRANTY, AND NOT COVERED UNDER A  RECALL. PLEASE FEEL FREE TO PROVIDE ANY FURTHER DETAILS ON THIS MATTER.  *AK",
        "vin": "1GCEC14WZNZ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/01/2000",
        "dateOfIncident": "10/25/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 735542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "SUFFERED SERIOUS FINGER WOUND AND SUBSEQUENT BACTERIAL INFECTION DUE TO MECHANISM CRUSHING SAID FINGER. DEALER HAD ASSURED THAT ALL RECALLS WERE PERFORMED ON VEHICLE PRIOR TO INCIDENT.  *AK",
        "vin": "1GCGC29R2VE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/13/2000",
        "dateOfIncident": "04/18/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 727802,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING THE TRUCK AND THE LEFT REAR TIRE FELL APART.  THE TREAD SEPARATED FROM THE TIRE AND CAUSED SUBSTANTIAL DAMAGE TO THE TRUCK.  APPROXIMATELY 90 - 95 % OF THE TREAD CAME OFF, ONLY A SMALL PIECE WAS LEFT ON THE TIRE.  WHEN SHE TOOK IT TO OUR LOCAL TIRE DEALER HE INSPECTED THE TIRES AND SAID SOME OF THE OTHERS WERE ALSO SHOWING SIGNS OF THE SAME PROBLEM; TREAD / TIRE SEPARATION.  THROUGH THE DEALER AND GENERAL TIRE CUSTOMER SERVICE I WAS GIVEN 4 TIRES AT HALF PRICE.  I HAVE SUBSEQUENTLY TRIED TO GET REIMBURSEMENT FOR THE DAMAGE TO MY TRUCK.  AT THIS POINT GENERAL TIRE IS SAYING THAT THE TIRE WAS DAMAGED BECAUSE THE TIRE HAD BEEN PATCHED.  MY TIRE DEALER WHO PATCHED THE TIRE IS SAYING THAT THEY DID THE JOB ACCORDING TO THE MANUFACTURER'S SPECIFICATIONS.  I AM IN THE MIDDLE AS EACH PARTY IS POINTING TO THE OTHER ONE.  I HAVE NEVER HAD TIRES THAT WERE AS BAD AS THESE.  I BOUGHT THE TRUCK IN 1997, ONE YEAR OLD, WITH 7600 MILES ON IT.  I MAKE IT A PRACTICE TO CHECK THE TIRES MONTHLY AND HAVE THE TIRES ROTATED ANNUALLY.  THIS TRUCK IS NO EXCEPTION TO THAT PRACTICE.  THESE TIRES AT THE TIME OF FAILURE WERE PROBABLY WITHIN 6 MONTHS OF NEEDING TO BE REPLACED AS THE TREAD WAS GETTING THIN.  GIVEN THAT THE TRUCK ONLY HAD 20K MILES ON IT DOES NOT SPEAK VERY HIGHLY OF THE TREAD WEAR ON THESE TIRES.  I HAVE A BIG PROBLEM WITH THE TIRE MANUFACTURER SAYING THAT THEY ARE NOT RESPONSIBLE FOR THE DAMAGE.  THEIR TIRE SEPARATED AND CAUSED THE DAMAGE.  AS THE DEALER STATED TO ME AND GENERAL TIRE THERE WERE OTHER TIRES THAT HAD THE SIGNS OF THE SAME PROBLEM.  IF MY WIFE HAD BEEN GOING 55 - 60 MPH TOWING OUR HORSE TRAILER I WOULD HATE TO THINK OF WHAT MIGHT HAVE HAPPENED.  THE BOTTOM LINE IS I FEEL THESE TIRES WERE DEFFECTIVE AND THE GENERAL TIRE SHOULD BE HELD ACCOUNTABLE FOR THEM.  THANKS FOR YOU ASSISTANCE ON THIS MATTER.  PAT IRWIN.  *AK( DOT NUMBER: AD11C9B206 TIRE SIZE: LT245//75R )",
        "vin": "1GCGC29R9VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/18/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 865577,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT EVERY 10,000 IN THE LAST 3 YEARS BRAKES ROTORS/ CALIPERS AND PADS NEED TO BE REPLACED WHICH CAUSES EXTENDED STOPPING DISTANCE AND  COULD RESULT IN A CRASH.  PLEASE PROVIDE FURTHER INFORMATION. *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/20/2000",
        "dateOfIncident": "05/03/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 722959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD WIPERS FAIL INTERMITTENTLY.  WHEN I WAS DRIVING ON THE INTERSTATE HIGHWAY IN A BLINDING RAIN STORM, THEY STOPPED WORKING WITH THE WIPERS STRAIGHT UP AND DOWN.  I HAD A HORRIBLE TIME GETTING TO THE SHOULDER TO STOP.  THEN THEY STARTED WORKING AGAIN A FEW MINUTES LATER.  THEY'VE DONE THIS FOUR TIMES IN DIFFERENT STATES ON DIFFERENT ROADS AT DIFFERENT SPEEDS.  FROM READING YOUR SITE, CHEVROLET APPARENTLY HAD THE SAME PROBLEM ON 1.5 MILLION TRUCKS IN THE PREVIOUS MODEL YEAR (1996), WHICH WAS FIXED WITH A RECALL.  I ALSO NOTED THAT YOU HAVE LOGGED OTHER COMPLAINTS FOR THE SAME MODEL YEAR (1997).  THANK YOU.  SINCERELY,  [XXX].  *AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GCGK29J4VE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/04/2000",
        "dateOfIncident": "04/03/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 859678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS BECAME INOPERABLE, OBSTRUCTING THE VIEW OF THE DRIVER. A RECALL HAS BEEN ISSUED ON VEHICLE'S MAKE/MODELS.  HOWEVER THIS VEHICLE WAS NOT INCLUDED.   DEALER HAS BEEN NOTIFIED.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/17/2000",
        "dateOfIncident": "08/17/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 857128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TWO MONTHS HAD TO HAVE ROTORS CHANGED.  WHEN  PRESSING  BRAKES  FRONT END SHUTTERS AND ROTORS ARE WARPING.  IF IN AN EMERGENCY, TRUCK WILL NOT STOP AS SOON AS IT SHOULD, AND THE WHOLE FRONT END WOULD SHAKE.  CHEVROLET HAS PROVIDED NO HELP. *AK *ML",
        "vin": "1GCGC29R9VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/09/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 853753,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKES ARE APPLIED THEY LOCK UP AND SKID, RESULTING IN EXTENDED STOPPING DISTANCE,  CAUSING A COLLISION.  THER E WERE NO INJURIES, BUT ONE FATALITY. DEALER INSPECTED THE VEHICLE.  *AK",
        "vin": "1GCGK29F3VC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/07/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 718430,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "1GBJG31F5V1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/25/1999",
        "dateOfIncident": "03/21/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 715248,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK DELIVERY OF OUR NEW ORDERED PICKUP ON 3/21/97.  FROM THE FIRST DAY WE EXPERIECED FRONT WHEEL LOCKUP AND SKIDDING OF OUR FRONT TIRES, IT ALSO PULLS VERY HARD TO THE SIDE THAT LOCKS UP. IT SEEMS TO LOCK UP ONE WHEEL AT A TIME, NOT BOTH AT THE SAME TIME.  THIS IS INTERMITTENT AND WE CAN NOT TELL WHEN IT WILL HAPPEN THE NEXT TIME.  WE HAVE HAD IT IN GOOTEE CHEVROLETS REPAIR SHOP SEVERAL TIMES AND IT HAS BEEN THERE FOR MANY DAYS, THEY SAY THEY CAN NOT FIND THE PROBLEM SO THEY WILL NOT FIX IT.  MY WIFE IS NOW SO SCARED SHE DOESN'T WANT TO DRIVE IT ANYMORE.  SHE HAS HAD MANY, MANY CLOSE CALLS BY ALMOST HITTING OTHER CARS.  I HAVE ASKED THE DEALERSHIP IF I CAN USE THEIR SCAN TOOL AND PLUG IT INTO TO TRUCK SO THAT WHEN IT HAPPEN IT WILL PICK IT UP, BUT THEY WOULD DO IT.  THEY ARE TELLING ME THEY CAN'T FIND IT SO I SHOULD CONTACT GM.  GOOTEE SAID IT'S NOT THEIR PLOBLEM IF THEY CAN'T PICK IT UP ON THEIR SCAN TOOL WHILE THEY HAVE OUR PICKUP.  I HAVE A CLAIM NUMBER WITH GM FOR THIS PROBLEM THAT WAS FILED SHORTLY AFTER WE BOUGHT THE PICKUP, THE NUMBER IS 9801159918.",
        "vin": "1GCGK29JXVE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/29/1999",
        "dateOfIncident": "06/01/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 712521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL SANK COMPLETELY TO FLOOR AND REMAINED AT FLOOR FOR APPROXIMATELY 0.5 TO 1 SECOND BEFORE BRAKE SYSTEM BEGAN OPERATION AND PEDAL BEGAN TO RETURN TO NORMAL FEEL. CONDITION HAS HAPPENED TWO TIMES ON THIS VEHICLE. DURING MOST RECENT INCIDENT, I HAD TO REACT QUICKLY TO VEHICLES STOPPING IN FRONT OF ME, ENGINE LOAD WENT FROM MAINTAINING STEADY 55 MPH TO DECELERATION. BRAKE BOOSTER ON THIS VEHICLE IS HYDRAULIC, DRIVEN BY THE POWER STEERING PUMP. THE DELAY IN BRAKE OPERATION IS SIGNIFICANT ENOUGH, IN MY OPINION, THAT THE VEHICLE COULD CAUSE AN ACCIDENT. HAVE NOT HAD SYSTEM SERVICED BECAUSE I CANNOT DUPLICATE THE PROBLEM.",
        "vin": "1GCFC29S3VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/14/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 847629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING UNDER WET CONDITIONS  BRAKES  LOCK UP, CAUSING THE VEHICLE TO SLIDE WHEN THEY ARE APPLIED. DEALER HAS BEEN CONTACTED.  *AK",
        "vin": "1GCGK24R5VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/04/1999",
        "dateOfIncident": "08/04/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 844283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKING SYSTEM MALFUNCTIONED WHEN DRIVING OVER ANYTHING THAT CAUSED THE AXLE TO MOVE. ALSO,  EXTENDED STOPPING DISTANCE.  PLEASE PROVIDE FURTHER INFORMATION.  *AK",
        "vin": "1GCGK29J0VE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/29/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 843721,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 35 MPH  AND WITHOUT PRIOR WARNING  VEHICLE LOST POWER  STEERING WHEN MAKING A LEFT OR RIGHT TURN, THE VEHICLE WOULD GO INTO THE NEXT LANE.  *AK",
        "vin": "2GCEK19R6V1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/27/1999",
        "dateOfIncident": "01/19/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 834072,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 50MPH, STOPPED, APPLIED BRAKES AND PEDAL WENT TO FLOOR, RESULTING IN EXTENDED STOPPING DISTANCE . ABS DID NOT KICK IN. DEALER CONTACTED, AND REPAIRWORK DONE AT OWNER'S EXPENSE. IN ORDER FOR G.M TO PAY FOR MY TRUCK THE WOULD REQUIRE ME TO SIGN A RELEASE FOR ALL LIABILITY. *AK.ET.",
        "vin": "1GCGC29JOVE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/23/1998",
        "dateOfIncident": "06/11/1998",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 831162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER MAKING A TURN, STEERING WHEEL FEELS LIKE IT'S FREE WHEELING. WOULD LOSE CONTROL OF VEHICLE WHEN IT HAPPENS. MAINLY OCCURS WHEN MAKING RIGHT TURNS. WAS INFORMED MIGHT BE STEERING COLUMN. *AK",
        "vin": "1G6FC29R7VE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/22/1998",
        "dateOfIncident": "07/20/1998",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 700034,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBJ:        1997 CHEV. K2500 P/U LEMON DATE:        10/22/98 10:56:25 PM EASTERN DAYLIGHT TIME FROM:        TBARROB1 TO:    [XXX]  HI,    I WAS WONDERING IF YOU COULD STEER ME IN THE RIGHT DIRECTION ABOUT A VEHICLE THAT I HAVE AND SINCE IT WAS NEW, BURNS A QUART OF OIL EVERY 1,000 MILES AND THE MANUFACTURER STATES THAT IT IS O.K. !  THAT THIS IS O.K. TO BURN A QUART OF OIL ANYWHERE FROM 500 TO 1,000 MILES. DOESN'T THAT HURT THE ENVIRONMENT? ISN'T THERE A LAW AGAINST IT? I WOULD REALLY LIKE SOMEONE TO HELP GET G.M. TO MAKE GOOD ON THIS VEHICLE. PLEASE DROP ME A LINE IF YOU CAN HELP AT ALL!  ETERNALLY GRATEFUL,             [XXX] P.S. MY ORIGINAL COMPLAINT WAS FOR VALVETRAIN NOISE!    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GCGK29J2VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/14/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 828892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A SUDDEN STOP AND APPLYING THE BRAKES THE VEHICLE WOULD SHOW EXTENDED STOPPING DISTANCE. PLEASE PROVIDE FURTHER DETAILS.  *AK",
        "vin": "1GCGK247VZ1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/1998",
        "dateOfIncident": "04/30/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537420,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE TRAIN VIBRATES OVER 45 MPH.",
        "vin": "1GCGC29ROVE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/03/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 823888,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER TRIED TO MAKE A SUDDEN STOP, PRESSED THE BRAKE PEDAL TO THE FLOORBOARD AND THE VEHICLE CONTINUED TO TRAVEL, THEN SLOWLY CAME TO A STOP. PLEASE PROVIDE FURTHER DETAILS.   *AK",
        "vin": "1GCGC29J2VE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/27/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 535965,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING DUST STORMS VENTS ALLOW SAND AND DEBRIS TO ENTER VEHICLE, EVEN WHEN THEY ARE CLOSED.",
        "vin": "1GCE29JIVE1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/28/1998",
        "dateOfIncident": "12/22/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 821930,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER THE ABS BRAKES ARE APPLIED, THEY FEEL VERY HARD; ALSO, MAKE NOISE WHEN APPLIED. VEHICLE WOULD STOP 1 CAR LENGTH FURTHER. HAPPENED 5 TIMES. IT'S INTERMITTENT. TOOK TO DEALER TO CHECK OUT. PROBLEM NOT FOUND. ABS ALSO FAILED WHEN APPLIED OVER ROUGH PAVEMENT/RAIL ROAD TRACKS/BUMPS, ETC.  *AK",
        "vin": "1GCGC24R7VZ"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/16/1998",
        "dateOfIncident": "11/10/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 822499,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING VEHICLE HIT A BUMP. LOST BRAKING POWER. VEHICLE STOPPED 1/10 MILE FURTHER. TOOK TO DEALER & MECHANIC CALLED MANUFACTURER. THEY REFUSED TO REPAIR THE BRAKES.  WAS TOLD THEY  WERE DESIGNED TO WORK LIKE THAT. *AK",
        "vin": "1GCGK29J9BE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/17/1998",
        "dateOfIncident": "11/06/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 532711,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED, RESULTING IN AN ACCIDENT, DUE TO SENSOR FAILURE.",
        "vin": "1GCGK29J9VE"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/02/1998",
        "dateOfIncident": "02/27/1998",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 821781,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE REAR SPINDLE  CAME OUT OF LINE, CAUSING THE REAR END TO SNAP, RESULTING IN LOSS OF CONTROL.  ALSO, WHEN MAKING A TURN  THE REAR WHEELS LOCK UP.  THE DEALER HAS REPLACED THE PART TWICE PRIOR TO INCIDENT.  *AK",
        "vin": "1GCGK29J5VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/24/1998",
        "dateOfIncident": "07/25/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 2,
        "numberOfInjuries": 1,
        "odiNumber": 820669,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S MOTHER AND FATHER WERE LEAVING A PARKING LOT WHEN THEIR BRAKES FAILED. THEIR TRUCK DRIFTED OUT INTO TRAFFIC THAT WAS GOING APPROX. 55-60MPH, AND THEY WERE BROADSIDED BY A FULL SIZED VAN LOADED WITH LEAD PIPES. THE TRUCK IS NOW IN BAY CITY MICHIGAN TOWED BY TIMS TOWING. CONSUMER DOESN'T HAVE THE NUMBER TO  HOLDER OF THE TRUCK AT THIS TIME.  *AK",
        "vin": "2GCE19RV111"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/17/1998",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 821505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS BRAKES; INTERMITTENTLY, WHEN APPLYING BRAKES, THE LEFT FRONT WHEEL LOCKS UP.  CAUSE UNKNOWN.  PLEASE PROVIDE FURTHER DETAILS.  *AK",
        "vin": "1GCGK29JXVE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/1998",
        "dateOfIncident": "04/15/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 529481,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL IS HARD WHEN APPLIED.",
        "vin": "1GCGK29F2VE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/23/1997",
        "dateOfIncident": "10/20/1997",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 817474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON DEPRESSING THE BRAKE PEDAL, CONSUMER NOTICED PULSTATION IN THE BRAKE PEDAL, PEDAL TRAVELED TO THE FLOORBOARD, RESULTING IN EXTENDED STOPPING DISTANCE. CONSUMER HAS  CONTACTED THE DEALER,  DEALER STATED THA THE FRONT BRAKE SHOES AND PADS/REAR ROTORS NEED TO BE REPLACED.   *AK  DEALER STATED TO CONSUMER THAT THE BRAKE SHOES ONLY LAST 13000 TO 20000 MILES.   *SLC",
        "vin": "1GCGG25R3X1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/19/1997",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 517283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DID NOT COME EQUIPPED WITH AN AIRBAG AS INDICATED BY STICKER ON WINDOW.",
        "vin": "1GCGK29J8VE"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/30/1997",
        "dateOfIncident": "12/24/1996",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 806706,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SEAT LATCH BROKE UPON  REACHING 50 MILES,  AT 1250 MILES PASSENGER'S SIDE LATCH BROKE,  CAUSING THE SEAT TO MOVE BACK AND FORTH.   *AK",
        "vin": "1GCGC29RXVE"
    }
]