[
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/19/2007",
        "dateOfIncident": "06/06/2007",
        "fire": false,
        "manufacturer": "Elgin Sweeper Company, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200036,
        "products": [
            {
                "manufacturer": "Elgin Sweeper Company, Inc.",
                "productMake": "ELGIN",
                "productModel": "NAVISTAR 4900",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE CATERPILLAR HYDRAULIC EXCAVATOR SUCH AS 330 AND 345 SERIES AND 325 SERIES WE SEE INSIDE THE DRIVER CAB THE SHADE FOR THE SUN ROOF WINDOW WILL HIT THE DRIVERS FINGERS VERY HARD WHEN THE DRIVER OPENS THE SHADE. THE SHADE HAS SOME FINGER GRIPS FOR THE DRIVER TO PULL ON TO OPEN THE SHADE BUT THE SHADE IT OPENS TOO FAR UNTIL THE FINGER GRIPS GO ALMOST ALL THE WAY INTO THE CEILING.  THE DRIVERS FINGERS GET CAUGHT AND IF THE DRIVER OPENED THE SHADE VERY FAST THEN THE SHADE HITS DRIVERS FINGERS VERY HARD INTO THE CEILING OF THE CAB.  SOMETIMES THE SHADE WILL NOT OPEN FAST BUT SOMETIMES IT SLIDES VERY EASY AND THEN THE SHADE MOVES VERY FAST AND HURTS THE DRIVERS FINGERS A LOT.  THE DRIVER CAN HAVE AN ACCIDENT BECAUSE OF THIS THE DRIVER CAN BE DISTRACTED AND UPSET AND CAN HIT THE CONTROLS BY ACCIDENT.  SOMETIMES YOU SEE THIS TRACTOR IN A BUSY CONSTRUCTION SITE WITH LOTS OF PEOPLES NEXT TO IT OR SOMETIMES YOU SEE THIS IT RIGHT IN THE MIDDLE OF THE HIGHWAY DOING SOME WORK WHEN THE CARS GO PAST RIGHT NEXT TO IT AND THE DRIVER HAS TO BE CAREFUL WHAT HE IS DOING SO THAT HE DOESN'T CAUSE AN ACCIDENT HOW CAN HE BE CAREFUL WHEN HIS FINGER TIPS HAVE JUST BEEN BROKE OFF!!!! :-P  THE FINGER TIPS ARE VERY SENSITIVE TO THIS!!!!  YOU SEE THIS IN ALL THE EXCAVATORS WE SEE FROM CATERPILLAR SO HOW MANY TRACTORS HAS THIS PROBLEM I DON'T KNOW BUT IT MUST BE A LOTS. *TR",
        "vin": ""
    }
]