[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/02/2014",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10595652,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEED CONTROL KEPT KICKING THE TRANSMISSION BACK INTO A LOWER GEAR GOING DOWN STATE ROAD 64 TO PATOKA LAKE, WHEN I FINALLY ARRIVED THE TRANSMISSION WAS SO HOT, IT HAD STARTED TO SLIP. I TRIED TO BACK INTO MY CAMP SITE, AND THE TRANSMISSION STARTED TO LEAK OIL ALL OVER THE PAD.  AFTER IT COOLED OFF, WE PUT MORE TRANSMISSION FLUID IN THE SYSTEM, AND TRIED IT, IT MOVED, BUT STILL WASN'T FEELING RIGHT WHEN IT SHIFTED, I DROVE IT HOME, TO [XXX]AND WHEN I TRIED TO PUT IT IN REVERSE IT WOULD NOT BACK UP AT ALL, IT IS NOW PARKED ON THE SIDEWALK IN FRONT OF THE HOUSE. WHAT DO I DO???      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "3FCMF53G1VJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/07/2007",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211113,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1997 FORD F53 CHASSIS.  IN AUGUST OF 2007, THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V336000 (VEHICLE SPEED CONTROL: CRUISE CONTROL).  HE RECEIVED THE SECOND NOTICE IN OCTOBER.  HE CALLED THE DEALERS IN THE AREA AND THE PARTS FOR THE RECALL REPAIR WERE STILL UNAVAILABLE, EVEN THOUGH THE NOTICE STATED THAT THE PARTS WOULD BE AVAILABLE IN NOVEMBER/DECEMBER.  THE CONTACT HAS BEEN UNABLE TO OPERATE THE VEHICLE DUE TO THE SEVERITY AND INSTRUCTIONS OF THE DEFECT.  HE HAS BEEN UNABLE TO REACH THE MANUFACTURER.  THE FORD RECALL NUMBER IS 05S28.  THERE HAD BEEN NO FAILURE TO DATE.  THE CURRENT MILEAGE WAS 38,000.     UPDATED 02-19-08 *BF  UPDATED 02/14/08  *TR",
        "vin": "3FCLF53G4VJ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/06/2002",
        "dateOfIncident": "10/20/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769392,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-53",
                "productYear": "1997",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT AXLE ON THESE CHASSIS'S SHIFT AND WITHOUT WARNING PUTTING THE VEHICLE INTO A SEVERE FRONT END SHIMMY.  THE ONLY WAY TO BRING THE VEHICLE UNDER CONTROL IS TO HIT THE BRAKES HARD AND SLOW THE VEHICLE TO APPROX. 20 MPH WHILE IN TRAFFIC USUALLY AT HIGHWAY SPEEDS CREATING A HAZARD TO THE OCCUPANTS OF THE VEHICLE AS WELL AS THE MOTORING PUBLIC.  DT",
        "vin": "3FCMF53G4VJ"
    }
]