[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/09/2006",
        "dateOfIncident": "11/07/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173004,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE JACK SUPPLIED BY AUDI USA FOR THE AUDI A8 IS VERY DANGEROUS. IT IS MANUFACTURED OUT OF CHEAP ALUMINUM AND IS NOT RUGGED ENOUGH TO LIFT THE CAR EVEN ON FLAT PAVEMENT.   THE JACK BENT UNDER THE WEIGHT OF THE CAR AND HAS THE POTENTIAL TO HURT SOMEONE.   *JB",
        "vin": "WAUBG34D7WN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/07/2006",
        "dateOfIncident": "02/16/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154820,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI ENGINES ARE NOTORIOUS FOR SLUDGE PROBLEMS.  ALTHOUGH AUDI RECOGNIZES THIS PROBLEM ON THEIR 4 CYL TURBO ENGINES, THEY DO NOT ACKNOWLEDGE THE PROBLEM ON THE 6 CLY ENGINE. MY ENGINE, WITH 71,000, HAS A SEVERE ENGINE SLUDGE PROBLEM, WHICH HAS CAUSE ALL THE SEALS TO LEAK.  AUDI DOES NOT ACKNOWLEDGE THE PROBLEM, AND WON'T ASSIST.  *JB",
        "vin": "WAUED28D7WA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/01/2005",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104906,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF THE ABS CONTROLLER WITH LESS THAN 70,000 MILES.  THE PROBLEM WAS CONFIRMED BY A LOCAL AUDI DEALERSHIP.  AUDI WAS CONTACTED AND REFUSED TO MAKE REPAIRS.  THIS IS A SIGNIFICANT PROBLEM FOR LATE MODEL AUDI'S AND VW'S AND NHTSA SHOULD INVESTIGATE THE FREQUENCY OF FAILURE AND REQUIRE A RECALL.  THE INCIDENT DATE IS APPOXIMATE.  *JB",
        "vin": "WAUBA24B2WN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2003",
        "dateOfIncident": "11/04/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003543,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG WARNING LIGHT INDICATES AIRBAG FAILURE. AUDI DEALER CANNOT RECTIFY.",
        "vin": "WAUBG74D0WN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2000",
        "dateOfIncident": "11/01/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 736732,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE FILLING THE FUEL TANK, GASOLINE SPRAYS OUT OF THE TANK, UNDER PRESSURE, AND GETS ALL OVER THE PERSON FILLING THE CAR, ALL OVER THE CAR, AND ALL OVER THE GROUND.  ONCE THE SPRAYING STARTS IT DOES NOT STOP UNTIL ALL PRESSURE IN THE TANK HAS VENTED.  WHEN THIS OCCURS IS UNPREDCTABLE.  AUDI IS AWARE OF THE PROBLEM AND HAS CHOSEN TO BLAME THE CONSUMER FOR NOT FILLING THE FUEL TANK CORRECTLY.  MY WIFE AND I HAVE BEEN SPRAYED WITH GAS ON THREE OCCASIONS.  *AK",
        "vin": "WAUBA34BXWN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/22/2000",
        "dateOfIncident": "01/18/1998",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 732213,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "SINGLE OCCUPANT IN VEHICLE (DRIVER) VEHICLE WAS FORCED OFF THE ROAD AND ENTERED A DITCH ABOUT THREE-FOUR FEET DEEP. PASSENGER'S AIR BAG, FRONT, FIRED. THE AUDI A8 CLEARLY STATES IN THE SALES LITERATURE THAT THE PASSENGER'S AIRBAG IS INTERLOCKED OUT WHEN NO PASSENGER IN THE VEHICLE. THE DRIVER WAS THE ONLY OCCUPANT AND THERE WERE NO PARCELS, SHOPPING BAGS, AND ETC. ON THE PASSENGER'S SEAT. AUDI & THE DEALERSHIP HAVE BEEN HIGHLY UNPLEASANT TO DEAL WITH CONCERNING THIS \"PERFECTLY NORMAL OPERATION OF THE PASSENGER'S AIRBAG.\"",
        "vin": "WAUBG74D3WN"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/28/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 709311,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A8",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "BLIND SPOTS, REAR VISIBILITY: AUDI'S REFUSAL TO REPLACE OUTSIDE MIRRORS. THE PASSENGER'S OUTSIDE MIRROR AN DRIVERS POORLY DESIGNED AND HAVE TREMENDOUS BLIND SPOTS. DRIVING A $70K WITH MIRROR ASSEMBLIES THAT DO NOT PROVIDE SAFE REAR VISION MONITORING IS OUTRAGEOUS AND DANGEROUS. POOR REAR VISION RESULTS FROM EXCESSIVELY WIDE C PILLARS, REAR SEAT HEAD RESTS THAT DO NOT HAVE STORAGE RECESSES OR OTHER PROVISIONS FOR PREVENTING THEM FROM OBSCURING LARGE AREAS OF THE REAR WINDOW. THE DEALER HAS AND AUDI HAVE BEEN LESS THAN HELPFUL EVEN WHEN I POINTED OUT THAT A 19991/2 A4 ($30,000) RIGHT OUSIDE MIRROR HAS ALMOST TWICE THE VISUAL FIELD AS MY A8. AUDI'S RESPONSE TO ME HAS BEEN TERRIBLE, AND THEIR SUGGESTED ACTIONS INCLUDE MY HAVING TO PURCHASE AND HAVE INSTALLED APPROXIMATELY $1000 FOR RIGHT AND LEFT OUTSIDE MIRROR. THE LATEST A4'S REAR HEAD RESTS RECESS INTO THE TOP OF THE REAR SEATS AND PROVIDE ALMOST NO OBSCURATION OR REAR VISION. I REQUESTED ASSISTANCE FROM AUDI AT PURCHASE TIME RE: REAR HEAD REST POINTING OUT MY GREAT DANE WAS THE ONLY REAR SEAT PASSENGER, AND MY WILLINGNESS TO SIGN A RELEASE IF THE HEAD RESTS WERE REMOVED AND ABLE TO BE REINSTALLED EASILY. AUDI HAS TOTALLY IGNORED MY REQUEST FOR SAFETY CRITICAL REPLACEMENTS FOR MIRRORS, AND AUDI HAS APPARENTLY TERRORIZED THE DEALERSHIP BECAUSE CRISWELL AUDI IS NOW REFUSING TO EVEN CONSIDER ANY AFTERMARKET PART INSTALLATION ON MY AUDI A8 INCUDING A BACK UP RADAR TRANSCIEVER THAT ONLY NEEDS A TWO WIRE HOOK UP AND SENSES OBJECTS WITHIN 12' OF THE REAR BUMPER WHEN BACKING UP. FINALLY EACH AREA OF CONCERN ABOUT THAT I HAVE ABOUT MY CAR, LIMITS MY CAR'S UTILITY ESP REAR VISION CONCERNS, AND ARE SEVERE ENOUGH SAFETY CONCERNS I HAVE FEWER THAN 6000 MILES IN 18 MONTHS OF OWNERSHIP. THE 99.5 ADN YEAR 2000 AUDI'S HAVE ADDRESS EACH OF MY AREAS OF CONCERN IN THEIR NEW VEHICLES MIRROR SIZE, FIELD OF VIEW, AND REAR HEAD RESTS, HOWEVER, I AM STILL BEING STONE WALLED RE: SAFETY ISSUES THAT HAVE PLAGUED THIS CAR SINCE I PURCHASED IT. *",
        "vin": "WAUBG74D3WN"
    }
]