[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/19/2005",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "AM GENERAL LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129353,
        "products": [
            {
                "manufacturer": "AM GENERAL LLC",
                "productMake": "AM GENERAL",
                "productModel": "HUMMER",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A HUMMER H1 (1998).  ON MY WAY TO THE AIRPORT IN TRAFFIC, MY #8 ENGINE CYLINDER WALL CRACKED CAUSING ME TO LOSE ALL MY COOLENT FOR BOTH THE ENGINE AND TRANSMISSION. IF I HAD NOT NOTICED IT AS QUICKLY HAS I HAD, I WOULD HAVE COME TO A SCREECHING HALT IN THE FREEWAY TRAFFIC AS MY ENGINE MELTED DOWN.  FURTHERMORE, I USE MY HUMMER FOR OFF-ROADING AND HAD IT HAPPENED WHILE I WAS OFF-ROAD IN THE UTAH DESERT, INJURY OR DEATH WOULD HAVE BEEN QUITE LIKELY (SINCE I AM OFTEN 20-40 MILES OFF THE HIGHWAY AND IT GETS TO BE 110 DEGREES F EASILY).  I HAVE CHECKED AROUND AND APPROXIMATELY 10% OF THE VEHICLES FROM 1997, 1998, AND PART OF 1999 AND 2000 HAVE HAD THE #8 CYLINDAR CRACK.  THIS IS A COMMON PROBLEM.  THE MANUFACTURER USED TO TAKE CARE OF THIS BUT ABOUT THREE YEARS AGO STOPPED COVERING THIS UNDER WARRANTEE OR EVEN GOOD-WILL.  A TOTAL ENGINE FAILURE CAN BE A HUGE SAFETY CONCERN IF THE TRAFFIC IS HEAVY OR IF THE OCCUPENTS ARE NOT NEAR A TOWN.  (OFTEN WHEN I DRIVE THROUGH NEVADA ON SOME VERY LONELY HIGHWAYS, I AM 3 HOURS FROM THE CLOSEST TOWN AND THE HEAT IS IMMENESE).  WHEN I AM OFF-ROAD THIS IS EVEN WORSE AND I MAY BE A DAY OR TWO HIKE FROM THE NEAREST (LONELY) HIGHWAY IN 110 DEGREE HEAT.  PLEASE LOOK INTO THIS AS IT IS A VERY FREQUENT PROBLEM FOR THE AFFECTED YEARS.  THANK YOU.",
        "vin": "137ZA8437WE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/16/2005",
        "dateOfIncident": "01/06/2005",
        "fire": false,
        "manufacturer": "AM GENERAL LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107042,
        "products": [
            {
                "manufacturer": "AM GENERAL LLC",
                "productMake": "AM GENERAL",
                "productModel": "HUMMER",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT  STEERING PROBLEMS.  WHILE DRIVING THE FRONT OF THE VEHICLE SHOOK, MAKING IT  DIFFICULT TO  CONTROL THE VEHICLE. CONSUMER CONTACTED THE DEALER, AND WAS TOLD THAT THERE WAS A PROBLEM WITH THE STEERING AND IT  HAD TO BE REPLACED.  *AK  THE VEHICLE SHOOT SO VIOLENTLY IT CAUSED LOSS OF CONTROL.  CONSUMER WAS ABLE TO AVOID AN ACCIDENT BY RUNNING OFF THE ROAD.    *TT",
        "vin": "137ZA8435WE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/10/2005",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "AM GENERAL LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128076,
        "products": [
            {
                "manufacturer": "AM GENERAL LLC",
                "productMake": "AM GENERAL",
                "productModel": "HUMMER",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "1998 HUMMER DEVELOPED PROBLEMS WITH THE FRONT STEERING ASSEMBLY.***NO ANSWER REQUIRED***. *MR  THE FRONT STEERING ASSEMBLY BEGAN OSCILLATING WILDLY AND ALMOST CAUSED AN ACCIDENT.  *NM",
        "vin": ""
    }
]