[
    {
        "components": "SUSPENSION,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "10/08/1997",
        "fire": false,
        "manufacturer": "BOUNDER MOTORHOMES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521038,
        "products": [
            {
                "manufacturer": "BOUNDER MOTORHOMES",
                "productMake": "BOUNDER",
                "productModel": "MOTORHOME",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "GVW ON REAR AXLE IS 11,000# HOWEVER THE VEHICLE EMPTY IS AT 11,000#  RIGHT NOW IT HAS ABOUT 53000 MILES ON IT AND AS I BOUGHT IT USED RECENTLY, I WENT THOUGH THE VEHICLE MECHANICALLY, AND FOUND THE BREAKS HAVE BEEN OVERHEATED TO THE POINT OF DISINTEGRATING THE RUBBER COMPONENTS ON THE BREAK CALIPERS FRONT AND BACK (THE RUBBER GARMENT THAT PROTECTS THE PISTONS ON THE CALIPER FELL APART WHICH ALLOWS CONTAMINATES TO ENTER THE PISTON-CYLINDER INTERFACE).  ALSO, THE STICKER NEAR THE DRIVERS SEAT STATES GVW REAR OF 11,000#, BUT THE TIRES ARE LT235/85R16 E (DUAL) ARE USUALLY RATED FOR ONLY AROUND 11,100#.  IF SOMEONE WERE TO LOAD THIS MOTORHOME AND NOT WEIGH IT, THEN NOT ONLY WOULD THE VEHICLE BE OVER LOADED, BUT THE TIRES ARE ALSO OVERLOADED ON THE REAR AXLE.  IT IS OBVIOUS THAT THE CHASSIS THAT WAS USED (A 1997 FORD SUPER DUTY WITH A 460 C.I. EFI GAS ENGINE) WAS NOT ABLE TO BE USED FOR THIS APPLICATION.  *TR",
        "vin": "3FCMF53G3VJ"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "06/20/2013",
        "fire": false,
        "manufacturer": "BOUNDER MOTORHOMES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521043,
        "products": [
            {
                "manufacturer": "BOUNDER MOTORHOMES",
                "productMake": "BOUNDER",
                "productModel": "MOTORHOME",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "TL-THE CONTACT OWNS A 1998 BOUNDER MOTOR-HOME. THE CONTACT STATED THAT WHILE STOPPED AT A WEIGH STATION, THE VEHICLE REAR AXLE WEIGHED IN AT 11,300 POUNDS WITHOUT ANY WEIGHT ON THE AXLE. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 53,000. ST  *TR",
        "vin": "3FCMF53G3VJ"
    },
    {
        "components": "PARKING BRAKE,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/06/2012",
        "dateOfIncident": "04/08/2009",
        "fire": false,
        "manufacturer": "BOUNDER MOTORHOMES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478813,
        "products": [
            {
                "manufacturer": "BOUNDER MOTORHOMES",
                "productMake": "BOUNDER",
                "productModel": "MOTORHOME",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE LOCKED UP. NOTICED LEAKING TRANSMISSION FLUID COMING FROM THE PARKING BRAKE BOX. TRANSMISSION FLUID ACTIVATES THE PRESSURE SENSORS WHICH IN TURN ACTIVATES AND SHUTS OFF THE AUTOMATIC PARKING BRAKE. FIX WORKED FOR AWHILE, HOWEVER THE PARKING BRAKE WARNING LIGHT CONTINUED TO GO ON AND GO OFF. PARKING BRAKE DID NOT WORK BY EITHER PUTTING THE VEHICLE IN PARK OR PULLING THE LEVER ON THE DASH WHICH IS SUPPOSED TO APPLY, AS WELL AS DEACTIVATE, THE PARKING BRAKE.  THE SYSTEM REQUIRES CHOCKING THE TIRES EACH TIME WE STOP, AS WE DO NOT HAVE ANY PARKING BRAKE. IN READING THE OWNERS MANUAL THAT CAME  THE VEHICLE, THE EXPLANATION OF THE PARKING BRAKE SYSTEM IS CONFUSING, AS WELL AS MAKING STATEMENTS TO THE EFFECT THAT \"YOUR VEHICLES HYDRAULIC BRAKE SYSTEM IS DIVIDED INTO TWO PARTS. IF ONE PART ISN'T WORKING, THE OTHER PART CAN STILL WORK AND STOP YOU. FOR GOOD BRAKING, THOUGH, YOU NEED BOTH PARTS WORKING WELL.\" WHAT DOES THIS MEAN? IN CALLING CHEVROLET DEALERS I HAVEN'T FOUND ONE THAT UNDERSTOOD THIS BRAKING SYSTEM ANY BETTER THAN I DO AND I KNOW NOTHING ABOUT AUTO MECHANICS. EXAMPLE: ON 2/18/2011, AT THE RECOMMENDATION OF CHEVROLET, I TOOK MY MOTORHOME INTO GILROY CHEVROLET.  I ASKED THEM TO INSPECT AND FIX THE AUTOMATIC PARKING BRAKE AS THE LIGHT ON THE DASH WAS ON AND THE BRAKE WAS NOT HOLDING. I WAS CHARGED $375.00 TO CLEAN AND CHECK THE SYSTEM, AND ADVISED THAT THE SYSTEM WAS HOLDING MY MOTORHOME WHILE ENGAGED.  AS I WAS LEAVING THE DEALERSHIP, I TESTED IT AND FOUND IT DIDN'T EVEN HOLD GOING DOWN THE DRIVEWAY TO THE STREET. SO WE LEFT THE VEHICLE WITH THEM OVERNIGHT, AND WHEN WE PICKED IT UP, THE PARKING BRAKE WAS STILL NOT HOLDING. AT A LATER DATE, WHEN I CONTACTED THE SERVICE MANAGER, HE SHRUGGED HIS SHOULDERS AND SAID THAT THERE WAS NOTHING ELSE THEY COULD DO, AND THAT THEY SHOULD NOT HAVE EVEN WORKED ON A MOTORHOME THAT SIZE. STILL TRYING TO GET THIS FIXED.  *TR",
        "vin": "1GBLP37J5W3"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/21/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "BOUNDER MOTORHOMES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101035,
        "products": [
            {
                "manufacturer": "BOUNDER MOTORHOMES",
                "productMake": "BOUNDER",
                "productModel": "MOTORHOME",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR HOME RIGHT VALVE COVER HAD THE HOSE HANGING OUT OF IT.  HOSE WAS LEAKING  A LIQUID THAT WAS FOUL AND MESSY.*AK  THE HOSE WAS LEAKING WHAT APPEARED TO BE A THICK OILY SLUDGE WHICH DRIPPED DOWN FROM THE VALVE COVER TOWARDS THE RIGHT EXHAUST MANIFOLD.  *NM",
        "vin": "3FCMF53S0XJ"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "04/28/2004",
        "dateOfIncident": "04/26/2004",
        "fire": false,
        "manufacturer": "BOUNDER MOTORHOMES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067956,
        "products": [
            {
                "manufacturer": "BOUNDER MOTORHOMES",
                "productMake": "BOUNDER",
                "productModel": "MOTORHOME",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 7/12/01 - 38,100 MILES I PURCHASED A 1998 FLEETWOOD BOUNDER 43J ON A P-30 CHASSIS.  VIN#[XXX]  I HAD TO RETURN THE COACH TO THE DEALER SEVERAL TIMES BECAUSE THE PARKING BRAKE WOULD NOT HOLD AND IT WAS A SAFETY ISSUE.  THE DEALER WAS LOATH TO ACTUALLY PUT ON ANY NEW PARTS AND SIMPLY TRIED TO RE-ADJUST THE BRAKE SEVERAL TIMES.  AFTER TAKING IT TO ANOTHER DEALER FOR THE REPAIRS, IT WAS REVEALED THAT THE BRAKE WOULD NOT HOLD BECAUSE TRANSMISSION FLUID WAS LEAKING FROM THE REAR TRANSMISSION SEAL ONTO THE PARKING BRAKE DRUM GETTING ALL OVER THE BRAKE SHOES RESULTING IN NO PARKING BRAKE.  THE TRANSMISSION SEAL WAS REPLACED ALONG WITH A NEW DRUM, AND BRAKE SHOES.  THE PROBLEM WAS FIXED AND THE COACH WOULD NO LONGER ROLL IN PARK.  8/18/02 - 40,213 MILES THE PARKING ACTUATOR CABLE FROM THE HYDRAULIC UNIT TO THE BRAKE DRUM ON THE DRIVE LINE FAILED WHILE ON THE FREEWAY.  THE CABLE WAS ROUTED IN SUCH A WAY THAT IT MAKES A 180 DEGREE BEND AND THE BEND WAS ONLY 1/2\" AWAY FROM THE EXHAUST PIPE.  THE EXCESSIVE HEAT FROM THE LEFT EXHAUST PIPE CAUSED THE CABLE TO FAIL AT THE BEND RESULTING IN CATASTROPHIC FAILURE AT 65MPH.  LUCKILY NO ONE WAS SERIOUSLY HURT.   THE FAILURE RESULTED IN A DESTROYED BRAKE SHOES AND DRUM.  4/26/04 - 43,090 MILES THE PRESSURE SWITCH FAILED WHILE UNDER WAY AT 45 MPH.  WE CAME TO A STOP IN THE CENTER OF THE ROAD AT NIGHT.  VERY DANGEROUS.  TOXIC TRANSMISSION FLUID WAS DUMPED ONTO THE ROAD.  THIS PARKING BRAKE DESIGN IS SERIOUSLY FLAWED AND IS GOING TO EVENTUALLY RESULT IN SERIOUS INJURY AND/OR DEATH.  I WILL ALSO CONTINUE WORKING TO GET SOME GOVERNMENT ACTION ON THIS ISSUE. I WILL POST ANY FURTHER DEVELOPMENTS.  I AM AVAILABLE FOR ANY QUESTIONS YOU MAY HAVE. CONTACT ME AT:  [XXX] WARMEST REGARDS,[XXX] 2004 CALIFORNIA ASSEMBLY CANDIDATE FOR THE 67TH DISTRICT THERE IS A PRICE FOR BEING FREE.   *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1GBLP37JXW3"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/01/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BOUNDER MOTORHOMES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 608785,
        "products": [
            {
                "manufacturer": "BOUNDER MOTORHOMES",
                "productMake": "BOUNDER",
                "productModel": "MOTORHOME",
                "productYear": "1998",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FAILED.  YH",
        "vin": "3FCMF53G4VJ"
    }
]