[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2019",
        "dateOfIncident": "05/01/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11184032,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PARKING BRAKE HAS NEVER WORKED PROPERLY SINCE NEW. YOUR PARTIAL RECALL FIX FOR STANDARD TRANSMISSIONS ONLY IS INADEQUATE. MAKE ME WONDER ABOUT UNDUE GM INFLUENCE. JUST BECAUSE THE AUTOMATIC TRANSMISSION TRUCKS HAVE PARK. THAT IS NOT AN EXCUSE FOR GM NOT TO FIX THE PARKING BRAKE.",
        "vin": "1GCGK24U2XE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/03/2018",
        "dateOfIncident": "03/29/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11083075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS ENGAGING LESS THAN 10  MILES PER HOUR.   NOT COVERED BY THE RECALL  OF 805,000, AS NOT IN A RUST BELT STATE.",
        "vin": "1GCFC29UFXZ"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "04/07/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971693,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT THE VEHICLE WAS PARKED INSIDE THE GARAGE ALL WINTER. THE CONTACT ATTEMPTED TO MOVE IT OUT AND NOTICED FUEL ON THE GROUND. THE CONTACT OBSERVED THAT THE FUEL LINE WAS SEVERELY RUSTED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "1GCGK29U7XZ"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/22/2016",
        "dateOfIncident": "05/20/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10870216,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN OR MISSING EXHAUST MANIFOLD BOLTS CAUSING EXHAUST LEAKS. POTENTIAL FOR CARBON MONOXIDE LEAKS INTO THE DRIVING COMPARTMENT. UPON RESEARCHING ON THE INTERNET THIS SEEMS TO BE A VERY COMMON AND EXPENSIVE PROBLEM. WITH GM ENGINES FROM 1999 TO AROUND 2007.  JUST FOUND THIS PROBLEM ON MY 1999 SILVERADO ON 5/20/16. I HAVE OWNED THIS TRUCK SINCE DAY ONE AND HAVE AN EXCELLENT SERVICE RECORD AT A WELL KNOW DEALERSHIP. VEHICLE WAS STATIONARY WHEN THE PROBLEM WAS DIAGNOSED.",
        "vin": "1GCGK24UXXE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/13/2015",
        "dateOfIncident": "12/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10809915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "RUSTED BRAKE LINES !  DRIVING DOWN THE STREET, HIT BRAKES TO SLOW DOWN TO TURN INTO A DRIVE, BRAKE PEDDLE WENT TO THE FLOOR, NO BRAKES AT ALL, I FOUND THE BRAKE LINE GOING TO THE REAR HAD BROKEN BY THE GAS TANK, BRAKE LINES ARE VERY CORRODED AND RUSTY, TRUCK IS KEEP INDOORS, AND CAME FROM NEW MEXICO, NO RUST ON THE BODY AT ALL,  TOW BILL WAS 200 BUCKS,AROUND 50 MILES FROM HOME.  STAINLESS STEEL BREAK LINES ARE AROUND 200 TO 300 BUCKS, AROUND 200 TO 300 FOR LABOR, VERY EXPENSIVE SO FAR, AND THE TRUCK IS NOT FIXED YET.  THE TRUCK ONLY HAS 90,000 MILES ON IT.  WHEN THE REAR LINE BROKE, I SHOULD HAVE, STILL HAD FRONT BREAKS, IN A TWO PART BRAKE SYSTEM, BUT I HAD NO BRAKES AT ALL.  I'M LUCKY, IT CAUSED, NO ACCIDENTS, OR INJURIES, OR ANY OTHER DAMAGE.  IT COULD HAVE BEEN VERY WORSE, EVEN DEADLY UNDER DIFFERENT CIRCUMSTANCES.  YOU THINK THEY WOULD HAVE PUT STAINLESS STEEL ON THE BRAKE LINES LIKE THEY DID ON THE EXHAUST.  I MEAN, A RUSTY EXHAUST, PROBABLY WONT KILL ANYBODY, BUT RUSTY BRAKE LINES HAVE KILLED A LOT OF PEOPLE, I'M SURE.",
        "vin": "1GCGC24U0XE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10764031,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED TO BACKUP OUT OF MY DRIVEWAY, WHEN I PRESSED ON THE BRAKE PEDAL THEY WENT ALL THE WAY TO THE FLOOR.  PULLED BACK INTO DRIVEWAY AND SAW WHERE BRAKE FLUID WOULD SHOOT OUT WHEN THE BRAKE PEDAL WAS PUSHED UNDER THE DRIVER'S SIDE DOOR.  FURTHER INVESTIGATION SHOWED THE BRAKE LINE HAD CORROSION IN FOR ABOUT 4 INCHES.  REPLACED THE BRAKE LINE.      YESTERDAY, SEPTEMBER 13, 2015 AGAIN WENT TO BACK UP AND PEDAL TO FLOOR.  UPON EXAMINATION THE BRAKE FLUID SHOOTS OUT IN A STEADY STREAM  WHEN PEDAL IS DEPRESSED.",
        "vin": "1GCGC24U8XE"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2015",
        "dateOfIncident": "08/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 CHEVROLET SILVERADO 2500. THE CONTACT STATED THAT WHILE DRIVING AT AN UNKNOWN SPEED, THE POWER STEERING AND BRAKES MALFUNCTIONED. THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE HYDROBOOST MALFUNCTIONED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 193,348.",
        "vin": "1GCGK29U7XZ"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618019,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE MALFUNCTIONS AFTER FILLING TANK - IT READS EMPTY IMMEDIATELY AND INTERMITTENTLY THEREAFTER AT ANY FUEL LEVEL.  IT MAKES IT DIFFICULT FOR TRAVELING ANY LONG DISTANCE AS YOU ARE NOT QUITE SURE HOW MUCH FUEL IS AVAILABLE OR IF IT WILL SHUT DOWN ON ME DURING A DIFFICULT SITUATION.  WE HAVE CONTACTED GM AND THEY WANT TO CHARGE ME TO CHECK IT AND THIS HAS BEEN REPORTED AS A PROBLEM FOR MULTIPLE MODELS TO GM.    *TR",
        "vin": "1GCGC29U1XE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2014",
        "dateOfIncident": "07/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL WENT TO THE FLOOR, VEHICLE DID NOT WANT TO STOP, FOUND ALL BRAKE LINES TO BE SEVERELY CORRODED FROM THE MASTER BRAKE CYLINDER TO THE BRAKING HARDWARE AT EACH WHEEL, DOT3 BRAKE FLUILD LEAKING QUICKLY FROM BRAKE LINE RUNNING TOWARD THE REAR OF THE TRUCK.    REF: HTTP://WWW-ODI.NHTSA.DOT.GOV/CARS/PROBLEMS/DEFECT/RESULTS.CFM?ACTION_NUMBER=EA11001&SEARCHTYPE=QUICKSEARCH&SUMMARY=TRUE    *JS",
        "vin": "1GCGC24R0XF"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/09/2014",
        "dateOfIncident": "07/12/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568023,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS TRUCK HAS HAD AN EXHAUST TIC FOR MANY YEARS. I JUST THOUGHT IT WAS A LIFTER NOISE WHEN IN ALL REALITY WHILE CHANGING SPARK PLUG AND WIRES ABOUT 2 MONTHS BACK I FOUND THE BROKEN EXHAUST MANIFOLD BOLTS. UPON FURTHER RESEARCH ON THE WEB I FOUND THIS IS AN ISSUE ON 80% OF THESE GM TRUCKS. I THINK THERE SHOULD BE A RECALL BECAUSE OF POSSIBLE CARBON MONOXIDE POISONING WHILE OPERATING THESE VEHICLES AND THE EMISSION PROBLEMS ENCOUNTERED. THANK YOU FOR YOUR ATTENTION TO THIS ISSUE.  *TR",
        "vin": "1GCGK29U4XE"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/27/2014",
        "dateOfIncident": "12/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED BRAKE PEDAL DROPPING TO FLOOR THOUGHT MASTER CYLINDER WAS BAD AFTER MECHANIC CHECKED VEHICLE HAD TO REPLACE ALL BRAKE LINES AT THE COST OF $ 500.00.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2013",
        "dateOfIncident": "12/22/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD BEEN RUNNING POORLY FOR ABOUT 2 WEEKS MAYBE MORE. FUEL PUMP ALSO WAS SOUNDING FUNNY. INSTEAD OF THE NORMAL QUICK WHIRRING FOR A FEW SECONDS THE PUMP SOUNDED LIKE IT WAS LABORING AND HAD A SLOWER, DEEPER PITCH. I THOUGHT MAYBE IT WAS TIME FOR TUNE UP BUT MY RECORDS SHOWED OTHERWISE. ( I KEEP PRETTY EXTENSIVE VEHICLE NOTES ON ALL WORK/MAINTENANCE PERFORMED.) ON THE MORNING THE ACTUAL PROBLEM FINALLY WAS DISCOVERED I HAD STARTED MY TRUCK AFTER A LITTLE MORE CRANKING EFFORT THAN USUAL. ENGINE RAN FOR ABOUT 20 SECONDS OR SO AND THAN SHUT DOWN. TRIED TO RESTART BUT THE FUEL PUMP DIDN'T POWER UP AND THEN THE SMELL OF FRESH GASOLINE WAS EVERYWHERE. AFTER GETTING OUT OF THE TRUCK I TOOK A LOOK ON THE GROUND AND YES THERE WAS GAS ON THE GROUND AND STILL DRIPPING FROM UP UNDER THE TRUCK. TOOK OUT MY FLASHLIGHT AND CAREFULLY PEEKED UNDERNEATH AND RIGHT AWAY SAW THE MAIN FUEL LEAK. FUEL LINES ON BOTH THE SUPPLY AND RETURN SIDES ARE RUSTED PRETTY BADLY IN MULTIPLE AREAS. GAS WAS LEAKING AT LEAST 4 POINTS FROM WHAT I COULD SEE AT THAT MOMENT. SEEMS THAT THE PLASTIC HOLD DOWNS FOR THESE FUEL LINES AND THE BRAKE LINES ARE THE CULPRIT WITH THESE ISSUES.  THIS PUMP BURNED OUT DO THESE LEAKS SO NOW I HAVE TO REPLACE THE FUEL PUMP MODULE AGAIN, AS WELL AS THE COMPLETE FUEL LINE SYSTEM FRONT TO BACK. I REMOVED THE 34 GALLON FUEL TANK AND THE TANK ALSO NEEDS TO BE REPLACED AS IT IS SEVERELY RUSTED. I MENTION ALL OF THIS BECAUSE I HAVE REPLACED THE FUEL PUMP TWICE BEFORE DUE TO FAILURE AND NOW IT SEEMS THAT THE ETHANOL BLENDS ARE RUINING THESE PUMP MODULES ALSO. EACH TIME I HAD REMOVED THE FUEL TANK I INSPECTED THE EXTERIOR/INTERIOR AND CLEANED, PREPPED, AND APPLIED RUST DETERRENT PRODUCTS AS NEEDED. I HAVE OWNED VEHICLES FROM THE 1950'S AND 60'S AND NEVER HAD THESE ANY OF THESE TYPE OF ISSUES.  *TR",
        "vin": "1GCGC24R1XR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/25/2013",
        "dateOfIncident": "08/12/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE REAR BRAKE FAILURE IN PARKING LOT JUST AS I WAS LEAVING WORK. HAD TO QUICKLY PUMP BRAKES TO KEEP TRUCK FROM MOVING. BRAKE PEDAL WENT TO FLOOR IN AN INSTANT. I PUT TRUCK IN PARK GOT OUT AND THERE WAS FLUID ALL OVER THE PLACE ON THE GROUND,AND ON THE DRIVERS SIDE UNDER CARRIAGE JUST BEHIND THE CAB DOOR. LOOKED UNDERNEATH WITH FLASHLIGHT AND COULD SEE THAT THE BRAKE LINE HAD SEVERE RUSTING WHERE EACH PLASTIC HOLD DOWN IS LOCATED AND ONE HAD RUSTED TO POINT OF FAILURE. GLAD I HADN'T PULLED OUT AND ONTO THE HIGHWAY AT THAT POINT. HAD TO HAVE MOST OF THE LINE REPLACED ALONG THE FRAME RAIL,( ABOUT 15').  *TR",
        "vin": "1GCGC24R1XR"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2013",
        "dateOfIncident": "09/01/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL OF MY EXHAUST MANIFOLD BOLT HEADS BROKE OFF EVEN THOUGH THEY HAVE NEVER BEEN REMOVED CAUSING HOT EXHAUST TO LEAK OUT IGNITING SOME ELECTRICAL WIRING. MY MECHANIC TOLD ME THIS IS A VERY COMMON PROBLEM WITH GM V8'S.  *JS",
        "vin": "1GCFC29U8XZ"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/11/2012",
        "dateOfIncident": "02/21/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447541,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK BRAKE PEDAL APPLIED AND BRAKES WENT TO THE FLOOR, LINES HIDDEN BY GAS TANK RUPTURED, THIS TRUCK WAS SHOWROOM CONDITION AND SPENT MOST OF IT'S TIME CLEAN AND IN THE GARAGE, NO RUST APPARENT ANYWHERE ELSE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/01/2011",
        "dateOfIncident": "05/27/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST DRIVING HOME FROM WORK AND THE BRAKES WERE NOT WORKING AS WELL AS NORMAL WHEN APPLYING THEM. LIGHT CAME ON IN THE DASHBOARD INDICATING BRAKE PROBLEM. WHEN I ARRIVED AT HOME CHECKED FLUID AND WAS OUT OF BRAKE FLUID. STARTED LOOKING FOR THE PROBLEM AND FOUND A BROKEN BRAKE LINE BADLY CORRODED. LOOKING AT THE REST OF THE LINES THEY ARE ALL IN A BAD WAY. I'M A PLUMBER AND HAVE WORKED WITH STAINLESS STEEL TUBING MY EXHAUST IS ORIGINAL NEVER HAD A PROBLEM OR LEAK. IT SEEMS STRANGE TO INSTALL SUCH A GREAT EXHAUST SYSTEM AND NOT THE SAME ON A LITTLE MORE IMPORTANT SYSTEM.  *TR",
        "vin": "1GCGK29U5XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/25/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402788,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 CHEVROLET SILVERADO 2500. THE CONTACT STATED WHEN HE DEPRESSED THE BRAKES, THE PEDAL EXTENDED TO THE FLOOR ABNORMALLY.  HE THEN INSPECTED THE VEHICLE AND FOUND BRAKE FLUID LEAKING ONTO THE GROUND. THE VEHICLE WAS TOWED TO THE DEALER WHO PERFORMED A DIAGNOSTIC TEST WHICH INDICATED THAT THE BRAKE LINES WERE CORRODED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/12/2011",
        "dateOfIncident": "04/08/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395600,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 CHEVROLET SILVARADO 2500. WHILE DRIVING APPROXIMATELY 25 MPH THE BRAKE PEDAL EXTENDED TO THE FLOOR MORE THAN USUAL AND THE VEHICLE BECAME DIFFICULT TO STOP WHILE APPLYING PRESSURE TO THE BRAKE PEDAL. THE BRAKE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT INSPECTED THE VEHICLE AND NOTICED THAT ONE OF THE SHOCKS WERE WET AND COVERED WITH OIL. THE CONTACT NOTICED THAT THE REAR BRAKE LINE WHICH CONNECTS TO THE REAR AXLE WAS ALSO LEAKING OIL. THE VEHICLE WAS INSPECTED BY A DEALER OR LOCAL  MECHANIC. THERE WAS AN OPEN INVESTIGATION; NHTSA ACTION NUMBER EA11001 (SERVICE BRAKES, HYDRAULIC SERVICE BRAKES, HYDRAULIC:FOUNDATION COMPONENTS:HOSES, LINES/PIPING, AND FITTINGS). THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "1GCGK29U5XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/05/2010",
        "dateOfIncident": "12/04/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369223,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 SILVERADO TRUCK BRAKE LINE FAILURE. WENT TO STOP BRAKE PEDAL WENT TO THE FLOOR. PROBLEM BRAKE LINE RUSTED THRU. ALL THE BRAKE LINE ARE RUSTY PRETTY SAD THE TRUCKS ONLY 10 YEARS OLD.  *TR",
        "vin": "1GCGK29U6XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "09/09/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362317,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 CHEVY SILVERADO 2500 EXT CAB LONG BOX 2WD PICKUP WITH 155,000 KLM HAD TWO BRAKE LINES EXPLODE UPON APPLYING THE BRAKES.  TRUCK WAS PULLING A FULL LOAD AT THE TIME AND AN ACCIDENT COULD HAVE BEEN MAJOR.  LUCKILY THE TRAILER BEING TOWED HAD ELECTRIC BRAKES ON IT.  INSPECTION OF THE BRAKE LINES SHOWS THEM ALL VERY RUSTY.  SHOULD NOT BE OCCURRING.  I DRIVE AN OLDER ASTRO VAN AND THERE ARE NO PROBLEMS WITH IT.  GM SHOULD BE REPLACING ALL THE BRAKE LINES. *TR",
        "vin": "1GCGC29U7XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/15/2010",
        "dateOfIncident": "09/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FRIDAY SEPT. 15, I WAS DRIVING MY 1999 CHEVROLET SILVERADO WHEN I EXPERIENCED BRAKE LINE RUPTURE FROM TWO DIFFERENT LOCATIONS.  I WAS MERELY ATTEMPTING TO SLOW DOWN FOR A CURVE AND I DID 'DYNAMITE' THE BRAKES.  I APPLIED NORMAL PRESSURE AND SUDDENLY, THE PEDAL BEGAN TO TRAVEL TOWARDS THE FLOOR AND I COULD FEEL THE VEHICLE BECOMING HARDER TO SLOW.  LUCKILY, I WAS ABLE TO STOP THE VEHICLE BEFORE SUFFERING AN ACCIDENT.  AFTER I PULLED OFF THE SIDE OF THE ROAD AND SAW LEAKING BRAKE FLUID, I INSPECTED THE AREA AND FOUND SEVERAL LOCATIONS ON THE BRAKE LINE WHERE CORROSION HAD SEVERELY DAMAGED THE LINES, AS WELL AS TWO SMALL HOLES IN TWO DIFFERENT LINES.  WHEN I GOT HOME, I PERFORMED A SEARCH OF THE PROBLEM ON MY COMPUTER AND FOUND LITERALLY HUNDREDS OF COMPLAINTS REGARDING THE SAME ISSUE!!  THIS IS AN EXTREMELY DANGEROUS CONDITION THAT GM SHOULD ADDRESS, OR BE FORCED TO ADDRESS IMMEDIATELY!!  IF NOT, THEY ARE RESPONSIBLE FOR INJURY/LOSS OF LIFE DUE TO SUB-STANDARD MATERIALS USED IN THEIR BRAKING SYSTEM. *TR",
        "vin": "1GCGK29U6XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/15/2010",
        "dateOfIncident": "08/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349482,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY 1999 CHEVY SILVERADO 2500 DOWN THE ROAD, WENT TO BRAKE AND THE BRAKE PEDAL WENT STRAIGHT TO THE FLOOR WITHOUT WARNING, I NARROWLY AVOIDED HITTING THE CAR IN FRONT OF ME ,CAUSING SIGNIFICANT DAMAGE AND INJURY.  LIMPED HOME AND FOUND RUSTED THRU BRAKE LINES JUST OUTSIDE OF DRIVER SIDE FRAME.  TRUCK HAS JUST TURNED 100,000 MILES, BUT THE UNDERCARRIAGE LOOKS MUCH OLDER...SEVERE CORROSION AND RUST...NOT WHAT YOU WOULD EXPECT FOR A $45,000 TRUCK.  NOT TO MENTION THE OTHER FAILURES I HAVE INCURRED...WILL NEVER BUY A CHEVY AGAIN.  NHTSA, YOU NEED TO DO SOMETHING ABOUT THIS BEFORE PEOPLE GET KILLED! *TR",
        "vin": "1GCGK29U6XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "08/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347202,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 CHEVROLET SILVERADO 2500. THE CONTACT ATTEMPTED TO ABRUPTLY BRAKE FROM 20 MPH BUT THE VEHICLE WOULD NOT STOP. THE CONTACT HAD TO UTILIZE THE EMERGENCY BRAKE TO GET THE VEHICLE TO STOP. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR A DIAGNOSIS OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 86,773.",
        "vin": "1GCGK29U3XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/10/2010",
        "dateOfIncident": "07/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342383,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE LINE FAILURE.  BRAKELINE CORRODED THROUGH CAUSING LOSS OF REAR BRAKES. *TR",
        "vin": "1GCGK29U5XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/26/2010",
        "dateOfIncident": "06/17/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340229,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1999 CHEVROLET SILVERADO 2500 EXTENDED CAB LONG BED 4WD.  WHILE LEAVING WORK MY BRAKE PEDAL WENT STRAIGHT TO THE FLOOR RESULTING IN NO BRAKES.  THE METAL BRAKE LINE GOING TO MY RIGHT REAR WHEEL RUSTED THROUGH RESULTING IN BRAKE FLUID SHOOTING OUT OF THE LINE LEAVING A PUDDLE OF FLUID ON THE GROUND.  AFTER CHECKING ALL THE METAL BRAKE LINES I FOUND THEM TO BE ALL RUSTING AND THEY WILL ALL HAVE TO BE REPLACED.  I HAVE NOT REPAIRED THE BRAKE LINES OR GOT AN ESTIMATE ON REPAIRS AS OF YET.  LUCKILY I WAS ABLE TO STOP BEFORE ENTERING A FOUR LANE ROAD WHERE THE SPEED LIMIT IS 40MPH. *TR",
        "vin": "1GCGK29U1XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "04/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE ROAD, I STEPPED ON THE BRAKE TO STOP TO TURN INTO MY DESTINATION WHEN MY FOOT WENT ALL THE WAY TO THE FLOOR.  I TURNED INTO THE PARKING LOT, PUT THE TRUCK INTO NEUTRAL AND PULLED THE EMERGENCY BRAKE TO STOP COMPLETELY.  THE TRUCK TOWED TO A LOCAL GARAGE WHEN THE MECHANIC STATED THAT THE BRAKE LINE HAD BLOWN DUE TO RUST. *TR",
        "vin": "1GCGC24U2XE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/16/2010",
        "dateOfIncident": "06/07/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 1999 CHEVROLET SILVERADO 2500.  THE CONTACT STATED WHILE STOPPED AT A STOP LIGHT THE ENGINE WOULD REV UP TO 2400 RPMS.  THE CONTACT HAS TO SHIFT THE VEHICLE INTO NEUTRAL TO STOP THE VEHICLE FROM ACCELERATING FORWARD.  THE CONTACT HAS TAKEN THE VEHICLE TO THE DEALER 20 TIMES IN THE LAST SIX MONTH REGARDING THE RACING RPMS. THE DEALER HAS CHANGED THE MAIN COMPUTER TWICE ALONG WITH THE THROTTLE POSITIONING SWITCH, THE IDLE AIR FLOW SENSOR AND THE MANIFOLD INTAKE GASKET. NONE OF THESE REPAIRS HAS REMEDIED THE ISSUE. THE CONTACT FEELS THIS VEHICLE IS NON-DRIVABLE AND THE MANUFACTURER SHOULD ISSUE A RECALL REGARDING THE RACING RPMS.  THE FAILURE MILEAGE WAS 146,000.",
        "vin": "1GCGK29U7XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "08/07/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304949,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "HYDRAULIC BRAKE TUBE RUPTURED DUE TO CORROSION. VEHICLE FAILED TO STOP. BUT BECAUSE IT'S NOT A TOYOTA NO ONE WILL DO ANYTHING ABOUT IT. *TR",
        "vin": "1GCGK29UXXE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "12/08/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295082,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTIRE BRAKE SYSTEM (CALIPERS, HOSES, LINES) EVERYTHING, TRUCK IS NOT PRIMARY VEHICLE,  HAS RUSTED HOSES COMPLETE BRAKE FAILURE ON ROAD NO ACCIDENT FORTUNATELY.  1999 CHEVY SILVERADO SPENT OVER $3,000 ON BRAKES IN ONE YEAR BECAUSE THE BRAKES DESIGNED FOR THIS TRUCK ARE FAULTY -  KEEP FAILING. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/21/2009",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ON MY 1999 SUBURBAN UNDER LOW SPEED THE ANTI LOCK BRAKE SYSTEM ENGAGES AND I CAN NOT STOP IN NORMAL BRAKING CONDITIONS THIS IS ON DRY PAVEMENT WITH GOOD TIRES AND THE MECHANIC SAID THAT THE SENSORS ARE RUSTY AND THERE IS A RECALL I CALLED GM AND THEY ARE SAYING MINE IS NOT INCLUDED I HAD THIS BRAKE  SYSTEM INSPECTED BY A GM MECHANIC AND THY DON'T UNDERSTAND WHY MINE IS ON NOT ON LIST ITS THE SAME PARTS AS IN THE RECALL. *TR",
        "vin": "1GNGK26R7XJ"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/25/2009",
        "dateOfIncident": "07/05/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278309,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1. LOW MILEAGE VEHICLE, DRIVEN BELOW NATIONAL MILEAGE AVG., MAINTAINED WELL.  2. HIGH PRESSURE BRAKE LINES RUPTURE DUE TO EXCESSIVE CORROSION.  3. NOTHING YET PENDING LEGAL ACTION. *TR",
        "vin": "1GCGK29UXXE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/13/2009",
        "dateOfIncident": "12/13/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268614,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THE SAME PROBLEMS OUTLINED IN THE RECALLS/SERVICE BULLETINS:  NHTSA0 6V066000, AND NHTSA 05V379000.  MY VEHICLE IS A 1999 CHEVY K2500 THAT ISN'T LISTED IN THE RECALL LIST.  THE SPEED SENSOR MALFUNCTIONS 1-4 TIMES PER YEAR (USUALLY FROM DEC THROUGH MAR).  THE FIRST TIME I HAD IT REPAIRED AT THE DEALERSHIP, BUT ON SUBSEQUENT FAILURES DID THE REPAIR MYSELF.  I HAVE ALSO REPLACED THE TAILGATE CABLES MORE THAN ONCE, AND CURRENTLY HAVE A BROKEN ONE AGAIN. *TR",
        "vin": "1GCGK23F7XF"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/2008",
        "dateOfIncident": "01/01/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 AND UP CHEVY GMC SILVERADO WITH THE 6.0 LITER ENGINE ARE HAVING PROBLEMS WITH THE EXHAUST MANIFOLD BOLTS RUSTING OFF. THIS CREATES AND EXHAUST LEAK THAT IS BAD FOR AIR  POLLUTION NOT TO MENTION WITH GAS IN THE AREA A FIRE HAZARD. THIS PROBLEM NEED A RECALL AND MANY HAVE THE PROBLEM AND DON'T KNOW IT AND THE ONES THAT DO FIX IT PAY A LOT OF LABOR COST THIS IS A FAIRLY LABOR INTENSE JOB. *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/23/2008",
        "dateOfIncident": "08/30/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT ADJUSTMENT LATCH HAS FALIED SO THE SEAT SLIDES BACK AND FORTH CAUSING A DANGEROUS CONDITION.  I HAVE BEEN TOLD BY A KNOWLEDGABLE SOURCE THAT THIS IS A COMMON, KNOWN PROBLEM TO CHEVY. REPAIR IS EXPENSIVE $600-900 WHICH THEY PASS ON TO CUSTOMER.   DANGEROUS PROBLEM THAT MANUFACTURER SHOULD HAVE TO CORRECT. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/09/2008",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A CHEVY 2500 SERIES SILVERADO PICK UP TRUCK.  I HAVE REPLACED THE TURN SIGNAL /BRAKE SIGNAL PANEL/ LIGHT BAR 5 FIVE TIMES.  IS THERE A RECALL ON THIS?  *TR",
        "vin": "1GCGC23R1XF"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2008",
        "dateOfIncident": "06/27/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232495,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 CHEVROLET SILVERADO 2500.  WHEN THE CONTACT ENTERED THE VEHICLE, THE DRIVER'S SIDE FRONTAL AIR BAG SPONTANEOUSLY DEPLOYED.  HE WAS ALMOST INJURED.  HE CALLED THE MANUFACTURER AND IS CURRENTLY WAITING FOR THEIR RESPONSE.  THE CONTACT HAS PICTURES OF THE VEHICLE AFTER IT FAILED.  THE FAILURE AND CURRENT MILEAGES WERE 138,314.   UPDATED 07/15/08 *BF  UPDATED 07/15/08",
        "vin": "1GCGC24U4XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/2008",
        "dateOfIncident": "03/25/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224135,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1999 CHEVY TRUCK WAS RECALLED FOR A FAULTY SPEED SENSOR THAT CAUSED THE ABS TO GO OFF WHEN IT SHOULDN'T.  I TOOK IT IN FOR THE REPAIR AND THEY CLEANED THE SENSOR. EVERYTHING WAS FINE.  TWO WEEKS AGO THE SAME THING STARTED TO HAPPEN, YOU GET ALMOST TO A STOP AND YOU ALL OF THE SUDDEN LOOSE ALL YOUR BRAKING POWER. I PUSHED THE BRAKE PEDAL WITH EVERYTHING I HAD AND NOTHING.  I PROBABLY DID EVEN MORE DAMAGE TO MY BRAKE SYSTEM BY PUSHING SO HARD TRYING TO STOP.  I CAME WITHIN ABOUT A HALF AN INCH FROM HITTING THE PERSON IN FRONT OF ME.  THE SAME THING HAS HAPPENED OTHER TIMES LUCKILY NOT WITH SUCH CLOSE CALLS. CHEVY HAS INFORMED ME THAT SINCE I HAVE PUT ON 30,000 MILES SINCE THE RECALL THE WILL NOT PAY FOR THE REPAIR.  THEY ALSO INFORMED ME THAT HAD I HAD ALL MY SERVICE AND REPAIR WORK THERE THEY WOULD HAVE FIXED IT AGAIN FOR ME.  THIS SHOWS ME THE RECALL WAS NOT ABOUT SAFETY FOR THE PEOPLE WHO DRIVE THEIR VEHICLES IT IS ABOUT THEIR BOTTOM LINE. PERIOD.  I HAVE TALKED TO OTHER PEOPLE THAT HAVE HAD THE SAME PROBLEM WITH THEIR CHEVY GMC TRUCKS AND THEY DIDN'T EVEN GET THE RECALL YET.  ALL IT WILL TAKE IS ONE TIME FOR YOUR BRAKES NOT TO WORK YOU ROLL INTO AND INTERSECTION AND YOUR WHOLE FAMILY GETS KILLED BECAUSE CHEVY IS TOO CHEAP TO STAND BEHIND OR FIX THEIR FAULTY PRODUCT.  *TR",
        "vin": "1GCGK29U2XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/28/2007",
        "dateOfIncident": "11/27/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210225,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAS THE RECALL ISSUE DESCRIBED IN THE RECALL DESCRIBED IN NHTSA CAMPAIGN #: 05V379000 BUT BECAUSE I LIVE IN COLORADO, THEY WILL NOT HONOR THE RECALL. MY VEHICLE ANTILOCK BRAKES MALFUNCTION AT LOW SPEEDS INTERMITTENTLY AND THE VEHICLE TAKES A LONGER DISTANCE TO COMPLETELY STOP AS DESCRIBED IN THE RECALL.  *TR",
        "vin": "1GCGK29U7XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 CHEVROLET SILVERADO 2500.  WHILE APPROACHING A STOP, THE ABS ACTIVATED AND THE VEHICLE BEGAN TO SWERVE FROM RIGHT TO LEFT.  THE VEHICLE FINALLY STOPPED APPROXIMATELY ONE VEHICLE LENGTH AWAY.  THE CONTACT REMOVED THE ABS FUSE AND THE VEHICLE STOPPED NORMALLY.  THE DEALER WAS NEVER NOTIFIED REGARDING THE FAILURE.  THE CURRENT MILEAGE WAS 105,000 AND FAILURE MILEAGE WAS 94,000.  UPDATED 12/12/07 *BF  UPDATED",
        "vin": "1GCGK29F8XF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/23/2007",
        "dateOfIncident": "05/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194054,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "HYDRO BOOSTER LEAKING FLUID.  *TR",
        "vin": "1GCGK23J0XF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/08/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175624,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW SPEED CYCLING OF FRONT ABS SYSTEM, OR FALSE ACTIVATION.  *NM",
        "vin": "1GCGK29J0WE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/26/2006",
        "dateOfIncident": "07/30/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170139,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BFGOODRICH",
                "productModel": "LAND TERRAIN",
                "productYear": "9999",
                "size": "P235/75R15",
                "type": "Tire"
            }
        ],
        "summary": "SUBMISSION REGARDING AUTOMOBILE ACCIDENT CAUSED BY BF GOODRICH TIRES (LAND TERRAIN LT 245/75R 16 LOAD RANGE E DOT N911) SEEKING REIMBURSEMENT FOR REPAIRS.  *TS  WHILE DRIVING THE CONSUMER NOTICED A SEVERE VIBRATION.  AS THE CONSUMER PULLED OVER TO INSPECT THE VEHICLE THE PASSENGER SIDE REAR TIRE BLEWOUT.  THE BLOWOUT DAMAGED THE RIGHT REAR QUARTER PANEL, MUFFLER, MUFFLER SUPPORT AND TAIL PIPE.  IT APPEAR TO THE CONSUMER THAT THE TIRE TREAD SEPARATED AND CAUSED THE TIRE TO BLOWOUT. *NM",
        "vin": "1GCGC24RXXR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/21/2006",
        "dateOfIncident": "07/28/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WOULD LIKE TO BE REIMBURSED FOR RECALL REPAIRS DONE TO A 1999 CHEVROLET K 2500. *KB  THE CONSUMER HAD THE WHEEL SPEED SENSOR REPLACED PRIOR TO RECEIVING THE RECALL NOTICE.  THE CONSUMER CONTACTED THE MANUFACTURER TWICE AND THE REFUSED TO HONOR THE RECALL AND REIMBURSE THE CONSUMER FOR THE REPAIR MADE.  *NM",
        "vin": "1GCGK24R3XF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/30/2006",
        "dateOfIncident": "06/28/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161138,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE VEHICLE HAD TROUBLE STOPPING WHEN DRIVEN 15 MPH.  THE HYDRAULIC BRAKES WOULD  DEPRESS TO THE GROUND WHEN PRESSURE WAS APPLIED UNDER NORMAL BRAKING.  THE VEHICLE'S EMERGENCY BRAKE WAS APPLIED TO HELP STOP THE VEHICLE.  THE CONTACT  INSPECTED THE VEHICLE AND NOTICED A FLUID SQUIRTED OVER THE DRIVER SIDE REAR WHEEL, AND SHOCK ABSORBER.  CHUNKS OF RUST WERE ALSO OBSERVED WHERE THE BRAKELINE FRACTURED WHICH WAS HOOKED TO THE BACK AXLE.  THE VEHICLE WAS DRIVEN HOME.  THE MANUFACTURER WAS CONTACT ON 06/29/06 WHO DETERMINED THAT THERE WAS NO RECALL OR REMEDY. THE DEALER HAS YET TO BE CONTACTED.  THERE WAS NO WARNING PRIOR TO THE INCIDENT.  THE INCIDENT OCCURRED ON A DRY AND FLAT SURFACE.    ALL 5 BRAKE LINES CONNECTED TO THE ABS UNIT WERE BADLY RUSTED. UPDATED 07/25/06. *JB",
        "vin": "1GCGK29U6XE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2006",
        "dateOfIncident": "05/24/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158323,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 1999 CHEVY 2500 WITH APPROXIMATELY 52,000 MILES ON IT.  WE'VE NOTICED ALL ALONG THAT THE GAS GAUGE HAS NOT FUNCTIONED CORRECTLY.  YESTERDAY, I APPROACHED THE VEHICLE AND SMELLED GAS.  I LOOKED UNDER THE PICKUP AND SAW GAS DRIPPING FROM THE FUEL TANK AREA.  I TOOK THE PICKUP TO MY LOCAL DEALER (YOUNG MOTOR) HERE IN LYONS.  THE SERVICE MANAGER TOLD ME THAT THE EMISSION CONTROL UNIT THAT VENTS THE GAS TANK WAS PLUGGED THUS CAUSING THE FUEL PUMP TO SUCK IN THE FUEL TANK.  AS THE TANK COLLAPSED, IT PUSHED THE SENDING UNIT/FUEL PUMP UPWARDS.  I JUST CHECKED OUR 2000 CHEVY PICKUP AND THE SAME THING IS HAPPENING TO IT.  READING THROUGH THE OWNERS MANUAL, THERE IS NOTHING STATING THAT THIS VENT NEEDS TO BE CLEANED.  WE ALSO HAVE A 1998 CHEVY 2500 THAT HAD THE SAME PROBLEM AND WE HAD TO REPLACE THE GAS TANK ON IT.  WITHIN OUR COMPANY, THERE HAVE BEEN REPORTS OF OTHER CHEVY PICKUPS HAVING THE SAME PROBLEM.  WE HAVE 3 AT THIS LOCATION: A 1998 SN:[XXX], THE 1999 SN:[XXX], AND A 2000 SN:[XXX].  I FIND IT MORE THAN A COINCIDENCE THAT ALL 3 OF THESE VEHICLES ARE HAVING THE SAME PROBLEM AND THERE IS NOTHING IN THE OWNER'S MANUAL ADDRESSING THE ISSUE.  *JB   UPDATED  07/16/2012*JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1GCGK24R4XR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2006",
        "dateOfIncident": "05/02/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156654,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE VEHICLE FUEL PUMP FAILED.  THE VEHICLE WOULD NOT START AFTER SITTING FOR SEVERAL HOURS.  AN INDEPENDENT REPAIR SHOP MECHANIC INSPECTED THE VEHICLE AND BANGED ON THE FUEL PUMP TO RESTART THE VEHICLE, IT WAS THEN DRIVEN TO THE REPAIR SHOP FOR A FUEL PUMP REPLACEMENT.  THERE IS A NHTSA RECALL, # 05V155000, REGARDING THE FUEL SYSTEM, FUEL PUMP.  THE MODEL YEAR WAS NOT INCLUDED IN THE RECALL.   UPDATED 05/30/06  PRIOR TO THIS FAILURE THE FUEL GAUGE HAD BEEN GIVING ERRONEOUS READINGS FOR ABOUT 2 MONTHS.  ON INSPECTION OF THE FUEL PUMP, THE WIRE COATING WAS FOUND TO BE MELTED NEAR CONNECTION.  *TT",
        "vin": "1GNGK26J5XJ"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "11/15/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135472,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  1999 CHEVROLET C2500.  THE CONSUMER STATES THE REAR ANTI LOCK BRAKES HAVE NOT WORKED SINCE NEW.  CHEVROLET STATES IT IS A FLAW IN THE DESIGN.  THE REAR BRAKES  NEVER HAD TO BE REPLACED BECAUSE THEY DID NOT WORK LIKE THEY SHOULD.  WHEN HAVING TO STOP SUDDENLY THE BRAKES LET LOOSE.  *AK  *NM",
        "vin": "1GCGC24R7XR"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120993,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONCERNS WITH THE DRIVER SIDE SEAT BEAT.  WHERE THE LATCH COMES UP THROUGH THE SEAT THERE ARE 2 STEEL CABLES THAT CONNECT THE SEAT BELT TO THE FRAME.  ONE OF THE CABLES HAS BROKEN AND THE OTHER IS WEARING. ON THE PORTION OF THE SEAT THAT COMES ACROSS THE BODY THERE IS A  PLASTIC THE SHIELD FRAYING 1/4 WAY THROUGH OF THE NYLON SEAT BELT.  THE SEAT WAS HANGING, THE CONSUMER LOOKED TO SEE WHY AND SAW ALL THE DAMAGE.   *TT",
        "vin": "1GCGC24R1XR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "04/30/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING ON DRY PAVEMENT APPROACHING A CROSSWALK THE ABS SYSTEM CHATTERS AND ALLOWS THE VEHICLE TO ROLL AHEAD WITHOUT WARNING. COMPLETE FAILURE HAS NOT OCCURRED BUT TWICE I HAVE COME DANGEROUSLY CLOSE TO HITTING A PERSON IN THE CROSSWALK. PROBLEM HAS NOT BEEN REPAIRED, BUT TO AVOID FURTHER OCCURENCE THE FUSE FOR ABS HAS BEEN PULLED OUT RESULTING IN CONVENTIONAL  POSITIVE BRAKING.",
        "vin": "1GCGK29UXXE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2005",
        "dateOfIncident": "05/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120755,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 CHEVY K2500 FAILED TO START DUE TO THE FACTORY PASSLOCK/ANTITHEFT DEVICE...THIS CAUSED A MISSED DAY OF WORK..THIS SAME PROBLEM HAS TAKEN PLACE ON 2 PREVIOUSE DATES...THE PROBLEM CLEARS AFTER A UNDETERMINED AMOUNT OF TIME \"USUALLY 15MIN-1/2HOUR\" THE SYSTEM RESETS ITSELF...THIS COULD HAVE BEEN A MORE SERIOUSE PROBLEM HAD I NEEDED TO DRIVE TO A HOSPITAL OR OTHER EMERGENCY SITUATION THAT MAY BE UN-FORESEEN",
        "vin": "1GCGK23R9XF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/19/2005",
        "dateOfIncident": "04/19/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118080,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 1999 CHEVROLET C/K 2500 5 SPEED PICKUP, AND THE ANTILOCK BRAKING SYSTEM IS FAILING TO OPERT. PROPERLY. I HAVE REPLACED ALL OF THE FRONT AND REAR PADS, AND SHOES. ALONG WITH REAR DRUMS, FRONT ROTORS AND ALL OF THE LINES. AND I HAVE A PROBLEM THAT GM WILL NOT HELP ME REPAIR THE DEFECT ON  VEHICLE, AND THAT NO RECALL IS OUT FOR THIS VEHICLE.*AK  THE PROBLEM IS WHEN I TRY TO STOP IN ANY CONDITION DRY OR WET ROADS, LOW OR HIGH SPEEDS THE ABS BRAKING SYSTEM FAILS BY MAKING A LOUD GROWLLING SONG, AND LOCKS THE BRAKES ON ONE SIDE OF THE VEHICLE. I HAVE TAKEN IT TO SEVERAL DEALERS AND PRIV. SHOPS AND THEY ARE UNABLE TO REPAIR THE PROBLEM. AND HAVE KNOW INFORMATION ON WHAT IS CAUSING THE BRAKES TO LOCK. THIS IS THE SECOND TIME TO REPLACE THE PARTS WITHIN FIVE MONTHS. AND SOMETHINK NEEDS TO BE DONE. MY FATHER-IN-LAW ALSO HAS THE SAME YEAR OF WORK TRUCK AND IS HAVING THE SAME PROBLEM.    THE PROBLEM HAS NOT CAUSED AND CRASH DUE TO DRIVER SAFTY BUT NEEDS TO BE LOOKED AT.  FOR IF AN INEXPERIENCED DRIVER MAY LEAD TO FAILURE WITH POSSIBLE INJURY.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/07/2005",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111365,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER EXPERIENCED PROBLEMS WITH  BOTH TAILGATE SUPPORT CABLES.   *BF   *SC  *JB",
        "vin": "1GCGK24R0XR"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "01/06/2005",
        "dateOfIncident": "12/20/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105882,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1999 CHEVROLET 2500 HD 4X4.  THE ABS LIGHT AND BRAKE LIGHT WILL STAY ON WHEN THE ABS MODULE GOES OUT.  THIS IS A SAFETY PROBLEM AND ONE THAT IS WIDELY KNOWN ON ANY OF THE CHEVROLET FORUMS ON THE WEB. I BOUGHT THE TRUCK TO TOW A TRAILER WITH MY FAMILY, NOW KNOWING THIS SAFETY ISSUE HAS NOT BEEN TAKEN CARE OF BY GM AND A RECALL STARTED I AM NOT GOING TO PUT MY 2 KIDS SAFETY IN JEAPARDY.  I WOULD HOPE THAT A MULTI-MILLION DOLLAR COMPANY LIKE GM COULD AND WOULD LOOK OUT FOR THE SAFETY OF THEIR CUSTOMERS.  THEY HAVE NO PROBLEM TAKING THE $800.00 - $1500.00 TO FIX THE PROBLEM. BUT THIS \"FIX\" ONLY LAST A LITTLE WHILE.  IN THE MEAN TIME YOU NEVER KNOW WHEN YOU WILL LOOSE YOUR ABS, AND POSSABLE CRASH AND KILL SOMEONE.  I JUST BOUGHT THE TRUCK AND I HOPE THIS WILL BE TAKEN CARE OF.  IT JUST GOT A DIFFERENT MODULE PUT IN THE DAY BEFORE I PICKED IT UP.  WELL SEE HOW LONG IT LAST.  IT'S REALLY SAD AND I HOPE YOU DON'T BASE YOUR INVESTIGATIONS ON WEATHER THERE WAS A DEATH OR INJURY.  GM KNOWS THERE IS A PROBLEM.  TELL THEM TO RECALL ALL ABS MODULES IN 1999.  IT'S SAD THAT IT TAKES HUNDREDS AND THOUSANDS OF MAD PEOPLE TO TAKE TIME OUT OF THERE BUSY SCHEDULES TO TYPE OR CALL YOU GUYS BEFORE THE GUYS MAKING MILLIONS WILL TAKE RESPOSIBILITY.  *AK",
        "vin": "1GCGK29UXXE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "08/18/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WIDETRACK RADIAL BAJA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE TREAD SEPARATION AND BLOW OUT.  *AK",
        "vin": "1GCGC24R1XR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/09/2004",
        "dateOfIncident": "08/02/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "(1)BRAKE PEDAL GOES TO FLOOR SLOWLY (BLEEDING BACK THROUGH MASTER CYLINDER SYSTEM) AND PULSATION FROM FRONT BRAKES AT 5 MPH: BRAKES RELEASE AND CAN NOT STOP.  (2)CAN NOT STOP IN EMERGENCY SITUATION OR IN FOUL WEATHER.*AK  (3)REPLACED MASTER CYLINDER AND DISCONNECT EBCM (ELECTRONIC BRAKE CONTROL MODUAL POWER LEAD.   NOTE: UPON DOING RESEARCH FROM NHTSA WEBSITE FOUND VARIOUS COMPLAINTS FROM CONSUMERS WITH SIMILAR PROBLEMS. I WAS DISAPPOINTED THAT DEALORS CONCLUDED REMOVING THE FUSE.  IN MY CASE, IF YOU REMOVE THE 60 AMPERE FUSE THE POWER WINDOWS AND HVAC SYSTEM BECOME INOPERATIVE!  I OWN A 1999 CHEVROLET K2500 PICKUP WITH 56,500 MILES.   ADDITIONALLY, I HAVE TWO CO-WORKERS WHO PURCHASED 2001 K1500'S THAT HAVE SIMILAR ABS PROBLEMS. LUCKILY, THEY ARE UNDER WARRANTY.",
        "vin": "1GCGK24R3XR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/09/2004",
        "dateOfIncident": "04/09/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE BRAKE PULL, ALMOST LOST CONTROL OFR VEHICLE. GM SERVICE BULLETIN CONCERNING THIS PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/24/2003",
        "dateOfIncident": "06/22/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053302,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING REAR TIRE BLEW OUT.*MR  WHEN THE CONSUMER INSPECTED THE VEHICLE HE NOTICED THAT THE OUTER BELT OF THE DRIVER'S SIDE REAR TIRE SEPARATED.  *NM",
        "vin": "1GCGC29U2XE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/15/2003",
        "dateOfIncident": "11/07/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046979,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILED DUE TO FAILURE OF TWO CONNECTING RODS DURING START-UP.  *LA",
        "vin": "1GCGC23R6XF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/10/2003",
        "dateOfIncident": "09/04/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038639,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "ALL SEASON RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING, THE FRONT PASSENGER SIDE TIRE EXPERIENCED TREAD SEPARATION,  WHICH CAUSED SEVERE DAMAGE TO THE FRONT END. PLEASE PROVIDE ADDITIONAL INFORMATION. *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "06/22/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029358,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING AT 70 MPH, THE DRIVER'S SIDE REAR TIRE BLEWOUT.  THE OUTER BELT CAME LOOSE FROM THE TIRE AND DID EXTENSIVE DAMAGE TO REAR SIDE PANEL AND SMALL DAMAGE TO BACK TAIL GATE. CONSUMER HAD TO PURCHASE A NEW TIRE WITH INSURANCE.  DEALER NOTIFIED.*AK  *CB   *JB",
        "vin": "1GCGC29VXYE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/23/2002",
        "dateOfIncident": "08/21/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 768782,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH AIRBAGS FAILED TO DEPLOY DURING HEAD ON COLLISION. HTTP://WWW.USER.DCCNET.COM/LHORNUNG/ACCIDENT  DT",
        "vin": "1GCGK29U2XZ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/30/2002",
        "dateOfIncident": "04/20/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8017655,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "UNIROYAL, LERADO AWP LT24575R16. BOUGHT TIRES IN NOVEMBER 2001.  TIRE PLY IS SEPERATING IN ALL FOUR TIRES,  CAUSING VIBRATION.*AK",
        "vin": "1GCGK24R8XR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK COLLAPSED DUE TO A VACUUM INSIDE OF GAS TANK WHICH STARTED TO LEAK. TOOK VEHICLE TO SERVICE CENTER AND HAD GAS TANK REPLACED. THIS WAS SECOND GAS TANK AND PROBLEM STILL EXISTS.  *AK   *SLC",
        "vin": "1GCGK29R8XS"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/30/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES HARD THEY DO NOT WORK. ALSO,  WHILE APPLYING BRAKES TO STOP VEHICLE THEY LET GO AND WILL NOT HOLD.*AK",
        "vin": "1GBGK24RXXR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/08/2001",
        "dateOfIncident": "04/10/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING 60MPH AND ABS WARNING CAME ON AND STAYED ON.  CONSUMER PULLED  FUSE AND USED  REGULAR BRAKES. DEALER REPLACED  ABS MODULE, AND  SYSTEMS WAS BACK TO NORMAL. *AK   *JB",
        "vin": "1GCGK24U6XE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/09/2001",
        "dateOfIncident": "04/23/2000",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 4,
        "odiNumber": 560739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE RIGHT REAR KELLY TRAIL MARK TIRE LT235/85R16E EXPERIENCED A BLOWOUT CAUSING VEHICLE TO SWERVE UNCONTROLLABLY AND INTO ANOTHER VEHICLE, THE IMPACT CAUSED BOTH VEHICLES TO LEAVE THE ROADWAY AND A FIRE TO ENSUE, THERE WAS ONE FATALITY AND 4 INJURIES. (ATTORNEY FOR CLIENT)   *SLC",
        "vin": "1GCGKZ4R0XR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 881077,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AN ELECTRICAL SHORT WITHIN HEAD LIGHT AND TAIL LIGHT BURNED OUT INSTALLATIONS, CAUSING INSUFFICIENT LIGHTING.  CONSUMER HAS CONTACTED DEALER.  *AK  CONSUMER STATES THE WIRING FOR THE TAIL LIGHTS AND DASH LIGHTS IS TOO SMALL WHEN TOWING A TRAILER, THE WIRING IS INADEQUATE TO HANDLE EXTRA LIGHTS, WIRE AT HEADLIGHT SWITCH ARE CHARGED FROM GETTING TOO HOT, CONSUMER FEELS THE WIRING NEEDS TO BE HEAVIER OR ON RELAYS TO SUPPORT THE TRAILER LIGHTS.   *SLC",
        "vin": "1GCHC33JOXF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/18/2000",
        "dateOfIncident": "12/18/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737959,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT, FRONT, BRAKE CALIPER IS NOT FLOATING PROPERLY, AND HAS APPARENTLY BEEN LIKE THIS SINCE NEW.  THE OUTSIDE BRAKE PAD IS UNWORN, AND THE INSIDE PAD IS ALMOST WORN OUT.  VEHICLE VEERED HARD TO LEFT UNDER HEAVY BRAKING. *AK",
        "vin": "1GCGK23R2XF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/15/2000",
        "dateOfIncident": "10/01/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 875020,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN HE GETTING INSIDE OF  VEHICLE AND PRESSING  BRAKES  BRAKES PEDAL GOES DOWN TO THE FLOOR, AND  BRAKES START TO GRAB SLIGHTLY.   DEALERSHIP IS AWARE OF  PROBLEM.  *AK",
        "vin": "1GCGG25R3X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/07/2000",
        "dateOfIncident": "07/01/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874535,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY  BRAKE PEDAL WOULD GO TO  FLOOR, HAVE TO PUMP  BRAKE PEDAL SEVERAL TIMES TO GET VEHICLE TO STOP.  ALSO, CAUSED  EXTENDED STOPPING DISTANCE. VEHICLE BEEN IN DEALER  SHOP ON FIVE OCCASIONS,  AND STILL UNABLE TO DUPLICATE  PROBLEM. PLEASE FEEL FREE TO PROVIDE ANY FURTHER DETAILS ON THIS MATTER.  *AK",
        "vin": "1GCGK23J1XF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/08/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 733697,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES MANUFACTURED WITH VERY MINIMAL DEPTH OF GROOVES ON CENTER 2 TREADS - AFTER SLIGHT TREAD WEAR, CENTER 2 TREADS WEAR FLAT AND CONTRIBUTE TO HYDROPLANING ON SLIGHTLY WET ROAD SURFACES( DOT NUMBER:   )",
        "vin": "1GCGK29R4XF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/08/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 733697,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES MANUFACTURED WITH VERY MINIMAL DEPTH OF GROOVES ON CENTER 2 TREADS - AFTER SLIGHT TREAD WEAR, CENTER 2 TREADS WEAR FLAT AND CONTRIBUTE TO HYDROPLANING ON SLIGHTLY WET ROAD SURFACES( DOT NUMBER:   )",
        "vin": "1GCGK29R4XF"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/19/2000",
        "dateOfIncident": "09/08/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731939,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPLACING ORGINAL DRIVERS SIDE SEATBELT THE REPLACED SEAT BELT FAILED ON 9-6-00, THE LOCAL CHEVY GARAGE HAS ORDERED A NEW REPLACEMENT, BOTH SEATBELTS HAVE LOCKED UP INTO THE SEAT.",
        "vin": "1GCGK29U6XZ"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/22/2000",
        "dateOfIncident": "05/15/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 864035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "G30, BRAKING SYSTEM MALFUNCTIONED, CAUSING  BRAKE PADS TO WEAR OUT. PADS  NEEDED TO BE REPLACED 4 TO 5 TIMES WHICH CAUSED EXTENDED STOPPING DISTANCE, AND  COULD HAVE RESULTED IN A CRASH.  DEALER  WAS NOT WILLING TO HELP, AND COULD NOT DETERMINE THE CAUSE OF THE PROBLEM.  PLEASE PROVIDE FURTHER INFORMATION.  *AK  THE VEHICLE REAR ENDED SOMEONE DUE TO BRAKE FAILURE, THERE WERE NO INJURIES AND THE DEALER IS STILL REFUSING TO WORK ON THE VEHICLE.   *SLC",
        "vin": "1GBJG31R4X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2000",
        "dateOfIncident": "05/08/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 861572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO AN ASSIGNED WORK AREA  HEARD A NOISE UNDER THE BOTTOM OF THE TRUCK.  STOPPED TO INSPECT THE NOISE.  UPON INSPECTION, FOUND THE REAR GAS TANK STRAP DISCONNECTED.  JUST THE FRONT STRAP WAS HOLDING THE TANK IN PLACE, BUT THE REAR OF THE TANK WAS HANGING DOWN WITHIN A COUPLE INCHES FROM THE GROUND.  WAS ABLE TO MAKE THE NECESSARY REPAIRS, AND REPLACED A BOLT.   WILL CONTACT THE DEALER.",
        "vin": "1GCGC29R8XF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/18/2000",
        "dateOfIncident": "11/05/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 860506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES LOCKED UP, BRAKES HAS BEEN REPLACED THREE TIMES.  WHEN CONSUMER APPLIED BRAKES CAR STARTED TO VIBRATE.  CHEVROLET AGREED TO FIX BY 15-JUN-2000 OR REFUND FULL PURCHASE PRICE.  *AK *ML",
        "vin": "1GCGC23RXXF"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM HAS BEEN CONSTANT SINCE I HAVE FIRST OWNED MY TRUCK. THE PROBLEM IS WHEN I AM AT A STOP (I.E. INTERSECTION) THE TRUCK WILL CONTINUE TO SURGE FORWARD TO THE POINT THAT I HAVE TO SHIFT INTO NUETRAL, I HAVE TAKEN IT TO 3 DIFFERENT CHEVROLET SERVICE DEPT.  AND RECEIVED 3 DIFFERENT ANSWERS WITH ONE TELLING ME THAT CHEVY IS AWARE OF THE PROBLEM BUT DOES NOT HAVE A REMEDY YET. I FEEL THIS IS A SAFETY ISSUE THAT NEEDS TO BE RESOLVED. I AM LOOKING FOR SOME DIRECTION ON HOW TO SOLVE THIS PROBLEM. *AK",
        "vin": "1GCGK23R2XF"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/17/2000",
        "dateOfIncident": "04/07/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 858714,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BRAKES LOCK UP.  LIKEWISE,  WHEN  GOING TO SLOW DOWN FOR A TURN CONSUMER WILL JUST SLAM ON BRAKES, AND IT FEELS  LIKE PUTTING ON THE  EMERGENCY BRAKE.  BECAUSE OF THIS PROBLEM, CONSUMER HAS CONSTANTLY HIT HIS HEAD ON STEERING WHEEL.   *AK *ML",
        "vin": "1GCGC29R2X0"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/15/2000",
        "dateOfIncident": "10/04/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 718775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK PULLS TO THE RIGHT WHENEVER THE BRAKES ARE APPLIED.TONY OGBURN, WHO IS THE REGIONAL MANAGER  AND I TEST DROVE THE TRUCK, HE WITNESSED THE TRUCK PULLING TO THE RIGHT WHEN I APPIED THE BRAKES. HIS OPINION WAS THAT THERE WAS NOTHING WRONG WITH THE VEHICLE, THE TRUCK HAS BEEN IN THE REPAIR SHOP 4 TIMES FOR THIS PROBLEM AND STILL IT IS NOT FIXED.",
        "vin": "1GCGK29R7XF"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/27/2000",
        "dateOfIncident": "10/18/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 784458,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO TRANSMISSION FAILED. *ET",
        "vin": "1GCGK29U6XE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/25/2000",
        "dateOfIncident": "02/09/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 717864,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOV EVEHICLE.  *AK",
        "vin": "1GBGC24ROXF"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/22/2000",
        "dateOfIncident": "07/01/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 550549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STAYS AT FAST IDLE AFTER GAS PEDAL IS RELEASED.  YH",
        "vin": "1JCJK29R5XF"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/22/2000",
        "dateOfIncident": "01/10/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 550549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SILVERADO 2500",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING LEFT STEERING MAKES RUBBING NOINSE.  YH",
        "vin": "1JCJK29R5XF"
    }
]