[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/10/2008",
        "dateOfIncident": "11/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248352,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "STRIPPED CHASSIS",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 FORD STRIPPED CHASSIS.  THE CONTACT TOOK THE VEHICLE TO THE FORD DEALER AND THEY DISCONNECTED THE CRUISE CONTROL ACCORDING TO NHTSA CAMPAIGN ID NUMBER 07V336000 (VEHICLE SPEED CONTROL) IN 2007.  WHEN THE PARTS BECAME AVAILABLE, THE VEHICLE WAS REPAIRED ACCORDING TO THE REMEDY REFERENCED IN THE RECALL.  IMMEDIATELY AFTER THE REPAIR WAS MADE, HE NOTICED THAT THE COMPONENT WOULD NOT WORK PROPERLY.  WITHIN ONE YEAR, THE VEHICLE HAS BEEN TAKEN TO THE DEALER SIX TIMES.  CURRENTLY, THE VEHICLE HAS NOT BEEN SUFFICIENTLY REPAIRED.  THE MANUFACTURER REFERRED THE CONTACT BACK TO THE DEALER.  THE TECHNICIAN STATED THAT THE CONTACT WOULD HAVE TO PAY $329 TO HAVE THE VEHICLE DIAGNOSED.  THE VEHICLE HAS NOT BEEN INSPECTED AGAIN.  THE FAILURE MILEAGE WAS 16,652 AND CURRENT MILEAGE WAS 21,469.  UPDATED 12/1/08 *CN  UPDATED 12/05/08.*JB",
        "vin": "3FCNF53S2XJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/08/2008",
        "dateOfIncident": "10/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227042,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "STRIPPED CHASSIS",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 (NA) FORD STRIPPED CHASSIS.  THE CONTACT RECEIVED A FORD RECALL NOTICE FOR THE VEHICLE SPEED CONTROL: CRUISE CONTROL IN OCTOBER OF 2007.  SHE CALLED THE DEALER TO HAVE THE VEHICLE REPAIRED.  A TECHNICIAN AT THE DEALER DISCONNECTED THE CRUISE CONTROL SWITCH AND ADVISED HER THAT THE PARTS WOULD BE AVAILABLE WITHIN 30 DAYS.  SHE HAS NOTIFIED THE DEALER ON SEVERAL OCCASIONS AND THEY CONTINUALLY PROVIDE INACCURATE ESTIMATES AS TO WHEN THE PARTS WILL BE AVAILABLE.  AS OF MARCH 8, 2008, THE VEHICLE HAS NOT BEEN REPAIRED.  THERE HAD BEEN NO FAILURE TO DATE.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT MILEAGE WAS 14,000.",
        "vin": "1FCMF53SX10"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/07/2008",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223564,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "STRIPPED CHASSIS",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 FORD STRIPPED CHASSIS.  THE CONTACT RECEIVED A FORD RECALL NOTICE FOR THE VEHICLE SPEED CONTROL: CRUISE CONTROL IN AUGUST OF 2007.  SHE CALLED THE DEALER IN OCTOBER OF 2007 TO HAVE THE VEHICLE REPAIRED AND A REPRESENTATIVE FROM THE LOCAL DEALER STATED THAT THE PARTS FOR THE REPAIR WERE UNAVAILABLE.  THE REPRESENTATIVE FURTHER STATED THAT THEY WOULD NOTIFY HER WHEN THE PARTS ARRIVE.  SHE DID NOT HAVE THE CRUISE CONTROL SWITCH DISCONNECTED AT THE TIME, INSTEAD SHE MANUALLY DISCONNECTED THE BATTERY.  SHE CALLED THE MANUFACTURER IN MARCH OF 2008 AND WAS INFORMED THAT THE PARTS WERE AVAILABLE.  SHE THEN CALLED HER LOCAL DEALER BACK AND THEY ADVISED HER THAT THEY STILL HAD NOT RECEIVED THE PARTS FROM THE MANUFACTURER.  THE CONTACT ATTEMPTED TO CALL OTHER DEALERS; HOWEVER, THEY WERE AT LEAST TWO HOURS AWAY.  THERE HAD BEEN NO FAILURE TO DATE.  THE ENGINE SIZE, NUMBER OF CYLINDERS, RECALL NUMBER, AND POWERTRAIN WERE UNKNOWN.  THE CURRENT MILEAGE WAS 30,000.",
        "vin": "3FCNF53S1XJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/07/2008",
        "dateOfIncident": "09/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223627,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "STRIPPED CHASSIS",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 (NA) FORD STRIPPED CHASSIS.  THE CONTACT RECEIVED A FORD RECALL NOTICE FOR THE VEHICLE SPEED CONTROL: CRUISE CONTROL IN SEPTEMBER OF 2007.  HE IMMEDIATELY TOOK HIS VEHICLE TO THE DEALER TO HAVE THE CRUISE CONTROL SWITCH DISCONNECTED.  HE WAS INFORMED BY A REPRESENTATIVE THAT THE PARTS WOULD BE UNAVAILABLE UNTIL DECEMBER OF 2007.  HE CALLED BACK IN DECEMBER AND WAS INFORMED THAT THE PARTS WOULD BE AVAILABLE IN MARCH OF 2008.  HE CALLED BACK IN MARCH OF 2008 AND THE DEALER STATED THAT THE PARTS WERE STILL UNAVAILABLE AND THEY DID NOT KNOW WHEN THEY WOULD ARRIVE.  THE MANUFACTURER DID NOT PROVIDE ANY ASSISTANCE.  THERE HAD BEEN NO FAILURE TO DATE.  THE CURRENT MILEAGE WAS 29,000.    UPDATED 4/25/08 *CN  THE CONSUMER STATED THE PROBLEM HAS BEEN RESOLVED.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/09/2008",
        "dateOfIncident": "10/11/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214277,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "STRIPPED CHASSIS",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 FORD STRIPPED CHASSIS.  THE CONTACT RECEIVED A FORD RECALL NOTICE FOR THE VEHICLE SPEED CONTROL: CRUISE CONTROL ON OCTOBER 2007 AND HE IMMEDIATELY SCHEDULED AN APPOINTMENT TO HAVE IT REPAIRED.  HE WAS INFORMED THAT THE PARTS WOULD BE AVAILABLE IN DECEMBER OF 2007.  HE CALLED BACK IN DECEMBER AND WAS INFORMED THAT THE PARTS WOULD NOT BE AVAILABLE UNTIL MARCH OF 2008.  THE CONTACT FILED A COMPLAINT WITH THE MANUFACTURER.  THERE HAD BEEN NO FAILURE TO DATE.  THE RECALL NUMBER, ENGINE SIZE, AND NUMBER OF CYLINDERS WERE UNKNOWN.  THE CURRENT MILEAGE WAS 26,000. UPDATED 03/11/08.  *LJ",
        "vin": "3FCNF53S4XJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "10/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214175,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "STRIPPED CHASSIS",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 FORD STRIPPED CHASSIS MOTORIZED CUTAWAY.  THE CONTACT RECEIVED A SAFETY RECALL NOTICE IN AUGUST OF 2007 AND A SECOND ONE IN OCTOBER.  HE WOULD LIKE TO KNOW WHEN FORD WILL HAVE THE PART FOR THE VEHICLE SPEED CONTROL RECALL REPAIR.  THERE HAD BEEN NO FAILURE TO DATE.  THE PURCHASE DATE, ENGINE SIZE, AND RECALL NUMBER WERE UNKNOWN.  THE CURRENT MILEAGE WAS 55,000.",
        "vin": "3FCNF53S1XJ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2003",
        "dateOfIncident": "06/20/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026326,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "STRIPPED CHASSIS",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING VEHICLE STARTES TO LEAK GAS OVER THE CATALIC CONVERTER SHIELD, CONSUMER IS CONCERNED THAT IF THE PROBLEM CONTINUES THE VEHICLE COULD CATCH ON FIRE. DEALER NOTIFIED. *AK",
        "vin": ""
    }
]