[
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/09/2014",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621117,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY BIKE HARLEY DAVIDSON ROAD KING IN TO THE SHOP FOR A FLAT TIRE. THE MECHANIC SHOWED ME MY SWING HAD ARM BROKEN LITERALLY INTO TWO PIECES. HE INFORMED THAT HARLEY QUIT MAKING THIS PARTICULAR SWING DUE THE HIGH RATE OF FAILURE! THIS IS HIGHLY CONCERNING, AS THIS IS THE PIECE THAT HOLDS THE REAR WHEEL TO THE MOTORCYCLE STRAIGHT WHEN THE TORQUE OF THE MOTOR IS TRANSFERRED TO THE REAR WHEEL. I COULD ISSUE A LOT OF HIGH TECH PHYSICS HERE, BUT SIMPLY PUT IF THE REAR WHEEL OF  MOTORCYCLE IS ALLOWED TO TURN, OR WORSE TWIST, THIS WOULD BE A LIFE THREATENING ISSUE, OR AT VERY LEAST SEVERE INJURY ISSUE. I HAVE SEEN SOME COMPLAINTS TO THIS VERY AGENCY RANGING BACK TO 1999, THIS IS NOW 2014, AND THE ISSUE IS WIDELY KNOW BY MOST OF THE HARLEY DAVIDSON TOURING WORLD. THE MANUFACTURER IS STILL SIMPLY OFFERING THAT THE SWING ARM HAS BEEN DISCONTINUED, AND THERE AS AN AFTERMARKET FIX TO UPGRADE THE SWING ARM TO THE ONE THEY CURRENTLY USE. SO EVEN WITHOUT CATASTROPHIC FAILURE, ONCE THE PROBLEM IS FOUND THERE QUITE A FINANCIAL INVESTMENT TO FIX A KNOWN FAULTY DRIVE TRAIN ISSUE! THIS WHAT I THOUGHT THIS AGENCY WAS HERE TO HELP PREVENT FORM MANUFACTURERS, ACCIDENTS, AND WILLFUL NEGLIGENCE OF SERIOUS ISSUES.  *TR",
        "vin": "1HD1FDV17XY"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/23/2006",
        "dateOfIncident": "04/10/2006",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155908,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF A 1999 HARLEY ROAD KING/FL FAMILY CYCLE. I HAVE HAD THE REAR FORK SWING ARM BREAK AT THE AXLE THROUGH HOLE SLOT ALMOST PUTTING ME IN THE BUSHES. THE SWING ARM IS MADE OF 1/8X1X2 INCH RECTANGULAR STRUCTURAL TUBING WITH THE SIDE WALL(2\") SLOTTED SO THAT LITTLE STRUCTURAL INTEGRITY REMAINS. IN ADDITION:1. THE VEHICLE POWER PLANT HAD INCREASE HORSEPOWER THAT YEAR AND NO MODIFICATION TO THE STRUCTURE.  2. THE SHOCK ABSORBER BOTTOM MOUNT IS TO THE REAR OF THE SLOT SO THAT IT CANTILEVERS EACH TIME THE SHOCK RETRACTS/EXTENDS AND IN ADDITION THE BELT ADJUSTER IS AT THE AXLE POINT AND MADE OF ROUND TUBING INSIDE THE SWING ARM ACTING AS A FULCRUM POINT. THIS LEADS TO TORTIONAL AND TORQUE LOADS EXCEEDING THE STRUCTURAL INTEGRITY/STRENGTH ODF THAT SECTION. IN PREVIOUS YEARS THE SWING ARM WAS ROUND WITH A CASTING END AND THE SHOCK MOUNT FORWARD OF THE \"FULCRUM\" AXLE POINT. IN LATER YEARS THE SWING ARM WAS CHANGED GAIN DUE TO I BELIEVE EXCESSIVE FAILURES.   I ASKED HARLEY TO ASSIST REPEATEDLY IN THE REPLACEMENT OF A CYCLE WITH ONLY 30K MILES. THEY REFUSED AND WOULD NOT FORWARD REQUESTS UP THE LINE OR TO THE ENGINEERING DEPT. AND REFUSED TO ALLOW ME TO REQUEST ANY RELATED RECALL OR SERVICE BULLETIN REGARDING THIS. IT IS A POOR DESIGN, DUE TO THE CUTAWAY OF THE SIDE WALL AND THE LOCATION OF THE SHOCK MOUNT, WHICH EXPONENTIALLY INCREASES THE LOAD PLACED AT THE SHOCK POINT ACCORDING TO PASSENGER WEIGHT, ACCELERATION AND TERRAIN.   IF THEY HAVE CHANGED IT , WHY?  *NM",
        "vin": "1HD1FDV14XY"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/30/2001",
        "dateOfIncident": "12/01/1999",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746161,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CAM BEARING FAILED CREATING LOD GRINDING NOISE. SHUT DOWN ENGINE AND GAVE TO DEALER.CAM BEARING REPLACED WITH SAME TYPE OF ROLLER BEARING NOT UPDATED VERSION .NOW AT 14500 MILES  ENGINE IS BEGINING TO MAKE SAME NOISE AGAIN.NOTIFIED HARLEY DEALER I WAS TOLD THAT A EXTENDED WARRANTY ON MOTOR HAS BEEN ISSUED .BUT THE BEARING WILL ONLY  BE REPLACED WITH THE UPDATED NEEDLE BEARING AFTER TOTAL FAILURE OF  THE OLD STYLE BEARING.  HARLEY   HAS ISSUED A SERVICE KIT #24984-99 TOREPLACE THE DEFECTIVE BEARINGS. BUT THEY ONLY WILL DO THIS AFTER THE MOTOR HAS LITERALLY BLOWN UP. PART OF THE SERVICE KIT IS TO FLUSH ALL METAL OUT OF THE MOTOR AFTER THE OLD STYLE BEARING HAS FAILED.WHAT HARLEY-DAVIDSON NEEDS TO DO IS REPLACE ALL THE DEFECTIVE BEARINGS THAT THEY KNOW ARE OUT IN THE FIELD!",
        "vin": "1HD1FDV18XY"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/07/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735913,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 HARLEY DAVIDSON 88 CUBIC INCH TWIN CAM ENGINES HAVE A KNOWN PROBLEM WITH CAM BEARINGS.  MANY OF THE BEARINGS ARE FAILING CAUSING THE ENGINE TO SEIZE, DIE OR STALL CAUSING A HAZARD TO THE RIDER AND PASSENGER.  HARLEY DAVIDSON IS AWARE OF THIS PROBLEM AND HAS AN UPDATE KIT OF PARTS AVAILABLE TO DEALERS TO FIX THE PROBLEM.  THEY ARE REFUSING TO TAKE ANY ACTION UNTIL THE ENGINE ACTUALLY FAILS.  I BELIEVE THERE SHOULD BE A RECALL TO REPAIR THE KNOWN DEFECTS WITHIN THIS ENGINE.  I CONTACTED HARLEY DAVIDSON CUSTOMER SERVICE DEPARTMENT ON 11/7/00 AND WAS TOLD WHEN MY ENGINE FAILS THEY WILL ADDRESS THE PROBLEM.  I LIVE IN HELENA MONTANA AND THERE IS LARGE PORTIONS OF THIS STATE WHERE THERE IS NO ASISTANCE AVAILABLE SHOULD THE ENGINE SEIZE.  I BELIEVE H-D SHOULD UPGRADE THE DEFECTIVE ENGINES BEFORE THEY FAIL.*AK",
        "vin": "1HD1FHW13XY"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/14/2000",
        "dateOfIncident": "07/26/2000",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731397,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL EQUIPMENT IE. (FACTORY CAMS AND CAM BEARINGS) REPLACED WITH STAGE 1 PERFORMANCE CAMS AND NEW BEARING SETS AT  APPROX. 10,000 MILES THROUGH THE ORIGINAL DEALERSHIP.",
        "vin": "1HD1FDV16XY"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/15/1999",
        "dateOfIncident": "08/01/1999",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 850861,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT TIRE (DUNLOP ELITE) IS UNSTABLE; CAUSING FRONT TIRE TO WOOBLE WHILE DRIVING AT HIGHWAY SPEED OF 70-75 MPH. DEALER NOTIFIED AND REPLACE TIRES. MAKING A REPORT TO NHTSA ON THIS MATTER. *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/22/1999",
        "dateOfIncident": "01/08/1999",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 835138,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ABOUT 20 MPH  ENGINE CAM BOLT SHEARED OFF, CAUSING SUDDEN ENGINE SIEGE. THE BOLT HAS BEEN REPLACED BY THE DEALERSHIP.  *AK",
        "vin": "1HD1FRW32XY"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/30/1998",
        "dateOfIncident": "06/11/1998",
        "fire": false,
        "manufacturer": "Harley-Davidson Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 537637,
        "products": [
            {
                "manufacturer": "Harley-Davidson Motor Company",
                "productMake": "HARLEY-DAVIDSON",
                "productModel": "FLHR",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "PASHANGER FLOOR BOARDS ARE DESIGNED TO EXTEND BEYOND THE CRASH BARS WHEN THE BIKE IS LAID ON ITS SIDE.  THE BIKE FELLOVER AND THE FLOOR BOARD FOLDED AND THE WEIGHT OF THE BIKE BROKE THE RIDER'S ANKLE.",
        "vin": "1HD1FDL16SY"
    }
]