[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/01/2009",
        "dateOfIncident": "08/02/2009",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282555,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL 4 WHEELS LOCKED UP AS THE CAR WAS DRIVING BRINGING CAR TO AN ABRUPT STOP. IF ANOTHER CAR HAD BEEN BEHIND ME WE WOULD HAVE BEEN REAR ENDED AND IF IT HAPPENED AT A HIGH RATE OF SPEED THE CAR AN ACCIDENT WOULD HAVE OCCURRED. *TR",
        "vin": "SALPV1443XA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/21/2009",
        "dateOfIncident": "01/15/2008",
        "fire": true,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266247,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 LAND ROVER RANGE ROVER.  THE CONTACT HEARD A RATTLING SOUND AND NOTICED THAT THE HEAT SHIELD SURROUNDING THE MUFFLER WAS COMPROMISED.  HE TOOK THE VEHICLE TO SEVERAL DEALERS, BUT THEY COULD NOT LOCATE ANY FAILURE.  THE CONTACT STATED THAT THE HEAT FROM THE EXHAUST MELTED THE PLASTIC GAS TANK AND SURROUNDING WIRES.  THE EXHAUST IS LOCATED NEXT TO THE GAS TANK, UNLIKE MOST VEHICLES.  THE DESIGN HAS FUSED THE FUEL PUMP TO THE GAS TANK.  A MECHANIC INSPECTED THE VEHICLE AND STATED THAT THE HEAT FROM THE EXHAUST HAS CAUSED A DANGEROUS FUEL LEAK.  THE EXHAUST SYSTEM WAS REPAIRED FOR $2,000 BY A LOCAL MECHANIC.  THE MECHANIC STATED THAT THE FUEL DESIGN WAS A SAFETY HAZARD AND CAUSED THE DAMAGE.  LAND ROVER REFUSED TO REPAIR THE VEHICLE FOR FREE.  THE FAILURE MILEAGE WAS 90,000 AND CURRENT MILEAGE WAS 110,000.",
        "vin": "SALPV1440XA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/14/2008",
        "dateOfIncident": "09/14/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242124,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY '99 RANGE ROVER WHEN MY ABS, TRACTION CONTROL AND BRAKE LIGHTS LIT. WITHIN MINUTES, I LOST CONTROL OF MY BRAKES. UPON INSPECTION, MY BRAKE PADS WERE IN GOOD CONDITION, THE BRAKE FLUID CANISTER WAS FULL (AND THERE WERE NO LEAKS), AND WHEN I CHECKED MY BRAKE LINES, I FOUND THAT BRAKE FLUID WAS NOT PUMPING INTO THE TWO REAR BRAKES. I DID RESEARCH ONLINE AND FOUND THAT THERE WERE HUNDREDS OF PEOPLE THAT HAVE EXPERIENCED THE SAME PROBLEM: A FAILURE OF THE BRAKE MODULAR UNIT. DURING THE FIRST HALF OF 1999, THE MANUFACTURER USED PLASTIC COMPONENTS IN THE CONSTRUCTION OF THE UNIT, BUT CHANGED THE PLASTIC TO STEEL. SINCE THEN, THE OWNERS OF VEHICLES WITH PLASTIC COMPONENTS HAVE SUFFERED BRAKE FAILURES RESULTING FROM THE BREAK DOWN OF THE PLASTIC COMPONENTS. THIS IS ABSOLUTELY A SAFETY ISSUE AND THERE NEEDS TO BE A RECALL. PEOPLE COULD DIE!  *TR",
        "vin": "SALPA1246XA"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "05/12/2008",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236854,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 LAND ROVER RANGE ROVER.  THE CONTACT TOOK HER VEHICLE TO THE DEALER BECAUSE OF A CRACKING NOISE SHE HEARD NEAR THE FRONT SUSPENSION.  THE DEALER REASSEMBLED THE AIR SUSPENSION AND INFORMED HER THAT IT SHOULD CORRECT THE FAILURE.  ALMOST A MONTH LATER, WHILE DRIVING 65 MPH, THE VEHICLE BEGAN TO MAKE A HUMMING NOISE.  THE AIR SUSPENSION LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND THE VEHICLE BEGAN TO LOSE POWER.  THE CONTACT MANAGED TO GET OFF THE FREEWAY AND DRIVE AT LOW SPEEDS TO HER RESIDENCE.  SHE CALLED THE DEALER AND THEY STATED THAT THEY WERE NOT RESPONSIBLE FOR THE DEFECT.  THE FAILURE MILEAGE WAS 78,000 AND CURRENT MILEAGE WAS 80,000.",
        "vin": "SALPV1440XA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/14/2007",
        "dateOfIncident": "11/11/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208888,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ALL ELECTRICAL POWER IS LOSS AND CAR COASTS TO A STOP.  INTERMITTENT FAILURE WHICH HAS NOT BEEN RESOLVED BY SHOP.  SUSPECT BECM CONTROL UNIT FAULT.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/02/2007",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198306,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 LAND ROVER RANGE ROVER.  WHILE STOPPED AT A RED LIGHT, THE VEHICLE WOULD NOT ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED.  THE ENGINE CONTINUED TO RUN.  THERE WERE NO WARNING INDICATOR LIGHTS ILLUMINATED.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE FRONT DIFFERENTIAL NEEDED TO BE REPLACED.  THERE IS A DEFECT INVESTIGATION (ACTION # PE07019) FOR THE DIFFERENTIAL FOR THE 2002-2004 MODELS.  THE CURRENT AND FAILURE MILEAGES WERE 134,000.  THE CONSUMER PROVIDED A COPY OF THE REPAIR INVOICE. UPDATED 08/29/07  *TR",
        "vin": "SALPV1441XA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/14/2006",
        "dateOfIncident": "08/08/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173522,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAR SIR,  HAVE YOU BEEN AWARE OF AN INADVERTENT LONG TRAVEL ISSUE OF SERVICE BRAKE AT OLDER (SERIES I-II) RANGER ROVERS ?  THIS IS ALREADY A KNOWN ISSUE IN JAPAN BY INITIATING A SURPRISE AUDIT BY JAPAN MINISTRY OF LAND INFRASTRUCTURE AND TRANSPORT (MLIT) AGAINST THE NATIONAL SALES COMPANY, PREMIUM AUTOMOBILE INCORPORATION (JAPAN) A FEW YEARS AGO.  NOT ONLY A SMALL VOLUME (MORE THAN 50 CASES), THERE HAVE BEEN LOTS OF MARKET FEEDBACKS REGARDING THIS ISSUE.  THIS PHENOMENON IS CAUSED NOT ONLY BY THE FOUL OF ABS UNIT ITSELF (CAUSED BY SOME METAL DEBRIS WITHIN THE ABS UNIT), BUT ALSO FOULS OF ACTUATOR, ABS PUMP UNIT, AND THE PRESSURE REGULATOR.  ONCE AGAIN THE PHENOMENON EXPERIENCED BY LOTS OF JAPANESE CUSTOMERS IS ALWAYS THE SAME; INADVERTENT LONG BRAKE TRAVEL SCARCELY TO SHAFFE THE SERVICE BRAKE PEDAL PAD WITH THE FLOOR PANEL.  IN ADDITION, THE REAR BRAKE FORCE WAS INACTIVE WHEN THIS FOUL OCCURS.  THUS THIS PHENOMENON IS UTTERLY A SAFETY RELATED ISSUE, I AM STILL WONDERING WHY THE JAPAN MINISTRY IS RELUCTANT TO LET THE MANUFACTURER INITIATE A RECALL CAMPAIGN IN JAPAN.  THE LAST THING I WOULD LIKE TO ADD; THIS IS NOT A JAPAN UNIQUE ISSUE BUT MUST BE A KNOWN ISSUE NOT ONLY IN THE STATES BUT ALSO AT OTHER NATIONS.    REGARDS,  RANGE ROVER OWNER. *JB",
        "vin": "SALLSUMVX6A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2006",
        "dateOfIncident": "09/11/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168978,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE 90 AND THE FRONT DIFFERENTIAL LOCKED UP.  *NM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/28/2006",
        "dateOfIncident": "04/30/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161007,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE PASSENGER REAR SIDE TIRE SIDEWALL DEVELOPED A CRACK WHICH PROGRESSIVELY WORSENED.  THE CONTACT WAS UNSURE OF PROPER AIR PRESSURE.  THE TIRE WAS ABOUT A YEAR AND A HALF OLD AT THE TIME OF THE INCIDENT.  THE TIRES HAD BEEN REGULARLY SERVICED, ROTATED AND HAD  PRESSURE CHECKS.  THERE WAS NO VIBRATION OR ABNORMAL BULGING.     UPDATED 7/13/2006 - NITTO TIRES *NM",
        "vin": "SALPV1443XA"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/24/2006",
        "dateOfIncident": "03/24/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153632,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE REAR PASSENGER SEAT BELT BUCKLE CAME APART AND IS INOPERABLE.  ALSO, THE REAR DRIVER SIDE SEAT BELT IS BEGINNING TO COME APART.  THE DEALERSHIP WAS ALERTED, BUT THE VEHICLE HAS NOT BEEN INSPECTED.    UPDATED 05/02/06.",
        "vin": "SALPV1443XA"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2006",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150118,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER: LAND ROVER  MODEL: RANGE ROVER 4.0SE  YEAR: 1999  LOCATION: NEW YORK CITY  DUE TO A HIGH RADIO FREQUENCY SIGNAL IN MY NEIGHBORHOOD FROM BUILDING/COMMERCIAL ANTENNAS, MY VEHICLE'S BECM (COMPUTER) HAS BEEN RECEIVING/ATTRACTING SIGNALS ERRONEOUSLY WHILE PARKED INSIDE A GARAGE.  AS A RESULT, THE COMPUTER IS KEPT ACTIVE THE ENTIRE TIME IT IS PARKED THUS DRAINING THE BATTERY.  IN ADDITION, THE SIGNAL HAS CAUSED BOTH LEFT AND RIGHT SIDE DOORS TO SHORT AND MALFUNCTION.  SINCE THE VEHICLE'S BATTERY IS FULLY DRAINED, IT HAD TO BE TOWED TO THE LOCAL DEALERSHIP.  BOTH FRONT AND RIGHT SIDE DOOR LATCHES PLUS BATTERY HAD TO BE REPLACED.  FINALLY, A SWITCH HAD TO BE INSTALLED IN ORDER TO MANUALLY TURN THE COMPUTER ON AND OFF.  TOTAL PARTS AND LABOR PLUS TOWING COSTS HAVE TOTALED TO APPROX. $3,000.  FINALLY, ANOTHER RANGE ROVER IN MY GARAGE HAS EXPERIENCED THE SAME PROBLEM AND WILL HAVE TO UNDERGO THE SAME TYPE OF REPAIRS AND INCUR THE SAME COSTS. *JB",
        "vin": "SALPV1243XA"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/10/2005",
        "dateOfIncident": "11/07/2005",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142399,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATES THERE IS  NHTSA RECALL 00V377000 CONCERNING AUTOMATIC TRANSMISSION  FOR A VEHICLE THAT IS IN DEALER'S  SHOP BEING REPAIRED.  THIS VEHICLE IS EXPERIENCING THE SAME PROBLEMS AS INDICATED IN THE RECALL.     *AK",
        "vin": "SALPV1445XA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "07/09/2004",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121361,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER OWNS A 1999 RANGE ROVER. SHE STATES THAT SINCE SHE PURCHASED THE VEHICLE AND HAVE BEEN HAVING PROBLEMS WITH THE VEHICLE, SUCH AS ABS LIGHT STAYING ON/OIL LEAKAGE/ENGINE PROBLEMS/RADIATOR, FAILURE, AND TRANSMISSION  COOLER LINE PROBLEMS.*AK  THE CONSUMERS AIR BAG FAULT LIGHT HAS BEEN ON EVERY SINCE SHE PURCHASED THE VEHICLE. THE VEHICLE FLUIDS HAVE BEEN CHANGED SEVERAL TIMES SUCH AS TRANS COOLER, OIL COOLER, BRAKE FLUID, MOTOR COOLANT, ETC.*SB",
        "vin": "SALPV1244XA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2004",
        "dateOfIncident": "05/23/2002",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072371,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 23, 2002 BROUGHT TO LAND ROVER (PHILIPS HWY) FOR SRS/AIRBAG LIGHT ON. UNDER WARRANTY. ON 8/05/02 SRS/AIRBAG LIGHT ON AGAIN PARTS ORDERED AND THE TRUCK WENT IN ON ANOTHER DAY TO BE FIXED. ON 10/08/02 SRS/AIRBAG LIGHT ON AGAIN NOTED ON RECEIPT. ON 3/17/03 SRS/AIRBAG LIGHT WAS ON FOR THE FOURTH TIME PARTS WERE ORDERED ON 3/20/03 TRUCK NEEDED TO BE BROUGHT BACK WHEN PARTS WERE IN. DURING THAT TIME PERIOD I WAS NEVER CALLED TO TELL ME THE PARTS ARE IN. AROUND THE END OF MAY WE CALLED AND THEY SAID THE PARTS WERE IN. THE TRUCK WAS BROUGHT BACK IN ON 9/29/03 AT ATLANTIC BLVD A NEW DEALERSHIP THAT BOUGHT OUT THE OLD ONE. ON 10/03/03 THE TRUCK WAS PICKED UP ON 11/14/03 SRS/AIRBAG LIGHT ON AGAIN. AT THIS POINT [XXX] MY HUSBAND CALLED LAND ROVER ON ATLANTIC BLVD ON 11/15 THEN AGAIN 11/17 AND 11/18/03 ONCE IN THE MORNING THEN THE AFTERNOON. MESSAGES WERE LEFT FOR MARK WADE THE MANAGER. [XXX] (HUSBAND) WENT THERE ON 11/18 AFTER NO CALL WAS RETURNED.  [XXX] SPOKE WITH [XXX] ABOUT THE SITUATION HE WAS TOLD THAT THE SOONEST HE COULD LOOK AT IT WAS 12/03/03 (2 WEEKS LATER) AS YOU CAN SEE THERE WAS NO CONCERN FOR OUR SAFETY IN THIS TRUCK. [XXX] WAS ASKED IF THE AIRBAG WILL DEPLOY IN AN ACCIDENT HE COULD NOT TELL [XXX] IF THE BAGS WILL WORK . THERE WAS NO GUARANTY FOR OUR SAFETY. WE DO NOT FEEL SAFE IN THIS TRUCK. THIS WAS ALL EXPLAINED TO A CUSTOMER SERVICE REP AT LANDROVER AS WELL. HER NAME IS [XXX]. I WAS TOLD THAT THE SRS LIGHT SHOULD NOT GO ON AGAIN. BUT THE LIGHT DID ONCE AGAIN COME BACK ON THEY REPLACED THE WHOLE AIRBAG BOX UNDER THE SEAT. CONTACTED [XXX] AT LANDROVER AGAIN. I GOT THE SAME STORY THAT THE LIGHT SHOULD NOT GO ON AGAIN. BUT IT WENT ON AGAIN IN FEB 04. IT TOOK 3-4 DAYS FOR [XXX] TO RESPOND TO ME. TO MAKE A LONG STORY SHORT THEY REMOVED THE DASH AND THE CENTER CONSOLE, STEERING WHEEL AND SO-ON. THEY REWIRED THE WHOLE SYSTEM. THERE IS A LOT TO THIS STORY.  IT IS NOW MAY 10 AND THE LIGHT HAS COME BACK ON FOR THE 7 OR 8 TIMES NOW.   *LA    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "SALPV1442XA"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/12/2004",
        "dateOfIncident": "03/03/2004",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063064,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AIR BAG LIGHT ILLUMINATED. THE DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM.  *AK",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/24/2002",
        "dateOfIncident": "05/07/2002",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764697,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS HAD CONTINOUS PROBLEMS WITH THE AIR CONDITIONING AND OVERHEATING.  3 OR 4 TIMES THE CAR HAS BEEN RETURNED TO ME WITH THE WARNING LIGHTS STILL ON.  TWICE THE CAR WAS RETURNED TO ME AND HAD TO BE TOWED BACK TO THE DEALER THE SAME DAY FOR OVERHEATING.  THE CAR HAS NOW BEEN IN THE DEALERSHIP OVER 5 WEEKS, 2 NEW WIRING HARNESSES, THE ORIGINAL HARNESS PUT BACK IN , AND STILL IS OVER HEATING.  THE DEALER AND THE MANUFACTURER HAVE BEEN CONTACTED DAILY SINCE THE PROBLEM BEGAN IN MAY.  NO EFFORT TO REPLACE/BUY BACK/TRADE MY CAR HAS BEEN ACCEPTED.  DEALER NEVER RETURNS PHONE CALLS OR CALLS WHEN PROMISED.  VEHICLE USED FOR WORK (CATERING) AND GIVEN SMALL LOANER CAR THAT IS UNACCEPTABLE FOR BUSINESS.  DEALER HAS NO RESPECT FOR CONSUMER AND DOES NOT PROVIDE SERVICE DEMANDED FOR THIS PRICE VEHICLE.  WAS ALSO TOLD THIS WAS DEALER DEMONSTRATOR AND FOUND OUT IT WAS PURCHASED AT AUCTION.",
        "vin": "SALPV1441XA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884262,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL 00V328000/ ENGINE COOLANT SYSTEM FAILURE IN  JAN 2001.  CONTACTED CLOSEST DEALER, PIONEER  CENTER, SAN DIEGO, CA  WHICH WAS  150 MILES AWAY, MADE APPOINTMENT. HAD TO WAIT 3 WEEKS.  WENT TO APPOINTMENT, AND WAS TOLD DEALER COULD NOT PERFORM RECALL BECAUSE THEY HAD TOO MANY VEHICLES.CONSUMER WAS UPSET BECAUSE DEALER COULD NOT GUARANTEE  AN APPOINTMENT,  AND REFUSED TO SELL PARTS EVEN IF CONSUMER PAID FOR IT.IN MEANTIME CONSUMER WAS DRIVING AN UNSAFE VEHICLE.*AK",
        "vin": "SALPE1242TA"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2001",
        "dateOfIncident": "03/12/2001",
        "fire": true,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884357,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AN UNDER  HOOD FIRE WHILE DRIVING AT 25-30 MPH.  CAUSE APPEARED TO BE A FUEL LEAKAGE. DEALER / MANUFACTURER WERE  NOTIFIED.   *AK",
        "vin": "SALPA1246XA"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/21/2001",
        "dateOfIncident": "07/01/2000",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 883635,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  CONSUMER NOTICED FLUID LEAKING FROM VEHICLE, TOOK VEHICLE TO DEALER WHO FOUND ENGINE COOLANT WAS BEING FLUSHED FROM VEHICLE.  ENGINE SEAL REPLACED 3 TIMES SINCE PURCHASE.*AK",
        "vin": "ADD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2000",
        "dateOfIncident": "11/01/2000",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 736344,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD MY MY LAND ROVER DEALER THAT THEY HAVE HAD A RASH OF INCIDENTS WHERE A DRIVER BACKED UP HIS VEHICLE, DIDN'T COME TO A COMPLETE STOP, AND BROKE THE TRANSMISSION.  I AM WRITING THIS BECAUSEI FELT IT IMPERATIVE YOU BE ADVISED  OF A SITUATION THAT INVOLVES A PRODUCT DEFECT THAT DIRECTLY IMPACTS THE SAFETY OF PASSENGERS IN LAND ROVER PRODUCTS.      IS BECAUSE.  *AK",
        "vin": "SALPA1248XA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/01/2000",
        "dateOfIncident": "07/01/1999",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 733103,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DEMAND REPLACEMENT OF CAR DUE TO BEING STRANDED ON ROAD WITH FAMILY AND POOR SERVICE OF EMERGENCY PICK UP  THEY REFUSED TO ACKNOWLEDGE MY DESPERATE SITUATION.  THANKS. NO SAFETY DEFECT MENTIONED.*AK",
        "vin": "SALTY1245XA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/27/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 871653,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  BELT TENSIONER  FAILED, CAUSING THE FLEXIBLE  TOOTH TIMING BELT TO BREAK, CAUSING LOSS OF POWER STEERING ABILITY.  *AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/18/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 551928,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "A SUDDEN ACCELERATION OF THE VEHICLE CAUSES THE REAR SEAT TO FALL DUE TO LACK OF DEVICE TO AFFIX THE SEATS. YH",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 551574,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALLED STEERING PUMP PULLEY REPAIR CANNOT BE COMPLETED DUE TO LACK OF PARTS 99V-278.  NLM",
        "vin": "SALPV1444XA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/28/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 551574,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALLED STEERING PUMP PULLEY REPAIR CANNOT BE COMPLETED DUE TO LACK OF PARTS 99V-278.  NLM",
        "vin": "SALPV1444XA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/30/1999",
        "dateOfIncident": "10/29/1999",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 549770,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL COMPONENT FAILED PRIOR TO REPAIR (99V-278), CONSUMER HAD DIFFICULTY IN SCHEDULING APT, POWER STEERING LOSS DUE TO FAILURE.   MJS",
        "vin": "SALPV1442XA"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/04/1999",
        "dateOfIncident": "05/01/1999",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 849801,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED, AND APPLYING THE BRAKES THEY GO HALF WAY TO THE FLOORBOARD, AND THERE IS A GRINDING NOISE.  DEALER CAN'T DETERMINE THE CAUS EOF THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/29/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 849238,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ARM REST IN THE MIDDLE OF THE REAR SEAT WHEN IT IS IN THE UPRIGHT POSITION IMPAIRS THE VISION OF THE DRIVER.  VERY DIFFICULT TO SEE OUT OF REAR WINDOW.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/28/1999",
        "dateOfIncident": "08/24/1999",
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 846229,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP PULLEY DETACHED BY  ITSELF FROM THE POST WHICH DISCONNECTED THE POWER STEERING.  *AK",
        "vin": "SALPV1446XA"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/08/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Land Rover",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 548375,
        "products": [
            {
                "manufacturer": "Land Rover",
                "productMake": "LAND ROVER",
                "productModel": "RANGE ROVER",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP PULLEY DETACHED FROM ITS WELD POST WHICH CAUSED THE MAIN BELT TO SHRED.  *YC",
        "vin": "SALPV1446XA"
    }
]