[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2021",
        "dateOfIncident": "07/23/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11427306,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "The ETM is acting up for no reason available",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "09/29/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373727,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IM DRIVING AND HAVE TO COME TO A SLOW STOP IM HEARING THE MASTER CYLINDER SOUND LIKE ITS RUBBING AGAINST SOMETHING LOUDLY EVEN WITH THE APPROPRIATE BRAKE FLUID AND MEASURE IS FILLED WITHIN IT, ALSO THE AIR CONDITIONER BLOWS HOT AIR DURING THE SUMMER CAUSING THE CAR TO FAIL DURING HOT WEATHER",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2020",
        "dateOfIncident": "10/02/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11373728,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THERES A RECENT RECALL ON THE AIRBAGS OF THE 1999 S80 VOLVO THAT WE NEED OUR AIRBAGS REPLACED BECAUSE ITS A HAZARD THAT CAN LEAD UP TO DEATH. ALSO THE ELECTRICITY KEEPS ZAPPING DOWN FROM THE CAR CREATING NO STARTS OR VERY POOR DRIVING, I ALMOST WAS STRANDED BECAUSE THE CAR SEEMS LIKE IT WANTED TO SHUT DOWN ONE NIGHT I WAS GETTING OFF WORK, I HIT FULL GAS AND IT ONLY GAVE ME 3 MPH AND ALSO WHEN I MADE A RIGHT TURN ONE NIGHT FROM WORK I FEEL THE WHEEL FEEL LIKE ITS COMING APART FROM THE INSIDE OR LOOSENING I DONT KNOW WHAT IT IS BUT IT FEELS AND SOUNDS ROUGH",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "01/01/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084691,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ECM",
        "vin": "YVITS90D5X1"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2017",
        "dateOfIncident": "04/10/2012",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11034282,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 VOLVO S80. WHILE STATIONARY, THE VEHICLE LEAKED FUEL ONTO THE GROUND. WALLACE VOLVO IN STUART, FLORIDA DIAGNOSED THE VEHICLE AS HAVING A MASS AIR FLOW FAILURE. THE VEHICLE WAS REPAIRED BY DON IMPORTS AUTO SERVICE IN VERO BEACH, FLORIDA. IN ADDITION, WHILE DRIVING 2 MPH, THE VEHICLE CAUGHT FIRE UNDERNEATH THE DRIVER'S SEAT. A POLICE REPORT WAS FILED. THE CONTACT EXTINGUISHED THE FIRE WITH THE ASSISTANCE OF A NEIGHBOR. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS TOWED TO WALLACE VOLVO IN STUART, FLORIDA. THE VEHICLE WAS NOT DESTROYED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE AND VIN WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2016",
        "dateOfIncident": "01/19/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823300,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WE WERE TRY I G TO REPAIR THIS VEHICLE WE WERE TEST DRIVING IT A D CAME TO A FULL STOP AT A STOPLIGHT SIGNAL AND COULD NOT DOWNSHIFT VEHICLE INTO 1ST GEAR FROM A STOP AFTER THE VEHICLE WAS AT NORMAL RUNNING TEMPERATURE. CAUSING IT TO GO I TO A LIMP HOME MODE. SO WHILE WE WERE DRIVING WE NOTICED THAT THE FLOOR WAS SATURATED WITH ANTIFREEZE AND A SWEET ODOR FROM THE VENTS WAS NOTICED WITH A SMOKE . WE SERVICED THE TRANSMISSION WITHOUT SUCCESS .     ALSO NOTICED AN NO OIL PRESSURE READ ON DASH ONLY WHEN WE WERE NOT IN ACCELERATION. THIS DISAPPEAR WHEN UPON ACCELERATION  AND RETURNED WHEN IDLING. WE SERVICED THE OIL FILTER THE FLUIDS PERFORMED A MOTOR FLUSH FIRST AND REPLACED THE OIL PRESSURE SWITCH. WITHOUT SUCCESSFUL REPAIRS AND CONTINUE OF THE CODE RETURNS AFTER PERFORMING A DRIVE CYCLE NUMEROUS TIMES. WE ARE CONVINCED THIS IS CAUSED BY THE RECALL #R155. THANK YOU FOR HELP IN REPAIRING THIS ISSUE UNDER THE NHTSA RECALL#06V441000.  *TR",
        "vin": "YV1TS97DXX1"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2016",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820242,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 VOLVO S80. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 30 MPH, THE VEHICLE BEGAN TO OPERATE ROUGHLY AND THE ENGINE STALLED WITHOUT WARNING. AFTER FIFTEEN MINUTES, THE VEHICLE RESTARTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  IN 2007, THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 06V441000 (VEHICLE SPEED CONTROL) HOWEVER, THE FAILURE RECURRED EIGHT YEARS LATER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "YV1TS97D6X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/15/2014",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610714,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 VOLVO S80. THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE POWER STEERING FAILED.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE RACK AND PINION AND THE POWER STEERING PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 153,000.",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10558799,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD THIS PROBLEM FOR MONTHS NOW. THE CAR SHUTS DOWN AND WON'T RESTART! I BEEN TAKING OFF THE BATTERY AND LETTING IT SIT OVER NIGHT, THEN PUTTING CABLES BACK ON TO GET IT TO RESTART! TODAY I DROVE IT FOR A  MILE AND PARKED IT AND WHILE IT WAS RUNNING IT SHUT DOWN AGAIN! MOST OF THE TIME IT SHUTS DOWN WHEN I'M DRIVING AND I LOSE BRAKE CONTROL!  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2012",
        "dateOfIncident": "08/14/2003",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473816,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 VOLVO S80. THE CONTACT STATED THAT AS THE VEHICLE WAS BEING STARTED, A STRONG BURNING ODOR BEGAN TO CIRCULATE INSIDE OF THE VEHICLE. IMMEDIATELY, THE CONTACT EXITED THE VEHICLE AND NOTICED FLAMES EMITTING FROM THE EXHAUST PIPE. THE CONTACT THEN EXTINGUISHED THE FLAMES.  THE VEHICLE HAD BEEN REPAIRED FOUR TIMES PRIOR TO THE RECENT FIRE FOR A SEVERE OIL LEAK. THE TURBO OIL TRAP PCV WAS REPLACED EACH TIME. THE REPAIRS WERE PERFORMED BY AN AUTHORIZED DEALER. THE CONTACT ALSO REPLACED THE PART HIMSELF. THE VEHICLE HAD NOT BEEN REPAIRED FOR THE MOST RECENT FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 65,000.",
        "vin": "YV1TS90D0X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/23/2011",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436884,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 VOLVO S80. WHILE THE VEHICLE WAS PARKED THE CONTACT SMELLED A STRONG FUEL ODOR IN THE VEHICLE. THE SMELL WAS COMING FROM THE REAR END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE MECHANIC STATED THE FUEL PUMP WAS FRACTURED AND HAD TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 105,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/02/2011",
        "dateOfIncident": "02/14/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416712,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 1999 VOLVO S80. THE CONTACT STATED THAT AFTER PARKING, SHE NOTICED THE VEHICLE WAS LEAKING POWER STEERING FLUID. THE VEHICLE WAS TAKEN TO A REPAIR SHOP, BUT THE DIAGNOSIS WAS UNKNOWN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND THEY STATED THAT THE VIN DID NOT QUALIFY FOR AN UNKNOWN RECALL THAT WAS MENTIONED ON TELEVISION. THE NHTSA CAMPAIGN ID WAS UNKNOWN. THE FAILURE MILEAGE WAS 107,000, AND THE CURRENT MILEAGE WAS 109,000.",
        "vin": "YV1TS90D9X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "07/22/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414964,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 VOLVO S80. WHILE DRIVING  APPROXIMATELY 60 MPH THE VEHICLE SUDDENLY STALLED. THE CONTACT STATED THE FUEL GAUGE DID NOT READ EMPTY AT THE TIME THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING.  THE APPROXIMATE FAILURE MILEAGE WAS 70,000.   UPDATED 8/29/11 *CN  THE CONSUMER STATED A RECALL WAS ISSUED REGARDING DEFECTIVE FUEL PUMPS. HOWEVER, HER VEHICLE WAS NOT INCLUDED IN THE RECALL.  THE DEALER WAS UNABLE TO DETERMINE WHAT CAUSED THE VEHICLE TO STALL. UPDATED 09/28/11",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/12/2011",
        "dateOfIncident": "06/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411937,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 1999 VOLVO S80. THE CONTACT STATED THE VEHICLE FAILED TO START. THE VEHICLE WAS TAKEN TO THE DEALER NUMEROUS FOR THE FAILURE. THE DEALER REPLACED THE BATTERY AND THE WIRING HARNESS BUT TO NO AVAIL. THE FAILURE MILEAGE WAS 186,585 AND THE CURRENT MILEAGE WAS 187, 642.",
        "vin": "YV1TS97D4X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "05/20/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402818,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING YOU TODAY IN REGARD OF A RECALL FOR MY 1999 VOLVO S80'S ETM (ELECTRONIC THROTTLE MODULE).  IN 2006, THERE WAS A CLASS ACTION LAWSUIT IN WHICH VOLVO AGREED TO EXTEND THE WARRANTY OF THE ETM TO 10 YEARS OR 200,000 MILES.  I HAVE OWNED THE CAR FOR ABOUT A YEAR AND BOUGHT THE CAR FROM MY FATHER.  MY FATHER OWNED THE CAR SINCE 2007, AND HAD FRUSTRATINGLY SPENT A TOTAL OF APPROXIMATELY $7,000 IN (DOCUMENTED) REPAIRS.  HE NEVER RECEIVED NOTIFICATION OF THIS RECALL AND WOULD HAVE UNDOUBTEDLY MADE THAT REPAIR KNOWING THE PART WAS RECALLED AND THERE WAS A STRONG LIKELIHOOD THE PART WAS DEFECTIVE.  THE CAR AS OF NOW HAS UNDER 126,000 MILES AND HAS BEEN OUT OF WARRANTY SINCE 2009.  VOLVO WILL COVER A SOFTWARE UPGRADE FOR FREE, BUT IN THE EVENT THE SOFTWARE PATCH FAILS, THE REPAIR WILL COST IN UPWARDS OF $1000.  IS THERE ANYTHING YOU CAN DO ON MY BEHALF TO GET THAT REPAIR TAKEN CARE OF  SERVICE BULLETIN NUMBER : 155  NHTSA ITEM NUMBER : 10019595  COMPONENT : VEHICLE SPEED CONTROL  DATE OF BULLETIN : MAR 20, 2006  I SINCERELY THANK YOU FOR ANY HELP YOU CAN GIVE ME.  *TR",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2011",
        "dateOfIncident": "03/28/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394198,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO, I RECENTLY PURCHASED USED \"99 VOLVO S80 T6  - VIN [XXX].  A FRIEND WAS STANDING NEXT TO MY PARKED CAR LAST WEEK, STARTED TO LIGHT A CIGARETTE, AND I STOPPED HIM BECAUSE I SMELLED A STRONG GASOLINE VAPOR.  LOOKING UNDER THE CAR, THERE WAS WHAT LOOKED TO BE ABOUT 2 CUPS OF RAW GAS ABOUT 1/2' IN AND IN FRONT OF THE PASSENGER REAR TIRE.  ASIDE FROM THE OBVIOUS LOSS OF A VEHICLE, WE COULD VERY EASILY HAVE BECOME A BURN STATISTIC OR WORSE, AND THAT LIKELY WOULD EXTEND TO ALL OF THE HE OTHER PEOPLE WHO WERE STANDING NEARBY. AT THE TIME.  AN INTERNET SEARCH FOR \"VOLVO S80 FUEL LEAK\" THAT EVENING YIELDED MULTIPLE RESULTS THAT INDICATED THIS IS COMMONLY REPORTED PROBLEM ON ALL S-80 MODELS, AND THAT A RECALL WAS IN EFFECT FOR 2002 AND NEWER VEHICLES TO REPLACE THE FUEL PUMP DUE TO FAILURE WITH HAIRLINE CRACKS IN THE NOZZLE CONNECTING TO THE RETURN LINE, CAUSING A LOT OF FUEL TO SPRAY UNDER THE CAR BELOW THE REAR SEAT, SINCE THE RETURN LINE IS UNDER HIGH PRESSURE AT ALL TIMES.  HERE IS BUT ONE LINK ON THIS SAFETY PROBLEM AND RECALL - HTTP://WWW.MATTHEWSVOLVOSITE.COM/FORUMS/VIEWTOPIC.PHP?F=11&T=25517.    UPON OPENING THE ACCESS PANEL TO VIEW THE TOP OF THE FUEL PUMP, IT WAS CLEARLY EVIDENT THAT MY CAR HAS THE EXACT SAME PROBLEM AS DESCRIBED IN THE RECALL NOTICE.  I CALLED VOLVO CUSTOMER SERVICE (800 458 1552) AND WAS TOLD THERE ARE NO ACTIVE RECALLS MATCHING MY VIN.  I PUSHED ABOUT THE RECALL AND THEY FINALLY AGREED IT IS A WELL KNOWN PROBLEM BUT THE RECALL DOESN'T APPLY TO 99-01 MODELS, EVEN THOUGH THEY ALSO AGREED THAT THEY USE EXACTLY THE SAME PUMP AND CONFIGURATION.  I WAS ALSO TOLD THAT VOLVO DOESN'T HAVE A PHONE NUMBER FOR NHTSA!  SOMEONE IS GOING TO GET SERIOUSLY INJURED OR KILLED BECAUSE OF THIS CATASTROPHIC FUEL SYSTEM FAILURE, SO PLEASE, PLEASE, PLEASE, EXPAND THIS RECALL FOR ALL YEARS AND MODELS OF VOLVO THAT USE THIS KNOWN DEFECTIVE COMPONENT.  [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2011",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376279,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80 T6 TRANSMISSION WENT COMPLETELY OUT.  WOULD NOT GO FORWARD OR BACK.  TOWED IN AND SAID TRANSMISSION NEEDED TO BE REPLACED.  ALSO MECHANIC SAID THE CV SHAFT THAT CONNECTS THE TRANSMISSION TO THE SPINDLE NEEDED REPLACED AFTER THE TRANSMISSION WAS REPLACED. *TR",
        "vin": "YV1TS90D2X1"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/17/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366607,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80. WHILE ACCELERATING FROM A STOP, THE CONTACT FELT A THUMP FROM THE DRIVER SIDE WHEEL. THE FAILURE OCCURRED WHENEVER SHE ACCELERATED FROM A STOP OR DECELERATED. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED THAT THE INSULATION SURROUNDING THE WIRES IN THE ENGINE COMPARTMENT WERE DEGRADED. THE VEHICLE ALSO DISPLAYED DIFFICULTY WHEN SHIFTING INTO FOURTH GEAR. WHILE DRIVING APPROXIMATELY 70 MPH, THE CONTACT COULD NOT SHIFT OUT OF THIRD GEAR AFTER ATTEMPTING TO ACCELERATE FROM 40 MPH. THE FAILURE OCCURRED INTERMITTENTLY AND THE CHECK ENGINE LIGHT BEGAN TO ILLUMINATE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN RECALLS 00V238000 (SUSPENSION: FRONT: CONTROL ARM: UPPER BALL JOINT), 02V096000 (ENGINE AND ENGINE COOLING: COOLING SYSTEM: FAN), AND 06V441000 (VEHICLE SPEED CONTROL). THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 78,600 AND THE CURRENT MILEAGE WAS APPROXIMATELY 79,100.",
        "vin": "YV1TS90DXX1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/10/2010",
        "dateOfIncident": "11/07/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365229,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80. WHILE DRIVING ON THREE DIFFERENT OCCASIONS THERE WAS SUDDEN UNINTENDED ACCELERATION. THE RPMS INCREASED FROM 700 TO 4000. THE VEHICLE WAS SHIFTED INTO NEUTRAL GEAR IN ORDER TO TURN THE ENGINE OFF. WITHIN A FEW SECONDS BEFORE RESTARTING THE VEHICLE THE RPMS INCREASED. THE VEHICLE WAS TURNED OFF THREE TIMES AND THEN BACK ON IN ORDER TO RESET ITSELF. THE DEALER WAS NOT CONTACTED NOR WAS THE MANUFACTURER NOTIFIED. THE FAILURE MILEAGE WAS 136,044.",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/04/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358708,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S 80. CONSUMER STATES PROBLEMS WITH THE TRANSMISSION AND ELECTRICAL PROBLEMS *TGW  THE CONSUMER STATED WHILE DRIVING, THE INTERIOR DASHBOARD AND OVERHEAD LIGHTS BEGAN TO DIM AND THEN RETURNED TO NORMAL LIGHT LEVELS ON A REPEATED BASIS.  THERE WERE A COUPLE OF INCIDENTS, WHERE THE VEHICLE WOULD LUNGE FORWARD WITHOUT APPLYING PRESSURE TO THE ACCELERATOR AND AT TIMES WOULD ALMOST COME TO A COMPLETE STALL.  THE CONSUMER STATED HE ALSO HAD PROBLEMS ACCELERATING AS HE ENTERED THE INTERSTATE ON ENTRANCE RAMPS DUE TO WHAT APPEARED TO BE STALLING OF THE ENGINE. THE VEHICLE COMPLETELY STALLED. THE VEHICLE WAS TAKEN TO A REPAIR SHOP AND IT WAS DETERMINED THE ETM HAD FAILED AND NEEDED TO BE REPLACED.  THE REPAIR SHOP INFORMED THE CONSUMER ABOUT A RECALL AND EXTENDED WARRANTY. HOWEVER, WHEN THE CONSUMER CONTACTED VOLVO, HE WAS TOLD HIS VEHICLE WAS UPDATED IN AUGUST 2008 AND THEY WOULDN'T ASSIST ANY FURTHER.  *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/23/2010",
        "dateOfIncident": "04/17/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339646,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "YOKOHAMA",
                "productYear": "9999",
                "size": "P215/60R15 93H AVID H4S",
                "type": "Tire"
            }
        ],
        "summary": "ON APRIL 13, 2010 I WAS TOLD BY THE SALESMAN THAT THE YOKOHAMA TIRE IS AS GOOD AS THE MICHELIN TIRES THAT I HAD ON MY CAR. (1 OF MY MICHELIN TIRES WAS SHOWING STEEL BELTS, APPARENTLY FROM SPINNING MY TIRES TRYING TO GET OUT OF THE SNOW ON MY GRAVEL DRIVEWAY THIS PAST MAR 2010.)  SINCE THE MICHELINS WERE NEARLY 4 YEARS OLD AND THE SALESMAN SAID THE SIDEWALLS WERE ROTTING, ON APR 13, 2010, I PURCHASED 4 YOKAHAMA TIRES.  ON APR 17, 2010, I VISITED FRIENDS IN REHOBOTH BEACH AREA OF DE AND WHILE PRKG AT THE GROCERY STORE I HIT A CURB/PRKG STOP WHILE PRKG.  THE SPEED OF TRAVEL AT THE TIME WAS AT A COAST SINCE I HAD MY FOOT ON THE BRAKE AT THE TIME. THE IMPACT WAS SO SLIGHT NEITHER I NOR MY PASS. WAS PROMPTED TO INSPECT THE TIRE.  AFTER A NORMAL WKND OF DRIVING THROUGH TOWN AND THEN RETURNING TO MY HOME IN LEXINGTON, VA., I NOTICED THE BUBBLE IN THE SIDEWALL OF THE RIGHT FRONT TIRE. THERE WAS NO IMPACT MARK ON THE TIRE THAT I COULD SEE THAT WOULD CAUSE ME TO THINK THAT I HAD HIT SOMETHING SHARP.  THE SALESMAN WHO SOLD ME THE TIRE POINTED TO A SPOT ON THE BUBBLE( I COULD NOT DISCERN THE MARK)  WITH A PEN POINT AND SAID THAT THERE IS A MARK ON THE TIRE AND IT SEEMS THAT THE BUBBLE WAS CAUSED BY HITTING SOMETHING SHARP.  NOW, I DO NOT CONTEND THAT I DID NOT HIT A PKNG/CURB STOP...I CONTEND IT WAS OF NO GREAT SPEED AT IMPACT.  I CONTEND THAT THIS TIRE MAY BE UNSAFE; ESPECIALLY IF IT HAD FAILED DURING MY  450-MILE DRIVE HOME FROM DE.  THE SALESMAN SAID, \"WELL, IF YOU HIT IT AT JUST THE RIGHT WAY, IT WILL DAMAGE THE TIRE.\"  ( I THINK MY OLD MICHELIN TIRES WOULD HAVE FAIRED BETTER AND I PROMPTLY REPLACED THE YOKOHAMA WITH MICHELINS. I FEEL SAFER BUT FEEL THIS NEEDS TO BE REPORTED. THERE WAS NO BLEMISH, YET THE SIDEWALL INSIDE THE TIRE WAS JAGGEDLY RIPPED APPROX. 1-INCH IN LENGTH.  CASE # YOKOHAMA  [XXX] CLAIM ADJUSTMENT NO. [XXX]    PURCHASED FROM TERRY'S TIRE TOWN, HENRICO, VA 23222 THROUGH LEXINGTON EXPRESS LUBE, LEXINGTON, VA.   INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335919,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80. CONSUMER STATES RECEIPT OF LETTER THAT STATES A COMBINATION OF THROTTLE POSITIONING SENSOR IRREGULARITIES A DIRTY THROTTLE HOUSING AND OR INEFFICIENT SOFTWARE CALIBRATION MAY CAUSE THE ONSET OF LIMP HOME MODES WITHOUT WARNING *TGW  THE CONSUMER STATED THE SOFTWARE UPDATE DID NOT SOLVE THE ISSUE NOR PREVENT UNSAFE SITUATIONS. THE DEALER EVEN CLEANED THE ELECTRONIC THROTTLE MODULE IN HOPES OF RESOLVING THE SUDDEN SURGES, ACCELERATION AND ENGINE REVVING THAT WAS OCCURRING, BUT TO NO AVAIL. ULTIMATELY, THE ELECTRONIC THROTTLE MODULE  HAD TO BE REPLACED, BECAUSE THE SOFTWARE UPDATE WAS NOT EFFECTIVE. *JB",
        "vin": "YV1TS97D7X1"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317792,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON. HAD THE CAR CHECKED BY A VOLVO SERVICE GARAGE. THE TECHNICIAN SAID THAT THE SRS (SUPPLEMENTAL RESTRAINT SYSTEM) MODULE NEEDS TO BE REPLACED.    I WAS INFORMED THE PYROTECHNICS IN THE SEAT BELT SYSTEM AND THE FRONT AIR BAGS DO NOT WORK UNTIL THE MODULE IS REPLACED AND PROGRAMMED. THE RE-PROGRAMMING  IS A 'DEALER ONLY' SERVICE.  THIS IS A PERMANENT SAFETY FAILURE WHICH HAS LIFE OR DEATH CONSEQUENCES IF I AM EVER INVOLVED IN AN ACCIDENT.  NOT CORRECTED AS OF 03/08/10. *TR",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/27/2010",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302622,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO S80 STALLS AT SPEED, COMPANY WON'T HONOR EXTENDED WARRANTY  *CN",
        "vin": "YV1TS90D3X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/23/2009",
        "dateOfIncident": "12/13/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296838,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNED A 1999 VOLVO S80. THE CONTACT STATED THAT THERE WAS A FUEL LEAKING INTO THE AIR VENTILATION SYSTEM. THE VEHICLE WAS TAKEN TO THE DEALER TO BE REPAIRED; HOWEVER, THERE ARE NO EXISTING RECALLS OR RELATED WARRANTIES. THE CONTACT IS RESPONSIBLE FOR THE REPAIR COSTS. THERE WAS ALSO A PROBLEM WITH THE THROTTLE BODY. THE FAILURE MILEAGE WAS 107,396.",
        "vin": "YV1TS90D2X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/08/2009",
        "dateOfIncident": "10/08/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286770,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED A USED 99 VOLVO, I AM A MOM OF 4 AND HAD HEARD VOLVO TO BE VERY SAFE RELIABLE CAR.  THE CAR RAN GREAT FOR ABOUT 2 DAYS, THEN THE LIGHTS STARTED COMING ON, ENGINE SYSTEM SERVICE REQUIRED, AND THE VEHICLE WOULD ALSO STALL FOR NO REASON.  I TOOK IT TO LOCAL VOLVO DEALER, THEY SAY THERE WAS A RECALL ON THE MESSAGE BOARD, BUT IF THE LIGHT CAME ON AGAIN IT WOULD NEED A NEW THROTTLE MODULE, COST OF 1100.  I LEFT AND CAME HOME AND DID SOME RESEARCH, I HAVE SINCE FOUND THAT THE ETM HAS BEEN RECALLED ON THAT YEAR VEHICLE AND THEY EXTENDED THE WARRANTY TO 200,000 MILES.  I AM VERY DISAPPOINTED IN THE DEALERSHIP THAT THEY WOULD NOT INFORM ME FIRST HAND AND TRY TO CHARGE ME. I HAVE SINCE CONTACTED VOLVO LLC AND AM AWAITING A RESPONSE.  I HAVE ALSO LEARNED THAT THE STALLING IS CONSIDERED \"LIMP HOME MODE\",  WHICH IS SUPPOSE TO BE A SAFETY FEATURE, HOWEVER I DID NOT FEEL SAFE WHEN THE VEHICLE DID IT TODAY DRIVING ON I285, IN THE CENTER LANE AT 65 MPH WITH MY 2 YEAR OLD IN THE CAR.  AFTER THAT EXPERIENCE I DO NOT THINK I WOULD EVER RECOMMEND A VOLVO TO ANYONE. *TR",
        "vin": "YV1TS97D3X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/01/2009",
        "dateOfIncident": "09/22/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285946,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY  1999 VOLVO S80 TO A VOLVO DEALERSHIP IN TEXAS AND THEY WANT ME TO PAY OUT OF POCKET TO REPLACE THE ETM ( ELECTRONIC THROTTLE MODULE) BECAUSE MY VEHICLE WENT INTO SERVICE IN MARCH 1999 SO THE 10YEARS/200,000 EXTENDED WARRANTY FOR THE ETM, VOLVO RECALL NO.155, HAS EXPIRED. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2009",
        "dateOfIncident": "01/29/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279894,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO S80 1999 -  I HAVE HAD 3 INSTANCES OF THE CAR LURCHING FORWARD FOR NO APPARENT REASON WHEN I AM COMING TO A STOP. IN ALL 3 CASES THE THROTTLE BODY ASSEMBLY REQUIRED REPLACEMENT. EACH TIME I THOUGHT THE PROBLEM WAS CORRECTED FOR GOOD. THE FIRST OCCURRENCE WAS IN 04, THEN 05, AND NOW AGAIN IN 09. I WAS LEAD TO BELIEVE THAT THE DESIGN HAD BEEN CHANGED AND THE PROBLEM CORRECTED. I HAVE BEEN FORTUNATE THAT WHEN THIS HAPPENED I DID NOT HIT ANYONE OR CRASH INTO ANYTHING. I FEEL THAT THIS IS A SERIOUS PROBLEM AND NO EFFORT HAS BEEN MADE BY VOLVO TO CORRECT THE PROBLEM. *TR",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2009",
        "dateOfIncident": "07/10/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276559,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WE LIVE IN A MOUNTAINOUS RURAL AREA AND I WAS GOING GROCERY SHOPPING IN THE AFTERNOON. MY CAR SEEMED TO BE RUNNING FINE. AFTER I BUCKLED MY TWO CHILDREN INTO THEIR CARSEATS AND LOADED MY CAR WITH MY BAGS OF GROCERIES, THE CAR DIDN'T HAVE THE POWER TO GET OUT OF THE PARKING LOT. IT WOULDN'T ACCELERATE. I PUT IT IN 1ST GEAR AND IT WAS NOT REVVING UP.     I MANAGED TO GET ON THE MAIN ROAD AND BEFORE AN UPHILL GRADE, I KNEW THAT THE CAR WAS UNSAFE TO GO AND IT WOULDN'T MAKE IT UP THE HILL. I STOPPED ON THE SIDE OF THE ROAD, BARELY ENOUGH ROOM FOR ME TO PULL OVER. I CALLED MY HUSBAND TO COME GET ME AND THE KIDS. HE WAS ON HIS WAY. CARS WERE SPEEDING PAST US AND I DIDN'T FEEL WE WERE IN A SAFE PLACE. I THOUGHT I SHOULD TRY TO MOVE THE CAR TO SOMEONE'S DRIVEWAY AND GET OFF THE MAIN ROAD.     AFTER SOME TIME PASSED, I STARTED THE CAR AGAIN, IT WAS REVVING. I TOOK A CHANCE TO MAKE IT UP THE HILL. I CALLED MY HUSBAND AND TOLD HIM OUR ROUTE. WE MADE IT HOME. I REMEMBERED THAT WE RECEIVED A RECALL NOTICE DATED MARCH 16, 2009. I PULLED IT OUT OF THE GLOVE COMPARTMENT AND CALLED TURNER VOLVO TO ARRANGE TO HAVE IT FIXED. THEY TOLD ME THAT THE TIMEFRAME HAD EXPIRED 5 MONTHS AGO, EVEN THOUGH WE ARE UNDER 200,000 MILES.    WHEN I RESEARCHED THIS RECALL, I REALIZED HOW FLIMSY IT IS. YES THE SOFTWARE FOR THIS CAR WAS INSTALLED 7/28/06 BY THE 1ST OWNER, BUT THE THROTTLE WASN'T FAILING SO THEY DIDN'T FIX IT IN 2006. VOLVO CARS OF N.A. SAID IT IS ONLY REPAIRED WHEN IT FAILS. SO HERE WE ARE IN 2009 AND THIS FAILED PART WASN'T FIX IN 2006? ME AND MY CHILDREN WERE STRANDED ON A HOT JULY DAY ON A RURAL ROAD. VOLVO KNOWS THIS IS AN EMERGENCY ISSUE, YET THEY HAVE NOT AND WILL NOT PROACTIVELY FIX IT.     IN THIS RECALL #155, IT SAYS THAT \"THIS CONDITION COULD CAUSE AN UNSAFE SITUATION AND POSSIBLY A CRASH.\" RECALL #155 NEEDS TO HAVE MORE TEETH IN IT. THEY HAVE TO FIX IT. MY SISTER BOUGHT OUR S70 FROM US AND I HAVE WARNED HER ABOUT THIS SITUATION SO THAT SHE DOESN'T WIND UP IN DANGER. *TR",
        "vin": "YV1TS90D8X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/29/2009",
        "dateOfIncident": "04/26/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275217,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND I FELT A LOSS OF POWER.  I PULLED OVER AND THE CAR SHUT DOWN.  I TRIED STARTING IT BUT IT BACKFIRED AND STALLED. IT TOOK ME A WHILE TO FIND OUT WHAT WAS GOING WRONG.  FINALLY I UNPLUGGED THE MAF (MASS AIR FLOW SENSOR) AND DROVE BACK HOME WITH AN EXTREMELY WEAK AND DANGEROUS CAR.  I DROVE IT LIKE THAT FOR A FEW DAYS.  I HAD NO CHOICE BECAUSE I HAD NO OTHER WAY TO GO TO SCHOOL.  I CHANGED THE MAF SENSOR BUT IT DIDN'T DO MUCH.  I WENT TO A LOCAL SHOP AND HAD THE THROTTLE BODY CLEANED.  I COULD NOW DRIVE WITH MY MAF PLUGGED IN BUT IT WOULDN'T DRIVE PROPERLY AND WOULD OCCASIONALLY STALL.    I LEARNED THAT VOLVO HAD ALOT OF ETM (ELECTRONIC THROTTLE MODULE/BODY) FAILURES ON THEIR S80'S.  SO THEY ISSUED A RECALL THAT THEY APPARENTLY HAVE A HARD TIME RESPECTING. I WENT TO A VOLVO DEALERSHIP (VOLVO LAVAL) ONE OF THE WORST DEALERSHIPS I'VE BEEN THROUGH, BY THE WAY.  THE SERVICE MANAGER DIDN'T WANT TO KNOW NOTHING ABOUT MY CAR AND SIMPLY TOLD ME MY WARRANTY WAS OVER (ALTHOUGH IT WAS SUPPOSED TO EXPIRE MAY 26TH, IT WAS ACTUALLY MAY 19TH THAT DAY, SO I HAD A WEEK LEFT).  HE DIDN'T WANT TO KNOW NOTHING ABOUT MY SITUATION AND CUT SHORT AND ASKED ME AND MY FRIEND TO LEAVE AFTER INSULTING US.      NOW MY CAR STALLS OCCASIONALLY AND HAS A ROUGH IDLE.  THE DEALERSHIP DIDN'T EVEN WANT TO DIAGNOSE THE CAR FOR FREE ALTHOUGH IT IS A DESIGN MISTAKE BY VOLVO.  I NOW HAVE THE CHOICE OF EITHER SPENDING 1600$+ ON A THROTTLE MODULE OR JUST DRIVE MY CAR AND DEAL WITH THE STALLING. *TR",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2009",
        "dateOfIncident": "04/15/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268790,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO 1999 S80 - CAR WENT FROM 60 MPH TO 20 MPH ON FREEWAY.  TOLD IT WAS THE ELECTRONIC THROTTLE BODY.  ALSO TOLD IT WAS A MONTH OUT OF THE EXTENDED WARRANTY. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2009",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268111,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80 HAS ISSUES WITH RECALL NOTICE ON THE ELECTRONIC THROTTLE SYSTEM SOFTWARE.  CONSUMER WANTS A REFUND FOR THE DEFECTS ON THE VEHICLE.  *NJ  PRIOR TO THE RECALL, THE CONSUMER  NOTICED SOME IRREGULARITIES REGARDING THE PERFORMANCE SUCH AS THE SERVICE ENGINE  LIGHT ILLUMINATED AND WHEN THE VEHICLE WAS ON AN UPHILL AND THE ACCELERATOR WAS APPLIED, THE VEHICLE WOULD NOT MOVE. *JB",
        "vin": "YV1TS97D7X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/05/2009",
        "dateOfIncident": "11/16/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267782,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80.  THE CONTACT STATED THAT THE VEHICLE WOULD IDLE HIGH AND THEN LOW.  THE VEHICLE WOULD SLOW DOWN AS WELL.  WHEN HE RELEASED THE ACCELERATOR PEDAL, THE VEHICLE WOULD LURCH INSTEAD OF GAIN SPEED.  THE FAILURE OCCURRED EVERY TIME THE VEHICLE WAS DRIVEN.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT THERE WAS NOT ENOUGH VACUUM IN THE SYSTEM, WHICH CAUSED A LOSS OF POWER ASSIST TO THE BRAKES.  IN REFERENCE TO NHTSA CAMPAIGN ID NUMBER 06V441000, BOTH THE DEALER AND MANUFACTURER STATED THAT THEY COULD NOT ASSIST BECAUSE THE VEHICLE WAS TEN YEARS OLD.  THE CURRENT MILEAGE WAS 100,348 AND FAILURE MILEAGE WAS APPROXIMATELY 95,000.",
        "vin": "YV1TS90D9X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/01/2009",
        "dateOfIncident": "03/24/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263901,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN AN 1999 VOLVO S80 (T6 TURBO)       SEVERAL MONTHS AGO THE CAR DEVELOPED A ROUGH IDLE AND ENGINE SURGE WHEN THE RPMS WERE BELOW ABOUT 1200.    I HAVE HAD THE CAR LOOKED AT BY A VOLVO DEALER AND INDEPENDENT MECHANICS.  NO ONE HAS FOUND THE PROBLEM.  THE ERROR CODES THAT ARE BEING GENERATED ARE INACCURATE.  REPLACING THE INDICATED PARTS DOES NOT SOLVE THE PROBLEM.    THE MOST DANGEROUS ASPECT OF THIS PROBLEM IS THAT WHEN IN REVERSE THERE IS A SIGNIFICANT ENGINE SURGE AT TIMES.  THIS CREATES A VERY UNSAFE SITUATION BECAUSE THE SURGE IS NOT PREDICTABLE.  SIGNIFICANTLY INCREASED PRESSURE ON THE BRAKE PEDAL IS REQUIRED TO KEEP THE CAR UNDER CONTROL WHILE IN REVERSE WHEN THIS SURGE OCCURS.    I STRONGLY URGE YOU TO INVESTIGATE THIS DEFECT IN THE VOLVO S80 AND TAKE ACTION TO REQUIRE A RECALL OF THESE VEHICLES. *TR",
        "vin": "YV1TS90D2X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2009",
        "dateOfIncident": "03/23/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263057,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80.  THE VEHICLE SHUT OFF IN THE MIDDLE OF THE ROAD WHILE TRAVELING AT AN UNKNOWN SPEED.  THERE WAS NO POWER AND THE VEHICLE FAILED TO MOVE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED.  THE CONTACT MUST WAIT FOR A COUPLE OF MINUTES AND THEN DEPRESS THE ACCELERATOR PEDAL BEFORE THE VEHICLE WOULD START.  THE DEALER STATED THAT THE FAILURE WAS DUE TO THE ELECTRONIC THROTTLE SYSTEM SOFTWARE.  THE VOLVO MANUFACTURER STATED THAT THEY WOULD NOT REPAIR THE VEHICLE BECAUSE IT WAS OUT OF WARRANTY.  THE FAILURE MILEAGE WAS 118,000.",
        "vin": "YV1TS97D3X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2009",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262512,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80.  IN 2008, THE DEALER DOWNLOADED THE THROTTLE SOFTWARE ON THE VEHICLE; HOWEVER, IT CONTINUED TO STALL AND LOSE POWER WHILE DRIVING 30 MPH.  THE MANUFACTURER STATED THAT NHTSA CAMPAIGN ID NUMBER 06V441000 (VEHICLE SPEED CONTROL) WAS CLOSED; THEREFORE, THEY WOULD NOT ASSIST.  THE CONTACT WILL HAVE THE VEHICLE REPAIRED.   THE FAILURE MILEAGE WAS 121,000 AND CURRENT MILEAGE WAS 122,000.  UPDATED 04/24/09.  *LJ  UPDATED 04/27/09.*JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/29/2009",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256907,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUNROOF WAS BUSTED OUT IN A CARWAS BY THE BLOWER DRYING IT OFF. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/29/2009",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256908,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF WAS BUSTED OUT BY DRYER IN A CARWASH. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/28/2009",
        "dateOfIncident": "12/07/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256555,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AXLE FAILED AFTER DOING A U TURN AT 5MPH. CONTROL ARM BUSHINGS KEEP BREAKING AND NEED TO BE EPOXIED OFTEN BY MECHANIC. COOLANT LEAK PROBLEMS AS WELL AS TRANSMISSION FLUID LEAKS. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/11/2008",
        "dateOfIncident": "12/04/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251514,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80.  WHILE DRIVING 40 MPH, THE VEHICLE BEGAN TO SLOW DOWN AND THE ABS AND ENGINE INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE TROLLIS SYSTEM NEEDED TO BE REPLACED.  THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED TWO WEEKS LATER.  THE VEHICLE WAS TAKEN TO THE DEALER AGAIN AND THEY STATED THAT THE CENTRAL MODULE NEEDED TO BE REPLACED.  THE VEHICLE WAS REPAIRED.  THE MANUFACTURER STATED THAT THE VEHICLE NEEDED TO BE TAKEN BACK TO THE DEALER FOR FURTHER INSPECTION.  THE FAILURE MILEAGE WAS 60,000 AND CURRENT MILEAGE WAS 97,000.    UPDATED 1/8/09 *CN  THE BALL JOINT NEEDED TO BE REPLACED, THE HEATING SYSTEM, THROTTLE SYSTEMS, ENGINE COOLING FAN AND THE MASTER CYLINDER ALL FAILED. THE VEHICLE WOULD ACCELERATED ON ITS OWN. THE VEHICLE STALLED ON SEVERAL OCCASIONS. THE STEERING MADE A NOISE WHEN IT WAS TURNED. THE DEALER LUBRICATED THE STEERING. THE DEALER STATED THE VEHICLE NEEDED AN O2 SENSOR. THE IGNITION SWITCH WAS REPLACED. THE INNER TIE RODS WERE REPLACED. 01/14/09. *JB",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/14/2008",
        "dateOfIncident": "05/31/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248779,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER BRINGING CAR HOME JUST AT RANDOM THE DRIVERS SEATBELT POPS OPEN. AT FIRST I THOUGHT OH I MUST NOT OF CLICKED IT . BUT IN YEAR IN HALF I'VE HAD CAR I'D SAY 5 TIMES ITS RELEASED IT SELF AND WITH NOT ONLY ME BUT MY PREGNANT SISTER AS WELL. *TR",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238674,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TWIN TURBO HAD TO BE REPLACED IN FEBRUARY 2008.  NOT CHEAP.  BUT EVER SINCE THEN, THERE HAS BEEN A LACK OF POWER AND VERY SLUGGISH ON TAKE OFF AND WHEN TRYING TO PASS ON THE HIGHWAY.  HAD THE CONTROL VALVE REPLACED JUST RECENTLY, HELPED SOME, BUT STILL VERY SLUGGISH.  THINK THE VOLVO DEALER HERE HAVE MORONS FOR SERVICE TECH'S. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/13/2008",
        "dateOfIncident": "11/15/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238000,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80.  THE VEHICLE FIRST BEGAN HESITATING AND STALLING INTERMITTENTLY WHILE DRIVING BETWEEN 50-60 MPH.  THE FAILURE IS NOW OCCURRING MORE FREQUENTLY.  THE VEHICLE HAS BEEN TO THE DEALER THREE OR FOUR TIMES FOR THIS FAILURE.  THE ACCELERATOR PEDAL WAS REPLACED TWICE AND THE THROTTLE HOUSING MODULE WAS CLEANED; HOWEVER, THE FAILURE CONTINUED.  THE LAST TIME THE VEHICLE WAS TAKEN TO THE DEALER, THEY COULD NOT DETERMINE THE CAUSE OF THE FAILURE OR PROVIDE FURTHER ASSISTANCE.  THE CONTACT REFERENCED DEFECT INVESTIGATION NUMBER PE05041 (VEHICLE SPEED CONTROL).  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 141,000 AND FAILURE MILEAGE WAS 137,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/16/2008",
        "dateOfIncident": "12/10/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231141,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VARIABLE SPEED POWER STEERING.  NO POWER STEERING AT -0- MILES PER HOUR.  NEEDED NEW STEERING PUMP AT 70,000 MILES.  *TR",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2008",
        "dateOfIncident": "06/05/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230174,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "INVESTIGATED GASOLINE ODOR IN/AROUND CAR.  RESULTING INSPECTION FOUND SIGNIFICANT GAS LEAK ON TOP SIDE OF FUEL TANK - PASSENGER SIDE.  FURTHER INSPECTION BY REPAIR SHOP REVEALED CRACKED FUEL PUMP FITTING THAT WHEN POWERED SPRAYED FUEL ON UNDERSIDE OF VEHICLE.  FUEL SPRAY / VAPORS WERE REACHING CLOSE TO IF NOT IN CONTACT WITH HOT EXHAUST COMPONENTS.  IN ADDITION TO DANGERS (TO VEHICLE OCCUPANTS) RELATED TO INHALATION OF GAS FUMES THIS FAILURE RESULTING IN A CRITICAL AND POTENTIALLY CATASTROPHIC RISK OR FIRE/EXPLOSION.  REPAIR INVOLVED REPLACEMENT OF FUEL PUMP ASSEMBLY, APPROXIMATELY $700.      BOTTOM LINE - THIS IS A COMPLETELY UNACCEPTABLE FAILURE AT ANY MILEAGE AND COULD HAVE RESULTED IN INJURY OR LOSS OF LIFE.  FURTHER, IT APPEARS THAT THIS IS NOT AN ISOLATED ISSUE (FROM READING OTHER COMPLAINTS FILED WITH NHTSA) AND ONE THAT MUST BE IMMEDIATELY ADDRESSED TO PREVENT FURTHER FAILURE(S) WITH SIGNIFICANT POTENTIAL FOR LOSS OF LIFE.      OLD PART IS AVAILABLE FOR INSPECTION UPON REQUEST.   *TR",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/02/2008",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223125,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80.  WHEN THE CONTACT ATTEMPTED TO LOWER THE PASSENGER SIDE WINDOW, IT SUDDENLY STOPPED FUNCTIONING.  SHE PUSHED THE BUTTON TO RAISE THE WINDOW AND THE GLASS FELL OFF TRACK, WHICH RESULTED IN THE WINDOW RESTING AT A SLIGHT RIGHT ANGLE.  THE CURRENT AND FAILURE MILEAGES WERE 118,000.",
        "vin": "YV1TS97D3X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/15/2008",
        "dateOfIncident": "03/06/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221277,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FIVE LANE RUSH HOUR FREEWAY DRIVING, 1999 VOLVO S80 T6 WENT INTO LIMP HOME MODE WITHOUT WARNING. WITH HIGH SPEED TRACTOR TRAILERS COMING UP THE REAR, THERE WAS ABSOLUTELY NO ACCELERATION RESPONSE FROM MY VEHICLE.  FORTUNATELY WAS ABLE TO QUICKLY PUSH THE HAZARD WARNING INDICATOR AND MOVE OVER TO THE SHOULDER.  THIS IS POTENTIALLY VERY DANGEROUS AND COULD HAVE CAUSED SERIOUS INJURY TO MYSELF OR OTHERS.  AFTER SPEAKING WITH SEVERAL SERVICE MANAGERS AT LOCAL DEALERSHIPS, I AM LESS THAN SATISFIED THAT THE SERIOUSNESS OF THIS DEFECT IS PROPERLY ACKNOWLEDGED. ACCORDING TO VOLVO NORTH AMERICA CUSTOMER SERVICE REP, THE SYMPTOMS SUGGEST A DEFECTIVE ETM (ELECTRONIC THROTTLE MODULE).  *TR",
        "vin": "YV1TS90D4X1"
    },
    {
        "components": "SUSPENSION,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/04/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219993,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NORMAL DRIVING CONDITIONS AT NIGHT, THE LOW BEAM (DIPPED BEAM) HEADLIGHTS FAILED WHILE OUT OF TOWN WITH MY WIFE AND TWO DAUGHTERS. I WAS ABLE TO DRIVE TO A SAFE LOCATION USING THE HIGH BEAMS. A CHECK OF HEADLAMP BULBS AND FUSES SHOWED THAT EVERYTHING WAS IN GOOD WORKING ORDER AND I WAS LEFT SCRATCHING MY HEAD. THE HEADLIGHTS ARE STILL NOT WORKING THREE WEEKS LATER, AND I FINALLY KNOW WHY. VOLVO OWNERS EXCHANGE INFORMATION ON VARIOUS WEBSITES AND ON MORE THAN ONE I FOUND PEOPLE SUGGESTING THAT THE CEM (MAIN COMPUTER) USED \"SHUNTS\" FOR VARIOUS COMPONENTS ON THE VEHICLE AND THEY WERE PRONED TO SHORTING OUT DUE TO RANDOM OVERHEATING ISSUES. I CHECKED THE AREA UNDER THE DRIVER'S SIDE DASH AND SURE ENOUGH, THERE IS A SHUNT INSERTED INTO THE CEM WITH HEAVY CHARRING AROUND THE TERMINALS. THE 1999 VOLVO S80 WAS THE FIRST YEAR OF MY PARTICULAR MODEL, AND THE FIRST YEAR THIS TYPE OF WIRING ARCHITECTURE WAS USED ON THEIR VEHICLES. THE SHORTING OF A CRUCIAL CIRCUIT SUCH AS HEADLAMPS NOT ONLY POSES A GRAVE DANGER WHEN DRIVING THE VEHICLE AT NIGHT, BUT COULD ALSO CAUSE A FIRE. I FEEL THE FAILURE IN THE DESIGN OF THE CEM AND THE VEHICLES WIRING ARCHITECTURE COULD ALSO BE RESPONSIBLE FOR THE RANDOM ELECTRICAL PROBLEMS OCCURRING WITH THE S80 AS WELL. THERE ARE SEVERAL WEBSITES THAT MENTION THE CONSTANT \"CHECK ENGINE\" LIGHT THAT COMES ON AND DEALERS ARE CLAIMING THEY REPAIR THE PROBLEM AFTER EACH VISIT, WHICH USUALLY END UP COSTING OVER $1,000.00. THERE'S ALSO SEVERAL EXAMPLES OF CUSTOMERS , INCLUDING MYSELF, WHO LOSE THE A/C COMPRESSOR RANDOMLY, AND THE ALTERNATOR INDICATING THAT IT ISN'T CHARGING CORRECTLY.     FINALLY, THERE IS ALSO SOMETHING INHERENTLY WRONG WITH THE DESIGN OF THE FRONT SUSPENSION OF THE S80. I'VE PAID FOR STRUTS AND BALL JOINT REPAIRS AND HAVE HAD THEM REPAIRED THROUGH A MANUFACTURER RECALL. AGAIN, THE DEALER CLAIMS TO HAVE REPAIRED THE PROBLEM AFTER EACH VISIT, YET THE PROBLEM HAS RECENTLY COME UP AGAIN IN MY VEHICLE. PLEASE CONTACT ME ANYTIME.  *TR",
        "vin": "YV1TS97D8X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218761,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARDONE INDUSTRIES, INC.",
                "productMake": "CARDONE",
                "productModel": "POWER BRAKE BOOSTER",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "BRAKE BOOSTER LEAKING VACUUM CAUSING THE CAR TO MIS FIRE AND RUN ERRATIC AND DIE IN MIDDLE OF TRAFFIC. THE BOOSTER QUITS WORKING WHICH MAKE IT A DEATH TRAP AND HARD TO STOP. LOSE OF POWER BRAKES.   *TR",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2007",
        "dateOfIncident": "03/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193587,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 1999 VOLVO S80.  WHILE DRIVING 55 MPH, THE CHECK ENGINE LIGHT ILLUMINATED WITH A MESSAGE STATING \"TRANSMISSION SERVICE URGENT\".  THE DEALER STATED THAT THE VALVE BODY WAS FAULTY AND THERE WAS MECHANICAL FAILURE WITH THE TRANSMISSION.  THE VEHICLE HAS NOT BEEN REPAIRED AND THE CHECK ENGINE LIGHT REMAINS ILLUMINATED.  THE CONTACT FELT THERE MAY BE A DEFECT WITH THE SOFTWARE.  THE CURRENT MILEAGE IS 100,255 AND FAILURE MILEAGE WAS 99,769.",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/05/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187942,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CUSTOMER WANT TO KNOW ABOUT SIMILAR DEFECTS ON THE VOLVO S 80**CC  THE CONSUMER STATED AFTER IT RAINED, WATER WOULD APPEAR IN THE LUGGAGE CARRIER. *JB",
        "vin": "YV1TS90C5X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/17/2007",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178947,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE REPLACED THE STRUTS AND STRUT MOUNTS TWICE; ORIGINAL OWNER REPLACED THEM ONCE....  SWAY BAR REPLACED LAST YEAR AND WHOLE FRONT END HAS BEEN RE-BUILT....  NOW I HAVE STEERING PROBLEMS.. REPLACED U-JOINT AND RACK....  *NM",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2007",
        "dateOfIncident": "01/03/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177705,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS SEVERAL RECURRING PROBLEMS THAT I HAVE NEVER SEEN ON ANY CAR BEFORE.  1)  ELECTRONIC THROTTLE HAS BEEN REPLACED 2 TIMES AS WELL AS OXYGEN SENSORS.  2)  SUSPENSION PARTS REPLACED 3 TIMES, BALL JOINTS, STRUTS, STRUT MOUNTS, FRAME BUSHINGS.  THE CAR STILL SQUEAKS.  *JB",
        "vin": "YV1TS90D0X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/15/2006",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177479,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 S80 STALLED/SURGED AT 20,000 MILES AT THE TIME.   *TS  THE CONSUMER STATED WHENEVER THE STALLING OCCURRED, THE CRUISE CONTROL WOULD GO OUT, AND AT HIGHWAY SPEEDS THE ENGINE WOULD START TO RUN IN AN UNEVEN/HESITATION MODE. THE PROBLEM WAS MUCH WORSE AT LOWER SPEEDS. THE DEALER INSTALLED TWO SOFTWARE UPDATES AT DIFFERENT TIMES WHICH DID NOT FIX THE PROBLEM.  FINALLY, THE PROBLEM WAS FIXED WHEN THE AIRFLOW SENSOR AND THE ABS CONTROL UNIT WAS REPLACED. *JB",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/12/2006",
        "dateOfIncident": "10/15/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175912,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 60MPH ON THE HIGHWAY, THE VEHICLE SKIDDED, AND PULLED TO THE RIGHT WITHOUT WARNING.  THE CONTACT MANEUVERED THE VEHICLE TO SIDE OF THE ROAD.  UPON INITIAL INSPECTION BY THE CONTACT, THE RIGHT FRONT TIRE WAS PARTIALLY SEPARATED AND TURNED PERPENDICULAR FROM THE VEHICLE.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP WHO DETERMINED THE TIE ROD ASSEMBLY, AS WELL AS THE ENTIRE FRONT SUSPENSION NEEDED TO BE REPLACED.  A NHTSA RECALL, #00V238000 WAS PERFORMED ON THE VEHICLE CONCERNING, THE FRONT SUSPENSION HOWEVER, THE RECALL DID NOT REMEDY THE PROBLEM.  THE MANUFACTURER WAS ALERTED.",
        "vin": "YV1TS97D8X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/27/2006",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174461,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS (15-75 MPH) ON NORMAL ROAD CONDITIONS WITH THE CRUISE CONTROL ENGAGED AND AFTER AN EXTENDED RIDE FROM 45 TO 90 MINUTES, ALL WARNING LIGHTS ILLUMINATED.  THE CRUISE CONTROL DISENGAGED BY IT SELF AND THE ENGINE HESITATED.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP TWICE, WHO PERFORMED A NHTSA RECALL #06V41000 WHICH ENTAILED UPGRADING THE CURRENT SOFTWARE.  HOWEVER, THE PROBLEM WAS NOT CORRECTED EITHER TIME, THE LURCH/STALL PROBLEM CONTINUED.  THE DEALERSHIP AND THE MANUFACTURER COINCIDED THE REPLACEMENT OF THE AIR FLOW CONTROL AND THE ABS CONTROL UNIT WAS NOT COVERED BY THE VEHICLE'S EXTENDED WARRANTY, EVENTHOUGH THOSE REPLACEMENT CORRECTED THE PROBLEM.  THE CONTACT WAS VERY CONCERNED BECAUSE THE RECALL DID NOT SOLVE THE DANGEROUS PROBLEM.    UPDATED 12/28/2006 - *NM",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2006",
        "dateOfIncident": "05/14/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171355,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST YEAR MY CHECK ENGINE AND URGENT LIGHT HAVE BEEN POPPING ON. I HAVE TO GO TO MY MACHANIC (WHO IS VOLVO CERTIFIED) TO HAVE THEM TURN OFF. BUT THE CHECK ENGINE LIGHT COMES ON MORE FREQUENT NOW. FOR THE PAST 6 MONTHS, WHEN I START THE CAR, IT HESITATES AND RUNS ROUGH, LIKE IT IS GOING TO STALL. THE FIRST TIME THIS HAPPENED MY MACHANIC SAID IT NEEDED A TUNE UP.  TODAY 10/19/06  I BROUGHT IT TO MY MACANIC AGAIN, AND THEY TOLD ME IT WAS THE THROTTLE MODULE AND THE 1999 S80 'S ARE HAVING ALL THE SAME PROBLEMS, AND THAT I NEED TO TAKE IT TO AN AUTHORIZED DEALER, BEFORE IT GETS WORSE.  *NM",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/22/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168924,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFORMATION PANEL GIVES THE FOLLOWING WARNINGS:    BRAKE FAILURE  STOP SAFELY ASAP  (T2 GOES TO ------)  STC  SERVICE REQUIRED'  WHEN THIS HAPPENS THE CRUISE CONTROL DOESN'T WORK.    WE HAVE CALLED THE DEALER TO FIND OUT WHAT TO DO. HE SAYS TO BRING THE CAR IN WHEN THE MESSAGE IS SHOWING.    THE MESSAGE COMES AND GOES AND ISN'T CONSISTENT ENOUGH TO BE ABLE TO TAKE IT TO THE DEALER WHEN IT IS ON.    WE WERE TOLD THAT THE BRAKES SHOULD WORK WITHOUT THE ABS FEATURE.    THE DEALER HAS MOVED TO 45 MILES FROM OUR HOUSE.    WE BELIEVE THAT THIS IS A FALSE WARNING.  *NM",
        "vin": "YV1TS97D6X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/31/2006",
        "dateOfIncident": "08/25/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167172,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 30 MPH, A BRAKE FAILURE WARNING, POWER STEERING WARNING, CHECK ENGINE WARNING LIGHT, ABS WARNING LIGHT, AND STABILITY TRACTION CONTROL  FAILURE WARNING MESSAGES ILLUMINATED INTERMITTENTLY.  THE VEHICLE WAS TAKEN TO A SERVICE DEALER WHERE IT WAS DETERMINED THAT THE ABS MODULE WAS WORN OUT AND SENDING A FALSE SIGNAL TO THE WARNING MESSAGE READOUT.  THERE WERE NO REPAIRS MADE.",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/19/2006",
        "dateOfIncident": "07/08/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162832,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER VOLVO PERFORMED THEIR RECALL ON MY SECOND FAILURE ELECTRONIC THROTTLE MODULE IN APRIL 2006 MY CARS STALLS WHILE DRIVING WITHOUT WARNING. AT THIS TIME VOLVO REPLACED THE FAILED ETM AND LOADED NEW CONTROLLER SOFTWARE INTO MY CAR. IN MAY 2006 I RETURNED MY CAR TO VOLVO AFTER 3 STALLING EVENTS IN ONE WEEK'S TIME, THEY TOLD ME THE CAR SET NO CODES THEREFORE THEY COULD NOT HELP ME UNTIL THEY CAR TOLD THEM WHAT WAS WRONG.   THE PROBLEM DID NOT REOCCUR AGAIN UNTIL JULY 8TH. AT THIS TIME I WAS DRIVING WITH MY FAMILY IN THE CAR AND IN A ROLLING BACKUP AT AT 30 MPH ON I-95 IN DELAWARE. THE FIRST TIME WAS ON A DOWNHILL SECTION AND I WAS ABLE TO RESTART THE CAR WITHOUT THE CAR SLOWING DOWN. THE SECOND STALLING FAILURE OCCURRED WITH NO WARNING OTHER THEN THE DASH INDICATOR LIGHTS COMING ON, ON AN UPHILL SECTION WITH AN SEMI FOLLOWING DIRECTLY BEHIND ME. IN THE CASE ALSO THE CAR IMMEDIATELY RESTARTED, HOWEVER IF THIS HAD NOT BEEN THE CASE MY CAR AND FAMILY WOULD HAVE BEEN REAR-ENDED BY THE SEMI.  IT IS MY UNDERSTANDING FROM RESEARCH ON THE INTERNET THAT THE PROGRAMMING CHANGES MADE BY VOLVO MAKE IT MORE DIFFICULT FOR THE ETM TO SET A ODI FAILURE CODE. IF THIS IS THE CASE, IT MAY BECOME IMPOSSIBLE TO DETERMINE AN ETM FAILURE EVEN WHEN THIS FAILURE RESULTS IN AN ACCIDENT.  THE CAR IS SCHEDULED TO BE LOOKED AT ON JULY, 21, 2006.  *NM",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2006",
        "dateOfIncident": "06/06/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159220,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST AFTER ENTERING THE HIGHWAY AND ATTAINING HIGHWAY SPEED MY 1999 VOVLO S80 LOST POWER AND HAD TO BE COASTED OFF THE RAMP. THE EMISSION SERVICE WARNING CAME ON AND THE VEHICLE WAS IDLING VERY ROUGH. THE CAR WAS TOWED IN TO A REPAIR SHOP AND THE COMPUTER CODES INDICATED THE THROTTLE MODULE HAD FAILED.  AFTER HEARING THAT THEIR WAS AN EXTENDED WARRANTY ISSUED I CHECKED THE WEBSITE AND LEARNED THAT THIS HAD HAPPENED TO OTHERS. FORTUNATELY THIS POWER FAILURE OCCURRED WHILE IN THE RT HAND ALOOWING THE VEHICLE TO SAFELY EXIT THE HWY WITHOUT INCIDENT. HAD THIS LOSS OF POWER OCCURRED IN IONE THE INTERIOR LANES THEN THIS INCIDENT WOULD'VE ENDED IN A COLLISION AND MOST LIKELY RESULTED IN INJURIES TO MY FAMILY.  THIS CONDITION WARRANTS AN IMMEDIATE RECALL.  *NM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/05/2006",
        "dateOfIncident": "05/30/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158975,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 1999 VOLVO S80 IN JUNE 2000. SINCE THAT TIME ON DOZENS OF OCCASIONS WARNING MESSAGES HAVE CONSTANTLY APPEARED ON THE DASH DISPLAY, I.E. FUEL FILLER CAP LOOSE, EMISSION SYSTEM SERVICE REQUIRED, AND ENGINE SYSTEM SERVICE URGENT. WE HAD THE VEHICLE CHECKED BY VOLVO OF ANNAPOLIS FOR THIS PROBLEM AND WERE INFORMED THAT THERE WAS NOTHING WRONG. SINCE THEN WE HAVE HAD THE S80 CHECKED BY A REPUTABLE AAA CERTIFIED AUTO SERVICE CENTER WHO INFORMED US THAT THE THROTTLE BODY WAS THE CAUSE OF THE PROBLEM AND THAT VOLVO HAD TO RECTIFY THE PROBLEM WHICH IS VERY COMMON. WHEN THE ERROR MESSAGE ENGINE SYSTEM SERVICE URGENT APPEARS THE CRUISE CONTROL DISCONNECTS AND WILL NOT RE-ENGAGE. THE VEHICLE SURGES AND IS A CONSTANT WORRY FOR MY SPOUSE WHO PRIMARILY OPERATES THE VEHICLE.  *NM",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2006",
        "dateOfIncident": "01/10/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158043,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEMS CAUSING DANGEROUS DRIVING CONDITIONS. THE TRANSMISSION SLIPS WHEN GOING BETWEEN 2ND AND 3RD. ALSO HAD ISSUES WITH THE ENGINE GOING TO 700 RPMS WHEN GOING 65 MPH. THIS IS JUST ONE OF THE MANY PROBLEMS. THE SOLENOID WENT OUT IN THE TRANSMISSION ABOUT 13000 MILES AGO. CURRENTLY I HAVE THREE DIFFERENT ERROR CODES \"TRANSMISSION SERVICE URGENT\", LOW OIL PRESSURE STOP ENGINE ASAP\", AND \"EMISSION SERVICE REQUIRED\". I HAVE READ MANY OTHER PEOPLE HAVE THE SAME PROBLEMS I HAVE HAD.   NM",
        "vin": "YV1TS97D4X1"
    },
    {
        "components": "EXTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/01/2006",
        "dateOfIncident": "03/28/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156565,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "TOW HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "FRONT SIGNAL HOUSING /LENS COVER KEEPS FALLING OFF. REPAIRED BUT PLASTIC BREAKS.   *JB",
        "vin": "YV1TS97D3X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/10/2006",
        "dateOfIncident": "09/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156225,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 S80 LOSS POWER WHILE DRIVING, SERVICE URGENT LIGHT ILLUMINATED.  *TS THE DEALER REPLACED THE ELECTRONIC THROTTLE MODULE.",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2006",
        "dateOfIncident": "03/28/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154351,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I95, I WAS IN THE MIDDLE LANE AND MY CAR STARTED LOSING POWER. I HAD TO GET ALL THE WAY TO THE BREAK DOWN LANE AND SHUT OFF MY CAR FOR A FEW MINUTES. I STARTED THE CAR UP AND IT SEEMED TO BE FINE BUT ABOUT 5 MINUTES LATER IT DID IT TO ME AGAIN AND COMPLETELY LOST POWER. I CALLED MY MOM AND TOLD HER ABOUT WHAT HAPPENED AND SHE TOLD ME THAT THE SAME THING HAPPENED TO HER WHEN SHE WAS ON HER WAY HOME FROM WORK THE DAY BEFORE AND WHEN SHE WENT ON THE HIGHWAY AS WELL. LUCKILY I WASN'T IN HEAVY TRAFFIC SO IT WAS EASY FOR ME TO GET INTO THE BREAKDOWN LANE IF NOT I WOULD HAVE BEEN STUCK IN THE MIDDLE LANE OR GOD FORBID GOTTEN INTO AN ACCIDENT. I CALLED THE VOLVO DEALERSHIP NEXT TO MY HOUSE AND MADE AN APPOINTMENT FOR TUESDAY MORNING I TOLD HIM MY PROBLEM AND HE TOLD ME THAT I HAVE TO BRING IN THE CAR FOR A DIAGNOSTIC CHECK. I'M PRETTY SURE MY CAR WILL BE COVERED UNDER THAT NEW EXTENDED WARRANTY OF 10 YEARS/200,000 MILES BUT I'LL HAVE TO WAIT AND SEE.  *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2006",
        "dateOfIncident": "03/13/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152819,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80 T6   3/08/06 REPLACED TRANSMISSION ( 75,000 MILES) ( $4,800)   08/05 REPLACE RADIATOR  08/05 REPLACED ETM   04 - REPLACED FRONT SUSPENSION / SWAY BARS / STRUTS/ ETC..  VOLVO UNDER ENGINEERED THE FRONT END OF THIS CAR AND IF YOU GO TO WEB BLOGS IT IS IN ALMOST EVERY 1999 - 2000 S-80 VEHICLE...  ITS DISGUSTING THAT THIS CAR IS ALLOWED TO CONTINUE OR FORD/ VOLVO ISN'T HELD LIABLE...*JB",
        "vin": "YV1TS90DXX1"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/24/2006",
        "dateOfIncident": "02/22/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151142,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER SEAT BELT IN MY 1999 VOLVO S80 STOPPED WORKING.  THE BELT FROZE IN THE RETRACTED POSITION MAKING IT IMPOSSIBLE TO USE.  THIS RESULTED IN THE FRONT PASSENGER SEAT BEING UNUSABLE.  MY OUT OF POCKET COST TO REPAIR THE PROBLEM WAS $433.45.  *JB",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/13/2006",
        "dateOfIncident": "02/12/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150186,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPORTING SEVERAL PROBLEMS TRACED TO EMT MALFUNCTION I HAD TO PAY OUT OF POCKET IN EXCESS OF $800.00 TO HAVE EMT REPLACED IN 11/2002. LESS THAN TWO YEARS AFTER THAT, I'VE EXPERIENCED THE SAME PROBLEMS LISTED ON PREVIOUS COMPLAINTS, TO THE POINT WHERE I CONSIDER THE VEHICLE UNSAFE. I HAVE EXPERIENCED NO LESS THAN 15-20 INCIDENTS IN THE PAST 6 MONTHS ALONE. THE LAST ONE BEING JUST YESTERDAY WHERE THE VEHICLE ALL OF A SUDDEN STALLED DOWN TO ABOUT 20 MPH ON THE HIGHWAY FOR NO APPARENT REASON AND THEN BACK TO NORMAL SPEED SEVERAL TIMES.  *NM",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2006",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148905,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUT DOWN ON NUMEROUS OCCASIONS WHILE DRIVING ON THE HIGHWAY. NO STEERING RESPONSE OR POWER BRAKES TO HELP TO STOP THE CAR. VERY DANGEROUS!  THE ELECTRONIC THROTTLE MODULE  (ETM) ON  1999 VOLVO S80 WAS REPLACED AT THE COST OF 843$.  *AK",
        "vin": "YV1TS90D9X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/22/2006",
        "dateOfIncident": "01/13/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148313,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALL WITHOUT WARNING. ALMOST CAUSE AN ACCIDENT. DEALER REFUSE TO ACKNOWLEDGE THE PROBLEM AND STATED THAT EVERY IS FINE. SEND ME BACK WITHOUT ANY WORK DONE.  *NM",
        "vin": "YV1TS90D4X1"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2006",
        "dateOfIncident": "01/13/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147731,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE ABS, TRACTION CONTROL, CHECK ENGINE, AND TOTAL BRAKE FAILURE LIGHTS ILLUMINATE AT DIFFERENT TIMES.  THERE IS A NOISE THAT SOUNDS AS IF THE ABS IS ACTIVATING.  THE VEHICLE HAS NOT BEEN SEEN BY THE DEALERSHIP OR AN INDEPENDENT REPAIR SHOP.  *NM",
        "vin": "YV1TS97D7X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2006",
        "dateOfIncident": "11/02/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146673,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DEFECT   MAKE:  VOLVO  YEAR: 1999  MODEL:  S80  NATURE OF PROBLEM:  CHECK ENGINE LIGHT IS ON AND VOLVO TECHNICIAN DIAGNOSES THE PROBLEM AS A DEFECTIVE ELECTRONIC THROTTLE CONTROL MODULE WHICH I FOUND LATER TO BE A COMMON PROBLEM WITH VOLVOS.  THE DEALERSHIP ESTIMATED THE REPAIR TO BE $850 PLUS THE COST OF THE DIAGNOSIS ($82.00).  I REFUSED TO AUTHORIZE THE REPAIR AND SOUGHT ALTERNATIVES.  PRESENTLY, THE CAR'S CHECK ENGINE LIGHT IS STILL ON AND THE CAR IDLES ROUGHLY AND SUFFERS FROM POOR GAS MILEAGE BUT CONTINUES TO START AND RUN. AS THIS IS AN APPARENT PROBLEM WITH VOLVOS AS I WAS TOLD BY OTHER MECHANICS, I FELT THAT THIS DEFECT SHOULD BE THE RESPONSIBILITY OF VOLVO RATHER THAN MYSELF. *JB",
        "vin": "YV1TS97D3X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2005",
        "dateOfIncident": "11/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145396,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED AT 45 TO 50 MPH. MADE SEVERAL ATTEMPTS  TO GET RESTARTED.  REPLACED ELECTRICAL THROTTLE MODULE  (ETM) AND IT FIXED THAT PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/25/2005",
        "dateOfIncident": "10/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143675,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ETM (ELECTRONIC THROTTLE MODULE) FAILURE WHILE DRIVING.  VEHICLE ABRUPTLY STALLED IN TRAFFIC, CAUSING A NEAR MISS REAR END COLLISION. ETM REPLACED.   *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/10/2005",
        "dateOfIncident": "11/07/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142412,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATES WHILE DRIVING ON THE INTERSTATE THE VEHICLE  ACCELERATED AND EXPERIENCED A LOSS OF POWER.  THE ENGINE DID NOT STALL, BUT OPERATED AT A REDUCED SPEED.  THE ENGINE SLOWLY RESUMED POWER AND THE CONTACT WAS ABLE TO PROCEED.  THE VEHICLE WAS TAKEN TO THE DEALER WHO DETERMINED THAT THE PROBLEM WAS WITH THE ELECTRONIC THROTTLE  CONTROL MODULE.  VOLVO OFFERED NO COST ASSISTANCE.  THE CONSUMER HAD THE ETM REPLACED.  *AK  UPDATED 12/27/2005.  *NM",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2005",
        "dateOfIncident": "09/12/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143175,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: WHEN THE SURGING HAPPENS THERE ARE NO NECESSARILY WARNING MESSAGES. THE FIRST TIME THE THROTTLE MODULE WAS REPLACED THERE WERE SOME MESSAGES ON THE DASH, BUT FOR ITEMS NOT RELATED TO THE THROTTLE MODULE. THE SECOND TIME THERE WERE NOT ANY MESSAGES UNTIL THE CAR DIED AND WOULD NOT START. THE THIRD TIME THE CAR STARTED TO SURGE , AND BROUGHT THE CAR TO DEALER  BEFORE IT GOT TOO BAD. BASICALLY, IT WOULD BE NECESSARY TO REPLACE  THROTTLE MODULE A FOURTH TIME.   THE CONTACT  ONLY HAD TO PAY FOR 1 REPLACEMENT, AND THEN IT WAS REPLACED 2 MORE TIMES BY THE DEALER AT NO COST. FROM THE TIME THE SURGING STARTED TO  THE CAR STALLED.  THE  CLEANING  OF THE THROTTLE MODULE WILL KEEP THE CAR RUNNING GOOD. IT SEEMED THAT THE CONTACT  HAS TO CLEAN IT EVERY 6 MONTHS.  IT STARTED TO SURGE. ABOUT 8000 - 10000 MILES. THE LAST TIME IT WAS REPLACED WAS 5/14/04 ,AND I THE CONTACT  CLEANED IT TWICE SINCE THEN. VOLVO TOLD THE CONTACT THAT THEY WOULD NOT WARRANTY IT ANY MORE BECAUSE THE CONTACT  DECLINED TO HAVE THEM DO $1000 WORTH OF WORK THAT DID NOT NEED TO BE DONE. THE CONTACT  ENDED UP DOING THE WORK HIMSELF,  AND THERE WAS NOTHING WRONG WITH THE PARTS THEY SAID WERE BAD. *AK",
        "vin": "YVATS90DXX1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "09/21/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142005,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:THE CONTACT STATED THIS VEHICLE WAS EXPERIENCING THE SAME PROBLEMS MENTIONED IN  NHTSA INVESTIGATION PE05-041. THIS HAS HAPPENED MANY TIMES.  THE LAST TIME THIS HAPPENED THE VEHICLE WAS TRAVELING ABOUT 40 MPH ,AND IT LOST POWER/STALLED. THE VEHICLE WAS PULLED OVER WITHOUT INCIDENT.  THE VEHICLE WAS RESTARTED IMMEDIATELY, AND  WOULD NOT GO FASTER THAN 20 MPH.  THE VEHICLE WAS TAKEN TO A SERVICE STATION.  THEY WERE UNABLE TO ASSIST THE CONTACT.  THE VEHICLE WAS TAKEN THE DEALER. THE PROBLEM WAS DIAGNOSED AS THE ETM BY THEIR COMPUTER ERROR NOTICE.  HE WAS NOT THE ORIGINAL OWNER.  THE PROBLEM HAS NOT BEEN FIXED.  THE MANUFACTURER HAS BEEN CONTACT,  AND THEY OFFERED NO ASSISTANCE.   *AK",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/02/2005",
        "dateOfIncident": "09/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141529,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE MISS FIRING AND EMISSION LIGHT ON. LATER ENGINE RUNNING GOOD BUT CRUISE CONTROL WOULD NOT WORK AND TEXT MESSAGE 'ENGINE SYSTEM FIX NEXT SERVICE' WITH ORANGE WARNING LIGHT ON.  TOOK TO VOLVO DEALER AND THEY REPLACED THE ETM FOR NO CHARGE. THEY KEPT THE OLD PART BECAUSE THEY HAD REPLACED THE ORIGINAL ONE.  *NM",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/28/2005",
        "dateOfIncident": "10/28/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141147,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE THROTTLE SURGES AT IDLE AND WHILE DRIVING.  SOMETIMES NO POWER AND SOMETIMES IT JUST TAKES OFF.  DEALER SAYS ITS THE ELECTRONIC THROTTLE BODY.  STATED THEY HAVE REPLACED A NUMBER OF THESE.  *NM",
        "vin": "YV1TS97D4X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2005",
        "dateOfIncident": "10/16/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140083,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS ON NUMEROUS OCCASION LOST COMPLETE POWER AND WILL BASICALLY JUST IDLE. THIS HAS HAPPENED BOTH WILL STARTING FROM A DEAD STOP AS WELL AS AT HIGHWAY SPEEDS. THIS ON SEVERAL OCCASIONS HAS ALMOST RESULTED IN ACCIDENTS DUE TO HIGH TRAFFIC VOLUME AT THE TIME OF FAILURE. CAR IS CURRENTLY AT SHOP FOR REPAIR WITH ESTIMATE OVER $1000.  *JB",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2005",
        "dateOfIncident": "10/14/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139681,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL ODOR IN VEHICLE, AND FUEL LEAKING UNDER VEHICLE. FUEL PUMP ASSEMBLY HAS STRESS CRACKED AT FUEL PRESSURE LINE. FUEL PUMP ASSEMBLY REQUIRED TO REPAIR LEAK. REPLACED FUEL PUMP. *JB",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "10/07/2005",
        "dateOfIncident": "07/12/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138995,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TAKEN MY S80 TO THE VOLVO DEALERSHIP A NUMBER OF TIMES COMPLAINING OF ENGINE HESITATION AND STALLING.  VOLVO\"S DIAGNOSTIC COMPUTER SYSTEM \"VADIS\" OUTPUT CODES CLEARLY SHOWED DEFAULT CODES INDICATING A FAULTY MODULE. THE SERVICE MANAGER AT THIS STEADFASTLY REFUSED TO REPLACE THE MODULE \"DUE TO COST\".  I WARNED HIM OF THE POTENTIAL CONSEQUENCES OF TRYING TO OPERATE THIS VEHICLE WITH UNRELIABLE ENGINE FIRING AND THE ASSOCIATED \"STALLING\" THAT OCCURS WITHOUT WARNING.  I EXPRESSED MY CONCERNS TO HIM ABOUT THE DANGER THAT THIS PROBLEM PRESENTED FOR ME AND OTHER VEHICLES WHICH I HAD EXPERIENCED DURING PREVIOUS \"STALLINGS\".  UNFORTUNATELY, AFTER TREMENDOUS RESEARCH AND A NUMBER OF PHONE CALLS BEFORE I COULD BRING THIS INFO TO BEAR TO FORCE THE DEALERSHIP TO HONOR THEIR WARRANTY I EXPERIENCED A \"STALLING\" EVENT WHILE DRIVING ON THE EXPRESSWAY WHICH LEAD TO A SINGLE CAR ACCIDENT,RESULTING IN A TOTAL LOSS OF MY CAR.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "02/14/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132993,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:THE CONTACT OWNS A VOLVO S80 VEHICLE. IT INTERMITTENTLY STALLED/ DIED, AND LOST POWER. THE ELECTRONIC THROTTLE MODULE FAILED AND WAS CLEANED THREE TIMES.  *AK   THE LINE SEAL AND GASKET WERE REPLACED DUE TO AN OIL LEAK.  THE TOP ENGINE TORQUE ARM WAS CRACKED.  *JB",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "09/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137671,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SURGES IN RPM WHILE DRIVING,VEHICLE STARTED BY NO ACCELERATION WARNING LIGHT ON ENGINE MALFUNCTION.  SHUT OFF WHILE DRIVING.  *NM",
        "vin": "YV1TS97D3X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2005",
        "dateOfIncident": "09/08/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137523,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1,2) VOLVO S80 STALLED WHILE MY WIFE WAS DRIVING 60 MPH IN RUSH HOUR INTERSTATE HIGHWAY TRAFFIC. CAR LOST POWER, WOULD NOT ACCELERATE, POWER STEERING LOST; SHE GOT THE CAR TO THE SIDE OF THE ROAD JUST IN TIME BEFORE A ONE-LANE CONSTRUCTION BARRIER; OTHERWISE, TRAFFIC WOULD HAVE BEEN BACKED UP FOR MILES FOR A LONG TIME (THERE WAS NO TURN AROUND AVAILABLE FOR TOW-TRUCK IN THIS PART OF THE INTERSTATE, THE TOW-TRUCK WOULD HAVE HAD TO BACK UP THE HIGHWAY OR TRY TO MAKE IT UP THE GRASSY DIVIDER EMBANKMENT TO GET TO HER STALLED CAR.  LUCK WAS ON HER SIDE; NO INJURIES, AND NO BLOCKED TRAFFIC-THIS TIME.  3) CAR TOWED TO VOLVO DEALER, WHERE IT RESTARTED. THE DEALER SERVICE DEPARTMENT COULD NOT FIND THE SOURCE OF THE PROBLEM, RESET SENSORS AND REPLACED A VACUUM HOSE.  I AM CONCERNED THAT THIS CAR HAS A DEFECTIVE ETM VALVE AND THAT THE CAR IS STILL A DANGER TO DRIVE.*JB",
        "vin": "YV1TS90DXX1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2005",
        "dateOfIncident": "09/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137272,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) ON MORE THAN ONE OCCASION THE VOLVO S80 HAS HAD SHUTTERING OF THE ENGINE AT IDLE. (2) ON MORE THAN ONE OCCASION THE VOLVO S80 HAS PLACED THE OCCUPANTS AT RISK OF BODILY INJURY DUE TO THE LOSS OF POWER AND SUDDEN ACCELERATION IN HIGH TRAFFIC SITUATIONS. (3) THE VOLVO S80 HAS BEEN TO THE DEALER ON TWO OCCASIONS - THE FIRST OCCASION, I BELIEVE THE THROTTLE BODY COMPONENTS WERE CLEANED AND THE WARNING LIGHT RESET - THE SECOND AND LATEST VISIT, ON SEPT 21, I WAS INFORMED THAT THE THROTTLE BODY NEEDED TO BE REPLACED AT AN APPROXIMATE COST OF $850 AND THAT MY ABS BRAKE MODULE ALSO NEEDED TO BE REPLACED AT AN APPROXIMATE COST OF $830.*JB",
        "vin": "YV1TS97D2X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2005",
        "dateOfIncident": "08/04/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136599,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "EMT FAILURE IN 1999 S80T6 VOLVO.  THE VEHICLE LOST POWER, THIS WAS THE SECOND TIME IN 2 WEEKS.  THE FIRST TIME THE DEALER REPLACED THE ALTERNATOR >$900.  THE NEXT TIME W/IN 2 WEEKS IT LOST POWER AND THEY REPLACED THE EMT >$1000.  ONLY 41K MILES ON THE VEHICLE.  *NM",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2005",
        "dateOfIncident": "09/02/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136510,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 1999 VOLVO S80 ON AUGUST 30, 2005. WITHIN 2 WEEKS OF OWNERSHIP, THE CAR WOULD RACE AT A STOP SIGN, WHILE I APPLIED THE BRAKES.  THE NEXT DAY, IT RAN ROUGH IN MY DRIVE WAY WHILE IT IDLED.  I TOOK IT DIRECTLY TO THE VOLVO DEALER IN MEMPHIS.  THEY TOLD ME I NEEDED A ETM AND AIR FLOW METER.  THESE WERE REPLACED AT A COST TO ME OF $848.21 PARTS AND LABOR.   *NM",
        "vin": "YV1TS97D2X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/11/2005",
        "dateOfIncident": "09/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136123,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 10, 2005 AT APPROXIMATELY 2:30 PM, MY ENGINE ABRUPTLY STALLED WHILE TRAVELING AT HIGHWAY SPEEDS WITH CRUISE CONTROL ENGAGED.  I PULLED THE CAR OFF TO THE SIDE OF THE ROAD.  IT WOULD NOT RESTART.   UPON EACH ATTEMPT TO RESTART, THE ENGINE WOULD ACTUALLY RUN ROUGHLY FOR 1-2 SECONDS AND THEN STALL.  I HAD THE CAR TOWED ABOUT 35 MILES TO MY VOLVO DEALER.  WHEN IT ARRIVED, IT STARTED.  THIS IS THE SECOND TIME THIS HAS HAPPENED.  THE LAST TIME, THE DEALER FOUND NO PROBLEM.  I AM AWARE THAT VOLVO SUSPECTS THE THROTTLE BODY IN THESE MATTERS.  MINE HAS ALREADY BEEN REPLACED!  *NM",
        "vin": "YV1TS97D2X1"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/10/2005",
        "dateOfIncident": "09/02/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136070,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "TOW HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "FAULTY ELECTRONIC THROTTLE MODULE (ETM) ON 1999 VOLVO S80 T6 ON A REPLACEMENT PART.  CAR HAS STALLED NUMEROUS TIMES ON OPEN HIGHWAY RESULT IN A SEVERE SAFETY SITUATION.  THE MILEAGE ON THE CAR IS ONLY 43,000 DESPITE BEING A 6 YEAR OLD VEHICLE.  THE ORIGINAL ETM WAS DETERMINED FAULTY AND A REPLACEMENT UNIT WAS PUT IN ON SEPTEMBER 19, 2002.  INDEPENDENT VOLVO REPAIR DEALER HAS DETERMINED THAT THE REPLACEMENT UNIT HAS FAILED AGAIN DESPITE ONLY HAVING 17,000 MILES PUT ON THE CAR SINCE BEING REPLACED IN 2002. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/08/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135870,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: WHILE DRIVING AT 20-25 MPH THE VEHICLE ACCELERATED AND SURGED ON ITS OWN. THE CONSUMER WAS THE VEHICLE'S SECOND OWNER.  THE FIRST OWNER EXPERIENCED A SIMILAR PROBLEM. THE PROBLEMS WAS  FIRST NOTICED ON 05/01/2005.  *AK *MR",
        "vin": "YV1TS97D6X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/05/2005",
        "dateOfIncident": "07/06/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135330,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOSES ALL POWER AT HIGHWAY SPEEDS.  FEELS LIKE IT STALLS OUT OR SUDDENLY RUNS OUT OF GAS. *JB",
        "vin": "YV1TS97D6X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/01/2005",
        "dateOfIncident": "08/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135135,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80; THROTTLE UNEXPECTEDLY STOPPED OPERATING AND VEHICLE WENT INTO A \"LIMP HOME MODE\".  VEHICLE WAS TOWED TO A DEALER.  DIAGNOSTIC TESTS REVEALED A FAULTY THROTTLE CONTROL MODULE (TCM).  THE TCM WAS REPLACED AND NEW SOFTWARE DOWNLOADED.  OLD PARTS WERE NOT PROVIDED BY THE DEALER.  *NM",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/31/2005",
        "dateOfIncident": "03/15/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134981,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1999 VOLVO S80 SIMPLY DECIDED TO STALL WHILE I WAS MERGING INTO TRAFFIC.  I WAS ABLE TO AVOID AN ACCIDENT.  A MESSAGE CAME ON THE DASH THAT STATED THAT I NEEDED AN URGENT SERVICE VISIT FOR MY EMISSION SYSTEM.  THE VOLVO DEALERSHIP CHARGED ME $1,000 TO REPLACE THE ELECTRONIC THROTTLE.      A SECOND DEFECT OF THIS CAR IS A LEAKING FUEL SENDER ASSEMBLY WHICH WAS A FIRE HAZARD.  ABOUT $700 TO REPAIR.      I EMAILED AND CALLED VOLVO REGARDING BOTH OF THESE ITEMS.  THEY HAVE NEVER RESPONDED.  *NM",
        "vin": "YV1TS97D7X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134713,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST GOT GAS AND STARTED CAR AND THE TACHOMETER STARTED TO REV UP AND DOWN.  I NEEDED TO LEAVE AS I WAS IN A GAS STATION AND IT WAS VERY CROWDED.  I HAD TO IMMEDIATELY PULL INTO A PARKING SPOT.  AFTER WAITING A FEW MINUTES, I LEFT THE SPOT AND ATTEMPTED TO DRIVE DOWN THE STREET.  THE CAR WOULDN'T SHIFT INTO ANY GEAR EXCEPT FIRST AND I WAS ALMOST RUN OFF THE ROAD BY SEVERAL VERY ANGRY DRIVERS SINCE I COULDN'T GO ANY FASTER.  I PULLED OVER AGAIN AND WAITED 15 MINUTES.  IN ARIZONA WHEN IT'S 115 OUT, THAT IS NOT TOO MUCH FUN.  AFTER WAITING, THE CAR MUST HAVE RESET ITSELF AND IT STARTED UP FINE.  THIS WAS THE FOURTH TIME THIS WEEK THAT THIS HAS HAPPENED TO ME BUT THIS WAS BY FAR THE WORST.   *NM",
        "vin": "YV1LS55A5X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/30/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134829,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE OCCASIONS MY VEHICLE ENGINE HAS LOST SPEED AND ENGINE HAS STALLED WITHOUT WARNING.  CAR HAS BEEN REPAIRED BY LOCAL CAR DEALERSHIP ONCE AND IS ONCE AGAIN IN THE SHOP FOR POSSIBLY THE SAME PROBLEM.  WHILE DRIVING AT 60 MPH ON THE FREEWAY WITH MY 3 CHILDREN IN CABIN THERE WAS A VERY STRONG ODOR OF GAS FOLLOWED MY A SUDDEN ENGINE SHUTDOWN TODAY.  I AM VERY GRATEFUL AND BLESSED I WASN'T HIT FROM THE BACK THIS WOULD HAVE BEEN VERY, VERY DISASTROUS TO MY FAMILY.*JB",
        "vin": "YV1TS90D8X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "07/12/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134845,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MONTHS PRIOR TO  ELECTRONIC THROTTLE MODULE  NEEDING REPLACEMENT , AT MY COST, 1999 VOLVO S80T (@85K MILES) ENGINE IDLE SURGING AND ENGINE WARNING LIGHTS RANDOMLY OCCURRED, REQUIRING RESTARTING CAR WHEN IT STALLED IN HEAVY TRAFFIC. NEW THROTTLE(GAS PEDAL) WAS REPLACED BUT DID NOT RESOLVE PROBLEM. LASTLY, WHILE DRIVING ON AN INTERSTATE HIGHWAY, CAR WOULD NOT ACCELERATED BEYOND 20 MPH(LIMP HOME MODE) AND VOLVO DEALER REPLACED ETM TO RESOLVE PROBLEM.  ABOUT A YEAR BEFORE, THE ABS MODULE WAS REPLACED(UNDER EXTENDED WARRANTY) BECAUSE A MULTITUDE OF WARNING LIGHTS WERE OCCURRING (ABS, BRAKES, POWER STEERING). WHILE I'M LISTING FAILURES, THE ENGINE COOLING FAN NEEDED TO BE REPLACED(UNDER EXTENDED WARRANTY).  *JB",
        "vin": "YV1TS90D2X1"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2005",
        "dateOfIncident": "07/31/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131007,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT : WHEN ATTEMPTING TO ACCELERATE  THE TACHOMETER WILL JUMP UP AND DROP DOWN, IT LOOSES POWER WHEN TRYING TO INCREASE SPEED. THIS STARTED  ON JULY 31, 2005. TOOK VEHICLE  TO A VOLVO MECHANIC ,AND COULD NOT   PINPOINT  THE PROBLEM.  HOWEVER, THOUGHT  IT HAD SOMETHING TO DO WITH THE AIR INTAKES. *AK  THE ELECTRONIC THROTTLE MODULE WAS REPLACED.  THE CONSUMER ALSO HAS TROUBLE ACCELERATING ONTO THE HIGHWAY. *JB",
        "vin": "YV1TS90D2X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/26/2005",
        "dateOfIncident": "08/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134327,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A MAJOR HIGHWAY, DURING RUSH HOUR TRAFFIC, THE CAR LOST ALL POWER.  FORTUNATELY, I WAS IN THE FAR RIGHT LANE AND WAS ABLE TO DRIFT SAFELY ONTO THE SHOULDER.  THE INDICATOR LIGHT READ FAILURE.  THE CAR WOULD NOT START, SO I HAD IT TOWED TO MY HOME.  THE CAR SUBSEQUENTLY STARTED, BUT HAD DEVELOPED THE SAME ACCELERATION PROBLEMS WITHIN A FEW MINUTES OF DRIVING.  MY SON-IN-LAW, A MECHANIC, BELIEVES THE PROBLEM IS WITH THE ELECTRONIC THROTTLE MODULE AND UNDERSTANDS THIS IS A COMMON PROBLEM WITH THIS MAKE OF VEHICLES (VOLVO). I HAVE NOT AS YET HAD THE MODULE REPLACED.  *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/25/2005",
        "dateOfIncident": "12/24/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134206,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE DIED WHILE DRIVING DOWN THE STREET.  AFTER COASTING TO A STOP, I WAS ABLE TO RESTART THE ENGINE.  RECENTLY WHEN IDLING, THE ENGINE RPM'S HAVE SURGED FROM ABOUT 700 TO APPROXIMATELY 1400 WITHOUT TOUCHING THE ACCELERATOR PEDAL.  CURRENTLY WHEN THE TRANSMISSION IS IN PARK OR NEUTRAL THE ENGINE SURGES FROM ABOUT 700 TO APPROXIMATELY 1000.  WHEN I CONTACTED A LOCAL VOLVO DEALER SERVICE PERSON, THEY ACKNOWLEDGED THIS HAS BEEN A FREQUENT PROBLEM.",
        "vin": "YV1TS90D9X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2005",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134105,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS MODULE HAS FAILED IN MY CAR AND ACCORDING TO MY MECHANIC AND ALL OVER THE INTERNET THE MODULES CONTINUALLY BREAK AND COST AROUND 700 DOLLARS TO REPAIR EACH TIME. WHEN THIS MODULE DOES NOT WORK IS CAUSES PROBLEMS WITH STEERING POWER, TRANSMISSION SHIFTING (WILL NOT DOWN SHIFT AND CAUSES CAR TO STALL), BRAKE FAILURE WARNINGS, AND NO ABS. THE PROBLEM IS INTERMITTENT WHILE DRIVING, BUT THERE IS ALWAYS ONE SYSTEM NOT WORKING OR MORE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "07/08/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133792,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATES:  ON 7-8-05 WHILE DRIVING  AT 25 MPH  THE CONSUMER  HEARD A SPUTTERING, AND ALL OF A SUDDEN THERE WAS A BURST OF BLACK SMOKE COMING FROM THE FUEL PIPE.  HAD VEHICLE  TOWED TO THE DEALER., WHO COULD NOT DUPLICATE THE PROBLEM.  *AK",
        "vin": "YV1TS90D4X1"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2005",
        "dateOfIncident": "08/13/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133647,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF ETM IN 1999 VOLVO S80T6 CAUSE NEAR COLLISION  WHEN THE CAR STOPED RUNNING WITHOUT WARNING AT 45 MPH.CAR HAD TO BE TOWED TO VOLVO DEALER WHERE REPAIRS WERE MADE AT A COST OF $1439.16",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/21/2005",
        "dateOfIncident": "11/25/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133658,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "TOW HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "WHILE DRIVING, I SUDDENLY LOST POWER/ACCELERATION IN MY VEHICLE.  MY CHECK ENGINE LIGHT ALSO CAME ON.  I TURNED THE CAR OFF, BUT COULD NOT RESTART IT.  MY VEHICLE WAS TOWED TO MY LOCAL VOLVO DEALERSHIP.  DIAGNOSIS - REPLACE THROTTLE BODY AND DOWNLOAD SOFTWARE (ETM).  BECAUSE MY VEHICLE WAS PAST THE ORIGINAL MANUFACTURER'S WARRANTY, I HAD TO PAY FOR THE REPARIS SINCE THE EXTENDED WARRANTY DID NOT SPECIFICALLY LIST THESE DEFECTS . . . $815 PARTS AND LABOR.  APPROXIMATELY 1 YEAR 3 MONTHS LATER, I BEGAN EXPERIENCING THE SAME PROBLEMS AS IN 2002 WHICH VOLVO DIAGNOSED AS A THROTTLE BODY FAILURE; HOWEVER I HAVE HAVE BEEN ABLE TO START MY CAR, BUT WITH SOME TROUBLE.  NON-WARRANTY REPAIRS ARE COVERED FOR ONLY 1 YEAR.  I CALLED THE WARRANTY COMPANY TO SEE IF THEY COULD HELP ME OUT.  THE WARRANTY COMPANY KNEW OF THE DEFECT FROM PREVIOUS OTHER COMPLAINTS, AND THEY TOLD ME TO TRY TO WORK OUT A DEAL WITH VOLVO (WHICH DIDN'T HAPPEN).    ON SEPTEMBER 11, 2002, I TOOK MY VEHICLE INTO VOLVO BECAUSE MY ENGINE FLUCTUATED WHILE IDLING.  THE INTERIOR LIGHTS FLICKERED AS THE IDLE SURGED.  VOLVO DIAGNOSED THE PROBLEM AS AN IGNITION COIL FAILURE.  PARTS AND LABOR COST ME $250.  I TOOK THE CAR IN AGAIN ON SEPTEMBER 16, 2002 (5 DAYS LATER) WITH THE SAME PROBLEM.  I REQUESTED A FUEL FILTER CHECK/REPLACEMENT, BUT VOLVO DIAGNOSED THE PROBLEM WITH THE THROTTLE BODY.  THE CHECKED AND CLEANED THE THROTTLE BODY.  THIS HAPPENED, OF COURSE, JUST 2 MONTHS BEFORE COMPLETE FAILURE OF THE THROTTLE BODY.    I'VE SPENT OVER $1000 FOR MIS-DIAGNOSIS AND AN DEFECTIVE PART THAT VOLVO AND THEIR WARRANTY COMPANY HAVE KNOWN ABOUT FOR SEVERAL YEARS.",
        "vin": "YV1TS90D3X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2005",
        "dateOfIncident": "08/28/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133631,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1999 VOVLO S80 ENGINE BEGAN SURGING WHEN COMING TO A STOP.  THE IDLE WOULD BOUNCE UP AND DOWN BY ITSELF FROM 500 - 1500RPM.  THE CAR FINALY SET DHECK ENGINE CODES THAT INDICATED THAT THE MASS AIR FLOW SENSOR HAD FAILED. REPLACING MAF CORRECTED THE ISSUE, HOWEVER THE CAR HAS BEEN SHOWING SIGNS OF THE SAME FAILURE AGAIN.    FIRST MAF UNIT WAS REPLACED ON AUGUST 28, 2003 WITH 63,935 MILES, NOW AT 104,380 THE SAME ISSUES HAVE BEGUN TO RE-APPEAR.  IT APPEARS TO ME THAT THE CURRENT DESIGN OF THE 1999 S80 MAF HAS A DESIGN FLAW THAT LIMITS ITS USEFUL LIFE.  I HAVE NEVER HAD TO REPLACE A MAF SENSOR BEFORE NOW I AM LOOKING AT A RE-OCCURANCE ON THE SAME VEHICLE.",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "07/03/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133047,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR TO THE FAILURE, THE IDLE OF THE CAR WOULD SURGE UP AND DOWN AT AN IDLE BETWEEN 500-1500 RPM'S. TRYING TO PARK THE CAR THE CAR WOULD JUMP FORWARD AT EACH SURGE. A COUPLE OF TIMES AS MY WIFE WAS DRIVING THE CAR DIED ON HER, ONE TIME AROUND A CORNER AND SHE COULD HARDLY STEER. THE CAR WOULD ONLY SURGE IF THE FOOT WAS OFF THE THROTTLE, THEREFORE IT WOULD STALL AS YOU TRIED TO CORNER OR WENT TO HIT THE BRAKE. ANOTHER TIME IT STALLED WAS IN A TRAFFIC SLOW DOWN ON THE FREEWAY. THE PART FINALLY FAILED ONE DAY WHEN THE CAR JUST WOULD NOT START. WE HAD TO HAVE IT TOWED TO THE DEALER WHERE THEY REPLACED THE  THROTTLE CONTROL. TWO MORE TIMES AFTER THE TC WAS REPLACED THE CAR STARTED TO SURGE AGAIN. AT THOSE TIMES AS SOON AS THE CAR STARTED TO SURGE I BROUGHT TO THE DEALER. BECAUSE IT WAS THE SAME PART THAT WAS REPLACED THERE WAS NO CHARGE. THE DEALER TOLD ME THEY MUST HAVE BEEN DEFECTIVE PARTS. ONE MORE TIME THE CAR DID THE SAME THING AND I RETURNED TO THE DEALER AND ONCE AGAIN THEY SUPPOSEDLY REPLACED THE TC AND TOLD ME THAT THE FLAME TRAP WAS THE CAUSE OF ALL THE PROBLEMS AND NEEDED TO BE REPLACED. SINCE THEY WANTED ANOTHER $1000 TO REPLACE THAT PART I DECIDED I WOULD DO IT MYSELF. THE DEALER TOLD ME THEY WOULD NOT WARRANTY THE TC ANYMORE. AFTER I REPLACED THE FLAME TRAP, WHICH THERE WAS NOTHING WRONG WITH IT, 6 MONTHS LATER THE CAR STARTED AGAIN WITH THE SAME PROBLEM ALL AVER AGAIN. THAT'S WHERE I AM AT NOW. ORIGINALLY WHEN THE CAR DIED AND WAS TOWED TO THE DEALER IT COST ME $1390. THEY REPLACED THE MASS AIR FLOW SENSOR $222.53,  THE THROTTLE BODY $573.10, GASKET $3.44, ETM RELOAD $35.75, LABOR $439.75 AND TAX. THIS OCCURRED ON JULY 3, 2003. THE CAR THEN WENT IN SEVERAL TIMES FOR THE SAME THING WITH THE LAST BEING MAY 18, 2004. AND NOW WE ARE BACK TO THE SAME PROBLEM AGAIN!!!   *NM",
        "vin": "YV1TS90DXX1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133059,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:VEHICKE STALLED/DIED, AND LOST POWER DUE TO THROTTLE BODY FAILURE.  *AK",
        "vin": "YV1TS90D2X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "08/02/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132416,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIAL PROBLEM OCCURRED AFTER VEHICLE WAS RUNNING FOR ABOUT 15 MINUTES. AFTER STOPPING AT A TRAFFIC LIGHT, VEHICLE WOULD ONLY ACCELERATE TO 20 MPH. ONLY AFTER TURNING OFF THE ENGINE FOR 5-10 MINUTES WOULD VEHICLE RESUME NORMAL PERFORMANCE - THEN WOULD REPEAT PROBLEM AFTER RUNNING A FEW MINUTES.  DEALER SERVICE HAS REPLACED A COMPUTER MODULE WHICH CONTROLS THIS FUNCTION.  I HAVE LEARNED THIS IS A COMMON PROBLEM IN VOLVOS.  MINE IS A 1999 S80. *JB",
        "vin": "YV1TS97D4X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "04/18/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132506,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED WHILE DRIVING/NO INJURIES/THROTTLE MODULE REPLACED/BATTERY REPLACED/RECENT NEWS ARTICLE STATED SEVERAL VOLVO SEDANS ARE UNDER INVESTIGATION FOR ENGINE STALLING WITH NO WARNING/THE PROBLEMS INVOLVED THE ELECTRONIC THROTTLE CONTROL MODULE.   *NM",
        "vin": "YV1LT56D5X2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2005",
        "dateOfIncident": "07/25/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131809,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO 1999 S70 GLT - I HAD A PROBLEM WHEN I WAS DRIVING MY CAR WOULD LOOSE ALL THE POWER.  I WAS ON THE HIGHWAY SEVERAL TIMES AND I THOUGHT I WAS GOING TO BE HIT BY ANOTHER CAR WHEN I HAD TO PULL OVER.  IT COST $1200.00 FOR VOLVO TO FIX THE PROBLEM. *JB",
        "vin": "YV1LS56D0X2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "06/21/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131593,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "10/04 PURCHASED A 1999 S70 VOLVO.  CHECK ENGINE LIGHT WAS ON; DEALERSHIP HAD IT MAINTENANCE, I WAS TOLD IT HAD TO DO WITH THE WAY THE GAS CAP WAS PUT ON.  LIGHT WENT ON AND OFF INTERMITTENTLY THE NEXT SEVERAL MONTHS.  6/20 THE ETS LIGHT CAME ON, AND THE CHECK ENGINE LIGHT WAS COMING ON MORE FREQUENTLY AND LONGER.  WHEN THE ETS LIGHT CAME ON, I TOOK IT TO VOLVO OF LOUISVILLE.  THEY DIAGNOSED THE PROBLEM AND SAID THE CATALYTIC CONVERTER NEEDED REPLACED ($1,400) AND GASKETS ($312).  THEY MADE THE REPAIRS.  WHEN I PICKED THE CAR UP AND DROVE IT, I COULD STILL HEAR THE SOUND PLUS BOTH LIGHTS WERE ON.  THEY WORKED ON IT AGAIN, AND SAID THE O2 SENSOR NEEDED TO BE REPLACED; INSTEAD THEY WERE ABLE TO FIX IT.  I PICKED THE CAR UP, AND BEFORE I COULD GET HOME, THE CAR WAS NOW RUNNING HOT AND THE AIR CONDITIONER WASN'T WORKING.  I CALLED THEM - THEY ASKED ME TO KEEP IT OVER THE WEEKEND AND CALL MONDAY.  WHEN THEY PICKED THE CAR UP, I TOLD THEM NOT ONLY WAS THE CAR RUNNING HOT, WITH NO AIR CONDITIONER, BUT IT WAS MAKING A LOUD NOISE.  THEY KEPT THE CAR FOR A WEEK ($364).  I PICKED THE CAR UP AND BEFORE I COULD CROSS THE STATE LINE, THE CAR STALLED OUT IN THE MIDDLE OF RUSH HOUR TRAFFIC.    FIRST THE IDLE WAS EXTREMELY ROUGH, AND YOU COULD TOUCH THE GAS PEDAL, BUT NO AMOUNT OF GAS WOULD MAKE THE CAR MOVE FORWARD.  IF I TURNED THE CAR OFF A COUPLE OF TIMES, THEN IT WOULD FINALLY WORK NORMALLY.  I CALLED THE DEALERSHIP, THEY ASKED ME TO DRIVE IT FOR THE WEEKEND AND CALL MONDAY.  ON SATURDAY, THE CAR GRADUALLY BECAME HARDER TO GET OUT OF THE STALL MODE.  WHEN I PULLED OFF THE ROAD, INSTEAD OF 2 TIMES AND IT WOULD FINALLY START AND WORK PROPERLY, ON SATURDAY IT TOOK 4 OR 5 TIMES TO GET IT TO WORK CORRECTLY.  BY SUNDAY, AFTER IT PLACING ME AND MY RELATIVES IN AN INCREDIBLY DANGEROUS SITUATION, I PARKED IT AND TOLD THEM TO COME GET IT.  ON MONDAY, THE REP WHO PICKED IT UP, CALLED IN A TOWING SERVICE BECAUSE OF SAFETY.  THIS TIME THEY PUT A NEW THROTTLE BODY ON THE CAR ($812).  *JB",
        "vin": "YV1LS56D1X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131215,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:1999, S-80,T-6 VOLVO. SAW AN AP ARTICLE IN MY LOCAL PAPER TODAY RE COMPLAINT INVESTIGATION. I EXPERIENCED VIRTUALLY ALL OF THE SAME PROBLEMS CITED IN THE ARTICLE.  NAMELY STALL W/O WARNING, FROM A STOP,STEP ON GAS AND BARELY WOULD MOVE(LIKE SLIPPING CLUTCH ON A MANUAL TRANSMISSION) , HAD NUMEROUS INCIDENTS WHERE I FELT VULNERABLE AND UNSAFE IN TRAFFIC, LOSS OF POWER STEERING ETC. SOUNDS VERY MUCH LIKE THESE OTHER COMPLAINTS. AT SAME TIME I HAD LOTS OF INCORRECT \"READOUTS\" ON DASH PANEL. I COMPLAINED TO DEALER WHO SAID THIS ALL COULD BE RELATED TO THE ABS CONTROL MODULE WHICH WAS REPLACED AT COST OF $825.00. OLD PART WAS NOT GIVEN BACK TO ME. OF NOTE IS THAT DURING THE SAME REPAIR A BELT WAS REPLACED WHICH THEY DID GIVE BACK TO ME, BUT NOT THE MODULE. MILEAGE WAS ONLY 61,376. THIS MODULE DID SOLVE THE PROBLEM HOWEVER I AM NOW GETTING ANOTHER GOOFY READOUT THAT DEALER SAYS COULD BE A DEFECTIVE MODULE. CURRENT MILEAGE IS 61779. I DID NOT THINK THAT FAILURES OF THIS TYPE SHOULD OCCUR AT SUCH LOW MILEAGE. AT THE TIME I ASKED IF THERE WAS A RECALL FOR THIS AND WAS TOLD NO.  I AM NOT HAPPY WITH THIS SITUATION AND II DO SUSPICION THAT A DEFECT EXISTS.  *JB",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "07/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131256,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT;VEHICLE STALLED/LOST POWER,  AND OPERATED ON REDUCED SPEED. PCV FAILED AND WAS REPLACED.  *AK",
        "vin": "YV1TS90D4X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131356,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:VEHICLE STALLED/ LOST POWER AND DIED. THE ELECTRONIC THROTTLE BODY FAILED AND WAS REPLACED.  *AK",
        "vin": "YV1TS90DXX1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "06/04/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130941,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN LOSS OF POWER AND ENGINE STALL AT HIGHWAY SPEED.  PULLED CAR OFF ROAD SAFELY.  ENGINE RESTARTED.  BROUGHT CAR TO VOLVO DEALER WHO COULD NOT IDENTIFY ANY PROBLEM.  *NM",
        "vin": "YV1TS97D2X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/14/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131112,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS STALLING AND IDLING IRREGULARLY.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/06/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131123,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80 T6, SUDDEN LOSS OF SPEED WHEN DRIVING IN HIGHWAY TRAFFIC, WITH SUDDEN PARTIAL AND AT TIMES COMPLETE STALL W/OUT WARNING.  THIS HAS HAPPENED FIVE TIMES, TWICE I HAD TO BE TOWED.  EXTENSIVE WORK HAS BEEN DONE ON THE ETM  BY TWO VERY GOOD  VOLVO SERVICE DEPARTMENTS, BUT THE PROBLEM PERSISTS AND IS A MYSTERY AS TO  WHAT TO DO ABOUT IT.  THIS IS VERY FRUSTRATING - I NEED THIS CAR TO WORK!!  *JB",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "08/02/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131165,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1999 S-80 VOLVO LOST POWER TEMPORARILY WHILE MY WIFE WAS DRIVING THE VEHICLE IN TRAFFIC.  SEVERAL OF THE CARS WARNING LIGHTS CAME ON INCLUDING THE TRANSMISSION SERVICE REQUIRED AND BRAKE SERVICE REQUIRED IMMEDIATELY TYPE MESSAGES.  THE VOLVO DEALER JUST REPLACE THE ABS MODULE AND SEVERAL COIL PACKETS AND SPARK PLUGS.  A COUPLE OF OLD PARTS WERE LEFT IN THE INSIDE OF THE VEHICLE.  WE ARE NOT SURE WHAT THE PARTS ARE. *JB",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "10/19/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131176,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80-T6 HAS HAD A MULTITUDE OF PROBLEMS  LATEST EVENT THE ENGINE QUIT WHILE DRIVING DOWN THE HIGHWAY.  WAS ABLE TO GET CAR TO SIDE OF THE ROAD.  COULD NOT BE RESTARTED.  TRANSPORTED VEHICLE  150 MILES TO DEALER.  BECAUSE WE HAD HAD SO MAY PROBLEMS WITH THE VEHICLE - $3000.00 WITHIN A THREE MONTH PERIOD CULMINATING IN THIS EVENT, THE DEALER GAVE US THE PARTS AND LABOR ($1500.00 IN THIS CASE.) *JB",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "04/12/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131184,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80 T6-MULTIPLE FAILURES OF ETM (5 FAILURES, REPLACED 4 ETMS TOTAL). CAR WOULD GO INTO \"LIMP HOME MODE\", \"CHECK ENGINE\" LIGHT WOULD GO ON. VERY DANGEROUS AND FRUSTRATING. THE ETM ALSO HAS FAILED ON WIFE'S 2001 V70 XC ONE TIME AROUND 80K MILES. I NO LONGER OWN THE S80; TOO UNRELIABLE, A COMPLETE JOKE GIVENS VOLVO'S REPUTATION FOR SAFETY!*JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "08/17/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131203,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 1999 VOLVO S80 WHICH I DRIVE FOR BUSINESS PURPOSES.  ON AUGUST 17, 2004 THE  VEHICLE STALLED AT HIGHWAY SPEED.  WOULD BARELY RUN, EVEN WITH FULL THROTTLE.  HAD VEHICLE TOWED TO NEAREST VOLVO DEALER, VOLVO OF LOUISVILLE, KY.  THEY REPLACED THROTTLE BODY .  APPROX. 2 WEEKS LATER, HAD SAME OCCURRENCE.  CAR STALLED AT HIGHWAY SPEED.  HAD VEHICLE TOWED TO LOCAL DEALER, CENTURY VOLVO HUNTSVILLE, AL.  THEY EXAMINED IT AND COULD NOT FIND ANY PROBLEM.  IT WAS NOT MALFUNCTIONING FOR THEM.  THEY KEPT VEHICLE FOR SEVERAL DAYS TRYING TO DUPLICATE PROBLEM.  I HAD A SIMILAR OCCURRENCE AGAIN APPROX. 5 DAYS LATER.  INSTEAD OF HAVING VEHICLE TOWED AGAIN, THE SERVICE REP SUGGESTED THAT THE CAR MIGHT \"RESET\" IF LEFT FOR 2-3 HOURS.  I LEFT CAR ON ROADSIDE OVERNIGHT AND HAD MY WIFE COME PICK ME UP.  THE NEXT DAY I WENT BACK AND THE CAR DROVE FINE.  I HAD ANOTHER OCCURRENCE AT HIGHWAY SPEEDS ON OCTOBER 26, 2004.  VEHICLE TOWED TO ROYAL VOLVO IN BIRMINGHAM.  BY THE TIME THEY EXAMINED IT, VEHICLE WAS NO LONGER MALFUNCTIONING.  THEY KEPT IT RUNNING UNDER LOAD FOR SEVERAL HOURS.  THERE WERE NO COMPUTER FAULT CODES FOUND THAT COULD HAVE CONTRIBUTED TO THE PROBLEM.  THIS IS THE SAME INFORMATION THAT CENTRURY VOLVO HAD FOUND AND ADVISED ME OF EARLIER.  I CONTINUED TO DRIVE THE CAR WITH A LOT OF CONCERN THROUGH THE WINTER.  IT WENT SEVERAL MONTHS WITH NO PROBLEMS.  I HAD ANOTHER OCCURRENCE IN  MAY 2005.  I WAS ABLE TO MAKE IT HOME BY ALLOWING THE CAR TO SIT FOR 20-30 MINUTES AND THEN IT WOULD DRIVE FOR A SHORT DISTANCE BEFORE GOING BAD AGAIN.  AT THIS TIME I PARKED THE CAR AND BEGAN DRIVING MY SECONDARY VEHICLE (A 94 VOLVO 960).  UNFORTUNATELY, I WAS INVOLVED IN AN ACCIDENT WITH THIS VEHICLE ON JULY 29, 2005 WHICH FORCED ME TO DRIVE THE 99 S80 AGAIN.  IT STALLED OUT AGAIN TODAY (SECOND DAY DRIVEN).  I'VE HAD IT TOWED TO CENTURY VOLVO IN HUNTSVILLE AGAIN.  MY SALESMAN SHOWED ME AN ARTICLE IN TODAY'S NEWSPAPER REGARDING THIS PROBLEM.   *JB",
        "vin": "YV1TS97D6X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "06/04/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130940,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN LOSS OF POWER AND STALLING OF ENGINE AT HIGHWAY SPEED.  PULLED CAR SAFELY OFF ROAD.  CAR RESTARTED.  BROUGHT CAR TO VOLVO DEALER WHO COULD NOT FIND ANY PROBLEM.  *NM",
        "vin": "YV1TS97D2X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "07/13/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128613,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER STATED HE IS A CERTIFIED MECHANIC AND HAS TWO SEPARATE VEHICLES THAT ARE THE SAME MAKE AND MODEL WITH THE SAME PROBLEM.  THE COMBINATION UNIT OF THE FUEL PUMP ASSEMBLY HAS A MASSIVE LEAK.  THERE IS A CRACK IN THE FUEL PUMP ASSEMBLY THAT IS CAUSED BY  STRESS FROM THE FUEL LINE.  WITH ENOUGH PRESSURE OVER TIME IT WILL CAUSE THIS CRACK.  THE FUEL PUMP ASSEMBLY WILL HAVE TO BE REPLACED.   *JB",
        "vin": "YV1TS90D0X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "07/13/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128615,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER STATES HE IS A CERTIFIED MECHANIC AND HAS TWO SEPARATE VEHICLES THAT ARE THE SAME MAKE AND MODEL WITH THE SAME PROBLEM.  THE COMBINATION UNIT OF THE FUEL PUMP ASSEMBLY HAS A MASSIVE LEAK.  THERE IS A CRACK IN THE FUEL PUMP ASSEMBLY THAT IS CAUSED BY THE STRESS FROM THE FUEL LINE.  WITH ENOUGH PRESSURE OVER TIME IT WILL CAUSE THIS CRACK.  THE FUEL PUMP ASSEMBLY WILL HAVE TO BE REPLACED.  *JB",
        "vin": "YV1TS90D3X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2005",
        "dateOfIncident": "03/01/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122028,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ETM PROBLEM WAS DIAGNOSED BY DEALER AFTER SURGING ENGINE AT IDLE AND THEN ENGINE FAILURE.  WE PAID $850 TO REPLACE THIS AND NOW 13 MONTHS AND 13000 MILES LATER THE NEW PART HAS ALSO FAILED.  THEY WILL NOT COVER THE PART BECAUSE IT HAS BEEN OVER 12 MONTHS SINCE REPAIR.  I HAVE NO CONFIDENCE IN SPENDING ANOTHER (NOW $950) FOR ANOTHER ETM THAT IS DESTINED TO FAIL AGAIN RISKING ACCIDENT/DEATH FOR MY FAMILY DEPENDING ON WHEN \"IT DECIDES\" TO FAIL.",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "11/02/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121070,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER STATES THAT SHE OWNS A 1999 VOLVO S80. SHE SAYS THAT SHE HAS HAD SEVERAL PROBLEMS WITH THIS VEHICLE. SHE TOOK THE VEHICLE TO HER VOLVO MANUFACTURER. VOLVO SAID THAT BECAUSE SHE BOUGHT IT USED FROM A INDEPENDENT DEALER AND OUT OF WARRANTY THAT THEY ARE NOT RESPONSIBLE FOR THE VEHICLE. SHE SAYS THAT HER ABS BRAKES KEEP FAILING AND NEEDED TO BE REPLACED.   SOMETIMES THE BRAKES WORK AND SOMETIMES IT WOULD NOT. SHE ALSO SAID THAT SHE HAD TO REPLACE THE STEERING HOSE BECAUSE THE STEERING WOULD LOCK UP. THE PRIOR OWNER OF THE VEHICLE HAD TOLD THE INDEPENDENT DEALER THAT HE HAD SEVERAL PROBLEMS WITH THE VEHICLE WHILE HE OWNED IT.    *TT",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/03/2005",
        "dateOfIncident": "04/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119530,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DEPLOYMENT CAUSED AN  ACCIDENT.  THERE WAS AN ACCIDENT TWO WEEK PRIOR TO DEPLOYMENT, NO AIR BAG DEPLOYED, AND NO MAJOR DAMAGE OCCURRED.  THE FRONT AND DASH AIR BAGS DEPLOYED ON 4/29/05.  NO IMPACT AT TIME OF DEPLOYMENT.  DRIVER LOST CONTROL AND HIT ANOTHER VEHICLE.  AIR BAG LIGHT CAME ON AS DRIVER WAS READING MESSAGE, AND  AIR BAG DEPLOYED. SPEED WAS 20 MPH.  THERE WILL BE INVOICES, POLICE REPORT.*AK",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/12/2005",
        "dateOfIncident": "04/11/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117781,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS MAKING A LEFT HAND TURN  IN A PARKING LOT WHEN ALL OF A SUDDEN THE CONSUMER FELT LIKE SHE HIT A POT HOLE. CONSUMER THEN GOT OUT OF THE VEHICLE AND NOTICED THAT THE FRONT LEFT WHEEL BECAME DETACHED.  VEHICLE WAS  TOWED TO A SHOP FOR REPAIR.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/24/2005",
        "dateOfIncident": "01/06/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114624,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO S80 T6 1999. DEFECTIVE ETM (THROTTLE MODULE OR THROTTLE UNIT). THIS MODULE FAILED AT ONLY 64,000 MILES AND IS NOT COVERED UNDER VOLVO WARRANTY. I UNDERSTAND THIS IS HAPPENING TO ALMOSY EVERY OWNER OF THIS MODEL YEAR. I'M ASKING FOR VOLVO TO COVER THE REPLACEMENT COST (PARTS AND LABOR). THE FAILURE OF THIS UNIT COULD CAUSE SEVERE INJURY AND/OR DEATH AS THE VEHICLE ENGINE WILL DIE AT ANY SPEED AND ANYWHERE WITHOUT NOTICE. THE DEALERSHIP REPLACEMENT COST IS OVER $1000.",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2005",
        "dateOfIncident": "02/07/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110062,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 7, 2005, I TOOK MY CAR FOR SERVICE CHECK AND OIL CHANGE.  HOWEVER, I WAS NOT NOTIFIED OF THE RECALLS AND OTHER DEFECTS WHICH I LOCATE ON THE WWW.FOX5DC.COM WEB PAGE LINK FOR  NHTS.DOT.GOV ON VARIOUS SERVICE BULLETINS WHICH HAVE BEEN ISSUE ON THE 1999 VOLVO S80.  I WAS VERY UPSET AT THE BILL RECEIVED OVER $3,000.00 FOR REPAIRS.  I FOUND THIS TO BE AN OUTRAGE.  PLEASE FORWARD ALL THE SERVICE BULLETIN REPORTS FOR THE 1999 VOLVO S80 TO ME AND BILL ME ANY CHARGES AS REQUIRED.  ALSO NOTE THAT  I WAS NOT SURE WHAT \"OEM\" MEANT AND I DID NOT CHECK YES.  IF YES IS REQUIRED IN THIS FILED THEN I SHOULD HAVE CHECKED YES.  THIS CAN BE FOUND IN THE COMPONENT SECTION OF THIS QUESTIONNAIRE.  THANK YOU.  *AK",
        "vin": "YV1TS97D4X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/24/2005",
        "dateOfIncident": "01/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108722,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING IN EITHER DIRECTION THE FRONT TIRES RUBBED THE UNDERCARRIAGE OF THE VEHICLE . THE CAUSE HAS NOT BEEN DETERMINED. PLEASE PROVIDE ADDITIONAL INFORMATION.",
        "vin": "YV1TS97D6X1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/21/2005",
        "dateOfIncident": "01/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10107661,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED IN MY DRIVEWAY RUNNING, I WAS IN THE PASSENGER SEAT, MY HUSBAND GOT OUT TO RETRIEVE AN ITEM IN THE HOUSE & SHUT THE DOOR, ALL DRIVER SIDE AIRBAGS DEPLOYED. THE FUMES/SMOKE FROM THE AIRBAGS BURNED MY THROAT, I HAVE HAD THROAT DISCOMFORT FOR 5 DAYS. THE COST TO PUT THE CAR BACK TOGETHER IN WORKING ORDER IS $3000. ONE PERSON AT VOLVO SERVICE IN THOUSAND OAKS, CA. SAID THAT IT SHOULD NOT HAVE HAPPENED BUT OUT OF WARRANTY SO I HAVE TO PAY THE $3000 IF I WANT IT REPAIRED.   *NM",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/19/2004",
        "dateOfIncident": "11/19/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101403,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING A GRINDING NOISE WAS HEARD COMING FROM THE FRONT.  CONSUMER NOTICED A LIQUID LEAKING FROM UNDERNEATH THE VEHICLE WHILE PARKED.  THE DRIVER WAS ABLE TO DRIVE IT TO THE DEALER FOR INSPECTION.  MECHANIC DETERMINED THAT  RACK AND PINION STEERING NEEDED REPLACED.  *AK",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100106,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "LID TO GAS TANK FELL OFF.  SINCE THIS HAPPENED TO MINE I HAVE SEEN 4 OTHER S80 VOLVOS MISSING THE LIT TO THE GAS TANK.*AK",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/11/2004",
        "dateOfIncident": "11/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098694,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP CRACK CAUSING GAS TO BE SPRAYED ON UNDERSIDE OF AUTO WHEN IGNITION IS ON.  GAS FUMES IN GARAGE FOLLOWING PARKING OF AUTO.  MAJOR RISK OF FIRE/EXPLOSION  POSSIBLE CAUSED BY DEFECTIVE FUEL PUMP.  AUTO IS FIVE + YEARS OLD WITH 37,100 MILES.  VOLVO DEALER REPLACED FUEL PUMP AT CHARGE OF $592.  *JB",
        "vin": "YV1TS97D8X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/03/2004",
        "dateOfIncident": "09/26/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093515,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT HAS COME ON 5 TIMES IN LESS THAN 7 MONTHS TOOK TO DEALER AND THEY SAID IT WAS A LOOSE GAS CAP.(WHICH IT WAS NOT) THE LAST TIME IT WAS TAKEN TO THE DEALER 9-26-04 AND JUST OUT OF THE EXTENDED WARRANTY PERIOD THEY SAY IT IS NOW A BAD THROTTLE BODY WITH A REPAIR EST OF 950.00. THROTTLE BODYS DO NOT GO BAD IS THERE INFORMATION THAT THE DEALER DOSE NOT HAVE ON THE REPAIR (CLEANING OF THE THROTTLE BODY) *AK",
        "vin": "YV1TS90D8X1"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/21/2004",
        "dateOfIncident": "08/24/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089617,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE BRAKES, THE DRIVER'S FRONT SEAT ROCKED BACK AND FORTH.  THE CONSUMER DROVE THE VEHICLE TO THE DEALER FOR INSPECTION.   THE CONSUMER INFORMED THE MECHANIC THAT THIS PROBLEM OCCURRED MORE THAN ONCE, AND THE PROBLEM STILL HAD NOT BEEN RESOLVED.   *AK   *SC  *JB",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "09/20/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091325,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DEPLOYED AFTER RUNNING OVER MANHOLE COVER ON RTE 4 WEST ON MONDAY SEP 20, 2004 APPROXIMATELY 7:20 AM EST. ROADWORK IN PROCESS ON RTE 4 TRAVELLING APPROX 15-20 MILES PER HOUR MORNING TRAFFIC, AIR BAG DEPLOYED.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/01/2004",
        "dateOfIncident": "08/13/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088972,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MAJOR SAFETY PROBLEMS AND POSSIBLE FIRE HAZARD:  THE 1999 IS HARD TO START AND HAS TO BE CRANKED FOR ABOUT A MINUTE BEFORE IT  STARTS, AND WE ALSO  SMELL GAS WHEN WE STOPPED THE CAR (BY THE FUEL FILLER).*AK  I TOOK THE CAR TO UNION PARK SPENT $300. THINKING IT NEEDED A TUNE UP.  STILL THE PROBLEM EXISTS. I TOOK THE CAR BACK TO UNION PARK AND I WAS ADVISED THAT THE PROBLEM IS A LEAK IN THE VENT TUBE OFF THE GAS TANK. WHEN THE KEY IS TURNED ON, THE ELECTRIC FUEL PUMP PRIMES THE LINE. HOWEVER, SINCE THERE IS A LEAK IN THE VENT TUBE THIS SUCKS IN AIR AND PREVENTS THE GAS FROM GOING TO THE FUEL INJECTORS, THEN THE FUMES EXIT OUT THE VENT. I WAS ADVISED THAT THE VENT TUBE IS NOT A REPLACEABLE PART AND THAT I WILL HAVE TO BUY A NEW GAS TANK WITH VENT TUBE AT THE COST OF $1,081.30.  I FEEL THAT THIS IS A DESIGN PROBLEM AND SHOULD BE PAID FOR BY VOLVO. OTHER VEHICLES HAVE THIS AS A TWO PIECE UNIT AND THE TUBE CAN BE REPLACED AT A LOWER EXPENSE, LESS THAN $150.00.  I ALSO FEEL THAT THIS IS A SAFETY PROBLEM; IF SOME ONE WAS SMOKING NEAR THE REAR OF THE CAR A FIRE COULD START. I HAVE REPORTED THIS TO THE NATIONAL DOT SAFETY BOARD.  FRONT END PARTS, STEARING  I HAVE ALSO HAD PROBLEMS WITH THE FRONT END PARTS, BALL JOINTS REPLACED, UPPER STRUT BUSHING REPLACED AND NOW THEY TELL ME THAT THE SWAY BAR LINKS NEED TO BE REPLACED AT A COST OF $192.04,  I FEEL THAT THIS CAR IS A LEMON. IN THE PAST TWO YEARS I HAVE SPENT $3000. TO FIX ITEMS WHICH SHOULD NOT HAVE BROKEN WITH NORMAL DRIVING USAGE. I ALWAYS BOUGHT VOLVO'S BECAUSE THEY WERE RELIABLE.THIS CAR IS A MAJOR HEADACHE. THE ELECTRICAL SYSTEM HAS ONE PROBLEM AFTER ANOTHER. THE DOOR LOCKS NEED FIXING OR REPLACEMENT FOR THE THIRD TIME. THE PROBLEM WITH THE FUEL VALVE IS A DESIGN PROBLEM AND A HUGE SAFETY CONCERN. SINCE FORD TOOK OVER VOLVO, THE CAR HAS GONE FROM AN EXTREMELY SAFE AND RELIABLE MEANS OF TRANSPORTATION TO A CONSTANT WORRY ABOUT SAFETY AND MAINTENANCE AND A MONEY PIT.",
        "vin": "YV1TS97D8X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2004",
        "dateOfIncident": "08/24/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089590,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AT ANY SPEED VEHICLE  STALLED, AND THEN WON'T START AGAIN.  VEHICLE WAS TOWED TO THE DEALERSHIP. FLOOR MANAGER INDICATED, A PIPE ON THE FUEL RAIL  BROKE AND NEEDED TO BE REPLACED AT CONSUMER'S EXPENSE OF $1200. CONSUMER INDICATED THE FUEL TANK/FUEL PUMP, AND FUEL RAIL WAS JUST ONE UNIT. *AK",
        "vin": "YV1TS97D8X1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2004",
        "dateOfIncident": "06/23/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083032,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "REPLACE MAIN COMPUTER AFTER COMPUTER REGISTERED \"URGENT, BRAKE FAILURE\" CODE AND VOLVO DETERMINED IT WAS A FAULTY CODE.  THREE MONTHS LATER,  I HAD TRANSMISSION SLIPPAGE WHILE UP SHIFTING...GETTING EXTREMELY BAD. HAD TRANSMISSION REBUILT AT A REPUTABLE TRANSMISSION SHOP AND HE TOLD ME THE TRANSMISSION  (AT 80,000M) FAILED BECAUSE IT WAS NEVER SERVICED PROPERLY.  I HAVE ALL SERVICE RECEIPTS...ALL DONE AT VOLVO DEALERSHIPS THROUGH 50K WARRANTY. TRANSMISSION SHOP SAID, MY GM TRANSMISSION, UNLIKE EARLIER VOLVO TRANSMISSION NEEDS MORE SERVICING THAN A VOLVO TRANSMISSION.  TRANSMISSION SHOP SAID THAT MY   \"TRANSMISSION FILTER HAD NEVER BEEN CHANGED!!!!\"*AK  CONTACTED VOLVO CONSUMER AFFAIRS AND THEY  BASICALLY LAUGHED AT ME.  I AM THINKING ABOUT FILING A COMPLAINT IN SMALL CLAIMS COURT FOR 2K THE COST OF MY REBUILT TRANSMISSION. PRESIDENT OF CARS SUGGESTED THAT WAS A VIABLE OPTION.  *TR",
        "vin": "YV1TS97D7X1"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/20/2004",
        "dateOfIncident": "12/10/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068570,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE DEFECTIVE DIP STICK WAS REPAIRED, CONSUMER NOTICED OIL ON THE GARAGE FLOOR.   *PH   DURING A 65K MAINTENANCE, THE TECHNICIAN FOUND A MALFUNCTIONING DIP STICK WHICH SPLATTERED OIL.  THE PART WAS REPLACED.  A COUPLE OF WEEKS LATER THE CONSUMER NOTICED THE GARAGE FLOOR COVERED IN OIL.  THE MECHANIC FOUND THAT THE TEMPORARY DIPSTICK REPAIR FAILED.   *SC    *JB",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "STEERING,POWER TRAIN,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/28/2004",
        "dateOfIncident": "04/01/1999",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059976,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MESSAGE CENTER DISPLAYES:  ABS SYSTEM FAILURE/SERVICING  TRANSMISSION SYSTEM SERVICE  POWER STEERING SERVICE   EMISSIONS CONTROL SERVICE  ALSO, THERE IS AN ENGINE OIL LEAK  AND A TIE ROD REPLACEMENT/FOUR WHEEL ALIGNMENT WAS REQUIRED  CRUISE CONTROL IS INTERMITTENT  DIRECTIONAL SIGNAL INOP  HEADLIGHTS COME ON WHEN NOT COMMANDED ETC.  INCIDENT DATE--THROUGHOUT OWNERSHIP .  *AK",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059473,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP PERFORMED INSPECTION ON VEHICLE AND A NUMBER OF DEFECTS WAS SEEN.  ONE PARTICULAR DEFECT WAS THE STEERING BOX.  CONSUMER HAVE BEEN FROM ONE DEALER TO ANOTHER BUT NO REPLACEMENT HAS BEEN MADE.  *LA  THE CONSUMER WAS WAITING FOR THE STEERING RACK  TO BE INSTALLED IN THE VEHICLE.*JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2004",
        "dateOfIncident": "10/21/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059235,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STOPPING AT A LIGHT OR SIGN WITH  FOOT ON THE BRAKES VEHICLE JUMPED FORWARD SEVERAL FEET.  ALSO, WHEN TRYING TO PASS ANOTHER VEHICLE ON THE HIGHWAY VEHICLE DECELERATED INSTEAD OF ACCELERATING, NEARLY CAUSING AN ACCIDENT.  *AK",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/17/2004",
        "dateOfIncident": "12/23/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059224,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT ABOUT VOLVO'S ATTITUDE AND REFUSAL TO ISSUE A RECALL FOR A FAULTY DIPSTICK AND THE REFUSAL TO REIMBURSE THE $50.00 DOLLARS DEDUCTIBLE FOR THE PROBLEMS THE CONSUMER EXPERIENCED WITH THEIR VEHICLE.   *PH  *MR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/09/2004",
        "dateOfIncident": "12/16/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056834,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WILL NOT DOWNSHIFT OR PROVIDE ANY VEHICLE DECELERATION.  RPM GOES TO 750 WHEN FOOT IS REMOVED FROM THE GAS BUT VEHICLE SPEED REMAINS SAME AND ONLY COASTS O SLOW DOWN",
        "vin": "YV1TS97D6X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "01/15/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054194,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE STEERING WHEEL LOCKED UP.  THE DRIVER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE AND UNLOCKED THE STEERING. HE  DROVE THE VEHICLE TO THE DEALER FOR ANALYSIS.  THE MECHANIC NOTICED THAT THE STEERING FLUID WAS LEAKING FROM UNDER THE HOOD.  THE DRIVER STATED THAT THE VEHICLE HAS BEEN AT THE DEALER FOR THREE MONTHS.  THE MECHANIC IS WAITING FOR A STEERING ROD.    . NETMET VOLVO 153-20 HILLSIDE AVE.  JAMAICA NEW YORK 11432  ***************718 523 5858 TONY JOHNSON(SERVICE MANAGER).   *NM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "12/15/1998",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069358,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DIES WITHOUT WARNING AT HIGH SPEEDS AND LOW SPEEDS, APPARENTLY VOLVO KNOWS THAT THERE IS A BAD COMPUTER CHIP IN MANY OF THE CARS BUT DOES NOT ADMIT TO IT BECAUSE IT COSTS $800 TO REPLACE THE CHIP.  I FOUND THIS OUT FROM ANOTHER VOLVO DRIVER!",
        "vin": "YV1TS90D4X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "12/15/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070071,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VOLVO S 80 CAR AS A SECOND OWNER WHEN IT HAD 35,500 MILES WITH 19,500 MILES REMAINING ON THE 50,000 NEW CAR WARRENTY. THE CAR HAD BEEN SERVICED FAITHFULLY. AT 57,00 MILES THE SERPENTINE BELT FAILED AND THE CAR QUIT. THE CAR WAS TOWED TO BYERS VOLVO,COLUMBUS,OH. THE SERPENTINE BELT CAUSED THE TIMING BELT TO GET OUT OF TIME WHICH CAUSED ALL THE INTAKE VALVES TO BE BE BENT. I WAS ADVISED THAT THE SERPENTINE BELT WAS SCHEDULED TO BE REPLACED AT 60,000 MILES AND THAT SINCE THE CAR WAS OUT OF WARRANTY, THAT I SHOULD CONTACT VOLVO OF AMERICA.  AGAIN I WAS TOLD THAT EVEN THOUGH THE BELT WAS NOT DUE TO BE REPLACED UNTIL 60,000 MILES , THE CAR WAS STILL OUT OF WARRANTY AND SINCE I DID NOT PURCHASE IT FROM THE VOLVO DEALER, THERE WAS NOTHING THEY COULD DO.  I TOOK THE CAR TO AN INDEPENDENT GARAGE AND HAD THE CAR REPAIRED. I AGAIN CONTACTED VOLVO AND RECEIVED THE SAME RESPONSE. I FEEL THAT SINCE THE BELT THAT CAUSED THE PROBLEM WAS NOT SUPPOSED TO BE REPLACED FOR ANOTHER 30000 MILES THAT THERE WAS AN IMPLIED WARRENTY AND VOLVO SHOULD BE HELD RESPONSIBLE.",
        "vin": "YVITS97DOX1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "06/15/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070447,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION HAD TO BE REPLACED LAST WEEK AND I FEEL THAT WITH THE QUALITY OF THIS CAR AND THE REPUTATION OF VOLVO, THAT THE TRANSMISSION SHOULD NOT HAVE HAD TO BE REPLACED AT THIS EARLY POINT IN THE CAR'S LIFE.  THEY ARE TOTALLY UNWILLING TO DISCUSS ANY CONSIDERATION IN THE COST OF THIS REPAIR.  THE DEALERSHIP HAS WORKED WITH US A BIT, BUT NOT THE DISTRIBUTORS.  PEOPLE I HAVE CHATTED WITH ARE AMAZED THAT VOLVO HAS BEEN SO UNRESPONSIVE.  MY HUSBAND IS READY TO SELL IT AND BUY A BMW!",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2003",
        "dateOfIncident": "12/07/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049436,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1999 VOLVO S-80 T-6 SUFFERS FROM A DESIGN FLAW ASSOCIATED WITH THE THROTTLE BODY AND ENGINE WARNING LIGHT.  THE LIGHT IS ON ALL OF THE TIME.  SERVICING DOES NOT CLEAR THE LIGHT, SO I HAVE BEGUN TO SIMPLY IGNORE THE LIGHT.  THE THROTTLE BODY HAS A PROBLEM WHERE THE ENGINE RUNS PROPERLY FOR 20,000 THEN BEGINS TO OSCILLATE UPAND DOWN BY 200-300 RMPS AT IDLE.  THIS SEEMS MINOR, BUT IT ALMOST CAUSED A MAJOR ACCIDENT YESTERDAY.  WHEN SLOWING TO A STOP AT A MAJOR INTERSECTION, THE ENGINE SLOWED TO IDLE AND THEN SPED UP JUST AS I WAS ABOUT TO COME TO A STOP.  THE HIGHER RPM CAUSED THE CAR TO MOVE INTO THE INTERSECTION.  IF ANOTHER CAR HAD BEEN APPROACHING, IT WOULD HAVE STRUCK MY CAR.  I ASKED MY WIFE (THIS IS HER PRIMARY CAR)IF SHE HAD EXPERIENCED THE SAME PROBLEM AND SHE SAID SHE HAD SEVERAL TIMES.  I WENT ON THE WEB AND FOUND THAT MANY VOLVO OWNERS ARE EXPERIENCING THE SAME RPM AND ENGINE LIGHT PROBLEMS.  I DO NOT KNOW IF THEY HAVE HAD THE SAME NEAR ACCIDENT I DID, BUT I MUST ASSUME THEY HAVE.  HAVE YOU RECEIVED OTHER COMPLAINTS ABOUT THIS PROBLEM AND HAS VOLVO BEEN NOTIFIED?  I CONTACTED VOLVO AND THEY DENIED ANY PROBLEM.  THE WORDS ON THE INTERNET TELL ME THEY ARE MISTAKEN.  SOME ONE COULD GET KILLED BY THIS DESIGN FLAW.  *AK",
        "vin": "YV1TS90D8X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "10/22/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045519,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "RACK AND PINION WENT OUT ON VEHICLE--VOLVO SAYS PART IS NOT AVAILABLE TO REPAIR VEHICLE, PART IS UNDER INVESTIGATION.  NO ONE AT VOLVO WILL GIVE ME REASONABLE RESOLUTION TO THE PROBLEM.  TOTALLY UNCOOPERATIVE.",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "07/28/2003",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047779,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S AXLE BRAKE CAUGHT FIRE.   *MR   THE VEHICLE WAS IN MOTION WHEN THE RIGHT SIDE AXLE BROKE AND CAUGHT FIRE.  (VOLVO CONVENTIONAL 1999)   *SCC",
        "vin": "4V67DBGH1XN"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/04/2003",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10045444,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY SUNROOF OPEN.  A LARGE FLAT METAL ROD FELL OUT OF IT AND HIT ME ON THE HEAD.  THE ROD IS ABOUT 3 FEET LONG AND WEIGHTS ABOUT 2-4 POUNDS.  IT IS LIKE A CROWBAR IN COLOR, WEIGHT AND THICKNESS, BUT IT IS FLAT AND STRAIGHT.*AK    I HAVE SINCE FOUND OUT THAT IT IS THE PIECE ATTACHED TO THE INNER RIM OF THE SUNROOF.  THE DEALER CALLED IT A SUNROOF BRAKE.  IT APPEARS TO HAVE BEEN HELD IN PLACE BY DOUBLE STICK TAPE.    I HAD A SLIGHT BUMP ON MY HEAD AND I HAVE HAD HEADACHES.  I WAS VERY STARTLED.  AT FIRST I THOUGHT IT FELL OFF A TRUCK OR POWER LINE, NOT MY OWN CAR.    MY CAR MODEL IS AN S80, BUT IT ISN'T IN YOUR LIST OF CHOICES.",
        "vin": "YV1TS97DXX1"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/04/2003",
        "dateOfIncident": "09/03/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037241,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT, PASSENGER WINDOW ACTUATOR \"BROKE\" APPROXIMATELY 1 MONTH AGO.  I JUST FOUND OUT THAT THE FRONT, DRIVER SIDE ACTUATOR IS NOW BROKEN.  NEITHER OF THESE WINDOWS RECEIVED EXCESSIVE USE OR ABUSE.  IT IS NOT ACCEPTABLE FOR THEM TO JUST \"BREAK\" WITH NORMAL USAGE.*AK",
        "vin": "YV1TS90D0X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2003",
        "dateOfIncident": "08/26/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036637,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1999 VOLVO S80 ENGINE CUT OUT ON HIGHWAY FIRST 6 MOS OF NEW VEHICLE OWNERSHIP.  ONGOING PROBLEMS WITH SERVICE ENGINE LIGHT, NUMEROUS ATTEMPTS BY LEE VOLVO TO REPAIR, ENGINE HAS CUT OUT THREE ADDITIONAL TIMES OVER LAST THREE MONTHS DESPITE $1400 SPENT WITH LEE VOLVO.  THIS CAR WAS TO HAVE A NEW FAN RECALL NOTICE 02V096/VOLVO RECALL NO. 110.   *NLM",
        "vin": "YV1TS90D4X1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/05/2003",
        "dateOfIncident": "07/23/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030818,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 23, 2003, OUR 1999 S80 VOLVO WAS SERVICED AT MT. KISCO VOLVO. THIS SERVICE INCLUDED THE 45,000 CHECKUP. THE BILL CAME TO $615.15. LESS THAN 48 HOURS LATER, AND AFTER DRIVING LESS THAN 100 MILES THE FRONT END AXLE COLLAPSED ON 124TH STREET AND THIRD AVENUE IN NEW YORK CITY. A YOUNG MAN CAME RUNNING TO THE CAR AND TOLD US THAT THE AXLE HAD BROKEN. AFTER MUCH BADGERING AND A DESCRIPTION OF WHAT HAD OCCURRED, CHRIS, THE SERVICE MANAGER AT MT. KISCO VOLVO DISPATCHED A TOW TRUCK AND A LOANER CAR.   ON MODAY, JULY 27,2003, CHRIS, THE SERVICE MANAGER AT MT. KISCO VOLVO, ADVISED US THAT THE CAR HAD ANSWERED A RECALL IN 2001 FOR THE DEFECT IN THE AXLE. THUS VOLVO WAS AWARE OF THE DEFECT.  THE SERVICE MANAGER ALSO TOLD US THE CAR WOULD BE REPAIRED AND READY IN A WEEK AT NO COST TO US. AS OF TODAY NOTHING HAS BEEN DONE.  IN A CONVERSATION WITH THE OWNER OF MT. KISCO VOLVO IN THE EVENING OF JULY 25, 2003, INFORMED US THAT HE  WANTED US TO PAY FOR THE REPAIR, CONTACT OUR INSURANCE CARRIER, SIGN A RELEASE AND RETURN THE LOANER BEFORE ANY WORK IS DONE TO REPAIR THE AUTO. MR. STAVIDES, THE OWNER TOLD US HE WOULD GET BACK TO US ON FRIDAY AUGUST 1, 2003. HE IMPLIED THAT UNLESS WE AGREED TO HIS TERMS THAT THE CAR WOULD NOT BE REPAIRED. HE HAS NOT CONTACTED US AGAIN.  I NOTE THAT THE CAR HAS BEEN SERVICED EXCLUSIVELY BY MT. KISCO VOLVO AND THAT IT HAS BEEN SERVICED NO LESS THAN FOURTEEN TIMES.*AK  I NOTE THAT ACCORDING TO THE RULE OF THE NHTSA, \" IF A SAFETY-RELATED DEFECT EXISTS IN A MOTOR VEHICLE OR ITEM OF MOTOR VEHICLE EQUIPMENT THE MANUFACTURER MUST FIX IT AT NO COST TO THE OWNER. \"",
        "vin": "YV1TS97D5X1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/25/2003",
        "dateOfIncident": "05/28/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023782,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE.   *NLM",
        "vin": "YV1TS97D2X1"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/30/2003",
        "dateOfIncident": "04/20/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017846,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, AND WITHOUT WARNING THE SUNROOF SUPPORT BAR DISCONNECTED FROM THE FRAME.  *JB  THE FRONT ROLLOVER SUPPORT BAR FELL OUT WHILE OPENING THE SUNROOF AND THE SAME HAPPENED TO THE REAR SUPPORT TWO WEEKS LATER.  (VIN#[XXX])  *SCC    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "YV1T597D3X1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "03/30/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10016332,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE IMPACT AIR BAGS,SEAT AND WINDOW CURTAIN DEPLOYED AFTER CLOSING FRONT DRIVERS DOOR.   *NLM",
        "vin": "YV1TS90D9X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2003",
        "dateOfIncident": "03/10/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013633,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "1) P/S UNIT FAILED ALLOWING P/S FLUID TO RAPIDLY DRAIN OUT.   *NLM",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2003",
        "dateOfIncident": "02/15/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011815,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED SUDDEN ACCELERATION.  *JB",
        "vin": "FULLFILL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/12/2003",
        "dateOfIncident": "01/30/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010364,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS BEFORE THE ACTUAL INCIDENT, I NOTICED THAT MY DRIVER SIDE WINDOW WOULD ONLY GO DOWN HALFWAY BEFORE ROLLING BACK UP AUTOMATICALLY ON ITS OWN.  IT KEPT DOING IT UNTIL I TURNED THE ENGINE OFF AND THEN TURNED IT BACK ON.  A FEW WEEKS LATER, WHEN I CLOSED MY DRIVER SIDE DOOR THE SIDE IMPACT AIRBAGS DEPLOYED.  THE VOLVO REPRESENTATIVE CAME OUT AND INSPECTED IT AND VOLVO FIXED IT BECAUSE IT WAS STILL UNDER WARRANTY, BUT THEY DID NOT KNOW WHAT CAUSED THIS PROBLEM.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2003",
        "dateOfIncident": "02/10/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005694,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS IDLING ALL LIGHTING ON THE VEHICLE(INTERIOR AND EXTERIOR) SLIGHTLY DIMS EVERY COUPLE SECONDS.  AN ANNOYANCE THE DEALER(ANNAPOLIS VOLVO) SAYS IS AN ANOMALY THAT IS INHERENT IN THIS MODEL AND CANNOT BE FIXED.  I DISAGREE AND AM CONFIDENT THAT A $38K CAR CAN BE MADE WITHOUT FLICKERING LIGHTING.  DEALER REFUSES TO ADDRESS THIS FURTHER.  CALLS TO VOLVO USA WENT UNRETURNED.  ALL OF THE 6 OTHER CARS I'VE OWNED DON'T HAVE FLICKERING LIGHTING.",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565082,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE  TIRE WEAR. *AK",
        "vin": "4VG7DARJXXN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/21/2003",
        "dateOfIncident": "05/20/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004281,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING PEDAL GOES TO THE FLOOR. DEALER NOTIFIED AND SAID THAT THIS WAS NORMAL.   PH...*AK",
        "vin": "YV1TS90D9X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767606,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS A DESIGN FLAW REGARDING THE AIR INTAKE TUBE.  IT PROTRUDES APPROXIMATELY 3\" BELOW THE SURFACE OF THE CAR.  I HAVE READ ACCOUNTS BY OTHER OWNERS WHO, WHILE PARKING THEIR CARS, GENTLY STRUCK THE CEMENT BLOCK WHILE PULLING INTO A PARKING SPOT.  THIS CAUSED THE AIR INTAKE TUBE TO BE FORCED UPWARDS, INTO THE SERPENTINE BELT, CAUSING IT TO JUMP OFF THE TRACK AND ULTIMATELY CAUSE MASSIVE ENGINE DAMAGE TOTALLING OVER $3,000.  I HAVE VERIFIED THAT NEW 2002 VOLVO S80'S FEATURE A COMPLETELY REDESIGNED AIR INTAKE TUBE, SIGNALING THE MANUFACTURER'S RECOGNITION OF THE DESIGN FLAW.  I CONTACTED MY DEALER, BUT HE WAS UNWILLING TO PERFORM THE SIMPLE OPERATION OF CUTTING THE PROTRUDING TUBE AND SECURING IT AS IT IS NOT A VOLVO-AUTHORIZED REPAIR.  I REALLY HOPE THAT NHTSA WILL FORCE VOLVO TO RECALL AFFECTED CARS AND MAKE A SIMPLE MODIFICATION THAT IS PREVENTATIVE AND COULD SAVE OWNERS THOUSANDS OF DOLLARS IN UNNECESARY REPARIS.  NLM",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/09/2002",
        "dateOfIncident": "08/28/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018235,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FRONT DRIVER'S SIDE WHEEL CAME OFF AS A RESULT OF BALL JOINT FAILURE.  CONSUMER  HAD VEHICLE FIXED UNDER PREVIOUS BALL JOINT RECALL 00V238000.  SINCE RECALL REPAIRS,  CONSUMER HAS HAD TO REPLACE FRONT BALL JOINTS TWICE.  *AK",
        "vin": "YV1TS90D7X1"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/03/2002",
        "dateOfIncident": "09/02/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8017817,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER FAILED EXCESSIVELY RESULTING IN INTERMITTENT WORKING OF  SUNROOF/ AIR CONDITIONING, AND POWER WINDOWS.   ALSO  VEHICLE STALLED  FREQUENTLY.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764181,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SUFFERS COMPLETE SHUTDOWN AT 30-40MPH. OCCURS 3-4 TIMES A WEEK AND HAS BEEN HAPPENING FOR LAST 3-4 MONTHS. DEALER CAN FIND NO PROBLEM AND HAS NEVER HEARD OF SUCH A PROBLEM HOWEVER I SEE SEVERAL REFERENCES TO THIS EXACT PROBLEM AT THIS DATABASE AND ALSO WWW.CARREVIEW.COM. ENGINE WILL RESTART WITH NO PROBLEM HOWEVER OBVIOUSLY WHEN ENGINE STOPS ALL POWER TO BRAKING AND STEERING SYSTEM IS LOST. ALWAYS HAPPENS WHEN COASTING, TYPICALLY DOWN LOW GRADE, AND TAKING A CORNER. I BELIEVE ISSUE IS TIED TO POWER STEERING, CLIMATE CONTROL AND LOW RPM (OR COMBO THEREOF) AS AT THIS SPEED THE TACHOMETER SWINGS WILDLY BETWEEN 400 AND 1200 RPM THOUGH SPEED IS STEADY (POSSIBLE EMISSION CONTROL ISSUE).*AK",
        "vin": "YV1TS90D0X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/13/2002",
        "dateOfIncident": "09/29/1999",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT REAR BUSHINGS FAILED CAUSING A RUBBING SOUND WHEN BACKING UP.  NLM",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2002",
        "dateOfIncident": "09/12/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED LOW OIL PRESSURE, THE DEALER REPLACED THE O-RING FROM THE OIL PUMP AND OIL PAN TOP. THE MOTOR MOUNT FAILED.  NLM",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2002",
        "dateOfIncident": "04/03/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED A NO START CONDITION DUE TO A FAULTY BATTERY, THE SENSOR IN THE VEHICLE IS ALSO FAULTY AND AS A RESULT, THE VEHICLE MAIN COMPUTER IS NOT WORKING AND IS CAUSING MESSAGES ON THE MESSAGE BOARD TO DISPLAY IN ERROR.  NLM",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/13/2002",
        "dateOfIncident": "04/21/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH HEADLIGHTS ARE INOPERATIVE, BRAKE LIGHT BULB FAILED.  NLM",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/13/2002",
        "dateOfIncident": "10/11/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DISC BRAKES WERE REPLACED, THE DEALER ALSO FOUND ABS BREAKOUT BOX AND POWER BRAKE BOOSTER INOPERATIVE.  NLM",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/27/2002",
        "dateOfIncident": "06/17/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012766,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HEARD  NOISE COMING FROM VEHICLE. SUDDENLY VEHICLE LURCHED TO  RIGHT, AND  HIT A PARKED CAR.  PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/17/2002",
        "dateOfIncident": "04/01/2000",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565833,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE CAUGHT FIRE AND BURNT DUE TO OVERHEATING.  THE CONSUMER RECEIVED RECALL (02V-096) NOTICE AFTER THE VEHICLE HAD BURNT. *YH",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/25/2002",
        "dateOfIncident": "01/18/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761186,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD SEVERAL PROBLEMS WITH THIS CAR.  FRAME, ENGINE, TRANSMISSION AND DRIVE SHAFT, STEERING, AND POWER LOCKS.  I HAVE HAD THE TRANSMISSION REPLACED TWICE.  I TOOK IT IN FOR SERVICE 6 TIMES BEFORE THEY REPAIRED THE PROBLEM.  I HAVE TAKEN THE CAR IN WITH 8 BULB POSITION LIGHT COMPLAINTS, 3 STEERING COMPLAINTS, 4 COMPLAINTS REGARDING THE CHECK ENGINE LIGHT COMING ON, AND THE MOST RECENT PROBLEM, THE ENGINE JUST QUITS WHILE DRIVING.  I HAVE BEEN WITHOUT THIS CAR FOR OVER 7 WEEKS THIS YEAR ALONE.  I AM STUCK BETWEEN THE DEALER AND THE MANUFACTURER.  VOLVO HAS RESPONDED TO MY COMPLAINT THAT I FILED WITH THE NEW MOTOR VEHICLE BOARD BY SAY, \"A VOLVO TECHNICAL SPECIALIST AND LAWRENCE VOLVO'S SERVICE TECH HAVE DRIVEN THE ESTES' 1999 VOLVO S80 IN EXCESS OF 500 MILES AND DETERMINED THAT NO NON-CONFORMITIES EXIST.  IN AN EFFORT TO DEMONSTRATE THAT WE VALUE THE ESTES' AS OUR CUSTOMERS, LAWRENCE VOLVO WILL CONTACT THEM TO MAKE A VERY FAIR OFFER TO TRADE THEM INTO A NEW VEHICLE.\"  I DON'T WANT ANOTHER VOLVO.  I WANT MINE FIXED OR VOLVO CAN ADJUST THE PURCHASE PRICE OR BUY IT BACK.  I RECENTLY RECEIVED A RECALL NOTICE ON THE CAR AND NOW FEAR EVEN MORE PROBLEMS.*AK",
        "vin": "YV1TS90D8X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/17/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008804,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WE FEEL VOLVO DESIGNED A DEFECTIVE STEERING U-JOINT AND SHOULD PAY FOR ALL TO BE REPLACED WHETHER THEY HAVE GONE BAD YET OR NOT.  *TS     *NLM       ****DIMSII IVOQ ENTRY POSTED AFTER 12-12-02 CUT OVER TO ARTEMIS****760815",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/11/2002",
        "dateOfIncident": "11/22/1999",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 760585,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THE FRONT CONTROL ARM BUSHINGS REPLACED THREE TIMES IN A LITTLE OVER TWO YEARS. ALSO THE FRONT BALL JOINTS TWICE (ONCE THROUGH A RECALL). MY TIRES NEED REPLACED FOR THE SECOND TIME AND THE DEALER IS NOT WILLING TO ACCEPT ANY BLAME FOR THE RAPID WEAR OF THE TIRES DESPITE THE CONTINUAL STEERING PROBLEMS. THEY DID REALIGN IT WHEN THEY REPLACED THE TRANSMISSION AND BUSHINGS IN DEC. OF 01. BUT DID NOT DO SO AGAIN WHEN THE BALL JOINTS WERE REPLACED IN MARCH 02. NOW THEY SAY MY ALIGNMENT IS POOR BECAUSE OF MY UNEVENLY WORN FRONT TIRES.",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2002",
        "dateOfIncident": "06/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758996,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDERHOOD WIRING HARNESS IS PROTECTED FROM HEAT/ELEMENTS BY A CONVOLUTED TUBING.  THE CONVOLUTED TUBING HAS BECOME VERY BRITTLE, TURNED TO POWDER AND FALLEN OFF THE HARNESS LEAVING THE HARNESS UNPROTECTED. VOLVO IS APPARENTLY USING A TUBING PLASTIC UNDERHOOD THAT CANNOT WITHSTAND HEAT! THE WIRING HARNESS ON MY CAR IS NOW LEFT UNPROTECTED AND WILL LIKELY SUFFER PREMATURE FAILURE SIMILAR TO EVERY OTHER MAJOR SYSTEM ON THIS CAR.",
        "vin": "YV1TS90DOX1"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "01/03/2002",
        "dateOfIncident": "08/11/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756356,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT WHEEL COLLAPSED AND FOLDED UNDER CAR RESTING ON THE OUTSIDE RIM. POLICE WERE SUMMONED BUT MADE NO REPORT BECAUSE NO OTHER PROPERTY DAMAGE OCCURRED AND THERE WAS NO EVIDENCE OF NEGLIGENCE. I DEMANDED THAT FARMERS INSURANCE HAVE THE CAR INSPECTED BY THEIR ENGINEERING FIRM. THE ENGINEER SAID DAMAGE WAS CONSISTENT WITH HITTING A POTHOLE AT 30-40 MPH AND THERE WAS NO EVIDENCE OF EXISTING METAL FATIGUE. THERE WAS NO POTHOLE AND SPEED WAS 12 MPH (WHILE SLOWING ON A STEEP DOWNHILL FOR A RED TRAFFIC LIGHT). THERE WAS NO \"IMPACT DAMAGE\" TO ALUMINUM TIRE RIM (AS YOU WOULD EXPECT IF YOU HIT AN OBJECT HARD ENOUGH TO CAUSE THE WHEEL TO FOLD). ENGINEER WAS \"UNABLE TO EXPLAIN THE CAUSE OF THE FAILURE.\" I CONTINUE TO PURSUE WITH FARMERS INSURANCE BECAUSE I BELIEVE A BALL-JOINT FAILURE CAUSED THE ACCIDENT. I SEE MANY COMPLAINTS ABOUT BALL JOINTS ON NHTSA'S SITE AND I SEE THAT THERE WAS A RECALL IN SEP 2000 FOR BALL JOINT REPLACEMENTS. I NEVER RECEIVED A LETTER ABOUT THE RECALL. EITHER MY CAR WAS NOT AFFECTED OR VOLVO FAILED TO DELIVER THE LETTER TO ME. I WOULD APPRECIATE ANY INFORMATION YOU HAVE THAT WOULD HELP TO CLARIFY THE CAUSE OF THE RIGHT-WHEEL FAILURE.",
        "vin": "YV1TS97DXX1"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,POWER TRAIN,EXTERIOR LIGHTING,VISIBILITY,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "12/14/2001",
        "dateOfIncident": "11/24/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000744,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55-60 MPH, BRAKES WERE PULSATING, AFTER APPLYING BRAKES AGAIN  NOTICED BRAKES WERE FADING. CONSUMER PULLED OVER AND NOTICED ROTORS WERE RED HOT. DEALER REPLACED FRONT ROTORS AND PADS.*AK  THE GAS TANK HAD A DEFECT THAT WOULD CAUSE A VACUUM LEAK. THE FRONT SUSPENSION MAKES A CRACKING NOISE WHEN TURNING DUE TO BALL JOINT FAILURE. THE GEAR SHIFTER SWITCH MAKES LOUD CLICKING NOISE. THE REAR PASSENGER DOOR HANDLE COULD NOT BE OPENED FROM OUTSIDE. AUTOMATIC TRANSMISSION HAD SLIPPAGE AND SHUDDER WHILE UP SHIFTING, CREATING A VEHICLE LOSS OF CONTROL. PASSENGER SIDE REAR SEAT BACKREST CUSHION MAKES NOISE DUE TO LOOSE CLIPS. THE FRONT PASSENGER WINDOW DEVELOPED A WIND NOISE DUE TO DEFECTIVE WINDOW SEALS. DUE TO DESIGN FAULT, THE UPPER TORQUE MOUNT BUSHING CRACKED. THE DRIVER SIDE FRONT HEADLIGHT LENS BROKE. THE CONSUMER IS ASKING FOR A FULL REFUND OF THE ACTUAL PRICE PAID FOR THE VEHICLE OR FOR IT TO BE REPLACED WITH A NEW EQUALLY EQUIPPED VEHICLE.  *YH",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2001",
        "dateOfIncident": "08/02/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753380,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "YV1TS90D8X1"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/20/2001",
        "dateOfIncident": "02/20/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 880812,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 30 MPH, HIT POTHOLE AND FRONT AXLE BROKE, BALL JOINT WERE OUT. *AK",
        "vin": "YV1TS97D0X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878186,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL SYSTEM MALFUNCTIONED, CAUSING  LIGHTING ON  DASH/ WINDSHIELD WIPERS AND  POWER WINDOWS TO BE INOPERABLE.*AK  THE VEHICLE HAD BENT BRAKE CALIPERS FAILURE, HEAD LIGHT FAILURE, BROKEN MIRROR SWITCH.  THE DOOR REMOTE FAILED. THE CONSUMER WANTS THE DEALER TO TAKE THE VEHICLE BACK AT NO COST.  *YH",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/10/2001",
        "dateOfIncident": "01/03/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 739184,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "YV1TS90D9X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/03/2001",
        "dateOfIncident": "09/05/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877354,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING CORNER IN PARKING LOT HEARD A NOISE LIKE VEHICLE WAS BELLYING. VEHICLE WAS NOT ABLE TO MOVE. HAD  VEHICLE TOWED TO DEALERSHIP. WAS INFORMED BY MECHANIC THAT BALL JOINTS ON  DRIVER'S SIDE  BROKE AND NEEDED REPLACING.  *AK",
        "vin": "FILL IN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2000",
        "dateOfIncident": "09/13/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 875509,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WIRING HARNESS WAS CRACKING AND FALLING APART, LEAVING  WIRES UNPROTECTED AGAINST  ENGINE AND RADITOR.   DEALERSHIP REPLACED ALL OF THE PLASTIC WIRING HARNESS PARTS.  *AK   *SLC",
        "vin": "YV1TS90D6X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/09/2000",
        "dateOfIncident": "09/20/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874761,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL 00V238000/MANUFACTURER'S RECALL 00 BALL JOINT, PARTS NOT AVAILABLE , NO DATE GIVEN.  *AK",
        "vin": "YV1TS90DIX1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 556544,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE SYSTEM IS EXPERIENCING CONTINUED FADING WHEN APPLYING THE BRAKE PEDAL, DEALERSHIP STATES THAT IT IS A DESIGN PROBLEM.   *MJS",
        "vin": "YV1TS90D3X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/17/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 556229,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIRES WERE BADLY WORN AS A RESULT OF THE FAULTY BALL JOINTS WHICH WERE RECALLED AND REPAIRED (00V-238), CONSUMER PURCHASED NEW TIRES AND REQUEST REIMBURSEMENT.  NLM",
        "vin": "YV1TS97D8X1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/28/2000",
        "dateOfIncident": "08/21/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732762,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL WAS SLOWLY GOING LOWER BEFORE BRAKING OCCURRED.  ORIGINAL PROBLEM WAS \"FIXED\" BY SERVICE ON 8/22/00, BUT SERVICE MANAGER STATED CAR NEEDED A NEW MASTER BRAKE CYLINDER, WHICH WAS SUPPOSEDLY ORDERED.  PROBLEM BEGAN TO RE-OCCUR ON 9/22/00, AND CAR WAS DELIVERED TO SERVICE ON 9/26/00.  AS OF NOW, IT HAS BEEN THERE 3 DAYS TO INSTALL A NEW MASTER BRAKE CYLINDER, ORIGINALLY DESCRIBED AS A 1-HOUR PROCEDURE.  SUPPOSEDLY THE REPLACEMENT INSTALLED YESTERDAY, ALSO HAD THE SAME PROBLEM.  AS OF NOW (AFTER 5 P.M., 9/28/00) THE SERVICE DEPARTMENT IS UNABLE TO DEFINITELY STATE THE PROBLEM HAS BEEN FIXED - - AND THERE MAY BE A SERIOUS PROBLEM WITH VOLVO MASTER BRAKE CYLINDERS (AND THEIR AVAILABILITY).",
        "vin": "YV1TS97D9X1"
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/11/2000",
        "dateOfIncident": "08/11/2000",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731015,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER ADVISED CAR HAD A DEFECTIVE STEERING RACK, WHICH WAS REPLACED ALONG WITH ASSOCIATED \"O\" RINGS.  ELEVEN DAYS AFTER WARRANTY WORK WAS COMPLETED, OWNER WAS DRIVING VEHICLE WHEN THE CAR CAUGHT ON FIRE.  FIRE WAS ATTRIBUTED TO A \"CRIMPED\" O-RING.  DEALER REPLACED THE O-RING AND HAS BEEN TEST DRIVING VEHICLE SINCE THEN.  THE O-RING HAS CRIMPED AGAIN RECREATING THE SAME SCENARIO.  OWNER IS NOW IN THE MIDDLE BETWEEN DEALER AND VOLVO POINTING FINGERS AT EACH OTHER.",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2000",
        "dateOfIncident": "08/13/2000",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730944,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED. FIRE STARTED UNDER HOOD. APPEARS TO BE AN ELECTRICAL SHORT. CAR WAS CONSIDERED A \"TOTAL\" BY THE INSURANCE CO.",
        "vin": "YV1TS90D5X1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/28/2000",
        "dateOfIncident": null,
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 868886,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING INTO A PARKING SPACE NOTICED VEHICLE WAS ON FIRE. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2000",
        "dateOfIncident": "08/01/1999",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 868636,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  VEHICLE TURNS LEFT  STEERING WHEEL BINDS UP.   STEERING WHEEL DOES NOT ALLOW  VEHICLE TO MAKE A FULL LEFT TURN.  WHILE ATTEMPTING TO TURN LEFT,  VEHICLE WILL GO HALF WAY, AND  CONSUMER IS FORCED TO REVERSE AND MOVE STRAIGHT.   DEALERSHIP IS UNABLE TO REPRODUCE PROBLEM, AND ISSUE A REMEDY.  ALSO, CONSUMER ATTEMPTED TO FILL THE GAS TANK W/ FUEL WHEN IT WAS 3/4 OF A WAY EMPTY.  GAS NOZZLE WOULD NOT PUMP THE GAS  AS IF THE TANK WAS FULL. SO  CONSUMER PULLED THE FUEL PUMP OUT, AND FUEL STARTED TO SQUIRT OUT ON CONSUMER, AND A PUDDLE ON  THE FLOOR. *AK",
        "vin": "YV1TS0D0X10"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2000",
        "dateOfIncident": "08/19/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 728934,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ATTEMPTING TO FILL THE FUEL TANK (3/4 EMPTY, 112 DEGREES F), THE TANK WOULD NOT ACCEPT FUEL.  I REMOVED THE NOZZLE TO SEE IF THE FILLER WAS OBSTRUCTED, AND A GEYSER OF PRESSURIZED GASOLINE WAS EJECTED FROM THE FILLER NECK LASTING ABOUT FIVE SECONDS, AND DRENCHING MY CLOTHING AND THE GROUND IN A PUDDLE OF GASOLINE.  FORTUNATELY THERE WERE NO IGNITION SOURCES PRESENT .",
        "vin": "YV1TS90D0X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/09/2000",
        "dateOfIncident": "08/06/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 727347,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "I APPROACHED A PARKING SPACE AT APPROXIMATELY 5 MPH, WITH MY FOOT ON THE BRAKE PEDAL, HOWEVER, SUDDENLY IT ACCELERATED IN SPITE OF MY FOOT PRESSING VERY HARD ON THE BRAKE PEDAL.  I TRIED TO MANEUVER THE CAR WITH MY FOOT STILL ON THE BRAKE TO AVOID HITTING OTHER PARKED CARS AND FINALLY HIT BUSHES AND A SMALL TREE WHICH UPLIFTED THE FRONT WHEELS OFF THE GROUND AND STOPPED THE CAR.  AT THAT POINT, THE IGNITION WAS TURNED OFF.  THERE WERE HEAVY TRACK MARKS ON THE HARD SURFACE AS WELL AS ON THE GRASS LAWN, SUGGESTING THAT THE REAR WHEELS WERE LOCKED UP.  I ESTIMATED $6,000 DAMAGE TO MY CAR AND PARKING AREA PROPERTY.",
        "vin": "YV1TS90D1X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/08/2000",
        "dateOfIncident": "06/16/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 867242,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED A PROBLEM WITH BALL JOINT FAILURE, CAUSING A DISCONNECTION DUE TO A FAULTY PART.  MANUFACTURER NOTIFIED, AND INFORMED CONSUMER THAT THEY WERE AWARE OF THIS PROBLEM. COULD NHTSA SHARE SOME LIGHT ON THIS MATTER. PLEASE FEEL FREE TO PROVIDE ANY FURTHER DETAILS.  *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/01/2000",
        "dateOfIncident": "07/18/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 726344,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A NOISE IN THE FRONT SIDE LEFT WHICH TURNED OUT TO BE SOMETHING RELATED TO THE SUB-FRAME. HOWEVER THERE IS STILL A RATTLE IN THE FRONT END WHICH I HAVE BEEN TOLD THAT ALL THE CARS HAVE. HOWEVER THE S70 LOANER CARS THEY PROVIDE DO NOT HAVE IT. THE RADIO AM PROBLEM IS FUSTRATING, AND THIS NEW PROBLEM WITH THE DOOR LOCKS JUST ADDS ICEING TO THE CAKE. I HAVE BEEN TOLD THE PART FOR THE RADIO IS NOT AVAILABLE, SO THEY WILL TRY AND MAKE IT WORK SOMEHOW. I AM JUST WAITNG FOR THE NEXT PROBLEM. THIS IS MY FIRST AND LAST VOLVO.  *AK",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/27/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 866124,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WHEEL FELL OFF THE AXLE  DUE TO GREASE SEAL, AND ALLOWED WATER TO GET INTO THE BEARING AND CORRODED IT.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/11/2000",
        "dateOfIncident": "07/10/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 725262,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DEVELOPED A PRONOUNCED FRONT-END \"SHIMMY\"  NOT UNLIKE WOULD BE FELT WITH AN UNBALANCED WHEEL. DEALERSHIP CONFIRMED THAT THE TIE ROD WAS ABOUT TO FAILED.",
        "vin": "YV1TS90D8X1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/26/2000",
        "dateOfIncident": "06/21/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 724593,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DEPLOYED WHILE CAR WAS IN \"PARK\"  AND WITH NO IMPACT.  *AK",
        "vin": "YV1TS97DXX1"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/10/2000",
        "dateOfIncident": "10/13/1999",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721272,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "IN OCTOBER 1999, I BEGAN NOTICING A CLUNKING NOISE EMINATING FROM BENEATH THE DRIVER'S-SIDE FOOTWELL, WHEN THE VEHICLE IS PLACED IN REVERSE, OCCASIONALLY WHEN ACCELERATING, BRAKING AND WHEN THE VEHICLE IS DRIVEN OVER ROUGHER ROAD SURFACES.  THE CLUNKING NOISE IS ALSO HEARD WHEN APPROACHING AN INCLINE AND CRESTING A HILL AS WELL.  I REPORTED THIS CLUNKING NOISE PROBLEM TO RAMSEY VOLVO (SELLING/SERVICING DEALER) ON 10/13/1999.  THE DEALER REPLACED THE LEFT-REAR SUBFRAME MOUNT AND SECURED IT USING JB WELD, PER VOLVO SERVICE BULLETIN.  ALMOST IMMEDIATELY AFTER THE REPAIR, THE CLUNKING NOISE RETURNED.  ON 10/18/1999, RAMSEY VOLVO AGAIN REPLACED THE LEFT-REAR SUBFRAME BUSHING , THIS TIME USING A DIFFERENT ADHESIVE, AS RECOMMENDED BY VOLVO CARS OF NORTH AMERICA.  THE DEALER ALSO REPLACED A DEFECTIVE SWAY BAR END LINK.  THE CLUNKING NOISE RETURNED A WEEK LATER.  ON 10/26/1999, I ALERTED VOLVO CARS OF NORTH AMERICA OF THIS RECURRING PROBLEM AND REQUESTED THAT THEY ASSIST IN THE THE REPAIR OF THIS VEHICLE.  MY REQUEST FOR ASSISTANCE WENT UNANSWERED FOR SEVERAL MONTHS.  ON FEBRUARY 3, 2000 VOLVO CARS OF NORTH AMERICA RECOMMENDED I AGAIN BRING MY VEHICLE TO RAMSEY VOLVO FOR REPAIR OF THE CLUNKING NOISE.  I BROUGHT THE VEHICLE IN ON MARCH 16, 2000, THE DEALER CLAIMS THAT THE CLUNKING NOISE HEARD WHEN PLACING THE VEHICLE IN REVERSE, WAS CAUSED BY THE FRONT BRAKE CALIPERS AND IS CONSIDERED TO BE \"NORMAL\" AND DID NOT ANY OTHER CLUNKING NOISES WHILE DRIVING THE VEHICLE.  I AGAIN CONTACTED VOLVO CARS AND REQUESTED THE VEHICLE REPAIRED OR REPLACED IF THE NOISE PROBLEM CANNOT BE ELIMINATED.  ON MARCH 30, 2000, THE VEHICLE WAS ROAD-TESTED BY THE VOLVO CARS OF NORTH AMERICA FACTORY REPRESENTATIVE.  VOLVO CARS OF NORTH AMERICA CONCLUDED THAT THE CLUNKING NOISE HEARD WHEN PLACING THE VEHICLE IN REVERSE WAS A NORMAL CHARACTERISTIC OF THE S80.  HOWEVER, THE VOLVO REPRESETATIVE CLAIMS HE DID NOT HEAR ANY CLUNKING NOISE FROM THE FRONT-END OF THE VEHICLE WHEN DRIVING. THIS CONCLUSION IS FALSE.",
        "vin": "YV1TS97D1X1"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/04/2000",
        "dateOfIncident": "11/22/1999",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 551710,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "SRS WARNING LIGHT CAME ON DUE TO FAULTY SRS CRASH SENSOR FAILURE. YH",
        "vin": "YV1TS97D8X1"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2000",
        "dateOfIncident": "02/07/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 856843,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BETWEEN 55-60 MPH DRIVER WENT TO PASS VEHICLE WHEN ACCELERATOR PEDAL BECAME STUCK AND WENT TO FLOOR, DRIVER TURNED OFF IGNITON  AND THEN PEDAL CAME BACK UP.DEALER COULD NOT REPRODUCE DEFECT.  *AK",
        "vin": "YV1TS97D2X1"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/10/2000",
        "dateOfIncident": "12/21/1999",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 718578,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MODEL VOLVO HAS A WELL DOCUMENTED SUBFRAME BUSHING PROBLEM.  THE FRONT SUBFRAME BUSHINGS WERE REPLACED AT NILS SEFELDT VOLVO IN DALLAS.  THE MECHANIC THAT REPLACED THESE BUSHINGS CUT THE SUBFRAME.  BUSHINGS WERE INSTALLED, THE CAR WAS BADLY OUT OF ALIGNMENT, WAS REALIGNED AT AUTOBAHN VOLVO IN FORT WORTH - A FEW WEEKS LATER - THE VEHICLE WAS BACK AT AUTOBAHN VOLVO FOR MAINTENANCE AND BRAKE NOISE PROBLEMS WHEN IT WAS DISCOVERED THAT THE SUBFRAME WAS CUT BY THE MECHANIC AT NILS SEFELDT - VOLVO ORDERED THE SUBFRAME REPLACED.  AT THE VERY LEAST ANY OTHER S80 THAT UNDERWENT A SUBFRAME BUSHING REPLACEMENT AT NILS SEFELDT, ESPECIALLY BY THE MECHANIC THAT \"REPAIRED\" MINE - SHOULD BE INVESTIGATED.  THE STEERING WAS \"SQUIRRELLY\" AND I SUSTAINED VERY MINIMAL PROPERTY DAMAGE WHEN CONTACT WAS MADE WITH A MINIVAN IN A HIGHWAY DRIVING INCIDENT PRIOR TO THE REPLACEMENT OF THE SUBFRAME.  IN ADDITION, ON ABOUT A DOZEN OCCASIONS, WHEN I'M TURNING THE CAR OFF, THE MESSAGE \"SRS AIRBAG SERVICE URGENT\" APPEARS IN THE MESSAGE DISPLAY.  THE MESSAGE DOES NOT STORE AND THE COMPUTER DOES NOT RETAIN IT.  NEITHER NILS SEFELDT OR AUTOBAHN HAVE BEEN ABLE TO DUPLICATE THE PROBLEM OR CORRECT IT.  I'M CONCERNED THAT THE AIRBAG SYSTEM - VERY COMPLEX ON THIS PARTICULAR CAR - FRONT, SIDE AND SIDE CURTAINS MAY DEPLOY.  I HAVE REQUESTED ASSISTANCE FROM VOLVO TO REPLACE THE VEHICLE, NOT ENGAGE IN A BUYBACK AT THIS TIME, BUT VOLVO REFUSES TO CONSIDER THAT AS AN OPTION.  IT TOOK 16 MONTHS TO CORRECT A NUISANCE PROBLEM WITH THE BRAKES AS WELL.  *AK",
        "vin": "YV1TS97D3X1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/04/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 558408,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MICHELIN TIRE (P336/50R17) EXPERIENCED A BLOWOUT, THE CONSUMER OBSERVED A 3\" CUT IN THE SIDEWALL AFTER AVOIDING A POT HOLE, THREE DAYS LATER WHILE DRIVING A LOANER WITH MICHELIN TIRES, ANOTHER BLOWOUT OCCURRED WHEN THE CONSUMER AVOIDED HITTIN A BALL THAT ROLLED INTO THE STREET.   *SLC",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/16/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 549987,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT WAS IMPROPERLY ADJUSTED CAUSING DISCOMFORT AND SAFETY PROBLEM.  YH",
        "vin": "YVITS97D9X1"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/14/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 549961,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "VOLVO",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CONVERTIBLE TOP IS UP CONSUMERS VISIBILITY IS IMPAIRED DUE TO DESIGN CAUSING SEVERE BLIND SPOTS.  *MJS",
        "vin": "YVINC56D3XJ"
    },
    {
        "components": "VISIBILITY,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/22/1999",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 853218,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "S80",
                "productYear": "1999",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER WINDOWS WOULD ACT SPORADICALLY, GOING UP OR DOWN WHENEVER THE BUTTON IS USED. SOME TIME WOULD PARTIALLY GO UP OR DOWN THEIR ITS OWN. TAKEN VEHICLE TO DEALERSHIP TWICE. THE 2ND TIME THE MECHANIC GOT INSIDE OF VEHICLE & CLOSED DOOR,  AIR BAGS DEPLOYED. HAD NO INDICATION OF WHY. DEALERSHIP HAVING VOLVO REPRESENTATIVE TO CHECK VEHICLE. *AK",
        "vin": "YV1TX97D4X1"
    }
]