[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/17/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005938,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "EACH TIME I FILL THE GAS TANK THERE IS A STRONG SMELL OF LEAKING GAS.  NOT CLEARLY IDENTIFIED THE SOURCE BUT FEEL THIS IS A SIGNIFICANT SAFETY RISK.",
        "vin": "WAUEH24B6YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2016",
        "dateOfIncident": "06/10/2016",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874383,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 AUDI A6. THE CONTACT NOTICED STRONG FUMES ENTERING THE VENTS, WHICH AFFECTED THE CONTACT'S BREATHING. THE CONTACT WAS NOT ABLE TO USE THE HEATER OR AIR CONDITIONER. A WEEK LATER, WHILE DRIVING, A FIRE ERUPTED NEAR THE DASHBOARD AND SMOKE CONSUMED THE INSIDE OF THE VEHICLE. THE CONTACT WAS ABLE TO PULL THE VEHICLE OVER TO THE SIDE OF THE ROAD AND A FIRE INSPECTOR EXTINGUISHED THE FLAMES. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 06V198000 (ELECTRICAL SYSTEM), BUT THE CONTACT DID NOT RECEIVE A NOTIFICATION. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS TOWED AND PARKED. THE FAILURE MILEAGE WAS NOT AVAILABLE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "WAUED24B7YN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2016",
        "dateOfIncident": "03/29/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852911,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME THIS CAR HAD ANY PROBLEMS WITH ANYTHING LEAKING WAS A COUPLE DAYS AGO WHEN WE WOKE UP IN MIDDLE OF THE NIGHT TO HOUSE AND GARAGE SMELLING LIKE GAS. ON DRIVER'S SIDE REAR BY PASSENGER DOOR THERE WAS A SMALL LEAK LOOKED LIKE OIL BUT SMELLED OF GAS AND UNDERNEATH CAR YOU CAN SEE WEAR A SMALL CRACK IS AT IN FUEL SYSTEM. I SEE MANY RECALLS FOR SAME THING FOR DIFFERENT  YEARS AND COMPLAINTS FILED FOR THIS SAME PROBLEM AND YEAR. NO RECALL NOTICES WAS EVER RECEIVED BY MYSELF OR PREVIOUS TWO OWNERS WHO WAS FRIENDS OR IT WOULD HAVE BEEN FIXED. I AM UPSET BECAUSE NOW IT WON'T BE FIXED UNDER RECALL BECAUSE IT'S BEEN SO LONG HOWEVER THERE WAS NO CLOSE DATE ON REPORTS IT SHOWS SEVERAL THOUSAND CARS NEVER GOT THE REPAIR AND WAS NOT NOTIFIED. THIS IS A HUGE SAFETY ISSUE THAT NOT ONLY CAN START CAR ON FIRE BUT HOUSE ON FIRE IF PARKED IN GARAGE. NOW I AM SUPPOSE TO PAY FOR THE COST ON SOMETHING THAT WAS NOT PUT TOGETHER CORRECTLY AND IS A SAFETY HAZZARD BECAUSE I WAS NOT WARNED ABOUT IT BY MAIL OR WHEN CAR WAS SERVICED AND NEVER HAD TROUBLE TILL NOW AND THERE ARE TONS OF CUSTOMERS YOU ARE NOT HELPING WITH SAME PROBLEM YEAR MAKE AND MODEL OF CAR. IF THIS RESULTS IN DEATH THAN IT WILL BECOME A MORE SERIOUS PROBLEM ON YOUR HAND FOR NOT FIXING A RECALL THAT HAS BEEN KNOWN TO BE PROBLEMS ON SEVERAL YEARS OF AUDI'S AND NOT ALL AUDI OWNERS WAS REACH OR REPAIRS DONE AND NOW WHEN WE ARE FINDING OUT WE ARE BEING TURNED AWAY. IF THIS WAS NOT SOMETHING HAZARDOUS OR LIFE THREATENING THAT'S ONE THING BUT SOMETHING SO DANGEROUS THAT CAN TAKE A LIFE YOU SHOULD MAKE SURE EVERY RECALL THAT IS SAFETY  RELATED AND HAZARDOUS FIX REGARDLESS OF WHEN NOTICE IF FOUND. I AM EXPECTING THE RECALLS FOR ALL FUEL RELATED PROBLEMS ON ALL AUDI BE FIXED WHEN CUSTOMERS CALL TO INQUIRE AND NOT BE TURNED AWAY AFTER WE ARE SENT TO DEALER TO HAVE IT LOOKED AT.",
        "vin": "WAUED24BXYN"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/12/2015",
        "dateOfIncident": "07/01/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781459,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST THE CAR RAN HOT NO TEMP HAVE CAME ON HAD TO REPLACE MOTOR .....THE COOLING FAN BROKE MADE OF PLASTIC AND CUT MY SERPENTINE BELT INTO  ......THEN THE CAR FLOODED AND RUINED THE COMFORT CONTROL MODULE  HAD TO REPLACE THIS   NOW THE FRONT AXEL IS BROKE AND THE BOOTS FELL APART AND THE BALL JOINTS ARE NO GOOD......",
        "vin": "WAUBH64B11N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2015",
        "dateOfIncident": "01/07/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10670841,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO!    TODAY I WAS AT THE SAMS CLUB GAS STATION TO FILL UP MY VEHICLE, 2000 AUDI A6 WITH THE 4.2 ENGINE.  WHEN I FINISHED, I WENT OVER TO THE DRIVER SIDE, WHERE IVE SEEN A HUGE AMOUNT OF GAS ON THE GROUND.   THE FUEL WAS LEAKING REALLY BAD FROM MY CAR. THE SAM'S CLUB EVEN CALLED THE FIRED DEPARTMENT AND THE POLICE THERE TOO.   IT LEAKED OUT A LOT COUPLE GALLONS FROM MY VEHICLE.   THANKS GOD THE GAS STATION HAD A SMALL INCLINE SO I COULD NOTICE IT RIGHT BEFORE I WOULD DRIVE AWAY.    JUST THINKING THAT I WOULD DRIVE AWAY AND SOMETHING SERIOUS WOULD HAPPEN IT SCARES ME.     AS I UNDERSTAND A LOT OF AUDIS ARE RECALLED BECAUSE OF THIS ISSUE. MINE IS NOT UNDER THE RECALL.   WHAT CAN I DO TO GET MINE UNDER THE RECALL TOO?    PLEASE HELP ME.  [XXX]      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUZL64B6YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/20/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573837,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING GAS TANK, GAS BEGAN LEAKING AS A STEADY STREAM FROM LEFT FRONT SIDE OF GAS TANK, NEAR THE REAR DRIVER'S WHEEL WELL. OWNER CONTACTED AUDI DEALERSHIP AND AUDI OF AMERICA. OWNER PAID FOR DEALER INSPECTION TO DIAGNOSE LEAKING GAS ISSUE. DEALER STATED THE TANK WAS LEAKING AND NEEDED TO BE REPLACED. AUDI OF AMERICA CONTACTED OWNER ON 3/20/2014 AND STATED THE SERVICE MANAGER OF AUDI OF ANN ARBOR, MI HAD DECIDED THEY WOULD NOT COVER THE REPAIR DUE TO VEHICLE \"MILEAGE AND AGE.\" AUDI OF AMERICA STATED SINCE VEHICLE WAS OUTSIDE OF RECALL RANGE (2001-2005 MY), THEY WOULD NOT ASSIST WITH REPAIRS.     INDEPENDENT OWNER RESEARCH SHOWS MULTIPLE LEAKING GAS TANK ISSUES (BROKEN ROLLOVER VALVE NIPPLE) WITH THIS VEHICLE, AND MATCHING PART NUMBERS BETWEEN 2001-2005 MY GAS TANKS AND 2000 MY GAS TANK.   *TR",
        "vin": "WAUED24B3YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2013",
        "dateOfIncident": "03/01/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536289,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST INCIDENT MARCH 2006 LEAKY GAS TANK HAD TO BE REPLACED,  COST TO US $2,249.27, AUDI DENIED RESPONSIBILITY. REQUESTED AUDI TO REPORT THIS ISSUE TO AUTHORITIES. SECOND INCIDENT, 7/30/13 (MILEAGE 163,016):  VERY STRONG GASOLINE ODOR. THE MECHANIC REMOVED REAR SEAT AND FOUND FUEL STAINING ALL AROUND THE SENDING UNIT.  FUEL TANK MUST AGAIN BE REPLACED.  THIS WILL BE OUR THIRD TANK COUNTING THE ORIGINAL ONE INSTALLED AT THE FACTORY. IN 2008 AUDI ISSUED SAFETY RECALL CIRCULAR  CODE:  2OL8/JY REVISED IN JANUARY 2009.  MY FIRST FUEL TANK FAILURE OCCURRED 2 YEARS BEFORE THE RECALL.  THE AUDI RECALL COVERS MODEL YEARS 2001 THROUGH 2005.  MY CAR IS 2000 WITH THE SAME DEFECT AS IN LATER MODELS.  2000 MODEL SHOULD HAVE BEEN INCLUDED IN THE RECALL.  I FIND IT INCREDIBLE THAT AUDI DID NOT KNOW THAT THE IDENTICAL SAFETY DEFECT WAS IN THE 2000 MODEL. THE 2006 FUEL TANK AND PARTS WERE PURCHASED NEW FROM AUDI AND SHOULD BE THE NEWER DESIGN FUEL TANK (IF THERE HAD BEEN ANY REDESIGN BY THEN).  ALSO, AS A 2006 FUEL TANK, REPAIRS SHOULD BE COVERED BY THE 2008 RECALL.  AUDI DOES NOT APPEAR TO HAVE PUBLICLY RECOGNIZED ITS DESIGN FAILURE, AND WAS NOT EXPLICIT ABOUT THE PROBLEM DETAILS AND THE FIX FOR THE FUEL TANK SAFETY PROBLEM UNTIL THE 2008 RECALL.  USING A COPY OF THE 2008 RECALL NOTICE I TELEPHONED CUSTOMER RELATIONS AT AUDI OF AMERICA IN ROCHESTER HILLS, MI  (1-800-253-2834).  AUDI ASSIGNED ME A CASE NO.  #130535300, AND TOLD ME TO TAKE THE CAR TO AN AUDI DEALER.  SINCE THE CAR WAS UNSAFE TO DRIVE IT WAS TOWED TO A DEALER ON 8/9/13.  I HAVE SPENT $871.25 AT MY MECHANIC'S TO IDENTIFY THE DEFECT AND TO TOW THE CAR TO AUDI.  ON 8/19/13 THE AUDI DEALER CALLED TO STATE THAT AUDI WAS NOT RESPONSIBLE FOR THE REPAIR AND REPLACEMENT OF THE FUEL TANK.  I AM THE ORIGINAL OWNER WITH SAME ADDRESS AND CAR REGISTRATION, YET NEVER RECEIVED A RECALL NOTICE.  WE HAVE BEEN DRIVING A MOLOTOV COCKTAIL.",
        "vin": "WAULH64BXYN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/18/2013",
        "dateOfIncident": "02/22/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503498,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST MONTH I FILLED UP MY TANK & AFTER DOING SO HAD A VERY STRONG SMELL OF GAS IN THE CABIN. I TOOK IT TO AN INDEPENDENT MECHANIC & HE TOLD ME THAT I HAVE A BROKEN ROLLOVER VALVE. TO REPLACE THE TANK COSTS $2500. THIS IS POTENTIALLY A VERY SERIOUS ISSUE GIVEN LEAKING GAS!  AFTER RESEARCH I FOUND THERE IS A RECALL TO REINFORCE THE VALVE WITH EPOXY. UNFORTUNATELY THE RECALL IS FOR 2001-2004 MODELS & MINE IS A 2000. THE ISSUE ON MY 2000 IS THE EXACT SAME TANK/VALVE. I NEXT CONTACTED AUDI CUSTOMER SERVICE TO GET A CASE # HOPING THEY'D TAKE RESPONSIBILITY. THEY CREATED THE CASE BUT TOLD ME UNTIL THE ISSUE IS VERIFIED BY AN AUDI DEALER THEY CAN'T DO ANYTHING. DOING SO WOULD COME WITH NO GUARANTEES. I CALLED THE DEALER & THEY SAID THE COST OF A DIAGNOSTIC IS $109.  SO I TOOK IT TO THE DEALER FOR A DIAGNOSTIC TO VALIDATE THE INDEPENDENT MECHANIC?S ANALYSIS. THE DEALERSHIP CALLED TODAY & CONFIRMED THE ISSUE FROM THE INDEPENDENT. COST TO PATCH IS $452+TAX (RATHER THAN COMPLETELY REPLACE THE TANK FOR $2500). THIS IS THE SAME RESOLUTION AS THE RECALL WHICH IS TO EPOXY THE VALVE. THEY TOLD ME TO EXPECT A CALL FROM AOA AS THEY JUST GOT OFF THE PHONE WITH THEM & AOA WOULD NOT BE PAYING FOR THE FIX (WHICH AGAIN IS IDENTICAL TO THE RECALL RESOLUTION). AOA CALLED & SAID THE MAIN REASON FOR NOT PAYING WAS THAT THE CAR HAS 169K MILES & A SECONDARY REASON THAT I HAD STOPPED TAKING IT TO THE AUDI DEALERSHIP. WHY SHOULD MILEAGE MATTER ON A KNOWN SAFETY ISSUE?  IF MY CAR WAS A 2001 WITH 300K MILES WOULD THEY NOT HAVE SENT THE RECALL NOTICE? REGARDLESS OF MILEAGE THIS IS A KNOWN DESIGN FAULT THAT AUDI HAS ACKNOWLEDGED. MY 2000 HAS THE EXACT SAME ISSUE TO A T THAT THEY ARE ADDRESSING WITH THE 2001-2004 MODELS.  I BELIEVE THAT SINCE AUDI HAS ACKNOWLEDGED THIS, THAT IT IS A MAJOR SAFETY ISSUE & IT?S EXACTLY THE SAME ISSUE WITH THE 2001-2004 MODELS THAT THEY SHOULD PAY FOR THE REPAIR.  *TR",
        "vin": "WAUED24B2YN"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2013",
        "dateOfIncident": "02/22/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500719,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MOVING THE STEERING COLUMN UP OR DOWN SMOKE COMES OUT OF THE STEERING COLUMN AND GET A BURNING SMELL ON THE PASSENGER SIDE.  *TR",
        "vin": "WAUZL64B0YN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2012",
        "dateOfIncident": "10/17/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486258,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG FUEL FUMES ARE PRESENT INSIDE THE CAR'S CABIN WHILE DRIVING OR STATIONARY WITH THE ENGINE BOTH ON AND OFF.  UPON INSPECTION BY AN AUTOMOTIVE TECH, FUEL IS DRIPPING FROM THE FUEL TANK AREA ON THE DRIVER'S SIDE UNDER THE REAR SEATS.  FUEL WILL CONTINUE TO DRIP OUT UNTIL THE FUEL TANK IS AT ABOUT 1/2 FULL.  THE REAR SEAT BENCH WAS REMOVED TO GAIN ACCESS TO PART OF THE FUEL TANK AND THERE IS VISIBLE WET SPOTS FROM FUEL SPILLING OUT THE TANK.  THE TECH FOUND A HOSE THAT CONNECTS TO A PLASTIC VALVE ON THE FUEL TANK.  THE PLASTIC VALVE IS CRACKED AND IS LEAKING FUEL.  THERE IS A RECALL FROM THE MANUFACTURER TO REPAIR THIS PROBLEM FOR THE VEHICLES MADE IN 2001 AND NEWER BUT NOT 2000.  THE 2000 A6 IS IDENTICAL TO THE 2001 A6, WHY ISN'T A 2000 COVERED IN THIS RECALL?  PLEASE AMEND THE RECALL TO COVER 2000 A6 CARS.  *TR",
        "vin": "WAUED24B7YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2012",
        "dateOfIncident": "10/01/2012",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478698,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE VENTS OF THE VEHICLE STARTED TO SMOKE, IT THEN IGNITED CAUSING A VEHICLE FIRE. THE DRIVERS SIDE COMPLETELY ENGULFED IN FLAMES.  *TR",
        "vin": "WAULH54B4YN"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2012",
        "dateOfIncident": "09/01/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473267,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HI AUDI REFUSES TO FIX THIS PROBLEM BECAUSE MY CAR IS 2000 MODEL , BUT IT HAS 6 IN THE VIN AS FOR RECALL REQUIREMENTS IN RECALL YUP GUYS ISSUED , I THINK 2000 MODELS SHOULD BE INCLUDED ALSO AS I HAVE SAME PROBLEM AS FOR RECALL FOR 2001 MODELS ALSO AS SAID BEFORE HAVE THAT 6 IN MY VIN NUMBER . CAN YOU PLEASE GUYS REVIEW THIS PROBLEM , AS 2000 MODELS SHOULD BE COVERED .  IF THAT MODEL HAS A 6 IN ITS DESIGNATION, YOU MIGHT WANT TO HAVE A LOOK AT ITS VALVE... NIPPLES, BECAUSE THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION (NHTSA) SAYS THERE IS SOMETHING WRONG WITH THEM.    SILLY JOKES ASIDE, THE SAFETY ORGANIZATION HAS JUST RELEASED A RECALL NOTICE FOR CERTAIN MODEL YEAR 2001-2004 AUDI A6, 2002-2003 MODEL YEAR S6 AND 2003 MODEL YEAR RS6 VEHICLES, ALL EQUIPPED WITH 4.2-LITER V8 ENGINES AND MANUFACTURED FROM JUNE 19TH, 2001, UNTIL JUNE 8TH, 2004.    A TOTAL OF 5,992 AUDIS BEARING THE NUMBER 6 IN THEIR TITLE ARE AFFECTED AND WILL BE RECALLED IN THE STATES OVER A POTENTIAL PROBLEM DESCRIBED AS THE ROLLOVER VALVE NIPPLE.    ?THE AGING OF THE PLASTIC MATERIAL IN THE FUEL TANK ROLLOVER VALVE COMBINED WITH BENDING STRESS FROM THE ALUMINUM VENTILATION LINE TO THE ROLLOVER VALVE NIPPLE MAY LEAD TO CRACKING OF THE NIPPLE,? THE OFFICIAL NHTSA PRESS RELEASE READS.    AS A RESULT, A FUEL LEAK MAY HAPPEN ACCORDING TO AUDI, WHICH COULD EVENTUALLY LEAD TO A FIRE IF AN IGNITION SOURCE IS NEARBY. IT?S NICE TO KNOW THAT THE GERMAN CARMAKERS MAKE MISTAKES TOO - IT LETS US NOW THAT THEY ARE HUMAN AS WELL.    THE RECALL IS EXPECTED TO BEGIN DURING JUNE 2011. TO FIX THE PROBLEM, DEALERS WILL REINFORCE THE NIPPLE ON THE ROLLOVER VALVE TO PREVENT LEAKAGE OR REPAIR THE NIPPLE CRACK. IT'S HIGHLY RECOMMENDED THAT YOU LEAVE YOUR CRACKED NIPPLES TO BE INSPECTED BY A PROFESSIONAL AND NOT DO IT YOURSELF.   *TR",
        "vin": "WAUZL64B2YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2012",
        "dateOfIncident": "07/02/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455844,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CENTER INSTUMENT CLUSTER HAS BEEN IN AND OUT FOR AS LONG AS I HAVE OWNED THE CAR. SOME DAYS, WHEN THE PLANETS ALIGN CORRECTLY, THE DISPLAY WILL BE MOSTLY VISIBLE. ON MOST DAYS, HOWEVER, MOST PIXELS ARE NOT VISIBLE, SOME ARE FADED, AND CERTAIN CRITICAL WARNINGS CANNOT BE SEEN...YOU CAN HEAR THE BEEPING, BUT HAVE NO CLUE WHAT IS FAILING! IF THIS WERE A PLUG AND PLAY PART I WOULD HAVE REPLACED IT BY NOW...BUT THE WHOLE THOUGHT OF HAVING TO SOLDER THE LCD IN DISCOURAGES A FIX. THIS IS AN INHERENT ISSUE WITH THE C5 LINE...CANNOT BELIEVE AUDI HAS NEVER RECALLED FOR THIS ISSUE! CLEARLY THIS IS A PROBLEM.     *JS",
        "vin": "WAUEH24B6YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/19/2012",
        "dateOfIncident": "03/06/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452286,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSTRUMENT CLUSTER HAS GONE OUT AND THERE IS NO WAY TO READ THE IMPORTANT MESSAGES THAT COME ACROSS IT. I.E. LOW FUEL, TEMP OR COOLANT OR ENGINE, BRAKE PROBLEMS, WASHER FLUID .... I FEEL SOMETHING NEEDS TO BE DONE ON THIS PART!!    *JS",
        "vin": "WAUED24B5YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2012",
        "dateOfIncident": "12/20/2011",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448947,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR AUDI A6 WAS TAKEN TO AUDI RECTOR ON 12/20/11 DUE TO AN ELECTRICAL BURNING SMELL COMING THROUGH THE AIR VENTS.  AUDI RECTOR REPAIRED THE RACK AND PINION STEERING AND A TRANSMISSION LEAK.  THEY SAID THE SMELL WAS DUE TO THE TRANSMISSION LEAK AND WOULD DISSIPATE.  ON THE TRIP HOME FROM AUDI RECTOR ON 12/23/11, THE CAR CAUGHT FIRE STARTING INSIDE THE DRIVER SIDE AIR VENT AND BURNED.  IT WAS COMPLETELY DESTROYED.  *TR",
        "vin": "WAULH64B9YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2011",
        "dateOfIncident": "10/28/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433111,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL VAPOR DETECTED IN CABIN. GASOLINE DETECTED ON FLOOR SURFACE UNDER DRIVER SIDE REAR PASSENGER LOCATION.  ALSO OBSERVE FUEL DRIPPING FROM DRIVER SIDE FUEL TANK.  SUSPECT DEFECTIVE ROLLOVER VALVE NIPPLE.     ADDENDUM REQUESTED TO INCLUDE YEAR 2000 A6 AUDI C5   CAR YEAR IS 04/2000 A6 QUATTRO C5.  SEE;  RECALL CAMPAIGN 08V157000  NHTSA ACTION NUMBER: PE08008.  *TR",
        "vin": "WAUED64B9YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/16/2011",
        "dateOfIncident": "09/02/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425696,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAD THE ABS AND BRAKE LIGHT DISPLAY (BRAKE LIGHT IF FLASHING), CAUSING THE CAR TO SOMETIMES NOT STOP PROPERLY.  CHECKED OUT TO BE ABS MODULE FAILURE.  *TT",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2011",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401509,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK ROLLOVER NIPPLE CRACKED AND BEGAN LEAKING FUEL ON THE CATALYTIC CONVERTER. CAUSING A MAJOR FIRE RISK, LEAVING ME TO HAVE THE CAR TOWED AND REPAIRED. AUDI HAS RECALLED 2001 AND UP CARS FOR THIS PROBLEM BUT LEFT OUT MY MODEL YEAR, EVEN THOUGH IT HAS THE SAME TANK.  *TR",
        "vin": "WAUED54B6YN"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "04/12/2011",
        "dateOfIncident": "04/07/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395590,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS MODULE FAILURE. BLINKING ABS LIGHT AND FLASHING DASH BRAKE LIGHT INDICATING FAILURE. IT APPARENTLY IS NOT UNCOMMON ON 1998-2002 AUDI VEHICLES, A4 & A6 MODELS ALIKE. *TR",
        "vin": "WAULH24B2YN"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "03/27/2011",
        "dateOfIncident": "10/21/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10393005,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Robert Bosch, LLC",
                "productMake": "BOSCH",
                "productModel": "ZOHT HYDRAULIC BRAKES",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2000 AUDI A6 ABS FAILURE. WITH AN CAR ACCIDENT CAR WAS TOTALED. FALL OF 2010. DAUGHTER SUSTAINED HEAD TRAMA.  *TR",
        "vin": "WAUED24B1YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2011",
        "dateOfIncident": "01/30/2011",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383838,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1/30/11, THIS VEHICLE, A 2000 AUDI A6, HAD AN ELECTRICAL FIRE. THE VEHICLE WAS TURNED OFF WHILE LISTENING TO THE RADIO. A PLASTIC/RUBBER BURNING SMELL EMANATED FROM WITHIN THE VEHICLE, FOLLOWED BY BLACK SMOKE, AND FLAMES COMING OUT OF THE AIR VENTS, PRIMARILY IN THE DRIVER'S SIDE. A FIRE HAD IGNITED WITHIN THE ELECTRICAL BOARD BENEATH THE DASHBOARD/GAUGE CLUSTER AREA IN THE DRIVER'S SIDE. THE WINDSHIELD WIPERS AND HEADLIGHTS TURNED ON BY THEMSELVES DURING THE INCIDENT.",
        "vin": "WAUBH24B4YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/14/2010",
        "dateOfIncident": "10/16/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10365630,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS LIGHT COMES ON STEADY, THE HAND BRAKE LIGHT FLASHED CONSTANTLY, AND THREE WARNING BEEPS ARE HEARD. A COMPUTER READING SAYS THERE IS NO CONNECTION WITH THE ABS UNIT. THE ABS DOESN'T WORK AT ALL. IT SOMETIMES OCCURS WHEN I FIRST START THE CAR, AND SOMETIMES AFTER DRIVING FOR A WHILE.  THE CONSUMER STATED SOMEONE ELSE WAS DRIVING HER VEHICLE AND HE/SHE REAR ENDED ANOTHER PERSON.  THE CONSUMER STATED THE ABS DID NOT FUNCTION AS DESIGNED. UPDATED 12/16/10  *TR",
        "vin": "WAUED24B1YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/09/2010",
        "dateOfIncident": "06/30/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342338,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 AUDI A6 4.2L V8 QUATTRO ENGINE COOLING SYSTEM FAILURE.  THE PLASTIC COOLANT PIPE BETWEEN THE OIL COOLER HOUSING AND THE ENGINE BLOCK FAILS CAUSING POTENTIAL CATASTROPHIC COOLANT LOSS, OVERHEATED ENGINE AND POTENTIAL FIRE. *TR  THE PLASTIC PIPE HARDENS/CRUMBLES WITH AGE, APPROXIMATELY 10 YEARS AND 135K MILES.  I REPLACED THE PIPE...IT TAKES ABOUT 10 MANHOURS.  THE REPLACEMENT AUDI PART IS MAYBE $20 BUT IT IS STILL PLASTIC.  I REPLACED IT WITH A BILLET ALUMINUM PART WITH DOUBLE O-RINGS.  DEALER WANTED $2900.00 TO REPAIR!!  I UNDERSTAND THIS PART IS ON EVERY 4.2L V8 ON BOTH A6 AND A8 CARS FROM 1998 TO CURRENT 2010.",
        "vin": "WAUZL54B0YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/17/2010",
        "dateOfIncident": "10/05/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336892,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS LIGHT COMES ON STEADY, THE HAND BRAKE LIGHT FLASHED CONSTANTLY, AND THREE WARNING BEEPS ARE HEARD. A COMPUTER READING SAYS THERE IS NO CONNECTION WITH THE ABS UNIT. THE ABS DOESN'T WORK AT ALL. IT SOMETIMES OCCURS WHEN I FIRST START THE CAR, AND SOMETIMES AFTER DRIVING FOR A WHILE. AUDI SAYS MY CAR IS TOO FAR OUT OF WARRANTY (2000 W/ 77,000 MI). THEY WON'T COVER ANY COSTS. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/26/2010",
        "dateOfIncident": "05/20/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10332280,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD A LOT OF PROBLEMS WITH MY AUDI 2000 A6 2.7 TURBO EMISSIONS SYSTEM. I WAS TOLD I HAD A BAD CATALYTIC CONVERTER AT 90,000 AND THEY SAID IT WAS NOT UNDER WARRANTY. I LOOKED ON THE INTERNET AND FOUND HUNDREDS OF COMPLAINTS ABOUT THE AUDI'S CATALYTIC CONVERTERS. WHY DO THEY ONLY LAST 80,000 TO 90,000 MILES? THEN WE HAVE TO PAY $3,000.00 TO FIX IT TO PASS THE CALIFORNIA SMOG TESTS? THAT IS NOT FAIR.  *TR",
        "vin": "WAUED54B1YN"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "01/06/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319846,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS CONTROL MODULE FAILS INTERMITTENTLY CAUSING THE ABS BRAKES TO ONLY WORK WHEN THE ABS/BRAKE WARNING INDICATOR LIGHT IS OFF.  I HAVE DONE QUITE A BIT OF RESEARCH ONLINE REGARDING THIS AND HAVE FOUND THAT THIS IS A COMMON PROBLEM WITH AUDI'S MANUFACTURED BETWEEN 1996 AND 2001. *TR",
        "vin": "WAUEH24B8YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2009",
        "dateOfIncident": "09/02/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296141,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS AN 2000 AUDI A6.  HE SMELLED A STRONG ODOR OF FUEL INSIDE AND OUTSIDE OF THE VEHICLE.  ALSO SHE NOTICED FUEL LEAKAGE ON THE GROUND.   THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION. THE FAILURE WAS CONTRIBUTED TO THE FUEL TANK ASSEMBLY.  THE VEHICLE HAS NOT BEEN REPAIRED.   THE FAILURE MILEAGE WAS 135,000.  THE CURRENT MILEAGE WAS 142,000.",
        "vin": "WAUEH24B0YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/02/2009",
        "dateOfIncident": "11/24/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286135,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ODOMETER BLACKS OUT WHEN IT WARMS UP. THE DISPLAY DISAPPEAR. *TR",
        "vin": "WAUED24B3YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/19/2009",
        "dateOfIncident": "08/18/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281015,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 AUDIT A6. THE CONTACT STATED THE ABS MODULE MALFUNCTIONED. HE DIDN'T WANT TO GIVE SPECIFIC FAILURES RELATED TO HIS VEHICLE.  CONTACT HAS NOT TAKEN HIS VEHICLE TO THE DEALER TO DIAGNOSE THE FAILURE. THE CONTACT HAS IDENTIFIED SEVERAL FAILURES HE VIEWED ON THE INTERNET. THE FAILURE MILEAGE WAS 126,000.",
        "vin": "WAULH24BXYN"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "07/18/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278205,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND HIT A MEDIUM SIZED BUMP. MY SEAT BEAT LOCK AND WOULDN'T RELEASE.  I DISENGAGED THE BELT AND LET IT FULLY RETRACT THINK THAT THE LOCK WOULD RELEASE.  BELT REMAINED LOCK IN THE FULLY RETRACTED POSITION.  SEAT BELT INOPERABLE.  *TR",
        "vin": "WAULH24BXYN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "09/16/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277571,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 AUDI A6.  THE CONTACT STATED THAT THE LIGHTING ON THE INSTRUMENT CONTROL PANEL DIMMED.  THE DEALER STATED THAT THE LCD SCREEN FOR THE INSTRUMENT CLUSTER WAS THE CAUSE OF THE FAILURE, AND WOULD COST $700 TO REPAIR.  THE CONTACT WAS INFORMED THAT THIS TYPE OF FAILURE WAS COMMON FOR THIS YEAR, MAKE, AND MODEL VEHICLE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE AND CURRENT MILEAGES WERE 120,500. UPDATED 08/20/09. *LJ  UPDATED 08/20/09.*JB",
        "vin": "WAULH24BXYN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2009",
        "dateOfIncident": "03/14/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261874,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM RELATES TO AUDI A6 QUATTRO 2.8L MODEL YEAR 2000. GAS ODOR FROM OUTSIDE VEHICLE IS EXTREMELY STRONG, ESPECIALLY AFTER FILLING TANK. GAS LEAKS AND POOLS UNDER CAR, POSING EXTREME FIRE HAZARD. FAILURE HAS NOT BEEN CORRECTED. AUDI RECALL [08V-157] DESCRIBES THIS PROBLEM EXACTLY, BUT ONLY COVERS MODEL YEARS 2001 THROUGH 2004. THE VIN RANGE DOES NOT COVER THIS VEHICLE. THIS REQUEST IS TO EXPAND THE COVERAGE OF THIS RECALL TO INCLUDE AUDI A6 QUATTRO 2.8L VEHICLES WITH MODEL YEAR 2000. *TR",
        "vin": "WAULH54B1YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "02/12/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258834,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 AUDI A-6 QUATTRO 2.8 L; ABS MODULE HAS MALFUNCTIONED. THIS SEEMS TO BE A COMMON OCCURRENNCE ON THESE VEHICLES AS I'VE SEEN NUMEROUS PEOPLE COMPLAINING ABOUT IT ON THE AUDI FORUM. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/05/2009",
        "dateOfIncident": "02/05/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257559,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS CONTROL MODULE HAS FAILED ON MY 2000 AUDI A6. FROM AN INTERNET SEARCH THIS APPEARS TO BE AN ALMOST TAKEN FOR GRANTED REPAIR/REPLACEMENT ITEM, I.E.; IT HAPPENS TO ALMOST EVERY VEHICLE. THIS IS NOT AN INEXPENSIVE ITEM TO REPLACE (500-1300 DOLLARS INCLUDING LABOR). THERE ARE THOUSANDS OF COMPLAINTS, FORUMS, BLOGS DEDICATED TO THIS PARTICULAR ISSUE. I BELIEVE A RECALL IS WARRANTED. PLEASE INVESTIGATE THIS ISSUE. THANK YOU. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "10/08/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254350,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MOISTURE IN HEADLAMP HOUSING CAUSING OXIDIZED HEADLAMP. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "10/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245438,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INFORMATION ON THE DIGITAL READOUT IS ALL SCREWED UP. SOMETIMES THE TOPS OF THE LETTERS ARE MISSING, OTHER TIMES THE BOTTOMS ARE MISSING. MAKES IT IMPOSSIBLE TO READ INFORMATION ON DASHBOARD. *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/02/2008",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244273,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "NORMAL DRIVING CONDITIONS. THE INSTRUMENT DISPLAY DOESN'T WORK, AND I CAN'T SEE VITAL SAFETY AND HAZARDOUS FAILURES OF THE VEHICLE AND/OR PARTS, ALSO  THE REAR VIEW MIRROR HAS A FLUID TYPE SUBSTANCE THAT CLOUDS THE VIEWING AREA AND IT MAY LEAK THIS FLUID ONTO THE ELECTRONICS BELOW. I HAD TO REPLACE BOTH OF THESE ITEMS AND I HAVE THEM BOTH.  *TR",
        "vin": "WAUZL64B3YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/01/2008",
        "dateOfIncident": "06/06/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244111,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY ABS SYSTEM IN AUDI A6 2000 MODEL.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2008",
        "dateOfIncident": "12/25/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242921,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 AUDI A6 AVANT.  THE CONTACT STATED THAT THE INSTRUMENT PANEL CLUSTER FAILED.  THE COOLANT AND OIL TEMPERATURE GAUGES WERE NO LONGER OPERATIVE.  HALF OF THE DISPLAY WAS VISIBLE, WHICH MEANT THAT CRITICAL INFORMATION THAT NEEDED TO BE DISPLAYED WAS NO LONGER ABLE TO BE SEEN.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THEY CONFIRMED THAT THE INSTRUMENT CLUSTER FAILED, BUT DID NOT OFFER ANY ASSISTANCE OR A FREE REPAIR.  THE CONTACT HAS NOT YET NOTIFIED THE MANUFACTURER.  THE CURRENT MILEAGE WAS 102,405 AND FAILURE MILEAGE WAS APPROXIMATELY 75,000.",
        "vin": "WAULH54B9YN"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/14/2008",
        "dateOfIncident": "02/11/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242168,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH DOES NOT SHOW IMPORTANT INFO TO MAINTAIN THE CAR PROPERLY. THE DIGITAL LETTERS HAVE DISAPPEARED.  I HAVE NO IDEA WHAT'S GOING ON WITH MY A-6..  THE DEALERSHIP TOLD ME THAT ALL AUDI WITH THAT SAME FEATURE HAS THAT SAME PROBLEM. ALSO THERE  IS A OIL LEAK THAT IS COMMON IN THE SAME MODELS AS MINE. *TR",
        "vin": "WAUED24B1YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2008",
        "dateOfIncident": "01/10/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10241073,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS ABOUT MY 2000 AUDI A6. THE CENTRAL DISPLAY LCD ON THE INSTRUMENT CLUSTER FAILED TO DISPLAY ANY INFORMATION INCLUDING IMPORTANT WARNINGS SUCH AS COOLANT LEVEL, ENGINE TEMPERATURE, ENGINE OIL PRESSURE, BRAKE/ TURN LIGHTS OUT, GEAR POSITION ETC. ALL ARE IMPORTANT TO DRIVING SAFETY.  I ONCE HAD  LEAKAGE IN MY RADIATOR BUT I COULD NOT SEE THE WARNING OF DROPPING WATER LEVEL AND THAT CAUSED DAMAGE TO MY ENGINE AND WATER PUMP AND I WAS BURNED WHEN CHECKING ENGINE. IT ALMOST CAUSED A ACCIDENT BECAUSE IT STOPPED MY CAR IN THE MIDDLE OF THE HIGH WAY. AS FAR AS I KNOW, ALMOST EVERY AUDI A4/A6 IN BETWEEN 1998-2004 MODEL YEAR HAD THE SAME DISPLAY PROBLEM.  *TR",
        "vin": "WAUBH24B5YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2008",
        "dateOfIncident": "08/04/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237413,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A RECENT RECALL FOR CERTAIN AUDI MODELS AS REFERENCED IN NHTSA ACTION NUMBER : PE08008. THIS BEGINS WITH MODEL YEAR 2001 A6 AUDI CARS WITH THE 2.7 ENGINE. I OWN A 2000 MODEL A6 2.7 AND AM HAVING THE SAME PROBLEM. THERE IS A GASOLINE SMELL THAT JUST BEGAN AND BY INSPECTION FROM UNDERNEATH THE CAR IT APPEARS THAT THERE IS A SLIGHT LEAK (NOT DRIPPING) FROM THE TOP AREA OF THE TANK AS DESCRIBED IN THIS RECALL. IT SEEMS LIKE MORE THAN A COINCIDENCE THAT MY CAR IS ALSO HAVING A VERY RARE SLOW GAS LEAK BUT IT WAS NOT INCLUDED IN THE RECALL. THE GAS TANK PART NUMBER (AS PRINTED ON THE BOTTOM OF THE TANK) IS 4B0 201 085. THIS IS THE SAME PART NUMBER AS USED IN THE 2001 AND 2002 MODELS AS REFERENCED FROM A N ONLINE PART SEARCH. THANK YOU FOR YOUR ASSISTANCE AND FURTHER RESEARCH.  *TR",
        "vin": "WAUED64BXYN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "07/14/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236823,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN AN AUDI RECALL  (OPENED 1/31/-8, CLOSED 5/30/08) FOR AUDI A6 MODELS  MANUFACTURED FROM JUNE 2, 2001 TO JUNE 1, 2005.  YOUR NHTSA ACTION NUMBER IS PE08008, RECALL CAMPAIGN NUMBER IS 08V157000.  THIS INVOLVES VERY DANGEROUS FUEL TANK CRACKS AND LEAKS.  THE PROBLEM IS, I HAVE A 2000 AUDI A6 WITH EXACTLY THE SAME PROBLEM, BUT NO RECALL.  IT WILL COST ME ABOUT $2,000  TO REPAIR, MY MECHANIC SAYS I'M LUCKY NO EXPLOSION.  IF YOU WILL CHECK THE INTERNET CHAT ROOMS, THESE PROBLEMS ARE EXTENSIVE BACK TO 1998 MODELS, INVOLVING PLASTIC FUEL TANKS.  AUDI TELLS ME 'NOT ENOUGH COMPLAINTS' OF MY YEAR MODEL TO WARRANT RECALL,EVEN THOUGH THE DEFECT SEEMS EXACTLY THE SAME THING AS THE DEFECT CAUSING THE RECALL, AND IS A TERRIBLY DANGEROUS SITUATION FOR AUDI DRIVERS AND THEIR FAMILIES.  IF THERE IS A DEFECT, THERE IS A DEFECT, IT SHOULD NOT MATTER WHETHER MORE COMPLAINTS WERE FILED FOR THE 2001 YEARS THAN MINE.  IS SAFETY A MATTER OF THE NUMBER OF COMPLAINTS, OR WHETHER THE PRODUCT IS TRULY DEFECTIVE AND DANGEROUS.  PLEASE HELP!  THANKS, KEN WILLIAMS.*TR",
        "vin": "WAULH24BXYN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/28/2008",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236138,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"AIRBAG MODULES\", MANUFACTURED BY BOSCH, IN MANY MODELS OF AUDI AUTOMOBILES APPEAR TO BE FAILING, INEXPLICABLY. THESE MODULES ACT AS THE CENTRAL \"BRAIN\" FOR A CAR'S AIRBAG SYSTEM AND IF THEY FAIL THE CAR'S AIRBAG SYSTEM IS RENDERED USELESS. IN MY CASE, MY MODULE FAILED INEXPLICABLY AND MUST BE REPLACED ($1000), HAVING NEVER BEEN IN A COLLISION OR HAD AN AIRBAG DEPLOYMENT.    AUDI AND BOSCH HAVE BEEN UNHELPFUL, GIVEN THAT MY CAR IS OUT OF WARRANTY. HOWEVER, IT SEEMS TO ME THAT GIVEN THE CRITICAL NATURE OF A CAR'S SAFETY SYSTEM, AND THE IMPOSSIBILITY OF TAMPERING WITH A COMPUTER MODULE HIDDEN DEEP IN THE RECESSES OF THE CAR, THE MANUFACTURERS SHOULD BE MORE PROACTIVE IN ADDRESSING THE ISSUE.    A SIMPLE INTERNET SEARCH INDICATES THIS MAY BE A PERVASIVE PROBLEM, AND IT IS SCARY TO THINK OF HOW MANY CARS ARE OPERATING WITH \"FAILED\" SAFETY SYSTEMS!  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2008",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233865,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 AUDI A6.  THE INSTRUMENT PANEL FAILED.  THE CONTACT PURCHASED THE VEHICLE IN 2007 AND THE LIGHTS ON THE INSTRUMENT PANEL HAVE NEVER COMPLETELY WORKED.  WHEN IT IS COLD OUTSIDE, THE LIGHTS ILLUMINATE BRIGHT ENOUGH TO BE VISIBLE.  IN WARM TEMPERATURES, THE LIGHTS WERE VERY LOW AND VERY DIM.  THE DEALER HAS NOT BEEN INSPECTED BY THE DEALER.  THE CONTACT WAS INFORMED THAT IN ORDER TO HAVE IT REPAIRED, HE WOULD NEED TO REPLACE THE ENTIRE INSTRUMENT PANEL CLUSTER.  WHEN THE LIGHTS ARE DIM, HE IS UNABLE TO SEE WHAT GEAR THE VEHICLE IS IN OR DETECT IF THERE WAS A POSSIBLE FAILURE WITH THE ENGINE.  THE FAILURE MILEAGE WAS 80,000 AND CURRENT MILEAGE WAS 97,000.   UPDATED 07/29/08  *BF  THE CONSUMER STATED THE SCRREN WAS NOT VISIBLE. UPDATED 07/31/08. *JB",
        "vin": "WAUED54B2YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/30/2008",
        "dateOfIncident": "03/06/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226307,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS CONTROL MODULE FAILURE. INTERMITTENT PROBLEM IN WHICH ABS LIGHT COMES ON, BRAKE LIGHT COMES ON AND FLASHES, AND CHIME COMES ON. WHEN THIS OCCURS IT SIGNIFIES THAT ABS SYSTEM IS NOT WORKING BECAUSE IT HAS LOST COMMUNICATION WITH THE COMPONENTS. DIAGNOSED BY AUDI DEALER AS \"ABS CONTROL MODULE INTERMITTENTLY NOT COMMUNICATING.\" NOTIFIED AUDI OF AMERICA ABOUT ISSUE AND CONTENTION THAT IT IS A SAFETY ISSUE BECAUSE WHEN ABS WORKING GREATER CONTROL IS AVAILABLE IN BRAKING SITUATIONS. WITH INTERMITTENT PROBLEM I'LL HAVE TO GLANCE AT DASHBOARD DURING EMERGENCY BRAKE SITUATION AND BRAKE ACCORDING TO WHETHER AT THAT MOMENT I HAVE ABS OR NOT. VOLKSWAGEN OF AMERICA HAS PERFORMED A RECALL ON THE ABS CONTROL UNIT (NHSTA CAMPAIGN ID: 02V031000) FOR THEIR 2002 JETTA.  *TR",
        "vin": "WAUED24B6YN"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/25/2008",
        "dateOfIncident": "01/05/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225747,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ELECTROFILM, INC.",
                "productMake": "ELECTROFILM",
                "productModel": "HELMET",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "MY INFORMATION LED CLUSTER IN MY DASH FADES OUT WHEN IT GETS WARM.  THIS CLUSTER IS RESPONSIBLE FOR DISPLAYING GEAR INFORMATION (P,R,N,D,4,3,2,1) AS WELL OTHER SAFETY AND INFORMATIONAL MESSAGES.    IT IS A HAZARD TO DRIVE OR SHIFT INTO GEAR WHEN YOU ARE NOT SURE IF IT IS REVERSE OR DRIVE AS WELL AS ANY SAFETY INFORMATION THE CAR WOULD NEED TO DISPLAY. *TR",
        "vin": "WAUED24B8YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/08/2008",
        "dateOfIncident": "11/15/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223687,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS/BRAKE LIGHT STARTED FLASHING INFREQUENTLY AND I CALLED MAPLEWOOD AUDI SERVICE AND THEY PROCEEDING TO TELL ME IT WAS A BRAKE LIGHT SWITCH, THROUGH FURTHER INVESTIGATION I FOUND THAT THIS IS A VERY COMMON PROBLEM WITH THEIR ABS CONTROL MODULE AND IT IS A \"FACTORY ONLY\" FIX BECAUSE OF REPROGRAMMING AND SUCH AND IT WOULD RUN ABOUT $2000.  I BELONG TO A COUPLE OF AUDI FORUMS AND THIS IS ONE OF THE MOST COMMON PROBLEMS.  I DON'T SEE HOW THIS PROPRIETARY SYSTEM IS ALLOWED TO CONTINUE WITHOUT ACCOUNTABILITY BY THE MANUFACTURER AND OR DEALERSHIPS.  UNLIKE THEIR OTHER POOR PRACTICES FOR MONOPOLIZING SERVICE TO THESE CARS THIS ONE AFFECTS BRAKING AND THUS SAFETY.  *TR",
        "vin": "WAUZL54B1YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/20/2007",
        "dateOfIncident": "12/04/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212421,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "1) THE ABS MODULE ON MY 2000 AUDI A6 HAS FAILED. FAILED AT 95,000 MILES, ALWAYS HAD REGULAR MAINTAINANCE DONE ON VEHICLE  2) I HAVE NOTICED A LARGE NUMBER OF THESE REPORTS REGARDING THIS MODULE AND TYPE OF CAR. IT IS $1500 TO FIX AND IN THE MANUAL STATES TO CORRECT IMMEDIATELY AS TO THE REAR BRAKES MAY LOCK UP UNDER HEAVY BRAKING.  3) HAVE NOT REPAIRED VEHICLE YET.  *TR",
        "vin": "WAUBH24B8YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2007",
        "dateOfIncident": "12/03/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212785,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 AUDI A6 WITH A FUEL LEAK. CONSUMER STATES THAT THE VEHICLE HAS BEEN REPAIRED FOR THE FUEL LEAK AND WOULD LIKE SOME FINANCIAL ASSISTANCE IN PAYING FOR THE REPAIR. CONSUMER STATED HE NEVER RECEIVED A CALL FROM THE DEALER.  *KB  THE VEHICLE HAD PUDDLES OF FUEL ON TOP OF THE TANK. THE CONSUMER BELIEVED RECALL # 01V157000 WAS RELATED TO FUEL TANK PROBLEM  HE EXPERIENCED . THE DEALER INFORMED THE CONSUMER THE VEHICLE IDENTIFICATION NUMBER WAS NOT INCLUDED IN THE RECALL. THE CONSUMER STATED THE LIGHTS ON THE VEHICLE WOULD DIM. *JB",
        "vin": "WAUED64B01N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/11/2007",
        "dateOfIncident": "11/09/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MODEL YEAR 2000, AUDI A6 QUATTRO WAGON  4 INSTANCES OF SUB-STANDARD EQUIPMENT:  1) ABS WARNING LIGHTS DUE TO DEFECTIVE ABS CONTROLLER A VERY COMMON PROBLEM WHICH THE MANUFACTURER SHOULD BE FORCED TO RECALL.  2)  SUB-STANDARD MATERIALS USED IN THE VENT TUBING IN THE ENGINE COMPARTMENT (CHEAP PLASTIC THAT BREAKS CAUSING INCREASED EMISSIONS OUTPUT HARMING THE ENVIRONMENT).  3) DASHBOARD WARNING DISPLAY LED FAULTY, A VERY COMMON PROBLEM WHICH THE MANUFACTURER SHOULD BE FORCED TO RECALL.  4)PLASTIC COMPONENTS IN INTERIOR OF THE AUTO BREAK EASILY POOR PLASTIC STRENGTH (IE CUPHOLDER, BUTTONS ETC).  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2007",
        "dateOfIncident": "09/17/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207091,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION DISPLAY ON INSTRUMENT CLUSTER IS NOT READABLE. MANY LINES ON THE LCD DISPLAY KEEP IT FROM PROVIDING CRITICAL INFORMATION.  *TR",
        "vin": "WAUEH64B5YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/05/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205082,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 AUDI A6.  THE CONTACT STATED THAT THE ABS AND BRAKE WARNING LIGHTS ILLUMINATED.  THE DEALER STATED THAT THE ABS MODULE MALFUNCTIONED.  AS OF OCTOBER 5, 2007, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE FAILURE MILEAGE WAS 114,000 AND CURRENT MILEAGE WAS 114,776.",
        "vin": "WAUEH24B9YN"
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/01/2007",
        "dateOfIncident": "09/04/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204613,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 AUDI A6. THE CONSOLE HAS A CENTER DISPLAY THAT SHOWS WARNING LIGHTS FOR GAS, BRAKES, ETC. THE CENTER DISPLAY FAILED GRADUALLY APPROXIMATELY ONE YEAR AGO. THE DISPLAY HAS COMPLETELY FAILED AND WHEN THE VEHICLE IS COLD SOME OF THE LINES IN THE DISPLAY ARE VISIBLE. THE DEALER STATED THAT THE VEHICLE IS NO LONGER UNDER WARRANTY AND THEY WILL NOT REPAIR IT.  THE CURRENT MILEAGE WAS 76,000 AND THE FAILURE MILEAGE WAS 70,000.     THE CONSUMER STATED THE GAS GAUGE IS NOT WORKING AND NOT MOVING WHEN THE VEHICLE IS FILLED UP WITH GAS. UPDATED 11/07/07  *TR",
        "vin": "WAUED24B7YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/15/2007",
        "dateOfIncident": "08/14/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199661,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS CONTROL MODULE NEEDS TO BE REPLACED AT A COST OF $800.  LITERALLY THOUSANDS OF THESE MODULES HAVE QUIT WORKING ON 2000 AUDI'S. A VISIT TO THE INTERNET DISPLAYS SO MANY COMPLAINTS REGARDING THIS PART THAT THERE IS NOT TIME ENOUGH TO READ THEM ALL. AUDI NOT ONLY REFUSES TO RECALL THIS PART (SINCE NO ONE DIES IN AN ACCIDENT BECAUSE OF IT) BUT THEY ALSO REFUSE TO DOCUMENT YOUR COMPLAINT TO GENERATE A LIST OF COMPLAINTS REGARDING THIS PART. I FIRST WAS TOLD I HAD TO GO TO AN AUDI DEALER TO HAVE THE MALFUNCTION VALIDATED (A PRIVATE AUTO REPAIR SHOP WOULD NOT DO), BUT AFTER I PAID AUDI $60.00 FOR A DIAGNOSTIC, AUDI USA STILL COULD ONLY TELL ME THAT THERE HAD NOT BEEN A RECALL AND MAYBE THE DEALER COULD DO SOMETHING TO HELP ME.  *JB",
        "vin": "WAUEH24B0YN"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2007",
        "dateOfIncident": "07/20/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197971,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 AUDI A6.  HE STATED THAT THE FUEL TANK BREATHER HOSE CONNECTION FAILED, WHICH CAUSED THE VEHICLE TO SMELL OF GASOLINE FUMES.  THE MECHANIC STATED THAT THE  CONNECTOR WAS PLASTIC AND WOULD EVENTUALLY FAIL. THE MECHANIC STATED THE ONLY WAY THE COULD BE REPLACED WAS TO REPLACE THE ENTIRE FUEL TANK.  THE CONTACT HAD A PATCH PUT ON THE CONNECTION.  THE CURRENT MILEAGE WAS 94,827 AND THE FAILURE MILEAGE WAS 93,700.  THE PURCHASE DATE WAS UNAVAILABLE.   THE CONSUMER PROVIDED THE REPAIR INVOICE. UPDATED 09/05/07  *TR",
        "vin": "WAUEH24B4YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/31/2007",
        "dateOfIncident": "07/20/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197980,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS AN OVERWHELMING LECEL OF GASOLINE FUMES INSIDE THE CAR.  THE PROBLEM:  THE FUEL TANK BREATHER HOSE IS CONNECTED TO THE FUEL TANK BY A PLASTIC CONNECTOR. THE PLASTIC CONNECTOR WAS BROKEN.  IT IS PHYSICALLY LOCATED WHERE NOTHING CAN CONTACT IT. IT JUST BROKE OVER TIME.  IT'S CLEARLY NOT A WARRANTY ISSUE (THE CAR IS OUT OF WARRANTY), BUT A SAFETY ISSUE.   THE CONNECTOR CAN NOT BE PROCURED SEPARATELY FROM THE ENTIRE FUEL TANK. THE COST TO REPLACE THE FUEL TANK WOULD BE ABOUT $2,000.  A REPAIR (HOPEFULLY) WAS MADE BY EPOXYING THE CONNECTOR, AFTER DROPPING THE FUEL TANK TO REACH IT.   A CALL TO AUDI TO REPORT THE CONCERN AS A SAFETY ISSUE WAS NOT REWARDING. THEY INSISTED THAT THE ONLY WAY THEY WILL PURSUE THIS FURTHER IS IF WE TAKE THE CAR TO THE AUDI DEALER (THE REPAIR WAS MADE AT AN AUDI SPECIALTY SERVICE CENTER), THAT WE PAY THEM (APPROXIMATELY $500) TO DROP THE FUEL TANK TO JUST LOOK AT THE CONNECTOR TO SEE IF IT INDEED WAS BROKEN. IF WE DO NOT PAY THEM THIS MONEY, SO THEY CAN SEE IT, THEY WILL NOT BELIEVE US AND WILL NOT PURSUE THIS FURTHER AS A POSSIBLE SAFETY CONCERN.  *TR",
        "vin": "WAUEH24B4YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/19/2007",
        "dateOfIncident": "06/18/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193702,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LCD IN THE INSTRUMENT CLUSTER WHICH DISPLAYS ANY WARNING LAMPS WAS FAILING.  THIS WAS A VERY COMMON PROBLEM.  WITHOUT USE OF THIS DISPLAY I WILL NOT KNOW IF I HAVE A CHECK ENGINE LIGHT, BRAKE FAILURE LIGHT OR SO FORTH.  I KNOW OVER 100 PEOPLE WITH THIS SAME PROBLEM ,AND I AM NOT MAKING THIS UP.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/07/2007",
        "dateOfIncident": "03/05/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184442,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A6 ABS NOT FUNCTIONING AFTER ONLY 58,000 MILES. AUDI REFUSES TO STAND BEHIND ITS ENGINEERING AND REPAIR. DIAGNOSIS\" ABS CONTROL UNIT IS NO LONGER COMMUNICATING WITH THE INSTRUMENT CLUSTER\". COST OVER $800 TO REPLACE AND CAN ONLY BE REPLACED BY AUDI DEALER. MANY A6 OWNERS HAVE SAME PROBLEM, YET AUDI HAS NOT ISSUED A \"CAMPAIGN\" / RECALL. ISN'T ABS INTRINSIC TO THE SAFETY OF THE CAR...SORT OF LIKE THE AIRBAGS? WHY NOT ENGINEERED TO LAST LONGER THAN 58,000 MILES? OR, COULD IT BE ENGINEERED ON PURPOSE TO GENERATE DEALER SERVICE REVENUE? SOMETHING NOT RIGHT HERE.  *JB",
        "vin": "WAUED24B8YN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/02/2007",
        "dateOfIncident": "02/07/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184069,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 AUDI A6 2.7T, WITH 58099 MILES, WAS PARKED IN COVERED BUT AMBIENT TEMPERATURE PARKING LOT FOR THREE DAYS AT APPROXIMATELY OF.  WHEN I RETURNED FROM TRAVEL AND STARTED THE CAR, THE AIRBAG WARNING LIGHT REMAINED ON.  THE REPAIR FACILITY DISCOVERED THAT A SENSOR HAD SHORTED AND DESTROYED THE AIRBAG CONTROL UNIT.  WHILE THE WARNING LIGHT NOTIFIED ME OF THE FAILURE, IT DOES NOT SEEM REASONABLE THAT THE AIRBAG CONTROL SHOULD FAIL UNDER THESE CIRCUMSTANCES.  *JB",
        "vin": "WAUED54B9YN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2007",
        "dateOfIncident": "02/17/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183255,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A COLD SNAP, THE AIR BAG WARNING LIGHT CAME ON WHEN THE CAR WAS STARTED IN THE MORNING.  THE AIR BAG CONTROLLER WAS QUERIED FOR A FAULT CODE, AND THE CODE 65535, INTERNAL CONTROL MODULE MEMORY ERROR, WAS RETURNED.  THE FACTORY MANUAL WAS CONSULTED AND THE REMEDY OFFERED WAS THE REPLACEMENT OF THE CONTROLLER, WITH THE INSTRUCTION THAT THE CONTROLLER COULD NOT BE RESET USING THE SCAN TOOL.  THE DEALER WAS CONTACTED FOR THE PART, APPROXIMATELY $900, AND IT WOULD HAVE TO BE ORDERED.  TOTAL COST (FROM A POSTING ON AUDI WORLD WEB SITE) FOR REPAIR APPROXIMATELY $1500.      OF CONCERN IS THE FACT THAT ON THE AUDI WORLD WEB SITE, VERY HEAVILY TILTED TOWARD DIY OWNERS, I SEARCHED FOR THE 65535 FAULT CODE AND IT RETURNED 229 CASES WHERE THEY SPECIFICALLY MENTIONED THE CODE, I DO NOT KNOW HOW MANY MORE MENTIONED THE PROBLEM WITHOUT MENTIONING THE CODE.  I DID NOT LOOK AT ALL OF THEM, BUT, MANY DESCRIBED THE SAME COLD WEATHER COINCIDENCE WITH THE PROBLEM.     IF THE PROBLEM IS A FAULTY CONTROLLER WHERE COLD INDUCES THE FAULT, EVERY VW PRODUCT, THAT SPENDS ANY TIME IN THE COLD, WITH THAT CONTROL, OR A VARIANT WITH THE SAME FLAW, R IS AT RISK.    SEE MY EMAIL FOR THE REST OF THIS.  YOUR SYSTEM WOULD NOT LET ME SEND IT AND WHEN I CALLED THEY COULD ONLY OFFER THAT I SEND AN EMAIL.  *NM",
        "vin": "WAULH24B3YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/12/2006",
        "dateOfIncident": "08/10/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168080,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A STRANGE NOISE FROM THE ENGINE COMPARTMENT OF A 2000 A6 AUDI BEGAN SEVERAL MONTHS AGO. THE NOISE BECAME PROGRESSIVELY LOUDER. I THEN SUSPECTED A WATER PUMP MALFUNCTION WAS FORTHCOMING. THE VEHICLE WAS TAKEN TO AN AUDI DEALER FOR EVALUATION. THEY DETERMINED THAT THE WATER PUMP WAS DEFECTIVE, AND RECOMMENDED A REPLACEMENT. MOST PEOPLE WOULD NOT HAVE RECOGNIZED THIS NOISE AND AN ON ROAD ACCIDENT COULD HAVE TAKEN PLACE ON A FREEWAY WHEN THE ENGINE WOULD HAVE OVERHEATED AND SEIZED. SINCE THERE WAS ONLY 31500 MILES ON THE VEHICLE I AM CONCERNED THAT THIS TYPE OF PROBLEM OCCURRED AT ALL. EITHER THE PUMP SHAFT WAS BENT BY AN OVER TIGHTENED BELT OR THE PART WAS DEFECTIVE AT MANUFACTURING POINT. (THE BELT HAS NEVER BEEN ADJUSTED AFTER PURCHASE).  *JB",
        "vin": "WAUEH24B7YN"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/20/2006",
        "dateOfIncident": "08/20/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166063,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LUCKILY I HAVEN'T HAD AN ACCIDENT BUT MY VEHICLE DOES HAVE A DANGEROUS PROBLEM. IF YOU BRAKE HARD AND THEN  STEP ON THE THROTTLE THE CAR WILL JERK AND NOT WANT TO START GOING AGAIN. IT IS VERY DANGEROUS IF YOU ARE TRYING TO MERGE INTO TRAFFIC OR GET OUT OF THE WAY. I WAS INFORMED IT WAS A PROGRAMMED \"SAFETY\" FEATURE INTENDED TO STOP ACCIDENTAL ACCELERATION. IT SEEMS TO BE EXACTLY THE OPPOSITE TO ME.   *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/17/2006",
        "dateOfIncident": "06/25/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162678,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL STUCK IN THROTTLE POSITION CAUSING AN INABILITY TO STOP. I HAD TO MANUALLY SHIFT TO NEUTRAL TO GAIN CONTROL OF A SPEEDING VEHICLE. BY PRYING MY FOOD UNDER THE GAS PEDAL IT RELEASED.  DEALER SUGGESTED CHANGING THE PEDAL ASSEMBLY.  *JB",
        "vin": "WAULH24B3YN"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN,EXTERIOR LIGHTING,VISIBILITY,TIRES,WHEELS,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/27/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161586,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 AUDI AX6 AXLE BROKE, TRANSMISSION IS POOR, LEFT FRONT RIM CRACKED, RACK AND PINION WORN, FLOOD LIGHTS DO NOT WORK, AIRBAG, ENGINE, ELECTRICAL WINDOWS AND SUNROOF FAILURES.  *TS   THE INSIDE LIGHTS DID NOT WORK. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/16/2006",
        "dateOfIncident": "06/05/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159976,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2000 AUDI A6 2.7T (ABOUT 48,500 MILES AND OUT OF WARRANTY) HOME FROM WORK, WHEN I NOTICED THE CAR SEEMED TO HAVE LESS POWER.  THE CAR DID NOT SEEM TO ACCELERATE VERY WELL. THEN I NOTICED THAT WHEN I TOOK MY FOOT OFF THE ACCELERATOR THAT THE CAR WAS SLOWING ON ITS OWN.  I WAS CLOSE TO HOME AND THE ROAD I WAS ON DID NOT HAVE A PLACE WHERE I COULD SAFELY PULL OVER SO I DROVE HOME.  WHEN I PULLED IN I NOTICED THE FRONT PASSENGER WHEEL WAS SMOKING.  I PICKED UP A FIRE EXTINGUISHER AND USED IT ON THE SMOKING WHEEL.  I KEPT CHECKING THE WHEEL UNTIL ALL THE PARTS OF THE BRAKE AND WHEEL WERE COOL TO THE TOUCH.  I HAD THE CAR CARRIED TO THE AUDI DEALER SINCE I DID NOT WANT REPEAT THE INCIDENT. THE BRAKE HAD LOOSENED UP SINCE THE CAR ROLLED WHEN IT WAS TAKEN OUT OF GEAR.  WHEN AT THE DEALER THE PROBLEM WAS INITIALLY IDENTIFIED AS A FAILED BRAKE CALIPER THAT LOCKED THE BRAKE PADS AGAINST THE WHEEL.  AFTER WAITING SEVERAL DAYS FOR THE BRAKE CALIPER TO BE SHIPPED FROM CANADA!!  IT WAS THEN DISCOVERED THAT THE BRAKE LINE WAS BLOCKED.   AFTER FURTHER INVESTIGATION IT WAS DISCOVERED THAT THE MASTER BRAKE CYLINDER HAD BEEN THE INITIAL FAILURE. ( THIS PART ALSO REQUIRED A DAY OR SO TO BE DELIVERED.)  SOMETHING FROM IT CLOGGED THE BRAKE LINE SO THE PRESSURE WAS NOT BE RELEASED AT THE BRAKE CALIPER.  SO THE BRAKE PADS WERE LOCKED AGAINST THE BRAKE ROTOR.  RESULT THE MASTER BRAKE CYLINDER, BRAKE FLUID, THE PASSENGER FRONT BRAKE CALIPER, BOTH FRON BRAKE ROTORS AND BOTH SETS OF FRONT BRAKE PADS WERE REPLACED. TIME TO REPAIR 10 DAYS. *JB",
        "vin": "WAUED24B1YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/08/2006",
        "dateOfIncident": "04/04/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154878,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL TOURINGCONTACT AS",
                "productYear": "9999",
                "size": "P215/60R16",
                "type": "Tire"
            }
        ],
        "summary": "ALL FOUR OF MY CONTINENTAL 205/55-16 TOURING CONTACTS TIRES HAVE LARGE SIMILAR BULGES IN THE SIDEWALL TIRES ARE OBVIOUSLY FLAWED AND NEED REPLACEMENT I WANT CONTINENTAL TO KNOW THIS A SERIOUS AND RECURRING PROBLEM THAT OTHER PEOPLE HAVE MADE COMPLAINTS ABOUT.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/01/2006",
        "dateOfIncident": "04/01/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154339,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "SEAT BELTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I OWN AN AUDI A6, 2000. THE CAR HAS BEEN IN THE SHOP FOR OVER 18 MONTHS AND 2 1/2 YEARS FOR A RE-ACCRUING CHECK ENGINE LIGHT. FOR OVER 50,000 MILES THE CAR HAS BEEN SERVICED BY AUDI AND AUDI ONLY. RECENTLY THE CAR WENT OUT OF WARRANTY, HOWEVER THE CHECK ENGINE LIGHT IS STILL NOT RESOLVED AND BOTH FLOW AND AUDI HAVE WASHED THERE HANDS OF IT.     IN-ADDITION, I JUST RECENTLY LOST MY 4 AND 5 GEAR AND ONLY AFTER I TOOK THE CAR TO A DIFFERENT DEALER WE FOUND THAT FLOW AUDI HAS BEEN DOING BAD WORK ON THE CAR SUCH AS GLUING PARTS BACK TOGETHER (YES, GLUING PARTS ON A $55,000 CAR) AND INSTALLING VACUUM HOSES UP TO THE WRONG PARTS. IN-ADDITION, THEY STRIPPED OUT BOLTS AND LEFT THEM IN PLACE WITHOUT FIXING THEM, THESE BOLTS HOLD THE ENGINE TOGETHER AND IN-PLACE.  (ASK ME ABOUT MY TIMING BELT ISSUE, TO LONG OF A STORY TO WRITE ON A WEB-PAGE).     THE BOTTOM LINE IS AUDI AND FLOW AUDI REFUSE TO WARRANTY THE CAR ANY FURTHER, HOWEVER THE CHECK ENGINE LIGHT IS STILL NOT FIXED AND ITS SHOWING NEW CODES. I HAVE MUCH MORE INFORMATION... ALSO, ASK ME ABOUT MY A4 (BETTER STORY)    FLOW AND AUDI HAVE COST ME OVER 8,000.00 IN THE LAST TWO MONTHS AND I HAVE CALLED EVERYONE FROM THE TOP OF FLOW TO THE TOP OF AUDI. THERE IS NO CUSTOMER SERVICE AND NO RESPONSE. MY NEW MECHANIC IS WILL TO TALK AS WELL... THERE ARE NO LEMON LAWS AND THERE IS NO ONE TO HELP THE BUYER. IT SEEMS LIKE NO-ONE WILL TALK TO ME SINCE IM NOT BUYING A NEW CAR.  I REALLY NEED HELP AND ADVICE.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2006",
        "dateOfIncident": "03/18/2006",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153369,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING THE VEHICLE BECAME VERY SMOKY INSIDE.  THE POWER STEERING AND ALL THE DASH LIGHTS WENT OUT.   THE VEHICLE WAS PULLED OFF THE SIDE OF THE ROAD.  UPON INSPECTION IT COULD NOT BE DETERMINED WHERE THE SMOKE WAS COMING FROM.  THE VEHICLE WAS DRIVEN FOR A SHORT DISTANCE AND THE CAB FILLED WITH SMOKE AGAIN.  THE VEHICLE WAS PARKED AND THEN TOWED TO AN INDEPENDENT REPAIR SHOP.   AFTER INSPECTING THE VEHICLE THE BATTERY WAS ENGAGED; FLAMES WERE DETECTED FROM UNDER THE DASH BOARD.  THE FIRE DEPARTMENT WAS CONTACTED TO EXTINGUISH THE FIRE BUT NO INSPECTION WAS MADE TO DETERMINE THE CAUSE OF THE FIRE.  THE INSIDE OF THE VEHICLE WAS DESTROYED DUE TO FIRE AND SMOKE.  THE VEHICLE HAD RECALL REPAIRS PERFORMED IN JULY 2005 FOR THE ELECTRICAL SYSTEM.  THE NHTSA CAMPAIGN # 04V133000 CONCERNING THE ELECTRICAL SYSTEM.  THE MANUFACTURER HAS BEEN ALERTED.",
        "vin": "WAUED24B0YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/25/2006",
        "dateOfIncident": "06/12/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151207,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT CAME ON.  THE CODE FOR THE LIGHT INDICATED A FAILED CATALYTIC CONVERTER HAD FAILED, THIS WAS AT 78K MILES   THE DEALER SAID THAT IT MUST FAIL AGAIN BEFORE 80K MILE TO BE COVER UNDER WARRANTY.  IT FAILED AGAIN AT 87K MILE AND NOW THE DEALER WON'T REPLACE IT UNDER WARRANTY.  *NM",
        "vin": "WAUEH64B6YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/15/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150863,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FM (OR) OWNER OF AUDI VEHICLE DEFECTIVE ABS/BRAKE COMPUTER CONTROL MODULE SUGGEST NHTSA RECALL VEHICLES AND AUDI TO REPLACE ABS DEFECT AT THEIR EXPENSE REPLY TO THE PORTLAND, OREGON OFFICE.   *TS *JB",
        "vin": "WAUEH24B1YN"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/14/2006",
        "dateOfIncident": "01/15/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150213,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF THE FRONT LEFT TIE ROD AND CONTROL ARM IN A 2000 AUDI A6 QUATTRO.  SEVERE WOBBLE CAUSING NEAR ACCIDENT AND VEHICLE IN THE DITCH.  *NM",
        "vin": "WAUEH54BXYN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2006",
        "dateOfIncident": "12/30/2005",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147724,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED A RECALL NOTIFICATION WAS RECEIVED IN 2004 ON NHTSA CAMPAIGN ID # 04V133000, CONCERNING THE ELECTRICAL SYSTEM. THE RECALL WORK WAS PERFORMED BY THE DEALERSHIP; HOWEVER THE VEHICLE CAUGHT FIRE AND BURNED WHILE DRIVING. THE FIRE STARTED UNDER THE DASH ON THE DRIVER'S SIDE. THE FLAMES WERE FIRST NOTICED COMING FROM THE VENTS. THE FIRE DEPARTMENT WAS CONTACTED TO EXTINGUISH THE FIRE. THE MANUFACTURER WAS CONTACTED AND SENT A REPRESENTATIVE TO INVESTIGATE THE SCENE. THE REPRESENTATIVE COMMENTED THE RECALL WAS SUPPOSE TO PREVENT A FIRE FROM OCCURRING. THE DRIVER'S SIDE OF THE VEHICLE WAS SEVERELY DAMAGED AND THE INSURANCE COMPANY TOTALED THE VEHICLE. *NM",
        "vin": "WAUEH24B9YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/10/2006",
        "dateOfIncident": "12/19/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147381,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE VEHICLE LURCHED FORWARD AT A STOP SIGN.  THE ABS AND BRAKE LIGHTS ILLUMINATED.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT REPAIR SHOP AND THE ANTILOCK BRAKE CONTROL MODULE ASSEMBLY WAS  REPLACED.*AK",
        "vin": "WAUEH24B4YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2005",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146143,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUSE NUMBER 14 BLEW, DISABLING THE ELECTRIC WINDOWS AND MOONROOF. I CONSIDER IT DANGEROUS TO DRIVE WITH INOPERATIVE WINDOWS.  FOUR VISITS TO THE AUDI DEALER WERE REQUIRED BEFORE THE PROBLEM WAS SUCCESSFULLY FIXED. THE PROBLEM TURNED OUT TO BE THE LUMBAR SUPPORT MECHANISM IN THE PASSENGER FRONT SEAT CHAFING AND EVENTUALLY SHORT-CIRCUITING THE WIRING TO THE REAR FOOTWELL LIGHTS, WHICH RUNS THROUGH THE FRONT SEATS.  *JB",
        "vin": "WAUED64B7YN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/12/2005",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136243,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT  PURCHASED A 2000 AUDI A6 IN AUGUST 2003. THE VEHICLE HAD 93,000 MILES ON IT WHEN PURCHASED. THE  CONTACT WAS NOT SURE WEATHER OR NOT THE 90,000 MILES SERVICE WAS  COMPLETED BECAUSE HE WAS NOT SUPPLIED WITH SERVICE RECORDS BY AUDI. A LOCAL DEALER COMPLETED THIS WORK SEVERAL MONTHS AFTER THIS CAR WAS PURCHASED. LATER, THE VEHICLE FAILED INSPECTION BECAUSE OF WEAR ON THE CONTROL ARMS. THIS FAILURE OCCURRED IN JULY  2004. THE CONTROL ARMS WERE REPLACED BY A LOCAL REPAIR SHOP OR AUDI SPECIALIST, NOT THE DEALER. WITHIN A MONTH OF THE REPLACEMENT THE CONTACT  RECEIVED A RECALL NOTICE FOR THE CONTROL ARMS. CONTACTED AUDI, AND WAS INSTRUCTED TO SUBMIT THE REPAIR INVOICE TO AUDI.  NO ONE WAS CONTACTED FOR FOUR MONTHS. WHEN THE CONTACT FURTHER INQUIRED, HE WAS TOLD THE APPLICATION WAS DENIED BECAUSE AUDI CLAIMED THAT THEY WERE UNABLE TO CONTACT HIM BY PHONE. THE REIMBURSEMENT WAS REFUSED BECAUSE THEY VEHICLE SERVICE RECORDS WERE NOT INCLUDED. HOWEVER,  THE VEHICLE WAS PREVIOUSLY AN AUDI LEASE VEHICLE AND THE RECORDS SHOULD HAVE BEEN AVAILABLE THROUGH AUDI  WHERE THE CONTACT  PURCHASED THIS VEHICLE TROUGH A BROKER. *AK",
        "vin": "WAUED24B8YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "05/27/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126836,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER STATES THAT THERE IS A MODULE THAT IS FAILING ON  VEHICLE. THIS RESULTS IN THE ABS SYSTEM NOT WORKING.  TO REPLACE THE MODULE WOULD COST $1,000-$1,300.  CONSUMER HAS AN APPOINTMENT TO HAVE THE VEHICLE FIXED THIS FRIDAY.  THE PROBLEM HAS BEEN SPORADIC OVER THE LAST 6 WEEKS.  WHEN THE VEHICLE WAS TAKEN TO THE DEALERSHIP THEY COULD NOT FIND THE CAUSE OF THE  PROBLEM , AND HE WAS TOLD TO DRIVE IT UNTIL IT FAILED AGAIN.  CONSUMER WAS CONCERNED THAT THIS WAS HAPPENING ON OTHER VEHICLES. HE FOUND THIS INFORMATION ONLINE.*AK",
        "vin": "WAUED54B4YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,VISIBILITY,VEHICLE SPEED CONTROL,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/23/2005",
        "dateOfIncident": "06/16/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126377,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NEAR TOTAL LOSS OF POWER (INTERMITTENT) 17 ERROR CODES IN OBD. NEW TRIPTONIC TRANSMISSION 1 MONTH AFTER EXPIRATION OF WARENTEE. EXTENDED WARENTEE NEVER OFFERED BY AUDI. ERROR CODES INCLUDE THROTTLE HOUSING AND CAM ERROR. I HAVE SPENT NEARLY $7,000 IN 10 MONTHES ON MECHANICAL REPAIRS AND MECHANIC SAYS THAT I NEED APPROXIMATLY $6,300 MORE. AUDI SAID THAT I CAN HAVE THE DEALER RUN A DIGNOSTIC AT MY OWN EXPENSE. ADDITION TO THE $6,300 NEED. CHECK ENGINE LIGHT HAS CONSTANTLY COME ON SINCE PURCHASE. DEALER SIAD THAT HE ADVISES CUSTOMER MANY TIMES TO DISCONNECT LIGHT. CONSTANT REPAIRS SINCE OWNERSHIP. AUDI IS NOT HELPFULL.",
        "vin": "WAUBH24B7YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/13/2005",
        "dateOfIncident": "05/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125086,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES RUSTED AND WARPED ROTORS 5 TIMES IN 25000 MILES",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/03/2005",
        "dateOfIncident": "12/12/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108506,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 61,000 MILES TURBO CHARGER SHAFT SHATTERED RESULTING IN CATASTROPHIC FAILURE, IMMEDIATE LOSS OF OIL THROUGHOUT ENGINE AND EXHAUST, LOSS OF DRIVABILITY AND SERIOUS FIRE POTENTIAL.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/26/2005",
        "dateOfIncident": "04/06/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066663,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS THERE WAS A BURNING SMELL COMING FROM THE VEHICLE.   THE AIRBAG LIGHT BEGAN TO FLICKER ON AND OFF, AND THEN THE DRIVERS SIDE AIRBAG UNEXPECTEDLY DEPLOYED.  THE VEHICLE WAS TOWED TO THE DEALER. *MR  THE CONSUMER WAS TOLD THAT THE PROBLEM WAS A RESULT OF AN ELECTRICAL SHORT.  THE SHORT WAS CAUSED BY AN IMPACT UNDER THE VEHICLE.  THE CONSUMER HAS NO MEMORY OF ANY IMPACT UNDER THE VEHICLE.  *TC",
        "vin": "WAVED24B6YN"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/26/2005",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109461,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTALL PLASTIC COVER ON DRIVER'S SIDE SUPPORT ON CROSS MEMBER AND APPLY FELT TO LEFT CROSS MEMBER END. CHECK FRONT SUSPENSION LOWER CONTROL ARMS.   *BF  THE CONSUMER REQUESTED REIMBURSEMENT.  THERE WAS AN ELECTRICAL SHORT THAT DISABLED THE VEHICLE AND REQUIRED EXTENSIVE REPAIRS FOR SMOKE AND PARTS/WIRING REPLACEMENT.  THE ELECTRICAL SHORT ON THE DRIVER'S SIDE BEHIND THE DASH RESULTED IN SMOKE AND A STRONG BURNING PLASTIC SMELL.  RECALL#  04V133000.   *SC THE CONSUMER HAD TO PAY TO HAVE THE RUBBER BOOT AND UPPER CONTROL ARMS REPLACED EVEN THOUGH THERE WAS A RECALL FOR THE CONTROL ARMS.  *JB",
        "vin": "WAULH24BXYN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2005",
        "dateOfIncident": "12/28/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108634,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "04 V 133 000/WIRING HARNESS: CONSUMER NOTICE WHITE SMOKE AND A STRONG PLASTIC BURNING ODORS COMING FROM THE LEFT SIDE OF THE DASHBOARD. THE VEHICLE WAS TAKEN TO THE DEALER. THE DEALER REPLACED THE CLUSTER MODULE AND REPAIRS THE BURNED WIRES. WITHIN TWO MONTH THE PROBLEM HAS RECURRED. THE CONSUMER BROUGHT THIS RECALL INFORMATION TO THE DEALER ATTENTION. THE DEALER INFORMED THE CONSUMER THAT WAS NOT THE PROBLEM HIS VEHICLE WAS EXPERIENCING.  *NM",
        "vin": "WAULH24BXYN"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/17/2005",
        "dateOfIncident": "01/04/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106464,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS OUT OF WARRANTY.   VEHICLE HAS NEVER BEEN IN A ACIDENT.   AIR BAG LIGHT IN INSTRUMENT PANEL CAME ON.   TESTS BY AUDI DEALERSHIP AND INDEPENDENT REPAIR SHOP SHOW AIR BAG CONTROL MODULE NEEDED TO BE REPLACED.   INDEPENTED REPAIR SHOP REPLACED AIR BAG CONTROL MODULE AT COST OF $879.50 PLUS 6% TAX.     *JB",
        "vin": "WAUED24B6YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/12/2005",
        "dateOfIncident": "12/20/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106212,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS AND BRAKE LIGHTS COME ON.  TOLD BY DEALER THAT ABS CONTROL MODULE NEEDED TO BE REPLACED.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/28/2004",
        "dateOfIncident": "06/22/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100658,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH CATALYTIC CONVERTERS FAILED AT 78,000 MILES.    CALLED AND WROTE TO AUDI, WANTING THIS COVERED UNDER WARRANTY; WAS TOLD THREE DIFFERENT THINGS REGARDING COVERAGE (1.  'DON'T KNOW,\" 2.  7YEARS AND 70,000 MILES, 3.  8 YEARS AND 80,000 MILES.)  WAS REPEATEDLY REBUFFED.  COST $4600 TO FIX.  AUDI 2000 A6.  WROTE TO VICE PRESIDENT - AUDI OF AMERICA - AXEL MEESE - TWO MONTHS LATER RESPONSE SAID NO AGAIN AND QUOTED SOME OTHER WARRANTY (3 YEARS AND 50,000 MILES)  IN ALL MY YEARS OF CAR OWNING, I HAVE NEVER HAD ONE CATALYTIC CONVERTER FAIL, LET ALONE TWO.  I FEEL THAT THIS IS A DEFECTIVE CAR, AND THINK AUDI SHOULD COVER THE FAILURE OF THE CATALYTIC CONVERTERS.*AK",
        "vin": "WAULH24B2YN"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/22/2004",
        "dateOfIncident": "10/22/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096253,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE FAILURE OF BOTH TIE ROD ENDS AND ALL UPPER CONTROL ARMS IN FRONT SUSPENSION, RESULTING IN LOOSE STEERING, DIFFICULTY IN MAINTAINING LANE POSITION, AND VIBRATION IN STEERING WHILE DRIVING AND BRAKING.  ALL TIE ROD ENDS AND FRONT SUSPENSION UPPER CONTROL ARMS (4) REQUIRED REPLACEMENT; IF LEFT NOT REPLACED, POTENTIAL FOR CATASTROPHIC LOSS OF STEERING AND/OR SUSPENSION  COLLAPSE IF ANY ONE OF THE 6 AFFECTED BALL JOINTS FAIL. FURTHER FAILURE OF FRONT RIGHT WHEEL BEARING AS A RESULT OF SUSPENSION PLAY, AND EXCESSIVE ASYMMETRICAL WEAR ON FRONT TIRES. AUDI RECALLED ALL 1999 MODELS FOR THE IDENTICAL TIE ROD END RUBBER SEAL FAILURE (NHTSA CAMPAIGN 99V248000), AND ESSENTIALLY THE SAME SEAL DESIGN IS USED ON THE CONTROL ARMS. AUDI ONLY CHANGED THE TIE ROD DESIGN IN 2003 RS6, MEANING POTENTIALLY ALL 2000-2004 A6 (AND OTHER MODELS POTENTIALLY) ARE AFFECTED.  IN ADDITION AUDI INCREASED WHEEL SIZE AND WEIGHT SUBSTANTIALLY ON NEWLY INTRODUCED V8 A6 IN 2000, BUT DID NOT UPRATE THE SUSPENSION; THE 2003 RS6 CHANGE (ALSO A V8) IS FURTHER EVIDENCE OF AN EXCESS LOADING PROBLEM. OLD PARTS EXPECTED TO BE AVAILABLE.*AK",
        "vin": "WAUZL54B4YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/23/2004",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093079,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMAL DRIVING.  ABS UNIT FAILURE.  ABS UNIT NEEDS TO BE REPLACED.  *JB",
        "vin": "WAUED64B5YN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/23/2004",
        "dateOfIncident": "08/25/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094237,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS TAKEN TO THE DEALER FOR A ROUTINE INSPECTION.  THE MECHANIC INFORMED THE CONSUMER THAT THE UPPER BALL JOINTS NEEDED TO BE REPLACED DUE TO WORN OUT PARTS.   PLEASE PROVIDE FURTHER DETAILS.    *JB",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2004",
        "dateOfIncident": "01/14/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090579,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO BYPASS AND MASS AIRFLOW REPLACED NUMEROUS TIMES DURING THE FIRST 30K MILES. CAR IN THE SHOP EVERY 2K...FOR ONE THING OR ANOTHER.*AK",
        "vin": "WAUED24B0YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/26/2004",
        "dateOfIncident": "07/28/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088635,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IT IS MY BELIEF THAT THE WRONG SIZE REAR WHEEL ROTORS (DISCS) WERE INSTALLED AT THE FACTORY ON THIS CAR.  THERE ARE APPARENTLY TWO SIZES, ONE FOR THE SEDAN AND A LARGER SIZE FOR THE STATION WAGON.  MY STATION WAGON HAD BEEN GIVEN THW SMALLER SIZE.  *AK    I HAVE ASKED AUDI OF AMERICA TO INVESTIGATE THE ISSUE BUT THEY HAVE REFUSED BECAUSE THE ROTORS WERE REMOVED AND REPLACED BY AN INDEPENDENT GARAGE THAT ACTAUALLY FOUND THE PROBLEM.  POOR BRAKING HAD BEEN REPORTED TO THE SELLING AUDI DEALER ON FOUR PREVIOUS OCCASIONS;  7K MLES,17K MILES, 25K MILES, AND 33K MILES.  THEN, I JUST GAVE UP.    I HAVE THE ORIGINAL PADS AND INCORECT ROTORS IN A SEALED BOX FROM THE INDEPENDENT GARAGE.  I HAVE ALL MAINTANENCE RECORDS INCLUDING FOUR STATEMENTS OF POOR BRAKING MADE TO THE AUDI DEALER.  THE PROBLEM WAS NOT FOUND UNTIL THE REAR BRAKES WERE ACTUALLY LOOKED AT AND REPLSCED AT 115,000 MILES.    I AM CONCERED THAT THERE ARE OTHER AUDI  STATION WAGONS OUT THERE WITH THE SAME PROBLEM.    I WOULD LIKE AUDI TO REPAY ME FOR THE EXPENSE OF INSTALLING THE CORRECT REAR BRAKES.",
        "vin": "WAULH54BXYN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/22/2004",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088352,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 AUDI A6 QUATTRO.  PASSENGER COMPARTMENT HAS A PERSISTANT AND ODD ODOR CONSTANTLY.  IT IS NOT A MOISTURE OR MOLD SMELL NOR AN OIL OR GAS SMELL.  ALMOST AS IF FROM THE UPHOLSTERY.  ANYTHING TO DO WITH THE DISALLOWANCE OF CERTAIN LEATHERS PUT ON THE AUDI CARS IN GERMANY IN 2000 AND BEFORE AND DISALLOWED AFTER THAT?   *JB",
        "vin": "WAUEH24B9YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/17/2004",
        "dateOfIncident": "08/12/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088104,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P600",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE FAILURE; PIRELLI P6000 TIRES 255/40/17/ZR;  FOUR FAILURES IN 3 YEARS; THE INSIDE WALL SPLITS CAUSING A FLAT; IN THE LATEST, THE INSIDE WALL IS SO SEVERELY CRACKED, THAT THE RUBBER IS PULLING AWAY FROM THE TIRE;  TIRES ARE 10 MONTHS OLD, LESS THAN 15,000 MILES; MANUFACTURER REFUSES TO ACKNOWLEDGE PROBLEM.  *JB",
        "vin": "WAUZL54B3YN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/08/2004",
        "dateOfIncident": "07/24/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086390,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIE ROD END FAILURE. 2000 AUDI A6; 52,000 MILES. TIE ROD ENDS WERE PART OF A RECALL CAMPAIGN FOR 1998 AND 1999 MODEL YEARS (2000 WAS NOT INCLUDED), THE PART IS / WAS REPORTEDLY CORRECTED IN LATER MODEL YEARS. ONCE COVERED UNDER EXTENDED WARRANTY PROVISIONS EFFECTIVE 4/30/2004 AUDI NO LONGER CONSIDERS THIS A DEFECTIVE PART; NOW STATING THAT THIS IS \"NORMAL WEAR AND TEAR\". COMMENT- A SEARCH OF AUDI RELATED INTERNET FORUMS FIND MANY, MANY OWNERS STATING THAT THIS IS A COMMON FAILURE COMPONENT, RELATED TO SEPARATION OF THE RUBBER BOOT WHEREAS THE JOINT LUBRICANT IS CONTAMINATED AND RAPID WEAR IS EXPERIENCED. REPAIR COST, AS QUOTED BY DEALER, IS JUST UNDER $400. *AK",
        "vin": "WAULH54B8YN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/05/2004",
        "dateOfIncident": "07/15/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086228,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2000 AUDI A6 WITH 2.7T ENGINE.ILEAGE: 52000.FAILURE: DEALER DIAGNOSED ABS/CONTROLLER WAS BAD AND NEEDED TO BE REPLACED AT A COST OF $1300.00.  THE PROBLEM CAUSES INTERMITTENT ABS FAILURE WHICH WILL PULSATE BRAKES OCCASSIONALLY IN SITUATIONS WHERE BRAKING WOULD NOT REQUIRE ABS ACTIVITY (IE. LIGHT BRAKING TO SLOW VEHICLE SLIGHTLY ON DRY PAVEMENT).  THIS COULD SLOW BRAKING RESPONSE AND INCREASE CHANCES OF AN ACCIDENT OCCURING.    THIS PROBLEM IS COMMONLY DISCUSSED IN AUDI USER FORUMS AND APPEARS TO HAVE A FAIRLY HIGH OCCURENCE. *AK",
        "vin": "WAUED24B8YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/13/2004",
        "dateOfIncident": "09/10/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083453,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER REQUESTING ASSISTANCE FOR A MATTER DEALING WITH INTERAMERICANA TRANSPORT INDUSTRIES INC.*MR  AFTER A NEW TRANSMISSION WAS INSTALLED THE CONSUMER WAS STILL DISSATISFIED WITH THE PERFORMANCE OF THE VEHICLE.  OFFENSIVE ODORS HAVE BEEN EMITTING FORM THE VEHICLE.  THESE ODORS HAVE MADE SEVERAL MEMBERS OF THE CONSUMER'S FAMILY ILL.  THE DOOR DID NOT CLOSE PROPERLY.  *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/05/2004",
        "dateOfIncident": "03/17/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064582,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 AUDI A6 CHRONIC \"SERVICE ENGINE\" LIGHT ILLUMINATION; OIL LEAKS & VALVE GASKETS REPEATEDLY REPLACED (WITHIN 30 DAYS); BRAKE ISSUES/FRONT END VIBRATION; ENGINE ROUGH WHEN INITIALLY STARTED.  *JB",
        "vin": "WAUZL64B4YN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": "03/17/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063382,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 20 MPH  TIE ROD ASSEMBLY FAILED.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/24/2004",
        "dateOfIncident": "12/10/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054797,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIE ROD ENDS WEARING PREMATURELY DUE TO DEFECTIVE BOOT COVERS RESULT IN STEERING WHEEL WOBBLE AND STEERING DIFFICULTY.  *LA",
        "vin": "WAULH64B4YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/16/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054246,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 65K MILES, MY BABY DAUGHTER AND I WERE DRIVING 70 MPH DOWN VAIL PASS ON I70 IN COLORADO WHEN THE ENGINE LIGHT STARTS TO FLASH.  I THEN LOSE ALL POWER, BRAKES AND STEERING DUE TO A TOTAL ENGINE AND TURBO FAILURE.  THIS PROBLEM WAS DISCOVERED TO BE CAUSED BY A WATER PUMP FAILURE, CAUSING THE TIMING BELT TO FAIL, IN TURN CAUSING THE ENGINE TO COMPLETELY SEIZE.  AUDI REFUSED TO TAKE RESPONSIBILITY FOR ALL THE COSTS ASSOCIATED WITH REPLACING THE ENGINE AND DIDN'T LEND ANY CONCERN THAT THIS IS A SAFETY ISSUE.  I HAVE RESEARCHED VARIOUS CONSUMER SITES AND HAVE FOUND SEVERAL COMMENTS DESCRIBING THIS EXACT PROBLEM.   *CB",
        "vin": "WAUED54BXYN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "01/07/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053274,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GASOLINE LEAKING FROM FUEL TANK DUE TO DEFECTIVE SEAL, VEHICLE HAD ALREADY HAD TWO RECALLS FOR FUEL TANK PROBLEMS.  *CB",
        "vin": "WAUEH24B2YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2004",
        "dateOfIncident": "01/04/2004",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052614,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FIRE:  2000 AUDI A6 CAUGHT FIRE APPROXIMATELY 30 MINUTES AFTER BEING PARKED IN A GARAGE.  THE LOCAL FIRE DEPARTMENT DETERMINED THAT THE FIRE ORIGINATED FROM UNDER THE VEHICLE'S DASHBOARD...SIMILAR TO REPORTS MENTIONED IN NHTSA ACTION NUMBER EA03025.  THE AUDI WAS COMPLETELY DESTROYED, AS WERE A 2000 CHEVROLET CORVETTE THAT WAS PARKED NEXT TO THE AUDI, THE ENTIRE GARAGE, AND FINISHED BASEMENT.  THE REMAINDER OF THEHOME WAS SEVERLY DAMAGED BY SMOKE AND SOOT AND THE OCCUPANTS HAVE HAD TO LEAVE THE HOME UNTIL REPAIRS CAN BE MADE.  NO ONE WAS INJURED IN THE INCIDENT, AS NO ONE WAS IN THE HOME AT THE TIME OF THE INCIDENT.*AK",
        "vin": "WAUZL54B1YN"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049966,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR VIEW MIRROR LEAKED AN UNKNOWN FLUID.  MANUFACTURER AND DEALER WERE CONTACTED. THE CAUSE OF THE PROBLEM HAD NOT BEEN  IDENTIFIED. *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/06/2003",
        "dateOfIncident": "08/25/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037328,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BROKEN TIE RODS AT 40,000 MILES.  *AK",
        "vin": "WAUED54B6YN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/25/2003",
        "dateOfIncident": "08/25/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033488,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000,AUDI A6 , 2.7 ,   FRONT SUSPENSION PIECES NEED REPLACEMENT DUE TO WEAR AND TEAR AFTER 25000 MILES .SYMPTOMS ARE CRUNCHING NOISE WHILE STOPPING OR STARTING SLOWLY.  8AK",
        "vin": "WAUED24B9YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/15/2003",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031449,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES CHECK ENGINE LIGHT ILLUMINATED.  THE DEALER REFUSED TO SERVICE THE VEHICLE UNLESS THE CONSUMER PAID OUT OF POCKET, ALTHOUGH THE VEHICLE WAS TAKEN TO THE DEALER FOR SERVICE 3 DAYS PRIOR.  THE CONSUMER PAID FOR THE CHECK ENGINE LIGHT SERVICE, IN ADDITION TO THE DEFECTIVE THERMOSTAT, WHICH CAUSED THE VEHICLE TO OVERHEAT ONE MONTH AFTER THE WARRANTY EXPIRED.  SUBSEQUENTLY, THREE DAYS AFTER THAT SERVICE, THE CHECK ENGINE LIGHT ILLUMINATED AGAIN.  *AK  *SCC  *NLM",
        "vin": "WAU2L54B0YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/12/2003",
        "dateOfIncident": "06/12/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022924,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE  CHECK LIGHT IS ON. DEALER HAS INSPECTED  VEHICLE FIVE TIMES AND COULD NOT DUPLICATE OR CORRECT THE PROBLEM. *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/08/2003",
        "dateOfIncident": "04/28/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018434,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "ENERGY MXV4 PLUS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TWO SEPARATE TIRE FAILURES FROM SAME BRAND/TYPE OF ORIGINAL EQUIPMENT TIRES, FIRST: JANUARY 22, 2003, SECOND: APRIL 28, 2003     BOTH WERE SIDEWALL BLOWOUTS.  THE FIRST, ON THE RIGHT FRONT WHEEL IN JANUARY 2001, DID NOT POSE A SAFETY HAZARD AS IT OCCURRED WHILE THE CAR WAS PARKED IN A GARAGE.  HOWEVER, THE 2ND, ONLY THREE MONTHS AFTER THE FIRST, OCCURRED ON A DIFFERENT WHEEL (RIGHT REAR) AT 60 MPH IN THE MIDDLE LANE OF A CONGESTED PORTION OF I-95 NEAR MILFORD, CT.  THE LATTER CLEARLY POSED A VERY SERIOUS SAFETY HAZARD TO US, AND TO ALL OTHER VEHICLES ON THIS HEAVILY-TRAFFICKED INTERSTATE.   I DID NOT REPORT THE FIRST BLOWOUT, BELIEVING THAT PERHAPS I HAD HIT SOMETHING ON THE ROAD.  BUT THE SECOND BLOWOUT OF SAME BRAND/VINTAGE TIRE, THIS TIME ON REAR RIGHT SIDE, INDICATES A LIKELY SAFETY DEFECT IN THIS EXPENSIVE MICHELIN TIRE.     *NLM",
        "vin": "WAULH54B9YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014871,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE OIL LEAKS, THE CONSUMER HAD TO REPLACE THE TURBO(S) AT 37000 MILES AND NEEDED A NEW TURBO(S) AGAIN, AND THE ENGINE AND BRAKE LIGHTS APPEARED ON DIFFERENT OCCASIONS.  DEALER STATED THE OIL  WASN'T CHANGED REGULARLY.  THE INITIAL TURBO(S) WERE REPLACED WITH THE OLD OIL BECAUSE THE NEW OIL WASN'T COVERED UNDER WARRANTY.  THE SERVICE DEALER STATED THAT 1 OUT OF 15 VEHICLE'S HAVE THE SAME PROBLEM.  MR  SCC   *JB",
        "vin": "WAUED2467YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "10/17/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014110,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO, 2000 A6 HAS AN AUXILIARY FAN ON THE 2.8 ENGINE. MY AUDI WAS IN WARRANTY ON 10/17/02, AND IT WAS BROUGHT TO THE DEALER. THE DEALER WAS UNABLE TO DUPLICATE THE PROBLEM. THE PROBLEM IS THE FAN MAKES ALOT OF NOISE, AND THE FAN SMELLS LIKE A FIRE IS HAPPENING..NOW THE LOCAL DEALER, WAGNER AUDI IN BOYLOSTON, MA CHECKED THE CAR, AND WILL NOT COVER IT UNDER WARRANTY.. THIS SHOULD BE CHECKED OUT BEFORE SOMEONE IS HURT IN A FIRE FROM THIS AUDI A6 PROBLEM.  THANKS,  DON MELANSON.    *NLM",
        "vin": "WAUEH54B6YN"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/02/2003",
        "dateOfIncident": "02/06/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013868,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOWS ROLL DOWN BY THEMSELVES. I HAVE HEARD FROM MANY SOURCES, THAT THIS IS A VERY COMMON PROBLEM WITH VOLKSWAGEN PASSAT'S, AND AUDI'S. THE FIX IS REPLACING THE REGULATOR, AT A VERY HIGH COST. THIS PROBLEM SHOULD BE PERMANENTLY FIXED, AS IT IS A HAZARD TO BE DRIVING DOWN THE HIGHWAY IN A STORM AT 65 MILES AN HOUR, AND HAVE ALL THE WINDOWS START OPENING. THIS WILL GO ON, EVERY MINUTE OR SO. SHOULD BE FIXED, PRIOR TO PEOPLE GETTING INTO ACCIDENTS.   *NLM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2003",
        "dateOfIncident": "05/23/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010784,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN COMPLAINING TO AUDI SERVICE ABOUT A NOISE IN THE STEERING. THIS WAS REPORTED TO THEM IN MAY OF 2002. 43,769 MILES. I WAS TOLD NO PROBLEM FOUND. I BROUGHT THIS TO THEIR ATTENTION AGAIN IN JUNE OF 2002. 48,743. NO PROBLEM FOUND. IN JAN. 2003 I BROUGHT THIS TO THEIR ATTENTION AGAIN. THEY HAD TO REPLACE THE TIE RODS.  I WAS TOLD AT THIS POINT DUE TO THE MILEAGE ON MY CAR I HAD TO PAY FOR REPAIRS. IN DOING  FURTHER RESEARCH, I DISCOVERED  THE 1999 AUDI A6 HAD A RECALL FOR  TIE RODS. I FEEL THIS MATTER OF THE TIE RODS FOR THE 2000 A6 AUDI SHOULD BE LOOKED INTO. *JB",
        "vin": "WAUEH24B5YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2003",
        "dateOfIncident": "01/06/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010522,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CYLINDER HEADS (V-6, 2.7 LITER, 5-VALVE) ARE LEAKING OIL FROM THE ENDS IN AN AREA WHICH IS PLUGGED WITH A \"BALL SEAL\" PRESSED IN PLACE DURING MFG.  OIL DRIPS ONTO EXHAUST CAUSING CAUSING MODERATE TO SEVERE SMELL OF BURNING OIL INSIDE AND AROUND VEHICLE.  DEALER MECHANICS WERE ABLE TO LOCATE PROBLEM BY INSERTING SPECIAL DYE IN THE OIL AND CHECKING WITH A BLACKLIGHT, AND STATE HEADS NEED TO BE REPLACED. DEALER DENIES DEFECT AND SUGGESTS THIS AS A NORMAL WEAR ITEM, BUT THERE ARE NO MOVING PARTS.  I AM WORRIED ABOUT COMPLETE FAILURE OF THE SEALS RESULTING IN OIL/OIL PRESSURE LOSS, EXTENSIVE ENGINE DAMAGE AND/OR FIRE.   *NLM",
        "vin": "WAUED24B9YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "12/31/2002",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002614,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A-6 YR 2000  WHILE  DRIVING THE CAR MY HUSBAND EYES BECAME IRRITATED,  SMELT SOMETHING BURNING, SHORTLY AFTER, SMOKE BLEW-OUT FROM THE LEFT AIR VENT INTO THE CAR AND THEN FIRE SPARKS.  AS THE CAR WAS MOVING,  HE NOTICED THE SMOKE,  SLOWED DOWN,  FORCED THE GEAR INTO PARK AND DASH OUT OF CAR.  THE FIRE SPREAD FROM THE FRONT TO THE REAR OF THE VEHICLE, CAUSING AN ESTIMATED $22,000 LOSS WHICH IS A TOTAL LOSS.  THE GEORGIA, DEKALB COUNTY FIRE SERVICES - INCIDENT REPORT NUM. 02-049367 WHICH WAS EXAMINED BY THE FIRE CHIEF CLEARLY STATE THE AREA OF FIRE ORIGIN CAME FROM OPERATING, CONTROL AREA (FUES BOX) AND FORM OF MATERIAL IGNITED WAS ELECTRICAL WIRE (FAULTY WIRING).  OUR INSURANCE COMPANY IS NOW INVESTIGATING AND HAS ALSO DETERMINED A TOTAL LOSS.   CALLED AUDI CORPORATE AND FILED A COMPLAINT ABOUT THIS TOTAL FINANCIAL LOSS AND OUR CONCERN OF FAULTY WIRING THAT CAN POSSIBLY CAUSE DEATH OR BODILY INJURY TO OTHER CAR OCCUPANTS, WITHOUT ANY PRIOR WARNING. AUDI HAS NOT CALLED US BACK AND HAS NOT TAKEN ANY ACTION AS OF 13 DAYS AFTER THE INCIDENT.  LUCKILY MY HUSBAND ESCAPED THIS FIRE HAZARD CAR, BUT WILL SOMEONE ELSE BE AS LUCKY.",
        "vin": "WAUBH24BXYN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2002",
        "dateOfIncident": "09/15/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022676,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING AT HIGHWAY SPEED THE TRANSMISSION SLIPS AND HAVE HARD SHIFTING CAUSING THE VEHICAL TO STALL. PROVIDE ANY ADDITIONAL INFORMATION.   MR",
        "vin": "PLEASE PROV"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/08/2002",
        "dateOfIncident": "11/07/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022537,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED: THE VEHICLE BRAKE PADS WORN EXCESSIVELY PREMATURE. CAUSING TO STOP THE CAR VIOLENT. DEALER HAS BEEN NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION.       TS",
        "vin": "PLEASE FILL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/01/2002",
        "dateOfIncident": "07/02/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015350,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 60MPH  FRONT RIGHT TIRE BLEWOUT,  CAUSING CONSUMER TO PULL OVER. DEALER NOTIFIED. SIZE 25540ZR17 PLEASE PROVIDE THE DOT#.*AK",
        "vin": "PLEASE PROV"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/27/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763555,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I THINK IT'S SILLY THAT THEY CAN PRODUCE A CAR WHOSE FRONT BUMPER DOESN'T CLEAR THE CONCRETE BUMPERS IN PARKING LOTS.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/19/2002",
        "dateOfIncident": "02/01/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 760925,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR MAKES A WHINING NOISE ON COLD START.  IT HAS BEEN IN FOR REPAIRS SINCE MARCH 2, 2002.  ZAUMBACH OF MANHATTAN HAS REPLACED THE ENGINE, TURBOS AND WATER PUMPS DUE TO POSSIBLE LEAK.  THEY CANNOT REPAIR THE CAR, THEY SAY THE NOISE IS STILL PRESENT.  NO ONE KNOWS WHAT THE PROBLEM IS AND IT MAY BE DANGEROUS.*AK",
        "vin": "WAUED64B4YN"
    },
    {
        "components": "EXTERIOR LIGHTING,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/18/2001",
        "dateOfIncident": "09/17/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752315,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT \"BUZZ\" SOUND (UP TO 3 SECONDS) WHEN USING TURN SIGNAL (EITHER SIDE)- DEALER SAYS CANNOT FIGURE OUT PROBLEM, THOUGH THEY HAVE HEARD \"BUZZ\"; TRUNK LATCH DOES NOT CLOSE UNLESS SHUT REALLY HARD- SOMETIMES IT DOES NOT LATCH AND WHILE I AM DRIVING, THE TRUNK SYMBOL SHOWS UP ON THE FRONT DASH; INTERMITTENTLY, FRONT DASH RADIO STATION DISPLAY GOES BLANK. *AK (TIRESIZE: 17)",
        "vin": "WAUZL54B2YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/18/2001",
        "dateOfIncident": "09/26/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752341,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VIBRATION OR CHUCKLE FELT BETWEEN 45MPH AND 75MPH IN FLOOR NEAR THROTTLE AND IN SEAT OF PASS, ALSO FELT WHEN CLIMBING /DECLINING  ON HIGHWAY,AT HIGHWAY SPEED. STARTED AT DAY ONE OF BUYING THIS $52,000 VEHICLE. 12 VISITS TO DEALER FOR SAME REPAIR,10 TIRES REPLACED AND OTHER PARTS.. AUDI NO HELP!*AK",
        "vin": "WAUZL54B6YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/08/2001",
        "dateOfIncident": "08/08/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750101,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE DISINTEGRATED.  TREAD SEPARATED COMPLETELY FROM SIDEWALLS, LEAVING ONLY A SMALL PORTION OF SIDEWALL ON RIM.*AK",
        "vin": "WAUED54B0YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/08/2001",
        "dateOfIncident": "08/08/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750101,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE DISINTEGRATED.  TREAD SEPARATED COMPLETELY FROM SIDEWALLS, LEAVING ONLY A SMALL PORTION OF SIDEWALL ON RIM.*AK (TIRESIZE: 215/55HR16)",
        "vin": "WAUED54B0YN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2001",
        "dateOfIncident": "01/29/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750026,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TORSEN PART(S) IN THE AWD SYSTEM ARE DEFECTIVE THUS CAUSING A NOTICEABLE VIBRATION AT SPEEDS OF 40-80MPH.  THE VIBRATION CAN VARY FROM SIGNIFICANT TO SLIGHT DEPENDING ON AMBIENT TEMP, VEHICLE/PART TEMP, SPEED, ACCELERATION PROFILE, AND LENGTH OF TIME AT CRUISE.  MANUFACTURER IS AWARE OF THE PROBLEM BUT WILL NOT ACKNOWLEDGE OFFICIALLY THAT IT PRESENTS A SAFETY HAZARD.  IT COULD ULTIMATELY LEAD TO A CATASTROPHIC FAILURE OF THE PART AT SPEED AND SUBSEQUENT LOSS OF CONTROL AT HIGH SPEED.*AK",
        "vin": "WAUED54B0YN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2001",
        "dateOfIncident": "01/29/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750026,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TORSEN PART(S) IN THE AWD SYSTEM ARE DEFECTIVE THUS CAUSING A NOTICEABLE VIBRATION AT SPEEDS OF 40-80MPH.  THE VIBRATION CAN VARY FROM SIGNIFICANT TO SLIGHT DEPENDING ON AMBIENT TEMP, VEHICLE/PART TEMP, SPEED, ACCELERATION PROFILE, AND LENGTH OF TIME AT CRUISE.  MANUFACTURER IS AWARE OF THE PROBLEM BUT WILL NOT ACKNOWLEDGE OFFICIALLY THAT IT PRESENTS A SAFETY HAZARD.  IT COULD ULTIMATELY LEAD TO A CATASTROPHIC FAILURE OF THE PART AT SPEED AND SUBSEQUENT LOSS OF CONTROL AT HIGH SPEED.*AK",
        "vin": "WAUED54B0YN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/07/2001",
        "dateOfIncident": "01/29/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750026,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TORSEN PART(S) IN THE AWD SYSTEM ARE DEFECTIVE THUS CAUSING A NOTICEABLE VIBRATION AT SPEEDS OF 40-80MPH.  THE VIBRATION CAN VARY FROM SIGNIFICANT TO SLIGHT DEPENDING ON AMBIENT TEMP, VEHICLE/PART TEMP, SPEED, ACCELERATION PROFILE, AND LENGTH OF TIME AT CRUISE.  MANUFACTURER IS AWARE OF THE PROBLEM BUT WILL NOT ACKNOWLEDGE OFFICIALLY THAT IT PRESENTS A SAFETY HAZARD.  IT COULD ULTIMATELY LEAD TO A CATASTROPHIC FAILURE OF THE PART AT SPEED AND SUBSEQUENT LOSS OF CONTROL AT HIGH SPEED.*AK",
        "vin": "WAUED54B0YN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/07/2001",
        "dateOfIncident": "10/27/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 562447,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A RED LIGHT, CONSUMER WAS STRUCK HEAD ON BY A TRUCK, AIR BAGS FAILED TO DEPLOY, CONSUMER SUFFERED NECK INJURIES AND VEHICLE WAS DEEMED A TOTAL LOSS.*JB  (ATTORNEY FOR CLIENT).",
        "vin": "WAUEH24B7YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2001",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 749360,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL INSTRUMENT CLUSTER WHICH WAS BACKLIT UNDER ALL RUNNING CONDITIONS NIGHT AND DAY WAS REPLACED W/ NON-BACKLIT CLUSTER DUE TO A SEPARATE FAILURE IN THE CLUSTER.  UNLIKE OTHER CARS, THIS CLUSTER HAS NO LUMINESCENT MATERIAL ON THE INSTRUMENT FACE TO MAKE INSTRUMENTS READABLE UNDER DIFFICULT LIGHTING CONDITIONS; WITH BACKLIGHTING IT IS NO PROBLEM.  WITHOUT IT IS DIFFICULT TO SEE AND DANGEROUS WHEN UNDER TREES, IN SHADE, WITH SUN AT CERTAIN ANGLES, ETC. THE BACKLIT CLUSTER WAS REPLACED DUE TO A SEPARATE FAILURE AND MANUFACTURER AND REPAIRING DEALER STATE BACKLIT VERSION IS NO LONGER AVAILABLE DUE TO A RUNNING CHANGE IN MANUFACTURING. I HAVE HEARD IT RUMORED VARIOUSLY THIS WAS DONE BECAUSE PEOPLE DIDN'T KNOW THEIR LIGHTS WEREN'T ON AT NIGHT, FORGOT TO TURN THEM OFF IF THEY HAD THEM ON IN THE DAYTIME, OR BECAUSE THE EXPENSIVE LED LIGHTING USED WAS FAILING PREMATURELY REQUIRING REPLACEMENT OF THE WHOLE $650 CLUSTER, OFTEN AT THE MANUFACTURER'S WARRANTY EXPENSE.  REGARDLESS, THE CHANGE HAS MADE THE INSTRUMENT PANEL UNSAFE IN EVERYDAY CONDITIONS DUE TO ITS DESIGN PECULIARITIES WITH NO LUMINESCENCE AND PRIOR DEPENDENCE ON BACKLIGHTING.  I UNDERSTAND OTHERS WHO HAVE DRIVEN THE CAR WITH THE BACKLIT FEATURE HAVE THE SAME COMPLAINT ABOUT THE NEWER NON-BACKLIT VERSION.*AK",
        "vin": "WAUZL54B4YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/15/2001",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748476,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "4 TIRES BUBBLED DURING NORMAL DRIVING CONDITIONS",
        "vin": "WAUZL54B0YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747230,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DATE I PURCHASE THE CAR I REALIZE THE INTRUMENT CLUSTER LOCATE IN THE CENTER OF THE INTRUMENT DID NOT LIGHT UP ALL THE INFORMATION UNDER THE SUN LIGHT, THE DEALER REPLACE THE PART AND THE SAME PROBLEM HAPPEN AGAIN, I REQUEST THE DEALER TO REPLACE IT , THEY SAY THEY ONLY GET THE PART FROM AUDI, THEY DO NOT KNOW WHEN THE PARTS COME WILL WORK OR NOT, THEY SAID THEY WILL REPLACE UNTIL I THINK IT LOOK RIGHT, I GOT VERY UPSET THE ATTITUDE OF THE DEALER, SO I CALLED THE AUDI CLIENT RELATION OFFICE, THE SAME KIND OF  ATTITUDE AND NON RESPONSIBLE ANSWER, THE CLIENT RELATION SAID WHAT  MY PROBLEM, THEY WILL REPLACE TILL IT FIX, BUT THEY CANT TELL HOW LONG, SO I HAVE TO KEEP DRIVING MY CAR WITH A  ALMOST UNREADABLE INSTRUMENT THAT TELL ME ALL THE VITALE INFORMATION OF MY CAR. AFTER I HAVE THE CAR FOR MORE THAN ONE MONTH LATER, I REALIZE THAT THE WINDOW ON THE FRONT RIGHT HAVE PROBLEM GETTING UP AND DOWN, SO I WENT INTO THE DEALER IN THE MORNING WITHOUT MAKING A APPOINTMENT, TOLD THEM THE PROBLEM THEY REPLACE THE WINDOW REGULATOR IN 2 HOURS, A FEW MONTH GONE BY, MY DRIVER SIDE WINDOW HAVE PROBLEM, I WENT IN IN THE MORNING WITHOUT APPOINTMENT AND THEY REPLACE THE WINDOW  REGULATOR . SO I ASK THEM IS SOMETHING THAT HAPPEN TO ALL THE AUDI OR JUST THE MY CAR, THEY SAY JUST MY CAR. THEN I TALK TO A VW DEALER WHERE I LIVE , HE SAID THEY BEEN REPLACING THE WINDOW REGULATOR IN VW PASSAT TOO. MY CONCERN IS IFN THERE IS A PROBLEM WITH THE REGULATOR IN MY AUDI, WHY DONT THEY INFORM US, BECAUSE  MY CAR EQUIP WITH A AUTOMATIC DOWN AND UP  WINDOW SWITCH, IF THIS SWITCH DID NOT WORK PROPERLY IT MIGHT HURT SOMEBODY.*AK",
        "vin": "WAUBH24B6YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/30/2001",
        "dateOfIncident": "12/14/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9002712,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE FLAT, ONE BLOWOUT AND FOUR SEVERE LOSS OF TIRE PRESSURES (INCLUDES THE FLAT AND BLOWOUT.  OUT TEMPERATURES WERE BELOW 30F. OEM TIRE EXPERENCED SEVERE 50% LOSS OF PRESSURE.",
        "vin": "WAULH24B2YN"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878892,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAN BE DRIVEN AS  MANUAL OR AUTOMATIC. WHEN DRIVEN AS AN AUTOMATIC VEHICLE SLIPS OUT OF GEAR. THIS IS DUE TO A WIRE HARNESS GONE BAD. DEALER TOLD THIS TO CONSUMER.*AK",
        "vin": "WAUZL54BXYN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/04/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877434,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING  ABS BRAKES  PEDAL GOES TO THE FLOOR, CAUSING EXTENDED STOPPING DISTANCE. PLEASE GIVE ANY FURTHER DETAILS.*AK",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2000",
        "dateOfIncident": "03/24/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738119,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PRESSURE WARNING INDICATOR COMES ON FREQUENTLY. REPORTED 3 TIMES, NOT YET FIXED. *AK",
        "vin": "WAUED54B4YN"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/19/2000",
        "dateOfIncident": "02/10/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738014,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END VIBRATION CAUSING EXCESSIVE TIRE WEAR.  MANUFACTURER REFUSES TO ACCEPT RESPONSIBILITY BY IGNORING WHAT MAY BE A SAFETY DEFECT.  *AK",
        "vin": "WAUEH24B6YN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/06/2000",
        "dateOfIncident": "09/01/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735819,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES ARE CUPPING, RESULTING IN HEAVY WEAR, NOISE AND VIBRATION.  CAUSE IS IMPROPER ALIGNMENT OR SUSPENSION WEAR.  DEALER AND MANUFACTURER HAVE NOT RESPONDED TO REQUEST FOR CORRECTION. (TIRESIZE: P20555R16)( DOT NUMBER:  TIRE SIZE: P20555R16 )",
        "vin": "WAUEH24B9YN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/01/2000",
        "dateOfIncident": "09/01/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735547,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE YEAR OLD TIRES CUPPING, RESULTING IN HEAVY WEAR, NOISE & VIBRATION.  CAUSED BY IMPROPER ALIGNMENT OR SUSPENSION WEAR.  DEALER HAS NOT RESPONDED WITH CORRECTION.*AK (TIRESIZE: P20555R16)( DOT NUMBER:  TIRE SIZE: P20555R16 )",
        "vin": "WAUEH24B9YN"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/29/2000",
        "dateOfIncident": "07/01/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735412,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK ON AUDI DOES NOT CLOSE WITHOUT USING EXTREME FORCE TO LATCH.  DEALER REPORTS ENCOUNTERING PROBLEM ON SEVERAL NEW AUDI 2000 A6",
        "vin": "WAUED54BXYN"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/19/2000",
        "dateOfIncident": "06/07/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 556706,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIO CHANGES STATIONS WHEN THE CAR IS FIRST STARTED IN THE MORNING.  *MJS",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/19/2000",
        "dateOfIncident": "06/07/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 556706,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT END ALIGNMENT WAS OUT OF SPECIFICATION CAUSING EXCESSIVE TIRE WEAR, CONSUMER WAS HAVING TROUBLE OBTAINING A SERVICE CALL FROM THE DEALERSHIP.  *MJS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2000",
        "dateOfIncident": "06/07/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 556706,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL FUSE PANEL HAS A SHORT IN IT WHICH BLOWS FUSES.  *MJS",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/18/2000",
        "dateOfIncident": "04/06/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731795,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER HAS ATTEMPTED TO BALANCE THESE TIRES ON THREE SEPARATE OCCASIONS WITHIN PAST 4 MONTHS WITHOUT SUCCESS.( DOT NUMBER:   TIRE SIZE: P205/55/16 )",
        "vin": "WAUED54B2YN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 869495,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY VEHICLE WILL NOT START.  WHEN IT DOES START IT, RUNS ON A LIMP.  DEALER HAS NOT BEEN ABLE TO DUPLICATE OR CORRECT THE PROBLEM.  *AK",
        "vin": "WAUED24BXYN"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/14/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9001872,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WOULD INTERMITTENTLY SWITCH FROM NORMAL EFFORT TO A VERY LIGHT TWITCHY MODE.  MANUFACTURER REFUSES TO CORRECCT PROBLEM DUE TO INTERMITTENT NATURE.",
        "vin": "WAUED24B4YN"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/07/2000",
        "dateOfIncident": "04/06/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9001888,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICE A REAR SUSPENSION PROBLEM WHILE ON A ROAD TRIP, THE CRUISE CONTROL DOES NOT DISENGAGE UNLESS THE BRAKE IS PUSHED ALMOST OT THE FLOOR AND THE CAR IS STOPPED, BRAKE LIGHTS DO NOT GO ON UNLESS YOU STEP ON THE BRAKES VERY HARD, ENGINE ACCELERATION THE ENGINE GOES FULL THROTTLE AND \"TAKES OFF\"",
        "vin": "WAUZL6481YN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/19/2000",
        "dateOfIncident": "04/01/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 725667,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR AN UNKNOWN REASON, WHEN THE VEHICLE IS SHUT DOWN AFTER DRIVING, THEN IT'S RE-STARTED THE ENGIN IDLES ROUGH. AT THAT TIME THE ENGINE CHECK LIGHT COME ON, AND THE ENGINES POWER IS REDUCED. IT WON'T GO FASTER THAN 15 MPH.",
        "vin": "WAUED24BXYN"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/28/2000",
        "dateOfIncident": "12/01/1999",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 724726,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS CAR FOR ONLY SLIGHTLY MORE THAN 6 MONTHS, AND HAVE HAD NO COLLISIONS OR OTHER UNUSUAL IMPACTS TO TIRES.  AFTER ONLY 800 MILES OF SERVICE, MY RIGHT FRONT TIRE DEVELOPED A BULGING KNOT IN THE SIDEWALL.  DEALER INSPECTED THE TIRE AND COULD FIND NO INDICATION OF \"IMPACT\" INJURY SO TIRE WAS REPLACED UNDER WARRANTY, AS VEHICLE WAS ONLY 2 WEEKS OLD.  NOW I HAVE DISCOVERED 3 MORE OF THE TIRES (LF, RF & RR) HAVE DEVELOPED SIMILAR BULGING KNOTS IN THE SIDEWALL, ONE OF WHICH IS THE TIRE THAT WAS REPLACED BY THE DEALER AT 800 MILES.  I DRIVE ONLY ON PAVED CITY STREETS, AND HAVE NEVER EXPERIENCED TIRE FAILURES OF THIS TYPE ON ANY OTHER VEHICLE THAT I HAVE OWNED, SO I DO NOT BELIEVE THAT THIS CONDITION IS DUE TO DRIVING CONDITIONS.*AK( DOT NUMBER: DMCE22D TIRE SIZE: 255/40ZR17 )",
        "vin": "WAUZL64B7YN"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2000",
        "dateOfIncident": "06/01/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 864041,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS GAUGE MALFUNCTIONED, PREVENTING OWNER FROM IDENTIFYING WHAT THE CORRECT FUEL READING WAS. CONSUMER HAS CONTACTED  DEALER.  RECALL NUMBER 00V137000,  CONSUMER HAS YET TO BE CONTACTED. *AK *ML",
        "vin": "WAULH24B6YN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/20/2000",
        "dateOfIncident": "04/16/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721698,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS SERVICE FOR THE TRIP FROM SARATOGA SPRINGS, NY TO HILTON HEAD,SC.  TWO DAYS AFTER I HAD MADE THIS 1000 MILE TRIP THE INCIDENT OCCURRED.  MY CAR WAS RUNNING FINE AND I STOPPED FOR GAS.  WHEN I PULLED OUT OF THE GAS STATION ONTO VERY BUSY HIGHWAY. *AK",
        "vin": "WAUED24B5YN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/17/2000",
        "dateOfIncident": "01/17/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 720228,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS NOT BEEN A FATAL FAILURE, BUT PARTS DO NOT WORK PROPERLY. NO SAFETY DEFECT LISTED IN THE SUMMARY.  *AK",
        "vin": "WAUED54B3YN"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2000",
        "dateOfIncident": "03/04/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 719786,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE REGISTERS EMPTY AFTER FILLING WITH 18 GALLONS FROM TRUE EMPTY STATE;AFTER 100 MILES GAUGE NOW REGISTERS FULL CONSTANTLY.  *AK",
        "vin": "WAUED24B3YN"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "03/02/2000",
        "dateOfIncident": "01/29/2000",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 719573,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOV EVEHICLE.  *AK",
        "vin": "WAUED24B1YN"
    }
]