[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "03/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL WAS POURING OUT FROM THE TOP PORTION OF THE FUEL TANK, ON MY YEAR 2000 CHEVROLET SUBURBAN 2500 WHERE THE LINE GOES INTO THE PUMP AT THE TANK. THERE WAS A SERIOUS POTENTIAL FIRE HAZARD FROM FUEL POURING ONTO THE EXHAUST SYSTEM WHILE DRIVING.  I HAD A CERTIFIED SERVICE STATION REMOVE THE FUEL TANK, AND PERFORM A SMOKE TEST. THEY FOUND THE LEAK COMING FROM THE FUEL PUMP ASSEMBLY. REPLACED FUEL PUMP ASSEMBLY, AND FUEL FILTER AS RECOMMENDED. REINSTALLED TANK, AND ROAD TESTED FOR ANY LEAKS, NONE FOUND. TOTAL PARTS, TAX, AND LABOR CAME TO $935.05.  *TR",
        "vin": "3GNGK26U7YG"
    },
    {
        "components": "STEERING,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "03/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705945,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED MY 2000 CHEVROLET - SUBURBAN K2500 VEHICLE PULLING TO THE LEFT AT LIGHT TO MODERATE BRAKING. NOTICED OIL LIKE STAINS TO UNDER SIDE OF DRIVERS FRONT WHEEL WELL AREA. I HAD IT INSPECTED BY A CERTIFIED SERVICE STATION. DURING INSPECTION THEY FOUND A LEAK COMING FROM THE BRAKE HYDRO BOOSTER, AND POWER ASSIST HIGH PRESSURE HOSES. I WAS TOLD THAT THE HYDRO BOOSTER NEEDED REPLACING, ALONG WITH THE TWO LINES COMING FROM THE HYDRO BOOSTER, AT A COST OF $1200.00. I WAS TOLD THAT THE DRIVER COULD LOSE COMPLETE POWER ASSIST TO THE STEERING AND BRAKES, CAUSING A POTENTIALLY HAZARDOUS DRIVING CONDITION. G.M. IS RESPONSIBLE FOR MAINTAINING RELIABLE SAFETY COMPONENTS FOR ALL THEIR VEHICLES. UNDER THE NHTSA CAMPAIGN ID NUMBER: 05V005000, UNDER THE NOTES SECTION: GM CAMPAIGN NO. 05001. THIS ACTION IS DEEMED A SAFETY IMPROVEMENT CAMPAIGN AND IS NOT BEING CONDUCTED UNDER THE SAFETY ACT. THE COMPANY HAS INFORMED NHTSA THAT IT WILL PROVIDE THE MODIFICATIONS DESCRIBED ABOVE FREE OF CHARGE.  *TR",
        "vin": "3GNGK26U7YG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/01/2015",
        "dateOfIncident": "07/20/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691324,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT OUR 2000 SUBURBAN IN 2002 WITH ONLY 3000 MILES .THIS WAS A SECRET SERVICE FLEET VEHICLE WITH HARDLY ANY MILES ON IT . WE HAVE HAD THIS VEHICLE TO DATE WITH ONLY 88,727MILES ON IT. LAST SUMMER AFTER PULLING OUR 31 FOOT CAMPER BACK FROM VACATION I NOTICED THAT I WAS LEAKING BRAKE FLUID IN OUR DRIVE WAY. I WAS GLAD THAT WE MADE IT HOME WITH NO INCIDENT. WE HAVE NOT USED THE TRUCK SENSE THAT TIME .I LOOKED UNDER THE TRUCK ONLY TO SEE ALL MY BRAKE LINES CORRODED AND LEAKING. THEY OFFER AFTERMARKET BRAKES IN STAINLESS STEEL LINES. WHY DON'T ALL THE AUTOMOTIVE COMPANIES PUT THE STAINLESS LINES  ON THERE VEHICLES. IT CAN'T BE THAT MUCH MORE FOR PEACE OF MIND. I WOULD ALSO LIKE TO SAY I HAVE A  1996 CHEVY TAHOE THAT I BOUGHT BRAND NEW AND HAS 132000 MILES ON IT WITH BRAKE LINES THAT DON'T LEAK. I CAN TELL , AND SHOW ANYONE THAT GM USED AN INFERIOR METAL FOR BRAKE LINES AT LEAST IN MY 2000 SUBURBAN.    *TR",
        "vin": "3GNGK26U2YG"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/02/2012",
        "dateOfIncident": "08/30/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473313,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEFT MY RESIDENCE TO RUN AN ERRRAND AND A DEER RAN OUT IN FRONT OF MY VEHICLE.  I HIT THE BRAKE PEDAL HARD TO AVOID HITTING THE DEER AND A BRAKE LINE RUPTURED.  I WAS ABLE TO SLOW DOWN AND EVENTUALLY STOP AND CAREFULLY RETURNED HOME WITH THE BRAKES BARELY WORKING.  UPON INSPECTION, THE BRAKE LINES, WHICH ARE CLUSTERED TOGETHER UNDER THE DRIVERS SIDE ARE COMPLETED CORRODED.  I CAN'T EVEN TELL WHICH ONE RUPTURED DUE TO ALL OF THE CORROSION.  I HAVE OWNED THIS VEHICLE SINCE NEW AND TAKE GOOD CARE OF IT.  THE BRAKE LINES LOOK LIKE THEY ARE 30 YEARS OLDER THAN THE REST OF MY VEHICLE.  I OWN SOME OLDER VEHICLES, INCLUDING A 1961 TRUCK AND A 1953 CAR THAT HAVE ORIGINAL BRAKE LINES AND LOOK TO BE IN MUCH BETTER CONDITION THAN ON MY 2000 SUBURBAN.  THIS IS THE VEHICLE THAT I DRIVE WHEN TRANSPORTING MY FAMILY AND I AM VERY UPSET REGARDING THE QUALITY AND DESIGN OF THESE IMPORTANT COMPONENTS.  WE PURCHASED THIS VEHICLE NEW IN APRIL 2001.  *TR",
        "vin": "3GNGK26U5YG"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2012",
        "dateOfIncident": "09/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445772,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RUSTED BRAKE LINES BLOWN AND GAS LINE VERY RUSTED.  *TT",
        "vin": "3GNGK26U5YG"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/31/2010",
        "dateOfIncident": "05/28/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10333912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I UNDERSTAND NHTSA IS LOOKING INTO REPORTS OF CORRODED BRAKE LINES ON YEAR 2000 CHEVROLET TRUCKS.  I JUST EXPERIENCED THIS ISSUE.  THIS WEEKEND I WAS PULLING MY BOAT OUT OF THE WATER, I PRESSED HARD ON THE BRAKE TO RELEASE THE PARKING BRAKE AND THE PEDAL WENT ALL THE WAY TO THE FLOOR.  I WAS ABLE TO POWER UP THE RAMP WITHOUT DIFFICULTY BUT WHEN ATTEMPTING TO STOP THERE WAS PRACTICALLY NO BRAKE PRESSURE AT ALL.  THERE WERE NO WARNING LIGHTS.  WHEN THE TRUCK WAS SAFELY STOPPED I CHOCKED THE TRAILER AND HAD MY WIFE STEP ON THE BRAKE, AND OBSERVED FLUID LEAKING OUT OF A FAILED LINE NEAR THE LEFT REAR AXLE.  I HAD TO GET BOTH THE BOAT AND THE TRUCK TOWED AS IT WAS OBVIOUSLY UNSAFE TO DRIVE.  THE TRUCK IS NOW AT THE DEALER FOR SERVICE.  AT A SERVICE APPOINTMENT A FEW WEEKS AGO THEY HAVE ALSO WARNED OF CORROSION ON THE FUEL LINE RUNNING FROM THE TANK TO THE FUEL FILTER.  THE TRUCK HAS ONLY 45,000 MILES AS I MOSTLY USE IT FOR TOWING. *TR",
        "vin": "3GNGK26U6YG"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/23/2007",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200535,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME FAILED IN REAR OF TRUCK. FAILURE WAS DISCOVERED AT LOW SPEED BEFORE IT WAS CATASTROPHIC. FAILURE AT HIGH SPEED WOULD HAVE BEEN. TRUCK WAS PULLING TRAILER. NEW QUARTER-FRAME IS NOW BEING INSTALLED. *TR",
        "vin": "3GNGK26U3YG"
    }
]