[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2019",
        "dateOfIncident": "07/15/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11244096,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD E-450. WHILE DRIVING WITH THE CRUISE CONTROL ENGAGED, THE VEHICLE ACCELERATED AT A HIGH SPEED. THE CONTACT DEPRESSED THE BRAKE PEDAL MULTIPLE TIMES, BUT THE CRUISE CONTROL DID NOT DISENGAGE. THE CONTACT PRESSED THE OFF BUTTON ON THE STEERING WHEEL AND THE CRUISE CONTRL STILL FAILED TO SHUT OFF. THE CONTACT STATED THAT THE CRUISE CONTROL DISENGAGED INDEPENDENTLY AFTER A FEW MILES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT A DIAGNOSIS WAS NOT PROVIDED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 116,000.",
        "vin": "1FDXE45S2YH"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/27/2016",
        "dateOfIncident": "11/22/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928164,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR RV HAS A V-10 ENGINE.  WE DROVE 244 MILES TO THE BEACH ON THANKSGIVING WEEK.  NO PROBLEMS UNTIL WE HAD TO STOP AND WAIT ON A PARKING SPACE.  WE TURNED THE ENGINE OFF AND WHEN WE RESTARTED IT A SPARK PLUG BLOW OUT OF THE ENGINE.  IT BROKE THE  PIECE ON TOP OF IT.   WE WERE BROKE DOWN AT THE BEACH ON A HOLIDAY.  A HELI CORD WAS USED TO REPAIR THE PLUG.  IS THIS A TEMPORARY FIX OR WILL WE BE STRANDED AGAIN.  WE ONLY HAVE 33,000 MILES ON THE RV.  *TR",
        "vin": "1FDXE45S4YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/15/2008",
        "dateOfIncident": "10/16/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251803,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD E450.  THE VEHICLE HAS NEXEN TIRES (NA), SIZE LT24574R16 (NA).  WHILE DRIVING 65 MPH ON THE INTERSTATE, BOTH THE REAR PASSENGER AND FRONT DRIVER SIDE TIRES BLEW OUT.  THE CONTACT CHANGED ONE OF THE TIRES AND DROVE TO THE TIRE SHOP.  THE CONTACT WAS INFORMED THAT THE FRONT PASSENGER TIRE WAS FULL OF BUBBLES AND WOULD ALSO BLOW OUT.  THE REMAINING TIRE APPEARED TO BE FINE; HOWEVER, ALL OF THE TIRES WERE REPLACED.  THE MANUFACTURER SENT HIM A LETTER STATING THAT THEY WOULD CHECK FOR ANY MANUFACTURER DEFECTS.  THE CONTACT BELIEVES THAT THE TIRES SHOULD BE RECALLED.  THE FAILURE MILEAGE WAS 166,500 AND CURRENT MILEAGE WAS 168,000.",
        "vin": "1FDXE45F7YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/24/2008",
        "dateOfIncident": "09/02/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243333,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A 2000 CHATEAU MOTOR HOME BUILT ON A FORD E450 CHASIS  WHICH CAME WITH OEM TIRES - FIRESTONE STEELTEX 256/75 R16 TIRES. AS OF THE DATE OF THIS COMPLAINT, THE VEHICLE AND TIES HAVE APPROXIMATELY 5,500 MILES ON THEM. IN APPROXIMATELY 2004, I TOOK THE VEHICLE TO THE FIRESTONE COMPLETE AUTO CARE STORE LOCATED AT 655 COURTHOUSE ROAD, GULFPORT, MS 39507 (228.897.1423) TO GET THE STATE SAFETY INSPECTION AND TO LOOK AT UNUSUALLY CRACKING IN THE SIDE WALLS OF THE EQUIPMENT TIRES. I WAS GIVEN THE STATE SAFETY INSPECTION AND TOLD THAT THE CRACKING IN THE SIDE WALLS WAS NORMAL AND THERE WAS NOTHING TO WORRY ABOUT.  AFTER NOT DRIVING THE VEHICLE MUCH AS WE LIVED IN IT IMMEDIATELY AFTER HURRICANE KATRINA FOR OVER A YEAR WHILE WE AWAITED OUR HOUSE TO BE REPAIRED, I DEPARTED IN IT FOR AN APPROXIMATELY 200 MILE TRIP IN RESPONSE TO EVACUATION FOR HURRICANE GUSTAV. UPON THE RETURN FROM OUR EVACUATION ON SEPT 2ND, 2008, AFTER DRIVING APPROXIMATELY 150 MILES AT HIGHWAY SPEEDS, THE OUTER REAR PASSENGER SIDE DULLY EXPERIENCED A TREAD SEPARATION WHERE THE TREAD OUTER TREAD SIMPLY SEPARATED FROM THE TIRE. AS I WAS TRAVELING AT A VERY LOW SPEED, THE TREAD DID NOT COME COMPLETELY OFF THE TIRE BUT JUST RATHER SEPARATED FROM THE TIRE AND THUS CAUSED IT TO GO FLAT. THIS DID HOWEVER CAUSE ADDITIONAL DAMAGE TO THE TIRE HUB-CAP.  I EMAIL FIRESTONE/BRIDGESTONE THE NEXT DAY VIA THEIR ON LINE CONTACT FORM AND WAS CONTACTED THE NEXT DAY. I WAS ASKED TO TAKE THE TIRE TO THE LOCAL FIRESTONE COMPLETE AUTO CARE (REFERENCED ABOVE) TO HAVE IT INSPECTED.  I TOOK THE TIRE THEIR THE NEXT DAY AND THE STORE MANAGER STATED THAT HE HAD NEVER SEEN ANYTHING LIKE THE FAILURE OF THIS TIRE AT IT LOOKED AS IT  WAS A RE-TREAD. I REMINDED HIM THAT ALL TIRES WERE EXPERIENCING SIMILAR CRACKING ON THE SIDE WALLS WHERE THE TREAD ATTACHES TO THE TIRE. THE STORE MANAGER THEN SAID HE WOULD REPLACE ALL 7 TIRES BUT AFTER TAKING THE VEHICLE BACK TO HIS SHOP, HE HAS NOW DECLINED TO DO SO BASED ON ADVICE FROM FIRESTONE. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/25/2008",
        "dateOfIncident": "12/24/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232265,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD WINNEBAGO MINI WINNIE (NA).  WHILE DRIVING 65 MPH, THE ABS WARNING LIGHT ILLUMINATED AND THE CONTACT SMELLED SOMETHING BURNING.  PRIOR TO THE FAILURE, THE CONTACT NOTICED THAT WHEN SHE WOULD DEPRESS THE BRAKE PEDAL, THE BRAKES WOULD PUSH BACK AGAINST HER FOOT.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE CURRENT MILEAGE WAS 59,000 AND FAILURE MILEAGE WAS 56,000.",
        "vin": "1FDXE45S2YH"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2008",
        "dateOfIncident": "05/12/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231769,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 FORD E450 CAUGHT ON FIRE WHILE DRIVING.   CONSUMER PULLED OVER TO THE SIDE OF THE ROADWAY AND PARKED ON THE BERM AND VEHICLE BECAME ENGULFED IN FLAMES.     *NJ  THE ALTERNATOR CAUGHT ON FIRE IN THE ENGINE COMPARTMENT, WHICH CAUSED THE FIRE. OHIO TRAFFIC CRASH REPORT # 19-0415-91. *JB  UPDATED   04/15/10 *BF",
        "vin": "1FDXE45F6YH"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/19/2008",
        "dateOfIncident": "03/21/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228242,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCCASION, WHEN USING THE RIGHT DIRECTIONAL TURN SIGNAL, THERE IS INTERMITTENT SMOKE COMING FROM THE STEERING COLUMN ALONG WITH A STRONG \"BURNING\" SMELL. RETURNING THE DIRECTIONAL TO IT'S NEUTRAL POSITION STOPS THE SMOKING. A FORD DEALER HAS REPLACED THE MULTI-FUNCTION SWITCH IN THE STEERING COLUMN BUT THE PROBLEM PERSISTS.  *TR",
        "vin": "1FDXE45S9YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "11/21/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212537,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER HT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FOUR GOODYEAR WRANGLER HT  LT235 65R 16E TIRES REPLACED ORIGINAL RV FIRESTONE TIRES AT GOOD YEAR DEALERSHIP, 5375 PROGRESS BLVD, BETHEL  PARK PA 15102 [412-831-1810] ON 11/21/2007 AT RECOMMENDATION OF GOODYEAR DEALERSHIP AT COST OF $744.44. RETURNED TO HOME AND FOUND REAR DRIVER OUTER TIRE TO HAVE BLOWOUT IN INNER SIDEWALL. BROUGHT TIRE TO NEAREST GOODYEAR DEALERSHIP ON 12/21/2007 AT 800 FORT DUQUESNE BLVD, PITTSBURGH, PA AND WARRANTY COVERAGE DENIED. REPLACEMENT COST $180.71. TIRE HAD BEEN BARELY DRIVEN ON AND NO LIKELIHOOD OR APPARENT ROAD HAZARD PRESENT. APPEARS TO BE FLAW IN NEW TIRE DESIGN OR INSTALLATION. NO MARKINGS ON TIRE OR OTHER EVIDENCE OF INJURY TO RIM APPARENT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2007",
        "dateOfIncident": "07/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205929,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TURBO ON AN E-450 FELL OFF BLEW A HIGH PRESSURE LINE ONLY TO SHUT DOWN AND WAS REAPPLIED ONLY TO BECOME LOOSE AGAIN,BY WHICH FORD DEALER APPLIED SOME TYPE OF BRACKET AND NOW HAS POOR FUEL ECONOMY AND LACK OF POWER .  *TR",
        "vin": "1FDXE45F4YH"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/29/2007",
        "dateOfIncident": "05/03/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181041,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2652",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL* -  THE CONTACT EXPLAINED SHE HAD A DOMETIC REFRIGERATOR ,AND SHE SMELLED GAS FUMES. SHE CALLED A REPAIRMAN TWICE TO FIX THE PROBLEM, BUT THE SMELL  CONTINUED. SHE READ IN A MAGAZINE ABOUT THE DOMETIC REFRIGERATOR RECALL, SO SHE CHECKED UNDER HER REFRIGERATOR AND WAS OVER COME BY THE FUMES.  THE COOLANT WAS LEAKING OUT OF THE REFRIGERATOR. SHE CALLED  THE NUMBER THAT WAS IN THE BOOK, AND  THEY INFORMED HER IT WOULD NOT BE REPAIRED UNTIL APRIL 2006. *AK  UPDATED 2/27/2007 - *NM",
        "vin": "1FDXE4554YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/23/2006",
        "dateOfIncident": "10/23/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171656,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "DISCOVERER A/T",
                "productModel": "P21575R15",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TREAD / TIRE FAILURE OF FRONT RIGHT HAND AND RIGHT REAR INBOARD TIRE ON FORD E450 / RV CLASS C MOTORHOME. TIRES ARE LESS THAN 4 YEARS OLD AND ARE DISCOVERER LT22575R16 - DOT UPIL CNK 2804 LOAD RATING 115/112N  RH FRONT TIRE TREAD DEPARTED FOLLOWED BY TIRE FAIL - PULLED OVER SAFELY - REPLACED WITH SPARE. - PURCHASED TWO NEW DISCOVERED TIRES FOR THE FRONT KEPT ONE OF THE ABOVE TIRES FOR THE SPARE.   RH REAR TIRE FAILED 2 WEEKS LATER TREAD DEPARTED TIRE - NO FAIL DUE TO SUPPORT OF VEHICLE BY THE OUTBOARD TIRE. REPLACED FAILED TIRE WITH THE SPARE ABOVE.    I HAVE NOW HAVE FOUR DISCOVERER LT22575R16 - DOT UPIL CNK 2804 LOAD RATING 115/112N TIRES ON THE REAR OF MY RV. I PURCHASED A NEW DISCOVER TIRE FOR THE SPARE -  I AM CONCERNED HOW LONG IT WILL BE BEFORE THESE FOUR REAR TIRES FAIL. *NM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2005",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126739,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TREAD SEPERATED FROM TIRE, CAUSING DAMAGE TO THE FENDER , STEP, AND MIRROR OF VEHICLE.  WAS TRAVLING AT 58 TO 59 MPH WHEN SEPERATION OCCURES. CALLED FOR SERVICE AND TIRE WAS REMOVED AND REPLACED BY SPARE.  THE SPEED LIMIT AT THE LOCATION WHERE INCIDENT OCCURED IS 70 MPH.  HAPPY I WASN'T TRAVLING THAT FAST",
        "vin": "FDXE40S8XHB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2005",
        "dateOfIncident": "06/17/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126771,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "LT22575R16E",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE ON VACATION JUNE 17,2005 IN OREGON WE HAD ABOUT AN 18 IN. PIECE OF THE TREAD SEPARATE FROM THE TIRE RESULTING IN A BLOWOUT ON THE RIGHT INSIDE DUEL.WE WERE DRIVING OUR 2000 23 J CHATEAU MOTORHOME TOWING A JEEP LIBERTY.FOLLOWED BY OUR FRIENDS IN ANOTHER RIG WE WERE TRAVELING NORTH ON HIGHWAY 97 ABOUT A MILE NORTH OF GILCRIST OREGON. THE TEMP.WAS ABOUT 54 DEGREES AND OVERCAST.WE WERE ABLE TO SAFELY GET OFF THE TWO LANE HIGHWAY ON TO THE SHOULDER.AFTER UN-HOOKING OUR TOW VEHICLE WITH THE HELP OF AN HIGHWAY PATROLMAN WHO STOPPED TRAFFIC WE TURNED AROUND AND LIMPED BACK TO A GILCHRIST SEVICE STATION AND HAD OUR SPARE INSTALLED. AFTER RETURNING HOME IN VANCOUVER WA. I TOOK THE DAMAGED TIRE TO A LOCAL FIRESTONE TIRE AND SEVICE CENTER.THE PERSON I DELT WITH TOLD ME I WOULD HAVE TO LEAVE THE TIRE SO SOMEONE ELSE COULD LOOK AT THE TIRE TO DETERMIN WHAT WOULD BE DONE. AFTER 4 DAYS OF WAITING I WAS TOLD THAT NOTHING WOULD BE DONE BECAUSE THEY FELT THAT IT WAS CAUSED BY THE TIRE BEING UNDER INFLATED AND IT GOT HOT.(B S) I THEN TOOK THE TIRE TO AN ANOTHER (NOT FIRESTONE) TIRE DEALER AND HE TOLD ME THAT THAT WAS POSSIBLE BUT HE DIDN'T THINK THAT WAS THE CASE. THESE TIRES HAVE ONLY 13,000 MILES ON THEM . THE TIRES ARE THE FIRESTONE STEELTEX LT 225/75R-16 M/T LOAD RANGE E . I WILL NOW HAVE TO BUY ALL 7 NEW TIRES AT A COST OF ABOUT $ 1,150.00 BECAUSE I WOULDN'T FEEL SAFE DRIVING ON THESE TIRES AS THEY ARE STARTING TO CRACK ON THE SIDE WALLS.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/13/2004",
        "dateOfIncident": "10/05/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102876,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE DOWN HILL SIDE OF A BRIDGE IN JACKSONVILLE, FL AND IN HEAVY TRAFFIC, THE BRAKES  WERE APPLIED BUT WOULD NOT RELEASE. SMOKE POURED OUT AND THE BRAKES WERE COOKED ON ALL FOUR WHEELS. I THEN HAD NO BRAKES. I LIMPED OUT OF TRAFFIC AND SPEND THE NIGHT IN MY RV- WITH AN UNPLEASANT ODER. THE NEXT DAY I HAD SOME BRAKING POWER AND LIMPED TO GARBER AUTOMALL FORD DEALERSHIP FOR REPAIRS.*AK",
        "vin": "1FDXE45S4YH"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/13/2004",
        "dateOfIncident": "10/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098798,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 MOTORHOME BUILT ON A FORD E450 SUPER DUTY CHASSIS. THE MOTORHOME HAS 35768 MILES ON IT. THE VIN#IS[XXX].ON OCT.15,2004 I RETURNED HOME FROM A WEEKEND AWAY AND AS I PULLED INTO MY DRIVEWAY AND STEPPED ON THE BRAKE PEDAL,THE PEDAL WENT TO THE FLOOR AND THE BRAKES COMPLETELY FAILED. THE MAIN BRAKE LINE FROM THE MASTER CYLINDER TO THE REAR WHEELS FAILED. THIS LINE IS ROUTED INSIDE THE FRAME RAIL AND FROM THE ROAD VIBRATION HAD CHAFFED AGAINST THE FRAME CAUSING A WEAK SPOT. WHEN I STEPPED ON THE BRAKE PEDAL IT RUPTURED. I HAVE HAD IT REPAIRED AND ALSO NOTIFIED FORD MOTORHOME CUSTOMER ASSISTANCE CENTER. I HAVE RECEIVED A REPLY FROM THEM, THAT SEEMS TO ME THEY DO NOT THINK THAT THIS COULD BE A PROBLEM, AND THAT IS THE REASON FOR THIS COMPLAINT. *JB UPDATED 07/24/2012  *JS     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FDXE45SXYH"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/18/2004",
        "dateOfIncident": "06/05/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079453,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BLEW OUT, SHUTTING DOWN  AT 43,000 MILES.  DEALER STATED  AIR FILTER MALFUNCTIONED WHICH CAUSED A  BLOCKAGE.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "08/19/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034476,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING AT AN UNDETERMINED SPEED REAR DUAL TIRE TREAD SEPARATED.  CAUSE OF THE FAILURE  UNDETERMINED. *AK       CONSUMER REPLACED ALL 6 TIRES.   *TS               AMBULANCE WAS TRANSPORTING A PATIENT WHEN THE FAILURE OCCURRED.    *PH",
        "vin": "1FDXE45F0YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/09/2003",
        "dateOfIncident": "08/07/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031170,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FIRESSTONE STEELTEX R4S.  *AK",
        "vin": "1FDXE45S2YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/22/2003",
        "dateOfIncident": "07/11/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029787,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "FIRESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING  AT 50 MPH THE RIGHT REAR OUTER DUEL TIRE HAD TREAD SEPARATION.",
        "vin": "1FDXE40S4XH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/03/2003",
        "dateOfIncident": "06/02/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020958,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "40 INCH STRIP OF TIRE TREAD SEPARATED FROM CASING CAUSING TIRE TO EXPLODE.   EXTENSIVE DAMAGE WAS CAUSED TO WHEEL WELL AND SIDE OF MOTORHOME.   *NLM",
        "vin": "1FDXE45S2YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/02/2003",
        "dateOfIncident": "12/31/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000680,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MICHELIN",
                "productYear": "1982",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE HAVE HAD AT LEAST 5 SIDEWALL BLOWOUTS ON THE REAR OF OUR AMBULANCES IN THE LAST 9 MONTHS. THE LATEST BEING YESTERDAY.  WE ARE USING MICHELEN XPS RADIALS. DOT FWJHAHWX1702.  THERE IS 10/32 TREAD LEFT ON THE TIRE.  OTHERS HAVE HAD MORE SOME LESS.  THIS ONLY OCCURS ON THE REAR OF THE VEHICLE.  I HAVE E-MAILED MICHELIN WITH THIS PROBLEM BUT HAVE GOT NO RESPONSE. PLEASE ADVISE ME OF REMEDY.  THIS MAY BE OF A SAFETY CONCERN.  THANK YOU.",
        "vin": "1FDXE45F0YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/29/2002",
        "dateOfIncident": "07/31/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "1FDXE45S6YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/20/2002",
        "dateOfIncident": "08/07/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765925,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE TIRES FAILED DUE TO COMPLETE TREAD SEPARATION[NO ROAD HAZZARD AT ALL.  *AK",
        "vin": "1FDXE40S3XH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/05/2002",
        "dateOfIncident": "07/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765208,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A PERIOD OF BETWEEN 13000 AND 16000 MILES ON THESE TIRES I LOST 4 OUT OF 7 OF THE ORIGINAL TIRES DELIVERED ON THIS VEHICLE.  THE BLOW OUTS WERE MASSIVE TREAD SEPERATIONS.  ONE BLOW OUT CAUSED APPROXIMATELY $1200 IN DAMAGE TO MY MOTORHOME.*AK",
        "vin": "1FDXE45S6YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/31/2002",
        "dateOfIncident": "12/26/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765009,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST TWO BLOWOUTS BLEW OUT THE SIDE, TREAD STAYED WITH TIRE.  THIRD BLOWOUT WAS CATASTROPHIC, NOTHING LEFT OF THE TIRE.  ALL BLOWOUTS WERE ON REAR INSIDE TIRES.  FOURTH FAILURE WAS ON LEFT FRONT AND ID'D PRIOR TO BLOWOUT.  DEFECT WAS IDENTIFIED BY VISIBLE SHIFT IN TREAD ON ABOUT A 20 DEGREE SECTOR OF TIRE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/11/2002",
        "dateOfIncident": "05/23/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013734,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT STATE SPEED LIMIT AND WITHOUT WARNING, THE LEFT REAR TIRE BLEWOUT, RESULTING IN  MINOR DAMAGE TO VEHICLE.  DEALER WAS NOTIFIED.  HOWEVER, WAS UNABLE TO SOLVE PROBLEM.  ALSO, WITHIN 3 WEEKS TWO OTHER TIRES BLEWOUT.  *AK*SCC",
        "vin": "1FDXE4553YH"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/19/2002",
        "dateOfIncident": "03/24/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566138,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TWO U-BOLTS ON THE LEFT SIDE OF THE VEHICLE BROKE, CAUSING THE VEHICLE TO LEAN, A TIRE BLEWOUT AND CREATED A HOLE IN THE BOTTOM OF THE AMBULANCE,  THE ATTORNEY GENERAL FOR THE STATE OF MINNESOTA WROTE IN BEHALF OF THE RUSHFORD COMMUNITY AMBULANCE SERVICE, THE VEHICLE WAS EQUIPPED WITH A VELVET RIDE SUSPENSION.   *YD",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/18/2002",
        "dateOfIncident": "06/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763205,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE DRIVER AT THE TIME OF THE OCCURRENCE:[XXX].  HE INDICATED HE HAD BEEN DRIVING FOR 6 HOURS  ON INTERSTATE 70 AT 65 MPH ON A HOT DAY IN UTAH.  THEY HEARD A FLOPPING SOUND AND FELT A VIBRATION AND APPARENTLY PULLED OVER TO INVESTIGATE.  NONE OF THE 4 PEOPLE ON BOARD WERE HURT AND THERE WAS NO ACCIDENT. THE TIRES ON THE VEHICLE ARE FIRESTONE STEELTEX RADIAL R4S. THE VEHICLE IS A 29' 2000 WINNEBAGO MINNIE CLASS C MOTOR HOME ON A FORD F-450 CHASSIS.  THE VIN#: [XXX]. THE TIRES ON THE VEHICLE ARE ORIGINAL EQUIPMENT.   VEHICLE HAD APPROXIMATELY 16,500 MILE ON IT.  THE TIRES ON THE VEHICLE ARE FIRESTONE STEELTEX RADIALS R4S.  THE DOT#: VD1L 1XD 339.  THE TIRE SIZE: LT 225/75R16 M/S.  THERE IS A SMALL STICKER ON THE INSIDE OF THE TIRE WHICH READS:  6009-483.  IT WAS LOCATED ON THE INBOARD SIDE OF THE RIGHT REAR.  THE OWNERS OF THE TIRE STILL HAVE THE TIRE.  THE OWNERS CONTACTED A FIRESTONE SERVICE CENTER IN DENVER.  THE CENTER INDICATED IT WAS A TIRE SEPARATION MOST LIKELY CAUSED BY UNDERINFLATION AND A POSSIBLE  OVERWEIGHT CONDITION. THE CENTER OFFERED TO ADJUST FOR MILEAGE AND REPLACE THE TIRE. THE CENTER INDICATED ONE OF THEIR TECH'S WOULD INSPECT THE TIRE THEN DESTROY IT OR SEND IT TO THEIR RESEACH PEOPLE FOR FURTHER ANAYLSIS.  THE OWNER ELECTED NOT TO GIVE THEM THE TIRE AT THAT TIME UNTIL THE NHTSA WAS CONTACTED IN CASE THEY WANTED TO SEE THE TIRE THEMSELVES. THE OWNERS ALSO HAVE PICTURES OF THE TIRE IF THE NHTSA WANTS TO SEE THEM IN LIEU OF PHYSICALLY INSPECTING THE TIRE.  THE OWNERS WOULD LIKE TO KNOW WHAT IF ANYTHING THE NHTSA WOULD LIKE TO DO SO THAT THE TIRE CAN BE RETURNED TO FIRESTONE FOR A REPLACEMENT. THE OWNERS OF THE VEHICLE (TLT INC.) ARE THE ONES WHO ARE FILLING OUT THIS FORM AND THE ONES WHO SHOULD BE CONTACTED.*AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1FDXE45S9YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/26/2002",
        "dateOfIncident": "04/11/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORHOME TIRES WERE REGULARLY MAINTAINED AND HAD BEEN CHECKED JUST 50 MILES BEFORE BLOWOUT OCCURRED AND WERE AT CORRECT OPERATING PRESSURE.  A SLIGHT VIBRATION STARTED JUST SECONDS BEFORE TOTAL TIRE FAILURE, I STARTED TO SLOW AND PULL OVER BUT NOT BEFORE THE TIRE SIDEWALL CAME APART AND THE WHEEL WELL WALLS WERE SEVERLY BATTERED CAUSING A LOT OF DAMAGE TO SHEILDING, WIRES, AND NEARLY RUPTURING THE GAS FILLER PIPE.  I'M VERY FORTUNATE IT WAS A REAR DUAL TIRE, NOT A FRONT ONE.*AK",
        "vin": "1FDXE45S8YH"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2002",
        "dateOfIncident": "04/18/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON INSPECTION BY FORD-CERTIFIED MECHANIC IT WAS DETERMINED THAT TWO OF THE BOLTS ON THE CONNECTOR BETWEEN THE AUTOMATIC TRANSMISSION AND THE DRIVE SHAFT HAD SHEARED. THE REMAINING BOLTS HAD LOOSENED AND THE SLACK WAS CREATING VIBRATION NOISES THAT WERE HEARD AT LOW SPEEDS. IF THE DRIVE SHAFT HAD SEPARATED FROM THE AT THE FAILURE COULD HAVE HAD CATASTROPHIC RESULTS AS THE LOOSE DRIVE SHAFT COULD HAVE DUG INTO THE PAVEMENT AND DEFINITELY CAUSED DAMAGE TO THE VEHICLE AND PERHAPS INJURY AND DEATH TO THE OCCUPANTS.*AK",
        "vin": "1FDXE45S0YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/17/2002",
        "dateOfIncident": "04/17/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH, THE TREAD SEPARATED FROM THE RIGHT REAR INSIDE DUALER. THE TREAD PEELED, ALL YOU COULD SEE IS THE STEEL AROUND WHEEL. CONTACTED FIRESTONE. TIRE SIZE LT255/75R16  ORIGINAL EQUIPMENT FOR 2000 FORD ECONOLINE E 450.  NLM  DOT.VD1L1XD.299 *JG",
        "vin": "1FDXE40S7XH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/15/2002",
        "dateOfIncident": "10/14/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9005199,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TREAD SEPERATION CAUSING LOSS OF CONTROL AND DAMAGE TO THE MOTOR HOME.",
        "vin": "1FDXE45S8YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/03/2001",
        "dateOfIncident": "11/25/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TREAD SEPARATION OCCURRED ON BACK WHEEL DURING TRAVEL.  TEMPARATURE WAS COOL AND TIRE AIR PRESSURE WAS NORMAL.  I UNDERSTAND TAHT TEH STEELTEX WAS NOT PART OF THE ORIGINAL RECALL BUT I WANTED TO FILE A COMPLAINT IN CASE THERE ARE OTHERS WHO MAY HAVE INCURRED SIMILAR PROBLEMS. *AK (DOT NUMBER: VDIL1XD269  TIRESIZE: LT225-75R1)",
        "vin": "1FDXE40S1XH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/03/2001",
        "dateOfIncident": "11/20/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755225,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST TIME TRAVELING 55-65MPH FOR APPROXIMATELY 100 MILES ON INTERSTATE, MOTORHOME (FORD E450 DUAL REAR AXEL) STARTED TO SHAKE AND WITHIN A FEW SECONDS WE HEARD A LOUD BANG. PULLED OVER AND SAW THAT THE RIGHT OUTSIDE REAR TIRE HAD ALL OF THE TREAD COME OFF. THE SECOND TIME (APPROXIMATELY 10 DAYS LATER) AFTER DRIVING 60-65MPH ABOUT 100 TO 150 MILES OF INTERSTATE THE VEHICLE STARTED SHAKING AND WE IMMEDIATELY PULLED OVER. WE FOUND THIS TIME THAT THE LEFT INSIDE REAR TIRE HAD APPROXIMATELY 1/4 OF THE TREAD OFF THE TIRE. WE HAD BOTH TIRES INSPECTED SEPERATELY BY TIRE REPAIR PERSONS AND BOTH TIMES EACH HAD INDICATED THAT THE FAILURE WAS NOT DUE TO THE TIRE HITTING OR SCRAPING ANYTHING.. *AK (DOT NUMBER: VD  TIRESIZE: LT22575R16)",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/07/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 893760,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2 TIRES  HAD TREAD SEPARATION, FIRST BEING AT 11,023 MILES  SECOND AT 11300 MILES, WHICH CAUSED A TIRE  BLOWOUT.  HE HAD THEM TAKEN OFF.*AK  FIRESTONE STEELTEX RADIAL R4 LT2251/74R16.*JB",
        "vin": "1FDXE45S2YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/01/2001",
        "dateOfIncident": "06/09/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 749611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE SIDEWALL EXPLODED AND SEPARATED- I STILL HAVE BOTH PARTS AND THE OTHER 5 TIRES ON THE VEHICLE I HAVE REPLACED!*AK (DOT NUMBER: VD111XD349  TIRESIZE: 225-75-16)",
        "vin": "1FDXE45S4YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/14/2001",
        "dateOfIncident": "05/09/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 888161,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUFFERED A  VALVE STEM DEFECT.  AFTER IT CAME LOOSE IT MADE  VEHICLE HAVE A TIRE BLOWOUT. CONTACTED DEALER.  *AK CONSUMER WAS ADVISED BY DEALER THERE HAVE BEEN NO OTHER REPORTS OF THIS TYPE OF FAILURE, AFTER VALVE STEM BLEW OUT CONSUMER TOOK THE WHEELS OFF AND TRIED ANOTHER VALVE STEM BY PULLING IT WITH HIS HAND AND THE STEM CAME OUT EASILY, CONSUMER HAD ALL STEMS REPLACED WITH STEEL STEMS AND HAS HAD NO FURTHER PROBLEMS. *JB",
        "vin": "1FDXE45S8YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/28/2001",
        "dateOfIncident": "02/07/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884418,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRESTONE TIRE LT P225/75R16, LEFT FRONT TIRE EXPERIENCED TREAD SEPARATION WHILE VEHICLE WAS TRAVELING AT APPROXIMATELY 45 MPH. *AK  CONSUMER STATES THE DOT NUMBER CAN NOT BE READ DUE TO SIDEWALL DAMAGE.   *SLC",
        "vin": "1FDXE45F4YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/01/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 740307,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE VALVE STEM NOT ACCESSIBLE ON OUTER REAR TIRES ON DUALIES:  WHEN THE VEHICLE IS DELIVERED TO THE CUSTOMER, THE OUTER TIRE VALVE STEM IS NOT ACCESSIBLE FOR CONSUMERS TO CHECK FOR PROPER INFLATION.  YOU HAVE TO HAVE VALVE STEM EXTENDERS PUT ON THE INNER AS AN ADDITIONAL PARTS.  MANY PEOPLE WHO BUY A NEW RV DON'T THINK ABOUT THE FACT THAT THE CURRENT ACCESS TO THE INNER TIRE VALVE STEM IS INADEQUATE.  THE OUTER TIRE VALVE STEM FACES BACK TOWARDS THE INNER TIRE AND IS BEHIND THE RIM.  FLEETWOOD (MOTOR HOME MANUFACTURER) AND FORD (CHASSIS MANUFACTURER) AND OTHER VEHICLE MANUFACTURERS SHOULD BE REQUIRED TO HAVE THE TIRE VALVE STEMS ACCESSIBLE FOR OBVIOUS REASONS OF DRIVING SAFETY AND TIRE CARE.  THIS PROBLEM/OVERSIGHT SHOULD NOT BE LEFT TO CONSUMERS TO ADD ON ADDITONAL FEATURES TO MAKE MONITORING THE CORRECT TIRE PRESSURE EASIER.*AK",
        "vin": "1FDXE45S0YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/01/2000",
        "dateOfIncident": "09/17/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 733068,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE HAS A THREE INCH SPLIT IN THE SIDE WALL 1/2 INCH FROM RIM. (DOT NUMBER: VD1L1X1  TIRESIZE: LT22575R16)",
        "vin": "1FDXE455S4Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/2000",
        "dateOfIncident": "02/01/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730786,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER REFUSES TO REPLACE VEHICLE OR TO INVESTIGATE VIBRATION PROBLEM",
        "vin": "1FDXE45F4YH"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/2000",
        "dateOfIncident": "02/01/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730786,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER REFUSES TO REPLACE VEHICLE OR TO INVESTIGATE VIBRATION PROBLEM",
        "vin": "1FDXE45F4YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/16/2000",
        "dateOfIncident": "08/11/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 728129,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "E-450",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY( DOT NUMBER: VD1L TIRE SIZE: LT225/7516 )",
        "vin": "1FDXE45F3YH"
    }
]