[
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/26/2005",
        "dateOfIncident": "09/23/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137866,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-650",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER OWNS A 2000 AND 2001 FORD F-650.  THE CONSUMER STATED THERE WAS AN INTERNAL CAMPAIGN ON THE FUEL SYSTEM LIFT PUMP.  THIS CONSUMER EXPERIENCED THE SAME PROBLEM AS INDICATED IN THE CAMPAIGN.  THE CONSUMER STATED THAT WHILE DRIVING  AT NORMAL SPEED THE VEHICLE CUT OFF AND STALLED.  BUT THE CAMPAIGN WAS TO PROTECT YOUNG CHILDREN IN BUSES OR ANYONE BEING TRANSPORTED IN AN EMERGENCY VEHICLE.   THE CONSUMER REPLACED THE FUEL PUMP  APPROXIMATELY 7 OR 8 TIMES.  THE CONSUMER STATED THE MANUFACTURER HELPED WITH THE REPAIR THE FIRST TIME.  HE HAS NOT COVERED THE COST OF THE REPAIR FOR THE REMAINDER OF THE TIMES.  THE MANUFACTURER STATED THAT THERE WAS NOTHING THAT COULD BE DONE ABOUT THE PROBLEM OTHER THAN THE CONSUMER HAVING TO REPLACE THE FUEL PUMP  AT HIS OWN EXPENSE.  THE CONTACT RECEIVED AN E-MAIL STATING TO CONTACT THE SERVICE DEALER, BUT THE SERVICE DEALER STATED THAT THEY COULD NOT GET THE PARTS TO REPAIR THE VEHICLE.  THE ENGINE SERIAL NUMBER FOR THE 2000 IS 56731401.  THE ENGINE SERIAL NUMBER FOR THE 2001 IS 56857116.*AK  CUMMINS CAMPAIGN 0504.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/04/2003",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037194,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-650",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FILING A COMPLAINT ABOUT THE LACK OF PROPER TESTING OF ALUMINUM AUTOMOTIVE PARTS THAT EFFECT FORD, GM, CHRYSLER, AND TRICK FLOW PRODUCTS. THIS IS OCCURRING AT ZEUS ALUMINUM PRODUCTS (USA) LOCATED AT RR 6 BOX 20, LATROBE, PA 15650. ACCORDING TO ISO STANDARDS ITEMS ARE TO BE TESTED TO INSURE THAT THE ALUMINUM CASTINGS CONFIRM TO PROPER STANDARDS AND WILL NOT FAIL. THIS COMPANY HAS DELIBERATELY BYPASSED THESE MANDATORY TEST AND IN OTHER CASES FALSIFIED THETEST RESULTS TO KEEP FROM SCRAPING THESE CASTINGS TO LOWER THE SCRAP LEVELS AND INCREASE PROFITABILITY. ONE EXAMPLE WAS WHEN THE PLANT MANAGER MR. JOHN KARAS STAMPED CASTINGS THAT RECIEVED NO PREASURE TESTING AS IF THEY COMPLETED THE PROCESS. I PERSONELLY WITNESSED THIS AND TOLD HIM HE COULD NOT STAMP THEM AS IF THEY PASSED THE PREASURE TEST IF THIS TEST WAS NEVER PREFORMED. HE STATED THAT HE COULD NOT LEAVE THEM LAYING AROUND AND THAT THEY MIGHT PASS ANYWAY SO HE DID NOT FEEL THE NEED TO TEST THESE CASTINGS. THIS TYPE OF INCIDENT OCCURRS ON A CONSTANT BASIS. SINCE THIS COMPANY HANDLES ITEMS FROM ALMOST ALL OF THE US CAR MANUFACTORS INCLUDING AFTER MARKET COMPANIES THE POSSIBILITY OF THESE CASTINGS FAILING IS POSSIBILY HIGH AND EFFECTS ALMOST ALL US VIECHLES MADE IN THE US.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/11/2003",
        "dateOfIncident": "06/10/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022858,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-650",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING   DRIVESHAFT BROKE. DEALER NOTIFIED. *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/26/2003",
        "dateOfIncident": "02/20/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009388,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-650",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKE WAS APPLIED, THE VEHICLE LOST POWER STEERING.*JB",
        "vin": "3FDNW6553YM"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 881505,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-650",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS FAILED ON THIS VEHICLE FOUR TIMES.    ADD FURTHER DETAILS.*AK",
        "vin": ""
    }
]