[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/06/2016",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10924549,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL TRANSMISSION KEEPING HANGING UP AND IS HARD SHIFTING INTO GEARS",
        "vin": "1FTWX32F2YE"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "11/10/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851896,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 SD. THE CONTACT STATED THAT LOCATED UNDER THE FUEL FILTER, THE O-RING AND THE DRAIN LINE FAILED ON MORE THAN ONE OCCASION. THE VEHICLE WAS TAKEN TO THE DEALER MORE THAN TWICE AND THEY WERE NOT ABLE TO REPLICATE AND DIAGNOSE THE FAILURE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO REPLACED THE DRAIN LINE AND INDICATED THAT THERE WAS TOO MUCH PRESSURE FLOWING INTO THE FUEL FILTER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 102,000.   UPDATED 05/10/16*LJ  UPDATED 11/3/2017*JS",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F-350.  CONSUMER WRITES IN REGARDS TO VEHICLE TIRE INFLATION PRESSURE PROBLEMS.  *SMD   THE CONSUMER STATED THE TIRE WAS INFLATED TO 55 PSI TO SOFTEN THE RIDE. LATER, WHILE HAULING TRACTOR THE TREAD ON ONE OF THE TIRES PEELED OFF. THE CONSUMER PUT THE SPARE ON THE TRUCK.  THE CONSUMER WAS ADVISED TO RUN THE TIRES AT THE MAXIMUM INFLATION PRESSURE FOR THE BEST WEAR, MAXIMUM LOAD CAPACITY, BEST MILEAGE AND LONGEST LIFE.  EACH OF THE TIRES EVENTUALLY FAILED ONE AT A TIME. WHEN THE CONSUMER PURCHASED NEW TIRES, THEY WERE INFLATED 60 PSI FOR THE FRONT AND 50 PSI FOR THE REAR, INSTEAD OF 80 PSI.  EVERYTHING WAS FINE FOR A WHILE, UNTIL THE CONSUMER STARTED TO EXPERIENCE ROUGH RIDING AND NOISY TIRES AS A RESULT OF IMPROPER INFLATION.  THE RETAILER STATED THE INFLATED THE TIRES ACCORDING TO WHAT WAS PRINTED ON THE DOOR STICKER. THE UNDER INFLATION CAUSED EXCESSIVE SIDEWALL FLEX, REDUCED MILEAGE, SHORTENED LIFE AND SEVERAL TIRE FAILURES. *JB    *CN",
        "vin": "1FTSW30F8YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "02/12/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WE WERE RETURNING HOME FROM A ROAD TRIP, WE HEARD A SCREECHING NOISE COMING FROM THE LEFT WHEEL WELL AREA WHEN WE MADE WIDE SWEEPING TURNS AND HIGHWAY CURVES. WE PULLED OVER AND, UPON INSPECTION, SAW OUR ORIGINAL ALLOY WHEEL ON OUR TRUCK WAS CRACKED. ONE OF THE WHEELS WAS DANGEROUSLY CLOSE TO COMING OFF THE HUB.    PHOTOS DOCUMENT HOW SEVERE THE CRACKING OF THE WHEELS WAS - THREE OF FOUR WHEELS WERE FOUND TO HAVE CRACKS AND CHUCKS OF METAL MISSING,COMPROMISING THE INTEGRITY OF THE WHEELS AND THE SAFETY OF OUR VEHICLE.    WE HAD TO PURCHASE NEW WHEELS AT A COST OF ALMOST $1,300.",
        "vin": "1FTWW33F9YE"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2014",
        "dateOfIncident": "06/16/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598654,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 SD. THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS THE VEHICLE STALLED ALTHOUGH THE FUEL LEVEL WAS AT CAPACITY. THE CONTACT TOOK HIS VEHICLE TO AN INDEPENDENT MECHANIC AND THE DEALER WHO BOTH STATED THAT HAVING LESS THEN 5% BIO DIESEL WOULD CAUSE THE FAILURE TO OCCUR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 130,000. THE CURRENT MILEAGE WAS 200,000.",
        "vin": "1FDWX37F9YE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/11/2013",
        "dateOfIncident": "06/04/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555724,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 SD. THE CONTACT STATED THAT BRAKE FLUID WAS LEAKING FROM THE WIRES THAT WERE CONNECTED TO THE MASTER CYLINDER AND ONTO THE ELECTRICAL CONNECTOR. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 09V399000 (VEHICLE SPEED CONTROL) BUT WAS ADVISED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS 160,000.",
        "vin": "1FTSX31L6YE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/29/2013",
        "dateOfIncident": "06/27/2013",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522341,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD THE OTHER DAY IN ARE 2000 F-350 7.3 DIESEL REG CAB CHASSIS TRUCK PULLING 25,000 LB GOOSENECK TRAILER WAS DIS ENGAGING THE CLUTCH WHEN THE CLUTCH ASSEMBLY BROKE THE BUSHINGS WENT OUT AND BROKE LEAVING THE CLUTCH USELESS DRIVING IN BUSY TRAFFIC CLUTCH STAYED STICKING CAUSED A FIRE UNDER VEHICLE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "04/19/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521716,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING DOWN THE HIGHWAY AT 60 MILES PER HOUR WHEN I HEARD A LARGE BANG.  I STOPPED AND DIDN'T SEE ANYTHING UNTIL I STOPPED FOR GAS.  GAS WAS LEAKING OUT THE FILL HOSE AND I LOOKED UNDER THE TRUCK AND THE GAS TANK STRAP HAD BROKE AND THE TANK WAS VERILY HANGING ON. I PURCHASED TWO STRAPS TO HOLD THE  TANK IN PLACE UNTIL I COULD GET TO A FORD DEALERSHIP.  THIS IS THE SAME PROBLEM THAT FORD RECALLED THE 150 AND 250 MODELS FOR.  LUCKILY FOR ME THE TANK DID NOT RUPTURE AND CATCH FIRE.  THE 350 NEEDS TO BE RECALLED TO FIX THIS PROBLEM BEFORE SOMEONE IS KILLED.  *TR",
        "vin": "1FTWX32L4YE"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2013",
        "dateOfIncident": "06/08/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520498,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE WAS ON A 2000 FORD F350 AMBULANCE ON ROUTE TO EMERGENCY CALL WHEN ENGINE SHUT DOWN AND LOST ALL POWER LIKE IT WAS OUT OF FUEL 7.3 LITER DIESEL AND TANK WAS FULL. HAD UNIT TOWED TO TABS GARAGE IN KING NC AND $1700.00 LATER AFTER NEW FUEL TANK FUEL PUMP 3 INJECTORS DUE TO LINER INSIDE OF TANK CAME OFF AND CLOGGED THE FUEL SYSTEM AND ENGINE FORD MOTOR COMPANY WAS NO HELP AND SAID SINCE THE VEHICLE WAS OUT OF WARRANTY THEY WOULD NOT DO ANYTHING TO RESOLVE THE COST ISSUES.  *TR",
        "vin": "1FDWF36F4YE"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2013",
        "dateOfIncident": "01/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520505,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ISSUE WAS ON A 2000 FORD F350 RESCUE TRUCK ON ROUTE TO EMERGENCY CALL WHEN ENGINE SHUT DOWN AND LOST ALL POWER LIKE IT WAS OUT OF FUEL 7.3 LITER DIESEL AND TANK WAS FULL. HAD UNIT TOWED TO GARAGE IN KING NC AND $900.00 LATER AFTER NEW FUEL TANK FUEL FILTER AND FUEL PUMP TO LINER INSIDE OF TANK CAME OFF AND CLOGGED THE FUEL SYSTEM AND ENGINE FORD MOTOR COMPANY WAS NO HELP AND SAID SINCE THE VEHICLE WAS OUT OF WARRANTY THEY WOULD NOT DO ANYTHING TO RESOLVE THE COST ISSUES.  *TR",
        "vin": "1FDWF36F0YE"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/25/2012",
        "dateOfIncident": "10/24/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482170,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 SD. THE CONTACT STATED WHILE DRIVING APPROXIMATELY 20 MPH AND MAKING A RIGHT HAND TURN, HE LOST CONTROL OF THE VEHICLE CAUSING HIM TO CRASH INTO SOMEONE'S MAILBOX. THE CONTACT STATED THAT THE POWER STEERING BECAME EXTREMELY LOOSE AND THE BRAKES ALSO FAILED. THE CONTACT DID NOT SUSTAIN ANY INJURIES. THE VEHICLE WAS UNABLE TO BE DRIVEN AND WAS LATER TOWED HOME. THE TOW TRUCK DRIVER INFORMED THE CONTACT THAT THE POWER STEERING HOSE LOOKS AS IF IT FRACTURED, WHICH MAY HAVE POSSIBLY CAUSED THE FAILURE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGE WAS APPROXIMATELY 253,000.",
        "vin": "1FTSX31F8YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/19/2012",
        "dateOfIncident": "04/15/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462300,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 SD. THE CONTACT ATTEMPTED TO OPEN THE REAR DRIVER AND PASSENGER SIDE DOORS BUT NOTICED THAT THE TOP DOOR LATCH WOULD NOT RELEASE. THE BOTTOM LATCH RELEASED WITHOUT FAILURE. THE CONTACT WAS UNABLE TO OPEN THE REAR DOORS. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTICS. THE TECHNICIAN ADVISED THAT THE DOOR ASSEMBLY WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 237,000.",
        "vin": "1FDWX36F7YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/18/2012",
        "dateOfIncident": "06/17/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462041,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 SD. THE CONTACT STATED THAT THE FRONT PASSENGER WHEEL WAS CRACKED. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 224,430 AND THE CURRENT MILEAGE 224,455.",
        "vin": "1FTWX33FXYE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2012",
        "dateOfIncident": "02/10/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447480,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPARK PLUG LOCATED AT THE REAR OF THE RIGHT CYLINDER BANK OF A 6.8 LITER GASOLINE ENGINE WAS EJECTED.  THE SPARK PLUGS IN THIS ENGINE HAVE NEVER BEEN CHANGED TO MY KNOWLEDGE SO THIS IS NOT A RESULT OF IMPROPER TORQUING PROCEDURES.  THE ENGINE HAD BEEN OPERATING PROPERLY AND VERY SELDOM HAS GONE OVER 70 MPH.  ACCELERATION AT THE TIME OF FAILURE WAS LIGHT AND THE VEHICLE WAS NOT TOWING. NO FIRE ENSUED ALTHOUGH THERE WAS A FAINT GASOLINE ODOR UNDER THE HOOD RIGHT AFTER I SHUT THE ENGINE DOWN.  THE FAILURE WAS OBVIOUS BECAUSE THE SPARK PLUG AND ATTACHED COIL PACK WAS LYING ON TOP OF THE CYLINDER HEAD. THE FORD DEALER ACKNOWLEDGED THAT THIS HAS BEEN A PROBLEM IN THESE ENGINES.  *TR",
        "vin": "1FDWF36S0YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/14/2011",
        "dateOfIncident": "09/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 DIESEL. THE CONTACT NOTICED THERE WAS A EXCESSIVE RUST ON THE FRAME AND THE EXTERIOR OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO  ADVISED HIM THAT HE NEEDED A FRAME, TRUCK BED, ETC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 118,000.     UPDATED 12/05/11",
        "vin": "1FTSX31F0YE"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/14/2011",
        "dateOfIncident": "10/14/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430199,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 F350 RUST : 8 FT. BED, RAILS UNDER BED, CAB RUST, CROSS MEMBER UNDER BED FROM RIGHT FRAME TO LEFT FRAME, RUNNING BOARDS. REPLACED OIL PAN BECAUSE OF RUST YEARS EARLIER. *TR",
        "vin": "1FTSX31F0YE"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "10/06/2011",
        "dateOfIncident": "10/02/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428904,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F-350 SD. WHILE DRIVING APPROXIMATELY 35 MPH, THE CONTACT HEARD A NOISE FROM THE REAR OF THE VEHICLE. THE CONTACT STOPPED THE VEHICLE TO INSPECT THE NOISE AND NOTICED THAT THE FRONT FUEL TANK STRAP WAS CORRODED AND FRACTURED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTICS. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 11V385000 (FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY:MOUNTING) THAT AND CONTACTED THE MANUFACTURER BUT WAS ADVISED THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 145,000. UPDATED 11/03/11*LJ  UPDATED 12/02/11",
        "vin": "1FTSF31F3YE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/31/2011",
        "dateOfIncident": "04/12/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403830,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 FORD F350 SUPER DUTY.  THE CONTACT STATED THAT THE CLUTCH ARM BROKE WHILE THE CONTACT WAS DRIVING APPROXIMATELY 35 MPH.  THE VEHICLE WAS REPAIRED BY THE CONTACT.  THE MANUFACTURER AND DEALER WERE CONTACTED TO REPORT THE FAILURE.  THE FAILURE MILEAGE WAS 151,000 AND THE CURRENT MILEAGE WAS 154,000. UPDATED 08/31/11*LJ   UPDATED 2/9/12 *CN",
        "vin": "1FTWW33F4YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/29/2011",
        "dateOfIncident": "05/27/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403672,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 FORD F350 CREW CAB 4X4 BRAKE LINE WAS CORRODED FROM DIFFERENT METALS USED.  HAD HOLE IN LINE AND BRAKE PEDAL WENT TO THE FLOOR CAUSING ME TO HAVE NO BRAKES.   EXTREMELY DANGEROUS!!!  *TR",
        "vin": "1FTWW33F7YE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2011",
        "dateOfIncident": "04/18/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399900,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK STRAP HAS BROKEN AGAIN.2ND TIME FOR THE REAR STRAP,FRONT REPLACED 1 TIME. ALSO REPLACED GAS TANK IN 2006 DUE TO LEAK FROM RUSTING AT SEAM,TANK IS STARTING TO LEAK AGAIN. TANK DROPPED TO THE STREET WHEN STRAP GAVE WAY LAST TIME,LUCKILY I WAS GOING SLOW ON A SIDE STREET. SPEAKING WITH OTHER OWNERS OF THESE TRUCKS,F-350 SUPERDUTY 2000 CAB AND CHASSIS MOST ARE HAVING OR HAVE HAD THE SAME  ISSUES I AM HAVING. *TR",
        "vin": "1FDWF36S6YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/22/2011",
        "dateOfIncident": "09/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383812,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 FORD F-350. CONSUMER WRITES IN REGARDS TO FACTORY RECALL, CAM SENSOR/CAM PARTS AND REPLACEMENT *TGW  THE CONSUMER STATED WITHIN DAYS OF PURCHASING THE VEHICLE, IT WAS INOPERABLE AS A RESULT DIRECTLY RELATING TO AND STEMMING FROM A SPECIFIC RECALL REGARDING THE CAMSHAFT. FORD SENT THE CONSUMER A RECALL LETTER TWO YEARS LATER.  THE CONSUMER ALSO STATED THE VEHICLE HAD AN ELECTRICAL AND FUEL PROBLEM. *JB",
        "vin": "1FTWW33F6YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "09/16/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379735,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F350 SUPER DUTY. WHILE CLEANING THE VEHICLE, THE CONTACT NOTICED THAT THE WHEEL HAD CRACKED THROUGH ONE OF THE SPOKES AND IF HE WERE TO LOSE CONTROL OF THE VEHICLE ON THE HIGHWAY, IT WOULD CAUSE A CRASH. THE DEALER WAS NOTIFIED WHO REFERRED HIM TO THE MANUFACTURER. THE MANUFACTURER TOOK A COMPLAINT. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE CURRENT MILEAGE WAS 220,000 AND THE FAILURE MILEAGE WAS 190,000.   UPDATED 12/30/11 *CN",
        "vin": "1FTWX33F5YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357027,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2000 FORD F-350 SUPER DUTY. THE CONTACT STATED THAT THE CAM SHAFT SENSOR WAS REPLACED IN AUGUST 2009 UNDER RECALL CAMPAIGN NUMBER 07V553000, WHICH WAS FOR ENGINE AND ENGINE COOLING. THE CAM SHAFT SENSOR THAT WAS REPLACED IN AUGUST OF 2009 WAS NOT REPLACED BECAUSE IT FAILED; IT WAS REPLACED BECAUSE THE DEALER STATED THAT THE CONTACT HAD TO GET THE NEW CAM SHAFT SENSOR. THE CONTACT HAD THE ORIGINAL CAM SHAFT SENSOR REPLACED SEPTEMBER 2005 AND WAS NOT HAVING ANY PROBLEMS. THE NEW CAM SHAFT SENSOR HAS FAILED IN JUST OVER A YEAR AND LESS THAN 4000 MILES. THE MANUFACTURER STATED THAT THE CAM SHAFT HAS A 12 MONTH 12000 MILE WARRANTY.THE FAILURE MILEAGE WAS 184329 AND THE CURRENT MILEAGE WAS 188600.",
        "vin": "1FTSW31F3YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2010",
        "dateOfIncident": "04/13/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326721,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A F-350 CREW CAB SUPERDUTY 2000, ON APRIL 13, 2010 MY TRUCK CUT OFF WITH ME IN THE MIDDLE OF THE ROAD IN WILMINGTON NC, AFTER GETTING THE TRUCK TOW IN TO THE GARAGE, I FOUND THAT THE CONNECT WIRE THAT HOOK UP TO THE HEADS FOR THE GLOW PLUGS IN THE HEAD WAS BARE WIRES THERE FROM THE PLASTIC. I AM WORRY IS THIS THE REASON IT CUT OFF ON ME IN THE MIDDLE OF THE ROAD, CAUSE THEY WAS TOUCHING ONE ANOTHER AND CAUSE THE TRUCK TO STOP RUNNING & WOULD NOT CRANK BACK UP. THE TUBO TUBE RUN WAS BESIDE THIS WIRING THAT HAVE ABOUT 5 OR SIX WIRE COMING OUT OF THE CONNECTION. *TR",
        "vin": "1FTSW30F4YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2010",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324415,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE OF MY SPARK PLUGS SIMPLY BLEW OUT OF THE CYLINDER HEAD OF MY 2000 FORD F350.  THESE WERE FACTORY PLUGS, SINCE MY TRUCK HAS LESS THAN 100,000 MILES.  I SIMPLY STARTED MY TRUCK IN THE MORNING AND IT BLEW RIGHT AWAY.  *TR",
        "vin": "1FTSW31S2YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/03/2010",
        "dateOfIncident": "09/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323623,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINE FAILURE ON MAIN LINE FROM MASTER CYLINDER TO REAR AXLE. RELEASED FLUID ON GROUND AND IN AIR, BASICALLY NO BRAKES WHEN THIS HAPPENED'   LINE WAS CORRODED RIGHT WHERE STAINLESS LINE CHANGES TO METAL SOME SORT OF DISSIMILAR METAL  CORROSION GOING ON MANY CASES ON LINE ABOUT THESE TRUCKS AND BRAKE LINES.",
        "vin": "1FTSF31LXYE"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/01/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315069,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC DIESEL FUEL FILTER DRAIN VALVE HAS DETERIORATED--DUMPING DIESEL FUEL ONTO THE ENGINE WHILE RUNNING AT THE RATE OF 10 TO 25  DROPS PER MINUTE--THE DIESEL FUEL WINDS UP ON THE ROAD --- WHEN TURNED OFF THE ENTIRE CONTENTS OF THE DIESEL FUEL FILTER (A PINT OR MORE) RUNS OVER THE ENGINE & ONTO THE GROUND---POLLUTION & FIRE HAZARD !!!!!!! *TR",
        "vin": "1FTSX30F3YE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2010",
        "dateOfIncident": "11/02/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F350 SD. SHE STATED THAT SHE RECEIVED FORD RECALL NOTICE THE FIRST WEEK IN NOVEMBER OF 2009 AND THE DEALER WAS NOT ABLE TO GIVE HER AN APPOINTMENT UNTIL JANUARY 15 2010. THE DEALER ADVISED HER TO PARK THE VEHICLE OUTSIDE SINCE A FIRE COULD OCCUR. SHE STATED THAT THE REPAIR EXCEEDED A REASONABLE TIME.  THE CURRENT MILEAGE WAS 160,000.  UPDATED 02/1710 *BF  UPDATED 02/19/10.*JB",
        "vin": "1FTSW31F1YE"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/13/2009",
        "dateOfIncident": "12/12/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295524,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER STEERING AND POWER BRAKING  MAKING DRIVING VERY DIFFICULT AND EXTREMELY DANGEROUS. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/05/2009",
        "dateOfIncident": "11/24/2009",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294581,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "200 FORD F-350 BURNED TO GROUND AFTER BEING PARKED IN DRIVEWAY FOR FIVE HRS. SUSPECT CRUISE CONTROL SWITCH. FIRE MARSHALL SAID OBVIOUS SHORT IN WIRING. DID NOT HAVE COMPREHENSIVE COVERAGE, BUSINESS AUTO LIABILITY WILL NOT COVER ANY OF OVER $8,000 LOSS OF TOOLS, EQUIPMENT AND SUPPLIES BECAUSE THE FIRE WAS NOT CAUSED BY MY NEGLIGENCE. LOSS OF TRUCK, TOOLS AND SUPPLIES ESTIMATE OVER $20,000. WHY IS FORD NOT RESPONSIBLE?? HAVE READ OF MANY OTHER SIMILAR CIRCUMSTANCES. *TR",
        "vin": "1FDSX35L7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/21/2009",
        "dateOfIncident": "03/14/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277552,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD CAREFULLY, SPARK PLUG BLOWS RIGHT OUT OF THE HEAD AND TRUCK STALLS OUT. VERY CLOSE TO GETTING REAR ENDED. COULD NOT BE FIXED WITHOUT REPLACING THE HEAD OR THE ENGINE. *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/30/2009",
        "dateOfIncident": "03/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263655,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT BELT WOULD NOT LATCH CORRECTLY. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "02/15/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10258752,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PAN ON ALL FORD TRUCKS RUST OUT AT 125;000-  150000 MI. CAUSING ALL OIL TO BE DUMPED ON HIGHWAY THEN THE ENGINE SHUTS DOWN  THEN THERE IS NO CONTROL OF VEHICLE THIS IS A PROBLEM FORD IS AWARE OF  AND WILL NOT DO ANYTHING TO FIX THIS IS A       2000.00 REPAIR JOB BY FORD. *TR",
        "vin": "1FTSF31F2YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/02/2009",
        "dateOfIncident": "09/04/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253577,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F-350 SD.  WHILE DRIVING APPROXIMATELY 30 MPH ON NORMAL ROAD CONDITIONS, THE ENGINE STALLED WITHOUT WARNING.  THE ENGINE RESTARTED AFTER THE FIRST ATTEMPT.  THE FAILURE OCCURRED INTERMITTENTLY.  THE CONTACT INSPECTED THE VEHICLE AND REPLACED THE CAMSHAFT POSITION SENSOR.  THE VEHICLE WAS TAKEN TO THE DEALER ON FIVE SEPARATE OCCASIONS FOR IDENTICAL FAILURES AND THE CAMSHAFT SENSORS WERE REPLACED.  THE TECHNICIAN DISCOVERED NHTSA CAMPAIGN ID NUMBER 07V553000 (ENGINE AND ENGINE COOLING:ENGINE:DIESEL).  THREE WEEKS AFTER THE RECALL REPAIR WAS PERFORMED, THE CAMSHAFT SENSOR FAILED AGAIN.  THE RECALL REMEDY HAS NOT CORRECTED THE ISSUE ADDRESSED IN THE SAFETY DEFECT.  THE VEHICLE IS IN THE PROCESS OF BEING REPAIRED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 12,500 AND CURRENT MILEAGE WAS 173,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2008",
        "dateOfIncident": "12/25/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253318,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ENGINE GOT ON FIRE, STARTED CLOSE TO FUEL FILTER.THE TRUCK IS TOWED TO CHULA VISTA CA. FORD DLR.*TR",
        "vin": "1FTWX33F3YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/23/2008",
        "dateOfIncident": "08/20/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243167,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F350 SUPER DUTY.  ON TWO SEPARATE OCCASIONS, WHILE DRIVING APPROXIMATELY 60 MPH, THE CABLE THAT HOLDS THE SPARE TIRE FAILED AND THE ENTIRE SPARE TIRE CABLE SUPPORT MOUNT HAD TO BE REPLACED.  THE CURRENT MILEAGE WAS 700,095 AND FAILURE MILEAGE WAS 500,050.",
        "vin": "1FTWW32F8YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/16/2008",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242484,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  CAST ALUMINUM WHEELS ON THE F350 FORD SUPER DUTY DULLY CAN BREAK, AND DID ON MY TRUCK. THE WHEELS ARE NOT STRONG ENOUGH TO SUPPORT THE WEIGHT OF THE TRUCK WITH THE 7.3 LITER DIESEL ENGINE. IF THE FRONT WHEEL BREAKS ON THIS TRUCK ON THE HIGHWAY AT NORMAL SPEEDS SOMEONE IS GOING TO DIE. MY TRUCK WEIGHS JUST SHORT OF 8,000 LBS. IT HAS NEVER BEEN DRIVEN OFF ROAD AND NEVER BEEN ABUSED, SUCH AS POT HOLES, CURBS, AND THAT SORT OF THING. I DID FILE A REPORT WITH FORD MTR. COMPANY AND THEIR COMMENT WAS WE WILL PUT YOUR COMPLAINT ON FILE AND NOTIFY THE ENGINEERS. I BELIEVE THEY ALREADY KNEW THEY HAD A PROBLEM WITH THE WHEELS BECAUSE THE NEWER TRUCKS HAVE A BEEFYER WHEEL. MY TRUCK IS A 2000.*TR",
        "vin": "1FTWX33F5YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "09/09/2008",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F-350 SUPERDUTY.  WHILE THE CONTACT'S WIFE WAS DRIVING 10 MPH, SHE SLOWED DOWN TO TURN INTO AN ENTRANCE AND THE ENGINE SUDDENLY SHUT OFF.  SHE LOST ALL POWER IN THE VEHICLE, INCLUDING STEERING AND BRAKES.  THE FAILURE CAUSED HER TO CRASH INTO ANOTHER VEHICLE, WHICH IN TURN, CAUSED THAT VEHICLE TO STRIKE ANOTHER VEHICLE.  THE CONTACT BELIEVES THAT THERE WERE NO INJURIES.  THE FAILURE OCCURRED WITHOUT WARNING.  THE DEALER AND MANUFACTURER WERE NOT NOTIFIED; HOWEVER, THE INSURANCE COMPANY WAS CALLED.  A POLICE REPORT WAS FILED.  THE CURRENT AND FAILURE MILEAGES WERE 161,530.",
        "vin": "1FTWW33F6YE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/30/2008",
        "dateOfIncident": "08/05/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229333,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F350 SUPER DUTY.  WHEN THE CONTACT STARTED THE ENGINE, SMOKE APPEARED UNDER THE HOOD.  HE IMMEDIATELY TURNED OFF THE VEHICLE, LOOKED UNDER THE HOOD, AND DISCOVERED THAT THE SPEED DEACTIVATION SWITCH WIRES WERE BURNING.  THE LOCAL MECHANIC CONFIRMED THAT THE DEACTIVATION SWITCH FAILED AND BRAKE FLUID WAS LEAKING.  THE VEHICLE WAS REPAIRED.  THE CONTACT STATED THAT HIS VEHICLE EXPERIENCED SYMPTOMS OF THE VEHICLE SPEED CONTROL RECALL, BUT IT WAS NOT INCLUDED.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT MILEAGE WAS 253,000 AND FAILURE MILEAGE WAS 150,000.  UPDATED 06/16/08 *BF",
        "vin": "1FTSW31F2YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2008",
        "dateOfIncident": "05/04/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226824,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG SHOOTING OUT OF HEAD AND RAPID LOSS OF POWER AND LOSING CONTROL OF VEHICLE DUE TO SPEED AND HAULING CAMPER GOING UP HILL SPARK PLUG BLOWS OUT OF HEAD AND YOU GOT NOTHING ENGINE STALL AFTER CALLING DEALER WAS TOLD THIS IS NOT A SAFETY ISSUE I SAY WHAT HAPPENS WHEN SPARK PLUG GOES THROUGH HOOD THROUGH WINDSHIELD AND CAUSE ACCIDENT OR DEATH ???? AFTER FURTHER LOOKING IN TO THIS I KNOW OF AT LEAST 12 OTHERS WITH SAME PROBLEM WHY CANT FORD PUT CAST IRON HEADS ON.  *TR",
        "vin": "1FTSW31S5YE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/19/2008",
        "dateOfIncident": "10/11/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225007,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 2007 I RECEIVED RECALL 05S28 FROM FORD MOTOR COMPANY CONCERNING MY 2000 350 SUPER DUTY TRUCK.  ON OCTOBER 11, 2007, FORD DEALER BLUEBONNET MOTORS DISCONNECTED THE CRUISE CONTROL SWITCH AND ADVISED ME THE REPLACEMENT PART WOULD BE AVAILABLE IN APPROXIMATELY 30 DAYS. IT HAS BEEN 204 DAYS AND THE REPLACEMENT PART IS NOT AVAILABLE.  THIS IS A MOTOR HOME AND IS USED FOR LONG TRIPS.  IT IS VERY TIRING AND RESULTS IN UNSAFE CONDITIONS TO DRIVE WITHOUT  CRUISE CONTROL.  *TR",
        "vin": "1FDWE35S9YH"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/20/2007",
        "dateOfIncident": "12/19/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212461,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST FOUND MY SECOND ALUMINUM WHEEL CRACKED.  I HAVE A 2000 FORD F350 4X4 DUALLY WITH OEM ALUMINUM WHEELS.  I HAD ONE CRACK ABOUT A YEAR AGO AND I REPLACED IT.  SO THIS IS THE SECOND ONE I HAVE FOUND CRACKED.  THE CRACK GOES INTO ON ONE OF THE 5 SPOKES WITH A CRACK STARTING INTO ANOTHER.  IF I HAD NOT FOUND EITHER CRACK, IT COULD CAUSED A CRASH OR INJURY.  *TR",
        "vin": "1FTWW33F5YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2007",
        "dateOfIncident": "07/02/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211097,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 FORD F-350 SUPERDUTY TRUCK.  I HEARD ABOUT THE RECALL (NHTSA #07V553000) CONCERNING THE CAM POSITION SENSOR IN THE INTERNATIONAL 7.3L DIESEL ENGINE.  I HAVE HAD A CAM POSITION SENSOR FAILURE IN MY VEHICLE WHICH RESULTED IN HESITATION AND STALLING - AN EXCEPTIONALLY FUN EXPERIENCE ON INTERSTATE 25.  $312.52  LATER, I NOW HAVE A NEW CAM SENSOR.  FORD IS ONLY INCLUDING THE E-SERIES VANS, EXCURSIONS AND F-450 AND F-550 MODELS IN THE RECALL.  THE SAME ENGINE, WITH THE SAME CAM SENSOR, IN THE SAME ENGINE LOCATION WAS INSTALLED IN F-250 AND F-350 SUPERDUTY MODELS.  WHY AREN'T THEY SUBJECT TO THE RECALL ALSO?  *TR",
        "vin": "1FTSW31FXYE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2007",
        "dateOfIncident": "11/02/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207888,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE PART FAILED AFTER ENGINE RUNNING LIKE CRAP THEN LEAVING ME STRANDED.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/23/2007",
        "dateOfIncident": "10/22/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206615,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CPS FAILURE UNDER WARRANTY PLUS 2 MORE FAILURES OUT OF WARRANTY.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/17/2007",
        "dateOfIncident": "09/07/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203189,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F350 SUPER DUTY.  THE CONTACT STATED THAT THE VEHICLE CAUGHT FIRE WHILE IDLING.  THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FIRE.  HE TOOK THE VEHICLE TO A MECHANIC AND WAS INFORMED THAT THE VEHICLE SPEED DEACTIVATION SWITCH CAUSED THE FIRE.  AS OF SEPTEMBER 17, 2007, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE FAILURE AND CURRENT MILEAGES WERE 180,000.",
        "vin": "1FDWX37F3YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/29/2007",
        "dateOfIncident": "08/28/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201134,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "#1 JUST USING VEHICLE.  #2 BRAKES BECAME SPONGY. AFTER STOPPING VEHICLE I NOTICED BRAKE FLUID RUNNING ON GROUND IN FRONT OF DRIVER SIDE REAR WHEEL COMING FROM FRAME RAIL. IT APPEARS BRAKE LINE IS CORRODED. VEHICLE HAS 100 THOUSAND MILES ON IT, AND UNDER CARRIAGE IS RINSED AS NEEDED.   A WRITTEN REQUEST HAS BEEN SENT TO KLABEN FORD (KENT OHIO) REQUEST ALL BROKEN PARTS. *TR   UPDATED 01/11/08.  *LJ  UPDATED",
        "vin": "1FTSX30F2YE"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "08/26/2007",
        "dateOfIncident": "08/26/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200812,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE DOES NOT HOLD VEHICLE. *TR",
        "vin": "1FTWW32F5YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "11/10/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198914,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD TWO SEPARATE CPS FAILURES ON MY 2000 FORD SUPER DUTY WITH THE 7.3 DIESEL.  BOTH TIMES IT MANIFESTED ITSELF AS THE MOTOR DYING WITHOUT WARNING.  ONCE IT WAS ON THE HIGHWAY.  THERE WHERE NO INJURIES WITH EITHER INCIDENT BUT THAT COULD HAVE EASILY BEEN A DIFFERENT STORY HAD I BEEN PULLING MY TRAILER. BOTH TIMES REPLACING THE (OVER PRICED) CPS WAS THE SOLUTION.  THE OLD PARTS WERE DISCARDED.*JB",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/03/2007",
        "dateOfIncident": "07/31/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198421,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INLET FOR TURBO WAS MIS POSITIONED AND ATE THRU POWER STEERING PUMP AND HOSE, CAUSING SUDDEN LOSS OF STEERING CONTROL AND BRAKES.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/11/2007",
        "dateOfIncident": "07/05/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196118,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire U.S.A., Inc.",
                "productMake": "NANJING KUMHO TIRE CO",
                "productModel": "ROAD VENTURE AT - KL78",
                "productYear": "9999",
                "size": "LT265/75R16",
                "type": "Tire"
            }
        ],
        "summary": "I  OWN 265/75R16 KUMHO ROAD VENTURE AT 10 PLY LOAD RANGE E TIRES THAT AT LEAST ONE HAS STARTED TO BLISTER ON THE SIDEWALL NEAR THE BEAD OF THE TIRE, ONLY 20,000 MILES ON TIRES WHICH WERE  REGULARLY ROTATED,  AND HAVEN'T HIT ANYTHING WITH THEM.  THERE WAS A RECALL OF THE SAME TIRE FOR THE SAME PROBLEM) BY KUMHO MANUFACTURED BETWEEN JANUARY 2005 AND DECEEMBER  2006.  THE POTENTIAL FOR BLOWOUT WAS THE REASON FOR THE RECALL.  I PURCHASED THE TIRES IN JUNE 2004 AND HAVE THE SAME PROBLEM.  HAVE THE RECALL INCLUSION DATES BEEN EXPANDED.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/10/2007",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195933,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AFTER ABOUT FOUR YEARS OF GOOD SERVICE A PROBLEM STARTED AND NOW STILL HAVING NUMEROUS CAMSHAFT POSITION SENSOR(CPS)  FAILURE IN THE 2000 F350 7.3 SD PICKUP TRUCK CPS SYSTEM. DEALERSHIP AND LOCAL AUTOMOTIVE REPAIRS HAVE BEEN PERFORMED AS EXTRA COSTS TO CORRECT THE PROBLEM.THE ORIGINAL CPS PART NUMBERS ARE NOT AVAILABLE AND AN ALTERNATE PART IS A REPLACEMENT TODAY. A YEAR AFTER THE LAST  REPAIR OF THE SAME SYMPTOMS THE COMPUTER CODE FINALLY RECOGNIZED THE DEFAULT WITH A CODE P0340. THIS IS THE FIRST TIME THE SENSOR ERROR WAS IDENTIFIED BY THE CHECK ENGINE CODE SYSTEM AND IT IS THE SECOND TIME THE CPS WILL BE REPLACED. I HAVE SPENT OVER $1,500 IN REPAIRS TO FIND A FIX. I HOPE THE NEW PART BE THE FINAL FIX.  *TR",
        "vin": "1FTSX31F2YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2007",
        "dateOfIncident": "01/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192412,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A CAM POSITION SENSOR FAIL ON THE FREEWAY I-80 (RENO) ON MY 2000 FORD F350 POWER STROKE DIESEL PICK-UP. REPLACED PART OUT OF POCKET. NO OTHER ISSUES LEADING UP TO THE FAILURE. TRUCK STOPPED DEAD IN ITS TRACKS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/31/2007",
        "dateOfIncident": "05/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192208,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TOWING 20 FT TRAILER IN TRAFFIC AND MOTOR JUST DIED NO BRAKES OR STEERING LUCKILY ONLY DOING 25 MPH WAS ABLE TO TAKE SIDE STREET AND HAVE TOWED TO DEALER WAS OUT OF STATE AT THE TIME.  CAM POSITION SENSOR NOT LISTED  NEEDS RECALL. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2007",
        "dateOfIncident": "05/06/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190640,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A CAM POSITION SENSOR FAILED SHUTTING THE VEHICLE DOWN...NO WARNING THE ENGINE JUST QUIT. RESTARTED FOR ABOUT 30 SECONDS SEVERAL TIMES, JUST LONG ENOUGH TO GET OFF THE ROAD. THE REPAIR COST ALMOST $ 600 WITH TOWING..A WEB SEARCH INDICATES THIS IS A COMMON PROBLEM AND VERY DANGEROUS DEPENDING ON WHEN THE FAILURE OCCURS. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/13/2007",
        "dateOfIncident": "03/06/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190605,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK FAILED ON A HIGHWAY ABOUT 10 KM FROM NEAREST TOWN. MANAGEDTO LIMP TO THE NEAREST FORD DEALER. DEALER CHARGED ME $621.00 TO REPLACE A FAULTY CPS MODULE.*AK",
        "vin": "1FTSX31F6YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/11/2007",
        "dateOfIncident": "05/08/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190486,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 FORD F-350 SD.  THE CONTACT HEARD AN EXPLOSION COMING FROM THE ENGINE WHILE DRIVING.  THE SPARK  PLUG THREAD BECAME DETACHED.  THE DEALER IS CHARGING BETWEEN $4000 AND $5000 TO REPLACE THE HEAD.  THE FAILURE HAS OCCURRED TWICE AND THE MOST RECENT OCCURRENCE WAS THREE DAYS AGO.  THE DEALER STATED THAT IT IS A COMMON FAILURE AMONG THE FORD TRITONS.  THE VIN AND ENGINE SIZE WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 122,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "05/11/2007",
        "dateOfIncident": "01/12/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190500,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAM POSITION SENSOR FAILURE- TRUCK TALLED IN MIDDLE OF HIGHWAY- HIT ROAD SIGN TRYING TO GET OFF ROAD WITHOUT POWER STEERING. DAMAGED THE  TRUCK=$ 850.00.  *AK",
        "vin": "1FTSW31F4YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2007",
        "dateOfIncident": "11/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) NO EVENTS BESIDES A SUDDEN MISS OR COMPLETE LOSE OF POWER  (2) ENGINE DIES  (3) I HAVE HAD MY 2000 F350 DRW AND I TOW 16K LBS I HAVE HAD THE MOTOR CUT OUT AND DIE AT HIGHWAY SPEEDS, I REPLACED THE CPS TWICE IN 15,000 MILES AT 105 BUCKS EACH FROM INTERNATIONAL.  TOWING THIS AMOUNT OF WEIGHT AT THIS TYPE OF SPEED IS NOT SAFE TO HAVE A MOTOR THAT DIES WITH NO WARNING. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/24/2007",
        "dateOfIncident": "04/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188695,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO REPLACE THE CPS ON MY 2000 F350  7.3L DIESEL 3 TIMES SINCE OWNING THE VEHICLE. I HAVE OWNED IT FOR 5 YEARS. I HAVE LISTED THE LAST REPLACEMENT IN THE FORM BELOW. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2007",
        "dateOfIncident": "04/07/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188755,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "F-350 DIESEL CAM POSITION SENSOR FAILURE. *JB",
        "vin": "1FTSW31F6YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/22/2007",
        "dateOfIncident": "03/12/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188553,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING IN A PARKING LOT IDLING AND THE TRUCK JUST STARTED TO PUFF OUT TONS OF SMOKE AND RUN BAD... TOOK IT THREE BLOCKS TO THE FORD DEALER AND THE CPS CAM POS SENSOR (FORD CALLS IT A SYNCHRONIZER P# F7TZ-12K073-A)  WAS BAD... I HAVE RODE IN TWO OTHER 7.3 L TRUCKS THAT ALSO HAD CPS GO BAD IN THEM. I NOW CARRY A SPARE IN THE GLOVE BOX BECAUSE IF IN THE DESERT OR WHERE EVER I DON'T WANT TO BE STRANDED FOR A SIMPLE PART. I KNOW OF AT LEAST 20 WHO OWN THIS TRUCK WHO HAVE ALL HAD CPS FAILURES. *TR",
        "vin": "1FTWW33F6YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2007",
        "dateOfIncident": "01/11/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188509,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO WARNING, TRUCK JUST DIED. STARTED UP AFTER I COASTED TO A STOP. GOOD THING I WASN'T PULLING MY TRAILER COMING DOWN VAIL PASS. DIED THE NEXT DAY AND WOULD NOT START. REPLACED CAM POSITION SENSOR AND THE TRUCK STARTED RIGHT UP AND NO PROBLEMS SINCE. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/11/2007",
        "dateOfIncident": "03/10/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187591,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAF SPRINGS BROKE WHILE HAULING LOADS.  PULLING A 16 FEET TRAILER WITH ONE SMALL MINI PONY SPRING BROKE,  CAUSES SWAYING IN  DECEMBER  2006. PULLING 28 FEET TRAILER ON INTERSTATE IN  JANUARY 2006 HAD SAME THING HAPPEN. NOW THE 3RD EVENT USING 30 FEET HORSE TRAILER TAKING 6  HORSES TO FARRIER HAD SAME PROBLEM. COULD CAUSE SERIOUS ACCIDENT BY FORCING VEHICLE OFF ROAD WHILE TOWING.*AK",
        "vin": "1FDNX21F9YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/01/2007",
        "dateOfIncident": "01/03/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183942,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*-  THE CONTACT  OWNS  A 2000 FORD F-350, AND STATED THAT THE TWO FRONT RIMS CRACKED TO THE POINT THAT THEY WON'T HOLD ANY AIR.  THERE WEREN'T ANY DENTS, AND HE HAD NOT DRIVEN OVER A CURB OR HIT ANY POTHOLES THAT WOULD HAVE CAUSED THE RIMS TO CRACK.  THE CONTACT COULD PROVIDE PICTURES IF NEEDED.  THE FAILURE MILEAGE WAS 119000, AND THE CURRENT MILEAGE WAS 122000 MILES.*AK  UPDATED 03/30/07. *JB",
        "vin": "1FTWW33F1YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2007",
        "dateOfIncident": "02/22/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183337,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY FORD F350 SD, THE ENGINE WILL CUT OFF WITHOUT NOTICE.  THIS HAPPENS WHILE DRIVING HIGHWAY SPEEDS AND IN STOP AND GO TRAFFIC.  I LOOSE ALL POWER FUNCTIONS SUCH AS BRAKES AND STEERING.  IF I AM LUCKY, I CAN GET THE VEHICLE INTO NEUTRAL AND RESTART ON THE MOVE.  IT IS MUCH MORE SERIOUS THOUGH WHEN I AM IN HEAVY TRAFFIC.  *JB",
        "vin": "1FTWW32F0YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2006",
        "dateOfIncident": "12/08/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175728,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT ANY KIND OF WARNING MY CAMSHAFT POSITION SENSOR ON MY 2000  FORD F-350 W/7.3 DIESEL FAILED, LEAVING ME STRANDED IN RUSH HOUR TRAFFIC! AFTER HAVING IT TOWED HOME IT TOOK ME THREE DAYS TO FIGURE OUT THE PROBLEM, AND THEN COST ME $162.36 FOR A NEW SENSOR! I WILL KEEP THE OLD PART IN CASE YOU WANT IT.  *NM",
        "vin": "1FTSW31F0YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/17/2006",
        "dateOfIncident": "10/08/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171140,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4SII",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAD A SERIOUS TIRE FAILURE. THE INTERNAL STEEL BELTS  SEPARATED CAUSING THE TIRE TO DEFORM. FORTUNATELY I WAS ABLE TO GET OFF THE HIGHWAY SAFELY WITHOUT INCIDENT, ALTHOUGH IT WAS VERY SCARY. THE TIRE WAS A FIRESTONE STEELTEX RADIAL R4S II. IT WAS ON MY 2000 FORD F350 TRUCK. I ONLY HAVE 24,000 MILES ON THE TRUCK. I AM NOW WORRIED THE OTHER TIRES MAY HAVE THE SAME ISSUE. IS THERE ANY RECALL ON THIS MODEL OF TIRE?  *NM",
        "vin": "1FTSW31S6YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2006",
        "dateOfIncident": "09/22/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169004,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIRD TIME REPLACING CPS/CMP (CAMSHAFT POSITIONING SENSOR) ON MY 2000 FORD SUPER DUTY 7.3L POWERSTROKE DIESEL.  TRUCK DIES AND WILL NOT RUN BEYOND ABOUT 30 SECONDS UNTIL THIS SENSOR IS REPLACED.  FIRST FAILURE WAS WHILE TRAVELING 70 MPH ON THE FREEWAY IN MY LARGE TRUCK AND IT DIES, NO POWER TO STEERING OR BRAKES.  SCARED MY FAMILY, THANK GOD NO ACCIDENT THOUGH.  I CARRY A SPARE CPS BUT HAVE GIVEN 2 AWAY TO FRIENDS WHEN THEIRS WENT OUT.  THIS PART IS A LONG KNOWN PROBLEM AND SHOULD BE RECALLED DUE TO THE DANGER OF A 7,800 LB TRUCK GOING DEAD W/O WARNING.  *NM",
        "vin": "1FTSW31F4YE"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "08/12/2006",
        "dateOfIncident": "08/12/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165320,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN DRIVING AVER 50 YEARS, HAVE HAD MANY BLOWOUT/FLATS AND HAVE NEVER HAD A PROBLEM CONTROLLING A VEHICLE, YESTERDAY HAD A FRONT TIRE DEVELOP A SMALL SEPARATION AND AT 45 MPH COULD NOT CONTROL MY 2000 FORD F350 IN ONE LANE. HAVE HAD CONVERSATIONS WITH SEVERAL PEOPLE AND IT SEEM THAT SENSE I STOPPED REPAIRING  VEHICLES THEY HAVE REDESIGNED FRONT END\\STEERING SYSTEMS AND FROM WHAT I FOUND OUT IT IS NO WONDER THAT AT 60 MPH+ ANYTHING HAPPENS TO A FRONT TIRE---- WE MAY HAVE A WRECK.  I CAN NOT HELP BUT FEEL THESE DESIGNS HAVE LED TO A LOT OF ROLL OVER'S AND BAD ACCIDENTS.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/26/2006",
        "dateOfIncident": "07/18/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163531,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 FORD F350 V10 SPARK PLUG BLOWOUT.  *JB",
        "vin": "1FTSX31S6YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/19/2006",
        "dateOfIncident": "07/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162855,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PAST 2 WEEKS THE VEHICLE'S ENGINE STALLED DURING VERY INOPPORTUNE TIMES WHILE HIGHWAY DRIVING. FUEL HAS BEEN RULED OUT, A FULL SYSTEMS CHECK WAS PERFORMED BY THE DEALER, WITH NO ERROR CODES OR OTHER PROBLEMS NOTED. WHEN THE ENGINE BEGINS TO STALL, IT GOES THROUGH A PERIOD OF STUTTERING (<1 MIN) THEN STALLS COMPLETELY. YOU CAN WAIT FOR APPROX. 2-7 MINUTES AND THEN ENGINE WILL START AND OPERATE FOR A PERIOD OF <5 MINS, BEFORE AGAIN STALLING. DURING THIS SECOND EVENT, THE TRUCK NEEDED TO BE TOWED TO THE DEALER FOR FURTHER SERVICING.  *NM",
        "vin": "1FTSW31F7YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/07/2006",
        "dateOfIncident": "07/05/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161747,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE TREAD OF THE VEHICLE'S FRONT PASSENGER TIRE SEPARATED FROM THE TIRE ITSELF WHILE TRAVELING 55 MPH ON A DRY AND FLAT COUNTY ROAD.  THE TIRE WAS STILL INFLATED HOWEVER THE STEEL BELTS NEVER SEPARATED.  THERE WAS NO VIBRATION NOTICED OR ABNORMAL BULGING TO THE TIRE PRIOR TO AND AFTER THE INCIDENT.  THE TIRES ON THE VEHICLE WERE ROTATED REGULARLY AND CHECKED FOR CORRECT TIRE PRESSURE AS WELL.",
        "vin": "1FTSW31F7YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/19/2006",
        "dateOfIncident": "06/16/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160196,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT RATE OF 40 MPH WHEN I HAD TO SUDDENLY STOP FROM HITTING ANIMAL ON THE ROAD. BRAKE PEDAL WENT TO FLOOR WHEN PEDAL WAS SUDDENLY PRESSED. BRAKE LINE WAS BUSTED ON DRIVERS SIDE UNDERNEATH THE CLIP HOLDING BRAKE LINE. VEHICLE HAS NOT BEEN REPAIRED AS OF YET. *JB",
        "vin": "1FTWX33F8YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/13/2006",
        "dateOfIncident": "06/12/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159676,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "3 CAM POSITION SENSOR FAILURES WITHIN APPROXIMATELY THE LAST 14 MONTHS. STEERING AND BRAKING ARE DIFFICULT AT BEST WHEN THE SUDDEN SHUTDOWN OF THE VEHICLE OCCURS.  *NM",
        "vin": "1FTSW31F0YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/01/2006",
        "dateOfIncident": "05/31/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158739,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  ENGINE  WOULD  JUST  DIE  EVEN  WHILE  DRIVING.  THE CAMSHAFT  POSTION  SENSOR WAS  BAD.  *JB",
        "vin": "1FTSW31F2YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/05/2006",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154637,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO BRAKE AT ANY TIME THE VEHICLE STEERING LOCKS UP (THE PUMP DOES NOT SUPPORT THE PRESSURE FOR THE BRAKES AND STEERING). AFTER CONTACTING SEVERAL MECHANICS THIS IS A FORD DIESEL COMMON PROBLEM AND THERE HAS NOT YET TO BE A CORRECT FIX.  *JB",
        "vin": "1FTWX33F9YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/23/2006",
        "dateOfIncident": "03/05/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153493,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 FORD F350 7.3 THE TRUCK KEPT STALLING AND STOPPING IN TRAFFIC. HAD THE CODES CHECKED AND NOTHING SHOWED ON THE SCANNER, I WAS TOLD I HAD BAD FUEL. DRAINED THE TANK, CHANGED THE FUEL FILTER,PUT IN NEW FUEL FROM A DIFFERENT STATION AND THE TRUCK RAN FINE FOR A COUPLE OF DAYS AND THEN STOPPED AGAIN IN THE ROAD AND HAD TO HAVE IT TOWED.  TOOK IT TO A FORD DEALER IN JOHNSTOWN THIS TIME.  THE DEALER SAID THE CAM SENSOR WAS BAD AND FOR $ 680.00 THE PROBLEM WOULD BE REPAIRED. HAD THEM MAKE THE REPAIRS AND WHEN WE PICKED IT UP THE SERVICE WRITER SAID THIS HAPPENS ALL THE TIME. TALKED WITH SEVERAL OWNER OF THE DIESEL TRUCKS AND THEY TOLD ME THAT IT HAPPENS SO OFTEN THAT THEY KEEP A SPARE IN THE GLOVE BOX THAT IT ONLY TAKES 15 MIN TO CHANGE. THE FIRST TIME THIS HAPPENED I WAS ON A STATE RT AT RUSH HOUR WITH A SEMI PULLING OUT IN FRONT OF ME,HE SEEN THAT I WAS HAVING TROUBLE AND DID NOT CONTINUE. I WAS LUCKY THAT DAY. THE NEXT TIME IT HAPPENED I WAS GOING DOWN A STEEP HILL WITH A  SHARP LEFT CURVE AT THE BOTTOM, JUST AS I GOT TO THE POINT OF HAVING TO USE MY BRAKES THE ENGINE STALLED, I MADE THE TURN BUT HAD TO DRIVE ON THE BERM AND IN THE DITCH TO DO SO.  AGAIN WE RAN THE CODES AND NOTHING SHOWED. ON THE WAY HOME FROM SCANNING THE CODES IT STALLED IN THE MIDDLE OF ST RT 13 . THAT IS WHEN IT WENT TO THE DEALER FOR REPAIR.  WHY KEEP MAKING THE SAME BAD SENSOR AND WHY DOES IT NOT SHOW UP WHEN YOUR RUN THE CODES?  *NM",
        "vin": "1FTSW31F9YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "01/05/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149511,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES, FADE AND EXTENDED STOPPING DISTANCE; THERE ARE  FLOAT PINS WHICH KEEP THE CALIPERS CENTERED OVER THE ROTORS . THEY HAVE SEIZED UP. THE VEHICLE BREAKING WAS BECOMING SLUGGISH. REPEATED INSPECTION OF THE FRONT BRAKE PADS INDICATED THEIR CONDITION TO BE GOOD. EVENTUALLY I DECIDED TO ORDER NEW CALIPERS WITH PADS. THESE UNITS CAME WITH 'NEW FLOAT PINS'. MUCH TO MY SURPRISE MY CALIPERS WERE GOOD BUT THEY WERE LOCKED IN POSITION BECAUSE OF THE SEIZED FLOAT PINS. WHEN THE BRAKES WERE APPLIED THE PRESSURE WAS TO THE INSIDE PAD ONLY GREATLY LENGTHENING THE STOPPING DISTANCE. AS THE PROBLEM CAME ON GRADUALLY I DIDN'T REALIZE HOW POOR THE BRAKING HAD BECOME UNTIL I REBUILT THE SYSTEM. THE PINS WHICH NEED TO SLIDE FOR PROPER BRAKING HAVE LITTLE RUBBER BOOTS TO KEEP OUT ROAD DEBRIS AND WATER. THESE BOOTS WERE NOT SEATED ON THE GROVE ON THE ORIGINAL CALIPER BODY. AS THE SYMPTOMS COME ON GRADUALLY THERE ARE OTHER VEHICLES OUT THERE WITH SEVERELY DEGRADING BRAKE PERFORMANCE. CURIOUSLY THE REPLACEMENT CALIPERS HAD A BAG OF SPARE PARTS.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "10/25/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148368,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHEN THE BRAKE PEDAL WAS DEPRESSED; THE BRAKE PEDAL WENT TO THE FLOOR.  THE VEHICLE WAS TAKEN TO THE LOCAL DEALERSHIP FOR INSPECTION AND REPAIR.  THE SERVICE PERSONNEL DISCOVERED THE BRAKE LINE WAS FRACTURED DUE TO CORROSION.",
        "vin": "1FTWW33F7YE"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10145393,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2000 F350 TIRE BLEW OUT.  *TS  WHEN THE TIRE BLEW OUT, THE CONSUMER LOST CONTROL OF THE VEHICLE, WENT THROUGH A MEDIAN INTO A DITCH AND SUBSEQUENTLY THE TRUCK TURNED OVER. *JB",
        "vin": "1FTSW31F0YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/18/2005",
        "dateOfIncident": "11/18/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143115,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN UP-SHIFTING GEARS, THE SERVICE ENGINE LIGHT WOULD ILLUMINATE AND ACCELERATOR IS NON-RESPONSIVE AS ENGINE IDLES AROUND 1K RPM CAUSING LOSS OF MOMENTUM.  AFTER A FEW SECONDS, THE ACCELERATOR CAN BE USED TO INCREASE SPEED, BUT DEPRESSING THE CLUTCH STARTS THE CYCLE OF NON-RESPONSIVE ACCELERATOR ACTION ALL OVER.  THE TRUCK HAS DIED ON CURBS, IN INTERSECTIONS, AND WHILE GETTING ONTO ON RAMPS.  FORD HAS REPLACED SOME MAGNETS WHICH JUST DELAYED THE ACTION FOR A FEW WEEKS.  THE LONGER IT GOES WITHOUT REPAIR, THE WORSE IT BECOMES.  *NM",
        "vin": "1FTSW31F4YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "10/26/2005",
        "dateOfIncident": "10/02/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140851,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT SAID THE VEHICLE  WAS SHUTTING OFF WHILE DRIVING DUE TO CAM SHAFT SENSOR FAILURE.  THE ENGINE DIED IN THE MIDDLE OF MAKING A RIGHT TURN. HE ALMOST HIT ANOTHER VEHICLE, TO MISS THE OTHER VEHICLE HE WENT OVER AN EMBANKMENT.  AFTER THE INCIDENT THE VEHICLE WAS TOWED TO A FORD DEALERSHIP.  THEY DIAGNOSED THE PROBLEM AS THE CAM SHAFT SENSOR. THE CAM SHAFT SENSOR WAS REMOVED AND REPLACED WITH A NEW ONE. THE REPAIR WAS MADE AT THE CONTACT'S  EXPENSE AS FORD OFFERED NO FREE REMEDY. *AK  UPDATED 12/7/2005.  THE CONSUMER REQUEST REIMBURSEMENT FOR THE COST OF A NEW CAM SENSOR AND TOW TRUCK SERVICE (PART # F7TZ12K073-A, SYNCRO 997690).  *NM",
        "vin": "1FTWW33F0YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2005",
        "dateOfIncident": "08/29/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140484,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CPS(CAM POSITION SENSOR) THERE ARE NO EVENTS THAT LEAD UP TO THE FAILURE OF THIS SENSOR. (EXPECT THE SENSOR TO FAIL ANY WHERE BETWEEN 80,000 TO 120,000 MILES)...YOUR FORD 7.3L POWER STROKE ENGINE WILL SIMPLY JUST SHUT DOWN LEAVING YOU WITH NO POWER TO STEER OR STOP YOUR VEHICLE. THE VEHICLE'S ENGINE MAY OR MAY NOT RESTART UNTIL THE FAILED SENSOR IS REPLACED. ONCE REPLACED, THE VEHICLE CAN BE DRIVEN ANOTHER 80,000 TO 120,000 MILES (WHO KNOWS). MANY PEOPLE CARRY A SPARE SENSOR IN THE VEHICLE AS YOU NEVER KNOW WHEN OR WHERE THIS FAILURE WILL OCCUR.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/20/2005",
        "dateOfIncident": "10/14/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140319,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2000 FORD F350 DIESEL, THE CAMSHAFT POSITION SENSOR FAILED AS I WAS ENTERING THE HIGHWAY.  THE ENGINE STALLED AND I HAD NO POWER TO THE ENGINE.  THE POWER STEERING AND POWER BRAKES FAILED AND I COULD NOT GET THE TRUCK TOTALLY OFF THE HIGHWAY.  LUCKILY A POLICE OFFICER ON THE HIGHWAY PULLED IN BEHIND ME AND STAYED WITH ME WITH HIS LIGHTS ON UNTIL A TOW TRUCK ARRIVED. IT WAS A SCARY SITUATION.  THEN I FIND OUT THAT THE PROBLEM IS VERY COMMON, VERY DANGEROUS, AND VERY IGNORED BY THE MANUFACTURER.  IF THE POLICE OFFICER WAS NOT THERE QUICKLY, OR IF HE HAD A CALL TO ATTEND TO, SOMEONE COULD HAVE BEEN KILLED. *JB",
        "vin": "1FTSW31F9YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/20/2005",
        "dateOfIncident": "02/10/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140344,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "F-350 CAMSHAFT POSITION SENSOR FAILED PREMATURELY (28,000 MILES). ENGINE SHUT DOWN WITH NO WARNING, BRAKES FAILED. ROLLED TO A STOP, THE ENGINE WOULD NOT RESTART. NO TRAFFIC AROUND. FORD REPLACED THE PART UNDER WARRANTY. *JB",
        "vin": "1FTSW31F0YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/19/2005",
        "dateOfIncident": "09/30/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140217,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 30, 2005 I EMAILED FORD MY CONCERN WITH THE POWER STEERING HOSE FAILURE ON MY 2000 F350 TRUCK ([XXX], 153,440 KM).  I SUBSEQUENTLY SPOKE TO THEIR CUSTOMER SERVICE REPRESENTATIVE, AND TO THE SUPERVISOR IN THAT DEPARTMENT, AND COULD NOT BELIEVE THE RUN-AROUND I RECEIVED REGARDING MY CONCERN.   THEY CLAIMED THEY HAD NO ACCESS TO PERFORMANCE RECORDS ON VEHICLES AND COULD NOT COMMENT ON MY CONCERN. THEY SIMPLY TRIED TO BOUNCE ME BACK TO THE DEALER, WITH WHOM I HAD ALREADY DISCUSSED MY CONCERN.  THE DEALER ADVISED I COMMUNICATE WITH FORD'S CUSTOMER SERVICE DEPARTMENT AND PROVIDED ME WITH THE EMAIL ADDRESS.    HERE IS WHAT HAPPENED.  WHEN BACKING OUT OF MY DRIVEWAY, THE POWER STEERING AND POWER BRAKES FAILED, LEAKING POWER STEERING FLUID ALL OVER THE DRIVEWAY. HAD THE VEHICLE TOWED TO JUBILEE FORD IN SASKATOON, SASKATCHEWAN FOR REPAIR.  THE HIGH PRESSURE LINE TO THE HYDRO-BOOST WAS REPLACED AT A COST OF $292.70. I WAS TOLD THE NUT AT ONE END OF THE HOSE FAILED. I KEPT THE OLD HOSE.    MY CONCERN IS VERY SIMPLE.  BECAUSE OF THE VERY SERIOUS CONSEQUENCE OF THIS (LOSING STEERING AND BRAKE CONTROL) HAPPENING WHILE DRIVING (IE. ACCIDENT CAUSING INJURY OR DEATH), HAS THIS OCCURRED WITH OTHER SUPER DUTY TRUCKS AND SHOULD THERE BE A RECALL FOR THIS FAILURE?  FORD'S ENGINEERING DEPARTMENT MUST KEEP RECORDS OF THIS TYPE OF FAILURE, AS IT APPLIES TO 1999-2005 SUPER DUTY TRUCKS, AND HENCE FORD SHOULD BE ABLE TO PROVIDE A STRAIGHT FORWARD ANSWER.  I HAVE NOT BEEN ABLE TO OBTAIN THIS FROM THEM.  *NM UPDATED 07/18/2012 *JS     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1FTWX33F2YE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/22/2005",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132418,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: WHILE DRIVING , THE CO NSUMER NOTICED THE ODOMETER WAS  NOT WORKING.   NO PARTICULAR SPEED WAS NOTICED AT WHICH THIS HAS OCCURRED.  CONSUMER DID NOTE IT WORKS WHEN STOPPED AT A RED LIGHT THEN ACCELERATING PAST THROUGH THE RED LIGHT THE ODOMETER BEGAN TO WORK AGAIN AFTER A COMPLETE STOP BUT THIS WAS INTERMITTENT.  *AK  *JB",
        "vin": "1FTSW31F5YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2005",
        "dateOfIncident": "09/17/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137065,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED  VEHICLE  TURNED OFF WHILE DRIVING. IT JUST DIED. IT VARIED AT THE SPEEDS THAT THE CONTACT WAS GOING. THE DEALER CHANGED VARIOUS SENSORS. THEY  COULD NOT DUPLICATE THE PROBLEM. THEY HAVE REPAIRED THE WIRING HARNESS. ON 9-16-05 THE CONTACT  TOOK VEHICLE TO THE DEALER, AND THE DEALER REPLACED THE WIRING HARNESS. HOWEVER, THEY WERE STILL EXPERIENCING THE SAME PROBLEMS WITH THE VEHICLE JUST STOPPING. IT WILL SOMETIMES START BACK RIGHT AWAY. SOMETIMES IT WILL JUST NOT START, AND ONE COULD  WAIT 10 MINUTES AND IT WILL RESTART OR  MAY HAVE TO WAIT 2 HOURS BEFORE IT WILL RESTART. THIS HAS BEEN AN ONGOING  PROBLEM FOR TWO YEARS. THE CONTACT  CITED  RECALL 05S34 ON THE SAME VEHICLE BUT JUST DIFFERENT YEAR MODELS. *AK",
        "vin": "3FTSW31F1YM"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/19/2005",
        "dateOfIncident": "09/19/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137021,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I EXPERIENCED A COMPLETE BRAKE LINE FAILURE AND LOSS OF BRAKE USE ON MY 2000 FORD F350 SUPER DUTY 4X4 PICKUP. LUCKILY, THE FAILURE OCCURRED WHILE MY VEHICLE WAS BEING INSPECTED BY THE STATE OF NEW JERSEY. I HAD TO HAVE IT TOWED TO THE NEAREST FORD DEALERSHIP WHERE THEY PROCEEDED TO BILL ME EXTENSIVELY FOR REPLACING THE MAIN BRAKE LINE. *JB",
        "vin": "1FTSW31S5YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/18/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133376,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2000 FORD F350.  THE CONSUMER STATED  WHEN DRIVING AT 55 MPH THE SPARE TIRE CABLE BROKE AND  LOST THE SPARE TIRE.  THERE WAS NO ONE BEHIND  CONSUMER'S VEHICLE AND NOBODY WAS INJURED.  THE VEHICLE HAS NOT BEEN FIXED.  THE SPARE HAS NEVER BEEN TAKEN OFF OF THE VEHICLE.*AK",
        "vin": "1FTWX33F9YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/15/2005",
        "dateOfIncident": "08/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132875,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATES THERE IS A FLAT PIECE OF METAL THAT HOLDS THE BED TOGETHER; THE METAL WAS COMPLETELY RUSTED  AND APART  FROM THE BENDS OF THE TRUCK. HE HAS AN ARROW TECHNICAL  BODY. CONTACTED,  REDDING THE MANUFACTURER OF THE BED OF THE TRUCK; THEY CALLED THEIR BOSSES AND SAID THEY COULD NOT DO ANYTHING FOR HIM BECAUSE HE WAS THE OWNER OF ONLY ONE TRUCK.  HE HAS FOUND THIS IS A MAJOR PROBLEM.  FOUND OUT THAT THEY COULD NOT PUT UNDER COAT UNDERNEATH THE TRUCK BECAUSE OF A FIRE HAZARD. IN ADDITION, FOUND OUT THEY WERE PUTTING UNDER COAT UNDER THE TRUCK THAT AROSE FROM A FIRE A YEAR OR TWO BEFORE HE BOUGHT THE TRUCK. HE  RECEIVED A RECALL LETTER REGARDING THE STRAPS FOR THE TAILGATE. HE WARRANTY ON THE BED OF THE TRUCK ALMOST EXPIRED. THE TRUCK DOES NOT HAVE ANY CONTACT WITH ANY OFF-ROAD ELEMENTS. THE MODEL # OF THE BODY WAS: V110FSW99. THE SERIAL # OF THE BODY IS: 501393 . THE REDDING BODY COMPANY WAS IN CHARGE OF THE BODY. *AK  UPDATED 11/29/05. *JB",
        "vin": "1FDSF35L7YE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "01/19/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111452,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE WAS PARKED A FIRE STARTED UNDER THE HOOD. THE VEHICLE WAS TOTALED. THE MANUFACTURER WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
        "vin": "1FTWW33F3YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/30/2005",
        "dateOfIncident": "06/20/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127182,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "LT26575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY F-350 PICKUP DOES NOT HAVE A LABEL ON THE DRIVER DOOR SO I HAVE NO WAY OF KNOWING THE PROPER TIRE INFLATION FOR THE VEHICAL.  THE TIRES ARE RATED FOR UP TO 80 PSI, BUT BOTH THE TIRE AND VEHICAL MANUALS STATE THAT IT SHOULD BE BASED ON THE LABEL ON THE DRIVERS DOOR.  FORD SAYS THEY CAN NOT PROVIDE THAT INFORMATION TO ME BECAUSE THEY DON'T HAVE IT- ALTHOUGH APPERANTLY A DEALER COULD GET IT.  DRIVING A TRUCK THAT COULD REQUIRE 75 PSI IN THE TIRES WITH ONLY 30 PSI COULD RESULT IN A FAILURE AT HIGHWAY SPEEDS, BUT THE FORD REP I SPOKE TO JUST KEPT SAYING THEY COULDN'T HELP ME.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "05/05/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124542,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY F350 DIESEL 4X4 HAS THE STEERING SHUT DOWN IN TRAFFIC, SEEMS LIKE THE POWER STEERING PUMP IS ALSO THE ABS BRAKE BOOSTER. WHEN THE BRAKES ARE APPLIED THE STEERING ASSIST STOPS. WITH THE WEIGH OF THE DIESEL ENGIN IT IS IMPOSSIBLE TO TURN THE STEERING WHEEL MORE THAN A QUARTER TURN WHEN THE BRAKE IS APPLIED. I NEED TO ROLL SEVERAL FEET WITHOUT BRAKE APPLIED IN ORDER TO TURN, PUMP REPLACED @ 20K MI NO BETTER. THE SITUATIONS IS GETTING WORSE...NO SOLUTION IN SIGHT",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/27/2005",
        "dateOfIncident": "05/16/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122289,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE STEERING SHAFT (POWER STEERING GEAR BOX  OUTPUT SHAFT)  SNAPPED OFF WHILE APPROACHING A STOP SIGN AT ABOUT 35 MPH.  WHEN THIS HAPPENED THE VEHICLE DID STOP WITH NO ACCIDENT.  I  AM IN THE PROCESS OF FIXING THIS PROBLEM.    *TT",
        "vin": "1FTSW31F9YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/03/2005",
        "dateOfIncident": "08/04/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119601,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE FAILURE- TREAD SEPARATION. PROPERTY DAMAGE TO VEHICLE.  *AK",
        "vin": "1FTWW32F8YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/25/2005",
        "dateOfIncident": "04/23/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118397,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING AT A REDUCED SPEED ON THE INTERSTATE FREEWAY, BECAUSE OF RAIN, I STARTED TO EXPERIENCE A VIBRATION FROM THE TIRES. AT THE FIRST OPPORTUNITY I PULLED OFF INTO A REST AREA TO CHECK THE TIRE PRESSURE THINKING THAT I HAD A TIRE THAT WAS GOING FLAT. I MEASURED THE AIR PRESSURE IN ALL 4 TIRES ON MY 2000 FORD F-350. I MEASURED 60LBS IN THE FRONT AND 70LBS IN THE REAR. I INSPECTED THE WHEELS TO SEE IF THERE WAS ANY APPARENT PROBLEM WITH THE TIRE BUT I COULDN?T FIND ANYTHING. I DEDUCED THAT THE VIBRATION MIGHT BE A RESULT OF THE TIRE THROWING A BALANCING WEIGHT AND I DECIDED TO CONTINUE ON MY JOURNEY SINCE I COULDN?T FIND ANY PROBLEM.     ABOUT 8 MILES FURTHER UP THE ROAD I SUFFERED A TREAT SEPARATION FROM THE TIRE WHICH CAME ACTUALLY CAME OFF THE TIRE. THE TIRE DID NOT LOSE AIR IMMEDIATELY AS A RESULT OF THE FAILURE (IT DID HAVE A SLOW LEAK THAT DRAINED THE TIRE AFTER ABOUT 6 HOURS). I WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE THROUGH THE ENTIRE INCIDENT AND COULD SAFELY DRIVE IT UNTIL I COULD FIND A SAFE PLACE  MILE FURTHER UP THE ROAD WHERE I REPLACED THE DAMAGED TIRE. THE RESULTING INCIDENT DAMAGED THE FENDER AREA OF MY VEHICLE AND WILL REQUIRE PROFESSIONAL REPAIR.     AS I MENTIONED EARLIER I WAS DRIVING AT A REDUCED SPEED FOR THIS SECTION OF THE INTERSTATE FREEWAY BECAUSE OF HEAVY RAIN AND AT NO TIME DID MY SPEED EXCEED 60MPH. THE AIR TEMPERATURE FROM THE TIME I FIRST NOTICED THE PROBLEM UNTIL THE FAILURE WAS 43 TO 38 DEGREES.  *AK",
        "vin": "1FTSW31F6YE"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2005",
        "dateOfIncident": "01/05/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH PASSENGER AND DRIVERS SIDE AXLE SEALS ON FRONT REAR ARE HANGING OUT OF END OF AXLES. DRIVERS SIDE IS LEAKING OIL.DEALER ALREADY REPAIRED THIS PROBLEM ONCE AT 30K NOW IT IS MY COST PARTS COUNTER SAID FORD REDESIGNED SEALS BECAUSE OF SO MANY PROBLEMS",
        "vin": "1FTSF31LXYE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/12/2005",
        "dateOfIncident": "01/31/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110397,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "LT24575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED TIRES FROM COSTCO FOR THE BACK OF MY PICKUP. THEY PLACED 82.5 PSI IN THE REAR TIRES OF A EMPTY PICKUP...AS DIRECTED BY MICHELIN. THIS CREATED A VERY SERIOUS SAFETY ISSUE AS THE TRUCK DID 3 REVOLUTIONS DOWN THE FREEWAY DUE TO SEVERELY CROWNED TIRES. SOMEONE HAS TO STOP THIS RECOMMENDATION OR SOMEONE IS GOING TO BE HURT/KILLED. THIS IS A COMMON SENSE ISSUE THAT NEITHER COSTCO OR MICHELIN WILL ADDRESS. I WOULD LIKE A RESPONSE TO THIS EMAIL IF POSSIBLE. THIS PRACTICE HAS TO BE STOPPED, PLEASE REVIEW WITH YOUR ENGINEERS. THANK YOU  DON PREUITT.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2005",
        "dateOfIncident": "05/29/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108202,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 FORD F 350. CLUTCH WILL NOT DISENGAGE DRIVELINE WHEN DEPRESSED. 2 ND FAILURE OF SUCH NATURE. VEHICLE WILL KEEP ROLLING IN CURRENT GEAR AND SPEED WHEN CLUTCH IS DISENGAGED. CAN DO NOTHING BUT STALL THE ENGINE BY HARD BRAKING OR TURNING OFF THE KEY BOTH CREATE OTHER DANGERS. FIRST FAILURE HAPPENED AT 38K MILES SECOND AT 52K. PAID FOR FIRST REPAIR OUT OF POCKET- SAID TO BE THE CLUTCH MASTER CYLINDER BOOT RIPPING WHILE UNDER PRESSURE. SEEKING FORD TO FIX THIS TIME. FORD DEALERSHIPS IN NORFOLK VA AND KNOXVILLE TN DENY THAT THIS IS A SAFETY ISSUE. I DO NOT UNDERSTAND THEIR LOGIC. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "07/20/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102922,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 F350 7.3 DIESEL  - CAM POSITION SENSOR FAILED, SHUTTING DOWN ENGINE.  LUCKILY VEHICLE HAD JUST PULLED OUR OF DRIVEWAY AND WAS ABLE TO GET TO SIDE OF ROAD.  THE ENGINE RESTARTED AFTER 10 MINUTES BUT DIES AGAIN AFTER A FEW SECONDS. CAM POSITION SENSOR WAS REPLACED, SOLVING PROBLEM.  EMPLOYEE AT DEALERSHIP UNOFFICALLLY SAID THIS WOULD PROBABLY HAPPEN AGAIN IN APPX. 40,000 MILES.  THIS TRUCK IS USED TO PULL HORSE TRAILERS ON THE INTERSTATE.  IF THIS IS GOING TO BE A REPEAT OCCURANCE, I DON'T WANT MY FAMILY OR MYSELF IN THE TRUCK IF THIS HAPPENS ON THE INTERSTATE AT 70MPH.  I NO LONGER FEEL SAFE IN THIS TRUCK.*AK",
        "vin": "1FTWW32F3YE"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/13/2004",
        "dateOfIncident": "05/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102896,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 FORD F350 PSD 4X4 THAT HAS BEEN HAVING MORE AND MORE PROBLEMS RECENTLY WITH THE DOOR AJAR FUNCTION.  IN WARMER WEATHER ONE OR MORE OF THE DOOR CLOSED SWITCH SENSORS IS MALFUNCTIONING SHOW THE DOOR OPEN WHEN THEY ARE ALL CLOSED.  I HAVE TRIED OPENING AND CLOSING ALL DOORS REPEATEDLY BUT NO IMPORVEMENT.  LATELY IT HAS BEEN HAPPENING MORE AND WITH COOLER TEMPS AS WELL.  I TALKED TO THE FORD DEALER HERE IN TOWN AND THEY SAID THEY HAD HEARD OF THIS AND TOLD ME TO TRY WD40 AS A FIX BY SPRAYING IT INTO THE DOOR CLOSER WHERE THE SWITCH IS BURIED.  NO LUCK.  THIS MAY NOT SOUND TO BAD OF A PROBLEM, HOWEVER THE RESULTS OF THE TRUCK THINKING THE DOOR IS OPEN IS NOT GOOD.  IF THE TRUCK IS RUNNING, THE INTERIOR LIGHTS STAY ON UNTIL A SPEED OF 15MPH OR MORE IS HIT, THEREBY AUTO SHUTTING OFF THE INTERIOR LIGHTS.  HOWEVER AS SPEED DECREASES AND GOES BELOW THE 15MPH THE LIGHTS TURN BACK ON.  IT MAKES IT VERY DIFFICULT TO SEE AT NIGHT DRIVING FORWARD AND ALMOST IMPOSSIBLE TO BACK UP.  THE OTHER CONCERN IS AFTER THE TRUCK IS SHUT OFF, THE INTERIOR LIGHTS STAY ON UNTIL THE SWITCH RELEASES OR A SELF TIMER SHUTS OFF THE LIGHTS.  THIS HAS CAUSED A SLIGHT DRAIN IN BATTERY, MAKING IT SLIGHTLY DIFFICULT AT TIMES TO START A TRUCK WHICH NEEDS ALL THE JUICE IT CAN GET TO TURN OVER.  I HAVE SEEN THIS DEFECT IN THE DOOR CLOSURE SWITCH HAPPEN IN AN OLD WORK TRUCK I USED TO DRIVE (99 FORD F150).  I WOULD LIKE TO INSTALL A SECURITY DEVICE IN THE FUTURE, HOWEVER IF THE DOOR REMAIN AJAR, THIS COULD POSE TO BE A PROBLEM TO THE FUNCTIONALITY OF SUCH A DEVICE.  ANY HELP WOULD BE APPRECIATED IN SEEING IF THIS IS A REGULAR PROBLEM OR A SAFETY CONCERN.    THANKS,  PAUL.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/26/2004",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100579,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU PRESS THE BRAKE PEDAL THE STEERING WHEEL LOCKS UP .  WHEN YOU RELEASE THE BRAKE IT RELEASE THE STEERING WHEEL. 2000 FORD F350 SUPERDUTY DIESEL HAS DONE THIS SINCE OWNED TRUCK APPROX. FROM 2003 TO CURRENT.  *AK",
        "vin": "1FTWW33F9YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/22/2004",
        "dateOfIncident": "11/22/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100342,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 FORD F-350 . I BOUGHT IT USED 6 MONTHS AGO. I RECENTLY HAD THE FRONT RIGHT TIRE LOSING AIR. UPON INSPECTION BY MY MECHANIC, IT WAS DETERMINED THAT THE ALLOY RIM HAD A STRESS CRACK IN IT. UPON CONTACTING FORD, THEY SAID THERE WAS NO RECALLS AND I WOULD HAVE TO REPLACE IT AT MY EXPENSE. I HAVE THE OLD RIM AND DIGITAL PICTURES OF IT ALSO. THIS WHEEL WAS NOT DAMAGED IN ANY WAY, AND THE CRACK SEEMS TO BE FROM A DEFECTIVE DESIGN. THE RIM DID NOT FAIL, BUT HAD I NOT NOTICED THE LOW AIR PRESSURE IN THE TIRE, IT MAY HAVE SOON FAILED. THANK YOU IN ADVANCE, ROBERT POWELL.   *JB",
        "vin": "1FTWW33F7YE"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/12/2004",
        "dateOfIncident": "11/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098746,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL ALREADY DONE ON OCTOBER 29, 2002 FOR WIPER MOTOR. ON NOVEMBER 12, 2004 I STARTED THE TRUCK UP AND A MINUTES LATER I LOOKED AND SAW SMOKE COMING FROM THE UNDERNEATH THE HOOD AND THE WIPERS RUNNING ALL BY THEMSELVES IN THE PARKED POSITION, THE WIPER MOTOR MALFUNCTIONED AGAIN. IT WAS TOWED TO THE DEALERSHIP AFTER CALLING THEM. TOTAL REPLACEMENT COVERAGE IS UNKNOWN AND DAMAGE IS UNKNOWN AT THIS TIME.  *JB",
        "vin": "1FTWW33F2YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/28/2004",
        "dateOfIncident": "08/26/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089919,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FIRESTONE, STEELTEX LOAD RANGE E, LT265/75R16  DOT# VDW81XM329.  WHILE DRIVING AT APPROXIMATELY 70 MPH, THE TIRE TREAD SEPARATED, EXPOSING THE BELTS AND CAUSING DAMAGE TO VEHICLE. THE INNER WHEEL WELL WAS DESTROYED AND THE LEFT FRONT FENDER WAS SLICED THROUGH FROM THE STEEL BELTS AND THE FRONT BUMPER WAS SCRATCHED, AND THE RUNNING BOARD WAS RIPPED OFF THE TRUCK.  ALSO, THE MIRROR BRACKET WAS DAMAGED.   *AK   *SC  *JB",
        "vin": "1FTSW31F2YE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/27/2004",
        "dateOfIncident": "09/26/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093176,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TIRE FAILED. UPON REVIEW THE REAR LEAF SPRING  BROKE AND WAS DISPLACED TO THE POINT OF  RIPPING OUT THE INNER SIDE WALL OF THE TIRE. AT THE TIME I WAS RUNNING ABOUT 70 MPH IN WEEKEND HIGHWAY TRAFFIC.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/15/2004",
        "dateOfIncident": "09/10/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092331,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX A/T",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FIRESTONE STEELTEX AT LT265/75R16 LOAD RANGE E. DOT# VNW81XL020. THE TIRE HAD 48,854 MI OF TREAD WEAR. THE CONSUMER EXPERIENCED TREAD SEPARATION.  THE TIRE DID HOLD AIR. THERE WAS ALSO DAMAGE TO THE RIGHT REAR QUARTER PANEL OF THE VEHICLE.  .  *JB",
        "vin": "1FTSW31F2YE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "09/10/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090970,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F350 SUPER DUTY CREW CAB: WHILE DRIVING THE INNER AND OUTER AXLE BEARING SEALS BLEW OUT, ALONG WITH THE HUB BEARING ON THE FRONT DRIVERS SIDE.  THE WHEEL TURNED IN AND APPEARED AS IF IT WOULD COME OFF.  UPON INSPECTION, THE PASSENGER SIDE INNER AND OUTER SEALS WERE ALSO HANGING OUT.  CONTACTED FORD AND THEY SAID THAT THERE WAS NO RECALL OR SERVICE BULLETIN ON THE TRUCK.  THEY WILL NOT HELP OUT IN ANY WAY.  THERE IS ANOTHER REPORT ON THIS WEB SITE OF THE SAME INCIDENCE.  OUR FRIEND WHO OWNS THE SAME YEAR F350 CHECKED HIS TRUCK TO FIND THE EXACT PROBLEM, THE SEALS ON THE AXLE BEARINGS ARE HANGING OUT!",
        "vin": "1FTSW31F3YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/05/2004",
        "dateOfIncident": "09/02/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090480,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT CALIPER WON'T RELEASE.  APPARENTLY COMMON PROBLEM WITH 4X4 PER MECHANIC.  GOUGED OUT ROTOR AND ALMOST CAUSED ACCIDENT.  *JB",
        "vin": "1FTSW31F4YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/02/2004",
        "dateOfIncident": "08/29/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088998,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INTO MY GARAGE I HEARD A STRANGE CLUNCK NOISE FROM THE REAR END.  IT TURNED OUT TO BE MY SPARE TIRE FALLING OFF.  THE FACTORY SPARE TIRE CARRIER CABLE BROKE.  THE CABLE SHOWED NO SIGNS OF CORROSION, I FINALLY FOUND THE CRIMPED ON END IN THE DRIVEWAY TO CONFIRM THE CABLE BROKE AT THE POINT OF CRIMP.  THANK GOODNESS THIS HAPPENED IN MY DRIVEWAY AND NOT AT 70MPH, WHO KNOWS WHAT KIND OF DAMAGE OR WHO WOULD HAVE BEEN KILLED AS A RESULT OF THIS. I CALLED MY LOCAL FORD DEALERSHIP TO INQUIRE ON A RECALL OR AT LEAST A TSB, NONE EXISTED.  I INSTALLED A SAFETY CHAIN TO CATCH THE SPARE SHOULD THE CABLE BREAK AGAIN.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2004",
        "dateOfIncident": "05/22/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073102,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 73 MPH ON US 131 EXPRESS WAY MY TRUCK ALL OF A SUDDEN LOST ALL POWER TO THE FUEL SYSTEM. CAUSING MY ENGINE TO SHUT DOWN AND CAUSING ME TO LOOSE POWER STEERING AND POWER BRAKES. CAUSING ME TO TAKE EVASIVE MEASURES TO KEEP FROM GETTING REAR ENDED AND BRAKING WITH BOTH FEET TO GET THE TRUCK SAFELY STOPPED. IN HAVING MY TRUCK REPAIRED AT THE FORD DEALERSHIP THEY FOUND THAT THE COMPUTER MODULE PART NUMBER XC3Z-12B599-AA SHORTED OUT CAUSING THE ENGINE TO SHUT DOWN. WHEN CHECKING OVER THE MODULE MYSELF. I FOUND A METAL VENT CAP COMING OFF FROM THE OUTSIDE OF THE MODULE IN TIPPING THE UNIT OVER WATER CAME DRIPPING OUT OF THE MODULE. THIS MODULE IS LOCATED BEHIND THE WHEEL WELL ON THE FIREWALL OF THE TRUCK. I FEEL THAT THIS IS A DEFFECTIVE AND HAZARDOUS DESIGN. THAT COULD/SHOULD BE FIXED SO THAT OTHER INCIDENTS DO NOT HAPPEN.",
        "vin": "1FTSW31F2YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2004",
        "dateOfIncident": "04/24/2004",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071619,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS PARKED CONSUMER SMELLED BURNING WIRES. VEHICLE CAUGHT ON FIRE.   THE  FIRE DEPARTMENT EXTINGUISHED THE FIRE.  VEHICLE WAS TOWED TO THE DEALER FOR INSPECTION. *AK   STATE FARM INSURANCE MADE AN INVESTIGATION ON THE VEHICLE AND SAID THAT THE FIRE WAS CAUSED BY A DESIGN DEFECT IN THE DASH.  *LA",
        "vin": "3FTFW3158YM"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/12/2004",
        "dateOfIncident": "03/08/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061996,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BRAKES ON MY F350 4X4 FAILED WHILE DRIVING INTERSTATE 77.*AK",
        "vin": "1FTWW33FXYE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/09/2004",
        "dateOfIncident": "03/05/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060784,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX A/T",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2000 F350 DEVELOPED VIBRATION IN TIRES.  LR TIRE HAD SEPERATED TREAD.  LT265/75R16 FIRESTONE STEELTEX AT LOAD RANGE E.",
        "vin": "1FDSX35L8YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/01/2004",
        "dateOfIncident": "02/19/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060084,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THIS IS THE SECOND TOTAL TREAD SEPARATION OF A STEELTEX R4S TIRE ON A FORD F-350 TRUCK.  BOTH CASES RESULTED IN EXTENSIVE BODY DAMAGE TO THE VEHICLE AND NEAR LOSS OFF CONTROL.  THE FIRST CASE ENVOLVED COMPLETE FAILURE OF THE TIRE. THE SECOND CASE (THIS ONE REPORTED) WAS ONLY A TOTAL TREAD SEPARATION.*AK",
        "vin": "1FTSX30F6YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/03/2004",
        "dateOfIncident": "01/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG BLEW OUT OF THE CYLINDER HEAD AT 76000 MILES. MY ORIGINAL OWNERS MENUAL  ATES THE PLUGS DO NOT HAVE TO BE SEVICED FOR 100,000. THIS IS CERTAINLY A DESIGN ERROR SPARK PLUGS SHOULD NOT BLOW OUT OF THE CYLINDER HEAD.*AK",
        "vin": "1FTSX31S8YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/29/2004",
        "dateOfIncident": "01/20/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055186,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 F350 4X4 EXTENDED CAB HAD STEERING PROBLEMS SINCE DAY ONE.  TRUCK WOULD WANDER AT ALL SPEEDS.  DEALER FINALLY REPLACED STEERING GEAR BOX AT MY REQUEST AND AT MY COST AND TRUCK NOW STEERS AS IT SHOULD.  THIS PART SHOULD BE A WARRANTY PART.  *AK",
        "vin": "1FTSX31F0YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/16/2004",
        "dateOfIncident": "01/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054270,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG BLEW OUT OF THE CYLINDER HEAD AT 75000 MILES. FORD MANUAL DOES NOT RECOMMEND SERVICING THE SPARK PLUGS FOR 100,000 MILES. THIS IS CERTAINLY A MANUFACTURER DEFECT.  *CB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": "10/07/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042471,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CONSUMER APPLIED THE BRAKES AND THE RESERVOIR PUMP FAILED. DEALER NOTIFIED. *AK    THE POWER STEERING HOSE BLEW OUT FROM THE POWER STEERING RESERVOIR TO THE HYDRO BOOSTER.  *JB   *NM",
        "vin": "1FTSW31F7YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2003",
        "dateOfIncident": "10/10/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045424,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55 MPH ON STRAIGHT LEVEL ROAD VEHICLE LOST STEERING ABILITY DUE TO  PASSENGER'S SIDE TIE-ROD FALLING  OFF.*AK",
        "vin": "1FTWW32F9YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/30/2003",
        "dateOfIncident": "10/17/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045068,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON SEPTEMBER 17, 2003, I HAD A FIRESTONE STEELTEX RADIAL R4S ON THE RIGHT REAR OF MY 2000 FORD F-350 SEPARATE ON INTERSTATE 10 IN SOUTH MISSISSIPPI. FIRESTONE DID NOT REPLACE OR PAY FOR REPLACEMENT OF S TIRE IN VIOLATION OF THERE PRODUCT WARRANTY. AFTER FURTHER INSPECTION, I WAS ADVISED BY A GOODYEAR TIRE DEALER THAT I SHOULD REPLACE ALL FOUR TIRES AND HAVE DONE SO.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/23/2003",
        "dateOfIncident": "10/19/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043480,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "23585R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PARTIAL TREAD SEPARATION/LOSS OF APPROXIMATELY ONE-THIRD OF THE TREAD WITH NO ADVANCE INDICATION OF ANY TIRE TROUBLE. THE ENTIRE INCIDENT AT FREEWAY SPEEDS (65-70) LASTED NO MORE THAN 15 SECONDS FROM THE TIME I HEARD SOMETHING HIT MY LEFT FRONT FENDERWELL UNTIL THE CHUNK OF TREAD FLEW OFF, (DAMAGING MY LOWER REAR FENDER) AND I CAME TO A FULL STOP. THANKFULLY, THE TIRE DID NOT DEFLATE. MY DUALLY PICK-UP HAS A FULL SET OF THESE TIRES TO INCLUDE THE THE SPARE WHICH REPLACED THE DEFECTIVE TIRE. SHOULD I CONTINUE TO DRIVE ON THESE TIRES? THE ENTIRE SET HAS UNDER 26,000 MILES OF LIGHT DUTY USE.  *LA",
        "vin": "1FTWX33F5YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/22/2003",
        "dateOfIncident": "07/18/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039901,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING AT 75 MPH, THE REAR PASSENGER TIRE EXPLODED AND CAUSED MAJOR DAMAGE TO THE REAR END OF THE VEHICLE.  THE CAUSE OF THE FAILURE WAS UNDETERMINED.   *PH   *TS   *SCC  *JB",
        "vin": "1FTSX31F6YE"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "10/01/2003",
        "dateOfIncident": "09/30/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10041046,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FRONT LEFT TIRE TREAD CAME OFF.  *LA",
        "vin": "3FTSW31F1YM"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/21/2003",
        "dateOfIncident": "09/16/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039254,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "GRABBER AW",
                "productModel": "P27560R17",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "A 2000 FORD F-350, DUALLY.  ON THE INTERSTATE, THE FRONT LEFT TIRE PEALED LIKE A BANANA. WE DIDN'T KNOW WHAT HAD TAKEN PLACE UNTIL  GETTING THE TRUCK UNDER CONTROL AND STOPPED. THOUGHT IT WAS OUR TIME, VERY LUCKY THE TRUCK DID NOT ROLL OVER.   THE DAMAGE WAS SHOCKING!  FRONT BUMPER, ALONG THE WHOLE LEFT SIDE AND UNDER CARRIAGE TO THE BACK . DAMAGED! *JB",
        "vin": "1FTWX33F4YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/17/2003",
        "dateOfIncident": "06/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039063,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING LOCKS UP WHEN AT A STOP OR MOVING SLOWLY MAKING IT VERY DIFFICULT TO MANEUVER IN PARKING LOTS.  *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/11/2003",
        "dateOfIncident": "07/03/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038697,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING EASTBOUND ON I80 (TWO LANES EACH DIRECTION), TWO MILES WEST OF BATTLE MOUNTAIN, NV, THE DRIVERS SIDE FRONT TIRE OF MY 2000 FORD F350 TRUCK SEPARATED.  THE ENTIRE TREAD CAME OFF THE TIRE, WHILE THE REST OF THE TIRE REMAINED INTACT, INCLUDE AIR IN THE TIRE.  DURING SEPARATION, WHICH HAPPENED IN THE BLINK OF AN EYE, THE TREAD SEVERLY DAMAGED THE VEHICLE, INCLUDING THE FRONT BUMPER, THE WHEEL WELL, THE DRIVERS DOOR, AND DESTROYED THE SIDE STEP.  THERE WERE NO INDICATORS THAT SOMETHING WAS GOING TO HAPPEN.  NO VIBRATION, OR ANYTHING ELSE.  THE TRUCK VIOLENTLY SWERVED TO THE LEFT, ACROSS THE FAST LANE, AND HEADING TOWARDS THE MEDIAN.  FORTUNATELY, I WAS ABLE TO GET CONTROL OF THE VEHICLE BEFORE IN HEADED DONE THE EMBANKMENT AND INTO THE GULLY DIVIDING THE EAST AND WEST BOUND LANES, AND PULLED THE VEHICLE OVER ONTO THE RIGHT SHOULDER.  THIS WAS EXTREMELY DIFFICULT, DUE TO THE BUMPER BEING PUSHED INTO THE TIRE.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/22/2003",
        "dateOfIncident": "07/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033296,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "24575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING MY 2000 FORD F-350 ON FREEWAY 80 WEST FROM DAVIS CA, THE RIGHT REAR FIRESTONE STEELTEX ATX SIZE 245/75X16 DEVELOPED A LARGE BUBBLE AND TREAD SEPARATION.  TIRE IS FACTORY SUPPLIED ORIGINAL WITH ONLY 30,760 MILES ON IT, TREAD STILL HAS 25% OF DEPTH LEFT.  TIRE WAS ALWAYS NOTED TO HAVE RUN HOTTER THAN THE OTHERS, BUT DID NOT GIVE ANY WARNING THAT FAILURE WAS EMMANENT. WHEN I QUESTIONED 2 FIRESTONE DEALERS ABOUT THE HIGH RATE OF FAILURE FOR THEIR TIRES, I WAS TOLD THAT THESE TIRES HAVE ALWAYS BEEN GOOD AND THIS HAS NOT BEEN A PROBLEM.  WHEN I QUESTIONED THEM ABOUT GETTING A SETTLEMENT TOWARD BUYING ANOTHER BRAND OF TIRE, THEY GOT QUITE UPSET AND DEFENSIVE, REFUSING TO DO ANYTHING EXCEPT A PRORATED AMOUNT TOWARD A NEW FIRESTONE TIRE.  I TOLD THEM I WAS NOT INTERESTED IN HAVING ANOTHER FIRESTONE TIRE, AND THEY WOULD NOT DO ANYTHING ELSE.  I WAS NOT AT ALL HAPPY ABOUT THE WAY I WAS TREATED, OR ABOUT HAVING TO SHELL OUT FOR ALL NEW TIRES, SINCE I DON'T TRUST THE FIRESTONE TIRES REMAINING ON THIS TRUCK.*AK",
        "vin": "1FTSW31F7YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/16/2003",
        "dateOfIncident": "08/16/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX AT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FIRESTONE STEELEX AT TIRE 265/75R16  ORIGINAL EQUIPMENT TIRE ON 2000 FORD F350 4X4 PICKUP TRUCK AT 27,700 MILES  TRAVELING AT 45 MPH RIGHT REAR GROSS FAILURE OF TIRE. OUTSIDE SIDEWALL SEPARATED 90% FROM TREAD.  *AK",
        "vin": "1FTSF31L6YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/05/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032167,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "L22575R16, LT RSFEB1998, DA180P013L. CONSUMER STATES THAT RIGHT REAR TIRE BLEWOUT AT 65 MPH. TIRE WAS REPLACED, AND AT 400 MILES BLEWOUT AGAIN. CAUSE  UNKWOWN. *AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": true,
        "dateComplaintFiled": "07/26/2003",
        "dateOfIncident": "07/19/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10029259,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INCIDENCE #1-FORD F-350 CREW CAB. 69,000 MILES. FRONT WHEEL BEARING WENT OUT CAUSING WHEEL TO SUDDENLY JERK PULLING TRUCK AND HORSE TRAILER INTO ONCOMING LANE AND LOCKING UP BRAKE SYSTEM, AND ALMOST JACKNIFING TRUCK AND TRAILER. TRUCK WAS HAULING HORSES AT THE TIME. TIRE AND WHEEL WAS WOBBLING AND LOOKED READY TO FALL OFF. HORSE SUSTAINED LEG INJURY CAUSING TEMPORARY LAMENESS.   INCIDENCE #2- SAME TRUCK ONE WEEK LATER. LEAKING SEALS ON THE TURBO OIL LINES CAUSED ENGINE TO BE SHUT DOWN WITH NO WARNING(LIGHTS GAUGES ETC... ALL DRIVING FUNCTIONS INCLUDING POWER STEERING, BRAKES WERE LOST TO DRIVER. TRUCK WAS AGAIN HAULING  LARGE HORSE TRAILER IN HEAVY HIGHWAY TRAFFIC ON WINDY HIGHWAY. TRUCK CRASHED ONTO SIDE OF ROAD. NO OTHER VEHICLES INVOLVED  INCIDENCE #3- 8 DAYS LATER. DIESEL FUEL LINES CRACKED AND LEAKING. ELECTRICAL WIRING IS FRAYED IN ENGINE COMPARTMENT. MAY HAVE BEEN CAUSED FROM DEALERSHIP WORKING ON LAST REPAIR OF LEAKING TURBO SEALS.?  FORD COMPANY OR DEALERSHIP HAS BEEN OF NO HELP IN DEALING WITH FAULTY PARTS, SAFETY ISSUES OR WARRANTY.*AK",
        "vin": "1FTSW31F7YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/12/2003",
        "dateOfIncident": "06/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025961,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "LT26575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING S/B INTERSTATE 5 - 11:00 AM AT 65 MPH SOUTH OF LAS VEGAS, I HAD A TREAD SEPERATION OF THE LEFT REAR TIRE (SINGLE REAR) CAUSING DAMAGE TO LEFT REAR QUARTER PANEL AND TAIL LIGHT.*AK",
        "vin": "1FTSW30F7YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/26/2003",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020522,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX AT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY WIFE WAS DRIVING OUR 2000 F350 FORD TRUCK. IT WAS EQUIPPED WITH FIRESTONE STEELTEX TIRES ON THE REAR.  AT A SPEED OF 55-60 MPH ON I17 IN ARIZONA MY WIFE EXPERIENCED A CATASTROPHIC TIRE FAILURE ON THE LEFT REAR TIRE.  THERE WAS NO WARNING, THE TIRE SIMPLY SEEMED TO COME APART. SHE MANAGED TO CONTROL THE VEHICLE AND BRING IT SAFELY TO A STOP ON THE EDGE OF THE HIGHWAY.  SHE STATED THAT THERE WAS NO DEBRIS IN THE ROAD.  IT WAS APPROX. 12:30 PM, THE TEMPERATURE WAS IN THE 90'S, AND THE ROAD WAS DRY.  AFTER ROAD SERVICE CHANGED THE TIRE SHE CONTINUED ON TO FLAGSTAFF, AZ AND DROPPED THE RIM AND DESTROYED TIRE OFF AT A DISCOUNT TIRE FOR REPLACEMENT OF THE TIRE.  THE SERVICE WRITER STATED THAT  WAS THE WORSE FAILURE HE HAD SEEN ON A TIRE.  THE TIRES WERE OEM.  THEY HAD BEEN INSPECTED THE WEEK BEFORE BY THE LOCAL FORD DEALERSHIP AS PART OF ROUTINE SERVICE THE SAME WEEK AS THE INCIDENT.   THE DISTRUCTION OF THE TIRE RESULTED BODY DAMAGE TO THE LEFT FENDER AREA OF THE VEHICLE.  I REQUESTED AND HAVE THE DESTROYED TIRE.  I AGREE IN OVER 20 YEARS OF MILITARY SERVICE I HAVE NEVER SEEN TIRE THAT FAILED IN THIS MANNER.  *NLM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/26/2003",
        "dateOfIncident": "05/24/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020537,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY 2000 F-350 FORD PICKUP EXPERIENCED A VIOLENT AND CONTINUAL SHAKING WHILE PROCEEDING AT HIGHWAY SPEEDS ON I-5 ON 24 MAY,2003.  INVESTIGATION REVEALED A BUBBLE AND TREAD SEPARATION ON MY LEFT REAR LT 26575R16 FIRESTONE STEEL TEX RADIAL R4S TIRE. VEHICLE WAS CONTROLLED AND TIRE CHANGED PRIOR TO ANY INCIDENT.    *NLM",
        "vin": "1FTSX30F2YE"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "05/14/2003",
        "dateOfIncident": "05/02/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018732,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BLOWOUT WITH TREAD SEPARATION WHILE DRIVING 70 MPH ON LEFT FRONT R4S II LT265/75/R16 STEELTEX RADIAL M/S LOAD RANGE E CAUSING AN ACCIDENT CROSSING MEDIAN OPPOSITE DIRECTION TRAFFIC BARELY MISSING AN ONCOMING 18 WHEELER THROUGH A DITCH/6FT CULVERT THROUGH A FENCE AND INTO FIELD. EXTENSIVE ($8.000+) DAMAGE TO F-350 SCLWB 4X4 FRAME AND FRONT END.  22800 MILES ON FACTORY TIRES, FORD HAD REFUSED TO REPLACE TIRES IN 2000 WHEN ASKED \"THEY WEREN'T ON THE LIST\"  TIRES VDW8-DECATUR PLANT.   *NLM",
        "vin": "1FTSX31F0YE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/08/2003",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018428,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"DOOR AJAR\" DASH LIGHT IS ON OFTEN.  NO DOORS ARE OPEN.  THE INTERIOR AND EXTERIOR BED LIGHT ARE ALSO LIGHT UP.  THIS PROBLEM COMES AND GOES-OFTEN.  I HAVE FOUR YOUNG KIDS, IT IS A BIG SAFETY ISSUE WHEN I SEE THE LIGHTS COME ON HEADING DOWN THE FREEWAY.  *NLM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/14/2003",
        "dateOfIncident": "03/20/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE LEFT REAR TIRE EXPERIENCED TREAD SEPARATION. *JB",
        "vin": "1FPTFX317YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "08/26/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011894,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX AT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE TREAD OF THE LEFT REAR TIRE SEPARATED WHILE DRIVING AND WRAPPED COMPLETELY AROUND THE AXLE.  THE TIRE REMAINED INFLATED (FIRESTONE STEELTEX, 265/75R16, LOAD RANGE E, VNW81XL2500).   *NLM   *NLM",
        "vin": "1FTFX31F9YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/01/2003",
        "dateOfIncident": "07/23/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008308,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "GRABBER AW",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BOTH REAR INSIDE TIRES WENT FLAT AT THE SAME TIME.  THE RIGHT TIRE HAD APPROX. 5390 MILES ON IT SINCE IT WAS THE SPARE FROM AN EARLIER BLOWOUT.  THE LEFT TIRE HAD APPROX. 22875 MILES ON IT.  I HAVE NOT FILED THIS WITH THE TIRE COMPANY DUE TO THEIR TREATMENT FROM THE FIRST FAILURE.  I WAS TOWING A FIFTH WHEEL RV TRAILER AT THE TIME OF THE INCIDENT.*JB",
        "vin": "1FTWW32FXYE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/01/2003",
        "dateOfIncident": "02/23/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008306,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "GRABBER AW",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "INSIDE REAR DUAL TIRE BLEW OUT WHILE DRIVING CAUSING DAMAGE TO THE FENDER, LINER AND MUD FLAP.  COMPANY STATED TIRE HAD BEEN RUN FLAT.  I DON'T THINK IT WOULD HAVE BLOWN IF IT WAS FLAT.  I ALSO HAD TWO MORE TIRES GO OUT IN JULY OF 2002 (I WILL FILE ON IT ALSO).",
        "vin": "1FTWW32FXYE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2003",
        "dateOfIncident": "01/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005503,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH RELEASE BEARING (THROW OUT BEARING) ACTUATOR ARM FAILURE    RESULTING IN MOVEMENT OF VEHICLE WHILE CLUTCH PEDAL IS DEPRESSED     THIS IS THE SECOND FAILURE OF THE SUBJECT PART IN THE LIFE OF THIS SERIAL NUMBER TRUCK. THE FIRST OCCURRED AT APX. 37,000 MILES; THE SECOND AT APX. 95,000 MILES. BOTH REPAIRS WERE COMPLETED USING OEM PARTS. I AM IN POSSESSION OF THE SECOND FAILED PART AND WILL MAKE IT AVAILABLE FOR INSPECTION UPON REQUEST.    THIS FAILURE IS A MAJOR SAFETY ISSUE AS THE POWER TRAIN CAN NOT BE INTERRUPTED BY NORMAL MEANS. THAT IS, ONE NORMALLY DEPRESSES THE CLUTCH PEDAL TO INTERRUPT POWER TRANSMISSION AND APPLIES BRAKE ACTION TO STOP THE VEHICLE. WHEN THE SUBJECT ARM FAILS, ONE DEPRESSES THE CLUTCH PEDAL AND THE VEHICLE CONTINUES MOVEMENT, CAUSING AN INHERENT REACTION DELAY TO ASSES THE ABNORMALITY, SUBSEQUENTLY FOLLOWED BY APPLICATION OF BRAKE PRESSURE TO STOP THE VEHICLE, CAUSING A SIGNIFICANT BIND IN THE TRANSMISSION, RESULTING IN THE INABILITY TO MOVE THE TRANSMISSION SHIFTER OUT OF GEAR, THEN ONE MUST EITHER TURN OFF THE IGNITION OR APPLY BRAKE PRESSURE OF SUFFICIENT FORCE TO STALL THE ENGINE; ALL OF WHICH HAS CONSUMED AND EXCEEDED A REASONABLY PLANNED STOPPING DISTANCE.     THE RESULTING DELAY MAY RESULT IN INJURY OR DEATH OF BY STANDERS, SHOULD THEY BE PINCHED BETWEEN THE FAILURE VEHICLE AND A STATIONARY OBJECT.    THE OPERATING NATURE OF A TRUCK OF THIS DESIGN INCREASES THE RISK OF INJURY OR DEATH, FOLLOWING THE DESCRIBED FAILURE. THE MANUFACTURER MARKETS THIS TRUCK TO COMMERCIAL OPERATORS AND ONE WILL ROUTINELY FIND THE VEHICLE EMPLOYED ON WORK SITES AND SIMILARLY CONGESTED AREAS.    THIS FAILURE LEAVES THE TRUSTING AND CAPABLE OPERATORS OF THIS VEHICLE AND UNSUSPECTING BY-STANDERS AT RISK OF INJURY OR DEATH; WHILE AT PLAY OR ON THE WORK PLACE.",
        "vin": "1FTWX33F5YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/20/2003",
        "dateOfIncident": "02/22/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002983,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "COLD MORNING STARTS, ENG: 7.3DIESEL.  PROBLEM STARTED AROUND DEC. 31,2001.  ON FIRST START ENG. IS SLOW TO START, WHEN IT DOES START IT GOES FROM 300RPM TO 1200RPM ABOUT THREE TIMES AND THEN SETTLES DOWN ON 800RPM'S AND RUNS OK. THE VEH. HAS BEEN IN APPROX.  4 OR 5 TIMES FOR THIS PROBLEM. THE DEALER  SHOWS THE VEH, HAS BEEN IN TWICE FOR THIS PROBLEM. I HAVE  TALKED  WITH  OTHER FORD TRUCK OWNERS  WITH A 7,3 DIESEL  ENG. AND NO ONE HAS HAD THIS PROBLEM. THE DEALER TELLS ME THAT THIS IS NORMAL FOR THE 7.3DI IN COLD WEATHER. QUESTION: IF THIS IS NORMAL WHY DID IT TAKE ALMOST A YEAR FOR THIS TO START.  OTHER PROBLEMS: 1. AARM REMAN INJ PKG #8 CYL REPLACED. 2. WARPED ROTORS (FRONT), WARPED PADS HEAT CRACKED, CALIPERS REPLACED. 3. 50 MILES ON TRUCK, TRUCK PULLED TO THE RIGHT ALL THE TIME,  TOOK INTO DEALER 4 TIMES, (CARSON CITY), DEALER IN FALLON CAME TO MY HOUSE TOOK THE VEH. TO FALLON & FIXED PULLING PROBLEM. 4. POWERTRAIN CONTROL MODULE (PCM) REPLACED. 5. EGR PRESSURE FEEDBACK-PFE/EXHAUST BACK PRESSURE -EBP-REPLACED. 6. DEALER INSTALLED FUEL HEATER KIT , SOP TOP WATER FUEL HEATER. ( ALL OF THIS & THIS DIESEL STILL GOES FROM 300RPM TO 1200RPM).  I TALKED TO A DIESEL SHOP IN RENO, NV. AND HE  SAID THERE IS SOMETHING WRONG WITH THIS DIESEL.  I HATE TO  THINK WHAT THIS IS DOING TO THE INTERNAL PARTS OF THIS ENG. I WOULD THINK THAT THE BEARINGS AT 300RPM ARE GETTING VERY LITTLE OIL PRESSURE. ( HOW EVER THE DEALER SAID THIS IS NORMAL AND THAT I SHOULD PLUG IN THE ENG. HEATER. QUESTION: HOW DO YOU PLUG IN WHEN YOU ARE ON VACATION OR OUT FISHING WHICH I DO ALOT.",
        "vin": "1FTSW31F1YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/18/2002",
        "dateOfIncident": "10/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769873,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT WHEEL ROTORS WARPED AND HAD TO BE RE-SURFACED AT 22,000 MILES. THE DEALER TURNED THE ROTORS AND INSTALLED NEW FRONT BRAKE PADS.  AT 32,000 MILES THE FRONT ROTORS WERE WARPED AGAIN.  WHEEL VIBRATION COULD BE FELT IN THE BRAKE PEDAL AND FRONT END ON HARD BRAKING WHILE GOING DOWN STEEP HILLS.  THE DEALER SAID THAT THE WARPING WAS CAUSED BY EXCESSIVE HEAT.  AT 32,000 AND 38,000 MILES THEY SAID THAT BRAKES ARE NOT COVERED UNDER WARRANTY AND THEY WOULD NOT CORRECT THE PROBLEM.  THE RECOMMENED HAVING THE ROTORS TURNED AND INSTALLING \"COMPOSITE/METALLIC\" BRAKE PADS.  THEY STATED THAT THE FACTORY BRAKE PADS ARE TOO HARD FOR THE ROTORS.  THE BRAKE PADS HAVE SHOWN LITTLE WEAR.  THERE IS AN EXHAUST BRAKE ON THE VEHICLE AND THE BRAKES HAVE BEEN USED SPARINGLY.  I FEEL THAT THERE IS AN ENGINEERING PROBLEM WITH THE FRONT BRAKE SYSTEM.  DT",
        "vin": "1FTSW31FOYE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/19/2002",
        "dateOfIncident": "06/14/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763233,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE TREAD SEPARATION ON ENTIRE TIRE FROM STEEL BELT CARCASS. *AK",
        "vin": "1FTSW31F2YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/03/2002",
        "dateOfIncident": "03/31/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6901135,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING BOX BROKE CAUSING INSURED TO LOSE CONTROL RUNNING OFF THE ROAD AND INTO A DITCH, CLAIM 03-3137-171.  *JG",
        "vin": "3FTSW31F5YM"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/03/2002",
        "dateOfIncident": "02/23/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6901133,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CLAIM NUMBER 59-V709-810 -  CONSUMER STATES THAT THE STEERING ARM SHEARED FROM THE STEERING BOX, FORD STATED THIS WAS ACCIDENT RELATED, UNABLE TO FIND CONTACT ON STEERING ARM, NO CONTACT AROUND STEERING LINKAGE OR SPRING, CONTACT WAS MADE ON LEFT FRONT OF BUMPER BAR.  *TT",
        "vin": "1FTSX31S6YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/03/2002",
        "dateOfIncident": "07/03/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6901134,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION, INSURED ATTEMPTED TO CHANGE LANES WHEN THE STEERING WENT OUT, CAUSING INSURED TO STRIKE ANOTHER VEHICLE IN THE REAR, RIGHT FRONT WHEEL HAD BEEN PUSHED BACK CAUSING SECTOR SHAFT TO BREAK, CLAIM 31-3069-892.  *JG",
        "vin": "1FTWX33F1YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/03/2002",
        "dateOfIncident": "11/01/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 6901132,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CLAIM NUMBER 11-3548-745 - WHILE IN STOP AND GO TRAFFIC IN THE FAR RIGHT LANE, VEHICLE 1 WAS TRAVELING IMMEDIATELY BEHIND VEHICLE 2, AS VEHICLE 2 STOPPED FOR TRAFFIC, VEHICLE 1 ATTEMPTED TO CHANGE LANES, WHEN SUDDENLY THE STEERING WOULD NOT RESPOND, CAUSING VEHICLE 1 TO COLLIDE WITH REAR RIGHT SIDE OF VEHICLE 2, INJURIES WERE A RESULT OF IMPACT.  *TT",
        "vin": "1FTSF30L1YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/08/2002",
        "dateOfIncident": "11/25/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756549,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING ON MY TRUCK WAS FINE FOR THE FIFST 35,000 MILES AND THEN LOST ALL POWER STEERING WHEN STOPPED WITH FOOT ON BRAKE OR OFF THE BRAKE. I TOOK THE TRUCK IN TO THE FORD DEALOR AND WAS TOLD THIS IS A NORMAL WAY FOR THIS SYSTEM TO WORK AND LIVE WITH IT,I CALLED FORD MOTER COMPANY AND THEY SAID THE SAME THING. I FEEL THIS IS A SAFTEY PROBLEM AS WHEN OFF ROAD YOU CANT GET THE TRUCK TO TURN IF THERE IS ADVERSE WEATHER CONDITIONS AND YOU MUST TRY TO TURN AT LOW SPEED OR NO SPEED. IF IT IS ICY ON THE ROAD OR EVEN ON DRY PAVEMENT IF YOU APPLY THE BRAKES AND TRY TO STEAR OUT OF A SKID SAY TO AVOID A CRASH YOU CANT GET THE TRUCK TO TURN DUE TO YOUR FOOT ON THE BRAKE.YOU CANT TURN IN SHOPPING CENTER PARKING LOTS TO GET INTO PARKING SPACES DUE TO THE STEERING PROBLEM. AND SHAME ON FORD FOR SELLING THESE TRUCKS THAT THEY KNOW HAVE THIS SITUATION (BULLITON 15446)  AND NOT TELLING THE CONSUMER THAT THIS IS A PROBLEM WITH THESUPER DUTY F-SERIES AND THE EXCURSION AND LEADING YOU TO BELIEVE THAT THE TRUCK WILL FUNCTION AS WEEL AT 5 MILES AS IT WILL AT 40,000 MILES. THEY SHOULD BE MADE TO FIX THIS PROBLEM AND TO DISCLOSE THE FACTORY BULLITON 15446 TO ALL CONSUMERS LOOKING AT THERE PRODUCT AS IT AFFECTS THE DRIVE ABILITY AND RESALE VALUE OF THE TRUCK. *AK",
        "vin": "1FTSW31F6YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/24/2001",
        "dateOfIncident": "06/01/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 896717,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GENERAL, GRABBERS TIRES, DOT9113 23585R16; AFTER HAVING TIRES SERVICED NOTICED SIDEWALL WITH CRACKES/ BUBBLES.*AK  THE BUBBLES ON TIRES EXPAND TO THE POINT OF ERUPTION DOWN TO INNER LINING OF TIRE.*JB",
        "vin": "1FTWW33F8YE"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 561946,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER CLASS C MOTORHOME UNIT IS A SHASTA 22.5 V10 WAS AFFECTED BY WINDY CONDITION AND BY PASSING TRAFFIC ESPECIALLY TRUCKS AT HIGH SPEED. THE DEALER EXAMINED THE MOTOHOME AND RECOMENDED THAT SPECIAL EQUIPMENT BE INSTALLED TO CORRECT THE UNSAFE HANDLING OF THE MOTOHOME. THE UNIT WAS WEIGHED AND WAS FOUND THAT THERE WAS WEIGHT DIFFERENCE OF 500 POUNDS FROM ONE SIDE TO THE OTHER, CONSUMER STATES HE WAS TOLD BY DEALER THAT NINE OUT OF TEN CLASS C MOTOR HOMES HAVE STEERING PROBLEMS.  *YH",
        "vin": ""
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 561946,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER CLASS C MOTORHOME UNIT IS A SHASTA 22.5 V10 WAS AFFECTED BY WINDY CONDITION AND BY PASSING TRAFFIC ESPECIALLY TRUCKS AT HIGH SPEED. THE DEALER EXAMINED THE MOTOHOME AND RECOMENDED THAT SPECIAL EQUIPMENT BE INSTALLED TO CORRECT THE UNSAFE HANDLING OF THE MOTOHOME. THE UNIT WAS WEIGHED AND WAS FOUND THAT THERE WAS WEIGHT DIFFERENCE OF 500 POUNDS FROM ONE SIDE TO THE OTHER, CONSUMER STATES HE WAS TOLD BY DEALER THAT NINE OUT OF TEN CLASS C MOTOR HOMES HAVE STEERING PROBLEMS.  *YH",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/20/2001",
        "dateOfIncident": "01/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 883500,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED A LEAK ON GARAGE FLOOR, TOOK VEHICLE TO DEALER, AND THEY FIXED LEAK. COSUMER STARTED SMELLING FUMES COMING IN, AND DEALER DID NOT KNOW WHERE  THEY WERE  COMING FROM.  CONSUMER DID NOT USE HEATER BECAUSE  SMELL WAS TOO STRONG.  *AK",
        "vin": "1FTSE34L6YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/20/2001",
        "dateOfIncident": "10/25/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 741203,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES HAVE SEPARATED ,THESE ARE OUT OF ROUND AND ROUGH RIDING AT ALL SPEEDS. *AK (TIRESIZE: 235/85/16)( DOT NUMBER:  TIRE SIZE: 235/85/16 )",
        "vin": "1FTWW32F5YE"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/07/2000",
        "dateOfIncident": "01/24/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 553567,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMERS EXPERIENCED PROBLEMS CONCERNING LOSS OF BRAKING ABILITY, STEERING, AND THROTTLE STICKING WHICH CAUSED 2 ACCIDENTS.  NLM",
        "vin": "1FTWW33F8YE"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/15/2000",
        "dateOfIncident": "02/15/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 863646,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM MALFUNCTIONED, AND CONSUMER LOST ALL POWER WHEN BRAKING.   VEHICLE HAS BEEN AT THE DEALER 4 TIMES & THEY HAVE FOUND NO REMEDY.  ALSO, WHEN STARTING THE VEHICLE, THE STEERING WHEEL IS DIFFICULT TO TURN.  AFTER THE BRAKES WERE REPAIRED, STEERING BECAME MORE DIFFICULT. *AK *ML",
        "vin": "1FTWWS3F8YE"
    }
]