[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/04/2021",
        "dateOfIncident": "05/03/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11415151,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A TIRE BLEW OUT DRIVING ON A HIGHWAY. GOODYEAR WRANGLER 235/75R15.",
        "vin": "1GDFG15R2Y1"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/23/2017",
        "dateOfIncident": "11/07/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10968174,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING TO A FULL STOP IN LIGHT TO MODERATE 35 TO 40 MILE AN HOUR TRAFFIC ZONES , USUALLY WHEN MAKING A RIGHT HAND TURN, THE BRAKE PEDAL WOULD OVER TRAVEL ALMOST TO THE FLOOR, THEIR WOULD BE A LOUD SCRUBBING SOUND. THIS HAPPENED A FEW YEARS AGO, AND I TOOK MY VAN TO THREE SEPARATE GM AUTHORIZED DEALERS/ REPAIR SHOPS ON THREE SEPARATE OCCASIONS AND THEY TOLD ME THAT THEIR WAS NOTHING WRONG WITH MY BRAKES. THIS WAS VARY FRUSTRATING.  SO I TOOK IT TO A LOCAL SHOP AND THEY DISCOVERED THAT THE RIGHT REAR PARKING BRAKE WAS ACTIVATED AND WOULD NOT RELEASE. THEY FIXED THE PROBLEM BY DISCONNECTING THE PARKING BRAKE CONTROL CABLE TO THE RIGHT REAR BRAKE DRUM. THE PROBLEM WAS FIXED EXCEPT NOW I HAD NO PARKING BRAKES! SINCE THAT TIME I HAD BECOME DISABLED AND THE VAN SAT ON MY PROPERTY FOR A COUPLE OF YEARS. UNTIL IT WAS TIME TO TAKE IT FOR A STATE REQUIRED EMISSIONS TEST. I TOOK THE VAN TO A LOCAL MECHANIC THAT WAS ALSO CERTIFIED BY THE STATE TO MAKE THE VAN PASS THE TEST. HE TOLD ME THAT I HAD A BRAKE CABLE DISCONNECTED, I TOLD HIM WHY. HE TOLD ME HE COULD FIXED THE PROBLEM, AND HE DID EVERY THING WORKED GUST FINE, AND HERE I AM A YEAR LATER FACING THE SAME PROBLEM. THERE HAS TO BE A PROBLEM WITH EITHER THE CABLE RUSTING AND WHEN SOMEONE APPLIES THE PARKING BRAKE THE RIGHT REAR DRUM WILL NOT RELEASE, OR SOMETHINGS WRONG WITH THE DRUM BRAKES. THE LAST TIME THE VAN WAS USED BY MY DAUGHTER, SHE HAS BEEN TRAINED TO OPERATE BIG BOX AMBULANCES, SHE IS AN EMT, SO I DON'T THINK SHE WOULD DRIVE IMPROPERLY, AND I WOULD ALSO TAKE HER WORK ABOUT THE MALFUNCTIONING BRAKES. ALL I CAN SAY IS HERE I GO AGAIN. BY THE WAY THIS VEHICLE HAS VERY LOW MILEAGE, LOOKS AND FUNCTIONS LIKE A NEW VAN EXCEPT FOR THIS BRAKE PROBLEM THAT KEEPS REOCCURRING. MAKE ME AFRAID TO LET ANY ONE USE IT, EVEN IF THEY BEEN TRAINED TO HANDLE LARGER VEHICLES.",
        "vin": "IGDFG15R6Y1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/09/2010",
        "dateOfIncident": "08/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348134,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I STEPPED ON THE BRAKES AND PEDAL WENT TO THE FLOOR, I HAD NO BRAKING AT ALL.  I WAS ATTEMPTING TO STOP AND PULL INTO A GAS STATION; FORTUNATELY I WAS HEADING UP-HILL.  I WAS ABLE TO CONTROL THE VEHICLE AND COAST TO A STOP SAFELY.  I HAVE NOT YET REPLACED ANY PARTS; I HAD THE TRUCK TOWED TO MY DRIVEWAY.  THE CAUSE OF THE ISSUE IS A RUPTURED BRAKE LINE DUE TO EXCESSIVE CORROSION.  THE BRAKE LINE IS RUPTURED AT A POINT ABOUT 18' BACK FROM THE FIREWALL.  THE TRUCK IS WASHED REGULARLY AND IS PRIMARILY DRIVEN ON-ROAD, NO EXTREME OR 'HEAVY-DUTY 'SERVICE USE OF THIS VEHICLE AT ALL. *TR",
        "vin": "1GTEK19T3YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2009",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC SAVANA 1500.  THE CONTACT STATED THAT THE SPEEDOMETER STICKS AND DISPLAYS INACCURATE SPEEDS.  IT USUALLY BECOMES STUCK ANYWHERE BETWEEN 60-70 MPH, REGARDLESS OF THE ACTUAL SPEED THAT IS BEING DRIVEN.  THE FAILURE HAS OCCURRED INTERMITTENTLY FOR YEARS AND THE VEHICLE WAS NEVER TAKEN TO THE DEALER.  THROUGH RESEARCH, THE CONTACT RECENTLY FOUND NUMEROUS COMPLAINTS FOR THE SAME FAILURE.  HE CALLED THE MANUFACTURER AND WAS INFORMED THAT THEY WERE ONLY REPAIRING THE 2003 AND 2004 MODELS, BUT NO RECALL HAD BEEN ISSUED.  WHENEVER THE CONTACT TAKES THE VEHICLE TO THE DEALER, THEY ARE UNABLE TO DUPLICATE THE FAILURE.  THE FAILURE IS PROGRESSIVELY BECOMING WORSE AND HAS NOT BEEN REPAIRED.  HE BELIEVES IT IS A SAFETY HAZARD TO NOT KNOW HOW FAST HE IS DRIVING.  THE FAILURE MILEAGE WAS APPROXIMATELY 55,000 AND CURRENT MILEAGE WAS 97,000.  UPDATED 03/04/09. *LJ  UPDATED 03/06/09. *JB",
        "vin": "1GDFG15R5Y1"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/15/2006",
        "dateOfIncident": "09/14/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168376,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 GMC SAVANA VAN WITH CONVERSION PACKAGE.  POWER STEERING COMPLETELY FAILED. I FOUND A RECALL NOTICE ON THE NHTSA SITE, CALLED GMC AND WAS TOLD THERE WAS NO RECALL. AFTER I TOLD THE OPERATOR THE RECALL NUMBER SHE THEN FOUND A \"CUSTOMER SATISFACTION SAFETY CAMPAIGN\".  I WAS NOT NOTIFIED OF THIS SERIOUS SAFETY HAZARD WITH MY VEHICLE.  MY 17 YEAR OLD DAUGHTER WAS DRIVING THE VEHICLE WHEN THE POWER STEERING FAILED. LUCKILY, SHE WAS ABLE TO PARK THE CAR WITHOUT INCIDENT.  THIS IS A LARGE HEAVY CAR IT IS ALMOST IMPOSSIBLE TO STEER W/O THE POWER STEERING.  GMC WILL BE KIND ENOUGH TO FIX THE STEERING AFTER I GET THE VEHICLE TO A DEALER. (THEY ARE NOT RESPONSIBLE FOR TOWING) SOOO I GET TO DRIVE THE CAR TO THE DEALER W/O THE POWER STEERING.  I WONDER IF IT WOULD PASS AN ACCIDENT AVOIDANCE COURSE??  *JB",
        "vin": ""
    }
]