[
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/28/2015",
        "dateOfIncident": "12/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10691249,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW SPEED ACTIVATION OF ABS BRAKES, ON DRY PAVEMENT, EXTENDING THE STOPPING DISTANCE TO AN UNANTICIPATED LENGTH. ALTHOUGH A COLLISION DID NOT OCCUR, THE PROBLEM IS ON GOING. THIS SOUNDS LIKE THE SAME CIRCUMSTANCES WHICH ARE INCLUDED IN THE MANUFACTURER'S RECALL 05V379000. EVEN THOUGH WE ARE NOT LOCATED IN ONE OF THE 14 STATES INCLUDED IN THE RECALL, OUR STATE DOES  AND HAS USED SALT AND OTHER CORROSIVE SUBSTANCES TO CLEAR ROADWAYS OF ICE AND SNOW FOR MANY YEARS.   *TR",
        "vin": "1GKEK13R1YR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2015",
        "dateOfIncident": "01/14/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC YUKON DENALI. THE CONTACT STATED THAT ANTI-LOCK BRAKE SYSTEM MALFUNCTIONED. THE CONTACT MENTIONED THAT THE VEHICLE EXHIBITED THE SAME FAILURE MENTIONED IN RECALL NHTSA CAMPAIGN NUMBER: 05V379000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 146,000.",
        "vin": "1GKEK63R1YR"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "09/27/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10638715,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BROUGHT THE CAR I KNEW THAT THEIR WERE SOME ISSUES THAT WOULD COME ABOUT, BUT I CAN BE DRIVING DOWN THE STREET, THE RADIO WILL GO OFF AND MY WINDOWS WILL NOT WORK, WIPERS WON'T WORK, MY DASH LIGHTS WILL GO OUT AND THE RADIO WILL NOT WORK AT ALL SOMETIMES IT LAST UP TO HOURS BEFORE I CAN GET THEM TO COME. I CAN TURN THE CAR ON AN TRY TO PUT IT IN GEAR IT WONT WORK IT TAKES ABOUT 2-3 MINUTES BEFORE IT WILL ENGAGE. PLEASE LET ME KNOW WHAT I CAN DO TO FIX THESE ISSUES WITH MY CAR, I LOVE IT VERY MUCH AND WILL BE UPSET IF SOMETHING WERE TO HAPPEN TO HER. SO FAR SO GOOD NO ACCIDENTS TO REPORT THIS TIME HOPEFULLY NEXT TIME THE SAME IF THERE IS A NEXT.  *TR",
        "vin": "1GKEK63R5YR"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "08/14/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619346,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED TO STOP PROPERLY, SURGING/INTERMITTENT PULSING AND STRANGE SOUNDS.  I THOUGHT THIS WAS A NORMAL FUNCTION FOR ABS BRAKES.  I TOLERATED AND DROVE CAREFULLY FOR YEARS.  NOW I FIND THIS IS A SYMPTOM OF A GMC RECALL PROBLEM 05V-379. UPON CONTACTING GMC THEY SAY THEIR COMPUTERS NEED UPDATING AND IT \"MAY\" BE IN FOR RECALL BUT THE GMC DOES NOT HAVE THE CORRECT PARTS NOW.  SOUNDS LIKE A MAJOR PROBLEM.  I AM WORRIED ABOUT TOTAL FAILURE AND AM REGISTERING A COMPLAINT.  THEY SAID THAT I COULD GET IT FIXED NOW AND THEN THEY \"MAY\" REIMBURSE ME LATER. I CALLED THE GMC NUMBER ON THEIR RECALL SITE, THE SITE SAID MY NUMBER \"MAY\" QUALIFY FOR RECALL.  I AM CONFUSED AND FRUSTRATED NOW THAT I KNOW THIS IS A BIG PROBLEM FOR OTHER GMC PRODUCTS AND CAN'T GET FIXED.  *TR",
        "vin": "1GKEK63R4YR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/11/2014",
        "dateOfIncident": "06/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING NORTH ON 85 AT 70 MILES AN HOUR AND MY VEHICLE DECIDED TO DROP DOWN TO 20. I HAVE LOOKED UP INFORMATION ON ISSUES THIS TRUCK HAS HAD AND 1 OF THEM IS REGISTERED UNDER NHTSA ID # 100032435 / PIP-4695.GM: LOSS OF POWER HESITATES ON ACCELERATION. 4.3, 4.8, 5.3, 5.7 AND 6.0 ENGINES COUPLED WITH THE 4L60E OR 4L65E MAY EXPERIENCE A CONDITION OF HESITATES, MISSES OR LOSS OF POWER UNDER ACCELERATION. THE VEHICLE MAY OPERATE AS IF IT IS IN REDUCED POWER MODE. *PE   I HAVE PURCHASED AN AIR MASS FLOW SENSOR, THROTTLE BODY SENSOR, ALL 4 O2 SENSORS, AND A COOLANT SENSOR. MY TRUCK IS STILL NOT RUNNING AT FULL CAPACITY.    I NEED SOME INFORMATION ON THIS AND SOME HELP FIXING MY VEHICLE.   *TR",
        "vin": "1GKEK13R6YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/10/2012",
        "dateOfIncident": "07/04/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479537,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWING DOWN FOR THE VEHICLE IN FRONT OF ME TO TURN LEFT AND MY GAS PEDAL WENT TO THE FLOOR. I WOUND UP REARENDING THE VEHICLE BECAUSE MY VEHICLE'S BRAKES DID NOT WANT TO ENGAGE.  *TR",
        "vin": "1GKEK13YR15"
    },
    {
        "components": "SUSPENSION,ENGINE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/10/2012",
        "dateOfIncident": "03/29/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE JUST BEEN HAVING PROBLEMS WITH THIS VEHICLE SINCE I PURCHASED IT. WHEN DRIVING IT SOMETIMES FEELS LIKE THE TRUCK IS FISHTAILING, GOING DOWN A STRAIGHT ROAD. THE ENGINE MAKES A GARGLING NOISE WHILE DRIVING AND IT GETS EVEN LOUDER WHEN YOU TURN THE VEHICLE OFF. THE WIPERS WORK WHEN AND HOW THEY WANT TO WORK; IT DOESN'T MATTER WHAT SPEED YOU PUT THEM ON. I HAVE NOT BEEN HAPPY  WITH THIS VEHICLE AT ALL, I LOOKED INFORMATION UP ON THIS VEHICLE BEFORE PURCHASING AND IT IS NOT LIKE THE INFORMATION STATED. *TR",
        "vin": "1GKEK13R6YR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/10/2012",
        "dateOfIncident": "03/03/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED THE VEHICLE IN MARCH, THE GAS GAUGE DID NOT WORK. I AM NOT SURE WHEN IT STOPPED WORKING. I WOULD REALLY LIKE FOR THIS TO BE FIXED, SO THAT I DO NOT RUN OUT OF GAS AGAIN. ( I WAS SITTING ON THE SIDE OF THE ROAD WITH MY 65 YEAR OLD MOTHER AND MY 16 MONTH OLD GRANDDAUGHTER.) PLEASE LET ME KNOW IF THIS CAN BE FIXED AND IF IT IS UNDER ANY RECALLS.  *TR",
        "vin": "1GKEK13R6YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/03/2010",
        "dateOfIncident": "05/15/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC YUKON. THE CONTACT STATED THAT WHEN TRAVELING AT A LOW RATE OF SPEED THE VEHICLE WOULD SLIDE. THE MECHANIC REPLACED THE BRAKE BOOSTER ROTORS AND PADS BEFORE THE CONTACT TOOK THE VEHICLE TO THE DEALER. THE CONTACT TOOK THE VEHICLE TO THE DEALER IN ORDER TO HAVE IT INSPECTED, AND WAS TOLD THAT THE FAILURE WAS WITH THE ANTI-LOCK BRAKING SYSTEM. THE DEALER INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN RECALL CAMPAIGN NUMBER 05V379000, WHICH WAS RELATED TO THE ANTI-LOCK BRAKING SYSTEM. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 135000 AND THE CURRENT MILEAGE WAS 150000.",
        "vin": "1GCEC140X7Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC YUKON DENALI. WHILE DRIVING 20 MPH  THE ABS LIGHT CAME ON. THE CONTACT APPLIED THE BRAKES BUT THE VEHICLE FAILED TO STOP.  WHENEVER THE ABS LIGHT WAS NOT ILLUMINATED THE VEHICLE BEGAN TO DRIVE NORMALLY. THE FAILURE HAS OCCURRED INTERMITTENTLY ON A DAILY BASIS. THE DEALER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 42000. THE CURRENT MILEAGE WAS 70000.    UPDATED 03/14/10   *BF  THE CONSUMER REQUESTED THE FILE TO BE CLOSED.  ACCORDING TO THE DEALER, THE DIAGNOSIS HAD NOTHING TO DO WITH THE RECALL. UPDATED 04/29/10.*JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/09/2009",
        "dateOfIncident": "07/09/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT WALL AT LOW SPEED DUE TO ANTI-LOCK BRAKE SYSTEM INCORRECTLY ACTIVATED.  SAME CONDITION HAS SINCE OCCURRED STOPPING AT STOP SIGNS.   MY VEHICLE IS A 2000 YUKON DENALI.  IT ISN'T COVERED IN NHTSA ACTION NUMBER: PE05020.  I BELIEVE THIS IS THE SAME ISSUE THAT CAUSED MY ACCIDENT. *TR",
        "vin": "1GKEK63RXYR"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "04/09/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10265246,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC DENALI.  WHILE DRIVING APPROXIMATELY 25 MPH, ANOTHER VEHICLE CRASHED INTO THE DRIVER'S SIDE OF THE CONTACT'S VEHICLE.  HER VEHICLE WAS COMPLETELY DESTROYED AND NONE OF THE AIR BAGS DEPLOYED.  AS A RESULT, TWO OCCUPANTS SUSTAINED MODERATE INJURIES.  THE CONTACT HAS PICTURES OF THE INCIDENT AND A POLICE REPORT WAS FILED.  THE CAUSE OF THE FAILURE HAS NOT BEEN DETERMINED.  THE FAILURE AND CURRENT MILEAGES WERE 117,000.",
        "vin": "1GKEK13R6YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/01/2009",
        "dateOfIncident": "03/25/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263833,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL # 05V379000 WAS ISSUED 8/29/2005 FOR THE GMC YUKON DENALI FOR ABS MALFUNCTION. GMC SAYS MY VIN IS NOT INCLUDED YET I HAVE THE EXACT PROBLEM DESCRIBED.  THIS IS A DANGEROUS PROBLEM AND NO WEB SITE SPECIFIES VIN NUMBER EXCLUSION. THE YEAR AND MODEL  ARE THE ONLY FACTORS. GMC SHOULD FIX THIS PROBLEM. *TR",
        "vin": "1GKEK63R9YR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2009",
        "dateOfIncident": "03/31/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263898,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC DENALI.  THE CONTACT WAS EXPERIENCING DIFFICULTY STARTING THE VEHICLE.  THE INDEPENDENT MECHANIC COULD NOT DUPLICATE THE FAILURES, BUT PROVIDED HER WITH NHTSA CAMPAIGN ID NUMBER 05V155000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP).  THE MANUFACTURER STATED THAT HER VIN WAS NOT INCLUDED IN THE RECALL; HOWEVER, THE DEALER VERIFIED THAT THE FAILURES WERE CAUSED BY THE FUEL PUMP.  THE REPAIR COST WAS ESTIMATED AT OVER $1,000.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE LESS THAN 100,405.",
        "vin": "1GKEK13R7YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/02/2009",
        "dateOfIncident": "01/02/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253561,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC YUKON DENALI.  WHILE DRIVING 25 MPH OR A LOWER SPEED, THE BRAKE PEDAL EXTENDS TO THE FLOOR WHEN IT IS DEPRESSED.  THE CONTACT TOOK THE VEHICLE TO A BRIDGESTONE SHOP TO BE REPAIRED AT THE COST OF $1,000.  A WEEK LATER, THE VEHICLE BEGAN TO SLIDE AND THE FAILURE RECURRED.  THE VEHICLE WAS TAKEN BACK TO THE REPAIR SHOP AND THEY STATED THAT THERE WAS A DEFECT IN THE HYDRAULIC ANTILOCK SYSTEM.  THE CONTACT WAS ADVISED TO TAKE THE VEHICLE TO THE DEALER FOR REPAIR.  THE GMC MANUFACTURER STATED THAT THERE WAS A RECALL FOR THIS ISSUE, EXCEPT FOR WISCONSIN BECAUSE IT IS NOT A SALT-BELTED CORROSION STATE.  THE CONTACT WOULD HAVE TO PAY FOR THE REPAIR EXPENSES.  THE FAILURE MILEAGE WAS 85,241.    UPDATED 02/05/09 *BF  UPDATED 02/09/09. *JB",
        "vin": "1GKEK13R2YR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2008",
        "dateOfIncident": "06/29/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253366,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC YUKON DENALI.  WHILE DRIVING 65 MPH, THE VEHICLE SUDDENLY STALLED AND SHUT OFF.  THE CONTACT WAS ABLE TO PULL THE VEHICLE ONTO THE SHOULDER AND HAD IT TOWED TO THE DEALER.  THE FUEL PRESSURE PUMP AND ECM WERE DIAGNOSED AS THE CAUSES OF THE FAILURE.  THE DEALER REPLACED THE FUEL DELIVERY PUMP AND FUSES AT THE COST OF $850.26.  A REPORT WAS FILED WITH THE MANUFACTURER.  THE MANUFACTURER STATED THAT THE VIN WAS NOT INCLUDED IN THE FUEL SYSTEM RECALL.  HOWEVER, IF THE RECALL HAPPENS TO EXPAND TO INCLUDE MORE VEHICLES, THE CONTACT COULD BE REIMBURSED FOR THE REPAIR COST.  THE FAILURE MILEAGE WAS 78,374 AND CURRENT MILEAGE WAS 139,000.",
        "vin": "1GKEK63R6YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/28/2007",
        "dateOfIncident": "04/10/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204409,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 GMC YUKON DENALI.  WHILE DRIVING 30 MPH, THE VEHICLE REFUSED TO STOP AND THE BRAKES MADE A LOUD NOISE WHEN THEY WERE APPLIED.  THE MECHANIC AT THE AUTO SHOP STATED THAT THE BRAKE SHOES AND DRUM FAILED.  THE MECHANIC PERFORMED THE REPAIRS.  THE CONTACT ALSO STATED THAT SHE HEARD A LOUD NOISE COMING FROM THE REAR OF THE VEHICLE WHILE MAKING A TURN.  THE NOISE SOUNDED LIKE A CRASH OCCURRED.  THE MECHANIC STATED THAT THE REAR END FAILED AND THEN REPAIRED THE VEHICLE.  THE CURRENT MILEAGE WAS 100,000 AND FAILURE MILEAGE WAS 98,000.",
        "vin": "1GKEK13R4YR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2007",
        "dateOfIncident": "09/12/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203071,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 YUKON DENALI OLD BODY STYLE WITH PASSLOCK 1. MANY TIMES IT WILL NOT START DUE TO A PROBLEM WITH THE PASSLOCK SYSTEM. I HAVE BROUGHT IT INTO THE DEALER FOR NOT TO FIND THE PROBLEM MANY TIMES AND BEING CHARGED AN HOUR FOR NOTHINGS. I DRIVE AND THE LIGHT COMES ON ALL THE TIME.  *JB",
        "vin": "1GKEK13R9YR"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "12/29/2006",
        "dateOfIncident": "11/05/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177284,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS SENSOR FAILS AT LOW SPEEDS. REQUIRES EXTENDED DISTANCE TO STOP.  BRAKE FAILURE.",
        "vin": "1GKEK63RXYR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2006",
        "dateOfIncident": "04/24/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE STARTING THE VEHICLE THE ENGINE WILL TURN OVER BUT NOT START.  THE CONTACT HAS REPLACED THE FUEL PUMP THREE TIMES, BUT THIS HAS NOT REPAIRED THE PROBLEM.  THERE IS  NHTSA RECALL.  # 05V155000, REGARDING THE FUEL PUMP; HOWEVER, THIS VEHICLE  IS NOT INCLUDED IN THE RECALL DUE TO THE VIN. UPDATED 06/01/2006.  *AK",
        "vin": "1GKEK63R4YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/17/2006",
        "dateOfIncident": "03/13/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152946,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE ANTILOCK BRAKES ACTIVATED AT SPEEDS BETWEEN 3-5 MPH.  THERE IS A NHTSA RECALL # 05V379000, REGARDING THE ANTILOCK BRAKES.  THE VEHICLE HAS THE SAME PROBLEMS AS INDICATED IN THE RECALL; HOWEVER, IT IS NOT INCLUDED IN THE RECALL DUE TO THE VIN.  *AK",
        "vin": "1GKEK13R2YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/18/2006",
        "dateOfIncident": "11/02/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147996,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE AT SLOW SPEEDS.  MY FOOT WOULD BE ON THE BRAKE COMING TO A STOP AND THEN THE ABS SYSTEM WOULD ACTIVATE CAUSING THE CAR TO MOVE FORWARD REQUIRING MORE PRESSURE ON THE BRAKE PEDAL TO STOP. RECALL 05V37900 IS AN ACCURATE DESCRIPTION OF THE PROBLEM. *JB",
        "vin": "1GKEK63R6YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/15/2005",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142709,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 GMC YUKON DENALI IS EXPERIENCING PROBLEMS AS DESCRIBED IN RECALL  05068 FROM GMC.  GMC HAS TOLD ME THAT MY VEHICLE FALLS UNDER THE RIGHT TIME FRAME BUT DOES NOT FALL UNDER THE RIGHT VIN NUMBERS.  I AM HAVING THE EXACT SAME PROBLEMS!  THE FOLLOWING IS AN EMAIL THAT I RECEIVED FROM GMC:      VEHICLES OF A MODEL YEAR ARE AFFECTED.      THERE IS AN UPCOMING RECALL 05068 FRONT WHEEL SPEED SENSOR- DESCRIPTION: ABS WHEEL SENSORS. GENERAL MOTORS WILL NOTIFY ALL OWNERS OF INVOLVED VEHICLES BEGINNING 10/12/2005. PLEASE MAKE SURE THE LOCAL DEPARTMENT OF MOTOR DIVISIONS (DMV) HAS YOUR CURRENT INFORMATION FOR MAILING PURPOSES IN CASE YOUR VEHICLE IS INVOLVED IN THE RECALL. BELOW ARE SOME INFORMATION THAT MAY BE HELPFUL FOR THE UPCOMING RECALL. DESCRIPTION OF CONDITION: SOME OF THE SUBJECT VEHICLES MAY EXPERIENCE EXTENDED STOPPING DISTANCE ASSOCIATED WITH UNWANTED ANTI-LOCK BRAKE SYSTEM (ABS) ACTIVATION DURING LOW-SPEED BRAKE APPLICATIONS (LESS THAN 10 MPH AND GREATER THAN 3.7 MPH). THIS CONDITION DOES NOT SET ANY ABS CODES NOR DOES IT ILLUMINATE THE ABS WARNING LAMP. THIS CONDITION IS MORE LIKELY TO OCCUR IN ENVIRONMENTALLY CORROSIVE AREAS, BASED ON FIELD REPORT DATA.  CONSEQUENCE OF CONDITION: WHEN THE PEAK-TO-PEAK WHEEL SPEED SENSOR VOLTAGE LEVEL RECEIVED AT THE ABS CONTROLLER IS BELOW THE MINIMUM SPECIFIED PEAK-TO-PEAK LEVEL, THE ABS CONTROLLER INTERPRETS THIS AS A WHEEL SPEED THAT IS LESS THAN THE ACTUAL WHEEL SPEED. IN OTHER WORDS, THE ABS INTERPRETS THE WHEEL AS SLIPPING WHEN IT IS NOT. IF THE BRAKES ARE APPLIED, AN EXTENDED STOPPING DISTANCE MAY BE REQUIRED.  *JB",
        "vin": "1GKEK13R0YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/04/2005",
        "dateOfIncident": "11/04/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEED SENSOR FAILS AT SPEEDS BETWEEN 6 AND 9 MPG; RESULTING IN NO OR LIMITED ABILITY TO BRAKE.  REPEATED NEAR ACCIDENTS HAVE OCCURRED IN TRAFFIC AND IN PARKING SITUATIONS.    THE VEHICLE IS BEING REPAIRED AT THIS TIME AT JIM MURPHY PONTIAC-GMC TRUCK, INC. 3000 WALDEN AVE  DEPEW,  NY 14043 PHONE: 716-684-8900 FAX: 716-684-9050.  I UNDERSTAND GM HAS RECALLED PRACTICALLY IDENTICAL VEHICLES SUCH AS THE GM TAHOE, SUBURBAN, ETC.  MY UNDERSTANDING IS THAT THE GMC YUKON DENALI IS VIRTUALLY THE SAME VEHICLE AS THE GM TAHOE.  I WOULD LIKE TO UNDERSTAND WHY THAT RECALL IS NOT APPLIED TO THE GMC YUKONS.  *NM",
        "vin": ""
    },
    {
        "components": "STEERING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "07/22/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER STATES THAT HER WINDSHIELD WIPERS WENT OUT ABOUT 1  TO 2 YEARS AGO.  WHEN SHE CALLED GMC, THEY HAD TOLD HER THE RECALL WAS NOT FOR 2000 MODEL VEHICLES.  SHE WAS TOLD HOW TO FIX THE VEHICLE, WHICH WAS DONE.  ON SATURDAY, THE POWER STEERING WENT OUT ON THE VEHICLE.  GENERAL MOTORS WAS CALLED AND THEY DID NOT HAVE ANY INFORMATION, BUT THE NEAREST DEALERSHIP WAS CONTACTED.  THE MANAGER AT THAT DEALERSHIP TOLD THE CONSUMER A COUPLE OF THINGS THAT IT COULD HAVE BEEN.  THE SHAFT THAT POWERS THE PUMP SHEERED OFF, BECAUSE IT IS TAPERED.  THE CONSUMER'S HUSBAND FOUND THE PROBLEM AND HE FIXED IT.   *JB",
        "vin": "1GKEK13R7YR"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/03/2005",
        "dateOfIncident": "09/02/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135243,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THIS IS A TIRE BLOWOUT AT 70 MPH ON EXPRESSWAY 840 IN TENNESSEE. PICTURE SHOWS TREAD BELT SEPARATION (AVAILABLE UPON REQUEST). TIRES HAVE 34051 MILES AND ARE THE ORIGINAL EQUIPMENT FOR THIS VEHICLE. TIRE IS DRIVER SIDE FRONT. INFLATION IS (WAS)40 PSI. VEHICLE STARTED TO VIBRATE THEN A LOUD POP NOISE WITH TOTAL TIRE FAILURE RESULTING IN A LOSS OF STEERING CAPABILITY AND MANEUVERABILITY.   FIRESTONE FIREHAWK LS P265/70R16  111S  27820 UR BM 13858 - 1  027584  TPC SPEC 1155MS  TRACTION B TEMP B  MADE IN USA.  *JB",
        "vin": "1GKEK63R9YR"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "01/03/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS BRAKES ENGAGED WITH NO WARNING AT LOW SPEEDS (PARKING LOTS, STOP SIGNS, DRIVE THROUHS) AND GREATLY INCREASED THE STOPPING DISTANCE AND SAFETY. THIS WAS OCCOURING IN THE FALL OF '04 EALY WINTER OF '05.  THIS WOULD HAPPEN ON TOTALY DRY SURFACES, AND WAS TO GREAT OF A RISK TO LEAVE UN-REPAIRED.  I HAD TO PAY OVER $900.00 TO CORRECT THE ONE FRONT WHEEL AND THE OTHER(S) ARE SURE TO FOLLOW. THIS IS POOR COMPENENT DEISIGN, AND SHOULD BE REPAIRED AS DEFECTIVE.  AN OWNER SHOULD NOT HAVE TO DISCONECT THE ABS COMPUTER TO AVOID THE BRAKE FAILURE, IF THEY ARE NOT ABLE TO PAY THE $900.00 + PER HUB.  ALSO OCCAISIONALY AFTER CLICKING DRIVER'S SEAT BELT, WITH OUT WARNING, THE BELT RELEASED AT THE LATCH.  NOT UNDER STRAIN, AND AFTER IT HAD BEEN FULLY ENGAGED.  WHY?",
        "vin": "1GKEK13R8YR"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2005",
        "dateOfIncident": "09/10/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107468,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ADJUSTING THE STEERING WHEEL DURING NIGHT HOURS THE HEADLIGHTS WOULD FLICKER. THE DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. PLEASE PROVIDE MORE INFORMATION.  *JB",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/23/2004",
        "dateOfIncident": "11/11/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100421,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HWY 65 SOUTH AT 70 MPH  ENGINE SUDDENLY QUIT .... HARD STEERING AND LITTLE BRAKE HAD TO WEAVE BETWEEN CONSTRUCTION BARRELS TO AVOID TRAFFIC (CLOSE ACCIDENT).  DEALER REPLACED THE CRANK SPEED SENSOR ($250.00).  *AK",
        "vin": "1GKEK63R9YR"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2004",
        "dateOfIncident": "09/23/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093933,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: FUEL TANK LEAK 2000 GMC YUKON/DENALI    ON THE EVENING OF SEPTEMBER 23, 2004 THE FUEL TANK WAS FILLED AT A LOCAL GAS STATION. UPON ARRIVAL AT HOME A STRONG GASOLINE SMELL WAS NOTICED FROM THE VEHICLE. THE NEXT MORNING NO OVERWHELMING SMELL OF GASOLINE WAS EVIDENT. ON OCTOBER 1, 2004 THE FUEL TANK WAS FILLED DURING THE DAY, AND GASOLINE WAS OBSERVED LEAKING DOWN THE SIDE OF THE FUEL TANK AND DRIPPING ONTO THE GROUND. THE VEHICLE WAS DRIVEN HOME AND NOT USED UNTIL AFTER THE FUEL WAS NO LONGER LEAKING ON OCTOBER 4, 2004. THE VEHICLE WAS TAKEN TO A GMC DEALERSHIP, VINCE WHIBBS AUTOMOTIVE GROUP, IN PENSACOLA, FL FOR SERVICE ON OCTOBER 7, 2004. THE SERVICE CONSULTANT, CHRISTA HALL, CALLED LATER THAT DAY TO INFORM ME THAT THE FUEL SENDING UNIT HAD STARTED TO SEPARATE FROM THE FUEL TANK AND THAT IS WHERE THE FUEL LEAK HAD COME FROM. I WENT TO THE DEALERSHIP AND THE SERVICE TECHNICIAN, ALEX JENKINS, JR, SHOWED ME THE FUEL TANK THAT HAD BEEN REMOVED AND POINTED OUT WHERE THE LEAK WAS COMING FROM. IT WAS ALONG A BONDED/PLASTIC WELDED BEAD AROUND THE BASE OF THE FUEL SENDING UNIT AND WHERE IT JOINS THE PLASTIC FUEL TANK, LOCATED AT THE TOP CENTER. A NEW FUEL TANK HAD TO BE ORDERED TO REPLACE THE DEFECTIVE TANK. THE OLD FUEL TANK IS AVAILABLE.  *NM",
        "vin": "1GKEK13R3YR"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/05/2004",
        "dateOfIncident": "12/31/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090472,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "YUKON DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "1) 4WD FAULTY ENCODER MOTOR FAILURE--SWITCH TO ENGAGE 4WD FAILED; OCCURRED AT 75,841 MILES ON 12/31/03  2) COULD NOT PUT VEHICLE INTO 4WD WHEN ON WINDING, NARROW, SNOWY ROAD; FORTUNATELY NO ACCIDENT.  *JB  3) 4WD FAULTY ENCODER MOTOR REPLACED ON 1/3/04, BUT WE HAD TO PAY FOR IT & 4WD RENTAL CAR; $938.46 & 180.15, RESPECTIVELY  NOTE:  I AM NOW REPORTING THIS BECAUSE AN ACCIDENT COULD HAVE BEEN FATAL AND I HAVE JUST HEARD THAT OTHER 4WD SAME SUV'S, YUKONS AND CHEVY TAHOES, HAVE HAD THE SAME PROBLEM, AND THE MANUFACTURER REFUSES TO RECALL THIS COMPONENT.  *JB",
        "vin": "1GNEV16KXJF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/01/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075495,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "FIREHAWK",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING 65-70 MPH PASSENGER'S FRONT TIRE TREAD SEPARATED. P265/70R16.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/20/2004",
        "dateOfIncident": "04/18/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE EXPERIENCED A VERY SERIOUS/DANGEROUS PROBLEM ON 9/5/03, 11/1/03, 11/2/03 & 4/18/04: THE ENGINE HAS COMPLETELY SHUT DOWN WHILE I WAS DRIVING MY SUV.  THIS HAS HAPPENED WHILE I'VE BEEN DRIVING ON  HWY, ON  BRIDGES/ TUNNELS  (WITHH NO SHOULDERS), & WHEN I'VE STOPPED THE SUV @ TRAFFIC LIGHTS & STOP SIGNS.  THE COMMON DENOMINATORS FOR THE ENGINE SHUTTING DOWN SEEM TO BE:     (1)LONG DISTANCE TRAVEL-ON ALL 4 OCCASIONS I HAD BEEN DRIVING THE VEHICLE ON THE HWY FOR 100 OR MORE MILES @ SPEEDS OF  60-70 MPH BEFORE THE ENGINE WOULD BEGIN SHUTTING DOWN  (2)WEATHER- ON ALL 4 OCCASIONS,  THE TEMPERATURE WAS 75-85 DEGREES WHEN THE ENGINE WOULD BEGIN SHUTTING DOWN      WHAT TYPICALLY HAPPENS WHEN THE ENGINE SHUTS DOWN: WHILE ACTIVELY DEPRESSING THE ACCELERATOR PEDAL, I WOULD SUDDENLY NOTICE THAT I WAS NO LONGER GETTING ANY ACCELERATION POWER    I WOULD THEN BEGIN TO PUMP THE ACCELERATOR PEDAL TO NO AVAIL    ALL THE LIGHTS ON THE DASHBOARD ILLUMINATED,  SIGNALING THE ENGINE SHUT DOWN      WHEN POSSIBLE, I WOULD PULL OVER TO THE SHOULDER, & CRANK THE IGNITION 1-3 TIMES BEFORE THE ENGINE WOULD START AGAIN.  ON THE DAYS THAT I EXPERIENCED THE  PROBLEM, THE ENGINE WOULD CONTIN. TO SHUT DOWN EVERY 1-5 MILES, (MORE FREQUENTLY IN TRAFFIC).  THE ENGINE WOULD CONTIN. TO SHUT DOWN UNTIL I COULD REACH A SAFE DESTINATION & ALLOW THE SUV TO REST FOR SEVERAL HRS.  IN TOTAL, THE ENGINE SHUT DOWN 10-18 TIMES ON EACH OF THE 4 DAYS THAT I HAD THE PROBLEM.      THE ENGINE WOULD SHUT DOWN MOSTLY WHILE I WAS ACTIVELY ACCELERATING, BUT  ALSO HAPPENED FREQUENTLY WHEN I WOULD BRAKE WHILE IN  TRAFFIC, & WHEN I WAS STOPPED @ A TRAFFIC LIGHT/STOP SIGN; OCCASIONALLY, THERE WERE TIMES WHEN I LOST ALL ACCELERATION POWER WHILE ACTIVELY DRIVING THE VEHICLE, BUT THE ENGINE DIDN'T ACTUALLY SHUTDOWN.  AFTER 10-20 SEC. OF HAVING NO ACCELERATION POWER, I COULD SUDDENLY ACCELERATE AGAIN. WHEN THE ENGINE SHUT DOWN, THERE WERE NO SIGNS OF OVERHEATING & I  HAD AT LEAST 1/3  TANK OF GAS.",
        "vin": "1GKEK13R2YR"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/29/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT EVERY 3000 TO 4000 MILES THE BRAKES NEEDED TO BE REPLACED REPLACED  DUE TO VIBRATION.   CONSUMER BELIEVES THAT THE HOT SUN IS  WARPING BRAKES AND ROTORS.  HOWEVER, DEALER BELIEVES THAT THE CONSUMER IS  SLAMMING ON BRAKES AT 80 MPH AND THAT'S WHAT IS CAUSING THE PROBLEM.  *AK",
        "vin": "1GKEK63R9YR"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/27/2003",
        "dateOfIncident": "07/26/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029301,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT SEAM SECURING THE TWO PIECES OF SHEET METAL OF THE HOOD SEPARATED WHILE DRIVING CAUSING THE TOP LAYER TO FLY UP, IMPAIRING VISION WHILE DRIVING.  THE BOTTM LAYER REMAINED SECURED BY THE LATCH.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/06/2003",
        "dateOfIncident": "05/06/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ON GMC DENALI VIBRATE AT 30 TO 45 MPH HAS HAVE THE ROTORS TURNED AND CUT TWICE SINCE THE CAR WAS PURCHASED IN AUG 2002 THE FIRST TIME WAS LESS THN 90 DAYS AFTER THE CAR WAS PURCHASE HAD LESS THAN 4000 ADDITIONAL MILEAGE. THE NEXT TIME WAS MARCH 2003 AGAIN LESS THAN 4K IN ADDITIONAL MILEAGE. AND JUNE 2003 THE SAME THING IS HAPPENING.*AK",
        "vin": "1GKEK63R9YR"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/19/2003",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10016204,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SEAT IS NOT ATTACHED.  I  HAD THIS REPLACED 2 TIMES IN THE LAST YEAR.  *JB",
        "vin": "1GDFG15W0Y1"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "03/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013652,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PULLS LEFT AND RIGHT WHEN  BRAKES ARE APPLIED. THIS WILL BE THE THIRD SET OF PADS REPLACED ON  FRONT END FROM SIX MONTHS AGO.  SUDDEN BRAKING CAUSES VEHICLE TO JERK INTO  SIDE LANES.  BRAKE LIGHT DOESN'T ILLUMINATE ON  DASHBOARD.   THERE IS  EXTENDED STOPPING DISTANCE.  DELAER NOTIFIED. PLEASE PROVIDE MORE INFORMATION.*AK",
        "vin": "1GTHC33J6YF"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/29/2002",
        "dateOfIncident": "10/14/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759984,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR STICKS WHEN YOU PUSH ON IT. IT HAS GOTTEN WORSE.*AK",
        "vin": "1GTEK19T2YE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING THERE IS A VIBRATION, THE TIRES HAVE BEEN REPLACED FOUR TIMES, CONSUMER STATES THAT THIS PROBLEM IS DESTOYING SUSPENSION PARTS, POSSIBLE SUSPENSION PROBLEM.   *SLC",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING THERE IS A VIBRATION, THE TIRES HAVE BEEN REPLACED FOUR TIMES, CONSUMER STATES THAT THIS PROBLEM IS DESTOYING SUSPENSION PARTS, POSSIBLE SUSPENSION PROBLEM.   *SLC",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/16/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 755711,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FILING A COMPLAINT AGAINST NHTSA FOR PERMITTING MANY AUTOMOBILE MANUFACTURERS TO UTILIZE SO-CALLED HIGH-BRIGHTNESS ARC-LAMPS ON PASSENGERS VEHICLES. THESE LAMPS CAUSE TEMPORARY BLINDNESS AND UNWARRANTED GLARE FOR OLDER DRIVERS SUCH AS MYSELF. THIS IS AN ESPECIAL PROBLEM WHEN THE ARC-LAMP EQUIPPED VEHICLE COMES OVER A HILL OR HITS A BUMP IN THE ROAD. THE POINT SOURCE NATURE OF THESE LAMPS RESULTS IN MUCH LOSS OF VISION IN DARK AREAS WITHIN THE FIELD OF VISION BECAUSE OF SCATTER DUE TO AGE HARDENING OF THE CRYSTALLINE LENSES OF THE EYE STRUCTURE. I AM AN INJURED PARTY ( I BELIEVE THERE ARE MANY THOUSANDS) SINCE THESE LAMPS DIMINISH THE ABILITY TO DRIVE AT NIGHT. I RECOMMEND THAT THEY BE OUTLAWED AS A SAFETY HAZARD. I AM A 63 YEAR OLD OPTICAL ENGINEER AND HOPE TO CONTINUE DRIVING FOR MANY MORE YEARS TO COME.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/12/2001",
        "dateOfIncident": "05/20/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9004978,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 55 MPH, TIRE BLOWOUT ON THE LEFT FRONT, CAUSED VEHICLE TO VEERS OFF THE ROAD TO THE RIGHT AND HIT A SERIES OF METAL POSTS WITH STEEL CABLE STRUNG BETWEEN THEM, THE CAUSE WAS A TIRE FAILURE DUE TO DELAMINATION TREAD SEPERATION.",
        "vin": "1GKEK63R0YR"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/10/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563638,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MODEL 6500 GMC TOP KICKS OR KODIAKS HAVE CAUSED EXTREMELY HARD STEERING EFFORTS IN THE POWER STEERING ASSEMBLY, AND THEN WILL LOCK UP WITH NO WARNING. THEY CHANGED ALL THESE UNITS, AND THE PROBLEM REOCCURRED. *YH  *JG",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/10/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563638,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MODEL 6500 GMC TOP KICKS OR KODIAKS HAVE CAUSED EXTREMELY HARD STEERING EFFORTS IN THE POWER STEERING ASSEMBLY, AND THEN WILL LOCK UP WITH NO WARNING. THEY CHANGED ALL THESE UNITS, AND THE PROBLEM REOCCURRED. *YH",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/25/2001",
        "dateOfIncident": "09/22/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDEWALL SIDE OF TIRE COMPLETELY FAILED. *AK (DOT NUMBER: VN73  TIRESIZE: P26575R16)",
        "vin": "26TEK19T2Y1"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/15/2001",
        "dateOfIncident": "05/18/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746882,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TRUCK IS STOPPED, YOU PRESS THE ACCELERATOR  AND THE ENGINE WILL REV UP, BUT THE TRUCK WILL NOT PROCEED FORWARD.  SECONDS LATER, YOU WILL HEAR THIS LOUD \"THUNK\" IN THE REAREND OF THE VEHICLE AND THE TRUCK WILL VIRTUELY JUMP FORWARD CAUSING YOU TO ALMOST HIT A CAR IN FRONT OF YOU.  THE SAME OCCURS WHEN BRINGING THE VEHICLE TO A STOP.*AK",
        "vin": "1GTEK19T6YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/02/2001",
        "dateOfIncident": "03/30/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SIMULTANEOUS LOSS OF STEERING AND BRAKES DUE TO STEERING PUMP SHAFT SHEER. *AK",
        "vin": "1GTGG25R6Y1"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/07/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742049,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES EQUIPPED WITH FACTORY SUNROOF DO NOT HAVE INDEPENDENT LIGHTING FOR THE REAR SEAT PASSENGERS, CREATING A SAFETY HAZARD WHEN LIGHTING IS NEEDED IN  REAR COMPARTMENT AND ALL LIGHTS MUST BE ILLUMINATED TO ALLOW LIGHTING IN REAR SEAT*AK",
        "vin": "1GKDT13W7Y2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/24/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 559146,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST SET OF TIRES WERE REPLACED BECAUSE THEY WERE OUT OF ROUND, THE NEW SET HAVE A RUMBLE WHICH SHAKES THE TRUCK, THESE ARE NOT INCLUDED IN RECALL, CONSUMER REQUESTED REIMBURSEMENT BUT WAS DENIED (FIRESTONE WILDERNESS P265/75R16 11XS M/S).  NLM",
        "vin": "1GTEK19T4YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/18/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE COMES EQUIPPED WITH  FIRESTONE FIREHAWK/LS TIRES,  P26570R16. FRONT PASSENGER'S SIDE TIRE SUFFERED A SIDEWALL BLOWOUT.  DEALER HAS BEEN CONTACTED.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/30/2000",
        "dateOfIncident": "08/08/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 729550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DENALI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TREAD ON OUR TIRES WAS SEPARATING JUST AS ON THE RECALLED TIRES.  WE FELT A SEVERE VIBRATION IN THE CAR WHEN TRAVELING AT INTERSTATE SPEEDS AND THE MECHANICS TOLD US THIS WHEN WE HAD THIS VIBRATION CHECKED.( DOT NUMBER:   )",
        "vin": "1GKEK13R9YR"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/30/2000",
        "dateOfIncident": "06/30/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 729551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS MY SECOND DENALI.  I FILED A REPORT ON THE OTHER WHERE TREAD WAS ACTUALLY SEPARATING AND THE TIRES HAVE BEEN REPLACED.   THE TIRES ON THIS VEHICLE ARE CONSTANTLY LOSING AIR AS IF THE TREAD ON THESE TIRES ARE SEPARATING TOO.   I PLAN TO HAVE THEM REPLACED BECAUSE OF THIS PROBLEM AS  I AM AFRAID  THEY WILL CAUSE THE VEHICLE TO WRECK.  THIS IS ESPECIALLY DISCONCERTING FOR ME SINCE THE TIRES ON MY OTHER DENALI WAS CAUSING THE VEHICLE TO BADLY VIBRATE AT HIGHER SPEEDS AND IT WAS CONFIRMED THAT THE TIRE TREAD WAS SEPARATING AS IN THE RECALLED TIRES.( DOT NUMBER:   )",
        "vin": "1GKEK13R9YR"
    }
]