[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "08/28/2020",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353244,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON MY WAY TO A GIG/JOB, WHILE I WAS ON THE HIGHWAY, GOING ABOUT 65 MPH,THE CAR STARTS TO JERK AND THE CAR ALL OF A SUDDEN STARTS SHUTTING DOWN ON ME. I ALMOST HAD A CAR ACCIDENT WHEN THE CAR SHUT OFF COMPLETELY. I HAD TO PAY FOR A TOW BACK HOME SINCE THE CAR WON'T EVEN START WITH A JUMPSTART. NOW I CAN'T EVEN TURN THE CAR ON. I PURCHASED THIS CAR ON 07/14/2020. NOW I HAVE TO PAY TO FIND OUT WHAT'S WRONG WITH THE CAR, PAY FOR THE CAR TO GET REPAIRED, I DON'T KNOW IF IT'S A LOSS SINCE THE LAST THING I REMEMBER WAS READING 'TRANSMISSION FAULT' ON MY DASHBOARD WHERE THE ODOMETER IS AT.",
        "vin": "SAJDA14C1YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/10/2011",
        "dateOfIncident": "07/15/2011",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418468,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE FILED THIS COMPLIANT A COUPLE OF WEEKS AGO, BUT IT DOESN'T APPEAR IN THE SEARCH, SO I'M FILING IT AGAIN. I BELIEVE JAGUAR HAS A SERIOUS PROBLEM THAT SHOULD BE ADDRESSED BY A MANDATORY RECALL. MY 2000 XJ8 HAS BEEN HAVING SURGING PROBLEMS FOR YEARS AND HAS GONE INTO LIMP MODE ON NUMEROUS OCCASIONS...USUALLY ON THE INTERSTATE...WHERE I HAVE NARROWLY MISSED CAUSING SERIOUS ACCIDENTS. THE LOCAL JAGUAR DEALER HAD THE CAR TWICE, EACH TIME FOR APPROXIMATELY ONE YEAR. EACH TIME THEY SAID IT NEEDED A THROTTLE BODY. AFTER THE THIRD THROTTLE BODY, I CALLED JAGUAR IN NEW JERSEY AND THEY CONTACTED THE DEALERSHIP AND WALKED THEM THROUGH BENCH TESTING THE THROTTLE BODY OFF THE CAR. TURNS OUT THERE WAS NEVER A THROTTLE BODY PROBLEM. SO AFTER THREE THROTTLE BODIES, THE REPLACEMENTS AT $2400 EACH, THE JAGUAR DEALER SAID THEY COULDN'T FIX THE CAR. I THEN SENT IT TO FOUR OTHER MECHANIC SHOPS. MOST HAD IT FOR AT LEAST SIX MONTHS. EACH ADMITTED THE PROBLEM EXISTED, BUT NONE COULD FIX IT. THE ECM AND TCMS WERE CHANGED, SPARK PLUG WIRES, SPARK PLUGS, AC COMPONENT, ALL GROUNDS CHECKED, HARNESS CHECKED, ETC., ETC., ETC. KEEP IN MIND THE CAR ONLY HAS 37000 MILES. FINALLY, WHILE ANOTHER MECHANIC WAS TRYING TO FIND THE PROBLEM, THE ENGINE LOCKED. THE CAR WAS TOWED TO ANOTHER MECHANIC, WHO OPENED THE ENGINE AND FOUND THE TIMING CHAIN TENSIONERS HAD ALLOWED THE CHAIN TO JUMP TWO TEETH. APPARENTLY, THE TENSIONER PROBLEM IS WELL KNOW TO JAGUAR AND ITS DEALERSHIPS. EVEN TECH BULLETINS HAVE BEEN SENT, BUT OWNERS WERE NEVER NOTIFIED OF THE PROBLEM DIRECTLY. NOW THAT I HAVE SEARCHED THE FORUMS, IT IS APPARENT THE PROBLEM IS PREVALENT. I'M LUCKY I WAS NOT KILLED IN THE CAR. I NOW HAVE TO INSTALL A NEW ENGINE DUE TO THIS KNOWN PROBLEM. MAYBE IF ENOUGH PEOPLE ARE KILLED OR MAIMED, WE WILL FINALLY SEE SOME ACTION TO FORCE JAGUAR TO FIX THEIR OBVIOUS DESIGN PROBLEM RESULTING FROM THEIR EFFORT TO INCREASE THEIR PROFITS. *TR",
        "vin": "SAJDA14C9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365875,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 JAGUAR XJ8 PLASTIC TIMING CHAIN TENSIONER BROKE. *TR",
        "vin": "SAJDA14C6YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "01/16/2010",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317111,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWN A 2000 JAGUAR XJ. THE CONTACT STATED THAT THE DRIVER ATTEMPTED TO START THE VEHICLE THAT WAS PARKED IN HIS GARAGE. THE VEHICLE WOULD NOT START. THE CONTACT STATED THAT THE DRIVER AND PASSENGER SMELLED  A SLIGHT BURNING ODOR AFTER TRYING TO START THE VEHICLE. THE VEHICLE WAS TOWED TO A  PERSONAL MECHANIC ON JANUARY 20, 2010. THE MECHANIC STATED THAT THE TIMING CHAIN GUIDES/TENSIONERS FAILED. THE MECHANIC TOOK PICTURES OF THE TIMING CHAIN.  THE CONTACT STATED THAT THE VEHICLE WAS STILL AT THE MECHANIC AT THE TIME OF THE COMPLAINT  THE APPROXIMATE FAILURE AND CURRENT MILEAGES WAS 93,000.   UPDATED 4/30/10 *CN  THE TIMING CHAIN GUIDES WHICH WAS MADE OF CHEAP PLASTIC CAUSED THE TIMING CHAIN TO BREAK AND JAM INTO THE GEAR AND PISTONS AND THEN DAMAGED THE VALVES.  UPDATED 08/18/10",
        "vin": "SAJDA23C5YL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "06/10/2009",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310594,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR IS:JAGUAR YEAR 2000 XJR  4.0L, W/SUPERCHARGER WITH. I WAS DRIVING ON THE PENNSYLVANIA TURNPIKE AT THE SPEED LIMIT WHEN SUDDENLY THE ENGINE STARTED RUNNING AT SLOW  IDLE SPEED. THE ENGINE SPEED WOULD NOT RESPOND TO THE POSITION OF THE ACCELERATOR PEDAL. I WAS TOLD LATER BY PROGRESSIVE AUTO REPAIR IN HAMILTON VA THAT THE PROBLEM WAS THAT THE ACCELERATOR PEDAL POSITION SENSOR HAD FAILED AND HAD TO BE REPLACED.  I WAS TOLD THAT THIS WAS ATTACHED TO THE THROTTLE BODY ASSEMBLY AND COULD NOT BE BOUGHT SEPARATELY FROM THE THROTTLE BODY ASSEMBLY.  I BOUGHT A NEW THROTTLE BODY ASSEMBLY BUT STILL HAVE THE REPLACED ASSEMBLY INCLUDING THE FAILED ACCELERATOR PEDAL POSITION SENSOR.  I REMEMBER SEARCHING THE INTERNET ABOUT THIS SENSOR AND AM ALMOST SURE THAT THIS JAG ACCELERATOR PEDAL POSITION SENSOR IS MADE BY THE SAME MANUFACTURER THAT MAKES THIS SENSOR FOR TOYOTA. I AM SUBMITTING THIS COMPLAINT BECAUSE I WONDER IF THE SENSOR COULD FAIL AND  CAUSE THE ENGINE TO GO TO MAXIMUM ACCELERATION AND, IF SO, COULD THIS BE THE SOURCE OF THE TOYOTA ACCELERATION PROBLEMS? IF THIS ACCELERATOR POSITION SENSOR IS IN FACT MADE BY THE SAME MANUFACTURER, THEN COULD THIS PROBLEM BE LURKING IN OTHER BRANDS OF CARS SUCH AS JAGUARS? *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/11/2009",
        "dateOfIncident": "12/15/2008",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258327,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNED A 2000 JAGUAR XJ8.  THE CONTACT STATED THAT HE FREQUENTLY EXPERIENCED UNWARRANTED VEHICLE ACCELERATION.  WHEN THE FAILURE OCCURS, THE RPM'S INCREASE TO 4,000-6,000.  THE RISK OF A SERIOUS CRASH WAS SIGNIFICANTLY INCREASED.  THE DEALER COULD NOT DUPLICATE THE FAILURE OR PRODUCE ANY ERROR CODES TO PROVIDE A SUFFICIENT REMEDY.  HE TOOK THE VEHICLE TO AN INDEPENDENT REPAIR SHOP AND THE MECHANIC LOCATED AN EVAPORATED SYSTEM FAULT ERROR CODE; HOWEVER, NO REPAIRS WERE MADE.  THE MANUFACTURER WOULD NOT ASSIST.  THE FAILURE AND CURRENT MILEAGES WERE 92,500.  UPDATED 03/23/09. *LJ  THE CONSUMER TRADED THE VEHICLE IN. UPDATED 03/24/09. *JB",
        "vin": "SAJDA14C1YL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/07/2007",
        "dateOfIncident": "03/08/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198722,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "UNSAFE CONDITION:  1.  IN EARLY SPRING I APPROACHED A PEDESTRIAN CROSSING AND APPLIED BRAKE.  2.  WHEN I WAS STOPPED WITH MY AUTO IN GEAR AND MY FOOT ON THE BRAKE THE ENGINE BEGAN RACING, THE CAR TRIED TO DRIVE FORWARD INTO THE CROSSWALK AND THE BACK END STARTED FISH TAILING.  3.  I TOOK THE CAR TO THE DEALER BUT THEY WERE UNABLE TO FIND THE CAUSE.  *JB",
        "vin": "SAJDA14C1YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178632,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 JAGUAR XJ8 'S INSTRUMENT PACK FAILED WHILE DRIVING 70 MPH (SPEED LIMIT) IN HEAVY INTERSTATE TRAFFIC.  RESULTING IN LOSS OFF ALL INSTRUMENTATION, INCLUDING SPEEDOMETER, ALL INSIDE LIGHTING AND LOSS OF AIR CONDITIONING AND DEFROSTING CAPABILITIES.    MY CAR IS NOW SITTING AT A NASHVILLE TENNESSEE JAGUAR DEALERSHIP FOR AN INDEFINITE PERIOD OF TIME ,DUE TO THE INABILITY OF THE JAGUAR CORPORATION TO SUPPLY THE NEEDED NEW PART, DUE TO HIGH DEMAND FOR THE 2000 XJ8 INSTRUMENT PACK.    AFTER MUCH RESEARCH THROUGH THE INTER NET , TALKING WITH OTHER 2000 XJ8 JAGUAR OWNERS AND JAGUAR TECHNICIANS AND FORMER JAGUAR TECHNICIANS IT IS CLEARLY EVIDENT THAT THIS MODEL JAGUAR HAS 2 SIGNIFICANT DEFECTS!  FAULTY INSTRUMENT PACK AND FAULTY TIMING BELT/CHAIN!  MY INSTRUMENT PACK FAILED AT APPROX 68,000 MILES AND MY TIMING CHAIN FAILED IN FEB. 2006 AT APPROX 64,000 MILES.  BOTH FAILURES COULD HAVE RESULTED IN SIGNIFICANT DAMAGE TO THE VEHICLE OR ITS OCCUPANTS.  HOWEVER IN MY CASE THESE FAILURES DID NOT RESULT IN ANY PERSONAL INJURIES.  *JB",
        "vin": "SAJDA14C9YL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2006",
        "dateOfIncident": "07/27/2006",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165475,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO EVENTS LEADING UP TO FAILURE. NO WARNING LIGHTS OR PRIOR INDICATION OF ANY PROBLEM. CAR SHUT DOWN AT INTERSTATE SPEED WITH NO WARNING.  HAD TO GET OVER 2 LANES OF TRAFFIC AND OUT OF HARMS WAY AND PULL OFF OF INTERSTATE. VERY DANGEROUS TIME.  REPLACED BODY THROTTLE AND CHARGED ME $1,563.17 + LABOR. OLD PART IS AVAILABLE. I WAS VERY SHAKEN UP AFTER THIS INCIDENT AND VERY CONCERNED THAT YOU COULD JUST BE DRIVING DOWN THE INTERSTATE AND WITH NO WARNING AT ALL YOUR CAR WOULD JUST SHUT DOWN.  THIS IS EXTREMELY DANGEROUS.  I HAD THIS HAPPEN ON ANOTHER JAGUAR BACK IN THE LATE 1990'S AND IT WAS A RECALLED PART BELIEVED TO BE THE SAME PROBLEM STILL EXISTING ON THIS CAR.  AT THAT TIME THE DEALER SAID IT WAS A RECALL AND REPLACED IT BUT SAME THING ON THIS NEWER MODEL AND NO RECALL.  IT SEEMS TO BE THE SAME PROBLEM   AND I FEEL IT SHOULD ALSO BE RECALLED.   THANK YOU,      *NM  *TR",
        "vin": "SAJDA15B3YM"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "08/18/2005",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141897,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATES  2000, JAGUAR XJR WAS EXPERIENCING A LOSS OF POWER. THE VEHICLE HAS UNDERGONE DIAGNOSTIC TESTING. THE SERVICE DEALER COULD  NOT DUPLICATE THE PROBLEM. THE VEHICLE STARTED OUT WITH INTERMITTENT POWER DIFFICULTIES, BUT IT BECAME TOO FREQUENT. THE VEHICLE JERKED SOMETIMES ON INITIAL ACCELERATION FROM A COMPLETE STOP AND AUTOMATICALLY CHANGED GEARS.  THERE HAVE BEEN SEVERAL NEAR MISSES ON THE INTERSTATE AS A RESULT OF NOT BEING ABLE TO ACCELERATE QUICKLY. *AK  UPDATED 3/17/2006 - *NM",
        "vin": "SAJDA15B7YM"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "07/03/2005",
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129212,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "COLLISION WITH OTHER AUTO, FRONT DAMAGE, BUMPER TOTALLED WITH FRAME DAMAGE, HOOD AND FENDER AND AIR BAGS DID NOT DEPLOY, JAGUAR HAS AND WILL NOT INSPECT AUTO AT BODY SHOP, ADJUSTER {FROM INSURANCE COMPANY} AND BODY SHOP BOTH SAID THE AIR BAGS SHOULD HAVE DEPLOYED, I THINK IF THERE IS A PROBLEM IT SHOULD BE RESOLVED BEFORE ANYONE IS HURT, FORTUNALLY IN THIS CASE THERE WEREN'T ANY INJURIES",
        "vin": "SAJDA14C0YL"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/27/2004",
        "dateOfIncident": "04/07/2004",
        "fire": true,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067909,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SUN ROOF MOTOR CAUGHT ON FIRE AND CAUSED THE CAR TO CATCH ON FIRE.  *AK",
        "vin": "SAJDA23C2YL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/26/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Jaguar Cars, Ltd.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884196,
        "products": [
            {
                "manufacturer": "Jaguar Cars, Ltd.",
                "productMake": "JAGUAR",
                "productModel": "XJ",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT BELT DOES NOT RELEASE FROM  RETRACTING MECHANISM.  PLEASE GIVE ANY FURTHER DETAILS.*AK",
        "vin": ""
    }
]