[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/03/2003",
        "dateOfIncident": "07/18/2003",
        "fire": false,
        "manufacturer": "Lazy Daze, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030700,
        "products": [
            {
                "manufacturer": "Lazy Daze, Inc.",
                "productMake": "LAZY DAZE",
                "productModel": "LAZY DAZE",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "STEELTEX R4S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE RIGHT REAR INSIDE TIRE ON A YEAR 2000 LAZY DAZE MOTORHOME (BUILT ON A FORD E-450 CHASSIS, DUAL REAR TIRES) BLEWOUT WHILE TRAVELING AT 60 MPH OUTSIDE OF SHERITAN, WY ON JULY 18TH, 2003.  THE TIRE WAS A FIRESTONE STEELTEX RADIAL R4S, SIZE LT225/75R16, LOAD RANGE E, DOT VD1L1XD329.  THIS TIRE WAS THE ORIGINAL EQUIPMENT ON THE RV AND HAD APPROXIMATELY 19,000 MILES ON IT.  THE TIRE WAS INFLATED TO 75 PSI BASED ON A REAR AXLE LOAD OF 8620 LBS TOTAL (OR 2155 LBS PER TIRE).  THE WHOLE TREAD SEPARATED COMPLETELY FROM THE TIRE AND THE CASING WAS TORN OPEN.  IT WAS A VERY EXPLOSIVE FAILURE, KNOCKING A HOLE IN THE FRONT OF THE STEEL LINED WHEEL WELL, PENETRATING THE INSIDE OF THE RV, AND SHOWERING TIRE PARTS ALL THE WAY TO THE FRONT OF THE CAB BY THE DRIVER AND PASSENGER.*AK",
        "vin": "1FDXE45S1YH"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/31/2003",
        "dateOfIncident": "03/26/2003",
        "fire": false,
        "manufacturer": "Lazy Daze, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013705,
        "products": [
            {
                "manufacturer": "Lazy Daze, Inc.",
                "productMake": "LAZY DAZE",
                "productModel": "LAZY DAZE",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "LT22575R16E",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON MARCH 26, 2003 MY WIFE, OUR 2 GRAND CHILDREN & I WERE TRAVELING EAST ON HIGHWAY. 15. WE WERE TAKING OUR GRANDKIDS BACK TO THEIR HOME IN LAS VEGAS.   WE HAD A BLOW OUT ON THE RIGHT REAR INSIDE DUAL GOING ABOUT 60 MPH. THE BLOWOUT HAPPENED ABOUT EST 40 MILES FROM HOME.  WE CALLED GOOD SAM RV SERVICE TO CHANGE THE TIRE AND PUT ON THE SPARE. WHEN WE GOT TO VICTORVILLE WE HAD TO GET  ANOTHER SPARE SO WE FOUND AN AMERICAN TIRE STORE AND PURCHASED A NEW TIRE.  WE THEN WENT ON OUR WAY & ABOUT 20 MILES WEST OF BAKER CALIFORNIA. IN THE MIDDLE OF THE DESERT WE HAD ANOTHER BLOW OUT ON THE LEFT REAR OUT SIDE DUAL. AGAIN WE CALLED GOOD SAM RV SERVICE TO CHANGE THE TIRE. NEEDLESS TO SAY MY 3 YEAR OLD GRANDDAUGHTER WAS VERY UPSET AND WE HAD  TO CALM HER DOWN AFTER EACH BLOWOUT. THESE BLOWOUTS REALLY UPSET US AND THE GRANDKIDS DIDN'T WANT TO GET BACK INTO THE MOTORHOME -  THEY WERE VERY SCARED.  THE BOWOUTS CAUSED SOME DAMAGE TO OUR NEW MOTORHOME.  OUR MOTOR HOME IS A 2000 LAZY DAZE 30 FT. CLASS \"C\"  EST. MILEAGE ON THE MOTOR HOME ON THE FIRST BLOWOUT WAS ABOUT 8316 MILES.  ON THE SECOND BLOWOUT THE EST. MILEAGE WAS 8410 MILES.  THE TIRES THAT CAME ON THE MOTORHOME ARE FIRESTONE STEEL EX RADIAL 225 / 75 / 16 - LOAD RANGE \"E\" DOT # VDIL 1XD  THE AMERICAN TIRE STORE IN VICTORVILLE KEPT THE FIRST TIRE, BUT WE KEPT THE SECOND BLOWOUT.  WE HAVE BOTH RECEIPTS FROM THE TIRES WE PURCHASED.  THE DAMAGE TO OUR MOTORHOME IS 1 RIGHT SIDE CLEARANCE LIGHT (AMBER),  BENT EXHAUST PIPE AND BRACKETS.  IT PUT A HOLE IN THE COMPARTMENT BEHIND THE TIRE THAT BLEW.  1 LEFT SIDE FENDER SKIRT  WAS DAMAGED AND ALSO THE LEFT SIDE GENERATOR COMPARTMENT DOOR IN FRONT OF THE TIRE THAT BLEW.   THIS DAMAGE IS ALL I CAN FIND AT THIS TIME.   WE WOULD LIKE TO HAVE ALL OF THE EXISTING FIRESTONE TIRES REPLACED SO THAT WE CAN TRAVEL WITH CONFIDENCE AND SAFETY.            *NLM",
        "vin": "4AGCU18D4VC"
    }
]