[
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2017",
        "dateOfIncident": "12/06/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11055840,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM DISABLED BY MY OWN FACTORY ALARM.  THE CAR WILL NOT START BECAUSE MY ECU WAS DEFECTIVE AND I REPLACED IT WITH A USED ONE AND TOOK IT TO THE DEALER TO PROGRAM MY KEY TO THE REPLACEMENT ECU AND THE KEY STILL DOESN'T WORK EVEN THOUGH I AM GETTING A P1610 TROUBLE CODE FOR IMMOBILIZER MALFUNCTION WHICH IS DUE TO AN ECU NOT RECOGNIZING THE KEY.  EVEN THE DEALOR CAN'T GET THE CAR TO START.  THE MANUFACTURER GOT THE IMMOBILIZER SYSTEM TOO ADVANCED THAT IT'S LOCKING THEIR CAR OWNER'S OUT OF THEIR OWN CAR!  THIS IS UNACCEPTABLE.",
        "vin": "4A3AA46G1YE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "11/25/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10720996,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2000 MITSUBISHI GALANT. WHILE DRIVING 25 MPH, ANOTHER VEHICLE EQUIPPED WITH A CRASH BAR CRASHED HEAD ON INTO THE CONTACT'S VEHICLE AT 50 MPH. THE CONTACT'S AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED NECK INQUIRES AND A HERNIATED DISK DISPLACER. MEDICAL ATTENTION WAS RECEIVED. A POLICE REPORT WAS FILED, BUT WAS NOT REPORTED ACCURATELY. THE VEHICLE WAS DESTROYED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "10/07/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643335,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 MITSUBISHI GALANT. WHILE DRIVING APPROXIMATELY 50 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE FAILED TO RESTART AND WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 230,000.",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2013",
        "dateOfIncident": "01/09/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505666,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 MITSUBISHI GALANT. THE CONTACT STATED THAT THE TEMPERATURE GAUGE NEEDLE WOULD FLUCTUATE CONTINUOUSLY. THE FAILURE RECURRED WHENEVER THE VEHICLE WAS IN OPERATION. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSIS, WHO STATED THAT THE FAILURE WAS RELATED TO THE RADIATOR, WHICH WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 86,700.",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/2010",
        "dateOfIncident": "08/27/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360761,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 MITSUBISHI GALANT.  FOR THE LAST TWO MONTHS, I HAVE BEEN IN AND OUT OF THE REPAIR SHOP.  I AM NOT A MECHANIC; HOWEVER, I KNOW THAT THERE IS A PROBLEM IN THE ELECTRICAL SYSTEM.  WHILE DRIVING, THE CAR WILL JUST STOP IN THE MIDDLE OF THE ROAD.  WHEN IT OCCURS, IT WILL NOT START AND HAS TO  BE TOWED IN. THE FIRST TWO TIMES, THE MECHANIC REPLACED THE BLOWN FUSE.  THE LAST TIME, THE IGNITION SWITCH WAS REPLACED BECAUSE THE DEALER SAID THAT IT WAS BAD.   I THOUGHT THAT WAS THE END UNTIL LAST NIGHT.  THE SAME THING HAS HAPPENED AGAIN.  I AM BECOMING FRUSTRATED OVER THIS MATTER.  THEY NEED TO FIND THE PROBLEM AND FIX IT.  OTHER THAN THIS, I HAVE NOT HAD MAJOR PROBLEMS WITH THE CAR.  HOWEVER, THIS SITUATION CONCERNS ME BECAUSE OF THE NATURE OF IT.  THIS PROBLEM HAS MADE ME CHANGE MY MIND REGARDING MITSUBISHI CARS.  I DON'T THINK I WILL BUY ANOTHER ONE.  I AM TIRED OF THEM GIVING ME THE \"RUN-AROUND\". *TR",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351906,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 MITSUBISHI GALANT. THE CONTACT WAS TRAVELING 55 MPH WHEN THE VEHICLE STALLED WITH THE ILLUMINATION OF THE ENTIRE DASHBOARD. THE VEHICLE WAS INSPECTED BY THE CONTACTS PERSONAL MECHANIC WHO ADVISED THAT THE BATTERY CABLE WIRING HARNESS FAILED AND CAUSED THE VEHICLE TO STALL. THE CONTACT LOCATED NHTSA CAMPAIGN ID NUMBER: 99V333001 (ELECTRICAL SYSTEM: BATTERY: CABLES) BUT WAS ADVISED BY THE MANUFACTURER THAT HIS VIN WAS NOT INCLUDED. IN ADDITION, THE MANUFACTURER ADVISED THAT THE PART NEEDED FOR REPAIRS WOULD ONLY BE MADE AVAILABLE TO THOSE VEHICLES THAT FELL WITHIN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 134,000.",
        "vin": "4A3AA46L2XE"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/27/2010",
        "dateOfIncident": "07/20/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345582,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MATCHING RECALL MITSUBISHI NOTICE SR-99-003 AND NHTSA 99V305001, OUR GALANT HAS THE BUSTED TURN SIGNAL PROBLEM. MITSUBISHI CLAIMS OUR VIN IS OUTSIDE THE RANGE OF DEFECTIVE UNITS. OBVIOUSLY, THAT'S NOT THE CASE, BUT THEY'RE NOT PAYING. *TR",
        "vin": "4A3AA46GXYE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/02/2010",
        "dateOfIncident": "06/25/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341082,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT. THE CONTACT STATED THAT ON JUNE 25, 2010, THE THROTTLE BECAME STUCK CAUSING HIM TO CRASH INTO A FUEL PUMP AT A GASOLINE STATION. THERE WERE NO INJURIES. A POLICE REPORT WAS FILED. THE VEHICLE WAS DAMAGED BUT NOT DESTROYED. THE CONTACT STATED, THAT WAS THE FIRST TIME HE EXPERIENCED THAT TYPE OF FAILURE. THE CONTACT HAD NOT CALLED THE DEALER OR THE MANUFACTURER WHEN THE COMPLAINT WAS FILED. THE CURRENT MILEAGE WAS 110,906. THE FAILURE MILEAGE WAS APPROXIMATELY 110,000.",
        "vin": "4A3AA46L9YE"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/16/2009",
        "dateOfIncident": "06/10/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284205,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT. THE CONTACT OBSERVED THAT THE ENTIRE VEHICLE EXTERIOR BODY EXHIBITED SEVERE RUST SPOTS. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR INSPECTION; HOWEVER, THE TECHNICIAN WAS UNABLE TO ASSIST WITH REPAIRING THE RUST. THE DASHBOARD ALSO EXHIBITED EXTENSIVE CRACKING AND WARPS WHICH COVERED THE ENTIRE LENGTH OF THE VEHICLE WHICH WAS CAUSED BY THE DEFROSTER UNIT. THE FRONT PASSENGER AXLE WAS TAKEN TO AN  AUTHORIZED DEALER ON A SEPARATE OCCASION AND REPAIRED. THE CONTACT HAD CONCERNS OF THE SAFETY RISK INVOLVED. THE FAILURE MILEAGE WAS 37,000 AND THE CURRENT MILEAGE WAS 79,800.",
        "vin": "4A3AA46G0YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/10/2009",
        "dateOfIncident": "05/19/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283594,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "YES I HAVE HAD A NUMBER OF PROBLEMS WITH MY GALANT YEAR 2000 DASH BOARD HAS CRACK IN THE COLD! THE PAINT(BLACK) HAS TURN FROM A BLACK TO NOW A RUST COLOR LIKE IT HADN'T HAD A COAT OF PRIMER PUT ON BEFORE PAINTING IT! BALL JOINT SNAP WHEEL FELL OFF COST 4300.00 TO FIX NOW IT NEEDS A PAINT JOB WASHING AND DETAILING ISN'T GOING TO FAZE IT   HAS BEEN TAKEN GOOD CARE OF BUT IM REALLY UPSET OVER THE RUST THIS IS JUST TOO MUCH FOR ME TO CONSIDER! PLEASSE RESPOND AND HELP IM DISABLE AND THIS IS MY ONLY CAR! IM READY TO CALL ACTION 2 NEWS IM AT MY WITS END! THANK YOU *TR",
        "vin": "4A3AA46G0YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2009",
        "dateOfIncident": "08/12/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280206,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL OF THE PAINT ON MY BLACK 2000 MITSUBISHI GALANT IS COMING OFF. THIS CAR WAS GARAGE KEPT MOST OF IT'S LIFE. *TR",
        "vin": "4A3AA46G6YE"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/22/2009",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277705,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT.  THE CONTACT STATED THAT THE TURN SIGNAL SWITCH DETACHED FROM THE VEHICLE WHEN HE ATTEMPTED TO ACTIVATE THE SIGNAL.  IN ADDITION, THE WINDSHIELD WIPERS WORK INTERMITTENTLY.  THE DEALER STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBERS 99V305001, MITSUBISHI RECALL NUMBER SR-99-003 (EXTERIOR LIGHTING:TURN SIGNAL:SWITCH) AND 99V305001 (VISIBILITY:WINDSHIELD WIPER/WASHER:SWITCH/WIRING).  THE FAILURE MILEAGE WAS 107,000.",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "06/16/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261313,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS BLACK AND THE PAINT IS STARTING TO GET LITTLE WHITE DOTS IN BIG AREAS! I ASKED THE MITSUBISHI DEALERSHIP ABOUT THE PROBLEM WITH THE PAINT AND THEY TOLD ME IT IS WITH ALL THE BLACK 2000 MITSUBISHI GALANTS! AS I SEE IT , IT SHOULD HAVE BEEN TAKEN CARE BY MITSUBISHI! I DON'T FEEL LIKE IT MAKES THE COMPANY LOOK VERY GOOD WHEN I SEE ALL THESE BLACK GALANT'S THAT LOOK WORSE THAN MINE! IF IT IS NOT TAKEN CARE OF OTHER PEOPLE WILL KNOW WHAT KIND OF PRODUCTS MITSUBISHI SELLS AND WON'T BUY ONE! I PERSONALLY WILL NOT UNLESS THIS IS HANDLED! *TR",
        "vin": "4A3AA46G5YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "10/01/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258874,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY PURCHASED USED 200 MITSUBISHI GALANT.  HAVING ISSUES WITH THE OIL LIGHT CONSTANTLY COMING ON AND THE CAR SHUTTING OFF.  IT ALSO SEEMS AS THOUGH THE VEHICLE LOOSES POWER AND NONE OF THE SIGNAL LIGHTS OR HAZARD LIGHTS WILL WORK. THIS HAS BEEN GOING ON SINCE PURCHASING THE VEHICLE IN OCTOBER 2008.  THE DEALER WHERE PURCHASED IS NOT BEING VERY COOPERATIVE.  ONCE OFF ITS TAKES SEVERAL TRIES FOR THE CAR TO START AGAIN.  YOUR WEBSITE INDICATED THAT SEVERAL OF THESE MODELS WERE RECALLED.  IT LOOKS AS THOUGH THIS VEHICLE WAS NEVER REPAIRED.  *TR",
        "vin": "4A3AA46G8YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/19/2008",
        "dateOfIncident": "11/19/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249312,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PURCHASED A BRAND NEW 2000 MITS. GALANT (BLACK) WHICH WAS A SPECIAL EDITION FROM THE LOCAL DEALER FOR MITSBUSHI AND WAS IN THE SHOWROOM.  WITHIN 1 1/2 OF HAVING THIS VEHICLE, THE PAINT ON THE ROOF AROUND THE SUNROOF HAD FADED.  GRADUALLY THROUGHOUT THE YEARS THE ROOF, FRONT HOOD AND REAR TRUCK IS COMPLETELY FADED AND THERE IS NO MORE COLOR ON THE CAR.  IT IS COMPLETELY FADED DOWN TO THE ALUMINUM.  I COMPLAINED TO THE CORPORATE OFFICE AS WELL AS MY LOCAL DEALER AND HAD PICS TAKEN OF MY CAR AND SENT IN TO THE CORPORATE OFFICE.  THEY DENIED MY CLAIM TO OFFER A GOODWILL PAINT JOB.  THEY HAD ALSO MENTIONED IT WAS A FACTORY DEFECT IN THE CLEAR COAT ON THE MODELS FROM 1999 TO 2004.  IF THIS WAS A DEFECT WHY DIDN'T THE CORPORATE COMPANY SEND OUT RECALLS AND ISSUE FREE PAINT WORK TO THESE DAMAGED VEHICLES.  THEY SAID MY VEHICLE WAS AT 108,000 MILES AND IT WAS 8 YEARS OLD AND TOO OLD TO QUALIFY FOR THIS PAINT JOB.  THIS IS RIDICULOUS.  MY CAR RUNS AWESOME OTHER THAN THE HORRIBLE PAINT JOB ON IT DUE TO MITSUBISHI'S BLACK CLEAR COAT PAINT IN WHICH THEY WERE USING ON A TRIAL BASIS CAUSE IT WAS A NEW COAT NEVER USED BEFORE AND DAMAGED HUNDREDS AND THOUSANDS OF VEHICLES ACROSS THE UNITED STATES!! THIS IS A DISGRACE AND MITSUBISHI SHOULD SHUT DOWN ITS OFFICES.  I URGE EVERYONE WHO READS THIS TO NEVER PURCHASE A MITS CAR EVER! *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2008",
        "dateOfIncident": "10/30/2008",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247373,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2000 MITSUBISHI GALANT BRAND NEW IN JUNE, 2000. ABOUT 18 MONTHS LATER, MY CAR WOULD IMMEDIATELY STOP RUNNING. ALL SYSTEMS WOULD DIE. MY MITSUBISHI DEALERSHIP ATTEMPTED DIFFERENT FIXES ON MANY OCCASIONS, ONLY TO HAVE THE PROBLEM OCCUR AGAIN. FINALLY, MY CAR WAS SENT TO A MASTER MECHANIC AT ANOTHER DEALERSHIP WHO DIAGNOSED THE PROBLEM AS SOMETHING TO DO WITH AN ELECTRICAL REGULATOR OR SWITCH. TO MY RECOLLECTION, THE SWITCH COULD ONLY CARRY A 10 AMP LOAD, AND WAS GETTING SHORTED OUT BECAUSE IT NEEDED MORE CAPACITY. THE PREVIOUS WORK AT THE OTHER DEALERSHIP DID NOT FIX THE PROBLEM, ALTHOUGH THE RESETTING OF THE SYSTEM MADE THE CAR ABLE TO FUNCTION AGAIN UNTIL ANOTHER OCCURRENCE. THE MASTER MECHANIC AT THE DEALERSHIP INSTALLED A 50 AMP SWITCH AND MENTIONED THAT IT WAS WAY MORE THAN I WOULD EVER NEED IN THIS CAR. MY CAR HAS OPERATED FOR OVER 4 YEARS WITHOUT INCIDENT. YESTERDAY, A SMALL FIRE STARTED ON THE PIECE THAT I BELIEVE MAY HAVE BEEN PART OF THE FIX. WHILE I'M UNSURE HOW RELATED THESE INCIDENTS ARE, I AM CONCERNED ABOUT OTHER GALANTS ON THE ROAD. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/25/2008",
        "dateOfIncident": "07/27/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243425,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT.  WHENEVER THE VEHICLE BEGINS TO GET HOT, THE AIR CONDITIONER BEGINS TO BLOW HOT AIR.  THE CONTACT ALSO NOTICED THAT THE LOW OIL LIGHT WOULD OCCASIONALLY ILLUMINATE ON THE INSTRUMENT PANEL.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE CURRENT MILEAGE WAS 233,000 AND FAILURE MILEAGE WAS 226,000.",
        "vin": "4A3AA46G4YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/03/2008",
        "dateOfIncident": "08/20/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240743,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD TO REPLACE TWO INTAKE MANIFOLDS IN 42 MONTHS  ON MY 2000 MITSUBISHI GALANT.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/24/2008",
        "dateOfIncident": "06/23/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232125,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT.  WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT DISCOVERED THAT THE PLASTIC PIECE IN THE TURN SIGNAL LEVER SNAPPED INSIDE.  CURRENTLY, THE HEADLIGHTS, TURN SIGNALS, AND HIGH BEAMS DO NOT WORK.  THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 99V305001 (VISIBILITY:WINDSHIELD WIPER/WASHER:SWITCH/WIRING).  THE CURRENT AND FAILURE MILEAGES WERE 144,000.",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/11/2008",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230567,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 MITSUBISHI GALANT MANUFACTURED IN OCTOBER 1999. THE WINDSHIELD WIPER SWITCH LEVER BROKE AND IS STUCK IN THE \"SQUIRT WIPER FLUID\" POSITION. I HAVE ALSO HAD THE TURN SIGNAL SWITCH LEVER BREAK LESS THAN A YEAR AGO AND PAID TO HAVE IT REPLACED.    BOTH OF THESE ARE LISTED AS DEFECTS UNDER NHTSA RECALL 99V305001, BUT THERE ARE NO RECALLS LISTED. BOTH LEVERS HAVING BROKEN SEEMS TO INDICATE MY LEVERS WERE DEFECTIVE AND SHOULD HAVE BEEN UNDER THE RECALL. I HAVE CONTACTED BOTH THE DEALERS SERVICE CENTER AND MITSUBISHI'S CUSTOMER SERVICE, BUT THEY BOTH TOLD ME THERE IS NOTHING THEY CAN DO FOR ME. IF OTHER CARS IN THE SAME PRODUCTION RUN AS MINE ARE AFFECTED, THEY COULD BE UNKNOWINGLY SUBJECT TO THE SAFETY RISKS LISTED IN THE RECALL.  *TR",
        "vin": "4A3AA46G4YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/05/2008",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230010,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DEFECT IN THE PAINT ON MY 2000 MITSUBISHI GALANT. AS FIRST I THOUGHT THERE WAS SOMETHING I WAS DOING WRONG, UNTIL I FOUND THE NUMEROUS CONSUMERS WITH THE SAME PROBLEM. I'M NOT SURE HOW MITSUBISHI HAS AVOIDED A RECALL BUT THIS IS A MANUFACTURER DEFECT AND SHOULD BE COMPLETELY CORRECTED BY THE COMPANY. THE PAINT ON THE HOOD OF MY CAR STARTED TO BECOME ROUGH, THEN OVER THE PERIOD OF A FEW MONTHS BEGAN TO COME OFF. FIRST THE CLEAR COAT, THEN THE PAINT, SO NOW ITS DOWN TO THE METAL IN SOME AREAS. NEXT IT WILL RUST, AND I AM NOT TO BLAME. I SHOULD NOT HAVE TO PAINT THE WHOLE CAR OUT OF POCKET IN ORDER TO PROTECT MY INVESTMENT.   *TR",
        "vin": "4A3AA46L4YE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/15/2008",
        "dateOfIncident": "01/05/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214949,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT.  WHILE DRIVING APPROXIMATELY 35 MPH, THE HEADLIGHTS ILLUMINATED WITHOUT WARNING AND WOULD NOT DIM.  THE CONTACT STATED THAT HER TURN SIGNALS WERE ALSO INOPERATIVE.  WHEN THE VEHICLE WAS TURNED OFF, THE LIGHTS REMAINED ILLUMINATED.  THE DEALER STATED THAT HER VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 99V305001 (EXTERIOR LIGHTING:HEADLIGHTS:SWITCH) AND (EXTERIOR LIGHTING:TURN SIGNAL:SWITCH).  THE CONTACT WOULD HAVE TO REPAIR THE VEHICLE AT HER OWN EXPENSE.  THE DEALER WILL INSTALL A REDESIGNED SWITCH.  SHE IS WAITING TO HEAR BACK FROM THE DEALER.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 146,000.",
        "vin": "4A3AA46G4YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/28/2007",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210211,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGINNING JUST A FEW YEARS AFTER PURCHASING MY 2000 GALANT BRAND NEW, THE PAINT STARTED EATING ITSELF AWAY (OXIDIZING).  THERE ARE HUGE BLOTCHES COVERING THE ROOF AND REAR OF THE CAR.  IT HAS CONTINUALLY GOTTEN WORSE.  NO ONE WILL HELP ME AT MITSIBUSHI.  JUST A FEW MONTHS AFTER ORIGINALLY PURCHASING THE VEHICLE, I HIT A DEER AND HAD THE HOOD AND DRIVER'S SIDE REPLACED.  THERE IS ABSOLUTELY NO PROBLEM WITH THE REPLACED PARTS.  *TR",
        "vin": "4A3AA46G1YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/21/2007",
        "dateOfIncident": "04/20/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209675,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 MITSUBISHI GALANT. IN 2004 THE VEHICLE'S DASHBOARD BEGAN CRACKING SOON AFTER THE WARRANTY EXPIRED . THE DASHBOARD HAS MULTIPLES CRACKS AND CONTINUED TO CRACK.  *TR",
        "vin": "4A3AA46G0YE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/03/2007",
        "dateOfIncident": "11/03/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207815,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN SIGNAL POPPED OFF/VEHICLE PAINT STARTING TO RUST) I PURCHASED THIS VEHICLE IN 10/05 HAD VEHICLE FOR TWO YARS. THE TURN SIGNAL POPPED OFF I SAW IT WAS A RECALL CALL DEALERSHIP WHO ADVISED ME MY CAR BASED ON THE VIN WAS NOT A PART OF THE RECALL. WHEN I WAS PERSISTENT HE THEN SAID MY CAR'S TURN SIGNAL WAS REPLACED IN 2000. THE RECALL WAS NOT DONE UNTIL 2004. ABOUT 3 MONTHS AGO I STARTED TO SEE RUST SPOTS ON MY BLACK CAR AS WELL. I FEEL I WAS TAKEN ADVANTAGE OF AT THIS DEALERSHIP AND NO ONE IS WILLING TO HELP ME.  *TR",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/16/2007",
        "dateOfIncident": "07/01/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205892,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C NOT WORKING PROPERLY NOT ANY WHERE NEAR AS COLD AS IT SHOULD BE.  BROUGHT BACK TO MITSUBISHI IN SERRAMONTE AROUND 4 TIME.  THEY COMPLETELY TOOK APART DASHBOARD AND THE  A/C IN 2003 AND SAID THEY FOUND METAL SHAVINGS IN SOME PART OF THE A/C UNIT AND FIXED IT.  WELL NOW IT'S 4 YEARS LATER AND IT NEVER REALLY WORKED RIGHT.   THIS IS A PROBLEM SINCE THE CAR WAS BOUGHT NEW IN 2000.  I JUST GAVE UP TRYING TO GET THIS A/C TO WORK PROPERLY BUT A FRIEND TOLD ME I SHOULD POST IT WITH THE NHTSA.  *TR",
        "vin": "4A3AA56LXYE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/16/2007",
        "dateOfIncident": "01/15/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205889,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE PAINT ON ROOF AND TRUNK WITH BIG WHITE PATCHES AFTER ONLY 4 YEARS.  TOOK IT TO A DEALER IN EAST BAY IN CALIFORNIA AND THEY SAID WOULD REPAINT ROOF AND TRUNK BUT I WOULD HAVE TO LEAVE FOR 2 WEEKS.  I WOULD HAVE HAD TO RENT A CAR FOR 2 WEEKS SO IT WAS NOT WORTH REPAINTING BECAUSE I HAD NO MEANS OF TRANSPORTATION.  *TR",
        "vin": "4A3AA56LXYE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/24/2007",
        "dateOfIncident": "07/01/2006",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204008,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT.  THE CONTACT STATED THAT THE DRIVER SIDE HEADLIGHT FAILED.  HE ATTEMPTED TO REPLACE THE BULB AND NOTICED THAT THE SOCKET WAS MELTED.  LAST YEAR, THE PASSENGER SIDE HEADLIGHT EXPERIENCED THE SAME FAILURE.  THE MECHANIC REMOVED THE SOCKET, BUT DID NOT STATE WHAT CAUSED THE FAILURE.  THE FAILURE MILEAGE WAS 93,000 AND CURRENT MILEAGE WAS 105,000.",
        "vin": "4A3AA46G4YE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/04/2007",
        "dateOfIncident": "07/15/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201825,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT.  WHILE ATTEMPTING TO MAKE A LEFT TURN, THE TURN SIGNAL SWITCH SNAPPED OFF WHEN IT WAS ENGAGED.  THE SWITCH IS CURRENTLY HANGING BY TWO WIRES.  THE DEALER STATED THAT HER VEHICLE WAS NOT INCLUDED IN RECALL NUMBER 99V30500.  THE SPEED, PURCHASE DATE, AND NHTSA RECALL NUMBER WERE UNKNOWN.  THE CURRENT MILEAGE WAS 94,000 AND FAILURE MILEAGE WAS 85,000.",
        "vin": "4A3AA46G6YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/31/2007",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201308,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 MITSUBISGHI GALANT. IN 2004 THE PAINT BEGAN TO DRASTICALLY FADE ON THE HOOD, TRUNK & ROOF. I BELIEVE THERE IS A DEFECT IN THE PAINT JOB. I STRONGLY BELIEVE MITSUBISHI NEEDS TO ISSUE A RECALL ON THE PAINT JOB! *TR",
        "vin": "4A3AA46G8YE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2007",
        "dateOfIncident": "02/15/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193927,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 MITSUBISHI GALANT.  THE CONTACT STATED THAT THE VEHICLE'S DASHBOARD BEGAN CRACKING SOON AFTER THE WARRANTY EXPIRED IN 2004.  THE DASHBOARD HAS CONTINUED TO CRACK.  IN JULY OF 2005, THE FUEL FILLER DOOR DETACHED AND THE CD PLAYER STOPPED OPERATING.  AFTER BEING INFORMED THAT HER WARRANTY DID NOT COVER ANY OF THESE COMPONENTS, SHE DECIDED NOT TO TAKE ACTION.  SHE IS PURSUING IT NOW AFTER REALIZING THAT SEVERAL OTHERS ARE EXPERIENCING THE SAME FAILURES.  THE VIN AND ENGINE SIZE WERE UNKNOWN.  THE CURRENT MILEAGE IS 99,900 AND FAILURE MILEAGE WAS 38,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/09/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190331,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL CYLINDERS  FAILED AGAIN.  THIS WAS  THE  SIXTH  SET THAT THIS CAR HAD BEEN THROUGH. THEY WERE LEAKING AT TIME OF PURCHASE ALTHOUGH I DISCOVERED  THIS  A WEEK THEREAFTER.  THE PROPORTIONAL VALVE HAD BEEN CHANGED, NEW BRAKES  ALL AROUND ALSO.  DEALERS HAD NO IDEA WHY THIS WAS HAPPENING.   NEED HELP TO FIND  THE CAUSE.  HAS  DISABLED PARENT THAT IS ON BLOOD THINNER, I DON'T NEED HER BLEEDING TO DEATH IF I TOTALLY LOOSE THE BRAKES AND GET INTO AN ACCIDENT.*AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/10/2007",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187466,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT OXIDATION ON TRUNK, ROOF, AND HOOD OF A 2000 BLACK MITSUBISHI GALANT THAT STARTED AS A SMALL SPOT AND GREW WITH TIME.  DID NOT NOTICE THIS WAS A NATIONWIDE ISSUE EXPERIENCED BY MANY BLACK CAR OWNERS UNTIL RECENTLY - DATA AND NEWS CLIPS  WERE WIDESPREAD ON THE INTERNET.*AK",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/15/2007",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185206,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT OXIDATION ON ROOF, HOOD AND TRUNK. *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/30/2007",
        "dateOfIncident": "12/28/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181137,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 GALLANT HEADLIGHT WIRES OVERHEAT CAUSING TO BURN OUT WIRE.  POSSIBLE FIRE HAZARD (DID NOT HAPPEN TO US), HOWEVER HEADLIGHT WIRES OVERHEATED ON BOTH HEADLIGHTS CAUSES THEM TO FUSE AND STOP WORKING.  *NM",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/26/2006",
        "dateOfIncident": "10/26/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171906,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS, THE WINDSHIELD WIPERS INTERMITTENTLY FAILED WHEN ENGAGED.  ADDITIONALLY, UPON ENGAGING THE HEADLIGHT SWITCH, THE HEADLIGHTS WOULD NOT ILLUMINATE.  THE VEHICLE WAS INSPECTED BY A DEALER WHO DETERMINED THE LEVER ARM LINKAGE OF THE WINDSHIELD WIPERS AND THE HEADLIGHT SWITCH NEEDED TO BE REPLACED.  THERE WAS A NHTSA RECALL, # 99V305001, REGARDING THE HEADLIGHT SWITCH.  THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.  THE MANUFACTURER WAS ALERTED.",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/18/2006",
        "dateOfIncident": "09/18/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168511,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE HEADLIGHTS FAILED WITHOUT WARNING.  THE VEHICLE WAS PULLED OVER THE SOCKETS WERE OBSERVED TO BE BURNED.  THE MANUFACTURER WAS ALERTED, BUT THE VEHICLE HAS NOT BEEN INSPECTED BY A MECHANIC.",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/07/2006",
        "dateOfIncident": "09/05/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167606,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HUB CAPS ON MITSUBISHI GALANTS KEEP FALLING ON DURING DRIVING. SEEMS LIKE A MANUFACTURER DEFECT. TIRED OF BUYING NEW ONES.  *NM",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/31/2006",
        "dateOfIncident": "07/28/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163931,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A BLACK 2000 GALANT. AFTER 3 YEARS THE PAINT ON THE ROOF BEGAN FADING. NOW THE ROOF AND HOOD ARE COVERED WITH BIG WHITE FADED PATCHES IT LOOKS AWFUL. I'VE NOTICED THE SAME PROBLEM ON OTHER BLACK GALANTS ABOUT THE SAME AGE LEADING ME TO BELIEVE MITSUBISHI'S BLACK PAINT IS DEFECTIVE. *JB",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/25/2006",
        "dateOfIncident": "06/30/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163450,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF A 2000 BLACK MITSUBISHI GALANT.  THE PAINT STARTED FADING WITHIN FOUR YEARS OF OWNING THIS VEHICLE.  I BROUGHT THE VEHICLE TO A LOCAL MITSUBISHI DEALERSHIP WHO ADMITTED A DEFECT IN THE PAINT ON THE 2000-2001 MITSUBISHI GALANTS.  AS SUCH, THE LOCAL MITSUBISHI DEALER AGREED TO PAINT THE VEHICLE ON OR ABOUT 2005.  HOWEVER, MITSUBISHI WOULD ONLY APPROVE PAINTING THE SPECIFIC AREAS WHICH WERE FADED HORRIBLY  (THE HOOD AND TRUNK WHICH WERE THE FIRST AREAS THAT BEGAN TO FADE), ALTHOUGH ALL OF THE ORIGINAL PAINT ON THE VEHICLE WAS DEFECTIVE.      ABOUT A YEAR AFTER THE LOCAL MITSUBISHI DEALERSHIP PAINTED THE HOOD AND TRUNK, ALL OF THE OTHER AREAS ON THE VEHICLE ARE NOW FADING HORRIBLY.  MITSUBISHI HAS DENIED ANY RESPONSIBILITY DUE TO THE FACT THAT MY VEHICLE HAS 107K MILES ON IT -- ALTHOUGH THEY WERE ONLY WILLING TO CORRECT THE DEFECTIVE PAINT IN PART WHEN THEY WERE AWARE OF THE DEFECTIVE PAINT.  MITSUBISHI SHOULD HAVE KNOWN THAT REMAINDER OF THE ORIGINAL DEFECTIVE PAINT ON THE VEHICLE WOULD FADE SIMILAR TO THE AREAS ON THE HOOD AND TRUNK.      I WAS NOT AWARE OF ANY LIMITS OR RESTRICTIONS BY MITSUBISHI FOR CORRECTING THE DEFECTIVE PAINT ON THE 2001 GALANT MODELS.        IT IS NOT UNREASONABLE THAT A PRUDENT BUYER EXPECT FROM A REPUTABLE AND ETHICAL MANUFACTURER AN IMPLIED GUARANTEE THAT THE ORIGINAL PAINT ON THE VEHICLE WILL NOT COMPLETELY FADE AWAY AFTER 5-6 YEARS OF OWNERSHIP.        (THE ONLY AREAS OF THE VEHICLE THAT NO LONGER HAVE THE ORIGINAL PAINT ARE THE AREAS PAINTED BY THE LOCAL MITSUBISHI DEALERSHIP - THE HOOD AND TRUNK).  THE TRUNK AND HOOD ARE THE ONLY AREAS NOT TURNING WHITE. *JB",
        "vin": "4A3AA46G1YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/21/2006",
        "dateOfIncident": "09/16/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163021,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD HAS BEEN REPLACED TWICE AND NOW THE THIRD MANIFOLD HAS CRACKED IN THE VERY SAME PLACE AS THE FIRST TWO. FIRST REPLACEMENT CAME WITH NO EXPLANATION WHY. SECOND REPLACEMENT WAS BECAUSE OF A CRACKED MOTOR MOUNT. I WILL NOT LET DEALERSHIP REPLACE THIS MANIFOLD. I HAVE BEEN TOLD THAT WHEN THE TIMING BELT WAS REPLACED IT WAS NOT INSTALLED CORRECTLY AND THERE IS TOO MUCH ENGINE VIBRATION. BELT REPLACED AT 60K. THREE MANIFOLDS FAILED IN A 19 MONTH PERIOD",
        "vin": "4A3AA36G7YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/2006",
        "dateOfIncident": "04/10/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155006,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD WHEEL CYLINDERS REPLACED -- LEFT REAR IN 2004 AND RIGHT REAR IN DEC 2005.  WENT FOR OIL CHANGE TODAY AND ASKED THE MECHANIC TO PULL OF REAR WHEELS BECAUSE THE BRAKES DIDN'T FEEL RIGHT TO ME.  RIGHT REAR WAS SOAKED IN BRAKE FLUID AND LEFT REAR HAD JUST STARTED TO LEAK.  RIGHT REAR HAD ALSO STARTED TO SEIZE UP DUE TO BRAKE FLUID COATING THE SHOES.  WHEEL CYLINDERS SHOULDN'T FAIL AFTER ONLY 4 MONTHS -- AND EVEN 2 YEARS SEEMS LIKE IT IS A SHORT PERIOD OF TIME. HAVE HAD OTHER CARS AND NEVER HAD THIS ISSUE.  ALSO, FRONT ROTORS SEEM TO WARP OUT REALLY FAST -- AS IN ONCE A YEAR.  I DRIVE CAR NORMAL AND AM NOT HARSH ON THE BRAKES.   *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2006",
        "dateOfIncident": "03/10/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152453,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS SHUT OFF AT WORK FOR ABOUT 30 - 50 MINUTES WHEN THE HORN STARTED TO BLARE FOR NO REASON -- NO ALARM INSTALLED.  OPENED CAR DOOR AND ELECTRICAL BURNING SMELL WAS PRESENT.  HAD TO PULL FUSE TO GET IT SHUT OFF.  VEHICLE WAS LOCKED AND EMPTY AT TIME. *NM",
        "vin": ""
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/30/2005",
        "dateOfIncident": "10/02/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146541,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "DIAMOND CARE",
                "productModel": "DIAMOND CARE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE OWNED A 2000 GALANT BRAND NEW FOR THE PAST 5 YEARS.  I KEEP UP WITH THE SERVICE, AND ALWAYS USE MITSUBISHI SERVICE DEPARTMENT.    THE PAST FEW MONTHS HOWEVER (SUMMER OF 2005) - RIGHT AROUND THE 5 YEAR ANNIVERSARY DATE - I NOTICE THAT EVERY TIME IT RAINS, THE \"FLOOR OF THE DRIVER SIDE IS FLOODED WITH WATER\".  IT IS SUCH A HUGE NUISANCE.     THERE IS NO EVIDENCE OF THE TRAIL OF THE WATER AT ALL.     I HAVE ASKED THE SERVICE DEPARTMENT TO CHECK IT OUT, AND THEY MENTIONED THAT \"MAYBE THE WATER IS COMING IN FROM THE SEAMS OF THE SUNROOF, ETC. , THAT IT MIGHT ALSO HAVE DEBRIS IN THE SUNROOF, AND THEY HAVE CLEANED IT OUT\".      THAT WAS OF NO HELP!!!! SO, MY CAR SMELLS SUPER MUSTY AND MILDEWY A FEW DAYS AFTER EVERY RAINFALL.  I TRY TO DRY IT OUT AS MUCH AS I CAN, BY CHANGING THE MATS AND USING TOWELS TO SOAK UP THE WATER AFTER EVERY RAINFALL AND EVERY SNOW FALL.    WHAT A MESS!!!  THANK YOU.  *NM",
        "vin": "4A3AA46L6YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/28/2005",
        "dateOfIncident": "11/21/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143802,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DIES DUE TO ENGINE FUSE BLOWING, APPARENTLY RELATED TO RECALL NUMBER 99V333001.  MITSUBISHI DENIES ANY KNOWLEDGE OF SUCH RECALL.  *NM",
        "vin": "4A3AA46L2YE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/23/2005",
        "dateOfIncident": "06/22/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137444,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 4 YEARS OLD MY 2000 MITSUBISHI GALANT'S BUMPER STARTED PEELING. AT 5 YEARS OLD MY ROOF (BY THE SUNROOF) STARTED SEVERELY FADING.  MY CAR IS BLACK AND I HAVE A HUGE WHITE SPOT ON THE ROOF.  I AM EXTREMELY WORRIED WHAT WILL HAPPEN THIS WINTER WITH THE PAINT. NOT TO MENTION SUCH A YOUNG CAR SHOULDN'T HAVE SUCH A PROBLEM WITH THE PAINT AND IT LOOKS HORRIBLE.  MITSUBISHI SHOULD BE ASHAMED THAT THE CAR LOOKS THE WAY IT DOES. I CONTACTED THEM AND THEY TOLD ME IT WAS OUT OF THE 3 YEAR WARRANTY AND WOULDN'T DO ANYTHING ABOUT IT. *JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "02/03/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132185,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM VERY DISGUSTED, I PURCHASED MY 2000 MITUSBISHI GALANT APPROXIMATELY A YEAR AND A HALF AGO, I WAS MY CAR WEEKLY AND WAX MY VEHICLE EVERY 4 TO 5 MONTHS, ABOUT 6 MONTHS AGO MY CAR STARTED GETTING OXIDATION SPOTS, I HAVE A HUGE SPOT ON THE HOOD, ALL ACROSS THE TRUNK AND EVEN ON THE HOOD OF THE CAR, IT IS REALLY DISGUSTING AND THROUGHOUT MY TOWN I HAVE SEEN APPROXIMATELY 5 OR 6 OTHER BLACK GALANTS WITH THE SAME PROBLEMS TO THEIR PAINT! I REALLY WISH SOMETHING WOULD BE DONE TO CORRECT THIS PROBLEM BECAUSE A PAINT JOB ISN'T EXACTLY CHEAP AND I'VE READ THROUGH THIS WEBSITE OF ALL THE OTHER 2000 BLACK GALANTS THAT ARE HAVING THIS SAME PROBLEM. PLEASE HELP!   *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/09/2005",
        "dateOfIncident": "08/09/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132120,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED THE COMPUTER SENSORS FAILED. THIS COULD AFFECT THE CATALYTIC CONVERTER AND CAUSE AIR POLLUTION. DID  NOT THINK THE PUBLIC WAS MADE AWARE OF THE RECALLS. TWO SENSORS FAILED  ASKED MITSUBISHI TO FIX THEM, AND THEY  REFUSED BECAUSE THERE WAS NO RECALL.  THEY WERE ONLY GUARANTEED FOR 3 THREE YEARS OR 36,000 MILES. *AK",
        "vin": "4A3AA46L9YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131346,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS WARP, PULSATING UPON APPLICATION OF BRAKE PEDAL.  THIS WILL BE THE THIRD SET OF ROTORS ON THIS SUV. *JB",
        "vin": "JA4MT31H3YP"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "05/02/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126482,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR JUST STALLED WITHOUT WARNING TURNS OUT TIMING CHAIN WENT. 1200 REPAIR FIXED WITHIN 2 MONTHS NEEDED ANOTHER TIMING BELT...",
        "vin": "4A3AA46G5YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/14/2005",
        "dateOfIncident": "01/05/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125322,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 6 MONTHS AGO I NOTICED THAT THE PAINT ON MY BLACK CAR WAS STARTING TO GET WHITE/GRAY SPOTS ON THE TRUNK AND ROOF AREA MAINLY AROUND MY SUN ROOF.  IT IS NOW GOTTEN MUCH WORSE AND HAS EVEN STARTED ON MY HOOD.  MY CAR IS ONLY 5 YEARS OLD AND IT HAS ALWAYS BEEN KEPT IN THE GARAGE AND WASHED AND WAXED REGULARLY.  I AM VERY DISPLEASED WITH THIS PAINT JOB.  I NOTICED THAT THERE ARE MANY COMPLAINTS ABOUT FADING/OXIDATION AND FUNNY HOW MOST OF THEM ARE 2000 AND BLACK.  SAME AS MINE.",
        "vin": "4A3AA46L0YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/01/2005",
        "dateOfIncident": "10/01/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118769,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 GALANT AND ABOUT SEVEN MONTHS AFTER I PURCHASED THE CAR THE CLEAR COAT ON THE PAINT STARTED PELLING ON THE DRIVER SIDE, AND THE FRONT AND REAR BUMPER, I DID NOT KNOW THAT A CAR THAT NEW WAS SUPPOSE TO HAVE PAINT DEFECTS. NOW MY CAR IS ONLY FIVE YEARS OLD, BUT I HAVE ONLY HAD THE CAR FOR TWO YEARS AND IT LOOKS AS IF IT IS OVER TEN YEARS OLD AND WAS NEVER TAKEN CARE OF. I ALSO HAVE A RATTLING IN MY DASH AND THAT STARTED ABOUT THE SAME TIME, AND I TAKEN MY CAR SEVEAL TIMES TO THE DEALER TO HAVE ITS  REGALUR MAINTANCE AND YET THE PROBLEM CONTINUES.  *AK",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/28/2005",
        "dateOfIncident": "01/05/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116958,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BRAKE ROTORS WARPED PREMATURELY, AND HAD TO BE REPLACED EVERY 5,000 MILES.  DEALERSHIP REPAIRED ROTORS  3 TIMES. HOWEVER, PROBLEM RECURRED.  *AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/15/2005",
        "dateOfIncident": "03/14/2005",
        "fire": false,
        "manufacturer": "MITSUBISHI CARIBBEAN",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115187,
        "products": [
            {
                "manufacturer": "MITSUBISHI CARIBBEAN",
                "productMake": "MITSUBISHI CARIBBEAN",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY 55 MPH DRIVER APPLIED THE TURN SIGNAL AND IT FELL OFF THE STEERING COLUMN ONTO THE FLOOR. DRIVER MUST USE HAND SIGNALS WHEN TURNING. VEHICLE IS CURRENTLY OUT OF WARRANTY.  *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "02/28/2005",
        "dateOfIncident": "01/15/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112301,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) MINOR FRONT BUMPER IMPACT WAS TO BE REPAIRED UNDER AN INSURANCE CLAIM  (2) IN TEARDOWN PROCESS FOUND SPOT WELDS THAT WERE RUSTED OUT AND IMPROPERLY   SEALED.  THIS WAS DETERMINED TO BE A MANUFACTURER DEFECT - NATURE OF ACCIDENT WOULD NOT HAVE CAUSED DAMAGE TO APRON AREA.  AS THIS IS A MAJOR SAFETY ISSUE, REPAIR COULD NOT BE COMPLETED AND VEHICLE WAS DEEMED A TOTAL LOSS.  (3)  MITSUBISHI NOT CLAIMING RESPONSIBLITY.  HAVE PHOTOS AND ADJUSTERS THAT REVIEWED VEHICLE THAT CAN PROVIDE STATEMENTS AS TO THIS BEING A MANUFACTURERS DEFECT",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/31/2005",
        "dateOfIncident": "01/10/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108305,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL COVERS CONTINUE TO FALL OFF OF VEHICLE.  WAS TOLD BY A PERSON THAT SELLS WHEEL COVERS, THAT THE 2000 MITSUBISHI GALANT  HAS THAT PROBLEM DUE TO THE PART THAT HOLDS THE WHEEL COVER ON, HEATS UP AND THE PIECE OPENS UP AND ALLOWS THE WHEEL COVER TO FALL OFF.  ALL MY WHEEL COVERS WERE LOSS OR HAD TO BE TAKEN OFF OVER THE LAST 4 YEARS.  THE MITSUBISI WHEEL COVERS ARE VERY EXPENSIVE TO REPLACE.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/18/2004",
        "dateOfIncident": "12/14/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104062,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR ON MY WAY TO WORK WHEN MY CAR MADE THIS LOUD NOISE COMING FROM THE ENGINE COMPARTMENT AND IT STALLED ON ME,AND CUT OFF ON THE MIDDLE OF THE RODE. CALLED A TOWING COMPANY AND HAD THE CAR TOW TO MY HOUSE ,I CALLED A MECHANIC HE CHECKED AND FOUND THE INTAKE MANIFOLD WAS CRACKED.  *JB",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "09/08/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092530,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATED THAT WHILE TURNING, THE SIGNALS FAILED INTERMITTENTLY.  RECALL 99V305001 WAS ISSUED.  HOWEVER, THIS VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO VIN.   *AK   WHEN THE CONSUMER USED THE TURN SIGNAL, THE HIGH BEAM LIGHT WOULD TURN ON AND WAS DIFFICULT TO TURN OFF AND THE SIGNAL WOULD NOT BE INDICATED.   *SC",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/22/2004",
        "dateOfIncident": "11/18/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100325,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING BELT AND VALUES FOR THE MITSUBISHI GALANTS NEED TO BE LOOKED OVER TO SEE IF IT'S A RECALL PROBLEM BECAUSE MINE WENT OUT ON ME, AND ALSO I KNOW OF ANOTHER PERSON WITH A MITSUBISHI GALANT HAD THE SAME THING HAPPEN TO THEM.  *JB",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2004",
        "dateOfIncident": "10/26/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096456,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT OS ABOUT THE PAINT ON MY CAR IT IS CRACKING IN MANY DIFFERENT AREAS OF MY CAR FOR NO REASON.  I HAD BROUGHT IT TO THE DEALER WHILE IT WAS UNDER WARRANTY THE HAD SENT IT TO BE REPAINTED BUT IT IS CRAKING IN CHUNKS ALL OVER AGAIN.*AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/19/2004",
        "dateOfIncident": "09/16/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092418,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEVER THAT CONTROLLED THE LIGHTS AND TURN SIGNAL WAS LOOSE . THIS DEFECT WAS RECALLED BY THE MANUFACTURER. THE REPAIR WAS DONE IN 2000, NOW THE PROBLEM EXIST AGAIN. OWNER HAS CONTACTED THE MANUFACTURER AND WAS TOLD THAT THIS PROBLEM CANNOT BE CORRECTED AGAIN UNDER THE RECALL. NOW THE OWNER HAS TO PAY OUT OF POCKET. THE OVER ALL PROBLEM WITH THE TURN SIGNAL SWITCH HAS NOT COMPLETELY BEEN RESOLVED. PROVIDE FURTHER DETAILS.  *JB  CONSUMER WAS CHARGED FOR REPAIRS.  *TC",
        "vin": "4A3AA46G5YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/13/2004",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095736,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY BLACK 2000 MITSUBISHI GALANT BRAND NEW IN AUGUST 2000.  ABOUT 3 MONTHS AGO I NOTICED THE PAINT IN A SMALL AREA ON MY HOOD APPEARED TO SHOW SOME OXIDATION.  SINCE THAT TIME THE SPOT HAS GROWN IN SIZE AND SPREAD TO OTHER AREAS OF THE HOOD AND ROOF OF THE VEHICLE.  MY HUSBAND AND I HAVE WASHED AND WAXED THE CAR REGULARLY AND TAKEN MEASURES TO PROTECT THE PAINT JOB.  I HAVE RESEARCHED THIS PROBLEM ONLINE AND IT SEEMS TO OCCUR ONLY ON MODELS PAINTED BLACK.  I HAVE OBSERVED A FEW OTHER BLACK GALANTS AROUND TOWN THAT SEEM TO SHARE MY CAR'S PROBLEM.  IT CAN ONLY BE EXPLAINED BY A DEFECT IN THE PAINT.  I HAVE CONTACTED MY MITSUBISHI DEALERSHIP AND THEY HAVE TAKEN DOWN MY NAME AND NUMBER AND TOLD ME THAT THEY WOULD FORWARD MY CONCERNS TO THE MITSUBISHI REPRESENTATIVE WHEN HE VISITS THIS MONTH.  ACCORDING TO OTHER POSTS BY GALANT OWNERS, I AM NOT EXPECTING THAT THE PROBLEM WILL BE RESOLVED.  I ENCOURAGE ANYONE READING THIS POST TO PLEASE ADD YOUR COMPLAINT IF YOUR CAR HAS THE SAME PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "07/14/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087866,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS A TENDENCY TO PULL TO THE RIGHT WHILE IN MOTION.  FRONT END FEELS SHAKY AT HIGH SPEEDS OR WHILE DRIVING ON ROUGH ROAD SURFACES. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/12/2004",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087767,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BRAKES ON THE BACK WHEEL MADE A DRAGGING NOISE.  THIS OCCURS EITHER WHEN THE BRAKES WERE APPLIED OR JUST NORMAL DRIVING.  THE BRAKES WERE REPLACED BUT THE NOISE RETURNED AFTER SEVERAL THOUSAND MILES.  THE BRAKE CALIPERS ALSO CAUSED PROBLEMS FORMING RESIDUE ON AND AROUND THE CALIPER SEAL.  PLEASE PROVIDE DETAILS.  *JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/29/2004",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082911,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A SIX MONTHS AGO THE PAINT ON MY 2000 GALANT STARTED TO GET REAL BAD OXIDATION.  NOW I KNOW THAT A CAR THAT IS 4 YRS OLD SHOULD NOT LOOK LIKE THAT.  THE PROBLEM AREAS ARE THE HOOD AND THE ROOF.*AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2004",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10078735,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT A 2000 MITSUBISHI GALANT  BRAND NEW IN 2000. I DID WHAT I WAS SUPPOSED TO. TAKING CARE WITH THE FINISH. I WASHED AND WAX THE CAR AS REQUIRED. THE CAR WAS BLACK. THE PAINT STARTED TO FADE ABOUT A YEAR AN A HALF AGO. THE CAR NOW LOOKS WHITE IT IS SO BAD. BECAUSE WE DO A GREAT DEAL OF DRIVING WERE TOLD WE WERE OVER  WARRANTY BECAUSE OF THE MILAGE. WE HAVE SPOKEN TO OTHER PEOPLE THAT HAVE HAD THE SAME PROBLEM.  *AK",
        "vin": "4A3AA46GXYE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/25/2004",
        "dateOfIncident": "03/11/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064861,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT AN UNDETERMINED SPEED, THE CHECK ENGINE LIGHT APPEARED ON THE DASH THEN THE VEHICLE STALLED. THIS CAUSED THE DRIVER TO DRIFT OFF THE ROAD. THE CONSUMER HAD THE VEHICLE TOWED TO THE DEALER. THE MECHANIC INFORMED THE OWNER THAT THE OIL PUMP HAD FAILED. PLEASE PROVIDE ANY FURTHER DETAILS.   *NM",
        "vin": "FILLIN"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/12/2004",
        "dateOfIncident": "02/12/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057107,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NEED FOR RADIO CODE NOT FURNISHED BY MITSUBSHI DEALER IN ALHAMBRA, CA  HAD TO PURCHASE NEW BATTERY, RADIO WOULD NOT WORK AFTER, CONTACTED DEALER AND WAS INFORMED WE HAD TO BRING THE CAR IN, INSTEAD OF GIVING ME THE CODE TO INPUT MYSELF, AS I AM PERFECTLY ABLE TO DO. I FEEL THIS IS A DELIBERATE CON JOB TO GET MORE   FROM HELPLESS CUSTOMERS, THE MITSUBISHI MANUAL SAYS WE ARE TO RECEIVE THE CODE WHEN WE ORIGINAL THE VEHICLE AND NO CODE WAS GIVEN, THE DEALER SAID IT COULD COST UP TO 100.00 DOLLARS, WHICH WE DO NOT HAVE JUST LAYING, I FEEL THAT THE CALIFORNIA ATTORNEY GENERAL OF CALIFORNIA WOULD LIKE TO FIND OUT HOW YOUR DEALERS ARE TRYING TO USE THIS AS WAY TO GET MORE MONEY OUT OF THEIR CUSTOMERS. ALL WE WANT IS THE CODE OF OUR 2000 MITSUBISHI GALLANT [XXX] WE FEEL THIS IS NOT ASKING VERY MUCH. SO PLEASE SEND OUR CODE AND THIS MATTER WILL BE ENDED. UPDATED 07/27/2012  *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/02/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042224,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE LEFT TURN SIGNAL IS TURNED ON SOMETIMES THE HEADLIGHTS AUTOMATICALLY GO OFF.  HOWEVER, WHEN TURNING  TURN  SIGNAL SWITCH OFF HEADLIGHTS COME ON. *AK",
        "vin": "4A3AA46G4YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2003",
        "dateOfIncident": "09/08/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037435,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY GALANT IS JUST THREE YEARS OLD AND THE PAINT IS SERIOUSLY FADING. IT IS OBVIOUS THAT THIS IS A DEFECT IN THE PAINT. I HAVE TAKEN IT TO 3 MECHANICS AND THEY'VE ALL TOLD ME THE PAINT IS DEFECTIVE. THERE ARE MANY GALANTS IN MY AREA THAT ARE OLDER THAN MINE AND HAVE NO PAINT DEFECTS. THIS IS VERY DISTURBING CONSIDERING I HAVEN'T EVEN PAID THE CAR OFF YET AND THE ENTIRE CAR NEEDS A PAINT JOB BECAUSE IT LOOKS AWFUL. THE TOP, HOOD AND TRUNK OF MY BLACK CAR ARE COVERED IN HUGE WHITE SPOTS. IT IS TERRIBLE AND I WILL NEVER BUY A MITSUBISHI AGAIN AND I ALSO PLAN TO REPORT THIS TO 6 ON YOUR SIDE NEWS STATION, SO IT CAN BE MADE KNOWN THAT MITSUBISHI'S WILL FADE WITHIN 2-3 YEARS OF PURCHASE, SINCE THEY DON'T TELL YOU THIS WHEN YOU BUY THE CAR.*AK",
        "vin": "4A3AA46L3YE"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": true,
        "dateComplaintFiled": "08/03/2003",
        "dateOfIncident": "08/01/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10030703,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 1, 2003, WE PURCHASED A USED 2000 MISTIBUSHI GALANT FROM COLONIAL MITIBUSHI IN DANBURY, CONN.    ON JULY 2, WE REPORTED TO THEM THE BRAKES DID NOT FEEL RIGHT.  IT WAS SLIPPING.  THEY RUB IT OFF AND TOLD US BEFORE WE PURCHASE THE CAR, THE CAR WENT THROUGH A GREAT INSPECTION AND NOTHING WAS WRONG.    JULY 4, MY HUSBAND WAS ON HIS WAY TO WORK WHEN HE REALIZED THAT THE BRAKES WOULD NOT STOP THE CAR ON THE HIGHWAY.  HE FINALLY COASTED UNTIL HE WAS ABLE TO EXIT THE HIGHWAY AND USED THE SHIFT PANEL TO STOP THE CAR.  WHILE THIS WAS GOING ON THERE WAS A SKAPING NOISE COMING FROM THE FRONT PASSENGER SIDE OF THE CAR.  THE FOLLOWING DAY, WE REPORTED THE INCIDENT TO COLONIAL MIST. (DAVE) AND THIS REPAIRED THE BRAKES, KEPT THE CAR FOR ABOUT 4 DAYS AND RETURNED IT BACK TO US SAYING IT WAS PERFECT.    ON JULY 27, I CALLED THE SERVICE FACILITY FOR COLONIAL AND REPORTED AGAIN THE BRAKES WERE SLIPPING AND I WAS UNABLE TO STOP AT CERTAIN TIME.  THE LADY TOLD ME THE CLOSET APPOINTMENT WOULD BE FRIDAY, JULY 8 I GUESS BECAUSE I WASN'T ONE OF THERE FAVORITE CUSTOMER.  I SAID TO HER I AM TALKING ABOUT THE BRAKES NOT THE WINDSHIELD OR DOOR, BUT THE SAFETY OF MY CHILDREN AND I. SHE SAID NO MANAGER WAS AVAILABLE AND THAT THE CLOSEST DAY AVAILABLE.      ON FRIDAY EVENING, AUGUST 1- I HAD NO CHOICE BUT TO USE THE CAR TO DRIVE MY SON TO WORK ABOUT 6 MILES.  ALL ALONG,  I NOTICED WHEN I PRESS THE BRAKES IT WOULD SLID A LITTLE BIT WHEN IT WAS TIME TO COME TO STOP.  BUT, AT THIS PARTICULAR POINT I PRESS THE BRAKES AND IT KEPT SLIDDING,AND SLIDDING ANFD WON'T STOP UNTIL I HIT THE CAR IN FRONT OF ME.  WHICH WAS STANDING STILL.  WE REPORTED THE PROBLEM TO OUR INSURANCE COMPANY, AND ALSO TO COLONIAL MISTIBUSHI WHO IS WILLING TO TAKE THE CAR BACK NOW, BUT WITHOUT REFUND BUT EXCHANGE.  WHAT OTHER RECOURSE CAN WE PERSUDE IN REFERENCE TO THIS ISSUE CONSIDERING IT'S A USED CAR?*AK",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/22/2003",
        "dateOfIncident": "07/22/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029867,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL 99-T-001-000: TIRE DESCRIPTION:  P195/65R15 TURANZA EL41, DOT SERIAL NO. Y79NPVD458 AND Y79NPVD468, SUPPLIED TO HONDA FOR INSTALLATION ON THEIR NEW VEHICLES.   THESE TIRES DO NOT COMPLY WITH THE HIGH SPEED AND ENDURANCE REQUIREMENTS OF FMVSS NO. 109, \"NEW PNEUMATIC TIRES.\" CONSUMER HAS THE SAME TIRE BRIDGESTONE MODEL TURRANZA EL 41 SIZEP195/65R15 DOT # UNKNOWN.   MANUFACTURER DENIED THE RECALL.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "04/17/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10022135,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPING AT A STOP SIGN, THE VEHICLE WAS INVOLVED IN A FRONT COLLISION.  UPON IMPACT, THE AIR BAGS DID NOT DEPLOY.  DRIVER AND PASSENGER SUSTAINED INJURIES.  *AK *TS",
        "vin": "4A3AA46G6YE"
    },
    {
        "components": "ELECTRICAL SYSTEM,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/20/2003",
        "dateOfIncident": "08/01/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023462,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ALONG WITH SEVERAL RECALLS, THE BRAKES, ROTORS, BATTERY, ALL FOUR TIRES HAD TO BE REPLACED AT MY EXPENSE. HORN STILL DOES NOT PROPERLY WORK AFTER BEING REPLACED. ELECTRICAL FAILURES WITH BLINKER LIGHT (INSIDE AND OUTSIDE) AND OUTSIDE REAR DRIVER SIDE LIGHT STAYING ON EVEN WHEN CAR IS TURNED OFF. SERVICE DEPARTMENT SAYS THEY FIND NOTHING WRONG. LETTERS WRITTEN TO MITSUBISHI GO UNRESPONSIVE TO AND/OR ARE REFERRED TO MY LOCAL SERVICE DEPARTMENT, WITH NO RESPONSE, ONLY THAT MY CLAIMS ARE DENIED. NEED HELP. PLEASE CHECK THIS OUT. CAN'T UNDERSTAND HOW A BRAND NEW VEHICLE CAN HAVE TO HAVE SO MANY PARTS REPLACED (AT MY EXPENSE) AND SO MANY OTHER DEFECTS AND NO ONE PROVIDE ANY ANSWERS/REASONS OR RESPONSES TO COMPLAINTS. PLEASE HELP. THANK YOU IN ADVANCE FOR YOUR ATTENTION.    *NLM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/23/2003",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003282,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUSPENSION/STEERING FOUNDATION HAS A PROBLEM THAT THE DEALERSHIP CANNOT LOCATE.  AN ALIGNMENT IS NEEDED EVERY 2/3 MONTHS(NOT ALWAYS RIDING ON ROUGH ROADS). STEERING FEELS OUT OF CONTROL, HAD 4 ALIGNMENTS DONE, 2 SETS OF 4 BRAND NEW TIRES PLACED ON THE CAR IN A 2YR. PERIOD- THE STEERING & SUSPENSION FEELS OUT OF CONTROL(ALMOST CAUSED TWO ACCIDENTS) AND THE DEALER CANNOT FIND ANYTHING WRONG...ALSO NOISE COMING FROM FRONT PASSENGER SIDE THAT THEY CANNOT FIND EITHER...........I SEEN A LOT OF THE SAME COMPLAINTS SENT ALREADY!",
        "vin": "4A3AA46G4YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2003",
        "dateOfIncident": "04/10/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002007,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THE CAR HAD SENATIVE HUB CAPS. TS",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/06/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023842,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE OPENING DOOR TOP EDGE OF DOOR SPLIT CONSUMER ACROSS FACE CAUSING INJURIES IN RESULT OF 30 STITCHES IN FACE. DEALER AND MANUFACTURE HAS BEEN CONTACTED. PLEASE PROVIDE FURTHER INFORMATION. TS",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/01/2002",
        "dateOfIncident": "08/20/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770292,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS CAR FOR ALMOST 6 MONTHS AND I HAVE HAD WORK DONE ON MY BRAKES 3 TIMES SINCE I PURCHASED THE CAR. I HAVE ALREADY MACHINED/TURNED THE ORIGINAL FRONT DISC ROTORS ONCE AND HAVE HAD TO BUY A NEW PAIR OF THEM AS WELL. THE PADS/SHOES HAVE BEEN REPLACED 3 TIMES. IT MAKES A SQUEEKING NOISE FROM THE FRONT BRAKES WHEN GOING ABOUT 15 MPH. IT STOPPED WHEN I GET THE BRAKES SERVICED BUT RETURNS AFTER ABOUT 2K. IT FIRST STARTS OFF WITH TREMBLING WHEN I BRAKE AND THEN THE TREMBLING PROGRESSES. IT STOPS SHAKING WHEN THE THE BRAKES ARE SERVICED BUT ALSO RETURNS AFTER ABOUT 2K.  DT",
        "vin": "4A3AA46G8YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/20/2002",
        "dateOfIncident": "09/17/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769919,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY.  DT",
        "vin": "4A3AA46G8YE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/16/2002",
        "dateOfIncident": "03/13/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767221,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2000 MITSUBISHI GALANT WENT HEAD ON INTO A ROCK WALL AND THE AIRBAGS DIDN'T INFLATE AT ALL THIS A SERIOUS SAFETY MATTER AND I WANT AN ANSWER.*AK",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2002",
        "dateOfIncident": "07/15/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018646,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTIRE ELECTRICAL SYSTEM OF THIS VEHICLE IS NOT WORKING PROPERLY, IT HAS BEEN REPAIRED SEVERAL TIMES YET THE PROBLEM STILL EXIST,  PLEASE PROVIDE ANY ADDITIONAL INFORMATION.   NLM",
        "vin": "YA3AA46G4YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/09/2002",
        "dateOfIncident": "08/11/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018197,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS RECALL O1V225001 A FEW MONTHS BACK REGARDING STEERING GEAR  LOCKING UP.  CONSUMER HAD PROBLEM RESOLVED.  CURRENTLY, SAME PROBLEM WAS OCCURRING IN  SAME VEHICLE. CONTACTED DEALER.  *AKCONSUMER WAS INVOLOVED IN AN ACCIDENT WHERE THE STEERING WHEEL LOCKED UP AND CONSUMER CRASHED INTO A POLE.  SINCE THEN CONSUMER WAS IN MOTION WHEN THE WHEEL LOCKED AGAIN CAUSING CONSUMER TO CRASH INTO A GAURD RAIL.  *JG",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2002",
        "dateOfIncident": "08/06/2002",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016370,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  DROVE VEHICLE TO WORK AND PARKED.  APPROXIMATELY  1 HOUR LATER VEHICLE CAUGHT ON FIRE.   FIRE DEPT ADVISED  CONSUMER THAT FIRE WAS ELECTRICAL IN ORIGIN.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765579,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS IN A ACCIDENT BEFOR THEY SOLD THE CAR TO ME AND IT HAS VERY BAD STEERING PROMBLEMS. THE DOOR COMES AJAR WHILE DRIVING THIS CAR ISN'T A GOOD RUNNING CAR AT ALL THE DEALER REFUSES TO ASSIST ME WITH THE PROMBLEMS .  *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/29/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8014942,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ANOTHER VEHICLE CUT DRIVER OFF.  SHE HIT BRAKES AND SWERVED TO MISS.  VEHICLE STRUCK WALL, AND NEITHER AIR BAG DEPLOYED.  PLEASE DESCRIBE DETAILS. *AK",
        "vin": "4A3A46G5YE1"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2002",
        "dateOfIncident": "06/01/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8014467,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON HIGHWAY AND APPLYING BRAKES, THERE WAS A LOUD GRINDING NOISE COMING FROM WHEEL.  DEALERSHIP WAS AWARE OF PROBLEM.  *AK  CONSUMER FOUND THAT THE PROBLEM WAS WITH THE BRAKES/ROTORS, AND TIRES.  TWO WEEKS LATER THE BACK SPRINGS ON TIRES HAD BEEN REPLACED.  ALSO THE BATTERY HAD GONE DEAD, AND THE BRAKES STILL SQUEAK.  *SCC",
        "vin": "4A38A46G3YE"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "02/07/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 566580,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS INVOLVED IN AN ACCIDENT.  CONSUMERS HEAD WENT INTO THE WINDSHIELD AND CRACKED THE GLASS.  THIS HAPPENED BECAUSE THE BELT RESTRAINT DID NOT SUFFICIENTLY HOLD CONSUMER AND THE AIR BAGS DID NOT DEPLOY.  CONSUMER SUFFERED A CONCUSSION AS A RESULT OF THE ACCIDENT.  AFTER CONTACTING MITSUBISHI'S CLAIMS SERVICE, THEY FOUND NOTHING WRONG WITH THE SEAT BELTS OR THE AIR BAGS. *JG  *SLC",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2002",
        "dateOfIncident": "07/08/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763919,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED A 1995 GALANT BEFORE I PURCHASED MY 2000 MITSUBISHI GALANT AND I MUST SAY, MITSUBISHI IS THE WORST BRAND OF CARS EVER ASSEMBLED.  I HAD SO MANY PROBLEMS WITH MY 1995 GALANT THAT I WAS FORCED TO GET RID OF IT AFTER ONLY ONE YEAR AND COULD NOT SELL OR TRADE THE CAR TO SAVE MY LIFE.  THE ONLY PEOPLE THAT WOULD DEAL WITH ME WERE MITSUBISHI AGAIN SO I WAS FORCED TO BUY ANOTHER MITSUBISHI.  MY CAR IS ONLY 2 YEARS OLD AND I AM HAVING PROBLEMS.  I BOUGHT THIS CAR BRAND NEW AND THE BATTERY IS DEAD.  I CALLED THE MITS. DEALER WERE I BOUGHT THE CAR AND THEY SAID MY WARRANTY DID NOT COVER THE BATTERY, AND I CALLED THE DEALERSHIP DOWN THE STREET FROM ME AND THEY SAID MITS. HAS A 50/50 DEAL AND I WOULD HAVE TO PAY $40 DOLLARS FOR A NEW BATTERY.  I WOULD SELL THIS CAR TODAY IF I COULD BUT KELLY BLUE BOOK.COM TELLS ME THE CAR IS WORTH LESS THAN I OWE.  IF THERE IS ANY WAY YOU CAN HELP ME I WOULD REALY APPRECIATE IT.  THANK YOU, [XXX].  *AK    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2002",
        "dateOfIncident": "10/25/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763703,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CONTINUES TO HAVE ELECTRICAL ISSUES -- WILL STALL INTERMITTENTLY AND SOMETIMES WILL NOT START BACK UP AGAIN.  *AK",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/06/2002",
        "dateOfIncident": "06/05/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762749,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS GALANT HAS A DEFECTIVE COLUMN SWITCH LEVER THAT CONTROLS LIGHTS, TURN SIGNALS AND WIPERS. THERE WAS A RECALL ON THIS ITEM WITH A NHTSA CAMPAIGN ID NUMBER OF 99V305001. WHEREAS, THE LEVER FAILS CAUSING THE DIRECTIONAL LAMPS TO NOT SELF-CANCEL OR OPERATE, HEAD LAMPS THAT DO NOT TURN OFF WHICH CAUSES THE BATTERY TO DIE AND WINDSHIELD WASHERS THAT OPERATE CONTINUOSLY OR DO NOT TURN OFF. DEALER IS SUPPOSED TO REPLACE THE DEFECTIVE LEVER WITH A REDISIDNED SWITCH. THE RECALL SUPPOSEDLY ONLY AFFECTED GALANTS BUILT BETWEEN 05/1998 TO 10/1999. MY GALANT WAS MANUFACTURED, ACCORDING TO MITSUBISHI, IN 11/1999. IT IS APPARENT THAT THEY CONTINUED TO USE THIS DEFECTIVE PART PAST THE 10/1999 CUTOFF DATE. THE DEALER AND MITSUBISHI HAVE SAID THAT I MUST PAY FOR THE REPAIR OF THIS DEFECTIVE PART. I AM ASKING THE NHTSA TO INVESTIGATE THIS DANGEROUS DEFECT FURTHER AND EXTEND THE RECALL COVERAGE TO ALL 2000 GALANT VEHICLES REGARDLESS OF MANUFACTURING DATE.*AK",
        "vin": "4A3AA46L4YE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/23/2002",
        "dateOfIncident": "04/28/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 8010373,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WAITING AND VEHICLE WAS IDLING,  ANOTHER VEHICLE REARENDED THE GALANT, CAUSING IT TO REAREND ANOTHER VEHICLE. UPON IMPACT WITH THE OTHER VEHICLE, THE FRONT AIR BAGS FAILED TO DEPLOY. THREE (3) PASSENGERS WERE INJURED.*JBCONSUMER SUFFERED NECK, BACK AND SOFT TISSUE PELVIC INJURIES.  *JG",
        "vin": "4A3AA46G6YE"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/23/2002",
        "dateOfIncident": "04/28/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762191,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE, TRUNK LID WILL CLOSE FORCEFULLY AND WITHOUT NOTICE ON A PERSONS HEAD,  NECK OR BACK AS THEY ARE RETRIEVING ITEMS FROM THE TRUNK IF THERE IS ANY WIND.   THE CRUISE CONTROL LIGHT COMES ON SOMETIMES WHEN YOU START THE CAR.*AK *JB",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/23/2002",
        "dateOfIncident": "04/28/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762191,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE, TRUNK LID WILL CLOSE FORCEFULLY AND WITHOUT NOTICE ON A PERSONS HEAD,  NECK OR BACK AS THEY ARE RETRIEVING ITEMS FROM THE TRUNK IF THERE IS ANY WIND.   THE CRUISE CONTROL LIGHT COMES ON SOMETIMES WHEN YOU START THE CAR.*AK *JB",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/10/2002",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565732,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT THE VEHICLE HAS A BRAKE PROBLEM DUE TO PROBLEMS FROM THE REAR BRAKE ON THE BACK WHEELS, BRAKES BEGAN MAKING A DRAGGING NOISE, FRONT BRAKES WERE REPLACED IN AUG 2001 AT 21000 MILES, THE DRAGGING NOISE CAME BACK IN MARCH 2002, DEALER STATED NEW PADS WERE NEEDED, DEALER STATED CALIPERS WERE BAD DUE TO NOTICING BRAKE FLUID RESIDUE ON THE BRAKE CALIPER AROUND THE CALIPER RUBBER SEAL.   *SLC",
        "vin": "4A3AA46G8YE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": "05/08/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761675,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 16\" RIMS ARE NOT STANDARD TO THIS VEHICLE AS I HAVE OBSERVED BUT CAME WITH THE CAR. THEY ARE BENT FROM NORMAL DRIVING WHICH IS ODD. THEY ARE STILL IN USE. COULD THEY BE PROBLEMED RIMS FROM ANOTHER MAKE?*AK",
        "vin": "4A3AA46L6YE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/08/2002",
        "dateOfIncident": "04/06/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006997,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 45 MPH  CONSUMER RAN INTO A TELEPHONE POLE HEAD-ON AND NONE OF FRONT AIR BAGS  DEPLOYED.  CONTACTED DEALER. *AK",
        "vin": "4J3AA46GXYE"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004189,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE  VEHICLE WAS COASTING IT SURGED AND  ENGINE IDLED HIGH.  DEALER HAS BEEN CONTACTED. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/18/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758366,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES STARTED ANNOYING SQUEALING AT @24,500 MILES. WHEN TAKEN TO DEALER TO INSPECT, ASKED TO LOOK AT PROBLEM.  SERVICE MANAGER SAID THERE WAS NOTHING WRONG. NOW, WITH 29,512 MILES, PROBLEM SYILL EXISTS. WHEN SCHEDULING 30,000 MILE MAINTENANCE, ASKED SERVICE MANAGER IF THERE WAS ANY PROBLEMS SIMILAR TO MINE.  MANAGER TOLD ME THAT MITSUBISHI WAS LOOKING INTO IT.  THIS IS NOT ONLY A POTENTIAL MAJOR SAFETY PROBLEM, BUT AN EXTREME ANNOYANCE FOR THE OWNER. YOUR INVESTIGATION INTO THIS WOULD BE GREATLY APPRECIATED. THANK YOU!*AK",
        "vin": "4A3AA46L2YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "12/17/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900949,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, FLAMES BEGAN COMING FROM UNDER THE HOOD.*JB(CLAIM#59-V969-316)",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "12/07/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 6900950,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE CAUGHT ON FIRE, THE INSURED JUMPED OUT AND INJURED HIS BACK.*JB(CLAIM#24-5202-022)",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "01/10/2000",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900951,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, VEHICLE CAUGHT ON FIRE.*JB(CLAIM#01-6147-740)",
        "vin": "4A3AA46GZYE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "04/23/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900952,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE INSURED SAW SMOKE COMING FROM THE ENGINE AND THEN PULLED OVER.*JB(CLAIM#33-0310-523)",
        "vin": "4A3AA46G1YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "01/10/2000",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900951,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, VEHICLE CAUGHT ON FIRE.*JB(CLAIM#01-6147-740)",
        "vin": "4A3AA46GZYE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "12/17/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900949,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, FLAMES BEGAN COMING FROM UNDER THE HOOD.*JB(CLAIM#59-V969-316)",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "12/07/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 6900950,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE CAUGHT ON FIRE, THE INSURED JUMPED OUT AND INJURED HIS BACK.*JB(CLAIM#24-5202-022)",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "04/23/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900952,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE INSURED SAW SMOKE COMING FROM THE ENGINE AND THEN PULLED OVER.*JB(CLAIM#33-0310-523)",
        "vin": "4A3AA46G1YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/19/2001",
        "dateOfIncident": "12/17/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900617,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, CONSUMER SAW FLAMES APPEARING FROM THE HOOD, CLAIM 59-V969-316.   *SLC",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/19/2001",
        "dateOfIncident": "12/17/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900617,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, CONSUMER SAW FLAMES APPEARING FROM THE HOOD, CLAIM 59-V969-316.   *SLC",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/13/2001",
        "dateOfIncident": "12/07/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 6900618,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, VEHICLE CAUGHT ON FIRE IN THE ENGINE COMPARTMENT, CONSUMER JUMPED OUT OF VEHICLE AND INJURED HIS BACK, CLAIM 24-5202-022.   *SLC",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/13/2001",
        "dateOfIncident": "12/07/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 6900618,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, VEHICLE CAUGHT ON FIRE IN THE ENGINE COMPARTMENT, CONSUMER JUMPED OUT OF VEHICLE AND INJURED HIS BACK, CLAIM 24-5202-022.   *SLC",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2001",
        "dateOfIncident": "11/13/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899822,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 45-50 MPH SMELLED SMOKE. CONSUMER  APPLIED BRAKES, AND THEY  FADED. TRANSMISSION SLIPPED.  CONSUMER PULLED OVER, AND  FRONT OF  VEHICLE BURST INTO FLAMES. FIRE DEPARTMENT PUT OUT FIRE, VEHICLE WAS TOWED TO DEALER. FACTORY REPRESENTATIVE DETERMINED MITSUBISHI WAS NOT RESPONSIBLE. THERE WAS RECALL000295001 ON  POWER STEERING TUBE THAT COULD CAUSE A FIRE, BUT THIS VEHICLE WAS  NOT AFFECTED. VEHICLE WAS TOTALLED, NO INJURIES.  *AK",
        "vin": "4A3AA46G5YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2001",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899554,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING APPROXIMATELY 45 TO 50 MPH SMOKE STARTED COMING FROM  FRONT END OF  VEHICLE.  UPON EXAMINATION BY DEALERSHIP WIRING HARNESS AND COMPUTER SYSTEM HAD BURNED UP.  NO DETERMINATION WAS MADE AS TO THE CAUSE OF  PROBLEM.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION / DOCUMENTATION.*AK",
        "vin": "4A3AA46G5YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/12/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754423,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MITSUBISHI CLAIMS THEY KNOW NOTHING ABOUT CAMPAIGN NUMBER 01V295001 ISSUED BY YOUR ORGANIZATION AND WILL NOT TELL ME IF MY VEHICLE IS AFFECTED. THEY REFERRED ME TO THIS SITE AFTER TELLING MITSUBISHI ABOUT THE SPECIFIC CAMPAIGN NUMBER. N;U",
        "vin": "4A3AA46L2YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/25/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752582,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS BEEN SERVICED AT MITSUBISHI ALMOST MONTHLY FOR THE SAME PROBLEMS. IT HAS NOT BEEN RESOLVED I BELIEVE THERE IS A SERIOUS DEFECT IN THE DESIGN OF THIS VEHICLE. NO SAFETY DEFEC TSTATED. *AK",
        "vin": "4A31146G5YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2001",
        "dateOfIncident": "07/16/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9003475,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING NOTICE SMOKE IN REARVIEW MIRROR. WITHIN 1/4 MILE LOST ALL BRAKES, ALL READ WARNING LIGHTS CAME ON. ENGINE STOPPED AND SMOKE WAS COMING FROM ENGINE COMPARTMENT. THE VEHICLE WAS DECLARED A TOTAL LOSS.",
        "vin": "4A3AA36G8YE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/10/2001",
        "dateOfIncident": "05/18/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 894037,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS DRIVING AT APPROXIMATELY 30 MPH AND REARENDED ANOTHER VEHICLE AFTER SLIDING DUE TO DIRT ON  ROAD . DUAL AIRBAGS DID NOT DEPLOY. FRONT PASSENGER  SUSTAINED MINOR INJURIES.  CONSUMER CONTACTED MANUFACTURER, BUT WAS NOT GIVEN EXPLANATION.*AK   *SLC",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2001",
        "dateOfIncident": "07/14/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007048,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 MITSUBISHI GALANT.  *JB  *NLM        ****DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT-OVER TO ARTEMIS*****749723",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/31/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562320,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT FRONT TIRE HAS A TWO INCH NARROW BUBBLE, CONSUMER STATES SHE HAS TAKEN THE VEHICLE TO TWO FIRESTONE DEALERS THEY HAVE OFFERED TO REPLACE THE TIRE BUT AT THE CONSUMERS EXPENSE.*JB  FIRESTONE TIRE, NO OTHER INFORMATION GIVEN.   *SLC",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/26/2001",
        "dateOfIncident": "07/24/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 893182,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER FIXED RECALL ON VEHICLE, AND NEXT DAY WHILE DRIVING STEERING WHEEL LOCKED UP, AND SPUN OUT OF CONTROL.   CONTACTED DEALERSHIP, AND DEALER STATED NOTHING THEY COULD DO WITHOUT POLICE REPORT.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/16/2001",
        "dateOfIncident": "07/02/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748512,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNSET FWY ONRAMP TO HOLLYWOOD FWY SOUTH, MY CAR'S STEERING WENT OUT, CAUSED ME LOSING CONTROL. CAR HAD BEEN TAKEN BEFORE FOR STEERING RECALL.I WAS TOLD STEERING IS OKAY AND NOTHING WAS REPLACED.*AK",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/13/2001",
        "dateOfIncident": "07/13/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 892798,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING AWAY FROM STOP SIGN  SIDEWALL ON  FRONT LEFT TIRE, SIZE P19565R15,  BLEWOUT.  ALSO,  SIDEWALL ON  LEFT REAR TIRE HAD A BUBBLE ON IT.  CONTACTED GOODYEAR.*AK  GOODYEAR DID NOT REPLACE THE TIRE UNDER WARRANTY, A FEW WEEKS LATER CONSUMER NOTICED A BUBBLE ON THE SIDEWALL OF ANOTHER TIRE, GOODYEAR DID REPLACE THIS TIRE, CONSUMER ASKED FOR REIMBURSEMENT FOR PREVIOUS TIRE, THE WHEEL WAS DAMAGED IN FIRST TIRE FAILURE.  *SLC",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/12/2001",
        "dateOfIncident": "01/01/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 892592,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  TOOK VEHICLE IN TO DEALER FOR A NOISE THAT WAS COMING FROM FRONT END.  DEALER TOLD CONSUMER IT WAS   FRONT PASSENGER TIRE. CONSUMER TOOK TIRE TO GOODYEAR  DEALER  TO HAVE IT INSPECTED. DEALER SAID IT WAS NOT THE TIRE.  CONSUMER WENT BACK TO MITSUBISHI, AND THEY CLAIMED THAT THEY ADJUSTED AIR PRESSURE.  AS STARTING TO DRIVE  NOISE WAS STILL THERE.   A WEEK LATER, DEALER SAID THEY RECEIVED A PAPER OFF COMPUTER INDICATING  THAT MITSUBISHI WAS AWARE OF PROBLEM. MITSUBISHI SAID TIRE AND  RIM  WERE NOT MEETING UP.*AK",
        "vin": "4A3AA46L3YE"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/10/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748206,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS INVOLVED IN A FRONT END COLLISION CAUSING $6500 IN DAMAGES.  BOTH AIR BAGS FAILED TO DEPLOY.   I WAS TOLD BY THE DEALERSHIP MANAGER THAT NOTHING COULD BE DONE ABOUT THE PROBLEM.  I REFUSED TO MAKE FURTHER PAYMENT ON THE VEHICLE, AND VOLUNTARILY SURRENDERED SAME TO MITSUBISHI MOTORS CREDIT OF AMERICA, PO BOX 6044, CYPRESS, CA 90630-6044.  ALL PARTIES WERE NOTIFIED OF THE DANGEROUS CONDITION OF THE VEHICLE, YET ON JUNE 12, 2001, THE VEHICLE WAS IRRESPONSIBLY SOLD BY MITSUBUSHI CREDIT FOR $9,100.  WHOEVER NOW OWNS THE VEHICLE IS IN GRAVE DANGER TO THE DRIVER AND PASSENGER SHOULD A COLLISION OCCUR.*AK",
        "vin": "4A3AA46G0YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/06/2001",
        "dateOfIncident": "02/15/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747967,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ROTORS SHOWED AT LEAST 6 RADIAL CRACKS SPACED AROUND ROTOR. *AK",
        "vin": "4A3AA46G0YE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2001",
        "dateOfIncident": "12/15/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747218,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL GAUGE STOPPED WORKING.  WHILE DROPING IT OF TO GET REPAIRED, THE SERVICE PERSON SAID, WOW I GOT ANOTHER ONE THIS MORNING FOR EXACTLY THE SAME PROBLEM. ODD?  I THINK NOT. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2001",
        "dateOfIncident": "05/18/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 888900,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY EXPLODED, CAUSING ACID TO FLY ALL OVER  ENGINE COMPARTMENT.  IT EXPLODED IN PARKING LOT WHEN  IGNITION WAS STARTED.BATTERY FUMES ENTERED  PASSENGER COMPARTMENT.  DEALER REPLACED BATTERY, BUT DID NOT HAVE A REASON FOR WHAT HAPPENED OR AN EXACT REMEDY.*AK   *SLC",
        "vin": "4A38A46GXYE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/20/2001",
        "dateOfIncident": "11/14/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 745567,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MITSUBISHI GALANT HAS HAD TWO BRAKE JOBS ONE ON 11/14/00 AT 12366 MILES THEN THE NEXT ON 3/02/00 FRONT AND REAR BRAKES I NOW FEEL I HAVE VERY LITTLE BRAKES AT THIS DATE 5/20/01 WITH THE MILES AT19913 IT HAS ONLY BEEN 3500 MILES SINCE THE BRAKES WERE DONE MITSUBISHI CANT EXPLAIN TO ME WHY MY BRAKES WONT LAST . MY CAR HAS ALOT OF NOISE COMING FROM THE FRONT END AND HAS HAD THIS NOISE SINCE I PURCHASED THE CAR I HAVE DROVE OTHER GALANTS AND NONE HAVE THIS NOISE I HAVE TOLD THE DEALER ABOUT THE NOISE BUT THEY HAVE NO ANSWERS FOR ME  I HAVE NEVER HEARD OF A CAR THAT GOES FOR BRAKES SO MUCH. *AK",
        "vin": "4A3AA36G0YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/24/2001",
        "dateOfIncident": "04/23/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900620,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER PULLED OVER WHEN SHE SMELLED SOMETHING BURNING AND SAW SMOKE FROM THE ENGINE, CLAIM 33-0310-523.   *SLC",
        "vin": "4A3AA46G1YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/24/2001",
        "dateOfIncident": "04/23/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900620,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER PULLED OVER WHEN SHE SMELLED SOMETHING BURNING AND SAW SMOKE FROM THE ENGINE, CLAIM 33-0310-523.   *SLC",
        "vin": "4A3AA46G1YE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/16/2001",
        "dateOfIncident": "01/29/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 886021,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END VIBRATION WHEN DRIVING AT HIGHWAY SPEED OF 65 OR MORE MPH.  VEHICLE BEEN IN / OUT OF DEALER SHOP ON SIX OCCASIONS, AND  WASINFORMED THAT NOTHING COULD BE FOUNDED.  FEEL FREE TO PROVIDE ANY FURTHER DETAILS ON THIS MATTER. *AK",
        "vin": "4A3AA46G5YE"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/2001",
        "dateOfIncident": "12/01/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743829,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2001",
        "dateOfIncident": "03/31/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884891,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING  ABOUT 45MPH ON  HIGHWAY AND WITHOUT PRIOR NOTICE SMOKE WAS INSIDE OF  VEHICLE.  HE MANAGED TO RUN OUT OF  VEHICLE AND IT WENT UP IN SMOKE.  FIRE DEPARTMENT WAS CALLED OUT.   VEHICLE HAS BEEN TOTALED.  *AK  *JB",
        "vin": "4A3AA46G0YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/27/2001",
        "dateOfIncident": "03/06/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884334,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE CALIPER CAUSING WHEELS TO LOCK UP INTERMITTENTLY.  VEHICLE BEEN TO AN INDEPENDENT REPAIR SHOP, AND  PROBLEM STILL OCCURRING. PLEASE PROVIDE ANY FURTHER DETAILS ON THIS MATTER. *AK",
        "vin": "4A3AA4CG5YE"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/26/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 881389,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE  TRAVELING DURNING RAIN AND WITHOUT ANY INDICATION  WINDSHIELD WIPERS /HIGH BEAMS/PARKING LIGHTS, AND FOG LAMPS FAILED.  DEALER HAS BEE NOTIFED. PLEASE PROVIDE FURTHER INFORMATION.  *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/15/2001",
        "dateOfIncident": "02/14/2001",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 880684,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INVOLVED IN A FRONTAL COLLISION WITH A COW. AT APPROXIMATELY 45-50 MPH IMPACT, BOTH AIR BAGS DID NOT DEPLOY. DEALER/MANUFACTURER NOTIFIED.  PLEASE FEEL FREE TO PROVIDE ANY FURTHER DETAILS ON THIS MATTER.  *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878118,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TRACTION LIGHT & ABS LIGHT WOULD COME ON & STAY.  ABS LIGHT FLASHED OFF/ON. WOULD SOMETIMES JUMP WHEN  ABS LIGHT & TRACTION LIGHT WERE ON AND THEN BRAKING.  *AK",
        "vin": "4A3AAA56L5Y"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/10/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877827,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOWS FOG UP EVEN WHEN  DEFROSTER IS ON.  DEALER HAS INSPECTED  VEHICLE.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2001",
        "dateOfIncident": "01/08/2001",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 877715,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS DRIVING DOWN ROAD WHEN  A FIRE IGNITIED IN  ENGINE. CONSUMER APPLIED BRAKES , BUT THEY WERE INOPERATIVE. HAD TO PULL EMERGENCY BRAKE WHICH CAUSED LOSS OF CONTROL ,VEHICLE SPUN AROUND BEFORE IT STOPPED. CONSUMER JUMPED OUT .  WIRING AND WHEEL COVERS, BASICALLY EVERTHING WAS MELTED.  *AK  THE CAUSE FOR THE FIRE COULD NOT BE FOUND.  HOWEVER, THE CONSUMER FIRMLY BELIEVES THAT SOMETHING WAS NOT INSTALLED CORRECTLY AT FACTORY THAT CAUSED THE FIVE MONTH OLD VEHICLE TO BURN.  *YH",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/09/2000",
        "dateOfIncident": "06/25/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 872555,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 00V225001/STEERING GEAR ASSEMBLY: WHILE COMING OFF FREEWAY RAMP, VEHICLE LOST TOTAL STEERING. DEALER NOTIFIED, AND REPAIRS WERE MADE UNDER WARRANTY.  RECALL NOTICE RECEIVED TWO DAYS AFTER  INCIDENT. PLEASE FEEL FREE TO PROVIDE ANY FURTHER DETAILS.  *AK",
        "vin": "4A3AA46G3YE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 555522,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER DOOR DOES NOT ALIGN AS THE PASSENGER DOOR DOES.   *SLC",
        "vin": "4A3AA46G5YE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730437,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END FEELS SHAKY AT HIGH SPEEDS, GOING OVER ROUGH ROADS AND BUMPS, & CHANGING LANES AT HIGH SPEED. VEHICLE ALSO TENDS TO PULL TO THE RIGHT WHILE DRIVING. I HAVE TAKEN THE CAR INTO THE DEALERSHIP ON TWO SEPARATE OCCASIONS THE FIRST TIME I WAS TOLD NOTHING WAS WRONG THE SECOND TIME THE CONTROL ARM BUSHINGS ON BOTH SIDES WERE REPLACED. THE PROBLEM PERSISTS AND I DO NOT FEEL SAFE DRIVING THIS VEHICLE . I NEVER RECEIVED ANY PAPERWORK REGARDING LEMON LAWS AT TIME OF PURCHASE NOR WAS IT MENTIONED. I NEED HELP.  *AK",
        "vin": "4A3AA46G8YE"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730437,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END FEELS SHAKY AT HIGH SPEEDS, GOING OVER ROUGH ROADS AND BUMPS, & CHANGING LANES AT HIGH SPEED. VEHICLE ALSO TENDS TO PULL TO THE RIGHT WHILE DRIVING. I HAVE TAKEN THE CAR INTO THE DEALERSHIP ON TWO SEPARATE OCCASIONS THE FIRST TIME I WAS TOLD NOTHING WAS WRONG THE SECOND TIME THE CONTROL ARM BUSHINGS ON BOTH SIDES WERE REPLACED. THE PROBLEM PERSISTS AND I DO NOT FEEL SAFE DRIVING THIS VEHICLE . I NEVER RECEIVED ANY PAPERWORK REGARDING LEMON LAWS AT TIME OF PURCHASE NOR WAS IT MENTIONED. I NEED HELP.  *AK",
        "vin": "4A3AA46G8YE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2000",
        "dateOfIncident": "08/14/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 728788,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR WAS LEAKING GASOLINE.  THE FUEL PUMP HOUSING SEAL HAD TO BE REPLACED.  IT TOOK TWO DAYS AND A PHONE CALL TO THE SERVICE MANAGER, TO GET MITSUBISHI TO FIND THE PROBLEM AND FIX IT.  I BELIEVED THE CAR TO BE UNSAFE.  IT WAS PARKED IN MY GARAGE, AFTER I FILLED THE TANK.  I WAS OUT OF TOWN FOR APPX. 24 HOURS, AND RETURNED TO FIND MY HOUSE FILLED WITH GASOLINE FUMES, WHICH TOOK OVER A DAY TO DISSIPATE.  I CALLED MITSUBISHI, AND HAD THE CAR TOWED IN.  THEY TOLD ME THEY'D NEVER HAD REPORTS OF THIS TYPE OF PROBLEM, BUT WHEN THEY ATTEMPTED TO GET THE PART TO FIX THE CAR - THE PART WAS ON NATIONAL BACK ORDER.",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2000",
        "dateOfIncident": "07/11/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 865762,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN IS NOT WORKING. THERE IS NO DAMAGE TO VEHICLE THAT WOULD HAVE CAUSED IT.  DEALER IS NOT ASSISTING.*AK",
        "vin": "4A3AA46G9YE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/26/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 552817,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER BELIEVES VEHICLE CAME WITH FABRIC DEFECTS.ET.",
        "vin": "4A3AA46G7YE"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/27/2000",
        "dateOfIncident": "03/18/2000",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 859263,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S SISTER WAS DRIVING ABOUT 30 MPH.  WHILE APPROACHING A CURVE TRIED TO TURN,  BUT STEERING LOCKED UP, LOST CONTROL AND DROVE STRAIGHT INTO  A WALL. UPON IMPACT, AIR BAGS DID NOT DEPLOY.  *AK",
        "vin": "4A3AA3669YE"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2000",
        "dateOfIncident": "01/10/2000",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 855050,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT APPROXIMATELY. 50 MPH DRIVER NOTICED SMOKE COMING FROM UNDERNEATH THE HOOD,.ATTEMPTED TO PULL OVER, BUT BRAKES WERE INOPERATIVE. DRIVER HAD TO PUMP BRAKES IN ORDER TO SLOW DOWN AND STOP.DRIVER  GOT OUT OF VEHICLE AND NOTICED FLAMES COMING FROM UNDERNEATH VEHICLE,  BURNING GRASS SURROUNDING THE AREA, AND DESTROYING/ MELTING ALL WIRING, AND ALL OF FRONT END. VEHICLE WAS A TOTAL LOSS.  *AK",
        "vin": "4A3AA46G2YE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2000",
        "dateOfIncident": "01/10/2000",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900619,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, FRONT END OF VEHICLE CAUGHT ON FIRE, CONSUMER PULLED OFF THE ROAD AND VEHICLE WAS TOTALED BY FIRE, CLAIM 01-6147-740.   *SLC",
        "vin": "4A3AA46GZYE"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2000",
        "dateOfIncident": "01/10/2000",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900619,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, FRONT END OF VEHICLE CAUGHT ON FIRE, CONSUMER PULLED OFF THE ROAD AND VEHICLE WAS TOTALED BY FIRE, CLAIM 01-6147-740.   *SLC",
        "vin": "4A3AA46GZYE"
    }
]