[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "07/23/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353116,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING LONG DISTANCE THE CAR WILL JUST SHUT OFF AND THE BRAKES QUIT WORKING",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/20/2020",
        "dateOfIncident": "08/05/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11350523,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM ORIGINAL OWNER OF 2000 NISSAN SENTRA. MANIFOLD CATALYTIC FAILED SMOG CHECK. I TRIED TO PURCHASE PARTS WITH DEALER AND THEY TELL ME THAT THE PART IS NO LONGER AVAILABLE WITH THEM OR AFTERMARKET. I WANT TO HOLD THEM RESPONSABLE FOR NOT HAVING THE PARTS FOR MY VEHICLE.",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2018",
        "dateOfIncident": "12/15/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076586,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATORS: MY CAR LOST POWER AND WILL NOT SHIFT INTO OD I NEED TO KNOW IF THERE IS A RECALL ON IT OR WHATEVER IS WRONG WITH IT MY CAR IS A 2000 NISSAN SENTRA",
        "vin": ""
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/29/2017",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002382,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUT OF WHILE DRIVING AT 65 MPH. THE CAR RESTARTED AFTER 10 MINUTES DROVE ABOUT 2 MILES AND IT SHUT OF AGAIN. THIS TIME I CALLED A MECHANIC AND HAD THE CAR TOWED TO HIS SHOP. THE MECHANIC INDICATED THAT IT WAS A CRANKSHAFT AND CAMSHAFT SENSOR ISSUE.  I HAVE CHANGED ALL OTHER SENSORS ON CAR. I WAS TOLD THAT THERE WAS A RECALL ON THIS CAR. I CONTACTED NISSAN AT 1-800-647-7261 AND WAS TOLD THAT THERE WAS NOTHING THAT THEY COULD DO. PLEASE ADVISE!!!!",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/09/2015",
        "dateOfIncident": "04/07/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704801,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUT OF WHILE DRIVING AT 65 MPH.  LUCKY IT WAS LATE AT NIGHT AND I WAS ABLE TO COAST THE CAR TO THE SHOULDER.  THE CAR RESTARTED AFTER 10 MINUTES DROVE ABOUT 2 MILES AND IT SHUT OF AGAIN.  THIS TIME I CALLED MY FATHER AND HAD THE CAR TOWED HOME.  THE MECHANIC INDICATED THAT IT WAS A CRANKSHAFT AND CAMSHAFT SENSOR ISSUE.  *TR",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2015",
        "dateOfIncident": "02/13/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683416,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN SENTRA CRANKS BUT WILL NOT START. THE CAR WAS STARTING AND RUNNING  GOT BACK TO MY PLACE AND . ABOUT A HOUR OR TWO LATER HAD SOME THING TO DO .GOT IN THE CAR TRIED TO START THE CAR AND IT WOULD NOT START.MOTOR TURN OVER BUT WOULD NOT START.   *TR",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "EXTERIOR LIGHTING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617995,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA. THE CONTACT STATED THAT WHILE OPERATING THE VEHICLE WITH THE HEADLIGHTS ACTIVATED, THE HEADLIGHTS AND THE TURN SIGNAL LIGHTS FAILED TO ILLUMINATE. THE CONTACT ALSO STATED THAT WHILE REFUELING, THE VEHICLE FUEL WOULD SPILL OUT OF FROM THE FUEL NECK, ALTHOUGH THE FUEL TANK WAS NOT FULL. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/12/2014",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610090,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SITTING AT THE RED LIGHT WHEN A SUBURBAN WAS SPEEDING AND WASN'T PAYING ATTENTION. HE HIT ME FROM THE BACK WHICH CASED A 4 CAR WRECK. MY TRUNK WAS LITERALLY PUSHED TO MY FRONT SEAT. THE FRONT OF MY CAR WAS UNDER THE CAR IN FRONT OF ME. MY CAR WAS TOTALED. I HIT MY SHOULDER ON THE STEERING WHEEL ALONG WITH MY NECK AND SHOULDERS. THIS WRECK MADE ME DISABLED. THE AIR BAGS NEVER DEPLOYED. IT WAS A MAJOR ACCIDENT WASN'T MUCH LEFT OF THE CAR AND MY AIR BAGS NEVER CAME OUT. THE AIR BAGS MORE THAN LIKELY WOULD HAVE SAVED ME FROM THAT HORRIBLE IMPACT. I AM NOW DISABLED FOR LIFE AND MY DOCTOR MENTIONED THE AIR BAGS WOULD HAVE TAKING THE FORCE OF THE INJURIES.   *TR",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2014",
        "dateOfIncident": "03/01/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568323,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS ALWAYS HAD A SLIGHT IDLE ISSUE..... WHEN U START IT YOU HAVE TO PRESS THE GAS A BIT OR ELSE IT IMMEDIATELY DIES. ALSO SOMETIMES IF YOU COME TO A STOP THE IDLE JUMPS UP AND DOWN..... HASN'T EVER COMPLETELY DIED IN THOSE INCIDENTS. MY COMPLAINT IS ABOUT THE IGNITION COIL FUSE. A BIT OVER A WEEK AGO THE CAR WAS FINE ALL DAY AND THEN ALL OF A SUDDEN WOULDN'T START. IT ENDED UP BEING THE FUSE. WE REPLACED IT AND THE CAR WAS FINE FOR A WHILE. TODAY I GOT IN IT GO TO WORK AND IT WOULDN'T START. ONCE AGAIN IT WAS THE FUSE. WHILE AT WORK MY HUSBAND REPLACED IT AND IT BLEW AS SOON AS HE TURNED THE KEY TO START THE CAR. WHEN I GOT HOME I TRIED AGAIN..... SAME OUTCOME. I'VE YET TO TALK TO A MECHANIC TO FIND OUT THE PROBLEM BUT IT SEEMS LIKE THERE'S SEVERAL COMPLAINTS OF THIS EXACT PROBLEM WITH MY MAKE AND MODEL OF CAR. I'D LIKE TO RESOLVE ASAP BUT I DON'T WANT TO PUT MONEY INTO A CAR THAT MAY HAVE SOME PROBLEMS EVEN AFTER THIS. I'D LIKE TO KNOW IF I FALL UNDER THE RECALL?  *TR",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2013",
        "dateOfIncident": "06/22/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522494,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THE CAR USED ON 6-22-13. THE GAUGES ON MY DASHBOARD STOPPED WORKING INTERMITTENTLY - I WILL BE DRIVING AND THERE IS NO SPEEDOMETER, ODOMETER, TACHOMETER, GAS GAUGE OR TEMPERATURE GAUGE. THEY ALL STOP WORKING TOGETHER FOR VARIOUS LENGTHS OF TIME, AND THEN JUST \"CLICK\" ON AGAIN. THE GAUGES SEEM TO BE STUCK IN PLACE ON THE GAS METER BUT THE SPEEDOMETER WOULD JUST FALL TO THE CORNER (LEFT OR RIGHT DEPENDING ON THE ANGLE IT IS ON WHEN IT STOPS WORKING.  THE TACHOMETER SOMETIMES FALLS IN THE CORNER AN OTHER TIMES IT JUST FREEZES WHEN IT STOPS WORKING.  THE TEMPERATURE GAUGES DOES THE SAME AS THE TACHOMETER. I DO NOT KNOW WHAT MAKES IT STOP OR COMES BACK ON.  THE ODOMETER DISAPPEARS WHEN IT GOES OUT AND REAPPEARS WHEN IT COMES BACK ON BUT DOES SEEM TO MAINTAIN THE MILEAGE WHEN SHOWING OR NOT.    LET ME KNOW IF THERE WAS A RECALL ON THE CAR OR NISSAN RESPONSIBLE TO REPAIR THE ISSUE.  THE LOCAL DEALER SAID THEY DO NOT MAKE THE PART ANYMORE TO FIX THE POSSIBLE ISSUES.  *TR",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2013",
        "dateOfIncident": "01/22/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495031,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA. THE CONTACT STATED THAT THE ENGINE LIGHT ILLUMINATED THEN THE VEHICLE JERKED AND STALLED. THE CONTACT ALSO STATED THAT THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTICS. THE TECHNICIAN STATED THAT THE ENGINE OXYGEN SENSOR HAD FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 55,000.",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2012",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479621,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA. THE CONTACT STATED THAT WHILE ACCELERATING FROM A TRAFFIC STOP, THE VEHICLE LOST POWER AS THE CHECK ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT WAS INFORMED OF A RECALL FOR THE FAILURE UNDER NHTSA CAMPAIGN ID NUMBER: 03V477000 (ELECTRICAL SYSTEM:IGNITION:MODULE) HOWEVER, THE DEALER INFORMED HIM THAT THE VIN WAS NOT INCLUDED IN THE RECALL. THE MANUFACTURER WAS NOTIFIED BUT OFFERED NO ASSISTANCE. THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 165,000.",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2012",
        "dateOfIncident": "10/15/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450047,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA . THE CONTACT STATED THAT WHILE DRIVING 10 MPH, THE VEHICLE STALLED WITH THE ILLUMINATION OF THE CHECK ENGINE WARNING LIGHT.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE TECHNICIANS WERE UNABLE TO DIAGNOSE THE FAILURE. THE CONTACT STATED THAT THE VEHICLE WAS EXPERIENCING THE SAME SYMPTOMS AS THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 03V477000 (ELECTRICAL SYSTEM:IGNITION:MODULE). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 117,000 AND THE CURRENT MILEAGE WAS 128,000.",
        "vin": "3N1BB51DXYL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/26/2012",
        "dateOfIncident": "01/23/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10445534,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON A FOUR LANE PUBLIC HIGHWAY AND WAS BOXED INTO THE FAR RIGHT LANE AS I WAS ATTEMPTING TO SWITCH LANES TO AVOID TRAFFIC. ANOTHER CAR SPED UP AND BOXED ME INTO THE RIGHT LANE. I SLAMMED ON THE BRAKES AND DECREASED MY SPEED FROM 45 MPH TO APPROXIMATELY 20-30 MPH. I CRASHED INTO A COMPLETELY STOPPED JEEP CHEROKEE. MY NISSAN SUSTAINED HEAVY FRONTAL DAMAGE AND WOULD LATER BE TOTALED. THE AIRBAGS FAILED TO DEPLOY. THE CAR I RAN INTO WAS A JEEP SO THE BUMPER RAN THROUGH MY ENGINE AND UPWARD. HAD I BEEN GOING FASTER THIS ACTION WOULD HAVE CONTINUED THROUGH THE WINDSHIELD. THE ONLY THING THAT SAVED MYSELF FROM INJURY WAS THE FACT THAT I WAS WEARING MY SEATBELT. I SUSTAINED THE TYPICAL WHIPLASH AND SORE BACK BUT THANKFULLY WASN'T SEVERELY INJURED IN THE CRASH. I HAVE PICTURES OF THE SEVERITY OF THE IMPACT AS WELL AS TESTIMONY FROM A LOCAL OFFICER WHO INSPECTED THE CRASH THAT THE AIRBAGS NEVER DEPLOYED.  *TR",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/03/2011",
        "dateOfIncident": "11/07/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438449,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE \"JERKS\" WHEN UNDER LOAD & THROTTLE IS APPLIED.  REPLACED 4 IGNITION COILS, & THROTTLE POSITION SENSOR.  NO CHANGE IN VEHICLE'S PERFORMANCE.  VEHICLE WILL ALSO NOT ACCELERATE OVER 3000 RPM'S.  MECHANIC SAID I NEEDED TO CONTACT NISSAN REGARDING APPLICABLE SAFETY RECALL THAT WAS LIKELY THE PROBLEM, WHICH I DID.  NISSAN SAID THERE WAS NO SAFETY RECALLS APPLICABLE TO MY VEHICLE.  I TOLD MECHANIC THIS, & HE INSISTS THAT THERE MOST CERTAINLY IS.  *TR",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/16/2011",
        "dateOfIncident": "05/12/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436063,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA. THE CONTACT STATED THAT THE VEHICLE FAILED TO START. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THEY ADVISED HIM THAT THEY WOULD REPAIR THE VEHICLE UNDER NHTSA CAMPAIGN ID NUMBER: 03V477000 (ELECTRICAL SYSTEM:IGNITION:MODULE). THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED A FEW MONTHS LATER. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHERE THEY ADVISED HIM THAT THE RECALL WAS NEVER PERFORMED AND THAT HE HAD EXCEEDED THE MILEAGE THAT WAS ASSOCIATED WITH THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 147,000.",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2011",
        "dateOfIncident": "07/05/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411554,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA. THE CONTACT STATED THAT WHILE DRIVING 70 MPH THE VEHICLE STALLED. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD BEFORE BEING TOWED HOME. THE MANUFACTURER WAS NOTIFIED, AND THE CONTACT WAS INFORMED THAT THE VEHICLE WAS INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 03V477000 (ELECTRICAL SYSTEM:IGNITION:MODULE). THE VEHICLE WAS THEN TAKEN TO AN AUTHORIZED DEALER WHERE THEY REFUSED TO REPAIR THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE SITUATION, AND THE CONTACT WAS AWAITING A RESPONSE. THE FAILURE MILEAGE WAS 100,150.",
        "vin": "3N1CB51D91L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/27/2010",
        "dateOfIncident": "08/27/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362682,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA.  THE CONTACT WAS DRIVING APPROXIMATELY 20 MPH WHEN SHE APPLIED PRESSURE TO THE BRAKE PEDAL AND THE VEHICLE STALLED.  THE CONTACT WAS ABLE TO RESTART THE VEHICLE AS IT RESUMED NORMAL OPERATION.  THE FAILURE BEGAN TO RECUR INTERMITTENTLY SO THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS INFORMED THAT THE CAM POSITION SENSOR WOULD NEED TO BE REPLACED.  THE MANUFACTURER WAS NOTIFIED AND THE CONTACT WAS INFORMED THAT HER VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER: 03V455000 (ENGINE AND ENGINE COOLING).  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND CURRENT MILEAGE WAS 90,000.",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2010",
        "dateOfIncident": "10/22/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362080,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 NISSAN SENTRA COMPLETELY STALLED WHILE DRIVING ON A SURFACE STREET. FIRST THE RADIO CUT OUT AND THE \"AIR BAG\" LIGHT CAME ON. WHEN THE CAR STARTED TO SHAKE A BIT, I NOTICED A BURNT PLASTIC SMELL AND ATTEMPTED TO PULL OVER TO A SIDE STREET AND THAT'S WHEN THE CAR LOST ALL POWER--HEADLIGHTS, DASHBOARD, ENGINE, NOT EVEN THE HAZARDS WORKED. I GENTLY TRIED TO ACCELERATE FORWARD AND THE CAR WENT INTO REVERSE INSTEAD, SO I PUT THE CAR IN PARK AND CALLED TRIPLE A. THEY TOWED MY CAR TO MY REGULAR MECHANIC, WHO WAS CLOSED AT THE TIME, AND THE NEXT MORNING HE WAS ABLE TO START THE CAR RIGHT UP AND HAS NOT BEEN ABLE TO LOCATE ANY PROBLEM SO FAR.  THIS IS NOT THE FIRST TIME THE CAR HAS STALLED. IN 2007, I HAD THE CAR STALL ON ME A NUMBER OF TIMES (ONCE ON THE FREEWAY) BEFORE MY MECHANIC REPLACED THE MASS AIRFLOW SENSOR. IN 2009, THE CAR STARTED IDLING ROUGHLY BEFORE STALLING AND THAT PROBLEM WAS TRACED TO A FAULTY EGR CONTROL VALVE CIRCUIT. *TR",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/31/2010",
        "dateOfIncident": "08/26/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352955,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN SENTRA. THE CONTACT STATED WHEN DRIVING 25 MPH AND UP OR APPLYING THE BRAKES, THE VEHICLE WOULD SPORADICALLY STALL WITH THE ILLUMINATION OF THE BRAKE WARNING LIGHT. THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 03V455000 (ENGINE AND ENGINE COOLING) BUT THE FAILURE RECURRED FOLLOWING RECALL REPAIRS. THE DEALER ADVISED HAVING A DIAGNOSTIC PERFORMED ON THE VEHICLE AT THE CONTACT'S EXPENSE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE WAS REPORTED TO THE MANUFACTURER BUT NO ASSISTANCE WAS OFFERED. THE FAILURE MILEAGE WAS 150,000.",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "07/29/2010",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347193,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A 2000 NISSAN SENTRA GXE, WITH 83245 MILES ON THE ODOMETER.  THERE WERE NO ISSUES WITH CAR AND IT HAD ALWAYS BEEN REGULARLY SERVICED.  ON JULY 29, 2010 AFTER A NORMAL DAY'S ACTIVITIES WHICH INVOLVED DRIVING TO AND FROM WORK AND A SHORT TRIP WITHIN TOWN TO AND FROM THE LOCAL SWIMMING POOL, IT WAS AS USUAL PARKED IN THE DRIVEWAY OF OUR HOME AT 8PM.  WE LOCKED THE CAR AND WENT INTO THE HOUSE AND WERE SITTING DOWN TO DINNER WHEN AT 8:20PM WE NOTICED A LARGE PLUME OF SMOKE DRIFT BY THE DINING ROOM WINDOW.  WHEN WE WENT OUT TO INVESTIGATE WE SAW THICK BILLOWING SMOKE BLOWING OUT OF THE HOOD OF THE CAR.  WE COULD ALSO SEE FLAMES UNDER THE HOOD. THE ENGINE WAS ON FIRE.  WE DIALED 911 AND THE FIRE TRUCKS ROLLED IN.  THE FIREMEN HAD DIFFICULTY OPENING THE HOOD BECAUSE THE HEAT HAD FUSED THE HOOD TO THE BODY AND THEY HAD TO PUNCH HOLES IN THE SIDE AND USE CROWBARS TO PRY THE HOOD OPEN.  AFTER A BRIEF DOUSING WITH FIRE RETARDANT FOAM, THE FIREMEN PUT OUT THE FLAMES WITHIN A FEW MINUTES.  ONCE THE FLAMES WERE PUT OUT WE COULD SEE THAT THE ENTIRE ENGINE COMPARTMENT WAS A MASS OF BURNED PLASTIC AND RUBBER AND CHARRED AND TWISTED METAL.  THE INSURANCE COMPANY HAS DECLARED THE CAR TO BE A TOTAL LOSS.  THANKFULLY NOBODY WAS INJURED AND OUR HOME WAS NOT DAMAGED.  WE ARE SHOCKED AND DISMAYED THAT A SUPPOSEDLY RELIABLE COMPACT CAR COULD WITHOUT ANY APPARENT REASON BURST INTO FLAMES AND DIE LIKE THIS ONE DID. *TR",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/27/2010",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340255,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CHECK STICK BROKEN INTO ENGINE. 2000 NISSAN SENTRA. CALLED THE DEALER SAID IS COMMON PROBLEM. NOTHING DONE. HAVE TO BUY NEW STICK. *TR",
        "vin": "3N1CB51D2YL"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/07/2010",
        "dateOfIncident": "07/10/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334950,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 NISSAN SENTRA AND TWICE NOW THE \"PLASTIC DIP STICK HANDLE\" HAS BROKEN OFF WHEN A MECHANIC PULLED IT OUT TO CHANGE THE OIL... THEY COULDN'T GET IT OUT AND I HAD TO TAKE IT TO THE DEALER... WHO CHARGES AN OUTRAGEOUS PRICE TO GET IT OUT AND REPLACE IT WITH ANOTHER PLASTIC HANDLED DIP STICK THAT BROKE, AGAIN...... WHO IN THEIR RIGHT MIND PUT A PLASTIC HANDLE ON A METAL DIP STICK?  HOW STUPID.  THE ENGINE HEATS UP AND COOLS AND PLASTIC UNDER THOSE CONDITIONS WILL BECOME BRITTLE..  I'D RATHER USE A POT HOLDER TO PULL OUT A UNIFORM \"METAL\" HANDLE PART OF A SOLID METAL STICK THAN HAVE IT BREAK ALL THE TIME WITH A PLASTIC HANDLE.  JUST LIKE THAT BP OIL SPILL... ENGINEERS COMPLICATE THINGS WHEN THE SOLUTION IS SO SIMPLE ....  PLEASE, HAVE NISSAN RECALL THIS STUPID PLASTIC HANDLED DIP STICK AND REPLACE IT WITH AN ALL METAL ONE,.... I'LL SUPPLY THE POT HOLDER OR RAG TO PULL OUT THE HOT DIP STICK MADE OF METAL....  THANK YOU! *TR",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/14/2010",
        "dateOfIncident": "09/10/1993",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319510,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A SERIOUS COMPLAINT ABOUT FRAUDULENT AUTO RENTAL SERVICES AT THE FOLLOWING   LOCATIONS, DATES, TRANSACTIONS INFORMATION.  EXTREMELY POOR, UNSATISFACTORY SERVICES WERE RENDERED :     (1)YEAR  :                 2000  (DALLAS, TEXAS) PD REPORT FILED   THRIFTY AUTO RENTAL    (866) 957 0058, (800) 367 8277  (A)3838 NORTHBOUND SERVICE ROAD, FORT WORTH,TEXAS   (B)DFW AIRPORT, 75261(972) 929 6300  (C)AUTO : DODGE INTREPID; COLOR ' GOLD  (D)IN ASSOCIATION WITH FORMER HULEN MALL LOCATION  (E)RESULT : AUTO THEFT           (2)      YEAR  :                  2000  (SAN ANTONIO, TEXAS) PD REPORT FILED         NATIONAL RENT A CAR      (888) 868 ' 6203        8530 EASTERN AVENUE, SAN ANTONIO, TEXAS 78216; (210) 824 1841        WHITE PONTIAC SUNBIRD         RESULT : AUTO THEFT           (3)        YEAR     :             BETWEEN  07 ' 12/ 1993          MONTGOMERY WARD AUTO RENTAL; FORMER WINDSOR PARK MALL LOCATION         OF SAN ANTONIO, TEXAS. SHARPSTOWN MALL, HOUSTON, TEXAS LOCATION          THRIFTY AFFILIATE (?)          FILED HOUSTON PD POLICE REPORT          RED NISSAN SENTRA          RESULT : AUTO, CAR JACKING THEFT INCIDENT     AGAIN, THIS IS A QUALITY OF SERVICE COMPLAINT. THESE LOCATIONS OF BUSINESS LIKELY HAVE   PROVIDED DISCRIMINATORY SERVICES, TRANSACTIONS TO NUMEROUS OTHER CONSUMERS.  PLEASE INVESTIGATE TO JUSTIFY THESE STATEMENTS. I SEEK MONETARY   COMPENSATION DAMAGES FOR ALL OF THESE FRAUDULENT TRANSACTIONS.  ANY CREDIT RATING DAMAGES SHOULD BE COMPENSATED FOR, IN ORDER  TO RESTORE FAIR, TO GOOD RATINGS.  ANY VICTIMIZATIONS OF CRIME PROCESSES, COMPLAINTS ARE APPLICABLE. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/18/2009",
        "dateOfIncident": "07/10/2009",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288873,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 NISSAN SENTRY  IT OVER HEAT ON ME SOMETIMES WHEN DRIVING ON THE HIGH WAY IT CUTS OFF AND CAUSE BUMPER TO BUMPER HITS. *TR",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/21/2009",
        "dateOfIncident": "06/27/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284776,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GPS2",
                "productYear": "9999",
                "size": "185/65R14",
                "type": "Tire"
            }
        ],
        "summary": "ON 12-22-07 I PURCHASED 4 BRAND NEW GOODYEAR 45,000 MILE TIRES. A YEAR AND A HALF LATER, AFTER PUTTING APPROXIMATELY 25,000 MILES ON THE TIRES, I BEGAN HAVING PROBLEMS. ON 6-27-09, MY FRONT DRIVERS SIDE TIRE BLEW OUT. ON 7-20-09, MY REAR DRIVERS SIDE TIRE BLEW OUT. ON 7-31-09, MY REAR PASSENGER SIDE TIRE BLEW OUT. AS I RARELY DRIVE MY VEHICLE, ALL 3 OF THESE BLOWOUTS WERE NOT ONLY WITHIN A MONTH'S TIME, BUT HAPPENED WITHIN 1000 MILES.   I DID NOT KEEP THE FIRST 2 DAMAGED TIRES BECAUSE I THOUGHT IT WAS JUST A RUN OF BAD LUCK. HOWEVER, AS SOON AS THE THIRD TIRE BLEW OUT, I KNEW THERE WAS A PROBLEM SO I SAVED NOT ONLY THE THIRD BLOWN TIRE, BUT ALSO THE ONE \"GOOD\" TIRE THAT HADN'T EXPLODED YET.   **ON YOUR FORMS I CANNOT FIND MY EXACT TIRES. THEY ARE GOODYEAR GPS3 SPORT, 1857014. *TR",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/16/2009",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAUGES ON MY DASHBOARD STOPPED WORKING INTERMITTENTLY - I WILL BE DRIVING AND THERE IS NO SPEEDOMETER, ODOMETER, TACHOMETER, GAS GAUGE OR TEMPERATURE GAUGE.  THEY ALL STOP WORKING TOGETHER FOR VARIOUS LENGTHS OF TIME, AND THEN JUST \"CLICK\" ON AGAIN. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/04/2009",
        "dateOfIncident": "05/04/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267645,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN SENTRA.  THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER 03V455000 (ENGINE AND ENGINE COOLING).  HE STATED THAT THE CHECK ENGINE LIGHT ILLUMINATES ON THE INSTRUMENT PANEL.  THE VEHICLE STALLS AND FAILS TO RESTART.  THE VEHICLE WAS PREVIOUSLY REPAIRED ACCORDING TO NISSAN RECALL NUMBER R3022, IN WHICH THE DEALER REPLACED THE CRANK POSITION SENSORS.  THERE IS A SECOND RECALL THAT STATES THAT THE REPLACEMENT SENSORS USED IN THE FIRST RECALL CAMPAIGN WERE ALSO DEFECTIVE AND SHOULD BE CHANGED.  THE NISSAN MANUFACTURER STATED THAT HIS VIN WAS NOT AFFECTED AND NOT INCLUDED IN THE SECOND RECALL.  HE WAS ADVISED TO BRING HIS VEHICLE IN FOR DIAGNOSTIC TESTING AT HIS EXPENSE.  THE FAILURE MILEAGE WAS 130,000.",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/10/2008",
        "dateOfIncident": "06/05/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233827,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN SENTRA.  WHILE DRIVING APPROXIMATELY 23 MPH OR GREATER, THE CONTACT HEARD A LOUD GRINDING  NOISE COMING FROM THE FRONT END OF THE VEHICLE.  THERE WERE NO WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THEY STATED THAT THE FAILURE WAS RELATED TO THE ATTACHMENT BOLTS FROM THE FRONT SUSPENSION.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CONTACT WAS DISPLEASED TO KNOW THAT THERE WAS A RECALL, IN WHICH HIS VIN WAS EXCLUDED.  HE EXPERIENCED THE SAME FAILURE THAT WAS MENTIONED IN THE RECALL.  THE RECALL NUMBER WAS 01V174000.  THE FAILURE MILEAGE WAS 50,000 AND CURRENT MILEAGE WAS 60,000.  UPDATED 07/31/08. *LJ  UPDATED 08/05/08. *JB",
        "vin": "3N1CB51D2YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/31/2008",
        "dateOfIncident": "04/28/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229394,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOP PIECE OF MY DIPSTICK SHATTERED, LEAVING THE REST OF MY DIPSTICK INSIDE OF MY CAR. THE MORE I ATTEMPT TO PULL IT OUT, THE CLOSER IT COMES TO MY CRANKSHAFT. THIS IS DEFINITELY NOT SAFE!!  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "02/20/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218818,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN SENTRA- MANY CONSUMERS WITH 2000/2001 SENTRAS COMPLAINING ABOUT SIMILAR PROBLEMS. CAR STALLING- SHUTTING OFF WHEN CAR IS SLOWING DOWN. RPM IS AT 4000 AND DROPS TO 0 IMMEDIATELY AND CAR SHUTS OFF.  SO FAR, WE\\'VE BEEN VERY LUCKY WHEN THIS HAPPENS, WE\\'VE BEEN ABLE TO PULL OVER TO THE SIDE (CAR IS BASICALLY OPERATING IN NEUTRAL AT THIS POINT).   WE HAVE TO SHUT OFF THE CAR AND TURN ON THE IGNITION AGAIN. WE HAD AN EXTENDED WARRANTY BUT NISSAN COULD NEVER FIND ANYTHING WRONG BECAUSE THEY SAID THEIR COMPUTERS COULD NOT FIND THE PROBLEM AND COULD NOT REPLICATE THE PROBLEM.  THEY CHARGED US THE LABOR CHARGE ANYWAY EVEN THOUGH THEY COULD NEVER FIND ANYTHING. NOW THE WARRANTY IS OVER AND MY PERSONAL MECHANIC JUST FOUND OUT THE PROBLEM AFTER EXPERIENCING THE SAME WITH ANOTHER NISSAN OWNER.  IT IS THE IDLE CONTROL VALVE WHICH NEEDS THE COMPUTER TO BE CHANGED AS WELL IN ORDER TO WORK.  THIS WILL COST THOUSANDS OF DOLLARS WHICH SHOULD HAVE BEEN COVERED BY NISSAN SINCE IT WAS A FACTORY DEFECT BUT THEY WON\\'T BECAUSE WE DON\\'T HAVE WARRANTY ANYMORE.  WE CANNOT IN GOOD CONSCIENCE SELL THE CAR TO SOMEONE ELSE BECAUSE DRIVING THESE CARS IS REALLY DANGEROUS. IF YOU READ THE FORUMS, THERE ARE MANY NISSAN SENTRA OWNERS IN THE SAME BOAT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/29/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217157,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN SENTRA  WITH MULTIPLE PROBLEMS. CONSUMER STATES THAT SHE WOULD LIKE COMPENSATION FOR ALL THE MONEY SHE HAS HAD TO PUT OUT FOR REPAIRS. SUCH AS NEW AF METER, REPLACED MASS AIR FLOW, REPLACED BATTERY, REPLACED CLUTCH TWICE DUE TO AN OIL LEAK/FLYWHEEL AND MORE.  *KB  THE CONSUMER STATED THE ENTIRE ELECTRICAL SYSTEM FAILED, A NEW TRUNK LOCK WAS NEEDED, THE REAR ENGINE SEAL WAS LEAKING OIL ON THE CLUTCH. THE ENGINE LIGHT ILLUMINATED AND THE DRIVERS SIDE WINDOW WAS INOPERATIVE. THE REGULATOR AND RADIATOR WERE REPLACED. *JB",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/11/2008",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10214536,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN SENTRA.  WHILE DRIVING 30 MPH, THE CONTACT WAS INVOLVED IN A HEAD ON CRASH.  THE AIR BAGS FAILED TO DEPLOY.  THE CONTACT SUSTAINED INJURIES TO THE NECK, ARMS, AND FINGERS.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS DESTROYED.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 36,000.",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/12/2007",
        "dateOfIncident": "06/01/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208698,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GAUGES WORK INTERMITTENTLY, GAS, SPEEDOMETER, TACHOMETER. EVER SINCE I BOUGHT BRAND NEW IN 2000. DEALER COULD NEVER DUPLICATE PROBLEM SINCE INTERMITTENT ELECTRICAL PROBLEM. STILL OPERATES INTERMITTENTLY.  *TR",
        "vin": "3N1BB51D2YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/30/2007",
        "dateOfIncident": "08/22/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201206,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN SENTRA ENGINE OIL DIPSTICK BROKE OFF.  THE DIPSTICK IS STILL IN THE TUBE.",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196607,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN SENTRA.  THE CONTACT STATED THAT THE HORN STOPPED OPERATING.  THE DEALER STATED THAT THE WIRES FOR THE HORN WERE CORRODED AND REPLACED THE WIRES.  THE CURRENT MILEAGE IS 54,000 AND FAILURE MILEAGE WAS 53,800.  UPDATED 10/11/07. *JB",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/08/2007",
        "dateOfIncident": "01/29/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181949,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL FOR CRANK POSITION SENSOR FOR NHTSA CAMPAIGN ID NUMBER: 01V35700 RECALL DATE: 11/16/01 FOR 2000 NISSAN SENTRA. THE SENSOR WAS REPLACED BY NISSAN IN 2003.  IN JANUARY 2007, THE CAR STARTED EXPERIENCE SAME PROBLEM DURING THE RECALL DATE. THE CAR STOPS RUNNING A LOT OF TIME AND THE SERVICE ENGINE SOON CAME ON SEVERAL TIMES. MY WIFE WAS VERY NERVOUS AND SCARED DRIVING THAT CAR. ON JANUARY 22ND, THE CAR WAS TAKEN TO THE DEALER TO REPORT THE PROBLEM. THEY STATED THAT THE RECALL IS NO LONGER BEING REPLACED. THEY INSPECTED THE CAR AND ORDERED ECM TO SEE IF THE FIXES THE PROBLEM WITH THE CAR. ON JANUARY 29TH, THE PART WAS REPLACED AND THE PROBLEM WAS STILL THERE.  THE SERVICE ADVISOR FOR BILL SEIDLE'S NISSAN IN MIAMI (10500 NW 12TH STREET) JORGE VILLAR STATED THE PROBLEM COULD BE A CRACK SHAFT OR MASS AIR. THEY SAID TO COME BACK WHEN I AM READY FOR THEM TO GET TO THE ROOT PROBLEM. ON FEBRUARY 6TH, I TOOK THE CAR TO PRECISION TUNE AUTO CARE AND INFORM THEM THAT THE CAR STOPS RUNNING WHEN IT WAS RUNNING. I WANT THEM TO SEE WHAT THE PROBLEM WAS. LATER THAT DAY THEY STATED THE PROBLEM WITH THE CAR IS THAT IT HAS A DEFECTIVE CRANK POSITION SENSOR. I CALLED BILL SEIDLE NISSAN EXPLAINING THAT THE PARTICULAR RECALL BACK IN NOV 2001 IS HAPPENING AGAIN AND I WANT THEM TO CHANGE TO PART OUT AGAIN. I WAS TOLD THAT THE PART IS OUT OF WARRANTY AND THEY ARE NOT GOING TO REPLACE IT. I HAD NO CHOICE BUT TO HAVE PRECISION AUTO CARE FIX THE PART AND AT COST OF $150.00.  NISSAN DEALER WAS TRYING TO FIND A WAY TO CHARGE ME MORE AND FIX PART THAT WASN'T NEED. THE WHOLE TIME THEY NEED THAT IT WAS A SENSOR THAT WAS CAUSING THE PROBLEM.  *NM",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/02/2006",
        "dateOfIncident": "06/26/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174982,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 1.8 ENGINE IN A SENTRA , DRIVEN NEW FROM VICTORY NISSAN (VN) IN CHESAPEAKE VA, CHECK ENGINE LIGHT KEPT COMING ON AFTER ALL THE RECALLS WERE COMPLETED AND RETURNED TO V. NISSAN (VN). $600.00 LATER AND LIGHT COMING ON 3 TIMES IN SEPARATE TRIPS TO (VN) WHILE TRYING DIAGNOSE THE PROBLEM I WAS CHARGED $600.00 AND I HAD NOW REACHED 67,000 MILES WITH MY WARRANTY EXPIRED AND LIGHT STILL ON AND OFF, THIS TIME IT WAS DIAGNOSED AS AN INTERNAL ANTIFREEZE LEAK INTO A CYLINDER, PLEASE NOTE $600.00 LATER AFTER BEING TOWED AT MY EXPENSE TWICE, NUMEROUS SENSOR'S AND EVEN THE COMPUTER IN THE CAR, (MY OLD COMPUTER WAS REINSTALLED BY (VN), (VN) WANTS TO MAKE ME A NEW BILL TO FIX THE ENGINE PROPERLY WITH THE MECHANIC EXPLAINING THAT THE ELECTRONIC DIAGNOSTIC TOOL WHICH COST $90 IS JUST A STARTING PLACE AND THEY FOLLOW THE CODES AND REPLACE THE CHEAPEST STUFF FIRST LIKE ALL MY SENSOR'S AT $200 A POP, EVEN THE ONES THAT WERE NOT BAD ACCORDING TO THE TEST, AND AFTER I QUESTIONED IT, I WAS TOLD WELL THE \"CERAMIC WAS CRACKED\" AND IT WAS NOW OR LATER!  IF IT WAS JUST A HEAD GASKET THAT BILL WAS GOING TO BE NOW $2,200 AND VICTORY NISSAN HAD THE NERVE TO TELL ME AFTER $2,200.00 THAT I STILL NEEDED TO HAVE THE HEAD SENT OUT TO BE PRESSURE CHECKED (OPTIONAL BUT REQUIRED) FOR AN ADDITIONAL $200 TO $300 AND WE CAN WORK OUT SOMETHING ABOUT MY $600.00!  I REPLACED THE ENTIRE ENGINE FOR $1234.00 AND HONDA IS CALLING MY NAME! CERTAINLY UNHAPPY WITH MY FIRST AN ONLY DEALING'S WITH NISSAN AND ESPECIALLY WITH VICTORY NISSAN. THEY INSISTED ON THE SAME MECHANIC WORKING ON THE CAR AND I HAD TO WAIT 7 HOURS IN THE WAITING ROOM ONCE AND NUMEROUS TIMES FOR 4 AND 5 HOURS IN ADDITION WHILE I WATCHED THE MECHANICS MOVE IN SLOW MOTION. BOTTOM LINE NEVER DEAL WITH VICTORY NISSAN!  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/02/2006",
        "dateOfIncident": "07/07/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169787,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS NEVER ONCE PASSED AN EMISSION TEST ON THE FIRST TRY. AS OF JULY 2004 THE SERVICE ENGINE SOON LIGHT CAME ON EVERY NOW AND THEN. I TOOK THE CAR FOR IT'S EMISSION TEST AND IT FAILED! THE ERROR CODE WAS P1491 (BYPASS VALVE/CUT VALVE). AFTER SPENDING $500, I THOUGHT THE CAR WAS FIXED. I TOOK THE CAR TO THE EMISSIONS FACILITY AND IT PASSED. I DROVE OUT OF THE PARKING LOT AND THE SERVICE ENGINE SOON LIGHT CAME BACK ON AND HAS STAYED ON CONSTANTLY SINCE THEN. NOW I'M A DUE FOR ANOTHER EMISSION TEST AND ONCE AGAIN IT FAILS! SAME ERROR CODE. CLEARLY THERE IS A DEFECT. SOMETHING MUST BE DONE TO RECTIFY THE SITUATION.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/14/2006",
        "dateOfIncident": "07/09/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162410,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS WHEN DRIVING. IT HAS ALSO CAME TO A LOW IDLE AND NEARLY DIED AT OTHER TIMES WHEN SLOWING TO A STOP.   THERE WERE NO SPECIFIC CONSEQUENCES TO THIS PROBLEM AS OF YET.  A MAINTENANCE SHOP BLEW OUT ALL AIRFLOW SENSORS AND REPLACED VACUUM HOSES.  THERE IS A CURRENT RECALL ON THE SAME YEAR MODEL OF THIS CAR, BUT NOT THE CORRECT VIN RANGE. THE DEALER WILL NOT REPLACE THIS ITEM AT NO COST.  *JB",
        "vin": "3N1CB51D2YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2006",
        "dateOfIncident": "09/15/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158983,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "3RD YEAR OF COLLEGE, NEEDED A DECENT CAR, PICKED 2000 NISSAN SENTRA. CAR WORKED GREAT AT FIRST, THEN LED TO HESITATION AND EVENTUALLY STALLING. I THOUGHT I FIXED THE PROBLEM, ORDERED A NEW THROTTLE POSITION CHAMBER (CAUSE I WAS TOLD THAT WAS THE PROBLEM) REPLACED THE PART, GOT A TUNE-UP, ONLY TO END UP WITH THE SAME PROBLEM. THE MIL ILLUMINATED. TOOK VEHICLE TO NISSAN DEALER FOR DIAGNOSTIC TESTING, AND THEY SAID IT STARTED FROM A SENSOR GONE BAD. I WAS NEVER NOTIFIED OF ANY OF THE RECALLS ON THIS VEHICLE, AND I THOUGHT I WAS SAFE BY FINANCING THE VEHICLE FROM THE DEALERSHIP. THE ESTIMATE FOR REPAIRS WAS OVER $2000 FROM THE DEALER. I NEEDED TO HAVE THE ENTIRE COMPUTER SYSTEM REPLACED BECAUSE THE BAD WIRING SHORTED EVERYTHING OUT. I COULD NOT AFFORD TO CONTINUE MAKING THE MONTHLY PAYMENTS AND PRICEY MAINTENANCE SO I LET HER GO..SADLY I HAVE A NISSAN ALTIMA NOW AND WAS DIRECTED TO THIS SITE SEARCHING FOR A RECALL A FAMILY MEMBER SAW ON THE NEWS TODAY ABOUT MY VEHICLE. THIS IS DEFINITELY MY LAST NISSAN!  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2006",
        "dateOfIncident": "04/01/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156393,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC WIRING OF 2000 SENTRA IS BAD AND DEFECTIVE, IT DISPLAYS INTERMITTENT PROBLEM, ALL THE DISPLAY METERS (SPEEDOMETER, FUEL GAUGE) WILL GO OF AND ON.  *JB",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/21/2006",
        "dateOfIncident": "03/17/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153372,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING AN INTERMITTENT PROBLEM WITH THE GAUGES IN MY 2000 NISSAN SENTRA GXE.  THEY RANDOMLY STOP WORKING UNTIL THE CAR IS CUT OFF FOR AWHILE.  SO IF I AM ON A LONG TRIP DOWN THE HIGHWAY AND MY GAUGES STOP WORKING, I CAN STOP AND PARK MY CAR FOR 30 MINUTES EVERY TEN OR TWENTY MILES OR I CAN DRIVE WITH OUT A SPEEDOMETER.  *JB",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2005",
        "dateOfIncident": "06/08/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139634,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE AND CHECK BRAKE LIGHTS CAME ON AND CHECK VEHICLE LIGHT, CAME ON AND STAYED ON . MY ALTERNATOR DISCHARGED AND MY CAR CUT OFF IN TRAFFIC, SEVERAL TIMES. I HAD TO REPLACE THE ALTERNATOR. I BELIEVE THIS ELECTRICAL PROBLEM CAUSED MY ALTERNATOR TO GO BAD. *JB",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "08/24/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135408,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED  ENGINE CONTROL MODULE  WAS BAD. IT MAD E THE ENGINE SHAKE AND THE CAR DID  NOT RUN. SHE SAID THE DEALER  HAD  CAR FOR 3 WEEKS, WHICH WAS WHEN SHE NOTICED THE PROBLEM.  THE CONTACT  INDICATED  THERE WAS A RECALL ON THE CONTROL MODULE,  BUT THIS  RECALL NUMBER WAS NOT AVAILABLE. SHE FOUND THE RECALL ON THE INTERNET. *AK",
        "vin": "3N1BB51D2YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/05/2005",
        "dateOfIncident": "07/27/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131759,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING OCCURRED THREE TIMES: WHILE DRIVING AT HIGHWAY SPEEDS, AND THEN STOPPING, AND THEN ACCELERATING SLOWLY, THE ENGINE SIMPLY CUT OUT AFTER THE RPM WAVERED BETWEEN 500-1100 FOR ABOUT A MINUTE. THE CAR COULD NOT BE RESTARTED AND TWO OUT OF THE THREE TIMES HAD TO BE TOWED. AFTER APPROXIMATELY ONE HOUR, THE CAR COULD BE STARTED AGAIN. ALL THREE DAYS WERE HOT DAYS. THE PROBLEM COULD NOT BE REPRODUCED AND A FULL INSPECTION OF THE CAR BY THREE MECHANICS REVEALED NO APPARENT PROBLEMS.  *NM",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/27/2005",
        "dateOfIncident": "07/27/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130291,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "EVER SINCE I'VE OWNED MY 2000 NISSAN SENTRA (OWNER SINCE APRIL 2003), I'VE NOTICED THAT THE CAR HESITATES WHEN THE ACCELERATOR PEDAL IS PRESSED. THIS CAUSES ME TO PRESS ON THE GAS HARDER MAKING MY CAR LURCH FORWARD. THIS MORNING I REAR ENDED SOMEONE AND WHILE THE NATURE OF THE COLLISION IS MY FAULT, I BELIEVE THERE WOULD BE FAR LESS DAMAGE TO MY CAR HAD IT NOT HESITATED DUE TO THE ACCELERATOR PEDAL GETTING STUCK.    MY SISTER ALSO OWNS A NISSAN SENTRA (2001 YEAR) SINCE JULY 2003 AND SHE HAS EXPERIENCED THE SAME PROBLEM WITH HER CAR HESITATING BECAUSE THE ACCELERATOR PEDAL GETS STUCK.    I LOOKED ON THE INTERNET AND THERE ARE SEVERAL OTHER PEOPLE WHO HAVE NOTICED THAT THEIR ACCELERATOR PEDAL GETS STUCK AS WELL.    HTTP://CONSUMERAFFAIRS.COM/AUTOMOTIVE/NISSAN_SENTRA.HTML    I CALLED NISSAN AND THEY SAID THAT IT'S BECAUSE I HAVE AN AUTOMATIC TRANSMISSION. HOWEVER, THIS IS NOT AN ACCEPTABLE JUSTIFICATION. JUST BECAUSE MY CAR IS AN AUTOMATIC, DOES NOT MEAN IT'S OKAY TO HAVE A STUCK ACCELERATOR ON MY CAR.",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "02/03/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10124780,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS HIT BY A TRACTOR TRAILER AND HER VEHICLE WAS DRAGGED 100 FEET AND THE AIR BAGS NEVER DEPLOYED.   *MR   THE CONSUMER STATED THAT PRIOR TO THE ACCIDENT, THE DEALER DISASSEMBLED THE DASH TO REPLACE A SENSOR WHICH WAS ON RECALL.  *SC *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/22/2005",
        "dateOfIncident": "04/20/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118266,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT BEGAN FLASHING.   VEHICLE WANTED TO STALL WHEN STOPPING.   NO POWER UPON ACCELERATION.    AIR FLOW METER AND #4 COIL WERE REPLACED.   CHECK ENGINE SOON LIGHT CAME BACK ON WITHIN 24 HOURS.   DEALER UNABLE TO PROVIDE ME WITH A COPY OF THE $90 DIAGNOSTIC TEST.    *JB",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2005",
        "dateOfIncident": "03/02/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115562,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RECALL CAMPAIGN  01V357000  CONCERNING CRANK POSITION SENSOR.  AFTER HAVING THE CRANK POSITION SENSOR REPLACED THE PROBLEM RECURRED.   WHILE DRIVING 40 MPH CHECK ENGINE LIGHT APPEARED ON THE DASHBOARD AND REMAINED ON.  VEHICLE WAS TAKEN BACK TO THE DEALER, AND CONSUMER WAS INFORMED THAT THE CRANK POSITION SENSOR NEEDED TO BE REPLACED AGAIN.  *AK    THE VEHICLE CIRCUIT CLUSTER FAILED CAUSING THE ODOMETER, FUEL GAUGE AND TEMP GAUGE TO FAIL.  THE ROTORS WARPED CAUSING PULSATION WHILE BRAKING.  *NM",
        "vin": "3N1CB51D2YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/13/2005",
        "dateOfIncident": "04/13/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10117842,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ANOTHER VEHICLE CROSSED INTO THE CONSUMER'S  LANE AND CRASHED HEAD ON WITH IT. UPON IMPACT, AIR BAGS FAILED TO DEPLOY.  DRIVER SUSTAINED HEAD INJURIES, AND REFUSED MEDICAL ATTENTION, BUT WENT TO THE HOSPITAL ON HIS OWN.  VEHICLE WAS TOWED AND TOTALED O BY THE INSURANCE COMPANY.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2005",
        "dateOfIncident": "12/20/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117762,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN SENTRA EXPERIENCING PROBLEMS WITH BRAKE EQUIPMENT, ENGINE SENSORS AND E.C.M. CONNECTOR.*MR  NHTSA RECALL CAMPAIGN  01V357000  CONCERNING CRANK POSITION SENSOR.  AFTER HAVING THE CRANK POSITION SENSOR REPLACED THE PROBLEM RECURRED.   WHILE DRIVING 40 MPH CHECK ENGINE LIGHT APPEARED ON THE DASHBOARD AND REMAINED ON.  VEHICLE WAS TAKEN BACK TO THE DEALER, AND CONSUMER WAS INFORMED THAT THE CRANK POSITION SENSOR NEEDED TO BE REPLACED AGAIN.  THE VEHICLE CIRCUIT CLUSTER FAILED CAUSING THE ODOMETER, FUEL GAUGE AND TEMP GAUGE TO FAIL.  THE ROTORS WARPED CAUSING PULSATION WHILE BRAKING  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/01/2005",
        "dateOfIncident": "10/28/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WHILE IDLING AT STOP SIGNS, RED LIGHTS AS WELL AS WHEN DRIVING AT SLOW SPEEDS (25 MPH).  *NM  THE VEHICLE WAS TAKEN TO THE DEALER AND THE CONSUMER WAS INFORMED THAT THE VEHICLE NEEDED A NEW ECM.  THE DEALER ALSO INFORMED THE CONSUMER THAT THERE WAS A NATIONWIDE BACKORDER ON THE PART.  *NM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/25/2005",
        "dateOfIncident": "02/25/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113095,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "FIRESTONE",
                "productModel": "FIREHAWK",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "A LOUD NOISE STARTED COMING FROM THE REAR OF THE VEHICLE. THE DRIVER PULL OVER AND NOTICED THAT THE RIGHT REAR SIDE TIRE HAD BLOWN.  AFTER CHANGING THE TIRE,THE DRIVER DROVE TO THE DEALER. THE MECHANIC  INFORMED THE DRIVER THAT THE CAUSED CAN NOT BE DETERMINED.  FIRESTONE FIRE HAWK  G2A02 P195/55R16.  PLEASE FILL IN ADDITIONAL INFORMATION ON #DOT NUMBER.  *NM",
        "vin": "PLEASE FIL "
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/16/2005",
        "dateOfIncident": "01/24/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108830,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER EXPERIENCED STALLING PROBLEMS WITH THE VEHICLE. WHEN DRIVING THE CONSUMER WENT TO APPLY THE BRAKE , THE VEHICLE STALLED WITHOUT WARNING. THIS HAPPENED 4 TIMES, WHEN THE BRAKES WERE APPLIED AT APPROXIMATELY 15 MPH.  THERE WAS NO WARNING.  THE CONSUMER TOOK THE VEHICLE TO THE DEALER AND WAS INFORMED THAT THE HEAD GASKET WAS BLOWN. THERE WAS A MIXTURE OF OIL AND COOLANT WHICH CAUSED THE VEHICLE TO LOSE POWER. PROVIDE FURTHER DETAILS.   *JB  THE DEALER REPLACED THE CRANK AND CAM SENSORS PER SAFETY RECALL CAMPAIGN D3163.  *TT",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/11/2005",
        "dateOfIncident": "02/04/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111397,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER IS EXPERIENCING A PROBLEM WITH THE CHECK ENGINE LIGHT. THE OWNER HAS TAKEN THE VEHICLE BACK TO THE DEALER AND THEY WOULD DO SOME ADJUSTMENTS AND THE LIGHT WOULD COME BACK ON SHORTLY AFTER. THE VEHICLE HAS BEEN ON THE DIAGNOSTIC MACHINE AND SEVERAL CODES WOULD COME TO INDICATE WHERE THE PROBLEMS ARE YET KNOW ONE SEEMS TO KNOW WHAT THE PROBLEMS ARE THAT EXIST WITHIN THIS VEHICLE.  PROVIDE FURTHER DETAILS.   *JB",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2005",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115539,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HAS NOT RECEIVED ANY TYPE OF NOTIFICATION FROM THE MANUFACTURER REGARDING ANY RECALLS ON HER 2000 NISSAN SENTRA.   *NM    *SC  *JB",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/15/2005",
        "dateOfIncident": "01/15/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106376,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LEFT WHEEL STUDS FAILING BECAUSE OF RUST.  HAD TO REPLACE 2 TODAY, HAD TO REPLACE THE FIRST 2 LAST YEAR.   *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/15/2004",
        "dateOfIncident": "11/20/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102992,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REF: NISSAN SENTRA GXE YEAR 2000, VIN# [XXX].  SINCE PURCHASE OF THIS USED CAR IN AUGUST 2003, OVER A PERIOD OF 8 MONTHS I HAVE HAD MANY PROBLEMS WITH \"CHECK ENGINE LIGHT\" COMING ON OFTEN AND RATTLING OF AXLE/SUSPENSION ON LEFT SIDE.  AFTER BRINGING TO DEALER FOR REPAIR UNDER WARRANTY AND EACH TIME THE PROBLEM COMES UP NEXT DAY OR 2 WEEKS LATER.  I HAVE HAD THE SPECIAL-ORDER FROM JAPAN ECM MODULE REPLACED 3 TIMES AFTER 3 MONTH WAIT EACH TIME.  I ALSO HAVE HAD FRONT WHEEL AXLE AND/OR SUSPENSION REPLACED 3 TIMES IN THE PAST YEAR. I HAVE HAD 2 OR MORE RECALLS PERFORMED ON THE CAR IN 2004. AS OF 12/14/04, THERE IS A PROBLEM OF POOR OR SLOW ENGINE PERFORMANCE AND RAGGEDNESS WHEN DRIVING. REFER TO NHTSA CAMPAIGN ID # 01V174000 AND 03V477000 AND 03V455000 FOR REFERENCES. I HAVE COPIES OF SERVICE RECORDS FOR THIS CAR IF YOU WOULD LIKE TO RECEIVE THEM.  PLEASE ADVISE.  [XXX]  EMAIL: [XXX].  *AK  UPDATED 07/24/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "09/10/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102958,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 NISSAN GXE.  THE HANDLE TO THE DIP STIP BROKE IN THE TECHNICIAN'S HAND LEAVING THE DIPSTICK IN THE \"TUBE\".  I HAVEN'T ASKED YET, BUT RECORDS SHOW THAT NISSAN WILL CHARGE UP TO $700 TO REMOVE THE BROKEN DIP STICK.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2004",
        "dateOfIncident": "09/10/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102446,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE IS EQUIPPED WITH CALIFORNIA EMISSION EXHAUST, AND THE PROBLEM IS THE FRONT BRACKET THAT SUSPENDS THE EXHAUST BETWEEN THE MANIFOLD AND THE REAR BRACKET HAD RUSTED AND FALLEN OFF.  THERE WAS NO PARTICULAR EVENT THAT CAUSED THIS TO HAPPEN AND WE LEARNED OF THE PROBLEM BE THE KNOCKING SOUND MADE BY THE EXHAUST PIPE HITTING A BAR ON THE BODY WHEN DRIVING OVER BUMPS AS SMALL AS 3 INCHES.  THE VEHICLE HAD BEEN DRIVEN  AROUND 24,000 MILES, AND THE QUOTE FOR A REPLACEMENT PART WAS $217 PLUS LABOR AND TAXES.   THERE ARE TO DATE NO AFTERMARKET ALTERNATIVES, AND THE WAY THE BRACKET IS ATTACHED TO THE EXHAUST IS AN INFERIOR DESIGN THAT WILL ENSURE PREMATURE FAILURE.*AK",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2004",
        "dateOfIncident": "09/15/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100577,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ON.  DEALER STATED BAD MASS AIR FLOW SENSOR DUE TO AFTER MARKET AIR FILTER.  STP FILTER(MANUFACTURER STATES FILTER MEETS OR EXCEEDS NISSAN SPECS.)  FIRST PRICE QUOTE FROM DEALER FOR REPAIR $800 PLUS. (MATRIX PRICING?) SECOND PRICE $565 (LIST PRICE ON PART,PLUS LABOR)  WHEN I QUESTIONED THE PRICING DIFFERENCE WITH NISSAN, THEY SAID DEALERS CAN CHARGE ANY PRICE THEY WANT FOR PARTS.  THEY DON'T HAVE TO FOLLOW LIST PRICING! SEEMS LIKE A POOR WAY TO TREAT CUSTOMERS.  I ENDED UP GETTING THE PART THROUGH A NISSAN DEALER IN ARIZONA FOR $365, INSTALLED IT IN FIVE MINUTES. JUDGING BY WHAT I HAVE BEEN READING, THIS IS A COMMON PROBLEM.  THE PROBLEM AROSE WITHIN DAYS OF THE DEALER REPLACING THE CRANK SENSOR DUE TO A RECALL.  THE VEHICLEIA A 2000 SENTRA GXE WITH 45,000 MILES ON IT.  PERHAPS NISSAN SHOULD HAVE A RECALL FOR THIS PROBLEM.*AK",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/22/2004",
        "dateOfIncident": "11/22/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101536,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE  DRIVING 50 MPH, THE VEHICLE STALLED WITHOUT WARNING.  THE CONSUMER TRIED TO RESTART THE VEHICLE AND WAS ABLE TO DO SO.   THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION. PLEASE PROVIDE FURTHER DETAILS. *JB",
        "vin": "2N1CB51D7YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/12/2004",
        "dateOfIncident": "10/10/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10095632,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SISTER'S CAR IS A 2000 NISSAN SENTRA GXE.  THE AIR BAG OF THIS CAR IS NOT INFLATE WHEN HER CAR INVOLVED IN THE FRONT END CRASH WHEN SHE TRAVEL AT 40 MPH.  I HAVE SOME PICTURES SHOWING HER CAR AFTER ACCIDENT THAT AVAILABLE IF YOU NEED TO LOOK AT.  PLEASE LET ME KNOW THIS IS A SERIOUS PROBLEM OR NOT. THANKS, THENHAN.   *NM",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/01/2004",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093450,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL DIPSTICK BROKE BETWEEN PLASTIC AND METAL. DIPSTICK WAS JAMMED INSIDE OF DIPSTICK TUBE. ATTEMPTING TO PULL OUT THE DIPSTICK LEADS TO PUSHING IT FURTHER, LEADING TO COLLISION WITH CRANKSHAFT. COULD BE A SERIOUS ISSUE IF THIS HAPPENS WHILE MOVING AND IT GETS ENTANGLED INSIDE THE ENGINE.*AK",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2004",
        "dateOfIncident": "04/08/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067361,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE VEHICLE, IT INTERMITTENTLY STALLED. THE DEALERSHIP INFORMED THE CONSUMER THAT THE PROBLEM PERTAINED  TO THE  COMPUTER. THE PROBLEM WAS NOT RESOLVED.   *AK   RECALL# 01V357000.  THE PROBLEM WAS SUPPOSED TO HAVE BEEN FIXED. *SC  *JB",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/09/2004",
        "dateOfIncident": "03/18/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087456,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED  RECALL 01V174000 CONCERNING LOWER CONTROL ARM.   WHILE TURNING ON TO A RESIDENTIAL STREET AT 5 MPH CONSUMER HEARD A PECULIAR NOISE FROM THE LEFT FRONT OF THE VEHICLE.  SECONDS LATER CONSUMER LOST CONTROL OF THE VEHICLE.  A MECHANIC EXAMINED THE VEHICLE AND  DETERMINED THAT THE LEFT LOWER CONTROL ARM  BROKE.  THIS PROBLEM WAS SUPPOSE TO HAVE BEEN FIXED BY A RECENT RECALL.*AK",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/04/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087220,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER TOOK VEHICLE TO THE DEALER,  AND THEY STATED THE PART WAS NOT IN.  DEALER  HAD  VEHICLE FOR MORE THAN ONE MONTH.  CONSUMER THOUGHT THAT THIS WAS THE PROCESS.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/29/2004",
        "dateOfIncident": "06/17/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083843,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE VEHICLE ENGINE WARNING LIGHT ILLUMINATED.  DEALERSHIP INSISTED THAT  THE PROBLEM RELATED TO THE CATALYTIC CONVERTER. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/27/2004",
        "dateOfIncident": "02/22/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082725,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING,  ENGINE CHECK LIGHT CAME ON. AFTER TAKING IT TO THE DEALER I WAS TOLD THE MASS FLOW/ AIR FLOW SENSOR WAS BAD AND WAS DUE TO ME USING AN NON-OEM AIRFILTER. I SENT THE AIRFILTER BACK TO PUROLATOR, WHO RESPONDED THAT THEIR PRODUCT MET ALL OEM REQUIREMENTS. I LOOKED UP THE RECALL INFORMATION AND FOUND OUT THERE WAS A RECALL FOR THE \"SERVICE ENGINE LIGHT\" COMING ON DUE TO OTHER ISSUES. I TOOK IT BACK TO THE DEALER, WHO NEVER TOLD ME ABOU THE RECALL, AND THEY COMPLETED THE WORK. I HAVE YET TO HAVE THE MASS FLOW/ AIR FLOW SENSOR REPLACED DUE TO COST $700 AS WELL AS MY FEELING IS THAT THIS IS A DEFECTIVE PRODUCT. I HAVE LOOKED THROUGH THE NHTSA WEB SITE AND FOUND SEVERAL OTHER MASS FLOW SENSOR PROBLEMS THAT HAVE YET TO BE ADDRESS FOR THIS MODEL YEAR CAR. I HAVE CONTACTED NISSAN AND THEY TOLD ME THE DEALER KNOWS WHAT IS BEST FOR MY VEHICLE AND THEY WOULD NOT DO ANYTHING!*AK",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/18/2004",
        "dateOfIncident": "06/28/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081319,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2000 NISSAN SENTRA HAS BEEN HAVING COMPUTER PROBLEMS FOR 6 MONTHS OR SO.  THREE WEEKS AGO THE CAR BEGAN SURGING AND LOOSING POWER AT HIGHWAY SPEED AND IS RENDERED USELESS.  THE PROBLEM WAS FOUND TO BE THE COMPUTER.  NISSAN HAS NOT YET DELIVERED THE PART AND THERE IS NO TIME OR DATE FOR SHIPMENT. I HAVE BEEN DEALING WITH NISSAN NORTH AMERICA DIRECTLY THROUGH AMITY NISSAN IN AMITYVILLE LONG ISLAND NEW YORK.",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/14/2004",
        "dateOfIncident": "07/08/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081078,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT  65,000-70,000 MILES THE SERVICE ENGINE LIGHT CAME ON. AT THE SAME TIME MY RIGHT FRONT WHEEL BEGAN MAKING NOISE. I TOOK MY CAR IN AND FOUND OUT THAT I NEEDED TO REPLACE THE HUB ASSEMBLY. NOT KNOWING THAT IT HAD BEEN RECALLED FOR THE HUB ASSEMBLY, I ENDED UP PAYING OVER $500 FOR THE PARTS AND LABOR. ABOUT 15,000 MILES LATER MY CAR LOST ALL POWER WHILE DRIVING ON THE FREEWAY. AFTER PAYING TO HAVE THE CRANK POSITION SENSOR REPLACED I RECEIVED A RECALL NOTICE WARNING OF THE PROBLEM.I TOOK MY CAR TO THE DEALER AND THEY PERFORMED THE RECALL WORK. THE SERVICE LIGHT IS STILL ON AND MY CAR OFTEN PERFORMS POORLY AND LOSES POWER WHEN TRYING TO ACCELERATE. I AM UNABLE TO PASS SMOG IN CA BECAUSE THE LIGHT IS ON. ALL OF THESE PROBLEMS ARE NOT COINCEDENTAL. NISSAN HAS MANUFACTURED A FAULTY SYSTEM AND THEY NEED TO OWN UP AND REPAIR IT.*AK",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "SEAT BELTS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/24/2004",
        "dateOfIncident": "05/02/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACCELERATOR PEDAL STICKS.  AS A RESULT WHEN TAKING OFF AFTER A STOP, THE CONSUMER HAD TO APPLY MORE PRESSURE TO THE PEDAL. THE PART HAS BEEN REPLACED THREE TIMES.  HOWEVER PROBLEM STILL EXISTS.   *AK   (THROTTLE PLATE STUCK)  THE PROBLEM NEVER SEEMED TO BE CORRECTED.  THE CONSUMER WOULD HAVE TO FORCIBLY PRESS DOWN ON THE GAS PEDAL, AFTER PUTTING THE VEHICLE INTO FIRST GEAR, FROM REVERSE.  THE SEAT BELT DID NOT RETRACT AND THE GAS PEDAL FELT AS IF IT WERE BINDING.   *SC  *JB",
        "vin": "3N1CB51DXXL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/24/2004",
        "dateOfIncident": "01/15/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH VEHICLE STALLED.  DEALER INDICATED THAT THE ENGINE SENSOR  FAILED. A RECALL WAS ISSUED. HOWEVER, THIS VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO VIN.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "04/27/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071637,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55 MPH VEHICLE STALLED.  THE CONSUMER WAS ABLE TO PULL THE VEHICLE OFF OF THE ROAD.  THE DEALER AND MANUFACTURER HAD BEEN NOTIFIED.   *AK   THE SERVICE DEALER COULDN'T FIND WHY THE VEHICLE STALLED SO HE CONCLUDED THAT THE FUEL PUMP WAS THE PROBLEM.  THE VEHICLE STILL DID NOT START EVEN AFTER A NEW FUEL PUMP WAS INSTALLED.  ON ANOTHER OCCASION THE CONSUMER WAS TOLD THAT THE ECM MODULE WAS THE PROBLEM.  RECALL# 03V477000.  THE VEHICLE PULLED TO THE RIGHT, THE A/C, HORN, AND THE THIRD BRAKE LIGHT WAS INOPERATIVE.  RECALL# 01V174000 .  THE CONSUMER ALSO LOST CONTROL OF THE VEHICLE AND HIT A GUARD RAIL.    *SC  THE FRONT ROTORS WERE WARPED.  *JB",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/01/2004",
        "dateOfIncident": "04/13/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075502,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL 01V357000 CONCERNING CRANK POSITION SENSOR:  AFTER RECALL REPAIRS WERE  DONE IT STARTED EXPERIENCING  CRANK POSITION SENSOR FAILURE.   LESS THAN TWO MONTHS AFTER THE RECALL REPAIRS WERE DONE WAS DRIVING  AND THE VEHICLE CUT OFF.   CONSUMER  SPOKE TO THE DEALER, WHO CLAIMED THAT  RECALL REPAIRS WERE DONE PROPERLY.  *AK",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/25/2004",
        "dateOfIncident": "05/10/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073093,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN SENTRA OIL STICK IS DESIGNED POORLY. STICK IS MADE OF PLASTIC AND IT COSTS A FURTUNE TO TAKE IT OUT ONCE IT BREAKS. NISSAN CHARGES UP TO $250 TO TAKE THE BROKEN PART OUT. THIS FIX SHOULD BE A RECALL BECAUSE THIS PART SHOULD NOT BE MADE OF PLASTIC.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": "05/11/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073496,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ANY SPEED  VEHICLE SHUT OFF.   CONSUMER HAD NO BRAKES, AND ALMOST HIT ANOTHER VEHICLE.  DEALER SAID CHECK ENGINE SENSOR NEEDED TO BE  REPLACED.  *AK",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/30/2004",
        "dateOfIncident": "04/05/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071906,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 20 MPH, THE ENGINE LIGHT ILLUMINATED THEN STALLED. THE DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. THE CAUSE HAS YET TO BE DETERMINED.  *LA",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/23/2004",
        "dateOfIncident": "04/17/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067739,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SERVICE ENGINE SOON LIGHT WAS ON FOR OVER A WEEK. THE DEALER TOLD ME BY PHONE TO PULL OVER IF IT STARTED FLASHING. AFTER THE CAR WAS CHECKED, IT TURNED OUT IT NEEDED A \" NEW MASS AIR FLOW SENSOR\". IT WAS A SATURDAY SO  THE SERVICE WRITER COULDN'T REACH NISSAN MOTOR CORP TO SEE IF I HAD TO PAY. I DID CALL NISSAN MOTOR CORP MYSELF BECAUSE THE SERVICE WRITER TOLD ME TUESDAY THE SERVICE MANAGER SAID I  HAVE TO PAY. THE REP AT NISSAN MOTOR CORP SPOKE TO THE SERVICE MANAGER AND NTHING WAS SOLVED. SINCE I HAD A COUPON, I DID SAVE OVER $200 BUT STILL HAD TO PAY $534.07 ON A 2000 CAR. I FEEL THIS IS A SAFTY FEATURE THAT NISSAN SHOULD NOT OF MADE ME PAY FOR. I DIDN'T PURCHASE THE CAR FROM THIS DEALER.*AK",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/23/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071627,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HANDLING CLAIM ON BEHALF OF SON RELATIVE TO DAMAGES RESULTING FROM AN AUTOMOBILE ACCIDENT. (NAR) *PH   *CB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/16/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067322,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH  CONSUMER HEARD A LOUD NOISE COMING FROM THE FRONT. AIRBAG LIGHT APPEARED   ON THE DASHBOARD AND REMAINED ON.   CONSUMER INSPECTED THE VEHICLE AND NOTICED THAT THE IDLE PULLEY HAD CAME OFF.   VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION, AND DEALER WAS NOT ABLE TO RESOLVE THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/11/2004",
        "dateOfIncident": "04/09/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065913,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE LOOKED AND FOUND NO RECALL ON THIS POORLY DESIGNED ENGINE COMPONENT. PLASTIC DIPSTICK HANDLE BREAKS.  MY CAR IS A NISSAN 2000 SENTRA GXE 1.8: THE PLASTIC ENGINE OIL DIPSTICK HANDLE BROKE OFF, LEAVING THE STAINLESS STEEL STICK INSIDE THE TUBE. I CALLED MY LOCAL NISSAN DEALERSHIP SERVICE DEPARTMENT FOR A METHOD OF EXTRACTING THE DEFECTIVE PART. I WAS TOLD IT WOULD BE 'VERY EXPENSIVE' FOR THE SERVICE SHOP TO DO, THAT I SHOULD TRY TO 'FIGURE IT OUT' MYSELF AND 'LET ME KNOW HOW YOU DID IT' IF I WAS SUCCESSFUL. THE ONLY OEM REPLACEMENT PART FOR THIS ITEM IS AN EXACT DUPLICATE OF THE PLASTIC HANDLE TYPE THAT BROKE, SO I AM NOT USING THAT AGAIN!   THIS PLASTIC COMPONENT IS POORLY DESIGNED AND CAN PERMIT THE STAINLESS STEEL 'STICK' TO BE FORCED INTO THE OIL PAN. *JB",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/09/2004",
        "dateOfIncident": "04/02/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065809,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO WHEEL LUGS, NUTS AND  STUDS WERE BROKEN IN THE PROCESS OF TIRE ROTATION SERVICE THAT WAS PERFORMANCED BY THE RIVERSIDE NISSAN DEALER. HAD THIS HAPPENDED DURING DRIVING, IT WOULD HAVE INCURED AN ACCIDENT. THIS VEHICLE HAD NO IMPACT OR ACCIDENT BEFORE THAT COULD POTENTIALLY DAMAGE THAT PART. AND THE VEHICLE HAS NEVER BEING USED OFF-ROAD. SO, I BELIEVE THIS IS A DEFECT OF THE PART, WHICH SHOULD BE RECALLED TO AVOID ANY POSSIBLE ACCIDENTS IN SIMILAR VEHICLES. *AK",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/05/2004",
        "dateOfIncident": "04/03/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064564,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I BROUGHT MY 2000 NISSAN SENTRA GXE TO SEARS AUTO CENTER FOR NEW TIRES ON SATURDAY MORNING.  WHEN THE MECHANIC ASKED IF MY CAR NEEDED AN OIL CHANGE, I SAID SURE.  WHEN I RETURNED TO PICK UP MY VEHICLE, THE MECHANIC HANDED ME TWO PIECES, THE PLASTIC \"O\" RING AND A BIT OF STEM FROM MY DIPSTICK, AND TOLD ME THAT THE REST OF MY DIPSTICK HAD SLID DOWN ABOUT SIX INCHES INTO THE TUBE.  BECAUSE PLASTIC WAS STILL ON ONE END, HE COULD NOT GET THE STICK OUT AND SENT ME TO MY NISSAN DEALER.  THE MECHANIC AT NISSAN SEEMED SURPRISED AT WHAT HE SAW.  I ASKED HIM WHAT NEEDED TO BE DONE WITHOUT MY TELLING HIM WHAT SEARS HAD SAID.      THE NISSAN MECHANIC AND THE SEARS MECHANIC CONCURRED:  NOT ONLY WAS GETTING THE DIPSTICK OUT GOING TO BE A PROBLEM, BUT AS IT BOUNCED AROUND IN THE TUBE, IT COULD DRIVE ITS WAY THROUGH MY OIL PAN AND BUST MY CRANKSHAFT OR CAUSE THE OIL TO BACK OVER THE ENGINE.  EITHER WAY, THE PROSPECT IS DIM.  HOW MUCH TO GET THE DIPSTICK OUT?  DUE TO NISSAN'S DESIGN, THE MECHANIC SAID THAT PART OF MY ENGINE WAS IN THE WAY OF THE OIL PAN AND THE LABOR ALONE WOULD COST $300, AN EXORBITANT SUM FOR SOMEONE'S STUPIDITY.  WHAT HAPPENED TO METAL DIPSTICKS?    WHEN I CONTACTED NISSAN HEADQUARTERS ABOUT THIS, I WAS TOLD THAT MY WARRANTY PERIOD WAS OVER.  I WAS VERY UPSET AT THIS NEWS CONSIDERING THAT THIS PROBLEM WOULD NOT MANIFEST WITHIN THE WARRANTY PERIOD!  PLASTIC TAKES A BIT OF TIME TO BE HEAT-DAMAGED AND SNAP LIKE THAT, BUT WHEN SITTING RIGHT NEXT TO THE ENGINE MANIFOLD...WELL, DUH!  RIGHT NOW, I AM STUCK WITH A BROKEN DIPSTICK, WHICH MAY OR MAY NOT MAKE MY CAR A FIRE-BREATHING DEATH TRAP.  APPARENTLY MY GRIPE WITH NISSAN IS NOT ISOLATED--JUST CHECK OUT THE GRIPED FROM THIS WEBSITE, ALSO ATTACHED BELOW.  HTTP://WWW.BROOMEMAN.COM/MT/ARCHIVES/001156.HTML  HELP! I DON'T THINK THIS SHOULD BE MY PROBLEM, BUT NISSAN DOESN'T THINK SO.   *JB",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/24/2004",
        "dateOfIncident": "12/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064779,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER HAD TO BE REPLACED DUE TO OVER HEATING BECAUSE OF DEFECTIVE LINING MATERIAL USED IN THE CASING HOUSING THE COMPUTER.  *PH  THE CONSUMER RECEIVED A RECALL TO REPLACE THE LINING ON THE COMPUTER HOUSING, THE MANUFACTURER REFUSED TO TAKE RESPONSIBILITY FOR THE DAMAGE THAT WAS DONE TO THE COMPUTER DUE TO THE OVERHEATING.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/23/2004",
        "dateOfIncident": "03/02/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064979,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER EXPERIENCED THE DEFECT AS STATED IN THE RECALL PERTAINING TO THE \"CHECK ENGINE\" LIGHT ILLUMINATING.  *PH  THE RECALL WAS FOR A DEFECTIVE ENGINE CONTROL MODULE (ECM) WHICH MAY CAUSE THE VEHICLE TO STALL WHILE DRIVING.",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/18/2004",
        "dateOfIncident": "03/17/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062490,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER REFUSED TO HONOR RECALL NOTICE BY NISSAN NORTH AMERICA, INC.*AK",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065121,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER BELIEVED SOME OF THE BURDEN OF COST FOR REPLACING THE MASS AIRFLOW SENSOR SHOULD BE BORNE BY NISSAN.   *PH   THE ACCELERATOR PEDAL WOULD STICK.  THE DEALER CLAIMED TO HAVE FIXED THE PROBLEM BUT IT STILL OCCURRED.  THE CONSUMER WAS ALSO TOLD THAT THE MASS AIRFLOW SENSOR WAS GOING BAD AND WOULD NEED TO BE REPLACED.  THE TECHNICIAN INFORMED THE CONSUMER THAT NOTHING COULD BE DONE.  THE VEHICLE MADE A CHIRPING SOUND SINCE THE VEHICLE WAS FIRST PURCHASED.   *SC",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063232,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED NHTSA RECALL 03V084000 CONCERNING DEBRIS/ FIRE.  VEHICLE WAS TAKEN TO THE DEALER FOR RECALL REPAIRS.  AFTER REPAIRS WERE DONE  VEHICLE WAS TAKEN  BACK TO THE DEALER THREE TIMES.  THE FIRST TIME DEALE RREPLACED THE CATALYTIC CONVERTER. THE SECOND TIME THEY REPLACED THE ENGINE, AND THE THIRD  TIME DEALER REPLACED BOTH, THE CATALYTIC CONVERTER AND ENGINE.    *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/08/2004",
        "dateOfIncident": "03/08/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN DEALERSHIP SERVICE DIAGNOSED AIR FLOW METER FAILURE - ENGINE LIGHT ON P0171 B1 FUEL LEAN. EVENT HAPPENED AT SAME TIME AS WHEN THE CRANK SENSOR AND ECM CASE RECALL WORK DONE EXCEPT DEALERSHIP CLAIMS SEPARATE - NOT PART OF COVERED RECALL WORK. AUTO ONLY HAS 64,889 MILES AND DEALERSHIP CLAIMS ENGINE TROUBLE AND REPAIR OVER $600. NISSAN DEALERSHIP STATED TOYOTA SLAES DEALERSHIP SHOULD HAVE NOTICED THIS DURING CLAIMED 160 POINT INSPECTION, AS COULD NOT HAVE HAPPENDED IN SHORT TIME OF MY OWNERSHIP. TOYOTA DEALERSHIP WHO SOLD IT ALSO DID NOT REPAIR OR DISCLOSE WHEEL RECALL AND OWNER, IN JUST ONE YEAR OF OWNERSHIP, HAD TO REPLACE THREE FLAT/DAMAGED AND IRREPAIRABLE TIRES AS A RESULT, OUT-OF-POCKET.  NOW FOR NISSAN TO DIAGNOSE ENGINE AIR FLOW METER FAILURE AT SAME TIME AS OTHER ENGINE RECALLS IS JUST TOO IRONIC TIMING. BELIEVE SHOULD BE PART OF THESE SAME RELATED OR ANOTHER RECALL.*AK",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/08/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062869,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD BEEN STALLING UNEXPECTEDLY FOR THE PAST 10 MONTHS. VEHICLE HAS BEEN IN THE SERVICE DEPARTMENT 7 TIMES AND THE PROBLEM HAS GONE UNRESOLVED. *PH",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/02/2004",
        "dateOfIncident": "02/09/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060180,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT REPEATEDLY ON SINCE 2002 THROUGH EVERY RECALL HAS BEEN FIXED AND NOW A MASS AIR FLOW SENSOR NEEDS TO BE REPLACED FOR A LOT OF MONEY WITH NO PROOF THIS WAS NOT THE ORIGINAL PROBLEM WHILE THE CAR WAS UNDER WARRANTY.  HAVE BROUGHT IT IN AGAIN FOR THIS LIGHT BACK IN JAN. AND IT IS STILL NOT FIXED BECAUSE AT FIRST THEY SAID IT WAS THE RECALL AND THAT DIDN'T WORK AGAIN AND THEN THEY FORGOT TO ORDER THE PART WHILE MY CAR WAS THERE.  NISSAN CONSUMER AFFAIRS WAS ALSO RUDE AND NOT HELPFUL WITH THIS.*AK",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2004",
        "dateOfIncident": "01/31/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056713,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2000 NISSAN SENTRA IN JUNE 2003. TRANSMISSION FAILED IN AUGUST 2003. DEALER REPLACED WITH RE-BUILT TRANSMISSION. THIS ONE FAILED IN JANUARY 2004. SECOND DEALER REFUSED TO REPLACE THIS ONE. SAID THERE WERE SIGNS OF ABUSE. THIS WAS NOT TRUE, CALLED NISSAN CUSTOMER SERVIC, NO HELP THERE. NO HELP ANYWHERE. *AK",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/02/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052266,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MAF SENSOR IS NOT WORKING. *AK",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2003",
        "dateOfIncident": "12/30/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052118,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH THE VEHICLE STALLED INTERMITTENTLY. THE VEHICLE WAS TOWED TO THE DEALER WHERE THE TECHNICIAN  REPLACED THE CRANK SHAFT SENSOR. PLEASE PROVIDE ANY ADDITIONAL INFORMATION.  *NM",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,STRUCTURE,WHEELS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/12/2003",
        "dateOfIncident": "08/19/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034177,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHUT OFF COMPLETELY AND WITHOUT PRIOR WARNING WHILE TRAVELING ON THE HIGHWAY.  THIS PROBLEM OCCURRED ON SEVERAL OCCASIONS.  DEALER WAS AWARE OF THE PROBLEM.  SEVERAL REPAIR ATTEMPTS WERE MADE BUT NONE OF THEM WERE SUCCESSFUL.  *AK   NOISE CAME FROM THE RIGHT WHEEL AREA WHILE DRIVING.  THE DEALER REPLACED ALL WHEELS PER A SAFETY CAMPAIGN.  THE INSIDE DOOR HANDLE WAS LOOSE.  THE DEALER REPLACED THE DOOR PAD BUT THAT DIDN'T REMEDY THE PROBLEM.  THE REAR PASSENGER SIDE BUMPER WAS LOOSE.  THE DEALER SECURED IT.  THE RADIO WAS INOPERATIVE.  THE DEALER SPECIAL ORDER A NEW RADIO.  THE RIGHT FRONT WINDOW WAS INOPERATIVE FROM THE MAIN SWITCH.     *PH   *NLM",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/25/2003",
        "dateOfIncident": "09/24/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039515,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN SENTRA GXE AIR FLOW METER BEGAN FAILING AT 52,500 MILES CAUSING THE CAR TO CUT OFF DURING DECELERATION OR AT STOPS. NISSAN DOES NOT COVER THIS PART AFTER 36,000. THE PART ALONE REPORTEDLY COSTS OVER $700. NISSAN'S SHODDY PARTS ARE A SIGNIFICANT SAFETY ISSUE AND SHOULD BE REPLACED BY THE COMPANY AS THEY SHOULD LAST FOR AT LEAST 100,000 MILES.",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040287,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CALLED COMPLAINING ABOUT PROBLEMS WITH MASTER AIR FLOOD METER WHICH CAUSED THE GAS PEDAL TO GET STUCK EVERY TIME SHE TRIED TO ACCELERATE. MANUFACTURER WAS CONTACTED ,AND STATED THAT THEY WERE OUT OF THE PIECE , AND THAT THEY DIDN'T KNOW WHEN THEY  WERE GOING TO HAVE IT AVAILABLE.*AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032846,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL STICKS. TO GET THE CAR MOVING WE HAVE TO PUSH THE PEDAL HARD WHICH CAUSES A FASTER THAN NORMAL ACCELERATION.*AK",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/05/2003",
        "dateOfIncident": "08/05/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030850,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE NATIONAL TECHNICAL ADVISOR FOR JIFFY LUBE INTERNATIONAL AND I WOULD LIKE TO FILE A DEFECT CONCERN REGARDING ENGINE OIL LEVEL DIPSTICK FAILURES. SINCE NOVEMBER 2002 TO PRESENT, JIFFY LUBE INTERNATIONAL HAS SERVICED APPROXIMATELY 13 (TO CURRENT COUNT-POSSIBLY MORE-CURRENTLY RESEARCHING FOR EXACT NUMBER) 2000-2001 NISSAN SENTRAS W/1.8L ENGINES RANGING FROM 23,000 - 55,000 MILES IN WHICH THE ENGINE OIL LEVEL DIPSTICK HANDLE BECAME SEPERATED FROM THE METAL INDICATOR INSIDE THE TUBE(AS DESCRIBED IN COMPLAINT#10010803 & 10023403). THIS HAPPENS ON INITIAL REMOVAL OF THE DIPSTICK PRIOR TO SERVICING. SOME OF THE VEHICLES WERE EVEN 1ST TIME CUSTOMERS TO OUR SERVICE CENTERS. THERE ARE ALSO CLAIMS THAT I DO NOT HAVE ACCOUNTED FOR BECAUSE THE STORES ARE FRANCHISE OWNED AND THEY HANDLE THERE OWN CLAIMS. I DO HAVE ALL THE CUSTOMERS PERSONAL & VEHICLE INFORMATION IF YOU WOULD LIKE TO HAVE IT TO INVESTIGATE. THE DEALERS THAT I HAVE TALKED WITH STATE THAT THEY ARE UNWARE OF ANY CONCERNS OF THIS NATURE BUT ARE QUICK TO PROPOSE A REPAIR BILL OF $200-300.00 DOLLARES EVERYTIME THIS HAPPENS. I WOULD LIKE SOMEONE FROM NHTSA TO INVESTIGATE AND CONSULT WITH NISSAN ON WHAT THERE TAKE IS ON THIS MATTER AND TO SEE IF THEY MAY ISSUE A RECALL TO WHERE JIFFY LUBE INTERNATIONAL COULD RECOUPE SOME OF THERE LOSSES, FINANCIALLY AND FROM A CUSTOMER STANDPOINT. PLEASE ADVISE IF I CAN OFFER ANYMORE INFORMATION REGARDING THIS MATTER. I APPRECIATE YOUR CONCERN AND LOOK FORWARD TO YOUR RESPONSE.    RICKY JACKSON  JLI NATIONAL TECHNICAL SERVICE ADVISOR  JIFFY LUBE INTERNATIONAL, INC.  A SUBSIDIARY OF SHELL OIL COMPANY  TEL:     (713)546-4205  FAX:    (713)217-3083  EMAIL: RICHARD.JACKSON@PZLQS.COM .  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/28/2003",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031233,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING  AND  WITH NO WARNING  VEHICLE WILL STALL, AND IT WILL BE HARD FOR THE CONSUMER TO CONTROL THE VEHICLE. DEALER NOTIFIED.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029874,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL DASHBOARD WENT OUT WITHOUT WARNING. TOOK TO THE DEALER, AND DEALER REPLACED THE CONTROL UNIFIED SENSOR.  PLEASE PROVIDE ANY FURTHER INFORMATION.",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/02/2003",
        "dateOfIncident": "02/21/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH SUDDEN LURCHING AND NO RESPONSE FROM ACCELERATOR WHEN DEPRESSED.   *MR   THE VEHICLE SUDDENLY LURCHED FORWARD,THE TACHOMETER DROPPED TO ZERO.  THE CONSUMER NOTICED A LOSS OF SPEED.  THE CONSUMER STEPPED ON THE ACCELERATOR AND DIDN'T GET A RESPONSE FROM THE VEHICLE WITH DIFFICULTY STEERING AND WHEN THE CONSUMER ATTEMPTED TO BRAKE AND OR PARK, NEITHER RESPONDED.   *SCC     *JB",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/19/2003",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023403,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ferrari North America, Inc.",
                "productMake": "OIL FILTER",
                "productModel": "111782",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2000 NISSAN SENTRA - ENGINE OIL STICK BROKE OFF, UNABLE TO CHECK OIL, PLASTIC HANDLE ON OIL STICK BRITTLE AFTER A FEW YEARS. COSTLY REPAIR TO DUE TO DEFECTED OIL STICK.   *NLM",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/18/2003",
        "dateOfIncident": "06/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024468,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH FRONT LOWER CONTROL ARMS AND DEFECTIVE PULLEY IN ENGINE. *MR  THE FUEL PUMP WAS REPLACED AT 17000 MILES.  THE AIR CONDITIONER WOULD BLOW WARM AIR INTERMITTENTLY.  THE DEALER HAS APPEMPTED TO REPAIR THE A/C SEVERAL TIMES BUT HAS NIT BEEN SUCCESSFUL.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2003",
        "dateOfIncident": "06/04/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022309,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISY  ENGINE, WHILE DRIVING VEHICLE MAKES A CLUNKY NOISE. DEALER NOTIFIED. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/23/2003",
        "dateOfIncident": "05/13/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020460,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES WORN BRAKE PADS CAUSED THE VEHICLE TO EXPERIENCE EXTENDED STOPPING DISTANCE.  *NLM",
        "vin": "PLEASE PROV"
    },
    {
        "components": "STEERING,TIRES",
        "crash": true,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "01/29/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015453,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER LOSS CONTROL OF THE VEHICLE ON A SNOWY STREET, HIT A CURB AND WAS REAR ENDED.  *JB",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2003",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009643,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN AN ACCIDENT, THE AIR BAGS AND ABS DID NOT PERFORM AS DESIGNED.*JB",
        "vin": "3N1CB51D2YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/21/2003",
        "dateOfIncident": "01/20/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003091,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WENT OUT TO CHECK MY OIL AND THE PLASTIC PULLER ON THE OIL DIP STICK BROKE OFF AS I REMOVED IT AND THE REMAINING PART OF THE STICK FELL INTO THE DIP STICK SHAFT AND BECAME LODGED.  MY NISSAN DEALER QUOTED ME SEVERAL HUNDRED DOLLARS TO REMOVE THE DIP STICK.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/10/2002",
        "dateOfIncident": "12/07/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770671,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD STOPPED VEHICLE, FOOT ON BRAKE, READY TO REVERSE TO PARALLED PARK, AND VEHICLE STARTED RACING FASTER AND FASTER.  ONLY WAY TO STOP IT WAS TO TURN OFF THE IGNITION, AFTER THE VEHICLE LURCHED FORWARD AND WAS REVVING UP TO MAX RPM.  FORTUNATELY I WAS AT END OF STREET, NOTHING AND NO ONE IN FRONT OF ME WHEN IT LURCHED, MY FOOT ON THE BRAKE DIDN'T STOP IT.  HAD TO SHUT MOTOR OFF.  DT",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": "10/06/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020446,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFTS FROM DRIVE INTO NEUTRAL INADVERTENTLY.   PLEASE PROVIDE FURTHER INFORMATION.  *MR",
        "vin": "PLEASE FILL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2002",
        "dateOfIncident": "10/03/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768190,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THIS AUTOMATIC CAR IN THE CITY (AT 20 - 40 MPH), IT SHIFTS OUT OF GEAR INTO NEUTRAL.  ACCELERATION IS LOST.  REENGAGEMENT OF THE TRANSMISSION IS ACCOMPLISHED BY MANUALLY SHIFTING THE CAR INTO SECOND GEAR.  THE PROBLEM OCCURS ONLY EVERY COUPLE OF WEEKS AND CANNOT BE DIAGNOSED BY O'NEILL OR STATE LINE NISSAN DEALERSHIPS.  THE PROBLEM HAS HAPPENED TO TWO DIFFERENT DRIVERS, AND ONCE WHEN A THIRD PERSON WAS IN THE CAR.  NISSAN SAYS IT WILL NOT FIX WHAT IT CANNOT DIAGNOSE, SO IT HAS NO PROPOSED REMEDY FOR THIS POTENTIALLY DANGEROUS CONDITION.     MR",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/01/2002",
        "dateOfIncident": "08/07/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019905,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES VEHICLE CUT OFF WHILE DRIVING 65 MPH WITHOUT WARNING. VEHICLE TAKEN TO THE DEALER .   NLM",
        "vin": "3NICB51D3YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/01/2002",
        "dateOfIncident": "08/12/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019909,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MFR# P1159 & NHTSA# 01 V 357 000/CRANK POSITION SENSOR: CONSUMER STATES WHILE THE VEHICLE WAS AT THE DEALER FOR CUTTING OFF WHILE DRIVING. THE TECHNICIAN STATED THAT A MANUFACTURER RECALL WAS ON THE VEHICLE CONCERNING A \"CRANK POSITION SENOR\". CONSUMER STATES THAT NO RECALL NOTICE WAS RECEIVERD UNTIL AFTER THIS INCIDENT OCCUR.   NLM",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/15/2002",
        "dateOfIncident": "06/21/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016423,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO MAKE A LEFT TURN ANOTHER VEHICLE RAN INTO  CONSUMER'S VEHICLE HEAD-ON, AND NONE OF THE AIR BAGS DEPLOYED. VEHICLE WAS TOTALED. CONTACTED DEALER.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/12/2002",
        "dateOfIncident": "08/15/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016043,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SMOKES RIGHT AFTER A OIL CHANGE IS DONE, THIS IS DUE TO THE OIL FILTER PLUG BEING RIGHT ABOVE CATALYTIC CONVERTER. CONSUMER CAN ACTUALLY HEAR THE OIL POPPING ON THE CATALYTIC CONVERTER AFTER THE OIL CHANGE IS DONE.*AK",
        "vin": "ADD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2002",
        "dateOfIncident": "06/14/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765369,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DEALER FAILED TO TELL ME THAT A NEEDED REPAIR WAS, ACTUALLY, PART OF A FORMAL RECALL.  I FOUND OUT ABOUT THE RECALL AFTER I HAD MY CAR REPAIRED.  WHEN MY CAR EXHIBITED THE EXACT SYMPTOMS DESCRIBED IN THE CRANK POSITION SENSOR RECALL, 01V357000.I CALLED HERITAGE NISSAN.  THEY TOLD ME THAT, SINCE I DIDN?T HAVE AN EXTENDED WARRANTY, I WOULD HAVE TO PAY FOR ANY REPAIRS TO CORRECT THE PROBLEM I DESCRIBED.  THE DEALER TOLD ME THAT ANY OTHER MECHANIC/SHOP COULD PROBABLY SEE ME SOONER AND THAT I MAY AS WELL FIND SOMEONE LOCAL TO MY HOME.  IN THE END, I PAID $231.68 FOR WHAT THE DEALER SHOULD HAVE REPLACED FREE OF CHARGE.  AFTER FINDING OUT ABOUT THE RECALL ONLINE, I WROTE NISSAN NATIONAL CONSUMER AFFAIRS (LETTER DATED JUNE 24, 2002).  TO DATE, THEY HAVE NOT REPLIED TO MY LETTER.  I WOULD BE HAPPY TO PROVIDE A COPY OF THESE MATERIALS TO YOU, IF NEEDED.*AK",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/05/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015469,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT A STOP LIGHT AND WITHOUT WARNING ANOTHER VEHICLE HIT CONSUMER'S VEHICLE HEAD ON. UPON IMPACT,  AIR BAGS DID NOT DEPLOY. DEALER HAS BEEN NOTIFIED.*AK",
        "vin": "3N1CB51B2GL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/05/2002",
        "dateOfIncident": "07/31/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015492,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 30 MPH, THE FRONT WHEEL DISCONNECTED FROM VEHICLE.  RECALL REPAIRS ON THE STEEL WHEELS WERE DONE ON JANUARY 10, 2002.  THERE WAS NO ACCIDENT OR INJURIES.  *AK  *SCC",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/09/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566537,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TOLD BY THE DEALER THAT RECALL OVI-277 WOULD ONLY BE PERFORMED IF CRACKS WERE EVIDENT IN THE WHEELS, IF NOT THE WHEEL COULD NOT BE REPLACED UNTIL DEC, THE CONSUMER IS NOT SATISFIED.  *MJ",
        "vin": "3N1CB51DOYL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2002",
        "dateOfIncident": "04/06/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565396,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, CONSUMER EXPERIENCED A MECHANICAL FAILURE/MALFUNCTION, WHICH FORCED HIM TO CROSS OVER 2 LANES TO THE CURB, DAMAGING THE PASSENGERS SIDE, ONCE THE VEHICLE WAS TOWED, IT WAS THEN DETERMINED THAT THE CAUSE OF MALFUNCTION WAS A PENDING RECALL (01V2770000) IN WHICH THE CONSUMER WAS NEVER NOTIFIED.*JB   DEALER REPLACED CRANK SENSOR ACCORDING TO RECALL.  *TT",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/11/2002",
        "dateOfIncident": "04/09/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565396,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING, THE STEERING WHEEL COLUMN MAKES A NOISE WHEN TURNING, THE DEALER COULD NOT DUPLICATE THE PROBLEM.*JB   *TT",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/10/2002",
        "dateOfIncident": "02/14/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761763,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK CAR STALLED.  AFTER RESTARTING THE CAR HAD VERY LITTLE PICK UP AND WAS NO LONGER REGISTERING RPM'S.  THE DEALERSHIP SAID THAT THE IDLER PULLEY HAD FAILED.*AK",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009408,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS  RECALL 01V35700 FOR  STALLING . CONSUMER TOOK   VEHICLE TO  DEALERSHIP FOR  RECALL REPAIRS,  BUT THE REMEDY DID NOT WORK,  PROBLEM STILL OCCURS.*AK",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/06/2002",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009252,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PRESSING THE BRAKE PEDAL, PEDAL WENT TO THE FLOOR AND VEHICLE DID NOT STOP. CAUSE IS UNKWOWN.  PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "3N1CB51DO1L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2002",
        "dateOfIncident": "09/04/2001",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6901113,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, CONSUMER SMELLED SMOKE, SHE THEN PULLED OVER OPENED THE HOOD AND SAW FLAMES COMING FROM THE VEHICLE, A RUST INHIBITOR HAD BEEN INSTALLED BY THE DEALERSHIP.(CLAIM#51-0495-524)*JB",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "04/13/2002",
        "dateOfIncident": "04/06/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 760643,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN REFUSES TO ACCEPT RESPONSIBILITY! NO SAFETY DEFECT LISTED. *AK",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/11/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 760566,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2001 MAY WHEN I WAS DRIVING THIS CAR TO HOUSTON, I HEARD SOME SQUEKING NOISE FROM THE FRONT RIGHT PART OF THE CAR WHEN THE VEHICLE SPEED WAS AROUND 65 MPH AND THE ATMOSPHERIC TEMPERATURE WAS AROUND 80 DEGREE F. AFTER SOME TIME IT BECAME WORSE AND THERE WAS VIBRATION TO THE WHOLE CAR EVEN AT 55 MPH AND ALSO THERE WAS A RETARDING EFFECT TO THE SPEED ALONG WITH EACH SQUEAKING SOUND. I TOOK THE CAR THE NEXT MORNING TO A DEALERSHIP IN BRYAN, COLLEGESTATION BUT THEY COULD NOT FIND ANYTHING, THEY TOLD ME. LATER THE SAME THING HAPPENED TO THE CAR WHENEVER THE ATMOSPHERIC TEMPERATURE IS MORE THAN 65 DEGREE F. I HAD TAKEN THIS VEHICLE TO HUDIBURG NISSAN DEALERSHIP IN OKLAHOMA CITY 2 OR 3 TIMES WITH THIS COMPLAINT AND EACH TIME A SERVICE ADVISOR TEST DRIVED ALONG WITH ME AND HAD HEARD THIS NOISE. THE ADVISOR ON ALL OCCASIONS WAS ONE MR. PETE.I TOOK THE CAR THERE ON ALL OCCASSIONS IN THE AFTERNOON WHEN I HEARD THE NOISE AND FELT THE VIBRATION AND THE RETARDING EFFECT ON SPEED WHILE I DRIVE. THE ADVISOR TEST DRIVED AT THE SAME TIME AND ON ALL OCCASSIONS ASKED ME TO LEAVE THE CAR THERE SO THAT THE TECHNICIANS CAN FIX IT. THEN THEY RETURNED THE CAR TO ME THE NEXT DAY SAYING THE TECHNICIANS NEVER HEARED ANYTHING. IF WE DRIVE IT ON COLD MORNINGS WE WON'T HEAR ANYTHING OR FEEL ANYTHING, THAT MAY BE THE REASON. NOW AS THE SPRING STARTS AND TEMPERATURE BEGAN TO INCREASE I HAS THE SAME PROBLEM FOR THE CAR. THE MAIN CONCERN IS THE RETARDING EFFECT ALONG WITH THE NOISE. I WANT TO HAVE IT FIXED.PLEASE HELP ME.",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2002",
        "dateOfIncident": "04/06/2002",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007124,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A FIRE ON  HOOD INSTALLATION HAD STARTED WHILE DRIVING.  DEALER AND  MANUFACTURER WERE NOTIFIED. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2002",
        "dateOfIncident": "01/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006266,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON HIGHWAY  VEHICLE SHU DOWN WITHOUT PRIOR WARNING.  ENGINE CHECK LIGHT CAME ON. *AK",
        "vin": "31CB51D6YL3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/20/2002",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005968,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD START TO WANDER ACROSS THE ROAD WHEN DRIVING 60-65 MPH, AND MORE SEVERELY AT 70 OR MORE. VEHICLE BEEN TO  DEALER ON TWO OR MORE OCCASIONS, AND  PROBLEM STILL OCCURRING. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "1CB51D6YL33"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/12/2002",
        "dateOfIncident": "11/28/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005512,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "01 V 277 000/STEEL WHEELS: DEALER (NISSAN HOTEL; JACKSON HEIGHTS, NY; PHONE# 718/898-7800 WILL NOT  HONOR RECALL DUE TO NO PARTS AVAILABLE SINCE ABOVE INCIDENT DATE. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "3N1CB51DOYL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564632,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, CONSUMER STATED VEHICLE STALLED, THE RPM GAUGE STOPPED WORKING, CONSUMER WAS ABLE TO TRAVEL APPROX 5 MILES THEN SERVICE ENGINE LIGHT CAME ON AND VEHICLE COMPLETELY SHUT OFF, WHEN CONSUMER BROUGHT VEHICLE IN FOR SERVICE, DEALER INFORMED CONSUMER THERE WAS A RECALL, 01V357, CONSUMER HAD NOT RECEIVED RECALL NOTICE AND FELT DEALER TOOK NO RESPONSIBILITY FOR NEGLECTING TO INFORM HER OF RECALL.   *TT",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564632,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, CONSUMER STATED VEHICLE STALLED, THE RPM GAUGE STOPPED WORKING, CONSUMER WAS ABLE TO TRAVEL APPROX 5 MILES THEN SERVICE ENGINE LIGHT CAME ON AND VEHICLE COMPLETELY SHUT OFF, WHEN CONSUMER BROUGHT VEHICLE IN FOR SERVICE, DEALER INFORMED CONSUMER THERE WAS A RECALL, 01V357, CONSUMER HAD NOT RECEIVED RECALL NOTICE AND FELT DEALER TOOK NO RESPONSIBILITY FOR NEGLECTING TO INFORM HER OF RECALL.   *TT",
        "vin": "3N1CB51D5YL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564625,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON WET PAVEMENT, VEHICLE WENT OUT OF CONTROL, CONSUMER STATES SHE BARELY KEPT FROM HAVING AN ACCIDENT.  CONSUMER RECEIVED RECALL 01V174 AND IS EXPERIENCING UNUSUAL NOISE AND ROUGH DRIVING, SHE FEELS THIS IS RELATED TO THE RECALL AND WAS INFORMED BY A LOCAL GARAGE THAT THERE WAS A PROBLEM.   *SLC",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2002",
        "dateOfIncident": "09/21/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004682,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING CAN'T TELL HOW FAST VEHICLE IS GOING. SPEEDOMETER WORKS INTERMITTENTLY. ALSO, ODOMETER AND TACHOMETER WORK INTERMITTENTLY.   SOMETIMES EVERYTHING WILL BECOME INOPERABLE.  DEALER CONTACTED.  PLEASE ADD VIN. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/25/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004458,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SEAT BELT LIGHT ILLUMINATED, INDICATING THAT THE SEAT BELT WAS NOT BEING USED WHEN  IT ACTUALLY USED DUE TO AN OPEN CIRCUIT.  DEALER REPLACED  SEAT BELT ASSEMBLY, AND INSPECTED  INSTRUCTMENT PANEL CLUSTER, BUT COULD NOT FIND A REMEDY TO CORRECT THE  PROBLEM.  PLEASE GIVE ANY FURTHER DETAILS.  *AK",
        "vin": "3N1BB51A5YL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/22/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564516,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS INFORMED THAT THE WHEEL HAD A MANUFACTURING DEFECT.  WHEN VEHICLE ARRIVED FOR INSPECTION, CONSUMER WAS INFORMED THAT EVERYTHING WAS OKAY, BUT THE DEALERSHIP DID NOT HAVE REPLACEMENT WHEELS.  SHORTLY THEREAFTER, THE TIRE TORE APART (SEPARATING IN HALF IN THE DIAMETER OF THE HOLES) RELEASING THE FRONT TIRE AT 55 MPH CAUSING EXTENSIVE DAMAGE TO VEHICLE.  *TT",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/20/2002",
        "dateOfIncident": "08/23/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 9005596,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE SUSPENSION",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": "10/22/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564267,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE MADE A THUMPING SOUND DUE TO THE FRONT LEFT TIRE BEGINNING TO SEPARATE PREMATURELY, CAUSING WHEEL TO BEND. THE CONSUMER HAD ALL TIRES REPLACED AND WANTS A REFUND FROM THE TIRE DEALER, BRIDGESTONE P185/65R14.  *YH",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": "12/14/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564249,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHEN APPLYING BRAKES, WHEELS LOCK UP, ON ONE OCCASION IT CAUSED A REAR END COLLSION, AND DAMAGED VEHICLE, CONSUMER STATES THAT THE AIR BAGS DID NOT DEPLOY AFTER REAR END COLLISION.   *TT",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": "12/14/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564249,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHEN APPLYING BRAKES, WHEELS LOCK UP, ON ONE OCCASION IT CAUSED A REAR END COLLSION, AND DAMAGED VEHICLE, CONSUMER STATES THAT THE AIR BAGS DID NOT DEPLOY AFTER REAR END COLLISION.   *TT",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": "10/22/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564267,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE MADE A THUMPING SOUND DUE TO THE FRONT LEFT TIRE BEGINNING TO SEPARATE PREMATURELY, CAUSING WHEEL TO BEND. THE CONSUMER HAD ALL TIRES REPLACED AND WANTS A REFUND FROM THE TIRE DEALER, BRIDGESTONE P185/65R14.  *YH",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": "12/14/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564249,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHEN APPLYING BRAKES, WHEELS LOCK UP, ON ONE OCCASION IT CAUSED A REAR END COLLSION, AND DAMAGED VEHICLE, CONSUMER STATES THAT THE AIR BAGS DID NOT DEPLOY AFTER REAR END COLLISION.   *TT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "03/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THERE WAS AN OIL BURNING SMELL UNDER VEHICLE WHILE DRIVING, IT WAS DETERMINED THAT THE FILTER WAS LEAKING OIL ON THE EXHAUST PIPE.*JB",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "03/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED SINCE THE VEHICLE WAS PURCHASED, THERE HAVE BEEN NUMEROUS FAILURES WITH SHIFTING OF THE OVERDRIVE MECHANISM, THE LIGHT ILLUMINATING, AND THE CANCEL SWITCH, DEALER WAS UNABLE TO DUPLICATE THE PROBLEM.*JB",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "03/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED SINCE THE VEHICLE WAS PURCHASED, THERE HAVE BEEN NUMEROUS FAILURES WITH SHIFTING OF THE OVERDRIVE MECHANISM, THE LIGHT ILLUMINATING, AND THE CANCEL SWITCH, DEALER WAS UNABLE TO DUPLICATE THE PROBLEM, ALSO VEHICLE IS NOT SHIFTING PROPERLY.*JB",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "03/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THERE WAS AN OIL BURNING SMELL UNDER VEHICLE WHILE DRIVING, IT WAS DETERMINED THAT THE FILTER WAS LEAKING OIL ON THE EXHAUST PIPE.*JB",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "03/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED SINCE THE VEHICLE WAS PURCHASED, THERE HAVE BEEN NUMEROUS FAILURES WITH SHIFTING OF THE OVERDRIVE MECHANISM, THE LIGHT ILLUMINATING, AND THE CANCEL SWITCH, DEALER WAS UNABLE TO DUPLICATE THE PROBLEM, ALSO VEHICLE IS NOT SHIFTING PROPERLY.*JB",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "10/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002423,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON SNOW CONSUMER SLAMMED ON BRAKES AND REAR BRAKES  WER NOT BRAKING PROPERLY.  DRIVER NOTICED THIS WHEEL IMPRINTS IN  SNOW. PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "NOT AVAIBLE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/08/2002",
        "dateOfIncident": "10/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001769,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED RECALL NOTICE 01V277000/STEEL WHEELS.  CONTACTED DEALERSHIP AND WAS INFORMED NO PARTS WERE AVAILABLE. RECEIVED LETTER FROM MANUFACTURER INDICATING PARTS WERE AVAILABLE AND DEALERSHIP WILL REPAIR. CONTACTED DEALERSHIP SECOND TIME AND WAS INFORMED AGAIN NO PARTS WERE AVAILABLE.  *AK  *JB",
        "vin": "3NICB51D8YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/07/2002",
        "dateOfIncident": "01/07/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001655,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE COOLING FAN STOPPED WORKING, AND VEHICLE OVER HEATED. CONTACTED DEALER, AND DEALER STATED THAT THEY COULD NO LOOK AT  VEHICLE UNTIL  24TH OF THIS MONTH. PLEASE PROVIDE MORE INFORMATION. *AK",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2001",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001177,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CATALYLIC CONVERTER WAS DEFECTIVE BECAUSE FUEL THAT RAN THROUGH THE CATALYTIC CONVERTER. *AK  CONSUMER ALSO STATED THE IGNITION COIL ON #3 CYLINDER FAILED, CUTTING OFF SPARK PLUG, FUEL/AIR CONTINUED THROUGH EXHAUST SYSTEM, OVERHEATING CATALYTIC CONVERTOR, ALSO WARNING LIGHT ACTIVATED.*SLC",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/26/2001",
        "dateOfIncident": "12/14/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756054,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A COLLISION ON DECEMBER 14, 2000 IN WHICH NEITHER MY DRIVER NOR PASSENGER SIDE AIRBAGS DEPLOYED. THE FRONT END OF MY VEHICLE SQUARELY HIT THE REAR OF A PICKUP TRUCK AT APPROXIMATELY 25 MILES PER HOUR. DEPITE THIS, THE AIRBAGS DID NOT DEPLOY.*AK",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/18/2001",
        "dateOfIncident": "12/17/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000845,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH VEHICLE COMPLETELY SHUTDOWN WITHOUT WARNING.  ALSO,  STEERING LOCKED UP, NEARLY RESULTING IN A COLLISION , CAUSE UNKNOWN.  PLEASE GIVE ANY FURTHER DETAILS.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "12/18/2001",
        "dateOfIncident": "11/15/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755772,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I MADE TURN RIGHT, I FACED UNCONTRORABLE STEERING FUNCTION FOR TWO TIMES ON THE SAME DAY. I FACED THE ACCIDENT IN SECOND TIME IN THE PREVIOUS DESCRIPTION. ACCORDING TO NISSAN THERE ARE THREE RECALLS ON MY CAR, BUT I ONLY RECEIVED ONE OF THEM 2 WEEKS BEFORE I FACED THE ACCIDENT. *AK   NOTE: THE SECOND INCIDENT OCCURRED WHILE TRAVELING LESS THAN 15 MPH ON NOVEMBER 25, 2001.  HE WAS MAKING A RIGHT-HAND TURN WHEN HE LOST ALL  STEERING CONTROL AND CRASHED INTO A JERSEY WALL.  NO DETERMINATION HAS BEEN MADE AS TO THE CAUSE OF THE STEERING FAILURE.",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/06/2001",
        "dateOfIncident": "02/02/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899951,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMPERATURE METER WAS ON( H).  CONSUMER WENT TO LIFT UP HOOD, AND  COOLANT WAS ALL OVER  ENGINE.   ALSO,  VEHICLE  PULLED TO  RIGHT.  DEALERSHIP IS AWARE OF  PROBLEM.*AK",
        "vin": "3N1BB51D5YL"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "12/05/2001",
        "dateOfIncident": "07/30/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 755329,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DU TO THE SUSPENSION ATTACHMENT BOLTS BREAKING ON MY VEHICLE I WAS SUBJECT TO HEARING NOISES  COMING FROM THE FRONT AREA OF THE VEHICLE.  I TOOK THE CAR IN TO NUMEROUS REPAIR SHOPS AND NO ONE COULD DIAGNOSE PROBLEM EVEN AT A DEALERSHIP SERVICE DEPT THEY ADVISED ME TO KEEP DRIVING VEHICLE UNTIL IT BREAKS DOWN THEN THEY COULD DIAGNOSE PROBLEM I DID EXACTLY AS ADVISED AND LOST CONTROL OF THE VEHICLE ON 8/24/01 AND IT RESULTED IN CRASH. *AK",
        "vin": "3N1CB51D7YL"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/30/2001",
        "dateOfIncident": "11/09/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755126,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STARTED RACING WHILE GOING 3MPH.  CAR JUMPED CURB AND WENT INTO A CEMENT PILLAR AT A STRIP MALL.  AIRBAG DID NOT DEPLOY.*AK",
        "vin": "3N1CB51D4YL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/14/2001",
        "dateOfIncident": "03/25/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899098,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 35 MPH CONSUMER LOST CONTROL OF VEHICLE DUE TO SUSPENSION FAILURE.  THERE  WAS A RECALL ON VEHICLE WHERE BOLTS USED TO ATTACH SUSPENSION MIGHT COME LOOSE FROM FRAME.*AK",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "10/25/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898657,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL NOTICE 01V277000/ MANUFACTURER'S RECALL R1005/3,  AND TOOK VEHICLE TO DEALER. DEALER  URGED CONSUMER TO BRING VEHICLE BACK ON DECEMBER 31,2001 TO CHECK WHEEL.  WHEN CALLING  DEALERSHIP FOR  REPAIRS,  DEALERSHIP INDICATED WOULD  NOT SERVICE VEHICLE. *AK",
        "vin": "3N1CB51D8YL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/29/2001",
        "dateOfIncident": "09/01/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898393,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY WHEN STOPPING, VEHICLE SURGES FORWARD.  DEALER WAS NOTIFIED. *AK  CONSUMER STATES SURGING HAPPENS WHEN APPLYING BRAKES, THE HARDER THE BRAKES ARE APLLIED, THE MORE THE VEHICLE WILL SURGE, THE RPMS ALSO INCREASE, CONSUMER STATES THE ONLY WAY TO STOP THE SUDDEN ACCELERATION IS BY RELEASING THE BRAKE PEDAL.   *SLC",
        "vin": "3N1CB51D3YL"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2001",
        "dateOfIncident": "03/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/05/2001",
        "dateOfIncident": "08/01/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 895775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS AT A FULL STOP WITH FOOT ON BRAKES WHEN VEHICLE ACCELERATED INTO FULL THROTTLE. TOOK VEHICLE TO DEALERSHIP, AND  MECHANIC FOUND NOTHING ON DIAGNOSTIC MACHINE. VEHICLE WAS ALSO TEST DRIVEN, AND NOTHING WAS FOUND.*AK",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/14/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 888095,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT LOW SPEEDS OR WHEN PULLING INTO A PARKING SPACE  VEHICLE WILL UNEXPECTEDLY ACCELERATE, CAUSE UNKNOWN.  PLEASE GIVE ANY FURTHER DETAILS.*AK",
        "vin": "3N1CB51D9YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/11/2001",
        "dateOfIncident": "07/15/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 885679,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IS MAKING A RATTLING  SOUND DURING ACCELERATION, STOPS WHEN VEHICLE REACHES 40-45 MPH.   TAKEN TO 2 DEALER WHO SAID TO WAIT AND SEE IF IT STOPS DOING IT, SINCE VEHICLE HAS A 5 YEAR WARRANTY.*AK   THE DEALER ACKNOWLEDGED THAT SOMETHING WAS WRONG WITHIN THE ENGINE, BUT COULD NOT DETERMINE WHAT IT WAS.  *YH",
        "vin": "3N1ZV51D9YL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/21/2001",
        "dateOfIncident": "03/21/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 883720,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING ABOUT 45MPH ON  HIGHWAY  AND WAS INVOLVED IN A  CHAIN REACTION WITH FIVE VEHICLES, ANOTHER VEHICLE HIT HER FROM  BEHIND AND SHE WAS  FOURTH CAR.  DRIVER'S SIDE OR PASSENGER'S SIDE AIRBAGS DIDN'T DEPLOY.  THERE WERE INJURIES SUSTAINED WITH DRIVER AND PASSENGER.   DEALERSHIP WAS AWARE OF PROBLEM.*AK *JB",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/22/2001",
        "dateOfIncident": "02/22/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 881102,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BELT EXTENDER ARM ON  ENGINE SEPARATED FROM  VEHICLE. VEHICLE IS AT DEALERSHIP.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/21/2000",
        "dateOfIncident": "12/16/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 876865,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 45 MPH COULD NOT SEE DUE TO SNOW.  VEHICLE HIT A SNOW BANK, AND  DRIVER'S/PASSENGER'S AIRBAGS DID NOT DEPLOY,  AND DID NOT PROTECT OCCUPANTS IN THIS CRASH.  NO PREVIOUS PROBLEM WITH AIRBAG SYSTEM.  PLEASE PROVIDE FURTHER INFORMATION.  *AK",
        "vin": "3N1BB51D6YL"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/19/2000",
        "dateOfIncident": "08/19/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 734711,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR COND. LINES FREEZE UP AIR COND. BECOMES UNEFFECTIVE",
        "vin": "3N1CB51D1YL"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/14/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 734304,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER BLOWS HOT AIR AFTER AN HOUR OF DRIVING WITH IT ON.",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/14/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 734304,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER BLOWS HOT AIR AFTER AN HOUR OF DRIVING WITH IT ON.   *AK",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/14/2000",
        "dateOfIncident": "10/14/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007017,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER BLOWS HOT AIR AFTER AN HOUR OF DRIVING WITH IT ON.   *AK   *NLM      **DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT-OVER TO ARTEMIS*734304",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2000",
        "dateOfIncident": "07/25/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732201,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION LOUD WHINNING FIRST GEAR AND AT 35 TO 45 MPH VIBRATION AND NO PICKUP ALSO PINGS ON ACCELERATION",
        "vin": "3N1CB51D0YL"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/17/2000",
        "dateOfIncident": "06/06/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 725599,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVER'S SEAT BELT NOT USED, THE SEAT BELT INDICATOR LIGHT ON THE DASH STAYS ON STEADY, WHICH IS NORMAL.  WHEN I USE THE SEAT BELT, THE INDICATOR LIGHT SOMETIMES GOES OFF (NORMAL)  AND SOMETIMES IT BLINKS RAPIDLY ON AND OFF.  DOES THAT MEAN THERE IS A PROBLEM AND IS THE SEAT BELT , IN FACT, WORKING PROPERLY?      I ASKED NISSAN AND THEY SAID TO BRING THE CAR IN FOR EXAMINATION...I AM CURIOUS IF ANYONE IS HAVING THE SAME PROBLEM AND IF THERE IS ANYTHING WRONG WITH THE SAFETY PRODUCT FEATURE (SEAT BELT) WITH THIS VEHICLE.*AK",
        "vin": "3N1CB51D6YL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/19/2000",
        "dateOfIncident": "06/19/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 865658,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HAD VEHICLE FOR 2WEEKS & IT STARTED RUNNING HARD & IDLING HIGH.  VEHICLE HAS BEEN IN REPAIRS 3 TIMES & IS STILL IN THE SHOP.  DEALER KNOW'S IT'S A VALVE PROBLEM,  BUT NOT SURE WERE IT'S COMING FROM.*AK",
        "vin": "3N1BB51D4YL"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/30/2000",
        "dateOfIncident": "05/27/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 723365,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER APPROXIMATELY 30 MINUTES OF DRIVING, DESPITE ADJUSTING EVERY CONTROL POSSIBLE, THE AIR CONDITIONER CEASED WORKING.  WHILE STOPPED FOR LUNCH, GAS REFILL, ETC. AND THE CAR HAD BEEN OFF FOR MORE THAN 5 MINUTES, UPON START UP IT WOULD ATTEMPT TO COOL, BUT THE ATTEMPTS FAILED AND AS A RESULT BLEW OUT ONLY HOT AIR.  THIS OCCURED DURING A DRIVING TRIP TO/FROM DALLAS OVER MEMORIAL DAY WEEKEND, SO IT WAS NOT AN INTERMITTENT PROBLEM, IT WAS CONSTANT, DESPITE ALL THE CONTROL ADJUSTMENT ATTEMPTS.  WHEN TAKING IT TO THE DEALER THE DAY AFTER I RETURNED, I DETAILED THE PROBLEM AND SAID, DON'T CALL ME AND TELL ME IT MUST BE INTERMITTENT BECAUSE YOU DIDN'T FIND ANYTHING WRONG BECAUSE YOU WON'T SINCE IT ONLY OCCURED ON THE LONG TRIP.  SURPRISE, THAT'S WHAT THEY TOLD ME AND THEY CANNOT RUN A DYE TEST THROUGH THE COMPONENT TO SEE WHAT FAILED UNTIL A NISSAN REPRESENTATIVE REPLICATES THE PROBLEM.  THE MECHANIC TEST DROVE IT FOR 20 MILES AND THE PROBLEM DIDN'T SURFACE, WHICH IT WOULDN'T ACCORDING TO MY EXPERIENCES.  NOW, THE DEALER IS SENDING IT HOME WITH AN EMPLOYEE WHO COMMUTES 50 MILES OR SO EACH DAY TO SEE IF IT REPLICATES BEFORE THEY CAN RUN ANY OTHER DIAGNOSTIC (DYE) TEST.  THE WRITE UP MANAGER WAS SURE THE MECHANIC HAD CALLED NISSAN AND THEY HAD NOT SEEN THIS PROBLEM BEFORE.  TOMORROW, MAY 31, I SHOULD HAVE MORE INFORMATION FOR YOU ON THIS PROBLEM IF YOU WOULD LIKE TO HEAR THE RESULT.*AK",
        "vin": "3N1CB51DXYL"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/08/2000",
        "dateOfIncident": "01/04/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 718490,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK BUMPER- ON 1/4/00 MY HUSBAND BACKED INTO A CONCRETE POLE.  HE WAS NAVIGATING A TIGHT SPACE AND WAS PROCEEDING WITH EXTREME CAUTION.  BOTH HE AND HIS COWORKER PASSENGER INDICATE THAT HE WAS GOING AT MOST 3 MPH AS HE KNEW A POST WAS THERE.  KNOWING THAT IT WAS A TIGHT SPACE, HE WAS GOING TO USE THE SLOW SPEED AND THE POST TO INDICATE WHEN TO PULL FORWARD IF HE BUMPED IT.  WHEN HE BACKED INTO THE POLE, MY HUSBAND PULLED FORWARD, GOT OUT OF THE VEHICLE TO LOOK AT THE BUMPER.  HE SAW THAT THE POLE HAD HIT THE BUMPER AT A LOCATION WHERE TWO PIECES MEET.  THE BUMPER ON THE LEFT SIDE HAD COLLAPSED, SEPARATING FROM THE VEHICLE, AND THE POLE HAD HIT THE BODY.  OBVIOUSLY, THIS DOES NOT MEET THE SAFETY STANDARDS FOR A REAR BUMPER.  WE HAVE CONTACTED NISSAN OF CERRITOS, WHICH CLAIMS THAT IT IS NOT RESPONSIBLE FOR THE MANUFACTURED PRODUCT, THEREFORE, THEY DID NOT FEEL A RESPONSIBILITY TO FIX IT.  WE CONTACTED CUSTOMER SERVICE AT NISSAN ON SEVERAL OCCASSIONS.  THEY FINALLY LEFT A MESSAGE TODAY DENYING OUR CLAIM.  MY HUSBAND TOOK THE CAR TO THE NISSAN BODYSHOP FOR AN ESTIMATE AND WAS TOLD THAT THE BODY DAMAGE HAD OCCURRED BECAUSE HE HAD \"HIT THE WEAK PART IN THE BUMPER.\"  THE X-TERRA HAS AN UNIQUE BUMPER IN THAT THE METAL PART OF THE BUMPER DOES NOT RUN THE LENGTH OF THE REAR AND IS CAPPED WITH PLASTIC \"BUMPERS\" AT EACH END.  FOR THE FRONT GRILL, THE PLASTIC HAS CRACKED ABOVE THE BUMPER FROM NORMAL DRIVING.  PLEASE HELP US BECAUSE THE PEOPLE AT NISSAN HAVE NOT LISTENED TO US AND HAVE BEEN SARCASTIC ABOUT OUR CONCERNS.  AT ONE POINT, THE OWNER/GENERAL MANAGER ACTUALLY ASKED ME IF I, \"HAD BEEN IN FRONT OF THE CAR SINCE YOU BOUGHT IT.\"  WE ARE MOST CONCERNED ABOUT THE REAR BUMPER AS PART OF THE REAR IS ONLY \"PROTECTED\" BY A PLASTIC FACADE.  IF THIS HAD OCCURRED AT A HIGHER SPEED OR THE RESULT OF A REAR END ACCIDENT, SIGNIFICANT DAMAGE AND INJURIES COULD HAVE OCCURRED.  *AK",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2000",
        "dateOfIncident": "02/05/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 718348,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "SENTRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN OWNER OF THE SUV OF THE YEAR. 2000 NISSAN SENTRA. JUST CURIOUS TO KNOW IF YOU WOULD BE INTERESTED TO FOLLOW UP ON A STORY OF A PROBLEM THAT I HAVE JUST DISCOVERED IN MY VEHICLE. IT SEEMS THAT NISSAN MAY HAVE A PROBLEM WITH THE VEHICLE PAINT. I HAVE JUST WASHED MY XTERRA AND NOTICED RUST SPOTS ON EVERY MAJOR PANEL OF THAT VEHICLE. IT JUST LOOKS UNBELIEVEBLE. WITHIN THE YEAR THIS WILL BE A RUST  BUCKET !!!! NOT EVEN THINK OF THE LOSS OF POTENTIAL RESELL VALUE !!!! NISSAN WILL MOST LIKELY NOT BE VERY HAPPY ABOUT THAT. JUST A NOTE . THIS SUV WAS MANUFACTURED IN JUNE AND PURCHASED IN JULY OF 1999 !!!! I AM AVAILABLE TO SPEAK WITH YOU IF YOU NEED TO FOLLOW UP ON THIS . I CAN BE REACHED AT 315-637-7674 ANYTIME.  THANKS.  NO SAFETY DEFECT LISTED IN SUMMARY.  *AK",
        "vin": "5N1ED28T2YC"
    }
]