[
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/14/2020",
        "dateOfIncident": "09/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A RECALL FOR OTHER VEHICLES BUT NOT MINE. LEFT BREAKLIGHT DOESN'T LIGHT UP, TILL YOU MOVE AND DOWN THE TURNSIGNAL LEVER. THEN THE LEFT BREAK LIGHT LIGHTS UP. SO WHY ISN'T MY MODEL IN THIS RECALL ? I FOUND THIS ON A BRAVADA THREAD AND LOTS OF AUTO PARTS STORES SELLING THE PART FOR IT.",
        "vin": "1GHDT13W3Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/23/2011",
        "dateOfIncident": "09/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426886,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HAZARD SWITCH INTERFERING WITH TURN SIGNAL OPERATION - THE RIGHT TURN SIGNAL BECAME INOPERATIVE - ALL BULBS LIT UP EXCEPT FOR THE RIGHT SIDE MARKER LIGHT WHEN THE RIGHT TURN SIGNAL WAS TURNED ON; HOWEVER, THE MARKER LIGHT AND ALL OTHERS THAT ARE SUPPOSED TO FLASHED WITH THE 4-WAY FLASHERS.  ALL BULBS AND THE FLASHER UNIT WAS REPLACED WITH NEGATIVE RESULTS.  DURING FURTHER EXAMINATION ON 9/23/11 WHEN THE FLASHER SWITCH WAS JIGGLED THE TURN SIGNAL BEGAN WORKING AND THEN STOPPED BUT THEN WORKED AGAIN EACH TIME THAT THE TURN SIGNAL SWITCH WAS JIGGLED.   THERE HAS BEEN A RECALL FOR A SIMILAR ISSUE WHERE THE HAZARD SWITCH INTERFERED WITH THE STOP LAMPS - CAMPAIGN ID NUMBER: 08V231000.   TWO DEALERSHIPS AND OLDSMOBILE WERE CONTACTED REGARDING THIS AND THE ANSWER WAS THAT THERE ARE NO OPEN RECALLS FOR THIS VEHICLE.  ONE OF THEM MENTIONED THAT A RECALL HAD BEEN DONE IN A YEAR PRIOR TO 2008 WHICH INVOLVED REPLACING THE HAZARD SWITCH.  AN OLDSMOBILE REP STATED THAT THE 2008 RECALL ONLY PERTAINED TO VEHICLES WITH CERTAIN VIN NUMBERS BUT COULD NOT CONFIRM THAT THE REPLACEMENT HAZARD SWITCH INSTALLED IN A PREVIOUS RECALL WAS NOT FROM THE SAME STOCK AS THE SWITCH INSTALLED IN THE VEHICLES THAT HAD THE HAZARD SWITCH REPLACED IN THE 2008 RECALL.  *TR",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/02/2011",
        "dateOfIncident": "07/17/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416735,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "PLASTIC CLAMP HOLDING POSITIVE BATTERY CABLE TO RH SPLASH GUARD BROKE OPEN ALLOWING CABLE TO SHIFT FORWARD AND DROOP ONTO TOP OF IDLER ARM. SUBSEQUENT DETERIORATION OF CABLE JACKET CAUSED CABLE TO SHORT ON IDLER ARM, ENERGIZING CHASSIS OF VEHICLE WHEN ATTEMPTING TO RESTART, HEATING UP PARKING BRAKE CABLE, BURNING LH KICK PANEL, CARPET, INSULATION, AND PARKING BRAKE CABLE GROMMET AT FLOOR OF VEHICLE.  SOLUTION WILL INCLUDE INSTALLATION OF STEEL/RUBBER HOLDING CLAMP.  *KB",
        "vin": "1GHDT13W3Y2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "11/09/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 OLDSMOBILE BRAVADA. WHILE DRIVING APPROXIMATELY BETWEEN 5-10 MPH, THE CONTACT APPROACHED A STOP SIGNAL AND THE ABS BEGAN TO ENGAGE SUDDENLY. THE CONTACT WAS ABLE TO CONTINUE IN OPERATION WITH AN INCREASE IN THE STOPPING DISTANCE. WHEN REACHING THE DESTINATION, THE CONTACT DISABLED THE ABS FUSE. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 114,000. UPDATED 03/15/11*LJ  UPDATED 03/21/11",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2009",
        "dateOfIncident": "09/03/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282808,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*. THE CONTACT OWNS A 2000 OLDSMOBILE BRAVADA. THE CONTACT STATED THAT THE FUEL GAUGES ON THE INSTRUMENT CONTROL PANEL  DISPLAYS INACCURATE READINGS OF THE AMOUNT OF FUEL INSIDE OF THE FUEL TANK. AS A CONSEQUENCE HIS RISK FOR VEHICLE CRASH INCREASES SHOULD THE VEHICLE UNEXPECTEDLY STALL BECAUSE OF DEPLETED FUEL LEVELS.THE VEHICLE HAS NOT BEEN INSPECTED TO DETERMINE THE CAUSE OF THE FAILURE. THE CURRENT AND FAILURE MILEAGES WERE 48,000.",
        "vin": "1GHDT13W0Y2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/23/2009",
        "dateOfIncident": "01/28/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 OLDSMOBILE BRAVADA. THE REAR BRAKE LIGHTS FAILED WHICH MADE IT DIFFICULT FOR ANOTHER DRIVER TO KNOW THAT THE VEHICLE WAS BRAKING AND/OR STOPPED WHICH COULD AVOID A CRASH. THE DEALER REPAIRED THE VEHICLE ACCORDING TO RECALL #  08V231000 (EXTERIOR LIGHTING:BRAKE LIGHTS:SWITCH). THE CONTACT WAS RESPONSIBLE FOR PAYING $372.00 FOR THE REPAIR. THE MANUFACTURER STATED THAT HE SHOULD NOT HAVE PAID FOR THE REPAIR AND THEY WOULD REIMBURSE HIM; HOWEVER, SHORTLY AFTERWARDS A REPRESENTATIVE DENIED REIMBURSEMENT STATING THAT HIS VEHICLE WAS EXCLUDED IN THE RECALL. THE CONTACT HAS NOT RECEIVED A REIMBURSEMENT. THE FAILURE MILEAGE WAS 75,008 AND THE CURRENT MILEAGE WAS 75,667.",
        "vin": "1GHDT13W2Y2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/25/2008",
        "dateOfIncident": "09/19/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243467,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2000 OLDSMOBILE BRAVADA IN JUNE 2008. THE VEHICLE PASSED STATE REQUIRED INSPECTION WITH NO ISSUES. ON 9/19/08 THE STOP LAMPS UNEXPECTEDLY BLEW ALL FOUR BULBS AND THE STOP LAMPS NOW DO NOT WORK AT ALL EVEN WITH NEW BULBS INSTALLED. UPON DOING INTERNET SEARCH FOR CAUSES AND REPAIR SOLUTIONS, I FOUND THAT THERE HAD BEEN A RECALL IN 2001 REGARDING STOP LAMP/HAZARD FLASHER SWITCH FAILURES. I CALLED A LOCAL DEALER AND THEY INFORMED ME THAT THE HAZARD FLASHER SWITCH HAD BEEN REPLACED DURING THE FIRST RECALL AND THEY COULD NOT DO THE REPAIR AGAIN, HOWEVER, I ALSO FOUND THAT A NEW RECALL HAD BEEN ISSUED IN 2008 FOR THE SAME ISSUE. I HAVE REPLACED THE BULBS AND STOP LAMP SWITCH WITH NO RESOLUTION TO THE FAILURE OF THE STOP LAMPS. THE DEALERSHIP SAYS IT WILL COST ME $100 TO GET THE WIRING CHECKED AND I WILL BE RESPONSIBLE FOR THE COST OF REPAIRS. IF THIS IS AN ONGOING ISSUE WITH THE LIGHTING I BELIEVE THAT THE TESTING SHOULD BE AT NO COST. FAILURE OF THE STOP LAMPS PUTS MY FAMILY AT SERIOUS RISK OF INJURY IF VEHICLES BEHIND ME ARE NOT ABLE TO KNOW THAT I AM STOPPING. THE HIGHMOUNT LIGHTS,FLASHERS,BACK UP LIGHTS AND TURN SIGNALS ARE NOT AFFECTED...ONLY THE LOWER STOP LAMPS. I ALSO HAVE AN ISSUE WITH MULTI FUNCTION TURN SIGNAL SWITCH BEING LOOSE ON STEERING COLUMN. I HAVE PURCHASED THE PART BUT HAVE NOT HAD IT INSTALLED AS OF THE DATE OF THIS LETTER. WHEN ENGAGING THE SWITCH TO MAKE A RIGHT TURN THE WINDSHIELD WIPERS COME ON. THIS ONLY HAPPENS WHEN MAKING A RIGHT TURN. *TR",
        "vin": "1GHDT13W1Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/28/2008",
        "dateOfIncident": "07/26/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235997,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 OLDSMOBILE BRAVADA.  THE CONTACT HEARD A LOUD NOISE COMING FROM THE MUFFLER.  WHEN THE VEHICLE WAS INSPECTED BY A MECHANIC, HE WAS INFORMED THAT THE TRANSMISSION MOUNT CROSS MEMBER OF THE FRAME WAS ROTTED AND READY TO BREAK LOOSE.  THE CURRENT AND FAILURE MILEAGES WERE 85,000.    UPDATED 09/23/08 *BF  THE CONSUMER ALSO STATED THERE WAS A GASKET LEAK IN THE EXHAUST. UPDATED 09/25/08. *JB",
        "vin": "1GHDT13WXY2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2007",
        "dateOfIncident": "10/30/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204040,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 60000 MILES HAVE HAD TO HAVE TOTAL BRAKE SYSTEM REPLACED ABS COMPUTER , BRAKE POWER BOOSTER , MASTER CYLINDER,A BRAKE LINE . ALSO MY 4 WHEEL DRIVE TRANSFER CASE HAS BEEN BOUND-UP FOR 9 MONTHS MY VEHICLE WONT EVEN ROLL ON AN INCLINE. *JB",
        "vin": "1GHDT13W5Y2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/05/2007",
        "dateOfIncident": "07/05/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195362,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 OLDS INTRIGUE THAT MY MOTHER LEFT TO ME WHEN SHE PASSED AWAY IN 2002.  I ALSO JUST PURCHASED A USED 2001 PONTIAC GRAND AM FOR MY TEENAGED SON.  BOTH OF THESE VEHICLES HAVE THE TURN SIGNAL/MULTI-FUNCTION SWITCH MALFUNCTION.  I CALLED THE 1800 NUMBERS ASSOCIATED WITH THE RECALL (ON THIS SITE) AND WAS TOLD THAT SINCE IT WAS NOT A CURRENT RECALL, I COULD NOT HAVE THE SWITCHES REPAIRED AS PART OF THE RECALL.  DO I HAVE ANY RECOURSE REGARDING THE RECALL?  I WAS NOT NOTIFIED OF EITHER VEHICLE IN REGARDS TO THE RECALL SINCE I WASN'T THE OWNER AT THE TIME.  PLEASE ADVISE.  THANKS!*AK",
        "vin": "1G3WX52H3YF"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/06/2007",
        "dateOfIncident": "05/29/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192533,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 OLDSMOBILE BRAVADA    WHEN ENGINE WAS TURNED OFF ALL ELECTRICAL FEATURES IN CAR DIED, INCLUDING POWER DOOR LOOKS. THE MANUAL RELEASE MECHANISM FORTHE DOORS WERE ALSO INOPERATIVE. THEY APPEARED TO BE HELD DOWN BY THE DOOR LOCK POWER CIRCUIT. THIS TRAPPED THE DRIVER INSIDE.    POLICE WERE CALLED AND THEY WERE UNABLE TO OPEN THE DOORS AND CONFIRMED THAT THE DRIVER WAS UNABLE TO USE THE MANUAL RELEASE MECHANISM SINCE IT WAS ALSO INOPERATIVE. THEY FINALLY BROKE A WINDOW TO RELEASE THE DRIVER.    CAR WAS TOWED AND IT WAS DISCOVERED THAT THE BATTERY WAS DEAD. THE BATTERY WAS REPLACED AND A FULL ELECTRICAL CHECK OF THE SYSTEM WAS PERFORMED AND THE PROBLEM COULD NOT BE REPRODUCED. NO REASON WAS PROVIDED FOR THE FAILURE.    THE OLD BATTERY IS STILL ACCESSIBLE BUT I BELIEVE THAT THE PROBLEM IS SOMEWHERE IN THE COMPUTER CIRCUITS THAT KEPT THE LOCKS IN THE LOCK POSITION UNTIL THE BATERY FAILED.",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/17/2007",
        "dateOfIncident": "12/25/2005",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188161,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 96 GRAND AM IN 98 FOUND IT TO BE WRECKED AFTER I TRADED IN 02 FOR OLD'S BRAVADA WITH MILEAGE ROLL BACK AT BAD DEALERSHIP MULTIPLE PROBLEMS SEVERAL WRECKS DUE TO MANUFACTURES DEFECT LET GO BACK TO GMAC FINANCING BECAUSE BAD DEALERS COULD FINANCE BAD DEALS THROUGH THEM. PLEASE CONTACT ME ASAP!!!!!  *JB",
        "vin": "1GHDT13W5Y2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/19/2007",
        "dateOfIncident": "03/16/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185511,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT STATED THAT 2000 OLDSMOBILE BRAVADAS  WERE RECALLED UNDER NOTICE 01V364006, BUT HIS VEHICLE'S VIN WAS NOT INCLUDED.  THE CONTACT STATED THAT THE FLASHERS, BRAKE LIGHTS AND TURN SIGNALS  DID  NOT WORK DUE TO SAME FAILURE THAT WAS STATED IN RECALL 01V364006.  THE VEHICLE HAS NOT BEEN REPAIRED AS OF YET.      THE FAILURE AND CURRENT MILEAGE WERE BOTH  64,000. *AK  THE CONSUMER VEHICLE WAS NOT INCLUDED IN THE RECALL.  UPDATED 04/09/07. *JB",
        "vin": "1GHDT13W7Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2006",
        "dateOfIncident": "07/01/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 OLDSMOBILE BRAVADA BEGAN SMOKING IN THE REAR OF THE VEHICLE.  *TS  THE VEHICLE WAS DAMAGED FROM THE DRIVER'S DOOR ON BACK.  BOTH REAR TIRES AND RIMS MELTED.  FIRE DEPT COULD NOT DETERMINE WHAT CAUSED THE FIRE.  NO INJURIES WERE SUSTAINED.  *NM",
        "vin": "1GHDT13W2Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/21/2006",
        "dateOfIncident": "03/20/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153349,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUN GEAR WENT OUT IN MY 200 OLDSMOBILE BRAVADA.  *JB",
        "vin": "1GHDT13W1Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/13/2005",
        "dateOfIncident": "10/24/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED CAR FROM THE DEALER, BUT THE CAR HAS A PROBLEM. THE SALESMAN WHO SOLD  ME THE CAR AT THE DEALER TOLD ME THAT THEY WERE GOING TO FIX IT AND THEY TRIED TO FIX IT 4 TIMES ALREADY. AFTER 4 TRIES THE PROBLEM IS STILL THERE. I THINK THEY ARE WAITING FOR THE 30 DAY GUARANTEE TO END BEFORE I DO ANYTHING ABOUT IT, SO THEN I NEED TO PAY FOR THE REPAIRS MYSELF. THEY KEEP TELLING THAT THE CAR IS FIXED, BUT THE PROBLEM IS STILL THERE. I CAN FEEL THE PROBLEM EVERY TIME I DRIVE, AND THEY ADMIT THAT THEY CAN FEEL IT AS WELL, WHEN THEY TEST DRIVE THE CAR. *NM",
        "vin": "1GHDT13W7Y2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "10/23/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "STEEL RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BRIDGESTONE TIRE   P215/70R15 MS SEPARATED AND TREAD CAUSED DAMAGE TO VEHICLE INCLUDING : FUEL TANK DAMAGE , TORE THE FUEL FILLER PIPE AWAY FROM VEHICLE AND TORE OFF GAS CAP. COSMETIC DAMAGE AS WELL INCLUDING REAR BUMPER AND SIDE RUNNING BOARD    ON 2000 OLDSMOBILE SILHOUETTE THIS IS THE SECOND SUCH INCIDENT.  THE FIRST TIME THIS HAPPENED WAS IN JULY OF 2005 AND THE FRONT TIRE SEPARATED  DESTROYING FRONT HEADLIGHT ,BUMPER FRONT QUARTER PANEL . APPROX $1700.00 DAMAGE.  *NM",
        "vin": "1GHDX03E3YD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2005",
        "dateOfIncident": "07/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR IS ALL WHEEL DRIVE.  THE FRONT HUBS SEEM TO ONLY LAST ABOUT 20K MILES.  THERE IS LESS THAN 60K MILES ON THE CAR.  IT NEEDS NEW HUBS THIS WILL BE THE 3RD SET ON THE CAR. THIS COULD BE DANGEROUS IF THEY FAIL.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/20/2005",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099481,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER EXPERIENCED THE SAME PROBLEM  AS STATED IN  RECALL 01V364000  CONCERNING MULTI FUNCTION SWITCH.  THE DEALERSHIP WOULD NOT REPAIR THE PROBLEM FREE OF CHARGE BECAUSE THE VIN WAS NOT INCLUDED.   *AK   *SC *JB",
        "vin": "1GHDT13W7Y2"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/20/2005",
        "dateOfIncident": "04/07/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125757,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WELL I JUST WANTED TO REOPRT THAT THE CAR THAT I HAVE HAS BEEN LIKE THIS SINCE I FIRST GOT IT AND THEIR WAS NO WARRANTY ON THE CAR AND I DID NOT NOTICE THE PROBLEM BUT NOW TO ME, I SEE ALOT OF CARS THAT ARE THE SAME AND IT HAS THE SAME PROBLEMS LIKE THE AIR BAG LOOKS LIKE IT IS GONNA POP OUT THE SIGNAL LIGHTS ARE ALWAYS GOING OUT THE IN THE FRONT, THE STEERING WHEEL TO ME ITS NOT SAFE CAUSE U CAN FEEL WHEN U TURN OR STOP THERE IS THIS FUNNY FEELING THAT U CAN FEEL AND WHEN U STOMP THE BREAKS U FEEL THE BRAKES AND STEERING IT FEELS LIKE ITS LOOSE AND I DONT THINK THAT THIS VEHICLE IS SAFE.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/08/2005",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116634,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VINYL ON THE DASHBOARD STARTED TO PEEL.  ITS NOW ALL WRINKLED UP.  FRONT BRAKE SYSTEM ON  MY ALERO NEED TO BE CHANGED MORE OFTEN THAN OTHER CARS IVE OWNED IN THE PAST.  AVE BEEN THROUGH 2 RECALLS ALREADY WITH THIS CAR.. WITH THE GEAR SHIFT, AND THE BLINKERS. WISH I HAD BOUGHT SOMETHING ELSE.*AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/07/2005",
        "dateOfIncident": "04/04/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 OLDS BRAVADA SUV, I RECENTLY HAD A PROBLAM WITH MY TURN SIGNALS AND TOOK THE BACK TO THE DEALERSHIP FOR REPAIR. THEY SAID I HAD A SHORT IN THE SWITCH AND REPAIRED IT.I PAID THE BILL. WHEN I GOT HOME I STARTED SOME RESEARCH ON THE INTERNET.THE PART NUMBER 26100837 SWITCH (TURN SIGNAL / HAZARD SWITCH) APPEARS TO BE THE SAME PART THAT WAS LISTED IN A RECALL NOTICE FROM  GM BY THE NATIONAL HIGHWAY SAFETY ADMIN. MY QUESTION IS , IS THIS THE SAME PART, AND SHOULD I HAVE TO PAY FOR A RECALLED ITEM?*AK",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2005",
        "dateOfIncident": "06/15/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUAL ELECTRICAL PROBLEMS WITH OLDSMOBILE BRAVADA.   *BF   THE HEAD LAMP FAILURE WAS RECURRENT.  THEY WOULD GO OFF AND STAY OFF FOR 30 MINUTES THEN COME BACK ON FOR A MINUTE TO A HALF AN HOUR, THEN WORK INTERMITTENTLY THROUGH OUT THE DAY, THE BATTERY WENT DEAD, THE COMPASS UNIT FAILED  NUMEROUS TIMES.   *SC      *JB",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/22/2004",
        "dateOfIncident": "09/29/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A  MALFUNCTIONING FUEL GAUGE.  THE TANK MODULE AND FUEL TANK CRACKED.  REPLACEMENT OF DEFECTIVE PARTS.  *BF   THE CONSUMER REQUESTED REIMBURSEMENT.   *SC",
        "vin": "1GHDT13W3Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/21/2004",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097422,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING OVER 60 MPH THE  VEHICLE VIBRATED.  THE TRANSFER CASE WAS DEFECTIVE.  THE CLUTCH  IN THE TRANSFER CASE WAS REPAIRED.*JB",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/10/2004",
        "dateOfIncident": "08/03/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CATALYTIC CONVERTER ELEMENT IS BROKEN INSIDE CAUSING RATTLING.   CAR HAS BEEN ON ROAD FOUR YEARS  IN NOVEMBER 2004.  GENERAL MOTORS AND DEALER STATED THERE IS NO DEFECT, THIS IS NORMAL.  COST OF REPAIRS ESTIMATED BETWEEN $750 AND $1,000.  BELIEVE THIS IS NOT NORMAL AND IS A MANUFACTURE DEFECT.   PREVIOUS OWNED GM CARS OWNED HAVE IN EXCESS OF 150,000 WITH ORIGINAL EXHAUST COMPONENTS.",
        "vin": "1GHDT13W3Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083937,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ON A SLIGHT INCLINE WITH ITS NOSE UP  VEHICLE ROLLED. UPON BEING IN A PARK POSITION IT TORQUED DOWN. CONSUMER SPOKE WITH OLDSMOBILE REGARDING THE ROLLING PROBLEM WHICH RECURRED. *AK",
        "vin": "1GHDT13WXY2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/15/2004",
        "dateOfIncident": "02/03/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079516,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE ACCELERATOR PEDAL VEHICLE HESITATED TO ACCELERATE.  AFTER APPLYING THE ACCELERATOR PEDAL NUMEROUS TIMES VEHICLE ACCELERATED UNCONTROLLABLY.  VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION, AND  MECHANIC  DETERMINED THAT THE VEHICLE SPEED  CONTROL SENSOR NEEDED TO BE REPLACED, AND HE REPLACED IT.  HOWEVER, THE PROBLEM RECURRED.  *AK    SOMETIMES, IT REQUIRED TO PRESS ACCELERATOR PEDAL HARD TO BLEND WITH HIGHWAY TRAFFIC.  PROBLEM HAS OCCURRED IN SPEED BETWEEN 30 TO 50 MPH.  *LA",
        "vin": "1GHDT13W3Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 BRAVADA IS LEAKING OIL.   *MR   THE OIL WAS LEAKING FROM THE FRONT OF THE ENGINE EACH TIME THE OIL AND FILTER WAS REPLACED.  THE PROBLEM WAS DIAGNOSED AS THE OIL COOLER HOSE (P/N 15194578 PIPE AND 15194579 HOSE) LEAKING.   *SC  *JB",
        "vin": "1GHDT13W9Y2"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "04/28/2004",
        "dateOfIncident": "03/16/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10071769,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SEAT BELT DISCONNECTED WHILE DRIVING, AND THE PLATE STROKE THE DRIVER IN THE EYE.  WHEN THIS OCCURRED IT OBSTRUCTED THE DRIVER'S VISIBILITY,  RESULTING  IN AN ACCIDENT. *AK",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/31/2004",
        "dateOfIncident": "03/31/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064289,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT UPPER BALLJOINT BROKE WHILE DRIVING AROUND 20 MILES PER HOUR. I TURNED A CORNER GOING SLOW AND FELT A BUMP. THE STEERING WHEEL WAS NOT TURNED STAIGHT, BUT THE BRAVADA WAS GOING STRAIGHT.*AK",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/08/2004",
        "dateOfIncident": "03/07/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060696,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 MODEL YEAR OLDSMOBILE BRAVADA.  YESTERDAY THE WARNING INDICATOR LIGHT FOR THE AIRBAG CAME ON AND STAYED ON.  I LOOKED IN THE OWNERS MANUAL WHICH INDICATED THIS SHOULD BE CHECKED IMMEDIATELY BY A GM DEALER.  I TOOK THE VEHICLE INTO THE DEALERSHIP FIRST THING THIS MORNING AND THEY INDICATED THE \"AIRBAG MODULE\" UNIT (AN ELECTRONIC COMPONENT) HAD FAILED AND WOULD NEED TO BE REPLACED.  I AM EXTREMELY CONCERNED BY THE FAILURE FOR NO REASON OF A CRITICAL SAFETY COMPONENT ON MY VEHICLE SINCE UNTIL IT IS FIXED, THE AIRBAGS WILL NOT WORK AND THIS DEFECTIVE SAFETY FEATURE PLACES ME AND PASSENGERS AT RISK.  I COMPLAINED TO GM BUT THEY DID NOT SEEM CONCERNED AND COULD NOT GIVE ME THE NAME OF A GOVERNMENT AGENCY TO CONTACT TO REGISTER A COMPLAINT.  I BELIEVE THIS ISSUE IS MORE WIDESPREAD THAN JUST MY VEHICLE, IS A MAJOR SAFETY CONCERN TO OTHER CAR OWNERS WITH THIS SAME AIRBAG MODULE AND SHOULD BE INVESTIGATED TO INITIATE A RECALL OF THIS DEFECTIVE PART.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070339,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST PURCHASED MY 2000 BRAVADA IN DECEMBER OF 2002 AND IT HAD LESS THAN 25,000 MILES ON IT.  I DO NOT DO HEAVY DRIVING, MOSTLY OPEN ROAD AND NO TOWING, AND WAS VERY SURPRISED WHEN ALL OF A SUDDEN MY TRANSMISSION WENT OUT TWO MONTHS AND 1,700 MILES AFTER THE POWER TRAIN WARRANTY EXPIRED.  WHEN I CALLED THE DEALERSHIP AND TALKED TO THE REPAIR PERSON HE KNEW WHAT WAS WRONG EVEN BEFORE I TOLD HIM (THE REVERSE AND OVERDRIVE WENT OUT BUT THE OTHER DRIVES WERE FINE) AND HE SAID THAT THIS WAS A COMMON PROBLEM WITH BRAVADAS.  IMAGINE MY SURPRISE!  THEN OLDSMOBILE INDICATED THEY WOULD ONLY PAY FOR 50% OF THE REPAIR. I AM CURRENTLY TRYING TO WORK WITH THEM TO COVER IT ALL BECAUSE IT IS OBVIOUSLY A DEFECT IN THE TRANSMISSION AND IS NOT AN ISOLATED INCIDENT.  I HADN'T HEARD ANYTHING ABOUT THIS, BUT NOW THAT I LOOK ON THE INTERNET THERE ARE QUITE A FEW PEOPLE WHO HAVE HAD SIMILAR PROBLEMS.  THE COMPANY SHOULD BE TAKING CARE OF THIS.",
        "vin": "1GHDT13W2Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/12/2004",
        "dateOfIncident": "12/27/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED IN 2003 THAT ON TRIPS OF 2 HOURS OR MORE THAT OUR BRAVADA WILL STALL AND I'LL PULL OVER FOR 5-10 MINUTES LETTING IT REST AND THEN WILL START IT BACK UP AND THEN ANOTHER 1/2 HOUR DOWN THE ROAD IT WILL STALL AGAIN.  MOST NOTICEABLY THIS HAPPENED TO ME ON DECEMBER 27, 2003 DURING A ROAD TRIP BACK FROM VIRGINIA TO GEORGIA WHERE THE VEHICLE STALLED 5 TIMES.  THIS WAS VERY FRUSTRATING AND TAKES AWAY MY CONFIDENCE TO TAKE THIS VEHICLE ON LONG TRIPS.   *LA",
        "vin": "1GHDT13W2Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2003",
        "dateOfIncident": "12/02/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049448,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MANY MECHANICAL PROBLEMS WITH MY VEHICLE SINCE THE DAY I PURCHASED IT (NEW!). I HAVE HAD SEVERAL OCCASIONS WHERE THE OXYGEN SNESOR WAS BAD, I CURRENTLY HAVE A PROBLEM WITH THE DOME OVERRIDE SWITCH. IF I HAVE IT ACTIVATED, PUSHED IN, IT WILL CAUSE MY LIGHTS TO STAY ON AND ALSO CAUSES MY PERSONAL ALARM (LIKE THE ONE ON MY REMOTE KEYLESS ENTRY) TO GO OFF QUITE OFTEN. WHEN THE DOME OVERRIDE IS DISENGAGED, ALL SEEMS FINE. THE MOST RECENT ISSUE THAT I HAVE IS WITH THE HEATING SYSTEM. THIS ONE'S A WINNER, ESPECIALLY BECAUSE THIS IS WINTER AND SNOW AND FREEZING TEMPERATURE SEASON, HERE IN THE NORTHEAST. I HAVE LITTLE OR NO HEAT. I DRIVE AN AVERAGE OF 110 MILES PER DAY. WE HAVE FLUSHED THE SYSTEM, REPLACED THE THERMOSTAT AND I AM LUCKY TO HAVE HEATED SEATS, BECAUSE I'D PROBABLY HAVE HYPOTHERMIA BY THE TIME I GOT TO WORK IF I DIDN'T. I HAVE OWNED THREE OTHER OLDS BRAVADAS AND I HAVE STOOD BY THEM, HAPPY WITH EVERYTHING THE VEHICLE HAD TO OFFER. AFTER THIS ONE IS PAID OFF, I STRONGLY DOUBT THAT I WILL EVEN LOOK AT PURCHASING A GM VEHICLE AGAIN! *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": "07/22/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HINGES ON THE DRIVER SIDE DOORS WERE DETERIORATING. WHICH MADE THE DOORS DIFFICULT TO CLOSE.  THE DEALER HAVE INFORMED THE CONSUMER THAT ALL FIVE DOORS WILL EXPERIENCE THE SAME PROBLEM. MANUFACTURER IS AWARE OF THE PROBLEM.  *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/18/2003",
        "dateOfIncident": "11/03/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047098,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A MY2000 OLDSMOBILE BRAVADA FROM A PRIVATE PARTY.  UPON DRIVING THE VEHICLE HOME, I REALIZED THAT THE BRAKE LIGHTS DID NOT FUNCTION.  UPON FURTHER INVESTIGATION, I FOUND THAT THE HAZARD FLASHERS ALSO DID NOT WORK.  I FOUND A RECALL NOTICE ON THE NHTSA WEBSITE WHICH COVERS THIS VEHICLE, WHICH DESCRIBES THE MALFUNCTION PERFECTLY.  UPON CONTACTING THE OLDSMOBILE DIVISION OF GENERAL MOTORS, I WAS TOLD BY THE CUSTOMER SERVICE REPRESENTATIVE THAT THE VEHICLE IN QUESTION HAD BEEN REPAIRED IN 2001 AS REQUIRED BY THE RECALL CAMPAIGN.  WHEN I INFORMED THE INDIVIDUAL THAT THE VEHICLE AGAIN HAD THE SAME MALFUNCTION, I WAS TOLD THAT SINCE GM HAD SATISFIED THE REQUIREMENT TO REPAIR THE VEHICLE ALREADY, IT WOULD BE MY RESPONSIBILITY TO TAKE IT TO A DEALER AND HAVE IT REPAIRED AT MY COST.  MY CONCERN IS THAT THERE ARE LIKELY OTHERS WHO HAVE HAD THE SAME PROBLEM REPAIRED BY A GM DEALER, AND ARE UNAWARE THAT THE PROBLEM EXISTS AGAIN WITH THEIR.  DRIVING A VEHICLE WITHOUT BRAKE LIGHTS IS EXTREMELY DANGEROUS.  I STRONGLY BELIEVE THAT THIS NEEDS TO BE LOOKED AT AGAIN, AS THE 'FIX' PERFORMED DID NOT CURE THE PROBLEM LONG TERM.",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "07/12/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040718,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPING AT A TRAFFIC LIGHT OR A STOP SIGN VEHICLE WOULD ACCELERATE WITHOUT WARNING. OWNER HAS MADE CONTACT WITH THE DEALERSHIP.*AK                THE THROTTLE BUTTERFLY PLATE BECAME STUCK IN THE THROTTLE BODY ASSEMBLY.  WHEN THE CONSUMER TRIED TO ACCELERATE FROM A STOP ADDITIONAL PRESSURE ON THE GAS PEDAL WAS REQUIRED.  THE THROTTLE THEN SNAPPED OPEN AND THE VEHICLE JUMPED FORWARD UNEXPECTEDLY.   *TS    *NLM",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/03/2003",
        "dateOfIncident": "10/02/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041160,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTOR FAILURE AFTER A LITTLE OVER 40,000 MILES MY BRAKES STARTED PULSATING AND I HAD, AT BEST, 60% OF THE NORMAL BRAKING POWER.  BRAKING IS SO POOR THAT ABS WON'T ACTIVATE EVEN WITH FULL BRAKING ACTION.  I REMOVED THE PADS AND ROTORS ONLY TO FIND THAT THE ROTORS WERE DISINTEGRATING.  APPARENTLY, ON MANY MODELS INCLUDING THE 2000 BRAVADA SUCH AS MINE, GM IS USING A BI-METAL ROTOR.  AFTER 30,000 MILES OF BRAKING THE HEAT WILL EVENTUALLY CAUSE SEPARATION OF THE TWO METALS AND FLAKING OF THE SURFACE OF THE ROTOR ALONG WITH ABNORMAL RUSTING AND PITTING ON THE ROTOR SURFACE.  I HAVE READ SEVERAL REVIEWS POSTED ON EDMUNDS.COM STATING THE SAME PROBLEM.  GM CUSTOMER SERVICE DENIES ANY PROBLEM AS WELL AS ANY OTHER COMPLAINTS AND IS UNWILLING TO FIX IT.  *LA",
        "vin": "1GHDT13W7Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2003",
        "dateOfIncident": "06/06/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039438,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE AWD LIGHT COMES ON, WAS TAKEN TO DEALER ONLY FOR THE SAME THING TO HAPPEN AGAIN.  HAD TO TAKE BACK TO THE DEALERSHIP AGAIN.",
        "vin": "1GHDT13W9Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/23/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031899,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED, THE VEHICLE LOST POWER.  *AK   THE VEHICLE ALSO LOST POWER WHEN TURNING CORNERS AND THEN STARTED AGAIN.  *SCC  *JB",
        "vin": "1GHDT13W9Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/18/2003",
        "dateOfIncident": "08/11/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE FRONT BALL JOINT BROKE WHILE DRIVING IN THE RAIN, CAR SLID, I DID MANAGE TO MISS THE SEMI'S TIRES THE CAR WAS HEADED FOR. AFTER CHECKING THE NTSA WEB PAGE I FIND THAT THERE HAVE BEEN OTHER COMPLAINTS/RECALS ON THE BALL JOINT AND SUSPENSION SYSTEM, I HAVE NEVER RECEIVED ANY INFORMATION REGUARDING THIS. I DID PAY DEARLY TO HAVE THE ONE SET OF BALL JOINT REPAIRED. IS THE RECALL STILL AVALIABLE FOR THE REST OF THE BALL JOINTS AND THE SUSPENSION SYSTEM. MY CAR ONLY HAS 38K MILES ON IT AND IS FALLING APART. PLEASE HELP.*AK",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2003",
        "dateOfIncident": "08/09/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033867,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE TURNING  STEERING  WHEEL TOWARDS THE RIGHT  STEERING LOCKED UP WITHOUT WARNING.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/18/2003",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAD BAD PULSATION IN BRAKE PEDAL AND WHOLE VEHICLE VIBRATED WHEN BRAKING, DEALER SAID FRONT ROTORS WERE WARPED, REPLACED FRONT ROTORS W/ 46,900 MI, STILL HAD SMALL VIBRATION AND W/IN 2  WEEKS  PULSATION STARTED AGAIN AND CONTINUED TO GET WORSE, TOOK TO ANOTHER MECHANIC WHO SAID FRONT ROTORS WERE WARPED AGAIN, BACK ROTORS ARE LITERALLY DISINTEGRATING.  I HAVE 132,000MI ON MY NISSAN AND HAVE NEVER HAD WARPED ROTORS OR HAD ROTORS REPLACED SO I KNOW IT'S NOT MY DRIVING.    *NLM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/05/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018142,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING THE VEHICLE IT WOULD BE HARD TO TURN THE STEERING WHEEL AROUND CORNER",
        "vin": "FILLIN"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "04/30/2003",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIRING HARNESS IN OUR 2000, OLDSMOBILE BRAVADA CAUGHT FIRE.  IT APPEARS AS THOUGH IT CHFED THROUGH AND SHORTED.  THE CHAFING OCCURRED WHERE THE HARNESS WAS BENT OVER THE A/C RETURN (?).  IT APPEARS TO BE A DESIGN FLAW.  VEHICLE WAS TOWED AND IS BACK WITH DEALER WHERE WE PURCHASED.",
        "vin": "1GHDT13W7Y2"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/30/2003",
        "dateOfIncident": "08/03/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10013680,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATER CORE RUPTURED ON I-40 NEAR GALLUP, NM.  THE HOT VAPOR INJURED MY WIFE, KAREN MOODY AND OUR CHILDREN JOSEPH, 11 AND JESIKA, 15.  KAREN HAS LUNG DAMAGE AND SEIZURES. NEUROLOGICAL PROBLEMS AND OTHER PROBLEMS.  JOSEPH HAS NASAL PROBLEMS AND SEIZURES AND NEUROLOGICAL PROBLEMS.   *NLM",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "03/04/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10009770,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WITHOUT WARNING.  THE DEALER INDICATED THAT THIS  PROBLEM WAS CAUSED BY ELECTRICAL PROBLEM, BUT THEY COULD NOT LOCATE IT.  THE FAILURE RECURRED WHILE DRIVING AND RESULTED IN AN ACCIDENT.  *NLM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2003",
        "dateOfIncident": "12/22/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004420,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSFER CASE ACTUATOR FAILED. *DT",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2002",
        "dateOfIncident": "06/26/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8014968,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING VEHICLE WOULD NOT SHIFT INTO REVERSE. DEALER NOTIFIED.*AK",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/22/2002",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8014463,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A CLUNKING NOISE IS COMING FROM FRONT END OF VEHICLE.   DEALERSHIP IS AWARE OF PROBLEM.*AK",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/15/2002",
        "dateOfIncident": "07/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT TIRE SEPARATED FROM THE VEHICLE WHILE IN MOTION.  TWO WEEKS AGO BRAKES AND ROTORS WERE CHANGED. MECHANIC STATED THERE WAS A DEFECT WITH THE LUGS: NUTS. PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/27/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763572,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUAL PROBLEM WITH WINDSHIELD CLEARING OF FOG, AND ICE ON THE PASSENGER SIDE OF THE WINDSHIELD RESTRICTING VISIBILITY AND A SAFETY CONCERN.  HAD IN TO DEALER IN DENVER, CO TWO TIMES, AND CONTACTED CUSTOMER SERVICE FOR OLDSMOBILE, AND THEY STATE IT WAS DESIGNED THAT WAY, AND THEY WILL DO NOTHING TO CORRECT THE PROBLEM, IT WAS ENGINEERED THAT WAY.  I HAVE VISITED WITH GM CORPORATE, AND THEY HAVE THE SAME STANCE.  THE PROBLEM HAS HAD A SECOND DEALER OPINION, AND THEY ADJUSTED THE FLOW DIVERTOR, BUT STILL A MINIMUM OF AIR GOING TO THE PASSENGER SIDE AND VISIBILITY IS STILL IMPAIRED.  THEY DID INDICATE THERE HAVE BEEN OTHER COMPLAINTS OF A SIMILAR NATURE, BUT HAD TO PRY TO GET TECHNICAL SERVICES TO ADMIT TO THAT.  IT IS A VERY SERIOUS CONCERN TO ME SINCE MY VISION IS ALREADY LIMITED BY AN OLD INJURY, AND IT IS REALLY AN UNCOMFORTABLE FEELING TO HAVE A WINDSHIELD THAT WON'T REMAIN CLEAR.*AK",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "4 BATTERIES HAVE BEEN REPLACED DURING THE FIRST 25000 MILES, DEALER HAS HAD TO RELOAD DATA THAT IS MISSING, VEHICLE SOMETIMES LOSES POWER TO A NUMBER OF SYSTEMS, HEADLIGHTS INOPERATIVE, ELECTRONIC COMPASS MALFUNCTIONS, THE RADIO OPERATES ERRATICALLY, THE DOME LIGHTS DONT TURN OFF, THE VEHICLE SECURITY SYSTEM ACTIVATES FOR NO REASON, THE POWER DOOR LOCKS WILL NOT OPEN ELECTRICALLY, THE COMPUTER CODES HAVE BEEN CHECKED, PARTS HAVE BEEN REPLACED BUT THE PROBLEM EXISTS.  NLM",
        "vin": "1GHDT13W7Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/15/2002",
        "dateOfIncident": "05/13/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING LESS THAN 10 MPH, HEARD A RUMBLING AND VIBRAITON LIKE A TIRE HAD BLOWN OUT. CONSUMER TRIED TO GET CAR OFF THE ROAD WHEN PASSENGER'S SIDE TIRE BENT INWARD, AND DRIVER'S TIRE WENT OUTWARD. ALSO, THERE WERE NO BRAKES. CONSUMER COASTED TO A STOP. TOOK VEHICLE TO DEALER WHO STATED THAT WHEN CONSUMER MADE A TURN, THE CONTROL ARM CUT THE BRAKE LINE. *AK  CONSUMER STATES WHILE DRIVING SHE HEARD A NOISE THAT SOUNDED LIKE THE PASSENGER SIDE FRONT TIRE WENT FLAT, WHE PULLED OFF TO THE RIGHT WHEN THE FRONT END COLLAPSED, CONSUMER STATED THAT SHE COMPLAINED ABOUT FRONT END PROBLEMS PRIOR TO THIS INCIDENT.   *SLC",
        "vin": "1GHDT13W5Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/14/2002",
        "dateOfIncident": "05/06/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009851,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR END NEEDS AN OVER HAULING,  INCLUDING BEARINGS AND PINS ETC. CONTACTED DEALER, AND THE DEALER WAS NOT WILLING TO DO ANYTHING. PLEASE PROVIDE FURTHER INFORMATION. *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/13/2002",
        "dateOfIncident": "05/02/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "UPPER LEFT BALL JOINT BROKE WHILE DRIVING AT 20 MPH CAUSING LEFT FRONT TIRE TO  FALL OFF.*AK",
        "vin": "1GHQT13WXY2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/11/2001",
        "dateOfIncident": "12/09/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755515,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS SECOND FAILURE OF THIS BRAKE LIGHT \"MODULE\"*AK",
        "vin": "1GHDT13WXY2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2001",
        "dateOfIncident": "11/30/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899770,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN ON THE STEERING WHEEL IS TOO HARD TO PRESSE, DEALER TRIED TO FIX IT, HOWEVER THE PROBLEM STILL EXISTS.*AK  *SLC",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/17/2001",
        "dateOfIncident": "10/02/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 897885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT SWITCH HAD TO BE REPLACED 3 TIMES.  AT THIS TIME SWITCH HAS FAILED AGAIN.  *AK",
        "vin": "1GHDT13W2Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/17/2001",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 897887,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL IS STICKING AT FIRST START. ALSO,  AFTER COMING TO A COMPLETE STOP. VEHICLE NOT TAKEN TO DEALER YET.*AK",
        "vin": "1GHDT13W2Y2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/14/2001",
        "dateOfIncident": "01/01/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 894329,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS NO BRAKE LIGHTS OR SIGNAL LIGHTS.  DEALERSHIP IS AWARE OF  PROBLEM.  ALSO,  MULTI SWITCH NEEDS TO BE REPLACED. *AK",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2001",
        "dateOfIncident": "03/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE BECOMES STICKY, RESULTS IN A ABRUPT JERKY ACCELERATION WHEN STARTING FROM STANDSTILL. DANGEROUS IN CLOSE QUARTERS AS RAPID NOT-CONTROLLED FORWARD/REARWARD MOVEMENT OCCURS.*AK",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/21/2001",
        "dateOfIncident": "11/02/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 883643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE OF VEHICLE IT HAS SHIMMIED AND THERE WAS VIBRATION,  AN OLDSMOBILE SERVICE ENGINEER DISCOVERED THERE WAS  WRONG OIL IN TRANSFER CASE FROM FACTORY.  *AK",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2001",
        "dateOfIncident": "11/01/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 882780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCING A VIBRATION WHEN TAKING OFF FROM A STOP OR WHEN TURNING RIGHT OR  LEFT. *AK  THE DEALER CHANGED THE OIL IN THE TRANSFER CASE AND THE VIBRATION WAS REDUCED.  *YH",
        "vin": "1GHDT13W4Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/21/2000",
        "dateOfIncident": "12/20/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NONE",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/11/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 558632,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAS BEEN AN CONTINUING PROBLEM WITH VEHICLE PULLING TO THE RIGHT, VEHICLE REALIGNED THREE TIMES, 6/29/00, 7/14/00 & 8/8/00, PROBLEM FIRST DETECTED AT 916 MILES.   *CJ",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/11/2000",
        "dateOfIncident": "11/27/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 558632,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CRANKS BUT WILL NOT START AND HESISTATES ON ACCELERATION, THIS HAS BEEN A CONTINUING PROBLEM SINCE JULY OF 2000, RAN DRIVABILITY AND EMISSIONS TEST, FOUND HISTORY CODE B2980, REPLACED PASSLOCK SENSOR AND REPORGRAMMED VEHICLE, REPAIRED BENT PCV VALVE HOSE(9/14/00), FOUND TSB 00-06-01-014, CRANKSHAFT SENSOR REPLACED ACCORDING TO TSB(11/21/00).   *CJ",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DEPRESSING  GAS PEDAL IT WOULD STICK THEN RELEASE,  CAUSING VEHICLE TO ACCELERATE.  PLEASE PROVIDE FURTHER INOFRMATION.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/20/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 873515,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH THE CRUISE CONTROL ON, VEHICLE SUDDENLY ACCELERATES AND PULLS TO THE RIGHT.  VEHICLE HAS EXPERIENCED ELECTRICAL PROBLEMS (CONSUMER DID NOT STATE SPECIFIC PROBLEMS).  4-WHEEL DRIVE ILLUMINATED.   *SLC",
        "vin": "1GHDT13W5Y2"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/18/2000",
        "dateOfIncident": "10/11/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 734607,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BAD SHOCK ON FRONT PASSENGER SIDE",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 865411,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING NOTICED VEHICLE NOT CHANGING GEARS. CONSUMER WOULD HAVE TO DEPRESS  GAS PEDAL SEVERAL TIMES TO CHANGE GEARS. DEALER HAS BEEN NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2000",
        "dateOfIncident": "06/24/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 865046,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRE WHICH GOES TO FUSE GOT PINCHED TOGETHER, CAUSING IT TO RUB AGAINSTAND WEAR OUT, CAUSING A SHORT TO THE FUSE WHICH RESULTED IN VEHICLE STALLING UNEXPECTEDLY. VEHICLE WAS UNABLE TO RESTART.  HAPPENED 2 TIMES.   THE FIRST TIME  DEALER REROUTTED THE WIRE AND CHANGE FUSE, BUT THE PROBLEM REOCCURRED.  THE FUSE NEED TO BE CHANGE AGAIN.  PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": "1GHDT13W7Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2000",
        "dateOfIncident": "04/07/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 864673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER REPLACED HORN SYSTEM,  OWNER'S MANUAL RECOMMENDED TO SOUND THE HORN, AND  PRESS CENTER PADS ON  STEERING WHEEL.   CONSUMER MAINTAINED THAT OWNER'S MANUAL  DID NOT SAY THAT THERE WAS A SPECIAL PLACE TO PRESS CENTER PADS. HOWEVER,  ON THIS VEHICLE THERE  WAS A SPECIFIC PLACE WHERE THE HORN PADS WERE LOCATED,  AND DRIVER HAD TO PRESS VERY  HARD.  ANOTHER  VEHICLE ALMOST BACKED INTO  CONSUMER'S VEHICLE, AND CONSUMER COULD DO NOTHING, BUT SIT THERE.*AK",
        "vin": "1GHDT13W1Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2000",
        "dateOfIncident": "04/22/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 861221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  ELECTRONIC SHIFTER  WILL SHIFT VEHICLE INTO NEUTRAL WHEN COMING TO A STOP.  TO PROCEED,  VEHICLE HAS TO BE PUT INTO LOWER DRIVE GEARS.  DEALER HAS BEEN CONTACTED.  *AK",
        "vin": "1GHDT13W3Y2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/02/2000",
        "dateOfIncident": "04/29/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 722214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE FAILED TO ACCELARATE ON I-80 WYOMING AND STALLED 4 TIMES 0N I-70, COLORADO. *AK",
        "vin": "1GHDT13W3Y2"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/29/2000",
        "dateOfIncident": "10/04/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 722085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIBERCLASS COVER ON THE FRONT BUMPER ASSEMBLY DOES NOT FIT PROPERLY. THE COVER VIBRATES APPROXIMATELY ONE HALF INCH IN AN UP AND DOWN DIRECTION. THE FOG LIGHTS ARE ATTACHED TO THIS COVER ALSO, AND VIBRATE WITH IT. CONTACTS WITH THE DEALER AND MANUFACTURER HAVE PRODUCED NO SOLUTIONS TO THIS PROBLEM. I WAS TOLD BY TWO DIFFERENT DEALERS THAT \"ALL 2000 BRAVADAS ARE BUILT LIKE THAT\". THE OLDSMOBILE COMPLAINT LINE SUGGESTED THAT I INFORM YOU OF THE PROBLEM. SINCE IT IS A MANUFACTURERS DEFECT AND WILL PROBABLY NOT CAUSE A FATAL ACCIDENT I FIGURE YOU WILL FILE THIS COMPLAINT IN THE BIG ROUND CIRCULAR FILE. THANKS.  *AK",
        "vin": "1GHDT13WXY2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/12/2000",
        "dateOfIncident": "01/12/2000",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721358,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER IS CONCERNED ABOUT POSSIBLE VEHICLE FIRE DUE TO THE OIL LEAK.  *AK",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 856775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER THE DOORS ARE AJAR & NOT FULLY SHUT, THERE IS NO WARNING CHIMES OR LIGHTS TO INDICATE THIS PARTICULAR PROBLEM.  *AK",
        "vin": "1GHDT13W6Y2"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/14/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 854988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE DOES NOT HAVE THE WARNING LIGHT ON THE DASH PANEL TO LET CONSUMER KNOW THAT THE DOOR IS OPEN.  DEALER HAS BEEN CONTACTED, DEALER TOLD CONSUMER THAT THIS IS NOT A STANDARD. PROCEDURE.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/1999",
        "dateOfIncident": "09/28/1999",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 549301,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "A BLOWN FUSE CAUSED THEM BRAKE TO FEEL MUSHY AND CONSUMER COULD NOT GET THE SHIFT LEVER OUT OF PARK, WIRE PINCHED IN LEFT MOTOR MOUNT WHEN ENGINE ROCKS CAUSING FUSE TO BLOW.  NLM",
        "vin": "1GHDT13W3Y2"
    }
]