[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2022",
        "dateOfIncident": "03/01/2022",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11454910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "The engine service soon have been on for quite some time now. I tried to take it to several Smog  places to get it smogged , and the mechanic have told me that the Smog scanner cannot read the computer of my car.",
        "vin": "5n1ed28y7yc"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2020",
        "dateOfIncident": "12/09/2020",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11383398,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 65 MPH WHEN THE VEHICLE SUDDENLY SHUT OFF. THE CONTACT WAS ABLE TO COAST TO THE SIDE SHOULDER WHERE THEY GOT OUT THE VEHICLE. THE CONTACT NOTICED SMOKE COMING FROM UNDERNEATH THE FRONT END OF THE VEHICLE. THE CONTACT OPENED THE HOOD OF THE VEHICLE AND POURED WATER ONTO THE VEHICLE TO PUT OUT THE  FIRE HOWEVER THE FIRE INCREASED SLIGHTLY. THE CONTACT STATED BIGGER EFFORTS WERE MADE FROM HER AND ANOTHER DRIVER TO PUT OUT THE FIRE. A FIRE REPORT WAS NOT MADE. THE VEHICLE WAS TOWED. THE CONTACT HAD NOT TAKEN THE VEHICLE TO A DEALER. THE VEHICLE HAD NOT BEEN OFFICIALLY DIAGNOSED THE CONTACT LEARNED THAT THEIR VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 04V230000 (FUEL SYSTEM, GASOLINE), HOWEVER, THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. THE MANUFACTURER WAS NOT MADE AWARE. THE APPROXIMATE MILEAGE ON THE VEHICLE 241,496.",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/16/2020",
        "dateOfIncident": "06/17/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11349705,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IMMEDIATELY AFTER I EXITED MY BUILDING GARAGE AND MADE RIGHT TURN ON CITY STREET ON A CLEAR SUMMER DAY AFTERNOON THE ENGINE SOUND BEGAN ROARING AND VEHICLE SUDDENLY ACCELERATING. I TRIED TO CONTROL THE VEHICLE FORCIBLY HITTING ON THE BRAKES, SHIFTING GEARS TO NEUTRAL, TURNING OFF THE ENGINE BUT  THE VEHICLE KEPT ON GOING AND RAN-AWAY UNCONTROLLABLY TILL I MADE  TWO LEFT TURNS AND ENDED UP ON A SIDE WALK  WITH THE REAR TIRE BLOWN OUT AND THE CAR STOPPED AFTER COLLIDING WITH SOME PUBLIC UTILITY BOX. THE VEHICLE HAS INCOMPLETE RECALL #R0402 AND NHSTA RECALL #04V-230 REGARDING THE FUEL SENDING UNIT. THERE WAS A LOCAL POLICE REPORT #200057082. SUSPECTED CAUSES COULD BE FLAWS IN THE VEHICLE ELECTRONIC THROTTLE CONTROL SYSTEM THAT PRODUCED FAULTY SIGNAL OF FULLY DEPRESSED ACCELERATOR PEDAL.",
        "vin": "5N1ED28Y4YC"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/15/2020",
        "dateOfIncident": "04/15/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321193,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS 47 MPH IN A 45 MPH ROAD AND THE GUY BEHIND ME ILLEGALLY PASSED ME BY DRIVING ON THE OPPOSITE SIDE OF THE ROAD UNTIL HE WAS ABLE TO PASS ME CAUSING ME TO SLAM ON MY BRAKES AND SWERVE.  *TR",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/11/2019",
        "dateOfIncident": "11/01/2018",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166468,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA. WHILE STATIONARY, THE VEHICLE UNINTENTIONALLY ACCELERATED AND CRASHED INTO ANOTHER VEHICLE. THE AIR BAGS DID NOT DEPLOY. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE VEHICLE WAS NOT TAKEN TO A DEALER OR INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 270,000.",
        "vin": "5N1ED28T2YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "05/08/2016",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863885,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY I SMELLED A BURNING SMELL WHILE DRIVING ON THE HIGHWAY BUT IT WENT AWAY QUICKLY AND I COULDN'T FIND ANY SOURCE IN THE VEHICLE, SO I ASSUMED I JUST DROVE PAST SOMETHING THAT SMELLED BADLY. ON SUNDAY THE SMELL RETURNED, STRONGER. I STOPPED AND SHUT THE ENGINE OFF, AND SMOKE BEGAN POURING OUT FROM UNDER THE LEFT SIDE OF THE DASH AS I RAN TO DISCONNECT THE BATTERY.     ONCE THE SMOKE CLEARED AND THERE WAS NO CONCERN OF A FIRE BREAKING OUT I BEGAN TO INVESTIGATE THE CAUSE AND FOUND THE \"SMART ENTRANCE CONTROL UNIT,\" WHICH IS MOUNTED TO THE FAR LEFT SIDE OF THE VEHICLE UNDER THE DASH AND CONTROLS THE POWER LOCKS AND KEYLESS ENTRY, TO BE NOTICEABLY HOT. I UNPLUGGED THIS BOX AND REMOVED IT FROM THE VEHICLE. THE BOX HAD HEAT VISIBLE DAMAGE ON ITS EXTERIOR. I OPENED THE BOX TO INVESTIGATE FURTHER AND FOUND A LARGE ELECTRICAL COMPONENT THAT I BELIEVE WAS A METAL OXIDE VARISTOR WAS THE SOURCE OF THE HEAT/SMOKE/POSSIBLE FIRE, AND NEARBY COMPONENTS SUFFERED SIGNIFICANT HEAT DAMAGE.    I THINK THAT THIS CATASTROPHIC FAILURE OF A COMPUTER MODULE MAY BE A SAFETY DESIGN FLAW. IF I HAD NOT BEEN AWARE OF THE ODOR AND PULLED OVER AND QUICKLY DISCONNECTED THE BATTERY, THE VEHICLE COULD HAVE CAUGHT ON FIRE. THIS COMPUTER IS POWERED EVEN WHEN THE VEHICLE IS TURNED OFF, SO IT COULD HAVE STARTED A FIRE IN THE MIDDLE OF THE NIGHT AND CAUSED A HOUSE FIRE AS WELL.     I CHECKED EVERY FUSE IN THE VEHICLE AND ALL FUSES ARE THE CORRECT AMPERAGE (NOBODY HAS INSTALLED A HIGHER CURRENT FUSE IN PLACE OF A LOWER CURRENT ONE). IT WOULD SEEM LIKE THE CIRCUIT PROTECTION IS INADEQUATE TO INTERRUPT POWER TO THE COMPUTER IF IT FAILS.     MY POWER LOCKS/KEYLESS FUNCTIONED UP UNTIL THE INCIDENT AND THE CAR CONTINUES TO OPERATE WITHOUT THE KEYLESS ENTRY COMPUTER.    THE COMPUTER'S PART LABEL READS AS FOLLOWS:  CONT ASSY'SMART ENTRANCE  PART NO. 28595 7Z000  UTA PART NO. 601-1190-001  FCC ID: KOBUTAHZR",
        "vin": "5N1ED28Y0YC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788122,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA. THE CONTACT STATED THAT THERE WERE CRACKS IN THE WHEELS OF THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "5N1ED28T1YC"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2015",
        "dateOfIncident": "10/19/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785417,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA. WHILE DRIVING AT 50 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FUEL PUMP MELTED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "5N1ED28Y3YC"
    },
    {
        "components": "SERVICE BRAKES,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "10/16/2015",
        "dateOfIncident": "10/08/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782961,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA. WHILE DRIVING AT ANY SPEED, THE STEERING WHEEL SEIZED AND MADE AN ABNORMAL NOISE WHEN TURNED TO THE RIGHT. IN ADDITION, THE BRAKE PEDAL HAD TO BE DEPRESSED WITH FORCE IN ORDER TO BRING THE VEHICLE TO A STOP. THE CONTACT ALSO STATED THAT THE DRIVER SIDE WINDOW WOULD NOT CLOSE. THE VEHICLE WAS TAKEN TO A DEALER BUT THE DIAGNOSIS WAS NOT AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 147,300.",
        "vin": "5N1ED28Y0YC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/22/2015",
        "dateOfIncident": "05/22/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721010,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE CAR THIS MORNING.  THE ODOMETER, TACHOMETER AND SPEEDOMETER DID NOT WORK. THE ODOMETER WAS BLANK. I DROVE THE CAR AND THE SPEEDOMETER OR TACHOMETER DID NOT WORK. THIS SAME THING HAPPENED TO ME AT NIGHT, ABOUT A YEAR AGO. THE PANEL LIGHTS ALSO DID NOT WORK. THE NEXT DAY, EVERYTHING WORKED FINE. IT DID NOT CORRECT ITSELF THIS TOME. THE INSTRUMENTS ARE STILL NOT WORKING.",
        "vin": "5N1ED28T1YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/21/2013",
        "dateOfIncident": "05/19/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10513059,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS INVOLVED IN A HEAD-ON COLLISION WHEN A DRUNK DRIVER HIT HER WHILE DRIVING ON THE WRONG SIDE OF THE ROAD. HIS AIRBAGS DEPLOYED BUT NOT MY DAUGHTERS NISSAN XTERRA.  *TR",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510230,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENDING UNIT RUSTED AND CORRODED GAS GAUGE IN ACCURATE READING.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/21/2013",
        "dateOfIncident": "01/18/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493601,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "T/A",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I BOUGHT 4 GOODRICH LONGTRAIL TA 60,000 MILES TIRES FOR MY NISSAN SUV X-TERRA, 2 TIRES BOUGHT FROM TIRE KINGDOM ON 1/3/11  (INVOICE # [XXX]?RI )WHEN MY VEHICLE MILEAGE WAS 131,050, & 2 TIRES BOUGHT 9 DAYS LATER FROM FIRESTONE ON 1/12/11 (INVOICE # [XXX]) WHEN MY VEHICLE MILEAGE WAS 131,190 (I HAVE BOTH RECEIPTS).  I BOUGHT THE TIRES AT LOCAL ESTABLISHMENTS (2 BOUGHT AT FIRESTONE ON 49TH STREET NORTH IN PINELLAS PARK, FL 33781 PHONE: 727-544-6601, AND 2 BOUGHT AT TIRE KINGDOM IN TYRONE BLVD IN ST. PETERSBURG, FL 33711 PHONE:  727-345-2404).  WHILE CLEANING MY CAR AND WASHING THE TIRES ON 1/18/2013, I NOTICED THAT THE DRIVERS FRONT TIRE IS CRACKING WHERE THE TREAD MEETS THE SIDEWALL.   I AM VERY CONCERNED FOR MY LIFE AND THAT OF ANY PASSENGERS, SINCE THIS SHOULD NOT BE HAPPENING TO TIRES THAT ARE JUST 2 YEARS OLD.  MY AUTO MILEAGE AS OF 1/20/2013 IS 142,343.  THIS MEANS IN TWO YEARS SINCE I BOUGHT THESE TIRES, I HAVE TRAVELED ONLY 11,293 MILES.   I AM NOW CONCERNED FOR MY LIFE AND THAT OF ANY PASSENGERS WITH THESE GOODRICH MANUFACTURER DEFECTIVE TIRES.   THESE ARE EXTREMELY DANGEROUS DEFECTIVE TIRES, WHICH RUBBER IS CRACKLING AND I AM VERY CONCERNED THE TREAD WILL SEPARATE FROM THE SIDEWALL CAUSING A BLOW OUT AND A THREAT TO LIFE.  THIS IS THE ONLY VEHICLE I HAVE.  ON 1/19/2013 I WENT TO FIRESTONE AND POINTED OUT THE DEFECT SHOWING ALREADY IN ONE OF THE TIRES.  N/C ON INVOICE # [XXX] DATED 1/19/13 ROTATION OF TIRES NOT DONE AND DEFECT COMPLAINT NOT FIXED.  THE SALESMAN ACKNOWLEDGE DEFECT AND WANTED TO SELL ME BRAND NEW TIRES, WHICH I CAN'T AFFORD, AND SHOULD NOT HAVE TO PAY FOR MFTG DEFECT,.  THESE TIRES SHOULD ME COVERED UNDER GOODRICH LIMITED WARRANTY FOR WORKMANSHIP AND MATERIAL DEFECTS.  BUT, THE FIRESTONE SALESMAN DENIED COVERAGE THROUGH MFTG WARRANTY & HE SAID FIRESTONE DOES NOT PROVIDE FOR GOODRICH MANUFACTURER'S  WARRANTY, BUT I BOUGHT 2 OF MY TIRES FROM FIRESTONE!  MANY COMPLAINTS ON THESE TIRES POSTED ON WEBSITE: WWW.CONSUMERAFFAIRS.COM/TIRES/GOODRICH.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2012",
        "dateOfIncident": "10/20/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481419,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA. THE CONTACT STATED THAT WHILE TRAVELING 65 MPH, THE VEHICLE SUDDENLY LOST POWER. THE CONTACT MANAGED TO MERGE TO THE SIDE OF THE ROAD WHERE THE VEHICLE WAS TOWED TO A PRIVATE MECHANIC. THE MECHANIC CONFIRMED THAT THE DISTRIBUTOR HAD FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE. THE FAILURE AND CURRENT MILEAGES WERE UNAVAILABLE.   UPDATED 12/5/12 *CN  THE CONSUMER STATED A SENSOR ON THE DISTRIBUTOR WAS BAD WHICH CAUSED THE VEHICLE TO STOP RUNNING. UPDATED 12/10/12",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2012",
        "dateOfIncident": "04/19/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455905,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA. WHILE DRIVING 30 MPH, THE CONTACT STATED THAT THE VEHICLE HAD SUDDENLY STALLED WITHOUT WARNING. THE VEHICLE WAS INSPECTED BY THE CONTACT AND HE NOTICED THAT THE FUEL PUMP MAY BE DEFECTIVE. THE VEHICLE HAD NOT BEEN DIAGNOSED AND HAD NOT BEEN REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 143,000.",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/24/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445086,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING APPROX. 5 MINUTES WHEN CAR WARNING LIGHTS (CHECK ENGINE) AND ALL DASH WARNING LIGHTS CAME ON IMMEDIATELY THERE AFTER, CAR ENGINE SHUTS OFF.   CAR ENGINE WOULD TURN ON WHEN STARTED BUT AS SOON AS YOU ENGAGE THE TRANSMISSION BY MOVING FROM PARK TO DRIVE, AND PRESS THE GAS PEDAL, CAR ENGINE WOULD AGAIN CUT OFF.  AT NO OTHER TIME PRIOR TO THIS DID CHECK ENGINE LIGHT COME ON, OIL LIGHT, OR WATER TEMPERATURE GAGE SHOW ANY MALFUNCTION.   THE PROFESSIONAL MECHANIC THAT CHECKED MY CAR AND RAN DIAGNOSTIC TESTING CAN'T FIND ANY PROBLEMS.  HE SAYS HE HAS DRIVEN THE CAR BUT, CAN'T GUARANTEE THIS WILL NOT HAPPEN AGAIN.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/01/2011",
        "dateOfIncident": "10/25/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433809,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "RADIAL T/A",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 NISSAN XTERRA EQUIPPED WITH BF GOODRICH RADIAL LONG TRAIL T/A TIRES. SIZE P265/70/R15. THE CONTACT STATED THAT THE VEHICLE BEGAN TO VIOLENTLY SHAKE WHILE DRIVING 50 MPH. THE VEHICLE WAS THEN STOPPED AND THE CONTACT NOTICED THAT THE TREAD ON THE REAR DRIVER'S TIRE TORE AWAY FROM THE TIRE. A SPARE TIRE WAS INSTALLED AS A REPLACEMENT. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND OFFERED TO REPLACE THE FAILED TIRE. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2011",
        "dateOfIncident": "06/18/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10429464,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2000 XTERRA HAD BEEN FAIRLY RELIABLE UNTIL IT DIED OUT ON THE HIGHWAY.  REPLACED THE DISTRIBUTOR 3 MONTHS AGO, AND IT DIED OUT AGAIN WHILE DRIVING, LAST WEEK, AFTER HAVING YET ANOTHER DISTRIBUTOR PUT IN.  THE MECHANIC SUGGESTED THAT THE NISSAN-ISSUED RE-BUILT DISTRIBUTORS ARE THE PROBLEM.  HE'S NOW PUTTING A THIRD ONE IN, BUT HE'S GETTING IT FROM A DIFFERENT SOURCE THAN NISSAN.   I WAS STUNNED TO KNOW THAT NISSAN KNOWS ABOUT THIS PROBLEM BUT STILL SELLS INFERIOR PARTS.  THIS IS NOTHING TO FOOL AROUND WITH AND I'M LUCKY THAT I DIDN'T CAUSE OR GET INVOLVED IN AN ACCIDENT.  *KB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2011",
        "dateOfIncident": "08/27/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423466,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WHILE IDLING.  WHILE IDLING CAR BEGINS TO VIBRATE, RPM DROP DOWN AND ULTIMATELY CAR STALLS.  LEADING UP TO THIS INCIDENT, WHEN ACCELERATING FROM A STOP, WHEN PRESSING ON GAS PEDAL, CAR DOES NOT ENGAGE AND APPEARS TO DIE OUT; FORTUNATELY IT CATCHES AND CONTINUES ON.  THOUGHT IT WAS ISOLATED INCIDENT, HOWEVER, THIS LED TO THE IDLING PROBLEM.  TOOK VEHICLE TO MECHANIC, AND HE COULD NOT IDENTIFY PROBLEM AS NO ENGINE CODES REGISTERED, AND NO OBVIOUS MALFUNCTION WAS PRESENT.  THIS IS A VERY DANGEROUS SITUATION, AS CAR COULD STALL OUT WHILE MOVING.  THIS NEEDS TO BE ADDRESSED IMMEDIATELY BEFORE A STALL OCCURS ON THE HIGHWAY AND SOMEONE GETS HURT.  A REVIEW OF NISSAN WEBSITES HAS REFLECTED A PERSISTENT PROBLEM WITH THIS SPECIFIC VEHICLE.  THE PREVALENCE OF THIS PROBLEM WOULD LOGICALLY LEAD TO THE CONCLUSION THAT THIS IS A DESIGN PROBLEM THAT SHOULD BE INVESTIGATED BY NISSAN AND CORRECTED; AGAIN BEFORE SOMEONE GETS SERIOUSLY HURT.",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/30/2010",
        "dateOfIncident": "12/29/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373524,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN XTERRA. THE CONTACT STATED THAT THE TRANSMISSION BEGAN TO SLIP OUT OF GEAR. WHENEVER THE FAILURE OCCURRED IT WAS VERY DIFFICULT TO TAKE THE VEHICLE OUT OF PARK.  WHEN THE CONTACT WAS ABLE TO SHIFT OUT OF PARK, THE VEHICLE WOULD  NOT BE IN THE SAME GEAR AS SHOWN ON THE GEAR SHIFT INDICATOR. THE VEHICLE WAS NOT INSPECTED, BUT THE CONTACT STATED THAT NHTSA RECALL CAMPAIGN NUMBER 00V288000, POWER TRAIN:AUTOMATIC TRANSMISSION WAS IDENTICAL TO HIS FAILURE AND IT WAS ALSO RELATED TO THE CABLE LOCK PLATE ON THE TRANSMISSION. THE MANUFACTURER TOLD THE CONTACT THAT HIS VIN WAS NOT A PART OF THE RECALL. THE FAILURE AND CURRENT MILEAGES WERE 190000.",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/18/2010",
        "dateOfIncident": "03/14/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320636,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN XTERRA. THE CONTACT STATED THAT WHEN THE VEHICLE WAS PURCHASED, THE RIMS WERE CRACKED. THE CONTACT STATED THERE WERE NO RELATED RECALLS. THE DEALER WILL NOT REPAIR THE VEHICLE SINCE THE RIMS WERE NOT A SAFETY ISSUE. THE INFORMATION PROVIDED FROM THE RECALL 03V307000 REGARDING THE WHEELS ON THE VEHICLE WAS AVAILABLE TO THE DEALER; HOWEVER, THEY REFUSED TO REPAIR THEM.  THE FAILURE MILEAGE WAS 209000.",
        "vin": "5N1ED28T0YC"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/01/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE'S 2000 NISSAN XTERRA HAS ACTING STRANGE AFTER THE CAR PARKED. ALL LIGHTS(HEAD, BRAKE, SIGNAL, AND MARKING) ARE BLINKING NONE STOP FOR AWHILE. THIS HAPPENS AT LEAST TWO OR THREE TIMES A WEEK. *TR",
        "vin": "5N1ED28Y4YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "09/10/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304964,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A 2000 NISSAN XTERRA AN EVENT SIMILAR TO THE RECENT TOYOTA PROBLEMS OCCURRED (SEVERAL TIMES) ABOUT 7-8 YEARS AGO. IN ONE CASE THE CAR JUMPED A CURB AND HIT A TREE. IT WAS DRIVABLE, SO NO POLICE REPORT WAS FILED- AS NO DAMAGE WAS DONE TO ANYTHING OTHER THAN THE CAR- WHICH HAD ABOUT $2000 BODY DAMAGE. THE CAR WAS REPAIRED AND NISSAN SAID THEY WERE UNABLE TO DUPLICATE THE PROBLEM. AS A RESULT OUR INSURANCE WENT UP AND WE HAD TO PAY THE DEDUCTIBLE (ABOUT $500). IT HAPPENED ONCE MORE A FEW MONTHS LATER, WITH NO DAMAGE RESULTING. IN BOTH CASES THE CAR WAS SLOWING FROM <20MPH TO A STOP, AND PAVEMENT WAS SLICK BUT NOT REAL WET- WHEN THE ACCELERATOR REVVED UP FOR NO REASON. IT HAS NOT HAPPENED SINCE. THE ENGINE WAS REPLACED ABOUT 2 YRS LATER.  NISSAN HAS A RECORD OF A COMPLAINT FILED, BUT I LOST THE NUMBER. THE DATE LISTED BELOW IS FOR ONE ACCIDENT THAT HAPPENED (I THINK IT'S THE ONE, BUT IT MIGHT BE ANOTHER). *TR",
        "vin": "5N1ED28T3YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/17/2009",
        "dateOfIncident": "11/12/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292633,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLANT IS LEAKING AT THE HEAD GASKET ON MY SINGLE OWNER 2000 NISSAN XTERRA XE V6 4WD. I HAD THIS CHECKED BY 3 DIFFERENT CERTIFIED TECHNICIANS AND THEY ALL POINTED OUT THE SAME ISSUE. THE CAR HAS ONLY 65K MILES ON IT. THE COST OF REPAIRING THIS IS MORE THAN $1200. SEEMS LIKE LOT OF NISSANS HAS SIMILAR ISSUE, YET NO RECALLS ON THIS PROBLEM. I HAVE OWNED CARS THAT HAD MORE THAN $100K MILES AND NEVER HAD TO REPLACE THE HEAD GASKET. CURRENTLY, A TEMPORARY SEAL IS PUT IN PLACE, YET, I SEE FEW DROPS OF COOLANT ON THE GARAGE FLOOR. *TR",
        "vin": "5N1ED28Y5YC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/05/2009",
        "dateOfIncident": "05/29/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LEAF SPRING BROKE IN HALF ON BOTH SIDES OF THE VEHICLE, ONE FELL COMPLETELY OFF THE TRUCK. SERIOUSLY AFFECTS CONTROL AND HANDLING OF THE VEHICLE. POSSIBLE SAFETY ISSUE TO ANY VEHICLE FOLLOWING BEHIND IF THIS LARGE PIECE OF STEEL FALLS OFF AT HIGHWAY SPEED. COULD ALSO JAM INTO ROADWAY AND CAUSE VEHICLE TO FLIP? *TR",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/19/2009",
        "dateOfIncident": "04/18/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266004,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2000 NISSAN XTERRA ON A OHV TRAIL WHEN I LOST BRAKE PRESSURE AND HAD MY \"BRAKES\" LIGHT COME ON.  AFTER INVESTIGATION, I FOUND THAT MY BRAKE LINE HAD RUSTED THROUGH WHERE THE LINE PASSES BY THE PASSENGER SIDE EXHAUST MANIFOLD.  THE SPOT WAS COMPLETELY HIDDEN UNDERNEATH WHERE THE OEM HAD PLACED A PROTECTIVE HEAT WRAP ON THE LINE.  THE HEAT WRAP WAS SATURATED WITH WATER AND THEREFORE PROMOTED THE LINE TO RUST THROUGH.  THIS CAUSED A LOSS OF BRAKE FLUID TO POWER TO MY REAR BRAKES.  I HAD TO REMOVE THE BRAKE LINE FROM THE ANTI SKID CONTROLLER CUT IT AND CLAMP IT OFF.  I REFILLED THE MASTER CYLINDER AND WAS ABLE TO REGAIN THE USE OF MY FRONT BRAKES AND GET THE VEHICLE HOME.  I WILL BE REPLACING BOTH THE FRONT AND REAR BRAKE LINES FROM THE ANTI SKID BOX TO THE DISTRIBUTION POINT AND HAVING THE BRAKE SYSTEM PURGED AND REFILLED.  THE OLD PARTS WILL BE KEPT. *TR",
        "vin": "5N1ED28YXYC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/02/2009",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253590,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS LIGHT COMES ON INTERMITTENTLY. SEEMS TO HAPPEN AFTER HEAVY RAIN OR WHEN THERE IS A LOT OF MOISTURE IN THE AIR. VEHICLE HAS BEEN BACK TO THE DEALER 3 TIMES IN THE LAST MONTH. AT FIRST THEY TOLD ME IT WAS A DEFECTIVE G SENSOR. THAT WAS REPLACED FOR APPROX. $600. THE SECOND TIME IT WENT BACK, THE DEALER STATED THAT THE SENSOR NEEDED TO BE RECALIBRATED. IT'S CURRENTLY AT THE DEALER FOR THE 3RD TIME. THE SERVICE REPS HAVE BEEN VERY POLITE, HOWEVER I DID PAY $600 AND HAVE BEEN BACK TO THE DEALER TWICE SINCE THEN.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/30/2008",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253317,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A 2000 NISSAN XTERRA.  WHILE I SELDOM USE THE EMERGENCY BRAKES, I NEEDED IT FOR PARKING ON A HILL THAT PARTICULAR DAY.  I DISCOVERED THAT THE BRAKES DID NOT GRAB AS THEY SHOULD.      UPON INVESTIGATION, IT WAS DETERMINED THAT A PULLEY WITHIN THE BRAKE DRUM ASSEMBLY WAS SEIZED.   THE MATERIALS OF THE PIN AND PULLEY DID NOT APPEAR TO HAVE ANY CORROSION OR ABNORMAL DAMAGE.      I HAVE SINCE LEARNED THAT THERE ARE QUITE A FEW OTHER PEOPLE ON THE INTERNET WHO HAVE EXPERIENCED THIS ISSUE.  AS A MATTER OF FACT THE DEALERSHIP WAS ON BACK ORDER FOR THE ENTIRE REAR BRAKE ASSEMBLY WITH A ONE MONTH LEAD TIME (P/N:  44000-7Z2000, 44010-7Z200).  I HAVE ALSO WRITTEN TO NISSAN WITH NO RESPONSE.      I STRONGLY FEEL THAT THIS IS THE RESULT OF A DESIGN ERROR BY NISSAN WHERE THE PARTS SEIZE OVER TIME.  BECAUSE THIS IS A SAFETY RELATED DEVICE, IT SHOULD BE INVESTIGATED AND ADDRESSED.  MY TRUCK IS CURRENTLY AT THE DEALERSHIP FOR REPAIR AND I HAVE REQUESTED FOR THE DEFECTIVE PARTS TO BE SAVED AS REFERENCE. *TR",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "11/30/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250418,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES OF MY WIFE'S 2000 XTERRA FAILED DUE TO POOR ENGINEERING. FORTUNATELY IT HAPPEN WHEN MY WIFE WAS DRIVING AT LOW SPEED ON THE BACK ROAD WE LIVE ON. THE HARD LINE FROM THE MASTER CYLINDER TO THE FRONT BRAKE IS ROUTED PAST A MANIFOLD HEAT SHIELD. THE LINE IS INSTALLED SO IT RUBS ON THE HEAT SHIELD. THE HEAT SHIELD EVENTUALLY CUTS INTO THE LINE CAUSING IT TO FAIL. THE CAR IS AT A LOCAL REPAIR SHOP WHERE A NEW BRAKE LINE WILL BE INSTALLED. *TR",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/14/2008",
        "dateOfIncident": "02/10/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242098,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING PROBLEMS WITH 2000 NISSAN XTERRA ALWAYS DYEING WHILE RUNNING AND HAVING TO HAVE IT PULLED HOME, LIKE THE GAS IS RUNNING OUT, NOW IT WON'T START,BEEN HAVING TROUBLE FOR EIGHT MONTHS,I CAN'T GET IT STARTED TO TAKE IT TO A DEALER,THE NEW BATTERY I PUT IN IT IS COMPLETELY DEAD, BUT WHEN CHARGER PUT ON IT, IT CUTS OUT SO BAD IT WONT RUN I HAD A FUEL FILTER PUT IN IT ,STARTED TO TOWN HAD TO HAVE IT TOWED HOME.  *TR",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/24/2008",
        "dateOfIncident": "12/09/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236051,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN XTERRA WITH RECALL REPAIR THAT WAS REPAIRED. CONSUMER STATES THAT THE VEHICLE WAS REPAIRED FOR THE RECALL PROBLEM AND IS NOW WAITING FOR REIMBURSEMENT. SHE STATES THAT KNOW ONE WILL RETURN HER CALLS.  *KB  THE CONSUMER STATED THE VEHICLE WAS SHUTTING OFF ON ITS OWN.  THE FUEL TANK SENDING UNIT WAS REPLACED. *JB",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2008",
        "dateOfIncident": "05/14/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233419,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN XTERRA.  THE CONTACT STATED THAT HIS SON WAS DRIVING THE VEHICLE AND IT WOULD STALL AFTER HE FILLED IT WITH GASOLINE.  HE DROVE FOR APPROXIMATELY FIVE MILES BEFORE THE STALLING BEGAN.  THE IGNITION WOULD NOT START, BUT THERE WAS NO SIGNIFICANT LOSS OF POWER.  HE TOOK THE VEHICLE TO FIRESTONE AND THEY PERFORMED AN ENGINE DIAGNOSTIC TEST AND FOUND THAT THE FUEL SENDING UNIT WAS DEFECTIVE.  THE DEALER STATED THAT THE FUEL SENDING UNIT WAS INCLUDED IN NHTSA CAMPAIGN ID NUMBER 04V230000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP).  THE CONTACT WAS INFORMED TO TAKE THE VEHICLE TO THE DEALER TO HAVE THE REPAIR MADE FOR FREE.  THE DEALER PERFORMED A DIAGNOSTIC TEST, VERIFIED THE DEFECT, AND REPLACED THE UNIT.  THE DEALER THEN CALLED THE CONTACT AND INFORMED HIM THAT THE VEHICLE WAS NOT STARTING, AND THEY WOULD HAVE TO CHANGE THE FUEL PUMP.  THE MANUFACTURER STATED THAT THEY WOULD NOT PAY FOR THE FUEL PUMP REPAIR.  HE WAS REFERRED TO A REPRESENTATIVE, WHO STATED THAT THEY WOULD GET BACK WITH HIM IF THEY PLANNED TO ASSIST.  THE CONTACT WAS LATER INFORMED THAT DUE TO THE MILEAGE ON THE VEHICLE AND BECAUSE THE FUEL PUMP WAS NOT THE SAME AS THE FUELING UNIT, THEY WOULD NOT MAKE THE REPAIR.  THE SPEED WAS UNKNOWN.  THE CURRENT MILEAGE WAS APPROXIMATELY 150,700 AND FAILURE MILEAGE WAS 150,129.",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2008",
        "dateOfIncident": "06/04/2008",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10232611,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN XTERRA 2WD VEHICLE.     SECOND OWNER.    OWNED FOR 6.5 YEARS.    NO MODIFICATIONS WERE MADE TO VEHICLE BY EITHER ORIGINAL OWNER, OR MYSELF.    ONLY DEALER INSTALLED OPTIONAL COMPONENT WAS A TRAILER HITCH.    CAR TRAVELED LESS THAN 1000 MILES IN LAST CALENDAR YEAR.    ON DATE IN QUESTION, CAR WAS STARTED AND DRIVEN AT 8:00 AM APPROXIMATELY 5 MILES TO A PARKING DECK.    CAR THEN SAT IN PARKING DECK UNTIL 12:00 PM.    CAR WAS THEN DRIVEN BACK TO ITS ORIGINAL ORIGIN AND PARKED BY APPROXIMATE TIME OF 12:30 PM.    SHORTLY AFTER 9:00 PM, CAR WAS BELIEVED TO BE SOURCE OF IGNITION WHICH RESULTED IN A HOUSE FIRE AND DESTROYED HOUSE STRUCTURE, AS WELL AS FOUR OTHER VEHICLES.    CAR WAS INVESTIGATED BY FORMER CHIEF ARSON INVESTIGATOR FOR ATLANTA, GA. HIS DETERMINATION AS TO SOURCE OF FIRE WAS WIRE HARNESS INSIDE XTERRA. BELIEVED TO BE A CASE OF A CONTACT REMAINING LIVE AND STARTING A FIRE SOMEWHERE BETWEEN THE CONSOLE SHIFT LEVER AND BEHIND THE CENTER OF THE DASH.    CAR COMPLETELY DESTROYED- LITERALLY. VIN UNKNOWN INFORMATION RESIDES WITH INSURANCE COMPANY.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2008",
        "dateOfIncident": "01/14/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217818,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 NISSAN XTERRA.  WHILE DRIVING AT ANY SPEED, THE VEHICLE WOULD HESITATE AND THEN SHUT OFF WITHOUT WARNING.  THE FAILURE OCCURRED TEN OR MORE TIMES.  THE VEHICLE WOULD NOT ALWAYS RESTART IMMEDIATELY.  THE VEHICLE WAS TAKEN TO A DEALER AND THEY REPLACED THE FUEL SENSOR.  THE CURRENT MILEAGE WAS 135,000 AND FAILURE MILEAGE WAS 134,000.   UPDATED 03/18/08  *TR",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2008",
        "dateOfIncident": "01/15/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216270,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE DASH OF THE VEHICLE GETS HOT, SUMMERTIME, OPERATING THE HEATER IN THE WINTER OR WHEN THE DASH LIGHTS ARE ON, THE GAGE CLUSTER FAILS. THE SPEEDOMETER, TACHOMETER, FUEL AND TEMP GAUGES ALL FAIL. THE ENGINE WILL SUDDENLY HESITATE AND NOT MAKE ENOUGH POWER TO MAINTAIN SPEED. SHIFTING INTO NEUTRAL AND REVVING THE ENGINE WILL GET THE POWER BACK, BUT THE GAUGES WILL NOT WORK UNTIL THE INSTRUMENT CLUSTER IS COOLED.  *TR",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/26/2007",
        "dateOfIncident": "11/26/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209987,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GAUGES (TEMPERATURE, GAS, SPEEDOMETER AND RPM) ALL GO DEAD WHILE DRIVING.  THE ERROR HAS BEEN OCCURRING SINCE MY CAR WAS ABOUT 6 MONTHS OLD.  I HAVE READ OTHER NISSAN CUSTOMERS HAVING THE SAME ISSUE WITH 2000 YEAR MODELS, HOWEVER NO RESOLUTION HAS COME TO MY ATTENTION.  THE DIGITAL ODOMETER ALSO DOES NOT REGISTER MILES AS THEY ARE ADDED TO THE VEHICLE.  SEEMS LIKE A SAFETY ISSUE TO ME.  I REALLY WOULD LIKE TO KNOW HOW FAST I'M GOING.  LUCKILY I HAVEN'T GOTTEN A SPEEDING TICKET YET.  IF I DO, NISSAN SHOULD PAY!  *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/22/2007",
        "dateOfIncident": "11/14/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209682,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "3 TIMES IN THE PAST YEAR WHEN PURCHASING TIRES OR BRAKES WHEEL STUDS HAVE BROKEN OFF. THE TIRE SHOP TOLD ME THIS HAS BEEN A BIG PROBLEM WITH NISSAN XTERRAS. I WAS CHARGED $25 FOR EACH WHEEL STUD AND LUG NUT. IT IS GETTING EXPENSIVE. SINCE I HAVE TO ENTER AN INCIDENT DATE I ENTERED THE LAST OCCURANCE.  *TR",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/20/2007",
        "dateOfIncident": "11/20/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209571,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OXYGEN SENSOR ... CAUSE MY ENGINE SERVICE LIGHT TO GO ON AND OFF ... IT SELF . WHEN THE LIGHT IS ON MY CAR BURN TONS OF GAS ... CONSUMPTION DOUBLED ...  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/03/2007",
        "dateOfIncident": "03/21/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204801,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 46,820 MILES ON OUR 2000 NISSAN XTERRA, WE WERE OUT OF WARRANTY BY 1 MONTH WHEN THE TRANSMISSION SIMPLY WENT OUT. THE ENGINE RAN FINE BUT THE TRANSMISSION WOULD NOT ENGAGE. HAD THE VEHICLE TOWED TO NISSAN DEALER FOR SERVICE.  THEY TOLD ME THE TRANSMISSION NEEDED TO BE REPLACED AND WAS NOT COVERED UNDER WARRANTY.  CONTACTED NISSAN CORPORATE IN CALIFORNIA AND THEY TOOK MY INFORMATION. AFTER A WEEK OF PRESSURING FOR A RESPONSE, THEY FINALLY TOLD ME THEY WOULD NOT COVER THE REPAIR AND THAT IF I HAD MADE ALL OF OUR REPAIRS AT THE LOCAL DEALER THAT MAYBE THEY WOULD HAVE DISCOUNTED THE REPAIR.  WE HAD ALL THE SERVICE PERFORMED AT THE LOCAL DEALER WITH THE EXCEPTION OF 4-5 OIL CHANGES THAT WERE PERFORMED AT JIFFY-LUBE.  ALL SERVICE & MAINTENANCE HAD BEEN PERFORMED ON SCHEDULE AND THEY STILL REFUSED TO HONOR THE WARRANTY.  WE NEVER TOWED ANYTHING (NO HITCH INSTALLED) AND LIVE IN A FLAT TOPOGRAPHICAL LOCATION (MIAMI).  WE HAD THE CAR TOWED TO A LOCAL TRANSMISSION SHOP AND HAD A REBUILT TRANSMISSION INSTALLED.  WE LATER SOLD THE CAR AS SOON AS POSSIBLE AND WILL NEVER BUY ANOTHER NISSAN PRODUCT - EVER!  WE ALWAYS HAD A PROBLEM WITH THE A/C AND COULD COUNT AN A REGULAR REPLACEMENT OF HOSES EVERY SUMMER.  WE ARE VERY UPSET WITH NISSAN AND THIS HAS BEEN 3 YEARS AGO.  TODAY WE RECEIVED A LETTER THAT THE CAR MAY BE INCLUDED IN A RECALL CAMPAIGN. HA!  *JB",
        "vin": "5N1ED28T6YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2007",
        "dateOfIncident": "08/09/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202520,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STALLED AT HIGH SPEED (60 MPH) ON AN INTERSTATE.  I WAS ABLE TO START IT AND TAKE TO DEALERSHIP WHERE THEY DIAGNOSED ISSUE AS BAD SPEEDOMETER CONTROLLER.  DASHBOARD FAILURE SENT MESSAGE TO TRANSMISSION THAT CAR WASN'T RUNNING, CAUSING A STALL.  VERY UNSAFE!!!   THE DEALERSHIP ORDERED THE PART ON 8/10 AND TOLD ME THE CAR WOULD BE READY FOR PICKUP ON 8/13.   AT THAT TIME I HAD SOME MAINTENANCE WORK DONE AS WELL, AFTER BEING INFORMED MY CAR WOULD BE READY ON 8/13.   ON 8/13 I WAS INFORMED THAT THE DEALERSHIP HAD DONE THE OTHER WORK ON MY CAR (120K MAINT, BATTERY, AND FIXED KNOCK SENSOR) BUT THE SPEEDOMETER CONTROLLER WAS ON BACKORDER.  IT HAS BEEN OVER A MONTH.  I TRIED DRIVING THE VEHICLE BUT AGAIN THREE TIMES EXPERIENCED A STALL, ALL WHILE DRIVING ON INTERSTATE SO CONSIDER THE CAR NOT DRIVABLE AND WAS LUCKY TO NOT HAVE BEEN HIT.   I REPORTED THE DELAY IN GETTING THE PART TO NISSAN CONSUMER AFFAIRS, AND THEY ARE UNCONCERNED.   THEY TOLD ME PARTS ONLY NEED TO BE MADE AVAILABLE DURING WARRANTY.   WHO THESE DAYS W/ PRICE OF CARS CAN AFFORD NEW CAR W/I 3 YEARS?   CAR IS ONLY 7  YRS OLD AND FOR ALL I KNOW, LATER MODELS COULD BE USING SAME PART.    I SUSPECT PART IS UNAVAILABLE BECAUSE OTHERS HAVE EXPERIENCED THIS SAME ISSUE, WHICH IS A VERY UNSAFE STALL, NORMALLY AT HIGH SPEED.  DEALERSHIP EVEN TOLD ME NOT TO DRIVE CAR.  CAN YOU DO ANYTHING TO NISSAN TO GET PART IN SO I HAVE TRANSPORTATION TO AND FROM MY JOB? *JB  UPDATED 12-12-07.  *KB  UPDATED *JB",
        "vin": "5N1ED28YXYC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/10/2007",
        "dateOfIncident": "03/04/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195955,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING ROUTINE CHECK AT CAR REPAIR SHOP (FOR NISSAN XTERRA), WAS TOLD THAT HEAD GASKET WAS CRACKED. I WAS ALSO NOTIFIED THAT THIS WAS UNUSUAL DUE TO THE AMOUNT OF MILES ON THE CAR, APPROXIMATELY 45,000.  CAR SUBSEQUENTLY STARTED TO OVERHEAT, IMMEDIATELY RETURNED CAR TO DEALER, HERB GORDON NISSAN, FOR EXPENSIVE REPLACEMENT OF HEAD GASKET.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/07/2007",
        "dateOfIncident": "03/20/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192675,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 20, 20007 I WAS SITTING IN A SUBWAY DRIVE-THRU AND THE ENGINE OF MY NISSAN XTERRA SHUT OFF.  I WAS UNABLE TO RESTART THE VEHICLE.  MY SON HAD TO PUSH THE CAR OUT OF THE DRIVE-THRU.  NOT KNOWING ABOUT THE RECALL I PAID $809.25 TO HAVE MY VEHICLE FIXED AT PRECISION IMPORT REPAIR IN ALOHA, OREGON.  I CALLED 1-800-NISSAN1 AND THEY SAY THAT BEAVERTON NISSAN COMPLETED THE RECALL REPAIRS ON DECEMBER 10, 2004.  I SPOKE TO BEAVERTON NISSAN AND THEY BELIEVE THOSE REPAIRS RELATED TO A DIFFERENT RECALL.  THE RECALL NUMBER THEY SHOW IS R0402.  I WANT TO KNOW HOW TO GET REIMBURSEMENT SINCE I PAID TO HAVE THE REPAIRS DONE MYSELF.  I WOULD ALSO LIKE TO KNOW WHY I NEVER RECEIVED NOTIFICATION OF THE RECALL.",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/18/2007",
        "dateOfIncident": "04/12/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188292,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEP BOARDS OF THE 2000 NISSAN XTERRA ARE CORRODING.  I HAVE BEEN THE ONLY OWNER OF THE VEHICLE AND THERE HAS BEEN NO DAMAGE OR UNUSUAL USAGE OF THE STEP BOARDS THAT WOULD HAVE CASUED THE CORROSION.  OTHERWISE, THE VEHICLE, BOTH MECHNAICALLY AND BODY, IS IN EXCELLENT SHAPE.  *AK    I HAVE TAKEN THE VEHICLE TO TWO BODY SHOPS AND BOTH AGREE THE STEP BOARDS NEED TO BE REPLACED AND CANNOT BE REPAIRED.  ESTIMATES FOR NEW STEP BOARDS AND INSTALLATION RANGE FROM $500 TO $670.  THE SERVICE MANAGER AT MY LOCAL NISSAN DEALER INDICATES THE STEP BOARDS ARE SUPPOSED TO BE VERY DURABLE AND SHOULD NOT HAVE CORRODED.  HOWEVER, HE WAS UNABLE TO GET ANY FINANCIAL ASSISTANCE FROM NISSAN TO REPLACE THE STEP BOARDS.  MY DIRECT REQUEST TO NISSAN WAS ALSO TURNED DOWN.  SINCE I HAD TO ENTER A DATE IN THE FORM BELOW, I ENTERED THE DATE NISSAN TELEPHONED ME AND SAID THEY WOULD NOT BE ASSISTING ME IN MY EFFORT TO REPLACE THE STEP BOARDS.  MY FILE NUMBER WAS 567.8334.      THERE HAVE BEEN NO ACCIDENTS OR DEATHS DUE TO THE DEFECT.  HOWEVER, THIS IS CLEARLY A DEFECTIVE FACTORY INSTALLED PART ON THE VEHICLE.",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "01/17/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179075,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT SHIELD ON BOTTOM OF 2000 NISSAN XTERRA SE BECAME LOOSE AND REQUIRED TIGHTENING TO STOP RATTLING ON NUMEROUS OCCASIONS SINCE BOUGHT CAR NEW IN THE END OF 1999 FROM A DEALERSHIP IN CHICAGO - MAYBE 6-12 TIMES.    WHILE DRIVING ON 1/17/07, BRAKES JUST GAVE OUT.  WHEN CAR BROUGHT TO SHOP, IT TURNS OUT THE HEAT SHIELD WAS RUBBING ON THE STEEL BRAKE LINE ON THE PASSENGER SIDE/BOTTOM OF THE ENGINE AND VIBRATION/RUBBING HAD FINALLY ERODED THE STEEL BRAKE LINE TO THE POINT IT BEGAN TO LEAK.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/05/2007",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177838,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH IDLE PROMPTED ME TO TAKE THE CAR INTO A MECHANIC. AFTER IT WAS HOOKED UP TO THE COMPUTER I WAS TOLD THE O2 SENSORS WERE TELLING MY COMPUTER TO RUN THE GAS LEAN AND THE COMPUTER WAS TELLING MY O2 SENSORS TO RUN LEANER.  AT THAT TIME MY CAR HAD ONLY 52,000 MILES AND I KNOW THE O2 SENSORS ARE SUPPOSED TO BE GOOD FOR UP TO ABOUT 80,000.  NOTING WAS DONE AND THE CARE CONTINUES TO HAVE THE ROUGH IDLE AS IF IT WANTS TO DIE.  I HAVE PUT ABOUT $2K INTO IT TRYING TO FIX POSSIBLE PROBLEMS AND FEEL IF IT IS AN O2 SENSOR PROBLEM AND THE CAR IS UNDER 80,000 MILES IT IS A DEFECT.   *NM",
        "vin": "4N2XN11T7YD"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/05/2006",
        "dateOfIncident": "12/04/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175168,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE PARKED, THE VEHICLE SUDDENLY ACCELERATED WITHOUT WARNING.  THE VEHICLE STOPPED AFTER THE BRAKE PEDAL WAS DEPRESSED FIVE TIMES.  THE SERVICE DEALER WAS NOT ABLE TO FIND THE PROBLEM.  THERE WAS A NHTSA RECALL, # 00V288000, REGARDING THE POWER TRAIN: AUTOMATIC TRANSMISSION.  THE OWNER DID NOT RECEIVE ANY NOTIFICATION ABOUT THIS RECALL.  UPDATED 12/28/06. *JB",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/26/2006",
        "dateOfIncident": "09/20/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171923,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE ACCELERATING AT VARIOUS SPEEDS, A RATTLING NOISE WAS HEARD COMING FROM UNDER THE VEHICLE.  ALSO, THE CONTACT NOTICED EXHAUST SMELL INSIDE THE CAB.  THE VEHICLE WAS TAKEN TO THE DEALER WHO DETERMINED THAT AN LOOSE UNDERBODY SHIELD WAS THE CAUSE FOR THE RATTLING.  THE MANUFACTURER WAS NOT ALERTED.  THE CONTACT NOTICED 14 SIMILAR COMPLAINTS ON THE NETS WEBSITE REGARDING CRACKED RIGHT HAND EXHAUST MANIFOLD, AND EXPRESSED CONCERN BECAUSE INHALING CARBON MONOXIDE POSED A SERIOUS RISK.  NO REPAIRS WERE MADE.",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/31/2006",
        "dateOfIncident": "08/31/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167167,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST AT 80,000 MILES AND THEN AGAIN AT 108,000 I HAVE HAD FAILURES OF MY PASSENGER SIDE EXHAUST MANIFOLD IN A 2000 NISSAN X-TERRA.  IT STARTED AS A QUIET TICKING DURING ACCELERATION, AND NOW IT IS A TICKING DURING IDLING.  I AM CONCERNED ABOUT THE POLLUTION & THE POSSIBILITY OF TOXIC GASES IN THE PASSENGER DEPARTMENT.  GOING TO HTTP://WWW.XTERRAOWNERSCLUB.COM/FORUMS.HTML I HAVE FOUND THAT IT IS A MORE THAN COMMON PROBLEM WITH ALL NISSAN TRUCKS & SUVS.  *NM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2006",
        "dateOfIncident": "06/12/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161527,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SEVERAL YEARS THERE HAS BEEN A \"RATTLING\" NOISE AND THE VEHICLE HAS HAD A PROBLEM SHIFTING GEARS AT TIMES.  THE DEALERSHIP TOLD ME THAT THEY DIDN'T SEE ANYTHING WRONG (OF COURSE THIS IS THE SAME DEALERSHIP THAT FORGOT TO PUT THE OIL CAP BACK ON AFTER CHANGING THE OIL ONE DAY).  FINALLY THE TRANSMISSION JUST BROKE.  I WAS DRIVING DOWN THE ROAD AND HEARD A HORRIBLE SCRAPING METAL NOISE AND MY CAR BASICALLY JUST LUNGED FORWARD.  IT SEEMED TO STAY IN 1ST GEAR BUT WOULDN'T GO INTO ANY OTHER GEAR INCLUDING REVERSE.  THANKFULLY I WAS LESS THAN A BLOCK FROM HOME AND WAS ABLE TO PARK IT IN FRONT OF THE HOUSE UNTIL I HAD IT TOWED.  I HAD IT TOWED TO DON IRBY'S TRANSMISSIONS LLC (THE BEST TRANSMISSION PLACE IN TOWN) AND THEY REBUILT THE TRANSMISSION (RE4R01A).  I KNOW THAT THE 2000 NISSAN XTERRA'S HAD A RECALL ON THE TRANSMISSION AND I REALLY WONDER IF/WHY MINE WASN'T INCLUDED...BECAUSE I REALLY DO FEEL THAT THIS HAS BEEN AN ONGOING PROBLEM.    MY XTERRA DRIVES LIKE A NEW CAR AGAIN!  IT HASN'T DRIVEN AND PERFORMED THIS GREAT IN YEARS!!*JB",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/06/2006",
        "dateOfIncident": "02/19/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10156921,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 MAXIMA IS HORRIBLE I HAVE THE NOTORIOUS COIL PROBLEM PLUS I SMASHED INTO A POLE AND THE CAR'S AIR BAGS AND THE SEAT BELTS DON'T WORK YOU MUST HIT THE BRAKE FOR THE SEAT BELT TO LOCK AND YOU NEED TO REALLY HIT SOMETHING REAL HARD    BUT AT THAT POINT YOU MAY ALREADY BE DEAD THEY  NEED TO ADDRESS THESE PROBLEMS ,THEY CAN BE SUED AND I AM GOING TO CONGRESS WITH THIS,THEY ARE NOT SENSITIVE TO ANYONE'S LIVES THEY SHOULD BAN NISSAN COMPANY THEY ARE CROOKS HUGE LAW SUIT THEY CAN GO DOWN.  *NM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/05/2006",
        "dateOfIncident": "04/05/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154641,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE VEHICLE WILL NOT SHIFT OUT OF PARK.  THE VEHICLE HAS NOT BEEN SEEN BY A MECHANIC, BUT THERE IS A NHTSA RECALL, # 00V288000, REGARDING THE AUTOMATIC TRANSMISSION.  THE VEHICLE HAS THE SAME PROBLEMS AS INDICATED IN THE RECALL; HOWEVER, IT IS NOT INCLUDED IN THE RECALL DUE TO THE VIN.",
        "vin": "5N1ED28T0YC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/15/2006",
        "dateOfIncident": "02/12/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150383,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY 2005 THE POWER WINDOW FOR THE DRIVER'S DOOR ON MY 2000 XTERRA (4WD-V6) BEGAN TO ONLY GO UP INTERMITTENTLY (NO PROBLEM GOING DOWN). NOW THE DRIVER'S WINDOW WILL NOT GO UP AT ALL.  THE OTHER THREE WINDOWS (PASSENGER AND REAR) ARE ALSO BEGINNING TO EXHIBIT INTERMITTENT AND SLOW MOVEMENT IN THE UPWARD DIRECTION. A TEST OF THE CONTROLLER AND MOTOR INDICATE THE COMPONENTS ARE RECEIVING POWER.   AS I UNDERSTAND IT, OTHER NISSAN MODELS (ALTIMA & PATHFINDER) AND 01-02 XTERRA WITH SIMILAR COMPONENTS HAVE THE SAME PROBLEM AND HAVE BEEN RECALLED.  *NM",
        "vin": "5N1ED28Y3YC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/16/2006",
        "dateOfIncident": "01/16/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147862,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE PASSENGER SIDE OF THE VEHICLE, THERE ARE TOW BRAKE LINES THAT ORIGINATE FROM THE ABS UNIT THAT CARRY BRAKE FLUID TO THE BRAKE SYSTEM. NEAR THE WHEEL WELL, ONE CAN SEE THAT THE BRAKE LINES ARE WRAPPED WITH HEAT SHIELDING AND ARE TOUCHING THE HEAT SHIELD THAT COVER THE EXHAUST MANIFOLD. OVER THE USE OF THE VEHICLE THE HEALTH BUILD UP FROM THE EXHAUST MANIFOLD HEAT UP THE HEAT SHIELD AND THUS BURNS THE HEAT SHIELDING ON THE BRAKE LINES. PLUS WITH THE VIBRATION CAUSED BY THE DRIVING OF THE VEHICLE, ALLOWS THE METAL BRAKE LINE TO PUNCTURE, THUS CREATING A HOLE IN THE BRAKE LINE WHERE BRAKE FLUID CAN EXIT. THIS RESULTS IN A LOSS OF THE BRAKING SYSTEM ON THE VEHICLE. THE HEAT SHIELD THAT IS AROUND THE BRAKE LINE IN THIS AREA DOES NOT PROTECT THE BRAKE LINE FROM HEAT STRESS AND THE VIBRATION THAT TAKES PLACE WITH THE USE OF THE VEHICLE.   *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2005",
        "dateOfIncident": "12/04/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145784,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTRUMENT CLUSTER WOULD INTERMITTENTLY CEASE INDICATING SPEED, RPM'S, FUEL LEVEL, & TEMPERATURE WHEN OPERATING WITH THE LIGHTS ON. THE PROBLEM WOULD CORRECT ITSELF AT DIFFERENT INTERVALS WHILE OPERATING. PROBLEM COULD NOT BE REPRODUCED FOR REPAIR AT DEALER.    SOLUTION: I REPLACED THE PRINTED CIRCUIT BOARD LOCATED ON THE BACK OF THE INSTRUMENT CLUSTER. THIS REQUIRED THE DEALER TO ORDER PART & HAVE ODOMETER READING PROGRAMMED INTO THE NEW BOARD. THIS SEEMED TO HAVE CORRECTED THE PROBLEM. *JB",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/21/2005",
        "dateOfIncident": "11/24/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145851,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT EXPERIENCED  SEVERAL PROBLEMS WITH VEHICLE.   FIRST PROBLEM  CONCERNED  POWER STEERING.  THE STEERING WHEEL WAS HARD TO TURN.  THIS WAS ACCOMPANIED BY A GRINDING NOISE.  THE DASHBOARD PANEL LIGHTS DID NOT ILLUMINATE.  THEY SIMPLY STOPPED WORKING WITHOUT ANY PRIOR WARNING.  THERE WAS TECHNICAL SERVICE BULLETIN  10001332 CONCERNING THE ELECTRICAL SYSTEM. IN ADDITION, THE POWER WINDOW ON THE DRIVER'S SIDE WAS DIFFICULT TO CLOSE.  IN ORDER TO GET THE WINDOW TO AUTOMATICALLY ROLL UP IT MUST BE MANUALLY ASSISTED.  THE VEHICLE HAS NOT BEEN SEEN BY A DEALER. *AK",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/01/2005",
        "dateOfIncident": "11/30/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144104,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN (2) 2000 NISSAN XTERRA'S BOTH HAVE CRACKED EXHAUST MANIFOLDS.  ONE HAS 82,000 THE OTHER HAS 52,000 MILES.  THIS IS NOT A MINOR ISSUE AND HAS BEEN DOCUMENTED IN GREAT DETAIL VIA INTERNET.  BOTH VEHICLES ARE OUT OF WARRANTY BUT THIS SURELY SHOULD BE COVERED UNDER SAFETY RELATED ISSUES.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/20/2005",
        "dateOfIncident": "10/16/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140386,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON HAVING AN ACCIDENT AT AN INTERSECTION CAUSING SEVERAL THOUSANDS OF DOLLARS IN FRONT END DAMAGE, THE AIR BAGS FAILED TO DEPLOY.  *NM",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/28/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137944,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST MANIFOLD CRACKS AROUND BOLTS, PART WILL HAVE TO BE REPLACED ON A 2000 NISSAN XTERRA.  *JB",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/01/2005",
        "dateOfIncident": "08/19/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135082,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 NISSAN XTERRA WITH AN AUTOMATIC TRANSMISSION.  ON AUG 19, WHILE ON A TRIP, THE TRANSMISSION SHIFT LEVER BECAME STUCK AND THE LEVER WOULD NOT MOVE.  AFTER CONSULTING THE MANUAL FOR A PROCEDURE TO DISENGAGE THE SHIFT LOCK MECHANISM, I DISCOVERED THAT THE SHIFT LEVER WOULD MOVE FREELY WITHOUT ENGAGING THE TRANSMISSION.  AFTER ADDITIONAL TIME, I WAS ABLE TO ENGAGE THE TRANSMISSION INTO \"D\", BUT THE SHIFT INDICATOR DISPLAYS \"N\".  I WAS ABLE TO COMPLETE THE TRIP, AND RETURN HOME.  UPON RETURNING, THIS SEQUENCE OF EVENTS RECURRED.  AFTER INVESTIGATING THE PROBLEM, I DISCOVERED NHTSA CAMPAIGN ID: 00V288000 WHICH DESCRIBES A VERY SIMILAR ISSUE WITH THE 2000 NISSAN XTERRA, THAT INDICATES NISSAN SHOULD CORRECT THIS DEFECT. I CONTACTED A NISSAN DEALER IN MY AREA AND BROUGHT THE VEHICLE IN FOR AN ASSESSMENT.  I INFORMED THE DEALER OF MY CONCERN ABOUT THE RECALL, BUT THE DEALER CLAIMED THEY WERE UNABLE TO LOCATE THIS RECALL, AND SUGGESTED THAT I CONTACT NISSAN DIRECTLY.  I CONTACTED NISSAN, AND AFTER SEVERAL CONVERSATIONS WAS REFERRED TO \"CHAD\" WHO IS A REGIONAL SERVICE REPRESENTATIVE (CHAD CAN BE CONTACTED AT 310-771-3853).  THE DEALER DIAGNOSED THE ISSUE AS A DEFECTIVE SHIFT LOCK, AND AFTER TWO CONVERSATIONS WITH CHAD AT NISSAN, I WAS INFORMED THAT MY VEHICLE WAS NOT UNDER WARRANTY, AND NOT PART OF THE RECALL, THEREFORE I WAS REQUIRED TO PAY FOR THESE REPAIRS.    BASED ON THE INFORMATION IN NHTSA 00V288000, I FAIL TO SEE HOW NISSAN SHOULD NOT BE RESPONSIBLE FOR THESE REPAIRS.  *NM",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2005",
        "dateOfIncident": "08/10/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133684,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE TIMES IN 2004 (WHILE UNDER WARRANTY) STATING ROUGH IDLE-CANNOT FIGURE OUT.  SAFETY CHECKS SHOW NO PROBLEMS.  2 AUG 05 CODE P1320 (PLUG #3 CLEANED); P 0303/GAS CAP.  CODES CLEARED $112.00; DIDN'T EVEN GET CAR IN GEAR OFF DEALER'S LOT CHECK ENGINE LIGHT IS STILL ON.  SVC REP STATED WAS OFF AFTER WORK PERFORMED MUST BE SOMETHING ELSE.  KEPT 2 DAYS, REFUSED TO PUT SR. TECH ON MY CAR WHO HAS WORKED ON THE CAR.  TOOK TO ANOTHER SHOP, REPLACED ALL 6 IGNITION COILS.  NEW CODE TO REPLACE TORQUE COVERTOR MALFUNCTION = TRANSMISSION.  EST FROM 300-$3,000.00!",
        "vin": "JN1CA31A9YT"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 32 MPH THE FRONT PASSENGER SIDE WHEEL SEPARATED FROM THE VEHICLE WITHOUT WARNING.  AS A RESULT THE CONSUMER LOSS CONTROL OF THE VEHICLE. THE  CONSUMER WAS ABLE TO REGAIN CONTROL AND PULLED OVER.  PLEASE PROVIDE ADDITIONAL INFORMATION. *JB",
        "vin": "5N1ED28Y0YC"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2005",
        "dateOfIncident": "06/26/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126620,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL FEELS LOOSE ON STEERING COLUMN. (MOVES IN AND OUT)",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "06/17/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126468,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE SOON LIGHT CAME ON 2 TIMES IN A MATTER OF 1 WEEK.",
        "vin": "JN1CA31A3YT"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/21/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126143,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN HIGHWAY VEHICLE LOST POWER. AFTER HAVING IT TOWED O A NISSAN DEALER IT WAS FOUND THAT THE UPPER RIGHT CAM SHAFT HAD BROKEN ALSO DAMAGING HYDRAULIC LIFTERS.",
        "vin": "5N1ED28Y3YC"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/20/2005",
        "dateOfIncident": "07/06/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125943,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: IN RESPONSE TO THE FUEL PUMP TERMINAL ON THE FUEL SENDING UNIT THAT MAY CRACK OWNER TOOK  VEHICLE TO DEALER  FOR RECALL WORK, AND THE CAR BROKE DOWN TWICE SINCE THEN FOR THE SAME REASON.  OWNER WAS WORRIED THAT THE CAR MAY STALL WHILE DRIVING.  DEALER HAD TRIED TO FIX THE RECALL 3 TIMES, AND THE OWNER NO LONGER TRUSTED THAT NISSAN WAS FIXING THE PROBLEM. THE FIRST TIME, THE OWNER WAS AT A TRAFFIC LIGHT AND THE VEHICLE DIED. THE SECOND TIME,  THE CAR WAS PARKED FOR ABOUT 2 HOURS AND WOULD NOT START.  THIRD TIME,    VEHICLE WAS PARKED FOR ABOUT AN HOUR AND THE CAR WOULD NOT START.  OWNER HAS NOT TALKED TO THE MANUFACTURER.  THIS HAS BEEN HAPPENING FOR ABOUT ONE YEAR.  OWNER  HAD THE FUEL PUMP REPLACED BEFORE THE RECALL. NISSAN REIMBURSED SOME OF THE MONEY BACK.  THE OWNER  CONCERNED THAT SHE MAY BE GETTING FAULTY PARTS.*AK",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/16/2005",
        "dateOfIncident": "09/05/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125542,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT ALLOY WHEEL OF MY XTERRA 2000 HAS CRACKS IN TWO PLACES, I CALLED NISSAN USA TO COMPLAIN ABOUT IT AND ASKED IF THERE WAS A RECALL ON MY VECHICLE, I WAS TOLD THAT THERE WAS A RECALL ON IT BUT IT DOES NOT INCLUDE MY VIN NUMBER. MY VECHICLE'S VIN NUMBER IS [XXX]. I NEED YOUR HELP.   *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "5N1ED28Y4YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "05/10/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125803,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REQUEST FOR REFUND FOR REPLACEMENT OF THE FUEL SENDING UNIT ON THE 2000 NISSAN XTERRA.***NO ANSWER REQUIRED***. *MR  AFTER THE REPAIRS WERE MADE THE CONSUMER RECEIVED A RECALL NOTICE.  THE CONSUMER WAS INFORMED THAT HE COULD BE REIMBURSED FOR THE REPAIR.  THE CONSUMER SENT SEVERAL COPIES OF THE INVOICE TO THE MANUFACTURER BUT TO DATE THE CONSUMER HAS NOT BEEN REIMBURSED.  *NM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "05/10/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125802,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REQUEST FOR REFUND FOR REPLACEMENT OF THE FUEL SENDING UNIT ON THE 2000 NISSAN XTERRA.***NO ANSWER REQUIRED***. *MR  AFTER THE REPAIRS WERE MADE THE CONSUMER RECEIVED A RECALL NOTICE.  THE CONSUMER WAS INFORMED THAT HE COULD BE REIMBURSED FOR THE REPAIR.  THE CONSUMER SENT SEVERAL COPIES OF THE INVOICE TO THE MANUFACTURER BUT TO DATE THE CONSUMER HAS NOT BEEN REIMBURSED.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/17/2005",
        "dateOfIncident": "11/20/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121227,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ABOUT 70,000 MILES ON MY 2000 NISSAN XTERRA.  I HAD TO REPLACE THE PASSENGER SIDE EXHAUST MANIFOLD AROUND 40K MILES DUE TO A CRACK.  I AM NOW EXPERIENCING A CRACK OF THE DRIVER EXHAUST MANIFOLD.  THIS PROBLEM HAS ME CONCERNED BECAUSE OF THE DEFECTS INVOLVED.  I THINK THAT THE EXHAUST FUMES MAY ENTER THE PASSENGER AREA OF THE CAR THROUGH THE FIREWALL.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2005",
        "dateOfIncident": "10/10/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116833,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIRST PROBLEM IS WITH THE INSTRUMENT PANEL ON THE DASHBOARD. WHEN DRIVING AT LOW OR HI GH SPEED THE ENTIRE CLUSTER WOULD STOP WORKING FOR A FEW MINUTES OR HOURS, AND THE CAR WOULD LOSE POWER, AND  SUDDENLY IT WOULD START WORKING AGAIN. THE SUDDEN LOSS OF POWER ALMOST CAUSE A TERRIBLE ACCIDENT ON TURNPIKE. I TOOK IT TO THE DEALER,  AND THA CIRCUIT BOARD WAS REPLACED. MY LATEST PROBLEM IS THE SECURITY/DOOR LOCK SYSTEM. MY DOORS KEEP UNLOCKING ON THEIR OWN AS I'M DRIVING ( CHILD ON BOARD).  I'VE DONE SOME RESEARCH AND THIS ARE VERY COMMON PROBLEMS AMONG XTERRA OWNERS.*AK",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/29/2005",
        "dateOfIncident": "03/10/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116036,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRANSPORTING A MECHANIC TO A JOB SITE, WHEN THE MECHANIC NOTED A CRACKED EXHAUST MANIFOLD.  AFTER TALKING WITH ANOTHER 2000 XTERRA OWNER, HE SITED THE SAME FAULT ON HIS VEHICLE.  I DID RESEARCH AND FOUND THE FAULT IS WIDE SPREAD.  I THEN TALKED WITH SEVERAL MECHANICS, AND THEY ALL AGREED THE EXHAUST MANIFOLD SHOULD NOT FAIL WITH THAT FREQUENCY AT THOSE MILES.  AFTER FURTHER RESEARCH I FOUND THAT NISSIAN HAS PROBLEMS NOT JUST WITH THE XTERRA BUT ALSO EARLIER MODELS OF THE FRONTER.   STATISTICAL AND MECHANICAL EVIDENCE SUGGETS A DEFECT IN THE EXHAUST MANIFOLD.",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/29/2005",
        "dateOfIncident": "03/24/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116037,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I DID NOT RECIEVE RECALL INFO ON ALLOY WHEEL AND FUEL SENDING UNIT FROM NISSAN FOR MY 2000 XTERRA.  IN ADDITION I HAD MY NISSIAN SERVICED SEVERAL TIMES AT A DEALER AND WAS NOT MADE AWARE OF THE RECALL.  ONLY WHEN I DID RESEARCH DID I FIND OUT THERE WAS A RECALL.",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/14/2005",
        "dateOfIncident": "03/12/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114065,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING HER 2000 NISSAN QUEST, WHEN THE CAR CONTINUED TO IDLE AT ABOUT 1200 RPMS AND WOULD NOT COME DOWN WHEN SHE LET UP ON THE GAS PEDAL.  THE VAN HAD TO BE TOWED TO OUR MECHANIC, AND THE MECHANIC STATED THE IDLE AIR MOTOR WAS STUCK AND NEEDED TO BE REPLACED.  THE MECHANIC ALSO STATED THE SPEED OF THE CAR AT 1200 RPM'S WAS ABOUT 40 MPH, AND TRYING TO STOP THE CAR WAS VERY HARD.  MY WIFE WAS VERY LUCKY SHE WAS NOT IN AN ACCIDENT AND WAS VERY LUCKY SHE WAS ABLE TO PULL THE VAN OVER AND STOP.  FURTHERMORE, ON YOUR COMPLAINT FORM I AM UNABLE TO PUT DOWN THE VEHICLE WAS A NISSAN QUEST, AS THAT MODEL IS NOT ONE OF THE OPTIONS UNDER THE VEHICLE INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/18/2005",
        "dateOfIncident": "10/28/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098989,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED VEHICLE WILL NOT GO INTO FIRST GEAR.  ABOUT ONE MONTH AGO WHEN CONSUMER WOULD PUT VEHICLE INTO FIRST GEAR IT MADE A LOT OF NOISE.  THEN,  IT WOULD GO INTO GEAR, BUT IT WOULD SLIP OUT AGAIN.  ABOUT A WEEK LATER, SHE HAD TO HOLD IT IN GEAR.  CURRENTLY,  THE VEHICLE WILL NOT GO INTO FIRST GEAR.  CONSUMER WILL BE TAKING THIS VEHICLE TO THE DEALER, BUT FELT THIS VEHICLE WAS TOO NEW FOR  TRANSMISSION TO MALFUNCTION.  *AK  AFTER THE TESTING THE CONSUMER WAS TOLD THAT THE TRANSMISSION AND THE CLUTCH WOULD HAVE TO BE REPLACED.  *TC",
        "vin": "5N1ED28T1YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2005",
        "dateOfIncident": "02/11/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110434,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN MAXIMA WITH BAD IGNITION COILS - OVER 1200 PEOPLE HAVE SIGNED AN ON-LINE PETITION. CONSUMERS ARE GETTING SCREWED BECAUSE OF FAULTY COILS SUPPLIED BY NISSAN. *JB",
        "vin": "JN1CA31D3YT"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2005",
        "dateOfIncident": "08/06/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110009,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUING POOR CLUTCH OPERATION.  PEDAL OFTEN BINDS; HAD TO RELEASE PEDAL FULLY TO GET CRUISE CONTROL TO OPERATE; PEDAL IS NEARLY TO THE FLOOR AT FIRST START ON COLD MORNING. JUST SPENT $1200 TO REPAIR CLUTCH.  DEALER CLAIMS BINDING CLUTCH IS NO PROBLEM.  I HAVE SPOKEN TO OTHER 2000 XTERRA OWNERS THAT HAVE HAD THE SAME PROBLEM EARLIER IN THEIR OWNERSHIP AND HAD THE PEDAL REPLACED UNDER WARRANTY...MY THOUGHT IS THE BINDING CLUTCH IS CAUSING OTHER PROBLEMS...*JB",
        "vin": "5N1ED28Y4YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2005",
        "dateOfIncident": "01/03/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106290,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK WAS FOUND TO HAVE CRACKED EXHAUST MANIFOLD, I NOTICE OTHER ONES HAVE BEEN REPORTED, ALSO TRUCK RUNS VERY ROUGH AT IDLE ALMOST STALLING OUT, I HAVE SPENT A LOT ON THIS PROBLEM, NISSAN CAN NOT SOLVE PROBLEM,  THEY REPLACE MANIFOLD BUT TRUCK STILL RUNS ROUGH AFTER A WEEK OF THEM FIXING IT.  *JB",
        "vin": "5N1ED28T6YC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/11/2005",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107228,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 03V307000/ALLOY WHEEL CRACKS. VEHICLE  EXPERIENCED CRACKING OF THE ALLOY WHEELS. IT WAS THE FRONT LEFT WHEEL THAT HAD THE DEFECT. CONSUMER CONTACTED THE MANUFACTURER, AND WAS TOLD THAT THE VIN FOR THIS VEHICLE WAS NOT INCLUDED IN THE RECALL. CONSUMER WILL HAVE TO PAY OUT OF POCKET TO REPAIR THIS DEFECT.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/03/2005",
        "dateOfIncident": "11/05/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105652,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING LOSES POWER\" INTERMITTENTLY WHILE DRIVING.  EXTREMELY HARD TO STEER.*AK",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "SERVICE BRAKES, AIR,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2004",
        "dateOfIncident": "12/20/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104546,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON COLD MORNINGS WHEN DRIVER APPLIES BRAKES, THE PEDAL GOES TO THE FLOOR AND PULSES RESULTING IN BRAKE FAILURE.  THE VEHICLE WILL NOT STOP AND CAN CAUSE A SERIOUS ACCIDENT.  ASLO IGNITION COILS ON 2000 NISSAN MAXIMA ARE DEFECTIVE BASED ON INDEPENDENT RESEARCH.  CHECK ENGINE SOON COMES ON AND THE VEHICLE LOSES POWER AND VIBRATES.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2004",
        "dateOfIncident": "11/30/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103820,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED  RECALL 04V230000 CONCERNING FUEL RAIL. TOOK  VEHICLE TO DEALER,  AND THE FUEL RAIL WAS REPLACED.  VEHICLE SHUT DOWN ON THE ROAD, AND HAD TO BE TOWED, AND CONTINUED TO BE SERVICED  NO LESS THAN  THREE TIMES SINCE THE FUEL RAIL REPLACEMENT.    *AK",
        "vin": "5N1ED28T5YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100799,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE TO COMPLETE VEHICLE GUARANTEED INSPECTION. RESULTING IN A SKID PLATE FALLING OFF BOTTOM OF VEHICLE WHILE DRIVING, OIL LEAK, FUEL INJECTOR FAILURE.*AK",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2004",
        "dateOfIncident": "11/17/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100124,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FIRST COOL DAY (MID-50S) OF NOVEMBER (IN HOUSTON, TX), THE ENGINE ON MY 2000 NISSAN MAXIMA GLE BEGAN SHUDDERING OCCASIONALLY AND THE \"SERVICE ENGINE SOON\" LAMP LIT. I TOOK VEHICLE TO MY LOCAL NISSAN DEALER FOR DIAGNOSIS. THE SERVICE ADVISOR RECOMMENDED REPLACEMENT OF ALL SIX IGNITION COILS AT A COST OF $660 (INCLUDING LABOR, PARTS, AND SALES TAX), WHICH I DECLINED. MY FURTHER RESEARCH ON THE INTERNET REVEALED THAT THIS IS A FREQUENT PROBLEM AMONG 2000-01 MAXIMAS, AND THAT NISSAN HAS ISSUED TSB NTB01-059 WHICH ADDRESSES THE ISSUE.*AK",
        "vin": "JN1CA31D2YT"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2004",
        "dateOfIncident": "11/04/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098407,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) I WAS EXPERIENCING POWER LOSS WITH MY 2000 NISSAN MAXIMA TO THE EXTENT THAT WHEN I ACCELERATED THE ENGINE BOGGED DOWN AND PLACED ME IN AN UNSAFE CONDITION.  (2) THE SERVICE ENGINE LIGHT CAME ON AND I TOOK THE CAR TO MY DEALER FOR A DIAGNOSTIC.  I WAS INFORMED THAT THERE WAS INTERMITTENT IGNITION COIL FAILURE BUT IT WAS UNDETERMINED AS TO WHICH COILS AND WAS ADVISED TO REPLACE ALL 6.  (3) I HAVE SINCE READ MANY COMPLAINTS REGARDING THE VERY SAME FAILURE TO THE EXTENT THAT NISSAN HAS BEGUN USING AN UPGRADED COIL.  THIS LEADS ME TO BELIEVE THAT THE ORIGINAL EQUIPMENT IS DEFECTIVE.  I NOTE THAT NO RECALL HAS BEEN INSTITUTED ON THE IGNITION COILS AND RESPECTFULLY REQUEST AN INVESTIGATION INTO THIS SAFETY ISSUE THAT PROVES VERY COSTLY TO REPAIR.  *JB",
        "vin": "JN1CA31D2YT"
    },
    {
        "components": "AIR BAGS,TIRES",
        "crash": true,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "10/30/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10098322,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "ALL SEASON",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "1. VEHICLE FISHTAILED ON WET SURFACE, LOST CONTROL, BEGAN TO ROLL. VEHICLE LEFT ROADWAY, HIT IRON FENCE, SPUN 180 DEGREES, REAR END HIT TREE.  2. THE VEHICLE SHOULD NOT HAVE LOST CONTROL, NOR SHOULD IT HAVE BEGUN TO ROLL IN THAT SITUATION. NOT A SINGLE AIR BAG DEPLOYED WHEN FRONT HIT IRON FENCE AT APPROX. 40 MILES PER HOUR. PASSENGERS WERE LEFT WITH MINOR, NON-INCAPCITATING INJURIES (WHIPLASH, MUSCLE PAINS, BRUISED ORGANS).  3. CAR WAS TOTAL LOSS. AWAITING COMPENSATION FROM INSURANCE COMPANY.*AK",
        "vin": "JN8AR07Y6XW"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098242,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HESITATION AND RUNNING ROUGH. SERVICE ENGINE CAME ON AND CAR DROPPED OFF AT NISSAN DEALER FOR SERVICE. DEALER CALLED AND SAID THE (6)COILS NEED REPLACING. THE CAR HAS 68000 MILES ON IT NOW.  THE COILS HAD BEEN REPLACED IN 2001 WHEN THE CAR HAD 30,000 MILES ON IT. I READ THERE SERVICE BOOKLET AND NO WHERE DOES IT SAY TO HAVE THE COILS REPLACED EVERY 30,000MILES.  WHEN THE DEALER REPLACED THE COILS AT 30,000MILES HE SAID THAT NISSAN HAD SOME DEFECTIVE COILS AND THEY DID THE UNDER WARRANTY BUT THIS TIME IT COSTS ME $611.65 AS THEY SAID THEY ARE NOT COVERED UNDER WARRANTY ANY LONGER. AFTER CHECKING EDMUNDS WEB SITE AND SEVERAL OTHERS IT APPEARS EVERY 2000 MAXIMA HAS TO HAVE THE COILS REPLACED EVERY 30,000MILES OR SO AS THERE ARE NUMEROUS COMPLAINTS ABOUT THE SAME PROBLEM I HAVE.*AK",
        "vin": "JN1CA31D1YT"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/21/2004",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097744,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN XTERRA, WHEELS ON THESE VEHICLE MAY NOT HAVE BEEN PROPERLY MANUFACTURED, COULD DEVELOP CRACKS IN WHEEL SPOKES.  *BF   RECALL  03V307000.  *TC",
        "vin": "5N1ED28Y5YC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/12/2004",
        "dateOfIncident": "08/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095635,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER LESS THAN THREE YEARS OF OWNING THE CAR THE DRIVER'S SIDE WINDOW JUST STOPPED GOING DOWN ONE DAY. THE SERVICE DEPT. AT MY LOCAL NISSAN DEALER SAID HE THOUGHT THERE'D BEEN A RECALL, BUT NISSAN SAID THERE WAS NONE. THIS IS THE THIRD MAJOR THING I'VE HAD TO HAVE REPLACED THAT WAS LATER A RECALL. THEY NEED TO TAKE CARE OF THIS.  *NM",
        "vin": "5N1ED28T0YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/05/2004",
        "dateOfIncident": "09/14/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10093646,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE DRIVEN MY 2000 NISSAN XTERRA FOR ALMOST 2 YEARS NOW WITH NORMAL DRIVING, NO OFF ROAD DRIVING OR ABUSE OF MY VEHICLE. RECENTLY I DISCOVERED THAT AFTER A FEW WEEKS OF AN OVERWHELMING SMELL OF EXHAUST IN MY PASSENGER CABIN THAT THE EXHAUST MANIFOLD IS IN FACT CRACKED. NOW ON MANY OCCASIONS I HAVE A VERY YOUNG CHILD IN MY VEHICLE SO I'VE HAD TO LEAVE HIM OUTSIDE TILL THE EXHAUST SMELL HAS DISSIPATED AND I CAN ONLY ASSUME IT'S NO LONGER MAKING IT'S WAY INTO THE CABIN. I CAN'T IMAGINE THAT THIS COULD POSSIBLE BE GOOD FOR ANYBODY. IN ANY EVENT I FIGURED I WOULD JUST HAVE TO GET THE PROBLEM FIXED BUT AS I DID SOME RESEARCH I REALIZED THAT I'M NOT ALONE AND THERE ARE THOUSANDS OF OTHER OWNERS WITH THE SAME PROBLEM. I WILL HAVE MANIFOLD REPLACED AT MY OWN COST SO I CAN AGAIN FEEL SAFE THAT I'M NOT BREATHING IN EXHAUST. I FIND IT ABSURD THAT NEITHER NISSAN NOR THE NHTSA HAS MADE THE PUBLIC AWARE OF THIS PROBLEM. I HOPE SOMETHING CAN BE DONE SOON.*AK",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/21/2004",
        "dateOfIncident": "09/21/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094028,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING AT AN INTERSECTION ANOTHER VEHICLE STRUCK THE  CONSUMER'S VEHICLE ON THE PASSENGER'S SIDE  DOOR. CONSUMER APPLIED THE BRAKES AND THE PEDAL WENT TO THE FLOOR.  ABS BRAKING  LIGHT APPEARED ON THE DASHBOARD AND REMAINED ON. CONSUMER DROVE VEHICLE TO THE DEALER FOR INSPECTION, AN D MECHANIC DETERMINED THAT THE ABS BRAKING UNIT NEEDED TO BE REPLACED DUE TO THE SOLENOID SWITCH BEING WORN OUT.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/04/2004",
        "dateOfIncident": "09/03/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090439,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN EXTERRA LEFT SIDE POWER WINDOW MOTOR FAILED. I KNOW OF OTHERS HAVING SAME PROBLEM.*AK",
        "vin": "5N1ED28T0YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/01/2004",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088955,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MAJOR EXHAUST MANIFOLD LEAK.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2004",
        "dateOfIncident": "08/02/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089608,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL NOTICE 04V230000. CONTACTED DEALERSHIP AND BROUGHT VEHICLE IN FOR REPAIR. DEALER WAS REFUSING TO DO RECALL REPAIRS.  DEALER  INDICATED TO CONSUMER VEHICLE MUST BE LEFT FOR UNDETERMINED AMOUNT OF TIME UNTIL MECHANIC COULD GET TO IT IN ORDER TO REPAIR RECALL. THAT WAS AN INCONVENIENCE TO THE CONSUMER SINCE NO OTHER TRANSPORT WAS AVAILABLE.*AK",
        "vin": "5N1ED28T3YC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/17/2004",
        "dateOfIncident": "08/17/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088034,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED WHILE INSTALLING A CHILD SEAT THAT THE REAR  LEFT SEAT BELT RETRACTOR DID NOT RETRACT.   DEALERSHIP WAS NOTIFIED. *AK",
        "vin": "5N1ED28T2YC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2004",
        "dateOfIncident": "07/20/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083373,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER WAS DRIVING WHEN THE CAR STOPPED, UPON TRYING TO SHIFT THE GEAR IT WOULD NOT MOVE.  WHEN FINALLY PUTTING IT IN DRIVE THE VEHICLE WENT INTO REVERSE.   *JB   *SC   *JB",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/05/2004",
        "dateOfIncident": "08/03/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 NISSAN XTERRA WITH LESS THAN 51,000 MILES DEVELOPED A CRACK IN THE PASSENGER SIDE EXHAUST MANIFOLD. I HAVE MAINTAINED THIS VEHICLE AT A VERY HIGH LEVEL AND EVEN THOUGH IT IS DESIGNED TO BE DRIVEN OFF ROAD MY VEHICLE'S OFF ROAD EXPERIENCE IS THE OCCASIONAL GRAVEL ROAD. THE VEHICLE IS NOT DRIVEN \"HARD\" OR BEYOND NORMAL DRIVING CONDITIONS. THE CRACKED DEVELOPED WITHOUT ANY INDICATION OTHER THAN A STRANGE \"HISSING\" SOUND FROM THE ENGINE AND A SLIGHT EXHAUST ODOR INSIDE THE VEHICLE. NO ONE WAS INJURED BUT IT APPEARS THAT EXHAUST LEAKING INTO THE DRIVER/PASSENGER COMPARTMENT OF THE VEHICLE COULD BE POTENTIALLY DANGEROUS ON LONG TRIPS OR PROLONGED STOP AND GO TRAFFIC DURING RUSH HOUR. THE PART HAS BEEN REPLACED AT MY EXPENSE. *AK",
        "vin": "5N1ED28YXYC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/24/2004",
        "dateOfIncident": "07/19/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082580,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 NISSAN XTERRA THAT I HAVE HAD NO COMPLAINTS ABOUT SINCE I PURCHASED IT IN AUGUST OF 2001. MY WIFE AND I CURRENTLY ROLLED 55,000 ON THE ODOMETER. LAST WEEK WHEN I GOT INTO MY TRUCK AFTER A LONG DAY AT THE OFFICE MY DRIVER SIDE WINDOW WOULD NOT ROLL DOWN. DUE TO THE WARM WEATHER I LEAVE MY WINDOWS HALF WAY. IT ROLLED UP FINE HOWEVER WOULD NOT GO DOWN. TODAY WHILE RESEARCHING \"HOW TO TAKE OFF MY DOOR PANELS\". I CAME ACROSS DOZENS OF COMPLAINTS WITH PEOPLE ALL OVER THE US EXPERIENCING THE SAME PROBLEMS . SOME PEOPLE HAVE HAD TO REPLACE ALL 4 OF THE WINDOW REGULATORS BEFORE THEIR WARRANTY HAS EXPIRED. I WANT TO KNOW IF NISSAN IS GOING TO TAKE ANY ACTION ON THIS AND SEND OUT A RECALL TO HELP OUT THE PEOPLE WHO TRULY BELIEVE THEY PURCHASED A GOOD RELIABLE VEHICLE FOR THEIR FAMILY. I DONT THINK I NEED TO SPEND ANOTHER $400.00 ON SOMETHING THAT THEY SHOULD HAVE MADE RIGHT IN THE FIRST PLACE. THANK YOU.  *AK",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2004",
        "dateOfIncident": "06/20/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080040,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 5 MPH THE VEHICLE STALLED.  THE CONSUMER RESTARTED THE VEHICLE AND DROVE  IT TO THE DEALER FOR INSPECTION.   *AK   *NM",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/15/2004",
        "dateOfIncident": "12/19/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082080,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL INJECTOR FAILED AND THE VEHICLE STALLED WHILE DRIVING. THE CONSUMBER EXITED THE VEHICLE WIGGLED THE BATTERY CABLE AND THE VEHICLE STARTED.  THE VEHICLE WAS DRIVEN TO THE DEALER WHERE THE FUEL INJECTOR WAS CLEANED AND  LATER IT NEEDED TO BE REPLACED AT THE OWNERS EXPENSE.   A  RECALL LETTER WAS RECEIVED YESTERDAY AND HIS VEHICLE ACORDING TO THE MANUFACTURE WAS NOT INCLUDED IN THE RECALL.   *JB",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2004",
        "dateOfIncident": "07/08/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081526,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED  TRANSMISSION SLIPPED. AS A RESULT, CONSUMER LOST CONTROL. NO IMPACT REPORTED. *AK",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2004",
        "dateOfIncident": "06/21/2004",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079541,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 30 MPH VEHICLE  CAUGHT ON FIRE. THERE WAS A LOT SMOKE AND FLAMES COMING FROM  UNDERNEATH THE VEHICLE.  DEALER HAD BEEN  NOTIFIED.  *AK",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/16/2004",
        "dateOfIncident": "06/16/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10078317,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I SAW A NEWS RELEASE TODAY WHERE HONDA IS RECALLING SOME VEHICLES DUE TO HEAT BUILDUP IN THE IP CAUSING THE IP LIGHTS TO GO OUT.  THIS HAS BEEN A PERSISTENT PROBLEM FOR YEARS IN BOTH MY 1996 NISSAN 200SX AND MY 2000 NISSAN XTERRA.  USUALLY I JUST HAVE TO FIND THE DIMMER DIAL ON THE DASH SOMEWHERE ON THE LEFT UNDER THE STEERING WHEEL AND ADJUST IT A BIT TO GET THE LIGHTS TO COME BACK ON, BUT THE SWITCH IS ALWAYS VERY HOT WHEN I TOUCH IT.  NO ACCIDENTS OR FIRES HAVE RESULTED IN MY EXPERIENCE.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2004",
        "dateOfIncident": "04/28/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075247,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT WENT ON WHILE DRIVING  TO TRUCKEE, CALIFORNIA FROM SACRAMENTO..  I HAD THE RADIO ON AND DID NOT HEAR AN ENGINE NOISE.  IT WAS 11:00 CLOCK AT NIGHT AND I WAS A WOMAN ALONE DRIVING IN A RURAL AREA.  THERE WAS NO WHERE TO STOP UNTIL I GOT TO MY HOME TOWN OF TRUCKEE .  WHEN I STARTED THE CAR IN THE MORNING, TO GO TO WORK I HEARD A RATHER DISTINCT NOISE IN THE ENGINE.  I CALLED MY LOCAL MECHANIC AND HE TOOK THE CAR IN IMMEDIATLEY..  HE REPLACED THE TIMING BELT AND THE NOISE CONTINUED.  HE RECOMMENDED TOWING IT TO THE NISSAN DEALERSHIP IN RENO.  WHICH IS WHAT I DID.  THEY LISTENED TO THE MOTOR AND SAID IT WAS THE # 5 PISTON WHICH MEANT THE I NEEDED A NEW ENGINE AT A COST OF $6500.00 , I DECLINED REPAIRS.  MY XTERRA ONLY HAD 68,000 MILES ON IT, AND COULD NOT UNDERSTAND WHY A CAR WITH SUCH A GOOD REPUTATION HAD ENGINE FAILURE WITH SO LITTLE MILEAAGE.  WHEN I BOUGHT BY CAR WHICH WAS USED AT 32,000 MILES I TOOK IT TO MY MECHANCIC.  HE SAID THAT THHIS CAR SHOULD LAST ME WELL INTO THE 200,000 PLUS MILES AS DID MY FORMER CAR A ISUZU RODEO (240,000).  THIS IS THE FIRST TIME I HAVE EVER PURCHASED A USED CAR AND FELT CONFIDENT IN GETTING A NISSAN PRODUCT.  UNFOUTUNATELY THIS WAS NOT THE CASE.  LUCKILY THE CAR MADE IT BACK TO MY HOME TOWN AND DID NOT BREAK DOWN IN THE MIDDLE OF NOWHERE IN WINTER.  I WAS MAKING THIS TRIP TO SACRAMENTO TWICE A WEEK FOR A CLASS IN OBTAINING MY SPECIAL EDUCAATION CREDENTIAL, AND I WILL HAVE T DO IT FOR THE NEXT SEVERAL YEARS.  I WAS DEPENDING ON THIS CAR FOR SAFETY AND RELIABLE TRANSPORTATION.  BUYING A CAR WITH 32,000 MIOLES SEEMED LIKE A NEW CAR TO ME, CONSIDERING MY OLD CAR HAD 240,000.  I TAKE CARE OF MY CARS, AND I AM NOT ABUSIVE TO THEM.  THEY LAST ME A LONG TIME. *AK",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2004",
        "dateOfIncident": "05/18/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075748,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S VEHICLE EXPERIENCED THE SAME PROBLEM AND CONSEQUENCES AS DESCRIBED IN THE FUEL SENDING UNIT RECALL 04V230000. THIS VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO VIN.    DEALERSHIP REPLACED THE FUEL SENDING UNIT.*AK",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2004",
        "dateOfIncident": "03/17/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072744,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GAUGES WENT BLANK OR STOPPED WORKING FOR APPROXAMTELY 10 MINS THEN STARTED TO WORK ON ITS OWN.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2004",
        "dateOfIncident": "01/12/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065973,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK, ENGINE SUDDENLY SLOWED & THEN STALLED - WOULD NOT RESTART.  AFTER TOWING TO A LOCAL SERVICE STATION - I WAS TOLD IT WAS THE FUEL PUMP.  THE VEHICLE IS NO LONGER COVERED UNDER WARRANTY SO I HAD TO PAY TO HAVE IT REPLACED.  THIS IS THE THIRD FUEL PUMP THAT HAS BEEN INSTALLED ON MY VEHICLE.  IN SEPTEMBER OF 2001 IT HAPPENED FOR THE FIRST TIME - AGAIN BREAKING DOWN IN THE MIDDLE OF THE ROAD.  I WAS TOLD BY THE SERVICE STATION THAT THIS IS A KNOWN PROBLEM WITH XTERRAS?  I DON'T WANT TO BE REPLACING MY FUEL PUMP EVERY 2 YEARS/20,000 MILES - MY TRUCK CURRENTLY HAS 94,000 MILES ON IT.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/23/2004",
        "dateOfIncident": "03/23/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064734,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN XTERRA V6. LEFT AND RIGHT  EXHAUST SYSTEM  INTAKE MANIFOLD CRACKED. ACCORDING TO TWO MECHANICS AND RESEARCH ON THE INTERNET THIS WAS A VERY COMMON PROBLEM IN NISSAN V6 ENGINES USED IN DIFFERENT CAR MODELS.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": "03/11/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062444,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "3 TIME PROBLEM WITH THE HIGH PRESSURE LINE IN MY 2000 NISSAN XTERRA.  GOT A COPY OF THE NISSAN 5 YEAR REPAIR HISTORY FOR THE VEHICLE, AND FOUND OUT THAT AT 22,3?? THE LINE HAD TO BE REPLACED.  IT HAS NOW FAILED A THIRD TIME AND BECAUSE IT IS OUT OF WARRANTY NISSAN SAID THEY WILL NOT FIX IT FOR ME.  CLEARLY THIS IS A FAULTY PART TO BEGIN WITH AND I SHOULD NOT HAVE TO BE CHARGED FOR ITS THIRD FAILURE.   *NM",
        "vin": "5N1ED28Y0YC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2004",
        "dateOfIncident": "03/09/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061689,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  BETWEEN 5 TO 15 MPH VEHICLE  SUDDENLY ACCELERATED. DEALER NOTIFIED.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2004",
        "dateOfIncident": "02/13/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058321,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DIED UNEXPECTEDLY WHILE BEING DRIVEN. ADVISED BY MECHANIC THAT THERE IS A DEFECT WITH THE FUEL PUMP WHERE THE BRASS FITTING MEETS THE PLASTIC COUPLER. STATED THAT PLASTIC CAUSED CORROSION TO BRASS FITTING. THERE IS NO RECALL BUT THE PART IS ON NATIONAL BACK ORDER. FROM REVIEWING THIS SITE, IT SEEMS LIKE I AM NOT THE ONLY ONE EXPERIENCING THIS PROBLEM.  *JB",
        "vin": "5N1ED28YXYC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2004",
        "dateOfIncident": "01/04/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056790,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 NISSAN XTERRA COMPLETELY FAILED ON ME WHILE DRIVING 50 MPH ON A BUSY HIGHWAY. THE RADIO SHUT OFF, LIGHTS AND THEN THE ENGINE CUT OFF AND I COMPLETELY  LOST ALL POWER. I MANAGED TO PULL OFF TO THE SIDE OF THE ROAD AND WAS TOWED BY TRIPLE A TO THE NISSAN DEALER. THEY PUT A NEW BATTERY IN AND AFTER I REPEATEDLY TOLD THEM IT WAS MORE THAN A BATTERY THEY DID A DIAGNOSTIC TEST AND INSISTED THERE WAS NOTHING ELSE WRONG. I TOLD THE MECHANIC I WOULD BREAK DOWN AGAIN. SURE ENOUGH ONE MONTH LATER MY HUSBAND AND OUR THREE DAUGHTERS HAD A SIMILAR EXPERIENCE, ONCE AGAIN TRIPLE A TOWED ME BUT, THIS TIME TO MY MECHANIC AND HE QUICKLY DIAGNOSED THE FUEL PUMP AND SENDING UNIT. HE ADVISED ME TO HAVE NISSAN PUT IT IN BECAUSE I AM STILL UNDER WARRANTY. WE ARE VERY UPSET WITH NISSAN NOT RECALLING THESE PARTS. THERE HAVE BEEN MANY PROBLEMS REPORTED AND THEY ARE DOING ANYTHING ABOUT IT. MY HUSBAND WAS THINKING ABOUT A NISSAN FRONTIER BUT AFTER THE WAY NISSAN HAS IGNORED THIS PROBLEM AND PUT MY FAMILY IN UNNECESSARY DANGER HE WON'T EVEN CONSIDER IT. WE ARE THROUGH WITH NISSAN VEHICLES.*AK",
        "vin": "5N1ED28T5YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2004",
        "dateOfIncident": "02/06/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056737,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FUEL SENDING UNIT FAILED ON A DARK HIGHWAY ON THE EVENING OF FEB 6, 2004.  THE VEHICLE IS A 2000 NISSAN XTERRA.  WHILE I HAVE NEVER HAD PROBLEMS WITH THE VEHICLE UNTIL NOW- I HAVE FOUND THAT THE FUEL SENDING UNIT HAS A FLAWED DESIGN AND FAILS VERY OFTEN, ESPECIALLY IN WINTER CLIMATES- THE UNIT IS SUCEPTABLE TO ROAD SALT THAT CORRODES THE ELECTRICAL CONNECTION TO THE FUEL PUMP- THERE IS REALLY NO NEED FOR THIS TO CAUSE THE TRUCK TO SHUT DOWN.  I WAS LEFT STRANDED ON A DARK STRETCH OF ROAD WITH LITTLE BREAKDOWN LANE ROOM.  THE TOW COST $120 AND THE PARTS WERE $70.  IF THIS IS A COMMON FAILURE, AND I HAVE TO BELIEVE THAT IT IS, BASED ON THE NUMEROUS CASES DOCUMENTED ON THE INTERNET, THEN NISSAN SHOULD HAVE ISSUED A RECALL AS THIS FAILURE COULD EASILY RESULT IN INJURY OR WORSE.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/31/2004",
        "dateOfIncident": "01/31/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056256,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOWS FELL INTO THE DOOR AS I WAS OPENING IT. FROM WHAT I READ THIS IS A COMMON PROBLEM WITH NISSAN VEHICLES POWER WINDOWS REGULATORS. THIS COULD CAUSE AN ACCIDENT BECAUSE IT COULD SCARE A DRIVER INTO THINKING THEIR WINDOW EXPLODED.  *JB",
        "vin": "5N1ED28Y0YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2004",
        "dateOfIncident": "12/06/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054647,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY FUEL  SENDING UNIT. PROBLEM OCCURED DURING A BAD SNOWSTORM. IT IS KNOWN TO HAPPEN TO SEVERAL XTERRA OWNERS I KNOW.",
        "vin": "5N1ED28Y5YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10069966,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INVOLVED IN VEHICLE ACCIDENT.  XTERRA WAS STOPPED, AND HIT FROM BEHIND AT 40 MPH.  IT THEN HIT THE VEHICLE IN FRONT OF IT.  AIRBAG DID NOT DEPLOY.  VEHICLE WSA TOTALLED, I WAS INJURED.",
        "vin": "5N1ED26T6YC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "11/15/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070027,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 4 WHEEL DRIVE AND MAKING SHARP LEFT OR RIGHT TURN, THE REAR WHEELS LOCK AND DRAG, CREATING A BRAKE AND SURGE CONDITION. TOOK THE VEHICLE TO DEALERSHIP AND THEY TOOK ME OUT IN ANOTHER XTERRA AND TO MY HORROR, IT DID THE SAME THING. THEY INFORMED ME THAT VEHICLE IS NOT REALLY DESIGNED FOR 4 WHEEL ON ROAD DRIVING. I CONTACTED NISSAN AND GOT LITTLE HELP AS WELL. I FEEL THIS COULD BE A VERY UNSAFE IN ANY CONDITION, BUT VERY BAD ON WET AND ICED ROADS.",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/07/2004",
        "dateOfIncident": "01/07/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10053584,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH DRIVER APPLIED THE BRAKES  TO SLOW DOWN THE SPEED  AND CONSUMER LOST CONTROL, CAUSING THE VEHICLE TO HIT A GUARD RAIL  AND ROLE THREE TIMES.  VEHICLE LANDED UPSIDE DOWN.  UPON IMPACT, THE AIRBAG DID NOT DEPLOY.  DRIVER SUSTAINED  MINOR INJURIES.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/05/2004",
        "dateOfIncident": "12/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052459,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SUDDENLY STOPS RUNNING WHILE DRIVING.  MY LOCAL REPAIR SHOP, STS IN CHESTER, NEW JERSEY, IDENTIFIES THE PROBLEM AS PART OF THE FUEL SENDING UNIT. UPON RESEARCH ON THE XTERRA OWNERS CLUB MESSAGE BOARDS, I FIND THERE ARE SIX PAGES OF COMPLAINTS REGARDING THIS ISSUE. I INTEND TO CALL MY NISSAN DEALER AND SEEK REIMBURSEMENT FOR MY REPAIRS SINCE THIS IS SO WIDE-SPREAD, IS A POTENTIALLY DANGEROUS PROBLEM (HAD THIS HAPPENED ON A HIGHWAY OR IN HEAVY TRAFFIC) AND SHOULD BE, IN MY OPINION, A RECALL ISSUE.*AK",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/19/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048332,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT ANY SPEED VEHICLE WOULD DECELERATE, SLOWING DOWN WITHOUT WARNING. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2003",
        "dateOfIncident": "06/12/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042524,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED VEHICLE WOULD JERK, AND THE INSTRUMENT PANEL WOULD FAIL. *AK  WHILE DRIVING THE VEHICLES GAUGES (TACHOMETER, ODOMETER, SPEEDOMETER AND TEMPERATURE) RANDOMLY WENT OUT.  THIS PROBLEM ALSO APPEARED TO AFFECT THE CRUISE CONTROL AND OCCURED AT DIFFERENT SPEEDS.  WHEN THE GAUGES GO OUT THEY STAYED OUT FROM 3-20 MILES.   *NLM",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/08/2003",
        "dateOfIncident": "11/08/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045752,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXHAUST MANIFOLD ON MY 2000 XTERRA SE (V6 ENGINE) HAS CRACKED, LIKE SO MANY OTHERS.  THIS LEADS TO EXHAUST SEEPING INTO THE CABIN WHICH IS OBVIOUSLY VERY DANGEROUS.  ON A LONG TRIP, ESPECIALLY A LONG COMMUTE IN SLOWER TRAFFIC, CHANCES OF THE DRIVER SUCCUMBING TO CO POISONING AND FALLING ASLEEP AT THE WHEEL INCREASE.*AK",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/06/2003",
        "dateOfIncident": "11/06/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045628,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRIC WINDOWS RATTLE EXCESSIVELY.*AK",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/17/2003",
        "dateOfIncident": "10/17/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043115,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN XTERRA V6.  PASSENGER SIDE EXHAUST MANIFOLD CRACKED.  ACCORDING TO BOTH MY MECHANIC AND RESEARCH ON THE INTERNET, THIS IS A VERY COMMON PROBLEM IN NISSAN V6 ENGINES USED IN DIFFERENT CAR MODELS.  *LA",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/14/2003",
        "dateOfIncident": "10/06/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042811,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS INOPERATIVE BECAUSE OF CRACKED RIMS.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/01/2003",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042124,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED BRAKES FAILED INTERMITTENTLY.  VEHICLE WAS TAKEN TO THE DEALER, WHO CHECKED AND INFORMED THE CONSUMER THAT THERE WAS NOTHING WRONG WITH THE VEHICLE.  SIX MONTHS LATER VEHICLE WAS EXPERIENCING SOME LOUD GRINDING NOISES AND WAS TAKEN BACK TO THE DEALER.   DEALER INFORMED CONSUMER THAT ROTORS WERE WARPED/PADS HAD DISINTEGRATED, AND THE CALIPERS NEEDED TO BE REPLACED.  MANUFACTURER WILL BE INFORMED OF THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/23/2003",
        "dateOfIncident": "09/17/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039359,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY AT APPROXIMATELY 65MPH. WHEN ENCOUNTERING SLOWER MOVING TRAFFIC I ATTEMPTED TO SLOW DOWN BY APPLYING MY BRAKES.THE VEHCILE WOULD NOT SLOW DOWN. I TRIED AGAIN IT WOULD NOT SLOW DOWN. I STEERED THE VEHICLE TO THE SIDE OF THE FREEWAY.  I PLACED THE CAR IN NEUTRAL AND THE ENGINE ROARED THE RPM INDICATOR WAS IN THE RED ZONE AND WOLD NOT COME DOWN  AS THE VEHICLE CONTINUED DOWN THE BERM OF THE FREEWAY. I TURNED OFF THE IGNITION AND THE VEHCILE EVENTUALLY SLOWED TO A STOP.TREMBLING I CALLED MY FATHER, WHEN HE ARRIVED HE CHECKED UNDER THE HOOD AND DISCOVERED THAT THE THROTTLE ASSEMBLY CONTROLLING THE FUEL INJECTION SYSTEM JAMMED AND LOCKED U THE VEHICLE A 2000 NISSAN EXTERRA WAS TAKEN TO THE BOARDMAN, OHIO NISSAN DEALER.  THEY DID NOT REACT TOO  CONCERNED REGARDING MY NARROW ESCAPE WITH POSSIBLE INJURY OR DEATH AND GREASED THE ASSEMBLY AND SAID IT SHOULD BE OKAY. I WANTED THE ASSEMBLY REPLACED THEY CLAIMED IT DID NOT RQUIRE REPLACEMENT.  I THOUGHT IT BEST THAT I REPORT THIS INCIDENT TO YOUR AGENCY.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2003",
        "dateOfIncident": "01/02/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039177,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING GAUGES DO NOT WORK ON MY DASH:  SPEEDOMETER, TACHOMETER, ENGINE TEMPERATURE, FUEL, ODOMETER, AND OIL GAUGES.  THE CRUISE CONTROL DOES NOT WORK AND THE ANTI-THEFT DEVICE ARMS ITSELF AT ANY TIME IT WANTS TO, THE HAZARDS LIGHTS RANDOMLY FLASH AS I AM DRIVING.  ALL OF THE PROBLEMS OCCURRED WITHIN ONE YEAR OF PURCHASE.  THE CAR HAS BEEN SERVICED SEVERAL TIMES CONCERNING THESE PROBLEMS AT KENDRICK NISSAN, YET THEY STILL CONTINUE TO OCCUR.  NOW I AM BEING TOLD THAT I HAVE TO PAY, AGAIN, TO HAVE IT DIAGNOSED FOR THE SAME PROBLEMS I HAVE BEEN HAVING FOR PAST TWO YEARS.  *JB",
        "vin": "5N1ED28YXYC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2003",
        "dateOfIncident": "08/13/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036636,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE OPERATING VEHICLE IT WOULD STALL THEN RESTART,IT FINALE QUIT AND WAS  TOWED TO DEALERSHIP.  WAS TOLD IT SOUNDED LIKE THE FUEL SENDING UNIT,TWO DAYS LATER RECEIVED A PHONE CALL FROM  DEALER AND TOLD PROBLEM WAS ECU/ECM WHICH FAILED BECAUSE A/C DRAIN HAD CLOGGED AND CONDENSATION RUINED CONTROL UNIT WHICH IS NOT COVERED UNDER EXTENDED WARRANTY BECAUSE IT IS DETERMINED BY THE DEALER AND NISSAN CORP. TO BE COLLATERAL DAMAGE.  HAVE READ OWNERS MANUAL COVER TO COVER AND AT NO TIME DOES IT SAY TO MAKE SURE DRAIN IS CLEAR OR IT COULD CAUSE THIS CONDITION WHICH THEY CLAIM IS MY FAULT, AT THIS TIME I HAVE FILED A REPORT WITH THE BBB AS PER THEIR MANUAL AND AM WAITING FOR AN ARBITRATOR TO BE ASSIGNED.   *NLM",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/09/2003",
        "dateOfIncident": "08/15/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031137,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ALLOY WHEELS ON 2000 NISSAN XTERRA SE MODELS ARE CRACKING.I NOTICED TWO 1\" CRACKS IN ONE OF MY WHEELS WHILE WASHING THE VEHICLE. A LOCAL DEALERSHIP RELUCTANTLY REPLACED THE WHEEL FREE OF CHARGE. SINCE I FOUND THE CRACK IN MY WHEEL I HAVE COME ACROSS SEVERAL PEOPLE WITH CRACKING WHEELS ON THE IDENTICAL MODEL AND YEAR.*AK",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/08/2003",
        "dateOfIncident": "08/07/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10031121,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR-ENDED ANOTHER VEHICLE-I WAS TRAVELLING APPROXIMATELY 45 MILES PER HOUR. NEITHER AIR BAG DEPLOYED. MY VEHICLE WAS TOTALLED.TAKEN BY AMBULANCE TO HOSPITAL. MY VEHICLE WAS PURCHASED NEW-SO I KNOW AIR BAGS HAVE NEVER BEEN DISCONNECTED. WHAT RECOURSE DO I HAVE? FAULTY EQUIPMENT? MANUFACTURER? WHO DO I CONTACT?",
        "vin": "5N1ED28T3YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2003",
        "dateOfIncident": "07/24/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030922,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "X-TERRA  STOPPED WHILE DRIVING ON THE INTERSTATE 4 TIMES IN TWO DAYS.  FINALLY HAD TO HAVE IT TOWED TO NISSAN DEALER AFTER 5TH TIME IT STOPPED, THIS TIME IN RUSH HOUR TRAFFIC.  MECHANIC COULDN'T FIND ANYTHING WRONG EVEN ON COMPUTER, THEN ON SECOND DAY DECIDED IT WAS THE FUEL PUMP, AND REPLACED IT, AND THEN DETERMINED THAT IT WAS NOT THE FUEL PUMP, BUT A WIRING PROBLEM THAT BURNT OUT THE FUEL SENDING UNIT. COST WAS OVER $700.00, PLUS TOW BILL, AND RENTAL CAR. ALSO MANIFOLD IS CRACKED, AND WAS BEFORE WARANTY EXPIRED, BUT DEALER WHERE IT WAS BOUGHT SAID THAT THE WARANTY DID NOT COVER IT AND ADVISED US TO HAVE A LOCAL MECAHNIC TO FIX IT BECAUSE IT WOULD BE CHEAPER. HAVE NOW LEARNED THAT BOTH FUELD SNEDING UNIT, AND MANIFOLD ARE A PROBLEM ON MANY XTERRAS. *AK",
        "vin": "5N1ED28Y3YC"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/17/2003",
        "dateOfIncident": "06/16/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10028482,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "YESTERDAY MY 2000 NISSIAN WAS BROKEN INTO AND THE STEREO FACE WAS STOLEN.  THE PASSENGER DOOR WAS PRIED OPEN.  THE ALARM SYSTEM NEVER WENT OFF.  WHAT I AM UPSET ABOUT IT THAT MY CAR IS OUT OF WARRANTY AND THE DEALERSHIP AND NISSIAN CORP. STATED THAT IT WOULD COST ME APPROX. $85.00 TO HAVE IT CHECKED.  I KNOW THAT THE ALARM WORKS BECAUSE I SET IT MYSELF REACHED THROUGH THE WINDOW AND TRIED TO UNLOCK THE DOOR AND THE ALARM WENT OFF.  I TOLD NISSIAN ABOUT IT THINKING THAT THEY MIGHT WANT TO CHECK IT OUT BECAUSE EVIDENTLY THEIVES HAVE FOUND OUT HOW TO UNLOCK THESE WITHOUT SETTING OFF THE ALARM.  THEY WEREN'T CONCERNED AND STATED THAT THEY WOULD DOCUMENT IT.  BASICALLY THEY DIDN'T BELIEVE WHAT I TOLD THEM HAD HAPPENED.  SO IF YOU OWN A NISSIAN DON'T EXPECT YOUR ALARM TO GO OFF IF SOMEONE PRIES OPEN THE DOOR.*AK",
        "vin": "5N1ED28T6YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2003",
        "dateOfIncident": "07/12/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025985,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR BATTERY BLEW UP, BLOWING OFF ALL BATTERY CAPS AND CRACKED DOWN THE MIDDLE, BATTERY ACID ALL OVER ENGINE.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/22/2003",
        "dateOfIncident": "06/19/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023542,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE FUEL SENDING UNIT IN 2000 NISSAN XTERRA.  CAUSES ENGINE TO CUT OFF WHILE DRIVING.   *NLM",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/30/2003",
        "dateOfIncident": "05/17/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020731,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN XTERRA INVOLVED IN A FRONTAL CRASH.  AIRBAGS DID NOT DEPLOY.  FIREMEN AT THE SCENE COULD NOT EVEN MAKE EITHER BAG DEPLOY MANUALLY.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/29/2003",
        "dateOfIncident": "05/24/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020711,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPARE TIRE (WHICH IS MOUNTED BENEATH THE REAR OF THE VEHICLE) FELL OFF DUE TO RUST IN THE MECHANISM WHICH SUSPENDS IT. THE MECHANISM WHICH HOLDS THE SPARE TIRE IS CLEARLY DEFECTIVE (A RELATIVELY THIN METAL BAR ATTACHED TO A METAL CHAIN), AND IT IS CLEAR THAT NORMAL WEAR AND RUST CAUSED IT TO BREAK UNDER THE WEIGHT OF THE SPARE TIRE (WHICH IS A FULL SIZE, FULL WEIGHT TIRE). FORTUNATELY, THE TIRE FELL OFF WHILE THE VEHICLE WAS NOT IN MOTION. HAD IT FALLEN OFF WHILE IN MOTION, THE TIRE COULD HAVE CAUSED SIGNIFICANT DAMAGE TO NEARBY VEHICLES (INCLUDING MY OWN) AND THEIR OCCUPANTS. THE FALLEN TIRE COULD HAVE CAUSED MY VEHICLE OR NEARBY VEHICLES TO FLIP OVER, PARTICULARLY AT HIGHER SPEEDS.    NISSAN HAS BEEN INFORMED (BY PHONE) OF THIS DEFECTIVE PART. THEY HAVE REFUSED TO TAKE ACTION. ALL NISSAN XTERRA OWNERS SHOULD BE AWARE-- YOUR SPARE TIRE MAY BE HANGING BY A THREAD. THIS IS A SERIOUS HAZARD WHICH SHOULD BE INVESTIGATED.",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2003",
        "dateOfIncident": "04/20/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019062,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM SURPRISED TO SEE ONLY A FEW COMPLAINTS ON THIS SIGHT, THERE'S PROBABLY THOUSANDS THAT THIS HAS HAPPENED TO.  I WAS DRIVING HOME ONE NIGHT AND THE TRUCK STALLED OUT, LUCKILY THERE WAS A PLACE TO PULL OVER ON THE SIDE OF THE ROAD.  AFTER I GOT TOWED AND SPOKE TO NISSAN THEY WERE READY WITH THE ANSWER - IT'S THE FUEL SENDING UNIT!  A BUILD UP OF CORROSION IN THE WIRE OF THE SENDING HAD SHORTED OUT THE SIGNAL TO SUPPLY GAS.  NICE JOB NISSAN!  PIECE OF CRAP! RECALL!!!!!!!!!!!",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020204,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN A FRONTAL COLLISION, AND NONE OF THE AIR BAGS DEPLOYED.   *JB",
        "vin": "5N1ED28TXYC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/10/2003",
        "dateOfIncident": "05/09/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018503,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENDING UNIT SHORT/***EXCESSIVE HEAT PRODUCED*** PROBLEM STARTED W/MY WIFE, WHICH DRIVES THE 200 NISSAN XTERRA EXCLUSIVELY. IT STALLED ON HER WHILE DRIVING. WOULD RESTART OFTEN THROUGHOUT THE TRIP SHE WAS ON. THE NEXT DAY I DROVE IT TO DIAGNOSE THE PROBLEM AND DECIDED TO MAKE AN APPOINTMENT W/GERMAIN NISSAN OF  COLUMBUS, OHIO. WHILE ON MY WAY THERE IT STALLED FOR GOOD. LEFT ME HIGH AND DRY. I DIAGNOSED THE PROBLEM AS A MALFUNCTIONING FUEL PUMP. I REPLACED THE PUMP, FUEL FILTER AND FUEL PUMP RELAY AT THE SAME TIME IN A LOCAL SCHOOL PARKING LOT. NO SUCCESS. STILL NOT STARTING. I THEN HAD MY WIFE TRY TO START THE VEHICLE WHILE I LISTENED FOR THE SOUND OF THE FUEL PUMP RUNNING. I HEARD THE PUMP OPERATE SPORADICALLY. I THEN NOTICED, TO MY SHOCKING SURPRISE, THAT THE FUEL PUMP POWER CONNECTION ON THE FUEL SENDING UNIT WAS GLOWING FROM THE EXCESSIVE HEAT CREATED BY A CORRODED CRACK IN THE INLET CONNECTION SIDE OF THE PUMP POWER SOURCE. I IMMEDIATELY DISCONNECTED THE BATTERY AND HAD THE TRUCK TOWED TO THE DEALER FOR REPAIRS AS I FELT THIS WOULD BE A DEFINITE SAFETY RECALL. TO MY SURPRISE IT IS NOT. I ASKED THIS AFTER ALLOWING THE SERVICE MAN TO DIAGNOSE THE PROBLEM OF HIS OWN. I WAS TOLD OF THE SAME GLOWING AFFECT SEEN FROM HEAT CREATED AT THE ELECTRICAL SHORT. I INQUIRED IF THIS WAS SEEN BEFORE AND THE TECH SAID IT IS COMMON. HE ALSO WRAPPED THE PART FOR ME TO KEEP AS \"I MAY NEED THIS FOR FUTURE RECALL REIMBURSEMENT\".        I WONDER HOW LONG IT MAY BE BEFORE SOMEONE'S' CHILD IS BURNED IN A CAR FIRE AS THIS MALFUNCTIONING AND DANGEROUS COMPONENT IS LOCATED LESS THAN 4 INCHES DIRECTLY BELOW THE REAR PASSENGER SEAT!        I AM OUT OVER$400 PLUS TOWING FOR WHAT I HAVE DISCOVERED TO BE A COMMON DEFECT RESULTING IN THE MOST SEVERE OF SAFETY ISSUES. I JUST HOPE I CAN SELL THIS TRUCK BEFORE THE NEW PART. WHICH I AM SURE IS OF THE DEFECTIVE DESIGN, FAILS.   *NLM",
        "vin": "5N1ED28Y5YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2003",
        "dateOfIncident": "02/22/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017828,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP FAILED WHICH CAUSED THE VEHICLE TO STALL.  MR....*AK    *",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2003",
        "dateOfIncident": "01/07/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018422,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING ON FUEL SENDING UNIT CORRODES, FUEL PUMP TURNS OFF, ENGINE SHUTS OFF -- NO MATTER WHERE YOU ARE NOR HOW FAST YOU'RE DRIVING!   OBVIOUSLY, A UNIT THAT CORRODES SO EASILY ON NEWISH VEHICLES IS A DEFECT IN MANUFACTURING.  IT'S A NO BRAINER THAT THIS IS A SAFETY ISSUE TOO.  I LIKE THE IDEA OF YOUR WEBSITE: \"PEOPLE SAVING PEOPLE\".  I DON'T UNDERSTAND HOW WITH ALL THE COMPLAINTS ON THIS PROBLEM, WITH THE BACKORDER ON REPLACEMENT PARTS FOR IT, ALL THE TALK ABOUT IT, THAT THERE HASN'T BEEN A DEFECT INVESTIGATION ON IT.  I LOOKED IN YOUR DATABASE AND IT SHOWS ZERO DEFECT INVESTIGATIONS ON ANY NISSAN MADE IN 2000 -- DOESN'T MATTER WHAT MAKE OR MODEL, NISSAN IS RUBBER-STAMPED FOR APPROVAL???    I OWN A 2000  XTERRA.  THIS PROBLEM HASN'T HAPPENED TO MINE YET, BUT I'M SURE IT WILL SINCE I'M APPROACHING 47K MILES.  I HAVE EXPERIENCED THIS PROBLEM AS A PASSENGER IN ANOTHER VEHICLE.  AND I SWEAR, IT IS SCARY!  SINCE NISSAN WON'T INITIATE A RECALL, AND YOU SAY ON THE WEBSITE YOU DON'T NEED A SPECIFIC NUMBER OF COMPLAINTS IN ORDER TO INVESTIGATE, DON'T YOU THINK THIS IS ONE THAT SHOULD BE LOOKED INTO???  THANKS.   *NLM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2003",
        "dateOfIncident": "02/22/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014866,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER WAS STRANDED DUE TO A FUEL TRANSPORTER PUMP FAILURE.  THE CONSUMER WAS TOLD THE PART WAS ON NATIONAL BACKORDER.  THE CONSUMER REQUESTED INFORMATION ABOUT THE PROBLEM.  MR  SCC  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2003",
        "dateOfIncident": "09/02/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014354,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL DASH BOARD ELECTRONICS SHUT DOWN FOR NO APPARENT REASON.  INCLUDES SPEEDOMETER, RADIO, DASH LIGHTS, AND ALL GAUGES AND WARNING LIGHTS.  NEVER REPRODUCED FOR REPAIR SHOP.  HEADLIGHTS AND TAIL LIGHTS CONTINUE TO FUNCTION.   SYSTEMS REGAIN POWER FOR NO APPARENT REASON, STOPPING AND STARTING THE ENGINE IS NOT HELPFUL.   *NLM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2003",
        "dateOfIncident": "04/11/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014342,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "APRIL 11TH MY 2000 XTERRA STALLED WHILE DRIVING. I RESTARTED IT AND 5 MINUTES LATER IT STALLED AGAIN. THE THIRD TIME IT DIED AND WOULDN'T START AGAIN. I HAD IT TOWED TO MY HOUSE AND SINCE IT WAS RAINING I FIGURED I WOULD TRY IT AGAIN IN THE MORNING (HOPEFULLY WHATEVER WAS WET WOULD DRY OUT AND IT WOULD BE FINE). THE NEXT MORNING IT DID START AND I WAS ABLE TO MAKE IT TO THE HIGHWAY WHERE IT DIED AGAIN (MIDDLE LANE OF A 5 FOUR LANE HIGHWAY!). THIS TIME I HAD IT TOWED TO THE DEALER. I WAS A LITTLE SURPRISED TO HEAR THE MECHANIC TELL ME WHAT WAS WRONG BEFORE HE EVEN LOOKED AT IT (HE HAD A FUEL SENDER UNIT SITTING ON HIS WORKSTATION THAT HE HAD JUST PULLED OUT OF ANOTHER X WITH THE SAME PROBLEM). APPARENTLY WHEN THE X-TERRA HITS 50K TO 70K MILES THE FUEL SENDER UNITS GO BAD AND NEED TO BE REPLACED. THE CONNECTION FOR THE FUEL PUMP CORRODES (GREEN OXIDE) AND ALSO CRACKS CREATING AN OPEN. THE GUY WORKING IN THE PARTS DEPARTMENT SAID I WAS LUCKY BECAUSE THEY HAD JUST HAD A RUN ON FUEL SENDERS BECAUSE OF THIS PROBLEM AND WERE OUT FOR A WHILE BUT THEY HAD JUST GOT A NEW SHIPMENT IN. I STARTED TO FEEL LIKE THIS WAS A KNOWN MANUFACTURING DEFECT THAT NISSAN IS NOT LETTING ON TO THEIR CUSTOMERS. THE CLINCHER WAS, WHILE I WAS WAITING ANOTHER FLAT BED TOW TRUCK PULLED UP WITH ANOTHER X-TERRA...THAT'S RIGHT, BAD FUEL SENDER!! I PAID $211.00 FOR THE FUEL SENDER PLUS $65 FOR TOWING.  I CHECKED IF OTHERS HAVE HAD THIS SAME PROBLEM ON AN X-TERRA FORUM WEB SITE AND IT APPEARS TO BE ALL TOO COMMON.  HAVING YOUR MOTOR CUT OUT IN THE MIDDLE OF THE HIGHWAY IS A VERY DANGEROUS THING!   *NLM",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/10/2003",
        "dateOfIncident": "08/09/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014237,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL TIRE",
                "productModel": "295/75R22.5",
                "productYear": "2003",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SEVERAL TIMES SINCE OWNING THE XTERRA WHILE DRIVING IN RAIN OR SNOW, THE BACK TIRES SLIDE CONSTANTLY AND THE REAR GOES OUT OF CONTROL.  I ALMOST CAUSED AN ACCIDENT DUE TO MY VEHICLE LOSING CONTROL ALSO WHILE DRIVING 25 MPH VERY LITTLE RAIN ON A CURVING ROAD MY VEHICLE'S REAR STARTED SPINNING OUT OF CONTROL ALMOST KILLING MY 4 PASSENGERS AND I.  THERE HAS TO BE A DEFECT IN THE REAR SUSPENSION OF THE VEHICLE.  \"NISSAN\" OWN UP TO YOUR RESPONSIBILITIES!!!   *NLM",
        "vin": "5N1ED28T9YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "04/05/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014115,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DIED ON A BUSY STREET - APPARENTLY FROM MALFUNCTIONING FUEL SENDING UNIT.  2000 NISSAN XTERRA HAD ONLY 38,000 MILES ON IT.  PART IS ON \"NATIONAL BACKORDER\" AND WILL NOT BE AVAILABLE FOR MONTHS.     *NLM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "03/26/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014146,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 5,000 MILES PRE WARRANTY EXPIRATION MY 2000 NISSAN XTERRA BROKE DOWN WHILE PULLING OUT FROM A STOP.  AFTER AN INVESTIGATION BY NISSAN, THEY'VE CONCLUDED THAT THE CRANKSHAFT HAD BROKE AND THUS THE ENGINE WOULD BE RENDERED USELESS.  THEY HAVE ALSO STATED THAT THEY WILL NOT COVER THIS UNDER THEIR WARRANTY AND WILL BILL ME FOR THE NEW ENGINE.  THEY'VE SAID THAT THE ENGINE GOT SLUDGE DUE TO INFREQUENT OIL CHANGES.  AFTER PROVIDING PROOF OF REGULAR OIL CHANGES NISSAN SAYS THAT THEY STILL WILL NOT COVER THE VEHICLE.  THESE FRAUDULENT ACCUSATIONS ARE AN OUTRAGE AND SHOULD BE COVERED UNDER NISSAN'S WARRANTY.  FURTHERMORE,  MY RIGHTS AS A CONSUMER HAVE BEEN VIOLATED.  AFTER CONTACTING NHTSA OVER THE PHONE I DISCOVERED THAT THEIR HAD BEEN A RECALL ON MY VEHICLE  AND THAT THE RECALL COULD HAVE HAD SOME AFFECT ON THE RESULTING PROBLEMS CONCURRED, I'M NOT SURE AS I WAS NEVER CONTACTED REGARDING ANY RECALL ISSUE.  ANYHOW NISSAN SAYS THAT THEY WILL NOT COVER MY ENGINE UNDER THEIR WARRANTY.  THEY ARE ALSO TRYING TO CHARGE ME FOR ADDITIONAL INVESTIGATION FEES THAT THEY'VE ALREADY BILLED ME FOR TO SEE IF THIS COULD AFTER ALL BE AN ISSUE OF WARRANTY, SO FAR THE TOTAL CONCURRED WITH NO REPAIRS IS $420, WITH THE ADDED INVESTIGATION IT WOULD BE AN ADDITIONAL $480, $1000 OF WORTH OF WORK WITH NO REPAIRS MADE!  I'M REFUSING TO PAY ANY FEES  REGARDING THIS ISSUE AS IT  IS NOT MY OBLIGATION UNDER NISSAN'S WARRANTY.   I WILL NOT BE A SCAPEGOAT FOR A DEFECTIVE CRANKSHAFT OR ANY OTHER PART CAUSING THIS FAILURE, AS THIS IS A BREACH IN WARRANTY.  I'M PREPARED TO PURSUE THIS ISSUE TO THE FULLEST EXTANT.  THANK YOU FOR ANY HELP.  *NLM",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2003",
        "dateOfIncident": "04/05/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014029,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN TRAFFIC TRAVELING AT APPROXIMATELY 30 MPH, THE VEHICLE SUDDENLY LOST ALL POWER AND STALLED.  THE CAR COASTED TO THE SIDE OF THE ROAD, AND RESISTED ALL ATTEMPTS TO BE RESTARTED.  THE TOW TRUCK TOOK THE 2000 XTERRA TO THE NISSAN DEALERSHIP.  THE DEALER SAID THE INTERNAL FUEL SENDING UNIT, LOCATED IN THE GAS TANK, WAS CORRODED AND NEEDED TO BE REPLACED.  LUCKILY NO ONE GOT HURT.  THE  VEHICLE ONLY HAS 65,412 MILES ON IT AND IS UNDER WARRANTY.  OUR DEDUCTIBLE WAS $50 PLUS $3 TAX.  IT IS DISTURBING TO SEE HOW MANY OTHERS HAVE HAD THIS SAME PROBLEM, BUT THERE HAS BEEN NO RECALL FOR THIS PROBLEM.   THE NHTSA SHOWS MANY COMPLAINTS FOR THIS SIMILAR PROBLEM.  IT APPEARS THAT A RECALL WOULD BE JUSTIFIED!  I WOULD BE SADDENED TO HEAR THAT SOMEONE DIED DUE TO THIS ISSUE.  *JB",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2003",
        "dateOfIncident": "03/30/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013823,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALL OUT CONTINUOUSLY.  SPENT A GREAT DEAL OF MONEY ($1,479 -60K CHECKUP FOR  BREAKS, THROTTLE, FUEL SENDER REPLACEMENT, ETC) ONLY TO HAVE TO BRING IT BACK A FEW WEEKS LATER BECAUSE IT STILL STALLED OUT.  THEY \"DISCOVERED\" THE FUEL SENSOR WIRE WAS CORRODED, HAD TO WAIT 2 WEEKS FOR PART TO COME IN (THEY DID PAY FOR A RENTAL). ONLY TO HAVE PROBLEM START UP AGAIN A FEW DAYS LATER.  THIS WAS THE 5TH TIME IN 8 MONTHS I HAD IT IN FOR THE SAME ISSUE.  I DID TELL THEM THAT IT DIDN'T OCCUR AS MUCH WHEN I PUT IN DRY GAS, THEY TOLD ME TO CONTINUE TO DO AND  THAT THEY COULDN'T HELP ME SINCE THEY WEREN'T AROUND WHEN IT OCCURRED.  THEY DID SAY TO BRING IT IN WHEN IT HAPPENED!   *NLM",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "03/26/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013540,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A MAJOR HIGHWAY IN THE FAST LANE, AT 65 MPH, ALL MY DASH LIGHTS CAME ON AND MY SPEEDOMETER STARTED TO DROP FROM 60-50-40 DOWN TO 0.  LUCKILY, IT WAS AROUND 10:30 P.M AND THERE WERE NOT MANY CARS ON THE ROAD AND I WAS ABLE TO GET OVER TO THE RIGHT SHOULDER SAFELY.  I HAD MY VEHICLE TOWED TO MY RELIABLE MECHANIC, WHERE HE IDENTIFIED THE PROBLEM AS BEING THE FUEL PUMP (PART # 25060-4S415, WHICH IS ON NATIONAL BACKORDER DUE TO SO MANY PROBLEMS).  THIS COULD MEAN THAT AN XTERRA OWNER COULD WAIT FOR AS LONG AS 3-6 WEEKS TO RECEIVE THE PART.  WITH THIS FAULTY FUEL PUMP, WHAT HAPPENS IS THE SENDING UNIT FAILS, DUE TO CORROSION OF THE WIRES, THE FUEL PUMP SHUTS OFF, WHICH IN TURN, SHUTS THE ENGINE OFF (AT ANY TIME); A VERY DANGEROUS SITUATION!  AS OF YET, THIS ITEM HAS NOT BEEN RECALLED.  MY MECHANIC SUGGESTED FOR ME TO KEEP THIS PART FOR REIMBURSEMENT, AS HE HAS REPLACED NEARLY 100 PUMPS ON XTERRAS, HE IS SURE THAT THEY WILL BE RECALLING THIS ITEM SOON.  I WILL BE CALLING THE NISSAN DEALER AS WELL AS WRITING A LETTER TO CORPORATE TO REGISTER MY COMPLAINT ON FILE.  IF YOU HAVE THIS PROBLEM, OR ANY OTHER, PLEASE MAKE SURE TO IDENTIFY IT WITH NISSAN AND THIS WEBSITE SO IT AIDS IN THE RECALL PROCESS.    *NLM",
        "vin": "5N1ED28YXYC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/26/2003",
        "dateOfIncident": "05/15/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011055,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BUMPER ON 2000 NISSAN XTERRA SAGS AND RUBS AGAINST TIRE WHILE TURNING.  NISSAN HAS NOT RECALLED...PROBLEM IS VERY COMMON AMONG 2000 NISSAN XTERRAS.  I HAD THE PROBLEM FIXED AND THE BUMPER SAGGED AGAIN WITHIN MONTHS. *JB",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2003",
        "dateOfIncident": "03/24/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010998,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 XTERRA THAT DIED SUDDENLY ON MARCH 1ST WHILE GETTING READY TO DO MY ERRANDS FOR THE DAY.  I HAD TO HAVE THE VEHICLE TOWED AND 3 WEEKS LATER REC'D IT BACK ALONG W/ A BILL FOR $300.  THE FUEL PUMP WAS ON BACKORDER FOR 3 WEEKS AND I ALSO KNOW SOMEONE ELSE WHO OWNS AN XTERRA AND THE SAME THING HAPPENED TO HER JUST LAST WEEK.  TODAY, AFTER HAVING THE CAR BACK FOR LESS THAN A WEEK IT DIED AGAIN!!!  I THINK NISSAN NEEDS TO TAKE RESPONSIBILITY FOR THIS.  I HAVE SENT THEM, THE DEALERSHIP THAT FIXED IT AND THE DEALERSHIP THAT I BOUGHT IT FROM ALL E-MAILS OF WHICH HAVE BEEN IGNORED!!  I WILL SERIOUSLY CONSIDER NOT BUYING A NISSAN NEXT TIME I AM IN THE MARKET, WHICH MAY BE VERY SOON@@@",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2003",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010670,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE NISSAN XTERRA'S, THE FUEL TANK SENDING UNITS, PART #250604F415, ARE GOING BAD. THE PLASTIC IS CRACKING CAUSING THE VEHICLE TO STALL OUT. REPLACEMENT PARTS ARE ON NATIONAL BACKORDER AND HARD TO GET. I HAVE BEEN WAITING ALMOST 3 WEEKS.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "07/02/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009625,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AS THE CONSUMER MOVED THE GEARSHIFT LEVER OUT OF PARK AND DOWN TOWARDS THE DRIVE GEAR, THE GEAR SHIFT BECAME STUCK IN THE REVERSE GEAR AND THE VEHICLE SUDDENLY ACCELERATED BACKWARDS.  *AK   *NLM",
        "vin": "5N1ED28Y3YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/13/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011668,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED, WHICH CAUSED LOSS OF POWER STEERING.   *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2003",
        "dateOfIncident": "03/05/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010271,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP ON MY 2000 NISSAN XTERRA BROKE.  MY TRUCK IS ONLY 3 YEARS OLD WITH 50,000 MILES ON IT.  IT WAS TOWED TO A SHOP WHERE THEY WERE ADVISED THE PART WAS ON A NATIONAL BACK ORDER.  IT WOULD PROBABLY TAKE 2 WEEKS, IF NOT LONGER TO GET THE PART IN.  BECAUSE MY TRUCK WAS NOT AT A NISSAN DEALERSHIP, NISSAN CHARGED THE AUTO SHOP AN EXTRA 10% TO GET THE PART AS SOON AS POSSIBLE.  I CONTACTED NISSAN CORPORATE, AND THEY SAID IT WOULD TAKE 3 TO 4 DAYS FOR THEM TO AUTHORIZE THE REIMBURSEMENT OF A RENTAL CAR. *JB",
        "vin": "5N1ED28T9YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "02/22/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010214,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 NISSAN XTERRA.  I WAS DRIVING ON A MAJOR HIGHWAY IN PHILADELPHIA AND MY CAR SUDDENLY LOST POWER AND DIED.  FORTUNATELY, I WAS ABLE TO GET TO THE SIDE OF THE ROAD TO BE TOWED.  I FOUND OUT THE XTERRAS PROBLEMS WITH THEIR \"FUEL SENDING UNIT\".  *JB  IN RESEARCHING THIS, I FOUND THERE ARE MANY XTERRA OWNERS COMPLAINING OF SUDDEN LOSSES OF POWER AND IT IS THE \"FUEL SENDING UNIT\".  MY PART WAS BACK ORDERED FOR NEARLY TWO WEEKS BECAUSE OF THE DEMAND FOR THIS PART.    I WAS LUCKY NOT TO BE INVOLVED IN AN ACCIDENT.  I AM AFRAID OTHERS WILL NOT BE SO LUCKY.  I FEEL NISSAN SHOULD BE REQUIRED TO RECALL THEIR NISSAN XTERRAS AND HAVE THEM REPLACE THE \"FUEL SENDING UNITS.\"",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "01/15/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011226,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WITHOUT WARNING.*JB",
        "vin": "FULLFILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "02/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011243,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED, AND ALL POWER WAS LOST.*JB *TS",
        "vin": "5N1ED28Y0YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010236,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ACROSS COUNTRY IN MY 2000 XTERRA LAST SUMMER(2002), THE SPEEDOMETER AND ALL GAUGES ON DASH STOPPED WORKING. I WENT TO A NISSAN DEALER IN COLORADO AND THEY TOLD ME THERE WAS NOTHING THEY COULD DO UNLESS IT STAYED STUCK. THE PROBLEM WAS THAT EVERY TIME I TURNED OFF THE VEHICLE AND TURNED IT BACK ON, IT WOULD WORK AGAIN.  FINALLY, A YEAR AND A HALF LATER WHILE I WAS DRIVING ON AN EXTREMELY BUSY ROAD, THE ENGINE SHUT OFF WHILE I WAS IN THE FAST LANE GOING 70 MPH. NOT ONLY DID I HAVE TO GLIDE ACROSS 3 LANES TO A SHOULDER, THERE WAS LITTLE SHOULDER TO PARK ON BECAUSE WE HAD A PREVIOUS SNOW STORM THE ROAD WAS NOT AS WIDE AS USUAL.  I HAD TO BE TOWED TO NISSAN AND WAIT 2 WEEKS FOR A FUEL SENDING UNIT BECAUSE THEY WERE ON NATIONAL BACK ORDER.  WHILE PERIODICALLY SPEAKING TO THE SERVICE REPRESENTATIVE AT DIFFERENT POINTS WITHIN THIS TWO WEEKS, HE WAS CONSTANTLY UPDATING ME ON HOW MANY MORE XTERRA'S WERE BEING TOWED IN WITH THE SAME PROBLEM.  I AM APPALLED THAT NISSAN HAS NOT MADE AN EFFORT TO RECALL THIS PART OR TO INFORM THEIR CUSTOMERS OF THIS DANGER. THE ENGINE SHUTTING OFF WHILE DRIVING ON A BUSY FREEWAY IS EXTREMELY DANGEROUS SITUATION AND SOME ACTION NEEDS TO BE TAKEN.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2003",
        "dateOfIncident": "03/06/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010151,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, FUEL SENDING UNIT(#25060-4S415) ON 2000 NISSAN XTERRA FAILED.  THIS PART FAILURE CAUSE ENGINE TO CEASE FUNCTION DUE TO A CUT IN POWER TO FUEL PUMP.  IT WAS DETERMINED BY A MECHANIC THAT THE WIRING HARNESS OF THE SENDING UNIT FAILED DUE TO THE CORROSION OF THE WIRES AND THE CONNECTION TERMINAL.  THIS CORROSION IS BELIEVED TO BE CAUSE EITHER BY THE FUEL OR BY WATER AND SALT.  *NLM",
        "vin": "5N1ED28Y5YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2003",
        "dateOfIncident": "02/22/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010170,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SENDING UNIT FAILED.  *NLM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008480,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I HAD JUST RETURNED HOME ONE EVENING AFTER DRIVING OUR XTERRA FOR APPROXIMATELY 1 HR.  15 MIN LATER MY 10 YR OLD SON CALLED NEEDING A RIDE HOME.  SO I WENT OUT TO THE XTERRA AND IT WOULD NOT START. I HAD TO CALL A CAB TO GO GET HIM.  WE NOTIFIED OUR DEALERSHIP, THEY SAID MOST LIKELY THE FUEL PUMP SENDING UNIT GONE BAD. THAT THEY HAVE SIX XTERRA'S IN THEIR LOT THAT HAVE BEEN THERE FOR 2 WEEKS WITH THE SAME PROBLEM.  PARTS ARE ON NATIONAL BACK ORDER, AND THEY HAVE NO IDEA AS TO WHEN PARTS CAN BE EXPECTED.  WE NOW HAVE TO HAVE OUR VEHICLE TOWED TO THE DEALER, AT OUR EXPENSE BECAUSE THE EXTENDED WARRANTY WE PAID $1,200 FOR JUST RAN OUT 2 WKS AGO !!!  THEY DO NOT KNOW WHEN THEY CAN HAVE THE VEHICLE FIXED BECAUSE PARTS ARE ON BACK ORDER.    THIS PROBLEM IS A SAFETY RELATED ISSUE AND SHOULD DEFINITELY BE RECALLED.*JB",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "03/05/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008489,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXHAUST MANIFOLDS ON THE NISSAN XTERRA WITH THE VG33? V-6 ENGINE HAS A CHRONIC PROBLEM WITH CRACKING AND/OR SHEARING BOLTS.  I MYSELF HAVE FALLEN VICTIM TO THIS, AS THOUSANDS OF OTHER XTERRA OWNERS HAVE.  JUST GO TO HTTP://WWW.XTERRAOWNERSCLUB.COM, TO THE FORUMS, AND YOU WILL SEE HOW MANY HAVE HAD TO HAVE THIS REPLACED, SOMETIMES TWICE.   *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "03/04/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008502,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STOPPED RUNNING.  DIAGNOSIS IS FUEL PUMP AND SENDING UNIT.  THE MANUFACTURER IS REFUSING A RECALL EVEN WITH THE PROOF THAT THIS HAS BEEN A NUMEROUS COMPLAINT.  I AM NOW TOLD THAT I WOULD HAVE TO WAIT 2 MONTHS FOR THE PART DUE TO A HIGH DEMAND.*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2003",
        "dateOfIncident": "02/18/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009958,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED IN THE MIDDLE OF THE INTERSECTION.  *JB  THE VEHICLE RESTARTED FIVE MINUTES AFTER THE INCIDENT.  THE VEHICLE REACHED ITS DESTINATION, BUT WAS UNABLE TO BE RESTARTED AGAIN.  THE FUEL TANKS SENDING UNIT WAS REPLACED.  SCC",
        "vin": "5N1EDZ8Y8YC"
    },
    {
        "components": "FUEL SYSTEM, OTHER,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/28/2003",
        "dateOfIncident": "02/24/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008246,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "WAGNER ELEC. BRAKE/CLUTCH",
                "productMake": "WAGNER",
                "productModel": "BRAKE/CLUTCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "FUEL SENDING SYSTEM FOR MY 2000 NISSAN XTERRA IS ON NATIONAL BACK ORDER MY CAR IS DISABLED FOR TWO WEEKS AT THE DEALER. FOUND THAT MANY OTHER PERSONS HAD THE SAME PROBLEM, WHICH IS MY CAR DIED ON A MAJOR HIGHWAY FOR NO EXPECTED REASON. *JB",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2003",
        "dateOfIncident": "02/24/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008135,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SUDDENLY LOST ALL POWER WHILE I WAS DRIVING, I HAD TO HAVE THE CAR TOWED TO A SERVICE STATION BECAUSE IT WOULD NOT RESTART.  I HAD A NEW BATTERY, FULL TANK OF GAS, IT MADE NO SENSE.  THE PROBLEM IS A CORRODED COMPONENT ON THE FUEL PUMP, NECESSITATING A NEW FUEL PUMP AND COMPONENT.  PER THE SERVICE STATION, THEY WILL USE THE SAME EXACT PART AGAIN, HOWEVER A GEL WILL BE USED ON THE COMPONENT TO AVOID THE CORROSION THAT CAN OCCUR. WHY DIDN'T NISSAN DO THIS IN THE FIRST PLACE??  I AM OUT OVER $500 FOR REPAIRS AND COULD HAVE BEEN INJURED DUE TO THE LOSS OF POWER! *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/25/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009264,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP FAILED.*JB",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/24/2003",
        "dateOfIncident": "02/21/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008015,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 EXTERRA W/ 40,000 MILES.  FUEL SENDING UNIT WIRES CORRODED, CAUSING ENGINE TO STOP.  (NISSAN PART # 25060-4S415).  INCIDENT LUCKILY OCCURRED WHILE TRAVELING AT LOW SPEED ON STREET WITH LIGHT TRAFFIC.",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009158,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WITHOUT WARNING.*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/22/2003",
        "dateOfIncident": "02/13/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN XTERRA SENDING UNIT FAILED CAUSING AUTO TO STOP IN THE MIDDLE OF THE ROAD",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2003",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007802,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2000 NISSAN XTERRA SE. I WAS DRIVING AT 60 MPH WHEN THE FUEL SENDING UNIT FAILED, FORCING ME TO DRIFT TO THE SHOULDER OF A BUSY HIGHWAY. THERE I SAT WITH MY ONE YEAR OLD DAUGHTER - STRANDED. I HAD NO WARNING OF THIS TERRIBLE EVENT AND AM FURIOUS THAT A VEHICLE WITH ONLY 35,000 MILES ON IT COULD MALFUNCTION SO TERRIBLY.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/16/2003",
        "dateOfIncident": "12/13/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007572,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS MERGING INTO TRAFFIC ON A VERY BUSY HIGHWAY MY 2000 NISSAN XTERRA'S ENGINE CUT OUT.  LUCKILY I WAS ABLE TO ROLL OFF THE ROAD INTO A GAS STATION WITHOUT CAUSING AN ACCIDENT.  THE VEHICLE WOULD NOT RESTART AND SEEMED AS THOUGH IT WAS OUT OF GAS EVEN THOUGH THE TANK WAS  FULL.    THE PART THAT FAILED IS THE FUEL SENDING UNIT (NISSAN PART # 25060-4S415) WHICH HAS WIRING THAT CORRODES.  WHEN THE SENDING UNIT FAILS THE FUEL PUMP IS TURNED OFF, WHICH IN TURN SHUTS THE ENGINE OFF.      THE FAILURE OF THE FUEL SENDING UNIT IS VERY SERIOUS.  THE VEHICLE'S ENGINE CAN SHUT OFF AT ANY MOMENT CAUSING OBVIOUS SAFETY CONCERNS.    I HAVE READ ABOUT A HANDFUL OF XTERRA OWNERS ON THE INTERNET THAT HAVE EXPERIENCED THIS PROBLEM.  IF THERE ARE 10 OR SO PEOPLE WRITING ABOUT IT ON THE INTERNET, I'M SURE THERE ARE MANY MORE WHO HAVE EXPERIENCED THIS PROBLEM THAT ARE NOT ON THE INTERNET.  WHEN I PURCHASED THE FUEL SENDING UNIT AT MY LOCAL NISSAN DEALER, THE PARTS PERSON TOLD ME THAT THIS IS A COMMON PROBLEM AND THAT HE SELLS QUITE A FEW OF THEM.    I CONTACTED NISSAN AND THEY WERE EXTREMELY UNHELPFUL, AND WOULD NOT ADMIT THAT THIS IS A PROBLEM.  NISSAN MUST ISSUE A RECALL AS THIS PROBLEM MAY HARM OR KILL PEOPLE.    PLEASE SEE THE FOLLOWING LINK FOR MORE INFO: HTTP://WWW.XTERRAOWNERSCLUB.COM/CGI-LOCAL/ULTIMATEBB.CGI?",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/01/2003",
        "dateOfIncident": "02/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005087,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 NISSAN XTERRA 67245MILES FUEL PUMP SENDING UNIT RUSTED OUT.           TS",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/30/2003",
        "dateOfIncident": "01/28/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 5,
        "odiNumber": 10004945,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS THE DRIVER OF MY 2000 NISSAN XTERRAIN - INVOLVED IN A VEHICLE ACCIDENT IN JANUARY 2003.  I WAS COMPLETELY STOPPED, AND HIT FROM BEHIND BY A VEHICLE GOING 40 MPH.  I THEN HIT THE VEHICLE IN FRONT OF ME.  THE AIRBAG DID NOT DEPLOY.  THE NISSAN WAS TOTALLED AND I WAS INJURED.",
        "vin": "5N1ED28T6YC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/06/2003",
        "dateOfIncident": "12/12/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000550,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A GARDEN-VARIETY INNER-CITY POTHOLE RETURNING FROM A DAY-TRIP.  AS A RESULT, THE TORSION BAR ON MY 2000 NISSAN XTERRA WAS BROKEN.  STRANGE, FOR A VEHICLE THAT IS MARKETED AS CAPABLE OF RUGGED OFF-ROAD DRIVING.  I TOOK THE VEHICLE TO THE DEALERSHIP FOR REPAIR, BUT MY INSURANCE COMPANY PREFERRED THAT I TAKE IT SOMEWHERE ELSE.  BEFORE RELEASING THE CAR TO THE OTHER FACILITY, THE DEALIERSHIP SAID THE TORSION BAR HAD BEEN ORDERED AND WOULD BE DELIVERED THE FOLLOWING WEDNESDAY.  THAT WAS ALMOST 4 WEEKS AGO.  EACH TIME I CHECK ON THE REPAIR, I AM TOLD THE SAME THING:  PART ON NATIONWIDE BACKORDER---NO RELEASE DATE AVAILABLE.  IT ALL SEEMS FISHY TO ME...WHY WOULD THE TORSION BAR BE SO FLIMSY ON A VEHICLE SUPPOSEDLY CAPABLE OF CLIMBING MOUNTAINS?  AND WHY IS THERE SUCH A SHORTAGE OF THIS PART?  ARE SO MANY NEEDED FOR REPAIRS THAT THEY CAN'T BE KEPT IN STOCK?  AND WHAT IS THE HOLDUP ON DELIVERY OF THE PART?  I'VE TRIED TO CONTACT NISSAN U SA TWICE, WITH NO REPLY EITHER TIME.  I FEEL TAKEN ADVANTAGE OF AND JERKED AROUND BECAUSE I'M A WOMAN AND I'M AT THEIR MERCY.",
        "vin": "5N1ED28Y4YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/05/2003",
        "dateOfIncident": "09/23/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000535,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL PUMP ON MY WIFE'S 2000 NISSAN XTERRA FAILED WHILE SHE WAS DRIVING IT.  THE VEHICLE STALLED AND FAILED TO RESTART.  IT WAS TOWED TO A SERVICE STATION FOR REPAIR.  THE SERVICE TECH CALLED NISSAN AND ORDERED THE PART FUEL PUMP, WHICH WAS ON BACK ORDER.  NISSAN SAID THEY HAD A NUMBER OF FAILURES BUT NOT RECALLED THE PUMP.  NISSAN ALSO SAID TO REPLACE THE FILTER AND REGULATOR.  THE COST WAS OVER $500.  THIS FAILURE COULD HAVE CAUSED A MAJOR ACCIDENT SINCE FUEL PUMP FAILURE SHUTS THE VEHICLE OFF.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2003",
        "dateOfIncident": "11/29/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000673,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2000 NISSAN XTERRA SE EXPERIENCED A SUDDEN LOSS OF POWER WHILE TRAVELLING AT HIGH SPEEDS ON A HIGHWAY. WE WERE IN THE RIGHT LANE AND WERE ABLE TO COAST TO THE SHOULDER, BUT IF WE WERE IN ANY OF THE OTHER LANES, WE WOULD HAVE BEEN IN SERIOUS TROUBLE. THE CAR COULD NOT BE RESTARTED AND WE WERE STUCK. THE PROBLEM WAS DIFFICULT TO ASSESS... THE BATTERY WAS FULLY CHARGED, THE GAS TANK WAS FULL, THE GAS CAP WAS TIGHTLY SECURED AT THE MOST RECENT FILLING, THE SERVICE LIGHTS ON THE DASHBOARD NEVER CAME ON INDICATING A POTENTIAL PROBLEM... IT WAS VERY SUDDEN AND VERY SCARY. AFTER HAVING IT TOWED, THE DEALER FOUND THE PROBLEM... A CORRODED WIRE CONNECTION ON THE FUEL PUMP SENDING UNIT. I CHECKED THE XTERRA OWNERS CLUB WEBSITE AND FOUND THAT SEVERAL OTHER PEOPLE HAVE EXPERIENCED THIS PROBLEM. ONE PERSON HAD IT HAPPEN TO THEM IN THE HIGH SPEED LANE DURING A HEAVY SNOWSTORM, BUT THEY WERE LUCKY THAT THE TRAFFIC WAS ALREADY MOVING SLOWLY. THIS IS A VERY DANGEROUS SITUATION AND SHOULD BE COVERED BY A RECALL BY NISSAN SO THAT OTHER XTERRA OWNERS GET THIS PART REPLACED BEFORE IT HAPPENS TO THEM.",
        "vin": "5N1ED28Y8YC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": "12/12/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001071,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT 45MPH THE AUTOMATIC TRANSMISSION FAILED, CAUSING THE DRIVER TO PULL OFF OF THE ROAD.  DEALER AND MANUFACTURER NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION. TS",
        "vin": "PROVIDE"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/24/2002",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768805,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD INSTRUMENT PANEL WILL JUST GO COMPLETELY BLANK: THE ODOMETER, GAS,  CRUISE CONTROL WILL EITHER FREEZE WHERE IT IS OR WILL GO DOWN TO ZERO.  THE CRUISE CONTROL WILL NOT WORK AND HAD EVEN STARTED TO AFFECT THE GAS PEDAL.  DRIVING DOWN THE ROAD AT 55+MPH I HAD POWER EVERYWHERE EXCEPT THE GAS PEDAL.  I CONTACTED MY DEALERSHIP AND THEY SAID THERE WAS NOTHING THEY COULD DO UNLESS I COULD BRING IT IN WHEN IT WAS NOT WORKING, WHICH WAS VERY HARD TO DO BECAUSE IT WOULD STOP WORKING AT DIFFERENT TIMES AND FOR DIFFERENT LENGHTS OF TIME. SOMETIMES FOR A FEW MINUTES AND SOMETIMES FOR HOURS.  I FINALLY CALLED 1-800-NISSAN1 WITH MY COMPLAINT AND THEY HAD THE CONTROL PANEL REPLACED AND NISSAN PAID FOR IT!!!!  DT",
        "vin": "5N1ED28T6YC"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/20/2002",
        "dateOfIncident": "07/19/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765927,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THESE TIRES HYDROPLANED VIOLENTLY, EVEN AT LOW SPEED. I ALMOST LOST CONTROL OF THE VEHICLE WHILE DRIVING IN WET WEATHER. MANY OTHER MEMBERS OF THE XTERRA OWNER'S CLUB REPORT SIMILAR PROBLEMS WITH THIS TIRE. ONE MEMBER REPORTED TO THE OWNER'S CLUB WEBSITE THAT THEY CAUSED HIS VEHICLE TO FLIP OVER. THE XTERRA OWNERS CLUB WEBSITE ADDRESS IS: HTTP.WWW.XTERRAOWNERSCLUB.COM.*AK",
        "vin": "5N1ED28T6YC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/09/2002",
        "dateOfIncident": "07/20/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567048,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING INTO A PARKING LOT, THERE WAS A LOUD POP, CONSUMER PARKED THE VEHICLE, LOOKED UNDER THE FRONT OF THE VEHICLE AND SAW THE CLAMP THAT HOLDS THE STABILIZER BAR IN PLACE BROKE OFF THE FRAME OF THE VEHICLE, CONSUMER TOOK THE VEHICLE TO THE DEALERSHIP AND WAS INFORMED THAT THE PIECE WAS AN OPTIONAL PIECE AND THAT IT WAS SAFE TO DRIVE BACK HOME, BUT TO HAVE IT REPAIRED SOON, THE VEHICLE WAS THEN TAKEN TO THE LOCAL DEALER AND CONSUMER WAS INFORMED THAT THERE WAS NOTHING THAT COULD BE DONE, HOWEVER ANOTHER TECHNICIAN STATED THE ONLY WAY THE VEHICLE COULD BE REPAIRED WOULD BE TO SAW THE FRONT PORTION OF THE VEHICLE OFF AND WELD AND REPLACE THAT PORTION OR NISSAN WOULD HAVE TO SEND ANOTHER FRAME FOR THE VEHICLE, THE DEALER KEPT THE VEHICLE TO SEE WHAT COULD BE DONE, CONSUMER CONTACTED THE DEALERSHIP AND WAS INFORMED BY ANOTHER TECHNICIAN THAT THE SCREW THAT HOLDS THE CLAMP ON WAS POSSIBLY LOOSE AND SHOULD HAVE BEEN NOTICED FROM OIL CHANGES AND BY THE SCREW BEING LOOSE IT BROKE, THE TECHNICIAN STATED A CLAMP WOULD BE ORDERD AND HE WOULD UTILIZE ANOTHER PIECE OF MATERIAL AND DRILL 2 HOLES AND REPLACE THE CLAMP ENOUGH IN PLACE TO KEEP THE BAR IN PLACE, CONSUMER BELIEVES THE MECHANIC IS PERFORMING A PATCH UP JOB AND NOT CORRECTLY IDENTIFYING THE PROBLEM.*JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/02/2002",
        "dateOfIncident": "07/20/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765106,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CLAMP THAT ATTACHES TO THE FRAME THAT HOLDS STABILIZER BAR IN PLACE BROKE OFF THE FRAME OF THE VEHICLE. *AK",
        "vin": "5N1ED28T3YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/02/2002",
        "dateOfIncident": "06/30/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763730,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED EXHAUST SMELL IN PASSENGER COMPARTMENT. REPORTED TO DEPARTMENT AND WAS INFORMED THAT VEHICLE HAD A CRACKED EXHAUST MANIFOLD. WAS REPAIRED BY DEALER UNDER WARRANTY. DISCUSSIONS WITH OTHER XTERRA OWNERS AT AN ONLINE DISCUSSION GROUP (WWW.XTERRAOWNERSCLUB.COM) HAS BROUGHT TO MY ATTENTION THAT THIS HAS OCCURED TO MANY OTHER XTERRA'S. I FEEL THAT THIS WARRANTS AN INVESTIGATION AS IT SEEMS TO BE A VERY COMMON FAILURE WITH POTENTIAL TO CAUSE AN ACCIDENT IF A DRIVER WERE OVERCOME BY CARBON MONOXIDE FROM THE LEAKING EXHAUST MANIFOLD BEING DRAWN INTO THE FRESH AIR INTAKE DURING A MODERATE TO LONG DRIVE.*AK",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011913,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH  AND WITHOUT WARNING  FUEL PUMP SENSOR MALFUNCTIONED,  CAUSING  VEHICLE TO BECOME  INOPERATIVE. *AK",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/17/2002",
        "dateOfIncident": "05/10/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 566101,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WENT OUT OF CONTROL AND ROLLED OVER ONE AND HALF TIMES, IT APPEARS THAT THE DRIVER WAS KILLED AS A RESULT OF THE SEAT BELT SHOULDER HARNESS BEING WRAPPED AROUND HIS NECK EXTREMELY TIGHT CAUSING ASPHYXIA.  *YH",
        "vin": "5N1ED28T2YC"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009419,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 35 MPH VEHICLE   STARTED TO SLOW DOWN  AND AFTERWARDS  VEHICLE STALLED.  DEALER WAS CONTACTED, TECHNICIAN STATED FUEL PUMP NEEDED TO BE REPLACED. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": "05/07/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761692,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS LIGHT GOES ON INTERMITENTLY. AT THAT POINT BRAKES FEEL ABNORMAL. HEAT SHILED RUSTED AND RATTLES AND ABOVE 35 MPH. ELECTRICAL SYSTEM RE: ABS LIGHT PANEL. THE XTERRA WAS TAKEN IN FOR SERVICE, NOT INFORMED OF DIAGNOSTIC CHARGE RE: ABS BRAKE SYS. THE ASSUMED. DEALER ASSUMES BY NOT SEEING THE LIGHT ON THAT THERE IS NO PROBLEM. DEALER STATES THAT THE COMPLETE BRAKING SYSTEM WAS LOOKED AT, AND THEN CLAIMS THAT MAYBE THE BRAKES NEED TO BE CHANGED? DID HE NOT LOOK AT THE COMPLETE BRAKE SYS. THE HEAT SHEILD WAS SAWED OFF AS HE STATED AND IT REQUIERD CALLING CONSUMER NISSAN TO HAVE THEM REPLACE THE HEAT SHEILD  ACCORDING THE WARRNETY PACKAGE. NISSNA CONSUMER REP SUCKS. THEY COULD NOT SUM UP THE WARRENT PACKAGE I HAD TO FAX THEM THE THE PAGE WHERE THE CLIAM SHOWED THEY WERE LIABLE FOR THE REPLACEMENT. THE $ 83 DIAGNOSTIC CHARGE WAS WAVIED AFTER SEVERAL PHONE CALLS. DID I HAVE TO PAY $83 EVERYTIME THIS ABS LIGHT CAME ON. THE DEALER CLAIMED IT WAS A PHANTOM LIGHT. *AK",
        "vin": "5N1ED28Y9YC"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/02/2002",
        "dateOfIncident": "04/28/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009185,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FAILED THE DEALER INFORMED ME THAT IT WAS ON NATIONWIDE BACK ORDER THEY HAD NO IDEA WHEN PARTS WOULD BE AVAILABLE. *TS    ***DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT-OVER TO ARTEMIS*****761472",
        "vin": "5N1ED28Y4YC"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/22/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008207,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30MPH REARENDED ANOTHER VEHICLE AND AIRBAGS DIDNOT DEPLOY.  PLEASE ADD VIN. *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/11/2002",
        "dateOfIncident": "04/05/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007394,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "B.F.GOODRICH, P265/70R15, ORIGINAL EQUIPMENT ON A 2000, NISSAN XTERRA WITH 34000 MILES. LEFT REAR TIRE SIDEWALL BLEWOUT AT 70 MPH. *AK  CONSUMER STATES MANY TIRE DEALERS VERIFIED THAT THE TIRES WERE DEFECTIVE. CONSUMER BOUGHT FOUR REPLACEMENT TIRES. (RADIAL LONGTRAIL T/A AND DOT # APTRAV114200). *YH",
        "vin": "5N1ED28T3YC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758676,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MAKES LOUD NOISE WHEN DRIVING.  NOISE GETS LOUDER AS YOU INCREASE SPEED.  LOUD HUMM.  AS YOU PRESS THE GAS PEDAL THE NOISE GOES UP.*AK",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2002",
        "dateOfIncident": "02/19/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004400,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 00 V 288 000/SHIFT CABLE LOCK PLATE:  WHILE DRIVING AT HIGHWAY SPEED  REAR WHEELS LOCKED UP.  MANUFACTURER WAS NOTIFIED, AND INFORMED CONSUMER THAT THIS VEHICLE WAS NOT COVERED UNDER  RECALL. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION. *AK",
        "vin": "5N1ED28T5YC"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/11/2002",
        "dateOfIncident": "12/06/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756690,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I REAR-ENDED A FORD F-350 AT APPROX 30 MPH. NEITHER OF MY AIRBAGS DEPLOYED. I HAVE CALLED PETERSON'S BODY SHOP, ON A DAILY BASIS, WHERE MY VEHICLE IS BEING REPAIRED. THE BODY SHOP GUY SAID THERE WAS A \"SHORT\" IN THE WIRING HARNESS WHICH MADE THE CHECK LIGHT NOT WORK AND THE AIRBAGS NOT DEPLOY.  I FEEL THAT NO ONE WILL TAKE RESPONSIBILITY FOR THE  RESULTING FAILURE OF MY AIRBAGS BECAUSE I WAS NOT INJURED. I HAVE CONTACTED NISSAN.  I SPOKE WITH [XXX], MY FILE # IS [XXX] AT 1-800-NISSAN1.  I HAVE ALSO CONTACTED [XXX] DAHLE NISSAN OF SANDY, WHERE I LEASED THE VEHICLE. ALSO THERE ISN'T A PART NUMBER ON THE FAULTY WIRING HARNESS THAT HAS DELAYED THE REPAIR OF MY VEHICLE FROM THE ACCIDENT ON DECEMBER 6,2001. I THANK YOU FOR ANY INFORMATION YOU CAN GIVE ME. SINCERELY, [XXX]. *AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5N1ED28Y5YC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/18/2001",
        "dateOfIncident": "12/17/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000860,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PLACED IN PARK IN FIRST GEAR WITH THE PARKING BRAKE APPLIED AND  ENGINE IN  OFF POSITION.  VEHICLE SUDDENLY JUMPED OUT OF GEAR, CRASHING INTO A STREET SIGN. CONSUMER HAS CONTACTED  DEALER. PLEASE PROVIDE ANY FURTHER DETAILS.*AK",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/13/2001",
        "dateOfIncident": "08/16/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754468,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN TO THE DEALERSHIP 6 TIMES FOR MY BRAKES.  THIS PROBLEM HAS BEEN ON GOING SINCE AUGUST 16, 2001.  AT FIRST MY ABS LIGHT WOULD GO ON AND OFF.  IT TOOK THE DEALER ABOUT 4 TIMES TO FIX THAT.  THEY DID NOT KNOW HOW TO FIX IT.  THEN MY BRAKES BEGAN TO RUMBLE.  I ALMOST GOT INTO A MAJOR ACCIDENT WITH THE MECHANIC IN MY TRUCK WITH ME.  THE DEALER SAID I NEEDED NEW ROATERS AND PADS AFTER ONLY 20,000.  MECHANIC AGREED THAT I PROBABLY HAVE A   LEMON.  NISSAN WILL NOT REPLACE MY CAR EVEN AFTER I WROTE THE LEMON LAW LETTER.  NISSAN SAID THAT SINCE I SENT THE LETTER TO THE DEALER AND NOT THE MANUFACTURER, IT IS NOT VALID.  THE ARBITRATOR AT NISSAN WAS RUDE AND WAS NOT WILLING TO HELP ME.  SHE SAID ALL THEY COULD DO WAS FIX THE TRUCK, NOT REPLACE IT.  I TOLD HER THAT THEY HAVE TRIED 6 TIMES AND IT IS STILL NOT RIGHT.  SHE WAS UNWILLING TO HELP BUT TO ONLY SAY THAT WE WILL HAVE TO GO TO ARBITRATION. I AM IN THE PROCESS OF GOING THROUGH ARBITRATION WITH NISSAN.  I WILL FIGHT FOR THEM TO COMPENSATE FOR MY LOSS.  I WANT MY DOWN PAYMENT BACK SO I CAN GET MYSELF A RELIABLE CAR.  I WILL NEVER BUY A NISSAN EVER AGAIN.  THIS COMPANY DOES NOT HOLD THE HIGH ETHICS THAT THEY SAY THEY HAVE.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/18/2001",
        "dateOfIncident": "10/15/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753383,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAFFIC ACCIDENT. COLLISION WAS 50 - 60 MPH IMPACT.  *AK",
        "vin": "SN1ED28YXYC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/10/2001",
        "dateOfIncident": "09/09/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753081,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE  HAVING MY VEHICLE I HAVE HAD SEVERAL PROBLEMS. SOME MINOR HOWEVER HAVING A NEW VEHICLE I DID NOT EXPECT TO HAVE THIS MANY PROBLEMS. I HAVE HAD A CONTINUOUS WIND NOISE FROM MY SUN ROOF THAT HAS BEEN TAKEN IN 3 TIMES TO BE REPAIRED. I ALSO HAD TO HAVE MY REAR WINDSHIELD WIPER REPAIRED. APPROXIMATELY 1 MONTH AGO I HAD TO HAVE MY BRAKES REPLACED AND WAS JUST INFORMED TODAY (10/10/01) THAT MY FUEL PUMP HAS GONE BAD. SEVERAL MONTHES AGO I HAD A \"KNOCKING\" NOISE UNDER MY HOOD AND AS OF TODAY I HAVE ANOTHER \"KNOCKING\" NOISE. I JUST DO NOT FEEL THAT MY TRUCK SHOULD HAVE THIS MANY PROBLEMS WITH IT BEING SO NEW! MY TRUCK STOPPED 3 TIMES AS I WAS ON THE HIGHWAY DRIVING. I HAD CARS IN FRONT AS WELL AS BEHIND ME, IT WAS A VERY SCARY AND DANGEROUS SITUATION TO BE IN. I HOPE MY COMPLAINTS DO NOT GO UNHEARD AS I FEEL THEY HAVE AT MY CAR DEALERSHIP. THANK YOU!",
        "vin": "5N1ED28Y5YC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/03/2001",
        "dateOfIncident": "10/02/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 897272,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 35-40 MPH HAD TO APPLY BRAKES HARD AND PEDAL WENT TO THE FLOOR. VEHICLE WENT THROUGH A RED LIGHT, AND JUMPED A DITCH BEFORE CONSUMER WAS ABLE TO STOP VEHICLE. CONSUMER SUFFERED LIGHT INJURIES. CONSUMER FOUND STUDS THAT CONNECT MASTER CYLINDER TO BRAKE BOOSTER HAD BROKEN. VEHICLE NOT TAKEN TO DEALER YET.*AK  *YH",
        "vin": "5N1ED28TSYC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/02/2001",
        "dateOfIncident": "04/01/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752815,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END ALIGNMENT BADLY OUT O\\F ADJUSTMENTS CAUSES PULL TO RIGHT AND UNEVEN TIRE WEAR AND TIRE SQUEAL",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/14/2001",
        "dateOfIncident": "09/13/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 752179,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WAS QUITE SCARY TO HAVE A SEATBELT FAIL IN AN ACCIDENT. IN ADDITION, THEY ARE INVESTIGATING THE CAUSE OF THE ACCIDENT. ALL OF A SUDDEN I STARTED TO FISHTAIL -- WE DON'T KNOW IF A TIRE OR SHOCK BLEW OR WHAT HAPPENED. ALL I DO KNOW IS THAT THE SEATBELT DID NOT STAY LATCHED -- IT FLEW OFF IN THE CRASH.*AK",
        "vin": "5N1ED28Y7YC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/31/2001",
        "dateOfIncident": "08/31/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 895604,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RUNNING BOARD HAS FALLEN OFF WHILE TRAVELING AT HIGHWAY SPEEDS. DEALER HAS BEEN CONTACTED. PLEASE PROVIDE FURTHER DETAILS.*AK",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/20/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562568,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING GAS GAUAGE FALLS BELOW EMPTY, REGARDLESS OF ACTUAL FUEL LEVEL, ALSO THE SPEEDOMETER EITHER DROPS TO ZERO OR JUMPS EXACTLY TO 75 MPH, REGARDLESS OF SPEED, THE ODOMETER FIRST CHANGES TO NON-NUMERIC LINE SEGMENTS, THEN GRADUALLY FADES TO BLANK OR INSTANTLY TURNS BLANK, THE TACHOMETER EITHER DROPS TO ZERO OR JUMPS TO APPROXIMATELY 2850 RPM, THE ENGINE TEMPERATURE GUAGE EITHER DROPS TO ZERO OR JUMPS TO WHERE THE NEEDLE IS EXACTLY HORIZONTAL.*JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/20/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562568,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CRUISE CONTROL IS ON, IT KICKS OUT AND THE DASHBOARD CRUISE LIGHT FLASHES RAPIDLY, CONSUMER IS THEN UNABLE TO REESTABLISH CRUISE CONTROL WHEN THIS OCCURS THE LIGHT CONTINUES TO FLASH UNTIL THE CRUISE CONTROL IS DEACTIVATED USING THE ROCKER SWITCH, WHEN THE PANEL IS MALFUNCTIONING, THE CRUISE CONTROL ROCKER CAN BE TURNED ON, BUT CRUISE CONTROL WILL NOT ENGAGE FROM THE STEERING CONTROL.*JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2001",
        "dateOfIncident": "07/05/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748648,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER & ODOMETER FAILING INTERMITTENTLY (DEAD ABOUT 75% OF THE TIME). HAD DEALER REPLACE SPEEDOMETER-RELATED PART; DIDN'T FIX PROBLEM. LATER, NOTICED TACHOMETER, TEMP & GAS GAUGES FAILING, TOO (THOUGH USUALLY EITHER THE GAS OR THE TEMP WORK EVEN WHEN EVERYTHING ELSE IS DEAD). AFTER 1 WEEK OF WAITING, DEALER SAYS IT WILL BE 3 WEEKS BEFORE PART IS AVAILABLE. SOUNDS IDENTICAL TO NHTSA CONSUMER COMPLAINT ODI ID #886991, WHICH WAS FIRST IDENTIFIED ON 3/15/2001 (4 MONTHS AGO), SO IT SHOULD BE SOMETHING NISSAN IS PREPARED TO DEAL WITH, NOT REQUIRING A MONTH OR MORE TO GET A REPLACEMENT PART!",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/20/2001",
        "dateOfIncident": "06/16/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747159,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AN PRETTY SURE AT 50 MPH HITTING ANOTHER CAR THE AIRBAGS SHOULD DEPLOYED. I DON'T KNOW ENOUGH ABOUT THEM TO SAY THAT WITH 100%  ACCURACY, BUT YOU WOULD. NISSAN WILL LOOK AT THE CAR, BUT HOW CAN I KNOW IF THEY SAY THEY SHOUDL NOT HAVE DEPLOYED IF THEY ARE SAYING THAT TO APPEASE ME OR BECAUSE IT'S TRUE.  *AK",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2001",
        "dateOfIncident": "03/15/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 886991,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH LIGHTS AND FUNCTIONS GO OUT INTERMITTENTLY, HAPPENS FREQUENTLY.TOOK VEHICLE TO DEALER TWICE, SO FAR NOT REMEDIED. *AK",
        "vin": "5N1ED28T0Y5"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/08/2001",
        "dateOfIncident": "04/08/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743724,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CONCERNED THAT THE AIR BAG DID NOT DEPLOY UPON IMPACT OF THE OTHER VEHICLE.  THIS WAS A FRONTAL COLLISION FOR ME AND A SIDE IMPACT FOR THE OTHER VEHICLE.  MY FRONT BUMPER AND FRONT END WAS BADLY DAMAGED TO A POINT WHERE MY AIR BAGS SHOULD HAVE DEPLOYED,  THIS ALSO WHAT THE OFFICE ON THE SCENE HAD INDICATED.",
        "vin": "5N1ED28T2YC"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2001",
        "dateOfIncident": "11/01/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884310,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS BEEN SLIPPING.  *AK",
        "vin": "ADD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/19/2001",
        "dateOfIncident": "10/21/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742675,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PURGE CONTROL VALVE. *AK",
        "vin": "5N1ED28TOYC"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/15/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 740980,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACCIDENT THAT  I WAS INVOLVED IN WAS IN JULY 2000.  IT WAS ONLY ME AND THE VEHICLE INVOLVED.  THE VEHICLE WENT OUT OF CONTROL AND INTO REVERSE.  I NEVER REGAINED CONTROL  THEN ROLLED DOWN A HILL OFF THE HIGHWAY..  THE VEHICLE WAS RULED A TOTAL LOSS.  MY INJURIES WERE MINIMAL.   I WAS GREATFUL FOR THAT .   I JUST FEEL THE VEHICLE WAS RESPONSIBLE AND THERE WAS SOMETHING THAT WENT WRONG.  I HAVE CONTACTED NISSAN  WITH NO LUCK . I EVEN RECEIVED A RECALL ON THE VEHICLE .  AND STILL NISSAN HAS GIVEN ME NO ANSWERS .  THIS WAS A NEW MODEL AND I FIGURED I ONLY HAD IT FOUR MONTHS, THEY MAY WANT TO KNOW ABOUT THE ACCIDENT .AND INVESTIGATE IT.*AK",
        "vin": "5N1ED28Y2YC"
    },
    {
        "components": "SUSPENSION,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/16/2001",
        "dateOfIncident": "12/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 739488,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK END HAS GONE OUT OF CONTROL MANY TIMES FOR NO REASON, ON 12-23-2000 THE BACK END WENT OUT OF CONTROL AND THE CAR WENT INTO THE ON-COMING LANE WHICH CAUSED A ACCIDENT. ALL 3 OF OUR SEAT BELTS IN MY CAR RELEASED DURRING THE ACCIDENT. I WAS THE ONLY ONE WITH LIGHT BRUISES ON MY HIPS BUT NOT MY SHOULDER, AND EVERYONE ELSE DIDN'T HAVE A MARK AFTER THE 100MPH TOTAL IMPACT  ACCIDENT. WHEN THE SEAT BELT RELEASED, I BROKE THE DASH BOARD WITH MY KNEE, EVEN THOUGH MY SEAT WAS AS FAR BACK AS IT COULD GO. RIGHT AFTER THE ACCIDENT, WE LOOKED DOWN AND OUR SEATBELTS WERE LAYING NEXT TO US OR RETRACTED. THE LADY IN THE OTHER CAR BROKE HER STURNIM AS A RESULT OF HER SEAT BELT. I HAVE POSSESION OF THE CAR AND I AM GOING TO HAVE IT INSPECTED.*AK",
        "vin": "5NIED28Y8YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/10/2001",
        "dateOfIncident": "12/01/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877878,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  VEHICLE STALLED UNEXPECTEDLY WHICH MAY HAVE CAUSED A CRASH.  CURRENTLY, THERE IS A NOISE WHICH  MAY BE A PROBLEM WITH MUFFLER. DEALER CANNOT DETERMINE CAUSE.  *AK",
        "vin": "5N`ED28Y3YC"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/04/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877374,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUT OF A PARKING LOT NOTICED THAT ABS INDICATOR LIGHT WAS ON. PLEASE PROVIDE FURTHER INFORMATION .  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/14/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 736302,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DIFFERENTIAL HAD LOUD WHINE. DEALER REPLACED UNDER WARRANTY AT 700-1500 MILES.  REPLACEMENT DIFFERENTIAL NOW STARTING TO WHINE AT 15000 MILES.  DRIVELINE CLUNKS WHEN STOPPING AND ACCELERATING, SUSPECTED DUE TO SLACK IN TRANSMISSION, UNIVERSAL JOINTS, OR REAR END.*AK",
        "vin": "5N1ED28T0YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/13/2000",
        "dateOfIncident": "10/31/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 874864,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STANDING BEHIND ANOTHER VEHICLE WAS REAR ENDED. FRONT HOOD WAS SMASHED TO HALF WAY.    UPON IMPACT, AIR BAGS DID NOT  DEPLOY.  *AK",
        "vin": "5N1ED28TOYC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/06/2000",
        "dateOfIncident": "09/19/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 874483,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING 40MPH WHEN ANOTHER VEHICLE WAS TURNING IN FRONT. NISSAN HIT  FRONT QUARTER PANEL. UPON IMPACT, NEITHER AIR BAGS DEPLOYED. WAS EMERGENCY ROOM TREATMENT.*AK",
        "vin": "5N1ED28Y6YC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/14/2000",
        "dateOfIncident": "02/24/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 870524,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING ABOUT 55MPH ON A RUAL ROUTE AND VEHICLE RAN OFF THE ROAD.  THEN, HE CAME BACK ON THE ROAD, AND  VEHICLE STARTED SLIPPING.   RIGHT WHEEL CAME COMPLETELY OFF,  AND VEHICLE STARTED ROLLING THREE TO FOUR TIMES.  THE PASSENGERS  WERE EJECTED FROM VEHICLE.   CONSUMER SUSTAINED HEAD INJURIES. ALSO,  DUAL AIRBAGS DIDN'T DEPLOY.  VEHICLE WAS TOTALED  AND TOWED  TO REPAIR SHOP. *AK",
        "vin": "5N1ED28YXYC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/12/2000",
        "dateOfIncident": "09/06/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731109,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HEARD A ROARING NOISE IN THE TRUCK SINCE I PUCHASED IT ON 4/29/00. THE NOISE HAS GOTTEN PROGRESSIVELY WORSE. I TOOK IT INTO THE DEALERSHIP FOR THEM TO CHECK THE NOISE. I WAS INFORMED THAT THE REAR END WAS GONE. THIS IS A MAJOR COMPONENT OF THE CAR. HAD I IGNORED THE NOISE THERE MAY HAVE BEEN A SERIOUS ACCIDENT , CAUSING SEVERE INJURY TO ME, MY PASSENGERS, AND OTHERS. I AM ALARMED AND REPORTING THIS BECAUSE SUCH A DEFECT  MAY GO UNREPORTED. THANK YOU FOR ANY ASSISTANCE ATTENTION YOU MAY GIVE TO THIS ISSUE.  *AK",
        "vin": "5N1ED28T5YC"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/23/2000",
        "dateOfIncident": "08/11/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 728842,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "3 OF THE 6 STUDS AND 5 OF THE 6 LUG NUTS CAME OFF OF THE TIRE( DOT NUMBER: 0215042 TIRE SIZE: P265/70R15 )",
        "vin": "5N1ED28T8YC"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/30/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 726243,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN STATES THERE IS NOT A PROBLEM.NOT COOPERATIVE. NO SAFETY DEFECT MENTIONE DIN SUMMARY.  *AK",
        "vin": "5N1ED28Y1YC"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/01/2000",
        "dateOfIncident": "06/23/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 724818,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED WITH ONE WHEEL BEHIND PARKING STOP, A/C RUNNING AND VEHICLE THOUGHT TO BE IN PARK, VEHICLE SAT THERE FOR 5 OR MORE MINUTES, VEHICLE STARTS MOVING FORWARD,GOES DOWN ABOUT 8'SLOPE, ACROSS ROAD, DOWN ANOTHER 14'SLOPE, THROUGH FENCE TAKING UP 4/4 POST SET IN CONCRETE, STRAIGHT AS ARROW ABOUT 100 PLUS FEET INTO LAKE. MOTHER AND STRANGER WERE ABLE TO OPEN DOORS AND REMOVE TWO CHILDREN BEFORE CAR SUNK TO TOP, WHEN WRECKER GOT CAR OUT IT WAS IN REVERSE, AND THE DOORS OR WINDOWS WOULD NOT OPEN.*AK",
        "vin": "5N1ED28T7YC"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/11/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721322,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN IS NOT BACKING THE WARRANTY. NO SAFETY DEFECT LISTED IN SUMMARY.  *AK",
        "vin": "5N1ED28Y4YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2000",
        "dateOfIncident": "12/15/1999",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 859910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED PROBLEMS WITH FOLLOWING  LEAKAGES: 1. OIL LEAK/ 2. COOLANT LEAKS,  AND 3. CONTINUOUS TRANSMISSION FLUIDS LEAKS, ON WHICH DEALER WAS STILL WORKING ON.  *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/04/2000",
        "dateOfIncident": "03/31/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 721010,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ACCELERATING ON TO THE FREEWAY, MY VEHICLE BEGAN TO CLIMB IN SPEED. I THOUGHT I HAD ACCIDENTLY HIT THE \"CRUISE\" BUTTON SO, I CANCELLED THE CRUISE CONTROL. THAT DID NOT WORK AND THE CAR BEGAN TO GAIN MORE SPEED DESPITE MY ATTEMPTS TO BRAKE. I ALSO PLACED MY FOOT BEHIND THE FOOT PEDAL; NOTHING WOULD SLOW THE CAR DOWN. I FINALLY STOPPED THE VEHICLE BY PRESSING ON THE BRAKES WHICH, WERE TO THE FLOOR. I WILL NEVER GET IN THIS VEHICLE AGAIN, EITHER AS A DRIVER OR A PASSENGER.  *AK",
        "vin": "5N1ED28T2YC"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/06/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 857974,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DRIVER'S  SEAT BELT DOES NOT BUCKLE.  DEALER WILL INSPECT AND REPAIR THE VEHICLE.  *AK",
        "vin": "5NLED28Y7YC"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 857338,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "POOR DRIVEABLITY PROBLEM AND ERRATIC IDELING. PLEASE PROVIDE FURTHER DETAIL.  *AK",
        "vin": "5N1ED28Y8YC"
    }
]