[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/11/2020",
        "dateOfIncident": "07/11/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11338755,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NEUTRAL PARKED IN TRAFFIC AT A RED LIGHT /  INTERSECTION WAITING FOR GREEN, THE DRIVER SIDE AIRBAG IN MY SEAT DEPLOYED/ EXPLODED CAUSING INJURY AND BRUISING TO LEFT ARM.",
        "vin": "YS3DD55H4Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2018",
        "dateOfIncident": "09/26/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11131905,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT INTO MY PARKED VEHICLE AS NORMAL, CLOSED THE DOOR AND FASTENED MY SEATBELT. I THEN DEPRESSED THE CLUTCH PEDAL AND INSERTED THE KEY INTO THE IGNITION. AS I TURNED THE KEY TO START THE CAR, THE DRIVERS SEAT SIDE IMPACT AIRBAG DEPLOYED SPONTANEOUSLY CAUSING TEMPORARY LOSS OF HEARING, A RINGING SOUND IN THE EARS, AND INJURY TO MY LEFT ARM. I REMOVED THE KEY FROM THE IGNITION AND EXITED THE VEHICLE. THE VEHICLE WAS PARKED, AND OFF/NOT RUNNING, IN A PARKING LOT AT A LOCAL SHOPPING MALL. THE VEHICLE WAS NOT HIT, DAMAGED, OR USED IN ANY OTHER WAY OUT OF ORDINARY OPERATION. THERE WERE NO WARNING LIGHTS, SOUNDS, OR SIGNS OF DISTURBANCE IN THE AIRBAG SYSTEM. I WENT TO THE HOSPITAL SHORTER AFTER TO BE TREATED FOR MY INJURIES. THE VEHICLE WAS THEN TOWED TO ITS PRIMARY PLACE OF REST, MY HOME.",
        "vin": "YS3DD55H2Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/23/2017",
        "dateOfIncident": "08/23/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019173,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED AND WITH THE ENGINE RUNNING THE DRIVER'S SEAT AIRBAG SPONTANEOUSLY DEPLOYED.",
        "vin": "YS3DP55G9Y7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/17/2016",
        "dateOfIncident": "09/19/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10916660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 SAAB SAAB 9-3. THE CONTACT STATED THAT THE BACK PASSENGER SIDE AIR BAG DEPLOYED WITHOUT ANY REAR IMPACT OR WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 92,000.",
        "vin": "YS3DD78H0Y7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/09/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10781171,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RETURNING FROM THREE DAYS OF AIR TRAVEL AND REACHED MY CAR WHICH WAS PARKED IN A SECURE CORPORATE AIRPORT PARKING LOT WITH NO OTHER CARS AROUND IT. I PLACED MY LUGGAGE IN THE TRUNK, ENTERED THE CAR AND PUT ON MY SEAT BELT. I STARTED THE CAR; IT STARTED NORMALLY WITH NO WARNINGS OR ANYTHING ABNORMAL. I PLACED THE CAR IN REVERSE, ROLLED APPROXIMATELY THREE FEET, AND THE SEAT-BACK SIDE AIRBAG DEPLOYED EXPLOSIVELY. IT SHATTERED THE DRIVER'S SIDE WINDOW, STRUCK ME VERY HARD ON THE LEFT SHOULDER AND UPPER ARM, AND SHOVED ME VIOLENTLY TOWARD THE CENTER OF THE CAR. I IMMEDIATELY STOPPED THE CAR AND TRIED TO RECOVER MY SENSES. I THOUGHT INITIALLY THAT I HAD BEEN SHOT OR SHOT AT WITH A GUN. THE EXPLOSION WAS VERY LOUD, AND LEFT RINGING IN MY LEFT EAR. I SHUT THE CAR OFF, GOT OUT AND CHECKED THE DAMAGE BOTH TO MY CAR AND MYSELF. MY UPPER ARM WAS SEVERELY BRUISED; INITIALLY THAT WAS THE ONLY PAIN THAT I FELT. THERE WAS GLASS EVERYWHERE, BOTH INSIDE AND OUTSIDE OF THE CAR. I NOTIFIED THE LOCAL SECURITY BOTH TO RECORD THE EVENT AND HOPEFULLY CLEAN UP THE GLASS. I TOOK SEVERAL PICTURES WITH MY PHONE, THEN DROVE HOME AFTERWARD WITHOUT INCIDENT. THE NEXT MORNING I HAD NECK, BACK, AND SHOULDER PAIN. I NOTIFIED AND FILED A CLAIM WITH MY INSURANCE AGENCY, CALLED MY DEALERSHIP, AS WELL AS UPDATING MY FAMILY OF THE OCCURRENCE AND WENT TO THE DOCTOR'S OFFICE FOR CHECK-OUT. HAD THIS EVENT OCCURRED WHILE DRIVING, AND ESPECIALLY IN TRAFFIC AT HIGHWAY SPEEDS, I AM CONFIDENT THIS EVENT WOULD HAVE CAUSED A SERIOUS ACCIDENT. IT WOULD HAVE BEEN VERY DIFFICULT TO MAINTAIN CONTROL OF THE VEHICLE GIVEN THE VIOLENCE OF THE DEPLOYMENT. I AM VERY THANKFUL THAT THIS EVENT OCCURRED IN A PARKING LOT AND NOT IN TRAFFIC, AND THAT I WAS NOT SERIOUSLY INJURED. THIS WAS A COMPLETELY UNCOMMANDED AIRBAG DEPLOYMENT, AND I WOULD LIKE TO PREVENT A SERIOUS ACCIDENT FROM OCCURRING IF THIS HAPPENS TO SOMEONE ELSE.",
        "vin": "YS3DP55GXY7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10648817,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDE AIRBAG ON DRIVER'S SIDE (LOCATED IN OUTSIDE EDGE OF DRIVER'S SEAT) DEPLOYED WHILE THE CAR WAS PARKED AND RUNNING. THIS WAS CLEARLY A MALFUNCTION -- THERE WAS NO EXTERNAL EVENT OR DAMAGE THAT WOULD CAUSE AN AIRBAG TO DEPLOY. SIGNIFICANT BRUISING TO DRIVER'S LEFT ARM, TEMPORARY HEARING LOSS; DID NOT REQUIRE MEDICAL ATTENTION.  *TR",
        "vin": "YS3DD55H9Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "09/16/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 SAAB 9-3. THE CONTACT STATED THAT AFTER SHIFTING INTO DRIVE FROM REVERSING, THE VEHICLE HESITATED. THE CONTACT MENTIONED THAT THE VEHICLE WAS RESTARTED AND RESUMED TO NORMAL. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC, WHO DIAGNOSED THAT THE IGNITION SWITCH NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 114,000.",
        "vin": "YS3DF78K0Y7"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/20/2014",
        "dateOfIncident": "02/08/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604729,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2000 SAAB 9-3. THE CONTACT STATED THAT THE DRIVERS SEAT BELT WAS NOT RETRACTING PROPERLY WHICH PREVENTED HIM FROM BEING PROPERLY SECURED. THE CONTACT WAS UNABLE TO WEAR THE SEAT BELT SINCE IT WAS NOT LONG ENOUGH TO CONNECT TO THE LATCH BECAUSE OF THE FAILURE. THE VEHICLE WAS SCHEDULED FOR DIAGNOSTIC TESTING BY AN AUTHORIZED DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 135,000.",
        "vin": "YS3DD78H9Y7"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2013",
        "dateOfIncident": "08/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN MY NEIGHBORHOOD STREET GOING APPROXIMATELY 15MPH WHEN MY PASSENGER SIDE IMPACT AIRBAG SPONTANEOUSLY DEPLOYED CAUSING A LOUD EXPLOSION SOUND AND MY PASSENGERS SIDE INSIDE DOOR HANDLE WAS EJECTED FROM THE DOOR. I HAD NOT HIT ANYONE OR ANYTHING.   *TR",
        "vin": "YS3DF78K6Y7"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/12/2012",
        "dateOfIncident": "08/05/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470315,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO THE STORE WHEN I HEARD BOOM AND SEEN SMOKE AND I REALISE THE SIDE AIRBAG OPEN. I DID NOT COME IN CONTACT WITH ANYTHING . THE DRIVER SEATBELT WENT ABOUT A YEAR AGO, IT BEGAN JAM MEACHICAN SAIDED THAT PULLEY JAM.  *TR",
        "vin": "YS3DF78K9Y7"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/21/2011",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436634,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 SAAB 9-3. THE CONTACT STATED THAT THE VEHICLE WAS STOPPED WHEN SHE EXPERIENCED EXTREME DIFFICULTY PULLING THE FRONT DRIVER'S SEAT BELT OUT OF ITS PRETENSIONER. THE FAILURE RECURRED WHENEVER THE SEAT BELT WAS OPERATED. APPROXIMATELY FIVE YEARS LATER, THE PRETENSIONER FRACTURED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, BUT WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 6,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2011",
        "dateOfIncident": "02/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405626,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SAAB 9-3. THE CONTACT STATED THE CHECK ENGINE LIGHT ILLUMINATED AS HE WAS TAKING THE VEHICLE FOR EMISSIONS TESTING. THE VEHICLE WAS REJECTED DUE TO THE CODES THAT SHOWED ON THE EMISSION TEST. THE VEHICLE WAS TAKEN TO A MECHANIC WHO ADVISED THAT THE IDM CODE, WHICH IS THE IGNITION DISCHARGE MODULE, CAUSED THE VEHICLE TO STALL, OVER HEAT AND FOR THE CHECK ENGINE LIGHT TO ILLUMINATE. THE DEALER WAS CONTACTED WHO INFORMED HIM TO BRING THE VEHICLE IN BECAUSE IT WAS INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 05V399000 (ELECTRICAL SYSTEM: IGNITION: MODULE). HE THEN TOOK THE VEHICLE TO THE DEALER WHERE THEY LATER INFORMED HIM THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL AND HE WOULD HAVE TO PAY $700 FOR THE REPAIRS.  THE MANUFACTURER WAS CONTACTED WHO CONFIRMED THAT THE VEHICLE WAS NOT PART OF THE RECALL AND HE WOULD HAVE TO PAY FOR THE REPAIRS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE WAS MILEAGE 106,871.",
        "vin": "YS3DD55H8Y2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/26/2011",
        "dateOfIncident": "02/20/2011",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10385730,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS STARTED LEAKING AT A STEADY STREAM FROM THE TOP OF THE TANK WHENEVER THE ENGINE WAS RUNNING. THE CAR WAS TOWED TO THE DEALER. FROM THE DEALER REPAIR STATEMENT: \"CUSTOMER STATES CHECK RAW GAS LEAKING FROM ABOVE THE FUEL TANK, ONLY WITH CAR RUNNING. FUEL TANK RETAINER CLIP BROKEN. REPLACED FUEL TANK RETAINER CLIP.\" MY CONCERN: THIS EXACT SAME PROBLEM (FUEL TANK RETAINER CLIP FAILURE AND LEAKING GAS) WAS A SAFETY RECALL FOR 2001 AND NEWER SAAB 9-3S. SAAB SHOULD HAVE INCLUDED 2000 MODELS AS WELL SINCE THEY HAVE THE SAME DESIGN (ACCORDING TO THE DEALER AND COMMENTS ON THE WEB). OVERALL, THIS IS A GOOD CAR, BUT SAFETY MATTERS!",
        "vin": "YS3DD35H1Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2009",
        "dateOfIncident": "06/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 SAAB 9-3.  IN 2006, THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 05V399000.  THE FAILURE WAS NOT PRESENT AT THE TIME, BUT THE IGNITION CONTROL MODULE WAS REPLACED AS A PRECAUTIONARY REMEDY.  AFTER THE REPAIR, THE VEHICLE WOULD HESITATE AND OFTEN STALL.  THE DEALER STATED THAT THE RECALL REPAIR WAS PERFORMED; THEREFORE, THEY WOULD NOT ASSUME ANY FURTHER LIABILITY.  THE CONTACT CONTINUED TO EXPERIENCE DIFFICULTY STARTING THE VEHICLE.  THE VEHICLE HAS NOT BEEN REPAIRED CORRECTLY.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 70,200 AND CURRENT MILEAGE WAS 107,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/26/2009",
        "dateOfIncident": "05/06/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269966,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SAAB 2000 9-3 TURBO CONTINUED TO BE PLAGUED WITH NO START PROBLEMS (RECALLED ITEM REPAIRED BY SAAB DEALERSHIP.  OIL SLUDGE AS A RESULT OF PROBLEMS RELATED TO   RECALL CAUSED ENGINE/TURBO TO FAIL AT 94,000 ON INTERSTATE HIGHWAY.  CAR HAS BEEN TOWED TO MECHANIC.  SERVICE AT DEALERSHIP IS DOCUMENTED AND SHOULD HAVE PREVENTED THIS TYPE OF ENGINE. TURBO FAILURE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2009",
        "dateOfIncident": "01/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254844,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS HAD PROBLEMS STARTING FOR MANY YEARS AND I HAVE TAKEN IT TO VARIOUS SAAB SERVICE CENTERS WITHOUT MUCH LUCK. IT HAS GOTTEN PROGRESSIVELY WORSE OVER THE YEARS.  THERE WAS A RECALL ON THIS MODEL AND YEAR ISSUED ON THE PART WHEN I BROUGHT IT IN WHEN THE RECALL WAS ISSUED THEY SAID THAT MY DI CASSETTE WAS NOT PART OF THE RECALL.  I HAVE JUST HAD TO PAY AND REPLACE THIS PART AND I FEAR THAT THIS DAMAGED PART HAS COMPROMISED OTHER PARTS OF THE CAR. *TR",
        "vin": "YS3DD55H2Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2008",
        "dateOfIncident": "07/15/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250865,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 SAAB 9-3.  THE IGNITION MODULE WAS REPLACED IN THE CONTACT'S VEHICLE.  TWO MONTHS LATER, HE RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 05V399000 (ELECTRICAL SYSTEM:IGNITION:MODULE) AND HE IMMEDIATELY CALLED THE DEALER.  THE DEALER WOULD NOT REPAIR THE VEHICLE BECAUSE A NEW IGNITION MODULE WAS ALREADY INSTALLED.  DAYS LATER, WHILE DRIVING 45 MPH, THE VEHICLE LOST COMPLETE POWER AND WAS ABLE TO BE RESTARTED AFTER SEVERAL ATTEMPTS.  HE TOOK THE VEHICLE TO A LOCAL REPAIR SHOP AND A MECHANIC STATED THAT THE CATALYTIC CONVERTER WAS CLOGGED DUE TO IGNITION MODULE FAILURE.  THE CONTACT CALLED THE MANUFACTURER, BUT HAS NOT RECEIVED A RESPONSE.  THE FAILURE AND CURRENT MILEAGES WERE 64,000.",
        "vin": "YS3DP35G7Y7"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2008",
        "dateOfIncident": "09/20/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246362,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 9-3 HAD THE IGNITION MODULE RECALL DONE A FEW YEARS AGO. WHILE DRIVING AT 45 MPH THE MOTOR STOPPED. LOST ALL ELECTRICAL POWER. CAR WOULD NOT RESTART.  THE REPAIR SHOP REPLACED THE CATALYTIC BECAUSE IT WAS PLUGGED. THEY SAID IT COULD BE CAUSED BY THE IGNITION MODULE.  *TR",
        "vin": "YS3DP35G7Y7"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/29/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED 2.0L 2000 SAAB 9-3 A YEAR AGO. SINCE THEN, THE CAR HAS HAD PROBLEMS THAT MANY OTHER OWNERS OF THIS SIMILAR MAKE/MODEL/YEAR HAVE HAD. I'VE REPLACED THE THROTTLE HOUSING, SERPENTINE BELT, BELT TENSIONER, CRANKSHAFT SENSOR, AND MOST RECENTLY THE WATER PUMP. NOW, I'M GETTING A CHECK ENGINE LIGHT FAULT CODE P1312 AND P1334, WHICH POINTS TO THE DIRECTION IGNITION MODULE. I KNOW THAT THERE WAS A RECALL OF THE DIRECT IGNITION MODULE IN CERTAIN SAABS FOR THIS MAKE/MODEL/YEAR, BUT IT'S ODD THAT MY CAR COINCIDENTALLY HAPPENS TO HAVE THE SAME PROBLEM. I'M THINKING THAT THE PROBLEM IS LARGER THAN INITIALLY ANTICIPATED WITH THE ORIGINAL RECALL.  *TR",
        "vin": "YS3DD58HXY2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/07/2008",
        "dateOfIncident": "08/14/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 SAAB 9-3 WITH SEVERAL PROBLEMS AFTER REPAIRS WERE MADE. CONSUMER STATES THAT AFTER THE SERPENTINE BELT WAS REPLACED. THE NEW BELT SHRED. DEALER SAID TO PAY FOR THE SECOND REPAIR AND THEN GET REIMBURSED.  *KB  THE CONSUMER ALSO STATED FOLLOWING THE REPLACEMENT OF THE WATER PUMP WHICH FAILED TWICE, THE VEHICLE DEVELOPED A RATTLING SOUND. THE DEALER STATED THE PROBLEM WAS THE CLUTCH, HOWEVER THE CONSUMER DISAGREED WITH THEIR FINDINGS. THE DEALER THEN INSTALLED AN AC COMPRESSOR BRACKET INCORRECTLY WHICH RESULTED IN ANOTHER FAILURE OF THE SERPENTINE BELT. THE DEALER STATED THE FAILURE OF THE SERPENTINE BELT WAS NOT A RESULT OF IT BEING FAULTY, IT WAS DUE TO THE BELT BEING DAMAGED OR CRACKED. THE DEALER STATED THE AIR CONDITIONING BRACKET HAD BROKEN AND IN DOING SO, IT THREW THE BELT OFF OF THE PULLEYS. THE AC BRACKET WAS THE CASUAL PART FAILURE NOT THE BELT. THE BELT WAS DAMAGED WHEN IT CAME OFF. THE OIL PUMP RING AND CRANKSHAFT SEAL WERE REPLACED DUE TO AN OIL LEAK AT THE PUMP. *JB",
        "vin": "YS3DF55KXY2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2008",
        "dateOfIncident": "03/26/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226768,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR STOPPED ON MASS TURNPIKE AROUND MIDNIGHT. I HAD VEHICLE TOWED TO THE NEAREST SAAB DEALER. THEIR DIAGNOSIS WAS THE OIL SLUDGE. EVEN AT THAT TIME THE DEALER DID NOT MENTION ANYTHING ABOUT SPECIAL WARRANTY THE SAAB ANNOUNCED IN 2005. I HAVE NEVER RECEIVED ANY INFORMATION FROM THE SAAB AS WELL. AFTER I SEARCH THE INTERNET I FOUND OUT ABOUT THE SPECIAL WARRANTY. I FILED A CLAIM AND SUBMITTED ALL OIL CHANGE RECEIPTS I HAD ( IT IS THEIR REQUIREMENT TO QUALIFY FOR THE SPECIAL WARRANTY). THE CAR IS ALMOST 8YEARS OLD. THE ONLY THREE RECEIPTS I DID NOT SUBMIT WERE WHEN THE CAR HAD 10,000, 20,000, AND 30,000 MILES. MY CLAIM WAS REJECTED BASED ON THESE 3 MISSING OILCHANGE RECEIPTS. I AM A SECOND OWNER THEREFORE I DO NOT HAVE THESE RECORDS AND SAAB REFUSED TO PROVIDE ME WITH THE PREVIOUS OWNER'S NAME ( PRIVACY ACT) AND THEY ALSO REFUSED TO CONTACT THE PREVIOUS OWNER ON MY BEHALF. THE MILEAGE ON THE CAR AT THE TIME OF THE ENGINE FAILURE WAS 104,000 MILES. IT IS OBVIOUS THAT THE OIL CHANGE IN THE FIRST YEAR OF THE CAR HAD NOTHING TO DO WITH THE PROBLEM I HAVE EXPERIENCED. THE CAR WOULD NOT DRIVE FOR THE NEXT 7 YEARS.  THE PEOPLE IN THE SAAB'S SPECIAL WARRANTY DEPT. WERE ARROGANT AND TOTALLY UNPROFESSIONAL.  THEIR RESPONSE TO ME WAS \" BUY A NEW CAR\". AS OF NOW MY CAR IS UNDRIVABLE AND HAS NO VALUE. I STRONGLY FEEL THAT SAAB CORP. SHOULD TAKE CARE OF THAT PROBLEM UNDER THE SPECIAL WARRANTY. IF YOU ARE UNABLE TO HELP ME PLEASE DIRECT ME TO THE RIGHT PLACE.  THAT CAR COST ME SO MUCH MONEY AND I REFUSE TO ACCEPT THEIR DECISION.  *TR",
        "vin": "YS3DD55H7Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/24/2008",
        "dateOfIncident": "02/19/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE SERPENTINE BELT ON MY SAAB 9-3, MODEL YEAR 2000 HAS FAILED 3 TIMES ON ME.  THE LAST TIME THE SERPENTINE BELT DISINTEGRATED INTO TINY PIECES WHILE THE CAR WAS DRIVEN AND ALMOST LED TO AN ACCIDENT. THIS HAPPENED LESS THAN 6 MONTHS AND 5,000 MILES AFTER THE BELT WAS REPLACED. ACCORDING TO THE REPAIR FACILITY THE DISINTEGRATION WAS DUE TO THE IDLER PULLEY SEIZURE AND THEY CLAIM IT HAPPENS FREQUENTLY ON SUCH CARS.  *TR",
        "vin": "YS3DF55KXY2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/28/2007",
        "dateOfIncident": "06/13/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200985,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 SAAB 9-3.  AT 68,359 MILES, THE ENGINE WAS REBUILT DUE TO A BLOWN PISTON.  THE MANUFACTURER STATED THAT HIS VIN WAS NOT INCLUDED IN THE RECALL.  FIFTEEN MONTHS LATER, THE ENTIRE ENGINE HAD TO BE REBUILT FOR THE SAME FAILURE.  WHILE DRIVING 55 MPH, THE VEHICLE STALLED AND THE ENGINE SUDDENLY FAILED.  THE VEHICLE WAS REPAIRED, BUT THE CONTACT BELIEVES THAT THE MANUFACTURER SHOULD CONSIDER THIS A RECALL BECAUSE OF THE FREQUENCY OF THE FAILURES.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 97,780.",
        "vin": "YS3DD78H7Y7"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/25/2007",
        "dateOfIncident": "05/23/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191732,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 SAAB 9-3 FUEL LINE DISCONNECTED AT THE TANK ON THE PRESSURIZED SIDE OF THE FUEL PUMP DUE TO A BROKEN PLASTIC TAB WHICH HODS THE FUEL LINE IN PLACE ( A TERRIABLE DESIGN) ALLOWING THE FUEL PUM DO DISCHARGE THE FUEL DIRECTLY ON TOP OF THE GAS TANK AT THE MAXIMUM DISCHARGE RATE OF THE FUEL PUMP ... I.E. GALLONS PER MINUTE WERE BEING PUMPED OUT THE TOP OF THE TANK RESULTING IN AN EXTREMELY DANGEROUS SITITUATION.",
        "vin": "YS3DF55K5Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/20/2006",
        "dateOfIncident": "08/13/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169111,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S 2002 SAAB 9-3'S ENGINE CAUGHT ON FIRE WHILE IT WAS BEING DRIVEN. *KB  THE MANUFACTURER WAS CONTACTED BUT THEY REFUSED TO PROVIDE ANY ASSISTANCE BECAUSE THE VEHICLE WAS NO LONGER UNDER WARRANTY.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2006",
        "dateOfIncident": "07/19/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164231,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED PARTS FOR A RECALL WERE PURCHASED AT AN AFTERMARKET PARTS STORE.  THE NHTSA RECALL WAS # 05V399000 CONCERNING THE IGNITION MODULE.  WHILE APPLYING FOR REIMBURSEMENT, THE CONTACT WAS DENIED REIMBURSEMENT BECAUSE PROOF OF PAYMENT WAS NOT PROVIDED. THE PURCHASE WAS PAID FOR WITH A CREDIT CARD.",
        "vin": "YS3DD58H6Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/02/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159454,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 SAAB 9-3 STALLS WHILE IN MOTION DUE TO IGNITION DISCHARGE MODULE (IDM).  *TS  THE VEHICLE HAS BEEN TAKEN TO THE DEALER TWICE . ON BOTH OCCASIONS THE CONSUMER WAS TOLD THAT THE VEHICLE MAY HAVE IDM PROBLEMS, BUT THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2006",
        "dateOfIncident": "09/13/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158416,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER 2000 9-3 SAAB ENGINE LIGHT ILLUMINATED.  *TS ***NAR***  THE CONSUMER WAS TOLD BY THE DEALER THAT THE IGNITION CASSETTE NEEDED TO BE REPLACED, HOWEVER ONE MONTH LATER THE CONSUMER RECEIVED A RECALL NOTICE IN THE MAIL REGARDING THE SAME PROBLEM HE HAD FIXED THE PREVIOUS MONTH.  *JB",
        "vin": "YS3DF55K3Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2006",
        "dateOfIncident": "05/15/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157558,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 75MPH ON THE FREEWAY THE VEHICLE STALLED WITHOUT WARNING.  THE VEHICLE RESTARTED A COUPLE OF MINUTES LATER.  THE VEHICLE WAS TOWED TO THE RESIDENCE WERE IT REMAINS.  THE VEHICLE HAS NOT BEEN INSPECTED BY THE DEALERSHIP.  A RECALL, # 05V399000 WAS PERFORMED ON APRIL 26, 2006 CONCERNING THE IGNITION MODULE.",
        "vin": "YS3DD58H9Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2006",
        "dateOfIncident": "04/28/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156369,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE STALLS SPORADICALLY BEFORE START UP AND WHILE DRIVING IN TRAFFIC WITHOUT WARNING AT ANY SPEED.  AFTER SITTING A WHILE, THE VEHICLE WILL RESTART.  AN NHTSA RECALL, #05V399000 WAS PERFORMED ON THE VEHICLE CONCERNING, THE ELECTRICAL SYSTEM: IGNITION: MODULE HOWEVER, THE RECALL DID NOT REMEDY THE PROBLEM.  THE DEALERSHIP WOULD NOT OFFER A SECOND REPAIR WITHOUT CHARGE UNDER THE RECALL.",
        "vin": "YS3DF58K8Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/21/2006",
        "dateOfIncident": "07/11/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155805,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING MY 2000 SAAB 9-3 [XXX] IN 2003, I HAVE SPENT $9,000 IN VEHICLE REPAIRS WHICH HAVE SUBSEQUENTLY BECOME \"RECALL NOTICES\" ISSUED FROM SAAB CARS USA. THE VEHICLE'S ENGINE FAILED FALL 2004 - WITH SUBSEQUENT REPAIR COVERAGE UNDER A RECALL NOTICE ISSUED 5/17/05. THE IGNITION DISCHARGE MODULE FAILED IN 7/05, WITH REPAIRS SUBSEQUENTLY COVERED THROUGH AN IDM RECALL NOTICE ISSUED 3/31/06.    AT THE TIME OF THE IDM FAILURE IN 7/05, THE SAAB DEALERSHIP ALSO DIAGNOSED CATALYTIC CONVERTER FAILURE IN THE VEHICLE. DO THE MAJOR MECHANICAL ISSUES THAT EXIST WITH THIS VEHICLE CAUSE A CASCADE OF EVENTS WHICH HAVE DAMAGED THE CATALYTIC CONVERTER, NOW REQUIRING REPLACEMENT?  *NM    *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "YS3DF58K1Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2006",
        "dateOfIncident": "02/27/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151413,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION CASSETTE FAILURE.  *NM",
        "vin": "YS3DD55H1Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2005",
        "dateOfIncident": "07/05/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130563,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RELATED TO NHTSA ACTION NUMBER (INVESTIGATION #) : PE05017.    (1) CHECK ENGINE LIGHT ACTIVATED ON AND OFF.  I HAD A TECHNICIAN RUN THE CODES.  THE DIRECT IGNITION CASSETTE (DIC) WAS SENDING ERROR CODES INDICATED POSSIBLE IMMINENT FAILURE.    (2) THE DIC DID NOT FAIL YET ON MY CAR (NOW HAS 68,000 MILES).  GIVEN SAAB'S HISTORY WITH THIS PARTICULAR PART AND THE CONSEQUENCES OF FAILURE (TOTAL LOSS OF POWER WHEREVER IT HAPPENS), I DIDN'T TAKE ANY CHANCES.    (3)  ON THE ADVICE OF OTHER SAAB OWNERS AND MY INDEPENDENT SAFE TECHNICIAN, I PURCHASED AND INSTALLED A NEW DIC.  THE OLD PART IS STILL AVAILABLE.  I'M HOLDING ONTO IT IN CASE THE NEW ONE FAILS.  *NM",
        "vin": "YS3DD55H3Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/29/2005",
        "dateOfIncident": "06/24/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130617,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN A BUSY STREET WHEN MY CAR STALLED, AND WOULD NOT RESTART.  THERE WAS NO INDICATION THAT ANYTHING WAS WRONG PRIOR TO THE CAR DYING.  FORTUNATELY, I WAS ABLE TO COAST OFF THE ROAD INTO A PARKING LOT.   THE CAR WAS TOWED TO THE LOCAL SAAB DEALER.  THEY REPLACED THE DI CASSETTE AND DID A SOFTWARE UPGRADE.  I WAS NOT INJURED, HOWEVER, I AM FRIGHTENED TO THINK WHAT MAY HAVE HAPPENED IF I WAS DRIVING 65 ON A BUSY HIGHWAY!  *NM",
        "vin": "YS3DP35G7Y7"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/06/2005",
        "dateOfIncident": "01/23/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124371,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED ENGINE FAILURE DUE TO SLUDGE IN ENGINE.  TOLD BY WARRANTY COMPANY WARRANTY VOIDED DUE TO SLUDGE IN ENGINE.  MONTHS LATER SAAB SEND OUT NOTICE STATING ENGINE FAILURE DUE TO SLUDGE, EXTENDS WARRANTY AND STILL DENIES CLAIM.",
        "vin": "YS3DD38H0Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2005",
        "dateOfIncident": "12/08/2002",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117991,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING OUR 2000 SAAB 9-3 AT APPROXIMATELY 55 MPH ON THE H-3 ENROUTE TO KANEOHE, HI.  ON THE DOWN HILL SIDE, THE ENGINE SHUT OFF WITH NO WARNING.  NOTHING ON THE SID OR OTHER INSTRUMENTATION.  THE CAR HAD PLENTY OF FUEL.  SHE ATTEMPTED TO RESTART SEVERAL TIMES.  SINCE SHE WAS COMING DOWN THE MOUNTAIN, SHE WAS ABLE TO SAFELY COAST TO THE SHOULDER OF THE ROAD.  THE CAR WAS TOWED TO THE LOCAL SAAB DEALER.  THE NEXT DAY THEY ASCERTAINED THE PROBLEM TO BE FAILURE OF THE DIRECT IGNITION CASSETTE.  COST FOR REPLACEMENT WAS $647.79.  SHORTLY THEREAFTER, THE CATALYTIC CONVERTER FAILED DUE TO RAW FUEL BEING DUMPED THROUGH THE EXHAUST AFTER THE DI CARTRIDGE FAILED.   THE CONVERTER WAS EVENTUALLY REPLACED FREE OF CHARGE UNDER THE EMISSION WARRANTY AFTER AN EXTENSIVE CORRESPONDENCE AND TELEPHONE EXCHANGE WITH SAAB USA.  THE CAR HAD 69,779 MILES ON IT WHEN THIS EVENT OCCURRED.   I STILL DRIVE THE CAR (105,000 MILES), BUT CARRY A SPARE DI CASSETTE JUST IN CASE IT SHOULD FAIL AGAIN.*AK",
        "vin": "YS3DD55H4Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2005",
        "dateOfIncident": "03/23/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116370,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING DOWN THE GSP DURING THE EVENING RUSH HOUR (5PM OR SO) IN THE LEFT LANE ON THE EXPRESS SIDE. PICKUP TRUCK APPROXIMATELY 4 FT OFF MY REAR BUMPER(NJ YOU KNOW). HEAVY RAIN.  MY 2000 SAAB 9-3 VIGGEN JUST SHUT OFF.NO WARNING. NO POWER TO GET TO APPROPRIATE SHOULDER SO I HAD TO DRIVE THE CAR OFF THE LEFT HAND SIDE OF THE ROAD INTO THE MUD.  AFTER BEING TOWED TO DEALER I GOT THE CAR BACK THE NEXT DAY. DI CASSETTE FAILURE WAS THE DIAGNOSIS.COME TO FIND OUT, THIS IS A KNOWN PROBLEM WITH THE SAAB DI CASSETTES.  ONE DAY LATER, CAR BACK IN SHOP FOR 4 DAYS. DEALER NEEDED TO REPLACE CATALYTIC CONVERTOR DUE TO NO ENGINE POWER. CATALYTIC CONVERTOR FAILURE A DIRECT RESULT OF DI FAILURE.  I AM REPORTING THIS BECAUSE HAD THIS HAPPENED WHILE I WAS GETTING ON THE HIGHWAY IT COULD HAVE BEEN A BIG PROBLEM. IT HAPPENS TO SOME LITTLE OLD LADY, IT'S DEFINITELY A PROBLEM AT SPEED.  WITH THE ADVANCED ON BOARD DIAGNOSTICS AND INFORMATION DISPLAYS, THERE IS NO WAY THIS  SHOULD HAPPEN.*AK",
        "vin": "YS3DP55G6Y7"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2005",
        "dateOfIncident": "04/18/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105667,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS CASUALLY DRIVING WITH MY DAUGHTER AND THE CAR SUDDENLY SHUTOFF IN THE MIDDLE OF TRAFFIC.  I TRIED TO RESTART THE VEHICLE; HOWEVER, IT DID NOT RESTART.  FORTUNATELY, I HAD ENOUGH MOMENTUM TO CARRY ME TOWARDS THE CURB.  BUT I HAD TO CUT ACROSS A LANE TO MAKE IT TO THE CURB.  WHEN I SPOKE WITH THE DEALER THE NEXT DAY, THEY KNEW IMMEDIATELY WHAT THE PROBLEM WAS - FAILED IGNITION CASSETTE.  THE DEALER SAID THIS IS A CONSTANT PROBLEM WITH SAABS AND THERE IS NO WARNING BEFORE FAILURE.  I FIND THIS ODD CONSIDERING THE CAR HAS A SERVICE INFORMATION DISPLAY.  FORTUNATELY THE CAR WAS STILL UNDER WARRANTY SO IT WAS REPAIRED AND RETURNED BY THE DEALER IN 2 DAYS.  BUT AT 42,000 MILES, I FIND IT SCARY AS I HAVE NO IDEA WHEN THE NEXT TIME IT WILL FAIL - IN ANOTHER 40,000?  HAD THIS BEEN A TIME WHEN I WAS ON THE EXPRESSWAY, WHICH I FREQUENTLY TRAVEL, THIS SUDDEN SHUT-DOWN COULD HAVE CAUSED FATAL CONSEQUENCES FOR MYSELF, MY FAMILY, AND/OR SURROUNDING MOTORISTS.  *AK",
        "vin": "YS3DP55G7Y7"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2004",
        "dateOfIncident": "08/31/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096715,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 45 MPH, THE VEHICLE STALLED. THE CONSUMER HAD THE VEHICLE TOWED. *JB",
        "vin": "YS3DD58H7Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/15/2004",
        "dateOfIncident": "06/20/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10091066,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON AND HIS GIRLFRIEND WERE IN A SERIOUS ROLL OVER CAR ACCIDENT IN HER 2000 SAAB HATCHBACK.  THE CAR WAS TOTALED.  NONE OF THE AIRBAGS DEPLOYED, NEITHER FRONT NOR SIDE, EVEN THOUGH THERE WAS SUBSTANTIAL IMPACT AND DAMAGE ON FRONT AND SIDES.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2004",
        "dateOfIncident": "08/24/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089579,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER SMELLED FUEL WHILE DRIVING.  STOPPED THE VEHICLE, EXAMINED FUEL RAIL, AND NOTICED ONE OF THE CLIPS BROKE.  AS RESULT, VEHICLE WAS LEAKING GAS. DEALER AND MANUFACTURER WERE NOTIFIED. *AK",
        "vin": "YS3DD58H7Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2004",
        "dateOfIncident": "08/05/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086627,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DI CASSETTE FAILURE  I WAS DRIVING IN THE I80 DURING RUSH HOUR (5:30 PM NEAR SAN FRANCISCO-RICHMOND) AT ABOUT 50 MILES PER HOUR WHEN THE ENGINE DIED ON ME.  I HAD TO CUT ACROSS 3 LANES OF TRAFFIC WITH A DEAD ENGINE TO GET TO THE SIDE.  I AM SURPRISED THAT I COULD EVEN DO THIS GIVEN THE VOLUME OF TRAFFIC.  IT COULD HAVE BEEN VERY NASTY SINCE I WAS JUST COMING AROUND A CORNER WHEN IT OCCURRED.  I HAD TO HAVE THE CAR TOWED TO A SAAB DEALER.  APPARENTLY THE DI CASSETTE HAS FAILED AND IT NEEDS TO BE REPLACED PLUS SPARK PLUGS ($725) AND POSSIBLY THE CATALYTIC CONVERTER ($1,100).  ACCORDING TO THE DEALER THERE IS ABSOLUTELY NO WARNINGS GIVEN ON THIS NOR WOULD IT BE DETECTABLE IN A NORMAL SERVICE.  DOING SOME RESEARCH IT APPEARS THAT THIS IS A COMMON FAILURE WITH SAAB'S AROUND THE WORLD.  VERY INTERESTINGLY MOST COMMENTS DESCRIBE CIRCUMSTANCES SIMILAR TO MINE WHERE THE ENGINE DIES WHILE TRAVELING ON A HIGHWAY AT HIGHWAY SPEEDS.  THIS HAS TO BE VERY DANGEROUS FOR THE OCCUPANTS AND OTHER USERS OF THE HIGHWAYS.  THIS IS A MAJOR SAFETY ISSUE THAT SHOULD BE CORRECTED IMMEDIATELY.  OPTIONS WOULD BE A FULL RECALL OR A PROPER WARNING SYSTEM THAT ALLOWS THE PART TO BE REPLACED BEFORE CATASTROPHE.  *JB",
        "vin": "YS3DD55H5Y2"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "02/23/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061172,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER BRIEFLY FORGOT THAT THE CAR HAD A MANUAL TRANSMISSION, THE CONSUMER TURNED THE KEY ON AND THE VEHICLE WENT BACKWARDS THROUGH THE GARAGE DOOR.  THE EMERGENCY BRAKE WAS ON, BUT DIDN'T HOLD THE VEHICLE.   *LA  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "09/15/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069245,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE RIM'S DENTED IN NORMAL USE & TIRES BLEW.  TIRES & RIMS EACH $250 FOR TOTAL OF $2000 TURBO FAILED; INSTALLED NEW TURBO AT COST OF $1200.",
        "vin": "YS3DD58H5Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/14/2004",
        "dateOfIncident": "12/15/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053174,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "USA PRODUCTS",
                "productMake": "USA",
                "productModel": "USA",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I AM THE CURRENT OWNER OF A SAAB 9-3SE. THIS VEHICLE WAS LEASED NEW 2-28-2000 AND THEN PURCHASED 2-27-03. THE ORIGINAL ENGINE WAS REBUILT AT 46,000 MILES IN 2001 AND NOW HAD TO BE REPLACED AGAIN 12-15-2003 AT 100,000 MILES.*AK",
        "vin": "YS3DF58K5Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": "10/04/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047492,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILED DIRECT IGNITION CASSETTE LEAVES MOTORIST STRANDED.  THERE HAVE BEEN COMPLAINTS THAT THE ENGINE WILL STOP WITH NO WARNING - EVEN AT HIGH SPEEDS OF TRAVEL.   *LA",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/14/2003",
        "dateOfIncident": "08/05/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033880,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND WITHOUT WARNING HEADLIGHTS DIM, INHIBITING THE DRIVER'S VISIBILITY. CAUSE OF PROBLEM HAS YET TO BE DETERMINED. *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/22/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 883802,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CHILD PUT KEY IN IGNITION WITHOUT DEPRESSING  CLUTCH, VEHICLE STARTED UP, ROLLING BACKWARD .*AK *JB",
        "vin": "YS3DF55K1Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/29/2000",
        "dateOfIncident": "08/25/2000",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 729460,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-3",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH IS LOCATED IN THE CENTER CONSOLE OF THE VEHICLE. A CHILD, KNEELING IN THE PASENGER SEAT (NO ONE ELSE WAS INVEHICLE) TURNED THE IGNITION SWITCH ON, THE CAR STARTED IN REVERSE AND JERK BACKWORDS TROWING THE CHILD FROM THE VEHICLE, HITTING HIM WITH THE PASSENGER DOOR, HITTING THE GARAGE IN WHICH IT WAS HOUSED, AND PROCEEDED DOWN THE DRIVEWAY AND INTO ACROSS THE YARD HITTING A TREE AND ENDING UP IN THE BRUSH. THE IGNITION SWITCH IS LOCATED IN THE CENTER CONSOLE, WHICH IS ACCESSIBLE FROM ALL FRONT AND REAR SEATS. WE HAVE BEEN INFORMED BY THE DEALER THE CAR HAS NO SAFETY DEVICE PREVENTING THE CAR FROM STARTING IN GEAR. THERE IS EVIDENTLY NO SAFTEY SWITCH REQUIREING THE CLUTCH TO BE DEPRESSED OR ANY OTHER MEANS OF STOPPING THE CAR FROM STARTING IN GEAR AND TAKING OFF CAUSING UNTHINKABLE DAMAGE TO PEOPLE AND PROPERTY. I THOUGHT THERE HAD TO BE A SAFETY SWITCH ON THE CLUTCH FOR CARS BUILT IN THE LAST SEVERAL YEARS. PLEASE ADVISE ME IF THERE IS ANY SUCH REQUIREMENT IN EFFECT. ALSO, IF NO REQUIREMENT IS IN EFFECT, PLEASE ADVISE ME AS TO HOW I CAN HELP TO GET ONE LEGISLATED. THIS IS A VERY DANGEROUS SITUATION WHERE ANY CHILD IN THE BACK SEAT CAN REACH OVER TO THE CENTER CONSOLE AND START A SAAB IN REVERSE. THANKS YOU YOUR ASSISTANCE.",
        "vin": "YS3DD55HXY2"
    }
]