[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/24/2019",
        "dateOfIncident": "12/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11291134,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON HAD A WRECK, HE HYDROPLANED AND HIS AIR BAG DID NOT DEPLOY. HE GOT A CONCUSSION.",
        "vin": "JT3HT05J7Y0"
    },
    {
        "components": "SUSPENSION,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2017",
        "dateOfIncident": "07/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010368,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S CHASSIS DETERIORATED AND IT IS NOW UNSAFE TO DRIVE THE VEHICLE ESPECIALLY WITH SOME LOAD.  DESPITE DUE CARE IN KEEPING THE CHASSIS FREE OF ICE AND SALT DURING WINTER TIME, THE CHASSIS IS SHOWING A LOT OF RUST AND APPEARS WEAK TO BE DRIVEN AT IT'S NORMAL ROUTINE.  I BELIEVE A VEHICLE'S CHASSIS COULD LAST FOR MORE THAN 20 YEARS IN THE ABSENCE OF ANY ACCIDENT OR COLLISION WHICH WE NEVER HAD WITH THE VEHICLE.",
        "vin": "JT3HT05J0Y0"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/10/2017",
        "dateOfIncident": "10/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971569,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 TOYOTA LAND CRUISER. WHILE DRIVING VARIOUS SPEEDS, THE TRACTION CONTROL WARNING INDICATOR ILLUMINATED, WHICH CAUSED THE BRAKES TO ENGAGE AND THE VEHICLE'S SPEED TO SUDDENLY DECREASE. WHEN THE FAILURE OCCURRED, THE VEHICLE DECREASED 10-15 MPH IN SPEED. THE FAILURE OCCURRED ON APPROXIMATELY FIVE OCCASIONS. THE VEHICLE WAS TAKEN TO A DEALER FOR REPAIRS, BUT THE FAILURE PERSISTED. ON THE MOST RECENT OCCASION, THE REAR PASSENGER SIDE WHEEL SEIZED DUE TO THE FAILURE. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE SEAL BEARING, A SNAP RING, THE REAR PASSENGER SIDE AXLE BEARING RETAINER, THE BRAKE DRUM GASKET, THE SKID CONTROL ROTOR, AND THE REAR PARKING BRAKE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 141,000.",
        "vin": "JT3HT05J4Y0"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,TRACTION CONTROL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2016",
        "dateOfIncident": "07/27/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898958,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 TOYOTA LAND CRUISER. THE CONTACT STATED THAT THE ENGINE AND SERVICE TRACTION WARNING INDICATORSILLUMINATED. THEVEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE NEUTRAL SAFETY SWITCH, MANUAL SHAFT VALVE, SEALED TYPE T OIL,HEXAGON NUT,DEX 3 TRANSMISSION FLUID, WASHER/SPRING WERE REPLACED. THE REMEDY FAILED TO REPAIR THE VEHICLEAND THE FAILURE RECURRED. THE ENGINE STALLED ON THE HIGHWAY WHILE DRIVING AT AN UNKNOWN SPEED. THE VEHICLE WASABLE TO BE RESTARTED AFTER NUMEROUS ATTEMPTS, BUT THEENGINE STALLED AGAIN. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THETHROTTLE BODY ASSEMBLY NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 243,000.",
        "vin": "JT3HT05J1Y0"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/10/2016",
        "dateOfIncident": "02/08/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825491,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS STATIONARY BUT IS DANGEROUS TO DRIVE  EXCESSIVE RUST ON FRAME , HOLES IN FRAME AND RUSTED TO WHERE FRAME IS HOLLOW.  TRANSMISSION CROSS MEMBER RUSTED BADLY AND READY TO BREAK OFF .   SWAY BAR RUSTED BADLY AND MOUNT RUSTED OFF THE CAR.  FRONT CALIPERS , ROTORS RUSTED BADLY.  NEEDS NEW FRAME. BODY RUSTED.  ALL INFORMATION WAS WRITTEN UP ON 02/08/16 BY SHORE TOYOTA SERVICE DEPT. MAYS LANDING , NJ  REPORT ORDER NUMBER 0404496 .",
        "vin": "JT3HT05J6Y0"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744088,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE AND TOTAL BRAKING FAILURE. ZERO BRAKE PRESSURE, COMPLETE LOSS OF STOPPING FORCE. ABS FAILED, ALL WARNING LIGHTS ILLUMINATED. THIS CAUSED THE VEHICLE TO PROCEED UNCONTROLLED DOWN THE ROAD FOR A COUPLE OF KILOMETERS DUE TO DRIVING DOWN HILL TILL IT WAS SLOWED ENOUGH BY RESISTANCE TO PULL OFF THE ROAD AND CALL A TOW TRUCK. AGAIN, IT WAS A COMPLETE AND TOTAL BRAKE FAILURE, DIAGNOSED BY TOYOTA AS A FAILED ABS PUMPING AND ACCUMULATOR SYSTEM.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10706435,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECENTLY PURCHASED (NOV 2014) A 1 OWNER LAND CRUISER. THIS WEEK I HAD A BRAKE LINE REPLACED AND IT WAS BROUGHT TO MY ATTENTION OF THE EXCESSIVE AMOUNT OF CORROSION TO THE FRAME.  WE WERE ALL A BIT SURPRISED BECAUSE THE VEHICLE WAS KEPT IN GREAT CONDITION OTHERWISE AND I DID AN EXTENSIVE VIN CHECK TO MAKE SURE IT WAS WELL MAINTAINED AND SERVICED , WHICH IT WAS AT THE SAME DEALERSHIP IT WAS PURCHASED AT IN CENTRAL NY.  THE FRAME WAS COATED WITH A UNDERBODY COATING- APPARENTLY AFTER THE FACT OF ORIGINAL PURCHASE, WHICH LEFT ME IN THE DARK ABOUT THE SITUATION UNDERNEATH. I KNOW THERE IS NUMEROUS ISSUES WITH FRAMES FROM TOYOTA IN THIS TIME FRAME AND MY VEHICLE SEEMS TO BE FALLING UNDER THIS EXCESSIVE FRAME ROT ISSUE.  *TR",
        "vin": "JT3HT05J1Y0"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/16/2010",
        "dateOfIncident": "12/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10370883,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED 2000 TOYOTA LAND CRUISER.    THE FRONT HOOD CAME DOWN HARD WHILE I WAS CHECKING THE LEVEL OF THE ENGINE OIL.    THE LIFT CYLINDERS ( 10 YEARS OLD / 2000 MODEL..) ARE NOT BE ABLE TO HOLD THE WEIGHT OF THE HOOD. AND THE HOOD CAME DOWN HARD ON MY HEAD WHILE I WAS CHECKING THE ENGINE OIL LEVEL...    THE LIFT CYLINDERS OF THE ENGINE HOOD SHOULD BE RECALLED FOR THE SAFETY REASON.... *TR",
        "vin": "JT3HT05JXY0"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2010",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369269,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 TOYOTA LAND CRUISER  PROBLEMS: ABS LIGHTS ON, VSS TRAC AND VSC OFF LIGHTS ON.  WENT THROUGH TO TOYOTA DEALERSHIP FOR DIAGNOSTIC AND DISCOVERED CODES FOR THE FOLLOWING: C1223 - ABS CONTROL SYSTEM MALFUNCTION AND C1246 - MASTER CYLINDER PRESSURE SENSOR.  TOYOTA DEALER RECOMMEND TO REPLACE \"SKID CONTROL ECU\"  FOUND THROUGH INTERNET THAT IS COMMON PROBLEM FOR TOYOTA TRUCKS PARTICULARLY SEQUOIAS. *TR",
        "vin": "JT3HT05J4Y0"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2010",
        "dateOfIncident": "06/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341562,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: CRACKED EXHAUST MANIFOLD ON 2000 TOYOTA LAND CRUISER  MY VEHICLE DEVELOPED A CRACK IN THE EXHAUST MANIFOLD. IT ONLY HAS 43,000 MILES.    I BELIEVE THIS MAY BE MORE WIDESPREAD. A FRIEND HAD A 2000 TUNDRA WITH THE SAME 4.7 LITER ENGINE, AND HIS HAS DEVELOPED THE SAME CONDITION. A INTERNET SEARCH HAS REVEALED OTHER REFERENCES TO THIS ISSUE. I WANTED TO LOG MY COMPLAINT SO IT COULD BE COUNTED. COULD NHTSA ASK TOYOTA FOR A INCIDENT REPORT ON THE FAILURE RATE OF THE 4.7 LITER ENGINE? THANK YOU *TR",
        "vin": "JT3HT05J4Y0"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328477,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 TOYOTA LAND CRUISER. WHEN THE VEHICLE  WAS TAKEN TO THE DEALER FOR ROUTINE MAINTENANCE THE CONTACT NOTICED THE SPARE TIRE BRACKET HAD CORRODED. THE DEALER REPLACING THE BRACKET BUT INSTEAD SHE HAD IT TIGHTENED. ON A LATER DATE, THE CONTACT NOTICED THE SPARE TIRE WAS NO LONGER UNDER THE VEHICLE. THE BRACKET HAD COMPLETELY CORRODED AND DISLODGED FROM THE VEHICLE. THE VEHICLE HAD NOT YET BEEN TAKEN BACK TO THE DEALER. THE FAILURE MILEAGE WAS 15,000 AND THE CURRENT MILEAGE WAS 117,000.",
        "vin": "JT3HT05J7Y0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318749,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).     PERHAPS THIS COULD SHED SOME LIGHT ON YOUR DISCUSSIONS REGARDING THE PROBLEM WITH THE FAILURE SO MANY PEOPLE ARE HAVING WITH THEIR VARIOUS TOYOTAS.    ACCELERATION ISSUES EMERGED WITH MY 2000 MODEL TOYOTA-- [XXX] IN 2000, I BOUGHT A NEW TOYOTA LAND CRUISER.AT AROUND 45,000 MILES (STILL UNDER MANUFACTURER?S WARRANTY) OR AROUND THE END OF THE YEAR 2003, I BEGAN TO EXPERIENCE ISSUES WITH MY LAND CRUISER NOT ACCELERATING?EVEN THOUGH THE ENGINE WAS STILL RUNNING, AND I WAS STILL DRIVING.  AFTER TURNING THE ENGINE OFF AND WAITING FOR ABOUT 20 MINUTES, I TURNED MY ENGINE BACK ON AND MY CRUISER WAS WORKING AGAIN.  I BEGAN TO EXPERIENCE THIS PROBLEM CONSISTENTLY, BUT SPORADICALLY OVER THE NEXT 4 YEARS.   I NEVER KNEW WHEN MY CAR WOULD STOP ACCELERATING WHILE I WAS DRIVING.  NO MATTER HOW HARD I PRESSED ON THE ACCELERATOR, THE CAR WOULD NOT ADVANCE FORWARD, EVEN THOUGH THE ENGINE CONTINUED TO RUN.     I IMMEDIATELY TOOK MY CRUISER TO THE CLOSEST TOYOTA DEALERSHIP.   I DESCRIBED MY PROBLEM TO THE SERVICE ADVISOR, MR. BRIAN MURPHY, AND MY VEHICLE WAS ASSIGNED TO THE MASTER MECHANIC ROHAN TO EVALUATE.  ROHAN KEPT MY VEHICLE FOR ABOUT TWO WEEKS BEFORE BEING ABLE TO DUPLICATE THE PROBLEM AND AGREED IT WAS A VERY DANGEROUS PROBLEM.    ROHAN EXPLAINED TO ME THAT WHEN I PRESS MY FOOT ON THE GAS PEDAL,  A SENSOR CONTROLS THE ACCELERATION FUNCTION, AND THAT MY SENSOR WAS BAD, AND HE HAD TO REPLACE IT.   THE SENSOR ISSUE WAS NEVER RESOLVED, AND OVER THE COURSE OF THE NEXT SEVERAL YEARS, I CONTINUED TO HAVE THIS PROBLEM WITH THE CAR LOSING ACCELERATION? DURING DRIVING. ROHAN CONTINUED TO TRY TO ADDRESS THE ISSUE? BUT NOTHING HE DID EVER RESOLVED THE PROBLEM.  IN MAY 2007, MY SON [XXX]  DROVE THE LAND CRUISER A SHORT DISTANCE TO SCHOOL .  THE LAND CRUISER LOST ACCELERATION WHILE [XXX] WAS DRIVING AND HE COULDN'T CONTROL THE CAR AND HIT AN OAK TREE AND TOTALED THE VEHICLE. HAD  HE BEEN ABLE TO ACCELERATE, HE COULD HAVE CONTROLLED THE CAR. *TR",
        "vin": "JT3HT05J7Y0"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "02/18/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312767,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 TOYOTA LANDCRUISER HAS EXPERIENCE EXCESSIVE UNDERCARRIAGE RUST SIMILAR TO THE TUNDRA MODELS REPORTED.  RECENTLY THE BRAKES ON MY VEHICLE FAILED DUE TO BRAKE LINES RUSTING THROUGH.  WHEN WE TRIED TO APPLY THE EMERGENCY BRAKE, IT DID NOT STOP THE VEHICLE SINCE IT HAD RUSTED THROUGH AS WELL AND WAS INOPERABLE.  FORTUNATELY WE WERE NOT DRIVING FAST AS WE WOULD HAVE NO WAY TO STOP THE VEHICLE FROM CRASHING. *TR",
        "vin": "JT3HT05J4Y0"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "05/30/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294025,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS BACKED OUT OD PARKING SPOT & WHEN SHIFTED TO FORWARD & GAS APPLIED   VEHICLE ACCELERATION WAS NOT CONTROLLABLE, CAUSING A CRASH WITH ANOTHER VEHICLE IN THE PARKING LOT.    THIS WAS THE ONLY TIME THIS HAS OCCURRED. *TR",
        "vin": "JT3HT05J3Y0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2007",
        "dateOfIncident": "10/15/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188936,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TOTAL LOSS OF LIGHTING IN DASH SO THAT DRIVER CANNOT SEE SPEEDOMETER OR ANY OTHER INSTRUMENTATION IN DASH AT NIGHT. *TR",
        "vin": "JT3HT05J2Y0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/28/2006",
        "dateOfIncident": "08/21/2006",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166743,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TRAVELING 40 MPH, THERE WAS BLACK SMOKE COMING FROM THE DRIVER SIDE DOOR PANEL.  THE SMOKE GOT DARKER AND THE CONTACT PULLED OVER.  AN ORANGE GLOW WAS NOTICED BETWEEN THE CONTROLS AND A BOTTLE OF WATER WAS POURED IN THE DOOR TO EXTINGUISH THE FIRE.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHO DETERMINED THERE WAS A SHORT IN THE WIRING SYSTEM THAT CAUSED THE FIRE.  THE WIRES WERE REPAIRED.     THE MASTER CONTROL SWITCH WAS REPLACED. UPDATED 09/20/06. *JB",
        "vin": "JT3HT05J7Y0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2005",
        "dateOfIncident": "09/27/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145272,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED WHILE DRIVING, THE VEHICLE STOPPED.  THE ENGINE WAS STILL RUNNING BUT THE VEHICLE WOULD NOT GO ANYWHERE.  THE VEHICLE WAS TOWED TO THE DEALERSHIP, AND THEY FOUND THERE WAS THROTTLE BODY FAILURE.  THE THROTTLE BODY WAS REPLACED, AND THERE HAVE BEEN NO FURTHER PROBLEMS.*AK   UPDATED 01/11/06. *JB",
        "vin": "JT3HT05J3Y0"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100796,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GUAGE HAS NOT BEEN WORKING CORRECTLY FOR LAST MONTH. I AM NOT SURE THAT THE GUAGE ITSELF OR FUEL SENDING UNIT IS CAUSING THIS VERY RARE PROBLEM.   THINK THERE IS THE SHORT-CIRCUIT SOMEWHERE. AND I FEEL IT IS NOT SAFE TO DRIVE THIS CAR. WHAT IF THIS SHORT-CIRCUIT CAUSES SPARKS IN OR NEAR THE FUEL TANK.  WOULD LIKE TO REPORT THIS RARE PROBLEM BEFORE I TAKE MY CAR TO DELARSHIP-SERVICE.*AK",
        "vin": "JT3HT05JXY0"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "11/15/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SLUDGE IN ENGINE",
        "vin": "JT3MN87R7Y9"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/01/2003",
        "dateOfIncident": "08/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI-SKID BRAKE FAILURE FOLLOWED BY FAILURE OF FRONT BUMPER.  MINIMAL DAMAGE TO REAR BUMPER OF VEHICLE IN FRONT.*AK",
        "vin": "JT3HT05J5Y0"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/21/2002",
        "dateOfIncident": "10/19/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768677,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE BLOWOUT WITH FULL TREAD  SEPARATION.  DT",
        "vin": "JT3HT05JXY0"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/23/2002",
        "dateOfIncident": "06/29/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 8017075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HAD PULLED PARTIALLY INTO GARAGE AND SHUT OFF VEHICLE. CONSUMER THEN REMOVED SOME ITEMS FROM VEHICLE, RESTARTED VEHICLE TO PULL COMPLETELY INTO GARAGE. CONSUMER HAD SHIFTED TO PARK, AND DROPPED AN ITEM ON GARAGE FLOOR.  WENT TO PICK UP ITEM, AND TRANSMISSION HAD SHIFTED INTO REVERSE ON ITS OWN, RUNNING INTO THE DRIVER. DRIVER WAS KILLED.  VEHICLE WAS TESTED BY ENGINEERS FOR THE FAILURE OF THE TRANSMISSION BY THE POLICE DEPARTMENT. THIS INFORMATION PROVIDED BY DETECTIVE  ROB CHRISTOPHER ( 281 275 2554 ).  *AK",
        "vin": "JT3HT05J6Y0"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567081,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REQUESTING DOCUMENTS PERTAINING TO MIS SHIFT AND PARK TO REVERSE SAFETY DEFECTS IN THESE VEHICLES.  VEHICLES SHIFTING INTO PARK POSITION BUT VEHICLE STILL MOVES FORWARD OR REVERSE UNEXPECTEDLY OR WITHOUT WARNING.  *JG",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/20/2002",
        "dateOfIncident": "05/19/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 762077,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 65 MPH ON FREEWAY.  WE WERE CLIPPED BY ANOTHER CAR ON OUR RIGHT FRONT BUMPER. OUR SUV SLID TO THE LEFT CROSSING 3 FREEWAY LANES AND WE HIT HEAD ON INTO THE CONCRETE FREEWAY DIVIDER.  OUR SUV SLIDE DOWN THE FREEWAY ALONG THE DIVIDER AND MADE ONE COMPLETE ROLL, LANDING AGAIN ON OUT TIRES.  THE FRONT DAMAGE TO THE CAR IS MASSIVE.  NO AIRBAGS DEPLOYED.  IN ADDITION THE FRONT PASSENGER SEAT BELT DID NOT LOCK. IT STAYED LOOSE DURING THE ACCIDENT.  I HAVE EMAIL PICTURES OF  THE DAMAGED SUV AND ALSO OF THE CONSOLE SHOWING NO AIRBAGS WERE DEPLOYED.",
        "vin": "JT3HT05J0Y0"
    }
]