[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/14/2013",
        "dateOfIncident": "05/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503072,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR DOWN THE HIGHWAY AT NIGHT THE DRIVERS HEADLIGHT WENT OUT.  AFTER PULLING OVER AND TURNING OFF CAR AND PLACING EMERGENCY BLINKERS ON GOT OUT AND LOOKED AT HEADLIGHTS DRIVERS SIDE WAS OUT.  TURNED OFF HEADLIGHTS AND TURNED THEM BACK ON.  THEY CAME BACK ON I DROVE HOME SAFELY. TWO DAYS LATER IT HAPPENED AGAIN WENT TO DEALERSHIP AND HAD BULBS REPLACED. THREE MONTHS HAD BULBS CHANGED AGAIN.  THIS HAS BEEN DON MULTIPLE TIMES.  TWO WEEKS AGO UPON RETURNING HOME AT NIGHT BOTH HEADLIGHT WENT OUT TOGETHER LEAVIN ME ON SIDE OF ROAD.  PARKED CAR AND HAD WIFE PICK ME UP. RETRIEVED CAR THE NEXT DAY. FACTORY SAYS SORRY ABOUT THIS NOT OUR PROBLEM.  *TR",
        "vin": "JTDKB20UX57"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2010",
        "dateOfIncident": "10/17/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361672,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS - STEERING WHEEL SUDDENLY VIBRATES AND PULLS HARD TO THE SIDE.  PROBLEM IS INTERMITTENT BUT HAS INCREASED IN FREQUENCY.  DEALER SAID IT WAS BRAKE DRUM AND PERFORMED $800 REPAIR BUT ONLINE SEARCH SUGGESTS IT IS ACTUALLY COMMON STEERING PROBLEM THAT CONTINUES EVEN AFTER PRIOR REPAIR. *TR",
        "vin": "JT2BK12U110"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/17/2009",
        "dateOfIncident": "11/17/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292604,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 TOYOTA PRIUS. THE PASSENGER AND DRIVER SIDE HEADLIGHT SHUTS ON AND OFF 2 TO 3 MINUTES AFTER STARTING THE VEHICLE. THE CONTACT HAS TO TURN THE HEADLIGHT SWITCH ON AND OFF TO RESET THE PASSENGER SIDE HEADLIGHT. THE CONTACT HAS SCHEDULED AN APPOINTMENT WITH THE DEALER TO DIAGNOSE THE FAILURE. THE CONTACT STATED THAT THE LACK OF HEADLIGHTS AT NIGHT COULD POTENTIALLY CAUSE A CRASH TO OCCUR. THE CURRENT MILEAGE WAS 45,000. THE FAILURE MILEAGE WAS 39,000.",
        "vin": "JTDKB20U577"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/12/2009",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291989,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS IN MY 2006 PRIUS INTERMITTENTLY GO OFF, AND TURN ON AGAIN WHEN THE HEADLIGHT SWITCHED IS TURNED OFF AND THEN ON AGAIN.  IT HAPPENS VERY FREQUENTLY WHEN DRIVING - THE LIGHTS DO NOT STAY ON FOR MORE THAN A COUPLE MINUTES AT A TIME.  THIS VEHICLE WAS REPAIRED FOR THE SAME ISSUE IN JANUARY 2008, WAS REPAIRED AT THE TOYOTA DEALERSHIP, AND IS NOW OCCURRING AGAIN LESS THAN TWO YEARS LATER.  *TR",
        "vin": "JTDKB20U763"
    }
]