[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/09/2005",
        "dateOfIncident": "07/09/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA VAN",
                "productModel": "COROLLA SPACIO",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LAST SUMMER  3 TIMES  DURING HOT DAYS THE BUTTONS ON THE SLIDING DOORS OF MY 2000 TOYOTA SIENNA GOT STUCK.  THE DOOR WOULD NOT CLOSE OR COULD NOT BE OPENED DEPENDING ON WHEN THE BUTTON GOT STUCK. THE BUTTON DID UNSTICK AFTER RUNNING  THE A/C FOR 20 TO 30 MINUTES. IT IS A HAZARD WITH 4 SMALL CHILDREN NOT TO BE ABLE TO OPEN OR CLOSE THE SLIDING DOORS.  AS IT IS GETTING HOT AGAIN, I FEAR THAT IT WILL HAPPEN AGAIN THIS SUMMER.",
        "vin": "4T3ZF19C5YU"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "01/21/2004",
        "dateOfIncident": "01/21/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055626,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA VAN",
                "productModel": "COROLLA SPACIO",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "COSCO, INC.",
                "productMake": "COSCO",
                "productModel": "COSCO 13-169",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "COSCO MODEL # 02452-WAL MAN ,07-02-2003, THE SEAT COVER BRACKET  ATTACHED TO THE SEAT BROKE. CONSUMER NOTIFIED THE MANUFACTURER FOR A  REPLACEMENT .  WITHIN SIX MONTHS, THE SEAT FELL APART. *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/24/2003",
        "dateOfIncident": "09/09/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039492,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA VAN",
                "productModel": "COROLLA SPACIO",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSIDE CABLE TO THE DRIVER SIDE REAR DOOR WILL NOT OPEN FROM THE INSIDE.  THE 2000 TOYOTA SIENNA VAN HAS 70,000 MILES AND I DO HAVE CHILDREN DRIVING WITH ME.   TOYOTA IS WILLING TO PAY HALF THE LABOR COST PLUS PARTS BUT THE PEOPLE I SPEAK TO LAUGH OFF THAT IT IS A SAFETY PROBLEM.  I WOULD LIKE TO KNOW IF OTHER COMPLAINTS HAVE BEEN REPORTED WITH THIS PROBLEM? IF SO HOW MANY?  OTHER WISE I AM PLEASED WITH THE CAR BUT WILL HAVE SECOND THOUGHTS ABOUT PURCHASING ANOTHER TOYOTA.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/07/2003",
        "dateOfIncident": "05/19/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025555,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA VAN",
                "productModel": "COROLLA SPACIO",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TOLD BY WINDWARD TOYOTA HAWAII THAT SLUDGE BUILDUP NECESSITATED ENGINE REPLACEMENT OF 2000 TOYOTA SIENNA VAN W/ 55,000 MILES.  TOYOTA REFUSES TO COVER REPAIR WORK UNDER POWER TRAIN WARRANTY W/O YEARLY OIL CHANGE RECEIPTS.   FROM AUTOMOTIVE NEWS - CERTIFIED MASTER TECHNICIAN REPAIR SHOP OWNER WHO SEES A DISPROPORTIONATE NUMBER OF THE ENGINES COMING THROUGH HIS REPAIR SHOP ON THE 1999-20000 SIENNAS:\u001cLARRY PERRY, AN A.S.E.-CERTIFIED MASTER TECHNICIAN,REPAIR-SHOP OWNER AND HOST OF A RADIO TALK SHOW IN ORLANDO, FLA., SAYS HE HAS DISCOVERED AN APPARENT DESIGN FLAW IN 3.0-LITER V-6S PRODUCED BETWEEN 1999 AND 2001. HE SAYS HE SEES A DISPROPORTIONATE NUMBER OF THE ENGINES COMING THROUGH HIS SHOP ON 1999 AND 2000 SIENNAS.   \u0018WE BELIEVE TOYOTA REDUCED THE SIZE OF COOLING PASSAGES TO THE CYLINDER HEADS IN THOSE ENGINES IN ORDER TO INCREASE COMBUSTION TEMPERATURES FOR MORE OF A COMPLETE BURN TO REDUCE EXHAUST EMISSIONS,\u0019 PERRY SAID.   EXCESSIVE HEAT MAKES OIL MORE SUSCEPTIBLE TO SLUDGE. PERRY SAYS HE HAS MEASURED CYLINDER-HEAD TEMPERATURES AS HIGH AS 260 DEGREES IN THOSE ENGINES - 30 DEGREES HIGHER THAN IN EARLIER MODELS.   PERRY ALSO POINTS OUT THAT THIS ENGINE SERIES USES A LIFTER BUCKET INSTEAD OF A ROCKER ARM TO OPEN AND CLOSE THE VALVES.   \u0018THE LIFTER SITS IN THE HEAD AND GETS SLUDGE AND DEBRIS COMPACTED UP UNDERNEATH IT. SO WHEN IT GETS COMPACTED BY THE CAMSHAFT, IT'S SQUEEZING OIL INTO THE COMBUSTION CHAMBERS,\u0019 HE SAID.   IN THIS CASE, HE SAID, THE SOLUTION IS TO USE ONLY 100 PERCENT SYNTHETIC MOTOR OIL.\u001d   FROM A CONSUMER AFFAIRS WEBSITE:  \u001cACTION ALERTS  TOYOTA OIL SLUDGE  FACED WITH A CONSUMER REVOLT OVER LOW MILEAGE ENGINE FAILURES  CAUSED BY OIL SLUDGE BUILDUP, TOYOTA HAS BEGUN  TO NOTIFY 3.3 MILLION OWNERS OF 1997-2002 TOYOTA AND LEXUS VEHICLES  WITH 3.0-LITER IMZ V-6 ENGINES AND ALL 1997-2001 TOYOTA VEHICLES WITH  5SFE 2.2-LITER 4-CYLINDER ENGINES THAT IT WILL COVER THE COST OF SLUDGE-RELATED REPAIRS FOR EIGHT YEARS FROM DATE OF INITIAL SALE.\u001d*AK",
        "vin": "4T3GF19CXYU"
    }
]