[
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "06/13/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606602,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR LOSES POWER, SHUTS OFF, AND/OR WON'T ACCELERATE WHEN YOU STEP ON THE GAS WITHOUT WARNING. VOLVO HAS DETERMINED THE ETM'S IN THESE MODELS TO BE DEFECTIVE BUT CONTINUE TO BE ALLOWED TO NOT TAKE RESPONSIBILITY FOR THEIR WORKMANSHIP. THEY HAVE NOT HAD TO TAKE FINANCIAL  RESPONSIBILITY FOR THEIR ACCIDENTS, INCIDENTS CAUSED BY THEIR DEFECTIVE PARTS. THE CONSUMER WHO HAS BOUGHT THE CARS, TRUSTING THE VOLVO NAMES IS BEING MADE TO PAY FOR TRUSTING THEM. THE PUT ALL OF THESE RESTRICTIONS IN PLACE TO KEEP FROM FIXING WHAT THEY. MESSED UP INITIALLY. THEY JUST WANT TO REPLACE SOFTWARE, IF YOUR CAR BREAKS IN TIME AND YOU KNOW ABOUT THE RECALL.  WE, THE CONSUMER SHOULD NOT BE ALLOWED TO BE FORCED TO TAKE MONETARY RESPONSIBILITY FOR THE PARTS, WORK, OR THE INCONVENIENCE  TO FIX THIS ISSUE. WE LIKE OUR CARS AND THAT SHOULD NOT BE USED AGAINST US. WE HAVEN'T EVEN ADDRESSED THE RESPONSIBILITY FOR DEATHS AND ACCIDENTS CONNECTED WITH THIS DEFECT, LIKE CHEVROLET.  *TR",
        "vin": "YV1NC56D6YJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/07/2012",
        "dateOfIncident": "10/09/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469507,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO C70. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE BRAKE PEDAL WAS ENGAGED AND THE VEHICLE UNEXPECTEDLY INCREASED ACCELERATION UP TO 75 MPH. THE VEHICLE FAILED TO SLOW DOWN AND CRASHED INTO THE REAR PASSENGER SIDE OF ANOTHER VEHICLE. THE VEHICLE CONTINUED TO ACCELERATE AND THEN CRASHED INTO A UTILITY POLE. THERE WERE NO INJURIES REPORTED. A POLICE REPORT WAS FILED. THE VEHICLE WAS COMPLETELY DESTROYED AND TOWED TO THE RESIDENCE. IN MARCH OF 2009 THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER 06V441000 (VEHICLE SPEED CONTROL). THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 100,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/25/2010",
        "dateOfIncident": "01/04/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351773,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "IRREGULAR ENGINE RPMS AT IDLE; CAR BEGINS TO STALL BEFORE ACCELERATION, AND CAR FAILS TO HOLD SPEED.  HAD CAR TO DEALER SEVERAL TIMES, ONLY TO HAVE THE \"155\" SOFTWARE UPDATE PERFORMED BUT NO ETM REPLACEMENT.  NOW THAT MAGICALLY THE 10 YEAR PERIOD HAS JUST EXPIRED, THE DEALER NOW CLAIMS A NEW ETM IS NEEDED AT MY EXPENSE. *TR",
        "vin": "YV1NK53D0YJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "09/28/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285765,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 VOLVO C70.  THE CAR WAS OPERATING NORMALLY DRIVING 65 MPH AND WHILE DRIVING WENT INTO WHAT IS CALLED 'LIMP MODE' CAUSING A NEAR CRASH.  THIS HAPPENED A 2ND TIME LATER THAT DAY.  THE CAR NOW SURGES AT VARIOUS SPEED AND IS UNSAFE TO DRIVE.  THE CAR IS AT A VOLVO DEALERSHIP RIGHT NOW.  THE DEALER INDICATED THAT THEY ARE AWARE OF THIS SAFTEY ISSUE (ETM FAILURE WIDESPREAD IN THESE CARS) BUT VOLVO IS BEING DIFFICULT IN AUTHORIZING REPLACEMENT OF THESE ETM UNITS DESPITE A 10/YEAR 200,000 EXTENDED WARRANTY. *TR",
        "vin": "YV1NC56D4YJ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "10/12/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245410,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2000 VOLVO C70 UP A HILL 80 MILES INTO A ROAD TRIP AND THE CAR LOST POWER AND COULD NOT ACCELERATE.  THE CHECK ENGINE LIGHT DID NOT COME ON AND I THOUGHT GAS WAS NOT GETTING TO THE ENGINE, I PULLED OFF GOT GAS, THEN PROCEEDED BACK ON THE HIGHWAY, THEN THE SAME THING HAPPENED.  I PULLED OFF THE ROAD AND THERE WAS SMOKE COMING OUT THE TAIL PIPE AND UNDER THE HOOD, ALSO THERE WAS OIL ALL OVER THE PLACE.    THERE WAS STILL NO WARNING LIGHT INDICATOR AND THE CAR WAS NOW IDLING ROUGH AND SKIPPING SO I DROVE 1 MILE TO A SERVICE STATION. I HAD THE CAR TOWED 80 MILES BACK TO MY HOME.  THE MECHANIC INFORMED MET THAT I WILL HAVE TO REPLACE THE ENGINE WHICH ONLY HAS 100,700 MILES. IT WILL COST $4500 TO REPLACE THE ENGINE WITH A USED ENGINE, $6000-$7000 IF REBUILT.  I TAKE VERY GOOD CARE OF THE CAR AND DO NOT UNDERSTAND HOW SOMETHING LIKE THIS COULD HAPPEN WITH NO WARNING.  IT COULD HAVE BEEN VERY DANGEROUS IF I WAS IN A HIGH TRAFFIC AREA. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/23/2005",
        "dateOfIncident": "11/14/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144249,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: X REF 10142625, 2 REPLACEMENTS, SMCH.  THE CONTACT'S WIFE WAS DRIVING ON THE INTERSTATE AND  VEHICLE SPEED SLOWED DOWN TO ALMOST NO SPEED . SHE WAS ABLE TO GET THE VEHICLE OFF THE RAMP. THE VEHICLE WAS TAKEN TO VOLVO DEALERSHIP IN JUNE  2005 TO BE CHECKED. HE WAS TOLD AT THAT TIME THE THROTTLE BODY NEEDED TO BE CLEANED. THE VEHICLE  RAN FINE UNTIL SEPTEMBER, 22,005.  THE VEHICLE WAS TAKEN TO A VOLVO MECHANIC, AND THE THROTTLE BODY WAS REPLACED . THE VEHICLE WAS UNDER WARRANTY AT THAT TIME .THEN, ON  NOVEMBER 12, 2005 THE CONTACT WAS PULLING OUT OF A PARKING PLACE AND THE THROTTLE BODY FAILED AGAIN. THIS, IN TURN, ALMOST CAUSED A SERIOUS ACCIDENT. ON NOVEMBER 14, 2005 HE TOOK THE CAR BACK TO THE MECHANIC, AND HE WAS TOLD THAT THE THROTTLE BODY   THAT WAS REPLACED IN SEPTEMBER  2005 WAS DEFECTIVE FROM VOLVO. THE VEHICLE IS NOW AT A REPAIR SHOP HAVING THE THROTTLE BODY REPLACED AGAIN. THE VEHICLE IS NO LONGER UNDER WARRANTY.*AK  UPDATED 12/22/2005.  *NM",
        "vin": "YV1LS61J6Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/21/2005",
        "dateOfIncident": "11/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143323,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 VOLVO C70  WHILE DRIVING AT 40-45 MPH, THE ETS LIGHT ILLUMINATED ON THE DASH AND THE VEHICLE LOST POWER.  THE ENGINE CONTINUED RUNNING, BUT WAS SIGNIFICANTLY MISSING AND PROVIDED NO POWER.  HAD TO ENGAGE EMERGENCY FLASHERS AND COAST OUT OF TRAFFIC.    AFTER TURNING CAR OFF AND RESTARTING, THE PROBLEM WENT AWAY.  THE CAR WAS FINE FOR THE REMAINDER OF THE DAY, DRIVING ~100 MILES.  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2005",
        "dateOfIncident": "10/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141131,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF ENGINE THROTTLE CONTROL MODULE (ETM) IN MY 2000 VOLVO C70 COUPE.  FAILURE RESULTED IN SUDDEN LOSS OF SPEED AND STEERING ASSIST WHEN DRIVING, AS WELL AS, SUDDEN AND COMPLETE STALL WITHOUT WARNING.  THIS HAPPENED TWICE, 10/20/05 (ETS LIGHT DID NOT REMAIN ON AFTER SWITCHING THE IGNITION OFF AND THEN ON AGAIN--SEE COMMENT BELOW) AND 10/22/05.  CAR WAS TAKEN INTO VOLVO SPECIALIST REPAIR SHOP FOR REPAIR (REPAIR COST IS APPROXIMATELY $1000).  REPAIR SHOP ADVISED THAT THIS WAS A COMMON PROBLEM WITH 1999 AND 2000 VOLVOS AS THIS WAS THE FIRST 2 YEARS THAT VOLVO HAD GONE TO AN ETM, AND IT \"JUST WASN'T RIGHT\".   I HAVE BEEN ADVISED THAT PRIOR TO THE INTRODUCTION OF THE ETM, WHEN A CABLE WAS USED FROM THE GAS PEDAL TO THE THROTTLE, THE VOLVO SERVICE MANUAL ADVISED THAT THE THROTTLE SHOULD BE CLEANED AS PART OF REGULAR SERVICING OF A VEHICLE.  HOWEVER, THE VOLVO SERVICE MANUAL DOES NOT INDICATE THAT THE ETM BE CLEANED AS PART OF SERVICING.  LUCKILY, NO ONE WAS FOLLOWING CLOSELY WHEN I HAD THE ETM FAILURES; OTHERWISE, I WOULD HAVE BEEN REAR-ENDED.  THIS WAS ESPECIALLY DISCONCERTING ON THE SECOND FAILURE AS MY 15-YEAR OLD SON WAS DRIVING WHEN THE FAILURE OCCURRED.  PLEASE NOTE THAT THE VOLVO OWNER'S MANUAL ADVISES THAT IF THE ETS LIGHT COMES ON, \"...THERE IS A FAULT IN THE ENGINE CONTROL SYSTEM AND DRIVEABILITY WILL BE AFFECTED.  SWITCH THE IGNITION OFF AND THEN ON AGAIN.  IF THE LIGHT REMAINS ON, THE SYSTEM SHOULD BE INSPECTED BY AN AUTHORIZED VOLVO RETAILER.\"  WHAT THEY DON'T TELL YOU IS THAT IT SHOULD BE TAKEN IN REGARDLESS (I.E., WHETHER OR NOT THE LIGHT REMAINS ON), AS IT IS DANGEROUS TO DRIVE IF A FAULT HAS OCCURRED IN THE ENGINE CONTROL SYSTEM. THE PROBLEMS WITH THE ETM ARE AN ACCIDENT WAITING TO HAPPENED, AND THE NHTSA SHOULD ISSUE A RECALL OF THIS PART ON ALL 1999 AND 2000 VOLVOS.  ANY RELUCTANCE OF VOLVO TO AGREE TO THIS POST HASTE WOULD BE POOR CORPORATE STEWARDSHIP ON BEHALF OF FORD MOTOR COMPANY, THE OWNER OF VOLVO CARS.  *JB",
        "vin": "YV1NK56D3YJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "09/07/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137189,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER  COMPLAINED ABOUT A THROTTLE CONTROL MODULE PROBLEM  ON  HIS 2000 VOLVO C70.   THE VEHICLE HESITATED/ STALLED AND LOST POWER WHILE DRIVING BETWEEN 50-70 MPH. THE CONSUMER TOOK THE VEHICLE TO DEALER. THEY PLACED THE  VEHICLE ON A  DIAGNOSTIC MACHINE AND DISCOVERED THAT THROTTLE CONTROL MODULE FAILED. REPAIRS WOULD COST THE CONSUMER ABOUT $1000.00.  *AK *JB",
        "vin": "YV1NK56D2YJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/02/2005",
        "dateOfIncident": "07/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135203,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ETS FAILURE",
        "vin": "YV1NK53D71J"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131599,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) ENGINE DEGRADED PERFORMANCE...FELT LIKE ENGINE WAS 'MISSING' AND RPM'S SURGED. (2) ENGINE COMPLETELY STOPPED IN HEAVY MORNING RUSH HOUR TRAFFIC.  (3) ELECTRONIC THROTTLE SENSOR FAILED AND WAS REPLACED BY STILLMAN VOLVO.   OLD PART UNAVAILABLE BY US.  PERHAPS VOLVO MAY HAVE IT.  INCIDENT DATE IS A ROUGH ESTIMATE AS I DO NOT HAVE THE RECEIPT HERE AT WORK. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/30/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131029,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 VOLVO C70 HAD A THROTTLE ISSUE.  MANY TIMES BEFORE THE ENGINE WOULD TURN OFF IMMEDIATELY WHEN FIRST STARTED.  RECENTLY, I WOULD GIVE THE ENGINE GAS AND THE ENGINE WOULD RATTLE AND FALTER.  THE ENGINE WOULD RATTLE WORSE WHEN THE AC WAS TURNED ON.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "05/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131151,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD MOTOR COMPANY",
                "productModel": "AFTERMARKET TRAILER HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY MY CHECK ENGINE LIGHT CAME ON.  SHORTLY AFTERWARDS I COULD NOT ACCELERATE,  AND HAD TO PROCEED TO THE SHOULDER.  I COULD NOT SEE ANYTHING VISUALLY WRONG WITH THE VEHICLE.  I WAITED A FEW MINUTES AND IT STARTED BACK UP AND WENT ON MY WAY.  THIS HAPPENED A NUMBER OF TIMES UNTIL I REACHED  MY DESTINATION.  WHEN I TOOK THE CAR INTO THE SHOP THEY REPLACED THE ELECTRONIC THROTTLE SENSOR.      SINCE THEN I HAVE BEEN HAVING ELECTRICAL ISSUES.  THE CAR WOULD NOT START AFTER STOPPING AT A CONVENIENT STORE, I GOT A JUMP START.  ALSO THE TRUNK LIGHT HAS BEEN COMING  ON, AND MY CAR ALARM HAS BEEN GOING OFF RANDOMLY.  *JB",
        "vin": "YV1NK56D2YJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131164,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 VOLVO C70 LP COUPE.  ELECTRONIC THROTTLE MODULE FAILURE.  AT APPROXIMATELY 54.000 MILES ON THE ODOMETER, CAR STARTED STUTTERING AND BOGGING INTERMITTENTLY.  AT 56,000 MILES, CAR WOULD ACTUALLY DIE AND REFUSE TO START.  AFTER SHUTTING CAR DOWN, THE CAR COMPUTER WOULD EVENTUALLY RESET AND ALLOW THE ENGINE TO OPERATE NORMALLY.  NOW, EVERY OTHER DAY, THE CAR'S ETS LIGHT AND CHECK ENGINE LIGHT WILL GO ON AND THE CAR WILL STALL.  *JB",
        "vin": "YV1NK56D5YJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131193,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC THROTTLE PROBLEMS - ETS LIGHT IS CURRENTLY ON, AND HAS BEEN ON IN THE PAST.*JB",
        "vin": "YV1NK56D8YJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "07/31/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130874,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STALLS WHILE AT HIGHWAY SPEEDS.  VERY DANGEROUS CONDITIONS.  STALLING OCCURS WITHOUT WARNING. *JB",
        "vin": "YV1NK53D0YJ"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/11/2005",
        "dateOfIncident": "04/08/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117675,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHT SWITCH DOES NOT FUNCTION, WHICH IS PREVENTING THE HEADLIGHTS FROM BEING TURNED AND OFF. MANUFACTURER HAS BEEN NOTIFIED BY CONSUMER.*AK",
        "vin": "YV1NK53D0YJ"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/21/2004",
        "dateOfIncident": "07/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082339,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGAN SHAKING WHEN DRIVING.  PULLED OVER TO CHECK THE TIRES AND DID NOT OBSERVE A FLAT.  WHEN I RESTARTED THE CAR AND PULLED AWAY FROM THE CURB, THE CAR WOULD NOT ACCELERATE BUT THE RADIO AND LIGHTS FROM THE DASH WERE STILL OPERATIONAL.  POWER STEERING NO LONGER WORKED AS WELL. CAR WAS TOWED TO DEALERSHIP.  THE THROTTLE WAS REPLACED BUT THE CAR CONTINUES TO SHAKE WHEN ACCELERATING BUT DOES NOT SHUT OFF.  HAVE TAKEN CAR TO ANOTHER MECHANIC BUT NO ERROR CODES HAVE BEEN DETECTED.  CAR IS STILL UNRELIABLE.   *LA",
        "vin": "YV1NK56D4YJ"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "08/01/2003",
        "dateOfIncident": "06/24/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024863,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 30MPH ON THE HIGHWAY AND WITHOUT PRIOR WARNING  VEHICLE  HIT A POTHOLE IN THE MIDDLE OF THE STREET, AND THE PASSENGER'S SIDE RIM SPLIT IN HALF. IT COST $390.00 FOR ALLUMINUM ALLOY RIM. *AK  *CB",
        "vin": "YV1NCS3D5YJ"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/16/2003",
        "dateOfIncident": "07/15/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004047,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLES' COMPONENTS , WHICH IS OPERATED BY THE ELECTRICAL SYSTEM WILL GO OUT INTERMITTENTLY  WITHOUT WARNING. THE DEALERSHIP HAS SERVICED THE VEHICLE SEVERAL TIMES FOR THIS PROBLEM, BUT THEY CAN'T FIND  ANYTHING WRONG. PROBLEM STILL CONTINUES.          PH",
        "vin": "YV1NC56D7YJ"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/22/2002",
        "dateOfIncident": "08/05/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021387,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT HEARD A CHATTERING NOISE, PULLED OVER AND NOTICE THE DRIVERS SIDE FRONT WHEEL BOLT CAME OFF AT NORMAL SPEED. TOOK TO DEALER AND THEY STATED THAT THE WHEEL HUB WAS RUSTED.  PLEASE PROVIDE ANY FURTHER INFORMATION.    MR",
        "vin": "YNIVC53D5YJ"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/07/2002",
        "dateOfIncident": "09/01/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011330,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ARM OF ACCELERATOR PEDAL BROKE WHEN HITTING PAD. REPLACED PART TWICE,  PROBLEM REOCCURRED. *AK. CONSUMER STATED FAILURE RESULTED IN SUDDEN ACCELERATION. *JB",
        "vin": "YV1NK56D3YJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "01/27/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002999,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60MPH, TIRE BLEWOUT ON SIDEWALL. PERELLI, P6000, TIRE SIZE P225/45R17. *AK  DOT NUMBER XTCJXKA6399.   *JB",
        "vin": "YV1NC56D8YJ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/13/2001",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 894181,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DEALERSHIP EXAMINED VEHICLE THEY DISCOVERED THAT MOTOR MOUNT BUSHING HAD CRACKED, AND THE MOTOR MOUNTS  BROKE. *AK  CONSUMER STATES ON THE FIRST OCCASION THE ENGINE CAME LOOSE AND BANGED AROUND IN THE ENGINE BAY, VOLVO REPLACED THE ENGINE MOTOR MOUNT BUSHINGS AND MODIFIED CV AXLES CAUSED BY ENGINE MOVING AROUND, THE SECOND TIME THE ENGINE CAME LOOSE, VOLVE REPLACED BROKEN MOTOR MOUNTS AND REPLACED RADIATOR HOSE CUT BY FAN BELTS.  WIPER BLADES FOR THE HEADLAMPS ARE NOT WORKING AND AR NOT ALIGNED PROPERLY.   *SLC",
        "vin": "YV1NC53D1YJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/19/2001",
        "dateOfIncident": "01/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 883379,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "C70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT TIRE AND  RIGHT REAR TIRE HAD SIDEWALL FAILURES WITHIN A SPAN OF A MONTH. CONTACTED DEALER, AND DEALER  WAS NOT WILLING TO DO ANYTHING, TIRES ARE PIRELLI P6000 17INCH.*AK   *SLC",
        "vin": ""
    }
]