[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/06/2011",
        "dateOfIncident": "06/04/2011",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404580,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 WINNEBAGO ADVENTURER. WHILE DRIVING APPROXIMATELY 5 MPH WITH THE GEAR IN REVERSE, THE BRAKE PEDAL DROPPED TO THE FLOOR BOARD. THE CONTACT EXIT THE VEHICLE AND NOTICED FLUID LEAKING FROM THE BRAKE LINE. THE CONTACT STATED THERE WERE NO WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT INSPECTED THE BRAKE LINE AND NOTICED THAT IT WAS CORRODED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE VEHICLE WAS NOT REPAIRED. NHTSA RECALL CAMPAIGN ID NUMBER: 03V060000 (SERVICE BRAKES, HYDRAULIC:SWITCHES:BRAKE WARNING) MAY BE RELATED TO THE FAILURE. THE MANUFACTURER WAS CONTACTED AND STATED THE VIN WAS NOT INCLUDED IN THE RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 43,500.    UPDATED 07/08/11  *BF  THE CONSUMER STATED THE RESERVOIR WAS EMPTY AND NO WARNINGS ILLUMINATED ON THE DASHBOARD INDICATING THERE WAS A PROBLEM. A CABLE WAS RUBBING AGAINST ANOTHER LINE AND ANOTHER SECTION HAD CORROSION, WHICH CAUSED THE BRAKE FAILURE.  UPDATED 08/04/11",
        "vin": "3FCNF53S4XJ"
    },
    {
        "components": "EXTERIOR LIGHTING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/06/2009",
        "dateOfIncident": "10/23/2009",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291256,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHT ASSEMBLY MOUNTING BRACKET GLUED TO THE FRONT FIBERGLASS FACIA BECAME UN-ATTACHED. THE ASSEMBLY DROPPED OUT OF ITS POSITION AND THE STEEL BRACKET WAS ABOUT TO FALL OFF. THE ONLY ATTACHMENT TO THE HEADLIGHT ASSEMBLY WAS THE ELECTRICAL WIRE CONNECTED TO THE HEADLAMP.  MY IMMEDIATE CONCERN WAS THE STEEL BRACKET WOULD FALL TO THE PAVEMENT POTENTIALLY CAUSING A PROBABLE CONTACT UNDER THE FRONT, OR REAR WHEELS OR TO A FOLLOWING VEHICLE. UPON CLOSER INVESTIGATION, THE BRACKET WAS HELD IN PLACE BY GLUE WITHOUT BOLTS AND NUTS. UPON EVEN CLOSER EXAMINATION SEVERAL ATTACHMENTS EXIST IN A SIMILAR MANNER. *TR",
        "vin": "1FCNF53S9Y0"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/04/2008",
        "dateOfIncident": "07/15/2000",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216869,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD PROBLEMS WITH OUR CRUISE CONTROL DISENGAGING AND SPEEDOMETER NOT WORKING SINCE OUR RV WAS NEW.  WE RECEIVED A RECALL FROM FORD (05S28) IN SEPTEMBER 2007 AND I CALLED AGAIN TODAY, FEBRUARY 4 AND THEY STILL DO NOT HAVE THE PARTS TO REPAIR THE RECALL.  *TR",
        "vin": "3FCNF53S1YJ"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/11/2007",
        "dateOfIncident": "05/07/2007",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192994,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RE:  A&E AWNING M 8500 BY DOMETIC, PO BOX 490, ELKHART, IN 46515 ON 2000 WINNEBAGO ADVENTURE MOTOR HOME.  SERIOUS DESIGN DEFECT CAUSED CATASTROPHIC  FAILURE WHICH COULD HAVE RESULTED IN SERIOUS INJURY OR LOSS OF LIFE.  SAME DESIGN DEFECT CAUSED A FAILURE IN APRIL 2003 ,WHICH WAS NOT AS SERIOUS AND ONLY REQUIRED THE REPLACEMENT OF THE AWNING FABRIC AND LOCKING MECHANISM..  ROLLER LOCKING MECHANISM FAILED.  ABLE TO STOP BEFORE ANY LARGE AMOUNT OF DAMAGE.  RECENT INCIDENT ON MAY 7, 2007.  BEFORE LEAVING ROLLED  AGAIN THE AWNING TO MAKE SURE IT WAS TIGHTLY ROLLED AND LOCKING MECHANISM WORKED.  TRAVELED 840 MILES FROM PORTLAND TO STRATH MORE, CANADA.  IN STRATHMORE DID NOT PUT OUT THE AWNING BUT DID INSPECT TO MAKE SURE STILL TIGHTLY ROLLED AND THE LOCKING MECHANISM ON.  80 MILES S, ROLLER LOCKING MECHANISM FAILED.  IN LESS TEN 10 SECONDS AWNING UNFURLED SO RAPIDLY IT WAS BLOWN OVER THE TOP OF THE MOTORHOME, BROKE LOOSE FROM AWNING ARMS, RIPPED THE FABRIC AND FLEW INTO THE ROAD.  ONLY BY THE GRACE OF GOD WAS THERE NOT MORE EXTENSIVE DAMAGE.  THE AWNING ROLLER AS A FLYING PROJECTILE COULD HAVE SEVERELY INJURED OR KILLED SOMEONE IN FOLLOWING TRAFFIC. THIS WAS A SERIOUS DESIGN DEFICIENCY WHICH CAN ALLOW A CATASTROPHIC FAILURE UNDER NORMAL HIGHWAY TRAVEL CONDITIONS. THIS FAILURE COULD VERY EASILY RESULT IN SERIOUS PERSONAL INJURY OR DEATH AND EXTENSIVE AND COSTLY MECHANICAL DAMAGES.  THE AWNING STOWING AND LOCKING MECHANISM  WAS NOT SUFFICIENT TO ASSURE THAT THE AWNING COULD NOT BECOME UNFURLED UNDER NORMAL HIGHWAY DRIVING CONDITIONS.   E-MAILED  DOMETIC REQUESTING AWNING REPAIR AND LOCKING MECHANISM MODIFICATION OR REPLACEMENT.  THEY REFUSED.  THEIR REPRESENTATIVE INFORMED ME THAT CAMPING WORLD AND OTHER RV OUTLETS SELL AWNING LOCKING MECHANISMS WHICH FIT THEIR AWNINGS AND WHICH WOULD LOCK THE AWNING SO THAT IT COULD NOT HAVE THIS CADISTROPIC FAILURE.  HE SUGGESTED THAT I SHOULD PURCHASE ONE IF I WANT TO PROTECT MY SELF FROM FUTURE AWNING FAILURES IN THE FUTURE.  *AK",
        "vin": "3FCNF53S3YJ"
    },
    {
        "components": "PARKING BRAKE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/05/2007",
        "dateOfIncident": "02/05/2007",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181678,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT  OWNS  A 2000 WINNEBAGO ADVENTURER WPG32V.   THE CONTACT STATED THAT THE MEDAL BRACKETS ON THE FRONT GRILL  BROKE OFF, AND HE REPAIRED THEM HIMSELF DUE TO THE COST.  THE CONTACT STATED THAT IN 2005 THE FIBERGLAS SIDING BEGAN  BUBBLING, AND THE ADHESIVE WAS NOT SECURING THE SIDING  AROUND WINDOWS AND JUST LIFTED IT  AWAY FROM THE WINNEBAGO.  THE WINNEBAGO WAS NOT EVEN TEN YEARS OLD  WHEN THE METAL BRACKETS COMING APART.  THE CONTACT STATED THAT THE GRAPHICS AND DECALS WERE FLAKING AND PEELING OFF.   THE CONTACT STATED THAT THE PARKING BRAKE MALFUNCTIONED,  AND WAS UNABLE TO SECURE THE WINNEBAGO.  THE CONTACT COULD ONLY STABILIZE  THE  VEHICLE IN PARK WITH THE ASSISTANCE OF JACKS.  *AK",
        "vin": "5B4LP37J5Y3"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/14/2006",
        "dateOfIncident": "07/08/2006",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162441,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING DOWN THE ROAD IN OUR 2000 WINNEBAGO MOTOR HOME WITH FORD V-10 TRITON ENGINE, WHEN A SPARK PLUG BLEW OUT.  WE HAD TO BE TOWED BACK TO THE DEALER, WHO IS REFUSING ANY RESPONSIBILITY TO REPAIR OUR ENGINE.  OUR MOTOR HOME ONLY HAS 14,000 MILES ON IT.  THE EXTENDED WARRANTY COMPANY IS SAYING THAT THIS IS NOT A COVERED REPAIR.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/30/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159435,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CONCERNED ABOUT THE 2000 WINNEBAGO ADVENTURER CHASSIS BOLT WHICH WAS CONTACTING THE LP GAS LINE LEADING FROM THE LP TANK TO THE FRONT OF THE COACH.  *TS  THERE WAS WEAR ON THE LP LINE WHERE THE CHASSIS BOLT IS LOCATED.  THE CONSUMER IS CONCERNED THAT THE LINE MAY RUPTURE.  *NM  UPDATED 06/12/06.  *JB",
        "vin": "3FCNF53S2YJ"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/27/2004",
        "dateOfIncident": "05/21/2004",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094367,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ROOF OF THE MOTOR HOME LIFTED OFF THE J RAIL ON EITHER SIDE OF THE MOTOR HOME. CONSUMER CONTACTED THE WINNEBAGO, AND WAS TOLD THAT THEY WERE AWARE OF THE DEFECT THAT CAUSED THE ROOF TO LIFT IN A SEVERE CROSS WIND, BUT WERE NOT WILLING TO REPAIR THE DEFECT.*AK",
        "vin": "3FCNF5357YJ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "02/01/2004",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065019,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN MODERATE TO HEAVY RAIN THE  AIR CLEANER FILLED WITH WATER AND CAUSED THE VEHICLE TO STALL.   *AK  THE CONSUMER FEELS THIS IS A SERIOUS DESIGN PROBLEM AND SAFETY CONCERN.  *NM",
        "vin": "3FCNF53S1YJ"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,POWER TRAIN,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE,VEHICLE SPEED CONTROL,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": "05/08/2002",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009434,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENTRY, AND DRIVER SIDE DOOR DOES NOT OPEN PROPERLY. SOMETIMES DOORS WILL NOT OPEN AT ALL, A PERSON WOULD HAVE TO PUSH HARD TO OPEN.*AK  THE RV IS EXPERIENCING THE FOLLOWING PROBLEMS,  GFI OUTLETS WILL NOT RESET, STOVE MOUTING SCREW IS BROKEN, TRIP METERS ARE INOPERATIVE, WORK HORSE CHASIS, WATER LEAKS ON DRIVER SIDE REAR WHEEL IF THE SHOWER IS IN USE, DRIVER SIDE REAR LEVELER RETRACTS AFTER SITTING (AFTER SITTING FOR 3 ITS ABOUT 3\" OFF THE GROUND), GRAY & BLACK WATER DUMP VALVES INOP, ENTRY DOOR DOES NOT CLOSE PROPERLY, DASH HEATER BLOWS COOL/AIR CHECKED OUT AND FOUND VAC LINE OFF/HEATER VALVE REINSTALLED OPS CHECKED GOOD, BODY ELECTRICAL CRUISE CONTROL INOP, CHECKED ADVISED DIAGNOSED AND REPAIRED POOR ELECTRICAL CONECTION FOR CRUISE CONTROL, ODOMETER INOP. PERFORMED DIAGNOSIS AND FOUND INTERNAL DAMAGE TO CLUSTERS MUST REMOVE IT AND SEND A TOUR MASTER FLUID HAS DEBRIS FLUID IS EMPTY, PEDAL GOES TO THE FLOOR CUSUMER HEARS A RATTLE IN BACK.*SCC",
        "vin": "5B4LP37JXY3"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/22/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878656,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CLAMPS ON ALL ENGINE COOLING SYSTEM   HOSES CLAMPS KEEP BREAKING OR SNAPPING OFF PREMATURELY POSSIBLY DUE TO POOR MANUFACTURING.*AK",
        "vin": "3FCNS53S4YJ"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/13/2000",
        "dateOfIncident": "10/18/2000",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874830,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT DRIVER'S SIDE STEERING WHEEL FROZE AND CAME OFF, ONLY THING THAT WAS LEFT WAS HYDRAULIC BRAKES.WHEN CHECKING  RIGHT WHEEL INSPECTION CUP FELL OFF AND THAT SHOULD NOT HAPPEN.  *AK",
        "vin": "5B4LP37J5Y3"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/24/2000",
        "dateOfIncident": "06/17/2000",
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 865872,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  NOTICED AFTER A RAIN STORM THAT TAIL LIGHT COVER WOULD BE FULL WITH WATER. AS A RESULT OF THIS, INDICATOR LIGHTS WOULD SHORT OUT.  DEALER HAS BEEN CONTACTED.  *AK",
        "vin": "5B4LP37J7Y3"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/04/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Winnebago Industries, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 558406,
        "products": [
            {
                "manufacturer": "Winnebago Industries, Inc.",
                "productMake": "WINNEBAGO",
                "productModel": "ADVENTURER",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL ON THE DRIVER'S SIDE BROKE OFF, THERE WAS NO GREASE IN THE LEFT FRONT BEARING AND THE ONLY THING HOLDING THE WHEEL WAS THE BRAKE LINE AND THE STEP ON THE DRIVERS SIDE, WHEN THE CONSUMER CHECKED THE WHEEL ON THE OTHER SIDE, IT TOO HAD NO GREASE IN THE BEARINGS, BUT IT HAD NOT FALLEN OFF YET.   *SLC",
        "vin": "5B4LP37J5Y3"
    }
]