[
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2019",
        "dateOfIncident": "11/15/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11165020,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY CAR TO THE DEALER BECAUSE IT WAS NOT PASSING SMOG AND HAD TROUBLE FOR SEVERAL YEARS. SO THE SMOG DEALER TOLD ME TO TAKE IT TO THE DEALER. I TOLD THE DEALER THAT I WAS TRYING TO PASS SMOG, BUT THE CAR HAD BEEN DRIVING VERY GOOD IN SPITE OF THE SMOG PROBLEM. THEY REPLACED EVERYTHING THAT YOU CAN IMAGINE AT A COST OF OVER 10,000 DOLLARS WHICH BOTH OF US SPENT IN A TWO MONTH PERIOD. BUT AFTER THEY GOT IT TO PASS SMOG I NOTICED ANOTHER MORE SERIOUS PROBLEM, IT WOULD STOP RUNNING IN THE MIDDLE OF TRAFFIC.  I TOLD THEM ABOUT THIS NEW PROBLEM AND THEY REPLACED THE KEY AND IT STILL STOPPED ON ME 3 X ON THE FREEWAY AND STREETS. I RETURNED THE CAR GOING DOWN THE MAIN STREETS FOR 2 HOURS AND LIFT IT WITH THE COMPANY. MCKEVITT VOLVO IN SAN LEANDRO CA. THEY WANTED TO CHARGE ME BUT I TOLD THEM MY ARE DID NOT HAVE THIS PROBLEM UNTIL THEY WORKED ON IT!  I NEED A WORKING CAR AND I AM IN DEPT AS A RESULT OF THEIR WORK. I AM A 65 YEAR OLD RETIRED TEACHER BUT I CAN'T AFFORD THIS DEPT. 11",
        "vin": "YV1LW61J8Y2"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "10/01/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785051,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO V70. WHILE DRIVING 65 MPH, THE ACCELERATOR PEDAL WAS DEPRESSED, BUT THE VEHICLE FAILED TO MOVE FORWARD AS THE RPMS INCREASED. THE CHECK ENGINE AND ETS WARNING LIGHTS ILLUMINATED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 146,000.",
        "vin": "YV1LZ56D5Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10727037,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO V70. WHILE DRIVING 65 MPH, THE RPMS EXCESSIVELY INCREASED AND THE ETS WARNING LIGHT ILLUMINATED. THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT WAS AWARE OF NHTSA CAMPAIGN NUMBER: 06V441000 (VEHICLE SPEED CONTROL); HOWEVER, THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 115,000.",
        "vin": "YV1LW61J0Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "10/28/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10593671,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO V70 STATION WAGON. THE CONTACT STATED WHILE SITTING IN TRAFFIC, THE VEHICLE WAS CRASHED INTO FROM THE REAR. THE PASSENGER AND DRIVERS SIDE AIR BAGS DID NOT DEPLOY.  THE VEHICLE WAS DESTROYED. A POLICE REPORT WAS FILED. THE CONTACT WAS INJURED AND RECEIVED IMMEDIATE MEDICAL ATTENTION. THE MANUFACTURER WAS NOTIFIED AND DID NOT OFFER A REMEDY. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WERE 200,070.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "10/28/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10593692,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO V70. THE CONTACT STATED THAT HE WAS REAR ENDED AT 45 MPH AND A VOLVO ADVERTISEMENT INDICATED THAT THE VEHICLE WAS EQUIPPED WITH SPECIAL SEATS TO AVOID SERIOUS INJURIES WHEN A CRASH OCCURRED. WHEN THE CRASH OCCURRED THE CONTACTS HEAD STRUCK THE STEERING WHEEL, BROKE THE STEERING WHEEL, THE HEAD REST AND THE SEAT. THE IMPACT FROM THE REAR END COLLISION CAUSED THE REAR SEATS TO BE PUSHED CLOSER TOWARDS THE FRONT AND REAR PASSENGER SEATS. THE IMPACT ALSO CAUSED DAMAGE TO THE EXTERIOR OF THE VEHICLE INCLUDING A CREASE IN THE ROOF OF THE VEHICLE IN A   V-SHAPE. NONE OF THE AIR BAGS DEPLOYED; HOWEVER, THE CONTACT WAS TOLD THAT DURING A REAR END CRASH THE AIR BAGS DO NOT DEPLOY. THE VEHICLE WAS DESTROYED. THE CONTACT WAS UNCONSCIOUS AND ANOTHER DRIVER PASSING BY CALLED THE AMBULANCE ON HIS BEHALF. THE FIREMAN ADVISED THE CONTACT THAT ALTHOUGH HE WAS DRIVING THE VEHICLE THEY FOUND HIM UNCONSCIOUS IN THE BACK SEAT. THE CONTACT SUSTAINED A BROKEN NOSE, A DEVIATED SEPTUM, A SEVERE CASE OF ASTHMA, HEART DISEASE, AND WAS COMPLETELY INCAPACITATED AFTER THE CRASH OCCURRED. THE T7 AND T9 THORACIC VERTEBRAE WERE FRACTURED. THE CRASH HAD CAUSED THE CONTACT TO LIVE WITH A TRAUMATIC BRAIN INJURY. THE MANUFACTURER DISPATCHED A TECHNICIAN TO INSPECT THE VEHICLE AND ADVISED THE CONTACT THAT THERE WAS NOTHING WRONG THE VEHICLE; HOWEVER, HE WOULD NOT PROVIDE THE CONTACT, THE INSURANCE COMPANY OR HIS ATTORNEY WITH COPIES OF THE REPORT OR PHOTOS TAKEN DURING THE INVESTIGATION. A POLICE REPORT WAS FILED. THE VIN WAS NOT PROVIDED. THE CURRENT AND FAILURE MILEAGE WERE 100,000.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "05/23/2014",
        "dateOfIncident": "10/28/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10593680,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO V70.  THE CONTACT STATED WHILE THE VEHICLE WAS AT A STOP, THE FRONT SEAT FAILED TO HOLD THE CONTACT IN  POSITION CAUSING HIM TO BE REAR ENDED. THE CONTACT WAS INJURED AND RECEIVED IMMEDIATE MEDICAL ATTENTION.  THE VEHICLE WAS DESTROYED.   A POLICE REPORT WAS FILED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND OFFERED NO REMEDY. THE FAILURE WAS NOT DIAGNOSED BY A DEALER OR LOCAL MECHANIC. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WERE  100,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/28/2014",
        "dateOfIncident": "10/01/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585360,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VOLVO V70 HAS BEEN DYING IMMEDIATELY AFTER STARTING THE ENGINE AND HAS PROGRESSIVELY GOTTEN WORSE OVER THE LAST 6 MONTHS.  HAVE HAD TWO TRIPS TO A MECHANIC WHO REPAIRED A FEW PARTS, BUT IT DIDN'T FIX IT.  PROBLEM CONTINUES.  RECENTLY, WE WERE DRIVING ON THE HIGHWAY AT ABOUT 65 MPH AND THE CAR SPEED DROPPED TO ABOUT 20 MPH AND COULDN'T GO ANY FASTER AND WE HAD TO PULL OVER.  THIS IS A MAJOR SAFETY RISK.    NOW THE CAR STARTS AND IMMEDIATELY DIES FOR ABOUT 4-5 TIMES BEFORE IT WILL START AND CONTINUE RUNNING.  THERE IS A WHIRRING NOISE COMING FROM THE ELECTRONIC THROTTLE WHEN IT DIES IMMEDIATELY.  I TOOK IT TO A VOLVO DEALER AND THEY SAID A RECALL FOR A SOFTWARE UPDATE WAS PERFORMED ON MY CAR IN 2006 TO LOWER THE WEAR INSIDE THE THROTTLE.  THEN VOLVO ISSUED A SERVICE CAMPAIGN FOR THE ETM WHEN IT FAILS, BUT THE CAMPAIGN LASTED UNTIL 200,000 MILES OR 10 YEARS.  SO EVEN THOUGH THE CAR HAS ONLY 94K MILES AND THE RECALL SOFTWARE WAS INSTALLED ONLY 25K MILES AGO, VOLVO WON'T REPLACE A CRITICAL PART TO THE SAFE OPERATION OF THE VEHICLE BECAUSE THE 10 YEARS HAVE PASSED.  SO THE DEALER AND VOLVO REFUSED TO REPLACE THIS PART EVEN THOUGH THE ETM ALREADY HAD A RECALL AND SERVICE CAMPAIGN IN THE PAST.  2 ACTIONS TO ADDRESS A DEFECTIVE PART, BUT VOLVO DIDN'T FIX THE PROBLEM AND I HAVE A BAD PART IN MY VOLVO THAT IS UNSAFE.  *JS",
        "vin": "YV1LW61J7Y2"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "11/01/2012",
        "dateOfIncident": "10/28/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482907,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO V70. THE CONTACT WAS STOPPED IN TRAFFIC WHEN ANOTHER VEHICLE CRASHED INTO THE REAR OF THE CONTACT'S VEHICLE WHILE DRIVING APPROXIMATELY 45 MPH. UPON IMPACT, THE DRIVER'S SEAT SPLIT IN HALF AND THE CONTACT WAS THROWN TO THE REAR DRIVER'S SIDE SEAT. HE HAD TO BE CUT OUT OF THE VEHICLE. THE VEHICLE WAS DESTROYED. THE FAILURE AND CURRENT MILEAGE WAS 100,000.",
        "vin": "YV1LW61J3Y2"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "10/31/2012",
        "dateOfIncident": "10/28/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10482738,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2000 VOLVO V70. THE CONTACT STATED THAT WHILE SITTING IDLE AT A TRAFFIC STOP, THE CONTACT'S VEHICLE WAS CRASHED INTO FROM THE REAR. AS A RESULT, THE FRONT DRIVER'S SEAT SPLIT IN HALF AND THE FRONT AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED INJURIES TO THE VERTEBRAE AND A POLICE REPORT WAS FILED OF THE INCIDENT. THE VEHICLE WAS TOWED FOR FURTHER INVESTIGATION. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE FAILURE AND CURRENT MILEAGE WAS 100,000.",
        "vin": "YV1LW61J3Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2012",
        "dateOfIncident": "05/22/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469617,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "AUGUST 8, 2012    I AM SENDING THIS COMPLAINT CONCERNING THE SERVICE I RECEIVED ON A RECALL FOR A 2000 V-70 VOLVO,                                         CAMPAIGN# R115  ( VEHICLE SPEED ), NHTSA -CAMPAIGN# O6V441000, ACTION # EAQ-5021.     I SCHEDULED AN APPOINTMENT WITH A VOLVO DEALERSHIP. I WENT TO THE SCHEDULED APPOINTMENT AND LEFT MY VEHICLE TO BE SERVICED. I WAS CALLED FROM THE DEALERSHIP AND WAS TOLD MY CAR WAS READY FOR ME TO PICK UP. AFTER DRIVING MY VEHICLE FOR ABOUT 15 MIN MAX. IT BEGAN UNFORTUNATELY WITH THE SAME SYMPTOMS I PREVIOUSLY WAS EXPERIENCING.    I CALLED THE SERVICE DEPARTMENT WHERE I APPARENTLY HAD MY CAR SERVICED FOR REPAIR AND WAS TOLD BY THE MANAGER THAT I WOULD BE RESPONSIBLE FOR ANOTHER DIAGNOSIS, AND THAT IT WAS PROBABLY SOMETHING ELSE, SINCE THE RECALL SERVICE WAS DONE     I DECIDED TO CALL THE:  VOLVOCARS.US  TELEPHONE #, @ 1-800-458-1552.  I THOUGHT FOR SURE, I WOULD RECEIVE THE SUPPORT I NEEDED . I DID NOT. I WAS TOLD ONCE AGAIN,  I WAS RESPONSIBLE FOR THE REPAIR.    VERY UPSET, NEEDLESS TO SAY,  I PROCEEDED ONCE AGAIN, AND CALLED THE MANAGER AT THE VOLVO DEALERSHIP. I EXPRESSED ONCE AGAIN, MY CONCERN WITH THE SERVICE PERFORMED. IN ADDITION TO THE SERVICE,  I HAD SOME QUESTIONS CONCERNING THE SERVICE INVOICE . THEY HAVE YET TO BE ANSWERED.    I HAVE ADOLESCENT CHILDREN WHO ARE PASSENGERS IN MY VEHICLE EVERYDAY, AND WE WOULD SO APPRECIATE!!! OUR CAR SERVICED AS IT SHOULD BE, PLEASE,     THIS RECALL READS MORE THAN AN UPGRADE. APPARENTLY THIS UPGRADE WAS COMPLETED,  I BEG TO DIFFER.    THANK YOU FOR YOUR TIME AND CONSIDERATION IN THIS VERY CONCERNING MATTER, AS I LOOK FORWARD TO HEARING FROM YOUR OFFICE. AT YOUR MOST EARLIEST CONVENIENCE.   *TR",
        "vin": "YV1LW56D5Y2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/10/2011",
        "dateOfIncident": "05/20/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424559,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHY AREN'T YOU DOING ANYTHING ABOUT VOLVO BUILDING CRAP? THEY SHOULD BE IN JAIL.  ETM - DESIGN WAS UNACCEPTABLE FROM A DAY ONE. THE ETM IS CAUSING SURGING, STALLING AND MANY OTHER SYMPTOMS. ONCE VOLVO STARTED TO REPLACE SOME OF THEM, THEY USED NEW ONES WITH EXACTLY THE SAME FLAWED DESIGN.  ABS MODULE - IS KNOWN FOR CAUSING LOSS OF BRAKING POWER, EARLY BRAKE PADS WEAR AND DAMAGING TRANSMISSION.  FRONT BRAKE CALIPERS - RUST ON CALIPERS IS SQUEEZING RUBBER BOOTS AROUND SLIDING PINS. DAMAGE TO ROTORS, PADS AND WHEEL BEARINGS.  FRONT LIGHTS LOW BEAMS - UNACCEPTABLE LIGHT OUTPUT.  FRONT SEAT BELTS - ARE CUTTING INTO SIDE TRIM AND SIDE TRIM IS CUTTING INTO SEAT BELTS.  WIND SHIELD WIPERS - HIGHEST SPEED IS USELESS IN HEAVY RAIN.  CRUISE CONTROL - RPM SURGES WHILE GOING 55MPH AND TURNING ON THE CRUISE CONTROL.   DO SOMETHING!  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2011",
        "dateOfIncident": "04/11/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396324,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LOST  POWER IN TRAFFIC, HAD TO DRIVE 10 MPH IN LIMP MODE IN HEAVY TRAFFIC",
        "vin": "YV1LZ56D5Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370615,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2000 V70 VOLVO -- CANNOT REMOVE KEY FROM IGNITION. MUST WAIT 1-10 MINUTES, OR USE SECOND KEY TO LOCK CAR WITH FIRST KEY STILL IN IGNITION. KEY CAN USUALLY BE REMOVED AFTER 1-10 MINUTES. *TR",
        "vin": "YV1LW56D1Y2"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/11/2010",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335800,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 VOLVO V70 WAGON AND THE CENTER BRAKE LIGHT IS NOT FUNCTIONING.  BEFORE SEEING THE CAR, THE MECHANIC PREDICTED THE PROBLEM WOULD BE THE LIGHT HARNESS, BECAUSE THE LED LAMPS ARE TYPICALLY  LONG LIVED.  (BUT DOES THIS ALSO SUGGEST THE PROBLEM IS COMMONPLACE?)  TOOK THE CAR TO BE DIAGNOSED.  HAVE BEEN TOLD THE HARNESS NEEDS TO BE REPLACE.  THE COST TO REPLACE IT WILL BE ABOUT $425.  WHILE I AM WAITING FOR THE PART TO COME IN, I CONTINUE TO BE WITHOUT THE CENTER BRAKE LIGHT. *TR",
        "vin": "YV1LW61J0Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2010",
        "dateOfIncident": "03/22/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326217,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 VOLVO V70 WITH 130K MILES AND THE CAR INTERMITTENTLY CUTS OFF WITHOUT WARNING AND/OR IT HAS DIFFICULTY STARTING.  THIS OCCURS SEVERAL TIMES A WEEK.  THERE ARE ALSO TIMES WHEN I TRY TO START THE CAR, IT DOES NOT HAVE ENOUGH POWER TO MOVE FORWARD, SPITS SPUTTERS, AND THEN CUTS OFF. THE LOCAL DEALERSHIP, VOLVO OF CHARLOTTE, NC SAID IT WAS THE ELECTRONIC THROTTLE SYSTEM (ETS) AND THAT MY RECALL/REPLACEMENT WARRANTY RAN OUT IN FEBRUARY 2010.  AFTER NOTIFICATION OF A PROBLEM EXISTING IN 2006/2007, I COMPLIED WITH THE RECALL AND THE SOFTWARE UPGRADED SHORTLY AFTER THE 2006 RECALL NOTICE WAS RECEIVED, BUT NOW VOLVO WILL NOT HONOR THE ISSUE WITH THE FAULTY SOFTWARE UPGRADE OR REPLACE THE ETS MODULE.  WHEN I CONTACTED VOLVO USA, THE REPRESENTATIVE SAID THEY HAVE CUSTOMERS EVERY DAY THAT ARE BEYOND THE 200,000 MILE OR 10-YR IN SERVICE DATE, AND THEY WON'T HELP.  FOR ME TO REPLACE THE MODULE WILL COST MORE THAN $1,000.  IF THE SOFTWARE AND MODULE ARE FAULTY, SHOULD THEY BE RESPONSIBLE FOR REPLACING THE UNITS SINCE THEY ADMIT TO MANUFACTURING THE CAR WITH THE FAULTY COMPONENT?  CLEANING THE MODULE DOES NOT WORK. *TR",
        "vin": "YV1LW61J1Y2"
    },
    {
        "components": "SEAT BELTS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/18/2009",
        "dateOfIncident": "08/14/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280877,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Trucks North America",
                "productMake": "VOLVO",
                "productModel": "SEAT BELT ASSEMBLY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DEFECTIVE REAR SEATBELT (DRIVER SIDE) IN 2000 VOLVO V70. SEATBELT BINDS UP, CANNOT BE PULLED OUT AND WON'T RETRACT. THIS IS THE SECOND OCCURRENCE FOR THIS CAR WHICH HAS 100,000 MILES ON IT. *TR",
        "vin": "YV1LW56D1Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2009",
        "dateOfIncident": "03/09/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261524,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION KEY CANNOT BE REMOVED FROM THE SWITCH AFTER THE ENGINE IS CUT OFF.  *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/28/2009",
        "dateOfIncident": "12/05/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256573,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 VOLVO V70.  THE CONTACT STATED THAT THE TAILGATE MECHANISIM WAS DEFECTIVE AND WOULD NOT LOCK IN COLD WEATHER.  THE DEALER STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 00V239000   (LATCHES/LOCKS/LINKAGES:TAILGATE:LATCH).  THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE MILEAGE WAS 104,000 AND CURRENT MILEAGE WAS 104,006.    UPDATED 2/23/09 *CN  UPDATED 02/25/09. *JB",
        "vin": "YV1LZ56DXY2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/03/2008",
        "dateOfIncident": "08/27/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240739,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 VOLVO V70.  THE VEHICLE WOULD SHUT OFF WHILE DRIVING AT ANY SPEED.  THE DEALER REPLACED SOME OF THE COMPONENTS.  THE CONTACT MERGED INTO HEAVY TRAFFIC AND THE VEHICLE SHUT OFF AGAIN.  THE FAILURE HAS OCCURRED TWICE AND BEEN REPAIRED TWICE; HOWEVER, THE CONTACT IS CONCERNED THAT THE FAILURE WILL RECUR.  THE FAILURE MILEAGE WAS 110,000.",
        "vin": "YV1LZ56D1Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "07/04/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234793,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 VOLVO V70 CROSS COUNTRY.  THE CONTACT IS CURRENTLY EXPERIENCING DIFFICULTY STARTING THE VEHICLE.  WHILE DRIVING 60 MPH, THE THROTTLE LIGHT ILLUMINATES INTERMITTENTLY.  SHE RECEIVED A SAFETY RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 06V441000 (VEHICLE SPEED CONTROL).  THE RECALL REPAIR WAS PERFORMED AND THE SURGING AND STALLING CEASED FOR A SHORT PERIOD OF TIME; HOWEVER, THE FAILURES HAVE RECURRED.  ON JULY 18, 2008, THE DEALER STATED THAT THEY WOULD REPAIR THE ECM SYSTEM IF NEEDED, BUT THE CONTACT WOULD HAVE TO PAY TO HAVE THE VEHICLE DIAGNOSED.  THE CURRENT AND FAILURE MILEAGES WERE 140,000.",
        "vin": "YV1LZ56D9Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/14/2008",
        "dateOfIncident": "04/13/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224475,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "VEHICLE SAFETY MANUFACTURING, LLC",
                "productMake": "VSM",
                "productModel": "4464RC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "CAN NOT REMOVE KEY FROM STEERING WHEEL IGNITION.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/29/2008",
        "dateOfIncident": "01/15/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216361,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Trucks North America",
                "productMake": "VOLVO",
                "productModel": "SEAT BELT ASSEMBLY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A 2000 V70 VOLVO THAT I HAVE A PROBLEM REMOVING THE KEY FROM THE IGNITION . I HAVE A SECOND KEY THAT I USE TO LOCK THE CAR WITH .  I CAN NOT REMOVE THE KEY . IS THERE A RECALL FOR THIS PROBLEM?  *CN",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/11/2007",
        "dateOfIncident": "12/07/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211428,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "1) WHEN REAR HATCH DOOR IS OPENED IN COLD WEATHER IT FAILS TO LATCH PROPERLY  2) REAR HATCH DOOR FAILS TO LATCH  3) VOLVO DEALER LUBRICATED LATCH WHICH FAILS TO SOLVE THE PROBLEM.  IN ADDITION, A RECALL FOR THIS EXACT PROBLEM EXISTS, HOWEVER, MY VIN DOES NOT QUALIFY.  *TR",
        "vin": "YV1LV60D0Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/30/2007",
        "dateOfIncident": "01/09/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201266,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 VOLVO V70.  THE CONTACT WAS ATTEMPTING TO BRAKE WHEN THE VEHICLE SURGED FORWARD AND STRUCK THE PRECEDING VEHICLE.  AT THE TIME, SHE THOUGHT THAT THE BRAKES FAILED.  THE CONTACT LEARNED OF NHTSA RECALL NUMBER 06V441000 (VEHICLE SPEED CONTROL) AFTER THE CRASH.  THE VEHICLE SUSTAINED DAMAGES TO THE FRONT END (HOOD BRACKET, HOOD HINGE, MARKER LIGHT, FRONT BUMPER COVER, WIPER BLADES, SIDE LAMPS, GRILL, HEAD LAMPS, HOOD AND LATCH, AND PAINT).  THE REPAIR WILL COST $4,870.81, WHICH INCLUDES THE $500 INSURANCE DEDUCTIBLE.  THE COST OF THE RENTAL VEHICLE WAS $390.  THE DAMAGES TO THE REAR END OF THE OTHER VEHICLE (1998 TOYOTA FORERUNNER) WERE THE QUARTER PANEL, RE-FINISH ON THE REAR BUMPER, AND A REPLACED PASSENGER SIDE REAR BUMPER OUTER EXTENSION.  THE TOTAL REPAIR COST WAS $563.22.   THE FAILURE MILEAGE WAS 98,590.  UPDATED 01/09/09.  *LJ  UPDATED 01/15/09. *JB",
        "vin": "YV1LW61J6Y2"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/16/2007",
        "dateOfIncident": "12/01/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196457,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2000 VOLVO V70.  THE CONTACT STATED THAT THE TAILGATE FAILED TO LATCH WHEN CLOSED.  THE DEALER STATED THAT THE VEHICLE NEEDED A NEW LOCKING MECHANISM, BUT THAT HER VIN WAS EXCLUDED FROM RECALL # 00V239000 (LATCHES/LOCKS/LINKAGES:TAILGATE:LATCH).  THE CURRENT MILEAGE IS 82,000 AND FAILURE MILEAGE WAS 32,000.",
        "vin": "YV1LW61J4Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2006",
        "dateOfIncident": "10/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171726,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 25 MPH AND ABOVE, THE VEHICLE COMPLETELY LOST POWER.  THE VEHICLE WAS TAKEN TO A SERVICE DEALER, WHO REPLACED BATTERY CABLES AND THE CONTROL MODULE.  THE CONSUMER STATED SOMETIMES IT WOULD TAKE ANYWHERE FRO 30 SECONDS TO 2 MINUTES BEFORE THE VEHICLE RESUMED NORMAL OPERATION AFTER STALLING. UPDATED 12/01/06. *JB",
        "vin": "YV1LZ56D2Y2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/12/2006",
        "dateOfIncident": "05/24/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160500,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 V70 MALFUNCTIONED IN REAR SEAT BELTS IN MY CAR.  *TS  TWO OF THE THREE SEAT BELTS IN THE REAR OF THE VEHICLE LOCKED AND COULD NOT BE RELEASED.  THE VEHICLE WAS TAKEN TO THE DEALER.  THE DEALER DISASSEMBLED THE REAR SEATS AND MANUALLY EASED THE LOCKED SEAT BELTS.  THE DEALER WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE AND BELIEVED THAT IT WOULD REC.  AS THE TECHNICIAN EASED THE LOCKED SEAT BELT AND ALARM CHIMED ON THE DASH WHICH SAID SRS AIR BAG SERVICE URGENT.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/02/2006",
        "dateOfIncident": "04/25/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156603,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS CONTROL MODULE FAILURE.  I WAS INFORMED BY TWO DEALERSHIPS, NORTH POINTE VOLVO AND DYER AND DYER VOLVO, AS WELL AS VOLVO PROFESSIONAL REPAIR (ALL LOCATED IN THE ATLANTA GA AREA) THAT THIS WAS A COMMON OCCURRENCE.  WELL I EXPERIENCED THIS YESTERDAY.  THE AUTOMOBILES' ABS NO LONGER IS EFFECTIVE WHEN THIS UNIT GOES BAD, LEADING TO DANGEROUS SITUATIONS.  IT ALSO LEADS TO STALLING, AND SHIFTING PROBLEMS WITH THE TRANSMISSION WHICH CAN LEAD TO AN ACCIDENT, AND ALMOST CAUSED ME TO HAVE ONE YESTERDAY.  THE PART HAS TO BE REPLACED TO THE TUNE OF NEARLY $1000.00 I CAN PROCURE THE OLD PART FROM THE SERVICE MANAGER.  I WAS INFORMED THIS WAS A DESIGN FLAW AS HEAT CAUSES THE DETERIORATION OF THIS MODULE DUE TO ITS LOCATION NEAR THE ENGINE.  *JB",
        "vin": "YV1LW56DXY2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/15/2006",
        "dateOfIncident": "02/03/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150382,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/3/06 OUR VOLVO V70 YEAR 2000, 74000M SHOWED AN ETS LIGHT AND CHECK ENGINE LIGHT.  CAR STALLED AT UPON STOPPING AND ALSO UPON STOPPING AT A STOP LIGHT THE VEHICLE WOULD NOT ACCELERATE.  UPON TURNING THE CAR OFF AND BACK ON I WAS ABLE TO HAVE IT ACCELERATE.  THE CAR WOULD RUN OK FOR ABOUT 20 MILES THEN LIGHTS CAME ON AGAIN.  CONTACTED VOLVO BYERS IN COLS OH 614-864-0780 WHOM INFORMED ME THAT THE THROTTLE SYSTEM IS NEEDING REPLACED.  HAD THE VEHICLE SERVICED ON 2/6/06.  BYERS PERFORM FAULT TESTS AND NOTED THAT THERE WAS LOW VOLTAGE AND STATED CABLES FROM BATTERY WERE NEEDING REPLACED.  I INFORMED THEM THAT I WAS CONFUSED WITH HOW THIS COULD CAUSE THE ETS LIGHT AND CHECK ENGINE LIGHT TO COME ON AND CAUSE MY CAR TO STALL AND AT TIMES NOT ACCELERATE WHILE THE CAR IS RUNNING.  THEY INDICATED THAT PRIOR TO FIXING THE ETS THEY NEEDED TO FIX THIS ISSUE.  THE COST $463.59.  THEY THEN CLEARED ALL FAULT CODES AND NOTED THAT THERE WAS NO ETS CODE PRESENT.  I INFORMED THEM THAT THIS IS PROBABLY BECAUSE THEY DID NOT DRIVE THE CAR ENOUGH AFTER IT HAD BEEN TURNED OFF AS THIS IS WHAT OCCURRED TO ME THE DAY THE ETS CAUSED PROBLEMS.  THEY INSISTED THAT IT WAS REPAIRED.  HOWEVER, ON FEBRUARY 15, 2006 THE ETS AND CHECK ENGINE LIGHT CAME ON AGAIN AND THE CAR STALLED UPON STOPPING AND THE LIGHTS WOULD TURN OFF UPON RESTARTING THEN DRIVING 10 MILES TURNED BACK ON.  I CALLED THE DEALER COMPLAINING ABOUT THE ISSUE AND FAILURE TO REMEDY THE INITIAL CAUSE OF THE PROBLEM.  I ADDRESSED MY FRUSTRATION THAT I SPENT OVER $450 TO FIX A PROBLEM THAT MAY NEVER HAVE HAD TO BE FIXED.  RESEARCHED OTHER PROBLEMS WITH VOLVO ETS AND FOUND SIMILAR ISSUES AND EXPERIENCES WITH THIS MODULE.  FURTHERMORE, I LEARN OF A WARRANTY EXTENSION BUT NEVER RECEIVED ANY DOCUMENTATION OF ANY POTENTIAL PROBLEM WITH THE VEHICLE.  THIS IS A SAFETY HAZARD.  HAD I BEEN STOPPED IN AN INTERSECTION/RAILROAD TRACK I WOULD NOT HAVE BEEN ABLE TO ACCELERATE THE CAR TO AVOID POTENTIAL INJURY.  VERY FRUSTRATED WITH VOLVO IN OHIO. *NM",
        "vin": "YV1LW61JXY2"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/30/2006",
        "dateOfIncident": "01/08/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148992,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH ONLY 80,000 MILES, AFTER 5 YEARS OF DRIVING, THE ENGINE IS WARNING THAT THE ELECTRONIC THROTTLE SYSTEM' (ETS)  FAILED.  THE DEALER AND AN INDEPENDENT REPAIR SHOP ONLY CAN REPLACE THE ETS MODULE AT A COST OF $1,200.  THE REPLACEMENT PART IS ACTUALLY THE SAME AS THE FAILED PART WITH NO IMPROVEMENT.  SEARCHES ON THE INTERNET SHOWED THAT THIS PART  FAILED OVER AND OVER AGAIN.  WHEN IT FAILED THE CAR COULD BE DRIVEN IN A LIMP ALONG HOME MODE, WHICH I HAVE HAD TO USE, MAKING OTHER CARS PASS ME WHILE THIS CAR COULD ONLY GO ABOUT 5-10 MPH.  THE INTERNET POSTINGS INDICATED THAT NHTSA WAS TRYING TO WORK WITH VOLVO TO EXTEND THE FACTORY WARRANTY OF THIS PART, BUT WITH NO SETTLEMENT YET.  LETTING VOLVO TO CONTINUE TO USE KNOWN TROUBLE-PRONE PARTS  WHICH SHOULD BE RESOLVED.*AK",
        "vin": "YV1LW56D2Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2005",
        "dateOfIncident": "10/30/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146320,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM SUBMITTING ETM FAILURE IN MY 2000 VOLVO V70 SE WAGON IN OCTOBER OF 2005. I AM CONCERNED FOR MY SAFETY DRIVING THIS CAR BECAUSE THE CAR HESITATES UPON ACCELERATION, THERE'S  SUDDEN AND UNEXPECTED TRANSITION INTO REDUCED PERFORMANCE OPERATION (LIMP MODE) AND SOMETIMES WHEN THE ETS INDICATOR HAS ENGAGED WHILE MY FOOT IS ON THE BRAKE THE CAR SURGES FORWARD AS IF I WERE GIVING IT A LOT OF GAS.  I WENT TO THE DEALER IN CULVER CITY, CALIFORNIA, TODAY, DECEMBER 28, 2005, AND THE MODULE WAS NOT REPLACED BUT, THE SERVICE REPS DID SAY THEY CLEANED THE THROTTLE - WHATEVER THAT IS - AND UPGRADED THE SOFTWARE PROGRAM ON THE COMPUTER. FIVE MINUTES AFTER LEAVING THE VOLVO SERVICES DEPARTMENT THE ETM FAILED AGAIN. I CALLED THE DEALER AND THEY TOLD ME THEY DID ALL THAT THEY COULD DO.  *JB",
        "vin": "YV1LW61J5Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/11/2005",
        "dateOfIncident": "08/19/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142448,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTERING THE HIGHWAY, MY VOLVO V70 HAD A COMPLETE STALL.  CAR COMPLETELY STOPPED AND WOULD NOT START.  AFTER ABOUT 20 MINUTES, IT RE STARTED.   IT WAS DRIVEN TO THE VOLVO DEALER ONCE IT STARTED AGAIN AND THE \"ELECTRONIC THROTTLE MODULE\" WAS REPLACED AT A COST OF $800. *JB",
        "vin": "YV1LW61J1Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/11/2005",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142459,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BEGIN TO BRAKE AND THE CAR SLOWS, IT WILL SIMPLY CUT OFF.  IT IS GETTING PROGRESSIVELY WORSE AND CUTS OFF ABOUT ONE-HALF THE TIME I BEGIN TO COME TO A COMPLETE STOP.  I HAD THIS SAME PROBLEM SEVERAL YEARS AGO, AND IT REACHED THE POINT WHERE IT STALLED AT AS I WAS DRIVING IN A ROUNDABOUT AT APPROXIMATELY 10 MPH.  I TOOK THE CAR TO MY MECHANIC AND IT WAS REPAIRED.  NOW, HOWEVER, THE STALLING FAILURE IS RECURRING.  ALTHOUGH THE FIELD BELOW REQUIRES A SPECIFIC DATE, THIS PROBLEM IS ONGOING.  *JB",
        "vin": "YV1LW61J1Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/08/2005",
        "dateOfIncident": "10/06/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142220,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER WHILE DRIVING/MULTIPLE TIMES (SOMETIMES WHILE PULLING OUT INTO TRAFFIC).  ENGINE LIGHT CAME ON.  TOOK TO DEALER WHO REPLACED THROTTLE. *JB",
        "vin": "YV1LW61J0Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2005",
        "dateOfIncident": "09/20/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141407,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC THROTTLE CONTROL MODULE IN MY 2000 V70 VOLVO WAGON WAS DEFECTIVE. THE CAR RAN BADLY, MISSED AND STALLED - BRAKES AND TRANSMISSION SHIFTING WAS ALSO AFFECTED. THE SITUATION CONTINUED TO HAPPEN WHILE ON AN EXTENDED TRIP WITH NO VOLVO DEALERS WITHIN RANGE. IT TOOK SEVERAL TRAYS FOR THE DEALER WHERE I PURCHASED THE CAR TO MAKE THE NECESSARY REPAIRS AT A COST OF ABOUT $900.00. I FEEL THAT THE COMPANY SHOULD REIMBURSE ME SINCE I UNDERSTAND THAT THIS SITUATION IS UNDER INVESTIGATION. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/31/2005",
        "dateOfIncident": "10/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141343,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VOLVO  RECENTLY BEGAN TO HAVE PROBLEMS WITH ITS ACCELERATION.  IT WOULDN'T RESPOND AS WELL AND AT TIMES WOULD FEEL LIKE IT LOST POWER.  ON 10/27/05 MY ETS LIGHT CAME ON AND MY MECHANIC TOLD ME IT WOULD COST AROUND 1000$ TO REPLACE MY ELECTRONIC THROTTLE SYSTEM.   *JB",
        "vin": "YV1LW56D6Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/26/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136309,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE VEHICLE STALLED/DIED AND LOST POWER DUE TO ELECTRONIC THROTTLE MODULE FAILURE. *AK  *JB",
        "vin": "YV1LS61J9Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140570,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT'S WIFE HAD THE ELECTRONIC THROTTLE MODULE  (ETM)REPLACED.  THE VEHICLE WOULD SLOW DOWN, ALMOST STALLING, AND THEN THE VEHICLE WOULD SURGE.  THE REPLACEMENT OF THE ETM  REMEDIED THE PROBLEM.*AK  UPDATED 11/29/2005 - *NM",
        "vin": "YV1LZ56D6Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/21/2005",
        "dateOfIncident": "09/10/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140436,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "TOW HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "A MONTH AND A HALF AGO MY 2000 VOLVO V70 THROTTLE HAD TO BE COMPLETELY REPLACED.  AFTER FURTHER RESEARCH I HAVE DETERMINED THIS IS AN MAJOR ON GOING ISSUE.  I AM VERY UPSET I HAD TO SPEND OVER $1100 TO REPLACE THE THROTTLE.  MY CAR ONLY HAD 90,500 MILES WHEN THE THROTTLE FAILED.  *NM",
        "vin": "YV1LW61J8Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "06/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136195,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER SAID  THE  ELECTRONIC THROTTLE CONTROL MODULE (ETCM) ON  2000 VOLVO V70 HAD TO BE  REPLACED. THE DASHBOARD LIGHT KEPT COMING ON AND OFF INTERMITTENTLY. THE VEHICLE STALLED DUE TO ETCM FAILURE. THE DEALER REPLACED THE ETCM.  *AK  *NM",
        "vin": "YV1LW61J8Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "10/12/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132444,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONTACT STATES  HAS A 2000 VOLVO V-70 STATION WAGON. HAD TO REPLACE THE ELECTRONIC THROTTLE MODULE  BECAUSE THE VEHICLE KEPT STALLING.  THE ABS LIGHT AND THE ELECTRONIC THROTTLE MODULE LIGHTS ILLUMINATED ON THE DASHBOARD.  THE CONSUMER STATED AFTER THE VEHICLE WAS SERVICED THE PROBLEM WAS CORRECTED.*AK  *NM",
        "vin": "YV1LW61J9Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "09/02/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133899,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED VEHICLE STALLED/DIED, AND LOST POWER. THROTTLE CONTROL MODULE WAS REPLACED.  *AK  *JB",
        "vin": "YV1LZ56D0Y2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2005",
        "dateOfIncident": "09/28/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138085,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUDDENLY LOSES POWER AT HIGHWAY SPEEDS.  *NM",
        "vin": "YV1LV60D8Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/22/2005",
        "dateOfIncident": "08/08/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137309,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2000 V70 VOLVO'S  ETS SYSTEM BROKE DOWN THIS SUMMER, HAVING BEEN ON THE ROAD FOR APPROX. 5 HRS.  I WAS TRAVELING HOME ON 95 FROM NY, & I WAS ON THE DC BELTWAY (495) WHEN THE INCIDENT OCCURRED.  I WAS IN THE CENTER LANE, GOING WITH THE PACE OF TRAFFIC (OR A LITTLE SLOWER - I HAD MY 23-MONTH-OLD SON IN THE CAR WITH ME), WHEN THE CAR STARTED BUCKLING A LITTLE BIT.  ABOUT .10  MILE LATER, THE CRUISE CONTROL WOULDN'T WORK, & I COULD NO LONGER ACCELERATE.  I WAS QUICKLY DECELERATING FROM 60+ MPH DOWN TO 20.  THE SHOULDERS WERE NOT AVAILABLE TO ME AS THERE WAS CONSTRUCTION ON THE SIDES, BUT I WAS FORTUNATE ENOUGH THAT THE CAR WOULD JUST GO FAST ENOUGH & TRAFFIC  WAS JUST LIGHT ENOUGH THAT I COULD MOVE TO THE CLOSEST EXIT - ABOUT A .5 MILES FROM THE BREAKDOWN.  MY CAR ONLY HAS 75K MILES - NEARLY BRAND NEW FOR A VOLVO - SO YOU CAN IMAGINE MY SHOCK WHEN I FOUND MYSELF BROKEN DOWN IN THE MIDDLE OF DC WITH A 5-YEAR-OLD CAR.  A 107-MILE TOW BACK TO RICHMOND ($300), PLUS THE $1000 FOR THE FIX WHICH INCLUDED THE HEAVILY RECOMMENDED COMPUTER UPGRADE, & I AM STILL LEARY OF THE CAR'S FUTURE PERFORMANCE.  (APPARENTLY THE DEALER KNOWS THAT THIS PROBLEM CAN HAPPEN AGAIN IF YOU DON'T UPGRADE THE COMPUTER SYSTEM).  THIS SITUATION TURNED OUT TO BE A RELATIVELY SAFE ONE FOR MY FAMILY, BUT IT COULD HAVE EASILY TURNED DISASTROUS - IF NOT DEADLY.  I COULD HAVE EASILY BEEN REAR-ENDED BY A FAST-MOVING VEHICLE ON THE BELTWAY SINCE SHOULDERS OF THE ROAD WERE NOT AN OPTION. CARS WERE WHIZZING PAST ME AT 70 MPH - I CANNOT BEAR TO IMAGINE WHAT WOULD HAVE HAPPENED IF IMPACTED AT SUCH HIGH SPEEDS - ESPECIALLY WITH MY SON IN THE CAR.  THIS ETS PROBLEM NEEDS TO BE ADDRESSED IMMEDIATELY - ESPECIALLY SINCE SO MANY PARENTS BOUGHT VOLVOS TO TRANSPORT THEIR PRECIOUS BABIES BASED ON THEIR REPUTATION OF SAFETY.    ALSO:  THE CAR HAD NOT HAD ITS 60K SERVICE AT THE TIME OF THE INCIDENT (COMPLETED MID- AUGUST, AS WELL AS THE 75K SERVICE).  WE ARE THE 3RD OWNER OF THE CAR.  WE BOUGHT AT AUCTION IN PA.  *JB",
        "vin": "YV1LW61J8Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2005",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136169,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: WHILE DRIVING AT 35 MPH VEHICLE STALLED LOST POWER DUE TO THROTTLE BODY FAILURE. DEALER REPLACED THROTTLE BODY.  *AK",
        "vin": "YV1LZ56D4Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/12/2005",
        "dateOfIncident": "09/08/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136292,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT AND ETS WARNING LIGHTS COME ON.  WAS SUPPOSEDLY REPAIRED AT DEALER BUT LIGHTS ARE COMING ON AGAIN.  HAVE READ ON A NUMBER OF FORUMS THAT THE ETS FAILURE CAN CAUSE DANGEROUS DRIVING CONDITIONS...SUDDEN LOSS OF POWER.  IF THIS PROBLEM CAN CAUSE THIS PROBLEM VOLVO SHOULD OFFER A RECALL ON THE DEVICE.  I HAVE ALSO RESEARCHED THAT INCORRECT DIAGNOSTIC SOFTWARE WAS INSTALLED ON SOME MODELS.  *NM",
        "vin": "YV1LW61JXY2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2005",
        "dateOfIncident": "08/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134590,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ETS LIGHT ON MY 2000 VOLVO V-70 CAME ON THE AND THE CAR DROVE VERY ERRATICALLY.   *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "11/16/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133976,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ETM (ETS) ON 2000 YEAR MODEL S70 (V70). UNIT FAILED AFTER MODEST USE (74915 MILES). REPLACED AT COST OF $860.13. THIS APPEARS TO BE A WIDESPREAD PROBLEM, AND THE MANUFACTURER SHOULD OWN UP TO POOR DESIGN. PLEASE FILE COMPLAINT WITH THE MANUFACTURER.",
        "vin": "YV1LW56D3Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "08/21/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133785,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED VEHICLE STALLED/DIED, AND LOST POWER DUE TO THROTTLE BODY FAILURE. *AK",
        "vin": "YV1LW61J6Y2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2005",
        "dateOfIncident": "05/05/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133593,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  2000 VOLVO V70  WHICH  I PURCHASED BRAND NEW BEGAN STALLING EVERY TIME I STARTED TO SLOW DOWN AFTER 3 YEARS OF OWNING IT.  STARTING FEBRUARY 2003 THE VEHICLE WOULD COMPLETELY STALL OR STRUGGLE TO STAY RUNNING.  I REPORTED THE PROBLEM TO ONE OF THE \"AUTHOURIZED\" VOLVO  DEALERS AND SCHEDULED  SERVICE  ON 02/05/03.  AFTER DIAGNOSING THE CAR, THE SERVICE CENTER TOLD ME THERE WAS NOTHING WRONG WITH THE VEHICLE.  AS I WAS LEAVING THE DEALERSHIP THE CAR STALLED  OUT AGAIN.  I RETURNED TO THE SERVICE CENTER AND THEY DIAGNOSED THE PROBLEM AS JUST NEEDING THE THROTTLE BODY CLEANED.  ON 06/19/03  THE PROBLEM STILL  CONTINUED THE VEHICLE WAS  AGAIN DIAGNOSED AS JUST NEEDING TO CLEAN THE THROTTLE BODY OUT.  AGAIN,  WITHIN ONE MONTH  ON 07/07/03, BACK TO THE SERVICE CENTER WITH THE SAME RESULTS.   SEPTEMBER 10, 2003,  THE PROBLEM STILL EXISTED. THE THROTTLE BODY WAS CLEANED AGAIN FOR THE 4TH TIME.  EACH ONE OF THESE APPOINTMENTS COSTING ME TIME, MONEY AND STILL A VOLOVO V70 THAT STILL STALLS.  FINALLY I SCHEDULED ANOTHER SERVICE APPOINTMENT ON  02/27/04 AT ANOTHER \"AUTHORIZED\" VOLVO CENTER( SOUTH SHORE VOLVO)   THEY DIAGNOSED THE PROBLEM AS THE THROTTLE BODY GETTING  OIL IN IT FROM THE BACKED UP BREATHER BOX.  THEIR SOLUTION TO THE PROBLEM WAS TO ALSO CLEAN OUT THE TROTTLE BODY. THIS ATTEMPT AGAIN WAS A FAILURE BECAUSE CURRENTLY,  THE VEHICLE STILL STRUGGLES TO STAY RUNNING OR STALLS EVERY TIME YOU SLOW DOWN.    I DID WRITE TO VOLVO IN APRIL 2004  AND EXPLAINED MY PROBLEM WITH THE CAR AS WELL AS PROVIDED THEM WITH ALL THE DOCUMENTATION OF ALL THE REPAIRS THAT I HAVE INCURRED TO DATE, BUT THEY SUPPLIED NO EXPLANATION NOR RESOLUTION TO THE PROBLEM.   I AM FRUSTRATED AND WOULD LIKE MY VOLVO FIXED AS WELL AS RESTITUTION FOR A TOTAL $1240.98 THAT I HAVE ALREADY INCURRED IN USELESS REPAIR BILLS.  THANK YOU FOR YOUR CONSIDERATION IN AN INVESTIGATION INTO TO THIS MATTER.",
        "vin": "YV1LW61J3Y2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "04/03/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131494,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR COULD BE RUNNING JUST FINE AND ALL OF THE SUDDEN IT WOULD START LURCHING AND THE RPMS WOULD VARY BY AS MUCH AS 500 - 600 RPMS.  WHEN YOU STOPPED THE CAR IT HAD TO BE PLACED IN NEUTRAL TO KEEP IT FROM STALLING-OUT.  AFTER YOU GOT OFF TO THE SIDE OF THE ROAD AND SWITCHED THE CAR OFF AND RESTARTED IT, IT WOULD BE FINE FOR SHORT DISTANCES.  I CHECKED AT AN AFTER MARKET REPAIR SHOP FOR VOLVO'S TO GET AN ESTIMATE OF NECESSARY REPAIRS.  THE MECHANIC KNEW EXACTLY WHAT WAS WRONG WITH THE CAR AS SOON AS I EXPLAINED THE SYMPTOMS TO HIM.  HE SAID WAS THE \"ELECTRONIC THROTTLE BODY MODULE.\"  I ASKED IF WE COULD FIND A USED MODULE.  HE LAUGHED AND STATED THAT THE MODULE HAD TO BE PROGRAM FOR THAT SPECIFIC CAR.  HE STATED IT WAS GENERAL KNOWLEDGE THAT THIS WAS A COMMON PROBLEM OCCURRING ON NUMEROUS 2000 MODELS AND NEWER V70'S AND S70'S.  I TOOK THE CAR TO THE VOLVO DEALERSHIP AND HAD THE MODULE REPLACED FOR A TOTAL COST OF $1036.  ALTHOUGH NO ACCIDENT OCCURRED IN MY CASE, IT COULD HAVE!",
        "vin": "YV1LW61J3Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/21/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130961,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2000 VOLVO V70 STATION WAGON.  WE HAVE EXPERIENCED STALLING IN TRAFFIC, ESPECIALLY FROM IDLE (MADE A LEFT TURN IN INTERSECTION AND ENGINE STALLED AND CUT OUT) AND OTHER STALLING AND IDLING PROBLEMS OVER LAST TWO - THREE YEARS.  WE HAVE TAKEN IT TO OUR DEALERSHIP; THEY HAVE CLEANED OUT THE THROTTLE CONTROL MODULE TWICE AT APPROX. $200 PER TIME; A NEW UNIT COSTS $500; DEALERSHIP BLAMES PROBLEM ON TODAY'S FUEL QUALITY. LAST STALL IN ONGOING TRAFFIC WAS JULY 21, 2005.  *NM",
        "vin": "YV1LW56D3Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "02/14/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130977,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "STALLING IN 2000 VOLVO V70.  SUDDEN LOSS OF POWER AND POWER STEERING ASSIST.  FAILURE CREATED DANGEROUS TRAFFIC OBSTRUCTION AS DISABLED VEHICLE BLOCKED ROADWAY. REPAIRING MECHANIC DIAGNOSED DEFECT IN ELECTRONIC THROTTLE BODY AND STATED THIS IS A WELL-KNOWN PRODUCT DEFECT IN THESE VEHICLES.  *NM",
        "vin": "YV1LW61J4Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/24/2005",
        "dateOfIncident": "07/23/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129855,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ALONG 495 HEADING WEST IN FAST LANE AT ABOUT 65 MPH. ETC LIGHT CAME ON. I STARTED MOVING OVER TO BREAKDOWN LANE AND STOPED. HAD TO PUT THE CAR IN NEUTRAL AS ENGINE WAS SURGING. SHUT OFF ENGINE. LOOKED UP ETC IN MANUAL WHICH SAID \"SHUT OFF ENGINE THEN RESTART. AFTER RESTARTING, ENGINE WAS SURGING. TACHOMETER GOING UP AND DOWN. SWITCHED OFF ENGINE. OPENED HOOD TO LOOK FOR LOOSE WIRE, CONNECTOR OR BLOWN ETC FUSE. SAW NO LOOSE WIRES OR CONNECTORS. IDENTIFIED FUSE. REMOVED FUSE, FUSE LOOKED FINE. REPLACED SAME FUSE. TRIED ENGINE, PROBLEM DISAPEARED!",
        "vin": ""
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119110,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LOCKING MECHANISM  BROKE . REAR LOCKING LIGHT ILLUMINATED, AND  LOCK WAS NOT LOCKING COMPLETELY. CONSUMER CONTACTED THE DEALER. HOWEVER, DEALER DID  NOTHING TO ASSIST THE CONSUMER. RECALL  00V239000 CONCERNING TAILGATE LOCKING MECHANISM WAS ISSUED.  *AK  *SB  *NM",
        "vin": "YV1LW61J5Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/14/2005",
        "dateOfIncident": "07/04/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10110497,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE AIRBAG DID NOT GO OFF BUT THE PASSENGER DID WHEN ANOTHER CAR COLLIDED WITH MINE IN A PRIMARILY FRONTAL IMPACT. A VOLVO REP INVESTIGATED AND FOUND NO FAULT WITH EQUIPMENT.  THE CAR WAS TOTALLED AND UNFORTUNATELY I AM STILL IN PHYSICAL THERAPY.*AK",
        "vin": "YV1LZ56D2Y2"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/21/2005",
        "dateOfIncident": "01/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108623,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS TRAVELING AT 40 MILES PER HOUR WHEN ALL OF A SUDDEN THE ELECTRONIC THROTTLE SYSTEM BROKE CAUSING THE VEHICLE TO SLOW DOWN AND STOP ON ITS OWN. MANUFACTURER WAS CONTACTED BY OWNER.   *NM",
        "vin": "YV1LZ56D6Y2"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "07/19/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083243,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TAILGATE LOCKING MECHANISM WAS DEFECTIVE, IT WILL NOT LOCK PROPERLY.  ALSO, THE INSIDE PANEL WAS FALLING OFF.  CURRENTLY, MANUFACTURER ISSUED  A RECALL.  HOWEVER, THIS VEHICLE WAS NOT INCLUDED DUE TO VIN.   *AK   RECALL#00V239000   *SC  *JB",
        "vin": "YV1LW61J0Y2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/30/2004",
        "dateOfIncident": "08/26/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090043,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THERE WAS A LOUD POPPING NOISE THEN SMOKE STARTED COMING FROM THE REAR OF THE TRUCK. THIS OCCURRED AFTER THE FACTORY SPARE TIRE WAS INSTALLED BY A VOLVO ROAD SIDE ASSISTANCE REPAIR SERVICE.  CONSUMER WASN'T' ABLE TO CONTROL THE VEHICLE, IT FELT LIKE THE TRUCK WAS BEING DRIVEN ON AN UNEVEN PAVEMENT, AND THE SPARE TIRE WASN'T GRIPPING. WHEN THE SERVICE REPRESENTATIVE  WAS CALLED HE INDICATED THAT THIS SIZE TIRE SHOULDN'T BE USED ON THIS TRUCK. THE TRUCK  HAD TO BE TOWED TO THE DEALERSHIP. THE CAUSE OF THE SMOKE HAD YET TO BE DETERMINED.*AK",
        "vin": "YV1LW5548V2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2004",
        "dateOfIncident": "03/12/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086676,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL GATE LATCH FAILS TO SHUT IN COLD WEATHER AND TAILGATE CANNOT BE CLOSED WHILE DRIVING.   MANUFACTURER HAS RECALLED SOME OF THESE VEHICLES, BUT NOT ALL (MY VIN NUMBER NOT INCLUDED AND I'VE NOTED THERE ARE SEVERAL OTHER SIMILAR COMPLAINTS REGARDING THIS ALREADY FILED WITH NHSTA) - RECALL NEEDS TO BE EXPANDED!!!  DEALER REFUSES TO REPAIR.",
        "vin": "YV1LW61J0Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2004",
        "dateOfIncident": "06/10/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10076091,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICE THE ETS INDICATOR LIGHT STAY ON THROUGH OUT TRAVEL, RESULTING VEHICLE HESITATING . CONSUMER WOULD SHUT ENGINE OFF AND RESTART TO TURN ETS INDICATOR LIGHTS OFF.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": "05/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073440,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE UNIT MALFUNCTIONED. AS A RESULT WHEN IDLING ENGINE STALLED. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/26/2004",
        "dateOfIncident": "04/24/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067849,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 2000 MAKE VOLVO V70 ON INTERSTATE AT 65 MPH. ETS AND CHECK ENGINE WARNING LIGHTS COME ON. CAR BEGINS LOSING POWER, CAN'T SLOW DOWN OR SPEED UP. FINALLY STEER TO AN EXIT RAMP; CAR DIES AT BOTTOM OF EXIT RAMP. NO CRASHES, BUT MAJOR TRAFFIC JAMS. CAR COMPLETELY DEAD, NEEDS TO BE TOWED. VIEWING INTERNET FORUMS RE: VOLVO, ETS WARNING LIGHT AND ELECTRONIC THROTTLE SYSTEM (ETS) PROBLEMS ARE A MAJOR OCCURRENCE AND A HUGE SAFETY ISSUE, JUDGING FROM THE MANY CLOSE CALLS I'VE READ ABOUT SIMILAR TO MINE. DEALER REPLACING THE ETS MODULE. DID NOT CARE ABOUT MY SAFETY. THIS IS A HUGE ISSUE THAT VOLVO NEEDS TO DEAL WITH. I AND MY DAUGHTER COULD HAVE BEEN KILLED, AND OTHERS AS WELL. *AK",
        "vin": "YV1LW61J5Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2004",
        "dateOfIncident": "03/01/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065775,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR ONLY STARTS INTERMITTENTLY.  IF I TRY TO START IT AND IT SIMPLY TURNS OVER WITHOUT STARTING, I PULL THE KEY OUT, REINSERT IT, AND TRY AGAIN.  THIS ONE RETRY OFTEN WORKS.  HOWEVER, IF IT DOES NOT, AND I REPEAT THIS PROCEDURE ENOUGH TIMES, THE CAR WILL EVENTUALLY START.  THIS SAME THING HAPPENED DURING THE FIRST YEAR I OWNED THE CAR AND IT WAS REPAIRED BY THE DEALER UNDER WARRANTY.  I WAS TOLD MY \"SMART KEY\" LOST ITS INTELLENGENCE.  I WAS A FEW DAYS OUT OF WARRANTY WHEN I BROUGHT IT BACK TO THE DEALER FOR THE SAME THING, AND WAS TOLD THAT THE PROBLEM COULD NOT BE RECREATED, THEREFORE IT COULD NOT BE DIAGNOSED OR REPAIRED.  I ASKED THEM TO CHECK MY HISTORY, AND WAS TOLD THAT BECAUSE IT COULD NOT BE RECREATED, MY HISTORY DIDN'T MATTER - THAT IT COULD BE SOMETHING ELSE ENTIRELY.*AK",
        "vin": "YV1LW56D8Y2"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": "02/19/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059326,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HAS THE SAME PROBLEM AS STATED IN NHTSA RECALL # 00V239000.  THE RECALL STATES THAT THE TAILGATE LOCKING MECHANISM MAY HAVE BEEN INCORRECTLY MANUFACTURED WHICH, IN COMBINATION WITH COLD TEMPERATURES, COULD CAUSE IMPROPER LOCKING OF THE TAILGATE.  THE CONSUMER WAS INFORMED BY THE DEALER THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO VIN.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "08/15/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070561,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I READ ABOUT YOUR COMPANY IN THIS PAST SUNDAY'S PHILADELPHIA INQUIERER. THE AIR CONDITIONING IN MY VOLVO NO LONGER WORKS, AND I NEEDED TO REPLACE THE THROTTLE BODY CONTROL. THERE ARE TECHNICAL SERVICE BULLETINS ON BOTH OF THESE ITEMS. I HAVE NOT MADE THE AIR CONDITIONING REPAIR YET BECAUSE THE ESTIMATE IS $1600.  I WROTE VOLVO A LETTER ON 5/15/03 ABOUT THE AIR CONDITIONING PROBLEM & ASKED THEM TO CALL ME.  THEY WROTE ME A LETTER DATED 5/19/03 & ESSENTIALLY DENIED ANY RESPONSIBILITY. I REPLIED ON 6/5/03 & AGAIN ASKED THAT THEY CALL ME, BUT THEY DID NOT. I CALLED VOLVO ON 7/8/03 AND THEY SAID THEY WOULD NOT CHANGE THEIR POSITION.  IN LOOKING FOR THE TSBS ON MY AIR CONDITIONING PROBLEM, I ALSO FOUND ONE ON A THROTTLE CONTROL PROBLEM THAT I HAD PREVIOUSLY REPLACED.  THERE WERE DEFINITELY DRIVABILITY PROBLEMS WITH THE THROTTLE BODY BEFORE I HAD THE REPAIR MADE. THE PROBLEM WAS ONCE I STARTED GETTING UP TO AROUND 55-60 MPH, THE DRIVING WOULD HESITATE.  I ORIGINALLY THOUGHT IT MIGHT BE A TRANSMISSION PROBLEM, AS THE PROBLEM DROVE SIMILAR TO A TRANSMISSION &#34;SLIPPING&#34;.  THEY REPLACED THE THROTTLE BODY, NOT CLEANED IT LIKE THE TSB MENTIONS.  MY FEELING IS THAT IF THESE TWO ITEMS ARE DESIGN FLAWS, FOR WHICH THE DESIGN HAS SINCE BEEN CORRECTED, THEN VOLVO SHOULD REPAIR MY VEHICLE REGARDLESS OF THE FACT THAT IT WAS OUT OF WARRANTY.  I BOUGHT MY VOLVO NEW ON 3/16/2000 AND IT CURRENTLY HAS 88,000 MILES.  THE WARRANTY WAS FOR FOUR YEARS/50,000 MILES.",
        "vin": "YV1LS56D4Y2"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070718,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENTIIRE TRANSMISSION FAILED AND HAD TO BE REPLACED BY THE MANUFACTURER. MY TURBO HAS NOW FAILED AND WARRANTY RECENTLY EXPIRED. THE CURRENT QUOTE IS $1000.00 OR MORE TO REPAIR THIS. THE AIRBAG DID NOT DEPLOY ON 2 OCCASIONS WHEN IT SHOULD HAVE. THE DEALERSHIP REFUSED TO CHECK IT BECAUSE IT WAS TOO EXPENSIVE. WHEN I BOUGHT THE CAR AT 7500 MILES, THE ANTENNA MOTOR WAS BROKEN. MY SALESPERSON TOLD ME THEY WOULD REPAIR IT ON MY NEXT SERVICE APPOINTMENT. THIS PROMISE WAS NOT HONORED, THEY LATER CLAIMED THAT WAS MY FAULT AND NOT COVERED UNDER WARRANTY. THIS SEEMS LIKE A LOT OF PROBLEMS FOR A CAR OF THIS CALIBER. I AM EXTREMELY DISSAPPOINTED WITH VOLVO SERVICE AND QUALITY. I HAD A HONDA FOR 7 YEARS AND NEVER HAD PROBLEMS LIKE THESE. I WILL GO BACK TO HONDA NOW.",
        "vin": "YV1LS56D5Y2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016813,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD SEVERAL FAILURES OF THE CHILD RESTRAINT SYSTEM. A SWITCH ON THE SEAT BELT ALLOWS TESION TO REMAIN IN THE LAP SECTION OF THE SEAT BELT. THIS TENSION SECURES CHILD SEATS INTO THE CAR BY PREVENTING MOTION. THE ENTIRE FORCE ON THIS RESTRAINT (IN THE LAP SECTION) IS TRANSFERRED THRU A SMALL SECTION OF PLASTIC WHICH CAN CRACK AND BREAK EASILY. WITHOUT TENSION IN THE LAP SECTION OF THE BELT, CHILD SAFETY SEATS ARE NOT FIRMLY SECURED ALLOWING MOTION SHOULD AN ACCIDENT OCCUR.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/16/2003",
        "dateOfIncident": "03/21/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014477,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT BRAKE CALIPER SEIZED ON MY 2003 VOLVO V70, DEALER REFUSED TO REPAIR UNDER WARRANTY AND REFUSED TO LET ME HAVE SEIZED CALIPER OR EVEN SEE IT.  THE CAR HAD 46882 MILES ON IT.   *NLM",
        "vin": "YV1LW61J4Y2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/03/2003",
        "dateOfIncident": "03/05/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009697,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TAILGATE FAILS TO LATCH/ LOCK IN COLD TEMPERATURES. TAILGATE LIFTS AND DROPS DISTRACTING DRIVER.  *JB",
        "vin": "YV1LW61J0Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/01/2003",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008301,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER FRONT AIRBAG EXPLODED.  CAR WAS IN GARAGE AND STARTED.  MY WIFE REACHED FOR A PAIR OF SUN GLASSES ON THE DASH AND THE AIRBAG DEPLOYED.  *JB",
        "vin": "YV1LW61J1Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/27/2003",
        "dateOfIncident": "01/27/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004750,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT THE SPEED OF 10-15MPH VEHICLE WAS INVOLVED IN A FRONTAL COLLISION, AND ONLY PASSENGER  AIR BAG DEPLOYED.  DEALER AND MANUFACTURER HAS BEEN NOTIFIED. IF YOU HAVE ANY ADDITIONAL INFORMATION  FEEL FREE TO ADD.*AK",
        "vin": "PROVIDE"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2002",
        "dateOfIncident": "08/30/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766451,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FAILURE CAUSED THE CAR TO RAPIDLY LOSE SPEED.  HAD IT HAPPENED DURING HEAVY TRAFFIC AND HIGHER SPEEDS THEN AN ACCIDENT COULD HAVE OCCURRED.  THIS FAILURE SEEMS EXTREMELY PREMATURE FOR THIS TYPE OF PART.  80000 MILES TRANSLATES TO ABOUT 2000 HRS OF OPERATION.  IF THIS IS A NORMAL REPAIR FOR THIS TYPE OF CAR THEN VOLVO HAS A SERIOUS PROBLEM THAT SHOULD BE ADDRESSED.  I WOULD LIKE TO KNOW IF NHTSA HAS ANY INFORMATION ABOUT THIS PART AND ITS FAILURE RATE.*AK",
        "vin": "YV1LZ56D7Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "06/15/2002",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013651,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INSIDE OF THE DRIVEWAY, VEHICLE STARTED SMOKING. VEHICLE WAS ON FIRE.  DEALERSHIP WAS AWARE OF PROBLEM.*AK   TO DATE, THE CAUSE OF FIRE IS STILL UNDETERMINED.  IT APPEARS THE COOLANT OVER FLOW BOTTLE EXPLODED AND SOME HOW SET FIRE TO THE ENGINE.  VOLVO WANTS TO TAKE NO RESPONSIBILITY FOR THE VEHICLE ALTHOUGH IT IS STILL UNDER WARRANTY.  *JG",
        "vin": "YV1LZ56DXY2"
    },
    {
        "components": "EXTERIOR LIGHTING,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/13/2002",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761847,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR IN EARLY JANUARY 2000.  PROBLEMS WITH HOOD LATCH NOT RELEASING.  SERVICING OF VEHICLE THREE TIMES TO RESOLVE AND WILL INTERMITTENTLY CONTINUE.  BOTH TURN SIGNALS FAILED WITHIN FIRST 6 MONTHS OF OWNING CAR.  RECALL WAS IN PLACE BUT DEALER DID NOT REPLACE UNTIL UNITS FAILED.  LATCH ON VEHICLE FAILED WITHIN FIRST WEEK OF OWNERSHIP IN COLD WEATHER.  BROUGHT INTO DEALER THREE TIMES TO RESOLVE.  DID NOT KNOW AT THE TIME THIS WAS A RECALL ISSUE AND DEALER SAID NOTHING WRONG WITH IT.  AFTER THIRD TIME, DEMANDED ACTION AND THEN THEY SAID, \"OH, IT'S ON RECALL\" AND REPLACED LATCH.  PROBLEM WAS WOULD NOT WORK IN COLD WEATHER, WOULD FREEZE UP SO THE LATCH WAS EITHER STUCK WHEN CLOSED OR IF YOU OPENED UP THE REAR DOOR, IT WOULD NOT CLOSE.  NEXT ITEM WAS FUEL VAPOR LEAK INTO CAR.  DEALER FIXED BUT CREATED PROBLEM WITH THE FUEL GAUGE.  GAUGE WOULD NOT INDICATE LESS THAN 6 GALLONS.  RAN OUT OF GAS THREE TIMES BEFORE FIGURING THAT OUT.  DEALER REPLACED PART/ALL OF LINE OR SENSOR IN FUEL SYSTEM.*AK",
        "vin": "YV1LZ56D9Y2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/10/2002",
        "dateOfIncident": "04/09/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007238,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH, SIDEWALL SEPARATED FROM TREAD ON RIGHT REAR TIRE. DEALER CONTACTED MICHELIN, MXV4 TIRE SIZE 195/60R15, DOT FUDA CHYX369 06-51078-01, ORIGINAL EQUIPMENT FOR A VOLVO, V70 ,2000.  *AK  *TT",
        "vin": "YV1LW56D8Y2"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/08/2002",
        "dateOfIncident": "01/09/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005231,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN PARKED AND WITHOUT PRIOR WARNING IT JUMPED OUT OF GEAR AND ROLLED DOWN THE STREET.*AK",
        "vin": "YV1SW58D110"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2002",
        "dateOfIncident": "11/01/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757771,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A FUEL LEAK WHICH THE DEALER FAILED TO REPAIR AFTER REPEATED REPORTS OF THE PROBLEM BEING CORRECTED.  IT WAS NOT UNTILL THE CAR WAS FLAT BEDDED TO THE ORIGINAL DEALER THAT IT WAS FINALLY CORRECTED.  THE FIRE DEPARTMENT DRAINED THE TANK.  I WAS 9 MONTHS PREGNANT AND DRIVING A CAR WITHOUT MY KNOWLEDGE THAT HAD A FUEL LEAK.  *AK",
        "vin": "YV1LZ56D8Y2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/08/2002",
        "dateOfIncident": "12/31/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756562,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT LOWERED TO ALLOW LOADING OF LARGE ITEM. UPON TRYING TO PUT THE SEAT BACK UPRIGHT, THE SEAT BELT RETRACTOR WOULD NOT RELEASE FORCING THE SEAT TO REMAIN IN THE DOWN POSITION UNTIL BROUGHT TO THE DEALER FOR REPAIR. AS A RESULT OF THE FAILURE, I WAS UNABLE TO PROPERLY RE-MOUNT CHILD CAR SEATS.",
        "vin": "YV1LZ56DXY2"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/03/2002",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001399,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "TAILGATE DOOR WILL NOT LOCK PROPERLY, AND IN COLD WEATHER  DOOR ALARM WILL GO OFF BECAUSE THE DOOR IS NOT CLOSED. CONTACTED DEALER, AND  DEALER WAS NOT WILLING TO DO ANYTHING.*AK",
        "vin": "N/A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/26/2001",
        "dateOfIncident": "06/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753707,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM FILING THIS REPORT BECAUSE OF THE CONCERN ABOUT A POTENTIAL SAFETY PROBLEM WITH THE BRAKES.  THE PROBLEM IS INTERMITTENT, HAS BEEN TAKEN BACK TO THE DEALER FIVE TIMES, AND CANNOT BE RESOLVED.  INTERMITTENTLY WHEN APPLYING THE BRAKES THERE IS A CLICKING SOUND AND A STRONG VIBRATION FEELING ON THE BRAKE PEDAL WHEN BRAKING.  THIS CLICKING AND VIBRATION CONTINUES UNTIL THE CAR COMES TO A FULL STOP.  DEALER STATES THAT THIS IS THE ABS AND IS NORMAL FOR THIS CAR.  I DON'T KNOW IF ITS REALLY THE ABS, BUT THE PROBLEM HAPPENS AT LEAST 5-10 TIMES PER WEEK UNDER NORMAL DRIVING CONDITIONS WHEN THE ABS SHOULD NOT ACTIVATE.  THIS IS UNNERVING FOR THE DRIVER AND MAKES US FEEL UNSAFE.  THERE ARE OTHER COMPLAINTS ON YOUR WEBSITE WITH THE SAME SYMPTONS, BUT WHERE THE CAR STALLED OR THE BRAKE PEDAL LOCKED UP.  I'M CONCERNED THAT MY PROBLEM WITH TURN INTO A MORE SERIOUS PROBLEM, BUT THE DEALER SAYS THAT NOTHING IS WRONG.  I'VE RECENTLY FOUND OUT THAT THE BRAKE SYSTEMS AND ABS WERE REDESIGNED IN 2001 AND THIS VIBRATION AND CLICKING PROBLEM WAS RESOLVED IN THE REDESIGN.  ALTHOUGH THE DEALER NOW ADMITS THERE IS A PROBLEM, THEY SAY IT CANNOT BE FIXED.  AS A RESULT, I HAVE A MAJOR SAFETY CONCERN AND DON'T WANT TO DRIVE THIS CAR ANY LONGER.  IT'S ON LEASE AND VOLVO REFUSES TO TERMINATE THE LEASE.*AK",
        "vin": "YV1LW61J6Y2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562707,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING BRAKING, THE ABS SEEMS TO RANDOMLY START FUNCTIONING ON ITS OWN, AS IT WOULD DURING A PANIC STOP, THE BRAKE PEDAL WILL PULSEIN UNISON WITH A MODERATE TAPPING SOUND EMANATING FROM BELOW THE REAR SEAT, THE BRAKES DO NOT PULSE PHYSICALLY, ONLY THE PEDAL PULSE AND THE TAPPING OCCURS, THE DEALER WAS NOTIFIED OF THE PROBLEM AND CONSUMER WAS INFORMED THAT IT WAS A NORMAL FUNCTION OF THE ABS, HOWEVER THE SERVICE MANAGER AGREED THAT THERE WAS A PROBLEM AND THAT VOLVO WAS AWARE OF IT IN A SMALL NUMBER OF OTHER VEHICLES.*JB",
        "vin": "YV1LW61J3Y2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562707,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING BRAKING, THE ABS SEEMS TO RANDOMLY START FUNCTIONING ON ITS OWN, AS IT WOULD DURING A PANIC STOP, THE BRAKE PEDAL WILL PULSEIN UNISON WITH A MODERATE TAPPING SOUND EMANATING FROM BELOW THE REAR SEAT, THE BRAKES DO NOT PULSE PHYSICALLY, ONLY THE PEDAL PULSE AND THE TAPPING OCCURS, THE DEALER WAS NOTIFIED OF THE PROBLEM AND CONSUMER WAS INFORMED THAT IT WAS A NORMAL FUNCTION OF THE ABS, HOWEVER THE SERVICE MANAGER AGREED THAT THERE WAS A PROBLEM AND THAT VOLVO WAS AWARE OF IT IN A SMALL NUMBER OF OTHER VEHICLES.*JB",
        "vin": "YV1LW61J3Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/25/2001",
        "dateOfIncident": "06/06/2001",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 891066,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 15 MPH CONSUMER WAS INVOLVED IN A MINOR COLLISION.   UPON IMPACT,  FRONT OF VEHICLE CAUGHT ON  FIRE, MELTING THE WIRES IN  ENGINE AND ELECTRICAL SYSTEM. AFTER  INSPECTION OF VEHICLE, IT WAS DETERMINED THAT  FIRE STARTED IN  TURN SIGNAL LIGHT.  MANUFACTURER HAS BEEN NOTIFIED. PLEASE PROVIDE ADDITIONAL INFORMATION.   *AK",
        "vin": "YV1LZ56DXY2"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/05/2001",
        "dateOfIncident": "05/02/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744964,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HEADING TO THE COUNTRY ON A 2-HOUR DRIVE AND THE WEATHER WAS HOT ABOVE 80 DEGREES. SO I GUESS YOU CAN SAY THE ENGINE WAS ALSO VERY HOT. I ALSO HAD THE AC GOING WHICH IS A GOOD DESCRIPTION OF THE ENVIRONMENT AT THE TIME OF FAILURE. I WAS ON A NARROW COUNTRY PAVED ROAD TRAVELING ABOUT 25 MPH. I KNOW THIS SPEED TO BE TRUE BECAUSE I WAS IN A DEVELOPMENT WHERE THE SPEED LIMIT IS LOW AND I ALWAYS TRAVEL SLOW IN THE DEVELOPMENT. THERE WAS A PARKED CAR ON THE SIDE OF THE ROAD AND I HAD TO MOVE SLIGHTLY OFF THE PAVED PART OF THE ROAD ONTO A SLIGHT DECLINE UNPAVED PART OF THE ROAD THEN WHEN I PASSED THE VEHICLE TURNED BACK ONTO THE PAVED SURFACE. IN EFFECT AT ON TIME THE DRIVERS SIDE 2 WHEELS WERE ON THE DECLINE UNPAVED ROAD. WHEN I TURNED BACK ONTO THE ROAD THE CAR STALLED AND IT WAS HARD TO STEER BUT THIS WAS NOT A CONCERN BECAUSE I WAS GOING SLOWLY. I TRIED TO RESTART WHICH ANY BODY WOULD DO AND THEN BEGAN TO SMELL A STRONG GASOLINE ODOR.  I POP OPENED THE HOOD BUT DID NOT SEE ANY WRONG BUT DID NOTICE WHAT APPEARED TO BE GASOLINE ON THE FLOOR UNDER THE ENGINE. WITH THE HOOD OPENED I TRIED TO START THE CAR AGAIN AND NOW SAW GASOLINE ALL OVER THE HOT ENGINE. AFTER QUICKLY WIPING THE GAS FROM THE ENGINE I FOUND THE FUEL LINE HAD SEPARATED AND I WAS NOT SURPRISED SINCE THIS WAS A SNAP TOGETHER PART THAT SITS ON TOP OF THE ENGINE.*AK",
        "vin": "YV1LZ56DXY2"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/03/2001",
        "dateOfIncident": "03/27/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743460,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE WEAR OF BRAKE PADS ON REAR AT 13,700 MI.  MANUAL INDICATES 1ST BRAKE INSPECTION DUE AT 15K, REPLACEMENT AT 30K.  SOME PEOPLE HAVE EVEN HAD TO GET ROTORS REPLACED DUE TO THIS.  NOT COVERED UNDER WARRANTY.  HEAD LAMPS HAVE BLOWN TWICE, NOW HAVE UPDATED WIRING KIT IN PLACE.*AK",
        "vin": "YV1VW2550YF"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/10/2001",
        "dateOfIncident": "01/10/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877866,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, MICHELIN MXV4 LEFT REAR TIRE EXPERIENCED SIDEWALL BLOWOUT, THERE WAS NO POTHOLE OR DEBRIS ON ROAD, TIRE WAS REPLACED AT PRORATED COST, TIRE SIZE P195/60R15, DOT FUDACHYX289.   *SLC",
        "vin": "YV1LW61J5Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/05/2001",
        "dateOfIncident": "12/20/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877477,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING IN DRIVEWAY AT ABOUT 10 MP ROAD WAS SLIPPERRY VEHICLE BUMPED INTO A CURB. THIS BROKE FRONT AXLE, THERE WAS NO BODY DAMAGE TO VEHICLE, OIL PAN WAS LEAKING. VOLVO CO. SAID CONSUMER LIED ABOUT ACCIDENT, AND THEY ARE NOT LIABLE.*AK    *JB",
        "vin": "YV1LV60DXY2"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/22/2000",
        "dateOfIncident": "12/09/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738171,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT AXLE SNAPPED UNDER SEEMINGLY NORMAL DRIVING CONDITIONS,20MILES PER HOUR HITTING A CURB.IS THIS COMMONLY SEEN IN VOLVO CARS?IT WOULD SEEM THIS CAR IS DANGEROUS SINCE IT COULD HAPPEN AT HIGHER SPEEDS PRODUCING SERIOUS INJURIES.  *AK",
        "vin": "YV1LV60DXY2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2000",
        "dateOfIncident": "09/15/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 870666,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL  CONTROL SYSTEM CAUSED CAR TO SHUT DOWN.  WHILE SITTING AT A LIGHT ETS LIGHT CAME ON. THEN, WHEN CONSUMER TRIED TO TAKE OFF, CAR WOULD HARDLY MOVE.*AK",
        "vin": "YV1LW56D4Y2"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2000",
        "dateOfIncident": "08/13/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 728609,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY",
        "vin": "YV1LZ56D8Y2"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/23/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 552772,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FEMALE RECEPTACLE FOR THE RIGHT SEAT IS TO THE LEFT OF THE MALE CONNECTOR FOR THE CENTER SEAT SO IF THERE ARE THREE PEOPLE IN THE REAR THE PERSON ON THE RIGHT CANNOT BUCKLE THE SEAT INTO THE FEMALE PART BECAUSE THE STRAP FOR THE CENTER SEAT IS OBSCURING IT.  NLM",
        "vin": "YV1L256D0Y2"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2000",
        "dateOfIncident": "06/09/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 723858,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACTIVATING THE TURN SIGNAL TO INDICATE LEFT OR RIGHT TURN FUSE BLOWS AND  LIGHTS FAIL. AFTER REPLACEMENT OF FUSE, FAILURE RECURS.*AK",
        "vin": "YV1LZ56DXY2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/20/2000",
        "dateOfIncident": "03/13/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 720373,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR WAS DELIVERED WITH AN INCORRECTLY SIZED SPARE TIRE. APPARENTLY (ACCORDING TO THE DEALER) THE TIRE IS SUPPOSED TO BE BIGGER SO THE CAR WILL REMAIN LEVEL AT ALL TIMES. WHEN THE CAR IS NOT LEVEL, THE SELF-LEVELING STRUTS IN THE REAR TRY TO LEVEL THE C",
        "vin": "YV1LZ56D8Y2"
    }
]