[
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/14/2009",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "WORKHORSE CUSTOM CHASSIS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292141,
        "products": [
            {
                "manufacturer": "WORKHORSE CUSTOM CHASSIS",
                "productMake": "WORKHORSE",
                "productModel": "W22",
                "productYear": "2000",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLIANT IS THE SAME AS COMPLAINT # 50901-C. I REQUESTED THAT WORKHORSE REIMBURSE ME FOR MY EXPENSES AND I RECEIVED A LETTER FROM THEM STATING THAT MY COACH DID NOT FALL INTO THE PARAMETER OF THE CAMPAIGN.   THIS COACH HAS THE SAME BRAKING SYSTEM THAT IS ON THE ONES MENTIONED IN THE FILE # 50901-C.  THIS IS WHAT I REPORTED TO WORKHORSE ON 10/26/2009 \"MY WIFE AND I WERE CHECKING OUT CAMPING AREAS IN DEFUNIAK SPRINGS, FL APPROXIMATELY THE FIRST PART OF APRIL 2008. DRIVING DOWN A SMALL INCLINE TO THE PARK I NOTICED THAT THE BRAKES FELT SPONGY AND WOULD NOT STOP THE MOTORHOME NO MATTER HOW MUCH I PRESSED ON THE BRAKES. I PULLED THE PARKING BRAKE AND FINALLY STOPPED BEFORE GOING INTO THE LAKE. I REVERSED UP THE HILL AND DROVE UNTIL I COULD PARK AND ON LEVEL GROUND. UPON CHECKING THE  BRAKE FLUIDS I BURNT MY FINGER TOUCHING THE BRAKE FLUID FILLER CAP. AFTER APPROXIMATELY 45 MINUTES I WAS ABLE TO REMOVE THE CAP AND MOST OF THE FLUID HAD BOILED OUT ALL OVER THE WHEEL WELL ON TO THE TIRE. I REFILLED THE BRAKE FLUID AND DROVE BACK TO MILTON, FL REAL SLOW.    ON 4/17/08 I CALLED CARPENTER'S CAMPERS IN PENSACOLA, FL ABOUT THE BRAKE PROBLEM AND THEY REFERRED ME TO DAVE HOWELL TIRES, INC. I DROVE TO THEIR SHOP FOR AN INSPECTION (INSPECTION FEE $35.00 INVOICE ATTACHED WITH OTHERS) AND THEY SAID THAT THE RIGHT FRONT WHEEL ROTOR HAD CRYSTALLIZED AND THAT THEY OTHERS HAD DAMAGE. AFTER MUCH NEGOTIATION (STARTED AT $3K PLUS) WE SETTLED UPON THE PARTS AND LABOR PERFORMED ON INVOICE ATTACHED IN THE AMOUNT OF $1621.86.    ON THE NEXT TRIP OUT I HAD PROBLEMS WITH THE FRONT TIRES. ON JULY 29, 2008 AND TOOK THE MH TO BEE-LINE IN PENSACOLA TO HAVE IT CHECKED OUT. THEY FOUND THE  SWAY BAR BUSHINGS GONE, AIR BAGS NOTHING BUT RAGS AND THAT THE TIRES HAD DAMAGE FROM THE BRAKE FLUID SPILLING ALL OVER THE PLACE. BEE-LINE REPLACED  SWAY BAR BUSHINGS $119.00 ON 07/29/08 . ADVANCED TIRES REPLACED FRONT TIRES $395.85 ON 07/31/08.  BEE-LINE REPLACED AIR BAGS $499.88 ON 08/01/08. *TR",
        "vin": "5B4LP37J4X3"
    }
]