[
    {
        "components": "STEERING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "02/14/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "Chevy / GM recalled over 100,000 Corvettes built between 1997 and 2004 for a steering column lock issue, that renders the car un drivable. The fuel supply cuts off at 2 miles per hour. Many of the dealers did a faulty job fixing the problem, causing it to recur. My 2001 Corvette (with less than 17,000 miles) repeatedly experiences this problem. GM says they will not warrant this known defective design, due to the recall expiring. According to an internet search on “Corvette Steering Column Lock”, there no telling how many unhappy Corvette owners this has created. Need your help getting this $50,000 car back on the road.",
        "vin": "1G1YY12S915"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/30/2021",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11445659,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "We purchased the car on 12/17/21. I went to Costco on 12/18/21 to get gas. I had a preset amount of $50 to put into the car. When I got to $50 I shut the pump off myself, the tank was not full enough for it to shut off automatically. As I look down on the ground I saw a fluid running out from underneath the car and rolling along the ground. I touched it with my finger and discovered it was gasoline. I put the nozzle back into the holder  and I checked underneath the car and saw it was dripping from the drivers side in the area just behind the drivers door. I pulled the car over to the side to inspect it further. By now the gas had stopped dripping. Since the exhaust pipe is right next to the fuel tank I was afraid of a fire or explosion. Had  some fuel vapors but they dissipated shortly after.  My gas gauge was registering full at this time. Since then I have not had any gasoline leaks and or vapors present. I have not put any more gas in the car since then. (I contacted the previous owner and he said in an email response, if you overfill there is a vent hole that gas will leak out of at the top of the filler neck. It happened once when I put like 20 gallons in it.)  I did some research and found that there is a problem with the Corvette gas tanks and or the crossover tube. I think this is a dangerous situation, thinking that if that gas ignited, the car and my passenger could have caught fire and possibly ignited the Costco gas station with an explosion. (This car will be going into the repair shop in January to have a diagnostic smoke test done to determine where the leak and or leaks are coming from.) I hope the NHTSA recognizes this as a very dangerous situation. All of this will be coming out of my own pocket for the repairs necessary to make this car safe to drive and not be dangerous to myself and family.  I consider this a very serious dangerous situation.",
        "vin": "1G1YY22G515"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2021",
        "dateOfIncident": "10/04/2021",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11437839,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "Have 2001 manual 6 speed corvette. Column  locks up.  Have no way to start car or steer. Worried car will lock up steering column  while driving. Gm says there's no recall on this. Seems  to be a problem on c5 Corvettes.",
        "vin": "1g1yy32g715"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/28/2020",
        "dateOfIncident": "08/18/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11385193,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THAT WHEN THE VEHICLE WAS STARTED, THE STEERING WHEEL CEASED WITH THE SERVICE STEERING COLUMN WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO I.G. BURTON LEWES AUTOMALL (17861 COASTAL HWY, LEWES, DE 19958) WHERE IT WAS DIAGNOSED AND THE MECHANIC DETERMINED THAT THE STEERING COLUMN NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED THREE ADDITIONAL TIMES HOWEVER, THE FAILURE RECURRED. THE CONTACT MENTIONED NHTSA CAMPAIGN NUMBER: 04V060000 (STEERING) AS A POSSIBLE SOLUTION TO THE FAILURE HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND REFERRED THE CONTACT TO THE DEALER FOR THE REPAIR. THE FAILURE MILEAGE WAS APPROXIMATELY 7,000.",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2020",
        "dateOfIncident": "07/24/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11341435,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PULLED OUT INTO TRAFFIC AND ALMOST GOT KILLED! THE CONSOLE LOCK SCREEN CAME ON, AND MY CAR STOPPED AS WELL! THE WHEEL WAS NOT LOCKED. THE CAR THAT WAS SO VERY UNDERSTANDING, SUGGEST I GET A FORD. GM TRULY NEEDS TO RECALL EVERY CAR THEY HAVE TO BE RECALLED FOR THEIR LOYAL CUSTOMERS LIVES. I WILL BE CONTACTING A LAWYER AS WELL! I HAD JUST COME TO A STOP, AND PROCEEDED WITH THE TURN, WITH PLENTY OF DISTANCE HAD THIS FOOLISHNESS NOT HAVE HAPPENED. NOW I SEE THIS IN JUST ABOUT EVERYWHERE ON THIS COMPUTER! FIX THIS IDIOTS AT GENERAL MOTORS!!!",
        "vin": "1G1YY22G015"
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/10/2020",
        "dateOfIncident": "05/08/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11324054,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED THIS 2001 CORVETTE SINCE IT WAS NEW IT HAS LESS THAN 7000 MILES ON IT.ON FRIDAY MAY 8TH 2020 I HAD TO HAVE IT TOWED TO THE DEALER CENTURY CHEVROLET IN BROOMFIELD COLORADO.THE SERVICE COLUMN LOCK IS ON AT THE DASH AND I CANNOT TURN THE STEERING WHEEL AND IF YOU TRY TO DRIVE IT THE VEHICLE WILL STALL.I HAD RECALL 04006 PERFORMED ON THE CAR ON 10/25/2004 WITH 1912 MILES ON IT AND THIS WAS A REPROGRAMMING OF THE PCM.I HAVE SINCE LEARNED THERE HAS BEEN 2-3 UPDATES FOR THIS CONDITION AND THERE IS A RECALL 04006C AND SPECIAL POLICY #05081 FOR A NEW WIRING HARNESS TO BE INSTALLED TO CORRECT THIS CONDITION.I WAS NEVER CONTACTED BY GM ABOUT THIS AND FEEL I SHOULD NOT HAVE TO PAY FOR A DEFECT THEY KNOW ABOUT! THE VEHICLE WAS TOWED OUT OF MY GARAGE /DRIVEWAY WE HAD TO PUSH IT OUT OF THE GARAGE ONTO A TOW TRUCK AND IT IS CURRENTLY AT THE DEALERSHIP WAITING TO HERE WHAT THEY ARE GOING TO DO. I DON'T THINK THEY ARE GOING TO OFFER ANY HELP NOR DID THEY WANT TO PICKUP THE TOW CHARGES AND ADD IT TO THE BILL. REGARDLESS I HAVE TO FIX THE VEHICLE AS IT DOES ME NO GOOD THE WAY IT IS.WITH THIS SAID THE ORIGINAL FIX OF THE RECALL DID NOT FIX THE VEHICLE AND THE NOW KNOWN FIX SHOULD BE DONE AT NO CHARGE TO THE CONSUMER/CUSTOMER.THIS VEHICLE IS IN MINT CONDITION AND HAS NOT BEEN MODIFIED IN ANY WAY AND TAKEN CARE OF LIKE NEW SINCE OWNED. I AM REACHING OUT TO YOU BECAUSE THE RIGHT THING NEEDS TO HAPPEN AND GM SHOULD ACCEPT RESPONSIBILITY FOR THERE ACTIONS AND KNOWINGLY THAT THERE IS A DEFECT. I AM LUCKY I WAS NOT DRIVING THIS VEHICLE AS I WAS PLANNING ON DRIVING THE MORNING THIS HAPPENED AS I COULD OF KILLED MYSELF OR SOMEONE ELSE.",
        "vin": "1G1YY32G215"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/29/2019",
        "dateOfIncident": "11/29/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11282836,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CORVETTE, PASSENGER SIDE FRONT WHEEL HAS AN APPROX 3\" CRACK WHERE THE SPOKE MEETS THE RIM AND RUNS FROM WHERE THE TIRE MOUNTS TO INSIDE THE WHEEL  AFFECTED WHEEL LOSES 20PSI OF AIR PER HOUR.",
        "vin": "1G1YY32G715"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254333,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL NUMBER  04V060000  RECALL DATE  02/09/2004  COMPONENT  STEERING:COLUMN LOCKING:ANTI-THEFT DEVICE  SUMMARY.     STEERING LOCKED  AT EXITING FREEWAY.     THE FUEL SUPPLY SHUT OFF SO THE VEHICLE CANNOT MOVED.  THE VEHICLE CANNOT BE STEERED.",
        "vin": "1G1YY32G715"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/29/2019",
        "dateOfIncident": "10/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11204537,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FILL UP MY GAS TANK THERE ARE STRONG GAS FUMES IN THE GARAGE. THE FUMES ARE NOT THERE WHEN THE TANK IS 3/4 FULL OR LESS. THIS IS A CONTINUING ISSUE.",
        "vin": "1G1YY32G215"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11195338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU FILL UP THE FUEL TANKS YOU GET A VERY STRONG SMELL OF GAS IN THE CAR AS WELL AS IN THE GARAGE. GENERAL MOTORS KNOWS ABOUT THIS COMPLAINT AND WILL HELP THEIR CUSTOMERS. IN FACT THERE IS A CLASS ACTION LAWSUIT AGAINST GM FOR YEAR CORVETTE 2004. IT WILL COST ABOUT $ 2,000.00 TO $ 2,500.00 TO MAKE THE REPAIRS.  A LOT OF TIMES THE RIGHT TANK IS CRACKED OR THE CROSSOVER TUBE IS CRACKED . I HAVE CALLED GM AND ASKED FOR HELP AND THEY WILL NOT ACCEPT THIS AS A WARRANTY ISSUE. THERE ARE MANY COMPLAINTS ABOUT THIS ISSUE . BY THE WAY ALL THE GM DEALERS ARE AWARE OF THE ISSUE.  CAN YOU HELP ME OUT ? YOU SMELL THE FUEL WHEN THE CAR IS STOPPED.",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/17/2018",
        "dateOfIncident": "08/15/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHEN THE CONTACT STARTED THE VEHICLE, THE STEERING COLUMN SEIZED AND THE CHECK STEERING COLUMN WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT TAKEN TO A DEALER TO BE DIAGNOSED OR REPAIRED.  THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME SYMPTOMS AS TSB NUMBER: 04006C. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND ADVISED THE CONTACT TO CALL NHTSA. THE MANUFACTURER PROVIDED CASE NUMBER: 8-4532782724. THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": "1G1YY22G215"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/03/2018",
        "dateOfIncident": "07/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11115611,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE RESTARTING THE ENGINE, A \"SERVICE STEERING COLUMN\" MESSAGE APPEARED AND THE STEERING WHEEL SEIZED. THE VEHICLE WAS TOWED TO THE LOCAL DEALER (DAVE MCDERMOTT CHEVROLET, 655 MAIN ST, EAST HAVEN, CT) WHERE IT WAS DIAGNOSED THAT THE STEERING COLUMN LOCKING MECHANISM FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE CONTINUED. THE VEHICLE WAS TOWED BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING COLUMN ACTUATOR WAS FAULTY. THE VEHICLE WAS REPAIRED AND THE FAILURE WAS REMEDIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 42,996.",
        "vin": "1G1YY32G515"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/17/2018",
        "dateOfIncident": "03/10/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079922,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING FUEL TANK. PARKED VEHICLE IN GARAGE AND NOTICED A FUEL LEAK ON PASSENGER SIDE UNDERNEATH FUEL TANK.",
        "vin": "1G1YY32G315"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/18/2018",
        "dateOfIncident": "02/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11073501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THE CAR I NOTICED THE ANTENNA STOPPED WORKING BUT I HEAR THE MOTOR RUNNING AFTER I TURN THE CAR ON AND OFF . ALSO MY PARK LIGHTS COME ON AND OFF AND KEEPS GOING OUT WITH GOOD FUSES, ALSO MY HORN WON'T BLOW AND IT HAS GOOD FUSES ALSO MY SEAT WILL ONLY MOVE FORWARD AND BACKWARD BUT NOT UP TO GIVE ME HEIGHT THIS IS BOTH IN MOTION AND PARKED",
        "vin": "1G1YY32GX15"
    },
    {
        "components": "STEERING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/28/2017",
        "dateOfIncident": "11/26/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051051,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE STEERING COLUMN LOCKED",
        "vin": "1G1YY12SX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/20/2017",
        "dateOfIncident": "08/15/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL LOCK DOES NOT RELEASE. I BELIEVE THIS WAS ALREADY A RECALL ISSUE",
        "vin": "1G1YY22G215"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2017",
        "dateOfIncident": "06/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE THE VEHICLE WAS IN REVERSE, THE STEERING WHEEL SEIZED AND THE ENGINE STALLED. THERE WERE NO WARNING INDICATORS ILLUMINATED. THE CONTACT CALLED A DEALER (JOHN L SULLIVAN CHEVROLET 350 AUTOMALL DR, ROSEVILLE, CA 95661 (916) 782-1243), BUT THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER STATED THAT NO RECALL WAS ASSOCIATED WITH THE VIN AND DID NOT OFFER ANY ASSISTANCE. THE FAILURE MILEAGE WAS 134,000.",
        "vin": "1G1YY12S915"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/17/2017",
        "dateOfIncident": "05/13/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10986186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING DOWN A BUSY ROAD AND STOPPED AT A TRAFFIC SIGNAL.  AFTER MOVING ABOUT 10' THE CAR STALLED AND THE MALFUNCTION INDICATOR FLASHED \"PULL KEY AND WAIT 10 SECONDS\" THEN \"SERVICE STEERING COLUMN LOCK\".  THIS HAPPENED SEVERAL TIMES BLOCKING TRAFFIC AND CAUSING A SAFETY HAZARD.  SHE WAS ABLE TO GET THE VEHICLE HOME AND IT WORKED FOR A FEW DAYS AND THE SAME THING HAPPENED TO ME WHILE DRIVING IN TRAFFIC, THE CAR STALLED REPEATEDLY FROM A DEAD STOP UPON MOVING ABOUT 10' AND THEN AFTER SEVERAL RESTARTS I WAS ABLE TO GET THE VEHICLE HOME AND HAD IT TOWED TO A CHEVROLET DEALER. THE DEALER CONFIRMED THAT GM HAD PERFORMED RECALLS 04006B AND NO. 04006C ON THIS VEHICLE SEVERAL YEARS AGO TO ADDRESS THE COLUMN LOCK ISSUE AND THAT RECALL INCLUDED REPROGRAMMING THE PCM TO SHUT OFF THE FUEL AT 2MPH - THIS VEHICLE WILL RUN INDEFINITELY SO LONG AS IT ISN'T PUT IN GEAR AND DRIVEN OVER 2MPH.  THE CHEVROLET DEALER INDICATED THAT THIS SAFETY ISSUE ISN'T THEIR CONCERN AND THAT GM EXPECTS IT'S CUSTOMERS TO COVER THE COST - I PHONED GM'S RECALL DEPARTMENT AND TOLD THEM THE SAFETY ISSUE IS RECURRING AND THEY CONFIRMED THAT THEY EXPECT THEIR CUSTOMERS TO COVER THE COST OF THIS SAFETY DEFECT.  I ALSO TOLD GM THAT I INTENDED TO FILE A COMPLAINT WITH THE NHTSA AND BBB IF THEY DIDN'T PROPERLY ADDRESS THIS SAFETY ISSUE AND THEY ENCOURAGED ME TO FILE THOSE COMPLAINTS.    BUYER BEWARE",
        "vin": "1G1YY12S715"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/07/2017",
        "dateOfIncident": "01/12/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10971064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT DOES NOT LOCK,CAN NOT BUY A REPLACEMENT.MFG DOES NOT MAKE THESE ANYMORE WHY?THEY SHOULD MAKE REPLACEMENT PARTS ,THIS IS A SAFETY ISSUE.YOU CANNOT DRIVE CAR WITHOUT SEATBELT!",
        "vin": "1G1YY32G715"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2017",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953687,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GASOLINE SMELL WHEN YOU FILL THE TANK.  IT IS MOST PREVALENT AT REAR PASSAGE SIDE OF THE CAR.  WHEN PARKED IN GARAGE THE GAS SMELL FILLS THE GARAGE.",
        "vin": "1G1YY12S915"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2016",
        "dateOfIncident": "05/14/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864871,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS FUMES AFTER FILLING. FILLS THE GARAGE OVER NIGHT. HAPPENS ALL OF THE TIME.",
        "vin": "1G1YY22G815"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/28/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862112,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2005 MY STEERING COLUMN LOCKED.  THE CAR WAS TOWED TO CHEVROLET DEALERSHIP IN ALEXANDRIA VA. THEY UNLOCKED THE STEERING COLUMN BUT DID NOT REPLACE THE NECESSARY PARTS.  NOW THE COMPUTER READS THAT THE STEERING COLUMN IS GOING TO LOCK AND THE FUEL PUMP SHUTS OFF.  WHEN THE CAR WAS INSPECTED BY WYNNGARDNER  CHEVROLET THEY INFORMED ME THEN WARRANTY HAD BEEN SATISFIED.  IF THE DEFECTED PARTS WERE REPLACED THEY WOULD NOT HAVE TO REPLACE THEN SAID PARTS WERE REPLACED INITIALLY.   THE VEHICLE HAS BEEN INSPECTED AND SAID PARTS ARE NOT THERE.  THE DEALERSHIP USED THE VIN NUMBER IN 2005, NOW WHEN THE VIN NUMBER IS USED, IT SHOWS THAT THE RECALL WAS SATISFIED.  THIS IS NOT THE CASE.",
        "vin": "1G!YY32G215"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "11/05/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE THE VEHICLE WAS IN REVERSE, THE SERVICE COLUMN LOCK WARNING INDICATOR ILLUMINATED AND THE VEHICLE STALLED. THE CONTACT WAS ABLE TO RESTART THE VEHICLE; HOWEVER, THE CONTACT WAS UNABLE TO DRIVE THE VEHICLE. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 04V060000 (STEERING). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 183,000.",
        "vin": "1G1YY22G015"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10782329,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE DRIVING AT AN UNKNOWN SPEED, THE SERVICE STEERING COLUMN LOCK WARNING LIGHT ILLUMINATED. IN ADDITION, THE CONTACT MENTIONED THAT AN ERROR MESSAGE ADVISING TO \"WAIT TEN SECONDS AND PULL KEY\" DISPLAYED ON THE INSTRUMENT PANEL. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING COLUMN LOCK NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE ERROR MESSAGE DISPLAYED AGAIN. THE TECHNICIAN STATED THAT AN UNKNOWN COMPUTER MODULE RELATED TO THE STEERING COLUMN NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 66,000.",
        "vin": "1G1YY12S015"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/10/2015",
        "dateOfIncident": "09/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763006,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 04V060000 (STEERING). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 29,000.",
        "vin": "1G1YY32G515"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "01/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730364,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON FILLING MY FUEL TANK FULL OF GASOLINE, I PARKED THE CAR IN MY GARAGE AND NOTICED A VERY PREDOMINATE FUEL VAPRO SMELL THAT SEEMS TO BE COMING FROM THE DRIVERS SIDE.    THERE NEVER HAS BEEN ANY EVIDENCE OF FUEL LEAKAGE OR POOLING ON THE FLORR BELOW THE CAR.    WHEN I INADVERTENTLY FILL THE FUEL TANK FULL, I HAVE TO TAKE A DRIVE AND PUT ABOUT 30MILES ON THE CAR THEN THE FUEL VAPOR ODOR PROBLEM IS SOLVED    FROM READING THE INTERNET BLOGS, IT WOULD APPEAR THAT I AM NOT ALONE IN THE SYMPTOMS FOR MY CAR",
        "vin": "1G1YY22G615"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/19/2015",
        "dateOfIncident": "06/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726272,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE DRIVING AT APPROXIMATELY 55 MPH, THE STEERING COLUMN LOCK INDICATOR LIGHT ILLUMINATED AND DISPLAY \"SERVICE NEEDED\". THE CONTACT COASTED OVER TO THE SIDE OF THE ROAD. THE CONTACT RESTARTED THE ENGINE, BUT IT FAILED TO START. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND THEN THE VEHICLE WAS TAKEN TO A DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 04V060000 (STEERING). THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 42,000.",
        "vin": "1G1YY12SX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/29/2015",
        "dateOfIncident": "09/06/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10722311,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED AFTER STARTING THE VEHICLE. THE FAILURE RECURRED NUMEROUS TIMES AND WAS TOWED TO THE CONTACT'S RESIDENCE AFTER EACH OCCURRENCE. THE STEERING WHEEL WOULD EVENTUALLY RESET OVER A PERIOD OF TWENTY FOUR HOURS OR GREATER. THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 04V060000 (STEERING); HOWEVER, THE FAILURE PERSISTED AFTER THE REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 3,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/25/2015",
        "dateOfIncident": "02/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690647,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A COMPLAINT ABOUT SEATBELTS IN RECENT (2000) CAR MODELS. I'VE RIDDEN IN CHEVROLET, CHRYSLER, FORD AND GMC VEHICLES AND ALL THESE VEHICLES (AT LEAST IN THE FRONT SEATS) HAVE RETRACTABLE SHOULDER HARNESSES. THESE HARNESSES KEEP RETRACTING WHEN YOU HAVE THEM ON AS YOU ARE DRIVING. SINCE I AM ONLY 5 FEET TALL, THE HARNESS CHOKES ME. ON MOST OCCASIONS WHEN THIS HAPPENS, I CAN SLIDE THE HARNESS OVER MY HEAD AND ONLY BE BELTED IN WITH THE SEATBELT UNTIL I CAN EITHER PULL OVER SAFELY TO FIX IT OR AM AT A STOP LIGHT OR SIGN AND CAN FIX IT. TO FIX THE STRANGULATION OF THE HARNESS, I HAVE UNHOOK THE WHOLE HARNESS AND LET IT TOTALLY RETRACT, THEN PULL IT OUT TO WHERE I CAN KEEP MY HAND ON IT SO IT DOESN'T KEEP GETTING TIGHTER OR USE A CLIP TO TRY TO KEEP IT FROM TIGHTENING ON ME. THE CLIPS ARE WINGED PAPER CLIPS, SO THEY DON'T ALWAYS HOLD. MY ISSUE IS THAT AS I'M DRIVING, I'M BEING STRANGLED BY THE HARNESSES IN THESE VEHICLES. PLEASE, CAN YOU START LEGISLATION TO PREVENT RETRACTABLE HARNESSES OR MAKE IT THAT THE RETRACTION IS CONTROLLED BY THE RIDER? THANK YOU.   *JS",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2015",
        "dateOfIncident": "02/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10684025,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD 1/2 TANK OF GAS, GAUGE SUDDENLY  DROPPED TO ZERO, ENGINE CUT OUT. ABS TRACTION CONTROL  WORKS WHEN IT WANTS TO OR DOESN'T.  *TR",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2015",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WELL MY 2001 CORVETTE GOT THE DREADED \"SERVICE COLUMN LOCK\" MESSAGE AFTER SITTING FOR A WHILE DURING MY SUMMER VACATION.  THE BATTERY DIED AND I REPLACED THE BATTERY WITH FACTORY/GM RECOMMENDATION CCA AND SIZING. AFTER CHANGING THE BATTERY I FIRST GOT THE \"PULL KEY WAIT 10 SEC\" MESSAGE, THEN AFTER DOING AS TOLD, \"SERVICE COLUMN LOCK\" CAME ONTO THE DISPLAY.  THE STEERING WHEEL WAS STILL EASILY TUNABLE, SO THIS VETTE MUST HAVE HAD THE RECALL SERVICE DONE BY ITS PREVIOUS OWNER; HOWEVER THE DIGITAL WARNING OR DISPLAY CONTINUES TO SHOW AND WHEN I PRESS CLEAR DISPLAY, IT IS REMOVED.  I HAVE CHECKED WITH A NUMBER OF CORVETTE OWNERS, AND AFTER HEARING FROM A COUPLE GUYS ON CORVETTEFORUM THAT THE ISSUE COULD CONTINUE AND CAUSE MAJOR ISSUES WITH ACCELERATION, ETC...  A DEVICE NAMED THE LMC5 FROM COMPLIANCEPARTS.COM IS A FIX AND POSSIBLY THE WAY TO GO, I HAVE NOT DECIDED TO GIVE IT A SHOT AS I BELIEVE THIS IS A MANUFACTURE ISSUE AND SHOULD BE ADDRESSED THROUGH GM.  IF I PLACE THIS DEVICE INTO THE SYSTEM, WHAT OTHER ISSUES WOULD I FACE, AND NONE OF THE OTHER OWNERS KNEW THE ANSWER AND ALL AGREED THAT THIS COULD CREATE OTHER ISSUES.  I ASK THAT YOU HAVE GM FIX THIS ISSUE BASED ON A RECALL.   *TR",
        "vin": "1G1YY22G615"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/22/2014",
        "dateOfIncident": "11/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660262,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED THE VEHICLE, IN THE DISPLAY PANEL WERE THE WORDS, \"STEERING COLUMN LOCKED.\" ALTHOUGH THE VEHICLE WAS RUNNING, THE STEERING COLUMN WAS IN FACT LOCKED. RESTARTED VEHICLE AND THE DISPLAY READ...\"SERVICE COLUMN LOCKED\" HOWEVER THIS WAS NOT THE CASE. THE STEERING WHEEL MOVED FREELY. THE PROBLEM NOW IS; THE STEERING WHEEL WILL NOT LOCK WHEN THE IGNITION IS TURNED OFF. MY CONCERN IS...CAN THE STEERING WHEEL LOCK WHEN THE VEHICLE IS IN MOTION?  *TR",
        "vin": "1G1YY12S215"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": true,
        "dateComplaintFiled": "08/01/2014",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10618184,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THAT WHILE REVERSING AT LOW SPEEDS MOVING, THE STEERING WHEEL SEIZED AND THE ENGINE STALLED CAUSING THE CONTACT TO CRASH INTO A TRAILER. THE FRONT PASSENGER SUFFERED INJURIES TO THE RIGHT ARM. THE DRIVER'S SEAT MOVED OUT OF POSITION AND CAUSED THE CONTACT TO HIT THE STEERING WHEEL. THE VEHICLE WAS TOWED TO A SPECIALIZED MECHANIC, WHO PERFORMED A DIAGNOSTIC AND LOCATED THE FAILURE AT THE IGNITION SWITCH. ADDITIONALLY, THE DRIVER'S SEAT RAIL MOUNTING WAS FRACTURED TO DUE TO DEFECTIVE METAL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "1G1YY22G715"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2014",
        "dateOfIncident": "07/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611310,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STOPPED RUNNING ON INTERSTATE AT 70 MPH , LOST ALL POWER. HAPPEN 3 TIMES ON A 700 MILE TRIP HOME FROM BUSINESS TRIP.  *TR",
        "vin": "1G1YY32G815"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "06/16/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE.  THE CONTACT STATED THAT THE STEERING WHEEL SEIZED AND THE KEY WAS ABLE TO BE REMOVED FROM THE IGNITION.  THE DEALER STATED THAT THE LOCK PLATE AND MOTOR NEEDED TO BE REPLACED.  THE VEHICLE WAS REPAIRED AND THE MANUFACTURER WAS NOTIFIED.  THE FAILURE MILEAGE WAS 40,000.",
        "vin": "1G1YY12S315"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "06/27/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606460,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKS OBSERVED ON REAR WHEEL AT POINT WHERE SPOKE MEETS RIM.  *TR",
        "vin": "1G1YY32GX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/12/2014",
        "dateOfIncident": "03/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587785,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE  CONTACT OWNS A 2001 CHEVROLET COREVETTE. HE STATED THAT AFTER THE REPAIR FOR RECALL NHTSA CAMPAIGN NUMBER: 04V060000 COMPONENT(S): STEERING. THE FAILURE REOCCURED AND THE DEALER HAD TO REPROGRAM THE ELECTRONIC LOCK WIRING HARNESS AND LOCK KIT WERE REPLACED. THE SECOND REMEDY HAS CEASED THE FAILURE FROM HAPPENING. SR",
        "vin": "1G1YY12S515"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/01/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585936,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST YEAR AND HALF I HAVEN'T DRIVEN MY CORVETTE MUCH DUE TO STEERING WHEEL MODULE INFLATABLE COVER BEING STICKY. ONCE YOU TOUCH IT WITH YOUR FINGER ITS ATTACHES TO THE STEERING WHEEL COVER.  I WENT TO MY LOCAL CHEVROLET DEALER TO SEE WHAT COULD BE DONE. NOT A THING. HIS REMARK WAS THIS IS (PART OF LIVING IN FLORIDA) IF YOU THINK YOU HAVE PROBLEMS YOU SHOULD HEAR HOW MANY COMPLAINTS WE GET ON OUR TRUCK STEERING WHEELS.  THIS IS A SAFETY ISSUE AND SHOULD BE A RECALL SINCE IT INVOLVES STEERING THE VEHICLE AND INFLATABLE AIR RESTRAINT. THE VEHICLE HAS 39,135 MILES. I HAVE THE SAME PROBLEM WITH MY 2006 SRX CADILLAC.  *TR",
        "vin": "1G1YY22G315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "07/04/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576784,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF THIS VEHICLE PURCHASED IN 2001 WHEN I WAS LEAVING IN TORONTO-CANADA AND MOVED TO WASHINGTON STATE IN 2011 (CAR WAS LEGALLY IMPORTED AND REGISTERED IN USA). IN JULY 2012 THE STEERING WHEEL/COLUMN LOCKED AS I WAS PULLING OUT (WITH THE CAR IN MOTION) OF A PARKING SPOT RENDERING THE CAR NOT DRIVABLE.   THE CAR WAS TOWED TO THE LOCAL DEALERSHIP AND I PAID FOR REPAIRS TO BE DONE TO REPLACE THE LOCKING MECHANISM OF THE STEERING COLUMN. AT THE SAME TIME I CONTACTED NUMEROUS TIMES G.M. CUSTOMER SERVICE AND ASKED THEM TO AUTHORIZED THE WORK UNDER RECALL NUMBER 4006C ISSUED IN FEB 08 2006 (REMOVE THE LOCKING MECHANISM), HOWEVER GM FAILED TO TAKE RESPONSIBILITY TO ASSURE THAT THIS LATEST  RECALL IS PROVIDED TO MY VEHICLE. THEIR ARGUMENT WAS THAT ALL WORK DONE IN CANADA ON THIS ISSUE HAD BEEN PERFORMED (ALTHOUGH THE CANADIAN RECALL NOTICE RESOLUTION IS DIFFERENT THAN THE USA RECALL RESOLUTION AND UNDER CANADIAN RECALL NOTICE THE LOCKING MECHANISM IS NOT REMOVED, JUST A WIRE HARNESS IS BEEN REPLACED)    SINCE THIS REPAIR WAS PERFORMED I AM DRIVING JUST A FEW SHORT TRIPS BACK AND FORTH FROM THE OFFICE AND NOT AT ALL ON THE HIGHWAY AS I AM AFRAID BECAUSE THE THEFT DETERRENT SYSTEM IS STILL IN OPERATION, MEANING THE STEERING COLUMN MAY LOCK WHEN DRIVING AND CRASH ( HIS IS FROM GM'S OWN SERVICE RECALL NUMBER 4006C).  *TR",
        "vin": "1G1YY32GX15"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/25/2014",
        "dateOfIncident": "05/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE OFTEN WOULD NOT START.  THEN THE NEXT MORNING IT WOULD START FINE.  OCCASIONALLY IT WOULD SHUT OFF WHILE DRIVING - TURNING OFF ALL POWER.  IT HAPPENED ONCE AT 70 MPH: THE CAR LOST ALL POWER, AND ONLY BY THE GRACE OF GOD WAS I ABLE TO RESTART IT AND REGAIN CONTROL.  EVENTUALLY IT WOULD NOT START AT ALL, AND I FINALLY HAD TO HAVE IT TOWED TO THE DEALERSHIP.  IT TOOK TWO WEEKS FOR THEM TO DETERMINE IT WAS THE IGNITION SWITCH SHUTTING OFF ALL POWER TO THE ENGINE, AND CHARGED ME $520 TO REPLACE IT. THEY TOLD ME TO REMOVE THE CAR KEY FROM MY KEYRING AND KEEP IT SEPARATE BECAUSE IT WAS CAUSING A PROBLEM WITH THE SWITCH.  I WOULD LIKE TO RECOVER THE MONEY THAT THIS COST ME SINCE WE CAN NOW SEE IT IS RELATED TO THE PERVASIVE IGNITION SWITCH RECALL.  I HAVE ASKED THEM AND THEY HAVE REFUSED.  *TR",
        "vin": "1G1YY22G115"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/21/2014",
        "dateOfIncident": "04/17/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574039,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2001 CORVETTE WITH MY WIFE FROM HENDRICK CHEVROLET.  THE STEERING WHEEL LOCKED AS I WAS PULLING OUT OF A PARKING SPOT RENDERING THE CAR NOT DRIVABLE.  I WAS A CAR SALESMAN AT THE TIME AND HAD GOTTEN A TEXT FROM MY WIFE TO HURRY HOME ABOUT SOMETHING URGENT.  AS I PULLED OUT IN REVERSE I ADJUSTED THE STEERING WHEEL DOWN AND STARTED BACKING UP ALL AT THE SAME TIME VERY FAST AND THE STEERING WHEEL LOCKED.  I CALLED HENDRICK CHEVROLET AND TOLD THEM OF THE INCIDENT.  I AM A MANUFACTURING ENGINEER IN THE AUTOMOTIVE INDUSTRY THAT DEALS WITH TIER1 AND TIER 2 SUPPLIERS FOR GM.  I KNOW THEIR QUALITY STANDARDS AND THIS I TOLD THEM WAS GOING TO KILL SOMEONE IF NOT ADDRESSED PROPERLY WITH AN 8D  A CORRECTIVE ACTION REPORT AND AN UPDATE TO THE PFMEA AND DFMEA CONTROL PLANS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/12/2014",
        "dateOfIncident": "04/17/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED WHILE DRIVING 45 MPH UP A HILL, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT HE HAD TO SHAKE THE KEY IN ORDER FOR THE VEHICLE TO START. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THE IGNITION SWITCH NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 45,000. THE VIN WAS UNAVAILABLE.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2013",
        "dateOfIncident": "05/25/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS A 2001 CHEVROLET CORVETTE. UPON DRIVING THE STEERING COLUMN LOCKED PREVENTING THE CAR FROM BEING CONTROLLED AT SPEED. AFTER RESEARCHING THE ISSUE AND INVESTIGATING THE MATTER WITH CHEVROLET CUSTOMER SERVICE I FOUND THAT THIS STEERING LOCK ANTITHEFT DEVICE WAS FOUND TO BE DANGEROUS AS I DESCRIBED. THE NHTSA FORCED GM TO RECALL VEHICLES, MINE IN 2003, RECALL NUMBER 4006. SUBSEQUENTLY GM CONCLUDED THAT THIS RECALL WAS NOT EFFECTIVE AND ISSUED TWO MORE RECALLS HOWEVER CUSTOMERS WERE NEVER NOTIFIED BY MAIL. RECALL NUMBER 4006C ISSUED IN FEB 08 2006 SUPERSEDES ALL PREVIOUS RECALLS INSTRUCTING DEALERS AND SERVICE TECHNICIANS TO REMOVE THE LOCKING MECHANISM. HOWEVER GM FAILS TO TAKE RESPONSIBILITY TO ASSURE THAT THIS LATTER RECALL IS PROVIDED TO MY VEHICLE. AFTER NUMEROUS CALLS TO CUSTOMER SERVICE 866 790 5700 THEY WILL NOT AUTHORIZE REPAIR OF MY VEHICLE. AFTER $1700 OUT OF POCKET EXPENSES MY CAR IS STILL IN A SITUATION THAT THE STEERING COLUMN CAN LOCK WHILE BEING DRIVEN AND GM FAILS TO RESPOND. I HAVE BEEN BOUNCED AROUND TO 8 TO 9 REPRESENTATIVES IN CUSTOMER SERVICE FROM PERU , TEXAS AND DETROIT ALL WITH NO ACTION. ALL OWNERS OF 1999 TO 2004 CORVETTES WHOSE THEFT DETERRENT SYSTEM IS STILL IN OPERATION, MEANING THE STEERING COLUMN LOCKS WHEN THE KEY IS REMOVED SHOULD BE AWARE THAT THE CAR MAY LOCK WHEN DRIVING AND CRASH. THIS IS FROM GM'S OWN SERVICE RECALL NUMBER 4006C. THESE VEHICLE SHOULD NOT BE DRIVEN.  *TR",
        "vin": "1G1YY22G315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/24/2013",
        "dateOfIncident": "03/20/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED WITHOUT WARNING. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND LATER TAKEN TO THE DEALER WHERE THE VEHICLE WAS SERVICED UNDER NHTSA CAMPAIGN NUMBER: 04V060000 (STEERING) BUT TO NO AVAIL. THE FAILURE PERSISTED AND THE VEHICLE WAS NOT FURTHER REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 42,000.    UPDATED 6/21/13 *CN UPDATED 07/18/2013 *JS",
        "vin": "1G1YY12S815"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/27/2012",
        "dateOfIncident": "08/25/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472580,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THAT THE FRONT PASSENGER'S SIDE SEAT BELT WEBBING FAILED TO RETRACT WHICH PREVENTED HIM FROM PROPERLY LOCKING THE SEAT BELT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 64,600.",
        "vin": "1G1YY32G515"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "07/21/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466997,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE COUPE. THE CONTACT STATED THAT THE VEHICLE STARTED BUT THE STEERING WHEEL FAILED TO UNLOCK.  THE VEHICLE WAS SERVICED THREE YEARS PRIOR TO THE FAILURE UNDER NHTSA CAMPAIGN ID NUMBER: 04V060000 (STEERING:COLUMN LOCKING:ANTI-THEFT DEVICE).THE VEHICLE WAS NOT TOWED TO THE DEALER. THE MANUFACTURER WAS CONTACTED BUT THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 42,000.",
        "vin": "1G1YY22G615"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "04/14/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455564,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 46,920  MILES ON MY 2001 CORVETTE I REPORTED TO GM ON 4/14/2012 THAT I NOTICED  CRACKS IN 2 OF 5 SPOKES ON THE RIGHT REAR WHEEL OF THIS CAR. THIS IS A QF5 POLISHED ALUM 5 THIN SPOKED WHEEL. GM DIRECTED ME TO HAVE AN AUTHORIZED DEALER TO INSPECT THE CONCERN. I DID THAT AND THE ANSWER FROM THE GM DEALER WAS \" THERE IS A PROBLEM HOWEVER THERE IS NOTHING WE ARE GOING TO DO FOR YOU OTHER THAN SALE YOU A NEW WHEEL\". I ASKED THE DEALER IF THIS CAR WAS SAFE TO DRIVE AND THEIR COMMENT WAS THAT THEY HAVE NO WAY OF KNOWING HOW DEEP THE CRACKS WERE SO THEY WERE NO COMMITTAL AS TO MY QUESTION. MY GM COMPLAINT FILE NUMBER IS [XXX] INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)      *JS",
        "vin": "1G1YY32G315"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2012",
        "dateOfIncident": "01/04/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448899,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THE FUEL TANK WOULD LEAK AND EXHIBITED GASOLINE FUMES INSIDE THE VEHICLE. THE VEHICLE WAS REPAIRED ONE YEAR PRIOR TO THE MOST RECENT FAILURE WHERE THE DEALER SEALED THE FUEL TANK TO STOP THE LEAK BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN TO THE DEALER TO HAVE THE FUEL SENDING UNIT AND PUMP SEAL REPLACED A SECOND TIME. THE VIN WAS NOT AVAILABLE. THE FAILURE AND THE CURRENT MILEAGES WERE 55,000.",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/12/2012",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10447678,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST INCIDENT HAPPENED A COUPLE YEARS AGO.  NOW AGAIN, I THOUGHT THAT I HAD A FLAT TIRE BUT ACTUALLY, MY CAR'S RIM CRACKED AND ALL THE AIR LEAKED OUT.  DOES CHEVROLET DO SOMETHING ABOUT THIS?  I HAVEN'T DRIVEN OVER ANY BAD POTHOLES... JUST ALL OF A SUDDEN, WHEEL CRACKS...  *TR",
        "vin": "1G1YY22G915"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/29/2011",
        "dateOfIncident": "04/15/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANKS LEAKING FROM THE TOP",
        "vin": "1G1YY32G115"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2011",
        "dateOfIncident": "11/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404767,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TOPPED OFF GAS TANK AND DETECTED STRONG GASOLINE ODOR WITHIN VEHICLE. PARKED CAR IN GARAGE AND STRONG GASOLINE ODOR EMANATING FROM REAR HALF OF VEHICLE. UNABLE TO DETECT ANY GASOLINE LEAKS FROM VEHICLE ON THE FLOOR OR VISIBLE PARTS OF THE UNDERSIDE OF THE VEHICLE. OPENED GARAGE DOORS TO VENT OUT THE FUMES. FUMES DISSIPATED AFTER SEVERAL HOURS.  I NO LONGER TOP OFF THE TANK IN AN EFFORT TO AVOID A POTENTIALLY VOLATILE SITUATION. ORIGINAL OWNER REPORTED FUEL TANK RELATED PROBLEMS AROUND 15,000 MILES BUT REFUSED TO FILL UP THE TANK DURING SERVICE AT DEALERSHIP.",
        "vin": "1G1YY22G015"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2011",
        "dateOfIncident": "04/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK LEAK RIGHT SIDE TOP OF TANK.  *TR",
        "vin": "1G1YY22G615"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2011",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE/CRACKED RIGHT FUEL TANK (WHERE FUEL PUMP CONNECTED TO FUEL TANK). STRONG FUEL SMELL NOTICED THIS PAST SUMMER, WHILE PARKED IN HOME GARAGE - SMELL WOULD ONLY BE NOTICEABLE AFTER TANK WAS FILLED. TANK REPLACED BY CARR CRAFT, INC., OF PORTAGE, MI., WITH 'ORIGINAL EQUIPMENT' TANK FROM CHEVROLET. CAR OWNER CALLED CHEVROLET CUSTOMER SERVICE AND DELIVERED TANK TO KRUM/COLE CHEVROLET DEALERSHIP IN VICKSBURG, MI FOR INSPECTION AND CONFIRMATION OF CRACK (AT REQUEST OF CHEVROLET CUSTOMER SERVICE). CHEVROLET SERVICE REPRESENTATIVE ADVISED THAT IT WAS DUE TO \"NORMAL WEAR AND TEAR\", RATHER THAN A MANUFACTURING ISSUE AND WOULD NOT CONSIDER COMPENSATION FOR REPLACEMENT OF THE TANK. VEHICLE HAS NEVER BEEN IN ANY KIND OF ACCIDENT AND IS OWNED BY ORIGINAL PURCHASER.",
        "vin": "1G1YY32G515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/27/2011",
        "dateOfIncident": "03/16/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393024,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAK AT THE FUEL TANK.  *TR",
        "vin": "1G1YY22G615"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/30/2010",
        "dateOfIncident": "10/28/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363001,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 CORVETTE THAT HAS LEAKED GAS FROM AROUND THE GAS TANK AREA AT THE REAR OF THE CAR.  I HAVE READ NUMEROUS COMPLAINTS ONLINE THAT OTHER CORVETTES OF THAT ERA ALSO HAVE FAULTY FUEL COMPONENTS THAT LEAK.  WHAT IS MY RECOURSE? *TR",
        "vin": "1G1YY32G915"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/22/2010",
        "dateOfIncident": "10/22/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE STEEL PROD. CO.",
                "productMake": "FIRESTONE",
                "productModel": "FIRESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2001 CHEVROLET CORVETTE. CONSUMER WRITES REGARDING FRAUDULENT PRACTICES OF WHEEL DISTRIBUTOR *TGW  THE CONSUMER AND HER HUSBAND PURCHASED A SET OF FIRESTONE TIRES AND WHEELS AS A PACKAGE DEAL FOR A VEHICLE THAT WAS TO BE USED ON A RACE TRACK.  THE SET WERE MOUNTED AND BALANCED.  HOWEVER, WHEN THEY ARRIVED AT THEIR DESTINATION, THEY DISCOVERED ONE OF THE NEW TIRES WERE FLAT. ONCE THE TIRE WAS REMOVED FROM THE RIM, IT WAS DISCOVERED THAT THE BEAD HAD BEEN CUT. WHEN THEY ARRIVED AT THE SHOP THE NEXT MORNING, IT WAS ALSO DISCOVERED THE TIRE HAD NOT BEEN BALANCED EITHER AS ORIGINALLY THOUGHT.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2010",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351262,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC BRAKE CONTROL MODULE (EBCM) CONTROLS FAILED ON A 2001 CORVETTE WITH 37,000 MILES.  TO CORRECT THIS MODULE, THE GM DEALER WILL CHARGE $1250 FOR THE REPLACEMENT PART AND 2.5 HOURS LABOR OR ABOUT $300 FOR A TOTAL OF $1650. *TR",
        "vin": "1G1YY22G615"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/19/2010",
        "dateOfIncident": "06/28/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE WITH 35,000 MILES. THE PREVIOUS OWNER HAD RECALL 04V060000 STEERING:COLUMN LOCKING:ANTI-THEFT DEVICE PERFORMED ON HIS VEHICLE. THE PROBLEM HAS NOW RECURRED. THE DEALER WAS CONTACTED ABOUT THE FAILURE  AND  TOLD THE CONTACT TO BRING THE VEHICLE IN. THE DEALER TOLD THE CONTACT THAT HE WOULD HAVE TO PAY FOR THE FAILURE. THE CONTACT IS UNABLE TO DRIVE THE VEHICLE. WHEN STARTING OR DRIVING THE VEHICLE A MESSAGE WOULD DISPLAY\" SERVICE ACTIVE HANDLING\". WHEN THIS HAPPENED THE BRAKES WOULD AUTOMATICALLY ENGAGE. THE FAILURE WAS IDENTICAL TO RECALL 10V172000 STEERING: COLUMN. THE VEHICLE WAS ALSO TAKEN TO THE DEALER FOR WATER LEAKING INTO THE TRUNK. THE CONTACT FOUND RECALL 09V491000 STRUCTURE:BODY:ROOF AND PILLARS CAUSED THE FAILURE TO OCCUR. THE CONTACT ALSO HAS PICTURES OF THE FAILURE. THE DEALER WOULD NOT REPAIR THE VEHICLE.",
        "vin": "1G1YY12S015"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/24/2010",
        "dateOfIncident": "06/22/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 CHEVROLET CORVETTE. WHILE REVERSING  AT APPROXIMATELY 1 MPH, THE STEERING WHEEL LOCKED FOLLOWED BY THE ILLUMINATION OF THE POWER STEERING WARNING LIGHT. THE VEHICLE SUDDENLY STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE HOWEVER, THE VEHICLE STALLED WITHIN SECONDS OF RESTARTING. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE CONTACT WAS ABLE TO LOCATE NHTSA RECALL CAMPAIGN ID NUMBER: 04V060000 (STEERING: COLUMN LOCKING: ANTI-THEFT DEVICE) HOWEVER, THE MANUFACTURER ADVISED HIS VIN WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 31,000.          UPDATED 2/22/11 *CN    UPDATED 05/23/11*JB",
        "vin": "1G1YY32G725"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2010",
        "dateOfIncident": "05/17/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CORVETTE GAS TANK ODOR.  I READ THAT YOU HAVE OPENED A CASE ON THE 2004 CORVETTES.  MY 2001 IS IDENTICAL TO THE 2004 MODEL AND HAS THE EXACT SAME PROBLEM.  IF THE GAS TANK IS FILLED FULL, A VERY BAD GASOLINE ODOR IS PRESENT.  THE ODOR GOES AWAY AS THE GAS TANK EMPTIES. *TR",
        "vin": "1G1YY12S715"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2010",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326892,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2004 MY 2001 CHEVY CORVETTE WAS RECALLED DUE TO DEFECTS WHICH COULD CAUSE THE STEERING COLUMN TO LOCK UP WHILE DRIVING.  I TOOK THE CAR IN FOR THE RECALLS AND WAS TOLD THE RECALLS WERE ACCOMPLISHED, BUT I DISCOVERED IN APRIL, 2010 THAT THE RECALLS HAD NOT BEEN ACCOMPLISHED.  THE STEERING COLUMN OF THE CAR LOCKED UP WHILE BEING DRIVEN ON OR ABOUT APRIL 6, 2010.  THE DEALER WHO CLAIMED TO HAVE ACCOMPLISHED THE RECALLS LIED AND PUT MY LIFE AND OTHER'S LIVES IN JEOPARDY.  I DEMAND THAT ACTION BE TAKEN AGAINST THE DEALER AND AGAINST GM FOR THIS INTENTIONAL DISREGARD FOR HUMAN LIFE! *TR",
        "vin": "1G1YY32GX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/16/2010",
        "dateOfIncident": "04/14/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC COLUMN LOCK SYSTEM FAILURE.  I GOT THE FAMOUS, \"PULL KEY WAIT 10 SECOND\" MESSAGE AND THEN THE COLUMN LOCKED.  I LOOKED IT UP ON WWW.CORVETTEFORUM.COM AND FOUND A BUNCH OF INFORMATION REGARDING THIS ISSUE. APPARENTLY THIS IS BY FAR THE MOST COMMON SAFETY ISSUE WITH ANY C5 CORVETTE.  AFTER UNHOOKING THE BATTERY AND SHAKING THE STEERING WHEEL VIGOROUSLY, I GOT THE STEERING WHEEL TO UNLOCK.  I CALLED THE LOCAL DEALERSHIP (HENDRICK DURHAM AUTO MALL)  AND EXPLAINED WHAT WAS GOING ON.  THEY TOLD ME I HAD ALREADY HAD THE RECALL PERFORMED IN 2005.  I INFORMED THEM THAT THERE WAS ANOTHER RECALL THAT WAS RELEASED IN 2006 THAT REMOVES THE LOCKING PLATE FROM THE STEERING COLUMN.  THEY FOUND THE RECALL THAT I WAS REFERRING TO AND AGREED TO TAKE A LOOK AT MY CAR.  I DROPPED IT OFF AT THE DEALERSHIP AND WAS TOLD THAT THE RECALL HAD EXPIRED AND NEEDED TO PAY THE DEALERSHIP TO PERFORM THE RECALL.  I WAS NEVER INFORMED OF THIS RECALL, I FOUND IT ON THE INTERNET AND INFORMED THE DEALERSHIP.  THE RECALL I HAD WAS 04006B, AND THE NEWEST RECALL WAS 04006C.  IT LOOKS LIKE IN ORDER FOR ANYONE TO GET THE RECALL PERFORMED THEIR STEERING WHEEL HAD TO LOCK UP FROM 2006-2008 AND TO TAKE IT TO A DEALERSHIP TO GET THE RECALL DONE, OR PAY THE DEALERSHIP TO DO IT.  IT SEEMS LIKE JUST ABOUT EVERY C5 CORVETTE OWNER HAS TO DEAL WITH THIS DEFECTIVE STEERING COLUMN SYSTEM SOONER OR LATER. THERE'S EVEN AFTERMARKET PRODUCTS THAT ARE AVAILABLE TO TRY AND REMEDY THIS PROBLEM SINCE GM CAN'T SEEM TO. *TR",
        "vin": "1G1YY22G315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/31/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323301,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE DRIVING APPROXIMATELY 55 MPH, THE STEERING COLUMN LOCK INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT CALLED THE DEALER WHO INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN RECALL 04V060000 (STEERING COLUMN LOCKING, ANTI-THEFT DEVICE). THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 64,000.",
        "vin": "1G1YY32GX15"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2010",
        "dateOfIncident": "11/30/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311069,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK LEAKS WHEN FILLED TO THE NORMAL CUTOFF POINT WHEN FILLING. THERE WAS NO EVENT LEADING TO THE FAILURE, IT OCCURS WHEN THE FUEL TANK IS FILLED. THE FUEL TANK NEEDS TO BE REPLACED TO CORRECT THE DEFECTIVE FUEL TANKS. GM/CHEVY DOES NOT STAND BEHIND THE DEFECTIVE TANKS AND THE COSTS ARE BORN BY THE OWNER. GM DID NOT RESPOND TO THE ISSUE WHILE IT WAS UNDER EITHER THE VEHICLE'S EXTENDED GMPP WARRANTY NOR THE EMISSIONS WARRANTY, BOTH NOW JUST EXPIRED. *TR",
        "vin": "1G1YY32G115"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2009",
        "dateOfIncident": "09/24/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IMMEDIATELY AFTER GAS FILL-UPS, CAR AND GARAGE SMELLS OF GASOLINE. CONTINUES TO SMELL  UNTIL APPROXIMATELY 50 MILES ARE REGISTERED ON VEHICLE. HAS BEEN A CONSTANT PROBLEM SINCE PURCHASE OF PRE-OWNED  2001 VEHICLE IN SEPTEMBER OF 2007 FROM GM DEALERSHIP.  *TR",
        "vin": "1G1YY32G515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2009",
        "dateOfIncident": "12/02/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKY GAS TANK OR CROSS OVER. WHEN TANK IS FILLED GAS LEAKS  AND FUMES CAN BE SMELLED FOR DAYS. *TR",
        "vin": "1G1YY12SX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/02/2009",
        "dateOfIncident": "09/26/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE DRIVING APPROXIMATELY 2 MPH IN REVERSE, THE \"STEERING ANTI-THEFT\" WARNING LIGHT INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. WITHIN MINUTES, THE STEERING WHEEL LOCKED; ALTHOUGH, THE STEERING SYSTEM WAS LOCKED THE VEHICLE WAS OPERATIONAL. THE CONTACT SHUT THE ENGINE OFF AND NOTIFIED AN THE DEALER AND MANUFACTURER OF THE FAILURES; HOWEVER, THERE WERE NO RESOLUTIONS. NHTSA CAMPAIGN ID NUMBER  04V060000 (STEERING;COLUMN LOCKING;ANTI-THEFT DEVICE) REPAIR WAS PERFORMED AND THE RECALL REMEDY WAS INSUFFICIENT. THE VEHICLE HAS NOT BEEN REPAIRED. THE CONTACT HAD CONCERNS OF THE SAFETY RISK INVOLVED. THE FAILURE AND CURRENT MILEAGES WERE 42,000.",
        "vin": "1G1YY12SX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/09/2009",
        "dateOfIncident": "09/09/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. WHILE ATTEMPTING TO DRIVE THE VEHICLE HE NOTICED THAT THE STEERING WHEEL LOCKED; HOWEVER, THE CONTACT WAS ABLE TO CONTINUE OPERATING THE VEHICLE.   THE DEALER INFORMED THE CONTACT THAT THE COLUMN LOCK NEEDED TO BE REPLACED. THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 80000.",
        "vin": "1G1YY22G815"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/11/2008",
        "dateOfIncident": "11/08/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248470,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CORVETTE MANUAL TRANSMISSION--HAD CAMPAIGN 004006 DONE FOR COLUMN LOCKING PROBLEM JAN 06--ONE MONTH LATER, THE SERVICE PROCEDURE FOR MANUAL TRANSMISSION CARS WAS CHANGED, AND THE NEW PROCEDURE NOT OFFERED TO ME/NEW INFORMATION NOT GIVEN TO ME.  NOW NOV '08, COLUMN LOCKING PROBLEM RETURNS,  AND DEALERSHIP IN SCOTTSDALE WILL NOT PERFORM THE NEWER RECALL PROCEDURE UNTIL THEY \"FIND OUT WHAT'S WRONG WITH IT THIS TIME\"  THAT IS NOT APPROPRIATE. *TR",
        "vin": "1G1YY32G515"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/21/2008",
        "dateOfIncident": "10/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246198,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE.  THE CONTACT STARTED THE IGNITION AND NOTICED THAT THE STEERING COLUMN LOCKED WITHOUT WARNING.  THE STEERING COLUMN  FAILED TO UNLOCK.  THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER RECALL FOR THE SAME FAILURE.  THE NHTSA CAMPAIGN ID NUMBER WAS UNKNOWN.  THE VEHICLE IS CURRENTLY INOPERABLE AND HAS NOT BEEN REPAIRED.  THE RECALL REMEDY HAS NOT CORRECTED THE SAFETY DEFECT.  THE MANUFACTURER WAS NOTIFIED.  THE VIN WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE 30,000.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/12/2008",
        "dateOfIncident": "08/08/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241955,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE TIRES IN QUESTION WHERE PURCHASE IN JULY 2007. APPROXIMATE MILEAGE SINCE INSTALLATION 2200. TRAVELING WEST ON I80/94 IN NORTHERN INDIANA 3 MILES THIS SIDE OF ILLINOIS STATE LINE. I NOTICE AFTER PASSING EXIT 3/CLINE AVENUE, THAT THE ROAD WAY STARTED TO SOUND LIKE A \"BUCK BOARD\" ROAD SURFACE. SINCE I WAS IN THE FAR LANE I STARTED TO MOVE OVER TO EXIT ONTO KENNEDY AVE OFF RAMP AND DROVE INTO A PARKING LOT AND STEPPED OUT TO SEE WHAT WAS GOING ON . I IMMEDIATELY NOTICED THAT THE \"LEFT REAR TIRE\" ON MY CORVETTE SEEMED LIKE IT WAS GOING FLAT. I SAW A SERVICE STATION UP THE STREET SO I DECIDED TO SEE IF I COULD DRIVE TO IT AND SEE IF ANYONE MIGHT BE ABLE TO OFFER US ASSISTANCE. AS IT WAS THEY COULDN'T. I LOOKED AT THE TIRE AGAIN AND FELT THERE WAS ENOUGH AIR IN THE TIRE TO GET US TO A DEALERSHIP OR TIRE STORE. WHILE WAITING FOR THE LIGHT TO CHANGE AT THE INTERSECTION UPON EXITING THE SERVICE STATION WE HEARD A LOUD \"BANG\". I DROVE INTO A PARKING LOT ACROSS FROM THE SERVICE STATION AND PARKED THE CAR. IT WAS NOW AROUND 5:00PM. THE YOUNG WAS JUST GETTING OFF WORK FROM  HIS JOB WITH \"BERTS TOWING, INC\". THE HAD HIM TOW THE VEHICLE TO MY LOCAL CHEVROLET DEALERSHIP 'BILL JACOBS\" IN THE JOILIET IL. THE DEALERSHIP GOT THE CAR INTO THEIR BODY SHOP AND \"NOTICE\" THAT THE \"INSIDE\" SIDE WALL HAD SEPARATED' WHICH CASED THE TIRE TO CRACK THE WHEEL. FOR HE NEXT THREE WEEKS THE DEALERSHIP TRIED TO GET A REPLACEMENT WHEEL, BUT COULDN'T FIND ONE SO WE PURCHASED A  WHEEL SO I COULD MOVED THE CAR THE BILL AT THIS POINT WAS AROUND $950.00 DOLLARS PLUS IT WOULD COST AN ADDITIONAL $1212.00 FOR A NEW WHEEL FROM GM FOR A TOTAL AROUND $2150.00.  I CONTACTED BRIDGESTONE/FIRESTONE ON SEPTEMBER 8TH WITH THEIR CLAIM REPORT NO. 842571. YESTERDAY I RECEIVED A LETTER REF. NO. 919077 THEY REJECTED THE CLAIM DO TO \"THIS TIRE WAS OPERATED FOR AN UNKNOWN PERIOD OF TIME WITH INSUFFICIENT AIR PRESSURE. WAS I SUPPOSE TO STOP THE VEHICLE IN THE MIDDLE OF THE HIGHWAY AND WHICH COULD CAUSE AN ACCIDENT. *TR",
        "vin": "1G1YY22G315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/08/2008",
        "dateOfIncident": "09/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241337,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE.  AFTER DRIVING THE VEHICLE APPROXIMATELY 5 MPH INTO THE GARAGE AND SHUTTING OFF AND RESTARTING IT, THE STEERING WHEEL LOCKED.  THE WARNING LIGHT MESSAGE READ, \"PULL KEY WAIT 10 SECONDS\" FOLLOWED BY \"SERVICE COLUMN LOCKED\".  THE VEHICLE RESTARTED AND SHIFTED INTO GEAR; HOWEVER, THE STEERING WHEEL REMAINED LOCKED.  DURING A SCHEDULED APPOINTMENT WITH THE DEALER ON SEPTEMBER 3, 2008, THE CONTACT WAS ABLE TO DRIVE THE VEHICLE, BUT THE STEERING LOCKED AFTER DRIVING HOME.  THE DEALER STATED AT THE APPOINTMENT THAT THERE WAS A $135 DIAGNOSTIC FEE.  GM ADVISED THE CONTACT TO PAY THE FEE AND THEY WOULD NOTIFY HER IF THERE WAS A $100 DEDUCTIBLE OR A 50/50 SPLIT.  THE MANUFACTURER ALSO STATED THAT THE RECALL REPAIR RELATED TO THE STEERING WAS PERFORMED.  WHEN CONFIRMING THE DATE THAT THE RECALL WAS PERFORMED, THE MANUFACTURER STATED THAT THE RECALL WAS NOT PERFORMED AND THAT THE STEERING COLUMN WAS REPLACED ON APRIL 23, 2002.  THE CONTACT HAS PHOTOS, WHICH INDICATE THE WARNING LIGHT MESSAGES ON THE INSTRUMENT PANEL.  THE APPROXIMATE CURRENT AND FAILURE MILEAGES WERE 85,000.",
        "vin": "1G1YY32G415"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,SERVICE BRAKES, ELECTRIC,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/04/2008",
        "dateOfIncident": "09/10/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240953,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CORVETTE. 2 YEARS AGO   (1)ENGINE CHECK LIGHT ALWAYS ON  (2)TRACTION CONTROL  WARNING LIGHTS ON   (3)ABS WARNING LIGHTS ON  (4)LOW FUEL WARNING LIGHT GOES ON IF UNDER 1/2 TANK AND GAUGE DROPS TO ZERO FUEL  (5)DRIVER SIDE HEADLIGHT WILL NOT OPEN UP  (6)LIGHTS DO NOT WORK ON HEATING ,A/C DIRECTIONAL FLOW    THESE COMPLAINTS FROM WHAT I HAVE READ ON BLOG SITES FROM HUNDREDS OF OTHER CORVETTE OWNERS ARE VERY COMMONPLACE  PROBLEM LIES IN THE FACT THAT WHEN MY WARNING LIGHTS ARE LIT UP I HAVE NO ANTILOCK BRAKES WORKING ON MY CAR NOR DO I HAVE TRACTION CONTROL. THIS IS EXTREMELY DANGEROUS. SOME TIME THE LIGHTS WORK SOMETIMES THEY GO OFF WELL I AM IN MOTION. THIS CAN CAUSE A DANGEROUS SITUATION IF I AM JUST HITTING THROTTLE AND THIS OCCURS CAUSING ME TO LOSE CONTROL AND RISKING A COLLISION. THESE ARE POWERFUL CARS EVEN WHEN DRIVEN IN A SAFE MANNER. I OWN AN AUTOMATIC TRANSMISSION AND IT DOES NOT TAKE MUCH THROTTLE FOR THE ENGINE TO GEAR DOWN AND ACCELERATE. I STOP AT GEN. MOTORS DEALER FREQUENTLY HOPING FOR A CAMPAIGN. TO CORRECT THIS PROBLEM. THE SAME STORY ALWAYS IS THAT IT IS A DEFECTIVE COMPUTER BOARD AND THAT I AM LOOKING AT APPROX $4000.00 DOLLARS TO REPAIR. READING BLOG SITE IT IS THE SAME.  SOME WOULD SAY THAT IF ONE CAN AFFORD A CORVETTE THEN THIS SHOULD NOT BE AN ISSUE. I SAY IT IS A SERIOUS SAFETY ISSUE AND SHOULD NOT HAVE TO PAY OUT OF POCKET. AM ONLY AN EMPLOYEE AT A DAYCARE AND SAVED FOR YEARS TO PURCHASE THIS CAR. THE OTHER COMMON COMPLAINT IS THE FUEL GAUGE BUT UNDERSTAND THAT WITH COMPUTER BOARD REPLACED THIS WILL ELIMINATE PROBLEM. POP UP HEADLIGHT COST  TO REPAIR $300.00.  *TR",
        "vin": "1G1YY22G615"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "07/28/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236868,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL LOCKED PERMANENT.  *TR",
        "vin": "1G1YY22G915"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/27/2008",
        "dateOfIncident": "06/25/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232500,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GOT OFF WORK AND TRY TO TURN THE CAR TO GO HOME BUT THE STEERING WHEEL WOULDN'T UNLOCK AND A MESSAGE POPPED SAYING \"SERVICE STEERING COLUMN LOCK\", THE CAR HAS BEEN SITTING AT WORK EVER SINCE. CONTACT THE CHEVY DEALERSHIP CLOSES AND THEY SAID THAT THE VIN NUMBER WAS NOT ASSOCIATED WITH ANY RECALL, ALTHOUGH MY CAR APPEAR TO FALL UNDER RECALL # 04V06000",
        "vin": "1G1YY12S415"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/13/2008",
        "dateOfIncident": "06/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE.  WHILE DRIVING AT ANY SPEED, THE STEERING COLUMN LOCKED, EVEN WHILE THE KEY WAS IN THE IGNITION.  THE CONTACT PLACED THE VEHICLE INTO DRIVE AND BEGAN TO ACCELERATE, BUT THE STEERING COLUMN REMAINED LOCKED.  THE VEHICLE WAS TOWED.  SHE CALLED THE DEALER AND MANUFACTURER AND WAS INFORMED THAT THE RECALL INVOLVING HER VEHICLE EXPIRED ON FEBRUARY 29, 2008.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT MILEAGE WAS 60,000 AND FAILURE MILEAGE WAS 59,990.",
        "vin": "1G1YY22G615"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/04/2008",
        "dateOfIncident": "10/04/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229901,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE. THE CONTACT STATED THAT THE ABS LIGHT ILLUMINATES INTERMITTENTLY. HE TOOK THE CAR INTO THE DEALERSHIPS THEY COULD DIAGNOSE A PROBLEM ON THE VEHICLE. HE HAS BEEN EXPERIENCING THIS FAILURE SINCE THE PURCHASE OF THE VEHICLE. THE FAILURE MILEAGE WAS 5,000. THE CURRENT MILEAGE WAS 52,000.(SC)",
        "vin": "1G1YY22G215"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/13/2008",
        "dateOfIncident": "05/10/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227566,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FLAT TIRE, CRACKED RIM CAUSED TIRE TO LOSE ALL AIR WHILE PARKED, NO ABUSE RIM CRACKED DUE TO FAULTY CASTING,IF FAILURE WERE TO OCCUR COULD CAUSE SERIOUS INJURY OR DEATH. REPLACED RIM AT MY EXPENSE BECAUSE WARRANTY EXPIRED AND GM WOULD NOT OFFER REPLACEMENT.  *TR",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/24/2008",
        "dateOfIncident": "04/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225552,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 CORVETTE RIGHT REAR WHEEL CRACKED WHILE I WAS DRIVING DOWN THE HIGHWAY AT ABOUT 75 MILES PER HOUR. I LOST MOST OF THE AIR BY THE TIME I STOPPED. I HAD THE TIRE CHECKED FOR LEAKS AND NO LEAKS WERE FOUND ON THE TIRE. I HAD THE WHEEL CHECKED AND A CRACK WAS FOUND AROUND THE SPOKE TO THE OUTER EDGE OF THE WHEEL.  *TR",
        "vin": "1G1YY22G615"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "03/02/2008",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON A LONG DISTANCE TRIP FROM ARIZONA TO TEXAS, A 2001 CHEVROLET CORVETTE EXPERIENCED A FATIGUE ON A WELD HOLDING THE REAR UPPER SUSPENSION ARM TO THE BODY OF THE VEHICLE.  THE RESULTANT FAILURE CAUSED THE CAR TO VEER OUT OF CONTROL WITHOUT WARNING AT 70 MPH. *TR",
        "vin": "2G1FP22K4T2"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/25/2007",
        "dateOfIncident": "11/23/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "UNTIL JUST NOW 11-24-2007  DID  I REALIZE MY CAR HAD A  RECALL THAT I NEVER RECEIVED ANY NOTIFICATION ABOUT FOR MY 2001 CORVETTE.  NHTSA CAMPAIGN ID NUMBER 04V060000 FOR STEERING: COLUMN LOCKING:ANTI-THEFT DEVICE.    IS THIS SOMETHING I SHOULD BE CONCERNED ABOUT?  *TR",
        "vin": "1G1YY22G315"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/26/2007",
        "dateOfIncident": "07/13/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE.  TWO MONTHS AGO, THE ABS TRACTION CONTROL SYSTEM LIGHT ILLUMINATED ON THE INSTRUMENT PANEL.  THE OWNER'S MANUAL STATED THAT THE LIGHT WOULD ILLUMINATE INTERMITTENTLY, HOWEVER, IT SHOULD DIM WHEN THE VEHICLE WAS SHUT OFF AND RESTARTED.  APPROXIMATELY ONE WEEK AGO, THE CONTACT NOTICED THAT THE LIGHT REMAINED ILLUMINATED.  HE TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT THERE WAS INTERNAL FAILURE WITH THE ABS AND BRAKE MODULES.  THEY ALSO STATED THAT THE ABS WAS NOT WORKING.  THE MANUFACTURER STATED THAT THEY WOULD NOT REPAIR THE VEHICLE FOR FREE BECAUSE IT WAS NOT UNDER WARRANTY.  THE CURRENT MILEAGE WAS 24,277 AND FAILURE MILEAGE WAS 24,200.",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/17/2007",
        "dateOfIncident": "08/16/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN SIGNAL STOPS WORKING WHILE VEHICLE IS IN MOTION.  THIS HAS HAPPENED MULTIPLE TIMES OVER THE LAST YEAR I HAVE OWNED THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "08/02/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198862,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 CHEVROLET CORVETTE.  WHILE DRIVING 15 MPH, THE HARD TOP FLEW OFF THE VEHICLE.  THE TOP SLID DOWN A HILL AND THE SAFETY BAR CRACKED.  THE CONTACT HAS BEEN UNABLE TO LOCATE A NEW OR USED TOP ANYWHERE.  THE PURCHASE DATE AND POWERTRAIN WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 23,755.    UPDATED 02-01-08 *BF  UPDATED 02/01/08  *TR",
        "vin": "1G1YY22G315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2007",
        "dateOfIncident": "07/24/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WITH MANY OTHER C-5 CORVETTE OWNERS I HAVE HAD AN EXPERIENCE CONCERNING MY STEERING COLUMN TO LOCK UP AND THUS MAKE IT IMPOSSIBLE TO DRIVE THE CAR. I HAD RECEIVED A BULLETIN ABOUT THIS ISSUE A COUPLE OF YEARS AGO AND EVEN THOUGH I HAD NOT YET HAD THE ISSUE I TOOK THE CAR IN AND HAD THE SUPPOSED REQUIRED FIX. HOWEVER A FEW DAYS AGO WHILE BACKING OUT OF MY DRIVE WAY THE COLUMN LOCKED UP AND NO MATTER WHAT I DID I COULD NOT GET IT TO UNLOCK. I CALLED THE DEALER ABOUT THE ISSUE AND HAD TO HAVE THE CAR TOWED IN UPON THEIR RECOMMENDATION, DUE TO THE FACT THAT EVEN IF I GOT IT UNLOCKED IT COULD POTENTIALLY LOCK UP AGAIN EVEN WHILE I WAS DRIVING DOWN THE ROAD. IT HAS BECOME EVIDENT TO ME AT THIS POINT AFTER RESEARCHING THIS ISSUE ONLINE AS WELL AS REFERRING BACK TO MY ORIGINAL BULLETIN THAT THIS IS WITHOUT A DOUBT A CHEVROLET'S MANUFACTURING DEFECT. HOWEVER WHEN I CALLED CHEVROLET THEY BASICALLY SAID TOUGH COOKIES AND REALLY DID NOT GIVE A YOU KNOW WHAT. THE DEALERS FIX AS THEY INFORMED ME COMES STRAIGHT FROM GENERAL MOTORS IS TO JUST DELETE THE LOCKING MECHANISMS THUS RENDERING PART OF THE ANTI-THEFT SYSTEM MUTE. I HAVE TALKED WITH MANY CORVETTE SPECIALISTS ABOUT THIS SITUATION AND IT DEFINITELY IS A PROBLEM, NO MATTER WHAT CHEVROLET TRIES TO SAY. AND THE FACT THAT THEIR FIX IS TO BYPASS THE SYSTEM INSTEAD OF FIXING THE PARTS INVOLVED PRETTY MUCH TELLS YOU THAT THEY HAVE A PROBLEM. EVEN WITH ALL THIS THEY ARE GOING TO MAKE ME PAY FOR THIS ISSUE. I HAVE CONTACTED AN ATTORNEY AND AM LOOKING AT ALL MY OPTIONS, HOWEVER AT THIS POINT I HAVE NO CHOICE BUT TO SHELL OUT THE 450 TO 650 BUCKS IT IS GOING TO COST ME TO FIX GM'S SCREW UP.*JB",
        "vin": "1G1YY12S615"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/31/2007",
        "dateOfIncident": "05/12/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192201,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CHASSIS SUSPENSION MOUNT FAILURE (UPPER CONTROL ARM BREAKS FROM CHASSIS). THIS APPEARS TO BE AS A RESULT OF IMPROPER WELD PENETRATION WHEN THE CHASSIS WAS FIRST ASSEMBLED. THE WEAK WELD EVENTUALLY LET GO. I HAVE THE SAME CONDITION AS OCCURRED ON OTHER VEHICLES, SUCH AS THIS ONE HERE: HTTP://FORUMS.CORVETTEFORUM.COM/SHOWTHREAD.PHP?T=262516&PAGE=1  THIS IS A SERIOUS FAILURE, WHICH COULD RESULT IN TOTAL LOSS OF CONTROL OF THE VEHICLE. *TR",
        "vin": "1G1YY22G215"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/17/2007",
        "dateOfIncident": "05/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191078,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CHEVROLET CORVETTE COUPE  WITH 50,000 MILES SERVICE ABS, ACTIVE HANDLING AND TRACTION CONTROL WARNING APPEARED  INTERMITTENTLY, ABOUT 6 TIMES IN THE LAST 3 MONTHS. LONGEST IT STAYED THAT WAY WAS FOR A WEEK. ABS, TRACTION CONTROL AND ACTIVE HANDLING  WERE DISABLED WHICH I BELIEVE  WAS A SERIOUS SAFETY ISSUE. IT COULD HAPPEN JUST BEFORE OR DURING AN EMERGENCY SITUATION. MANY OTHER OWNERS OF THIS MODEL  HAD THE SAME PROBLEM - SEE CORVETTE FORUMS.*AK",
        "vin": "1G1YY22G815"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/03/2007",
        "dateOfIncident": "05/02/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC BRAKE CONTROL MODULE (EBCM) FAILURE.  MUST REPLACE MODULE.  THERE SEEMS TO  BE MANY PEOPLE WITH MY SAME PROBLEM.  GO TO WWW.CORVETTEFORUM.COM AND SEARCH \"EBCM FAILURE\"  AND YOU WILL SEE THE LIST OF PEOPLE WITH MY SAME ISSUE. *TR",
        "vin": "1G1YY22G215"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/26/2007",
        "dateOfIncident": "04/14/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188906,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 CORVETTE, WHILE GETTING THE TIRES REPLACED THE DEALERSHIP TOLD ME ONE OF THE RIMS SPOKES HAS A CRACK IN IT AND SHOULD BE REPLACED.  THIS CRACK (WHICH IS COMMON IN THESE CARS) COULD BREAK THE RIM APART AND CAUSE A HORRIBLE ACCIDENT. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2007",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184973,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT CALLED REGARDING THE  2001 CHEVROLET CORVETTE Z06.  THE CONTACT  HEARD A  NOISE IN THE REAR OF THE VEHICLE.  THE CONTACT TOOK THE VEHICLE TO A REPAIR SHOP.  THE MECHANIC DIAGNOSED THAT THE REAR WHEEL BEARING NEEDED TO BE REPLACED.  THE CONTACT HAS THE FAULTY PART.  THE  FAILURE MILEAGE 11,000.  THE CONTACT HAS THE REPAIR INVOICE.  *AK  UPDATED 05/04/07. *JB  THE CONSUMER PROVIDED ADDITIONAL INFORMATION GLASSROOTS MOTOR MAGAZINE STATING THE VEHICLE IS PRONE TO AXEL SEAL FAILURE. UPDATED 06/29/07  *TR",
        "vin": "1G1YY12S515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2007",
        "dateOfIncident": "08/21/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178242,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CORVETTE CONVERTIBLE, WITH LESS THAN 66K MILES -- DEFECT/CRACK IN GASOLINE TANK -- RESULTING IN STRONG SMELL OF FUEL AND VISIBLE LEAKING FROM UNDER REAR OF VEHICLE -- IN FRONT OF LEFT REAR WHEEL.  VEHICLE WAS TAKEN IN FOR PROBLEM ON AUGUST 21 2006 FOR REPAIR.  CUSTOMER WAS TOLD BY BOTH DEALERSHIP AND GM THAT NO 2001 GASOLINE TANK AVAILABLE FOR IMMEDIATE REPAIR.  GM AND DEALERSHIP  INFORMED CUSTOMER THAT 2001 GASOLINE TANK MANUFACTURERS WERE SWITCHED -- BUT NO GAS TANKS HAVE PASSED INSPECTION, AS YET, TO ALLOW FOR CUSTOMER REPAIR.  IT HAS NOW BEEN 4.5 MONTHS THAT MY 2001 CORVETTE IS STILL SITTING AT THE DEALERSHIP -- AWAITING A SAFE GASOLINE TANK TO BE INSTALLED.  *JB",
        "vin": "1G1YY32G715"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/10/2006",
        "dateOfIncident": "11/17/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175726,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMOBILE WAS RECALLED FOR LOCK STEERING COLUMN IN APPROX 2004 WHILE UNDER 36000 MILE WARRANTY STEERING LOCKED AND RECALL WAS DONE.  IN NOV 2006 STEERING COLUMN LOCKED AGAIN. THIS TIME LOCAL CHEVROLET DEALER WOULD NOT WARRANTY THE SAME LOCKED STEERING COLUMN PROBLEM. WAS TOLD WOULD NOT FIX SAME PROBLEM TWICE UNDER RECALL BY MANUFACTURE.  *NM",
        "vin": "1G1YY12S915"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2006",
        "dateOfIncident": "09/26/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED A RECALL NOTICE #04V060000 WAS RECEIVED ON THE 2002 MODEL FOR ONE OF THE TWO VEHICLES OF THE SAME MAKE AND MODEL REGARDING THE STEERING.  THE 2002 WAS TAKEN TO THE SERVICE DEALER IN 2004 FOR THE REMEDY REPAIR WHERE A PROGRAMMING CHANGE WAS MADE TO THE VEHICLE.  IN SEPTEMBER OF 2006,  WHEN THE 2002 VEHICLE WAS STARTED, THE DRIVING INFORMATION CENTER DISPLAYED THAT THE STEERING HAD LOCKED.  THE VEHICLE WAS TOWED TO THE DEALER.  THE CONTACT ALSO OWNED A 2001 OF THE SAME MAKE AND MODEL BUT A RECALL NOTICE WAS NOT RECEIVED FOR THIS VEHICLE.  THE CONTACT WAS CONCERNED THAT THE STEERING MAY ALSO LOCK ON THIS VEHICLE.  THE MANUFACTURER WAS CONTACTED AND DETERMINED THE 2001 VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.",
        "vin": "1G1YY22G215"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/19/2006",
        "dateOfIncident": "07/18/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162907,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR WHEEL IS CRACKED AT THE SPOKE MEETING THE RIM.  *NM",
        "vin": "1G1YY22G715"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/28/2006",
        "dateOfIncident": "06/28/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161015,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BROWSING A CORVETTE ENTHUSIAST'S WEB SITE I WAS MADE AWARE OF A FLAW WITH THE 2000-2004 POLISHED WHEELS THAT CAME ON BASE AND CONVERTIBLE MODELS. I INSPECTED MY CAR UPON ARRIVING HOME AND FOUND THAT INDEED MY VEHICLE TOO WAS AFFECTED THERE ARE 2 LARGE STRESS CRACKS IN THE REAR DRIVER WHEEL. *NM",
        "vin": "1G1YY22G315"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/08/2006",
        "dateOfIncident": "05/04/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157001,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT TURN INDICATORS KEEP BLOWING BULBS. I HAVE CONTACTED GM AND CHEVROLET MOTOR DIVISION CONCERNING MY 2001 CHEVROLET CORVETTE. THE FRONT TURN INDICATORS HAVE BEEN A CONTINUING PROBLEM IN THIS VEHICLE. I HAVE NOTICED MANY 2001-2005 MODELS WITH THIS PROBLEM. THE FRONT TURN INDICATORS RIGHT AND LEFT BLOW BULBS AT DIFFERENT TIMES. IT SEEMS TO BE A PROBLEM WITH THE LENS COVERS CRACKING OVER TIME AND ALLOWING MOISTURE INSIDE CAUSING THE BULB TO FAIL THUS WHEN TURNING, THE VEHICLE WILL NOT SEND A SIGNAL TO ONCOMING TRAFFIC. CHEVROLET DECLINED TO REPLACE. CAR HAS TO BE PLACED ON A LIFT TO REPLACE A BULB AVG COST $2.95 BULB $20.00 LABOR.  *NM",
        "vin": "1G1YY22G915"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/11/2006",
        "dateOfIncident": "04/11/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155032,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE DRIVER'S SEAT ROCKED BACK AND FORTH WHILE BEING DRIVING IN NORMAL CONDITIONS.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION.  THE DEALER DETERMINED THE BOLTS TO THE SEAT WERE NOT BOLTED CORRECTLY TO THE VEHICLE.  THE DEALER OFFERED TO MAKE REPAIRS TO THE VEHICLE, BUT THE CONTACT DECLINED.",
        "vin": "1G1YY32G615"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/03/2006",
        "dateOfIncident": "03/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154417,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2001 CORVETTE CONVERTIBLE, THE ABS/TRACTION CONTROL SYSTEM HAS FAILED TWICE, ONCE AT 40,000 MILES THEN AFTER HAVING IT REPLACED IT FAILED AGAIN AT APPROXIMATELY 75,000 MILES. IT IS THE ABS MODULE AND CONTROL VALVE, THE CODE IS C1214, WHICH STATES SET CURRENT-SOLENOID RELAY COIL OPEN. IT'S FAILURE CAUSES COMPLETE AND TOTAL LOSS OF THE ABS SAFETY FEATURES AS WELL AS THE SAFETY FEATURES OF THE TRACTION CONTROL LOST. THESE FAILURES CAN LEAD TO LOSS OF TRACTION WHILE TURNING OR ON SLIPPERY SURFACE AS WELL LOSS OF CONTROL OF VEHICLE DURING EMERGENCY BRAKING OR ATTEMPTING TO STOP QUICKLY OR ON WET OR ICY SURFACES. THIS COULD LEAD TO ACCIDENTS RESULTING IN SERIOUS INJURY OR EVEN DEATH. THE FIRST DEFECTIVE ABS MODULE AND VALVE WERE REPLACED AND I NO LONGER HAVE THEM, HOWEVER THE CURRENT DEFECTIVE ABS MODULE AND VALVE ARE STILL IN THE CAR AND AVAILABLE.  *NM",
        "vin": "1G1YY32G115"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/22/2006",
        "dateOfIncident": "05/08/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED WHEEL.  *NM",
        "vin": "1G1YY22G015"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/08/2006",
        "dateOfIncident": "02/26/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152234,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A FLAT TIRE.  WHILE LOOKING FOR THE CAUSE I FOUND THAT IT WAS A CRACKED RIM.  AFTER LOOKING AT MY OTHER RIMS I FOUND ANOTHER ONE CRACKED, BUT NOT LEAKING.  I HAVE A 2001 CHEVY CORVETTE WITH THE Y2K STYLE, HIGHLY POLISHED, THIN SPOKE DESIGN RIMS.  THE CAR HAS 59,000 MILES BUT THE CRACKED RIMS ONLY HAVE 55,000 MILES.  THE RIGHT REAR WAS THE ONE WITH THE LARGE LEAKING CRACK, AND THE LEFT REAR WAS CRACKED BUT NOT LEAKING.  THE FRONT RIMS DO NOT APPEAR TO BE CRACKED AT THIS TIME.  I HAVE ORDERED FOUR NEW AFTERMARKET RIMS TO REPLACE MY CRACKED OEM GM RIMS.  *NM",
        "vin": "1G1YY22G815"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2006",
        "dateOfIncident": "03/03/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151737,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED PREVIOUSLY THERE WAS NOT A PROBLEM WITH THE STEERING COLUMN.  THERE IS A NHTSA RECALL # 04V060000 CONCERNING THE STEERING COLUMN LOCKING ANTI-THEFT DEVICE.  AFTER THE RECALL WORK WAS PERFORMED, THE STEERING COLUMN BEGAN TO LOCK.  THE VEHICLE IS CURRENTLY AT THE DEALERSHIP AWAITING REPAIRS.  THE MANUFACTURER WAS ALERTED.",
        "vin": "1G1YY22G915"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/23/2006",
        "dateOfIncident": "02/19/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TRAVELING 65 MPH THE STEERING WHEEL LOCKED AND CAUSED THE ENGINE TO STALL.  THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD AND WAS TOWED HOME.  THE DEALER HAS NOT BEEN ALERTED AND NO REPAIRS HAVE BEEN MADE.",
        "vin": "1G1YY32G815"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2006",
        "dateOfIncident": "01/07/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148061,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2001 C5 AND ON A 2 HOUR TRIP THE FUEL GAUGE DROPPED TO ZERO, THE CHECK GAUGES LIGHT CAME ON AND THEN THE LOW FUEL' WARNING CAME ON.  THIS HAPPENED TO THE VEHICLE SEVERAL TIMES.  I HAVE REACHED OUT TO SEVERAL OTHER CORVETTE OWNERS BECAUSE OUR LOCAL GM DEALER CANNOT IDENTIFY THE PROBLEM.  THE PROBLEM IS THE RIGHT AND LEFT SENDING UNITS ARE FAULTY IN THE FUEL SYSTEM.  BOTH NEED TO BE REPLACED TO CORRECT THE PROBLEM AND YOU CANNOT UNDER ANY CIRCUMSTANCES RUN ANYTHING BUT CHEVRON SUPREME IN THE TANK OR IT WILL BLOW OUT THE FUEL SENDING UNIT AGAIN.  THIS ITEM IS OVER $1000 TO FIX AND NO GM RECALL IN SIGHT.  THE PROBLEM BECOMES WHEN THE CAR QUITS IN THE MIDDLE OF THE ROAD AND SOMEONE REAR ENDS YOU AND TOTALS YOUR C5 BECAUSE OF GM'S ERROR!  *NM",
        "vin": "1G1YY22G615"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/02/2005",
        "dateOfIncident": "11/02/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141591,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS, TRACTION CONTROL, AND ACTIVE HANDLING INDICATORS STARTED COMING ON WHEN STARTING VEHICLE.  VEHICLE IS 2001 CHEVROLET CORVETTE WITH 32,000 MILES.  I TOOK THE VEHICLE IN FOR REPAIR AND WAS TOLD IT WOULD COST $3,189 TO REPLACE A VALVE AND A MODULE (BPMV AND EBCM).   I THOUGH THIS WAS UNUSUAL FOR TWO PARTS TO GO OUT ON A VEHICLE WITH SUCH LOW MILES.  THE TECHNICIAN TOLD ME THAT THERE HAD BEEN OTHER VEHICLES WITH THE SAME PROBLEM.  I FEEL THAT I SHOULD NOT HAVE TO PAY THE FULL PRICE FOR THE FAILURE OF A DEFECTIVE SAFETY DEVICE ON MY VEHICLE, ESPECIALLY WHEN IT FAILS AT 32,000 MILES.  ALTHOUGH I HAVE ONLY HAD TO RELY ON ABS ONCE SINCE I PURCHASED THE VEHICLE NEW IN 2001, I FEEL THAT IT SAVED ME FROM GETTING INTO AN ACCIDENT.  NOW, THE FEATURE DOESN'T WORK AND GM HAS MADE IT NEARLY COST PROHIBITIVE TO GET IT FIXED!  WHEN I HAD A DEFECTIVE SEAT BELT ON ANOTHER GM VEHICLE, GM WAS FORCED TO FIX IT FOR FREE.  I FEEL THE SAME SHOULD OCCUR ON ANY VEHICLES WHOSE SAFETY DEVICES, SUCH AS ABS, FAIL AT LESS THAN 100,000 MILES.  *JB",
        "vin": "1G1YY22G415"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2005",
        "dateOfIncident": "10/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SAME AS COMPLAINT #'S 757075 & 10124963 \"ACTIVE HANDLING SYSTEM MALFUNCTION\".  WHILE MOVING AT SPEED (APPROX 75 MPH) IN A STRAIGHT LINE ON EVEN PAVEMENT, THE ACTIVE HANDLING SYSTEM ACTIVATES THE LEFT SIDE BRAKES HARD FOR ABOUT TWO SECONDS.  THIS CAUSES MOMENTARY LOSS OF CONTROL OF THE VEHICLE.  IN MY CASE THE VEHICLE DEPARTED THE RIGHT LANE AND FORCED ME ACROSS THE LEFT LANE ONTO THE SHOULDER.  NO CODES.    ADDITIONAL DETAIL: I ORIGINALLY TOOK THE VEHICLE IN FOR SERVICE BECAUSE I WAS GETTING A FAULT IN THE AHS, \"SERVICE ACTIVE HANDLING\".  THE AHS WOULD AUTOMATICALLY DISABLE ITSELF AT THE TIME OF THE CODE WARNING.  THIS HAPPENED ONCE PER DRIVING CYCLE WHILE MOVING AT SPEED (EXACTLY THE SAME AS ABOVE, ONLY IT DIDN'T TRY TO WRECK THE CAR).  THE DEALER REFERENCED A GM SERVICE BULLETIN AND SAID THE SOFTWARE FOR THE AHS NEEDED TO BE UPGRADED.  AFTER THE UPGRADE, UNDER THE SAME CIRCUMSTANCES IT NOW ACTIVATES THE AHS AND CAUSES THE VEHICLE TO VEER WILDLY.  THE DEALER CAN FIND NOTHING WRONG.  THIS IS A BIG SAFETY ISSUE.  THE AHS SHOULD NOT BE ABLE TO CAUSE LOSS OF CONTROL.  *NM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/06/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134750,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCKED UP TWO TIMES WITHIN A 2 WEEK PERIOD AFTER HAVING RECALL PERFORMED IN YEAR PRIOR TO THIS INCIDENT.  FIRST LOCKUP OCCURRED FOR 2 1/2 HOURS AND SECOND OCCURRED FOR 20 MINUTES BOTH OF WHICH  CAUSED THE VEHICLE TO BE COMPLETELY UNUSABLE SINCE IT COULD NOT BE DRIVEN.  BEING CONCERNED WITH THE LOCKING AFTER THE SO CALLED RECALL FOR THE STEERING COLUMN LOCK PROBLEM BEING PERFORMED, I TOOK THE VEHICLE TO THE DEALERSHIP WHERE I WAS INFORMED THAT THE LOCKING MECHANISM WOULD HAVE TO BE REPLACED NOT UNDER ANY WARRANTY OR RECALL BECAUSE IT WAS \"BROKEN\".  LATER I  FOUND OUT THAT A BAD WIRE IS THE REASON FOR THIS PART (#88965331) HAVING TO BE REPLACED.  I CONTACTED GM CUSTOMER ASSISTANCE AND WAS INFORMED THAT THIS BROKEN PART HAD NOTHING TO DO WITH THE RECALL AND THEREFORE HAS COST ME $486.97 OF WHICH $282 WAS FOR THE \"GM GOODWRENCH\" TO PERFORM LABOR DURING 3 HOURS THEY SAID IT TOOK.  I CANNOT BELIEVE IT TOOK A GM GOODWRENCH MECHANIC 3 HOURS TO REPLACE A COLUMN LOCK PART BECAUSE OF A WIRE. GM GAVE ME THE TYPICAL BRUSH OFF FOR CORVETTE OWNERS WITH REGARDS TO THESE COLUMN LOCK PROBLEMS BY TELLING ME THAT THEY WILL KEEP INFORMATION ABOUT THIS PROBLEM IN THERE RECORDS.  HOW CAN A CAR WITH ONLY 13K MILES START HAVING FAILURES OF PARTS THAT NOBODY EVER HAS ACCESS TO WITHIN THE STEERING COLUMN AND THEN GM HAS THE NERVE TO TELL ME IT IS NOT A DEFECTIVE PART.   *NM",
        "vin": "1G1YY22G315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "07/29/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CALLER HAD RECALL WORK DONE ON MAY 11, 2005. CALLER  DID NOT HAVE THE PROBLEM UNTIL THE RECALL WORK WAS DONE.  STEERING: ANTI-THEFT DEVICEFAILED.  CALLER SAID THAT WHILE HE WAS PULLING OUT OF DRIVEWAY THE VEHICLE LOCKED. TURNED IT OFF, AND WHEN HE STARTED IT AGAIN IT CAME UNLOCKED. HE HAD TO HAVE VEHICLE HAULED TO DEALER. DEALER HAS VEHICLE NOW AND CAN NOT FIND PROBLEM. MANUFACTURER HAS NOT BEEN CONTACTED YET. *AK",
        "vin": "1G1YY22G715"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 1999 CHEVROLET CORVETTE. CONTACT  TOOK  CAR TO A DEALERSHIP TO HAVE THE STEERING FIXED ON JULY 15, 2005 AND THEY DID NOT FIX IT. THE SECOND TIME DEALERSHIP  WORKED ON IT, AND THEN  TOLD  CONTACT THE CAR LOCKED AGAIN ON  THEY WOULD COME OUT AND GET THE CAR. CONTACT TOOK IT TO  DEALER THE FIRST TIME ON  JULY 1, 2005. HE CITED  RECALL 04V060000 REGARDING THE STEERING.  CONTACTNEVER RECEIVED A RECALL LETTER, BOUGHT THE CAR USED FROM A CHEVROLET DEALERSHIP.  *AK",
        "vin": "1G1YY12G7X5"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/16/2005",
        "dateOfIncident": "06/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125558,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1. 50,000 MILES OF DRIVING 2001 CORVETTE.  2. CRACKS HAVE APPEARED IN BOTH REAR WHEELS WHERE THE SPOKE TRANSITIONS TO THE RIM . POSSIBLE CATASTROPHIC FAILURE AND VEHICLE CRASH.  3. STOPPED DRIVING THE CAR UNTIL I CAN REPLACE THE WHEELS.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/10/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124963,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ACTIVE HANDLING SYSTEM MALFUNCTIONS AT HIGHWAY SPEEDS.  WHEN TRAVELING ON DRY SMOOTH HIGHWAYS, IN A STRAIGHT LINE, THE ACTIVE HANDLING SYSTEM WILL ACTIVATE AND RANDOMLY ACTUATE INDIVIDUAL BRAKE CALIPERS.  WHEN THIS OCCURS, THE \"DRIVER INFORMATION SYSTEM\" WILL FLASH \"ACTIVE HANDLING\".  IN EVERY CASE, THIS CAUSES MOMENTARY, UNINTENDED CHANGES IN DIRECTION AND SPEED  OF THE AUTOMOBILE.  THE EVENT DOES NOT REGISTER ANY CODES IN THE OBD II.   THE PROBLEM CAN ONLY BE DEFEATED BY TURNING OFF THE ACTIVE HANDLING SYSTEM.    THE PROBLEM CAN BE INDUCED BY MAKING MINUTE ADJUSTMENTS TO THE STEERING WHEEL WHILE TRAVELING IN A STRAIGHT LINE.      THIS PROBLEM HAS BEEN LOOK AT BY THE DEALER SEVERAL TIMES, AND THEY HAVE BEEN UNABLE TO DIAGNOSE OR REPAIR THE PROBLEM.    THIS IS SIMILAR TO COMPLAINT 757075.",
        "vin": "1G1YY12S815"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "05/30/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123981,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ORIGINALLY TAKEN IN FOR RECALL ON 12/13/04.  MAC MAGRUDER CHEVROLET IN PALM SPRINGS, CALIFORNIA DID NOT HAVE THE PART TO REPLACE AND SENT VEHICLE HOME WITH ME FAILING TO TELL ME THAT THIS COULD BE A SERIOUS PROBLEM.  CAR STEERING COLUMN LOCKED UP ON 5/30/05.  CAR HAD TO BE TOWED TO DEALERSHIP.  DEALERSHIP INDICATED THE SERVICE HAD BEEN DONE AND THAT THEY WOULD HAVE TO CHARGE FOR TO PART.  I RESEARCHED THIS RECALL ITEM AND FOUND THAT THE PART SHOULD BE COVERED BY THE RECALL AND THEY DENY IT.  COMPLAINING REGARDING MAC MAGRUDER TRYING TO CHARGE FOR A RECALL SITUATION AND THAT THEY DID NOT INFORM ME OF THE SERIOUSNESS OF THIS RECALL.  FORTUNATELY THERE WAS NO ACCIDENT INVOLVED IN THE FAILURE.",
        "vin": "1G1YY32G715"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/24/2005",
        "dateOfIncident": "04/23/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WAXING THE FACTORY POLISHED SPOKE WHEELS ON MY 2001 CORVETTE YESTERDAY (SATURDAY APRIL 23, 2005, I NOTICED ONE OF THE WHEELS, LEFT REAR, HAS A CRACK WHERE THE SPOKE JOINS THE RIM.  BASED ON INFORMATION PROVIDED ON THE CORVETTE FORUM BY MEMBERS WITH IDENTICAL PROBLEMS, I AM VERY CONCERNED.  MY VEHICLE IS OUT OF WARRANTY BY 16 MONTHS, BUT THIS STILL SEEMS LIKE A DANGEROUS ISSUE.  THE LINK TO THE PARTICULAR FORUM POSTING IS:    HTTP://FORUMS.CORVETTEFORUM.COM/SHOWTHREAD.PHP?T=1072167&FORUM_ID=103  THE PHOTO THAT APPEARS FIRST IS OF MY WHEEL. IT IS CURRENTLY APPROX. 3/4\" LONG.  *JB  UPDATED 05/01/06",
        "vin": "1G1YY22G515"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/05/2005",
        "dateOfIncident": "02/10/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE VEHICLE AND DRIVING OFF THE ENGINES STALLED.  AFTER THE  VEHICLE WAS REPAIRED, THE VEHICLE WAS DRIVEN FOR ABOUT 600 MILES AND IT LOCKED UP AGAIN.  THE VEHICLE WAS TAKEN BACK TO THE DEALERSHIP.   *AK   WHEN THE VEHICLE WAS PARKED, A WARNING CHIME WOULD SOUND.  WHEN STARTING THE VEHICLE, IT WOULD ONLY MOVE SEVERAL FEET THEN THE FUEL WILL SHUT OFF, CAUSING THE VEHICLE TO STALL IN TRAFFIC.  THE VEHICLE HADN'T BEEN ABLE TO BE REPAIRED.  OTHER PROBLEMS:  THE LOCK  CLYINDER WAS NOT READING WHEN THE KEY WAS REMOVED, THEN WHEN THE KEY WAS INSERTED, THE VEHICLE READ THEFT ATTEMPT AND LOCK OUT, A COLUMN LOCK MESSAGE APPEARED ON THE DASH AND THERE WAS A RATTLE IN THE DRIVERS DOORS DUE TO DOOR SPERATION.   *SC",
        "vin": "1G1YY22G615"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/28/2004",
        "dateOfIncident": "08/10/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100666,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1.) NOTHING LEAD UP TO EVENT JUST PUT THE KEY IN IGNITION TO START CAR AND IT COLUMN LOCKED.  SYSTEM COLUMN LOCK-STEERING WHEEL WILL NOT TURN, AND IF YOU PUT IT IN GEAR THE ENGINE WILL DIE.  8-10-2004 FIXED UNDER RECALL.*AK  DEALER GAVE NO INFORMATION. ( PALM BAY CHEVROLET)  THEY HAD THE CAR FROM 8-10-2004 THROUGH 8-23-2004.",
        "vin": "1G1YY12S115"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/28/2004",
        "dateOfIncident": "11/09/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100669,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE NO EVENTS LEADING UP TO THIS CONDITION OTHER THAN I HAD THE CAR IN FOR SERVICE AND OIL CHANGE ON THE THURSDAY PRIOR TO IT HAPPENING.  SYSTEM COLUMN LOCK-STEERING WHEEL LOCKS AND WILL NOT TURN. IF CAR IS PUT INTO GEAR THE ENGINE WILL SHUT DOWN.  TOOK IT TO PALM BAY CHEVROLET AGAIN. THEY HAD IT FROM 11-09-2004 THROUGH 11-23-2004. DURING WHICH IT COST ME $315.00 IN RETAL CAR FEES WHICH I HAD TO TURN IN EARLY BECAUSE I COULDN' AFFORD IT ANY MORE, AND THE SERVICE ADVISOR KEPT TELLING ME THEY COULDN'T FIND ANYTHING WRONG WITH IT. THEY HAD CALLED GM AND DONE WHAT THEY SAID AND IT WAS RUNNING FINE.( WHICH IT ALWAYS DOES UNTIL IT COLUMN LOCKS.) UPON PICKING IT UP WE WERE TOLD THAT IT WAS FINE. I ASKED IF THEY FIXED IT AND WAS TOLD AGAIN WE DID ALL WE COULD DO.THEY RESET THE COMPUTER AND CLEANED TWO CORREDING GROUNDS.  UPON GETTING IN THE CAR AND STARTING IT UP THEY HAD PUT 103 MILES ON THE CAR WHILE THEY HAD IT.  *AK",
        "vin": "1G1YY12S115"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/28/2004",
        "dateOfIncident": "11/27/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100673,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EVENTS LEADING UP TO FAILURE- JUST PICKED IT UP FROM THE SHOP ( PALM BAY CHEVROLET) ON 11-26-2004 FOR THE SAME THING WAS ASSURED THAT IT WAS FIXED. SERVICE ADVISOR SAID MY WIFE SEAMED A LITTLE APPREHENSIVE AT THE TIME OF PICK UP ,AND SHE TOLD HIM SHE WAS NOT A LITTLE APPREHENSIVE SHE WAS ALOT APPREHENSIVE. SHE WAS SCARED OF THE CAR NOW.BECAUSE OF RESEARCH SHE HAD DONE ON THE RECALL ISSUE OF THE COLUMN LOCK SHE LEARNED THAT IT COULD HAPPEN WHILE YOU WERE DRIVING DOWN THE ROAD AND RESULT IN AN ACCIDENT. SHE WAS ASSURED BY THE SERVICE ADVISOR THAT THIS COULD NOT HAPPEN. MY WIFE IS THE MAIN DRIVER OF THIS CAR, BACK AND FORTH TO WORK.         WHEN WE PICKED THE CAR UP WE DROVE IT STRAIGHT HOME, AND MY WIFE DROVE IT TO WORK THE NEXT MORNING 11-27-2004 AT 6:00AM UPON GETTING OFF WORK AT 3:00PM AND STARTING THE CAR IT SYSTEM COLUMN LOCKED AGAIN LESS THEN 24 HOURS UPON PICKING IT UP FROM THE DEALERSHIP. WE WILL CALL THE DEALERSHIP AGAIN TOMMORROW 11-29-2004 AND SEE WHAT THEY HAVE TO SAY. MY WIFE IS SCARED OF THE CAR COMPLETELY NOW, AND AFFRIAD TO DRIVE. IT EVEN IF IT IS FIXED.*AK",
        "vin": "1G1YY12S115"
    },
    {
        "components": "STEERING,SERVICE BRAKES, AIR,ELECTRICAL SYSTEM,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2004",
        "dateOfIncident": "10/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098908,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CHEVROLET CORVETTE WITH MULTIPLE ELECTRICAL PROBLEMS WHICH HAVE WHICH HAVE LED TO MULTIPLE TRIPS TO THE DEALER FOR REPAIRS.  MOST RECENTLY, THE STEERING WHEEL LOCKS WHILE THE CAR IS ON.  THIS OCCURED THREE TIMES.  IT WAS REPAIRED TWICE BY THE DEALER AND CURRENTLY THE CAR IS AT THE DEALER AGAIN.  THE SERVICE MANAGER SAID THAT THERE IS NOTHING WRONG WITH THE CAR.  I'M AFRAID TO DRIVE THIS CAR.  IF THE STEERING WHEEL LOCKS WHEN I'M ON THE FREEWAY SOMEONE COULD GET INJURED.  THE STEERING WHEEL LOCKING PROBLEM HAS BEEN RECALLED ON THE VEHICLE.  GM CUSTOMER CARE WILL NOT ADDRESS THE PROBLEM.  WHAT SHOULD I DO?  THEY CANNOT FIX THE CAR NOR WILL THEY REPLACE IT.*AK",
        "vin": "1G1YY22G715"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/09/2004",
        "dateOfIncident": "10/26/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098573,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN SIGNAL INTERMITTANTLY FAILED TO FUNCTION.  FAILURE OCCURS AT DIFFERNT TIMES AND CONDITIONS OF OPERATIONS.  DEALERS AND GM SAID THEY CAN NOT FIX THE ISSUES UNIT THE FAILURE  IS NON INTERMITTENT.  FAILURE CAN OCCUR AT ANY TIME.  *AK",
        "vin": "1G1YY22G015"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/14/2004",
        "dateOfIncident": "05/16/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095770,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WATER/RAIN FALLS ALONG WINDSHIELD AND HOOD, WATER COLLECTS UNDER THE DASH AND SPILLS ONTO THE CLUTCH AND BRAKE PEDALS....CAUSING YOUR FEET TO SLIP SPORADICALLY, CREATING VERY DANGEROUS SITUATIONS. *AK",
        "vin": "1G1YY12SX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "09/22/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091315,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TILT STEERING WHEEL INOPERATIVE.  DROVE CAR HOME WITH THE STEERING WHEEL IN THE UP POSITION TO AVOID BEING STRANDED.  HAVE HAD MULTIPLE OCCASIONS WHERE THE SERVICE ACTIVE HANDLING COMES ON. THIS PROBLEM HAS OCCURED SINCE THE VEHICLE WAS NEW. THE CAR HAS BEEN INTO TWO SEPERATE DEALERS AND HAS NOT BEEN REPAIRED.*AK",
        "vin": "1G1YY22G215"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/08/2004",
        "dateOfIncident": "05/29/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091677,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER FOGS UP WINDSHIELD WHEN OPERATED.*MR  THE CONSUMER WAS TOLD BY THE DEALER THAT THE PROBLEM WAS A DESIGN DEFECT AND THERE WAS NOTHING THAT THEY COULD DO.  *JB",
        "vin": "1G1YY22G015"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "08/17/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088195,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED ENGINE. SELECTED MANUAL REVERSE. STEERING COLUMN LOCKED.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/16/2004",
        "dateOfIncident": "08/16/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086948,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKY REAR AXLE ON 2001 CORVETTE.  *AK",
        "vin": "1G1YY22G915"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/19/2004",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083238,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS CONCERNED THAT THE SERVICE MESSAGE THAT SERVICE COLUMN LOCK APPEARED WHILE STARTING THE VEHICLE. TOOK VEHICLE TO DEALER, AND  DEALER DIAGNOSED THE PROBLEM AS A FAULTY BMC (BODY CONTROL MODULE.  *AK",
        "vin": "1G1YY22G315"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/09/2004",
        "dateOfIncident": "06/08/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080653,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 3,900 MILES MY NEW CAR WAS DOWN 1QUART OF OIL. UPON QUESTIONING I FOUND THIS WAS COMMON PROBLEM WITH 2001 CORVETTES. AT 15000 MILES GM REPLACE PISTONS BUT SAID THAT IT IS ACCEPTABLE BY GM STARDARDS FOR THE CORVETTE TO BURN A QUART OF OIL EVERY 900 MILES. HOWEVER THEY WON'T GIVE ME INFORMATION IN WRITING ONLY TO MY LAWGER WHICH I DON'T FEEL NEEDED YET. I ALSO HAD A FRIEND WHO HAS SAME YEAR CORVETTE AS MINE AND HE TWO IS BURNING OIL. IT IS A KNOW PROBLEM EVEN IN GM WEB SITES FOR IT MECHANICS. PLEASE HELP I'M TIRED OF CHECKING OIL AND REPORTING CONSUMPTION TO DEALERSHIP I DIDN'T PURCHASE A 50,000 CAR FOR THIS.*AK",
        "vin": "1G1YY32G815"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/21/2004",
        "dateOfIncident": "06/18/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10078571,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCKED - LOCKING PIN DID NOT RELEASE DURING KEY TURN BUT ENGINE TURNED OVER.  THIS OCCURED THE SAME WAY THREE TIMES.  FIRST TIME WAS A YEAR AGO.  HAD DEALER REPAIR IT BUT THEY CLAIMED IT WAS A WEAK BATTERY, THEY CHARGED IT AND SIMPLY SAID THEY RESET IT..  DUE TO HOW LONG THEY HAD IT, I HAD TO RENT A CAR WHICH ULTIMATELY COST ME $350.  SECOND TIME, A DIFFERENT DEALER CLAIMED IT WAS THE BCM NEEDING REPROGRAMMING AND THAT IT WAS NOT THE SAME THING AS THE CURRENT RECALL AT THE TIME (SPECIFICALLY RELATED TO THE PCM) DESPITE THE SEEMINGLY SIMILAR EXPLAINATION OF THE RECALL.  IT WAS JUST OUT OF WARRANTY AND LEAD TO A COST OF $275.  THE THIRD TIME, SAME EXACT THING HAPPENED AGAIN AND THIS TIME THE SAME DEALER CLAIMED IT WAS THE STEERING COLUMN LOCK ACTUATOR OR OTHERWISE KNOWN AS THE SOLENOID.  THEY ARE NOW IN THE PROCESS OF REPLACING THE WHOLE LOCKING ASSEMBLY FOR $315 ($175+LABOR).  ALL THREE INCIDENCES OCCURED WITH A WEAKENED BATTERY YET THE ENGINE HAD NO PROBLEMS TURNING OVER SUGGESTING THAT DAMAGE COULD HAVE OCCURED.  EACH TIME, I WAS STRANDED WITHOUT A VEHICLE FOR SEVERAL DAYS AND THE TOTAL COST IS NOW ROUGHLY $1000 OUT OF MY POCKET.  I SHOULD ALSO MENTION THAT SINCE TOW TRUCKS ARE NOT DESIGNED WITH THE CORVETTE IN MIND, EACH AND EVEY TIME MY VEHICLE GETS TOWED, I HAVE TO ASSIST THE TOW TRUCK SO AS TO AVOID FURTHER DAMAGE WHILE THEY BARELY GET THE VEHICLE ON THE FLAT BED.  THIS ALONE IS ENOUGH STRESS LET ALONE THE COST OF THE TOWS.  *AK",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061137,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE LOCKED UP WHEN THE CONSUMER BACKED OUT OF THE DRIVEWAY. THE VEHICLE ALSO FAILED TO UNLOCK TWICE WHILE PARKED.  *PH  THE CONSUMER HAS SINCE TRADE THE VEHICLE FOR A 2004 CHEVROLET CORVETTE WITH NO PROBLEMS. *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE WAS IN MOTION STEERING WHEEL LOCKED IN PLACE. THIS CAUSED THE CONSUMER TO LOSE DIRECTIONAL CONTROL. *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/12/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067023,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS IN MOTION STEERING WHEEL LOCKED IN PLACE. THIS CAUSED THE CONSUMER TO LOSE DIRECTIONAL CONTROL. *AK",
        "vin": "1G1YY32G815"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061180,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT A  FUEL GAUGE PROBLEM.  VEHICLE  RAN OUT OF FUEL, BUT THE FUEL GAGE  INDICATED THAT THE FUEL TANK WAS  FULL. FUEL GAUGE HAD ALREADY BEEN REPAIRED 4 TIMES. CURRENTLY,  WARRANTY EXPIRED.  DEALER WAS  CHARGING  $1300.00  FOR  REPAIRS.   *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2004",
        "dateOfIncident": "01/28/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056977,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSES POWER SUDDENLY ON FREEWAY WITHOUT WARNING.  ENGINE DIES QUICKLY DURING DRIVING WITHOUT WARNING. RYDELL CHEVROLET (818)933-3000 UNABLE TO DETECT OR FIX PROBLEM AFTER SEVERAL VISITS.  PROBLEM PERSISTS.*AK",
        "vin": "1G1YY22G915"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2004",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054839,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCK UP.  *LA",
        "vin": "1G1YY12S315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/25/2004",
        "dateOfIncident": "12/19/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING-JUMPING FEELING WHEN WHEELS ARE TURNED AS FAR AS POSSIBLE-WHILE MOVING FORWARD OR IN REVERSE AFTER BEING PARKED AND AS YOU MOVE TO LEAVE.  TIRES FEEL AS THEY ARE NOT JUST ROLLING BUT SMALL HOPPING FEELING.  *LA",
        "vin": "1G1YY12S315"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/24/2004",
        "dateOfIncident": "01/14/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE WAS STARTED THE BRAKE PEDAL WENT TO THE FLOOR.  (NAR)  *LA   *CB",
        "vin": "1G1YY22G315"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/16/2004",
        "dateOfIncident": "09/30/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054278,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS I HAVE HAD THE FUEL GAUGE READ FROM OVER A HALVE OF A TANK TO IMMEDIATELY READING NOTHING. WHEN I TOOK IT TO THE DEALER, THE SERVICE DEPARTMENT STATED TO ME \"WELL IT'S NOT A PERFECT SCIENCE YOU KNOW\" AND PROCEEDED TO DO NOTHING TO INVESTIGATE IT OR REPAIR IT. I HAVE ALSO BEEN HAVING PROBLEMS WITH THE LIGHTS IN THE INSTRUMENT PANEL. THE MPH LIGHT IS BLINKING ON AND OFF AND JUST THE OTHER DAY THE LIGHT INFO BAR WENT COMPLETELY OFF AND I COULDN'T  READ MY COMPUTER INFO. I HAVE ADDRESSED SEVERAL TIMES WITH THE DEALER ABOUT THE SEVERE FRONT END VIBRATION WHEN THE VEHICLE REACHES SPEEDS OF 70MPH, BUT THE DEALER WON'T LOOK INTO IT BECAUSE THEY SAY THEY CAN;T DRIVE IT THAT FAST. WHAT! IF THE LAW ALLOWS ME TO GO THAT FAST, WHY CAN'T THEY? THE DRIVES SEAT BELT CONSTANTLY LOCKS ON ME NOT ALLOWING ME TO LOOK OUT MY SIDE OR REAR WINDOW. IN THE CONVERTIBLE YOU REALLY HAVE TO STRETCH TO SEE OUT THAT SMALL WINDOW IN THE TOP, THE SEAT BELT DOES NOT ALLOW ME TO AND I FIGHT TO GET IT TO RELEASE. THE LAST THING I WANT TO DO IT TAKE MY SEAT BELT OFF WHEN I'M DRIVING! PLEASE LOOK INTO THESE PROBLEMS. THANK YOU.  *CB",
        "vin": "1G1YY32G215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "09/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2001 CORVETTE WAS TAKEN TO THE DEALER ON SEP T12TH, 2003 FOR ENGINE FAILURE.  PISTONS, RODS, BEARINGS & RELATED PARTS WERE REPLACED. VEHICLE WAS RETURNED TO ME 4 WEEKS LATER.  AS OF 10/22/03 VEHICLE HAS BEEN RETURNED TO THE DEALER TWICE FOR RELATED ENGINE PROBLEMS & IS IN THEIR SHOP AT THIS TIME WITH NO ESTIMATED COMPLETION TIME. I HAVE NOT BEEN OFFERED ANY SUBSTITUTE TRANSPORTATION. GM CUSTOMER ASSISTANCE WILL DO NOTHING AND HAS REFUSED TO EXTEND THE WARRANTY OR PROVIDE COMPENSATION FOR LOST USE OF THIS $52,000 VEHICLE.",
        "vin": "1G1YY32G015"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/10/2003",
        "dateOfIncident": "10/29/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046693,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HWY AT 65-70 MPH  STARTED TO TURN INTO CONVIENCE STORE, AND TURNED WHEEL FROM 12 TO 2 O'CLOCK POSITION, BUT DECIDED NOT TO GO INTO STORE.  DRIVER TRIED TO TURN WHEEL LEFT TO STRAIGHTEN OUT THE CAR, BUT WHEEL WOULD NOT TURN, AND STAYED LOCKED FOR 10-15 SECONDS BEFORE DRIVER WAS ABLE TO GET IT UNLOCKED.  DRIVER ENDED UP WITH 2 WHEELS IN A DITCH,  AND DAMAGE TO FRONT END.  DEALER CONTACT:  MATT JOHNSON. *AK",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "10/16/2003",
        "dateOfIncident": "09/12/2003",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043058,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CHEVROLET CORVETTE CONVERTIBLE, PARKED AT GOLF COURSE, STARTED CAR TO LEAVE AND REALIZED THE STEERING WHEEL WAS LOCKED.  THE DASH DISPLAY READ \"SERVICE STEERING COLUMN.\"  THE CAR SAT AT THE GOLF COURSE A COUPLE DAYS WHILE I CHECKED WITH MECHANICS, FRIENDS, INTERNET AND NHTSA (MY SON WORKS FOR YOU).  I DISCOVERED THIS IS A FREQUENT PROBLEM WITH CORVETTES FROM 1997 AND UP (C5 BODY STYLE).  I TRIED ALL THE \"TRICKS\" I WAS TOLD BY SEVERAL PEOPLE INCLUDING SHAKING THE STEERING WHEEL HARD LEFT TO RIGHT WITH THE KEY OUT OF THE IGNITION AND IN THE IGNITION, PLUS USING THE KEY INSTEAD OF THE REMOTE CONTROL TO UNLOCK THE DOOR.  NOTHING WORKED.  I HAD IT TOWED TO A CHEVROLET DEALER.  THEY HAD IT SEVERAL DAYS AND COMMENTED THEY COULD NOT UNLOCK IT WITH THEIR SPECIAL TOOL.  THEY FIXED IT IN THE END BY INSTALLING GM PART NUMBER 26050960 WHICH IS THE STEERING WHEEL LOCK ASSEMBLY/THEFT DETERRENT ACTUATOR.  THE REPAIR BILL OF $392 ($171 FOR THE PART) STATED THE STEERING WHEEL LOCK HAD AN OPEN CIRCUIT CAUSING IT NOT TO RELEASE.  THEY JUMP STARTED VEHICLE & VERIFIED CONCERN, REMOVED AND REPLACED THE STEERING LOCK ASSEMBLY/THEFT DETERRENT ACTUATOR.  THIS CAR HAS 45000 MILES ON IT, IS A MANUAL TRANSMISSION.  *LA",
        "vin": "1G1YY32G015"
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/05/2003",
        "dateOfIncident": "10/03/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041274,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 CORVETTE. SINCE I'VE OWNED IT, SEVERAL PROBLEMS HAVE OCCURRED. THE FIRST BEING THE DRIVERS DOOR LOCK. THE CAR DEALER REPLACED THE MODULE TWICE AND THEN IT SWITCH ITSELF. THEN THE ELECTRONIC SYSTEM DEFAULTED WHERE I COULDN'T START THE CAR (TWICE). HAD TO HAVE IT TOWED BACK TO THE DEALERSHIP. THEN DRIVING ONE DAY THE FUEL GAUGE WENT FROM SHOWING HALF A TANK ALL THE WAY TO ZERO. ALL THE FUEL WARNING LIGHTS CAME ON. TOOK IT INTO SERVICE AND THEY REPROGRAMMED THE COMPUTER. THE VERY NEXT DAY I STARTED THE CAR AND THE STEERING WHEEL LOCK ENGAGED AFTER THE CAR FIRST STARTED, (I HAVEN'T HAD IT IN GEAR YET). THIS PROBLEM CONCERNED ME AND I STATED THAT TO THE SERVICE MANAGER WHO IMMEDIATELY STATED IT COULDN'T HAPPEN IF I WAS DRIVING THE CAR. (REALLY?) THEY REPAIRED THAT. THEN THE GAS GAUGE DID IT AGAIN. TOOK IT IN AGAIN AND THEY REPLACED SEVERAL ITEMS IN THE FUEL SYSTEM. NOW, ONE TANK OF GAS LATER, THE GAUGE DOESN'T READ PROPERLY. THE LOW LEVEL LIGHT CAME ON AND IT ONLY TOOK 10 GALLONS. TOOK IT BACK INTO THE DEALER AND THEY DON'T KNOW HOW TO FIX IT SO THEY'RE TALKING WITH GM ENGINEERS. ALSO THERE WERE SEVERAL OTHER 2001 CORVETTE'S IN FOR THE IDENTICAL PROBLEM. NOW (10/3/03) I HAVE A RENTAL CAR AND DON'T HAVE ANY IDEA WHEN THEY WILL BE ABLE TO FIX MINE.  *LA",
        "vin": "1G1YY32G015"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/03/2003",
        "dateOfIncident": "09/03/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038119,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOWS  WILL COME UP AND DOWN INTERMITTENTLY ON  DRIVER'S SIDE AND PASSENGER'S  SIDE.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/26/2003",
        "dateOfIncident": "10/05/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10036621,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A SINGLE CAR ACCIDENT IN MY 2001 CORVETTE. I BOUGHT IT BRAND NEW. THE INJURIES I SUFFERED WERE NEARLY FATAL. I WAS AIR LIFTED TO A  SHOCK TRAUMA UNIT, IN A COMA AND ON A RESPIRATOR FOR 21 DAYS AND REHABILITATION FOR SEVERAL MONTHS AFTER. I HAVE SUSTAINED SOME PERMANENT INJURIES AS A RESULT OF THIS ACCIDENT.   THIS WAS A SINGLE CAR ACCIDENT INVOLVING ONLY MY VEHICLE. THE EVIDENCE POINTS TO A POSSIBLE STEERING COLUMN LOCK UP WHICH RENDERED ME UNABLE TO STEER THE CAR. THE VEHICLE RIGHT HAND SIDE WENT OVER A ROCK WALL ON A DRIVEWAY AND THEN WENT PERFECTLY STRAIGHT INTO TREE WHICH BEGAN TIPPING THE CAR OVER. NEXT TO THE TREE WAS A VERY LARGE TREE STUMP WHICH CAUGHT THE RIGHT SIDE OF THE CAR'S UNDERSIDE AND FINISHED ROLLING THE CAR.  I WAS THROWN FROM THE CAR AS I WASN'T BELTED IN. (I HAD TROUBLE WITH THE DRIVER'S SIDE SEAT BELT IN THIS CAR ALSO.)  THE ESTIMATED SPEED AT THE TIME OF THE CRASH WOULD BE AROUND 20 MPH.   *NLM",
        "vin": "1G1YY32GX15"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/24/2003",
        "dateOfIncident": "08/24/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "\"SERVICE COLUMN LOCK\" - CAR STARTS AND RUNS BUT COMPLETELY SHUTS DOWN ONCE THE CLUTCH IS REALEASED.  CAR HAS 8,374 MILES ON IT AND HAS BEEN TO CHEVROLET FOR THIS PROBLEM 4 TIMES IN THE LAST 600 MILES.  EACH TIME I WAS TOLD IT WAS FIXED EXCEPT FOR THE LAST TIME WHERE THE SERVICE TECH COULDN'T TELL ME WHAT THEY DID FOR THE CAR BUT STATED \"IT SEEMS TO BE WORKING NOW\".  THAT WAS 200 MILES AGO - NOW BACK AT CHEVROLET.  *AK",
        "vin": "1G1YY22G515"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/19/2003",
        "dateOfIncident": "08/18/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SECURITY SYTEM STEERING COLUMN LOCKS. LIGHT IS ON ON DASHBOARD. CANNOT STEER CAR. CANNOT KEEP RUNNING IF I PUT IT IN GEAR. HAD TO CALL TOW TRUCK. THIS IS THE SECOND TIME IN ONE YEAR I HAVE HAD TO HAVE IT TOWED AND \"FIXED\". WHATS THE DEAL?? WHY NO RECALL?*AK",
        "vin": "1G1YY22G915"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/04/2003",
        "dateOfIncident": "07/30/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030789,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL LOCKED WHILE DRIVING.",
        "vin": "1G1YY22G715"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2003",
        "dateOfIncident": "06/18/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023317,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE JUST PURCHASED A 2001 CORVETTE COUPE 2 MONTHS AGO.  I HAVE HAD A PROBLEM WHEN THE SIGNAL LIGHTS (BOTH) JUST QUIT OPERATING--NO LIGHTS, NO CLICKING, NOTHING, IN AN INSTANT.  AFTER A PERIOD OF TIME, THEY WILL WORK AGAIN.  HAVE TAKEN THE FUSE OUT AND REINSTALLED IT IN CASE IT MIGHT HAVE BEEN LOOSE.  SEEMED TO WORK FOR ABOUT 2 WEEKS WITHOUT A PROBLEM, THEN SUDDENLY STOPPED WORKING AGAIN.  THERE IS NO LOGICAL SEQUENCE OF EVENTS WHEN THIS HAPPENS.  GM DEALERSHIP PUT IT ON THE COMPUTER BUT COULD NOT DETECT ANYTHING.  THEY INDICATED THAT THE SIGNALS WOULD HAVE TO BE 'NOT WORKING' WHEN I BROUGHT IT IN FOR THEM TO TELL WHAT WAS HAPPENING. THIS IS A POTENTIALLY DANGEROUS SITUATION, ESPECIALLY DURING HIGHWAY DRIVING.   *NLM",
        "vin": "1G1YY22G315"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER,POWER TRAIN,EXTERIOR LIGHTING,VISIBILITY,LATCHES/LOCKS/LINKAGES,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NAR 06/19/2003.  *MR  THE CONSUMERS VEHICLE WAS IN  NEED OF NUMEROUS REPAIRS.  VOLUNTARY EMISSION RECALL- REPROGRAM THE POWERTRAIN CONTROL MODULE. EXCESSIVE ENGINE OIL CONSUMPTION. ENGINE KNOCKING NOISE.  FUEL GAUGE DROPPED TO EMPTY, DRIVER SEAT IS COMING APART, STEERING COLUMN LOCK. AIR CONDITIONER HAS A BAD ODOR. INABILITY TO LOCK CAR DOORS. RADIO PRODUCES LOUD STATIC, AND SPEAKERS RATTLE. HEADLIGHTS HAVE A BAD BATTERY AND THE REAR VIEW MIRROR DOESN'T DIM.   *CB   *JB",
        "vin": "1G1YY22G215"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "06/04/2003",
        "dateOfIncident": "02/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022301,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM WITH 2001 CHEVROLET CORVETTE.  *MR  THE REAR LEFT WHEEL WITH NO IMPACT HAD EXPERIENCED A HAIR LINE FRACTURE.  THE CRACK WAS SO DEEP THAT THE COMPUTER INDICATED THE TIRE PRESSURE TO BE 10 PSI.  THE CONSUMER ALSO OWNED A 98 CHEVROLET CORVETTE WHERE A PIECE OF METAL HAD FALLEN OF THE WHEEL ALONG WITH THE COATING.  AN INSPECTION CONCLUDED THAT THE COATING IS A CLEAR MATERIAL AND WAS LIKELY TO EITHER HAVE BEEN IMPROPERLY APPLIED OR IS NOT SUITED FOR SOUTHERN FL.  UP EXPOSURE.  *SCC",
        "vin": "1G1XX32G515"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/02/2003",
        "dateOfIncident": "06/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020876,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS WITH MANY OTHER CORVETTE OWNERS I KNOW, I WAS STRANDED BY THE DEFECTIVE COLUMN LOCK MECHANISM.  THIS SHOULD BE A FACTORY RECALL ON ALL CORVETTES.*AK",
        "vin": "1G1YY22G215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2003",
        "dateOfIncident": "06/09/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018690,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL CONSUMPTION IS ABOVE NORMAL FOR A NEW ENGINE.  I HAVE EXPERIENCED THE CONSUMPTION OF MORE THAT ONE QUART PER 1000 MILES.  DEALER INITIALLY STATED THAT THIS WAS NORMAL FOR A NEW ENGINE AND WOULD IMPROVE AFTER A GOOD BREAK-IN PERIOD.  PROBLEM REMAINS.  RESEARCH HAS SHOWN THAT THERE IS AN ACKNOWLEDGED PROBLEM WITH EXCESSIVE OIL CONSUMPTION.  CATALYTIC CONVERTER AND EXHAUST PIPES SHOW SIGNIFICANT BLACK OILY RESIDUE.  CONCERNED ABOUT POTENTIAL FIRE FROM CATALYTIC CONVERTER.  ALSO CONCERNED ABOUT ENVIRONMENTAL EFFECTS.  CHEVROLET NEEDS TO TAKE POSITIVE ACTION TO RESOLVE ISSUE.   *NLM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/09/2003",
        "dateOfIncident": "04/09/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES INTAKE MANIFOLD GASKET BLEW OUT.  THE DEALER WAS NOTIFIED.  *NLM",
        "vin": "1GBJG31R211"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2003",
        "dateOfIncident": "04/08/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014104,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE BURNS EXCESSIVE AMOUNT OF ENGINE OIL.   *NLM",
        "vin": "1G1YY12S215"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "02/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10012381,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A DEEP AND LONG CRACK WAS ON THE REAR LEFT WHEEL, WHICH CAUSED AIR TO LEAK FROM THE TIRE.  *AK     *JB",
        "vin": "1G1YY32G515"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": "02/04/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MESSAGE \"SERVICE STEERING COLUMN LOCK\". DEALER SAID RECALL DOES NOT INCLUDE THE '01 CORVETTE, JUST PREVIOUS YEARS. APPARENTLY THE PROBLEM WAS NOT CURED, JUST DROPPED THE RECALL.  REF. IN EA02-031 *CJS",
        "vin": "1G1YY32G815"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2003",
        "dateOfIncident": "01/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST AFTER STARTING MY 2001 CORVETTE, I WAS PULLING OUT OF THE GARAGE AND THE STEERING LOCKED UP.    I THINK THIS IS BECAUSE THE STEERING PIN SOLENOID DOESN'T PULL THE PIN WHEN THE VOLTAGE DROPS.  MY BATTERY WAS APPARENTLY WEAK BECAUSE WHEN THE TOW TRUCK DRIVER BEAT THE STEERING COLUMN UNTIL THE PIN DROPPED, THE CAR WOULDN'T START WITHOUT A JUMP.  REF. IN EA02-031 *CJS",
        "vin": "1G1YY22G415"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2003",
        "dateOfIncident": "01/16/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004162,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUT OF THE DRIVE WAY WITHOUT PRIOR WARNING THE STEERING COLUMN LOCKED UP.  CAUSING HIM TO CRASH INTO THE NEIGHBOR NEXT DOOR HOUSE.  PLEASE PROVIDE ADDITIONAL INFORMATION DEALER IS AWARE OF THE PROBLEM.  REF. IN EA02-031 *CJS",
        "vin": "1G1YY22G315"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/05/2003",
        "dateOfIncident": "11/11/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GOODYEAR",
                "productYear": "1982",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BAD SET OF TIRES. I BOUGHT THIS CAR NEW AND HAVE BEEN HAVING PROBLEMS WITH IT MAKING A NOISE. I AM A WOMAN SO I THOUGHT IT WAS COMING FROM THE REAREND OF THE CAR. I KEPT TAKING IT IN ANDHAVING IT CHECKED AND THE DEALERS SAID IT WASN'T THE REAR END OF THE CAR. FINALLY THEY FOUND WHAT WAS MAKING THE NOISE, THE TIRES HAVE BUMPS AND LUMPS ON THEM, THE TIRES AREN'T EVEN ROUND.I HAVE TRIED SINCE NOVEMBER TO GET GM TO HONOR THE WARRENTY ON THE CAR AND REPLACE THE TIRES AND HAVE RECIEVED NOTHING BUT A RUN AROUND. THEY WERE SUPPOSE TO LET ME KNOW SOMETHING DEC. 21ST BUT I HAVE NOT HEARD ANYTHING FROM THEM. THE TIRES ARE NOT SAFE AND WERE NOT ANY GOOD TO BEGIN WITH. YOU CANNOT ROTATE THE TIRES AND THEY ARE SUPPOSE TO BE RATED FOR TOP SPEEDS AND GO FOR A 100 THOUSAND MILES. I AM SACRED TO DRIVE ANYWHERE ON THE TIRES AND I DON'T BELIEVE I SHOULD HAVE TO SPEND 2 THOUSAND DOLLARS TO REPLACE THE TIRES WHEN THEY WEREN'T ANY GOOD TO BEGIN WITH. I HAVE ALREADY PAID FOR TIRES WHEN I BOUGHT THE CAR AND THEY SHOULD HAVE BEEN GOOD.I HAVE BEEN TRYNG TO FIND OUT WHAT THE PROBLEM WAS FOR A YEAR BUT THEY DIDN'T FIND IT UNTIL THIS PAST NOV. THIS IS WHEN I CONTACTED GM. I DON'T WANT TO HAVE A WRECK BECAUSE OF THESE TIRES AND I CAN'T AFFORD ANOTHER CAR AT THIS TIME. I LOVE THE CAR BUT I WANT SOME DEPENDABLE TIRES ON IT. I REMEMBER THE PROBLEMS WITH THE FIRESTONE TIRES CAUSING WRECKS.THESE TIRES ARE GOODYEAR RUN FLAT TIRES 18 INCH IN THE REAR AND 17 IN THE FRONT. THE CAR IS UNDER WARRENTY, CAN YOU HELP ME GET THE CHEVY DIVISON TO HONOR IT?",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/31/2002",
        "dateOfIncident": "12/15/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000663,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL HAS LOCKED UP ABOUT 10 OR 15 TIMES.  USUALLY IMMEDIATELY AFTER STARTING THE CAR.  IT HAS HAD ME STRANDED FOR ANYWHERE FROM 5-60 MINUTES.  TWO DEALERS HAVE LOOKED AT THE CAR AT LEAST 5 OR 6 TIMES.  I THOUGHT THE PROBLEM WAS RESOLVED UNTIL I WAS DRIVING TO WORK A FEW WEEKS AGO ON A MAJOR HIGHWAY AT A RATE OF SPEED OF ABOUT 65MPH WHEN THE DIGITAL DISPLAY ON THE COMPUTER SAID TO \"SERVICE STEERING COLUMN LOCK\".  THIS IS THE USUAL NOTIFICATION I GET ON MY CAR WHEN THE WHEEL HAS LOCKED UP IN THE PAST.  FORTUNATELY THE STEERING DIDN'T LOCK UP BUT IT REALLY FRIGHTENED ME.  THE DEALER WAS UNABLE TO IDENTIFY ANY PROBLEM IN THE DEALERSHIP AND NOW I'M SCARED TO DRIVE THE CAR FOR FEAR THE STEARING WHEEL WILL LOCK UP WHILE I'M DRIVING.  ABOUT A WEEK AFTER THIS HAPPENED I WAS MADE AWARE OF AN INVESTIGATION INTO THIS PROBLEM BY NHTSA .  I HAVE A 2001 CHEVY CORVETTE.  CAN YOU PLEASE UPDATE ME ON THE INVESTGATION AND WHAT SHOULD I DO NOW??  REF. IN EA02-031 *CJS",
        "vin": "1G1YY22G215"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/20/2002",
        "dateOfIncident": "10/15/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000323,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT REAR UPPER CONTROL ARM BRACKET BROKE OFF THE FRAME BECAUSE THE BOTTOM 2 (OF 4 TOTAL) WELDS WERE NOT MAKING CONTACT WITH THE FRAME.  THE WHEEL MOVES FREELY IN AND OUT.  I'M TOLD THAT MINE WAS NOT THE ONLY ONE WITH THE WELD PROBLEM, BUT THE FIRST ONE LOCALLY THAT HAS ACTUALLY BROKEN OFF. TS",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/06/2002",
        "dateOfIncident": "11/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023895,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT DURING A TEST DRIVE OF VEHICLE BY DEALERSHIP THE \"ACCELETROMETER\" LOCKED UP WHEN SHIFTING FROM 2ND TO 3RD GEAR, CAUSING VEHICLE TO COLLIDE INTO A MINIVAN AND TREE. TS",
        "vin": "1G1YY226715"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/13/2002",
        "dateOfIncident": "05/17/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF THE DRIVEWAY CONSUMER ATTEMPTED TO TURN THE STEERING WHEEL, THE STEERING WHEEL LOCKED UP, AND THE WARNING BUZZER SOUNDED. VEHICLE WAS TOWED TO DEALER AND THE  STEERING ACTUATOR WAS REPLACED.    MR  *TT *JB",
        "vin": "1G1YY22G615"
    },
    {
        "components": "INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/12/2002",
        "dateOfIncident": "11/08/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022606,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY ENGINE LIGHT BECOME INNOPERABLE  AND OBSTRUCTING DRIVERS VIEW. DEALER HAS BEEN NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION.   MR",
        "vin": "1G1YY32G315"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/23/2002",
        "dateOfIncident": "05/20/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCKED UP. IF YOU GO TO HTTP://WWW.CORVETTEFORUM.COM & DO A SEARCH FOR COLUMN LOCK YOU WILL SEE THIS IS A WIDESPREAD PROBLEM. A LOT OF PEOPLE ON THIS FORUM HAVE REMOVED THE LOCK & INSTALLED A COLUMN LOCK BYPASS INSTEAD OF PRESSING THE ISSUE WITH GM. TO ME GM DOES NOT HAVE A PROPER & CORRECT FIX FOR IT AS THEY HAVE REMOVED THE LOCKING MECHANISM ON THE CARS WITH AUTOMATIC TRANSMISSIONS BUT DUE TO FEDERAL LAW CAN NOT REMOVE IT FROM THE MANUAL TRANSMISSION. GM JUST PUT THEIR HANDS UP & GAVE UP AS IT SHOWS THEY HAVE NO ANSWER OTHERWISE THEY WOULD NOT HAVE REMOVED THE LOCK FROM THE AUTOMATIC CARS. I HAVE HEARD IT LOCKS UP WHILE MOVING & THAT IS ON THE BACK OF MY MIND WHILE DRIVING, VERY DANGEROUS. PLEASE GET GM TO CORRECT THIS UNSAFE CONDITION & IF THEY TELL YOU THEY HAVE A FIX ASK THEM WHY THEY REMOVED THE LOCK FROM THE AUTOMATIC CARS.  DT",
        "vin": "1G1YY22G615"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/02/2002",
        "dateOfIncident": "05/17/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCKED UP WHILE BACKING OUT OF MY GARAGE PREVENTING ME FROM TURNING STEERING WHEEL. CAR WAS TOWED TO MY NEAREST DEALERSHIP, PALM CHEVROLET WHO REPLACED THE LOCKING MECHANISM. MY CAR SUPPOSEDLY HAD THE LATEST IMPROVED FIX BY GM FROM THE FACTORY. THIS IS AN ONGOING PROBLEM WITH ALL CORVETTES SINCE 1997. GM HAS TAKEN THE LOCKING MECHANISM OUT OF ALL AUTOMATIC TRANSMISSION CORVETTE WHICH SHOWS THEY DO NOT HAVE CONFIDENCE IN ANY OF THEIR FIXES. THEY CANNOT REMOVE THEM FROM MANUAL TRANSMISSION SINCE THAT WOULD BE AGAINST FEDERAL LAW. ON THE FORUMS THIS IS A BIG TOPIC OF STEERIING COLUMNS LOCKING UP & I HAVE HEARD IT HAS BEEN DOING SO ON MOVING VEHICLES. MINE LOCKED UP WHILE BACKING OUT OF MY GARAGE. BEING LOCKED UP WHILE PARKED IS AN INCONVENIENCE BUT IT HAPPENING WHILE MOVING IS DEADLY.      TS  REF. IN EA02-031 *CJS",
        "vin": "1G1YY22G615"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/16/2002",
        "dateOfIncident": "09/10/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING ON HIGHWAY AND HEARD A RATTLING NOISE COMING FROM   LEFT WHEEL UPPER FORWARD CONTROL ARM. DEALERSHIP WAS AWARE OF  PROBLEM.*AK",
        "vin": "1G1YY32T815"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/15/2002",
        "dateOfIncident": "09/11/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767197,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAM IN RIGHT FUEL TANK DEVELOPED A LEAK WHILE SITTING IN MY GARAGE.  NLM",
        "vin": "1G1YY12S915"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/20/2002",
        "dateOfIncident": "06/14/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012288,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CONSUMES TOO MUCH OIL DUE TO A DEFECTIVE A MOTOR. CONTACTED DEALER. *AK THE VEHICLE HAD BEEN TO THE DEALER FIVE TIMES FOR COLD PISTON KNOCK PROBLEMS. THE DEALER REPLACED RINGS TWICE, BUT WAS UNABLE TO CORRECT THE PROBLEM. THE LOW OIL LIGHT CAME ON DUE TO EXCESSIVE OIL CONSUMPTION. THE CONSUMER HAD BEEN TO THE DEALERSHIP TEN TIMES FOR PROBLEMS RELATED TO EXCESSIVE OIL USE. THE DRIVER SIDE SEAT BELT RETRACTOR HAD FAILED, BUT THE DEALER REPLACED THE LEFT SIDE SHOULDER ASSEMBLY. THE PASSENGER DOOR OPENING WEATHER STRIP HAD GLUE COMING OUT. ARBITRATOR DENIED THE CONSUMERS REQUEST FOR THE MANUFACTURER REPURCHASE OF THE VEHICLE. *YH",
        "vin": "1G1YY125615"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY,SEAT BELTS,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/28/2002",
        "dateOfIncident": "01/18/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SENSOR ON DRIVER'S DOOR HAS BEEN REPLACED NUMEROUS TIMES, INTERMITTENTLY  DRIVERS DOOR WILL NOT RESPOND TO REMOTE OPTION.*AK  CUSTOMER STATED THAT OIL LEAKED FROM ENGINE AREA. THE DRIVER DOOR RATTLES WHILE DRIVING AND WAS HARD TO CLOSE. THE RIGHT DOOR GLASS HAS WIND NOISE DUE TO DOOR GLASS FAILURE. BRAKES FAILED TO GRAB. THERE WAS A NOISE WHILE DRIVING DUE TO LEFT SEAT BELT RETRACTOR FAILURE. CONSUMER STATES CD CHARGER WOULD NOT EJECT CD CARTRIDGE, THE STEERING TILT WAS INOPARTIVE, THE DOOR RATTLED, THE SEATS WOULD NOT HOLD PROGRAMMING. *YH",
        "vin": "1G1YY23GX15"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2002",
        "dateOfIncident": "12/14/2001",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010258,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON  HIGHWAY SMELLED AN ODOR. IT WAS  SMOKE COMING FROM UNDERNEATH  VEHICLE.*AK",
        "vin": "1G1Y122G515"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/17/2002",
        "dateOfIncident": "04/14/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING AT 60 MPH THE STEERING WHEEL ON THE VEHICLE LOCKED UP AND THE CONSUMER COULD NOT STEER THE VEHICLE AT ALL. CONTACTED DEALER AND THE DEALER IS NOT WILLING TO DO ANYTHING.   NLM",
        "vin": "1G1YY22G015"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/17/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007882,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING 60 MPH WITHOUT WARNING THE STEERING WHEEL LOCKED RESULTING IN CONSUMER LOSS OF STEERING THIS PROBLEM HAS OCCURRED THREE TIMES DEALERSHIP HAS BEEN NOTIFIED MECHANIC STATES VEHICLE IS SAFE TO DRIVE.  GM NOT WILLING TO DO NOTHING.   *TT    REF. IN EA02-031 *CJS",
        "vin": "1G1YY22G015"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2002",
        "dateOfIncident": "10/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005093,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STANDARD TRANSMISSION; VEHICLE WILL TRY TO GO INTO REVERSE AT HIGH RPMS WHILE  CONSUMER IS DRIVING. CONTACTED DEALER, AND THE DEALER IS NOT WILLING TO DO ANYTHING. *AK",
        "vin": "N/A"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2002",
        "dateOfIncident": "12/31/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ACTIVE HANDLING SYSTEM MALFUNCTION - ON THREE SEPARATE OCCASIONS DURING A RECENT ROAD TRIP, I EXPERIENCED  A MOMENTARY LOSS OF DIRECTIONAL CONTROL WHILE DRIVING MY VEHICLE AT HIGHWAY SPEEDS.  ON EACH OCCASION, I WAS FORTUNATE TO QUICKLY REGAIN CONTROL OF THE VEHICLE AFTER IT  INVOLUNTARILY VEERED TO THE LEFT AND CROSSED INTO THE ADJACENT LANE OF TRAVEL.  SHORTLY THEREAFTER, A DASH BOARD MESSAGE APPEARED : \"SERVICE ACTIVE HANDLING\".  UPON ARRIVAL AT MY DESTINATION, I HAD MY VEHICLE SERVICED AT AN OUT OF TOWN CHEVEROLET DEALER.  AFTER CONSULTING WITH GENERAL MOTORS, THE DEALER EXAMINED THE VEHICLE BUT WAS UNABLE TO PROVIDE A \"FIX\" FOR THE PROBLEM.  I ASKED THE DEALER IF THEY WERE AWARE OF ANY SIMILAR PROBLEMS WITH OTHER  CORVETTES - THEY RESPONDED - \"NO\".               ACCELERATION DISRUPTION ISSUE - THIS HAS BEEN A PROBLEM SINCE DAY ONE AND CONTINUESS THROUGH TODAY. THE PROBLOEM IS MOST APPARENT  WHEN I ATTEMPT TO MERGE INTO TRAFFIC UPON ENTERING A FREEWAY.        \"EXCESSIVE HEAT\" - AS WITH THE ACCELERATION ISSUE , THIS PROBLEM HAS EXISTED SINCE BUYING MY VEHICLE IN AUGUST OF 2000.  I PLAN TO HAVE WARRANTY SERVICE WITH RESPECT TO THE ACCELERATION AND HEAT ISSUES SOMETIME IN THE VERY NEAR FUTURE.*AK",
        "vin": "1G1YY22G115"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/19/2002",
        "dateOfIncident": "12/31/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ACTIVE HANDLING SYSTEM MALFUNCTION - ON THREE SEPARATE OCCASIONS DURING A RECENT ROAD TRIP, I EXPERIENCED  A MOMENTARY LOSS OF DIRECTIONAL CONTROL WHILE DRIVING MY VEHICLE AT HIGHWAY SPEEDS.  ON EACH OCCASION, I WAS FORTUNATE TO QUICKLY REGAIN CONTROL OF THE VEHICLE AFTER IT  INVOLUNTARILY VEERED TO THE LEFT AND CROSSED INTO THE ADJACENT LANE OF TRAVEL.  SHORTLY THEREAFTER, A DASH BOARD MESSAGE APPEARED : \"SERVICE ACTIVE HANDLING\".  UPON ARRIVAL AT MY DESTINATION, I HAD MY VEHICLE SERVICED AT AN OUT OF TOWN CHEVEROLET DEALER.  AFTER CONSULTING WITH GENERAL MOTORS, THE DEALER EXAMINED THE VEHICLE BUT WAS UNABLE TO PROVIDE A \"FIX\" FOR THE PROBLEM.  I ASKED THE DEALER IF THEY WERE AWARE OF ANY SIMILAR PROBLEMS WITH OTHER  CORVETTES - THEY RESPONDED - \"NO\".               ACCELERATION DISRUPTION ISSUE - THIS HAS BEEN A PROBLEM SINCE DAY ONE AND CONTINUESS THROUGH TODAY. THE PROBLOEM IS MOST APPARENT  WHEN I ATTEMPT TO MERGE INTO TRAFFIC UPON ENTERING A FREEWAY.        \"EXCESSIVE HEAT\" - AS WITH THE ACCELERATION ISSUE , THIS PROBLEM HAS EXISTED SINCE BUYING MY VEHICLE IN AUGUST OF 2000.  I PLAN TO HAVE WARRANTY SERVICE WITH RESPECT TO THE ACCELERATION AND HEAT ISSUES SOMETIME IN THE VERY NEAR FUTURE.*AK",
        "vin": "1G1YY22G115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES HE HAS DRIVEN THE VEHICLE 5,600 MILES WITH A LOSS OF 2 QUARTS OF ENGINE OIL, CONSUMER WAS INFORMED THAT THE OIL CONSUMPTION IS NORMAL, CONSUMER STATES THAT THE OIL IS BEING BLOWN INTO THE EXHAUST SYSTEM DUE TO A FAULTY ENGINE DESIGN.*JB",
        "vin": "1G1YY22G115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564117,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES HE HAS DRIVEN THE VEHICLE 5,600 MILES WITH A LOSS OF 2 QUARTS OF ENGINE OIL, CONSUMER WAS INFORMED THAT THE OIL CONSUMPTION IS NORMAL, CONSUMER STATES THAT THE OIL IS BEING BLOWN INTO THE EXHAUST SYSTEM DUE TO A FAULTY ENGINE DESIGN.*JB",
        "vin": "1G1YY22G115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/16/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756954,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION REPORTED TO DEALERSHIP.  PRESENTLY UNDER \"OIL CONSUMPTION\" TEST UNDER DEALERSHIP SUPERVISION.  BLACK BUILD UP NOTICED ON EXHAUST TIPS.  CATALYTIC CONVERTER POSSIBLY SATURATED WITH BURNT SYNTHETIC OIL.",
        "vin": "1G1YY12S215"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2001",
        "dateOfIncident": "10/06/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RAW FUEL LEAK  FROM LINE NEAR FIREWALL INSIDE ENGINE COMPARTMENT",
        "vin": "1G1YY12S515"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/19/2001",
        "dateOfIncident": "12/18/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755813,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS EQUIPPED WITH 4 CATALYTIC CONVERTERS WHICH CAUSE EXCESSIVE HEAT BUILD UP--TO THE POINT THAT THE REAR UNDER DECK STORAGE COMPARTMENTS ARE USELESS FOR STORAGE OF ANY HEAT SENSITIVE EQUIP. OR MATERIAL-CAN'T STORE A LAPTOP IN COMPARTMENT WHEN TRAVELING-OR DISCS OR FLOPPYS, ETC.--THE BACK BUMPER GETS HOT ENOUGH TO DISTORT AROUND BOTH MUFFLERS. CHEVROLET MAINTAINS THAT THIS IS NORMAL......THE 4 CAT SYSTEM IS NO LONGER PUT ON THESE VEHICLES, YET CHEVROLET REFUSES UPGRADE. CURE FOR WARPED REAR BUMPER, PER CHEVROLET IS TO USE A HEAT GUN TO HEAT AND STRAIGHTEN WARPED AREA????",
        "vin": "1G1YY22G215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/19/2001",
        "dateOfIncident": "12/18/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE ENGINE OIL USE--1 1/2 QTS PER 2000. MILES CHEVROLET ADVISES THAT NORMAL OIL CONSUMPTION IS A QT EVERY 700 MILES????? CHEVROLET HAS A  UPGRADED SET OF RINGS THAT STOP THE EXCESSIVE CONSUMPTION BUT THEY STONEWALL CUSTOMERS BY TELLING THEM THAT CONSUMPTION RATES ARE NORMAL AT 1QT EVERY 700 MILES.  IS THIS NOT A SAFETY ISSUE SINCE THE EXCESSIVE OIL SOAKS THE CATALYTIC CONVERTER, THUS CAUSING A FIRE.*AK",
        "vin": "1G1YY22G215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/18/2001",
        "dateOfIncident": "12/15/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000848,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMPERATURE IN  PASSENGER AND STORAGE COMPARTMENTS PROGRESSIVELY BECOMES HOTTER DURING OPERATION OF  VEHICLE.  ALSO,  REAR BUMPER ASSEMBLY IS STARTING TO DEFORM DUE TO CATALYTIC CONVERTER SYSTEM PRODUCING EXCESSIVE HEAT.   DEALERSHIP WILL PERFORM NO SERVICE ON  VEHICLE UNTIL AUTHORIZATION IS GIVEN BY  MANUFACTURER.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION / DOCUMENTATION.*AK",
        "vin": "1G1YY22G215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/15/2001",
        "dateOfIncident": "12/03/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BURNS 1 TO 1.5 QUARTS OF OIL EVERY 400 TO 500 MILES. *AK",
        "vin": "1G1YY12S415"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2001",
        "dateOfIncident": "11/29/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755483,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE IS USING EXCESSIVE AMOUNTS OF OIL - 2 QUARTS IN 5,600 MILES.  ENGINE OIL IS BEING BLOWN INTO EXHAUST SYSTEM CONTAMINATING THE CATALYTIC CONVERTERS AND POSING A RISK OF CATALYTIC CONVERTER FIRE WHEN CAR IS PARKED.  MANUFACTURER HAS BEEN CONTACTED AND IS DOING OIL CONSUMPTION TEST.  DEALER STATES THAT USE OF UP TO 1 QUART OF OIL PER 1,000 MILES IS NORMAL.  CAR HAS LESS THAN 6,000 MILES.  *AK",
        "vin": "1G1YY22G115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/29/2001",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS EXCESSIVE OIL CONSUMPTION, AND OIL CONTAMINATION OF CATALYTIC COVERTER. CONTAMINATED  OIL CAUSED VEHICLE TO HAVE HIGH EMISSION DUE TO  CONTAMINATED CATALYTIC CONVERTER. DEALER HAS YET TO BE CONTACTED. PLEASE PROVIDE FURTHER DETAILS.  *AK",
        "vin": "1G1YY22G115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2001",
        "dateOfIncident": "07/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785740,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES ENGINE HAS BURNED 3 QUARTS OF OIL IN ONLY 6000 MILES, DEALER HAS CHANGED OIL TWICE AND STATES THAT THIS IS NORMAL.   *SLC",
        "vin": "1G1YY32G415"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2001",
        "dateOfIncident": "07/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785740,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES ENGINE HAS BURNED 3 QUARTS OF OIL IN ONLY 6000 MILES, DEALER HAS CHANGED OIL TWICE AND STATES THAT THIS IS NORMAL.   *SLC",
        "vin": "1G1YY32G415"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/14/2001",
        "dateOfIncident": "09/14/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 896359,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE SEAT ROCKS LIKE A ROCKING CHAIR WHILE DRIVING.  WHEN  PUTTING ON BRAKES  CHAIR GOES FORWARD, CAUSING  DRIVER  TO PRESS  BRAKE HARDER.   CONSUMER FEELS ITS A MANUFACTURING  DEFECT.  PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2001",
        "dateOfIncident": "05/08/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751905,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS BURNED SEVERAL QUARTS OF OIL SINCE I'VE OWNED IT.  IT BURNS APPROXIMATELY 1 TO 1 1/2 QUARTS EVERY ONE THOUSAND MILES.  THE DEALERSHIP SAID THE 2001 CORVETTES ALL HAVE THIS PROBLEM BECAUSE OF BAD PISTON RINGS.  THEY SIAD SOME CARS CONSUME AS MUCH AS 3 QUARTS OF OIL PER 1000 MILES.  THE AMOUNT OF OIL BURNED IS RELATIVE TO HOW HARD THE CAR IS DRIVEN.  THERE ARE KNOW REPLACEMENT PARTS AVAILABLE AT THIS TIME.  I THINK THE WHOLE ENGINE SHOPULD BE REPLACED ALONG WITH THE OIL SOAKED CATALITIC CONVERTER AND MUFFLERS.*AK",
        "vin": "1G1YY32G115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/16/2001",
        "dateOfIncident": "07/14/2001",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 892826,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAUGHT FIRE WHILE PARKED. FIRE STARTED IN CATALYTIC CONVERTER.  MANUFACTURER HAS BEEN NOTIFIED. *AK  MANUFACTURER REFUSES TO ACCEPT RESPONSIBILITY FOR THIS ACCIDENT, FIRE REPORT STATED THAT CAUSE OF FIRE WAS UNINTENTIONAL AND IT STARTED ON EXTERIOR PART OF VEHICLE.   *SLC",
        "vin": "1G1YY22G915"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/12/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748346,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE OIL CONSUMPTION IN CORVETTE Z06.  2.5 QUARTS USED IN 2400 MILES.  *AK",
        "vin": "1G1YY12S415"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748347,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 CORVETTE Z06- INTERMITTENT PROBLEM-ENGINE TURNS OVER WHEN STARTING BUT FAILS TO CONTINUE RUNNING WHEN STARTER DISENGAGED",
        "vin": "1G1YY12S415"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/16/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746927,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXHIBITS EXCESSIVE OIL CONSUMPTION, OVER 1 QUART PER 1000 MILES, AND HAS DONE SO SINCE NEW.  EXHAUST PIPES CONTAIN BLACK OILY RESIDUE.  COMPLAINTS HAVE BEEN FILED WITH THE CHEVROLET CUSTOMER ASSISTANCE CENTER.  THEY HAVE TOLD ME THAT A REPAIR FOR THE VEHICLE WILL NOT BE AVAILABLE UNTIL FALL 2001, WHICH IS UNACCEPTABLE TO ME.  I REQUESTED A BUY-BACK WHICH THEY DENIED.  I REQUESTED THAT CHEVROLET WRITE ME A LETTER EXPLAINING THEIR POSITION AND THEY REFUSED.*AK",
        "vin": "1G1YY12S915"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/04/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744922,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS BURNT 4 QUARTS OF OIL IN 6000 MILES. WAS TOLD BY DEALER THAT CHEVROLET KNOWS THIS IS A \"RING PROBLEM\" AND HAS YET TO ISSUE A REVISION PART TO CORRECT PROBLEM. HAS SENT ME HOME WITH A CASE OF OIL TELLING ME THAT THEY ARE ALREADY WAITING OVER 3 MONTHS FOR OTHER CAR OWNERS WITH SAME PROBLEM AND HAVE NO IDEA HOW LONG IT WILL TAKE CHEVY TO ISSUE REVISION PART. CAR IS RUNNING TERRIBLY. DEALER SAYS THIS IS B/C BURNT OIL RESIDUE IS LANDING ON PISTONS CAUSING CAR TO PERFORM POORLY. THEY CAN DO NOTHING TO HELP ME.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/25/2001",
        "dateOfIncident": "04/21/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744526,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCKED, BRAND NEW CAR STRANDED.*AK  REF. IN EA02-031 *CJS",
        "vin": "1G1YY22G915"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/22/2001",
        "dateOfIncident": "03/06/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 883816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A TOTAL LOSS IN ACCELERATION POWER DUE TO TRANSMISSION LINE NOT BEING INSTALLED PROPERLY. CONSUMER WAS TOLD THIS BY AN MECHANIC AT THE DEALERSHIP.*AK  WHILE DRIVING, CONSUMER NOTICED A PUFF OF SMOKE FOLLOWED BY A LOSS OF ACCELERATION, THE ONLY RESPONSE WHILE PRESSING THE ACCELERATOR WAS HIGH RPM'S, DEALER IS REFUSING TO REFUND THE PURCHASE PRICE OR EXCHANGE THE VEHICLE WITHOUT A SUBSTANTIAL FINANCIAL PENALTY.   *SLC",
        "vin": "1G1YY22GX15"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/22/2001",
        "dateOfIncident": "02/21/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 741303,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COPY OF COMPLAINT TO DEALER: I BROUGHT MY 2001 CORVETTE IN FOR SERVICE YESTERDAY. ONE OF MY COMPLAINTS WAS THE IMPROPER OPERATION OF THE DRIVER\u0012S SIDE SEAT BELT.  YOU REPLACED THE RETRACTOR ASSEMBLY.  THE NEW ONE IS FAR WORSE. I\u0012M NOT BLAMING YOU BECAUSE IT WAS OKAY WHEN I PICKED UP THE CAR. BY THE END OF THE DAY IT WAS ALL MOST IMPOSSIBLE TO PROPERLY EXTEND THE BELT TO BUCKLE IT. EVEN MORE DANGEROUS WAS THE FACT THAT IT LOCKS UP ON ME WHILE I\u0012M DRIVING, PINNING ME TO MY SEAT AND MAKING IT IMPOSSIBLE TO MANEUVER (LIKE CHECKING TO THE REAR WHEN BACKING UP)..... I WENT THROUGH ALMOST 3 YEARS WITH THIS NONSENSE WITH MY 1998 CORVETTE BEFORE CHEVY FINALLY RECALLED THE CAR. . *AK",
        "vin": "1G1YY32G115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/14/2001",
        "dateOfIncident": "09/22/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 559651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS AN ENGINE DEFECT WHICH CAUSES THE VEHICLE TO RUN ROUGH, HAVE POOR GAS MILEAGE, SMOKES AND HAS A OILY TAILPIPE DISCHARGE, SEVERAL REPAIR ATTEMPTS HOWEVER THE VEHICLE CONTINUES TO EXPERIENCE PROBLEMS, CONSUMER HAS HAD TWO OTHER CORVETTES PRIOR THAT HAVE EXPERIENCED PROBLEMS (NO VIN NUMBERS AVAILABLE ON OTHER VEHICLES).   *MJS",
        "vin": "1G1YY32G515"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/07/2000",
        "dateOfIncident": "11/19/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737444,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT TIMES AT HIGHWAY SPEEDS WHEN BRAKING FRONT BRAKES WILL STICK ON AND WILL NOT RELEASE. BEEN TO THE DEALER AND SAYS THEY KNOW OF THE PROBLEM,BUT UPON THEM TEST DRIVING CAR IT WILL NOT REPRODUCE THE PROBLEM. THEY SAY IF THEY CAN'T REPRODUCE THE PROBLEM, THEY CAN NOT FIX. OTHER 2000 AND 2001 CORVETTE OWNERS REPORT THIS  PROBLEM ON CORVETTEFORUM.COM.  *AK",
        "vin": "1G1YY22G715"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/07/2000",
        "dateOfIncident": "11/15/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737439,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL STICKS WHEN YOU JUST TAP IT TO SLOW DOWN.   PEDAL DOES NOT SPRING BACK UP AFTER  INITAL TAP. I HAVE TO PLACE MY FOOT BEHIND  BRAKE PEDAL TO LIFT T PEDAL BACK UP.  *AK",
        "vin": "1G1YY32G415"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/07/2000",
        "dateOfIncident": "11/15/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737439,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL STICKS WHEN YOU JUST TAP IT TO SLOW DOWN.   PEDAL DOES NOT SPRING BACK UP AFTER  INITAL TAP. I HAVE TO PLACE MY FOOT BEHIND  BRAKE PEDAL TO LIFT T PEDAL BACK UP.  *AK",
        "vin": "1G1YY32G415"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/04/2000",
        "dateOfIncident": "11/20/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737279,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON APPLICATION OF BRAKES AT HIGHWAY SPEEDS, WHEN THE DRIVER THEN LETS OFF OF THE BRAKES, THE PEDAL STAYS DOWN AND THE BRAKES ARE STILL APPLIED.  *AK",
        "vin": "1G1YY12S915"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/14/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874923,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL PULL TO LEFT OR RIGHT WHILE BRAKING. CONSUMER MUST HOLD STEERING WHEEL TIGHTLY EVEN AT LOW SPEEDS OR WILL LOSE CONTROL OF VEHICLE.  *AK  THE TIRE MANUFACTURER AND THE INDEPENDENT ALIGNMENT SPECIALISTS STATE THAT THE PROBLEM IS WITH THE SUSPENSION.   *SLC",
        "vin": "1G1YY22G415"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/09/2000",
        "dateOfIncident": "10/29/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ABOUT 65/70 MPH VEHICLE COMPELETELY TURNED OFF.  VEHICLE WAS BROUGHT TO  DEALERSHIP. DEALERSHIP  WAS NOT ABLE TO DETECT THE PROBLEM.  *AK",
        "vin": "1G1YY125615"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/01/2000",
        "dateOfIncident": "10/18/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735546,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES DO NOT FULLY RELEASE.  WHEN BRAKES APPLIED AND REPLEASED, THEY STUCK AND CONTINUED TO BRAKE.  DEALER ACKNOWLEDGED PROBLEM, BUT WILL NOT REPLACE BRAKE BOOSTER WHICH SEEMED TO BE CULPRIT BECAUSE IT APPEARED TO BE OPERATIONAL TO SPEC.*AK",
        "vin": "1G1YY22G215"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/31/2000",
        "dateOfIncident": "09/07/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735534,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECT #1: BRAKES STICK CLOSED AT RANDOM TIMES.  SEEMS RELATED TO ENGINE RPM AND TO DECELERATION. DEFECT #2:  DRIVERS SIDE SEAT BELT & HARNESS WILL NOT EXTEND AT RANDOM INTERVALS.  INERTIA REEL APPEARS TO LOCK SEVERAL TIMES AS THE BELT IS DEPLOYED.",
        "vin": "1G1YY12S315"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/26/2000",
        "dateOfIncident": "10/23/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 735175,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "1G1YY32G715"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/07/2000",
        "dateOfIncident": "09/07/2000",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 730626,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CORVETTE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL 1997-2001 CORVETTES ARE BEING SHIPPED WITH A DEFECTIVE COLUMN LOCK, CAUSING STEERING WHEEL TO LOCK AND LEAVE OWNERS OF $50,000 SPORTS CARS STRANDED!  GM WILL NOT ADDRESS THIS ISSUE.  PLEASE INVESTIGATE THIS SITUATION.  YOU WILL FIND NUMEROUS CASES OF FAILURE AND FIXES BY GM WITH THE ORIGIONAL DEFECTIVE PART.  THESE THINGS FAIL REPEATEDLY!  THANK YOU.  REF. IN EA02-031 *CJS",
        "vin": ""
    }
]