[
    {
        "components": "STRUCTURE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/15/2021",
        "dateOfIncident": "10/27/2021",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11440472,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "My car lit on fire under the hood",
        "vin": "2g4wb55kx11"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "09/18/2020",
        "dateOfIncident": "08/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11359843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A FRONT TIRE BLOW OUT CAR WENT ACROSS THE ROAD DOWN INTO SMALL DITCH AND STOPPED TO HIT A MAILBOX RESULTING IN THE AIRBAGS DEPLOYING THE PASSENGER SIDE AIRBAG CAME OUT SO HARD THAT IT BROKE THE WINDSHIELD DRIVER SIDE AIRBAG CAME OUT AND RESULTED IN IT BREAKING MY SPINE I'VE HAD TO HAVE ONE SURGERY SINCE THEN AND MAYBE MORE",
        "vin": "2G4WB52K711"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/30/2020",
        "dateOfIncident": "04/14/2020",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11322853,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHILE THE VEHICLE WAS IDLING FLAMES APPEARED FROM UNDER THE HOOD.      NO INJURIES WERE REPORTED.     THE CAUSE WAS UNDETERMINED.     THE CONTACT STATED THAT WHILE PARKED WITH THE ENGINE ON FLAMES WERE SUDDENLY PRESENT COMING FROM UNDER THE HOOD OF THE VEHICLE. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE AND EXTINGUISHED THE FLAMES. A FIRE DEPARTMENT AND POLICE DEPARTMENT REPORTS WERE TAKEN AT THE SCENE. THE VEHICLE WAS DESTROYED. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED OF THE FAILURE. THE VIN LOOK UP INDICATED THAT THE VEHICLE WAS INCLUDED IN THE NHTSA RECALL CAMPAIGN: 15V701000 (ENGINE AND ENGINE COOLING). THE CONTACT INDICATED THAT THE VEHICLE HAD EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "2G4WB55KX11"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/22/2020",
        "dateOfIncident": "01/12/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11321881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSING OIL NOT VISIBLE, APPEARS TO BE VALVE COVER GASKET, OIL PAN, HOSE.  ADDING A QUART A MONTH.",
        "vin": "2G4WB55K511"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/08/2020",
        "dateOfIncident": "02/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11316888,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL FIXED THE FRONT VALVE COVER AND THE REAR ONE SHOULD OF BEEN DONE ALSO DUE TO THE LEAKING OF OIL THAT COULD POTENTIALLY START A FIRE FROM LEAKING ON THE BLOCK AND POSSIBLY BURN ON THE EXHAUST MANIFOLD.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "STEERING,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2019",
        "dateOfIncident": "09/19/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288811,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOING ALMOST 50 WHEN IT SHUT OFF WITH NO WARNING THE STEERING WHEEL LOCKED UP THE BRAKES WERE NOT WORKING. THE FIRST TIME THIS HAPPENED I JUST LET THE CAR COAST TO A STOP, THE SECOND TIME WAS EXACTLY THE SAME EXCEPT I PUT THE CAR IN NEUTRAL WHILE I STILL HAD A GOOD BIT OF SPEED AND CRUNK IT BACK UP. THE CAR ALWAYS CRANK RIGHT BACK UP WITH NO PROBLEM AND DRIVES FINE. I'VE CHANGE MY FUSES AND CERTAIN LIGHTS (LOW TIRE, LOW COOLANT, CHECK ENGINE)ON THE DASHBOARD WON'T GO OFF AND I JUST RECENTLY HAD MY CAR INSPECTED IN WHICH IT PASSED",
        "vin": "2G4WB55K711"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/04/2018",
        "dateOfIncident": "02/04/2018",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR A YEAR AGO. TODAY I TRIED TO CRANK THE CAR WHILE SITTING IN MY YARD A BIG BOOM HAPPENED AND THE CAR ENGINE CAUGHT ON FIRE. THE PLASTIC COVERING MELTED OFF THE ENGINE AS WELL AS SOME OF THE BACK PART OF THE ENGINE IT WAS ENGULFED IN FLAMES. THE RECALLS ASSOCIATED MANUFACTURER RECALL NUMBERN150757  NHTSA RECALL NUMBER15V701",
        "vin": "2G4WB55K511"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/23/2018",
        "dateOfIncident": "01/22/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064479,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 1997-2004 \"W PLATFORM\" GM AUTOS, INCLUDING MY REGAL, THE ABS SENSOR DESIGN IS FLAWED IN THAT IT'S WIRING IS LOCATED IN AN EXPOSED LOCATION AT THE INSIDE BOTTOM OF THE WHEEL HUB THAT ANY ROAD DITRITUS CAN IMPACT, CAUSING THE TRACK SYSTEM OFF DASH LIGHT TO COME ON AND ABS BRAKING TO FAIL.   I AM NOW ON MY 6TH REPLACEMENT INCIDENT SINCE 2006, WHEN IT HAPPENED THE 1ST TIME. (2 EACH ON THE FRONT WHEEL HUBS AND 1 ON A REAR. DO NOT KNOW AT THIS TIME WHICH WHEEL IS INVOLVED THIS TIME,)   EVERY TIME THE LITTLE SENSOR WIRE BREAKS OR GETS CUT & YOU CAN'T JUST FIX THE WIRE, IT REQUIRES A TOTAL REPLACEMENT OF THE WHEEL HUB AND COSTS NEARLY $500 A POP. THE WIRE IS RIDICULOUSLY EASY TO DAMAGE JUST BY DRIVING THROUGH PLOW DRIFT IN THE DRIVEWAY OR HITTING SMALL TREE BRANCH DETRITUS ON THE ROAD THAT BOUNCES OFF THE UNDERCARRIAGE AND SNAGS THE WIRE. MOST COMMONLY IT BREAKS INSIDE THE INSULATION AND INTERMITENTLY SHORTS OUT WHEN IT GETS WET, (& DISAPPEARS WHEN IT DRIES OUT AGAIN) CAUSING THE ABS SYSTEM TO STUTTER WHEN BRAKING, & MAKING IT EVEN MORE EXPENSIVE TO DIAGNOSE BEFORE FIXING (AN EXTRA $129). SINCE IT'S A COMMON (& FREQUENT) DANGEROUS SAFETY DEFECT ON ALL \"W PLATFORM\" GM VEHICLES FROM '97-'04, I FIND IT CURIOUS THAT THE NTSB HASN'T ORDERED GM TO FIND A FIX FOR THIS LONG AGO.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2017",
        "dateOfIncident": "07/15/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11022320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHILE DRIVING APPROXIMATELY 65 MPH AND PULLING INTO A PARKING LOT, THE CONTACT NOTICED SMOKE UNDERNEATH THE HOOD. THE CONTACT EXITED THE VEHICLE AND RAN INTO FERRY FACILITY TO CALL THE FIRE DEPARTMENT. THE CONTACT STATED THAT BY THE TIME THE FIRE DEPARTMENT ARRIVED AT THE SCENE, THE VEHICLE WAS ENGULFED IN FLAMES. THE CONTACT WAS NOT SURE WHETHER A FIRE REPORT WAS FILED. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE VEHICLE WAS DESTROYED AND THE REMNANT WAS TOWED AWAY. THERE WERE NO INJURIES. THE DEALER AND THE MANUFACTURER WERE NOT CONTACTED. APPROXIMATELY SEVEN MONTHS LATER, THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE FAILURE MILEAGE WAS APPROXIMATELY 170,000. PARTS DISTRIBUTION DISCONNECT. *BF  *JS",
        "vin": "2G4WB55K511"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/26/2017",
        "dateOfIncident": "04/09/2017",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10991864,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHILE THE VEHICLE WAS PARKED ON A LOCAL STREET, IT CAUGHT FIRE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. A PASSERBY NOTICED THE VEHICLE WAS ON FIRE AND CONTACTED THE FIRE AND POLICE DEPARTMENTS. A FIRE AND A POLICE REPORT WERE FILED. THE CAUSE OF THE FIRE WAS NOT DETERMINED. THE VEHICLE WAS TOWED AND DEEMED DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2G4WB52K911"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/19/2017",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979361,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THE IGNITION ANTI-THEFT CHIP CAUSED THE VEHICLE TO STALL WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT STATED THAT HE REPLACED THE KEY, WHICH RESOLVED THE FAILURE FOR APPROXIMATELY ONE YEAR; HOWEVER, THE FAILURE PERSISTED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 170,000.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "04/04/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL... WHILE DRIVING IN OUR CITY ALL INSTRUMENT PANEL LIGHT WENT TO FLASHING AND THE GAUGES WERE QUIVERING, BELLS WENT OFF AND MY CAR DIED RIGHT THERE IN THE TRAFFIC WHILE GOING 25 MPH.  I HAD MY DAUGHTER AND GRANDSON IN THE CAR WITH ME AND BY THE GRACE OF GOD WE AVOIDED AN ACCIDENT. CAR WOULDN'T RESTART FOR ABOUT 10 MINUTES BUT EVENTUALLY DID WITH THE SAME THING HAPPENING WITH THE INSTRUMENT PANEL. DAUGHTER GOT THE CAR OFF THE ROAD. HUSBAND GOT THE CAR HOME AND LEFT IT. IT WOULDN'T START BACK THE NEXT DAY BUT AFTER CONTINUALLY TRYING IT EVENTUALLY STARTED BUT HAD A HORRIBLE GRINDING NOISE AND THE INSTRUMENT PANEL STILL GOING CRAZY. HUSBAND CALLED OUR LOCAL GARAGE WHILE I STARTED A SEARCH ON THE WEB FOR POSSIBLE EXPLANATIONS. I CAME ACROSS  OTHERS WITH THE SAME COMPLAINT AS WE WERE EXPERIENCING AND FOUND THAT THEIR PROBLEM WAS THE IGNITION SWITCH. OUR LOCAL GARAGE SUGGESTED WE LOOK FOR GROUND WIRE PROBLEMS. I WATCHED A VIDEO OF A CAR DOING THE SAME THING MINE WAS DOING, THAT PERSON REPLACED THE IGNITION SWITCH AND ALL WAS WELL. I READ AND WATCHED A VIDEO OF WHERE ONE SAID TO TURN ON THE FLASHERS OR HEADLIGHTS BEFORE TRY TO START THE CAR, THIS ALLOWED THE CAR TO START WITH NO PROBLEMS. TRIED IT AND IT WORKED. ONE OTHER THING WITHOUT THE FLASHERS OR HEADLIGHTS ON, THE SIFTER IS LOCKED AND WILL NOT COME OUT OF PARK. CALLED OUR LOCAL DEALERSHIP ABOUT A RECALL AND WAS LAUGHED AT AND SPOKEN TO AS IF I WAS A CHILD. SHE SAID IF THERE WAS A PROBLEM WITH THE IGNITION SWITCH AND 1 PERSON HAD A COMPLAINT THERE WOULD HAVE BEEN A RECALL. I TOLD HER THERE WAS PLENTY DOCUMENTATION ON YOUTUBE TO GO WATCH IT. I AM READING MANY THAT ARE CALLING THIS AS A \"DEATH TRAP\" AND THAT SOME HAVE DIED BECAUSE OF THIS PROBLEM.  *TR",
        "vin": "2G4WB55K411"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "12/15/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956124,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. AFTER STARTING THE ENGINE, A LOUD BOOMING SOUND WAS HEARD COMING FROM THE ENGINE. UPON INSPECTION, THE CONTACT DISCOVERED SMOKE UNDER THE HOOD. THE VEHICLE WAS TOWED TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE INTAKE MANIFOLD WAS FAULTY AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED FOR THE SAME FAILURE PER NHTSA CAMPAIGN NUMBER: 09V116000 (ENGINE) ON SEPTEMBER 20, 2016. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE  THE FAILURE MILEAGE WAS 232,000. UPDATED 05/16/17*LJ    *CN    THE CONSUMER STATED AFTER THE VEHICLE WAS REPAIRED UNDER RECALL THE UPPER INTAKE MANIFOLD EXPLODED.  *JS",
        "vin": "2G4WB55K311"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "02/07/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928741,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHILE THE VEHICLE WAS PARKED AND THE ENGINE WAS STARTED, THE VEHICLE CAUGHT FIRE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE AND A FIRE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED. THE VEHICLE WAS DESTROYED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE, ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 80,000.  UPDATED 04/11/17 L'S  CONSUMER STATED VEHICLE WAS PARKED AT OWNERS HOME WHEN KEY WAS TURNED TO START CAR - YOU COULD HEAR THE EXPLOSION FROM THE HOUSE INSIDE. UPDATED 9/7/18*JP",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2016",
        "dateOfIncident": "11/22/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHILE DRIVING 55 MPH, THE ENGINE CAUGHT FIRE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. THE VEHICLE WAS TOWED AND DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FIRE. THE FAILURE MILEAGE WAS 130,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2016",
        "dateOfIncident": "11/01/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10925381,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. WHILE DRIVING, AN ELECTRICAL BURNING ODOR WAS PRESENT INSIDE THE VEHICLE. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. NO FURTHER INFORMATION WAS AVAILABLE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/04/2016",
        "dateOfIncident": "10/31/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10924327,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. WHILE DRIVING APPROXIMATELY 70 MPH, THE VEHICLE LOST POWER AND THE STEERING WHEEL TIGHTENED WITHOUT WARNING. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD. SMOKE AND FLAMES APPEARED UNDER THE HOOD. THE FIRE WAS EXTINGUISHED BY THE POLICE AND A POLICE REPORT WAS FILED. THE CONTACT WAS INJURED, BUT DID NOT RECEIVE MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 155,000.",
        "vin": "2G4WB55K611"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/19/2016",
        "dateOfIncident": "09/12/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. WHILE DRIVING 55 MPH, THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO DIAGNOSED THAT THE MODULE WAS FAULTY. THE MANUFATURER WAS NOTIFIED THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 155,000.  UPDATED 03/01/17*LJ",
        "vin": "2G4WF551311"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "09/03/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903713,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHEN THE CONTACT STARTED THE VEHICLE, THE ENGINE CAUGHT FIRE. A FIRE REPORT WAS FILED AND THERE WERE NO INJURIES. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE VEHICLE WAS DESTROYED AND TOWED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "2G4WB55K611"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/27/2016",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888937,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) EXCEEDED A REASONABLE AMOUNT OF TIME FOR REPAIR. THE CONTACT RECEIVED THE RECALL NOTIFICATION IN DECEMBER OF 2015. THE DEALER ADVISED THAT THEY RECEIVED TWO PACKAGES OF PARTS PER WEEK; THEREFORE, THE REPAIR COULD NOT BE PERFORMED IMMEDIATELY. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS UNKNOWN. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2016",
        "dateOfIncident": "01/07/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10884303,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/04/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883004,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE TO LITTLE CEASERS TO GET PIZZA, I TURNED  THE CAR OFF AND WENT INSIDE, APPROXIMATELY 5 MIN LATER AND SOMEONE CAME INSIDE AND SAID THAT SOMEONE'S CAR WAS SMOKING, I WENT OUTSIDE AND IT WAS SMOKING HEAVILY FROM THE FRONT OF THE CAR, A WITNESS CALLED 911, BY THE TIME THE FIRE DEPARTMENT SHOWED UP THE FRONT OF THE VEHICLE WAS IN FLAMES, A TIRE EXPLODED AND THE FIRE DEPT WAS ABLE TO PUT IT OUT, THE ENGINE COMPARTMENT IS COMPLETELY BURNED DOWN, I STARTED DOING RESEARCH AND FOUND OUT THAT THERE WERE RECALLS MENTIONING POSSIBLE FIRE HAPPENING EVEN WHILE THE CAR IS UNATTENDED, IT WAS NOT RUNNING WHEN FIRE STARTED AND IT DROVE FINE ON THE WAY THERE, WAS NOT HOT OR SMOKING WHILE I WAS DRIVING. THANK GOD NO ONE WAS HURT AND THAT THE FIRE DID NOT REACH THE GAS TANK. I AM AT A LOSS ON WHAT TO DO AND NEED HELP.",
        "vin": "2G4WB55K911"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/05/2016",
        "dateOfIncident": "07/01/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881200,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL.  CONSUMER WRITES IN REGARDS TO PARTS NOT AVAILABLE TO REPAIR DEFECTIVE RECALL NOTICE 15757.  *SMD  THE CONSUMER STATED THE VEHICLE CAUGHT FIRE. ALSO, THE VEHICLE HAD AN OVERHEATING PROBLEM.  *JB",
        "vin": "2G4WF551811"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/09/2016",
        "dateOfIncident": "07/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) AND STATED THAT THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCE A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G4WB55K611"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/13/2016",
        "dateOfIncident": "03/13/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864758,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT WHILE ADDING ENGINE OIL, THE VEHICLE CAUGHT ON FIRE. THE CONTACT WAS ABLE TO EXTINGUISH THE FIRE. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART TO REMEDY THE RECALL WAS UNAVAILABLE. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNAVAILABLE. PARTS DISTRIBUTION DISCONNECT. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "11/15/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864910,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL.  CONSUMER WRITES IN REGARDS TO VEHICLE ENGINE FIRE AND RECALL NOTICE THAT STATES DROPS OF ENGINE OIL DEPOSIT ON EXHAUST MANIFOLD COULD CAUSE ENGINE COMPARTMENT FIRE.  CONSUMER SEEKS REIMBURSEMENT FOR FAIR MARKET VALUE OF VEHICLE.  *SMD",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "11/16/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL.  CONSUMER WRITES IN REGARDS TO INFORMATION SENT TO CUSTOMER SERVICE ABOUT VEHICLE FIRE AND ENGINE OIL DEPOSIT ON EXHAUST MANIFOLD RECALL NOTICE.  *SMD   THE CONSUMER STATED BY THE TIME HE RECEIVED THE RECALL NOTICE, THE VEHICLE HAD ALREADY CAUGHT ON FIRE. *JB",
        "vin": "2G4WB52K511"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863957,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G4WB55K311"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863995,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE TOOK OUR CAR IN FOR RECALL REPAIR ON WEDNESDAY APRIL 6, 2016. WHEN THE DEALER RETURNED OUR CAR IT CUT OFF CONTINUOUSLY. AS A MATTER IF FACT IT CUT OFF WHILE WE WERE DRIVING ON A MAJOR BUSY STREET. WE RETURNED  THE CAR TO THE DEALER EXPLAINING THAT THIS WAS NOT A PROBLEM WHEN WE BROUGHT THE CAR IN FOR THE RECALL REPAIRS. THE DEALER HAS HAD OUR CAR FOR A MONTHS AND STATED THAT IT WAS SOMETHING ELSE AND IT WOULD COST $400. WE TOLD THE DEALER WE DID NOT HAVE $400. THIS IS THE THIRD TIME WE HAVE BROUGHT OUR CAR TO CORRECT THE PROBLEM. OUR DAUGHTER WENT WITH US TO THE DEALER AND WAS TOLD THAT THEY WOULD CUT HALF OF THE COST FOR REPAIR AND THAT OUR CAR WOULD BE READY FRIDAY, MAY 6, 2016. THE DEALER STILL HAS OUR CAR AND STATED THE PART THAT WAS ORDERED DID NOT FIX THE PROBLEM. WE HAVE NOT HEARD ANYTHING FROM THE DEALER AS OF TODAY, MONDAY, MAY 9, 2016.    WE ARE SENIOR CITIZENS AND WAS TOLD NOT TO DRIVE THE CAR AND NOT TO PARK IT IN THE GARAGE BECAUSE IT MIGHT CATCH ON FIRE. WE HAVE BEEN WITHOUT OUR CAR SINCE WE RECEIVED THE RECALL LETTER AND WAITING ON THE PART TO ARRIVE AT THE DEALER.   WE ARE VERY FRUSTRATED AND DISAPPOINTED WITH THE CUSTOMER SERVICE WE HAVE RECEIVED DURING THIS RECALL PROCESS.  WE HAVE BEEN INCONVENIENCED AND THERE HAS BEEN NO TYPE OF COMPENSATION OFFERED FOR THE INCONVENIENCE. NOT A LOANER CAR OR RENTAL CAR. WE HAVE HAD TO CANCEL DOCTOR'S APPOINTMENTS BECAUSE WE HAVE  NO CAR TO DRIVE.      WE ARE REALLY CONTEMPLATING LEGAL ACTIONS.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,UNKNOWN OR OTHER,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2016",
        "dateOfIncident": "05/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STATIONARY AND IN MOTION ON HIGHWAY AND ON CITY STREETS WHEN THE TURN SIGNAL ISTURNED ON THE VEHICLE SHUTS OFF, AND WHEN ATTEMPTING TO RESTART VEHICLE WITH TURN SIGNALS OFF THE ELECTRONICS FLASH AS IF THEY ARE CONNECTED TO FLASHER RELAY",
        "vin": "2G4WB55K511"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/15/2016",
        "dateOfIncident": "11/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855724,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. WHILE THE VEHICLE WAS UNDERGOING ROUTINE SERVICE, THE TECHNICIAN NOTICED THAT THE REAR GASKET WAS LEAKING OIL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) AND STATED THAT THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 98,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2016",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10855410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/11/2016",
        "dateOfIncident": "04/11/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10854855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V701000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2G4WB55K911"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2016",
        "dateOfIncident": "04/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853759,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. WHILE DRIVING 35 MPH, THE CONTACT HEARD AN ABNORMAL NOISE COMING FROM THE FRONT OF THE VEHICLE. THE CONTACT STATED THAT THE STEERING WHEEL BECAME DIFFICULT TO TURN. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. ON SEVERAL OCCASIONS, WHEN THE VEHICLE WAS PLACED IN THE PARK POSITION, IT WAS DIFFICULT TO REMOVE THE KEY FROM THE IGNITION. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 71,000.",
        "vin": "2G4WF551511"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2016",
        "dateOfIncident": "03/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING OIL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE PART NEEDED FOR THE REPAIR WAS NOT AVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 58,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/21/2016",
        "dateOfIncident": "01/18/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10849542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL.  CONSUMER WRITES IN REGARDS TO PARTS NOT AVAILABLE TO REPAIR EXHAUST MANIFOLD ENGINE COMPARTMENT FIRE RECALL NOTICE.  *SMD  THE CONSUMER STATED ON JANUARY 18, 2016 THE VEHICLE CAUGHT ON FIRE. *JB",
        "vin": "2G4WB55K711"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10850408,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PARTS TO DO THE RECALL REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G4WB55K411"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2016",
        "dateOfIncident": "02/10/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT WHILE DRIVING AT 55 MPH, THE CONTACT NOTICED A BURNING ODOR COMING THROUGH THE AIR VENTS. THE FAILURE RECURRED ON NUMEROUS OCCASIONS.  THE VEHICLE WAS TAKEN TO A DEALER BUT WAS NOT DIAGNOSED OR REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART NEEDED TO REPAIR THE VEHICLE WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/08/2016",
        "dateOfIncident": "03/01/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10845647,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\" VERY HARD TO STEER AND STEERING WHEELS LOCKS UP FEELS LIKE THE VEHICLE WILL NOT MOVE WHEN YOU NEED IT. I AM SCARED THAT AS I AM TURNING THE STEERING WHEEL WILL LOCK ALSO HAS A BAD LEAK AND THE BELT FEELS LIKE IT WILL POP. MY VEHICLE WAS IN MOTION DRIVING DOWN THE STREET AND AT ANOTHER TIME I WAS TRYING TO PARK.",
        "vin": "2G4WBDDK611"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2016",
        "dateOfIncident": "01/01/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHEN THE VEHICLE WAS STARTED, IT BURST INTO FLAMES. THE FAILURE OCCURRED WITHOUT WARNING. THE VEHICLE WAS EXTINGUISHED BY THE FIRE DEPARTMENT. THE VEHICLE WAS DEEMED DESTROYED. THERE WERE NO INJURIES. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) AFTER THE FAILURE OCCURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT PROVIDED.",
        "vin": "2G4WB55K911"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2016",
        "dateOfIncident": "11/20/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837775,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED THAT THE ENGINE COMPARTMENT WAS ON FIRE. THE FIRE DEPARTMENT WAS ABLE TO EXTINGUISH THE FIRE. A POLICE REPORT WAS FILED. THE VEHICLE WAS NOT DIAGNOSED AND WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE FAILURE MILEAGE WAS 80,000.",
        "vin": "2G4WB55K3Y1"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2016",
        "dateOfIncident": "10/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER THE PART TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K111"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "02/12/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836388,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THERE WAS A FUEL ODOR EMITTED FROM THE FRONT OF THE VEHICLE. THE CONTACT OPENED THE HOOD AND NOTICED FLAMES COMING FROM THE MANIFOLD AND THE GASKET COVER. THE CONTACT ATTEMPTED TO EXTINGUISH THE FIRE. THERE WERE NO REPORTS FILED. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHO REPLACED THE S COVER, S RETAINER, AND GASKET. THE CONTACT STATED THAT THE CHECK ENGINE LIGHT WAS ILLUMINATED AND ALL THE BODY DAMAGE TO THE VEHICLE WAS NOT REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING), WHICH STATED THAT THE CONSEQUENCE FOR THE RECALL COULD RESULT IN A FIRE. THE CONTACT STATED THAT THE FAILURE EXPERIENCED DIRECTLY RELATED TO THE FAILURE INDICATED IN THE RECALL NOTICE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. PARTS DISTRIBUTION DISCONNECT. THE APPROXIMATE FAILURE MILEAGE WAS 154,000.",
        "vin": "2G4WF551311"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "02/15/2016",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED SMOKE COMING FROM THE ENGINE COMPARTMENT. THE CONTACT OPENED THE HOOD OF THE VEHICLE AND THE ENGINE COMPARTMENT WAS ON FIRE. THE FIRE DEPARTMENT WAS NOTIFIED AND WAS ABLE TO EXTINGUISH THE FIRE. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "2G4WB52K911"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10836563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM THE NHTSC ABOUT A PROBLEM WITH POSSIBLE OIL LEAK AND FIRE IN MY ENGINE. I WAS INFORMED THAT A REMEDY IS NOT YET AVAILABLE FOR THIS PROBLEM. I HAVE ONLY THIS ONE VEHICLE AND I AM IN FEAR OF A TRAFFIC ACCIDENT.",
        "vin": "2GWB55K5111"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825050,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT SMELLED A STRONG ODOR OF BURNING ENGINE OIL INSIDE AND OUTSIDE THE VEHICLE. THE ENGINE OIL WAS VISIBLE ON THE GROUND. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 159,000. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K911"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/09/2016",
        "dateOfIncident": "12/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10825087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K311"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824789,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT DIAGNOSED THE VEHICLE WAS LEAKING FUEL. IN ADDITION, THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS NOT PROVIDED. VIN TOOL CONFIRMS PARTS UNAVAILABLE.",
        "vin": "2G4WF521611"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2016",
        "dateOfIncident": "12/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2G4WF551711"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/04/2016",
        "dateOfIncident": "12/14/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824285,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE PART NEEDED WAS UNAVAILABLE TO PERFORM THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  PARTS DISTRIBUTION DISCONNECT.   UPDATED 03/16/16*LJ  UPDATED 03/30/16.*JB",
        "vin": "2G4WB55K111"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "12/02/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823514,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVAILALBE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K411"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821783,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTHER RECEIVED GM SAFETY RECALL 15757 IN DECEMBER 2015. SHE HAS GONE TO HER BUICK DEALER TWICE, BUT THE PART IS NOT YET AVAILABLE.  THEY TOLD HER TO KEEP HER CAR OUT OF THE GARAGE.  SHE IS 90 YEARS OLD, AND DRIVEWAY IS ON A SLANT.  SHE LIVES IN THE CHICAGO AREA, SO THERE IS ICE AND SNOW, EXTREMELY DANGEROUS FOR HER TO GO OUTSIDE IN THE DRIVEWAY TO A SNOW AND ICE COVERED CAR AND DRIVEWAY.  I CALLED GM 10 DAYS AGO FOR HER, SPOKE WITH A PERSON NAMED LEE, AND EXPLAINED THE SITUATION.  HE SAID HE WOULD CONTACT US, AND NEVER HAS.  SHE CANNOT KEEP THE CAR OUTSIDE, AND BE SAFE ENTERING THE VEHICLE.  I ASKED FOR A LOANER UNTIL GM FIXES THE PROBLEM.  I HAVE NOT HEARD FROM GM IN 10 DAYS.  SHE WAS TOLD BY  YOUR LETTER THAT THERE CAN BE AN ENGINE COMPARTMENT FIRE, AND HER GARAGE IS ATTACHED TO HER HOUSE.  SHE IS TERRIFIED TO KEEP THE CAR IN THE GARAGE SO SHE KEEPS IS OUTSIDE ON THE SLANTED DRIVE IN THE ICE AND SNOW.  IF SHE SLIPS AND FALLS, YOU UNDERSTAND WE WILL HOLD GM ACCOUNTABLE SINCE SHE TRIED TO FIX THE PROBLEM TWICE AT HER BUICK DEALERSHIP.  CAN YOU GIVE HER A LOANER CAR SHE CAN KEEP IN THE GARAGE?",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/12/2016",
        "dateOfIncident": "08/29/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 45 MPH, THE CONTACT NOTICED SMOKE COMING FROM THE HOOD OF THE VEHICLE. THE CONTACT DROVE HOME AND DISCOVERED THAT THE ENGINE COMPARTMENT WAS ON FIRE. THE FIRE DEPARTMENT EXTINGUISHED THE FIRE. A FIRE REPORT WAS FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE MOTOR AND THE SPARK PLUGS NEEDED TO BE REPLACED BUT THE FAILURE WAS NOT DETERMINED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT MENTIONED THAT SHE RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) AFTER THE FAILURE OCCURRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2016",
        "dateOfIncident": "03/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. WHILE INSPECTING THE VEHICLE, THE CONTACT NOTICED OIL DRIPPING FROM THE ENGINE VALVE COVER GASKET ONTO THE MANIFOLD. THE CONTACT RECENTLY RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING). THE PARTS NEEDED WERE NOT AVAILABLE. THE DEALER INFORMED THE CONTACT THAT THE PARTS NEEDED WERE NOT AVAILABLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 187,000.",
        "vin": "2G4WB55K311"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2016",
        "dateOfIncident": "08/28/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818984,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. AFTER HAVING A FUEL PUMP PLACED ON THE VEHICLE BY AN INDEPENDENT MECHANIC, THE VEHICLE CAUGHT FIRE IN THE CONTACT'S DRIVEWAY. THE CONTACT EXTINGUISHED THE FIRE. A FIRE REPORT WAS NOT FILED AND THERE WERE NO INJURIES. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) AFTER THE FIRE OCCURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 160,000.",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2015",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816606,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THE VEHICLE WAS PARKED IN THE GARAGE AND WAS LEAKING OIL FROM THE FRONT OF THE VEHICLE. THE CONTACT MENTIONED THAT SEVERAL WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB52K111"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2015",
        "dateOfIncident": "12/18/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811902,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2015",
        "dateOfIncident": "01/11/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "10-15 MINUTES AFTER BUICK WAS PARKED IT CAUGHT FIRE. JAN. 2014.   I KNOW FIND THERE IS A RECALL FOR OIL ON EXHAUST MANIFOLD . I CONTACTED BUICK AND GOT THE RUN AROUND  AND DO FEEL I AM DUE SOME COMPENSATION    HOWEVER DO NOT KNOW HOW TO GO FORWARD.",
        "vin": "2G4WB55K611"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/18/2015",
        "dateOfIncident": "11/07/2010",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811190,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 BUICK REGAL. THE CONTACT STATED THAT THE FRONT OF THE VEHICLE CAUGHT ON FIRE, WHILE PARKED. THE FIRE DEPARTMENT WAS NOTIFIED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 140,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2015",
        "dateOfIncident": "12/17/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811000,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2015",
        "dateOfIncident": "09/14/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THERE WAS A PROGRESSING ODOR WHICH MAY HAVE BEEN ASSOCIATED WITH THE MOTOR OR ENGINE THAT CONTINUED TO WORSEN. AS THE FAILURE CONTINUED, THE SERVICE ENGINE WARNING LIGHT REMAINED ILLUMINATED FOR AN EXTENDED PERIOD OF TIME. THE VEHICLE WAS TAKEN TO MORE THAN TWO DEALERS AND THEY WERE NOT ABLE TO REPLICATE AND DIAGNOSE THE FAILURE. THE CONTACT LATER RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) AND THE DEALER WAS UNABLE TO DETERMINE WHEN THE PART WOULD BECOME AVAILABLE. THE DEALER STATED THAT THE CONTACT WOULD HAVE TO WAIT TO RECEIVE THE SECOND NOTIFICATION LETTER. THE CONTACT WAS UNABLE TO DETERMINE WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND WAS UNABLE TO DETERMINE WHEN THE RECALL REPAIR PART WOULD BE AVAILABLE TO REPAIR THE VEHICLE. THE FAILURE MILEAGE WAS NOT AVAILABLE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K611"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2015",
        "dateOfIncident": "06/20/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810731,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THERE WAS A BURNING ODOR COMING FROM THE ENGINE COMPARTMENT OF THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO BE DIAGNOSED OR INSPECTED. THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 15V701000 (ENGINE AND ENGINE COOLING) HOWEVER, THE PARTS TO DO THE RECALL REPAIR WAS UNAVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 93,764. THE VIN TOOL CONFIRMS THE PARTS NOT AVAILABLE.",
        "vin": "2G4WB55K511"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/03/2015",
        "dateOfIncident": "03/06/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788070,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTRUMENT PANEL ODOMETER LIGHTING HAS GONE OUT TWICE CAR IS STATIONARY, REPAIR IS COSTLY AND REQUIRES THE ENTIRE DASH TO BE TAKEN OUT FOR REPAIR.",
        "vin": "2G4WB55K113"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/17/2015",
        "dateOfIncident": "01/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734684,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAN'T GET KEY OUT OF IGNITION WHEN TRYING TO TURN OFF ENGINE. WHY WASN'T 2001 BUICK REGAL RECALLED FOR IGNITION PROBLEM. THE KEY GETS STUCK AND I CAN'T TURN OFF ENGINE. I HAVE TO TURN KEY BACK AND FORTH OR PUT CAR IN DRIVE AND INPARK TO GET KEY OUT. THIS HAPPENS 9 OUT OF 10 TIMES I DRIVE CAR. PLEASE DO SOMETHING ABOUT THIS PROBLEM.",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2015",
        "dateOfIncident": "02/01/2015",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I TRIED TO CRANK CAR ON COLD MORNING TO GO TO CHURCH, A LOUD BOOM OCCURRED UNDER HOOD FOLLOWED BY SMOKE BILLOWING OUT. I IMMEDIATELY RAISED THE HOOD AND SAW FLAMES ON TOP OF ENGINE. I RAN IN HOUSE AND GOT BAKING SODA AND THREW ON FIRE WHICH PUT IT OUT.  *TR",
        "vin": "2G4WB55A911"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/14/2014",
        "dateOfIncident": "07/06/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10664188,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME IT HAPPENED WAS ON THE INTERSTATE AND I HAD SET THE CRUISE CONTROL AND MY SPEED STARTED TO INCREASE SLOWLY AT FIRST THEN IT INCREASED AT A RAPID RATE.SO I TAPPED THE BRAKE AND IT DISENGAGED . WHEN I REENGAGED IT  THE SAME THING HAPPENED. IT HAS HAPPENED SPORADICALLY  AND BECAUSE IT HAPPENS INFREQUENTLY I HAVEN'T GOTTEN IT REPAIRED AND WHEN I HAVE ASKED MECHANICS ABOUT IT, THEY DRIVE IT AND IT WORKS FINE.I CANT BELIEVE I AM THE ONLY ONE THIS HAS HAPPENED TO.  *TR",
        "vin": "2G4WB52KX11"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST FEW DAYS WHILE DRIVING MY SECURITY LIGHT WILL COME ON ALL OF A SUDDEN AND THE CAR WILL LOSE POWER AND THEN INSTANTLY COME BACK ON.  I HAD MY 3 CHILDREN IN THE CAR WITH ME SO WE ALL WERE IN PANIC MODE WHEN THIS HAPPENED.  IT HAS NOW MADE ME VERY NERVOUS TO DRIVE BECAUSE I DO NOT WANT TO GET INTO AN ACCIDENT.  FRIENDS HAVE TOLD ME IT WAS BECAUSE THE CHIP IN MY KEY IS WORN OUT AND TO HAVE A NEW KEY MADE.  I CONTACTED A LOCAL LOCKSMITH AND HE SAYS SINCE THIS IS HAPPENING AFTER THE CAR IS IN MOTION THEN IT IS NOT THE KEY.  THERE IS SOMETHING WRONG WITH THE IGNITION SWITCH.  I CONTACTED MY LOCAL BUICK DEALERSHIP AND WAS TOLD THERE ARE NO RECALLS ON THIS AND IT COST $95 JUST FOR THEM TO LOOK AT IT AND SEE HOW MUCH TO FIX IT.   *TR",
        "vin": "2G4WB55K911"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/25/2014",
        "dateOfIncident": "08/23/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER RETURNING FROM RUNNING ERRANDS, THE PARKED CAR WAS OBSERVED SMOKING FROM UNDER THE HOOD. THIS WAS FOLLOWED BY FLAMES FULLY ENGULFING THE FRONT END OF THE CAR, RESULTING IN THE TIRE EXPLODING AND SCHRAPNEL BEING LAUNCHED.  *TR",
        "vin": "2G4WB55K511"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2014",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WELL DRIVING I WAS GOING ALONG AT 40 MPH AND THE CAR JUST UP AND DIED ALL THE DASH LIGHTS STARTED TO FLASHING STEERING BECOMES HARD AND THE BRAKING IS LIKE STANDING ON A BRICK I DO BELIEVE THE IGNITION SWITCH MAY BE THE PROBLEM IT IS THE SAME SWITCH THAT IS IN THE CHEVROLET IMPALA THAT HAD BEEN RECALLED I USED TO WORK FOR A GARAGE AND INSTALL THEM OFTEN I DO HOPE YOU LOOK IN TO THIS WITH CARE SECOND THING IS THE STEERING RACK IS REALLY BAD AND WHEN I TOOK IT IN TO THEM AT THE DEALER THEY TRIED TO TELL ME IT WAS FROM USE I DON'T BELIEVE IT I HAVE A ASE CERTIFIED  PERSON DO ALL THE WORK TO IT AND THE BRAKES ARE BRAND NEW SO YOU TELL ME THERE IS A MAD DEFECT ON THE CAR IT SHOULD HAVE BEEN RECALLED SOME TIME AGO AND I DON'T KNOW AS TO WHY THIS IS STILL NOT ON THE LIST OF RECALLS BUT IT NEEDS TO BE SAME FOR THE 2000 01 02 03 BUICKS THANK YOU FOR YOUR TIME HOPE THIS GET TAKEN CARE OF.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10625855,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING WITH MY SON. WE WERE COMING TO A STOP AND LOST ALL POWER STEERING, BRAKES, AND ALL DASH LIGHTS LIT UP. THE IGNITION SWITCH FAILED.. VERY TERRIFYING! HOW IS MY CAR NOT ON THE RECALL LIST???? WE COULD HAVE DIED!!!  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/30/2014",
        "dateOfIncident": "06/28/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606991,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL.  THE CONTACT STATED THAT THE KEY COULD NOT BE REMOVED FROM THE IGNITION TO SHUT OFF THE VEHICLE.  THE VIN WAS EXCLUDED FROM NHTSA CAMPAIGN NUMBER:  14V355000 (ELECTRICAL SYSTEM:IGNITION).  THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED.  THE APPROXIMATE FAILURE MILEAGE WAS 160,000.",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598799,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 35 MPH, THE VEHICLE STALLED AND NO WARNING LAMPS ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE FAILED TO RESTART. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE TECHNICIAN DIAGNOSED THAT THE IGNITION SWITCH WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.  UPDATED 08/19/14*LJ UPDATED 08/23/2017*CT",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2014",
        "dateOfIncident": "11/16/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575988,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THE VEHICLE STALLED WHILE DRIVING AT VARIOUS SPEEDS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE IGNITION WAS REPLACED. THE MANUFACTURE WAS NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS  37,500 AND THE CURRENT MILEAGE WAS 47,922.  UPDATED 05/19/14*LJ  UPDATED 7/24/17 *CN",
        "vin": "2G4WB52K011"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/23/2014",
        "dateOfIncident": "03/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574298,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I HIT BREAKS MY HEADLIGHTS GO OUT NO ACCIDENT YET",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2014",
        "dateOfIncident": "05/16/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572661,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING STALLING PROBLEMS I. E. IGNITION. GOING OVER BUMPS AND TURNING ON THE LEFT TURN SIGNAL SEEMED TO CAUSE IT TO STALL FOR OVER A YEAR. I PRETTY MUCH QUIT DRIVING THE CAR UNLESS IT WAS LESS THAN 3 MILES LIKE GOING TO THE GROCERY STORE OR THE GOLF COURSE. I FINALLY TOOK IT IN TO THE DEALER AND THEY HAD NEVER SEEN ANYTHING LIKE IT. SEPT. 17, 2013. ANYWAY, THEY REPAIRED IT FOR $556.40. I HAVE ONLY HAD THE KEYS THAT CAME WITH IT, STARTER AND TRUNK AND ONE HOUSE KEY, 3 TOTAL ON THE KEY RING. IN LIGHT OF THE RECENT PROBLEMS, YOU MIGHT WANT TO EXPAND THE SCOPE OF YOUR INVESTIGATION.  *TR",
        "vin": "2G4WF551311"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "03/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10569463,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT BUCKLE FROZE, WOULDNOT RELEASE, HAD TO CUT THE SEATBELT TO GET OUT OF CAR...  *TR",
        "vin": "2G4WB55K311"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2014",
        "dateOfIncident": "05/04/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10568505,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT WAS DRIVING APPROXIMATELY 30 MPH WHEN THE ENTIRE DASHBOARD ILLUMINATED FOLLOWED BY THE VEHICLE IMMEDIATELY STALLING. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHO REPLACED THE STARTER HOWEVER, THE FAILURE WAS NOT CORRECTED. THE VEHICLE WAS THEN TOWED TO AN AUTHORIZED DEALER, WHO REPLACED THE ANTI-THEFT ELECTRICAL DEVICE HOWEVER THE FAILURE WAS NOT CORRECTED. THE VEHICLE WAS THEN TAKEN TO A PERSONAL MECHANIC WHO MADE UNKNOWN REPAIRS. THE FAILURE DID NOT RECUR FOR SEVERAL MONTHS. THE MANUFACTURER ADVISED THE CONTACT TO TAKE THE VEHICLE BACK TO THE DEALER FOR FURTHER DIAGNOSTIC TESTING AT THE OWNER'S EXPENSE. THE CONTACT DECLINED BECAUSE THE PREVIOUS THREE DIAGNOSTIC TESTS THAT WERE PERFORMED WERE UNSUCCESSFUL.  THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 84,137.  *TR",
        "vin": "2G4WF551711"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/20/2014",
        "dateOfIncident": "11/18/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560633,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ODOMETER METER CANNOT BE READ AT ANY TIME BECAUSE LIGHT WENT OUT.  GM CARS HAVE INSTRUMENT LIGHTING CLUSTER PROBLEMS, ACCORDING TO THE SERVICE WRITER AT A BUICK DEALER.  THIS COSTS $676.75 TO REPAIR.    OUR SON'S 2001 CHEVY IMPALA HAD THE DASHBOARD INSTRUMENT PANEL FAIL AND HE COULD NOT READ HIS SPEEDOMETER.  THIS WAS REPLACED FOR $614.00 AND IT FAILED AGAIN A YEAR LATER.   *TR",
        "vin": "2G4WB55K411"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2013",
        "dateOfIncident": "08/27/2013",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10538544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT WHILE PARKED, SMOKE WAS BEING EMITTED FROM UNDER THE HOOD. THE CONTACT STATED THAT THE FUEL INJECTOR COVER CAUGHT ON FIRE. THE FIRE WAS PUT OUT WITH A FIRE EXTINGUISHER. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR A DIAGNOSTIC. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 170,000.",
        "vin": "2G4WB55K911"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/26/2013",
        "dateOfIncident": "05/09/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537369,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "VIVA 2",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "I AM AN AUTO MECHANIC AND LATER AUTOMOTIVE ENGINEER AND I ALWAYS KEEP MY TIRES PROPERLY INFLATED WITH ROUTINE BALANCING, ROTATION AND ALIGNMENTS.  IN OVER 30 YEARS OF DRIVING I HAD NEVER HAD A TIRE ISSUE BEYOND THE OCCASIONAL FLAT UNTIL I BOUGHT A SET OF GOODYEAR VIVA 2 TIRES FROM WALMART ON MAY 31, 2011.   P225/60R16 97S  DOT MDX0 H6HP 1911 TIRES FOR MY 2001 BUICK REGAL.  AFTER ALMOST A YEAR I NOTICED THE CAR WAS NOT RIDING SMOOTHLY SO I TOOK IT IN TO GET THE TIRES BALANCED.  THE TIRE MAN SHOWED ME THAT THERE WAS A TREAD ISSUE ON A TIRE, SO ON MAY 9, 2012 I BOUGHT A REPLACEMENT VIVA 2 TIRE.  THE FAILED TIRE HAD LESS THAN A YEAR AND 17,601 MILES ON IT.  RECENTLY WHILE DRIVING ON THE FREEWAY ANOTHER OF THE INITIAL VIVA 2 TIRES BLEW OUT (SAME DOT CODE).  THIS TIRE WAS ABOUT 26 MONTHS OLD WITH 31,440 MILES ON IT.  I STILL HAVE THIS TIRE IF YOU WANT TO INSPECT IT.  *TR",
        "vin": "2G4WB52K511"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/26/2013",
        "dateOfIncident": "08/05/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "VIVA 2",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "SINCE TWO OF THE FOUR TIRES HAVE NOW FAILED I WILL SUBMIT TWO COMPLAINTS, ONE FOR EACH TIRE.  GOODYEAR VIVA 2 TIRES BOUGHT FROM WALMART ON MAY 31, 2011.   P225/60R16 97S  DOT MDX0 H6HP 1911 TIRES FOR MY 2001 BUICK REGAL.  AFTER ALMOST A YEAR I NOTICED THE CAR WAS NOT RIDING SMOOTHLY SO I TOOK IT IN TO GET THE TIRES BALANCED.  THE TIRE MAN SHOWED ME THAT THERE WAS A TREAD ISSUE ON A TIRE, SO ON MAY 9, 2012 I BOUGHT A REPLACEMENT VIVA 2 TIRE.  THE FAILED TIRE HAD LESS THAN A YEAR AND 17,601 MILES ON IT.  RECENTLY WHILE DRIVING ON THE FREEWAY ANOTHER OF THE INITIAL VIVA 2 TIRES BLEW OUT (SAME DOT CODE).  THIS TIRE WAS ABOUT 26 MONTHS OLD WITH 31,440 MILES ON IT.  *TR",
        "vin": "2G4WB52K511"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2013",
        "dateOfIncident": "04/24/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509488,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD AND IT STALLS- REPLACED THE FUEL PUMP- FUEL FILTER- SPARK PLUGS AND IT STILL STALLS- SEEMS TO BE A NUMBER OF COMPLAINTS ON THIS AND NO CODES COME UP WHEN HOOKED TO A COMPUTER.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/18/2013",
        "dateOfIncident": "03/16/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE ENGINE OVERHEATED. THE CONTACT STATED HE PULLED THE VEHICLE OVER, LET THE VEHICLE SIT, AND ADDED COOLANT BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE WHERE IT WAS FOUND THAT A BLOWN HEAD GASKET MAY HAVE CAUSED THE FAILURE. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR INSPECTION. THE MANUFACTURER WAS NOTIFIED AND STATED THAT NHTSA CAMPAIGN NUMBER: 09V116000 (ENGINE AND ENGINE COOLING) HAD EXPIRED. THE FAILURE MILEAGE WAS 125,000.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2013",
        "dateOfIncident": "12/11/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496558,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RETURNING HOME FROM SHOPPING, ROUGHLY 20 MILE DRIVE, I PARKED THE CAR IN OUR ATTACHED 3 CAR GARAGE.  I WENT INSIDE, VISITED BRIEFLY WITH MY HUSBAND, FIXED A SALAD AND WAS EATING WHEN I HEARD A NOISE.  AS I OPENED THE DOOR FROM THE KITCHEN TO THE GARAGE, I FOUND THE GARAGE WAS FULL OF SMOKE AND CALLED 911.  I ESTIMATE THE TIME FROM SHUTTING OFF THE CAR UNTIL WE CALLED 911 TO BE 10 TO 15 MINUTES.  AS FAR AS I KNOW, THE VEHICLE IS NOT UNDER RECALL BASED ON THE GM WEB SITE LISTING RECALLS BY VIN; HOWEVER, OUR EXPERIENCE SURE SOUNDS VERY SIMILAR TO THE INVESTIGATIONS THAT RESULTED IN SIGNIFICANT RECALLS OF SIMILAR MAKE, MODEL AND YEAR VEHICLES.  THIS VEHICLE DID HAVE A SERVICE NOTICE THAT PAID FOR REPLACEMENT OF THE CATALYTIC CONVERTER ROUGHLY 2 YRS AGO.  THE CAR WAS RUNNING ROUGH 6 MOS PRIOR TO THE FIRE.  REPAIRS WERE MADE AT THE GM DEALERSHIP WHERE WE PURCHASED THE CAR.  REPAIRS SEEMED TO CORRECT THE PROBLEM.      THE FIRE DESTROYED THE BUICK AND THE CAR PARKED NEXT TO IT.  THERE WAS SIGNIFICANT DAMAGE TO THE 3RD CAR.  ALL GARAGE CONTENTS WERE LOST.  WE ARE OUT OF OUR HOUSE AND WILL BE LIVING IN AN APT FOR 6 MONTHS.  THERE WAS SIGNIFICANT DAMAGE TO OUR HOME, $100K PLUS.  OUR INSURANCE COMPANY SENT A FIRE INVESTIGATOR.  GM SENT A FIRE INVESTIGATOR.  WE HAVE NOT SEEN EITHER REPORT.  *TR",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467327,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL. CONSUMER STATES ODOMETER STOPS WHEN CLUSTER PANEL LIGHT GOES OUT *TGW",
        "vin": ""
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/2012",
        "dateOfIncident": "07/14/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING ROUTINE MAINTENANCE DISCOVERED THAT THE FRONT RHS STEERING SPINDLE TO TIE-ROD ATTACHMENT LUG HAD CRACKED THROUGH ONE SIDE OF THE LUG.  SPINDLE IS FABRICATED FROM CAST ALUMINUM.  FATIGUE CRACK INITIATION FROM INCLUSION OR POTENTIAL CASTING DEFECT WAS APPARENT BEFORE FAILURE.  PART NUMBER AND PHOTOGRAPHS OF THE CRACKED SURFACE ARE AVAILABLE.  *TR",
        "vin": "2G4WB55K411"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/03/2012",
        "dateOfIncident": "04/02/2012",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454005,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT ON LUNCH, ON MY FIRST DAY OF WORK NONE THE LESS, BUT I PARKED MY CAR IN THE PARKING GARAGE AFTER  GOING TO THE LOCAL MCDONALDS AND WENT IN AND ATE. AND FROM WHAT I'M TOLD THE FIRE WAS NOTICED FIRST AT AROUND 1240PM AND I HAD GOTTEN BACK AT 1235 SO IT LITTERALLY HAPPENED WITH IN MINUTES OF ME GETTING BACK.  BY THE TIME THE FIREFIGHTERS GOT  IT OUT THE WHOLE ENGINE AND FRONT END WAS BASICALLY MELTED .  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/28/2011",
        "dateOfIncident": "12/19/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA RECALL CAMPAIGN ID NUMBER: 09V116000 (ENGINE AND ENGINE COOLING) TO PREVENT THE ROCKER COVER GASKET FROM LEAKING OIL. THE CONTACT STATED THAT SHORTLY AFTER RECEIVING THE RECALL REPAIRS, THE VEHICLE CAUGHT ON FIRE FROM THE ENGINE. THE CONTACT BELIEVED THAT THE RECALL REPAIR WAS THE CAUSE OF THE FIRE. THE CONTACT HAD NOT ENCOUNTERED A FAILURE PRIOR TO THE RECALL REPAIRS.  THE FAILURE AND THE CURRENT MILEAGES WERE UNKNOWN.   KMJ",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/11/2011",
        "dateOfIncident": "08/21/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I FILED A COMPLAINT WITH THE ATTORNEY GENERAL WHO IN TURN REFERRED ME TO YOU (NHTSA).  HOWEVER, I FILED A COMPLAINT WITH NHTSA TWO WEEKS BEFORE I FILED WITH THE ATTORNEY GENERAL. HERE IS A COPY OF THE COMPLAINT:       MY 2001 BUICK REGAL CAUGHT ON FIRE IN AUGUST 2011 AFTER A SHORT DRIVE TO THE GAS STATION. IN APRIL 2009, BUICK ISSUED A SAFETY RECALL ON MY CAR STATING THERE HAVE BEEN ENGINE COMPARTMENT FIRES. I WAS TOLD I WAS ENTITLED TO A \"FREE\" AND \"EFFECTIVE\" REMEDY FOR MY CAR. I TOOK MY CAR TO [XXX]TO HAVE THE \"FIX\" COMPLETED ON JANUARY 14, 2010. THE REPAIR WAS OBVIOUSLY NOT \"EFFECTIVE\" AS MY CAR STILL CAUGHT ON   FIRE JUST AS DESCRIBED IN THE RECALL. I CALLED BUICK AND FILED A CLAIM WHICH WAS DENIED WITHOUT ANYONE COMING TO LOOK AT MY CAR OR ANYTHING. THE CLAIMS DEPARTMENT STATED THAT THEY WERE DENYING MY CLAIM BECAUSE THE CALIFORNIA BREACH OF WARRANTY STATUTE WAS UP AND THEY ONLY HAD TO FIX THE CAR IF IT WAS WITHIN THE FIRST FOUR YEARS FROM THE DATE THE CAR WAS ORIGINALLY PURCHASED. THIS MAKES NO SENSE AS THE SAFETY RECALL WAS ISSUED EIGHT YEARS AFTER THE CAR WAS ORIGINALLY PURCHASED. FURTHERMORE, FEDERAL LAW STATES THAT IF A SAFETY ISSUE IS DISCOVERED WITHIN TEN YEARS OF THE CAR BEING PURCHASED THE OWNER IS ENTITLED TO   A FREE AND EFFECTIVE REMEDY. AGAIN, THE REMEDY FOR MY CAR WAS OBVIOUSLY \"NOT EFFECTIVE!\" I THEN ASKED BUICK WHAT IF I HAD BEEN IN THE CAR WITH MY KIDS WHEN IT CAUGHT ON FIRE OR WHAT IF IT HAD BEEN PARKED IN MY GARAGE AND MY HOUSE CAUGHT ON FIRE? THEIR RESPONSE WAS, \"WELL, THAT DIDN'T HAPPEN SO I'M NOT GOING TO   DISCUSS IT.\" SO BASICALLY, I'M LEFT TO ASSUME THAT I WOULD HAD TO HAVE BEEN BURNED IN THAT CAR BEFORE BUICK WOULD ACCEPT RESPONSIBILITY FOR THEIR ILL MANUFACTURED CAR? THAT HARDLY SEEMSRIGHT. I STILL OWE $400 ON A CAR I CAN'T DRIVE. THIS IS WRONG ON SO MANY LEVELS. PLEASE, PLEASE HELP ME. THANK YOU SO MUCH FOR YOUR TIME.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "2G4WB55K411"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2011",
        "dateOfIncident": "08/21/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10426486,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WENT TO THE GAS STATION AND THEN WENT TO MY PARENTS HOUSE WHERE I PARKED MY CAR.  THIS WAS ALL OF ABOUT 6 MILES.  I WENT INTO MY PARENTS HOUSE AND WAS WATCHING TV WHEN MY DAD CAME IN AND SAID COME HERE QUICK... YOUR CAR'S ON FIRE.  I COULDN'T BELIEVE IT. IT WAS WORKING FINE WHEN I WENT TO THE STORE AND THEN IT CAUGHT ON FIRE OUT OF THE BLUE.  THERE WAS A RECALL IN APRIL 2009 ON MY CAR DUE TO ENGINE COMPARTMENT FIRES.  I TOOK IT TO JOHN L. SULLIVAN IN JANUARY 2010 TO HAVE THE RECALL WORK DONE AT NO CHARGE. YET, MY CAR CAUGHT ON FIRE ANYWAY. I FILED A COMPLAIN WITH GM MOTORS WHO DENIED MY CLAIM STATING THE BREACH OF WARRANTY STATUTE OF LIMITATIONS HAD EXPIRED PER CALIFORNIA STATE LAW.  HOWEVER, FEDERAL LAW STATES I AM ENTITLED TO A FREE AND \"EFFECTIVE\" REMEDY FOR THIS SITUATION. OBVIOUSLY, THE REMEDY WAS NOT EFFECTIVE.   I WANT GM TO FIX MY CAR IMMEDIATELY!!!!!! FEDERAL LAW SHOULD OVERRIDE ANY STATE LAW. I AM VERY LUCKY I WAS NOT IN THE CAR WHEN THE FLAMES ERUPTED. I AM ALSO VERY LUCKY IT WAS NOT PARKED IN MY GARAGE OR SOMETHING WHERE MY HOUSE COULD HAVE CAUGHT FIRE. THERE WERE ABSOLUTELY NO INDICATIONS THAT ANYTHING WAS WRONG WITH MY CAR.  *TR",
        "vin": "2G4WB55K411"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/09/2011",
        "dateOfIncident": "07/18/2010",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405693,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED WHILE DRIVING 70 MPH THE VEHICLE LOST POWER AND THE ENGINE CAUGHT FIRE. THE CONTACT DID NOT MENTION IF THERE WERE ANY INJURIES OR IF A FIRE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE DEALER WHO PERFORMED A DIAGNOSTIC TEST THAT LOCATED THE FAILURE IN THE ENGINE WIRING HARNESS. NHTSA CAMPAIGN ID NUMBER 09V116000, ENGINE AND ENGINE COOLING WAS RECEIVED AFTER THE FAILURE OCCURRED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILES WAS 115,027.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/20/2011",
        "dateOfIncident": "04/16/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396872,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PROBLEM WITH THE ODOMETER LIGHT IT DOES NOT SHOW THE MILEAGES OF THE CAR I JUST BOUGHT IT, AND IT HASN'T SHOWN UP YET. ALL THE OTHER LIGHTS ARE ON EXCEPT THIS ONE. CAN'T PASS INSPECTION BECAUSE OF IT.  *TR",
        "vin": "2G4WB55K611"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2011",
        "dateOfIncident": "04/09/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397591,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE THREE THINGS THAT THIS VEHICLE CRUISE CONTROL DOES. FIRST IF YOU TRY TO USE THE RESUME FEATURE, IT ACCELERATES WILDLY SO YOU HAVE TO HIT THE BRAKE TO DISENGAGE IT. SECOND, WHILE DRIVING DOWN THE HIGHWAY WITH THE CRUISE SET AT ANY SPEED THE VEHICLE WILL RANDOMLY JUST GO TO MAXIMUM ACCELERATION AND AGAIN YOU MUST USE THE BRAKE TO DISENGAGE IT. THIRD AND MOST RECENT, WHILE DRIVING THROUGH TOWN WITH THE CRUISE ON BUT NOT ENGAGED, THE CRUISE LIGHT COMES ON AND THE VEHICLE TAKES OFF AT FULL ACCELERATION ALL BY ITSELF. THIS IS A VERY DANGEROUS SITUATION AND NEEDS TO BE ADDRESSED IMMEDIATELY. GM HAS NO IDEA WHERE TO LOOK OTHER THAN REPLACING ABOUT $900.00 WORTH OF PARTS. IN CHECKING ON THIS SITUATION, I FOUND NUMEROUS INCIDENTS OF THIS SAME DEFECT WITH OTHER OWNERS OF THIS VEHICLE.",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2011",
        "dateOfIncident": "11/12/2009",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392040,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL. CONSUMER STATES VEHICLE WAS DEEMED A TOTAL LOSS DUE TO AN ENGINE FIRE RESULTING FROM AN ENGINE LEAK ONTO THE EXHAUST MANIFOLD *TGW  THE CONSUMER STATED HE OFFICIALLY GAVE THE VEHICLE TO HIS SON ON DECEMBER 15, 2007.  A RECALL WAS ISSUED ON APRIL 14, 2009, BUT, NEITHER HIM OR HIS SON RECEIVED A RECALL LETTER.  NOVEMBER 12, 2009, THE VEHICLE CAUGHT ON FIRE AND WAS DESTROYED. THE CONSUMER THEN RECEIVED A NOTICE IN NOVEMBER 2010 STATING THE RECALL HAD NOT BEEN PERFORMED AND TO CONTACT THE DEALER AS SOON AS POSSIBLE. *JB",
        "vin": "2G4WB55DX11"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2011",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383241,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT NOTICED OIL WAS LEAKING FORM UNDER THE VEHICLE WHILE IT WAS PARKED.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS TOLD THE FRONT ROCKER GASKET WAS LEAKING.  THE MANUFACTURER WAS NOTIFIED AND THE CONTACT WAS TOLD THE VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 08V118000 (ENGINE AND ENGINE COOLING).  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 58,500 AND THE CURRENT MILEAGE WAS 64,000.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/17/2011",
        "dateOfIncident": "12/31/2010",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376960,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 BUICK REGAL THAT HAS A 3.8 LITRE SUPERCHARGED ENGINE. THIS VEHICLE WAS RECALLED FOR STARTING ON FIRE FROM OIL DRIPPING ONTO THE EXHAUST. I HAD THE RECALL DONE OVER A YEAR AGO. I DROVE THE CAR EVERY DAY. RECENTLY I LEFT THE CAR PARKED FOR TWO DAYS. WHEN I STARTED DRIVING THE CAR TOWARD WORK I NOTICED THAT IT WAS SHUTTERING SLIGHTLY AND AFTER ABOUT FOUR MILES I TURNED AROUND TO HEAD BACK HOME. ON THE WAY BACK I NOTICED A BURNING SMELL AND SMOKE STARTED COMING OUT FROM THE FLOOR NEAR THE SHIFTER. I QUICKLY PULLED INTO A PARKING LOT AND GOT OUT. THE CAR BURST INTO FLAMES AND WAS COMPLETELY DESTROYED. I WAS NOT HURT BUT THE CAR WAS A TOTAL LOSS. I CALLED BUICK TO TELL THEM WHAT HAPPENED. I GOT THEIR CLAIM DEPARTMENT. I TOLD THEM WHAT HAPPENED. THEY ASKED ME IF I WANTED TO FILE A CLAIM. I TOLD THEM I WAS CONCERNED THAT I HAD THE RECALL DONE AND THE CAR BURST INTO FLAMES ANYWAY AND THAT I WANTED SOMEONE TO LOOK AT IT TO DETERMINE IF THE RECALL WAS DONE CORRECTLY OR POSSIBLY THE RECALL DOESN'T WORK. THEY TOLD ME SOMEONE WOULD CALL ME WITHIN 10 DAYS. NO ONE CALLED AND I GOT A LETTER IN THE MAIL SAYING THEY WERE NOT LIABLE AFTER TWO YEARS AFTER THE PURCHASE OF THE CAR. MY CONCERN IS THAT THE RECALL DOES NOT WORK, THAT NO ONE EVER CAME TO LOOK AT THE CAR AND THE DISMISSED ME WITHOUT TAKING ME SERIOUSLY AT ALL. THE CAR WAS IN PERFECT DRIVING SHAPE AND HAD NO PREVIOUS PROBLEMS. I TOLD BUICK THAT I WAS CONCERNED THAT IF THE RECALL DOESN'T WORK PEOPLE COULD BE KILLED  (I WAS LESS THAN 100 FEET FROM THE CAR WHEN IT BURST INTO FLAMES). THE ENTIRE CAR WAS BURNT DOWN TO BARE METAL EXCEPT THE ENGINE WHICH LOOKED NEW. THE OWNER OF THE TOW YARD SAID HE HAD NEVER SEEN A CAR BURN THAT WAY UNLESS THE OWNER TRIED TO BURN IT OR THE EXHAUST SET THE BOTTOM OF THE CAR ON FIRE. BUICK EXCEPTS NO RESPONSIBILITY FOR THIS AND THEY DID NOT CARE ENOUGH TO LOOK AT THE CAR THE ENSURE THE RECALL WORKED OR THAT OTHER PEOPLE DO NOT GET HURT IF IT FAILS. *TR",
        "vin": "2G4WF551811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/29/2010",
        "dateOfIncident": "07/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352628,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE,RADIATOR FAILURE. *TR",
        "vin": "2G4WF551111"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/11/2010",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348708,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT NOTICED THAT THERE WAS POWER STEERING FLUID LEAKING ALL OVER HIS DRIVEWAY. THE VEHICLE WAS TOWED TO THE DEALER, WHERE THEY STATED THAT THERE WAS RUST CORROSION UNDERNEATH THE VEHICLE. THE CORROSION WAS CAUSING THE LEAK AND THEY STATED THAT THEY WILL HAVE TO REPLACE ALL OF THE PARTS THAT WERE CORRODED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 19000.",
        "vin": "2G4WB55K711"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/24/2010",
        "dateOfIncident": "03/25/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345075,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL GS. FUEL FILLER PIPE RUSTED OUT, SUB FRAME VERY RUSTY, AND REAR BUMPER SUPPORT RUSTED OUT.  ALL HAD TO BE REPLACED.  HAD NOTIFIED BUICK ON MAY 25, 2010 AND THEY GAVE ME A CASE NUMBER ( [XXX] )  BUICK SAID THERE WAS NOTHING THEY COULD DO FOR ME AS THERE WAS NO RECALL ON THIS CAR.  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "2G4WB52K611"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "04/20/2010",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340788,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE HAD THE NECESSARY RECALL WORK DONE, BUT IT STILL CAUGHT FIRE AND IS NO LONGER IN WORKING ORDER.  THE WHOLE ENGINE IS BURNT TO A CRISP... *TR",
        "vin": "2G4WB55K611"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2010",
        "dateOfIncident": "05/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336816,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STATED THAT IN ORDER TO START THE VEHICLE, SHE WOULD HAVE TO ENGAGE THE HAZARD LIGHTS FIRST AND THEN TURN THE IGNITION BEFORE IT WOULD START. THE DASHBOARD COMPONENTS WOULD ILLUMINATE SPORADICALLY AND THE FUEL LEVEL GAUGE, GEAR SHIFTER, AND ODOMETER WERE ALL INOPERABLE. THE VEHICLE WAS NOT REPAIRED AND THE CONTACT WAS UNAWARE IF THERE WERE ANY RECALLS ON THE VEHICLE. THE FAILURE AND CURRENT MILEAGES WERE UNKNOWN.",
        "vin": "2G4WB55K911"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/19/2010",
        "dateOfIncident": "01/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL. THE CONTACT STARTED THE ENGINE ON A COLD START AND A SHAKING MOTION OCCURRED. ADDITIONALLY, WHENEVER THE VEHICLE WAS IN OPERATION THE ENGINE POWER FAILED TO ALLOW THE VEHICLE TO EXCEED OVER 25 MPH. ALSO, THE TRANSMISSION WAS LEAKING TRANSMISSION FLUID. THE VEHICLE WAS TAKEN TO A LOCAL DEALER FOR INSPECTION. THE FAILURE WAS CONTRIBUTED TO THE POWER TRAIN, TRANSMISSION AND ENGINE. THE VEHICLE HAS NOT BEEN REPAIRED FOR THE MALFUNCTIONS. THE FAILURE MILEAGE WAS 99,500. THE CURRENT MILEAGE WAS 99,584.  UPDATED 05/13/10. *LJ",
        "vin": "2G4WB55K511"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "03/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319972,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2011 REGAL HAD TO HAVE THE LOWER AND UPPER INTAKE GASKET REPLACED AS WELL AS THE VALVE COVER GASKETS.. A WEEK AFTER THAT THE SERVICE ENGINE SOON LIGHT CAME ON AND THE MECHANIC SAID IT WAS THE THROTTLE BODY GASKET. I THEN GOT IT REPLACED AND THEN A WEEK AFTER THAT THE SERVICE ENGINE SOON LIGHT CAME ON AGAIN. IT WAS PULLING UP A CODE FOR A VACUUM LEAK. WTF! MY BOYFRIEND TURNED THE LIGHT OFF AND IT HASN'T COME ON SINCE, SO I DON'T KNOW IF IT WAS A GLITCH. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "01/20/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315648,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL. THE THROTTLE BECAME STUCK AND THE VEHICLE WOULD NOT SLOW DOWN UNTIL IT WAS PLACED IN NEUTRAL GEAR. THE VEHICLE WAS TOWED TO A LOCAL MECHANIC WHO STATED THAT THE THROTTLE CABLE WAS DEFECTIVE AND HE SHOULD FILE A SAFETY COMPLAINT WITH NHTSA. THE VEHICLE WAS TRAVELING AT 35 MPH WHEN THE VEHICLE SUDDENLY ACCELERATED. THE FAILURE MILEAGE WAS 120,000. THE CURRENT MILEAGE WAS 123,000.",
        "vin": "2G4WF551811"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/13/2009",
        "dateOfIncident": "10/13/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS CAR.  THE INCIDENT INVOLVES THE CRUISE CONTROL OF THIS VEHICLE.  I WAS DRIVING ON I-65.  I SET THE CRUISE FOR 65 MPH.  LATER, I PUSHED THE ACCELERATE BUTTON TO INCREASE THE SPEED BY 5 MPH.  I RELEASED THE SWITCH AT THE DESIRED SPEED BUT THE CAR CONTINUED TO ACCELERATE AS IF I FLOORED IT.  I QUICKLY HIT THE BRAKES AND THAT FIRST STOPPED THE ACCELERATION.  BUT AS SOON AS I RELEASED THE BRAKES, IT WENT BACK TO ACCELERATION.  I THEN TURNED THE CRUISE CONTROL SWITCH TO THE OFF POSITION AND THAT STOPPED THE ACCELERATION.  I CONTINUED FOR ABOUT 10 MILES WHEN I TRIED THE CRUISE CONTROL AGAIN.  THE UNCONTROLLED ACCELERATION OCCURRED AGAIN WHEN I USED THE ACCELERATE BUTTON BUT THIS TIME I APPLIED THE DECELERATE BUTTON ONE TIME AS IF TO DECREASE THE SPEED BY 1 MPH.  THAT ACTION KILLED THE CRUISE CONTROL ALL TOGETHER.  IF I WANTED CRUISE CONTROL AGAIN, I WOULD HAVE TO RESET THE DESIRED SPEED ALL OVER AGAIN AS IF IT WEREN'T SET AT ALL.  I HAVE ANOTHER INCIDENT INVOLVING THE CRUISE CONTROL ON THE SAME TRIP.  I HAD THE DESIRED SPEED SET.  WHEN THE CAR HIT A BUMP SUCH AS A SMALL POTHOLE, THE CAR'S SPEED SUDDENLY WOULD START TO INCREASE AS IF I FLOORED IT.  AGAIN I HAD TO APPLY THE OFF SWITCH OR DECELERATE BUTTON TO KILL IT.  ANOTHER INCIDENT OCCURRED ON THE SAME TRIP INVOLVING THE CRUISE CONTROL.  I HAD THE CRUISE CONTROL SWITCH IN THE ON POSITION BUT HADN'T SET THE SPEED WHEN I HIT A BUMP ON THE INTERSTATE.  AGAIN THE CAR ACTED AS IF I FLOORED THE ACCELERATOR AND AGAIN I HAD TO TURN THE SWITCH TO THE OFF POSITION OR USE THE DECELERATE BUTTON TO STOP IT.  I HAD THIS CAR TROUBLE-SHOT FOR THIS PROBLEM.  THEY FOUND THAT THE CRUISE CONTROL MODULE WAS AT FAULT BUT THE PART IS ON BACK ORDER NATIONWIDE.  I WAS TOLD I COULD BE PUT ON A WAITING LIST BUT IT COULD BE A WHILE.  ONE WOULD HAVE TO THINK I'M NOT THE ONLY ONE HAVING THESE PROBLEMS.  I THINK THIS IS AN UNSAFE CONDITION AND SHOULD BE LOOKED AT. *TR    JEFF LEONARD,",
        "vin": "2G4WB52K511"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/21/2009",
        "dateOfIncident": "05/08/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10281320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS IN FATAL ACCIDENT ON MAY 8 2009 IN DES MOINES, IA.  IT WAS LIGHT RAIN THAT NIGHT AND I MADE AN ATTEMPT TO TURN A CORNER AND SLIDE RIGHT THROUGH AND FENCE AND DROPPED DOWN A HILL ABOUT AND ESTIMATED 20 FEET.  THE ANTI-BRAKE SYSTEM FAILED AS WELL AS THE AIRBAG NOT DEPLOYING IS MY CONCERN.  THIS WAS NOT THE FIRST INCIDENT.  THE ONE TOOK PLACE IN DECEMBER OF 2009.  A DEER RAN OUT IN FRONT OF THE CAR AND THE SAME THING HAPPENED I WAS THEY CONDUCTED AN INVESTIGATION, BUT WAS NOT INFORMED TO WHERE I COULD UNDERSTAND.  NOW THE CASE IS WITH THEIR LAWYERS WHO WON'T ANSWER THE PHONE. *TR",
        "vin": "2G4WB55K1Y1"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2009",
        "dateOfIncident": "12/27/2007",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  MINUTES LATER AFTER THE CONTACT PARKED THE VEHICLE, IT CAUGHT FIRE.  THE FIRE DEPARTMENT EXTINGUISHED THE FIRE AND FILED A REPORT.  THERE WERE NO INJURIES AND THE VEHICLE WAS DESTROYED.  THE CONTACT WAS ADVISED TO FILE A COMPLAINT WITH THE MANUFACTURER.  THE FAILURE MILEAGE WAS 32,000.",
        "vin": "2G4WB55K011"
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/28/2009",
        "dateOfIncident": "06/24/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267081,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  THE CONTACT EXPERIENCED SEVERAL FAILURES WITH THE POWER WINDOWS EVER SINCE THE VEHICLE WAS PURCHASED.  WHEN ENTERING THE VEHICLE AND PROCEEDING TO ROLL DOWN THE FRONT WINDOW, THE WINDOW STALLED AND WAS UNABLE TO BE ROLLED BACK UP.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE REGULATOR AND THE RETAINER WERE FAILING.  THE VEHICLE WAS REPAIRED.  THE VEHICLE HAS FAILED EIGHTEEN TIMES OVER THE YEARS SINCE 2004 AND EACH TIME THE SAME PART HAS BEEN REPLACED.  ON APRIL 16, 2009, THE FRONT PASSENGER WINDOW FAILED.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE REGULATOR FAILED.  THE TECHNICIAN BOLTED UP THE WINDOW.  THE CONTACT WAS INFORMED THAT SHE WOULD NEVER BE ABLE TO USE THAT WINDOW AGAIN AND THERE WAS NO REMEDY TO REPAIR IT; THEREFORE, IT WILL CONTINUE TO FAIL.  THE MANUFACTURER STATED THAT NO COMPENSATION WOULD BE PROVIDED AND THE CONTACT WOULD BE RESPONSIBLE FOR THE REPAIR COST.  THE FAILURE MILEAGE WAS 20,000 AND CURRENT MILEAGE WAS 50,000.   UPDATED 7/9/09 *CN  THE CONSUMER STATED THE WINDOWS WOULD MAKE A CLICKING SOUND AND THEN IT WOULD FALL DOWN INTO THE DOOR PANEL. DURING RAINY WEATHER, THE DRIVERS SIDE DOOR WOULD NOT OPEN, THE HEADLIGHTS WOULD NOT SHUT OFF AND THE CHECK ENGINE LIGHT ILLUMINATED. UPDATED 07/17/09.*JB",
        "vin": "2G4WB55K911"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "01/07/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257141,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DEC.2008, I HAD MY OIL CHANGED  AND I NOTICED SEVERAL WEEK LATER THAT OIL WAS LEAKING ON MY GARAGE FLOOR. I THEN TOOK MY CAR TO HAVE IT CHECKED FOR THE OIL LEAK. MY MECHANIC INFORMED ME THAT IT WAS A PROBLEM WITH THE \"INTAKE MANIFOLD\" WHICH HAD A BAD DESIGN AND IT WAS ALSO CAUSING COOLANT TO LEAK INTO THE OIL. I IMMEDIATELY CHECKED TO SEE IF THERE WERE ANY RECALLS ON MY VEHICLE, AND THERE WERE. HOWEVER, WHEN I CALLED THE \"BUICK\" HOME OFFICE I WAS TOLD THAT THERE WERE NO RECALLS ON MY VEHICLE. THE INFORMATION WHICH I COLLECTED STATED THAT LETTERS WERE MAILED OUT FOR 1997-2000 MODELS ON APRIL 28,2008.  IT ALSO STATED THAT GM WILL ADVISE WHEN LETTERS FOR THE 2001-2003 MODELS WILL BE MAILED. THE PROBLEM IS GETTING WORSE AND I AM AFRAID THAT THIS PROBLEM MAY CAUSE MY CAR TO CATCH FIRE. *TR",
        "vin": "2G4WB52K011"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2008",
        "dateOfIncident": "06/19/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  THE CONTACT RECEIVED BUICK RECALL NOTICE NUMBER 07035 OR NHTSA CAMPAIGN ID NUMBER 08V118000 REGARDING THE GASKET ON HIS VEHICLE.  HE TOOK THE VEHICLE TO THE DEALER AND THEY REPAIRED THE FIRST GASKET.  THE CONTACT STATED THAT THE SECOND GASKET IS EXPERIENCING THE SAME FAILURE; HOWEVER, THE DEALER DOES NOT WANT TO MAKE THE REPAIR.  HE CALLED GM TO FILE A COMPLAINT AND THEY REFERRED HIM TO NHTSA.  CURRENTLY, THE GASKET IS LEAKING AND DRIPPING DOWN ONTO THE EXHAUST MANIFOLD.  THE FAILURE MILEAGE WAS 30,000.",
        "vin": "2G4WF551511"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "06/26/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  WHILE DRIVING APPROXIMATELY 10 MPH, THE CONTACT HEARD A LOUD CLUNKING NOISE.  THE VEHICLE WAS TAKEN TO A MECHANIC AND THEY STATED THAT THE FRONT STABILIZER BAR FAILED.  THE VEHICLE IS STILL ABLE TO BE DRIVEN.  THE CURRENT MILEAGE WAS 104,250 AND FAILURE MILEAGE WAS 104,100.    UPDATED 07/29/08  *BF  UPDATED 08/01/08. *JB",
        "vin": "2G4WB55K211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2008",
        "dateOfIncident": "04/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  WHILE DRIVING APPROXIMATELY 45 MPH AND APPROACHING AN INCLINE, THE VEHICLE FAILED TO ACCELERATE AFTER SEVERAL ATTEMPTS.  THE CONTACT SHIFTED INTO SECOND GEAR AND WAS ABLE TO DRIVE THE VEHICLE.  THERE WERE NO INJURIES; HOWEVER, HE FELT THE FAILURE WAS LIFE THREATENING WHEN THE VEHICLE STOPPED WITHOUT WARNING.  THE VEHICLE WAS ONLY ABLE TO BE DRIVEN IN 1ST, 2ND, AND REVERSE GEARS.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR REPAIR AND HE STATED THAT THE  FAILURE WAS RELATED TO A DEFECTIVE TORQUE CONVERTER THAT SHOULD NOT HAVE FAILED AT 92,000 MILES.  THE TORQUE CONVERTER IN THE VEHICLE WAS THE ORIGINAL PART.  THE CURRENT MILEAGE WAS 94,000 AND FAILURE MILEAGE WAS 92,000.",
        "vin": "2G4WF551411"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/08/2008",
        "dateOfIncident": "05/17/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227029,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 BUICK REGAL THAT I BOUGHT NEW, IT HAS 27,000 ORIGINAL MILES. TWO YEARS AGO WHEN I ENGAGED THE CRUISE CONTROL AND THE CAR ACCELERATED ON ITS OWN.   NOW WHENEVER THE CRUISE CONTROL IS ENGAGED SOMETIMES IT WORKS AT FIRST AND THEN LATER IT MAY START ACCELERATE UNTIL YOU HIT THE BRAKES TO DISENGAGE IT.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/29/2008",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST OF LAST YEAR (07) 3 WINDOWS FELL INTO THE DOOR ALL WITHIN A 2 WEEK TIME SPAN.  I SEE THAT MANY OWNERS HAVE COMPLAINED AND GM HAS ALREADY RECALLED TOYOTA VEHICLES FOR THIS DEFECT BUT NOT BUICK VEHICLES.  AFTER CALLING MY DEALERSHIP, I AM TOLD THAT THIS PROBLEM EXIST IN LARGE NUMBERS ALL OVER THE COUNTRY, YET NO SOLUTION. THE MOTORS STILL WORK BUT THE LEADS HAVE DETACHED.  *TR",
        "vin": "2G4WB55K211"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/29/2008",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  IN AUGUST OF 2007, WITHIN A SPAN OF THREE WEEKS, THREE OF THE VEHICLE'S WINDOWS COLLAPSED.  THE VEHICLE WAS TAKEN TO THE DEALER FOR A DIAGNOSIS AND THEY STATED THAT THE ASSEMBLY FAILED.  THE WINDOWS WERE REPAIRED AT THE COST OF $750 EACH.  THE MANUFACTURER STATED THAT THERE WERE NO RECALLS FOR THE FAILURE, BUT THEY WERE AWARE OF THE COMPLAINTS.  THE FAILURE MILEAGE WAS 95,000.  UPDATED 05/19/08.  *LJ",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/24/2008",
        "dateOfIncident": "03/27/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225595,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER SAYS LOWER INTAKE MANIFOLD LEAKING. REPAIRED AT 61,549 MI. DEALER SAYS LOWER INTAKE COOLANT BYPASS IS LEAKING, AS IS, THE VALVE COVER GASKETS. CLAIMS THERE HAVE BEEN ENGINE FIRES AND THAT GM HAS A RECALL ,BUT NOT A REMEDY FOR THE PROBLEM, AS OF YET. REPAIRED GASKETS AT 78,892 MI., TOTAL COST FOR BOTH 1,600.00.  1. ONE WOULD THINK AFTER BUILDING CARS FOR 50 YRS. THAT A HEAD GASKET COULD LAST 200,000 MI.  2. MY GASKET LASTED 17,000 MILES BETWEEN REPAIRS.  THE LEAKING GASKETS ARE A DIRECT CAUSE OF THE ENGINE FIRES. THE OIL LEAKS DOWN ON TOP OF THE EXHAUST MANIFOLD AND BINGO, \"FIRE\". THEY SAY THEY HAVE TO COME UP WITH A BETTER HEAT SHIELD \"DUH\". I BOUGHT THE CAR BASED ON CONSUMER REPORTS. I'VE HAD OTHER PROBLEMS TOO. I JUST WONDER IF GM WILL STEP UP AND REIMBURSE ME.  *TR",
        "vin": "2G4WF551311"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/17/2008",
        "dateOfIncident": "04/16/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DRIVING THE CAR TO THE SHOPPING MALL THERE WAS NOTHING OUT OF THE ORDINARY, NO SMELL, NO NOISE. ABOUT 15 MINUTES LATER I REMEMBERED  I FORGOT SOMETHING IN THE CAR AND WENT OUT TO RETRIEVE IT WHEN I SAW FIRE TRUCKS. THERE WERE FLAMES SHOOTING OUT 10 FEET HIGH OF A CAR, THINKING POOR FOOL, THEN REALIZING THAT FOOL WAS ME! IT WAS MY 2001 REGAL. THE CAR WAS TORCHED TO THE INSIDE DASH BOARD. WITNESSES STATED SPARKS WERE COMING FROM UNDER THE FRONT LEFT, WHEN IT BURST INTO FLAMES. NEEDLESS TO SAY THE CAR IS TOAST. NEVER, EVER ANY WARNING, NO DASH LIGHTS INDICATING A PROBLEM, AND IT ONLY HAD 65K MILES ON IT. MY SON HAS A 92 TOYOTA WITH OVER 200K, BET THAT WON'T EVER CATCH FIRE!  *TR",
        "vin": "2G4WB55K711"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/15/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221305,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL GAUGE ON MY 2001 BUICK REGAL LS WAS NOT WORKING PROPERLY. THIS VEHICLE HAS BEEN WELL MAINTAINED AS IT HAS BEEN IN MY FAMILY SINCE IT WAS PURCHASED NEW. THE VEHICLE ONLY HAD 54,348 MILES ON IT WHICH IS CONSIDERED LOW MILEAGE GIVEN THE MODEL YEAR. I TOOK IT TO THE LOCAL BUICK DEALER AND THEY HAD TO REPLACE THE FUEL LEVEL SENOR WHICH COST ME OVER $300. IT SHOULD BE NOTED THAT THIS PART IS COVERED UNDER THE CALIFORNIA EMISSIONS WARRANTY. HOWEVER, SINCE I DO NOT RESIDE IN CALIFORNIA, THEN I HAD TO PAY FOR THIS REPAIR OUT OF POCKET. I CONTACTED BUICK TO ADVISE THEM THAT THIS FAILURE WAS DUE TO A MANUFACTURE DEFECT. HOWEVER, SINCE THEY COULD NOT FIND AND SERVICE BULLENTINS OR RECALLS, THEY ADVISED ME THAT THERE WAS NOTHING THAT THEY COULD DUE TO REIMBURSE ME THE REPAIR COST FOR THIS DEFECT. I HAVE HEARD OF OTHER BUICK OWNERS HAVE SIMILAR PROBLEMS WITH THE FUEL GAUGE. THEREFORE, I AM FILING THIS COMPLAINT IN HOPES OF OTHER BUICK OWNERS WILL FOLLOW SUIT THAT HAVE EXPERIENCED THE SAME PROBLEM WITH THEIR BUICK.  *TR",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/13/2008",
        "dateOfIncident": "03/04/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WENT OUT TO START THE VEHICLE AFTER IT HAD BEEN SITTING FOR 2-3 DAYS IN 0-20 DEGREE TEMPERATURES. UPON TURNING THE IGNITION SWITCH SHE HEARD A LOUD EXPLOSION SOUND, SAW THE HOOD BULGE, AND SAW SMOKE BILLOW OUT FROM THE SIDES. SHE IMMEDIATELY REMOVED KEY, EXITED THE VEHICLE, AND ASKED ME TO COME OUT TO THE VEHICLE. UPON OPENING THE HOOD WE FOUND PIECES OF THE HEAT SHIELD, AND PLASTIC INTAKE MANIFOLD SCATTERED THROUGH THE ENGINE COMPARTMENT, ALONG WITH THE OIL FILL CAP, WHICH HAD BEEN BLOWN OFF.  *TR",
        "vin": "2G4WB52K111"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2008",
        "dateOfIncident": "01/25/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216261,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY CAR AT A COMPANY PARKING LOT AND WENT INSIDE. WITHIN 15 MINUTES, A PERSON APPROACHED ME TO TELL ME MY CAR WAS ON FIRE OUTSIDE. ANOTHER PERSON WHO WAS WALKING PAST THE CAR AT THE TIME SAID IT TRIED TO START ALL BY ITSELF JUST BEFORE IT CAUGHT ON FIRE. FIREMEN PUT THE FIRE OUT BUT NOT BEFORE IT MELTED THE THROTTLE BODY, THE RADIATOR, BRAKE MASTER CYLINDER AND EVERYTHING UNDER THE HOOD, EXPLODING THE LEFT FRONT TIRE AND HAD BEGUN BURNING THROUGH THE FIREWALL INTO THE CAB.  *CN",
        "vin": "2G4WF551111"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/04/2008",
        "dateOfIncident": "10/30/2007",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213722,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS A 3.8 LITER SUPER CHARGED ENGINE.  PARKED CAR AFTER DRIVING APPROXIMATELY 70 MILES WITH NO NOTICEABLE PROBLEM.  ABOUT FIFTEEN MINUTES LATER, I SAW SMOKE COMING FROM UNDER THE HOOD.  THE ENGINE COMPARTMENT WAS ENGULFED.  THE VEHICLE IS A TOTAL LOSS.     THE CAR WAS NOT RUNNING AND THEIR WAS NO INDICATION OF SMOKE/FIRE WHEN I TURNED IT OFF.  *CN",
        "vin": "2G4WF551511"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/26/2007",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209999,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SHAFT IN MY 2001 BUICK HAS FAILED 3 TIMES.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/19/2007",
        "dateOfIncident": "11/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209352,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ARE OFFLINE, COOLANT LIGHT COMES ON WHEN COOLANT IS FULL, AND 3X THE DRIVER SIDE POWER WINDOW HAS MALFUNCTIONED AND THE WINDOW WILL NOT GO UP OR STAY UP.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/09/2007",
        "dateOfIncident": "12/17/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208514,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REGULATORS ON THE WINDOWS MOTORS BROKE, ALLOWING THE WINDOWS TO DROP FREELY.  THERE WAS NO SIGN ON ALL BUT ONE WINDOWS (WHICH MADE A GRINDING NOISE BEFORE FAILING).  ONE WINDOW FELL WHILE WE WHERE AT A MALL, MAKING IT EASIER FOR A POTENTIAL THIEF TO TAKE THE CAR.  THE WINDOWS ARE CURRENTLY C CLAMPED IN THE CLOSED POSITION.  THEY'VE NOT BEEN FIXED BECAUSE OF A $250 PURCHASE PRICE FOR NEW COMPONENTS PER WINDOW.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/28/2007",
        "dateOfIncident": "04/05/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204394,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  THE CONTACT STATED THAT WATER LEAKS ONTO THE FLOORBOARD AND THE FRONT PASSENGER SEAT DURING INCLEMENT WEATHER.  WHEN THE WATER ENTERS THE VEHICLE, IT SATURATES THE ENTIRE FLOOR.  THE VEHICLE HAS NOT BEEN TAKEN TO THE DEALER TO DETERMINE THE CAUSE OF FAILURE.  THE FAILURE MILEAGE WAS 60,000 AND CURRENT MILEAGE WAS 64,400.",
        "vin": "2G4WB52K331"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/09/2007",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202306,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW ON MY BUICK LASABRE IS BROKEN AND IT SEEMS THAT THERE ARE A LOT OF THEM THAT BREAK AND BUICK WON'T STAND BEHIND IT AND WANTS OVER $400 TO FIX IT. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/03/2007",
        "dateOfIncident": "04/16/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189625,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 BUICK REGAL.  THE CONTACT STATED THAT THE ENGINE FAILED  WHEN ACTIVATING THE TURN SIGNALS AND SLOWING DOWN TO MAKE A TURN.  THE VEHICLE WILL RESTART AFTER A FEW MINUTES HAVE PASSED.  THE FAILURE BEGAN IN APRIL 2007 , AND WAS  NOW OCCURRING MORE FREQUENTLY.  THE CURRENT AND FAILURE MILEAGES WERE UNKNOWN.  *AK",
        "vin": "2G4WB55K911"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2007",
        "dateOfIncident": "04/03/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS WHEN USING TURN SIGNALS, GAUGES CLICK AND FLASH, DRIVE SELECTOR STUCK IN PARK, ENGINE WON'T START.  PROBLEM IS FAULTY IGNITION RELAY AND WIRING HARNESS REPLACED BY DEALER AT $400.00 COST.  ALLIED SWITCH 2.188 FROM AC DELCO COMPANY.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/03/2007",
        "dateOfIncident": "04/03/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186833,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE SHUTS OFF WHEN USING THE LEFT TURN SIGNAL, WHEN TRYING TO RESTART ALL DASH BOARD LIGHTS FLASH AND THE FUEL GAUGE SWAYS FROM LEFT TO RIGHT, THE DRIVE LEVER LOCKS IN THE LOCKED POSITION AND THE CAR WILL NOT START. AFTER LETTING IT SET THE DASH LIGHTS CONTINUE TO FLASH AND WON'T START. IF YOU TURN THE HAZARDS ON OR SET THE PARKING BRAKE THE CAR WILL START BUT SHUTS DOWN WHEN DRIVING.  *JB",
        "vin": "2G4WB55K611"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2007",
        "dateOfIncident": "03/28/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186630,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR DIES WHILE DRIVING IF TURN SIGNAL LEVER IS MOVED,   INTERMITTENT SERVICE ENGINE SOON (SES), ANTI-LOCK BRAKE (ABS) OR TRACTION CONTROL SYSTEM (TCS) LAMP ILLUMINATED, ENGINE NO CRANK/NO START, VARIOUS INSTRUMENT PANEL (I/P) CLUSTER INTERMITTENT, DIAGNOSTIC TROUBLE CODES (DTCS) U1000, U1016, B1422, B2957, B2958 SET, SHIFTER LOCKED IN PARK. *JB",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/30/2007",
        "dateOfIncident": "12/19/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187897,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BUICK REGAL. THE HEATING MODULE IN THE DRIVER'S SEAT MALFUNCTIONED, CATCHING ON FIRE AND BURNT A HOLE IN THE MIDDLE OF SEAT. CONSUMER IS SEEKING REIMBURSEMENT FOR REPAIRS. *MC   THE DEALER WAS UNABLE TO ASCERTAIN THE CAUSE OF THE MALFUNCTION. *JB",
        "vin": "2G4WB55K011"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/09/2007",
        "dateOfIncident": "06/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182087,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRIC WINDOW MECHANISM ON BOTH REAR WINDOWS WERE REPLACED UNDER WARRANTY. NOW THE LEFT REAR WINDOW HAS FAILED AGAIN AND ALSO THE FRONT PASSENGER WINDOW HAS FAILED. WHEN I CALLED THE LOCAL DEALER, THEY HAD NO EXPLANATION ON WHY THE REAR WINDOW FAILED AGAIN (ESPECIALLY WHEN I DON'T CARRY REAR PASSENGERS AND THE WINDOW IS SELDOM USED) AND WAS QUOTED $530.00 FOR REPAIR. IT WAS AFTER THAT THE FRONT WINDOW THEN FAILED.  IT SEEMS TO ME THERE MUST BE SOME KIND OF PROBLEM OR DEFECT WITH THE MECHANISM SINCE 4 WINDOWS HAVE FAILED SINCE BUYING THE CAR.  *JB",
        "vin": "2G4WB55K311"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/01/2007",
        "dateOfIncident": "01/26/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181358,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 80,000 MILES GRINDING NOISE IN RIGHT FRONT WHEEL DEVELOPED, REPLACED BRAKES AND ROTORS FOUND THE RIGHT FRONT WHEEL BEARING WAS BAD AND HAD TO HAVE IT REPLACED .  AT ABOUT 84,000 MILES THE LIFTERS WERE MAKING A TICKING NOISE THAT SOUNDED LIKE A HELICOPTER, REPLACED THE LIFTERS AT A COST OF $1600 THIS WAS JUST ONE MONTH AFTER THE FINAL PAYMENT OF THE 5 YEAR LOAN ONE MONTH AFTER THE LIFTERS WERE REPLACED THE ENGINE SEIZED UP NEEDED TO BE TOWED AND I'M TOLD THAT THE MAIN BEARING HAS GONE BAD AND THE ENGINE NEEDS TO BE REPLACED OR REBUILT.  *NM",
        "vin": "2G4WB52K011"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/18/2007",
        "dateOfIncident": "12/05/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10179079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  WHILE DRIVING ON THE HIGHWAY AT 65 MPH, CONTACTS 2001 BUICK REGAL WAS REAR ENDED, CAUSING THE CONTACTS VEHICLE TO CRASH INTO ANOTHER VEHICLE.  UPON IMPACT THE DRIVER'S SIDE AND PASSENGER SIDE AIRBAGS FAILED TO DEPLOY.  THE FAILURE MILEAGE WAS 91000.  THE CONTACT CAN PROVIDE COPY OF THE POLICE REPORT.  *JB  UPDATED 03/07/07*JB",
        "vin": "2G4WB55K111"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/12/2007",
        "dateOfIncident": "12/24/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL ONLY WORKS INTERMITTENTLY AND SOMETIMES OPERATES NORMALLY FOR A PERIOD OF TIME THEN ACCELERATES VERY RAPIDLY UNEXPECTEDLY. I HAVE NOT RETURNED TO A DEALER YET BUT THOUGHT THE INCIDENTS IMPORTANT TO REPORT.  *NM",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/11/2007",
        "dateOfIncident": "12/29/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178484,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD ISSUES WITH LOW AIR PRESSURE IN THE FRONT RIGHT TIRE OF MY 2001 BUICK REGAL.  THERE HAS ALSO BEEN SIGNIFICANT CORROSION ON ALL OF THE CHROME COATED ALUMINUM RIMS SINCE MY PURCHASE.  I HAVE TRIED TO RESOLVE THIS ISSUE UNDER WARRANTY DURING THE FIRST YEAR OF OWNERSHIP WITH MY DEALERSHIP, GM CUSTOMER SERVICE, AND VARIOUS TIRE MANUFACTURERS.  ALL PARTIES INVOLVED WILL NOT TAKE RESPONSIBILITY FOR THESE PROBLEMS CITING REASONS HAVING TO DO WITH MOTHER NATURE, AND/OR  BLAMING EACH OTHER TO AVOID THE ISSUE.                                                                        I RECENTLY HAD A FRONT TIRE CHANGE  WHERE THE EMPLOYEE WORKING ON IT INFORMED ME OF A \"CRACKED OR \"FRACTURED\" WHEEL.  AFTER CONTACTING GM CUSTOMER SERVICE AND BEING SENT TO THE DEALERSHIP AGAIN, I WAS TOLD THAT THE CRACK MUST HAVE COME FROM EITHER CORROSION, OR HITTING A POTHOLE.  I DISAGREED WITH THEIR ASSESSMENT AND DEMANDED A NEW RIM FREE OF CHARGE.  THIS IS THE FIRST TIME THAT I HAVE EVER EXPERIENCED A CRACK IN A RIM.  IT IS MY POSITION THAT THIS IS A MAJOR SAFETY ISSUE, AND COULD POSSIBLY CAUSE A \"DEATH IN THE FIELD\".     I WILL BE REPLACING THE RIM AT MY COST, YET I NEED THIS ISSUE RESOLVED BEFORE THE OTHER THREE RIMS ON MY CAR POSSIBLY CRACK.  ALSO, I NEED TO FIND OUT HOW \"COMMON\" CRACKED RIMS ARE ON THIS MODEL VEHICLE, AND WHY THEY WERE NEVER RECALLED.      *JB",
        "vin": "2G4WF551911"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/20/2006",
        "dateOfIncident": "12/05/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176688,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "FUTURA",
                "productModel": "FUTURA 2000 RADIAL LTE",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "TL*- THE CONTACT CALLED TO INFORM NHTSA THAT HE RECEIVE A RECALL LETTER FROM PEP BOYS ON HIS TIRES, THE COOPER FUTURA 2000 RADIAL LTE, SIZE 225/60/R16. THE CONTACT STATED THAT  HE TOOK HIS VEHICLE TO PEP BOYS TO HAVE THEM REPLACE THE TIRE BECAUSE THIS IS A PEP BOY RECALL, AND THEY DECLINE TO DO SO.  PEP BOYS STATED THEY WERE UNAWARE OF THE RECALL.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2006",
        "dateOfIncident": "11/08/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173442,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED UPON EXITING THE VEHICLE, THERE WAS A SMELL OF PLASTIC BURNING.  THE CONTACT DISMISSED THE SMELL AND ENTERED THE HOME.  SHORTLY THEREAFTER, THE CONTACT SAW SMOKE COMING FROM OUTSIDE THE GARAGE DOOR.  UPON INSPECTION, IT WAS NOTED THAT THERE WERE 20 FOOT HIGH FLAMES COMING FROM THE LEFT SIDE OF THE HOOD.  DURING THE FIRE, THE VEHICLE ENGINE ATTEMPTED TO START TWICE ON ITS OWN.  THE FIRE BURNED THE SIDING ON THE HOUSE, AND MELTED THE FRONT OF THE GARAGE DOOR.  THE VEHICLE WAS CONSIDERED A TOTAL LOSS, AND WAS NOT BEEN SEEN BY DEALER.  THE MANUFACTURER HAD NOT RETURNED PHONE CALLS FROM THE CONTACT.*AK",
        "vin": "2G4WB55K811"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/25/2006",
        "dateOfIncident": "12/28/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171785,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REGULATOR AND MOTOR MALFUNCTION IN MY 2001 BUICK REGAL.  ALL 4 WINDOWS HAVE HAD PROBLEMS WITH THIS OFF AND ON SINCE I PURCHASED THE CAR IN DECEMBER 2001.  THEY STOP WORKING FOR A MONTH OR SO, THEN START WORKING AGAIN.  ONE QUIT WORKING COMPLETELY, SO I TOOK IT TO THE BUICK DEALER IN FORT WALTON BEACH, FL.  THEY WANTED SEVERAL HUNDRED DOLLARS TO FIX IT.  I COULD NOT AFFORD THIS, SO THEY SAID FOR LESS THEY COULD BOLT IT IN THE UP POSITION.  THEY SAID THAT WAS BETTER THAN IT BEING STUCK DOWN.  SO I TOLD THEM TO DO THAT FOR NOW.  NOW THE FRONT PASSENGER IS BROKEN IN THE HALFWAY DOWN POSITION.  THE OTHER WINDOWS WORK FOR A WHILE THEN QUIT WORKING.  *NM",
        "vin": "2G4WB55K511"
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/21/2006",
        "dateOfIncident": "10/21/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 BUICK REGAL, PURCHASED NEW IN OCTOBER 2001.  IN MAY 2005 THE REAR WINDOW ON THE PASSENGER SIDE FELL. I TOOK IT FOR REPAIR AT A BUICK DEALER AND IT COST ME $516 FOR PARTS AND LABOR.  A SHORT TIME AGO THE FRONT WINDOW ON THE PASSENGER SIDE FELL, AND TODAY THE FRONT WINDOW ON THE DRIVER'S SIDE FELL.  I AM IN THE CAR ALONE 99.99% OF THE TIME.  THE REAR WINDOWS AND PASSENGER WINDOW ARE NEVER DOWN.  INITIALLY I THOUGHT THAT WAS WHY THEY FAILED, BUT NOW THE DRIVERS WINDOW FELL.  I SEE THAT JEEP VEHICLES HAVE HAD THE SAME PROBLEM.  BEING GM PRODUCTS, HAS THIS BEEN DISCUSSED.  I JUST PAID THIS CAR OFF AND FEEL IT IS PROBABLY THE WORST VEHICLE I HAVE EVER OWNED.  I HAVE REPLACED THE CATALYTIC CONVERTER AND HAD ISSUES WITH THE TRANSMISSION.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2006",
        "dateOfIncident": "09/09/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168295,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE'S ENGINE LOST POWER DUE TO AN ELECTRICAL ISSUE.  THE SERVICE DEALER DETERMINED THE VEHICLE COULD BE REPAIRED AT A COST.",
        "vin": "2Z4WB55K511"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/06/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168036,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 REGAL POWER WINDOWS FAILED.  *TS  THE CONSUMER STATED THE WINDOW WOULD SUDDENLY GO DOWN AND WOULD NOT COME BACK UP WHEN THE BUTTON WAS PRESSED.*JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165815,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL AUTOMATIC TRANSMISSION FAILED. *KB  WHILE DRIVING, THE CONSUMER NOTICED THE VEHICLE HAVE A SLIGHT LURCH, A WEAK THUD AND IT KICKED DOWN FROM DRIVE TO THIRD GEAR.  THE CONSUMER PULLED OVER TO A REST STOP AND WHEN HE WAS GETTING READY TO LEAVE, THE VEHICLE WOULD NOT MOVE IN REVERSE, FIRST OR SECOND GEAR. IT WOULD ONLY LURCH FORWARD WHEN IN DRIVE.  THE VEHICLE WAS TAKEN TO A REPAIR FACILITY WHERE IT WAS DETERMINED THE PLANETARY HAD A BROKEN GEAR, SOME DAMAGED CLUTCH DISKS AND METAL FRAGMENTS IN THE PAN.  THE CONSUMER DIDN'T GET TOO FAR WHEN ALL OF A SUDDEN HE SMELLED FUMES AND SAW BLUE SMOKE COMING FROM THE REAR OF THE VEHICLE. THE CONSUMER PULLED OVER, OPENED THE HOOD AND SAW BLUE SMOKE COMING FROM THE ENGINE COMPARTMENT. THE CONSUMER AND A POLICE OFFICER OBSERVED A DAMP SPOT ON THE GROUND WHICH TURNED OUT TO BE TRANSMISSION FLUID. WHEN THE TRANSMISSION STICK WAS CHECKED IT SHOWED THERE WAS NO FLUID. A HAIRLINE CRACK WAS DISCOVERED IN THE LEFT COVER AND WHEN IT BECAME HOT, IT EXPANDED FORCING OUT FLUID. *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2006",
        "dateOfIncident": "07/04/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163234,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2001 BUICK REGAL LOST IT'S A/T AT 40,300 MILES, LOCKED OUT OF REVERSE, GEARS 1 & 2. ONLY HAD DRIVE-3.  WHY DOES THE GM AND AMERICAN CARS LOSE THEIR A/T MORE SO THAN THE JAPANESE CARS. WE WERE CURSING ON I-5 AT 70 MPH IN CRUISE CONTROL SOUTH OF STOCKTON, CA, WHEN THE CAR GAVE A SLIGHT LURCH, A THUD AND SLOWED DOWN. I STOPPED CHECKED THE TIRES, ALL OK. CHECKED THE ENGINE OIL AND A/T FLUID, ALL OK. PROCEEDED TO OXNARD, CA HAD THE A/T REPAIRED COSTING US SENIORS $3,600--OUCH.  THE SHOP SAID THE PLANETARY GEAR AND THE CLUTCH DISKS WERE BROKEN WITH METAL FRAGMENT IS THE PAN. I KNOW IT WAS OUT OF WARRANTY, BUT GOSH, IT SHOULD HAVE LASTED LONGER THAN IT DID KONKING OUT AT 40,300.  OUR SON DROVE HIS TOYOTA CAMRY 130,00 WITH OUT PROBLEMS, WHY CAN'T AMERICAN CARS BE AS RELIABLE. MY NEXT CAR WILL BE JAPANESE, AND THAT IS A PROMISE. THANKS, LLOYD PEARSON.  *NM",
        "vin": "2G4WB55K011"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2006",
        "dateOfIncident": "01/02/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED A CLUNKING NOISE WHEN MAKE TURNS AT SLOW SPEED.  SYMPTOMS INCLUDED LOOSENESS IN THE STEERING WHEEL AND A POPPING IN THE BRAKE PEDAL DURING TURNS AT LOW SPEEDS.  THIS WAS FIXED UNDER WARRANTY AT ABOUT 25,000 MILES (RE-LUBRICATING IN THE INTERMEDIATE STEERING SHAFT), BUT THE PROBLEM HAS RESURFACED AT 50,000 MILES. *JB",
        "vin": "2G4WB55K311"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/27/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FM (CA) RE DEFECTIVE 2001 - 2003 BUICK REGAL LS & GS STEERING SHAFT, REQUESTS A DEFECT INVESTIGATION.  *TS   THE DEALER INFORMED THE CONSUMER IT WOULD COST 287.00 DOLLARS TO FIX THE PROBLEM. THE CONSUMER ALSO HAD THE BRAKES REPAIRED ON THE VEHICLE. *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/18/2005",
        "dateOfIncident": "09/10/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2001 BUICK CENTURY.  THE POWER WINDOWS WERE DEFECTIVE.  THE CONTACT TOOK HER VEHICLE TO DEALER.  THE CONTACT  DID NOT WANT TO PAY FOR THE WINDOWS TO BE FIXED. *AK  *NM",
        "vin": "2G4WS52J411"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/22/2005",
        "dateOfIncident": "09/16/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137266,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL LS.  I LOST ALL VACUUM TO BRAKES AND STEERING. ENGINE DIED. TOOK IT TO C_SPECK MOTORS IN SUNNYSIDE, WA FOR INVESTIGATION. THEY FOUND THAT THE INTAKE COVER, WHICH IS EITHER PLASTIC OR FIBERGLASS HAD A HOLE ABOUT 1 1/2 INCH IN DIAMETER BURNT THROUGH JUST BEHIND THE AIR INTAKE HOSE. ON TOP OF THE HOLE IS A WIRING HARNESS THAT HAS THE FLEX  BURNT THROUGH AND THE WIRING HARNESS TAPE IS BURNT THROUGH. WIRES APPEAR TO BE OK. IT COULD HAVE CAUSED AN ACCIDENT AND OR CAUGHT FIRE.*JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "09/03/2005",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135483,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I RETURNED HOME FROM A SHORT TRIP TO THE STORE ON 9/3/05, TURNED OFF THE CAR, AND PARKED MY 2001 BUICK REGAL GS IN THE DRIVEWAY.  ABOUT 5-10 MINUTES LATER, MY HUSBAND SAID HE SMELLED SOMETHING BURNING.  HE LOOKED OUT THE FRONT DOOR, AND SMOKE AND FLAMES WERE COMING FROM UNDER THE HOOD OF THE CAR.  I CALLED 911, AND MY HUSBAND ATTEMPTED TO CONTAIN THE FLAMES UNTIL THE FIRE DEPARTMENT ARRIVED.  THE ENGINE TRIED TO START, ON ITS OWN, WHILE IT WAS BURNING.  THE CAR RADIO CAME ON.  THE ENGINE WAS ENGULFED IN FLAMES WHEN THE FIRE DEPARTMENT ARRIVED.  THE CAR APPEARS TO BE A TOTAL LOSS.  IN ADDITION, THE HEAT FROM THE FLAMES MELTED THE VINYL SIDING ON MY HOUSE, INASMUCH AS THE CAR WAS PARKED IN FRONT OF THE GARAGE NEXT TO THE HOUSE.   *NM",
        "vin": "2G4WF551111"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER STATES THERE IS AN ODOR COMING FROM THE AIR CONDITIONER.  THERE IS A TECHNICAL SERVICE BULLETIN REGARDING THIS ISSUE IT STATES THERE IS A GROWTH ON THE EVAPORATOR CORE.    *TT",
        "vin": "2G4WB55K811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121526,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BUICK REGAL EXPERIENCED STALLING .   *MR   THE VEHICLE ALSO EXPERIENCED SUDDEN ACCELERATION.  THE SERVICE DEALER WAS UNABLE TO FIND THE PROBLEM.   *SC    *JB",
        "vin": "2G4WBSSK911"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/02/2005",
        "dateOfIncident": "05/02/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119395,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A CLUNKING NOISE WHEN THE STEERING WHEEL WAS TURNED IN ANY DIRECTION. IT COULD BE FELT IN THE STEERING WHEEL AND THE BRAKE PEDAL. IT GOT PROGRESSIVELY WORSE OVER TIME. I TOOK IT TO THE DEALERSHIP AND THEY SAID IT HAD A FAULTY RACK. IT WAS REPLACED UNDER THE WARRANTY AND THE NOISE IS GONE.",
        "vin": "2G4WF551711"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/02/2005",
        "dateOfIncident": "02/10/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116271,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL CHECK AND WARNIING LIGHTS COME ON WITH ENGINE SHUTDOWN WHEN USING  TURN SIGNAL SWITCH.  *AK",
        "vin": "2G4WB52K211"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/18/2005",
        "dateOfIncident": "02/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110759,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2001 BUICK REGAL (ABOUD PACKAGE).  TODAY, MY HUSBAND PLACED HIS KEY IN THE IGNITION, WE DROVE SOMEWHERE AND THE KEY WOULD NOT DISENGAGE.  I TOOK THE CAR TO MY BUICK DEALER, WHO IS CHARGING ME 240.00 TO FIX THE IGNITION CYLINDER DUE TO A PROBLEM WITH THE TUMBLERS.  I HAVE NO CONTROL OVER THIS PART AND WOULD LIKE TO KNOW WHY IT IS NOT UNDER WARRANTY FOR THE LIFE OF THE CAR.  I HAVE BEEN A LOYAL BUICK CUSTOMER, BUT WILL RECONSIDER WHEN I PURCHASE MY NEXT CAR.*AK    THANKS!    NANCY MANASKA (DISAPPOINTED BUICK OWNER)",
        "vin": "2G4WF551611"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/11/2005",
        "dateOfIncident": "09/29/2004",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096795,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE VEHICLE, A FIRE STARTED UNDERNEATH THE HOOD. THE CONSUMER PUT THE OUT THE FIRE AND HAD THE VEHICLE TOWED. PLEASE PROVIDE MORE INFORMATION. *JB",
        "vin": "2G4WB55K211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/27/2004",
        "dateOfIncident": "12/25/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104583,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO COMPLAIN ABOUT THE TRASMISSION ON MY 2001 BUICK REGAL W/ 69500 MILES ON IT. ON 12/25/2004 AFTER ACCELARATING ON AN ON RAMP TO THE FREEWAY, MY TRANSMISSION GAVE A CRACKING SOUND. AFTER THAT INCIDENT, I HAVE HAD TROUBLE WITH THE TRANSMISSION NOT SHIFTING CORRECTLY WHEN I START ACCELARATING FROM A STANDING POSITION. IT WILL HESITATE WHEN GAS PEDAL IS PUSHED. NOT A GOOD SIGN FOR A CAR THAT SHOULD STILL BE IN DECENT SHAPE HAVING ONLY THIS AMOUNT OF MILES.*AK",
        "vin": "2G4WB55KX11"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/20/2004",
        "dateOfIncident": "08/05/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105112,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER HEARD A CLANKING NOISE. WHEN TRYING TO TURN TO THE LEFT VEHICLE CONTINUED TO GO STRAIGHT. CONSUMER CONTACTED THE DEALER, WHO THOUGHT IT WAS THE SHAFT, BUT WAS NOT COMPLETELY CERTAIN. ALSO,  DEALERSHIP WAS GUESSING AS TO WHY THIS DEFECT MAY OCCUR. WHEN CONSUMER CONTACTED THE MANUFACTURER HE  INDICATED THAT VEHICLE HAD TOO MANY MILES AND  WAS OUT OF WARRANTY.  THEY WILL NOT MAKE ANY REPAIRS.*AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/15/2004",
        "dateOfIncident": "07/07/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081504,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING THE VEHICLE LOSES POWER.  THE DASHBOARD LIGHTS COME ON, AND THE VEHICLE SHUTS DOWN INTERMITTENTLY.  THE CONSUMER TRIED TO CONTACT THE DEALERSHIP MANAGER, BUT THE MANAGER REFUSED TO DISCUSS THE PROBLEM.   *AK    THE VEHICLE WOULD RUN IN HIGH GEAR AND NEVER CHANGE GEARS AND WOULD RUN UP TO 50 MPH BEFORE IT STOPS, THERE WERE TIMES WHEN THE VEHICLE WOULD RUN PERFECTLY, THERE WERE NOISES COMING FROM THE FRONT END, AND WHEN THE VEHICLE PULLED OUT FROM STOP, WHILE IN TRAFFIC, THE CONSUMER WOULD BE ABLE TO ACCELERATE TO THE FLOOR AND THE VEHICLE WOULD TAKE OFF AT 5 MPH.   *SC",
        "vin": "2G4WB55K211"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/15/2004",
        "dateOfIncident": "09/16/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095831,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 BUICK REGAL LES. THE CAR WAS PURCHASED FROM A DEALER AS A USED CAR IN JANUARY 2004. I NOTICE THE CAR WAS HARD TO START. I TOOK IT TO A CAR REPAIR PLACE AND THEY COULD NOT FIND THE PROBLEM BUT CALLED A BUICK DEALERSHIP AND WAS TOLD THERE WAS A RECALL ON THE CAR FOR THROTTLE BODY BOLTS. I TOOK THE CAR TO THE BUICK DEALERSHIP TO HAVE THE RECALL DONE ON THE CAR AND THEY DID THE RECALL AND REPLACED A FUEL PRESSURE REGULATOR WHICH HAD FAILED. I HAD TO PAY $197.00 TO HAVE THAT WORK COMPLETED. AFTER PICKING UP THE CAR, I THEN NOTICED THAT MY CAR WAS LEAKING  ANTIFREEZE AND THE CAR WAS SHIFTING HARD BETWEEN 1ST TO 2ND AND 2ND TO 3RD GEARS (AUTOMATIC TRANSMISSION).  I GOT MY HUSBAND TO LOOK AT THE CAR AND HE SPOTTED WHERE IT WAS COMING FROM BUT WE TOOK IT BACK TO THE PRIVATELY OWNED CAR MECHANIC SHOP AND WAS TOLD THE THE PLASTIC INTAKE MANIFOLD WAS CRACKED. I PAID THAT MECHANIC OVER $400.00 TO HAVE THAT FIXED. I ALSO HAD THEM LOOK AT THE SHIFTING PROBLEM AND THEY COULD NOT FIND WHAT WAS WRONG. I HAVE TWICE TAKEN THE CAR TO THE TRANSMISSION SERVICE CENTER AND THEY CHANGED THE FLUID AND REPLACED THE GASKET BUT CANNOT FIND ANYTHING WRONG WITH THE AUTOMATIC TRANSMISSION. I AM VERY DISAPPOINTED WITH BUICK. I CONTACTED THEM BY E-MAIL AND BY PHONE AND WAS TOLD MY CAR WAS NOT A PART OF THE RECALL INVOLVING THE FUEL PRESSURE REGULATOR AND PLASTIC MANIFOLD. CAN ANYONE HELP ME IN REGARDS TO THESE CAR PROBLEMS? THE TRANSMISSION IS STILL SHIFTING HARD.   *AK",
        "vin": "2G4WB55KX11"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/15/2004",
        "dateOfIncident": "09/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092343,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HAS A CONCERN THAT THE AIR BAG LIGHT WILL ILLUMINATE WHILE DRIVING. DEALER WAS NOTIFIED. PLEASE PROVIDE ANY FURTHER INFORMATION. *JB",
        "vin": "2G4WB55K611"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/13/2004",
        "dateOfIncident": "07/10/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "L SERIES",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPORTED THIS TO THE BUICK DEALER ONCE BEFORE  AND THEY SAID THERE WAS NO RECALL. THE CRUISE CONTROL HANGS AND ACCELLERATES. IT IS ALL YOU CAN DO TO GET IT STOPPED.I QUIT USING IT FOR A LONG TIME AND TRIED IT AGAIN RECENTLY AND ALMOST REAR ENDED ANOTHER CAR.THE DEALER SAID THEY WOULD NOT EVEN KNOW WHERE TO START LOOKING FOR THE PROBLEM.*AK",
        "vin": "2G4WB55K111"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/06/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081827,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S PLASTIC INTAKE MANIFOLD WARPED FROM HEAT OF THE ENGINE.*MR  *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/15/2004",
        "dateOfIncident": "04/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066241,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SYSTEM HARD TO TURN WHEN COLD (IN WINTER MONTHS) FEELING OF LOOSENESS IN STEERING AND ROAD BUMPS TRANSMITTED INTO STEERING WHEEL AND SOMETIME BRAKE PEDAL IF BRAKING.REPAIR SHOP CLAIMS THAT MANY LATE MODEL GM PRODUCTS ARE HAVING SIMILAR PROBLEMS AND ADVISE THAT IT MAY TAKE STEERING RACK REPLACEMENT.  *AK",
        "vin": "2G4WF551411"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/23/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055437,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT A  POWER STEERING PROBLEM,  ESPECIALLY WHEN TURNING LEFT.  *AK  THE WHEEL LOCKED UP FOR A SECOND.  *JB",
        "vin": "2G4WB55K211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": "09/09/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062390,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION ON MY 2001 BUICK REGAL HAD PROBLEM SHIFTING,TO FIND OUT TRANSMISSION TOTALLY FELL APART AFTER 45000 MILES,HAD TO REBUILD TRANSMISSION AT CONSIDERABLE COST CONVENIENTLY 10000 MILES OR LESS OUT OF WARRANTY,FINDING OUT BY THIS WEBSITE THAT OTHER REGALS HAVE HAD TRANSMISSION DEFECTS AND TOTAL FAILURES.  *NM",
        "vin": "2G4WB55K211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2004",
        "dateOfIncident": "10/12/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060548,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAD BEEN SOUNDING ROUGH AND SLIGHTLY SLIPPING GOING UP HILL IN DRIVEWAY SOON AFTER PURCHASING CAR AS USED. CAR WAS SAID TO HAVE PASSED GMC 100+ POINT INSPECTION.   TRANSMISSION COMPLETELY FAILED AFTER ABOUT ONE WEEK OF OWNERSHIP AT 25,000 MILES.  DEALERSHIP AND BUICK RESPONDED VERY SATISFACTORILY.  REPAIRS COMPLETED UNDER WARRANTY.  REPAIRS TOOK ABOUT ONE WEEK THOUGH A SECOND ATTEMPT HAD TO BE MADE AFTER TRANSMISSION CONTINUED TO SLIP SLIGHTLY WHEN GOING UP HILLS, MORE NOTICEABLE AT HIGHER SPEEDS AND AFTER A STOP AND TURNING LEFT.  DEALERSHIP REPORTED THE FOLLOWING ON INITIAL REPAIRS:  \" ...FLUID PRESSURES OK.  R&R TRANS (4T65E). FOUND INPUT AND REACTION CARRIER ASSEMBLY GEARS BROKEN. TORRINGTON THRUST BEARING FAILED, DAMAGING GEARS.  REPLACED CARRIER, SUN GEAR,INPUT COMPLETE CARRIER,CARRIER DRUM, 2/1 BAND, BEARING, FILTER, AXLE SEAL, GASKETS AS NEEDED, FLUSH CASE AND RELATED COMPONENTS TO REMOVE PARTICLES\"    SUBSEQUENT CONTINUED PROBLEMS RESULTED IN THE FOLLOWING REPAIRS:  \".....ROAD TEST -PERFORMA DIAG. ISOLATED TO VALVE BODY VALVES BINDING IN THEIR BORES.  REPLACED TRANSMISSION VALVE BODY AND GASKET,....\"  CAR HAS FUNCTIONED WELL SINCE AND AS OF 3/5/04.*AK",
        "vin": "2G4WB55K711"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2004",
        "dateOfIncident": "02/26/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059859,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65 MPH AND ENGAGING THE CRUISE CONTROL VEHICLE SUDDENLY  ACCELERATED. DRIVER TAPPED THE BRAKES AND SPEED INCREASED EVEN MORE. *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/26/2004",
        "dateOfIncident": "02/23/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059074,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON THE INTERSTATE I HAD MY CRUISE CONTROL SET ON 70 MPH AND ALL OF A SUDDEN MY CAR JUMPED TO 90 MPH BEFORE I REALIZED IT. I HIT THE BRAKES TO DISENGAGE IT. IT DID THIS 3 OR 4 TIMES AND THE LAST TIME I NEARLY REAR ENDED A CAR SO I JUST QUIT USING IT. ALSO WHEN I WOULD USE MY SIGNAL FOR A RIGHT LANE CHANGE IT WOULD KILL THE CRUISE AND I WOULD HAVE TO HIT THE GAS REAL QUICK TO GET IN THE OTHER LANE.*AK",
        "vin": "2G4WB55K111"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "02/10/2004",
        "dateOfIncident": "10/03/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056933,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS STATED IN SEVERAL OTHER COMPLAINTS MY BRAKES HAVE RUSTED AND ALSO SCREECH. I HAVE ALSO REPLACED THEM LIKE OTHERS HAVE WITH THE SAME RESULT ( PUT NEW ROTORS ON THIS LAST TIME ALSO). THIS LAST TIME I HAD IT START SCREAMING ALMOST INSTANTLY AFTER REPLACING THEM. MY CAR ALSO HAS A SMALL SHAKE TO IT THAT CAN`T SEEM TO BE FIGURED OUT. IT COMES FROM THE FRONT END JUST LIKE OTHERS HAVE STATED.*AK",
        "vin": "2G4WB52K011"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/17/2003",
        "dateOfIncident": "12/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 BUICK REGAL HAS A \"LOOSENESS\" WOBBLING\" FEELING IN THE STEERING ON ALL PAVEMENTS AND IS ESPECIALLY NOTICEABLE WHILE TURNING OR CORNERING. I HAD THE CAR INTO A BUICK DEALER SEVERAL MONTHS AGO AND THEY PUT A GREASE BUSHING IN THE INTERMEDIATE STEERING SHAFT. THE PROBLEM WAS NOT SOLVED, BUT WAS LESSER FOR A WHILE. NOW AT 31,500 MILES THE PROBLEM IS AGAIN VERY NOTICEABLE AND EVEN MORE SO THAN BEFORE. I TOOK THE CAR BACK TO THE DEALER AND THEY THERE IS NOTHING WRONG WITH THE FRONT END. I HAVE HAD SEVERAL OTHER PEOPLE DRIVE THE CAR AND THEY CERTAINLY NOTICED THE LOOSE FEELING IN THE STEERING.*AK",
        "vin": "2G4WF551111"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048592,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A SQUEAKING NOISE COMING FROM THE STEERING WHEEL AREA WHEN TURNING LEFT OR RIGHT.  THE DEALER HAS BEEN CONTACTED. PLEASE PROVIDE ANY FURTHER INFORMATION. *JB",
        "vin": "2G4WB55K311"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/04/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025411,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE ROTORS RUSTED AT ONLY 17,000 MI.WAS TOLD CAR NOT DRIVEN ENOUGH.*AK",
        "vin": "2G4WB55K511"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2003",
        "dateOfIncident": "06/18/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023483,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION KEY HANGS UP CANT GET IT OUT, IT WILL COM OUT IF YOU WAIT SEVERAL MINUTES AFTER YOU TURN KEY OFF THE KEY FEELS RATHER WARM TO THE TOUCH WHEN YOU FINALLY GET IT OUT.   *NLM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/12/2003",
        "dateOfIncident": "05/18/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021467,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ROTORS NEEDED TO BE GROUND @ 21000 MILES AND THEN AGAIN @43000 MILES, FRONT END SHAKES BADLY WHEN BRAKING, MAKE CONTROL DIFFICULT.  *JB",
        "vin": "2G4WF551711"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/14/2003",
        "dateOfIncident": "05/16/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WE FIRST BOUGHT THE CAR THE CHECK ENGINE LIGHT CAME ON AND CAR WOULD NOT START. DEALER FINALLY FOUND THE PROBLEM. IT WAS A SENSOR. DEALER REPLACED SENSOR. IN MARCH 2003 CHECK ENGINE LIGHT STARTED COMING ON AGAIN. IT STAYS ON ALL THE TIME. SOME OF THE OTHERS COME ON TO. SERVICE ENGINE SOON ECT. IT HAS BEEN LESS THAN A YEAR SINCE WE HAD IT FIXED THE FIRST TIME. I THINK MAYBE IT COULD BE A DEFECT.  *NLM",
        "vin": "2G4WB55K211"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/30/2003",
        "dateOfIncident": "04/30/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016744,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING AT ABOUT 10,000 MILES THERE WAS A VERY DISTINCT RUBBING SOUND WHEN APPLYING THE BRAKES IN A NON-EMERGENCY SITUATION (IT REMINDED ME OF THE SOUND BRAKES MAKE WHEN THEY HAVE TOO MUCH WEAR AND USUALLY IT'S AN INDICATION THE BRAKES NEED TO BE RELPACED).  AT ABOUT 15,000 MILES I HAD THE CAR SERVICED AND THE DEALER STATED NO PROBLEM WITH THE BRAKES.  AT ABOUT 29,500 I HAD TO HAVE THE BRAKES AND ROTORS REPLACED.  ABOUT 5,000 MILES AFTER THE BRAKES AND ROTORS WERE REPLACED THE SOUND HAS STARTED AGAIN.  IT SOUNDS AS IF THE ABS IS CONSTANTLY ENGAGED BUT THIS HAPPENS WHENEVER PRESSURE IS APPLIED TO THE BRAKES.  I'M CONVINCED THERE IS A BRAKE PROBLEM THAT HAS NOTHING TO DO WITH NORMAL WEAR AND TEAR AND I'M CONCERNED THE BRAKES WILL FAIL IN AN EMERGENCY.  THE DEALERS SEEM UNABLE TO IDENTIFY A PROBLEM.  DOES YOUR AGENCY HAVE ANY RECORDS OF BRAKE PROBLEMS WITH THE 2001 BUICK REGAL GS?",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2003",
        "dateOfIncident": "03/05/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IN MY 2001 BUICK REGAL GS, WHEN FIRST PURCHASED, HAD A CLUNK IN IT AT ABOUT 42-45 MPH, AFTER LETTING GO OF THE ACCELERATOR, AND COASTING DOWN A HILL.  I HAD TOLD THE DEALERSHIP ABOUT IT, BUT THEY COULDN'T DUPLICATE THE PROBLEM.  FINALLY THE 10TH TIME, I HAD TAKEN THE SERVICE MANAGER OUT TO THE LOCATION WHERE IT WOULD CLUNK.  THEY FINALLY TOOK THE TRANSMISSION APART AND FOUND  THERE WAS A SLIGHTLY STRIPPED SHAFT AND A COUPLE OTHER COMPONENTS BAD IN THE TRANSMISSION.  THE TRANSMISSION HAS NOW DEVELOPED ANOTHER PROBLEM.  IN THE MORNINGS ON MY WAY OUT AND THE CAR SITTING OVERNIGHT, AT ABOUT 20-35 MPH, IT WILL SHIFT RUFF, LIKE IT JERKS YOU AHEAD, LIKE I AM DRIVING A MANUAL TRANSMISSION, NOT USING THE CLUTCH.  HAS ANYONE ELSE EXPERIENCED THESE KIND OF PROBLEMS WITH THEIR REGAL GS?  *JB",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/11/2002",
        "dateOfIncident": "09/03/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018383,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN AIR BAG WARNING STICKER LOCATED ON BOTH SUNVISORS, IT DISTRACTS  DRIVER'S VIEW. CANNOT REMOVE LABEL BY HANDS. DEALER REFUSED TO REMOVE LABEL, STATING BY LAW IT CAN NOT BE REMOVED.*AK *JB",
        "vin": "2G4WB55KX11"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/10/2002",
        "dateOfIncident": "08/16/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018301,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED AND WITH NO WARNING AIR BAG LIGHT STAYS ON, CAUSING AIR BAG TO BE INOPERATIVE IN THE EVENT OF A VEHICLE ACCIDENT. DEALER NOTIFIED.*AK  *YH",
        "vin": "2G4WB55K011"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2002",
        "dateOfIncident": "06/23/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIRES ON THE CAR HAVE FAILED.  I HAVE DONE THE ALL OF THE SCHEDULED ROTATIONS AND ALINGMENTS.  THE TIRES \"GOODYEAR EAGLE LS (225/60R16) ON MY 2001 BUICK REGAL ARE PUTTING MY LIFE AT RISK WHEN I DRIVE EVERYDAY FOR WORK.  I CONTACTED BUICK AND THEY STILL ARE MAKING A DETERMINATION TO REPLACE THESE FAILED TIRES, AT 23,900 MILES.  I BELIEVE THAT GM SHOULD OF TESTED THESE TIRES BEFORE THEY HAD MADE THE DECISION TO PUT THEM ON A QUITE PRICY CAR.  GOODYEAR I BELIEVE IS AT FAULT FOR PRODUCING SUCH A TIRE THAT IS A COMPLETE FAILURE.  I HOPE THAT SOMETHING IS DONE ABOUT THIS PROBLEM.*AK",
        "vin": "2G4WF551711"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "06/25/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013671,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ARE TO DIM, AND IT IS HARD FOR DRIVER TO SEE WHILE DRIVING AT NIGHT. CAUSE UNKNOWN. DEALER NOTIFIED.  *AK CONSUMER STATES THAT THE LIGHTS ARE DIM ON LOW BEAM ONLY. (DESIGN PROBLEM) AND THAT OTHER GM VEHICLES HAVE SAME PROBLEM AND LIGHTS ARE GOOD ON HIGH BEAM. *SCC",
        "vin": "2G4WB55K311"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006729,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AND APPLYING  CRUISE CONTROL AT 70-75 MPH ON  FREEWAY VEHICLE ACCELARATED TO HIGHER SPEED ON ITS OWN. PLEASE PROVIDE ANY FURTHER INFORMATION, AND VEHICLE IDENTIFICATION NUMBER.*AK",
        "vin": "UNKNOWN"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/31/2001",
        "dateOfIncident": "08/30/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 898550,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS INVOLVED IN A FRONT END COLLISION WHILE TRAVELING 35-40 MPH. UPON IMPACT, DRIVER'S SIDE AND PASSENGER'S SIDE AIRBAGS FAILED TO DEPLOY.  *AK  CONSUMER WROTE IN STATING THAT THIS IS NOT HER VEHICLE.   *JB",
        "vin": "N/A"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/31/2001",
        "dateOfIncident": "08/30/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 898551,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS INVOLVED IN A FRONT END COLLISION WHILE TRAVELING 35-40 MPH.  UPON IMPACT,  DRIVER'S SIDE AND PASSENGER'S SIDE SHOULDER BELTS RELEASED. DRIVER SUSTAINED INJURIES.  DEALER HAS BEEN CONTACTED. PLEASE PROVIDE FURTHER DETAILS.*AK",
        "vin": "N/A"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS BEING WASHED, CONSUMER DISCOVERED A BULDGE IN THE SIDEWALL AND A LIGHTENING TYPE JAGGED SEPARATION IN TIRE, CONSUMER WAS INFORMED BY MECHANIC THAT THE BULDGE AND CRACK WAS THE RESULT OF A PLY SEPARATION.(CONTINENTIAL TIRES)*JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "BUICK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS BEING WASHED, CONSUMER DISCOVERED A BULDGE IN THE SIDEWALL AND A LIGHTENING TYPE JAGGED SEPARATION IN TIRE, CONSUMER WAS INFORMED BY MECHANIC THAT THE BULDGE AND CRACK WAS THE RESULT OF A PLY SEPARATION.(CONTINENTIAL TIRES)*JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/01/2001",
        "dateOfIncident": "05/15/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 562338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RUSTED ROTORS CAUSED CLUNKING NOISE AT THE REAR END WHILE BRAKING.  NLM",
        "vin": "2G4WB55KX11"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2001",
        "dateOfIncident": "07/02/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747915,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 500 MILES WE ENCOUNTERED TRANSMISSION PROBLEMS.  FORTUNATELY THERE WAS A DEALERSHIP IN TEMECULA CA.  CARRIAGE MOTORS KEPT OUR CAR FOR TWO DAYS AND ADVISED THE TRANSMISSION WAS REPAIRED.  WE ENCOUNTER THE SAME PROBLEM AT 1240 MILES.  THE CAR WAS TAKEN TO HARDIN BUICK.  WE WERE ADVISED THAT THEY WERE SENDING THE TRANSMISSION TO BUICK AND THAT A NEW TRANSMISSION WAS BEING SENT TO THEM BY BUICK.  THIS WOULD TAKE FROM A WEEK TO TEN DAYS.  THE CAR HAS BEEN IN FOR REPAIR FOR MORE TIME THAN WE HAVE USED IT.  WE DO NOT WANT A CAR WITH A TRANSMISSION WE CAN'T RELY ON.  HAVE YOU HAD ANY OTHER COMPLAINTS ABOUT REGAL TRANSMISSION PROBLEMS?*AK",
        "vin": "2G4WB52K111"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/19/2001",
        "dateOfIncident": "02/27/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9002979,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL INCIDENTS WERE OF THE SAME NATURE. VEHICLE WOULD NOT DECELERATE WITHOUT EXCESSIVE BRAKING. ENGINE WOULD NEVER IDLE AT LESS THAN 1800 TO 2600 RPM'S.  WITH FOOT REMOVED FROM THE BRAKE THE CAR TRAVELED BETWEEN 35 TO 60 PLUS MPH, DEPENDING ON TERRAIN.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/07/2001",
        "dateOfIncident": "05/12/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 561508,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING RENTAL CAR FROM ALAMO RENTAL, VEHICLE EXPERIENCED A FLAT TIRE, AN INSPECTION OF THE OTHER 3 TIRES WAS DONE AND NOTED THAT THEY WERE IN VERY POOR CONDITION, TIRES WERE WORN AND WEAR INDICATORS WERE SHOWING, TIRES WERE 3 FIRESTONES AND 1 GENERAL AMERIA, NO OTHER SPECIFIC TIRE INFORMATION GIVEN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/05/2001",
        "dateOfIncident": "05/23/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 889821,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES  WERE RUSTIED.   WAS TOLD BY  DEALER THAT  BRAKES WERE RUSTED BECAUSE OF  ATMOSPHERE.*AK   *SLC",
        "vin": "2G4WB55KX11"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/31/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 561409,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "BUICK",
                "productModel": "REGAL",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ROTORS RUSTED.   *SLC",
        "vin": ""
    }
]