[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/16/2007",
        "dateOfIncident": "03/15/2007",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185294,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A 2001 DAEWOO NUBIRA.  THE CONTACT RECEIVED RECALL 04V357000.  THE RECALL STATED  THAT THE CAMSHAFT POSITION SENSOR MAY MELT, RESULTING IN A BURNING SMELL AND VISIBLE SMOKE, WHICH MAY SUBSEQUENTLY LEAD TO THE MELTING OF THE CAMSHAFT COVER AND THE CAMSHAFT POSITION SENSOR WIRE HARNESS.  THE BUICK DEALER REFUSED TO PERFORM  RECALL REPAIRS DUE TO THE VEHICLE BEING OUT OF WARRANTY.  THE CURRENT MILEAGE WAS 62,007. THE CHECK ENGINE LIGHT STAYED ON. *AK",
        "vin": "KLAJB52ZX1K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/13/2006",
        "dateOfIncident": "10/13/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170735,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT APPEARED ON DASHBOARD    I HAD RECEIVED A LETTER FROM DAEWOO INDICATING THAT THE CAMSHAFT POSITION SENSOR IS BEING RECALLED AND THAT I NEEDED TO HAVE IT REPLACED OR RISK FIRE/INSULATION BURN DAMAGE TO MY VEHICLE.    I MADE AN APPOINTMENT TO HAVE THE CMP SENSOR LOOKED AT, AND TO HAVE THE DIAGNOSTIC TEST RUN TO DETERMINE WHY MY CHECK ENGINE LIGHT CAME ON.    THE SERVICE DEPARTMENT WORKING ON MY CAR HAS DETERMINE THROUGH THE DIAGNOSTIC TESTING THAT IT IS THE CMP SENSOR THAT CAUSED MY CHECK ENGINE LIGHT TO GO OFF AND THAT IT MUST BE REPLACED FOR SAFETY PURPOSES.  THEY HAVE ALSO DETERMINED THAT MY PARTICULAR CMP SENSOR IS NOT SUBJECT TO THE RECALL DUE TO ITS SERIAL#, AND THAT IT IS COSTING ME $300 TO HAVE THIS REPLACED FOR THE PARTS AND LABOR.    I DO NOT UNDERSTAND HOW MY CMP SENSOR CANNOT BE COVERED BY THE RECALL.  I THINK THE RECALL NEEDS TO BE ENLARGED TO COVER MORE CMP SENSORS, OR OTHER DAEWOO OWNERS WHO DO NOT HAVE $300 TO CORRECT THIS DAMAGED SENSOR MAY ELECT NOT TO HAVE IT FIXED AND COULD DAMAGE THEIR CAR IN THE PROCESS.  *NM",
        "vin": "KLAJC52ZX1K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/09/2006",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167762,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I OWN A DAEWOO NUBIRA THAT WAS UNDER TWO SEPARATE RECALLS.  I WAS UNAWARE OF THE BRAKE RECALL AND TOOK MY CAR UP TO GET THE CAM SENSOR RECALL TAKEN CARE OF.  WITHOUT MY APPROVAL OR NOTIFCATION, THE BRAKE RECALL WAS ADDRESSED.  THE CAM SENSOR RECALL WAS FOUND NOT TO APPLY TO MY CAR.  AFTER HAVING MY NUBIRA FIXED BY AN AUTHORIZED DAEWOO DEALERSHIP, MY BRAKES COMPLETELY FAILED, WHILE I WAS DRIVING.  I HAVE ATTEMPTED TO SOLVE THIS PROBLEM THROUGH DAEWOO OF LITHIA SPRINGS AT NO COST TO MYSELF.  THEY HAVE MADE SEVERAL CLAIMS THAT IT WAS MY FAULT, IT WAS THE FAULT OF A POTHOLE AND VARIOUS OTHER ASSERTATIONS.  I HAD MY CAR TOWED (AT MY EXPENSE) TO JUST BRAKES WHO SAID THAT THE HOSE UNDER RECALL WERE IMPROPERLY INSTALLED, RUBBING AGAINST MY TIRE CAUSING BREAKAGE.  THIS COMPANY HAS BEEN VERY OFFHANDED ABOUT THIS SITUATION AND WON'T EVEN LET ME SPEAK TO THE HEAD SUPERVISOR.  DAEWOO DOES NOT CARE ABOUT RECALLS OR THEIR OBLIGATION TO PROTECT THE PUBLIIC.  *NM",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/30/2006",
        "dateOfIncident": "08/29/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167105,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FOUR (4) TIRES WERE PURCHASED (02/05) FROM FIRESTONE, 08/06 ONE OF THE  FRONT TIRES SEPARATED, A SECOND FRONT TIRE APPEARS TO BE DEFECTIVE ALSO.  TIRES WERE WARRANTED FOR 55,000K, THEY WERE DRIVEN ABOUT 17,223K.  WHILE DRIVING 08/06 VEHICLE BEGAN TO SHAKE BADLY, UPON CHECKING, IT WAS DISCOVERED THAT THE PASSENGER FRONT TIRE HAD SEPARATED.  TOOK TIRE TO FIRESTONE, REQUESTING TIRE BE REPLACED AT N/C, THEY REFUSED CLAIMING (1) IT WAS MY VEHICLES FAULT, (2) TIRE WAS OVERINFLATED (3)TIRES HAD NOT BEEN PROPERLY MAINTAINED.  I ASKED IF MY VEHICLE WOULD REQUIRE AN ALIGNMENT, DUE TO THE FACT THAT THE DEFECTIVE (SEPARATED) TIRE PROBABLY CAUSED THE VEHICLE TO BECOME MISALIGNED, WAS TOLD PROBABLY.  I WAS CHARGED $46.80 (08/29) FOR REPLACEMENT TIRE,(08/30) $69.47 FOR THE ALIGNMENT AND UNFORTUNATELY, THE OTHER DEFECTIVE TIRE IS STILL ON THE VEHICLE, AND I AM HOPEFUL IT DOESN'T SEPARATE.  I REQUESTED THE DEFECTIVE TIRE BE GIVEN TO ME AND I HAVE IT IN MY POSSESSION FOR INSPECTION.  I HAVE E-MAILED FIRESTONE, INFORMING THEM OF THE PROBLEM(S), THEY HAVE NOT RESPONDED.  *NM",
        "vin": "KLAJB82Z11K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2006",
        "dateOfIncident": "08/16/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165606,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE CHECK ENGINE LIGHT ILLUMINATED IN THE VEHICLE.  A RECALL LETTER WAS RECEIVED ON 9-04.   THE DEALER AND MANUFACTURER WERE CONTACTED AND AGREED THE VEHICLE WAS INCLUDED IN NHTSA RECALL, # 04V357000, CONCERNING ENGINE AND ENGINE COOLING.  HOWEVER, BOTH REFUSED TO REPAIR THE VEHICLE WITHOUT CHARGE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/31/2006",
        "dateOfIncident": "05/01/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163949,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:THE CONTACT STATED THAT THE VEHICLE EMITS A BURNING SMELL WHEN THE VEHICLE WAS DRIVEN.  A RECALL LETTER WAS RECEIVED REGARDING THE CAMSHAFT SENSOR.   THE CONTACT HAS NOT FOUND A SERVICE DEALER TO ASSIST WITH THE RECALL DUE TO UNAVAILABLE PARTS.  THE MANUFACTURER HAS NOT RETURNED ANY OF THE SIX CALLS AND MESSAGES LEFT ON THE CUSTOMER LINE SINCE 5/1/06.",
        "vin": "KLAJB52Z3YK"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/27/2006",
        "dateOfIncident": "06/07/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161579,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 NUBIRA HAS A PROBLEM CAMSHAFT POSITION.  *TS  THE CONSUMER RECEIVED A RECALL FOR THE CAMSHAFT POSITION SENSOR ON JUNE 6, 2006.  ON JUNE 7 THE CONSUMER CALLED THE NEAREST AUTHORIZED DEALER TO MAKE AN APPOINTMENT TO HAVE THE VEHICLE REPAIRED.  THE DEALER INFORMED THE CONSUMER THAT THEY WERE NOT ACCEPTING DAEWOO RECALLS.  THE CONSUMER CONTACTED DAEWOO CUSTOMER SERVICE AND LEFT TWO MESSAGES.  NO ONE EVER CALLED THE CONSUMER BACK.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2006",
        "dateOfIncident": "06/23/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160762,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE CHECK ENGINE LIGHT ILLUMINATED IN THE VEHICLE.  AFTER RECEIVING A RECALL LETTER, THE DEALER AND MANUFACTURER WERE ALERTED AND AGREED THE VEHICLE WAS INCLUDED IN NHTSA RECALL, # 04V357000 CONCERNING THE ENGINE AND ENGINE COOLING.  HOWEVER, THE DEALERSHIP INFORMED THE CONTACT THAT THE CAM SHAFT SENSOR DID NOT FALL WITHIN THE REPLACEMENT RANGE. THE DEALERSHIP CHARGED THE CONTACT FOR THE PARTS.  THE RECALL LETTER DID NOT STATE THE CAM SHAFT SENSOR HAD TO BE WITHIN A SPECIFIC RANGE.   UPDATED 7/14/2006 -*NM",
        "vin": "KLAJC52Z31K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/23/2006",
        "dateOfIncident": "06/15/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160575,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE CHECK ENGINE LIGHT ILLUMINATED ON THREE SEPARATE OCCASIONS RESULTING IN THE VEHICLE  LOSING POWER EACH TIME. ON THE FIRST VISIT TO THE DEALER, REPAIRS WERE MADE TO THE TRANSMISSION. SHORTLY AFTER FIRST VISIT TO DEALERS, THE VEHICLE BEGAN TO EXPERIENCE SAME PROBLEMS. AFTER SEVERAL VISITS TO THE DEALER, THE  CONTACT RECEIVED A RECALL LETTER PERTAINING TO THE  POSITION CENTER AND ENGINE CONTROL MODULATOR STATING THE CONSEQUENCES OF THIS DEFECT COULD CAUSE A FIRE IN ENGINE. THE VEHICLE WAS TAKEN BACK TO THE DEALERS WITH A COPY OF THE RECALL LETTER. DEALERS DETERMINED THAT THE ONLY REPAIRS NEEDED WERE TO TIGHTEN THE GAS CAP. THE RECALL REMEDY REPAIRS WERE NOT MADE. PROBLEM PERSISTS AND THE DEALERS WILL NOT REPAIR OR REPLACE PARTS ADDRESSED BY RECALL LETTER.",
        "vin": "KLAJC52Z01K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/22/2006",
        "dateOfIncident": "06/21/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160412,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED THE CHECK ENGINE LIGHT HAD BEEN ILLUMINATING FOR THE PAST 5 MONTHS. A RECALL NOTICE WAS RECIEVED FROM DAEWOO REGARDING THE CAMSHAFT POSITION SENSOR WHICH CAUSES THE ENGINE LIGHT TO ILLUMINATE. ON THE RECALL LETTER, THE VEHICLE'S VIN# WAS INCLUDED. WHEN THE VEHICLE WAS TAKEN TO THE THE DEALERSHIP, THEY DETERMINED THE CAMSHIFT FAILED CAUSES THE ENGINE LIGHT TO ILLUMINATE HOWEVER THE CAMSHIFT PART ON THIS VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS REPAIR BUT AT A COST.",
        "vin": "KLAJB52Z21K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/21/2006",
        "dateOfIncident": "06/20/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160381,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED A RECALL LETTER WAS RECIEVED FROM DAEWOO CONCERNING THE CAMSHAFT POSITION CENTER. AN APPOINMENT WAS MADE WITH THE NEAREST DEALER ON JUNE 20TH 2006 TO REPLACE PART. AFTER PART WAS REPLACED THE VEHICLE TRAVELED FOR 5 MILES AT A SPEED OF 45 MPH FROM DEALERS WHEN THE ENGINE LIGHT ILLUMINATED. THE VEHICLE WAS RETURNED TO DEALERS FOR FURTHER INVESTIGATION. THE DEALER DETERMINED THAT TO PERFORM ANY ADDITIONAL SERVICES A FEE OF $75 WOULD HAVE TO BE PAID. VEHICLE WAS THAN DRIVEN TO ANOTHER INDEPENDENT MECHANIC TO CHECK FOR THE CAUSE OF CHECK ENGINE LIGHT. THE INDEPENDENT MECHANIC DETERMINED THAT THE CAMSHAFT POSITION CENTER NEEDED TO BE REPLACED.  SEVERAL ATTEMPTS TO CONTACT THE MANUFACTURER ABOUT SERVICE TO VEHICLE RECALL HAVE BEEN MADE WITHOUT A RETURN RESPONSE. THE CAMSHIFT POSITION CENTER STILL NEEDS TO BE REPAIRED OR REPLACED.",
        "vin": "KLAJB52Z61K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159739,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A RECALL FROM DAEWOO MOTORS. THE LOCAL DEALERS IN FORT MYERS AND NAPLES NO LONGER SELL DAEWOO AND WILL NOT WORK ON THE RECALL. I HAVE E-MAILED DAEWOO TWO TIMES WITH NO RESPONSE. I NEED TO KNOW WHERE TO GET THIS RECALL DONE. PLEASE ADVISE. *JB",
        "vin": "KLAJB52Z41K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/12/2006",
        "dateOfIncident": "06/12/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159582,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE CHECK ENGINE LIGHT BEGAN ILLUMINATING INTERMITTENTLY HOWEVER NOW REMAINS ILLUMINATED.  A RECALL LETTER WAS RECEIVED NHTSA RECALL, #04V357000, REGARDING THE ENGINE AND ENGINE COOLING.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP FOR SERVICE WHO EXPLAINED THE PART NUMBER ON THE CAMSHAFT POSITION SENSOR WAS NOT INCLUDED IN THE RECALL.  THE CAMSHAFT IS THE ORIGINAL PART IN THE VEHICLE.  THE CONTACT HAS LEFT SEVERAL MESSAGES WITH DAEWOO HOWEVER NO ONE HAS RETURNED A CALL.",
        "vin": "KLAJC52Z31K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2006",
        "dateOfIncident": "05/20/2006",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158990,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A SAFETY RECALL NOTICE ON MY DAEWOO NUBIRA AND I CANNOT FIND ANYONE TO SERVICE THE CAR.  THE CHECK ENGINE LIGHT IS ON AND I'M AFRAID THE CAR IS GOING TO CATCH ON FIRE.  I HAVE CALLED THE DEALER I PURCHASED THE VEHICLE FROM AND THEY SAY THEY ARE NO LONGER AFFILIATED WITH DAEWOO. I HAVE CALLED DAEWOO MOTOR AMERICA AND LEFT MESSAGES AND NO ONE HAS RESPONDED. *NM",
        "vin": "KLAJB52Z41K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/15/2005",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142760,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATES SHE HAD EXCESSIVE WEAR ON THE FRONT TIRES FOR THE PAST TWO MONTHS.  THIS CAUSED HER TO GO THROUGH SIX TIRES IN THAT TIME.  UPON INSPECTION, THE DEALERSHIP FOUND THE FRONT BUSHINGS WERE MISSING.  BECAUSE THE WARRANTY HAS EXPIRED, THE REPAIR WILL HAVE TO BE DONE AT THE OWNER'S EXPENSE.  *NM",
        "vin": "KLAJC52Z91K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/23/2005",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137417,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2001 DAEWOO NUBIRA.  THE CONSUMER STATES WHEN  DRIVING AT A 60 MPH THE VEHICLE SWAYS ALL OVER THE FREEWAY.  THE VEHICLE HAS BEEN LIKE THIS FOR SEVERAL YEARS.  THE VEHICLE WAS CHECKED BY SEARS, AND THEY FOUND NO PROBLEM WITH THE FRONT END OR TIRES.  THE VEHICLE HAS DONE THIS SINCE PURCHASE.  DAEWOO DOES NOT KNOW WHY THIS IS HAPPENING EITHER.*AK",
        "vin": "KLAJB52Z51K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/05/2005",
        "dateOfIncident": "04/05/2005",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119979,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER' VEHICLE WAS RECALLED FOR A FAULTY CRANK SENSOR BUT THE PART NUMBER WAS NOT LISTED.  THE CHECK ENGINE LIGHT WAS ILLUMINATED DUE TOT HIS FAULTY PART.  THE CONSUMER ATTEMPTED TO CONTACT THE MANUFACTURER BUT THEY WERE OUT OF BUSINESS.  THE DEALER REFUSED TO REPLACE THE PART.  *NM",
        "vin": "KLAJB52Z61K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/02/2005",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108457,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INFORMED OF A RECALL REGARDING MY CHECK ENGINE LIGHT AND THE CAMSHAFT SENSOR. WHEN I TOOK IT TO A AUTHORIZED REPAIR SHOP, THEY CHARGED ME FOR THE REPAIR EVEN THOUGH IT WAS UNDER A RECALL. I HAD SPENT NUMEROUS AMOUNTS OF MONEY TRYING TO PASS MY EMMISSIONS TEST AND HAVING THE CHECK ENGINE LIGHT CHECKED PRIOR TO THE RECALL.*AK",
        "vin": "KLJAB52Z11K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/16/2004",
        "dateOfIncident": "12/14/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103918,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TAKEN TO DEALER  FOR THE CAM SHAFT SENSOR RECALL 04V357000 REPAIRS.  THE PART WAS REPLACED, AND THE CHECK ENGINE LIGHT WAS ON AGAIN.    *AK",
        "vin": "KLAJC52Z31K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "11/27/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100771,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WILL NOT STEER PROPERLY.  WHILE DRIVING, NO MATTER WHAT KIND OF ROAD CONDITIONS, BRAKING OR SPEED, THE VEHICLE'S STEERING BECOMES UNCONTROLLABLE.  ON SATURDAY, NOVEMBER 27, 2004, I WAS DRIVING WEST ON I-10 AND THE CAR WENT FROM THE FAR RIGHT LANE INTO THE FAR LEFT LANE.  IN THIS AREA, I-10 IS THREE LANES AND I WAS TAKEN COMPLETELY BY SURPRISE.  IF ANY OTHER CARS HAD BEEN IN THE VICINITY, IT COULD HAVE CAUSED A MAJOR ACCIDENT.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/15/2004",
        "dateOfIncident": "11/15/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098885,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS THAT THE DAEWOO CORP. HAS FILED BANKRUPTCY AND IS NOT HONORING ALL FULL WARRANTIES. ALSO WE STILL OWE 9500.00 ON THE CAR THAT IS ONLY WORTH 2,000.00.  HESE CARS ARE LEMONS AND I FEEL WE SHOULD HAVE SOME TYPE OF RECORSE T OGET ARE MONEY BACK OR WE SHOULD ONLY OWE WHAT THE CAR IS WORTH.WHTA CAN WE DO ??? THE CAR IS IN THE SHOP EVERY 2-3 MONTHS . IT ALWAYS HAS A BURNING SMELL WHICH I WAS BASICALLY TOLD  IWAS IMAGINING IT BUT LOOKING UP RECALLS ON THE VEHICLE  IFOUND THAT THE  CAMSHAFT WAS RECALLED AND COULD CAUSE A UNDER HOOD FIRE. I WAS NEVER NOTIFIED OF THIS RECALL.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/21/2004",
        "dateOfIncident": "09/20/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097320,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER WAS UNABLE TO FIND A DEALERSHIP TO REPAIR RECALL#04357000 CAMSHAFT POTION SENSOR FREE OF CHARGE. PLEASE PROVIDE MORE INFORMATION.  *JB",
        "vin": "KLAJC52Z81K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/20/2004",
        "dateOfIncident": "10/20/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097210,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE NO DEALERS  OR PARTS AVAILABLE TO PERFORM THE CAMSHAFT SENSOR RECALL. *JB.   NHTSA RECALL 04V357000.  *JB",
        "vin": "KLAJC52Z31K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/18/2004",
        "dateOfIncident": "10/18/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097091,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED A RECALL NOTICE(02V257001) REGARDING THE BRAKE HOSE. THERE WAS NO DEALER AVAILABLE TO PERFORM THE RECALL. *JB",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/17/2004",
        "dateOfIncident": "10/16/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095890,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PUSHED BRAKE, BUT IT WAS NOT WORK. AND I GOT CRASH WITH THE OTHER CAR. *JB",
        "vin": "KLAJC52Z41K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/15/2004",
        "dateOfIncident": "10/15/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096986,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL NOTICE(02V257001/ FRONT BRAKE HOSE BUT THE DEALER WAS NOT IN OPERATION.  *NM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2004",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096687,
        "products": [
            {
                "manufacturer": "DAEWOO MOTOR DE PUERTO RICO",
                "productMake": "DAEWOO PUERTO RICO",
                "productModel": "NUBIRA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED A RECALL NOTICE(02V131002) FOR THE AIR BAGS.  THE DEALER WAS NOT IN OPERATION. *JB",
        "vin": "PLEASE FIL "
    }
]