[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2014",
        "dateOfIncident": "09/22/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 GMC SAVANA 1500. THE CONTACT STATED THAT WHILE DRIVING AT 65 MPH, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE FAILED TO RESTART.  THE VEHICLE WAS TOWED TO A PRIVATE MECHANIC, WHO DIAGNOSED THAT THE ENGINE NEEDED TO BE REPLACED.  THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "1GKHG39R711"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/17/2007",
        "dateOfIncident": "03/03/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE POWER SEAT BRACKET BREAKS OFF AT THE BASE VERY EASILY. THIS VEHICLE IS A STARCRAFT CONVERSION OF A 2001 GMC SAVANA VAN. THIS BRACKET HAS BROKEN OFF 4 TIMES SINCE THE VAN WAS PURCHASED NEW IN 2001. THIS HAS TO BE A SAFETY HAZARD, AS THE SEAT WILL BE VERY PRONE TO BREAKING OFF IN THE EVENT OF ANY COLLISION. THIS IS A $600 REPAIR EACH TIME. THE GM CUSTOMER SERVICE REPRESENTATIVE HAS IGNORED OUR LATEST COMMUNICATION WITH HIM. THE MOST RECENTLY BROKEN SEAT BRACKET WAS INSTALLED IN MAY 2006, AND BROKE MARCH 3, 2007, SO HAS LASTED LESS THAN A YEAR. THIS IS A LIGHTLY USED FAMILY VEHICLE, NOT USED FOR ANY COMMERCIAL PURPOSE.",
        "vin": "1GDFG15M711"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/30/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL SPORT LT/SUV",
                "productYear": "9999",
                "size": "LT235/85R16",
                "type": "Tire"
            }
        ],
        "summary": "TWO TIRE FAILURES WITHIN PAST 8 WEEKS.    BOUGHT FOUR CONTINENTAL SPORT LT/SUV TIRES AT WALMART IN COLORADO 6/18/04.  INSTALLED ON 2001 GMC SAVANA (FULL SIZE) PASSENGER VAN 235/75R15.  TIRES HAVE UNDER 30,000 USE BY SUMMER 2006.    IN JUNE 2006, RIGHT REAR TIRE FAILED WITH MAJOR TREAD SEPARATION AND METAL CORDS UNRAVELED BENEATH TREAD CAUSING EGG SHAPE AND TIRE TO BECOME PARTIAL SHRAPNEL.  IT WAS HOT DAY; OCCURRED WITHIN 10 MINUTES OF DRIVING AT HIGHWAY SPEED; TIRE PRESSURE HAD BEEN CHECKED SAME DAY AND WAS GOOD PER SIDEWALL MAX PSI RATING.  REPLACED WITH PRO RATED DISCOUNT.  TODAY, AUG 29, 2006, ANOTHER ONE OF THE TIRES FAILED IN EXACT SAME MANNER!  THIS WAS FRONT RIGHT TIRE.  TIRE HAD SEPARATION JUST BENEATH TREAD CAUSING EGG SHAPE AND ADVERSE HANDLING.  I HAVE PHOTOS SAVED THIS TIME OF DAMAGE.  TIRE PRESSURE CHECKED EARLIER SAME DAY AND PERFECT PER MFG PSI RATING ON TIRE.  HOT DAY (AGAIN), HIGHWAY TRAVEL IN ARIZONA FOR ONE HOUR WHEN TIRE FAILED.  TIRE COMING APART INTERNALLY, WITHIN TREAD AREA.    I AM NOW CONVINCED SOMETHING WRONG WITH THIS WHOLE BATCH OF CONTINENTAL'S FROM COLORADO IN 2004.  PERHAPS YOU WILL FIND MORE COMPLAINTS AS MOTORISTS HIT 30,000 MARK.  *JB",
        "vin": "1GKFG65R411"
    }
]