[
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "11/10/2021",
        "dateOfIncident": "11/07/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11439998,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "The rear trailing arm cracked in half causing my wife to run off the road11",
        "vin": "Km8sc83d21u"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/24/2021",
        "dateOfIncident": "03/15/2021",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430266,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact's friend owns a 2001 Hyundai Santa Fe. The contact stated that while a friend was driving at approximately 55 MPH, the vehicle began to veer off to the right without warning and the driver began losing control of the vehicle. Despite the failure, the contact's friend was able to drive the vehicle to her home at slow speeds. Another friend was able to inspect the vehicle and discovered that the rear passenger’s side trailing arm had fractured due to severe corrosion. Upon investigation, the contact discovered NHTSA Campaign Number: 09V123000 (Suspension) which he linked to the failure. The dealer and the manufacturer were both notified of the failure and he was informed that his vehicle was not under recall. The vehicle had yet to be repaired. The failure mileage was unknown.",
        "vin": "km8sc83d91u"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/10/2021",
        "dateOfIncident": "12/22/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11387403,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS ACCELERATING TO 45 MPH, THE VEHICLE BEGAN TO SWERVE LEFT TO RIGHT RAPIDLY. THERE WAS NO WARNING INDICATOR ILLUMINATED. SHE COASTED THE VEHICLE TO THE SIDE OF THE ROAD AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED, BUT THE FAILURE RECURRED. SHE NOTICED THAT THE REAR PASSENGER SIDE WHEEL WAS ALMOST TOUCHING THE INSIDE OF THE REAR FENDER. SHE WAS ABLE TO LIMP IT ABOUT A MILE HOME TO DRIVEWAY.   SHE CONTACTED HYUNDAI & THEY TOLD HER TO TOW IT TO CLOSEST HYUNDAI DEALERSHIP & REAP SUSPENSION PROBLEM WILL BE FIXED UNDER RECALL. AFTER WE PAID TO HAVE IT TOWED TO DEALERSHIP IT WAS DIAGNOSED THAT THE REAR TRAILING ARM WAS CORRODED AND ALMOST BROKEN & NEEDED TO BE REPLACED. THE DEALER SERVICE TECHNICIAN CALLED MY WIFE THE NEXT DAY TO INFORM HER THAT HER SANTA FE REAR TRAILING ARMS HAD NOT BEEN REPLACED BY HYUNDAI. SHE IMMEDIATELY CALLED HYUNDAI TO SPEAK WITH PERSON THAT TOLD HER TO HAVE IT TOWED TO DEALERSHIP. HYUNDAI OPENED A CASE NUMBER FOR HER SANTA FE. HYUNDAI CALLED BACK COUPLE DAYS LATER SAYING THEY HAD RESEARCHED HER SANTA FE UNDER RECALL  CAMPAIGN 090 AND THAT IT DID NOT QUALIFY BEING THAT IT HAD NOT REGISTERED WITHIN THE 20 SALT BELT STATES REQUIRED FOR RECALL. HYUNDAI CASE WORKER SAID THEY WERE NOT GOING TO REPAIR THE SANTA FE UNDER RECALL.& HYUNDAI WAS CLOSING THE CASE.   AFTER A VERY EXTENSIVE SEARCH ON THE SANTA FE FRAME CORROSION RECALL SHE DISCOVERED THAT THE FRAME CORROSION RECALL HAD BEEN EXPANDED TO INCLUDE EVERY SANTA FE WITHIN THE 50 STATES, ALTHOUGH HYUNDAI DID NOT SEND NOTICES TO ANYONE UNLESS THE SANTA FE HAD BEEN REGISTERED IN THE 20 SALT BELT STATES.   WITH THIS NEW INFO SHE HAS BEEN TRYING TO CONTACT THE HYUNDAI CASE WORKER TO RE-OPEN HER CASE.  AS IT STANDS HER SANTA FE WAS TOWED TO HYUNDAI DEALERSHIP WHERE IT SITS IN BACK LOT UNTOUCHED & UNDRIVEABLE. AFTER CLOSER LOOK AT TRAILING ARMS BOTH SIDES ARE RUSTED COMPLETELY OUT.",
        "vin": "KM8SC83031U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2020",
        "dateOfIncident": "02/14/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325885,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PUMP PROBLEM KEEPS CLICKING AND I'VE REPLACE MANY PARTY BUT STILL LIKE ITS FULL OF GAS BUT I BE ON EMPTY.CAR ALSO JERKS LIKE I'VE BEEN REAR ENDED WHILE DRIVING LIKE IT HAS TRANSMISSION PROBLEMS AND I'VE REPLACE TRANSMISSION 2 TIMES. GEARS ONLY WORK MANUAL IT'S LIKE THE CAR HAS A MIND OF ITS OWN .ALSO MY TIRE FLEW OFF MY CAR ON THE BACK AND HAD TO TAKE TO DEALER SHIP AND THEY WAS SAYING IT'S SOME PROBLEM THEY CAN'T HELP .",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/18/2020",
        "dateOfIncident": "05/16/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325011,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING AT 10 MPH, THE CONTACT HEARD AN ABNORMAL POPPING SOUND COMING FROM THE REAR OF THE VEHICLE. THE CONTACT DROVE BACK TO HER RESIDENCE WHERE HER HUSBAND INSPECTED THE VEHICLE. THE CONTACT'S HUSBAND DISCOVERED CORROSION ON THE REAR CONTROL ARM. DUE TO THE CORROSION, THE DRIVER'S SIDE REAR CONTROL ARM FRACTURED. NEITHER THE DEALER NOR THE MANUFACTURER HAD BEEN NOTIFIED OF THE FAILURE. UPON INVESTIGATION, THE CONTACT LINKED HER FAILURE TO NHTSA CAMPAIGN NUMBER: 09V123000 (SUSPENSION) HOWEVER, THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 161,000. *LN*JB",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2020",
        "dateOfIncident": "03/10/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11317237,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE'S A REALL ON THIS VEHICLE THAT I JUST PURCHASED  THE DESCRIPTION SAYS: FRONT COIL SPRING PROTECTOR INSTALLATION   HOW CAN THIS ISSUE BE RESOLVED? THIS ISSUE SHOULD BEEN TAKING CARE OF AND REPORTED TO YOU GUYS BUT OBVIOUSLY IT HASN'T. SO  I NEED TO KNOW IS IT STILL AVAILABLE TO BE FREE OF CHARGE OR DO I HAVE TO COME OUT OF POCKET TO GET THIS REPAIRED? OR CAN I STILL GO TO A HYANDAI DEALER FOR FREE REPAIRS? I'M NOT SURE OF THE NOTIFICATION DATE. SO IN THE BOX BELOW I'LL PUT THIS YEAR AND DATE",
        "vin": "KM8SB82B51U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/21/2019",
        "dateOfIncident": "11/06/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11290474,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR MECHANIC HAS IDENTIFIED SIGNIFICANT CORROSION TO THE DRIVER'S SIDE REAR TRAILING ARM, A SAFETY AND OPERATIONAL VULNERABILITY CONSISTENT WITH NHTSA SAFETY RECALL NOTICE 09V123000.  THE NHTSA SAFETY RECALL OBSERVES THE DANGER OF THE REAR TRAILING ARM FRACTURING, AND INCREASING THE RISK OF A VEHICLE CRASH.    WE HAVE CONTACTED THE LOCAL DEALERSHIP AND THE MANUFACTURER, HYUNDAI, ABOUT THE SAFETY VULNERABILITY, RESULTING FROM THE LATENT MANUFACTURING WEAKNESS.  AS DETAILED IN THE ATTACHED FILE.  THE DEALER SERVICE DEPARTMENT IS INDIFFERENT TO THE FAULTY VEHICLE PART AND SAFETY VULNERABILITY, AND NO RESPONSE HAS BEEN RECEIVED FROM THE MANUFACTURER.    WE ARE ATTACHING PHOTOS OF THE REAR TRAILING ARM CORROSION CONSISTENT WITH THE MANUFACTURING FAILURE IDENTIFIED IN THE NHTSA SAFETY RECALL.",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "SUSPENSION,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2019",
        "dateOfIncident": "11/18/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11287666,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HEARING A CLANKING SOUND SINCE I HAVE BOUGHT THE VEHICLE USED MID NOVEMBER 2019 . THE SOUND SEEMS TO BE COMING FROM THE BACK PASSANGER SIDE WHEEL AREA IT APPEARS TO BE GETTING WORSE AND FEELS LIKE THE BACK PASSANGER SIDE WHEEL IS ABOUT TO FALL OFF ANYTIME THE VEHICLE IS IN MOTION .AND LOOKS VERY RUSTED OUT",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/21/2019",
        "dateOfIncident": "10/19/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269840,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GETTING GAS, THE PUMP ALWAYS 'CLICKS OFF' WHEN IM PUMPING GAS. DOES NOT MATTER HOW FULL. THE ONLY WAY TO ENSURE A FULL TANK IS TO CONTINUE PUMPING UNTIL GAS COMES OUT THE TOP OF THE FILLER NECK. THIS USUALLY MEANS OVERRIDING AS MANY AS 50 PUMP 'CLICK OFFS'. I HAVE SEEN OTHER SANTA FE OWNERS COMPLAINING ABOUT THE SAME PROBLEM OBVIOUSLY THIS IS A MANUFACTURING FLAW & NEEDS TO BE FIXED. THIS METHOD OF GETTING A FULL TANK IS NOT DESIRABLE AND WHAT'S THE POINT OF HAVING A 17 GALLON GAS TANK IF IT TAKES 45MINUTES TO FILL UP. THANK YOU.",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/24/2019",
        "dateOfIncident": "08/23/2019",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11246192,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE LOWER CONTROL ARM RUSTED OUT IT HAS 2 RECALLS ON IT BUT NOT THE CONTROL ARM WHY IF THE TRAILING ARMS ARE RUSTED IT SHOULD BE ADDED TO???????? STARTED MAKING NOISE NO WARNING WHILE DRIVEING 55 MPH HAPPENED ON 8/23/2019",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/13/2018",
        "dateOfIncident": "12/08/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11161135,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING 35 MPH, THE VEHICLE BEGAN TO SWERVE LEFT TO RIGHT RAPIDLY. THERE WAS NO WARNING INDICATOR ILLUMINATED. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD AND POWERED OFF THE ENGINE. THE VEHICLE WAS RESTARTED, BUT THE FAILURE RECURRED. THE CONTACT NOTICED THAT THE REAR DRIVER'S SIDE WHEEL WAS ALMOST TOUCHING THE INSIDE OF THE REAR FENDER. THE CONTACT WAS ABLE TO DRIVE THE VEHICLE TO A NEARBY INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE REAR TRAILING ARM WAS CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS LATER TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT TAKEN TO A DEALER BECAUSE IT WAS EIGHTY MILES AWAY. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 175,000.",
        "vin": "KM8SC83D51U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "10/22/2018",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141940,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DRIVER SIDE TRAILING ARM BADLY RUSTED.",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2018",
        "dateOfIncident": "04/02/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084533,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT BOTH FRONT COIL SPRINGS FRACTURED WITHOUT WARNING AND HAD BEEN REPLACED BY THE DEALER (HYUNDAI EAST, 11200 E CENTRAL AVE, WICHITA, KS 67206, (316) 977-7800). IN ADDITION, WHILE DRIVING AT A LOW RATE OF SPEED, THE REAR LOWER CONTROL ARM FRACTURED ON THE DRIVER'S SIDE. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC TESTING. THE CONTACT EXPERIENCED A FAILURE WITH THE CRANKSHAFT SENSOR. THE MANUFACTURER INDICATED THAT THE VEHICLE WAS NOT INCLUDED IN ANY RECALL CAMPAIGNS. THE VEHICLE CONTINUED TO EXHIBIT THE FAILURES. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/10/2017",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053798,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN DRIVING THE VEHICLE HOME AND NOTICED THE CAR WAS RUBBING AGAINST THE CAR.  THE SUBFRAME HAS RUSTED SO MUCH THAT I CAN'T DRIVE IT.  HAD TAKEN THE VEHICLE TO FIRESTONE.  THEY SAID NOT TO DRIVE IT AND YOU SHOULD HAVE IT TOWED TO OUR HOUSE. THEY SAID THE TIRE WOULD FALL OFF OR WORSE.  THEY WOULDN'T TOUCH IT.  SO I HAD IT TOWED TO THE HYUNDAI DEALERSHIP.  THEY TOLD ME THAT TO REPLACE THE SUB FRAME IN THE FRONT ON THE DRIVER'S SIDE, IT WOULD COST $2000.  WHEN I TOWED THE VEHICLE TO HYUNDAI, THEY SAID IT COULD COST UP TO $5000.  I COULDN'T AFFORD TO FIX IT.  I THEN TOWED IT HOME AND IT IS SITTING IN MY GARAGE.  I WISH I WOULD HAVE KNOW ABOUT THIS PROBLEM BEFORE I BOUGHT.",
        "vin": "KM8SB828B21"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048240,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DRIVER SIDE SPRING RUSTED OUT CAUSING TIRE TO LEAN INTO CAR. ONLY BACKING OUT OF DRIVE WAY AT 2 MPH. WHY WAS ONLY RECALL SENT TO SO CALLED \"SALT STATES\"? I LIVE IN TENNESSEE AND SALT IS USED ON ROADS IN WINTER.",
        "vin": "KM8SB82B11U"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "11/24/2017",
        "dateOfIncident": "11/21/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11048246,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 2 MPH, THE REAR DRIVER SIDE WHEEL LEANED INWARD INTO THE VEHICLE. IN ADDITION, THE CONTACT NOTICED THAT THE REAR COIL SPRING OF THE SUSPENSION WAS RUSTED AND CORRODED. FRIENDSHIP HONDA IN JOHNSON CITY, TENESSEE WAS MADE AWARE OF THE FAILURES AND STATED THAT THERE WAS NO RECALL ON THE VEHICLE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 108,000. *TT  JOHNSON CITY HYUNDAI REPAIRED FOR FREE. TRADED IT IN 12/29/17. UPDATED 8/14/18*JB",
        "vin": "KM8SB82B11U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/12/2017",
        "dateOfIncident": "04/12/2017",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10972134,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE THE VEHICLE WAS AT AN INDEPENDENT MECHANIC FOR AN OIL CHANGE, IT WAS DIAGNOSED THAT THE SUBFRAME FAILED DUE TO CORROSION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 126,000.",
        "vin": "KM8SC83D91U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2017",
        "dateOfIncident": "10/03/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950082,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT NOTICED A FUEL ODOR INSIDE AND OUTSIDE THE VEHICLE. WHEN RE-FUELING, THE FUEL LEAKED OUT OF THE FUEL TANK WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/01/2017",
        "dateOfIncident": "12/29/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939003,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBFRAME/ENGINE CRADLE ROT TO POINT OF SEPARATION, LOSS OF STEERING AND VEHICLE CONTROL.  MY NEWLY LICENSED GRAND-DAUGHTER TOOK IT FOR A SHORT ABOUT TOWN DRIVE, NOT GETTING MORE THAN A QUARTER MILE BEFORE THE WHEEL SNAPPED OUT OF HER HANDS AND THE VEHICLE HEADED FOR THE CENTER LINE. SHE MANAGED TO GET IT TO THE SIDE OF THE ROAD.  BOTH FRONT WHEELS WERE IN DIFFERENT DIRECTIONS, MOVEMENT FORWARD WAS SLOPPY. AWEFUL NOISES COMING FROM BELOW. FLUIDS LEAKING.  I KNEW THERE WAS RUST UNDERNEATH BUT NOT SUCH GREATLY WEAKENED PARTS.  IMG_6087.JPG",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/20/2016",
        "dateOfIncident": "06/19/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10875188,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE VEHICLE'S LOWER FRAME CONTROL ARM WAS MAKING A CLICKING NOISE. THE DEALER DIAGNOSED THAT THE A FRAME NEEDED TO BE REPLACED; HOWEVER, THE BOLTS THAT HELD THE FRAME WERE RUSTED. THE A FRAME WAS NOT ABLE TO BE REMOVED AND THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE MANUFACTURER ISSUED A PREVIOUS RECALL THAT WAS DIRECTLY RELATED TO THE FAILURE; HOWEVER, THEY WERE UNABLE TO IDENTIFY THE RECALL NUMBER. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 172,000.",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/01/2016",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10871918,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING AT 25 MPH, THE DRIVER'S SIDE REAR WHEEL TILTED LEAVING THE VEHICLE IMPAIRED. THE VEHICLE WAS TOWED TO A NEAR BY FIRESTONE WHERE THE FAILURE WAS ASSESSED BY THE TECHNICIAN. THE FAILURE WAS DIAGNOSED AS A FRACTURED REAR AXEL. THE CONTACT STATED THAT THE MANUFACTURE WAS NOTIFIED OF THE FAILURE AND NO REPAIRS WAS MADE. THE FAILURE MILEAGE WAS 17,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2016",
        "dateOfIncident": "03/21/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10851470,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE CRANKSHAFT POSITION SENSOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 03V030000 (ELECTRICAL SYSTEM). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 116,000.",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2016",
        "dateOfIncident": "01/23/2016",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846372,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "V  EHICLE CAUGH    T ON FIRE IN MOTION  CLAIM NUMBER 870190.",
        "vin": "KM8SC83D91U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/11/2016",
        "dateOfIncident": "02/10/2016",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846159,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE SUSPENSION AND SUBFRAME THAT THE SUSPENSION WAS MOUNTED TO WAS SEVERELY CORRODED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE INSPECTED. THE CONTACT WAS INFORMED THAT THE SUBFRAME AND SUSPENSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V435000 (SUSPENSION). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 184,215.",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/08/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780757,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTE FE. WHILE DRIVING 25 MPH, THE CONTACT HEARD A LOUD POP, THE VEHICLE'S WEIGHT SHIFTED, AND THE REAR DRIVER SIDE TIRE CAVED INTO THE WHEEL WELD. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE REAR DRIVER SIDE TRAILING ARM NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 155,000.",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/20/2015",
        "dateOfIncident": "06/25/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749992,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO REPLACE THE BALL JOINTS TWICE. THE FIRST TIME WAS SEVEN YEARS AGO AT ABOUT 40,000 MILES AND RECENTLY IN JUNE 2016 AT 84,000 MILES. SINCE IT IS A UNIQUE SUSPENSION WITHOUT ALIGNMENT ADJUSTMENTS, THE DESIGN COULD BE CAUSING UNUSUAL STRESS ON THE BALL JOINTS.",
        "vin": "KM8SB82B71U"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/19/2015",
        "dateOfIncident": "05/11/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10717420,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME WITH FAMILY IN VEHICLE THE CONTROL ARMS BROKE, BALL JOINTS BROKE AND THE SWAY BAR BROKE.",
        "vin": "KM8SC83D91U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/16/2015",
        "dateOfIncident": "04/10/2015",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10711759,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TRAILING ON ON BOTH SIDES HAVE CORRODED THROUGH.  DRIVER SIDE REAR CONTROL CASE HAS DISINTEGRATED, PASSENGER SIDE IS SEVERELY CORRODED.    - MARCH 18, 2010: VEHICLE HAD SERVICE PREFORMED ON TO ADDRESS \"RECALL #090  REAR TRAILING ARMS AND FRONT SUB-FRAME CORROSION TREATMENT\", RUST PREVENTATIVE V AND PLUG KIT SERVICE PERFORMED BY DEALER.   - MAY 16, 2012: VEHICLE HAD SUBFAME REPLACED DUE TO RUST HOLE AT RIGHT FRONT LOWER CONTROL ARM CONNECTION, REPLACEMENT OF RACK & PINION AND TRANSFER CASE FOR $2777.    - DEC 12, 2014: VEHICLE HAD SERVICE PERFORMED TO ADDRESS \"TSB# 14-01-141-1 - FRONT COIL SPRING PROTECTOR.  THERE IS A FAULT WITH HOW THE RECALLS AND SERVICE REQUIREMENTS HAVE BEEN ISSUED WITH THIS VEHICLE.  IF THE RECALL AND PRESCRIBED SERVICE WERE PROPERLY DONE, HAVING TO REPLACE THE FRONT SUB-FRAME JUST OVER 2 YEARS OF HAVING SERVICE TO PREVENT SUB-FRAME CORROSION PERFORMED WOULD NOT HAVE BEEN REQUIRED.  THE SUB-FRAME WAS SO DAMAGED THAT THE VEHICLE WAS DEEMED UNSAFE TO DRIVE. NOR WOULD 4 MONTHS AFTER HAVING RECALL SERVICE PERFORMED AND VEHICLE INSPECTED BY DEALER, THE REAR CONTROL CASE AND ARMS HAVE COMPLETELY FAILED MAKING THE CAR NOT ONLY UNSAFE TO DRIVE BUT NOT EVEN DRIVABLE NOW BECAUSE THE REAR DRIVER SIDE WHEEL IS POSITIONED AT AN ANGLE WITH STRUCTURAL SUPPORT.",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/08/2015",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704422,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE EXTERIOR PAINTING ON MY VEHICLE IS OF POOR QUALITY. ABOUT 4 YEARS AGO, THE PAINT STARTED OXIDIZING IN MULTIPLE AREAS SUCH AS THE HOOD & ROOF- INITIALLY IN SMALL AREAS, BUT HAS NOW SPREAD TO COVER MOST OF THESE AREAS. I WAXED THE CAR AT LEAST 2X PER YEAR. THE PAINT JUST DOES NOT APPEAR TO HAVE BEEN OF A HIGH QUALITY.    *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2014",
        "dateOfIncident": "12/28/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669329,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING 15 MPH, THE VEHICLE STALLED WITHOUT WARNING. ON A SECOND OCCASION, THE VEHICLE STALLED AND ALL THE WARNING LIGHTS ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 163,000.  UPDATED 03/24/15*LJ",
        "vin": "KM8SB82B51U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "12/23/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668693,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING 55 MPH, THE VEHICLE VEERED TO THE RIGHT AND THE STEERING WHEEL SEIZED. THE FAILURE RECURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE SUBFRAME WAS FRACTURED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 98,592.",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "06/11/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658638,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE FRAME WAS COMPLETELY CORRODED AND CAUSED DAMAGE TO THE FRONT TIRES. THE CONTACT RECEIVED A NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 14V435000 (SUSPENSION). THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "SUSPENSION,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2014",
        "dateOfIncident": "09/23/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643256,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 40 MPH, THE REAR OF THE VEHICLE SWAYED. THE CONTACT NOTICED THAT THE REAR END WAS LOWER THAN NORMAL. A CERTIFIED MECHANIC STATED THAT THE REAR-TRAILING ARM AND STRUTS WERE RUSTED. THE VEHICLE WAS TOWED TO THE DEALER AND REPAIRED. THE DETAILS OF THE REPAIR WERE UNKNOWN. THE CONTACT ALSO MENTIONED THAT THE FUEL TANK WAS PREVIOUSLY REPLACED DUE TO RUST. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE APPROXIMATE FAILURE MILEAGE WAS 125,000.",
        "vin": "KM8SC83D11U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/30/2014",
        "dateOfIncident": "09/09/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10640234,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE ATTEMPTING TO MAKE A LEFT, THE REAR TIRES TURNED RIGHT AND THE VEHICLE WENT SIDEWAYS BLOCKING TWO LANES. THE VEHICLE WAS TOWED TO A PRIVATE MECHANIC WHERE IT WAS DIAGNOSED THAT THE DRIVER AND PASSENGER SIDE TRAIL ARM WAS RUSTED AND CRACKED IN HALF. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V123000 (SUSPENSION). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 157,000.",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2014",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637474,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING AT 20 MPH, THE ENGINE STALLED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 55,000. DJR",
        "vin": "KM8SC83D91U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/01/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629911,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HI,    I'VE READ SEVERAL COMPLAINTS OVER A ISSUE THAT I'M STARTING TO HAVE AND THE OUT COMES HAS NOT BEEN GOOD AND I FEAR FOR MY FAMILY DRIVING IN THIS VEHICLE. I'M HEARING A SCRATCHY RUBBING SOUND IN THE REAR SO I JACKED IT UP TO FIND MY TRAIL ARMS ARE RUSTED SO BAD THEIRS HUGE HOLES IN THE TRAIL ARMS AND ROTOR COVER ARE RUSTED ALMOST OFF. I SURE DON'T WANT TO RECEIVE A CALL MY FAMILY HAS BEEN HURT IN A ACCIDENT SO IS WHY I'M CONTACTING YOU OVER THIS MATTER. I WOULD APPRECIATE TO BE CONTACTED TO KNOW WHAT I SHOULD DO BEFORE IT'S TO LATE.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/28/2014",
        "dateOfIncident": "08/27/2014",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629115,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING UPHILL AT AN UNKNOWN SPEED, THE VEHICLE BEGAN TO SHUTTER AND FAILED TO ACCELERATE. THE CONTACT WAS ALERTED THAT THE SUBFRAME WAS ON FIRE. THE CONTACT IMMEDIATELY SHUT OFF THE ENGINE AND EXITED THE VEHICLE. AN ONLOOKER ASSISTED WITH EXTINGUISHING THE FIRE WITH WATER. THE FIRE WAS EXTINGUISHED BY THE TIME THE FIREFIGHTERS ARRIVED. NEITHER THE FIRE DEPARTMENT INVESTIGATOR NOR THE INSURANCE INVESTIGATOR WERE ABLE TO IDENTIFY THE CAUSE OF THE FAILURE. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/10/2014",
        "dateOfIncident": "07/28/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621217,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TEENAGE DAUGHTER WAS DRIVING HER CAR AND IT STARTED SWAYING ON THE ROAD. SHE HAD A LOT OF TROUBLE CONTROLLING THE CAR AND FINALLY WAS ABLE TO PULL IN SOMEONES DRIVE. UPON INSPECTING THE CAR WE NOTICED THERE WAS A PROBLEM WITH THE BACK RIGHT TIRE. AFTER FURTHER INSPECTION IT WAS DISCOVERED THE TRAILING ARM HAD SPLIT AND HAD RUSTED OUT. I HAD NOTICED THERE WAS A RECALL IN CERTAIN STATES FOR THE SAME PROBLEM THAT WAS WRONG WITH HER CAR BUT I WAS TOLD BY THE DEALER HER CAR DID NOT HAVE A RECALL FOR THIS. WE HAD  TO PAY OUT OF POCKET TO FIX THE CAR.  I DON'T UNDERSTAND HOW HYUNDAI CAN ONLY LIMITED THIS TYPE OF RECALL TO CERTAIN STATES, WHEN KENTUCKY DOES USE A LOT OF ROAD SALT THAT SEEMS TO CAUSE THIS PROBLEM. PLEASE LET ME KNOW IF WE COULD BE REIMBURSED FOR THIS. IT COULD HAVE BEEN A LOT WORSE IF MY DAUGHTER HAD BEEN GOING FASTER OR ON THE INTERSTATE.WE DO HAVE PICTURES IF YOU NEED THOSE PLEASE LET ME KNOW.",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/27/2014",
        "dateOfIncident": "01/26/2014",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561625,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED WHILE DRIVING 35 MPH, THE DRIVER SUDDENLY LOST CONTROL OF THE VEHICLE WITHOUT ANY WARNING. AFTER INSPECTING THE VEHICLE HE NOTICED THAT THE REAR PASSENGER WHEEL WAS BENT DUE TO CORROSION. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE HAD BEEN REPAIRED UNDER RECALL NHTSA CAMPAIGN NUMBER: 09V123000 (SUSPENSION). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 255,000.",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2013",
        "dateOfIncident": "08/07/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543370,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BECAME 2ND OWNER IN JUNE 2005. IN MARCH 2010, HYUNDAI RECALLED VEHICLE FOR SUSPENSION COMPONENT RUSTING/CORROSION, SPECIFICALLY REAR TRAILING ARMS & FRONT SUB-FRAME.  [ HYUNDAI HAS HAD NUMEROUS (8-9 ??) SIMILAR SUSPENSION RECALLS OVER THE PAST 5 YEARS FOR ELANTRA, SONATA, TIBURON, AZERA AND OTHER MODELS.]  IN MARCH 2010, RESPONDING TO RECALL, VEHICLE TAKEN TO AUTHORIZED HYUNDAI DEALER, WHERE DEALER ELECTED TO REPAIR, RATHER THAN REPLACE AFFECTED FRONT AND REAR SUSPENSION COMPONENTS. THE PRESCRIBED RECALL REPAIR CONSISTED OF DRILLING (DRAIN) HOLES IN ALL FRONT & REAR SUSPENSION COMPONENTS, REMOVING EXCESS RUST FROM INSIDE COMPONENTS, THEN SPRAYING WITH ANTI-CORROSIVE WAX. AUGUST 7, 2013, RIGHT REAR TRAILING ARM FAILED DUE TO CONTINUED EXCESSIVE CORROSION, CAUSING STEERING LOSS AND NEAR WHEEL COLLAPSE. HYUNDAI DEALER REVEALED CAUSE OF SUSPENSION FAILURE. HYUNDAI CORROSION SPECIALIST CONCLUDED THAT HYUNDAI WOULD REPLACE BOTH REAR TRAILING ARMS ONLY (NOT FRONT SUB-FRAME COMPONENTS, WHICH ARE ALSO EXCESSIVELY RUSTED/CORRODED), BUT THAT BECAUSE OF VEHICLE'S 10+ YEAR AGE, OWNER WOULD BE RESPONSIBLE FOR ALL \"INCIDENTAL AND RELATED SUSPENSION PARTS AND LABOR\" EXPENSES INCURRED WHILE THE REAR TRAILING ARM REPLACEMENTS WERE BEING MADE.  I AM APPEALING THIS HYUNDAI DECISION TO NHTSA BECAUSE THE REPAIR THAT HYUNDAI ELECTED TO PERFORM (VS A FULL COMPONENTS REPLACEMENT) IN MARCH 2010, WHEN VEHICLE WAS ONLY 9 YEARS OLD, HAS PROVEN TO BE TOTALLY INEFFECTIVE, AND THAT OWNER HAS NOT CONTRIBUTED, IN ANY WAY, TO THIS SUSPENSION DEFECT.  GIVEN HYUNDAI'S  CORROSION VULNERABILITIES, THEIR INABILITY TO EFFECT A REPAIR IN 2010, AND THE OWNER'S NON-CONTRIBUTORY ROLE HERE, HYUNDAI SHOULD NOW REPLACE ALL FRONT & REAR SUSPENSION COMPONENTS, AS THEY SHOULD HAVE IN 2010, AT NO COST TO THE OWNER.  *TR",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/09/2013",
        "dateOfIncident": "09/08/2013",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542546,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LOWER CONTROL ARM RUSTED THROUGH WHEEL DETACHED FROM ROTOR WHEEL HANG OFF. WHEEL NOT STRAIGHT.   *TR",
        "vin": "KM8SC83D91U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/23/2013",
        "dateOfIncident": "09/19/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494488,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH, THE ENGINE RPMS INCREASED EXCESSIVELY AND THE VEHICLE INDEPENDENTLY ACCELERATED TO OVER 100 MPH WHILE THE BRAKE WAS DEPRESSED. THE CONTACT WAS ABLE TO STOP THE VEHICLE AND HAD IT TOWED TO A LOCAL MECHANIC. A DIAGNOSTIC WAS PERFORMED AND THE FAILURE WAS LOCATED AT THE CRUISE CONTROL CABLE. THE MECHANIC RE-CRIMPED THE CRUISE CONTROL CABLE AND THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 143,000 AND THE APPROXIMATE CURRENT MILEAGE WAS 150,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/05/2012",
        "dateOfIncident": "10/06/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478783,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE REAR DRIVER'S SIDE TIRE WAS ABNORMALLY LEANING INWARD. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION WHERE THEY STATED THAT THE TRAILING ARMS WERE RUSTED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 149,000.    UPDATED 1/129/13 *CN    THE CONSUMER STATED THE TRAILING ARMS WERE ALSO RUSTED ON THE PASSENGER SIDE. UPDATED 2/6/2013 *JS",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/27/2012",
        "dateOfIncident": "09/19/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477270,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING 55 MPH THE VEHICLE STARTED TO SHAKE AND THE TIRES BEGAN TO MAKE A LOUD NOISE. THE CONTACT MENTIONED THAT AFTER INSPECTING THE VEHICLE HE NOTICED THAT THE CONTROL ARM WAS BENT INTO THE FRAME. THE CONTACT BELIEVED THAT THE FAILURE WAS DUE TO CORROSION. THE DEALER WAS CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 118,000 AND THE CURRENT MILEAGE WAS 118,390.",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/24/2012",
        "dateOfIncident": "09/10/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477725,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TEENAGE SON WAS DRIVING HIS VEHICLE, WHEN IT SUDDENLY FELT LIKE HE WAS DRIVING ON BLACK ICE. THE WHEELS FELT LIKE THEY WERE ALL OVER THE ROAD, AND HE HEARD SOME TYPE OF LOUD NOISES COMING FROM UNDERNEATH THE CAR. LUCKILY HE KNEW BETTER AND PULLED OVER ONTO THE SIDE OF THE ROAD. THE WHEEL ON THE LEFT HAND SIDE LOOKED COMPLETELY TURNED IN AND THE VEHICLE WAS NOT DRIVABLE. WE IMMEDIATELY TOOK THE VEHICLE TO OUR LOCAL MECHANIC. LATER THAT NIGHT I DID SOME RESEARCH AND SAW THAT THEY HAD A RECALL FOR THE 2001 HYUNDAI SANTA FE BECAUSE OF THE TRAILING ARMS RUSTING OUT. I CALLED THE CORPORATION FOR HYUNDAI REFERENCE MY SITUATION AND ASKED ABOUT THE RECALL. THEY SAID THAT SINCE I DID NOT LIVE IN A SALT BELT STATE, THERE WAS NOTHING THEY COULD DO FOR ME. I THEN CALLED MY LOCAL HYUNDAI AND ASKED THEM. THEY TOLD ME THAT I COULD BRING IT IN AND THEY WOULD LOOK AT IT AND SEE WHAT THEY COULD DO, BUT THEY WOULD NOT MAKE ANY PROMISES. OUR LOCAL HYUNDAI DEALERSHIP HAS A HORRIBLE REPUTATION, AND I KNEW IF I HAD THE VEHICLE TOWED TO THEM, NOT ONLY WOULD THEY TELL ME THAT THE VEHICLE DID NOT FALL UNDER THE RECALL, THEY WOULD CHARGE ME AND ARM AND LEG TO FIX IT. I CHOSE TO STAY WITH MY LOCAL MECHANIC WHO I TRUST. THAT MECHANIC TOLD ME THE ARM WAS COMPLETELY RUSTED OUT. . HE HAD PULLED UP THE RECALL AS WELL, AND AGREED WITH ME THAT HYUNDAI SHOULD FIX THIS FREE OF CHARGE, SINCE OBVIOUSLY IT WAS A DEFECT ON THEIR PART. HE ALSO SAID THAT THE SALT BELT STATE RULE FOR THE RECALL MADE NO SENSE SINCE OTHER THINGS CAN CAUSE RUST. AFTER MY VEHICLE WAS FIXED I TOOK THE TRAILING ARM TO MY LOCAL HYUNDAI DEALERSHIP AND SHOWED THEM. I TOLD THEM I EXPECTED THEM TO PAY AT LEAST FOR THE ARM WHICH COST ME 189.00 PLUS TAX, SINCE THIS WAS THEIR DEFECT. I HAD ALSO BOUGHT THE VEHICLE FROM THEM ON APRIL 30. THEY SAID NO AND SHOWED ME THE DOOR. MY SON COULD HAVE CRASHED AND DIED. HYUNDAI SHOULD BE ASHAMED.",
        "vin": "KM8SC83D91U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2012",
        "dateOfIncident": "07/11/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465658,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ENTERING MY APARTMENT COMPLEX WHEN MY CAR MADE A NOISE. IT FELT LIKE WE HAD A FLAT TIRE AND I LOST CONTROL OF THE VEHICLE.  I PARKED THE CAR AND THEN SAW THAT THE REAR TRAILING ARM WAS FRACTURED.  I LOOKED IN THE INTERNET AND SAW CAMPAIGN ID NUMBER 09V123000.  THIS CAMPAIGN MENTIONS ALL CARS MANUFACTURED FROM 2001-2003.  MY CAR WAS MANUFACTURED IN 2001 AND WAS SOLD IN THE STATE OF NEW YORK.  I CALLED THE HYUNDAI AND THEY SAY MY VIN DOES NOT FALL ONTO THIS CAMPAIGN YET IT HAS ALL THE SYMPTOMS AND CHARACTERISTICS TO BE INCLUDED. PLEASE HELP!  *TR",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2012",
        "dateOfIncident": "06/21/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462884,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPROACHING A STOP (<5MPH) AND BRAKING, THE CAR ENGAGES IN UNINTENDED ACCELERATION.  THE ENGINE WILL TACH TO OVER 3000 RPM AND IF YOU ARE NOT HARD ON THE BRAKES, THE CAR WILL ACCELERATE.  AT LEAST ONE TIME THE CAR HAD TO BE PUT INTO NEUTRAL AND THE IGNITION TURNED OFF TO KEEP THE CAR UNDER CONTROL.  *TR",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/22/2012",
        "dateOfIncident": "10/01/2000",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462756,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT THE FRONT PASSENGER SIDE AIR BAG SENSOR WOULD NOT DETECT A PASSENGER IN THE SEAT AND ACTIVATE THE AIR BAG. THE CONTACT STATED THAT THE FAILURE WAS INTERMITTENT AND WOULD ACTIVATE ONLY WHEN CERTAIN PERSONS WERE SEATED IN THE PASSENGER SEAT.  THE VEHICLE WAS TAKEN TO THE DEALER WHO INSPECTED THE VEHICLE AND ADVISED THAT THERE WERE NO FAILURES WITH THE AIR BAG. THE CONTACT WAS CONCERNED BECAUSE WHEN THEIR SPOUSE OF 100 POUND WAS SEATED IN THE PASSENGER SEAT, THE AIR BAG WOULD NOT ACTIVATE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE CURRENT MILEAGE WAS 50,000 AND THE FAILURE MILEAGE WAS 10,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/30/2012",
        "dateOfIncident": "05/29/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460000,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE REFUELING, FUEL LEAKED FROM THE FUEL TANK. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC. THE MECHANIC CONFIRMED THAT THE FUEL TANK TUBE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED.  THE MANUFACTURER WAS NOT CONTACTED.  THE VIN WAS UNAVAILABLE. THE FAILURE AND CURRENT MILEAGES WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/17/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444297,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING STRAIGHT ON HIGHWAY AT ABOUT 55 MPH.  CAR HOOD BLEW WIDE OPEN AND WAS LAYING UP, OVER MY WINDSHIELD.  LEFT ME ALMOST BLINDED; ABLE TO SEE OUT A SMALL OPENING, ABOUT 2-4 INCHES AT BOTTOM OF WINDSHIELD WHERE HOOD IS RAISED UP BY HINGES.  WAS ABLE TO GET TO SHOULDER OF ROAD SAFELY.   BOTH HOOD LATCH AND SAFETY LATCH FAILED.  CAR IS IN EXCEPTIONALLY GOOD CONDITION EXCEPT FOR MY NOW BENT AND DAMAGED HOOD.  I AM VERY LUCKY TO BE ALIVE.  THANK YOU G-D.  I HAVE ALSO REPORTED THIS HOOD FAILURE TO HYUNDAI MOTOR COMPANY.    HOPE THIS HELPS TO PREVENT SOMEONE FROM GETTING SERIOUSLY INJURED OR KILLED.  *TR",
        "vin": "KM85C83D21U"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/08/2011",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439047,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS SINCE 2006 THE LUG NUTS HAVE COME LOOSE ON THE DRIVER SIDE FRONT WHEEL.  EACH TIME THERE HAD BEEN SOMEONE DIFFERENT ROTATING THE TIRES.  OWNER, DEALER, TIRE SHOP.  EVERY TIME IT HAS BEEN THE FRONT DRIVER SIDE.  NONE OF THE OTHER WHEEL POSITIONS HAVE COME LOOSE.  THE LAST INSTANCE WAS 12/7/2011, THE LAST TIME THE TIRES WERE REMOVED OR REPLACES WAS 4/19/2011 AT THE HYUNDAI DEALERSHIP TOPEKA.  *TR",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/21/2011",
        "dateOfIncident": "11/12/2011",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436675,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF THE DRIVEWAY I NOTED A CRUNCHING SOUND FROM THE REAR OF THE VEHICLE.  AFTER DRIVING APPROX ONE MILE I INSPECTED THE REAR SUSPENSION.  I FOUND THE DRIVER'S SIDE LOWER TRAILING ARM HAD RUSTED TO THE POINT THAT IT HAD COLLAPSED.  THIS VEHICLE HAS BEEN KEPT IN A GARAGE IN NORTHERN VIRGINIA SINCE NEW.  UP THROUGH DEC 2008 IT WAS USED FOR ONE WINTER TRIP TO EASTERN PENNSYLVANIA AND NORTHERN NEW JERSEY.  SINCE I WAS AWARE OF ISSUES WITH THE REAR SUSPENSION OF THIS VEHICLE I HAD INSPECTED THE LOWER TRAILING ARMS APPROX FOUR MONTHS PRIOR TO THIS INCIDENT.  AT THAT TIME I FOUND ONLY A HALF DOLLAR SIZED CIRCLE OF SCALE/RUST AND SOME SCALE/RUST ON THE WELDED SEAM ON THE DRIVER'S SIDE TRAILING ARM.  THERE WAS NO INDICATION OF AN IMPENDING FAILURE.  I SURMISE THE COMPONENT RUSTED FROM THE INSIDE OUT AND THUS A VISUAL INSPECTION WOULD NOT BE EFFECTIVE TO GIVE A WARNING OF POSSIBLE FAILURE. OWNERS SHOULD BE ADVISED THAT VISUAL INSPECTION, AT LEAST TO AN UNTRAINED EYE, MAY NOT BE EFFECTIVE TO INDICATE IMPENDING FAILURE.  THE LAST DEALER MAINTENANCE PRIOR TO THIS INCIDENT WAS A REAR BRAKE JOB IN OCTOBER 2010 AT 111,000 MILES.  PICTURES OF THE FAILED COMPONENT ARE AVAILABLE.",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/14/2011",
        "dateOfIncident": "07/27/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435432,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON EXPRESSWAY PLASTIC GARBAGE BAG FLEW UNDER CAR CATCHING ON POWER STEERING LINES WHICH BROKE DUE TO RUST CORROSION. ONLY ONE LINE BROKE BUT REPLACED BOTH LINES AS PRECAUTION.  HARD TO HAVE THE CAR TOWED.  TOTAL COST $444.07 ( 277.15 PARTS + 166.92 LABOR- AAA MEMBERSHIP).    MICHIGAN WINTERS!  *TR",
        "vin": "KM8SB82BX1U"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/20/2011",
        "dateOfIncident": "09/03/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10377221,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 HYUNDAI SANTA FE. CONSUMER STATES WHILE TRAVELING THE HOOD FLEW UP AND SMASHED THE WINDSHIELD *TGW  THE CONSUMER STATED THE SAFETY RELEASE HOOD RUSTED OUT, ALSO THE PIECE THAT HELD THE SPARE TIRE RUSTED OUT. THE SPARE TIRE IS NOW HOUSED IN THE BACK OF THE VEHICLE.  *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/05/2011",
        "dateOfIncident": "12/07/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374848,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 HYUNDAI SANTA FE THAT HAD A RECALL UNDER CAMPAIGN # 09V123000 . THE RECALL STARTED IN AUGUST 2009, HOWEVER, I WAS NEVER NOTIFIED. IN DECEMBER, 2010 I NOTICED EXTREME PULLING IN MY VEHICLE WHEN I ALMOST DROVE INTO A DITCH. I IMMEDIATELY STOPPED DRIVING MY VEHICLE. I CONTACTED THE DEALERSHIP, AND WAS THEN INFORMED OF THE RECALL. I HAD MY CAR BROUGHT IN FOR REPAIRS, BUT DURING REPAIRS, WHERE MY TRAILING ARMS WERE NOT ONLY CORRODED BUT ALSO BENT, IT WAS NOTED THAT MY TIRES WHICH WERE ALL AT HALF LIFE (WHICH LEAVES ABOUT 40K MILES ON THEM) WERE ABNORMALLY WORN ON THE INSIDE OF THE REAR TIRES. WITH THE TYPE OF ABNORMAL WEAR, THIS IS MOST OFTEN BECAUSE OF MISALIGNMENT, WHICH IS NOTED AS SOMETHING THAT WILL HAPPEN IF REPAIRS ARE NOT MADE TO THE VEHICLE PER THE RECALL. I ASKED HYUNDAI TO REPLACE THE TIRES AS THIS WAS THEIR NEGLIGENCE IN NOTIFICATION OF THE RECALL, THEY DENIED IT. I SPOKE TO THE HEAD OF THE DEALERSHIP, WHO SET UP A MEETING WITH A REPRESENTATIVE FROM HYUNDAI, WHO MADE IT VERY CLEAR THEY HYUNDAI, UNDER NO CIRCUMSTANCES, WARRANTIES TIRES. THIS \"UNDER NO CIRCUMSTANCES\" DOES NOT FIT, SINCE THEIR RECALL AND REAR SUSPENSION PROBLEMS CAUSED THE ISSUE AND I HAD TO REPLACE MY TIRES LONG BEFORE WOULD HAVE BEEN NECESSARY BECAUSE THEY DID NOT INFORM ME OF THE RECALL. THEY ALSO HAD PUT A NOTE OF THE RECALL ON A PREVIOUS WORK ORDER IN 2009, BUT HAD NOT MADE NOTE OF THIS TO ME WHEN I CHECKED OUT WITH THEM, NOR DID THEY TAKE CARE OF THE REPAIRS THAT DAY WHILE MY VEHICLE WAS ALREADY IN THE SHOP.  *TR",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2010",
        "dateOfIncident": "11/14/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368135,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHEN THE VEHICLE WAS PARKED, HE NOTICED A FUEL ODOR. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR SHOP WHERE THE CONTACT WAS INFORMED THAT THE FUEL TANK AND STRAPS WERE CORRODED. THE CONTACT CALLED THE MANUFACTURER WHO TOOK A COMPLAINT BUT OFFERED NO FURTHER ASSISTANCE. THE VEHICLE HAD NOT BEEN REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 92,000.",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358783,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 HYUNDAI SANTA FE  POWER STEERING LINES AND BRAKE LINES COMPLETELY RUSTED THROUGH.  THERE IS A RECALL FOR THE SUSPENSION.  MAKES SENSE IF THEY DIDN'T PROTECT THAT PROPERLY, THEN THEY DIDN'T PROTECT THESE LINES PROPERLY.  CAN NOT STOP VEHICLE.  CAN NOT STEER VEHICLE.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "05/01/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356736,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 25-30 MPH ON A GRAVEL ROAD DURING RAINY WEATHER CONDITIONS THE REAR PASSENGER SIDE TIRE CAME OFF.  THE CONTACT DROVE ONTO THE EMERGENCY LANE. HE CALLED THE DEALER WHERE HE PURCHASED THE VEHICLE AND IT WAS TOWED TO THE DEALER. THE VEHICLE WAS PRE-OWNED AND PURCHASED IN APRIL 2010. THE CONTACT STATED THAT THE DEALER PUT THE WRONG LUG NUTS ON THE TIRE. AFTER THE LUG NUTS WERE REPLACED A WEEK LATER THE BALL JOINTS ON THE PASSENGER AND DRIVER SIDE FAILED.  HE ALSO STATED THAT THE TRAILING ARMS ON THE REAR DRIVER'S SIDE WERE COVERED WITH RUST AND BROKE IN HALF. MOST OF THE REPAIRS WERE MADE  TO THE VEHICLE.  THE BODY SHOP IS REPAIRING TIRE FAILURE AND THE REAR FENDER. THE FAILURE MILEAGE WAS 121,000 THE CURRENT MILEAGE WAS UNKNOWN.  UPDATED 01/06/11. *LJ  UPDATED 02/28/11",
        "vin": "KM8SC83D51U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/19/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356360,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CRANKSHAFT SENSOR FAILURE 2001 SANTA FE 4 CYL. WHILE DRIVING VEHICLE STALLED. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/09/2010",
        "dateOfIncident": "06/30/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342200,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 30, 2010 AT APPROX 9:50 AM CDT, I SUDDENLY LOST CONTROL OF MY 2001 HYUNDAI SANTA FE WHILE DRIVING APPROXIMATELY 65 MPH ON THE HIGHWAY IN OKLAHOMA CITY, OK.  MY VEHICLE BEGAN TO SWERVE AS IF ON A SHEET OF ICE.  ROAD CONDITIONS WERE ACTUALLY OPTIMAL WITH NO WATER, ICE OR OTHER ADVERSE ROAD CONDITIONS.  I WAS ABLE TO WRESTLE MY VEHICLE OFF THE HIGHWAY ONTO AN EXIT WHILE GENTLY APPLYING MY BRAKES TO GRADUALLY REDUCE SPEED.  THE VEHICLE WAS CANTED ON THE ROADWAY (REAR END SIGNIFICANTLY DISPLACED TO RIGHT) AS I DROVE IT TO A NEARBY REPAIR SHOP.  I WAS BASICALLY DRAGGING THE REAR END BEHIND ME.  A FRIEND CONFIRMED THIS APPEARANCE AND THAT THE PASSENGER-SIDE REAR TIRE WAS ALSO DEVIATED TOWARD THE RIGHT AND THAT BOTH TIRES WERE ANGLED INWARD AS HE FOLLOWED ME TO THE REPAIR SHOP.  AT THIS TIME, I WAS UNAWARE OF A SAFETY RECALL (NHTSA ACTION # EA08023, RECALL CAMPAIGN # 09V123000) THAT APPLIED TO MY VEHICLE.  THE REAR TRAILING ARMS ARE SUSCEPTIBLE TO CORROSION AND FAILURE.  UNFORTUNATELY, ONLY OWNERS WHO HAD PURCHASED THAT VEHICLE IN A SALT-BELT STATE, OR WERE REGISTERED IN A SALT-BELT STATE AT THE TIME OF THE RECALL (APRIL 2009) WERE NOTIFIED OF THE DANGER.  MY VEHICLE HAD BEEN PURCHASED IN OREGON AND I HAVE RESIDED IN OKLAHOMA FOR THE 4 YEARS.  I DID SPEND 4 YEARS DRIVING THIS VEHICLE IN 2 SALT-BELT STATES, HOWEVER, EXPOSED TO THE CONDITIONS THAT ACCELERATED THE CORROSION OF THE FLAWED PARTS.  AFTER I DISCOVERED THIS RECALL ON MY OWN ON 7/8/2010, I GOT THE VEHICLE TOWED TO EDMOND HYUNDAI IN EDMOND, OK AND BEGAN TRYING TO GET THIS RECALL WORK DONE.  THE SERVICE MANAGER AGREED THAT BOTH REAR TRAILING ARMS HAD FAILED AND HAD SIGNIFICANT CORROSION.  HYUNDAI AGREED TO REPLACE THE REAR TRAILING ARMS, BUT HAS REFUSED TO PAY FOR TOWING AND OTHER VEHICLE DAMAGES THAT RESULTED FROM THIS COMPONENT FAILURE.  THEY ALSO REFUSED TO PROVIDE A VEHICLE WHILE MINE IS IN THE SHOP OR PAY FOR A COMPARABLE RENTAL VEHICLE.  I HAVE ESCALATED THIS TO HYUNDAI'S NATIONAL OFFICE. *TR",
        "vin": "KM8SB82B31U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/04/2010",
        "dateOfIncident": "02/27/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328836,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 30 MPH, THE DRIVER HEARD A LOUD NOISE; BOTH TRAILING ARMS FRACTURED DUE TO CORROSION. THE VEHICLE WAS TOWED TO A LOCAL MECHANIC. THE CONTACT CALLED THE MANUFACTURER WHO INFORMED HER THAT RECALL 09V123000 (SUSPENSION: REAR) WAS IN EFFECT. THE REAR SUSPENSION WAS REPAIRED AND THE REAR AXLE REPLACED ACCORDING TO THE RECALL. SINCE THE REPAIR, THE VEHICLE SHAKES, SHIMMIES AND RATTLES. THE CHECK ENGINE LIGHT WAS ILLUMINATED AT ALL TIMES AND THE VEHICLE WAS HARD TO STEER AS IT PULLED FROM LEFT TO RIGHT. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 129,000.",
        "vin": "KM8SC83D11U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/18/2010",
        "dateOfIncident": "03/10/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326205,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SANTA FE AT ABOUT 50,000 MILES, FRONT DRIVER SIDE BALL JOINT CAUSED STEERING PROBLEM MARCH 2006, PART REPLACED. THEN MARCH 2009 FRONT PASSENGER SIDE  BALL JOINT BROKEN, AS BEFORE PART REPLACED. IN BOTH  CASES THE STEERING CAUSED THE CAR TO PULL SEVERLY TO THE RIGHT. *TR",
        "vin": "KM8SB82B21U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/19/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313667,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BEING IN PARK - ENGINE WILL SURGE - RPMS JUMP TO ABOUT 6,000 AND ACCELERATES LIKE IT WANTS TO GO.  I WILL PUT CAR IN DRIVE AND RPMS COME DOWN BUT STILL WANTS TO ACCELERATE.  THIS SAME THING HAPPENS EVEN AT STOP SIGN - WITH FOOT ON BRAKE.  CAR UNINTENTIONALLY ACCELERATES ON ITS ON ONCE FOOT COMES OFF BRAKE.  CHECK ENGINE LIGHT MAY OR MAY NOT BE ON.  VERY SCARY SITUATION AND ALMOST SCARED TO DRIVE IT.  THIS HAPPENS EVERY NOW AND THEN BUT LATELY IT HAS BEEN GOING ON FOR SEVERAL DAYS.  NOTICED THE PROBLEM ABOUT 3 MONTHS AGO. *TR",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "01/02/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10311482,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT HAD A 2001 HYUNDAI SANTE. THE CONTACT WAS DRIVING 35 MPH DOWN A 60 DEGREE INCLINE WHEN THE 4 WHEEL DRIVE SHIFTED OUT OF GEAR ON ITS OWN. THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO A GUARD RAIL AND LIGHT POLE. THE SEATBELT DID NOT LOCK AND THE AIR BAGS DID NOT DEPLOY. THE CONTACT IS CONCERNED ABOUT THE SAFETY RISK SINCE THE SEAT BELTS AND AIR BAGS MALFUNCTIONED WHEN THE CRASH OCCURRED. THE FAILURE MILEAGE WAS 154,000.",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/13/2010",
        "dateOfIncident": "09/25/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310192,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REGULAR INTERSTATE DRIVING, I THEN SUDDENLY LOST CONTROL, AND CROSSED THREE LANES, DARTING BACK AND FORTH ACROSS  TRAFFIC AND GOT IT UNDER CONTROL TO THE SIDE OF THE ROAD.  THERE IS WHERE I DISCOVERED THE REAR RIGHT WHEEL WAS HANGING OFF. *TR",
        "vin": "KM8SB82B71U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "02/04/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306076,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR LOWER CONTROL ARM BROKE WHILE DRIVING. *JB",
        "vin": "KM8SB82B21U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/21/2010",
        "dateOfIncident": "01/16/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10301747,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 11:00AM ON SATURDAY, JANUARY 16, 2010,  I WAS DRIVING MY 2001 HYUNDAI SANTA FE OUTBOUND ON ROOSEVELT BRIDGE IN WASHINGTON, DC.  SPEED WAS ABOUT 30-40 MPH WHEN, WITHOUT WARNING,  I LOST CONTROL OF VEHICLE,  WHICH BEGAN TO FISHTAIL FIRST LEFT THEN RIGHT.  MIRACULOUSLY HIT NOTHING AND WAS ABLE TO REGAIN STEERING CONTROL AND BRING VEHICLE TO A STOP AFTER ABOUT 3/10 OF A MILE.  I LATER LEARNED THAT THIS EVENT WAS CAUSED BY A TOTAL FRACTURE OF THE DRIVER SIDE REAR TRAILING ARM OF THE VEHICLE.   IT HAD FRACTURED AS THE RESULT OF  EXCESSIVE CORROSION OF THE PART.  VEHICLE WAS CARRYING NO LOAD BUT ME AS DRIVER AND DID NOT HIT A POTHOLE OR OTHER OBSTRUCTION.   COULD HAVE BEEN EXTREMELY SERIOUS AT A HIGHER SPEED WITH TRAFFIC ON EITHER SIDE OF VEHICLE.  I HAVE 50 YEARS OF DRIVING EXPERIENCE,  MUCH OF IT IN SNOW AND ICE IN NEW ENGLAND, AND NEVER EXPERIENCED TOTALLY SUDDEN AND UNEXPECTED  LOSS OF CONTROL LIKE THIS.  I UNDERSTAND THAT NHTSA HAS STUDIED THIS SITUATION AND THAT HYUNDAI HAS A RECALL IN \"SALT BELT\" STATES ONLY (INCLUDES DC AND MARYLAND BUT REMARKABLY NOT NORTHERN VIRGINIA WHICH IS THE AREA OF VIRGINIA IN WHICH I LIVE).    SEEMS RIDICULOUS THAT DC AND MD ARE INCLUDED, BUT NOT NORTHERN VIRGINIA  DESPITE THE FACT THAT SO MANY NORTHERN VIRGINIANS DRIVE IN DC AND MARYLAND EVERY DAY.  I HAVE RETAINED THE FRACTURED PART WHICH I HAD REPLACED.  HYUNDAI IS NOW TELLING ME THAT PASSENGER SIDE REAR TRAILING ARM HAS NO RUST.  THIS SEEMS STRANGE AND IS HARD TO BELIEVE GIVEN WHAT HAPPENED TO THE PART THAT IS ABOUT 6 FEET AWAY ON THE OTHER SIDE OF THE CAR AND GIVEN THAT BOTH ARE ORIGINAL PARTS. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/20/2010",
        "dateOfIncident": "01/19/2010",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300405,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING 30 MPH UNDER NORMAL CONDITIONS THE CONTACT HEARD A LOUD NOISE AND BEGAN LOSING CONTROL OF THE VEHICLE; HOWEVER, HE WAS ABLE TO REGAIN CONTROL AND SHUT THE ENGINE OFF. THE CONTACTS MECHANIC DROVE THE VEHICLE TO HIS REPAIR FACILITY  WHERE HE FOUND THAT RECALL 09V123000, SUSPENSION REAR WAS THE CAUSE OF THE FAILURE. THE LOCAL DEALER AND MANUFACTURER ADVISED THE CONTACT WAIT SEVERAL WEEKS TO HAVE THE VEHICLE REPAIRED OR TRAVEL TO A DEALER WHICH IS 30 MILES AWAY. THE CURRENT AND FAILURE MILEAGES WERE 150,000.",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/11/2009",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295355,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. DURING STATE INSPECTION HE WAS ADVISED THAT THE FRONT  MOTOR CONTROL ARM WAS LOOSE . A TECHNICIAN FROM A LOCAL REPAIR FACILITY REPLACED THE COMPONENT AT AN EXPENSE OF $190.00. AFTER THE REPAIR HE RECEIVED A RECALL NOTICE FOR THE REAR TRAILING ARM.   THE DEALER WAS NOT CONTACTED . THE FAILURE MILEAGE WAS 120000. THE CURRENT MILEAGE WAS 126000.",
        "vin": "KM8SC13D32U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/04/2009",
        "dateOfIncident": "11/30/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294528,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. THE LOWER CONTROL ARM ON THE FRONT PASSENGER SIDE BROKE. THE WHEELS ARE TILTED INWARD WHICH MADE IT DIFFICULT TO DRIVE NORMALLY. THE MANUFACTURER ADVISED THE DEALER THAT A REPRESENTATIVE WOULD DIAGNOSE THE FAILURE. THE FAILURE MILEAGE WAS 70,000.",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/04/2009",
        "dateOfIncident": "08/18/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294539,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE. WHILE DRIVING APPROXIMATELY 50 MPH ON NORMAL ROAD CONDITIONS. THE VEHICLE BEGAN TO PULL SEVERELY TOWARDS THE RIGHT DIRECTION. THE DRIVER REDUCED THE SPEED RATE AND CONTINUED IN OPERATION WITH CAUTION. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION. THERE WAS FRONT SUB-FRAME PERFORATION WHICH WAS A RESULT OF SEVERE INTERNAL CORROSION. THE CONTACT HAD CONCERN OF THE POTENTIAL SAFETY HAZARD. THE VEHICLE HAS NOT BEEN REPAIRED AT THIS TIME. THE FAILURE AND CURRENT MILEAGES WERE 129,000.     UPDATED 01/20/10 *BF  THE CONSUMER  STATED THE VEHICLE WAS NOT DRIVABLE. A RUSTED HOLE IN THE SUB-FRAME OCCURRED WHERE THE UPPER A-ARM WAS SECURED.  FAILURE OF RETAINING BOLT WOULD RESULT IN SUSPENSION COLLAPSE AND LOSS OF CONTROL OF VEHICLE. THE SUSPENSION WAS REPAIRED. THE CONSUMER STATED THERE WAS A RECALL FOR SAME MAKE, BUT DIFFERENT MODEL.  UPDATED 01/22/10.*JB",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/12/2009",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291949,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS BACKING UP THE 2001 SANTA FE SUV AT MY PARENTS DRIVE WAY, I HEARD A LOUD THUMP. I THOUGHT I WENT OVER A BIKE OR SOMETHING ELSE, AND GOT OUT OF THE CAR TO LOOK. THE LEFT FRONT  TIRE WAS CAVED INWARD, AND A METAL PART WAS BROKEN AND HANGING DOWN. THE CAR WAS NOT DRIVABLE IN THIS CONDITION, AND A TOW TRUCK HAD TO COME TO OUR HOME AND LOAD THE CAR ONTO A FLATBED. AFTER DISCOVERING THERE WERE NUMEROUS CASES OF 2001 SANTA FE CONTROL ARMS RUSTING OUT, I DECIDED TO FILE AN NHTSA COMPLAINT. I AM VERY GRATEFUL THAT THIS DID NOT HAPPEN AS I WAS DRIVING AT A HIGH SPEED. IT IS MY OPINION THAT HYUNDAI SHOULD TAKE RESPONSIBILITY FOR THE POOR DESIGN OF THE CONTROL ARM. FURTHERMORE, IN THE PAST TWO WEEKS, I HAVE DISCOVERED THAT THE LEFT CONTROL ARM IS SHOWING THE SAME SIGNS OF RUST THAT CAUSED THE FAILURE OF THE RIGHT CONTROL ARM. IT WILL SOON NEED TO BE REPLACED, WHICH WILL BE EXPENSIVE. I FEEL IT SHOULD BE PART OF A SAFETY RECALL. *TR",
        "vin": "KM8SC83D51U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/21/2009",
        "dateOfIncident": "10/16/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289206,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD FAILURE OF THE REAR TRAILING ARM ON MY 2001 SANTA FE.  ON THE HIGHWAY IN THE RAIN. I HAVE YET TO BE NOTIFIED OF THIS RECALL BY THE HYUNDAI CORPORATION.  WHY? THIS RECALL IS 6 MONTHS OLD AND THIS IS THE FIRST I HEAR ABOUT IT.  HOW MANY OTHERS DON'T KNOW?  THIS COMPANY HAS BEEN SLOW TO RESPOND. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,CHILD SEAT,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "10/07/2009",
        "dateOfIncident": "09/15/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286704,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "CHILD SAFETY SEAT",
                "productModel": "CHILD SAFETY SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "I BOUGHT THIS CAR USED FROM CAR MART LESS THAN  A YEAR AGO.FIRST MY STEERING WAS VERY SHAKY. IT GOT RAPIDLY WORSE.  I WENT THROUGH 3 SETS OF NEW TIRES IN ONE YEAR PLUS 2 ALIGNMENTS. I RECENTLY HAD TROUBLE AGAIN AND MY CAR IS IN THE HYUNDAI DEALERSHIP IN FAYETTEVILLE. FIRST THE BEARINGS WERE RUSTED IN.  BOTH BALL JOINTS WERE NEARLY OUT. THE CONTROL ARM IS GOING OUT. THE STEERING LINKAGE AND THE CRADLE ABOVE THE DRIVELINE IS RUSTED AND FALLING APART LITERALLY. THE EXHAUST SYSTEM THE CADILLAC CONVERTER IS RUSTED APART FOR THE THIRD TIME. THE SPARE TIRE HOLDER WAS RUSTED CLOSED AND HAD TO BE BROKE OFF TO GET MY SPARE OUT. ALSO THE REAR SEAT BELT JUST STOPPED WORKING . TALK ABOUT A BAD DAY. *TR",
        "vin": "KM8SC83D114"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/28/2009",
        "dateOfIncident": "08/28/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282190,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SEAT BACK DOES NOT STAY LOCKED, 2ND ROW. CHILD SEAT MUST BE INSTALLED IN THIS SEATING POSITION.  VEHICLE SEAT BACK DOES NOT STAY ENGAGED IN ANY UPRIGHT POSITION. *TR",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/06/2009",
        "dateOfIncident": "09/15/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279586,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHT ASSEMBLIES ON MY 2001 HYUNDAI SANTA FE HAVE FADED OVER TIME FROM THE SUN.  THE SUN HAS FADED THE LIGHT ASSEMBLIES SO MUCH, THE AMOUNT OF LIGHT VISIBLE THROUGH THE ASSEMBLY IS GREATLY REDUCED.  I CONSIDER THIS A SAFETY ISSUE, DUE TO THE WAY THE AMOUNT OF LIGHT COMING THROUGH THE ASSEMBLY IS GREATLY REDUCED DUE TO THE FADING OF THE PLASTIC BY THE SUN.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/28/2009",
        "dateOfIncident": "07/28/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278554,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 01 HYUNDAI SANTA FE DOWNSHIFTS WHILE ON THE HIGHWAY WITH A LOUD POP AND DECELERATES THE VEHICLE SUBSTANTIALLY CAUSING A TRAFFIC/SAFETY HAZARD. THIS IS CORRECTED MOMENTARILY WHEN I STOP AND RESTART THE ENGINE AS IF IT RESETS SOMETHING, THEN OF COURSE WHEN I GET BACK ON THE HIGHWAY IT DOES IT ALL OVER AGAIN. OTHER 01 SANTA FE OWNERS SUFFER THE SAME DANGEROUS CIRCUMSTANCES. WHY NOT RECALL THE VEHICLE TO CORRECT THIS ISSUE? THIS IS AN ACCIDENT WAITING TO HAPPEN. *TR",
        "vin": "KM8SB82B31U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/06/2009",
        "dateOfIncident": "07/04/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275823,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE.  WHILE DRIVING APPROXIMATELY 30 MPH, THE REAR PASSENGER SIDE COIL SPRING FAILED AND CAUSED THE WHEEL TO BEND.  THE MANUFACTURER FILED REPORT NUMBER 3632527.  THE VEHICLE WILL BE TOWED TO THE DEALER.  THE CURRENT AND FAILURE MILEAGES WERE 108,000.",
        "vin": "KM8SB82B21U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2009",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274535,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING NORMAL TO LIGHT PRESSURE FROM 25-5MPH ON DRY PAVED ROAD, ABS SYSTEM WILL TURN ON AND GREATLY INCREASE STOPPING DISTANCE. THERE HAS BEEN MORE THAN ONE INSTANCE THAT I HAVE NOT BEEN ABLE TO STOP BEFORE A STOP LIGHT OR STOPPED TRAFFIC. THERE ARE NO ABS CODES OR ABS IDIOT LIGHTS ON IN THE DASH WHICH INDICATE THAT ANYTHING IS WRONG. SAFETY IS A LARGE CONCERN.    BROUGHT VEHICLE TO DEALER AND NO ISSUE WAS FOUND, WITHOUT BEING REQUESTED TO PAY $1500+ FOR AN  ENTIRE NEW ABS. THIS WAS AFTER THEY TOLD ME THEY COULDN'T FIND SOURCE TO THE PROBLEM. I SEE THIS A COMMON PROBLEM ON MANY FORUMS AND THERE IS A RECALL ON 2003-2005 SANTA FE'S FOR A SAME/SIMILAR ISSUE. *TR",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/24/2009",
        "dateOfIncident": "03/19/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262883,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER TURNING A CORNER @ 15 MPH I HAD TO LEAVE THE STEERING WHEEL AT THE 9 O-CLOCK POSITION IN ORDER TO DRIVE STRAIGHT.  I NOTICED THE VEHICLE PULLING TO THE RIGHT.  I THOUGHT I HAD AN ALIGNMENT PROBLEM SO I SCHEDULE AN APPOINTMENT AT THE LOCAL TIRE REPAIR SHOP.  ONCE THEY LIFTED THE VEHICLE UP FOR INSPECTION THEY NOTICED THAT THE SUBFRAME HAD RUSTED THROUGH AND BROKE.  AFTER SPEAKING WITH THE MECHANIC I FELL VERY FORTUNATE THAT I WAS NOT DRIVING ON THE HIGHWAY AT THE TIME OF THE FAILURE.  AFTER FURTHER INVESTIGATION ON THE INTERNET I FOUND THAT THE 2001 HYUNDAI SANTA FE IS CURRENTLY BEING INVESTIGATED FOR THIS EXACT PROBLEM SO I CALLED THE LOCAL DEALERSHIP.  THE DEALERSHIP STATED I WAS THE 3RD VEHICLE THEY HAVE REPAIRED FOR THIS PROBLEM.  THE DEALERSHIP IS MAKING THE NECESSARY REPAIRS WITH NO COST TO ME.  I FELL THAT ALL 2001 SANTA FE'S SHOULD BE RECALLED FOR AN INSPECTION AT THE LEAST.  WE SHOULD NOT BE WAITING FOR A SEVERE ACCIDENT BEFORE THE NECESSARY STEPS ARE TAKEN.  THERE ARE ONLY 30,000 PEOPLE LIVING IN THE TOWN WHERE I HAD MY VEHICLE TAKEN FOR SERVICE, 3 REPAIRS WOULD INDICATE TO ME THAT OVER THE ENTIRE USA THERE ARE A LOT MORE VEHICLES WITH THE SAME PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/17/2009",
        "dateOfIncident": "09/06/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262139,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 HYUNDAI SANTA FE LOWER CONTROL ARE COMPLETED ROTTED OUT ON THE LEFT SIDE OF MY VEHICLE.  CALLED HYUNDAI THEY SAID THEY WERE AWARE OF THE PROBLEM AND SAVE THE CONTROL ARM WHICH I DID.  THE COST OF REPAIRS WERE $500+.  NOW THE RIGHT HAND SIDE IS ROTTED AND WILL NEED TO BE REPLACED IN A FEW MONTHS.  MY MECHANIC SAID THIS SHOULD NOT HAPPEN. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/22/2009",
        "dateOfIncident": "02/21/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259574,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUR 2001 SANTA FE, MY STEPSON EXPERIENCED DRIVING DIFFICULTY WHEN HE COULD NOT EASILY CONTROL THE DIRECTION OF THE VEHICLE.  UPON INVESTIGATION I FOUND THAT THE RIGHT REAR WHEEL WAS BENT OUTWARD APPROXIMATELY 30 DEGREES LATERALLY.  WHEN THE WHEEL WAS REMOVED I NOTICED THAT THE RIGHT, REAR TRAILING ARM HAD RUSTED THROUGH AND COLLAPSED.  THE LEFT, REAR TRAILING ARM IS ALSO SHOWING SIGNS OF RUST-THROUGH.  I HAVE DEEMED THIS VEHICLE UNSAFE TO DRIVE AND AM THANKFUL THAT NOBODY WAS HURT. *TR",
        "vin": "KM8SB82B81U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/07/2009",
        "dateOfIncident": "02/05/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257821,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND DAUGHTER WERE ON THEIR WAY HOME AND WENT ACROSS THE RAILROAD TRACKS WHEN MY WIFE HEARD A CLUNK AND THOUGHT A CHUNK OF ICE FELL OFF THE CAR. SHE SAID THE CAR THEN HANDLED AS IF IT WERE ON BLACK ICE ALL OVER THE ROAD. I PULLED THE CAR IN THE SHOP AND FOUND THE LEFT REAR TRAILING BROKE NEXT TO THE SPRING MOUNT TOWARDS THE WHEEL. NOT HAVING DISMANTLED ANY COMPONENTS, USING A VISUAL INSPECTION THE PART HAD ONLY A FEW SPOTS THAT HAD BEEN HOLDING JUDGING BY THE RUST ON THE BROKEN PART. THE CAR IS STILL IN MY SHOP AND I WILL BE CALLING HYUNDAI MONDAY TO FIND OUT ABOUT THIS PART. MY CONCERN IS IF THIS WOULD HAVE HAPPENED GOING DOWN THE ROAD AT HIGHWAY SPEEDS, MY WIFE AND 17 MONTH DAUGHTER COULD HAVE BEEN SERIOUSLY HURT OR KILLED. PLEASE REVIEW THIS PROBLEM. I HAVE NEVER SEEN TRAILING ARMS, CONTROL ARMS OR MAJOR SUSPENSION COMPONENTS BREAK LIKE THIS ONE DID WITHOUT HAVING BEEN IN SOME TYPE OF ACCIDENT. THIS PART FAILED FROM THE TOP DOWN. *TR",
        "vin": "KM8SB82B31U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2009",
        "dateOfIncident": "01/31/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257556,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING IN REGARDS TO A PROBLEM WITH A 2001 HYUNDAI SANTA FE. I BORROWED THE CAR FROM MY GIRLFRIEND TO RUN AN ERRAND. BEING 6 FOOT TALL AND HAVING A SIZE 13 FOOT I MUST SAY THE CAR WASN'T VERY COMFORTABLE EVEN WITH THE DRIVERS SEAT ALL THE WAY BACK. IT SEEMED TO RESPOND AND HANDLE SMOOTHLY BUT AS I EASED ON THE BRAKE TO SLOW FOR A RAILROAD CROSSING, THE TOE OF MY WORK BOOT BECAME WEDGED BETWEEN THE BRAKE PEDAL AND THE ACCELERATOR. THE VEHICLE SUDDENLY LAUNCHED LIKE A ROCKET AND MY IMPULSE WAS TO PRESS ON THE BRAKE PEDAL WITH MY FREE (LEFT) FOOT. THIS ONLY DEPRESSED THE ACCELERATOR FURTHER TO THE FLOOR AND THE CAR CONTINUED TO SPEED OUT OF CONTROL.      IT WENT FROM 30 MPH TO NEARLY 90 MPH IN A VERY SHORT PERIOD OF TIME AND IN A MOMENT OF CLARITY I REACHED FOR THE IGNITION KEY. I SWITCHED THE IGNITION OFF LOSING ALL POWER STEERING AND BRAKING CAPABILITIES BUT WAS ABLE TO BRING THE VEHICLE TO A STOP WITHOUT INCIDENT. AT THIS POINT I WAS ABLE TO FREE MY RIGHT FOOT FROM IT'S TRAPPED POSITION BETWEEN THE TWO CONTROL PEDALS AND SAT IN A STATE OF SHOCK.      IT WAS 2 DAYS LATER THAT I REALLY CAME BACK TO A SOMEWHAT LOGICAL STATE OF MIND AND DECIDED TO DO SOME RESEARCH AND HOPEFULLY ALERT OTHER DRIVERS  TO THIS POTENTIAL DEADLY PROBLEM. MUCH TO MY HORROR, I FIND THAT I'M NOT THE FIRST ONE TO EXPERIENCE THIS  AND BEING MECHANICAL MYSELF CAN SEE THAT THESE CARS ARE NOT DESIGNED BY 6 FOOT ENGINEERS WITH SIZE 13 BOOTS.     I FOUND A SIMILAR COMPLAINT ON THE ABOUTAUTOMOBILE.COM FORUM WHILE SEARCHING THE 2001 SANTA FE ( COMPLAINT NUMBER 754795) AND AGREE THAT THESE VEHICLES HAVE A SERIOUS DESIGN FLAW IN THE PROXIMITY OF THE BRAKE / ACCELERATOR PEDAL CONFIGURATION. FOR A PERSON OF MY STATURE, THEY CAN BE POTENTIAL DEATH TRAPS ! *TR",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/03/2009",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257302,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2001 HYUNDAI SANTA FE IN THE EVENING ON THE SOUTHERN STATE PARKWAY (55 MPH, LEFT LANE,  PKWY TRAFFIC HEAVY BUT MOVING WELL), STEERING SUDDENLY BEGAN TO SHIMMY, FOLLOWED BY GRINDING NOISE EMANATING FROM RIGHT FRONT WHEEL.  ASSUMED A FLAT, PULLED FOOT OFF GAS PEDAL, PUT HAZARD LIGHTS ON AND BEGAN TO PULL OVER TO RIGHT LANE.   STEERING ALMOST IMPOSSIBLE TO CONTROL AS STEERING WHEEL WAS WHIPPING FROM RIGHT TO LEFT, GRINDING NOISE INCREASED - AS I SLOWED ENOUGH TO PULL ONTO DIRT SHOULDER, RIGHT FRONT OF CAR COLLAPSED, RIGHT FRONT WHEEL BROKE OFF AND BOUNCED ACROSS 3 LANES OF TRAFFIC BEFORE LANDING ON OPPOSITE SHOULDER OF PARKWAY. THAT THE WHEEL DIDN'T FLY OFF WHILE DRIVING AT FULL 55 MPH AND WHEN IT DID FAIL, THAT IT BOUNCED BETWEEN ONCOMING CARS, AND DID NOT HIT ONE OF THEM AND CAUSE AN ACCIDENT, WAS ASTOUNDING.  THIS OCCURRED WITHOUT ANY PRIOR HINT OF A PROBLEM, MY CAR IS WELL MAINTAINED AND SERVICED ON A REGULAR BASIS.  ACCORDING TO MY MECHANIC, THE WHEEL LITERALLY RUSTED OFF - HE HAS NEVER SEEN ANYTHING LIKE THIS.  MECHANIC STATES 3 OTHER WHEELS HAVE MORE RUST THAN HE HAS EVER SEEN ON A VEHICLE, HOWEVER, HE DIDN'T FEEL THERE WAS DANGER OF AN IMMEDIATE FAILURE. *TR",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/21/2009",
        "dateOfIncident": "01/20/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255823,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BACK WINDOW OF MY 2001 HYUNDAI SANTA FE  JUST BLEW OUT LAST NIGHT, NO ACCIDENT. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/16/2009",
        "dateOfIncident": "01/08/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255284,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RUSTING OF LOWER SUB-FRAME ON A 2001 HYUNDAI SANTA FE. CAUSE STEERING PROBLEMS LEADING VEHICLE TO BE UNDRIVABLE. *TR",
        "vin": "KM8SC83D51U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "01/09/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254447,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SUSPENSION: LOST STEERING GOING OVER A BRIDGE. LOOKED UNDER CAR AND ALL RODS AND SPRINGS ARE RUSTED OUT WITH HUGE RUSTED HOLES. CRACKED AND RUSTED, ENTIRE REAR SUSPENSION NEEDS TO BE REPLACED. *TR",
        "vin": "KM8SB82B81U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/06/2009",
        "dateOfIncident": "01/05/2009",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253929,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR OF VEHICLE DROPPED CAUSING LANE CHANGE , LEFT REAR TIRE RUBBING ON STRUT-SHOCK , TRAILING ARM BROKE LEFT REAR. *TR",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/17/2008",
        "dateOfIncident": "10/12/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252061,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR TRAILING ARMS ROTTED AND ONE BROKE AS I WAS DRIVING.  II TOOK THE VEHICLE TO MY MECHANIC, WHO WAS TOLD BY HIS PARTS CONTACT THAT THIS IS A FREQUENT OCCURRENCE WITH HYUNDAI SANTA FE'S.  BOTH THE REAR TRAILING ARMS NEEDED REPLACING. I CONTACTED HYUNDAI AND THEY REFUSE TO LOOK INTO IT.  THEY TOLD ME THAT BECAUSE I DIDN'T TAKE THE VEHICLE TO A HYUNDAI SERVICE CENTER, THEY COULDN'T CONFIRM IT AND THEY DON'T FEEL THE NEED TO INVESTIGATE IT.  I DON'T UNDERSTAND WHY IT MAKES ANY DIFFERENCE AS TO WHICH SERVICE PLACE I TOOK THE VEHICLE TO.  THE BOTTOM LINE IS - THE VEHICLE NEEDED REPAIR.  I AM DISAPPOINTED WITH HYUNDAI FOR NOT STANDING BEHIND THEIR PRODUCT.  CLEARLY, STATING THAT IT NEEDED TO GO TO A HYUNDAI SERVICE CENTER IS JUST AN EXCUSE FOR THEM TO DENY THERE IS A PROBLEM WITH THE DESIGN OF THE VEHICLE OR THE PART.  I FEEL THERE IS A PUBLIC SAFETY RISK.  THERE WAS NO WARNING THAT THIS COULD HAPPEN WITH THE VEHICLE.  I COULD HAVE BEEN IN A SERIOUS ACCIDENT - OR WORSE.  MY TEENAGE SON COULD HAVE BEEN DRIVING THE VEHICLE WHEN THIS OCCURRED.  I WONDER HOW MANY OTHER VEHICLES ARE DRIVING AROUND WITH THE SAME DEFECT.  I WOULD LIKE AN INVESTIGATION TO BE SURE THAT OTHER'S DON'T EXPERIENCE WHAT I EXPERIENCED OR WORSE.  IF THE PART HAD BROKEN WHEN I WAS DRIVING ON THE HIGHWAY, IT COULD HAVE HARMED OTHERS.  PLEASE INVESTIGATE AND HELP PROTECT OTHERS. *TR",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/12/2008",
        "dateOfIncident": "12/11/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251569,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2001 HYUNDAI SANTA FE I NOTICED THAT MY VEHICLE WOULD SWAY TO THE RIGHT AND I HAD TO COMPENSATE BY STEERING THE VEHICLE TO THE LEFT. A PRELIMINARY INSPECTION SHOWED THAT I NEEDED A WHEEL ALIGNMENT AND NEW TIRES DUE TO THE EXCESSIVE WEAR TO THE TIRES CAUSED BY THE VEHICLE NOT BEING ALIGNED PROPERLY. THE VEHICLE WAS BROUGHT TO A LOCAL TIRE SHOP FOR TIRE REPLACEMENT AND WHEEL ALIGNMENT. UPON INSPECTION BY THE MECHANIC IT WAS DISCOVERED THAT THE SUB FRAME OF THE PASSENGER SIDE OF THE VEHICLE WHERE THE LOWER CONTROL ARM IS ATTACHED HAS A RUST HOLE WHERE THE RIGHT BOLT ATTACHES TO THE SUB FRAME. IN FACT THE LOWER CONTROL ARM OF THE PASSENGER SIDE OF THE VEHICLE IS ONLY ATTACHED WITH ONE BOLT. AS A RESULT THE VEHICLE NEEDED A TIE ROD REPLACEMENT AND WHEEL BEARING REPLACEMENT CAUSED BY THE LOWER CONTROL ARM NOT BEING PROPERLY ATTACHED TO THE SUB FRAME. I WAS ALSO INFORMED BY THE MECHANIC THAT HE WAS UNABLE TO ALIGN THE VEHICLE OR CHANGE THE WHEEL BEARINGS    DUE TO THIS CONDITION. THE MECHANIC INFORMED ME THAT THE SUB FRAME NEEDS TO BE REPLACED AS THE VEHICLE IS NOT SAFE TO DRIVE IN THIS CONDITION.  DAMAGE RESULTING = I AM UNABLE TO USE THIS VEHICLE AS IT IS UNSAFE TO DRIVE. COST TO REPLACE THE SUB FRAME IS APPROXIMATELY $2000.00 DOLLARS. *TR",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/02/2008",
        "dateOfIncident": "11/29/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250464,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE.  WHILE MAKING A LEFT TURN AT APPROXIMATELY 20 MPH, THE CONTACT FELT THE TIRES RUBBING AGAINST THE FRAME.  IMMEDIATELY FOLLOWING, THE VEHICLE BECAME DIFFICULT TO CONTROL DUE TO THE STEERING COLUMN VIBRATING UNCONTROLLABLY.  THE VEHICLE WAS DRIVEN TO A TIRE SHOP AND THE MECHANIC STATED THAT THE REAR DRIVER'S SIDE CONTROL ARM AND BALL JOINTS WERE RUSTED AND CRACKED.  THE VEHICLE WAS NOT REPAIRED.  THE MECHANIC ALSO ADVISED THE CONTACT TO HAVE THE VEHICLE TOWED TO A LOCAL REPAIR SHOP OR HER RESIDENCE BECAUSE IT WAS UNSAFE TO DRIVE.  THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE.  THE DEALER AND MANUFACTURER WERE NOT NOTIFIED.  THE VIN WAS UNAVAILABLE.  THE CURRENT MILEAGE WAS 104,800 AND FAILURE MILEAGE WAS 104,785.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/2008",
        "dateOfIncident": "11/12/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249299,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN APRIL 2008, THE RIGHT TRAILING ARM OF MY 2001HYUNDAI SANTA FE RUSTED THROUGH CAUSING THE REAR OF THE VEHICLE TO DROP.  REPLACEMENT WAS $712.  LAT WEEK (NOVEMBER 2008) THE LEFT TRAILING ARM RUSTED THROUGH CAUSING THE REAR OF THE CAR TO DROP, CRASHING THROUGH THE STRUT, WHEEL BALANCING AGAINST SIDE.  THIS REPLACEMENT COST $762.  HYUNDAI NEVER ALLOWED FOR DRAINAGE IN THE TRAILING ARMS FROM 2001 TO 2004.  NO RECALL AS IT HAPPENS IN HIGH SALT STATES.  I BELIEVE THEY ARE BEING INVESTIGATED FOR THIS NOW.  VERY DANGEROUS.  WE WERE LUCKY BOTH TIMES, BUT THIS HAS CAUSED OTHER VEHICLES TO FLIP OVER AND CAUSED DEATHS. *TR",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/14/2008",
        "dateOfIncident": "08/13/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248796,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LIGHT CAME ON .SO I CARRY TO THE PEOPLE THAT DID MY OIL CHANGE THEY CHECKED IT OUT THEY DID NOT SEE WHERE IT WAS LEAKING FROM. THEY REFILL IT AND THEN THE LIGHT CAME ON AGAIN ,SO THIS TIME I CARRY IT TO THE DEALER ON THAT MONDAY THEY GAVE ME AN APP. FOR THAT WEDNESDAY THE 13TH KEPT IT OVERNITE AND RETURNED BACK THE 14TH MAN IN PARTS DEPT SAID IT WAS BLOWING OUT THE TAIL PIPE. NO LEAKS ON THE GROUND. OIL LIGHT CAME ON AGAIN AND NOW THEY SAID THE B.B.B.SAID MY CAR IS TO OLD AND THAT THE PEOPLE THAT DID MY OIL CHANGE DID NOT PUT OIL IN ,WHICH IS A LIE. START TO BURN OIL  AT LITTLE OVER 85000 MILE. I CARRY IT TO THE DEALER AND THEY SAID THEY FIXED IT BUT THEY DID NOT. *TR",
        "vin": "KM8SB82B51U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/12/2008",
        "dateOfIncident": "04/08/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248633,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2001 HYUNDAI SANTA FE...GOING ALONG THE HIGHWAY WE HEARD A THUNK AND THE SUV ALMOST WENT OUT OF CONTROL...FISHTAILING...FINALLY BROUGHT IT TO A SAFE STOP AND TOWED....MY MECHANIC COULDN'T BELIEVE HOW THIN THE REAR CONTROL ARM WAS ( WHICH IS WHAT BROKE)  STATING IT WAS COMPLETELY RUSTED OUT, MAINLY BECAUSE THERE IS NO PLACE FOR THE WATER TO DRAIN CAUSING PREMATURE AND DANGEROUS CONDITIONS...THE OTHER SIDE WAS READY TO BREAK THROUGH TOO HE OBSERVED.    LUCKILY THERE WAS TRAFFIC THAT NIGHT AND WE WERE NOT GOING THAT FAST, HAD THAT HAPPEN AT 65, THE TRUCK WOULD HAVE BEEN APT TO ROLL OVER. *TR",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/29/2008",
        "dateOfIncident": "10/05/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247104,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I BACKED OUT OF THE DRIVEWAY MY FRONT BRAKES FAILED. THE FRONT DRIVER BRAKE PAD HAD SEPARATED FROM THE BRAKE ASSEMBLY .  THE PAD WAS ON THE DRIVEWAY. INSPECTION REVEALED THAT THE BONDING AGENT HAD FAILED. THE JENKINS HYUNDAI OF BRADENTON CONFIRMED THE DEFECT IN THE BONDING AGENT-BUT STATED THAT THE BRAKING SYSTEM IS NOT COVERED BY HYUNDAI WARRANTY. ALL BRAKE PADS WERE REPLACED. I RETAINED THE DEFECTIVE BRAKE PAD. *TR  UPDATED 02/01/10.*JB         UPDATED 03/08/10 *BF  UPDATED 04/29/10.*JB",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/09/2008",
        "dateOfIncident": "03/10/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245004,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE.  WHILE DRIVING OVER 50 MPH, THE CONTACT HEARD A THUMPING NOISE COMING FROM THE VEHICLE.  SHE ALSO FELT THE VEHICLE JERKING WHILE ATTEMPTING TO TURN LEFT OR RIGHT.  THE VEHICLE WAS SERVICED BY A MECHANIC, WHO STATED THAT THE TRANSMISSION WAS FINE AND HE COULD NOT FIND ANY FAILURES.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 110,000 AND CURRENT MILEAGE WAS 126,000.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/08/2008",
        "dateOfIncident": "02/28/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244752,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE WAS BACKING UP THE 2001 SANTA FE SUV AT A LOCAL PARK, SHE HEARD A LOUD THUMP.  SHE THOUGHT SHE WENT OVER A POTHOLE, AND GOT OUT OF THE CAR TO LOOK.  SHE DIDN'T SEE A POTHOLE, AND GOT BACK INTO THE CAR.  AS SHE DROVE DOWN THE ROAD, A RHYTHMIC SCREECH BECAME VERY LOUD FROM THE RIGHT REAR SIDE.  SHE STOPPED THE CAR, AND AGAIN GOT OUT TO TAKE A LOOK.  THE RIGHT REAR TIRE LOOKED NORMAL.  SHE GOT BACK INTO THE CAR AND CONTINUED TO DRIVE HOME, SLOWLY.  THE SCREECHING BECAME LOUDER AND LOUDER.  WHEN SHE GOT HOME, SHE LOOKED AT THE RIGHT REAR TIRE AND WAS SHOCKED TO SEE THAT IT WAS CAVED INWARD, AND A METAL PART WAS BROKEN AND HANGING DOWN.  THE CAR WAS NOT DRIVABLE IN THIS CONDITION, AND A TOW TRUCK HAD TO COME TO OUR HOME AND LOAD THE CAR ONTO A FLATBED TRUCK AND TAKE IT TO THE LOCAL HYUNDAI DEALER.          THE HYUNDAI MECHANIC DISCOVERED THAT THE CENTER OF THE RIGHT REAR CONTROL ARM HAD FULLY RUSTED OUT AND THE SUSPENSION HAD BROKEN THROUGH.  THE RIGHT REAR CONTROL ARM, THE LATERAL LINK, THE ABS SENSOR, CAM VOLT, AND NUT HAD TO BE REPLACED TO FIX THE PROBLEM.  THE TOTAL COST WAS $1,549.22.  THE DEALER TOLD ME THAT THIS WAS NOT COVERED UNDER THE WARRANTY OF THE CAR.        I THOUGHT THIS WAS AN ISOLATED CASE.  HOWEVER, AFTER DISCOVERING THERE WERE NUMEROUS CASES OF 2001 SANTA FE CONTROL ARMS RUSTING OUT, I DECIDED TO FILE AN NHTSA COMPLAINT.  I AM VERY GRATEFUL THAT THIS DID NOT HAPPEN AS MY WIFE WAS DRIVING AT A HIGH SPEED ON THE TOLLWAY.  IT IS MY OPINION THAT HYUNDAI SHOULD TAKE RESPONSIBILITY FOR THE POOR DESIGN OF THE CONTROL ARM.  FURTHERMORE, IN THE PAST TWO WEEKS, I HAVE DISCOVERED THAT THE LEFT CONTROL ARM IS SHOWING THE SAME SIGNS OF RUST THAT CAUSED THE FAILURE OF THE RIGHT CONTROL ARM.  IT WILL SOON NEED TO BE REPLACED, WHICH WILL BE EXPENSIVE.  I FEEL IT SHOULD BE PART OF A SAFETY RECALL.  *TR",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2008",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244898,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE.  THE CONTACT STATED THAT WHILE THE VEHICLE WAS IDLING AND AS THE ACCELERATOR PEDAL WAS DEPRESSED, THE VEHICLE DRAMATICALLY ACCELERATED.  THE RPM'S SURGED TO APPROXIMATELY 3,000.  THE DEALER COULD NOT DUPLICATE THE FAILURE OR PROVIDE A SUFFICIENT REMEDY.  AS OF OCTOBER 8, 2008, THE VEHICLE HAS NOT BEEN PROPERLY REPAIRED.  THE MANUFACTURER DID NOT ASSIST.  THE FAILURE MILEAGE WAS 80,000 AND CURRENT MILEAGE WAS 90,000.",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/17/2008",
        "dateOfIncident": "09/14/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242534,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS PULLING OUT OF A PARKING LOT AND THE RIGHT REAR TRAILING ARM FAILED BECAUSE IT HAD RUSTED AND BROKE CAUSING THE REAR TIRE TO TURN OUT AND THERE WAS NO CONTROL OF THE VEHICLE, SHE JUST GOT OFF THE INTERSTATE RUNNING 70 MILES PER HOUR, THIS COULD HAVE HAD A REAL SAD OUT COME. WE ARE HAVING BOTH TRAILING ARMS REPLACED. *TR",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2008",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241989,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING OVER A POT HOLE THE VEHICLE CONTINUED TO PULL TO THE RIGHT AS IT WAS DRIVEN. THE NEXT DAY I TOOK IT TO A REPAIR SHOP FOR WHEEL ALIGNMENT. THE SHOP SAID THEY COULD NOT REPAIR IT AS THERE WAS A FIST SIZE HOLE IN THE FRAME WHERE IT HAD RUSTED THROUGH WHERE THE CONTROL ATTACHES TO THE FRAME. WHILE RESEARCHING THE INTERNET I LEARNED OF MANY SIMILAR DEFECTS REPORTED TO NHTSA I BELIEVE SOME HYUNDAI MODELS SHARE THE FRAME. *TR",
        "vin": "KM8SC83D51U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/05/2008",
        "dateOfIncident": "08/04/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237092,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SANTE FE WAS MAKING \" CREAKING\" NOISE BY THE PASSENGER SIDE REAR TIRE.  I MADE AN APPOINTMENT FOR IT, BUT BEFORE THE APPOINTMENT I HEARD A LOUD THUD AND LOST CONTROL OF THE VEHICLE.  FORTUNATELY I WAS ONLY GOING 35 MPH AND WAS ABLE TO SKID INTO A DRIVEWAY.  THE REAR CONTROL ARM SNAPPED OFF DUE TO AN EXCESSIVE AMOUNT OF RUST.  THE OTHER SIDE IS ALMOST RUSTED THROUGH.  THE REPAIR SHOP HAD NEVER SEEN ANYTHING LIKE IT BEFORE.  *TR",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/31/2008",
        "dateOfIncident": "07/31/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236585,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 30MPH (2001 SANTA FE), I FELT A BIG JERK WHICH I NEVER FELT IT BEFORE WITH THIS CAR. AFTER THAT I MADE A RIGHT TURN AND MY CAR SUDDENLY STOPPED AND CHECK ENGINE LIGHT COMES ON. WHEN I RE-STARTED THE CAR, IT STARTED FINE.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/07/2008",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233333,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CRANKSHAFT SENSOR FAILED ON MY 2001 4 CYLINDER HYUNDAI SANTA FE.  THE CAR SUDDENLY STALLED AND WOULD NOT RESTART.  I WAS DRIVING ON BUSY STREET IN THE WINTER EVENING AND, AT THE TIME, WAS ON CRUTCHES AND UNABLE TO NAVIGATE ON FOOT.  I WAITED IN 20 DEGREE WEATHER FOR ABOUT 45 MINUTES UNTIL A POLICE PERSON RESCUED ME.  *TR",
        "vin": "KM8SB82B91U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/31/2008",
        "dateOfIncident": "05/24/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229405,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RETURNING FROM 2 HOUR HIGHWAY TRIP, TURNED INTO DEVELOPMENT, HEARD LOUD SNAPPING NOISE.  TOOK TO DEALER NEXT DAY, INFORMED DRIVER SIDE REAR CONTROL ARMS RUSTED THROUGH AND BROKEN, PASSENGER SIDE WELL ON WAY.  AXLE WOULD ALSO NEED TO BE REPLACED.  ONLY AXLE UNDER WARRANTY--HAD DEALER REPLACE SUCH.  TOOK VEHICLE TO REGULAR GARAGE FOR REMAINDER OF REPAIRS.  GARAGE EXTREMELY SURPRISED AT AMOUNT OF RUST CONTAINED IN REAR SUSPENSION----PAPER THIN.  HAVE SAVED PARTS FOR ANYONE WISHING TO LOOK AT THEM.  HAVE NOTED ON-GOING COMPLAINTS ABOUT 2001 HYUNDAI ELANTRAS WITH SAME PROBLEM--MUST BE A HYUNDAI ISSUE--AS MINE IS A SANTA FE.  THIS IS A VERY DANGEROUS CONDITION AND COULD CAUSE MAJOR ACCIDENTS AND/OR DEATHS SHOULD CONTROL FAIL DURING NORMAL DRIVING CONDITIONS.  WAS TOLD CONTROL ARM IS DEFECTIVE, AS THERE IS NO HOLES FOR ANY WATER/CONDENSATION TO DRAIN, THEREFORE WATER SITS AND RUSTS THEM OUT.  *TR",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/28/2008",
        "dateOfIncident": "04/09/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225986,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE: 2001 HYUNDAI SANTA FE    I AM CONCERNED ABOUT THE SAFETY AND RELIABILITY OF A KEY SUSPENSION COMPONENT: THE RIGHT REAR BEARING ARM. THIS COMPONENT, WHICH ATTACHES THE RIGHT REAR WHEEL AXLE TO THE CHASSIS COMPLETELY FAILED DURING A DRIVE ON A SECONDARY ROAD AT SPEEDS UNDER 55 MPH ON APRIL 9, 2008. THE STEERING WHEEL JERKED TO THE RIGHT A QUARTER OF A TURN, AND THE VEHICLE ALMOST FLIPPED OVER. THE VEHICLE WAS TOWED.    MY MECHANIC INFORMS ME THAT THIS COMPONENT SHOULD LAST THE LIFE OF THE VEHICLE. IN MY CASE, IT IS COMPLETELY CORRODED TO THE POINT WHERE IT COULD NO LONGER SUPPORT THE WEIGHT OF THE VEHICLE AND CAUSED A STRUCTURAL FAILURE. I HAVE OWNED MANY CARS, AND HAVE NEVER SEEN A WEIGHT BEARING SUSPENSION COMPONENT FAIL UNDER NORMAL DRIVING CONDITIONS.     HAD THIS FAILURE HAPPENED ON THE FREEWAY, I AM SURE THE RIGHT REAR WHEEL WOULD HAVE COMPLETED DEPARTED THE VEHICLE RESULTING IN A COMPLETE LACK OF CONTROL AND PROBABLE DISASTER. WE CONSIDER OURSELVES VERY FORTUNATE THAT NO ONE WAS HURT.    HOWEVER, THE DAMAGE TO THE CAR WAS EXPENSIVE. THE COST OF THE REPAIR WAS NEARLY $1,000. THE COST OF THE SUSPENSION COMPONENT ALONE WAS $567.79. I CONSIDER THIS FAILURE NOT A NORMAL CIRCUMSTANCE AND WOULD LIKE SOMEONE TO INSPECT THE PART AND VEHICLE FOR COMPLETE ANALYSIS. I HAVE THE OLD PART AS WELL AS DIGITAL PHOTOS OF THE FAILED COMPONENT FOR YOUR REVIEW AS WELL AS REPAIR DOCUMENTATION.    I WOULD LIKE HYUNDAI TO COVER THE COST OF THIS EXPENSIVE REPAIR. IN MY OPINION, THIS COMPONENT SHOULD NEVER FAIL UNDER NORMAL DRIVING CONDITIONS AND CERTAINLY NEVER FAIL IN A VEHICLE THAT HAS NEVER BEEN INVOLVED IN AN ACCIDENT.    THIS FAILURE HAS REALLY SHAKEN MY CONFIDENCE IN HYUNDAI'S DESIGN AND ENGINEERING QUALITY. IF WE HAD BEEN ON THE HIGHWAY, I AM CERTAIN THAT AN ACCIDENT WOULD HAVE BEEN INEVITABLE.  *TR",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/29/2008",
        "dateOfIncident": "03/26/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222673,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A-FRAME OF THE DRIVER SIDE REAR RUSTED THROUGH AND MY TIRE AND WHEEL FELL OFF.  *TR",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215997,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR A FEW DAYS  PRIOR TO THE INCIDENT, I THOUGHT I NEEDED TO HAVE THE BRAKES REPLACED ON THIS VEHICLE.  EVERYTIME I APPLIED THE BRAKES, THE CAR WOULD SWERVE A LITTLE; THEN THERE WOULD BE A \"THUMP\" AT THE REAR OF THE CAR.    ON THE DAY OF THE INCIDENT, THERE WAS A SIGNIFICANT NOISE AT THE REAR OF THE CAR, SO I LOOKED IN THE BACK STORAGE AREA THINKING SOMETHING WAS ROLLING AROUND-FOUND NOTHING.  I CONTINUED DRIVING A FEW MILES, HEARING THE THUMPING NOISE AGAIN, I STOPPED AND  LOOKED UNDERNEATH THE THE REAR OF THE VEHICLE THINKING THE SPARE TIRE BRACKET WAS BROKEN--SAW NOTHING.  LATER IN THE DAY, AS I TURNED RIGHT THERE WAS A LOUD NOISE AT THE REAR.  I TOLD MYSELF TO DRIVE SLOWLY--AND THEN THE RIGHT REAR TIRE BROKE CAUSING ME TO LOSE CONTROL OF THE CAR.  FORTUNATELY FOR MYSELF, OTHER DRIVERS AND HYUNDAI I WAS DRIVING SLOW.  THE CAR WAS FLATBEDDED TO THE HYUNDAI DEALER, WHO TOLD ME THAT THE REAR TRAILERING ARM \"SNAPPED\" OFF DUE TO AN IMPACT.  THE SERVICE MANAGER STATED THAT HE HAD NEVER SEEN ANYTHING LIKE THAT AND WANTED TO WAIT FOR THE COMPANY REP BEFORE DECIDING WHAT TO DO.  THE REP INSISTED THAT RUST HAD NOTHING TO DO WITH THE PART BREAKING AND THAT I NEEDED TO PAY 1100.00 FOR THE REPAIR (WHICH INCLUDED A NEW BRAKE LINE AND SHOCK DUE TO THE FAULTY PART)  THE DEALERSHIP THEN DID NOT WANT TO GIVE ME THE PART BECAUSE IT WAS \"TOO RUSTY\" TO PUT IN THE CAR.  THIS SEEMS TO BE THE 4TH VEHICLE REPORTING THE SAME PROBLEM.    I DO HAVE THE PART AND WILL BE GOING TO THE LOCAL NEWS MEDIA TO COMPLAIN ABOUT THE SAFETY ISSUE NOT BEING ADDRESSED BY THE COMPANY.  *TR",
        "vin": "KM8SB82B91U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/17/2007",
        "dateOfIncident": "12/07/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212087,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS COMING TO A RED LIGHT AND LET OFF THE GAS TO COAST BEFORE PUTTING ON MY BRAKES(MY DAD TAUGHT ME WELL TO DO THIS INSTEAD OF BEING A QUICK BRAKER TO MAKE MY BRAKES LAST LONGER). AT ABOUT 25MPH MY CAR BEGAN TO ACCELERATE BACK UP TO 30, THEN 35, THEN 40. I PANICKED. I PRESSED THE BRAKES VERY HARD BUT THE RPM'S WERE STILL RISING AND I COULD HEAR THE ENGINE STILL ACCELERATING. I TRIED PUTTING IT INTO PARK, NO LUCK. I THEN TURNED THE CAR OFF WHILE IN PARK. SCARY!!!! MY KIDS WERE WITH ME. HAD I NOT BEEN ABLE TO STOP WE'D HAVE BEEN KILLED WHILE  PLOWING INTO CROSS TRAFFIC TRAVELING AT 55MPH OR MORE! AFTER RESTARTING THE CAR, IT SEEMED BETTER. THEN 5 MILES DOWN THE ROAD IT DID IT AGAIN. I DROVE IT BACK HOME (8MILES) WITH NO INCIDENT. 2 DAYS LATER WHILE DRIVING MY SON HOME FROM SCHOOL, THIS EPISODE REPEATED 4 TIMES. WITH EACH \"RESTART\" IT BECAME MORE DIFFICULT TO START THE CAR AND I HAD TO WAIT (YES, IN TRAFFIC) 5 MINUTES BEFORE STARTING THE CAR AGAIN. I NEEDED TRANSMISSION WORK, TOOK IT IN, $2000 REBUILD. TOLD THEM ABOUT THE ISSUE AND THEY COULD FIND NOTHING BUT HOT MAYBE AFTER THE TRANSMISSION WORK WAS DONE IT WOULD RESOLVE. NOT A CHANCE. THEY ARE STUMPED AS TO WHAT'S WRONG. THEY'VE CHECKED THE THROTTLE BODY AND PARTS. NO CODES COME UP. THEY'VE UNHOOKED THE CRUISE CONTROL. MY HUSBAND DROVE IT HOME THIS PAST WEEKEND SO A FRIEND COULD LOOK AT IT AND SEE WHAT HE THOUGHT AND MY HUSBAND WAS DRIVING ON A LONG STRETCH OF ROAD WITH NO STOPS AND THE CAR WAS DRIVING AT 50MPH WITH HIM NOT PUSHING THE GAS PEDAL. HELP!!! THIS IS GOING TO HURT OR KILL SOMEBODY.  *TR",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/23/2007",
        "dateOfIncident": "07/06/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197266,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2001 HYUNDAI SANTE FE EASTBOUND ON INTERSTATE 275 IN WILDER KENTUCKY AT APPROXIMATELY 65 MILES PER HOUR AT APPROXIMATELY 10PM , WHEN I HEARD A POPPING SOUND AND SUDDENLY LOST CONTROL OF THE VEHICLE. MY WIFE AND TWO CHILDREN AGES 8 AND 11 WERE IN OUR SUV WITH ME. THE CAR SWERVED OVER THREE LANES OF TRAFFIC AND THE MEDIAN STRIP VEERING WILDLY FROM LANE TO LANE. THE VEHICLE ALMOST TIPPED OVER SEVERAL TIMES. FORTUNATELY, NO OTHER CARS WERE NEARBY AND I WAS ABLE TO BRING THE VEHICLE UNDER CONTROL. THE CAR WAS TOWED TO THE NEWPORT FIRESTONE STORE ON CAROTHERS ROAD. 859-491-1400. THE WHEEL WAS TURNED OUT APPROXIMATELY 10 DEGREES. THE SHOP FOUND THAT THE SUSPENSION TRAILING ARM HAD RUSTED THROUGH AND HAD ALMOST COMPLETELY SEPARATED INTO TWO PIECES. WE COULD EASILY HAVE BEEN KILLED OR SERIOUSLY INJURED. I SAVED THE PART. THE WHEEL WAS LITERALLY HANGING ON BY A THREAD.  THE REPAIRS COSTS APPROXIMATELY $800. I CALLED HYUNDAI CUSTOMER SERVICE AND THEY WERE COMPLETELY UNRESPONSIVE.  THIS IS NOT WHAT A CONSUMER WOULD EXPECT FROM A SIX YEAR OLD VEHICLE. I AM CONCERNED THAT  OTHER CARS OUT THERE ARE TICKING TIME BOMBS.  *JB",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/02/2007",
        "dateOfIncident": "06/29/2007",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195117,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 HYUNDAI SANTA FE.  WHILE DRIVING 65 MPH, THE CONTACT HEARD A LOUD CRACKING SOUND COMING FROM THE PASSENGER SIDE REAR WHEEL.  THE CONTACT LOST CONTROL OF THE VEHICLE AND BECAME WORSE WHEN HE DEPRESSED THE BRAKE PEDAL.  THE VEHICLE BEGAN TO FISHTAIL, BUT GRADUALLY DECELERATED TO A COMPLETE STOP.  THE CONTACT NOTICED THAT THE PASSENGER SIDE REAR WHEEL LOOKED AS IF IT WERE TURNED AT A 15 DEGREE ANGLE.  THE VEHICLE WAS TOWED AND THE MECHANIC STATED THAT THE SUSPENSION TRAILING ARM WAS RUSTED AND CRACKED.  THE CURRENT MILEAGE IS 103,000 AND FAILURE MILEAGE WAS 13,000.",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2007",
        "dateOfIncident": "03/30/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183537,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 HYUNDAI SANTE FE.  THE CHECK ENGINE LIGHTS ILLUMINATED AND THE VEHICLE WILL NOT SHIFT PROPERLY.  WHILE DRIVING 55 MPH AND SHIFTING GEARS,THE GEAR STUCK FROM FOURTH TO THIRD GEAR. THE CONTACT TURNED THE VEHICLE OFF. THE VEHICLE  OPERATED NORMALLY ONCE IT WAS RESTARTED.  THE FAILURE USUALLY OCCURRED DURING RAINY OR DAMP CONDITIONS. THE DEALER INFORMED THE CONTACT THAT THE FAILURE WAS DUE TO A CRACKED CRANKSHAFT. THE VEHICLE WAS INSPECTED, AND THE CRANKSHAFT WAS REPLACED ON MARCH 30, 2004. AFTER THE CRANKSHAFT WAS REPLACED THERE WERE NO OCCURRENCES UNTIL MAY 2005 AND AUGUST 2005,  WHEN THE COIL WAS REPLACED. THE VEHICLE OPERATED NORMALLY UNTIL NOVEMBER 2006.   THE CURRENT AND FAILURE MILEAGE WAS 88,000.*AK  THE CONSUMER HAS PROVIDED A RECALL FOR THE ELECTRICAL SYSTEM PERTAINING TO THE CRANKSHAFT POSITIONER AND INVOICES FOR THE REPAIRS. THE DEALER STATED THAT THE SPEED SENSOR HAS BEEN REPLACED. UPDATE 5/3/07*TR",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/02/2006",
        "dateOfIncident": "10/24/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175002,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON THE HIGHWAY ABOUT 65 MILES PER HOUR THE VEHICLE SUDDENLY TURN TO THE RIGHT AND LUNGED DOWNWARD TO A POINT THE VEHICLE FELT AS IF IT WAS GOING TO FLIP OVER. I BROUGHT THE VEHICLE TO A REPAIR SHOP AND FOUND THE RIGHT REAR LOWER CONTROL ARM HAD RUSTED COMPLETELY THROUGH. I HAVE PICTURES OF THE PART IF NEEDED. WHEN THE REPAIR SHOP CALLED THE HYUNDAI PARTS DEPARTMENT THE PERSON ANSWERING THE PHONE SAID THIS TYPE OF PROBLEM WAS COMMON PROBLEM WITH SANTA FE SUVS. THAT NEXT THING THAT MADE ME THINK THIS WAS A PROBLEM THAT HYUNDAI WAS AWARE OF, WAS THAT THE REPLACEMENT PART HAD BE REDESIGNED AND NOW HAS WEEP HOLES SO NOT TO RETAIN WATER OR MOISTURE.    THE REPAIR SHOP TESTED THE REMAINING CONTROL ARMS ON THE VEHICLE TO FIND THE LEFT REAR LOWER CONTROL ARM WAS ALMOST RUSTED THROUGH. THE REPAIR SHOP SAID THAT THIS VEHICLE HAS THE SAME DEGREE OF RUST ON THESE PARTS THAT A TEN YEAR OLD CAR WOULD HAVE. THIS VEHICLE IS ONLY SIX YEARS OLD AND HAS BEEN GARAGED DURING THIS TIME.   HYUNDAI SEEMS TO BE AWARE OF THE DEFECT DUE TO THE REDESIGN OF THE PART IN QUESTION AND THAT HYUNDAI PARTS DEPARTMENT IS AWARE OF THE NUMBER OF FAILURES. IS HYUNDAI WAITING UNTIL THERE IS A SERIOUS INJURY OR A DEATH?   *NM",
        "vin": "KM8SC83D51U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2006",
        "dateOfIncident": "06/02/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171603,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 70 MPH ON THE HIGHWAY, THE VEHICLE STALLED WITHOUT WARNING.  IT WAS MANEUVERED OFF THE ROAD AND TOWED TO THE DEALER WHO REPLACED THE CRANK SHAFT POSITION SENSOR.  THERE WAS A NHTSA RECALL, # 03V030000, REGARDING THE ELECTRICAL SYSTEM; STARTER ASSEMBLY.  THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.",
        "vin": "KM8SB82B21U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "09/13/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168622,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 40 MPH, A THUMPING NOISE WAS HEARD FROM THE FRONT OF THE VEHICLE.  IT WAS DRIVEN TO THE DEALER WHO DETERMINED THE FRONT DRIVER SIDE LOWER BALL JOINT NEEDED TO BE REPLACED.  THE PROBLEM REOCCURRED ON FOUR OTHER OCCASIONS AND THE LOWER BALL JOINT WAS REPLACED EACH TIME.",
        "vin": "KM8SB82B61U"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/19/2006",
        "dateOfIncident": "06/17/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166021,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Honda (American Honda Motor Co.)",
                "productMake": "HONDA",
                "productModel": "SILVERWING",
                "productYear": "1982",
                "type": "Equipment"
            }
        ],
        "summary": "SUSPENSION /CHECK ENGINE LIGHT /LOWER BALL JOINT:  DEALER REPLACE @54,353 MILES, LOWER ARM IN 2004 AND 8/2006 REPLACEMENT IS NEEDED    I HAVE TAKEN MY 2001 SANTA FE TO DEALER 8 PLUS TIMES FOR CHECK ENGINE  LIGHT AND WAS TOLD FOUND TETHER ON GAS CAP NOT LETTING CAP CLOSE TIGHT ENOUGH /MOVED TETHER AND RAN EVAP TEST AND CHECK OUT OK . I WAS TOLD CAP LOOSE 8 PLUS TIMES THIS PROBLEM IS ON GOING.  RETURN TO DEALER FOR JERK TRANSMISSION ISSUES  I HAVE TO PUSH THE ACCELERATOR PEDAL TO THE FLOOR AND IT TAKES OFF SLOW AND ONCE GETS POWER THE CAR JERKS STARTS AS IF THE GEARS OR NOT SWITCHING OVER.  DEALER SAID DO THE PRESSURE IN GAS CAP AND GAS  CAP NOT CLOSED TIGHT ENOUGH EVAL TEST WAS DONE.  BACK AT DEALER  AFTER ROAD TRIP MY  CAR WAS RUNNING AFTER BEGIN PARKED WITH A/C RUNNING AND I TURN CAR OFF AND CAR WOULD NOT START THOUGHT MAY BATTERY CHECK AND NO WATER WAS IN BATTERY I PUT WATER IN BATTERY AND LET CAR SIT FOR ABOUT HOUR AND  CAR RESTARTED  BACK AT DEALER EXPLAIN THIS ISSUE MY BATTERY WAS REPLACE I WAS TOLD FACTORY BATTERY WASN'T STRONG ENOUGH WAS FOR SANTA FE THIS IS 3RD BATTERY WITH IN FIVE YEARS.  *NM",
        "vin": "KM8SC83D11U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/29/2006",
        "dateOfIncident": "06/28/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161110,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE- HYUNDAI SANTA FE 2001 2.4L 58000 MILES  SUDDEN CLUTCH FAILURE DUE TO EXCESSIVE SLIPPAGE CAUSED BY HYDRAULIC PROBLEM IN THE CLUTCH SLAVE CYLINDER.  INTERNET RESEARCH INDICATES THIS IS A PERVASIVE PROBLEM WITH HYUNDAI CLUTCHES IN GENERAL. MANUFACTURER APPARENTLY IS IGNORING THE PROBLEM. IN EXCESS OF $2000 IN QUOTED REPAIRS.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/30/2006",
        "dateOfIncident": "05/28/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158626,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Maxon Lift Corp.",
                "productMake": "MAXON",
                "productModel": "MAXON",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON MAY 7TH MY CAR WAS TOWED INTO THE MAXON DEALERSHIP WITH COMPLAINTS OF CLUNKING NOISE UNDER THE HOOD AND LOST OF POWER.  THE SERVICE ON MY VEHICLE WAS COMPLETED ON MAY 9TH.  I WAS TOLD THAT I NEEDED TO REPLACE MY DRIVER BELTS AND A COMPUTERIZED PROBLEM WAS THE CAUSE OF POWER.  ON MAY 28TH (MEMORIAL DAY WEEKEND) WHILE COMING HOME FROM VIRGINIA I SUDDENLY LOST STEERING POWER ON INTERSTATE 95 IN MARYLAND.  I HAD MY THREE CHILDREN IN THE CAR ALONG WITH MY COUSIN AND HER DAUGHTER.  WE WERE ALL VERY SCARED!  MY CAR WAS THEN TOWED TO THE HYUNDAI DEALERSHIP IN LAUREL, MD.  I RECEIVED A CALL FROM THE SERVICE ADVISOR WHO ADVISED ME THAT WHEN MY DRIVER BELTS WERE REPLACED THEY WERE TOO TIGHT WHICH IN TURN CRACKED MY PULLEY AND DAMAGE MY POWER STEERING PUMP.  HE ADVISED ME THAT THE BOTH WILL HAVE TO BE REPAIRED AND THAT A TENSIONER WILL BE ADDED.  I CONTACTED MAXON HYUNDAI, WHO SIMPLY STATED \" THE REPAIRS WILL BE DONE UNDER MY WARRANTY\" END OF STORY.  WE AND MY FAMILY COULD HAVE LOST OUR LIVES IN AN INSTANT BECAUSE OF THE TECHNICIANS ERROR AND FOR MAXON TO NOT RECOGNIZE THAT ERROR IS A MAJOR PROBLEM.  I WAS NOT OFFERED TO BE REIMBURSED FOR THE ORIGINAL REPAIRS MADE, NOR DID THEY OFFER TO REIMBURSED FOR THE COST OF THE RENTAL, NOR DID THEY OFFER TO BRING MY CAR FROM MARYLAND TO NEW JERSEY, THEY OFFERED ME NOTHING. MY CAR HAS BEEN TO THEM ON NUMEROUS OCCASIONS AND ALWAYS SEEM TO GO BACK WITHIN TWO MONTHS FOR THE SAME PROBLEM.  DO THE OWNERS OF MAXON REALIZE HOW PRECIOUS A LIFE IS?  MY LIFE AND THE LIVES OF MY CHILDREN WERE SPARED THIS TIME, BUT WHAT HAPPENS TO THEIR NEXT CUSTOMER WHERE THEY DECIDE TO CUT CORNERS?  *NM",
        "vin": "KM8SB82B51U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/03/2006",
        "dateOfIncident": "12/23/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156685,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SANTA FE 4 CYLINDER REPEATEDLY STALLED, WOULDN'T START. DEALERSHIP WHERE PURCHASED HAD CAR FOR 2 FULL DAYS, COULDN'T FIND THE PROBLEM. PRIVATE MECHANIC REPLACED CRANKCASE SENSOR, PROBLEM SOLVED. FAULTY CRANKCASE SENSOR SUBJECT OF RECALL FOR 6 CYLINDER ENGINE ON SAME MODEL. *NM",
        "vin": "KM8SB82B71U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/2006",
        "dateOfIncident": "04/06/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154983,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:THE CONTACT STATED WHILE DEPRESSING THE BRAKE PEDAL AT HIGHWAY SPEEDS THE VEHICLE VIBRATES DUE TO THE ROTORS BEING WARPED.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP AND THE FRONT BRAKES WERE REPLACED.  SINCE THE REPLACEMENT THE CONTACT BEGAN TO HAVE THE PROBLEM WITH THE VEHICLE VIBRATING.  IT HAS BEEN TAKEN TO THE DEALERSHIP A TOTAL OF THREE TIMES.  THE FIRST TIME BOTH FRONT ROTORS WERE TURNED.  THE SECOND TIME THE FRONT PASSENGER ROTORS WERE RESURFACED.  THE LAST TIME THE FRONT PASSENGER ROTOR WAS WARPED HOWEVER THE DEALERSHIP RESURFACED THE FRONT DRIVER AND PASSENGER SIDE ROTORS.  THE ROTORS HAVE BEEN RESURFACED THREE TIMES IN THE LAST THIRTEEN MONTHS.  THE DEALERSHIP DETERMINED THIS IS DUE TO THE WAY THE CONTACT DRIVES THE VEHICLE.  THE CONTACT CLAIMED  DEALER REPLACED ROTORS ON 04/18/2006, AND TURNED THEM 3 TIMES IN 13 MONTHS.",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2006",
        "dateOfIncident": "04/02/2006",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154649,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 HYUNDAI SANTA FE HAD A VERY BAD ODOR LIKE WIRES WERE BURNING IN THE VEHICLE. WHEN THAT OCCURRED MY POWER DOOR LOCKS WOULD NOT WORK AND MY REAR WIPER WOULD NOT WORK. THE SMELL WAS SO BAD I HAD TO LOWER ALL THE WINDOWS SO I WOULD NOT PASS OUT. I STOP TO CHECK IF THERE WAS A FIRE. I TOOK IT TO THE DEALER WHO SAID THEY COULD NOT FIND ANY PROBLEM, BECAUSE IT DID NOT OCCUR WHEN THEY CHECKED IT. I WAS TOLD TO BRING THE CAR BACK IMMEDIATELY WHEN IT HAPPENS AGAIN. I WAS WONDERING IF THERE WERE ANY SIMILAR PROBLEMS WITH 2001 SANTA FE'S. *JB",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2006",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153675,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 HYUNDAI SANTE FE.  WHEN FILLING THE GAS TANK, THERE SEEMS TO BE SOME SORT OF VENTING PROBLEM THAT CAUSES OVERFLOW OF GASOLINE DOWN THE SIDE OF THE VEHICLE.  THIS OCCURS EVERY TIME I FILL UP AT ANY GAS STATION UNLESS I AM VERY CAREFUL AND FILL THE TANK VERY VERY SLOWLY.  EVEN THEN IT SOMETIMES OVERFLOWS.  BASICALLY, IT SEEMS AS THOUGH A PRESSURE IS BUILT UP WITHIN THE TANK AND WHEN THE GAS PUMP CUTS OFF, IT IS TOO LATE.  THE CAR SEEMS TO SORT OF \"VOMIT\" ABOUT A CUP OR SO OF GAS OUT OF THE FILLER HOLE AND DOWN THE SIDE OF THE VEHICLE AND ONTO THE GROUND.    IT SEEMS VERY DANGEROUS TO ME AND SCARES ME.  AS A RESULT, I ALWAYS HAVE TO FILL UP VERY CAREFULLY AND FILL THE TANK AS SLOWLY AS POSSIBLE ONCE IT IS OVER ABOUT HALF FULL.  I'M AFRAID THIS COULD RESULT IN A FIRE AT THE GAS STATION.   *JB",
        "vin": "KM8SC83D91U"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145219,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED THAT WHILE PARKING PUT THE VEHICLE IN REVERSE THEN DRIVE AND THE TACHOMETER WENT TO THE RED ZONE.  ALTHOUGH THE CONTACT'S  FOOT WAS ON THE BRAKE THE VEHICLE MOVED APPROXIMATELY 15 FEET FORWARD IN 30 SECONDS.  THEN, HE THEN  THE VEHICLE OFF AND BACK ON, AND THE PROBLEM WAS GONE.  THIS REPEATED A WEEK LATER.  HE HAD THE VEHICLE TOWED TO THE DEALERSHIP, WHO DETERMINED THAT  THE BATTERY WAS RUN DOWN AND NEEDED TO BE REPLACED.  THE DEALERSHIP WAS UNABLE TO DIAGNOSE THE CAUSE OF THE  PROBLEM.  THEY RULED OUT A  CRUISE CONTROL BECAUSE IT HAS NEVER BEEN USED.    *AK  UPDATE 1/4/2006 - *NM",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "10/06/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142012,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:THE CONTACT STATED THE CPS CAPACITOR THAT IS WITH THE CRANK SHAFT POSITION SENSOR IS NOT WORKING PROPERLY AND AS A RESULT THE VEHICLE STALLED ON THE FREEWAY. THE DEALERSHIP RAN A DIAGNOSTIC TEST AND THIS PROBLEM CAME UP AS A CRITICAL CODE. THE CONSUMER FOUND NHTSA RECALL 03V030000  FOR THIS PROBLEM BUT THE DEALERSHIP TOLD HER THIS VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO VIN.  *AK   UPDATED 2/7/2006 - *NM",
        "vin": "KM8SB82BX1U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/14/2005",
        "dateOfIncident": "12/08/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139703,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SANTA FE 4 CYLINDER CAR STALLED,WOULDN'T START, HAD TO REPLACE CRANKCASE POSITION SENSOR, OLD PART NOT AVAILABLE, EXACT SAME PROBLEM SUBJECT OF RECALL CAMPAIGN FOR 6 CYLINDER ENGINE OF SAME MODEL CAR, HYUNDAI REFUSES TO ASSIST.  *NM",
        "vin": "KM8SB82B91U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2005",
        "dateOfIncident": "09/08/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136786,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE THE SAME COMPLAINT AS MANY SANTA FE OWNERS.  PROBLEMS OF ACCELERATION AT 40, ALONG WITH SHIFTING ISSUES.  ON SEVERAL TRIPS TO THE DEALER, LEAVING THE CAR THERE FOR SOMETIMES 7-15 DAYS AT A TIME. IT HAS HAD 4 THROTTLE POSITION SENSORS, AN ALTERNATOR AND 2 BATTERIES.  MY MILEAGE IS 100,386 AND THE VEHICLE NEEDS 3000.00 WORTH OF TRANSMISSION WORK.  HYUNDAI SIMPLY STATES MY VEHICLE IS OUT OF WARRANTY AND THESE ISSUES DO NOT HAVE ANYTHING TO DO WITH MY TRANSMISSION.  I HAVE A SIGNED STATEMENT FROM THE TRANSMISSION SHOP MANAGER THAT STATES A TPS PROBLEM ABSOLUTELY WILL AFFECT THE TRANSMISSION.  *NM",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "06/01/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130787,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS A 2001 4-CYLINDER 5-SPEED MANUAL TRANSMISSION.  THE ENGINE IS TOO SMALL FOR THE CAR'S WEIGHT.  I HAD TO HAVE THE CLUTCH REPLACED AFTER ONLY 24,000 MILES, WHICH WAS NOT COVERED UNDER THE WARRANTY (COST WAS OVER $1000).  THE DEALER INSISTED THAT I CAUSED THE PROBLEM BY \"BAD DRIVING\".  I HAVE DRIVEN A STICK FOR WELL OVER 12 YEARS, AND NEVER HAD TO REPLACE A CLUTCH ON ANY OTHER CAR.  *JB",
        "vin": "KM8SB82B31U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "05/13/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124566,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2001 HYUNDAI SANTA FE HAS AUTOMATIC/STANDARD TRANSMISSION  WHICH  WOULD DOWNSHIFT ON ITS OWN.  THE CONSUMER FIRST NOTICED THIS PROBLEM WHEN GETTING ONTO THE HIGHWAY AND THE VEHICLE WOULDN'T SHIFT OUT OF THIRD GEAR.  WHEN CONSUMER EXITED THE HIGHWAY HE NOTICED HE ONLY HAD SECOND AND THIRD GEARS.  HE SHUT THE VEHICLE OFF AND RESTARTED IT AND THE VEHICLE OPERATED NORMALLY.  *AK",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/20/2005",
        "dateOfIncident": "04/18/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118154,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE REACHS APPROXIMATELY 40 MPH IT  STUTTERS. WHEN THE PROBLEM OCCURS I TAKEMY FOOT OFF THE ACCELERATOR AND THEN PUTTING YOUR FOOT BACK ON THIS FIXES THE PROBLEM. IF I PUSH THROUGH 40 MPH THEN I DO NOT GET THE STUTTER. I HAVE TAKING THE CAR IN TO HYUNDAI AND THEY FIXED THE BALL JOINT ON THE DRIVERS FRONT WHEEL, THEY SAID THIS WILL FIX THE PROBLEM; BUT HAS NOT FIXED IT. I WENT BACK UP TO HYUNDAI AND NOW THEY SAY THEY DON'T KNOW WHAT IT COULD BE. ANYTHING FROM TRANSMISSION FLUSH TO THE BALANCE OF THE WHEELS.*AK",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/13/2005",
        "dateOfIncident": "04/11/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117799,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE TENDED TO GO INTO NEUTRAL AT RANDOM TIMES WHILE BEING DRIVEN, AND DID NOT ACCELERATE. CONSUMER TOOK VEHICLE TO DEALER FOR  TESTING, AND TO REPLACE THE TRANSMISSION, BUT THE PROBLEM RECURRED.*AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/03/2005",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112457,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT FADES VERY BADLY ON THIS VEHICLE, DEPRECIATES THE VALUE OF THE VEHICLE TREMENDOUSLY.  ALSO THE DRIVER SEAT DOES NOT CLICK IN PLACE, IT MOVES AROUND A SMALL AMOUNT. *JB",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/05/2005",
        "dateOfIncident": "02/04/2005",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109900,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DEC 04, JAN 05 AND FEB 05, MY 2001 HYUNDAI SANTA FE V-6, EXPERIENCED ARCING OF SPARK PLUG WIRES, REQUIRING THE WIRES TO BE REPLACED  BY DEALER 3 SEPARATE TIMES.  *JB",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/17/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103992,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LATCH ON MY LEFT BACK PASSENGER DOOR IS LOOSE.  IT LOOKS AS IF THE DOOR IS NOT CLOSED ALL THE WAY.  THE SCREWS THAT HOLD THE LATCH IN PLACE INSIDE THE CAR IS LOOSE.  I HAVE HAD TO TIGHTEN IT WITH A SCREW DRIVER SEVERAL TIMES.  I HAVE CHILDREN RIDING IN THE BACK SEAT OF MY CAR AND IF THAT LATCH EVER CAME TOTALLY OFF IT WOULD BE DISASTROUS. *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/11/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098688,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS  VEHICLE IS AN \"ALL WHEEL DRIVE\".  THE VEHICLE'S TRANSMISSION UNEVENLY DISTRIBUTES POWER AT AROUND 35-40 MPH - CAUSING THE VEHICLE TO PULL DANGEROUSLY TO THE RIGHT.  THIS \"JERK\" OF POWER TO THE RIGHT OCCASIONALLY CAUSES ME TO ALMOST SWERVE OUT OF MY LANE OF TRAFFIC!! *JB",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/19/2004",
        "dateOfIncident": "07/20/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097188,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 35 MPH,  THE VEHICLE JERKED AND VIBRATED UNCONTROLLABLY.  THE CONSUMER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE AND DROVE IT TO THE DEALER FOR INSPECTION.   THE MECHANIC INFORMED THE DRIVER THAT THE CATALYTIC  CONVERTER NEEDED TO BE REPLACED.   PLEASE PROVIDE FURTHER DETAILS. *JB",
        "vin": "KM85C83V01U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/04/2004",
        "dateOfIncident": "07/05/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094932,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED AT ANY SPEED WHILE DRIVING. INTERMITTENTLY  VEHICLE WOULD RESTART. VEHICLE WAS TOWED TO THE DEALER ON TWO SEPARATE OCCASIONS, BUT PROBLEM RECURRED.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "05/03/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072040,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 25 MPH, THE CONSUMER HEARD A SCREECHING SOUND THAT WAS FOLLOWED BY A LOUD BUMPING NOISE.  THE VEHICLE SOON STALLED AND WOULD NOT RESTART.  THE DEALER EXAMINED THE VEHICLE AND DETERMINED THAT THE FOUR WHEEL DRIVE TRANSFER CASE NEEDED REPLACEMENT.   *AK   THE BALL JOINT AND THE FRONT WHEEL BEARING WAS REPLACED.   *SC   *JB",
        "vin": "KM8SC83D51U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2004",
        "dateOfIncident": "07/23/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082943,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINED OF CLUTCH NOT BEING RIGHT 10-3-01 15000 MILES, NO PROBLEM FOUND, ALWAYS FELT WRONG, CLUTCH/PRESSURE PLATE/FLYWHEEL IN PIECES NOW AT 64000 NOTHING COVERED UNDER \"AMERICA'S BEST WARRANTY\" CAR ONLY 3 YRS OLD. WAS TOLD FLYWHEEL COST IS $1114. + $975 +TAX TO REPAIR AT DEALER BUT DIDN'T TRUST SALES PITCH SEVICE REP WAS GIVING ABOUT FLYWHEEL NOT BEING ABLE TO BE RESURFACED BEFORE CAR WAS EVEN LOOKED AT ONLY CAN BE REPLACED. DECIDED TO HAVE CAR FIXED ELSEWHERE FOR A COST OF APPROX. $2000. *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/16/2004",
        "dateOfIncident": "07/08/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082152,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL BEARINGS ON THE FRONT WHEELS WERE STRIPPED. THIS PROBLEM OCCURRED EVERY 6 MONTHS. CONSUMER TOOK THE VEHICLE TO DEALER FOR REPAIRS ON 3 OCCASIONS, AND JUST RECENTLY RECURRED.  *AK",
        "vin": "KM8SB82BX1U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2004",
        "dateOfIncident": "04/27/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072268,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING VEHICLE INSPECTION  DEALERSHIP INFORMED THE CONSUMER THAT  THE FRONT PASSENGER AXLE SNAPPED AND OIL LEAK ONTO THE ALTERNATOR.  *AK   *SC  *JB",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074086,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE  SUDDENLY LOST POWER AND IDLED.  DEALERSHIP SERVICED VEHICLE 5 TIMES AND REPLACED  IGNITION COIL, MASS AIR FLOW SENSOR,  AND 2 OTHER COMPONENTS.  BUT THE FAILURE STILL RECURRED.  ALSO,  VEHICLE WAS SERVICED 3 TIMES FOR BRAKE FAILURE.  BRAKE PADS AND ROTORS WERE REPLACED TWICE. BUT GRINDING CONTINUED.  *AK",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/08/2004",
        "dateOfIncident": "06/12/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068491,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 12TH THE VEHICLE STARTED TO RATTLE AND PROCEEDED TO SHAKE.  THE VEHICLE WOULD NOT ACCELERATE BUT INSTEAD DECELERATED ON 695 TOWARDS TOWSON.  THE VEHICLE WAS DRIFTING AT 25 MPH.  I THEN PROCEEDED TO THE NEAREST EXIT WHICH WAS BEL AIR ROAD.  I PROCEEDED ONTO THIS EXIT WHEN MY VEHICLE SHUT OFF LOSING ALL POWER.  AT THIS TIME MY DASHBOARD LIGHTS WERE ON.  I HAD NO POWER BUT MY VEHICLE WAS STILL IN GEAR AND I SAFELY STOPPED MY VEHICLE IN A SHOPPING PLAZA.      ENGINE FAILURE    NEW ENGINE PLACED INTO MY VEHICLE.  *AK    JULY 5TH THE VEHICLE WAS TAKEN BACK TO THOMPSON HYUNDAI BY MY FATHER.  THE MILEAGE OUT WAS 25,593.      THOMPSON HYUNDAI FORGOT TO SCREW DOWN THE ENGINE PROPERLY RESULTING IN LOUD NOISES FROM THE ENGINE.  I PLACED ANOTHER CALL TO THOMPSON ASKING FOR DOCUMENTATION OF THE SERVICE RENDERED.  I THEN NOTICED ANOTHER SCREW WHICH WAS NOT SECURE ON THE ENGINE. IN ADDITION, I WOULD BE BRINGING THE VEHICLE BACK TO GET THE DOCUMENTATION AND TO GET THE STEERING CHECKED. THOMPSON NEVER WROTE UP A SERVICE SLIP FOR THE SCREWS.      JULY 8TH THE VEHICLE BROKE DOWN. THE VEHICLE WAS TOWED INTO THOMPSON AGAIN.  I PLACED A CALL TO THOMPSON AND SPOKE WITH GARY WELCH.  GARY STATES \u001cTHERE IS NOTHING WRONG WITH THE VEHICLE.\u001d  WE CAN\u0019T FIND ANYTHING WRONG WITH YOU VEHICLE.     HYUNDAI REPRESENTATIVE PAID MY VEHICLE PAYMENT FOR THE MONTH MY CAR WAS IN SERVICE.*AK",
        "vin": "KM8SB82B31U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/08/2004",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068495,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 12TH THE VEHICLE STARTED TO RATTLE AND PROCEEDED TO SHAKE. THE VEHICLE WOULD NOT ACCELERATE BUT INSTEAD DECELERATED ON 695 TOWARDS TOWSON. THE VEHICLE WAS DRIFTING AT 25 MPH. I THEN PROCEEDED TO THE NEAREST EXIT WHICH WAS BEL AIR ROAD. I PROCEEDED ONTO THIS EXIT WHEN MY VEHICLE SHUT OFF LOSING ALL POWER. AT THIS TIME MY DASHBOARD LIGHTS WERE ON. I HAD NO POWER BUT MY VEHICLE WAS STILL IN GEAR AND I SAFELY STOPPED MY VEHICLE IN A SHOPPING PLAZA.     ENGINE FAILURE   NEW ENGINE PLACED INTO MY VEHICLE   JULY 5TH THE VEHICLE WAS TAKEN BACK TO THOMPSON HYUNDAI BY MY FATHER. THE MILEAGE OUT WAS 25,593. THOMPSON HYUNDAI FORGOT TO SCREW DOWN THE ENGINE PROPERLY RESULTING IN LOUD NOISES FROM THE ENGINE. I PLACED ANOTHER CALL TO THOMPSON ASKING FOR DOCUMENTATION OF THE SERVICE RENDERED. I THEN NOTICED ANOTHER SCREW WHICH WAS NOT SECURE ON THE ENGINE. IN ADDITION, I WOULD BE BRINGING THE VEHICLE BACK TO GET THE DOCUMENTATION AND TO GET THE STEERING CHECKED. THOMPSON NEVER WROTE UP A SERVICE SLIP FOR THE SCREWS. JULY 8TH THE VEHICLE BROKE DOWN. THE VEHICLE WAS TOWED INTO THOMPSON AGAIN. I PLACED A CALL TO THOMPSON AND SPOKE WITH GARY WELCH. GARY STATES \u001cTHERE IS NOTHING WRONG WITH THE VEHICLE.\u001d WE CAN\u0019T FIND ANYTHING WRONG WITH YOU VEHICLE. HYUNDAI REPRESENTATIVE PAID MY VEHICLE PAYMENT FOR THE MONTH MY CAR WAS IN SERVICE.     APRIL 1, 2004 THE VEHICLE WAS TOWED IN AFTER STOPPING ON 695 TOWARD ESSEX 2 MILES BEFORE THE 95 NORTH EXIT TO NEW YORK IN THE LEFT HAND LANE.  THE VEHICLE JERKED AND PROCEEDED TO SLOW AT A RAPID SPEED.     WARRANTY CLAIM SUBMITTED.  *AK",
        "vin": "KM8SB82B31U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/05/2004",
        "dateOfIncident": "02/02/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060537,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING BELT REPLACED IN SEPT. 2003 UNDER WARRANTY.  I PAID FOR 3 DAYS RENTAL VEHICLE DURING THIS SERVICE.  TIMING BELT DISCOVERED TO BE DEFECTIVE IN FEBRUARY 2004, AND WAS REPLACED AGAIN UNDER WARRANTY, BUT HYUNDAI REFUSES TO PAY FOR THE 2 DAYS RENTAL CAR, CLAIMING THIS IS A WARRANTY ITEM AND (NO MATTER HOW MANY TIMES THEY REPLACE A DEFECTIVE PART), THEY WILL NOT COVERR A RENTAL.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2004",
        "dateOfIncident": "02/07/2004",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060169,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL DOWNSHIFT TO THIRD GEAR AT HIGH SPEEDS CAUSING VEHICLE TO JERK AND SWERVE.  DEALER CHECKED CPU AND SHOWED NO FAULTS.  SENT BACK TO HUYNDI FOR CHECK UP.  SAID THE PROBLEM WAS IN A SPEED SENSOR.  VERY CONCERNED ABOUT DAMAGE TO TRANSMISION AFTER THE PROBLEM IS SOLVED.  WILL TRADE IN ASAP.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2004",
        "dateOfIncident": "06/05/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058608,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE SAME PROBLEM WITH THE ELECTRICAL SYSTEM LIGHTS DIMMING WIPERS GOING SLOW RADIO GOING OFF ALSO WHEN I WENT THROUGH A PUDDLE IN THE RAIN SOMETHING GOT WET IN THE ENGINE AND STARTED TO SMELL .I WENT TO HYUNDAI IN MANHATTAN AND THEY FIXED THE PROBLEM. SO FAR SO GOOD KEEPING MY FINGERS CROSSED.*AK",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/14/2004",
        "dateOfIncident": "11/15/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053997,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AND UNDER ANY BRAKING CONDITIONS WHEN DEPRESSING THE BRAKES  BRAKE PEDAL IS DELAYED, RESULTING IN EXTENED STOPPING DISTANCE.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/12/2003",
        "dateOfIncident": "12/05/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049641,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING BELT FAILURE, CAUSING ENGINE TO SEIZE AND DAMAGED ENGINE.*AK",
        "vin": "KM8SB82B11U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2003",
        "dateOfIncident": "08/10/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047220,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A MEDICAL PERSONNEL AND WORK NIGHT HOURS. I OWN A HYUNDAI SANTA FE 2001 AND HAVE ELECTRICAL PROBLEMS. THE CAR RUNNING BUT AT STOP CANNOT HANDLE HEADLIGHTS, HEATER, RADIO AND INTERNAL LIGHTS, WHICH IS A PROBLEM IF I WERE EVER STUCK.  IT HAS HAPPENED IN SUMMER AND WINTER AND CAN BE DANGEROUS IF I'M STRANDED.  I HAVE BROUGHT THIS VEHICLE TO 2 DIFFERENT HYUNDAI DEALERS AND THERE ARE NO PROBLEMS FOUND, YET I BROUGHT MY VEHICLE TO PEP BOYS AND SEARS AND THEY SAID MY BATTERY WAS FAILING.  I REPLACED BATTERY AT SEAR'S 3 MONTHS AGO AND LIGHTS ARE STARTING TO DIM AGAIN.  THE RESPONSE FROM HYUNDAI SERVICE DEPARTMENT WAS TO TURN OFF HEADLIGHTS?  ISN'T THAT DANGEROUS?   *LA",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/18/2003",
        "dateOfIncident": "11/01/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047128,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT LOWER BALL JOINTS STARTED TO FAIL AFTER 42,000 MILES.  *LA",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/13/2003",
        "dateOfIncident": "10/03/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046838,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NOISE IN FRONT SUSPENSION. WE HAVE GONE 3 TIME IN LESS THAN A YEAR FOR SERVICE AND THE NOISE KEEP COMING BACK . THEY CHANGE MANY PARTS BUT THEY HAVE NOT FIX THE PROBLEM. WE DO NOT FEEL SAFE ANY MOORE IN THE CAR.  I HAVE CALL DIFFERENT PLACES BUT ALL THEY TELL ME TAKE IT BACK FOR REPAIRS, HOW MANY TIMES DO I HAVE TO TAKE IT BACK?  OR THEY ARE JUST WAITING FOR US TO HAVE AN ACCIDENT TO DO SOMETHING.  I NEED HELP.  THANK YOU.  *LA",
        "vin": "KM8SB82B61U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/08/2003",
        "dateOfIncident": "10/03/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045731,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALTERNATOR/BATTERY PROBLEMS: LIGHTS DIM, WINDSHIELD WIPER DELAY CHANGES SPEED, ELECTRIC WINDOWS SLOW AT TIMES.*AK",
        "vin": "KM8SB82B01U"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/08/2003",
        "dateOfIncident": "06/28/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045735,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE RATTLES AND SHAKES WHEN DRIVING IN CITY.  NOISE APPEARS TO COME UNDER THE CARRIAGE.  TAKEN SEVERAL TIMES TO THE DEALER AND THEY ARE UNABLE TO LOCATE THE SOURCE OF THE PROBLEM.  HAVE A WRITTEN COMPLAIN WITH HYUNDAI.*AK",
        "vin": "KM8SB82B01U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2003",
        "dateOfIncident": "04/08/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043473,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON GOING PROBLEMS WITH MY HYUNDAI SANTA FE.  I HAVE HAD TO TAKE MY CAR BACK 16 DIFFERENT TIMES, 7 TIMES SINCE THE FLORIDA LEMON LAW EXPIRED. EACH PROBLEM HAS BEEN REPAIRED UNDER WARRANTY, BUT WITH THE ONGOING PROBLEMS I ASKED HYUNDAI TO COMPENSATE ME. I WAS TOLD THE LEMON LAW HAS EXPIRED AND THEY WILL DO NOTHING TO HELP.  *LA",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2003",
        "dateOfIncident": "10/14/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043913,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ABOUT 55 MPH ON THE HIGHWAY AND WITHOUT WARNING VEHICLE WOULD STALL AND SHUT DOWN, AND WOULD NOT RESTART.   THE SUV WAS TOWED TO THE DEALERSHIP FOR ANALYSIS. DRIVER PICKED UP THE TRUCK FROM THE DEALER THAT DAY, BUT WITHOUT WARNING THE SUV SHUT DOWN ON THE WAY HOME.  *AK",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2003",
        "dateOfIncident": "10/05/2020",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041406,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST MONTH, CAR HAS PROBLEMS STARTING.  USUALLY, IT DOES NOT START FOR THE FIRST TIME OR IT HAS A SLOW START.  IN ADDITION, THERE'S AN OCCURRENCE THAT IT DID NOT START AT ALL, WHICH HAD TO BE TOWED TO THE DEALER WHERE IN THEY REPROGRAMMED THE MODULE.  WILL WAIT AND CHECK IF THIS FIXES THE PROBLEM BECAUSE THE CAR STARTS SLOWLY THAT MORNING.  *LA",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/15/2003",
        "dateOfIncident": "09/15/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038911,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST MANIFOLD CRACKED ABOUT 6 INCHES RIGHT DOWN THE MIDDLE.  DISCOVERED WHEN CAR HAD ABOUT 42,000 MILES.  ORIGINAL OWNER.  I BELIEVE THIS COULD POTENTIALLY BE A FIRE HAZARD.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2003",
        "dateOfIncident": "09/04/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037455,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKE A LOOK AT WHERE THE OIL FILTER IS AT ON THE 2001 HYUNDAI SANTE FE'S.  THE OIL FILTERS ARE VERY WEAK AND CAN BUST EASILY.  ALL IT TAKES IS A BIG ROCK OR ANY FOREIGN OBJECT TO HIT IT ON THE ROAD AND ALL YOUR OIL IS OUT.  THE FILTERS ARE RIGHT IN THE FRONT AND ARE OPEN TO ANY OBJECTS.*AK",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/20/2003",
        "dateOfIncident": "05/10/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033173,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE APPROX. 90,000 MILES ON OUR SANTA FE AND HAVE HAD A/C TROUBLE OFF AND ON THE PAST YEAR.  WE HAVE SPENT OVER $2000.00 WHILE THE DEALERSHIP AND A PRIVATELY OWNED A/C SHOP REPLACED VARIOUS PARTS.  I AM AWAITING A RESPONSE FROM HYUNDAI AS TO WHAT THEY WILL DO TO RESOLVE THIS SITUATION.  WE HAVE ALSO HAD THE STRAP ON THE BACK SEAT BREAK, THE PAINT IS PEALING OFF AT THE BOTTOM OF THE VEHICLE, THE LIGHTS/RADIO/AIR CONDITION ALL DIM WHEN VEHICLE STOPS OR HITS A BUMP IN THE ROAD.*AK",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/29/2003",
        "dateOfIncident": "05/26/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021858,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT LOW SPEED AND WITHOUT WARNING  VEHICLE WILL SHUT OFF DUE TO DEFECTIVE TIMING BELT. THIS CAUSED CONSUMER TO PULL OVER. DEALER NOTIFIED.*AK",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/27/2003",
        "dateOfIncident": "05/26/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020604,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GOOD MORNING,  I AM WRITING TO YOU TO LET YOU KNOW ABOUT MY DISSATISFACTION WITH HYUNDAI MOTORS.  I HAVE CONTACTED HYUNDAI MANY TIMES SEEKING SATISFACTORY RESOLUTION TO MY COMPLAINT ON MY 2001 SANTA FE. THE SANTA FE WAS SOLD TO ME ADVERTISING 181 HORSEPOWER. THIS HOWEVER, IS NOT TRUE, AND I AM STILL WAITING TO HEAR FROM THEM.  I HAVE OFFERED HYUNDAI MANY SOLUTIONS THAT I CONSIDER SATISFACTORY TO MYSELF, AND AT THE SAME TIME MAINTAINING MY RELATIONSHIP WITH THEM.  I AM VERY UNHAPPY WITH THE WAY HYUNDAI IS HANDLING THE VALID COMPLAINTS FROM PEOPLE WHO, IN GOOD FAITH, PURCHASED A VEHICLE THAT IS NOT WHAT IT WAS ADVERTISED TO BE. I AM VERY UPSET WITH THE MANNER IN WHICH THIS MATTER IS BEING IGNORED.   HYUNDAI DID HOWEVER, SET THEIR OWN DEADLINE OF SEPT 2003 FOR CLOSURE TO ALL AFFECTED BY THIS FALSE ADVERTISEMENT. THIS LEADS ME TO WONDER IF THEY ARE PURPOSELY DRAGGING THEIR FEET TO FORCE OWNERS OF THESE AFFECTED VEHICLES IN TO RESOLUTION THAT MIGHT NOT OTHERWISE BE ACCEPTABLE.   THE VEHICLE IS NOT WHAT I PAID FOR AND THE LACK OF CONCERN FROM HYUNDAI IS VERY UNSETTLING TO ME. WE ARE TALKING ABOUT ALMOST 10 PERCENT LESS HP THAN ADVERTISED. THE AFFECT IT COULD HAVE ON THE SAFETY AND OVERALL PERFORMANCE OF THE VEHICLE IS SCARY. THE VEHICLE HAS A CERTAIN TOWING CAPACITY AND TORQUE. THIS ALSO HAS TO BE AFFECTED BY THIS. YOUR ASSISTANCE IS GREATLY APPRECIATED.  THANK YOU FOR YOUR TIME AND ATTENTION.   HAVE A GREAT DAY.   SINCERELY,   STEVE COOPER       26MAY03   *TT",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/21/2003",
        "dateOfIncident": "09/27/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020369,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NAR 05/21/2003  *MR   WITH OUT NOTIFICATION THE CONSUMERS PURCHASED THE VEHICLE  BRANDED AS A LEMON. PROBLEMS OCCURRED WITH THE TRANSMISSION, AIR CONDITIONER COMPRESSOR, HEADLIGHT DIMMERS, AND ELECTRICAL SYSTEM WAS FAULTY.  THEY'RE REQUESTING THE DEALERSHIP TO BUY BACK THE VEHICLE.     *CB",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/03/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013938,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE STUCK ON VEHICLE IN A FAST IDLE POSITION.  CONTROL OF VEHICLE WAS MAINTAINED BY USE OF FOOT BRAKE.  VEHICLE HAD 23020 MILES AND IS A GLS WITH ALL WHEEL DRIVE, DATE OF MANUFACTURE WAS 13 JAN 01.  NO INJURIES, NO PROPERTY DAMAGE.  DEALER REPLACED CRUISE CONTROL CABLE AND STATED THAT THE CAUSE WAS THAT THE CABLE WAS MISROUTED.  ACCORDING TO DEALER THE CABLE SHOULD NOT HAVE BEEN ROUTED THROUGH A METAL CLIP AT RIGHT REAR OF SURGE TANK/INTAKE MANIFOLD.  THIS CLIP IS ADJACENT TO THE CLIP USED TO SECURE THE GAS PEDAL CABLE.  THE REPLACEMENT CABLE APPEARS TO BE SHORTER THAN THE ORIGINAL CABLE AS IT IS NOT LONG ENOUGH TO BE PLACED IN THE METAL CLIP.  THE REPLACEMENT CABLE USED WAS PART #96430-26110 AND HAS A YELLOW LABEL WITH \"TO2\" ON IT.",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/03/2002",
        "dateOfIncident": "11/03/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769240,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS STALLED TWICE WHILE DRIVING UP TO SPEEDS OF 60 MPH.  THERE IS NO POWER, NO GAS, NOTHING.  THE SECOND TIME IT STALLED I WAS IN THE CALDECOTT TUNNEL, HIGHWAY 24, BERKELEY CA. DRIVING AT A SPEED OF 60 MPH.  THERE IS NO PLACE TO PULL OVER FOR SAFETY.  THANKFULLY THE TUNNEL IS ON A DOWNHILL SLOPE, AND I WAS ABLE TO COAST OUT OF THE TUNNEL AND PULL OVER TO THE SIDE OF THE ROAD.  THE TUNNEL IS AN EXTREMELY DANGEROUS PLACE FOR ENGINE FAILURE.  THE FIRST TIME I EXPERIENCED ENGINE FAILURE WAS ON A TWO LANE ROAD OUTSIDE OF ANTIOCH, CA.  AT NIGHT  DRIVING BY MYSELF.  IT IS AN TERRIFYING FEELING TO BE DRIVING AT SPEEDS OF 55-60 MPH AND HAVE THE VEHICLE SHUT OFF COMPLETELY.  THERE IS NO WARNING.  I HAVE TAKEN THIS VEHICLE IN SEVERAL TIMES FOR SERVICE, WHINING TIMING CHAIN, SEVERAL TIMES, AND EACH TIME THE VEHICLE WAS NOT REPAIRED.  NOW WITH THE ENGINE STALL PROBLEMS I AM VERY AFRAID THAT I OR OTHERS DRIVING WITH ME AS WELL AS OTHER VEHICLES ON THE ROAD MAY INJURED OR WORSE KILLED DUE TO THIS MAJOR DEFECT IN THIS CAR.  I BABYSIT MY GRANDCHILDREN ON A REGULAR BASIS AND FEAR FOR THEIR SAFETY AS WELL.  I TRIED CONTACTING HYUNDAI AT THEIR 1800 NUMBER AND THERE WAS NO EXTENSION AVAILABLE TO SPEAK TO SOMEONE IN ORDER TO FILE A CLAIM.  ALSO AFTER WAITING 20 MINUTES TO GET THROUGH IT SENT ME TO VOICE MAIL.  THE CAR IS NOW AT HYUNDAI IN CONCORD, CALIFORNIA WAITING FOR SERVICE.  I WAS WITHOUT A CAR FOR ONE WEEK THE FIRST TIME IT WAS SUPPOSEDLY REPAIRED AFTER THE FIRST STALL.  BESIDES BEING FEARFUL OF MY SAFETY AND THE SAFETY OF OTHERS I WILL NOW HAVE TO GO WITHOUT A VEHICLE AGAIN FOR A LENGTH OF TIME.  DT",
        "vin": "KM8SB82B51U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/14/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768451,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DASH BRAKE AND ALTERNATOR LIGHTS COME ON WHEN VEHICLE SPLASHES THROUGH WATER PUDDLES.  ON ALL OCCASIONS I ALSO LOSE POWER STEERING CONSTROL.  THE DEALER'S RESPONSE TO THE PROBLEM REPORTED IS SIMPLY NOT TO SPLASH WATER WHILE GOING OVER PUDDLES.  THIS IS VERY DIFFICULT TO DO DURING THUNDER STORMS FOR WHICH TAMPA BAY IS WELL KNOWN.  WATER IS OBVIOUSLY GETTING INTO THE ALTERNATOR AND WETTING THE POWER STEERING SYSTEM.  ON ONE OCCASION I LOST POWER STEERING AS I WAS NEGOTIATING A RIGHT TURN.  VERY DANGEROUS SITUATION.   MR",
        "vin": "KM8SC83D11U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/05/2002",
        "dateOfIncident": "08/29/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766731,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED AFTER STARTING AND WOULD NOT RESTART.  ENGINE CHECK BY DEALERSHIP REVEALED WATERLOGGED AIR FILTER AND NON-OIL LIQUID IN THE OIL RESEVOIR.  DEALERSHIP CONCLUDES ENGINE FLOODED WITH WATER (IT WASN'T); OTHER (NON-DEALERSHIP) EXPERT MECHANICS SUSPECT CRACKED CYLINDER LINER.*AK",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2002",
        "dateOfIncident": "12/05/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766624,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HYUNDAI WILL NOT REPLACE ALTERNATOR WITH HIGHER OUTPUT.  *AK",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2002",
        "dateOfIncident": "11/17/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766631,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR \"MISSES\" SO BADLY IT WILL NOT ACCELERATE.  IN ADDITION, IT PERIODICALLY DIES WHILE IDLING.  THIS VEHICLE HAS HAD NUMEROUS ELECTRICAL ISSUES.  HYUNDAI HAS REPLACED THE ALTERNATOR AND THE BATTERY WITH HIGHER OUTPUT EQUIPMENT AND THE PROBLEMS HAVE WORSENED.*AK",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/01/2002",
        "dateOfIncident": "08/25/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766547,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD NOT START WHEN LEAVING FROM DEALERSHIP AFTER PURCHASING, CAUSE ACCORDING TO DEALER WAS DEFECTIVE BATTERY. BATTERY WAS REPLACED. ELEVEN MONTHS LATER I EXPERIENCED ENGINE HAD SLOW CRANKING TO START AND LIGHTS DIMMED WHEN AIR COMPRESSOR ENGAGED AND THE CAR WAS AT LOW RPM\u0012S. RADIO THEN TURNED OFF LIGHTS WENT OUT, AND VEHICLE ALMOST STALLED. TURNED OFF AIR, RADIO AND LIGHTS (LUCKILY IT WAS SUNDOWN NOT DARK YET) AND PROCEEDED HOME. CONTACTED DEALERSHIP AND ONCE AGAIN PROBLEM WAS ATTRIBUTED TO DEFECTIVE BATTERY. BATTERY WAS REPLACED. IT SHOULD BE NOTED THAT HYUNDAI HAD INCREASED THE OUTPUT OF THE ALTERNATOR IN THE NEWER SANTA FE MODELS TO 110AMP OUTPUT. IT WOULD SEEM THAT THEY HAVE NOTED THE INADEQUATE OUTPUT OF THE EARLIER ALTERNATOR. I WOULD THINK THIS WOULD WARRANT AN INVESTIGATION INTO THE RETROFITTING OF EARLIER VEHICLES TO THE HIGHER OUTPUT ALTERNATOR. ALSO DISCUSSIONS WITH OTHER SANTA FE OWNERS THAT HAVE THIS MAKE AND MODEL HAVE IN SOME INSTANCES OBTAINED A REPLACEMENT FOR THE UPGRADED ALTERNATOR THROUGH WARRANTY.*AK",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2002",
        "dateOfIncident": "08/16/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766496,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY CHARGE INDICATOR SHOWED A LONG TERM \"LOW\" CHARGE LEVEL, AND DURING VERY HOT WEATHER, BATTERY FAILED TO START VEHICLE DUE TO ALTERNATOR NOT KEEPING BATTERY CHARGED UP PROPERLY.*AK",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2002",
        "dateOfIncident": "08/01/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766296,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OCCASIONALY AS I DRIVE AT NIGHT THE HEADLIGHTS WILL DIM, CLOCK WILL FLASH, AND THE WINDSHIELD WIPERS WILL SLOW DOWN BECAUSE THE ALERNATOR WILL NOT CHARGE THE BATTERY.  OCCASIONALY WHEN I STOP AND TURN THE CAR OFF I WILL COME BACK OUT TO RESTART THE CAR AND IT WILL NOT START BECAUSE OF THE BATTERY BEING DEAD AND NOT BEING CHARGED BY THE ALTERNATOR.  I HAVE ALREADY HAD THE BATTERY AND ALTERNATOR REPLACED ONCE ON 7/26/02 AND IT IS STARTING TO DO THE SAME THING AGAIN.  I AM IN CONTACT WITH SEVERAL OTHER SANTA FE OWNERS AT WWW.SANTAFEFORUM.NET AND ALOT OF THEM ARE HAVING THE SAME PROBLEM.",
        "vin": "KM8SB82B01U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2002",
        "dateOfIncident": "08/12/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766315,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WILL LIKE THIS RESOLVED BY HYUNDAY AMERICA AS SOON AS POSSIBLE. NO SAFETY DEFEC TLISTED.  *AK",
        "vin": "KM8SC83D21U"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766199,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SPPEDOMETER OUT BY 7.75%  , O2 WAS A RECALL NEVER CONTACTED BY MFG HYUNDAI REPLACING WHEN OWNERS STOP IN FOR SERVICE, ALSO OWNERS ON SANTA FE FORUM HAVING ALTERNATOR PROBLEMS NUMEROUS ALTERNATORS BEING REPLACED (ECU REPROGRAMMING)ON CASE BY CASE BASIS?",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2002",
        "dateOfIncident": "06/01/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766231,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE FIRST DAY WE PICKED UP THE VEHICLE (6-01-01) THE KEYS STUCK IN THE IGNITION & WE WERE NOT ABLE TO GET THEM OUT WITHOUT JIGGLING THE GEARSHIFT.  THE VEHICLE WAS TAKEN INTO PATTERSON'S SERVICE DEPARTMENT ON 10-25-01, 3-1-02, 7-5-02, & 8-7-02, BUT THE PROBLEM WAS NEVER REPAIRED.  ON THE LAST OCCASION THE SERVICE DEPARTMENT CAUSED AN EVEN GREATER PROBLEM TO OCCUR.  EVIDENTLY THEY HAVE DISCONNECTED THE SAFETY MECHANISM WHICH KEEPS ONE FROM REMOVING THE KEY FROM THE IGNITION IN ALL GEARS EXCEPT PARK.  NOW WE CAN TURN OFF THE VEHICLE AND REMOVE THE KEYS FROM THE IGNITION IN ANY GEAR.  WHEN WE DROVE THE VEHICLE INTO OUR GARAGE THIS PAST FRIDAY, AUGUST 23RD, WE PUT THE GEARSHIFT INTO WHAT WE THOUGHT WAS PARK (THE SHIFTER WOULD NOT GO ANY FURTHER), TURNED OFF THE VEHICLE, REMOVED THE KEY FROM THE IGNITION AND STARTED GETTING OUT OF THE VEHICLE.  THE VEHICLE STARTED ROLLING OUT OF THE GARAGE.  IT TURNED OUT THE GEARSHIFT WAS IN REVERSE.  THE VEHICLE IS DIFFICULT TO PUT INTO PARK NOW ESPECIALLY IF THE BRAKE PEDAL IS NOT FULLY DEPRESSED PAST THE NORMAL STOPPING TENSION.  THE DEALER IS AWARE OF THE PROBLEM.*AK",
        "vin": "KM8SC83DX1U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/23/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567188,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE HESITATES.  DEALER CHANGED SPARK PLUGS TWICE, OXYGEN SENSOR AND TRANSMISSION COMPUTER.  AFTER REPLACEMENT VEHICLE BEGAN TO OVERHEAT AND STALLED OUT LOSING POWER.  VEHICLE HAS BEEN AT DEALERSHIP 15 TIMES AND THEY ARE STILL NOT ABLE TO FIND THE PROBLEM.  *TT",
        "vin": "KM8SB82B01U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/24/2002",
        "dateOfIncident": "07/24/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764674,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS AND OR FAILS TO ACCELERATE UNEXPECTEDLY.  *AK",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2002",
        "dateOfIncident": "05/01/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764584,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME IT HAPPENED, WE WERE STOPPED AT  LIGHT AND THE RADIO STARTED TO GO OUT AND THE CLOCK LIGHT DIMMED.  WE TOOK IT TO THE LOCAL DEALERSHIP AND THEY REPLACED THE BATTERY (IT SAT ON THE SHIP TOO LONG AND DRAINED THE BATTERY).  ABOUT A MONTH LATER, THE SAME THING HAPPENED AND THEY SAID THAT THE CONNECTIONS TO THE BATTERY WERE CORRODED AND THAT I MUST CLEAN THE CONNECTIONS EVERY 3K MILES...YEAH RIGHT!  ANOTHER MONTH WENT BY AND THE DOME LIGHTS BEGAN FADING, THE CAR WAS VERY SLOW TO TURN OVER, AND THE A.C. WOULD BARELY WORK.  THIS TIME THEY REPLACED THE ALTERNATOR.  FINALLY, THIS WEEKEND, THE STUPID THING WOULDN'T TURN OVER, LEAVING MY WIFE AND 4 MONTH OLD CHILD STRANDED IN 95+ DEGREE TEXAS HEAT.  THE DEALERSHIP HAS LEFT ME A MESSAGE RIGHT AT BUSINESS END TODAY STATING THAT THE \"NEW\" ALTERNATOR IS EXPECTED IN ON WEDNESDAY BUT THAT THEY HAVE \"INTERESTING\" NEWS TO REPORT ON THIS PROBLEM.  I ANXIOUSLY AWAIT TO SEE WHAT THIS MIGHT BE.  IT IS VERY FRUSTRATING TO HAVE OUR ENTIRE LIFE REARRANGED 4 TIMES, ESPECIALLY SINCE THIS IS A NEW VEHICLE.  THE WORST PART IS THAT I LOVE THE WAY THE SANTA FE DRIVES, FEELS, LOOKS.  JUST WISH I DIDN'T HAVE TO USE THE STUPID WARRANTY THIS MUCH.  JUST HOPE THIS IS NOT HAPPENING TO EVERY SANTA FE OWNER AS I KNOW THESE CARS ARE BIG SELLERS!  THANKS FOR THE OPPORTUNITY TO VENT!*AK",
        "vin": "KM8SC83D01U"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/28/2002",
        "dateOfIncident": "06/27/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012982,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CHECK LIGHT STAYS ILLUMINATED ON DASHBOARD..  VEHICLE STALLS OUT EVEN WHEN THE AIR CONDITIONER IS TURNED ON.  ALSO, LATELY THE VEHICLE IS USING ALOT OF GAS  AND IS PULLING.   VEHICLE HAS STARTED TO HESTITATE  WHEN ACCELERATING OR BRAKING. DEALER WAS INFORMED. PLEASE PROVIDE MORE INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/07/2002",
        "dateOfIncident": "01/02/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011271,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AND WITHOUT ANY NOTICE WILL LOSE POWER, AND  CONSUMER CAN NO LONGE ACCELERATE  VEHICLE. CONTACTED DEALER. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/20/2002",
        "dateOfIncident": "05/14/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010174,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUTSIDE OF  DRIVEWAY.  WITHOUT PRIOR WARNING, BRAKE PEDAL WAS STUCK TO THE FLOOR.  CONSUMER WILL FILL IN ADDITIONAL INFORMATION. *AK",
        "vin": "KM8SC83D31U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/13/2002",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009683,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BELT FOR THE POWER STEERING HAS SHREDDED SEVERAL TIMES SINCE  PURCHASE OF VEHICLE. CONTACTED DEALER. *AK",
        "vin": "KM8FB82B71U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/18/2002",
        "dateOfIncident": "07/01/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 760872,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE PROBLEM HAPPENED THE FIRST TIME, THE RADIO STARTED TURNED OFF BY ITSELF.  I WAS IN THE PARKING LOT OF A STORE.  I WENT IN AND DID MY SHOPPING AND THEN WENT TO ANOTHER STORE.  WHEN I GOT DONE AT THE 2ND STORE, THE CAR WOULDN'T START.  I HAD SOMEONE GIVE ME A JUMP START AS THE ROAD SIDE ASSISTANCE WAS GOING TO TAKE 3 HOURS.  I DROVE THE CAR TO THE DEALERSHIP AND DROPPED IT OFF.  THAT WAS A SATURDAY AND THEY WERE ALREADY CLOSED.  BY THE TIME THEY LOOKED AT IT ON MONDAY, THE CAR STARTED.  THE 2ND TIME IT HAPPENED, I WAS ON MY LUNCH BREAK.  THE RADIO STARTED TO GO OFF BY ITSELF AGAIN AND THE INTERIOR LIGHTS BEGAN TO DIM OUT.  I DROVE IT AGAIN TO THE DEALERSHIP SO THEY COULD SEE WHAT IT WAS DOING.  THEY SAID IT WAS THE ALTERNATOR.  THEY REPLACED THE ALTERNATOR AND 5 DAYS LATER IT BEGAN AGAIN.  I WAS STOPPED AT A STOP LIGHT WHEN MY RADIO TURNED OFF AND THE LIGHTS DIMMED OUT AGAIN.  THE CAR WAS WANTING TO STALL OUT AGAIN.  WHEN I TURNED IT OFF, IT WOULDN'T START AGAIN.  THEY REPLACED THE BATTERY.  ANOTHER 5 DAYS LATER, IT HAPPENED AGAIN.  THEY REPLACE THE ALTERNATOR AND THE BATTERY.  IT WAS IN THE SHOP A TOTAL OF 4 TIMES.  THEY SAID THE UPGRADED ALTERNATOR AND THE GEL BATTERY THEY INSTALLED WILL KEEP IT FROM HAPPENING AGAIN, BUT SAID THE TEXAS HEAT  IN AUGUST HAD SOME EFFECT ON IT.  WE WILL SEE WHAT HAPPENS AGAIN IN AUGUST.  SO FAR SO GOOD.  I JUST WANTED TO REPORT IT AND JUST FOUND OUT WHERE TO DO IT.*AK",
        "vin": "KM8SC83D81U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/22/2002",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006226,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING TO A STOP LIGHT VEHICLE WOULD STALL INTERMITTENTLY, UPON RESTART IT WOULD NOT EXCEED 10-15 MPH FOR ABOUT 1 MILE. THEN, IT WOULD NOT SHIFT UNTIL 40 MPH WAS REACHED. VEHICLE WAS TAKEN TO DEALER 6 TIMES, CATALYTIC CONVERTER WAS REPLACED TWICE, DID NOT REMEDY THE PROBLEM. PART OF CRANKSHAFT WAS REPLACED, VEHICLE HAS NOT STALLED SINCE. PLEASE PROVIDE NAME OF PART.*AK",
        "vin": "ADD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564627,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE CUT OFF WHILE THE CONSUMER WAS DRIVING. THE DEALER SAID THERE WAS NOTHING WRONG. *YH",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/27/2002",
        "dateOfIncident": "02/23/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004679,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON INTERSTATE  VEHICLE LOST POWER WITHOUT PRIOR WARNING.   DEALERSHIP IS AWARE OF  PROBLEM. *AK",
        "vin": ""
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758610,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT HAS COME ON AND OFF FOR A PERIOSD OF TWO WEEKS WHEN DEALER CHECKED NOTHING WRONG, AND NOW THE RADIO PAUSES WHILE PLAYING.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564420,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THE VEHICLE HAD ENGINE HESITATION, LOSES POWER, IT ALSO TURNS OFF WHILE RUNNING,AND ON 2 OCCASSIONS THE VEHICLE OVERHEATED, THE VEHICLE WAS TAKEN TO THE SERVICE CENTER AND THEY REPLACED THE SPARK PLUGS, OXYGEN SENSORS, AND THEY SUGGESTED TO CHANGE THE GASOLINE WHICH CURRENTLY HE IS USING. THE VEHICLE STILL HAD THE SAME PROBLEM.   *YD",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564420,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THE VEHICLE HAD ENGINE HESITATION, LOSES POWER, IT ALSO TURNS OFF WHILE RUNNING,AND ON 2 OCCASSIONS THE VEHICLE OVERHEATED, THE VEHICLE WAS TAKEN TO THE SERVICE CENTER AND THEY REPLACED THE SPARK PLUGS, OXYGEN SENSORS, AND THEY SUGGESTED TO CHANGE THE GASOLINE WHICH CURRENTLY HE IS USING. THE VEHICLE STILL HAD THE SAME PROBLEM.   *YD",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564420,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED THAT THE CAR WOULD NOT CHANGE GEARS, INSTEAD IT WOULD STAY IN THIRD GEAR AND THE CAR WOULD NOT RUN, AND WHEN IT DID, IT WOULD RUN VERY SLOWLY, DEALER INFORMED CONSUMER THAT THE TRANSMISSION COMPUTER NEEDED TO BE REPLACED.  *YD",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564420,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED THAT THE CAR WOULD NOT CHANGE GEARS, INSTEAD IT WOULD STAY IN THIRD GEAR AND THE CAR WOULD NOT RUN, AND WHEN IT DID, IT WOULD RUN VERY SLOWLY, DEALER INFORMED CONSUMER THAT THE TRANSMISSION COMPUTER NEEDED TO BE REPLACED.  *YD",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": "01/11/2002",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758143,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR LURCHED (DUE TO TRANSMISSION) OUT INTO THE MIDDLE OF A MAIN ROAD AND LURCHED ALMOST INTO ANOTHER CAR AT A SEPARATE TIME, AND NOW THE SPEEDOMETER DOESN'T WORK. *AK",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2002",
        "dateOfIncident": "11/12/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002002,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OWNER HEARD A CLICKING NOISE FROM UNDER THE HOOD. HAD VEHICLE TOWED. WAS INFORMED BY DEALERSHIP THAT PROBLEM WAS IN TRANSMISSION. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": "KM8SB82B51U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2001",
        "dateOfIncident": "11/13/2001",
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755780,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS MAKING A GRINDING NOISE WHEN I SHIFTED FROM DRIVE TO PARK AND REVERSE. I TOOK IT BACK TO THE DEALERSHIP WHERE I HAD PURCHASED THE CAR THE DAY BEFORE AND WHILE IN PARK AT THE DEALERSHIP THE CAR'S STARTER CAUGHT ON FIRE AND WAS PUT OUT BY THE MECHANIC. NO INJURIES, THANK GOODNESS IT HAPPENED AT THE DEALERSHIP AND A FIRE EXTINQUISHER WAS AVAILABLE!!",
        "vin": "KM8SB82B81U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/05/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755321,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATLELY 50-60 MPH THE CAR HAS A ENGINE MISS. CAR LOSES POWER THAT CAN LAST FOR A SECOND OR MORE.  PROBLEM IS A INTERMITTENT ONE. I HAVE HAD IT TO THE DEALER AT LEAST 5 TIMES. THEY HAVE REPLACED THE COMPUTER AND THE MASS AIR SENSOR BUT THE PROBLEM STILL HAPPENS. IT SEEMS TO HAPPEN MORE WHEN THE TRUCK IS UNDER LOAD IE: GOING UP A HILL, PASSING.  *AK",
        "vin": "KM8S282B41U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/22/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754795,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE ACCELERATES WHILE BRAKING. WHEN PRESSING ON BRAKE PEDAL YOU CAN ACCIDENTLLY PRESS THE ACCELERATOR PEDAL AT THE SAME TIME. THIS HAS HAPPENED A NUMBER OF TIMES SINCE I PURCHASED THIS VEHICLE. THIS CREATES AN EXTREMELY DANGEROUS SITUATION WHEN THIS HAPPENS SINCE YOUR FIRST REFLEX IS TO PRESS HARDER ON THE BRAKE PEDAL, WHICH CAUSES THE VEHICLE TO ACCELERATE MORE. VERY SCARY WHEN THIS HAPPENS, ESPECIALLY WHEN PEDESTRIANS ARE IN FRONT OF THE VEHICLE. IT APPEARS THIS IS CAUSED BY THE POSITION OF THE BRAKE PEDAL IN RELATION TO THE ACCELERATOR PEDAL. I DON'T BELIEVE THIS TO BE AN ISOLATED INCIDENT BUT MORE OF A DESIGN FLAW. AS A MECHANIC FOR 31 YEARS AND DRIVER OF NUMEROUS FOREIGN AND DOMESTIC VEHICLES I HAVE NOT EXPERIENCED ANYTHING QUITE AS UNNERVING. IF ANY ADDITIONAL INFORMATION IS NEEDED PLEASE DO CONTACT ME.  *AK",
        "vin": "KM8SC83D61U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/26/2001",
        "dateOfIncident": "08/23/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753743,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "4 CYL. GL AUTOMATIC , WHEN DRIVING CAR BUCKS-STUTTERS,DOWNSHIFTS HESITATES FOR A FEW SECONDS IN DOING THIS IT CAN CAUSE A BAD ACCIDENT. *AK",
        "vin": "KM8SB82B31U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2001",
        "dateOfIncident": "10/19/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753598,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESTITATES ON ACCELERATION,AND CUTS OFF.  HARNESS, THROTTLE BODY, THROTTLE BODY SENSOR, COMPRESSOR, EGR GASKET, PLUGS, VALVES, ETC., ALL REPLACED.  PROBLEM STILL EXISTS.  MANUFACTURER  AND DEALERSHIP CAN'T FIX PROBLEM.  THEY HAVE HAD NO OTHER COMPLAINTS OF THIS PROBLEM, PER STEVE HICKMAN (MAN. REP) AND DEALERSHIP. AFTER REPLACING HARNESS, STEVE HICKMAN ASSURED ME THAT THE VEHICLE WOULD BE FIXED, THE VEHICLE STILL CUTS OFF AND THE RPM BOUNCES UP AND DOWN WHILE THE TRUCK IS BUCKING AND THEN IT WILL CUT OFF!!   SERIOUS SAFETY HAZARD!!  *AK (DOT NUMBER: HMA010900  TIRESIZE: P225/70-16)",
        "vin": "KM8SB82B11U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/29/2001",
        "dateOfIncident": "07/22/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751357,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR LOCKS ARE ALL ATIVATED TOGETHER. YOU CAN NOT UNLOCK THE DRIVERS DOOR WITHOUT ALL FOUR DOORS AND THE BACK GATE BEING UNLOCKED. I DO NOT KNOW OF ANY CAR THAT A SINGLE DOOR CAN NOT BE UNLOCKED WITHOUT OPENING ALL THE DOORS. I FEEL THIS IS A VERY SERIOUS SAFETY PROBLE. MY WIFE CAN NOT GO TO THE MALL AND EXIT OR ENTER HER TRUCK WITHOUT THE POSSIBLITY OF SOMEONE ENTERNING HER TRUCK USING A DOOR THAT SHE DID NOT WON,T TO UNLOCK. THERE WILL BE INJURY AND POSSIBLE DEATH INVOLVED WITH THIS FACTORY DEFECT. PLEASE ADDRESS THIS COMPLAINT POST-HASTE. THANKS; CHARLES WALSINGHAM. *AK",
        "vin": "KM8SC83D71U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/16/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 894497,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT ANY SPEED AND WITHOUT ANY PRIOR WARNING  STEERING WHEEL LOCKS UP, CAUSING LOSS OF STEERING CAPABILITY. CONSUMER TURNED  VEHICLE OFF AND RESTARTED IT  IN WHICH STEERING WHEEL UNLOCKED.  CONSUMER HAS CONTACTED DEALER.  PLEASE PROVIDE ANY FURTHER DETAILS.*AK",
        "vin": "KM8SB82B61U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2001",
        "dateOfIncident": "08/11/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750292,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GETTING GAS, THE PUMP ALWAYS 'CLICKS OFF' WHEN TANK IS 1.5-2 GALLONS FROM BEING FULL.  THE ONLY WAY TO ENSURE A FULL TANK IS TO CONTINUE PUMPING UNTIL GAS COMES OUT THE TOP OF THE FILLER NECK.  THIS USUALLY MEANS OVERRIDING AS MANY AS 50 PUMP 'CLICK OFFS'.   ON THE EDMUNDS CHAT ROOM I HAVE SEEN OTHER SANTA FE OWNERS COMPLAINING ABOUT THE SAME PROBLEM SO I BELIEVE THIS IS A DESIGN FLAW WITH THE VEHICLE.  BY THE WAY, I HAVE YET TO FIND ANY GAS STATION WHERE THIS DOES NOT OCCUR.  OBVIOUSLY, THIS METHOD OF GETTING A FULL TANK IS NOT DESIRABLE BUT WHAT'S THE POINT OF HAVING A 17 GALLON GAS TANK IF IT WILL ONLY TAKE 15 GALLONS OF GAS?  THANK YOU.*AK",
        "vin": "KM8SC83D41U"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/09/2001",
        "dateOfIncident": "05/01/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748134,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE REACHS APPROXIMATELY 40 MPH, THE VEHICLE \u0013BUCKS, STUTTERS, HESITATES, DOWNSHIFTS\u0014 FOR A FEW SECONDS. WHEN THE PROBLEM OCCURS IT IS LIKE YOU ARE TAKING YOUR FOOT OFF THE ACCELERATOR AND THEN PUTTING YOUR FOOT BACK ON. WE NO LONGER FEEL SAFE IN THE VEHICLE AND IT\u0012S ONLY A MATTER OF TIME BEFORE THE TRANSMISSION BREAKS LEAVING US STRANDED OR EVEN WORSE CAUSING A FATAL ACCIDENT.  \u0013AMERICA\u0012S BEST WARRANTY\u0014 IS A MEANINGLESS SLOGAN WHEN A COMPANY CHOOSES TO DENY THAT THERE IS A SERIOUS AND DANGEROUS DEFECT IN A VEHICLE.*AK",
        "vin": "KM8SB82BX1U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2001",
        "dateOfIncident": "04/28/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 891262,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL HESITATE WHEN IT REACHING SPEED OF 40 MPH, BEFORE SPEED CAN RETURN TO NORMAL. DEALER NOTIFIED, AND UNABLE TO LOCATE  PROBLEM. PROVIDE ANY FURTHER INFORMATION ON THIS MATTER.*AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/11/2001",
        "dateOfIncident": null,
        "fire": true,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 888058,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WOULD NOTICE FUMES ENTERING VEHICLE. TOOK VEHICLE TO DEALERSHIP,  MECHANIC INDICATED THAT A SHORT IN  IGNITION SYSTEM WAS CAUSING PROBLEM. ALSO,  HAD ENTIRE CATALYTIC CONVERTER SYSTEM REPLACED.*AK",
        "vin": "KM8SBB2BZ1U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744528,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROXIMATELY 30 TO 45 MPH, WHETHER ACCELERATING OR SLOWING DOWN, THERE IS A SEVERE \"DOWNSHIFT\"  WHICH JERKS THE TRUCK, IN THE ENGINE AS THOUGH THE ENGINE IS CUTTING OUT BEFORE IT CATCHES UP WITH ITSELF.  I HAVE HAD IT INTO THE DEALERSHIP ON 3 SEPARATE OCCASIONS, AND AM ALWAYS TOLD WHEN I GO TO PICK UP MY TRUCK THAT NOTHING SHOWED UP ON THE DIAGNOSTIC TESTS RUN ON MY VEHICLE AND THAT THEY CANNOT FIGURE OUT WHAT MAY BE CAUSING THE PROBLEM.*AK",
        "vin": "KM8SB82B11U"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/30/2001",
        "dateOfIncident": "03/02/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884700,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE WILL JERK FORWARD , ACCELERATOR PEDAL WHEN DEPRESSED  WILL SLOW DOWN.  AFTER A FEW MINUTES, ACCELERATOR WILL RESPOND AGAIN. DEALER REPLACED TRANSMISSION, DID NOT REMEDY.  CURRENTLY,  DEALER INSISTED IT WAS A SOFTWARE PROBLEM. *AK",
        "vin": "KMBSC83DD1U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/13/2001",
        "dateOfIncident": "12/10/2000",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 882884,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES BRAKING DISTANCE IS NOT WHAT IT SHOULD BE. CONSUMER REARENDED A VEHICLE WHILE GOING ABOUT 10 MPH, HAD APPLIED BRAKES, ABS MADE NOISE, AND VEHICLE CONTINUED TO SLIDE FORWARD. DEALER TOLD CONSUMER SHE JUST NEEDED TO GET USED TO ABS BRAKES. PLEASE ADD ADDITIONAL INFORMATION. *AK",
        "vin": "ADD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/09/2001",
        "dateOfIncident": "01/22/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 882634,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A HESITATION  WHEN ACCELERATING, FEELS AS THOUGH VEHICLE NEEDS A TUNE UP. DEALER CANNOT DETERMINE CAUSE.*AK   *SLC",
        "vin": "KM85P82B614"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2001",
        "dateOfIncident": "03/06/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742087,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR INTAKE IS LOCATED LOW IN ENGINE COMPARTMENT. IN RAINY WEATHER WATER GETS INTO INTAKE AND SHORTS THE MASS AIR SENSOR.*AK",
        "vin": "KM8SB82B51U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/10/2001",
        "dateOfIncident": "01/16/2001",
        "fire": false,
        "manufacturer": "Hyundai Motor America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 740700,
        "products": [
            {
                "manufacturer": "Hyundai Motor America",
                "productMake": "HYUNDAI",
                "productModel": "SANTA FE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN A AUTO ACCIDENT IN WHICH ANOTHER CAR HIT ME IN THE FRONT CENTER OF MY CAR AND THEIR FRONT RIGHT. MY SPEED WAS 40 MILES BEFORE BRAKES APPLIED THEIR SPEED WAS ABOUT 15. MY AIR BAGS DID NOT DEPLOY BUT THEIRS DID. BOTH FIRE AND RESCUE PERSONAL VOICE CONCERN ABOUT THE NON DEPLOYMENT OF AIRBAGS WITH VISUAL DAMAGE TO VEHICLE.*AK",
        "vin": "KM8SC83D41U"
    }
]