[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2015",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10730387,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 JEEP LIBERTY. WHILE DRIVING 20 MPH, THE CONTACT NOTICED WATER ENTERING THE VEHICLE UNDER THE STEERING COLUMN. THE FAILURE WORSENED OVER THE YEARS. WHENEVER IT RAINED, WATER WOULD ENTER THE VEHICLE AND MOLD AND MILDEW ARE PRESENT. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE CAULKING BEHIND THE FIREWALL WAS DESTROYED AND NEEDED TO BE RE-CAULKED BEHIND THE FIREWALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 53,000.",
        "vin": "1J4GL48K92W"
    },
    {
        "components": "TRAILER HITCHES,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/17/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659980,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M FILING  A COMPLAINT AS I HAVE RECEIVED A RECALL NOTICE N46/NHTSA 13V-252 BUT CANNOT GET MY CAR SERVICED.    MY JEEP DEALERSHIP IN TOWN SAYS THEY CAN'T SERVICE THIS RECALL NOTICE IN A TIMELY FASHION AS THEY CAN'T GET THE PARTS FROM CHRYSLER. I HAVE A FACTORY INSTALLED - BY JEEP -TRAILER HITCH. THE HITCH HAS NEVER BEEN USED TO TOW ANYTHING.  \"I CAN BE PUT ON A WAITING LIST AND IT MAY TAKE UP TO A YEAR.\" NICE CUSTOMER SERVICE.  IT WOULD PROBABLY TAKE 5 MINUTES TO DETERMINE THEY NEED TO DO NOTHING! I WILL NEVER BUY ANOTHER JEEP FROM THIS DEALERSHIP AND I'M DUE FOR A NEW ONE!    I THOUGHT YOU SHOULD BE AWARE OF THIS. IN THE UNLIKELY EVENT OF A CRASH, EXPLOSION, AND MY DEATH, MY FAMILY PROBABLY HAS A GOOD CAUSE FOR A SERIOUS LAWSUIT.  *TR",
        "vin": "1J4GL38K05W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2014",
        "dateOfIncident": "08/25/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10620951,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR JEEP IN 2008 AND THE AIR BAG LIGHT WAS ON. SOME TIMES IT COMES ON IMMEDIATELY AFTER STARTING THE VEHICLE, SOMETIMES AFTER DRIVING FOR AWHILE, SOMETIMES NOT AT ALL, LIKE THERE IS A BAD CONNECTION SOMEWHERE. THE CAR LOT SAID THERE WAS A RECALL AND WE NEEDED TO TAKE IT IN FOR THE FREE REPAIR. W WENT TO OUR LOCAL JEEP DEALER, THEY SAID THE RECALL HAD BEEN DONE, AND WHEN THE ADVISER POPPED THE HOOD TO SHOW ME WHAT WAS DONE, HE NOTICED THE WIRE LOOM WAS NOT ON THE WIRE LIKE IT WAS SUPPOSED TO BE. SO HE PUT ONE ON IT. SO AS FAR AS WE KNEW THE ORIGINAL DEALERSHIP THAT SUPPOSEDLY PERFORMED THE REPAIR DID NOT ACTUALLY DO IT AND JUST SAID THEY DID. SO AROUND 7 YEARS WITH NO REPAIR FOR A POSSIBLE WIRE RASH. IN 2012 WE GOT NOTICE THAT ANOTHER AIR BAG RECALL NEEDED TO BE DONE, WHICH TOOK ABOUT A YEAR FOR THEM TO GET PARTS FOR. A DEALER DID THE REPAIR AND CLEARED THE AIR BAG CODE. I ASKED THE DEALER WHAT THE AIR BAG CODE WAS AND WAS TOLD THEY DIDN'T READ IT JUST CLEARED IT. I ASKED WHY THE AIR BAG LIGHT WAS STILL ON AND THEY SAID THEY COULD DIAGNOSE IT FOR $120 AN HOUR. I CONTACTED CHRYSLER ON THIS AND THEY SAID THEY CONTACTED THE DEALER WHO DID THE REPAIR AND THE DEALER TOLD THEM THE AIRBAG LIGHT IS NOT RELATED TO THE RECALL THEY DID. IF THEY DID NOT READ THE CODE, HOW DO THEY KNOW? [XXX] AT CHRYSLER SAYS THAT IF YOU BUY A USED VEHICLE THEN YOU ARE RESPONSIBLE FOR THE REPAIRS NOT CHRYSLER. 6 OTHER JEEPS WHICH HAVE HAD BOTH REPAIRS HAVE HAD THEIR AIRBAGS DEPLOY. IT IS OBVIOUS THAT NEITHER OF THE FIRST TWO FIXES HAVE CORRECTED THE PROBLEM AND JEEPS HAVE MULTIPLE AIR BAG PROBLEMS WHERE THE ENTIRE SYSTEMS NEED TO BE GONE THROUGH AND EACH JEEP MIGHT HAVE DIFFERENT THINGS WRONG. IT IS TIME FOR A THIRD AND FINAL RECALL WHERE EACH JEEP NEEDS TO BE DIAGNOSED THEN REPAIRED INSTEAD OF CHRYSLERS ONE SIZE FITS ALL SOLUTION.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1J4GL48K92W"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/18/2010",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300176,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PUT THE KEY IN THE IGNITION, BUT IT CAN'T TURN, EVEN WHILE FIDDLING WITH THE STEERING WHEEL. IF I THEN TAP ON THE KEY WITH SOMETHING, THEN IT MIGHT TURN. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/15/2008",
        "dateOfIncident": "01/17/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10248880,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CRASH INTO POLE FAILED TO ACTIVATE AIR BAGS. CAR TOTALED. *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/07/2006",
        "dateOfIncident": "08/15/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT RECLINER HANDLE BROKE OFF WHILE MAKING THE NEEDED ADJUSTMENT,  THE OPERATION OF THE RECLINER ON BOTH DRIVER AND PASSENGER IS EXTREMELY HARD. WITH OR WITH OUT A LOAD APPLIED TO THE BACK.  DRIVE SEAT IS NOW RESTRICTED IN MOVEMENT AT A 25 DEGREE ANGLE.  PASSENGER RECLINER WILL ONLY WORK IF YOU ARE OUT SIDE THE JEEP AND ASSIST FROM THE BACK SEAT TO MOVE THE SEAT BACK FORWARDS AND BACKWARDS.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/29/2006",
        "dateOfIncident": "12/27/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10148960,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TO WORK MY BROTHER HAD A HEART ATTACK, CAUSING HIM TO LOSE CONTROL OF  VEHICLE. HE STRUCK A TREE DEAD CENTER  AND THE AIR BAGS FAILED TO DEPLOY. THE FRONT OF HIS VEHICLE WAS PUSHED IN APPROXIMATELY 16 INCHES. PHOTOGRAPHS  AVAILABLE. UNFORTUNATLY MY BROTHER IS NOT. VEHICLE INFORMATION IS AVAILABLE BUT NOT AT THIS MOMENT.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "06/21/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126488,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 JEEP CHEROKEE SPORT.  THE CHECK ENGINE LIGHT WENT ON.  I WAS TOLD I WOULD NEED A NEW FUEL PUMP AND TANK.  MY MECHANIC WENT TO THE WRECKING YARD AND FOUND A GOOD TANK, THE PUMP HOWEVER, HAD IT'S FILTER PIECES MISSING.  THEY WERE IN THE BOTTOM OF THE TANK.  WHEN THE MECHANICS TOOK OUT MY DAMAGED TANK, THE SAME WAS TRUE WITH MY FUEL FILTER.  IT IS UNDER MY IMPRESSION THAT THIS 2 FOR 2 DISCOVERY MAY MEAN THERE IS A CLOSE TO 100% PROBLEM WITH THE FUEL PUMPS.",
        "vin": "1J4FF48S71L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/09/2005",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115333,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "JEEP LIBERTY 2001, PROBLEM WITH BALL JOINT.   *BF    *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/07/2003",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015335,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "JEEP",
                "productModel": "LIBERTY",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30 MPH THE VEHICLE WAS INVOLVED IN A HEAD ON ACCIDENT YET THE DRIVERS SIDE AIR BAG DID NOT DEPLOY.  *NLM",
        "vin": "FULLFILL"
    }
]