[
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/17/2018",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082039,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR 2 WEEKS AFTER I LEFT DEALER  STARTED NOTICING A SMELL  OF GAS  THOUGH WAS. BECAUSE JUST PUT GAS IN .THEN WHEN TURNED ON HEAT SMELL WOULD GET WORSE ! A FEW DAYS AGO WENT TO FILL GAS AND  A LOT GAS OVER.FILLED ONTO GROUND   NOT ABLE TO FIGURE OUT WHY THE SMELL GAS SO STRONG INSIDE CAR ITS. ACTUALLY  UPSET MY STOMACH WHEN DRIVING THE. AT AND AFRAID GOING START FIRE ! ALSO LEAKAGE ON GROUND WHEN PARKED . I HAVE READ OTHER COMPLAINTS WITH SAME PROBLEM !! IT'S A 2001 KIA. ONLY HAS 78,000 MILES ON IT THINK SHOULD BE COVER. FROM COMPANY SINCE NOT ONLY ONE WITH THIS PROBLEM .",
        "vin": "KNDJA723115"
    },
    {
        "components": "SEAT BELTS,WHEELS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2017",
        "dateOfIncident": "12/15/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10940367,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT THIS VEHICLE WITH ONLY 11K MILES FROM AN ELDERLY COUPLE THAT HARDLY DROVE IT.  NOW AT 21K MILES, THERE IS A GAS SMELL COMING INSIDE THE VEHICLE AND ALSO OUTSIDE OF THE VEHICLE.  HAS A ROUGH IDLE AND GAS SPEWS OUT OF TANK WHILE I'M PUMPING GAS.  THE FRONT PASSENGER TIRE SOUNDS LIKE IT'S ABOUT TO FALL OFF.  HAD TO REPLACE SPARK PLUGS TWICE ALREADY.  ALSO, THE DRIVERSIDE SEATBELT WILL NOT RETRACT. I BOUGHT THIS VEHICLE WITH ONLY 11K MILES THINKING IT WILL LAST FOR AWHILE, BUT I'VE HAD SO MANY ISSUES WITH IT.",
        "vin": "KNDJB723715"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2015",
        "dateOfIncident": "11/19/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10795040,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. WHILE DRIVING AT APPROXIMATELY 20 MPH, THE VEHICLE BEGIN TO SHAKE, THE BRAKE WARNING INDICATOR ILLUMINATED, AND THE BRAKES FAILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE FRAME WAS CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 150,000. THE VIN WAS UNAVAILABLE.   UPDATED 01/12/16*LJ ;UPDATED VIN INVALID 4/25/18*JB  *TR",
        "vin": "KNDJA723501"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2015",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703076,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. WHILE DRIVING AT VARIOUS SPEEDS, FUEL FUMES EMITTED INTO THE VEHICLE. AFTER INSPECTING THE VEHICLE, THE CONTACT NOTICED FUEL LEAKING FROM THE FUEL TANK. THE FAILURE RECURRED CONTINUOUSLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT FUEL WAS LEAKING FROM THE TOP OF THE FUEL TANK AND THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 32,000.",
        "vin": "KNDJB723515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/30/2014",
        "dateOfIncident": "12/25/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668990,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PURCHASED THIS CAR FOR MY TEEN...WHEN FILLING GAS TANK IT BEGINS TO SPEW OUT ONTO HIM . ARE THE PERSON FILLING THE TANK.ALSO A BAD SMELL OF FUMES INSIDE OF CAR,,,,PLEASE HELP THE PROBLEM....*JS",
        "vin": "KNDJB723115"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/15/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10644890,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PART OF THE FRAME JUST BEHIND THE REAR SUSPENSION RUSTS FROM WATER THROWN UP BY THE TIRES. WHILE THIS MIGHT NOT NORMALLY BE A DANGER UNLESS YOU WERE TOWING, ON THIS MODEL IT'S WHERE THE FRAME CONNECTS TO THE WHEELS BELOW TO STABILIZE THE FRAME OVER THE SUSPENSION, WITHOUT THIS SUPPORT IT RELEASES THE BACK SUSPENSION AND ALLOWS THE CAR TO EASILY ROCK BACK AND FORTH INTO THE WHEELS. I COULD SEE SHINY SPOTS ON THE SHOCKS FROM TIRE RUB WHERE THE PAINT WAS RUBBED OFF, NO CURRENT SIGN OF TIRE DAMAGE. I FEEL THIS COULD CAUSE AN ACCIDENT BECAUSE THE SHOCKS, SPRINGS OR OTHER METAL BODY OR FRAME PART COULD WEAR OR POSSIBLY IF SHARP PUNCTURE A TIRE ON EITHER SIDE WHEN CORNERING. THIS PROBLEM CAN EASILY BE SEEN BY SWINGING THE SPARE TIRE OUT OF IT'S CLOSED POSITION TO OPEN THE TAILGATE, WHEN THE TIRE REACHES THE END OF IT'S ARM THE WHOLE BACK END OF THE VEHICLE WILL MOVE OVER, THE RUSTED FRAME BELOW WILL BEND.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2014",
        "dateOfIncident": "08/04/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10626338,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING FUEL, WHICH CREATED FUMES IN AND AROUND THE VEHICLE. THE CONTACT LOCATED THE LEAK UNDER THE FUEL TANK ON THE PASSENGER SIDE OF THE VEHICLE. THERE WERE NO WARNING INDICATORS ILLUMINATED DUE TO THE FAILURE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 82,000.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615861,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PURCHASED THIS VEHICLE FROM A PRIVATE OWNER, THEY SMELLED AN ODOR OF FUEL EVER SINCE THEY ACQUIRED THE VEHICLE A MONTH AGO. PRIOR TO THAT IT WAS OWNED BY ONE OWNER AND GARAGE KEPT. THE FUEL TANK AND BOTTOM PROTECTOR WAS ROTTED AWAY AND IN DANGEROUS LEAKING CONDITION. KIA WAS CONTACTED AND THEY SAID THERE WERE NO RECALL AND THEY WOULDN'T REPAIR THE VEHICLE. THE ROT IN THIS TANK DIDN'T HAPPEN OVERNIGHT, BUT IT WAS SO SEVERE THAT IT WARRANTS A LOOK FROM THE NHTSA INTO THIS. A MANUFACTURER SUCH AS KIA SHOULD NOT BE ABLE TO SELL AN INFERIOR SAFETY HAZARD TO THE CITIZENS OF THE USA. THERE WERE INVESTIGATIONS INTO THIS PROBLEM A FULL 7 YEARS AGO AND NOTHING WAS DONE. THIS IS AN INSULT TO PEOPLE CONCERNED WITH MOTORING SAFETY, WE SHOULD EXPECT BETTER FROM BOTH THE MANUFACTURER AND GOVERNMENT AGENCIES SUCH AS THIS ONE.    IT'S NOT A MILEAGE ISSUE, THE 1999/2000 SPORTAGES WERE RUSTING OUT WITH ONLY A FEW YEARS OF SERVICE AND IT IS DUE TO INFERIOR MATERIALS THAT SHOULD BE COVERED BY A MANUFACTURER THAT USES THEM.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2014",
        "dateOfIncident": "07/09/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10614450,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR KEEPS STALLING JUST QUITS WHEN I SLOW DOWN.   I HAD TWO MECHANICS CHECK IT OUT.  FILLED THE TANK WITH NEW GAS, AND NOTHING SHOWED UP ON THE ELECTRICAL CHECK.  IT IS A MYSTERY WHY THIS KEEPS HAPPENING.  I AM WORRIED THAT THIS MIGHT HAPPEN ON A MAJOR HIGHWAY.  AND I DON'T WANT TO SELL THE CAR AND GIVE SOMEONE ELSE THIS PROBLEM.",
        "vin": "KNDJB723415"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/19/2014",
        "dateOfIncident": "03/19/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573564,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST TRIED TO GET MY KIA SPORTAGE INSPECTED AND WAS TOLD BY TWO DIFFERENT PLACES THE FRAME IS RUSTED RIGHT OUT AND I SHOULDN'T EVEN BE DRIVING IT. I JUST LOOKED ONLINE ABOUT THE PROBLEM AND THERE ARE ALOT OF COMPLAINTS AND FEEL THERE SHOULD BE A RECALL TO FIX THE PROBLEM.  THE CAR IS FINE OTHERWISE.  IF THERE IS NO RECALL I AM GOING TO BE WITHOUT A VEHICLE NOW BECAUSE I CANT AFFORD ANOTHER ONE.  *TR",
        "vin": "KNDJA723315"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "01/08/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559670,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE ON OUR WAY TO THE HOSPITAL GOING 30MPH, I REACHED DOWN TO PICK UP SOMETHING OFF THE PASSENGER SIDE FLOOR( I WAS THE PASSENGER), WHEN I HEARD A SOUND LIKE BREAKING GLASS. WE THOUGHT WE HAD RUN OVER A GLASS OBJECT BUT WHEN I TURNED TO LOOK BACK THERE WAS NOTHING THERE. I DID NOTICE THAT MY SEATBELT WAS NO LONGER RESTRAINING ME. THE PART THAT SHOULD HAVE KEPT ME SAFE, THE SEATBELT, HAD COME COMPLETELY OUT OF ITS COMPARTMENT. I KNOW THAT IF WE HAD BEEN IN A WRECK I WOULD HAVE GONE THROUGH THE WINDSHIELD.  *TR",
        "vin": "KNDJB623915"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/22/2013",
        "dateOfIncident": "07/22/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10526274,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HEARING A CLUNK EVERY TIME I STARTED GOING FORWARD AND BACKWARDS AND GOT UNDERNEATH THE CAR TO NOTICE THE FRAME CROSSMEMBER WAS TOTALLY SEPARATED FROM THE FRAME.  IT IS THE FRAME CROSSBAR THAT HOLDS THE REAR AXLE SUPPORT TO THE FRAME.  THE AFFECTED FRAME CROSS MEMBER GOES UNDERNEATH THE GAS TANK AND WOULD REQUIRE 2 DAYS LABOR TO FIX AT MY LOCAL REPAIR SHOP.  TO REMOVE THE GAS TANK IS ONE PROJECT AND TO HAVE A NEW WELDED SUPPORT BAR IS ANOTHER PROJECT AND WILL COST ALOT TO FIX.  I CALLED KIA FOR POSSIBLE RECALLS AND THEY SAID \"OH ITS OUT OF WARRANTY\"  GOODLUCK WITH THAT!!!      THIS CAR IS UNSAFE AND COULD HAVE CAUSED SERIOUS DAMAGE.  *TR",
        "vin": "KNDJB723215"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/09/2013",
        "dateOfIncident": "07/20/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511321,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY KIA SPORTAGE ON 6/29/11 WITH 90000 MILES ON IT. I AM THE SECOND OWNER. I ALSO PURCHASED A ONE YEAR WARRANTY/10,000 MILES. AFTER 2 WEEKS OF DRIVING MY CAR WOULD TURN OFF WHILE DRIVING ON THE HIGHWAY. FIRST TIME SCARED THE CRAP OUT OF ME HAD NOT CONTROL WAS ABLE TO PUT CAR IN NEUTRAL AND APPLY EMERGENCY BRAKE WITH NO STEERING. CAR STARTED BACK UP. BROUGHT TO DEALERSHIP, DEALERSHIP SAID THERE WAS NO WAY POSSIBLE OF THIS OCCURRING. I THEN DID RESEARCH ONLINE AND SAW THAT MANY OTHER KIA SPORTAGE OWNERS WERE HAVING THE SAME PROBLEM. PRINTED OUT THE INFORMATION FROM OTHER OWNERS AND BROUGHT BACK TO DEALERSHIP.THEY SAID MY BATTERY HOUSING WAS LOOSE AND THEY REPAIRED. A WEEK LATER MY CAR SHUT OFF AGAIN WHILE DRIVING ON HIGHWAY. TOOK BAG TO KIA THEY THEN REPLACED MY BATTERY AND WIRES. NO PROBLEMS FOR A YEAR SAME ISSUE AGAIN. CAR STALLED WHILE DRIVING. I CANT BELIEVE I HAVE YET TO GET IN A CAR ACCIDENT. THIS TIME MY WARRANTY WAS UP AND I HAD TO PAY FOR A NEW BATTERY AND WIRES AND THE HOLDER THAT THE BATTERY SITS ON BECAUSE THEY SAID IT WAS DEFECTIVE. IT IS NOW 5/9/2013. TODAY MY CAR SHUT OFF AGAIN ON THE HIGHWAY. I WAS LIVING IN NEW YORK AND NOW SAN ANTONIO TEXAS. I HAVE ALSO GONE THROUGH THREE THERMOSTATS IN 6 MONTHS DUE TO DEFECTS. THIS IS RIDICULOUS. KIA NEEDS TO RECALL THE CAR NOT STARTING ISSUE IMMEDIATELY.  *TR",
        "vin": "KNDJA723815"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/15/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503211,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THAT  THE FRAME OF THE VEHICLE WAS SEVERELY RUSTED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "KNDJA723X15"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2013",
        "dateOfIncident": "02/04/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496157,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A KIA SPORTAGE EX 2001 ON 12/27/12 FROM FRONT RYAL AUTO GROUP IN FRONT ROYAL VA. I WENT TO THE GAS STATION AFTER FILLING MY GAS TANK I NOTICED A STRONG SMELL OF GAS. AFTER A FEW DAYS I CALLED THE DEALERSHIP AND TOLD THEM , THEY DID NOT KNOW IF IT WAS COVERED UNDER THE WARRANTY TO BRING IT IN MON-FRI 8-5 WELL I CAN NOT MAKE THOSE HOURS TO GO ,SO THE ODOR CONTINUES TO FIND OUT FROM A MECHANIC OF MY OWN CHOICE WHICH AFTER I CALLED THE DEALERSHIP BACK AGAIN BEFORE MY WARRANTY RAN OUT THAT WE DICOVERED I HAVE A FUEL TANK GAS SEAL LEAKAGE..  *TR",
        "vin": "KNDJA723715"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2012",
        "dateOfIncident": "08/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470284,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE WAS DRIVING HOME FROM WORK SHE NOTICED THE REAR OF THE SUV WAS SWAYING UPON FURTHER INSPECTION OF MYSELF AND AN AUTO MECHANIC WE FOUND A CRACK IN THE RT REAR FRAME THE MECHANIC TOLD US TO PARK IT AND CONTACT KIA. TOLD BY KIA AS THIS CAR WAS NOW OVER 100,000 MILES THAT IT WAS NO LONGER COVERED AND THERE WAS NOTHING THAT COULD BE DONE OR IT . WELL WE WELDED ON A FEW PIECES OF STEEL AND IT LASTED ONLY ANOTHER 3 MONTHS AND IT STARTED AGAIN THIS TIME WE CHECKED AND FOUND THAT THE FRAME WAS ROTTED FROM THE PASSENGER DOOR TO THE BACK END OF THE VEHICLE YOU COULD PUT YOUR FINGER THRU IT CAR IS NOW PARKED AND WONT BE DRIVEN AGAIN. KIA WILL DO NOTHING ABOUT THIS. I WENT TO THE BONE YARD TO SEE IF THEY HAD A FRAME AND THE 7 KIAS THAT I CHECKED ALL HAD THE SAME PROBLEM IF I WERE YOU AND I OWNED A KIA I WOULD CHECK THIS OUT BEFORE I DROVE ANOTHER MILE.  *TR",
        "vin": "KNDJA723815"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2012",
        "dateOfIncident": "08/27/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470234,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 KIA SPORTAGE, WITH A FAULTY SENDING UNIT SEAL. THE SEAL LEAKED, CAUSING FUEL TO RUN DOWN THE SIDE OF THE TANK AND RUST A HOLE INTO THE TANK CAUSING A SECOND LEAK. THE SENDING UNIT AND THE PRESSURE REGULATOR AND THE GAS TANK ARE ALL SOLD SEPARATELY. THE SHIELD AROUND THE TANK CAUSES FLUID TO TRAP BETWEEN THE TANK AND THE SHIELD, WHICH IS WHERE IT RUSTED. THE SHIELD IS ANOTHER EXPENSE. KIA WILL HONOR NOTHING. I FEAR FOR MY LIFE TO DRIVE IT THE WAY IT IS. IT WILL COST AROUND $600-800 IN PARTS ALONE.  *TR",
        "vin": "KNDJA723815"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/31/2012",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468494,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 KIA SPORTAGE WITH APPROXIMATELY 84,000 MILES AND THE FRAME IS COMPLETELY ROTTED AND I WAS TOLD IT WAS UNSAFE TO DRIVE ON PUBLIC ROADS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2012",
        "dateOfIncident": "07/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467652,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK LEAK. BOUGHT THE CAR NEW BUT NO HELP FROM KIA OR THE DEALERSHIP FOR REPAIRS.  THIS HAS BEEN A COMMON PROBLEM ! *TR",
        "vin": "KNDJB723615"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2012",
        "dateOfIncident": "07/17/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465986,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS IS IT HAPPENING WITH THE 2002, AND 2005 MODELS, MY 2001 KIA SPORTAGE ALSO HAS PROBLEM WHEN I PUT GAS IN.  WHEN I TRY TO FILL IT UP, IT SPITS THE GASOLINE OUT WITH SO MUCH FORCE IT GETS ALL OVER THE FLOOR AND IF YOU ARE NOT CAREFUL, IT GETS ON YOU.  THIS IS BEEN HAPPENING ABOUT A YEAR OR SO AGO.  IT IS A VERY DANGEROUS SITUATION BECAUSE WHEN YOU LEAST EXPECT IT THE GASOLINE YOU PUT IN THE TANK GOES BACK OUT.  I TOOK IT TO THE LOCAL MECHANIC AND TOLD ME THERE WAS A DEFECTIVE VALVE INSIDE THE TANK AND IT WAS A VERY EXPENSIVE JOB.  I CHECK BUT THERE ARE NO KIA RECALLS.  I THINK THERE SHOULD BE SOME ENFORCEMENT FROM THE GOVERNMENT AGAINST KIA SO THEY FIX THIS PROBLEM WHICH  IS DANGEROUS NOT ONLY TO THE OWNER'S HEALTH, BUT TO THE ENVIRONMENT AND HIS POCKET TOO.  *TR",
        "vin": "KNDJB723415"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/20/2012",
        "dateOfIncident": "02/13/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452360,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE CONTACT STATED THAT THE TAIL LIGHTS AND THE FRONT PARKING LIGHTS WERE INOPERATIVE, MAKING IT DIFFICULT TO SEE WHILE DRIVING AT NIGHT.  NEITHER THE DEALER NOR THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 120,000.",
        "vin": "KNDJA723315"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/29/2012",
        "dateOfIncident": "02/28/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449756,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THAT WHILE HAVING REGULAR MAINTENANCE, THE MECHANIC NOTIFIED HER THAT THE FRAME WAS SEVERELY CORRODED. THE MECHANIC STATED THAT THE VEHICLE WAS NOT ABLE TO BE REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 150,000.",
        "vin": "KNDJA7230Y5"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/04/2012",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442422,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE CONTACT STATED THAT THE SPRINGS THAT HELD THE SEAT BELT IN PLACE FRACTURED ON TWO OCCASIONS.  IN MARCH 2011, THE FRONT DRIVER'S SEAT BELT SPRING FRACTURED AND WAS REPAIRED BY A PRIVATE MECHANIC. THE SAME FAILURE OCCURRED ON THE FRONT PASSENGER SEAT BELT APPROXIMATELY NINE MONTHS LATER.  THE MANUFACTURER WAS AWARE OF THE FAILURE, BUT DID NOT OFFER ANY ASSISTANCE.  THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 70,000.   THE CONSUMER STATED THE FRONT DRIVER'S SEAT BELT RETRACTOR COLLAPSED/BROKE AND WAS REPAIRED BY A PRIVATE MECHANIC. THE SAME FAILURE OCCURRED WITH THE FRONT PASSENGER'S SEAT BELT APPROXIMATELY SIX MONTHS LATER.  THE CONSUMER STATED NO REPAIRS HAVE BEEN MADE. UPDATED 02/29/12",
        "vin": "KNDJB623X15"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2011",
        "dateOfIncident": "12/20/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441970,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS AN ELECTRICAL PROBLEM WHERE THE WIRES ARE MOUNTED CLOSE TO THE TRANSMISSION AND THE DASH BOARD COMPONENTS ARE NOT READING/MOVING NEITHER IS THE AUTOMATIC GEAR SHIFT AND OVERDRIVE. I'VE LEARNED THROUGH BLOG POSTS THAT THIS IS A COMMON ISSUE WITH THIS YEAR MAKE AND MODEL CAR.  *KB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/28/2011",
        "dateOfIncident": "11/26/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437430,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER TRENDSETTER SE",
                "productYear": "9999",
                "size": "P175/65/R14",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE EQUIPPED WITH COOPER TRENDSETTER SE TIRES SIZE 205/75R15, DOT NUMBER U9ULC2T2811. A FRIEND WAS DRIVING 70 MPH WHEN THE SIDEWALL SEPARATED ON THE REAR PASSENGER TIRE. THE TIRE SHREDDED INTO PIECES AS A RESULT. THE VEHICLE STARTED TO SWAY AS THE CONTACT MERGED TO THE SHOULDER, WHERE HE INSTALLED A SPARE TIRE. THE CONTACT ALSO STATED THAT THE TIRES WERE BRAND NEW AND RECENTLY PURCHASED. THE DEALER WAS NOTIFIED AND STATED THAT THEY WOULD GET BACK IN TOUCH WITH THE CONTACT. THE TIRE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE ON THE TIRE WAS 3,562. THE VEHICLE FAILURE MILEAGE WAS 120,238.    UPDATED 12/29/11 *BF  UPDATED 03/16/12",
        "vin": "KNDJB723415"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/28/2011",
        "dateOfIncident": "11/17/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437444,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTGAGE. THE CONTACT WAS DRIVING 40 MPH WHEN SHE LOST CONTROL OF THE VEHICLE AND EXPERIENCED A DIFFICULT TIME STEERING STRAIGHT. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC. THE MECHANIC STATED THAT THE TRACK BAR, WHICH WAS CONNECTED TO THE REAR AXLE, WAS CORRODED AND NEEDED REPLACEMENT. THE MANUFACTURER WAS NOTIFIED AND THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 65,500. AND THE CURRENT MILEAGE WAS 65,600.  UPDATED 01/10/12*LJ  UPDATED 01/10/12",
        "vin": "KNDJA723715"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2011",
        "dateOfIncident": "10/13/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432457,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2001 KIA SPORTAGE HAD A GAS SMELL. NOW WE NOTICED GAS LEAKING OUT OF THE TANK. IT SEEMS TO STOP AT 1/4 FULL. WE BOUGHT IN BRAND NEW IN 2002.  *TR",
        "vin": "KNDJA623325"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2011",
        "dateOfIncident": "09/28/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428345,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILIZER CONNECTED TO THE CHASIS ROTTED FROM THE FRAME AND THE BRAKES STOPPED WORKING BECAUSE WHERE THE BRAKE LINE WAS CONNECTED TO THE FRAME WAS ROTTED. BROUGHT THE CAR TO AN INDEPENDENT MECHANIC TO FIND THIS OUT. CANNOT DRIVE THE VEHICLE IN CURRENT CONDITION AS IT IS EXTREMELY UNSAFE.  I WAS LUCKY I WASN'T GOING FAST AND WAS ABLE TO GET THE CAR OFF THE ROAD.  PEOPLE SHOULD BE NOTIFIED TO HAVE THIS CHECKED IMMEDIATELY, IT COULD SAVE SOMEONE'S LIFE.  *TR",
        "vin": "KNDJA723415"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/02/2011",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423022,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK LEAKING, STRONG FUMES INSIDE CABIN.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2011",
        "dateOfIncident": "07/11/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412022,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THE FUEL TANK WAS CORRODED CAUSING A LEAK IN THE FUEL TANK. THE CONTACT FOUND A LARGE PUDDLE OF GASOLINE FUEL UNDER THE VEHICLE AND THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THAT THE FUEL SENDING UNIT WOULD NEED REPLACING AT THE CONTACT'S EXPENSE. THE MANUFACTURER WAS CONTACTED AND OFFERED NO OTHER ASSISTANCE. THE FAILURE MILEAGE WAS 110,000.",
        "vin": "KNDJA723215"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/20/2011",
        "dateOfIncident": "05/30/2000",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407480,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THE VEHICLE WAS PARKED WHEN SHE SMELLED A STRONG FUEL ODOR. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS INFORMED THAT THE EXTERIOR OF THE FUEL TANK WAS WET ON THE EXTERIOR BECAUSE THERE WAS A FUEL LEAK. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED WITHIN A FEW MONTHS. THE FAILURE MILEAGE WAS UNKNOWN. UPDATED 08/01/11*LJ  UPDATED 08/03/11",
        "vin": "KNDJB723815"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400937,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY GAS TANK.  THE GAS TANK LEAKS GAS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/14/2011",
        "dateOfIncident": "02/09/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395854,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT WAS DRIVING APPROXIMATELY BETWEEN 30-70 MPH WHEN THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS RESTARTED AND RESUMED NORMALLY YET THE FAILURE RECURRED AT VARIOUS SPEEDS. THERE WAS A SEPARATE OCCASION WHEN THE ENGINE FAILED TO RESTART. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER EIGHT TIMES WHERE THEY WERE UNABLE TO LOCATE THE FAILURE. THE PASSENGER SIDE WIRING HARNESS WAS CLEANED BUT TO NO AVAIL. THE FAILURE PERSISTED IN WHICH THERE WAS NO RESOLUTION. THE FAILURE MILEAGE WAS 60,000. UPDATED 05/05/11*LJ  UPDATED 05/09/11",
        "vin": "KNDJA723615"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/07/2011",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386734,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THAT THE HEADLIGHTS WERE FAILING INTERMITTENTLY.  THE CONTACT STATED THAT HE WOULD HAVE TO TURN THE VEHICLE ON AND OFF AND PLAY AROUND WITH THE FUSE IN ORDER TO HAVE THE HEADLIGHTS RE-ILLUMINATE. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSIS OR REPAIRS. THE MANUFACTURER WAS CONTACTED WHO DID NOT OFFER ANY ASSISTANCE SINCE HIS VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 170,000.",
        "vin": "KNDJB723215"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/25/2011",
        "dateOfIncident": "01/23/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378551,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 KIA SPORTAGE BEGAN TO SWERVE AND WAS ALL OVER THE ROAD. I BROUGHT IT TO A REPAIR SHOP THAT TOLD ME THE FRAME WAS ROTTED WERE THE STABILIZER CONNECTED TO THE CHASSIS. HONDA HAS THE SAME PROBLEM AND RECALLED THE VEHICLE. *TR",
        "vin": "KNDJA723X15"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/14/2011",
        "dateOfIncident": "12/28/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375762,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE. CONSUMER STATES REPEATED PROBLEMS WITH BRAKES *TGW  THE CONSUMER STATED BRAKE WORK HAS BEEN PERFORMED ON THE VEHICLE 12 TIMES FOR THE SAME PROBLEM. THE DEALER TOLD THE CONSUMER, THE PROBLEM WAS DUE TO THE WEATHER AND SALT AND ALSO NOT DRIVING THE VEHICLE AND ALLOWING IT TO SIT FOR WEEKS AT A TIME.  THE ROTORS, CALIPERS, PADS AND DRUMS HAVE ALL BEEN REPLACED. *JB",
        "vin": "KNDJA723515"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/01/2011",
        "dateOfIncident": "11/30/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10373715,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUMPING FUEL IT SPLASHES OUT, YOU HAVE TO PUMP THE GAS VERY SLOW AND CONSTANTLY START AND STOP CAUSING TRIPLE THE TIME TO PUMP GAS THEN NORMAL. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2010",
        "dateOfIncident": "07/11/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369290,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL ODOR ,FOUND GAS LEAKS FROM CORRODED GAS TANK, CALLED KIA HEADQUARTERS,TOLD TO TAKE IT TO A DEALER , CAR WAS OUT OF WARRANTIES BUT KIA PAID TO REPLACE THE GAS TANK, I WAS TOLD IT WAS COMMON WITH THIS KIA SPORTAGE 2001 , THE TANK SHIELD UNDER THE TANK COLLECTED THE SALT FROM THE ROAD WHILE DRIVING IN THE WINTER AND SIT THERE BETWEEN THE SHIELD AND THE TANK CAUSING EXCESSIVE CORROSION,I WAS PLEASED WITH KIA ACTION TO PAY FULLY FOR THE TANK.  *TR",
        "vin": "KNDJA723815"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2010",
        "dateOfIncident": "11/22/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367899,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THAT THERE WAS A STRONG ODOR OF FUEL INSIDE AND OUTSIDE OF THE VEHICLE. SHE ALSO NOTICED FUEL LEAKING ON THE GROUND UNDERNEATH THE FUEL TANK. THE FAILURE WAS A CONTINUOUS OCCURRENCE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO STATED THAT THE FUEL TANK, FUEL SENSOR AND THE FUEL PUMP NEEDED TO BE REPLACED. THERE WAS A MANUFACTURER RECALL RELATED TO THE SIMILAR DEFECT; HOWEVER THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 92,000.",
        "vin": "KNDJB723315"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/12/2010",
        "dateOfIncident": "10/11/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360061,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THAT THE FUEL TANK WAS LEAKING. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE FUEL TANK NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 66,000.",
        "vin": "KNDJB723215"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "07/25/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358794,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1 2001 KIA SPORTAGE DRIVING ON HIGHWAY. DRY PAVEMENT. REAR OF VEHICLE SWAYS SIDE TO SIDE NOTICE CLUNKING SOUND INTERMITTENT  2. CHASSIS IS ROTTED  EVERYTIME  VEHICLE DRIVEN FAILURE OCCURS. TURNING CORNERS, ACCELERATING, OR IF BAGS OR LUGGAGE ARE LOADED IN REAR OF VEHICLE. VEHICLE SWAYS OR FEELS LIKE YOU ARE DRIVING ON VERY LOW TIRES IN THE REAR OF VEHICLE.  3.NOTHING CAN BE DONE TO CORRECT THE FAILURE. THE REAR OF THE CHASSIS IS COMPLETELY ROTTED ON BOTH  CHASSIS RAILS, ALSO THE CROSS MEMBER THAT STABILIZES THE REAR OF THE CHASSIS IS SO ROTTED THERE IS A 5\" OVAL HOLE THROUGH THE CROSS MEMBER. PLEASE LOOK INTO THIS PROBLEM. THE VEHICLE HAS BEEN MAINTAINED LOOKS GREAT FROM THE TOP BUT FROM UNDERNEATH YOU CAN LITERALLY POKE HOLES IN THE CHASSIS WITH A SCREWDRIVER.  MECHANIC RECOMMENDATION : UNFIT/UNSAFE FOR TRAVEL ON PUBLIC ROADS. VEHICLE IS PRESENTLY SITTING IN YARD UNDRIVABLE. I HAVE PICS OF THE ROT TO SEND TO NHTSA IF THIS WILL HELP GET INVESTIGATION STARTED. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "06/06/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354411,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 50 MPH, THE REAR END OF THE VEHICLE BEGAN TO FISH TAIL. THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD AND INSPECTED. THE VEHICLE RESUMED NORMALLY AT A REDUCED SPEED. THE FAILURE OCCURRED INTERMITTENT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION WHERE THEY DETECTED THE MAIN FRAME EXHIBITED EXCESSIVE RUST CORROSION NEAR THE FUEL TANK AREA. ALSO, THE REAR BRAKE LINE WAS SEVERELY CORRODED. THE MAIN FRAME WAS ULTRA THIN AND DAMAGED BEYOND REPAIR. THE TECHNICIAN REPLACED THE BRAKE LINE AND ADVISED THAT THE VEHICLE NOT BE DRIVEN DUE TO THE SAFETY HAZARD. THE FAILURE MILEAGE WAS APPROXIMATELY 137,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/26/2010",
        "dateOfIncident": "08/12/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351931,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE CONTACT STATED THAT THE VEHICLE WAS LEAKING GASOLINE FUEL ABNORMALLY FROM THE TOP OF THE FUEL TANK. THE MANUFACTURER ADVISED THAT THERE WERE NO RECALLS ON THE VEHICLE AND ANY REPAIRS WOULD BE AT THE CONTACTS EXPENSE. THE VEHICLE WAS NOT REPAIRED.  THE VIN WAS NOT AVAILABLE.  THE FAILURE AND CURRENT MILEAGE WAS APPROXIMATELY 70,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2010",
        "dateOfIncident": "06/17/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351097,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE FUEL TANK.  FUEL TANK LEAKS AND IT IS A KNOWN PROBLEM WITH VEHICLE AND YET KIA CORPORATION AND THE DEALERSHIP IN CANTON MICHIGAN WHERE I PURCHASED VEHICLE WILL NOT TAKE RESPONSIBILITY FOR THIS ISSUE.  THIS IS DANGEROUS.  I HAVE TAKEN OUTSTANDING CARE OF MY 2001 KIA SPORTAGE-IT WAS ALWAYS GARAGED AND AWAY FROM THE ELEMENTS.  I EVEN HAVE COVERED PARKING AT WORK.  I WANT KIA TO COMPENSATE ME BY 1) REPLACING THE FUEL TANK FREE OF CHARGE; 2) GIVING ME MY $ BACK $11K--THAT I SPENT ON PURCHASING THIS CARE; OR 3)GIVING ME $ TO PURCHASE A TANK AND COVER LABOR.  DO YOU KNOW THAT IT IS IMPOSSIBLE TO FIND A NEW OR USED 2001 KIA SPORTAGE FUEL TANK.  THIS IS TERRIBLE AND AN INCREDIBLE SAFETY VIOLATION.  I HAVE BEEN TRYING FOR YEARS TO GET AN ANSWER AND I JUST GET THE RUN AROUND.  I AM WRITING KIA, THE DEALERSHIP, MY MICHIGAN ATTORNEY GENERAL AND PRESIDENT OBAMA.  I AM EXTREMELY FRUSTRATED THAT A COMPANY CAN PRODUCE THIS TYPE OF VEHICLE WITH A KNOWN DEFECT AND NOT BE HELD LIABLE.  *TR",
        "vin": "KNDJA723515"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/06/2010",
        "dateOfIncident": "07/23/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347831,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED   WHILE DRIVING APPROXIMATELY 70 MPH, SHE HEARD AN UNUSUAL CLUNK  AND THE BRAKE WARNING LIGHT ILLUMINATED. THE CONTACT ATTEMPTED TO APPLY THE BRAKES YET THE BRAKE PEDAL FELL MUCH FARTHER INTO THE FLOORBOARD THAN USUAL.  THE VEHICLE WAS TAKEN TO A LOCAL REPAIR FACILITY WHERE SHE WAS ADVISED THAT THE FRAME WAS SEVERELY RUSTED AT THE REAR CROSS MEMBER. THE MECHANIC STATED THAT WHEN THE PART FRACTURED FROM THE VEHICLE, IT STRUCK THE BRAKE LINE, CAUSING THE FAILURE. THE MANUFACTURER OFFERED TO TAKE THE LIABILITY FOR PARTIAL REPAIR COSTS. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 140,000.",
        "vin": "KNDJA723615"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "07/14/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347279,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME JULY 14TH 2010 WHEN I BEGAN TO HEAR A \"THUD\" UNDERNEATH MY 2001 KIA SPORTAGE. IT WAS THEN THAT THE BRAKE LIGHT WARNING CAME ON. I PRESSED THE BRAKES, BUT THEY WERE NOT FUNCTIONING AT ALL. I HAD TO TRAVEL OVER 20 MILES BACK HOME ON THE FREEWAY WITH NO BRAKES. LUCKILY, I WAS ABLE TO MANEUVER THE CAR BACK WITH NO DAMAGE TO IT, MYSELF, OR MY TWO FRIENDS WHO WERE RIDING WITH ME. IT TURNS OUT THAT WHAT HAPPENED WAS THAT THE FRAME WAS ROTTED OUT AND THUS FELL SUDDENLY, CUTTING THE BRAKE LINE. I LATER LEARNED THAT THE ROTTING OF THE FRAME WAS DUE TO POOR AND NEGLIGENT DESIGN. IT IS COMPLETELY EXPOSED AND HAS NO VENTILATION TO FLUSH OUT WATER AND SALT. IT WAS A MIRACLE THAT THIS DIDN'T HAPPEN SOONER AND THAT I WAS ABLE TO GET HOME WITH NO INJURIES. KIA LATER OFFERED TO REPLACE THE FRAME WITH AN $1,800 ONE, BUT NOTED THAT IT WOULD COST OVER $6,000 TO HAVE IT INSTALLED WHICH IS SIMPLY UNREASONABLE. I AM NOW WITHOUT A VEHICLE UNTIL FURTHER NOTICE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2010",
        "dateOfIncident": "07/03/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345831,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT STATED THAT BOTH REAR POWER WINDOWS WERE INOPERABLE. THE AIR BAG WARNING LIGHT ALSO REMAINED ILLUMINATED. THE DEALER REPAIRED THE WINDOWS AND IN THE PROCESS, THE SECURITY ALARM INDEPENDENTLY SOUNDED. THE DEALER WAS UNABLE TO SHUT OFF THE ALARM AND THEN DISCONNECTED THE FUSE. THE DEALER ALSO DISCONNECTED THE AIR BAG SENSOR. IN ADDITION, THE DOOR AND SEAT BELT ALARMS WERE INOPERABLE. THE DOOR LOCK ALSO WOULD NOT ENGAGE. THE DEALER ADVISED HE WOULD NOT TAKE POSSESSION OF THE VEHICLE. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT FURTHER REPAIRED. THE CONTACT REFUSED TO DRIVE THE VEHICLE DUE TO THE UNSAFE NATURE OF THE MANY FAILURES. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 97,500.",
        "vin": "KNDJA723515"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/27/2010",
        "dateOfIncident": "07/05/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345697,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "USED CAR DEALER SOLD A CAR WITH ELECTRICAL PROBLEMS ON 7/3/10.  JULY 5, 2010, THEY FIXED THE BACK 2 WINDOWS CAUSING CAR ALARM TO GO OFF WHEN YOU GET IN AND  WHEN YOU GET OUT, THEY DISABLED THE CAR ALARM NOW CAUSING THE AIR BAG LIGHT TO BE ON ALL THE TIME, THE DOOR DON'T SOUND WHEN YOU OPEN IT,  THE LOCKS DON'T WORK THE WAY THEY SHOULD, DOOM LIGHT DON'T WORK SEAT BELT DON'T SOUND TO REMIND YOU TO PUT THEM ON.  SHOULD YOU DRIVE A VEHICLE WHEN AIR BAG LIGHT IS ON? *TR",
        "vin": "KNDJA723515"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/26/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323365,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE. WHILE DRIVING APPROXIMATELY 30 MPH, A CRACK FORMED IN THE EXHAUST MANIFOLD. THE STABILIZER BAR DISCONNECTED FROM THE RIGHT BALL JOINT WHILE TRAVELING AT APPROXIMATELY 5 MPH; AT THAT POINT, THE CONTACT WAS UNABLE TO TURN THE STEERING WHEEL TO THE LEFT. THERE WERE NO WARNINGS BEFORE THE FAILURE OCCURRED. THE VEHICLE WAS TAKEN TO THE DEALER TO BE DIAGNOSED BUT NO REPAIRS HAD BEEN PERFORMED WHEN THE COMPLAINT WAS FILED. THE CURRENT MILEAGE WAS APPROXIMATELY 121,600. THE FAILURE MILEAGE WAS APPROXIMATELY 121,500.  UPDATED 05/18/10.  *LJ",
        "vin": "KNDJB723X15"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319620,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHOLE UNDERBODY OF A 2001 KIA SPORTAGE IS RUSTING OUT , ESPECIALLY AROUND THE GAS TANK. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319647,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE. THE CONTACT SMELLED A STRONG ODOR OF FUEL COMING FROM THE AIR VENTS AND CIRCULATING THROUGHOUT THE INSIDE OF THE VEHICLE. ALSO, AN EXCESSIVE AMOUNT OF FUEL WAS LEAKING COMING FROM THE FUEL TANK. THE VEHICLE HAS NOT BEEN REPAIRED FOR THE MALFUNCTION AT THIS TIME. THE FAILURE MILEAGE WAS 120,000. THE CURRENT MILEAGE WAS 155,000.",
        "vin": "KNDJB723515"
    },
    {
        "components": "STRUCTURE,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310624,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRAME, BEHIND THE REAR WHEELS,  RUSTED TO THE POINT OF NOT PASSING INSPECTION IN 2009.  IT COULD HAVE LED TO A PROBLEM IN AN ACCIDENT WITH COLLAPSE AND CRUSHING THE GAS TANK. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/11/2010",
        "dateOfIncident": "02/09/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308831,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2001 KIA SPORTAGE WITH 55200 MILES.  WENT TO KIA DEALER BECAUSE OF FUEL LEAK.  TECHNICIAN TOLD ME THAT THE FRAME WAS SO ROTTED ON THE VEHICLE AND THAT IF I HIT A POT HOLE THAT THE REAR END COULD LET GO.  THE TECHNICIAN TOLD ME THAT FROM 1995 TO 2001 KIA USED LOW GRADE MATERIAL ON THE FRAMES OF THEIR VEHICLES AND POSSIBLY DID NOT COAT THEM.  HE TOLD ME WHEN HE PUT MY CAR ON THE LIFT THAT THERE WAS PIECES OF THE FRAME DROPPING ON THE GROUND. HE SAID HE SLIGHTLY TAPPED A HAMMER AGAINST THE FRAME AND IT MADE HOLES. HE TOLD ME THAT I SHOULD JUNK THE VEHICLE AND GAVE ME PAPERWORK STATING THE VEHICLE WAS UNSAFE TO DRIVE.  I ALSO HAD SPOKEN TO THE OWNER OF A USED CAR DEALERSHIP IN MY AREA PRIOR TO THIS AND HE TOLD ME THAT HE COULD NOT SELL THE 1999 KIA SPORTAGE THAT HE PURCHASED AT AUCTION WITH APPROX. 73,000 DUE TO THE FRAME ROTTING OUT.   I COULD HAVE BEEN SERIOUSLY HURT OR KILLED IF I WAS ON THE HIGHWAY IF I HAD NOT HAD THAT FUEL LEAK.   I CANNOT UNDERSTAND HOW KIA COULD PRODUCE A VEHICLE LIKE THIS. LOWER QUALITY COSMETICS ARE ONE THING BUT A FRAME ON A VEHICLE IS ANOTHER. *TR",
        "vin": "KNDJA723915"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2010",
        "dateOfIncident": "02/03/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306598,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK IS LEAKING WHEN TANK IS FILLED FULL. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/04/2009",
        "dateOfIncident": "10/14/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290993,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "POLYPROPYLENE COOLING FAN BLADE BROKE OFF WHILE I WAS TRAVELING ON MY WAY TO WORK, THE FAN PROCEEDED TO PUNCTURE MY RADIATOR AND COULD HAVE CAUSED ME TO WRECK SINCE IT OVER HEATED AND SHUT OFF AND I HAD NO CONTROL. *TR",
        "vin": "KNDJA723915"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/02/2009",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282692,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE PURCHASED ON AUGUST 25, 2009. THERE WAS A NOISE UNDER THE HOOD. AN INDEPENDENT MECHANIC STATED THAT THE CATALYTIC CONVERTER WAS REMOVED AND REPLACED BY A PIPE THAT SHOULD NOT HAVE BEEN ON THE VEHICLE. SHE ALSO STATED THE AIR CONDITIONING UNIT CONTINUED TO LEAK WATER FROM THE VENTS AND ONTO THE FLOOR BOARD. THE MECHANIC STATED THAT THERE WAS ALLERGY IN THE AIR CONDITIONING UNIT. THE FAILURE AND CURRENT MILEAGES WERE 75,200.",
        "vin": "KNDJB723315"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "07/18/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278657,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS,  MY 2001 KIA SPORTAGE HAS SUFFERED A RUPTURED GASOLINE TANK FROM ROCKS BEING TRAP BETWEEN THE GASOLINE TANK AND THE GASOLINE TANK GUARD PLATE, MAKING MY VEHICLE A ROLLING BOMB UNTIL I DISCOVERED THE GASOLINE LEAK. THE GASOLINE GUARD PLATE WAS DESIGNED WITH  8, CIRCULAR HOLES IN THE GUARD APPROXIMATELY 1 INCH IN DIAMETER WHICH ALLOWS SMALLS ROCKS FROM THE ROAD TO ENTER THE SPACE BETWEEN THE GUARD PLATE AND THE GASOLINE TANK AND GRINDING A HOLE IN THE GASOLINE TANK, ALLOWING THE FUEL TO LEAK WHICH CREATES AN ALMOST CERTAIN RECIPE FOR A DISASTER IF THE GASOLINE WAS TO CONTACT A HOT TAILPIPE, OR IF THE VEHICLE WAS IN A ACCIDENT.    IN BOTH CASES I HAD TO REPLACE A VERY EXPENSIVE GASOLINE TANK.    I WILL BE INJECTING FOAM INTO THE SPACE BETWEEN GASOLINE TANK AND THE GUARD PLATE LATER THIS WEEK TO HOPEFULLY, KEEP THIS EXPLOSIVE PROBLEM FROM OCCURRING AGAIN.    THIS A  DANGEROUS DESIGN FLAW IN MY OPINION AND NEEDS TO BE ADDRESSED. WHEN I CONTACTED KIA OF AMERICA YESTERDAY AND EXPLAINED THIS SITUATION, THE CUSTOMER SERVICE REPRESENTATIVE WAS IN MY OPINION, LESS THAN RECEPTIVE ABOUT KIA LOOKING INTO THIS SITUATION.    WHEN SOMEONE GETS CREMATED BECAUSE OF THIS DESIGN FLAW, IT WILL BE TOO LATE.    PLEASE LOOK INTO THIS SITUATION.    THANK YOU. *TR",
        "vin": "KNDJB723515"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "07/29/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278678,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 KIA SPORTAGE SEEMS TO HAVE THE SAME RECALL DEFECT AS THE 2001-2004 OPTIMA. THE CAR ONLY HAS 45,000 MILES ON IT AND WAS JUST DECLARED UNFIXABLE AT THE DEALERSHIP DUE TO THE REAR SUSPENSION ROTTED OFF THE FRAME. THE SERVICE TECHNICIAN SAID IT WAS THE SECOND ONE HE SAW TODAY, SAME MODEL/YEAR. *TR",
        "vin": "KNDJA723X15"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2009",
        "dateOfIncident": "11/10/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277282,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GASOLINE SMELL COMES IN THROUGH THE VENTS INTO THE WINDOWS.  THE SMELL IS SO STRONG THAT I CANNOT DRIVE MY VEHICLE DURING COOL OR COLD WEATHER.  FIRST MENTIONED IT TO DEALERSHIP.  THEY SAID IT WAS NORMAL FOR A NEW VEHICLE AND THAT THE SMELL WOULD GO AWAY.  8 YEARS LATER THE SMELL HAS GOTTEN WORSE AND HASN'T GONE AWAY. *TR",
        "vin": "KNDJB723115"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/17/2009",
        "dateOfIncident": "07/16/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277160,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER TRENDSETTER SE",
                "productYear": "9999",
                "size": "P175/65/R14",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE VEHICLE HAS COOPER TRENDSETTER SE TIRES, SIZE P 20575R15 (NA).  WHILE DRIVING 60 MPH, THE CONTACT HEARD A LOUD SOUND INSIDE OF THE VEHICLE.  HE PULLED THE VEHICLE OVER, BUT WHEN HE DROVE OFF FOR A FEW MILES, HE HEARD A SLAPPING SOUND COMING FROM THE REAR DRIVER'S SIDE TIRE.  THE CONTACT PULLED INTO A PARKING LOT AND NOTICED MAJOR TREAD SEPARATION; HOWEVER, THERE WAS STILL AIR INSIDE OF THE TIRE.  THE FAILURE CRACKED THE REAR BUMPER, THE REAR DRIVER'S SIDE LENS, AND THE BULB.  HE EMAILED THE MANUFACTURER, BUT HAS NOT RECEIVED A RESPONSE.  THE CURRENT AND FAILURE MILEAGES WERE 192,000.",
        "vin": "KNDJA723615"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2009",
        "dateOfIncident": "06/20/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276175,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA 2001 SPORTAGE / GAS TANK LEAK /PLATE GUARDING TANK RUSTED AWAY/FUEL PUMP HAD TO BE REPLACED.    RECALL DATE 2007 FOR KIA SPORTAGES ALREADY INACTED / GARAGE SAID DIDN'T APPLY TO KIAS IN OHIO????? COST 1200 TO REPAIR . WHY NOT OHIO????? GARAGE TELLING TRUTH??? *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274857,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  SHORTLY AFTER PURCHASING THE VEHICLE, THE CONTACT NOTICED A FUEL RELATED ISSUE.  THE VEHICLE WOULD STALL WHILE ATTEMPTING TO DEPRESS THE BRAKE PEDAL TO SLOW DOWN.  THE VEHICLE WOULD ALSO STALL WHILE TRAVELING UPHILL OR A SLOPE.  THE FUEL PUMP, CRANKSHAFT SENSOR, TWO FUEL FILTERS, AND ADDITIONAL UNKNOWN REPAIRS WERE MADE ON SEVERAL OCCASIONS; HOWEVER, THE FAILURE STILL PERSISTS.  THERE WERE NO RECALLS LISTED FOR THE VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE LESS THAN 63,398.",
        "vin": "KNDJA723315"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/10/2009",
        "dateOfIncident": "06/09/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273501,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BPURCHASED A 2001 KIA SPORTAGE ,THE GAS TANK IS ALL RUSTED AND LEAKING. *TR",
        "vin": "KNDJA723515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/13/2009",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265143,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE CONTACT SMELLED GASOLINE IN THE VEHICLE AND TOOK IT TO THE MECHANIC.  IT WAS DISCOVERED THAT THE TANK WAS LEAKING DUE TO A LOOSE SEAM.  AS A RESULT, THE CONTACT CANNOT FILL UP THE GAS TANK IN THE VEHICLE.  SHE DISCOVERED ON THE INTERNET THAT THERE WERE OTHER COMPLAINTS FOR THIS YEAR, MAKE, AND MODEL VEHICLE.  THE CONTACT FEELS THAT THIS IS UNSAFE BECAUSE THE VEHICLE COULD CATCH FIRE.  THE FAILURE MILEAGE WAS 70,000.  UPDATED 05/13/09*LJ  UPDATED 05/13/09. *JB",
        "vin": "KNDJB723X15"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/23/2009",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259715,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 KIA SPORTAGE 4 WHEEL DRIVE.  I AM THE ORIGINAL OWNER AND I AM SUPPOSED TO HAVE AN EXTENDED 10 YEAR, 100,000 MILE WARRANTY.  I ONLY USE THE 4WHEEL DRIVE WHEN IT SNOWS.  TWO YEARS AGO I DISCOVERED THAT THE VEHICLE WAS GOING INTO 4 WHEEL DRIVE.  WHEN I WENT TO THE DEALERSHIP I WAS TOLD THAT I NEEDED NEW VACUUM LINES TO THE FRONT HUBS.  WITHOUT VACUUM TO THE HUBS THEY WON'T ENGAGE.  I HAD NO OPPORTUNITY TO VERIFY THAT THE VEHICLE WOULD GO INTO 4 WHEEL DRIVE.  IN 2008 WHEN IT SNOWED AGAIN I AGAIN FOUND THAT THE VEHICLE WOULD NOT GO INTO 4 WHEEL DRIVE.  NOW I AM TOLD THAT I HAVE TO BUY $1500.00 WORTH OF PARTS AND LABOR TO FIX THE FRONT HUBS SO THAT THEY WILL MAINTAIN A VACUUM.   THEY CLAIM THAT THERE IS NO WARRANTY FIX AND BECAUSE THE PARTS NECESSARY TO FIX THE PROBLEM ARE DIFFERENT FROM WHAT IS ON THE VEHICLE THEY DON'T HAVE TO WARRANTY THEM.  THE SAFETY DEFECT INVOLVED HERE IS THAT WHEN THE 4 WHEEL DRIVE IS ENGAGED THE DASH HAS AN INDICATOR THAT SAYS THE VEHICLE IS IN 4 WHEEL DRIVE WHEN IN FACT IT IS NOT.  THIS CAN LEAD TO A VERY DANGEROUS SITUATION WITH LOSS OF CONTROL  ON SNOW OR SLICK SURFACES.  *TR",
        "vin": "KNDJA723415"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/08/2008",
        "dateOfIncident": "11/08/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248009,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAK UNDER HOOD.  FUMES COME INTO VEHICLE THROUGH AIR VENTS WHEN OUTSIDE AIR IS COLD. *TR",
        "vin": "KNDJA723X15"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2008",
        "dateOfIncident": "06/30/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233659,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A LEAK IN MY 2001 KIA SPORTAGE FUEL TANK LAST YEAR. I DISCOVERED THAT WHILE I WAS VISITING CANADA AND FIXED IT THERE. THIS WEEK, I TAKE THE VEHICLE TO THE MECHANIC FOR INSPECTION. HE FINDS THAT THERE IS ANOTHER LEAKAGE AROUND THE FUEL PUMP. THE MECHANIC RECOMMENDS THAT I REPLACE BOTH THE FUEL PUMP AND THE FUEL TANK. I FILE THE COMPLAINT BECAUSE THE LEAKAGE PROBLEM IS A SAFETY HAZARD AND THE MECHANIC INDICATES THAT IT IS A COMMON PROBLEM WITH THE KIA SPORTAGE. THE VEHICLE CURRENTLY HAS FEWER THAN 59,000 MILES AND HAD FEWER THAN 50,000 MILES WHEN THE FIRST INCIDENT OCCURRED. SO, I PRESUME THAT THE PROBLEM IS LIKELY RELATED TO A MANUFACTURING DEFECT.  *TR",
        "vin": "KNDJA723315"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/01/2008",
        "dateOfIncident": "09/13/2006",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226377,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  ON NOVEMBER 21, 2006, WHILE DRIVING 55 MPH, THE VEHICLE BEGAN TO SMOKE.  THE CONTACT NOTICED THE SMOKE ENTERING THROUGH THE AIR VENTS ON THE PASSENGER SIDE OF THE VEHICLE.  SHE PULLED TO THE SIDE OF THE ROAD AND CALLED HER LOCAL KIA DEALER TO INQUIRE IF SHE COULD BRING HER VEHICLE IN FOR SERVICE.  THE DEALER ADVISED HER TO BRING IT IN THE FOLLOWING DAY.  THE DEALER REPLACED THE BLOWER MOTOR, BUT THE FAILURE CONTINUED FOR THE NEXT THREE YEARS.  THE CONTACT ALSO HAD THE BRAKE PADS REPLACED, BUT THE DEALER HAS BEEN UNABLE TO REMEDY THE FAILURE.  THE FAILURE MILEAGE WAS UNKNOWN.    UPDATED 05/13/08 *BF  THE CHECK ENGINE LIGHT ILLUMINATED. UPDATED",
        "vin": "KNDJA723115"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2008",
        "dateOfIncident": "03/25/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222250,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK BEGAN LEAKING DUE TO FAILURE OF THE FUEL TANK ASSEMBLY.  KIA PROVIDES A SERVICE CAMPAIGN (SC059) TO INSPECT 1996-2002 SPORTAGE MODELS TO VERIFY THIS FAILURE IS COVERED BY THAT CAMPAIGN.  HOWEVER, KIA ONLY PROVIDES REPAIR BULLETIN ASSISTANCE FOR 1996-2000 MODELS WITH THIS PROBLEM - SO EVEN THOUGH THEY VERIFIED IT IS A SAFETY ISSUE THEY REFUSE TO REPAIR IT UNDER THE REPAIR BULLETIN BECAUSE IT IS A 2001 MODEL.  WHY IS THE SERVICE CAMPAIGN FOR INSPECTION ENCOMPASSING 1996-2002 MODELS IF THEY ARE ONLY REPAIRING 1996-2000 MODELS WITHOUT CHARGING?  *TR",
        "vin": "KNDJA723315"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2008",
        "dateOfIncident": "03/06/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222190,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE CONTACT SMELLED A STRONG ODOR OF GASOLINE AND THE FUEL GAUGE WENT FROM A FULL TANK TO HALF A TANK.  SHE FOUND A PUDDLE OF GASOLINE UNDERNEATH THE VEHICLE.  THE DEALER STATED THAT THE FUEL TANK WAS CORRODED.  THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE BECAUSE THE VEHICLE WAS NO LONGER UNDER WARRANTY.  THE VIN, NUMBER OF CYLINDERS, ENGINE SIZE, AND DEALER INFORMATION WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 68,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/17/2008",
        "dateOfIncident": "03/06/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221493,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 KIA SPORTAGE IS GARAGE PARKED, AND I NOTICED THE SMELL OF GAS IN MY GARAGE ONE DAY LAST WEEK.  I PARKED IN MY DRIVEWAY THAT NIGHT AND NOTICED A LARGE GAS STAIN THE NEXT MORNING.     I TOOK MY CAR TO MY MECHANIC WHO CALLED A PARTS DEALER TO FIND OUT THE COST OF A USED ONE.  HE WAS NOTIFIED THAT KIA HAD A RECALL ON THESE GAS TANKS.  HE THEN CALLED KIA AND SCHEDULED AN APPOINTMENT FOR ME TO TAKE IT IN TO THEM THAT AFTERNOON.    AFTER KIA'S INSPECTION, THEY SAID I HAD THE SAME PROBLEM AS MANY OTHERS WERE HAVING WITH THESE GAS TANKS.  THE SERVICE TECH RAN MY VIN NUMBER AND WAS TOLD THAT MY VEHICLE WAS \"TWO MONTHS OUT OF THE RECALL DATE.\"  HE SAID HE FELT THAT SINCE IT WAS THAT CLOSE TO THE DATE, THAT KIA SHOULD COVER IT.  HE CALLED KIA AND SPOKE TO A COUPLE OF \"HIGHER UPS\" THERE AND WAS TOLD THE SAME THING.      I HAVE RECENTLY LEARNED THAT THERE ARE MANY PEOPLE IN MY AREA, AS WELL AS COLUMBUS AND CINCINNATI, ARE HAVING THE SAME PROBLEM I AM HAVING...THAT THE VIN NUMBERS ARE 2 MONTHS NEWER THAN THE RECALL THAT KIA HAS ISSUED, AND THEREFORE ARE BEING DENIED.      I HAD TO PAY $443.92 TO GET THIS FIXED AT THE KIA DEALER AND FEEL THAT KIA SHOULD REIMBURSE ME FOR THE PROBLEM WITH THIS GAS TANK.  *TR",
        "vin": "KNDJA723215"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/03/2008",
        "dateOfIncident": "12/10/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219950,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD WEATHER GAS LEAKS FROM UNDERNEATH THE MANIFOLD FROM A RUBBER HOSE IN LINE WITH FUEL LINE CAUSING GAS LOST AND FUMES TO EMIT INSIDE VEHICLE.  *TR",
        "vin": "KNDJA723015"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/26/2008",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219220,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANKS RUST OUT QUICK. I NOTICED SMELL OF GAS, AND REPLACED TANK IMMEDIATELY. NO DAMAGE WAS DONE, JUST CONCERN FOR OTHERS. POOR DESIGN CAPTURES MOISTURE BETWEEN FUEL TANK AND SKID PLATE. THIS HAS COST ME 250.00 FOR THE TANK, A HALF DAY OF LABOR, AND I'M CONCERNED WITH PUTTING SKID PLATE BACK ON. I LOOKED ON THE INTERNET  TO SEE IF THERE WERE SIMILAR PROBLEMS. THERE WERE SEVERAL EXACT AND OTHERS FOUND WITH THE FUEL TANKS. NO CARS HAVE CAUGHT FIRE YET.  *TR",
        "vin": "KNDJA723215"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/10/2008",
        "dateOfIncident": "02/09/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217585,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE GAS TANK IS LEAKING FROM SEAM IN GAS TANK.  *TR",
        "vin": "KNDJA723515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2007",
        "dateOfIncident": "11/15/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209518,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE CONTACT SMELLED GAS WHILE THE VEHICLE WAS PARKED OR BEING DRIVEN AT VARIOUS SPEEDS.  THE GAS CAP WAS REPLACED, BUT THE ODOR REMAINED.  HE HAD TO FILL UP THE TANK WITH GAS  EACH DAY.  THE VEHICLE WAS TAKEN TO THE SHOP AND A GAS LEAK, HOLES, AND CORROSION WERE FOUND.  THE TANK WAS REPLACED.  THE VIN, ENGINE SIZE, NUMBER OF CYLINDERS, AND DEALER INFORMATION WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 90,000.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/09/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208385,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE WITH NO AIRBAG. CUSTOMER STATED THAT THE DEALERSHIP TOOK THE DRIVER SIDE AIRBAG OUT BEFORE THEY SOLD THE VEHICLE.  *KB  THE CONSUMER REALIZED THE AIR BAG WAS MISSING WHEN SHE WENT TO USE THE HORN AND FOUND THE LEATHER WAS NOT FIRM, AND WHEN SHE PRESSED HARDER, IT LEFT A CIRCULAR INDENTATION WHERE THE AIR BAG SHOULD HAVE BEEN. *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/05/2007",
        "dateOfIncident": "10/30/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207926,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  I TURNED THE EXHAUST ON IN THE CAR THERE WAS A VERY STRONG GASOLINE SMELL TO THE POINT I HAD TO TURN IT OFF AND OPEN THE WINDOWS. THERE HAS BEEN SEVERAL COMPLAINTS FILED ON THE INTERNET CONCERNING THIS SAME PROBLEM. I FEEL SINCE THIS COULD BE A FIRE PROBLEM WITH THE CAR IT NEEDS TO BE ADDRESSED WITH THE MANUFACTURERS OF THE AUTO AND A RECALL GIVEN . ALSO THERE HAS BEEN SEVERAL COMPLAINTS WRITTEN CONCERNING LEAKS EARLY ON WITH THE GAS TANK ITS SELF.  *TR",
        "vin": "KNDJB723715"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207580,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY, 2007, MY 2001 KIA SPORTAGE WAS MAKING A LOUD, STRAINING ENGINE SOUND.  TOOK THE CAR TO BE REPAIRED AND WAS TOLD I NEED A COOLING FAN BLADE ASSEMBLY.  MY CAR WAS OUT OF WARRANTY SO I DIDN'T TAKE IT TO THE DEALER.  I HAD LESS THAN 60,000 MILES ON THE CAR.  I HAVE SINCE FOUND OUT THERE IS A RECALL THIS PART.  I PLAN TO SEEK REIMBURSEMENT FROM KIA.  *TR",
        "vin": "KNDJB723715"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "10/15/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207585,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 KIA SPORTAGE HAD A STRONG GAS ODOR FOR A COUPLE OF WEEKS. I WAS TOLD BY THE DEALER TO GET A NEW GAS CAP.  THE ODOR BECAME STRONGER AND I TOOK THE CAR IN FOR REPAIR AT AN INDEPENDENT SERVICE STATION.  I WAS TOLD I NEEDED A NEW GAS TANK.  THE TANK WAS CORRODED AND LEAKING. I HAD THE GAS TANK INSTALLED IN OCTOBER, 2007.  THE CAR HAD 61,000 MILES.  *TR",
        "vin": "KNDJB723715"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2007",
        "dateOfIncident": "06/11/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207029,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL TANK ON MY 2001 KIA SPORTAGE DEVELOPED A FUEL LEAK ON THE BOTTOM OF THE TANK CAUSED BY CORROSION. THIS LEAK HAPPENED ABOUT A YEAR AGO AND I MADE A TEMPORARY REPAIR.  *TR",
        "vin": "KNDJA623415"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2007",
        "dateOfIncident": "10/10/2007",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205816,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  WHILE DRIVING 75 MPH, THE VEHICLE BEGAN TO MAKE A POPPING NOISE UNDER THE HOOD.  THE CHECK ENGINE LIGHT ILLUMINATED, THE VEHICLE WOULD NOT ACCELERATE, AND THE CONTACT SMELLED SMOKE.  THE CONTACT SHUT OFF THE VEHICLE AND ATTEMPTED TO RESTART IT, BUT WAS UNSUCCESSFUL.  THE VEHICLE HAD TO BE TOWED TO THE DEALER.  THE DEALER STATED THAT TWO CYLINDERS AND FOUR SPARK PLUGS WERE BURNT AND DESTROYED.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 85,000.",
        "vin": "KNDJB723715"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2007",
        "dateOfIncident": "10/11/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205452,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED A CONTINUOUS LEAK COMING FROM THE FUEL TANK.  HE ALSO SMELLED GAS WHILE DRIVING AT ANY SPEED.  THE DEALER HAD NOT BEEN NOTIFIED.  THE CURRENT AND FAILURE MILEAGES WERE 72,104.",
        "vin": "KNDJB623X15"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204861,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  WHEN THE HEAT IS ACTIVATED, A STRONG GASEOUS ODOR COMES THROUGH THE VENTS.  THE VEHICLE WAS TAKEN TO A SHOP, BUT THE MECHANIC COULD NOT FIND ANYTHING WRONG.  THE VENTS WERE NOT CLEANED AND NO COMPONENTS WERE REPLACED.  THE VEHICLE WILL BE TAKEN TO A DEALER FOR A DIAGNOSIS.  THE CURRENT MILEAGE WAS 90,000 AND FAILURE MILEAGE WAS 70,000.  THE CONSUMER STATED HAS TO DRIVE WITH THE WINDOWS DOWN DUE TO THE INTENSE ODOR. UPDATED 1/24/08  *TR",
        "vin": "KNDJB723215"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2007",
        "dateOfIncident": "06/06/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201296,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 KIA SPORTAGE EX, IT IS LEAKING GAS FROM THE GAS TANK AREA.   UPDATED 12-12-07.  *KB  THE CONSUMER STATED THE VEHICLE IS AT THE DEALER FOR A REPLACEMENT GAS TANK. UPDATED *JB",
        "vin": "KNDJA723X15"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2007",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199546,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 KIA SPORTAGE.  THE CONTACT SMELLED GAS COMING FROM INSIDE AND OUTSIDE OF THE VEHICLE.  THE DEALER HAS NOT INSPECTED THE VEHICLE.  THE CONTACT'S HUSBAND INSPECTED THE VEHICLE AND NOTICED TWO HOLES IN THE FUEL TANK.  THERE IS AN OPEN DEFECT INVESTIGATION FOR THE FUEL SYSTEM TANK ASSEMBLY (NHTSA CAMPAIGN NUMBER EA06007).  THE FAILURE MILEAGE WAS 42,000 AND CURRENT MILEAGE WAS 52,000.  UPDATED 09/06/07  *TR",
        "vin": "KNDJA723915"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/04/2007",
        "dateOfIncident": "06/30/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195299,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GASOLINE LEAK; FUEL CONTAINMENT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/27/2007",
        "dateOfIncident": "06/26/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194792,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POLYPROPYLENE COOLING FAN BLADE BROKE OFF WHILE I WAS TRAVELING AT 60 MPH ON THE FREEWAY, PUNCTURING THE RADIATOR, BREAKING THE COWLING, AND PUNCTURING A HOSE. THE RESULTS BEING THE SPORTAGE WAS TOWED TO THE REPAIR SHOP AND THE REPAIRS ARE COSTING $500 - $600. THE SPORTAGE IS STILL IN THE SHOP BEING FIXED AS I AM WRITING THIS. THE REPAIR SHOP WILL SAVE THE OLD PARTS FOR ME. I CONTACTED KIA CUSTOMER SERVICE AND THEY RESEARCHED MY VIN NUMBER, WHICH IS OUTSIDE THE WINDOW FOR THE PRESENT RECALL (07V161000). THE SAME PROBLEM THAT IS OCCURRING WITH THE 2002 MODELS IS ALSO HAPPENING WITH THE EARLIER MODELS. I AM SURE I AM NOT THE ONLY ONE WHO HAS HAD TO HAVE THESE REPAIRS MADE.",
        "vin": "KNDJA723115"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/30/2007",
        "dateOfIncident": "03/28/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189323,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 KIA SPORTAGE'S ENGINE WILL SHUT OFF WITHOUT WARNING.  THERE IS NO LOGIC TO THE INCIDENTS: WAITING AT A TRAFFIC SIGNAL, DRIVING IN CITY TRAFFIC, DRIVING AT FREEWAY SPEEDS.  MOVING THE GEAR SHIFT SELECTOR TO NEUTRAL AND TURNING THE IGNITION SWITCH WILL USUALLY RESTART THE ENGINE IN ONE TRY, BUT NOT ALWAYS.  I HAVE REPLACED TWO EMISSION CONTROL SOLENOID VALVES, THE FUEL TANK  AND THE CRANK POSITION SENSOR ON THE RECOMMENDATION OF THE KIA DEALER AND ON-LINE CHATTERS HAVING SIMILAR PROBLEMS QUITE A FEW OF THEM.  A RECENT VISIT TO THE KIA DEALER FOUND O CODES STORED IN THE ON-BOARD DIAGNOSTIC SYSTEM.  THE DEALERSHIP  WILL NOT ACKNOWLEDGE THE PROBLEM.  THE DATE LISTED BELOW WAS AN INCIDENT WITNESSED BY MY PARENTS, ACTUALLY THE FOURTH SUCH OCCURRENCE IN AS MANY DAYS.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, AIR,POWER TRAIN,ELECTRICAL SYSTEM,SEAT BELTS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/19/2007",
        "dateOfIncident": "07/11/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185532,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MT 2001 KIA SPORTAGE IN 2003. IT WAS A 2 DOOR AUTOMATIC SOFT TOP.  THE PROBLEMS WITH THE CAR STARTED WITHIN MONTHS. FIRST THE \"HOLD\" LIGHT WOULD COME ON AND THEN WHILE DRIVING THE CARE WOULD STICK IN ONE GEAR. I COULD NOT SLOW DOWN WITH OUT IT STALLING ONCE THE GEARS GOT STUCK. I TOOK IT TO THE DEALER, AND THE REPLACED THE TRANSMISSION.   THIS DID NOT FIX THE PROBLEM B/C IT STILL HAPPENS EVEN TO THIS DAY AND EVERY PLACE I TAKE IT TO SAYS THAT THERE IS NO PROBLEM.   IN 2005  EVERYTHING STARTED GOING DOWNHILL. THE POWER WINDOWS DONT WORK THE CD PLAYER EATS YOU CDS AND I GET NO RESEPTION ON THE RADIO. NOT TO MENTION THE SEAT BELT LIGHT COMES ON ALL THE TIME AND CONTINUES TO FLASH AND BEEP EVEN WITH YOUR SEAT BELT IS ON. THE PASENGER SEATBELT DOES NOT STAY  CLASPED.  THE CAR WILL SHUT OFF WHILE DRIVING IF I TURN ON THE AIR. THE AIR ONLY BLOWS ON YOUR FEET. MY CAR SHAKES VIOLENTLY IT I GO ABOUT 50  MPH. THE CAR MAKES A WIERD CHATTERING NOISE WHILE DRIVING. AND THE BRAKES HAVE LOCKED UP FOR NO REASON.     ALL OF THESE THINGS I HAVE STATED ARE TRUE AND I HAVE TAKEN MY CAR TO THE DEALERSHIP NUMEROUS OF TIMES AND SEEM TO GET IT \"FIXED\" BUT SOMETHING ELSE HAPPENS BEFORE THE MONTH ENDS. I HAVE HAD MY CAR IN THE SHOP FOR MORE THAN 3 MONTHS TOTAL, AND IT STILL DOESNT RUN PROPERLY. SO FAR I HAVE HAD THE TRAMISSION REPLACED, THE ELECTRICAL HARNESS, THE MASTER AND REAR CYLINDER(2X), WHEEL BARRING, ALTERNATER, STARTED , BATTERIES(4X),AIR VENTS,  AD MANY OTHER THING BUT I CANT KEEP TRACK OF EVERYTHING THAT GOES WRONG WITH THIS CAR. IM A COLLEGE STUDENT THAT HAS A VERY LIMITED INCOME, AND I CANT WASTED ANY MORE TIME AND MONEY DEALING WITH THIS CAR THAT SHOULD LAST LONGER THAN I IS. MY FIRST CAR WAS BETTER THA THIS ONE AND IT WAS MADE IN THE 80'S.",
        "vin": "KNDJB6238Y5"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2007",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178699,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE 4WD DOES NOT ENGAGE. IT WORKED GOOD IN WINTER OF 2005, BUT THIS YEAR FINALLY HAVING SNOW IN JANUARY, I TRIED THE 4WD WITHOUT SUCCESS. THE FRONT DRIVESHAFT SPINS, SO THE TRANSFER CASE WORKS, HOWEVER THE DRIVE ISN'T BEING INITIATED TO THE FRONT WHEELS.  AFTER DOING A LITTLE RESEARCH, I NOTICED THE SAME PROBLEMS OCCURRED TO SAME MAKE AND MODEL, BUT IN A DIFFERENT YEAR. IT IS ALSO STATED THAT THE DOUBLE SEALED HUBS WAS APPARENTLY SUPPOSED TO REMEDY THIS PROBLEM WITH THE HUBS BECOMING FROZEN DUE TO RUST. COULD IT BE POSSIBLE THAT THIS REMEDY DIDN'T ALLEVIATE THE PROBLEM.  *NM",
        "vin": "KNDJA723715"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/14/2006",
        "dateOfIncident": "12/07/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176115,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE BRAKE LIGHT ON THE DASH ILLUMINATED AND THE BRAKE PEDAL DEPRESSED TO THE FLOOR.  BRAKE FLUID WAS ADDED TWICE.  THE VEHICLE WAS DRIVEN TO THE DEALER WHO COULD NOT FIND A LEAK.",
        "vin": "KNDJA723615"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/07/2006",
        "dateOfIncident": "11/07/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172851,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A BAD SMELL COMING FROM THE REAR OF MY VEHICLE.  I TOOK MY VEHICLE TO BE INSPECTED AT TIRES PLUS IN WAUSAU.  THEY INDICATED TO ME THE SMELL WAS CAUSED BY A FAILURE WITH THE FUEL CONTAINMENT AND DISTRIBUTION SYSTEM. *JJB",
        "vin": "KNDJA723215"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/23/2006",
        "dateOfIncident": "09/22/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169036,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 KIA SPORTAGE, 4DR, 4X4, WITH 38,000 MILES.  I AM REPORTING THAT THE FUEL TANK HAS CORRODED AND HAS A LEAK. I WILL BE CALLING THE DEALER FOR ASSISTANCE, IF I DO NOT RECEIVE THE PROPER ASSISTANCE, I WILL BE FILING MORE COMPLAINTS. I AM A SINGLE MOTHER OF ONE, WITH CHILDREN IN THE CAR MANY TIMES PER WEEK, THIS CAR NEEDS TO BE SAFE FOR EVERYONE IN THE VEHICLE. I FEEL WITH A VEHICLE WITH THIS LOW MILEAGE AND JUST 5 YRS.OLD. THIS SHOULD NOT BE HAPPENING SO SOON.    *NM",
        "vin": "KNDJA723415"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/24/2006",
        "dateOfIncident": "08/18/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166399,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2001 KIA SPORTAGE CONVERTIBLE WE BOUGHT FOR OUR 16 YEAR OLD SON TO DRIVE.  ON SEVERAL OCCASIONS WHEN THE CAR GETS BELOW A QUARTER OF A TANK OF GAS IN IT WHEN YOU SLOW DOWN OR STOP TO MAKE A TURN THE CAR CUTS OFF.  THIS HAS POSED A DANGER TO HIM ON MORE THAN ONE OCCASION.  *JB",
        "vin": "KNDJB623515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2006",
        "dateOfIncident": "07/22/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163187,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE IN FOR AN OIL CHANGE, MECHANIC NOTICED LEAK FROM GAS TANK.  RESEARCH SHOWS INVESTIGATION INTO FUEL TANK LEAKAGE.  HAVE APPT. TO REPLACE GAS TANK AT LIA KIA, SCHENECTADY,NY ON 7/25/06.  ADD MY CAR TO THE LIST.  *NM",
        "vin": "KNDJA723215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/14/2006",
        "dateOfIncident": "03/20/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162407,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER WAS TRAVELING FROM BOSTON ON THE MASSACHUSETTS TURNPIKE TOWARD NEW YORK STATE.   AS SHE APPROACHED THE NEW YORK STATE TOLL BOOTHS, BRAKES, STEERING, AND ACCELERATION SUDDENLY FAILED AND THE VEHICLE, A 2001 KIA SPORTAGE WITH 66,018 MILES BEGAN SMOKING.  THE DRIVER MANAGED TO TURN SLIGHTLY TO AVOID CRASHING INTO THE TOLL BOOTHS AND FOUND HERSELF HEADED FOR A LARGE PROPANE TANK ON THE GROUNDS.  SHE PULLED THE EMERGENCY BRAKE AND MANAGED TO STOP WITHIN A FEW FEET OF THE TANK.  BELIEVING THE CAR TO BE ON FIRE, SHE EXITED QUICKLY.  THE CAR WAS TOWED TO LIA KIA IN SCHENECTADY, NEW YORK.  THE ALLSTATE INSURANCE INVESTIGATOR AND THE MECHANIC AGREED THAT THE FAN CLUTCH HAD BROKEN OFF AND MOVED THROUGHOUT THE AREA UNDER THE HOOD, CAUSING EXTENSIVE DAMAGE.  THE ALLSTATE INVESTIGATOR HAS PICTURES OF THE FAN CLUTCH AND DAMAGE.  INSURANCE DID NOT PAY BECAUSE THE PROBLEM WAS A DEFECTIVE PART.  THE ESTIMATED REPAIR WAS $4500.00.  THE  VEHICLE REMAINED AT LIA KIA WHILE THE NATIONAL KIA HEADQUARTERS WAS CONTACTED.   MR. RYAN CHRISTIANSON WAS THE CONTACT THERE.  HE MAINTAINED THAT THE VEHICLE WAS OUT OF WARRANTY, SO KIA HAD NO RESPONSIBILITY. HE SUGGESTED THAT THE VEHICLE MAY NOT HAVE BEEN MAINTAINED PROPERLY AND WANTED ALL PAST RECORDS SENT TO HIM, UNTIL HE WAS INFORMED THAT THERE WERE PICTURES AT ALLSTATE. VERBAL AND WRITTEN COMMUNICATION ARE AVAILABLE.  THE FACT THAT THERE WAS VERY NEARLY  A CATASTROPHIC ACCIDENT WHICH WOULD HAVE INVOLVED MANY VEHICLES AND INDIVIDUALS WAS POINTED OUT TO HIM.   THE VEHICLE REMAINED AT LIA KIA UNTIL  MAY, WHEN THEY BEGAN TO DEMAND RENT.  WITH NO APPARENT REMAINING OPTIONS, THE VEHICLE WAS REPAIRED AT A COST OF $4595.99 AND DRIVEN HOME ON MAY 19, 2006.  THERE WAS SOME DIFFICULTY DRIVING HOME AND THE VEHICLE WAS TAKEN TO LEGACY KIA IN E. SYRACUSE, NEW YORK, THE ORIGINAL PURCHASE SITE, WHERE THE THERMOSTAT WAS REPAIRED AT A FURTHER COST OF $306.13.  ITEMIZED LISTS OF ALL REPAIRS ARE AVAILABLE.  *JB",
        "vin": "KNDJA723515"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/22/2006",
        "dateOfIncident": "02/16/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150878,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 10MPH IN SNOWY CONDITIONS, THE RIGHT FRONT WHEEL DISLODGED FROM THE AXLE.  THE VEHICLE WAS IN 4 WHEEL DRIVE WHEN THE INCIDENT OCCURRED.  IT WAS PULLED TO THE SIDE OF THE ROAD SAFELY AND WAS TOWED TO THE DEALERSHIP FOR INSPECTION.  THE VEHICLE RECEIVED REGULAR MAINTENANCE AND INSPECTION, AND HAD PASSED STATE INSPECTION IN JUNE 2005 AT 32,000 MILES.  THE VEHICLE IS CURRENTLY AT THE DEALER AWAITING REPAIRS.",
        "vin": "KNDJA723815"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "01/23/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148392,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE CHECK ENGINE LIGHT  HAS BEEN ILLUMINATING AND THE TRANSMISSION HAS HAD FAILURES IN SHIFTING GEARS SINCE THE VEHICLE WAS PURCHASED.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP. THE ECT CONNECTOR HAS BEEN REPLACED AND THE SENSOR HAS BEEN REPROGRAMMED MULTIPLE TIMES.  THE PROBLEM PERSISTS DESPITE THE REPAIRS.  THE THERMOSTAT WAS REPLACED. UPDATED 02/13/06. *JB",
        "vin": "KNDJA723615"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2006",
        "dateOfIncident": "12/27/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146955,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED ONE YEAR AGO THE VEHICLE WAS TAKEN  TO THE DEALERSHIP FOR AN OIL CHANGE , AND  AN ODOR OF GAS  APPEARED WHEN THE HEATER WAS SWITCHED ON. THE DEALER DISCOVERED THE FUEL INJECTORS WERE CORRODED AND FUEL WAS LEAKING FROM  THE INJECTORS, FUEL LINE, AND THE PRESSURE REGULATOR. AND REPLACED. THEM.  THE REPLACEMENTS WERE TEMPORARY BECAUSE THE PROBLEM  RECURRED AND THE PARTS  WERE ON BACK ORDER. *AK",
        "vin": "KNDJA723315"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/13/2005",
        "dateOfIncident": "02/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145118,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED  ENGINE LIGHT  ILLUMINATED INTERMITTENTLY AND THE RPM GAUGE WAS READING INCORRECTLY,  EITHER VERY HIGH OR NOT READING AT ALL WHEN THE SAME AMOUNT OF PRESSURE WAS APPLIED TO THE ACCELERATOR PEDAL.  ALSO, THE EXHAUST WAS GLOWING RED UNDERNEATH THE VEHICLE. THE CONTACT TOOK THE  VEHICLE TO THE DEALERSHIP EIGHT TIMES, AND  THEY HAVE BEEN UNABLE TO DIAGNOSIS THE PROBLEM. *AK",
        "vin": "KNDJB723215"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/17/2005",
        "dateOfIncident": "08/15/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139863,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE 4 DR WITH 50,000 MILES  FAILED INSPECTION BECAUSE OF BROKEN WHEEL BEARING AND RIGHT IDLER ARM.  I HAD THESE REPAIRED, FORTUNATELY, UNDER WARRANTY.    I'M DISAPPOINTED AND ANGRY THAT SUCH CHEAP PARTS WERE USED IN MANUFACTURING (DISCOVERED BROKEN AT 50,000 MILES) WHICH GREATLY INCREASES THE RISK FOR AN ACCIDENT.  NOT A SAFE VEHICLE AND WILL NOT BUY ANOTHER BASED ON THE QUALITY OF THE MANUFACTURING.   *NM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2005",
        "dateOfIncident": "06/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139324,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATES THAT 2001 KIA SPORTAGE WAS HAVING A PROBLEM WITH THE GAS LINE. WHEN THE  CONSUMER  PUT GAS INTO THE GAS TANK THE GAS WAS LEAKING FROM UNDERNEATH THE VEHICLE. THE CHARCOAL BOX HAS BEEN CHANGED. THE GAS WAS SHOOTING OUT BACK TOWARD THE PERSON PUTTING THE GAS IN THE TANK. THE VEHICLE HAS BEEN IN THE SHOP THREE TIMES OVER THE SAMETHING. THE OTHER TWO TIMES THAT THE CONSUMER  BROUGHT THE VEHICLE BACK HOME FROM THE DEALERSHIP IT  WAS OKAY FOR A FEW DAYS.  THE DEALERSHIP WAS TRYING TO FIX THE VEHICLE. IT WILL RUN FOR A COUPLE OF DAYS, AND WHEN  GOING TO GET GAS THE VEHICLE WILL ONLY HOLD $4 WORTH OF GAS. AFTERRWARDS  THE GAS  WOULD  SHOOT OUT OF THE FILLER PIPE. THE VEHICLE I STALLED WHILE DRIVING. WHEN  STOPPING  AT A STOP SIGN THE VEHICLE DIED AND THEN STARTED RIGHT BACK UP. KIA SAID  THAT SHE MAY BE OVERFILLING THE TANK. KIACHECKED VARIOUS PARTS AND THE VEHICLE WILL STILL NOT RUN CORRECTLY. TH ECONSUMER  REMOVED THE VEHICLE  OUT OF THE SHOP LAST WEEK, AND IT  HAD TO BE TOWED LAST NIGHT BACK TO THE DEALERSHIP. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137910,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A KIA 2001 ON 7/13/2005 AND SINCE THEN I HAD TO TAKE IT BACK 4 TIMES. THE ENGINE CHECK LIGHT COMES ON ALONG WITH THE BRAKE LIGHT AND ONCE THE HOLD LIGHT. THE CAR HAS ONLY 34,500 MILES ON IT! THIS IS A 2001 4X4 SPORTAGE AND ITS VERY STRESSFUL .*JB",
        "vin": "KNDJA723615"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "08/26/2005",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10134293,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN MY 2001 KIA SPORTAGE AND WAS INVOLVED IN A SINGLE AUTOMOBILE ACCIDENT ON 7/20/05. I WAS DRIVING APPROXIMATELY 5 MPH WHEN THE BOLT THAT HOLDS THE ROCKER ARM OF MY ENGINE SHEARED OFF AND THE ENGINE DROPPED DOWN ON THE LEFT HAND SIDE (DRIVER'S SIDE OF MY VEHICLE) AND FELL ONTO THE DRIVE TRAIN AND AXLE, CRUSHING EVERYTHING IT HIT. I WAS INJURED IN THIS ACCIDENT, AS WELL, AND KIA IS BEING EXTREMELY DIFFICULT ABOUT FIXING MY VEHICLE. IF I HAD BEEN DRIVING ANY FASTER, LIKE I HAD BEEN ONLY MINUTES EARLIER, THE ENGINE COULD HAVE BEEN YANKED FROM UNDERNEATH THE SUV AND SEPARATED FROM MY VEHICLE, LEAVING ME STRAPPED INTO THE FRAME OF MY CAR WITH NO ENGINE IN IT AND FREE ROLLING IN THE FRAME. IT IS HIGHLY FORTUNATE THAT I WAS NOT KILLED IN THIS ACCIDENT BECAUSE IT CERTAINLY COULD HAVE BEEN A POSSIBILITY. INITIALLY, THE LOCAL DEALER WENT AHEAD AND REPAIRED THE AXLE, DRIVE TRAIN, AND ENGINE MOUNT REPAIRS; HOWEVER, MY FRAME IS BENT BADLY ON MY VEHICLE AND THE LOCAL DEALER SAYS THAT THEY DO NOT REPAIR THIS TYPE OF PROBLEM. AFTER REPORTING THE ACCIDENT, THEN GOING BACK AND FORTH BEING PUT OFF MULTIPLE TIMES BY KIA CORPORATE, I NOW STILL HAVE NO VEHICLE FIVE WEEKS AFTER THE ACCIDENT. KIA CUSTOMER SERVICE TOLD THAT SEVERAL INDIVIDUALS HAD MY CASE AND THAT THEY WOULD CALL ME. THEY NEVER DID UNTIL LAST NIGHT WHEN THE KIA CORPORATE NATIONAL CONSUMER AFFAIRS MANAGER LEFT ME A MESSAGE AT HOME WHILE I WAS AT DINNER.  THIS IS THE FIRST PERSON TO CALL ME IN FIVE WEEKS, ASIDE FROM THE LOCAL DEALERSHIP.  I AM EXTREMELY CONCERNED ABOUT THE SAFETY OF MY VEHICLE GOING FORWARD AND MY INSURANCE COMPANY, USAA, IS NOT WILLING TO HELP ME WITH THIS CASE BECAUSE EVEN THOUGH I REPORTED THE ACCIDENT WITHIN MINUTES OF IT HAPPENING, THEY DID NOT FOLLOW THROUGH AND NOW THEY ARE SAYING THAT SINCE KIA TOUCHED THE VEHICLE AND MADE REPAIRS BEFORE THEY COULD LOOK AT THE EXACT NATURE OF THE DAMAGES THEY CANNOT HELP ME WITH THIS PROBLEM.  CALL LOGS AND ALL RELATED PAPERWORK IS AVAILABLE IF NEEDED.  *JB",
        "vin": "KNDJA723315"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/19/2005",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129298,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER STATES THAT THE TIRE LATCH ON THE BACK OF  2001 KIA SPORTAGE I BROKE. THIS WAS LATCH THAT HELD THE SPARE TIRE CARRIER, IT ALSO HAS TO OPEN IN ORDER FOR THE CONSUMER TO OPEN  TRUCK. THE OWNERS MECHANIC HAS OILED AND FIXED THE TIRE CARRIER FOR A TEMPORARY FIX. THE OWNER HAS TAKEN THE VEHICLE TO THE DEALERSHIP FOR REPAIRS, AND THEY SAID THEY COULD NOT FIND ANYTHING WRONG WITH THE VEHICLE AND COULDN'T FIX THE LATCH UNTIL IT WAS BROKEN, AND THEN THEY COULD REPAIR IT. THE OWNER HAS NOT CALLED KIA. THE LATCH HAS BEEN BROKEN FOR ABOUT 2 MONTHS. THE OWNER SUGGESTED THAT THE LATCH COULD HAVE ROTTED OUT. THE OWNER HAD TAKEN THE VEHICLE  LAST YEAR ON JUNE 12, 2004 TO HAVE THE TAIL PIPE FIXED. THE KIA DEALERSHIP BODY SHOP THAT WAS SUPPOSE TO FIX THE TAILPIPE, DID NOT REPAIR THE TAILPIPE. THE CAR WAS RATTLING FROM THE EXHAUST. THE OWNER'S MECHANIC REMOVED THE ROTTED EXHAUST SYSTEM, THE KIA DEALERSHIP WAS SUPPOSE TO FIX THIS AND DID NOT AT THIS POINT THE VEHICLE ON HAD 13,623 MILES ON IT AT THIS POINT. THE DEALER IS NO LONGER WITH THE ADDRESS OR PHONE NUMBER THEY CLOSED DOWN.*AK",
        "vin": "KNDJA723515"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/10/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124982,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SUNROOF LATCH HAS BECOME DETACHED FROM THE SUNROOF GLASS TWICE. FIRST TIME HAD IT GLUED BACK ON TO SUNROOF. SECOND TIME THE PART DISAPPEAR (PROBABLY BLEW AWAY WHILE SUNROOF WAS OPEN). CAN'T FIND REPLACEMENT PART.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/26/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122633,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE TEMPERATURE GAUGE NEVER REGISTERED THAT THE ENGINE WAS RUNNING HOT.  THE CONSUMER HAD TO HAVE THE ENGINE REPLACED.*MR  THE COOLANT SENSOR MALFUNCTIONED, THE REAR HATCH PANEL INSIDE FELL OFF, NEW CLIPS WERE INSTALLED.  REPLACED MANUAL TRANSMISSION CLUTCH, TIMING BELT WAS REPLACED, WIND NOISE FROM FRONT PASSENGER SIDE DOOR AREA.    *BF",
        "vin": "KNDJA723515"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "02/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117102,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN PUMPING FUEL INTO THE VEHICLE, FUEL SPRAYS OUT ONTO THE GROUND.  THE DEALER STATES THAT THE FUEL TANK NEEDED TO BE REPLACED.   *AK   THE BACK PRESSURE WAS CAUSING THE GASOLINE TO SPLASH BACK AND THE PUMP NOZZLE WOULD SHUT OFF.  IT WAS DETERMINED THAT ICE AND SNOW HAD BUILT UP ON TOP OF THE GAS TANK AND CAUSED THE ORVR VALVE TO STICK.  THE ICE AND SNOW WAS REMOVED AND EVERYTHING WAS FINE FOR A WEEK BUT THE PROBLEM RECURRED.  THE SCREWS HOLDING THE PUMP ONTO THE FUEL TANK WERE BREAKING THEREFORE THE FUEL TANK WAS REPLACED ALONG WITH THE ORVR.   *SC",
        "vin": "KNDJA723X15"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/02/2005",
        "dateOfIncident": "04/24/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10118804,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON APRIL 24, 2005 COLUMBUS OHIO HAD POOR WEATHER CONDITIONS ;SNOW AND ICY RAIN.  I WAS TRAVELING ON S.R. 104  EXITING ON HIGH ST. I APPLIED PRESSURE TO THE BRAKES AND FISH TAILED MY 2001 KIA SPORTAGE. I HIT THE GUARD RAIL AND THE CAR ROLLED OVER. THE FRONT BUMPER HAD HIT THE GUARD RAIL AND WAS ACTUALLY OFF THE CAR BY THE TIME I UPRIGHTED THE VEHICLE AGAIN. THE KIA SPORTAGE IS EQUIPPED WITH 3 AIRBAGS;THE FRONT DRIVER FRONT PASSENGER AND A DRIVER KNEE AIRBAG, NONE OF WHICH DEPLOYED. THE PASSENGER SIDE DOOR WAS OFF THE CAR AS WELL WHEN I UPRIGHTED, AND AGAIN, NONE OF THE AIRBAGS, INCLUDING THE PASSENGER SIDE DEPLOYED. MY 2 YEAR OLD SON WAS ALSO IN THE CAR, IN A CARSEAT IN THE BACK PASSENGER SIDE. HE  THANKFULLY SUFFERED NO INJURY, BUT THAT PART OF THE CAR RECIEVED THE LEAST DAMAGE.",
        "vin": "KNDJA723615"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/29/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117452,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE SUFFERED TWO COMPLETE ENGINE FAILURES.*MR  ALONG WITH THE ENGINE FAILURES, THERE WERE PROBLEMS WITH THE RADIO, BATTERY AND THE TERMINALS, FRONT BRAKES, A SENSOR KNOCK, EXHAUST SYSTEM, AIR CONDITION, VALVE COVER GASKET, FRONT WHEEL BEARINGS, FRONT PADS AND ROTORS, CRUISE CONTROL, AND A DEFECTIVE IDLER ARM.  *JB",
        "vin": "KNDJA723215"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/10/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115127,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE,  STOPPED DEAD IN THE MIDDLE OF A MAJOR HIGHWAY.  *BF  THE CONSUMER WAS UNABLE TO GET A FULL ALIGNMENT BECAUSE THE IDLER WAS DEFECTIVE, ON 2 OCCASIONS THE VEHICLE WOULD NOT START AND IT HAD TO BE JUMP STARTED, WHICH WAS DUE TO DEFECTIVE BATTERY TERMINALS, THE RADIO, FONT BRAKES EXHAUST SYSTEM, AIR CONDITION VALVE COVER GASKET, FRONT WHEEL BEARING, CRUISE CONTROL  WERE ALL INOPERATIVE, THE VEHICLE HAS HAD 2 ENGINE  REPLACEMENTS, AND THE DRIVE BELTS WERE OUT OF TENSION. *JB",
        "vin": "KNDJA723215"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,VISIBILITY,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "09/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109781,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUAL  PROBLEMS WITH 2001 KIA SPORTAGE CONVERTIBLE.   REPLACEMENT OF BRAKES 5 TIMES, REPLACEMENT OF BELTS 6 TIMES AND 14 OTHER PROBLEMS.  *BF  THE CUP HOLDER, CONVERTIBLE TOP, AND  BELTS WERE REPLACED. THE ALARM WIRES WERE RE-ADJUSTED, THE AC COMPRESSOR, IGNITION COIL PACK, CD PLAYER RIGHT REAR AXLE, RIGHT FRONT STRUT, CATALYTIC CONVERTER, CENTER CONSOLE, REAR WINDOW FUSE, SPARK PLUG AND ENGINE HARNESS WERE ALL REPLACED NUMEROUS TIMES.  *JB  *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/23/2005",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107774,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A KIA SPORTAGE FROM A DEALERSHIP WHO SAID THE VEHICLE STILL HAD ITS FULL POWER TRAIN WARRANTY BUMPER TO BUMPER FOR 7 YEARS. THE KIA HAS LOW MILEAGE AND STILL DOES DUE TO THE FACT IT HAS BEEN SETTING AT THE KIA GARAGE AND THEY WILL NOT DO ANYTHING TO THE VEHICLE. THE VEHICLE HAD MULTIPLE ISSUES WITH PROBLEMS FROM THE EXHAUST, FRONT SUSPENSION, MOTO, AND THE 4WD TRANSFER SYSTEM. I CANNOT GET THE KIA DEALERSHIP TO FIX THE VEHICLE SAYING THEY CANNOT REPLICATE THE PROBLEM. I HAVE HAD TO PAY MY LOCAL MECHANIC $100.00 TO FIND THE PROBLEMS AND SAID THEY DEFINITELY NEEDED FIXING OR THE VEHICLE WOULD RUN INTO MORE EXPENSE AS TIME LINGERS ON. THE HEAD GASKET IS BLOWN AND LEAKING OIL, LOOSING COMPRESSION AND EVENTUALLY THE MOTOR WILL FAIL TO OPERATE. MY WIFE HAS A QUADRIPLEGIC DAUGHTER WHO NEEDS AROUND THE CLOCK ATTENTION AND SHE NEEDS THE VEHICLE TO TRANSPORT HER BACK AND FORTH TO THE HOSPITAL TWICE MONTHLY, AND SHE ATTENDS CHURCH WITH HER DAUGHTER SEVERAL TIMES PER MONTH AS WELL. I AM AFRAID THAT THE VEHICLE IS GOING TO MALFUNCTION WITH HER DAUGHTER INSIDE AND IF SHE GETS COLD THEN SHE FACES POSSIBLE SOCK, PNEUMONIA AND IS EXTREMELY SUSPECTIBLE TO ANY KIND OF SICKNESS. KIA MOTORS HAS FOUGHT ME AS WELL AS THEIR SAFETY HOOK, LINE AND SINKER TRYING TO SAVE THEM A BUCK. IF THERE IS SOMEONE OUT THERE WHO WILL LISTEN TO MY COMPLAINT PLEASE CONTACT KIA AND TELL THEM TO FIX THIS VEHICLE OR RECOMMED SOMEONE WHO WILL TAKE THEM TO COURT TO BRING JUSTICE INTO THIS ISSUE.  *JB",
        "vin": "KNDJA723015"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2005",
        "dateOfIncident": "01/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106022,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY KIA SPORTAGE 4WD JUST RECENTLY TRIPPED 100,000 AND NOW EVERYTHING APPEARS TO BE GOING WRONG.  THE CHECK ENGINE LIGHT CAME ON AND THE ENGINE SUDDENLY BEGAN LOSING POWER.  THE FIRST DAY IT STRUGGLED ONLY AT START OFF ACCELERATION AND UP HILLS.  THE SECOND DAY IT STALLED WHILE BEING STARTED AND STRUGGLED AT ACCELERATION EVEN ON FLAT HIGHWAY.  NOW, JUST 5 DAYS LATER, IT WON'T GO ABOVE 40MPH AND LOSES POWER WHEN YOU APPLY THE GAS PEDAL.  THERE IS A STRONG BURNT RUBBER SMELL THAT WE'VE NOTICED  FOR SOME TIME.  THE FIRST TIME WE NOTICED IT, THE DEALERSHIP SAID NOTHING WAS WRONG.  NOW WE ARE OUT OF WARRANTY.  NOT ONLY IS THE CHECK ENGINE LIGHT ON, BUT TODAY, THE HOLD LIGHT BEGAN TO FLASH.  ACCORDING TO THE BOOK, THIS DEPICTS AN ELECTRICAL PROBLEM WITH THE TRANSMISSION.  WE CALLED THE DEALERSHIP ON, BUT HAVE NOT RECEIVED A PHONE CALL IN RETURN.  I AM UNABLE TO DRIVE MY CAR TO WORK, WHICH PUTS STRAIN ON MY FAMILY AND MY SELF.  BEING PREGNANT, I NEED MY OWN VEHICLE.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "01/07/2005",
        "dateOfIncident": "04/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105929,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 KIA SPORTAGE HAS A DEFECT IN ITS DESIGN. THE SOLENOID, & HOSES THAT CONNECT TO IT ARE PLACED IN AN AREA ON THE VEHICLE WHERE THEY ARE SUBJECTED TO THE ELEMENTS-&-IN HARMS WAY OF BEING DAMAGED FROM NORMAL DRIVING CONDITIONS. I DO NOT HAVE THE SERVICE PAPER WORK ON ME, AT THE MOMENT (I AM AT THE PUBLIC LIBRARY-DOING RESEARCH ON KIA'S MANY SAFETY ISSUES)-IF YOU NEED COPIES OF MY SERVICE RECORDS, OR ANY FURTHER INFO-PLEASE CONTACT ME BY MAIL.  WHEN SOLENOID/HOSES FAILED - I WAS UNAWARE THAT MY 4 WHEEL DRIVE WAS INOPERABLE. THERE WERE MANY TIMES, IN THE WINTER MONTHS- WHERE MY KIA WOULD SLIP/SLIDE-HANDLE ERRATICALLY IN THE SNOW/RAIN. I HAVE LOST TRACK OF THE TIMES I LOST CONTROL OF MY VEHICLE DURING THIS TIME FRAME (2001-2004). NOW I REALIZE THAT IT WAS DUE TO THE 4 WHEEL DRIVE MALFUNCTIONING. I WAS LUCKY ENOUGH TO HAVE JUST SPUN OUT-WITH NO ONE ELSE HITTING ME; THANK GOD FOR THAT. THE SPORTAGE IS VERY UNSAFE TO DRIVE-WHEN IT IS RAINING/SNOWING-IT'S WHEEL BASE MAKES IT DANGEROUS.  THE FIRST SERVICE MANAGER REFUSED TO FIX IT UNDER KIA'S 10 YEAR/ 100,000 COVERAGE-SO I HAD TO PAY $85 TO FIX IT. IT WORKED TWO MORE TIMES, AND NOW THE HUBS ARE SHOT (AFTER A MERE 29,000 MILES). I WAS NAIVE ABOUT KIA'S RECORD AT THE TIME. I HAVE SEEN THOUSANDS OF COMPLAINTS ON THE INTERNET ABOUT KIA NOW- AND I WANT THE TRUTH ABOUT THEM TO COME OUT.  I HAVE CONTACED KIA ABOUT MY PROBLEM(S) MANY TIMES. THEY ARE VERY SMUG, AND KNOWLEGEABLE ABOUT WHAT THEY DO NOT HAVE TO DO FOR YOU. IF THEY SPENT 1/2 THE MONEY THAT THEY DID ON HAVING A SLICK LAW FIRM WRITE THEIR 10 YEAR COVERAGE PLAN-AS THEY DID MAKING A SAFE/RELIABLE VEHICLE-MANY PEOPLE WOULD BE MUCH SAFER FOR IT.  *AK",
        "vin": "KNDJA623115"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/28/2004",
        "dateOfIncident": "11/23/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10104663,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS TRAVELING ABOUT 35 MPH.  TWO VEHICLES IN FRONT OF ME COLLIDED AND THEN BOTH SLID INTO ME HEAD ON.  DAMAGE TO MY VEHICLE WAS IN EXCESS OF $5,000.  NEITHER AIR BAG DEPLOYED.  DRIVER AND FRONT PASSENGER SUSTAINED MINOR SOFT TISSUE INJURIES.  *JB",
        "vin": "KNDJA723815"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TIRES",
        "crash": false,
        "dateComplaintFiled": "11/28/2004",
        "dateOfIncident": "11/21/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100671,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "HANKOOK TIRE MFG. CO.",
                "productMake": "HANKOOK",
                "productModel": "HANKOOK",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "UNDER NORMAL DRIVING CONDITIONS, FORTUNATELY HAPPENED AT A PARKING LOT, BRAKE PEDAL WENT TO THE FLOOR. INITIAL INVESTIGATION REVEALED LEAKING BRAKE FLUID. FURTHER INVESTIGATION REVEALED THIS HOSE, NON-REINFORCED IN ANY WAY HAD SPLIT AT BOTH ENDS OF CONNECTION TO METAL TUBE. TUBE IS APPROXIMATELY 1/8\" OD MAKING ID OF HOSE APPROXIMATELY 1/8\". WALL OF HOSE IS VERY THIN PERHAPS 1/16\" OR LESS. THIS HOSE IS VERY FLEXIBLE BEING QUITE SIMILAR TO VACUUM HOSE AND MUST BE UNDER HIGH PRESSURE FROM THE BRAKING SYSTEM. THIS IS EXTREMELY HAZARDOUS.HAD THIS VEHICLE BEEN TRAVELING ON THE ROAD AT A HIGHER RATE OF SPEED AND THE BRAKE PETAL GONE TO THE FLOOR AS IT DID WHEN LEAVING A PARKING SPACE A DANGEROUS ACCIDENT COULD EASILY AND MOST PROBABLY WOULD HAVE OCCURED. WHEN CHECKING THE SAME HOSE ON THE OTHER SIDE OF THE VEHICLE THE HOSE ON THE FRONT DRIVERS SIDE IS SPLIT ALSO. THERE IS NO CLAMP HOLDING THIOS HOSE IN PLACE. IT MERELY SLIPS ONTO METAL TUBE ON BOTH ENDS AND IS SPLIT AT THE END OF THE CONNECTION SITH EACH TUBE-THATS FOUR HOLES (TWO TUBES). I CANNOT EVEN BEGIN TO IMAGINE THE REPERCUSSIONS OF THIS POOR ENGINEERING DESIGN. STEP ON THE PETAL AND BRAKE FLUID POURS OUT OF THE SPLITS. THIS COULD HAPPEN AT ANY TIME. VERY, VERY POOR DESIGN. THIS REQUIRES IMMEDIATE ACTION.   *AK",
        "vin": "KNDJA723615"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "07/22/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101096,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S ENGINE AND A/C FAILED.  *NM  THE CONSUMER HAD TO REPLACE TWO ENGINES WITHIN A 40000 MILE USAGE.  THE VEHICLE STOPPED DEAD ON A VERY BUSY US ROUTE 1 HWY.   THE SUDDEN STOP CAUSED A TRAFFIC TIE UP AND THE VEHICLE WAS NEARLY REAR ENDED BY A AIR CONDITIONING, THE VEHICLE NEEDED A COMPLETE ENGINE REPLACEMENT, VALVE COVER GASKET, FRONT WHEEL BEARINGS, DRIVE BELTS OUT OF TENSION, CRUISE CONTROL, V BELTS REPLACED, BRAKES AND ROTORS, EXHAUST SYSTEM.  *TC   *JB",
        "vin": "KNDJA723215"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/21/2004",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090184,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CHECK ENGINE LIGHT ILLUMINATED ON DASHBOARD. DUE TO FUEL CONTAMINATION COATING IN THE FUEL TANK PEELED AND WAS COMING OFF, CLOGGING THE FUEL FILTER. *AK  THE CONSUMER STATED THAT THE VEHICLE LOST POWER.   *TC",
        "vin": "KNDJA623115"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "08/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092032,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN FOUR WHEEL DRIVE REAR WHEEL SLIPPED. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "04/20/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087892,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  VEHICLE SHIMMIED AND VIBRATED UNCONTROLLABLY.  VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION, AND MECHANIC  DETERMINED THAT  TRANSMISSION NEEDED TO BE REPLACED. *AK",
        "vin": "KNDJA723X15"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087894,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED THAT THE REAR PASSENGER  SIDE AND DRIVER SIDE SEAT BELT WEBBING WAS CORRODED.  CONSUMER DROVE THE VEHICLE TO THE DEALER FOR INSPECTION, AND  MECHANIC  DETERMINED THAT THE SEAT BELTS  NEEDED TO BE REPLACED, AND REPLACED IT.  HOWEVER, THE PROBLEM RECURRED. VEHICLE WAS TAKEN BACK TO THE DEALER FOR INSPECTION NUMEROUS TIMES, AND DETERMINED THAT THE SEAT BELTS NEEDED TO BE REPLACED AGAIN.  *AK",
        "vin": "KNDJA723X15"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "05/20/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087897,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER APPLIED THE BRAKE PEDAL AND THE BRAKES FAILED.  CONSUMER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE, AND DROVE IT TO THE DEALER FOR INSPECTION.   MECHANIC DETERMINED THAT THE ROTORS NEEDED TO BE REPLACED, AND REPLACED THEM.  HOWEVER, THE PROBLEM RECURRED, AND  VEHICLE WAS TAKEN BACK TO THE DEALER FOR INSPECTION.  MECHANIC DETERMINED THAT THE ROTORS NEEDED TO BE REPLACED AGAIN.   *AK",
        "vin": "KNDJA723X15"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087900,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS TAKEN TO THE DEALER FOR A ROUTINE INSPECTION, AND MECHANIC DETERMINED THAT FLUID WAS LEAKING FROM UNDERNEATH THE VEHICLE, AND THAT THE HEAD GASKET NEEDED TO BE REPLACED. *AK",
        "vin": "KNDJA723X15"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/26/2004",
        "dateOfIncident": "07/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083971,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH VEHICLE STARTING UP AS WELL AS STALLING.   *MR   THE VEHICLE WAS HARD TO START  AND THE GAS MILEAGE WAS DROPPING WAY DOWN AND THE VEHICLE WAS TAKEN IN FOR A TUNE UP BUT THE PROBLEM STILL EXISTED.  WHEN THE VEHICLE WAS DRIVEN ON THE EXPRESSWAY, THE CONSUMER HIT A BUMP AND THE ENGINE STALLED.  THE CONSUMER WAS INFORMED THAT THE TRANSMISSION HAD TO BE SERVICED.  THE FILLER NECK RUSTED AND THE FUEL CAP WAS LEAKING.  THE FILLER NECK WAS REPLACED, BUT IMMEDIATELY AFTER THE PROBLEM RECURRED.  THE TRANSMISSION FLUID WAS WORN AND THE TRANSMISSION WAS FLUSHED.   *SC  *JB",
        "vin": "KNDJB723015"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/14/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081035,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK WOULD NOT START AT TIMES AND KEPT BLOWING FUSES.. DEALER FOUND PROBLEM TO BE IN THE ENGINE HARNESS CONNECTOR. ALSO IN 10/03, ONE NIGHT WHILE I WAS DRIVING HOME FROM WORK LATE, MY TRUCK STULLED ON ME, AND THE SHIFTER WAS VERY LOOSE, TOOK TO DEALER  AND THEY REPLACED THE DRIVE SHAFT AND REAR MAIN SEAL (X3). THEY HAVE ALSO REPLACED THE CAT.CONVERTOR X3, TIMING BELT DUE TO ABNORMAL STRECHING,AND 2 IGNITION COILS.*AK",
        "vin": "KNDJB723515"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/13/2004",
        "dateOfIncident": "07/13/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081805,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HAD VEHICLE TOWED TO THE DEALER AFTER THE CHECK  ENGINE LIGHT CAME ON.   ENGINE  COIL  BECAME DEFECTIVE, AND  BROKE INTO TWO PARTS.  DEALER CONTACTED THE CONSUMER TO INFORM HIM THAT THEY REPLACED THE COIL WITH THE SAME ONE THAT CAME OUT OF THE VEHICLE.  *AK",
        "vin": "KNDJB723815"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/08/2004",
        "dateOfIncident": "07/07/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080606,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 7TH, MY VEHICLE WAS TAKEN TO HARRIS KIA IN LANSDALE BECAUSE THE 2001 KIA SPORTAGE WAS VIBRATING WHEN THE BRAKES WERE APPLIED. IT WAS FOUND THAT BOTH FRONT ROTORS WERE WARPED AFTER ONLY 19,000 MILES. UNDER NORMAL DRIVING CONDITIONS, ROTORS SHOULD LAST 60,000 MILES. KIA HAS SERIOUS PROBLEM, THESE ROTORS ARE DEFECTIVE AND SHOULD BE RECALLED IMMEDIATELY.*AK",
        "vin": "KNDJA723225"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074175,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STARTING UP THE VEHICLE IT FAILED TO TURN ON.  CONSUMER  TRIED NUMEROUS TIMES BUT VEHICLE WAS INOPERATIVE.  CONSUMER CONTACTED KIAS ROAD SIDE ASSISTANT, AND TECHNICIAN  DISCONNECTED A WIRE FROM THE ELECTRICAL KYLAS  REMOTE CONTROL SYSTEM.  THIS CAUSED THE KYLAS REMOTE CONTROL SYSTEM TO DEACTIVATE.  THEN, CONSUMER WAS ABLE TO START THE VEHICLE.  SINCE THEN  CONSUMER  HAD NO PROBLEM WITH THE VEHICLE.  CONSUMER CONTACTED THE DEALER, AND WAS ADVISED TO KEEP THE KYLAS  REMOTE CONTROL SYSTEM IN THE VEHICLE.  *AK",
        "vin": "KNDJA723715"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/21/2004",
        "dateOfIncident": "05/08/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072946,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I REAR ENDED ANOTHER CAR ON THE HIGHWAY GOING APPROX. 10-15 MILES AN HOUR. THE AIRBAG SENSOR WAS SMASHED AND NEITHER AIRBAGS DEPLOYED. I WAS TOLD IN THE BEGINNING THAT THE AIRBAG MISFIRED AND WENT OFF INSIDE THE DASHBOARD. NOW THEY ARE UNABLE TO TELL ME WETHER THE AIRBAGS DEPLOYED OR NOT AND THEY DO NOT KNOW IF THEY ARE EVEN GOING TO FIX THEM. I AM LIVID!*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/07/2004",
        "dateOfIncident": "05/07/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072294,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "HANKOOK TIRE MFG. CO.",
                "productMake": "HANKOOK",
                "productModel": "DYNAMIC RADIAL Z36 TIR",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING 70 MPH PASSENGER REAR SIDE TIRE BLEW OUT.  CONSUMER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE, AND PULLED OVER.  VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION. *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/19/2004",
        "dateOfIncident": "04/14/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10067347,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 40 MPH CONSUMER'S VEHICLE WAS HIT ON THE FRONT  PASSENGER'S   SIDE  BY A VEHICLE GOING  55 MPH. UPON IMPACT, NONE OF THE FRONTAL AIR BAGS DEPLOYED.  DRIVER SUSTAINED A BROKEN ANGLE, A SPRAINED WRIST, AND POSSIBLE HEAD INJURIES.   *AK",
        "vin": "KNDJA723515"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/07/2004",
        "dateOfIncident": "04/03/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066712,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LAST DRIVER SIDE WINDOW ON THE CORNER OF THE TRUCK SEPARATED WHILE DRIVING AND FELL ONTO THE HIGHWAY. *AK",
        "vin": "KNDJA723815"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/11/2004",
        "dateOfIncident": "07/20/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059439,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR A PERIOD OF 30-45 MINUTES AFTER STARTING THE VEHICLE GASOLINE AND EXHAUST FUMES ENTERED THE PASSENGER'S CABIN.  A COMPANY NAMED GREEN CIRCLE TESTED THE VEHICLE, WHICH TESTED POSITIVE FOR CARBON MONOXIDE.  PASSENGERS COMPLAINED OF HEADACHES WHILE IN THE VEHICLE, AND  DRIVER SOMETIMES BECAME DIZZY.    DEALER  REPLACED THE CATALYTIC CONVERTER TWICE, INTAKE MANIFOLD ONCE,  AND  FUEL INJECTORS ONCE.   THESE REPAIRS  DID NOT  REMEDY THE PROBLEM. *AK  *MR",
        "vin": "KNDJA723615"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2004",
        "dateOfIncident": "03/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061824,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 KIA SPORTAGE 4X4 WITH 76K MILES. WITHIN THE LAST 3 WEEKS I HAVE HAD TO HAVE THE FRONT BRAKES TOTALLY REPLACED, ALTERNATOR AND 2 BELTS REPLACED, MUFFLER TAILPIPE RUSTED THRU, AND BOTH FRONT BEARING HUBS NEED TO BE REPLACED (WOBBLY).*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/03/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057409,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR ABOUT A YEAR NOW REAR WINDOWS WOULD NOT PROPERLY FUNCTION.  IF THE WINDOWS WERE ALL THE WAY UP THERE WAS NO WAY TO GET THEM  TO GO DOWN.  ALSO,  FRONT WINDSHIELD WIPERS STOPPED OPERATING.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/2004",
        "dateOfIncident": "02/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057374,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE'S BRAKES FAILED WITHOUT WARNING. THE DEALER STATED THAT THE MASTER CYLINDER WAS THE CAUSE OF THE FAILURE.  *NM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "10/15/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070012,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD THE TRANSMISSION REPLACED IN APRIL OF 2003 AND THE CLUTCH REPLACED IN APRIL 2003.  THE CLUTCH WAS NOT COVERED UNDER WARRANTY.  WE PAID TOTAL COST $366.76. THE TRANSMISSION HAS NOW GONE OUT AGAIN.  THE TRANSMISSION IS ONLY 2 MONTHS OLD.  THIS WILL BE THE 6TH PROBLEM WE HAVE HAD WITH THIS CAR SINCE OCTOBER OF 2002:   (1)  CLUTCH SWITCH OCT 2002 (2)  EXHAUST MANIFOLD CRACKED APR 2003 (3)  PASSENGER SIDE FRONT WINDOW WOULD NOT GO UP  APR 2003 (4)  TRANSMISSION FAILURE  APRIL 2003 (5)  CLUTCH FAILURE  APRIL 2003 (6)  TRANSMISSION FAILURE  JUNE 2003",
        "vin": "KNDJB723615"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070574,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE ENGINE ON MY KIA WILL SIMPLY STOP.   THERE IS NO WARNING WHATSOEVER, AND THIS HAPPENS AT ANY TIME - SHORT TRIPS, LONG TRIPS, HIGHWAYS, BACK ROADS, THERE IS NO COMMON DENOMINATOR WHATSOEVER.     I HAVE TAKEN IT TO THE KIA DEALERSHIP NUMBEROUS TIMES - IT WAS THERE MONDAY THROUGH FRIDAY LAST WEEK, AND WAS AGAIN TOWED THERE SUNDAY NIGHT WHERE IT IS STILL THERE.    EACH TIME THEY GIVE ME MY CAR BACK SAYING THEY CAN'T FIND ANYTHING WRONG WITH IT, BUT THE PROBLEM KEEPS OCCURING.    I WORK ON THE ROAD AND I'M TERRIFIED TO DRIVE THIS CAR - AFRAID THAT SOMEDAY I WON'T BE ABLE TO GET TO THE BREAKDOWN LANE WHEN IT DIES THE NEXT TIME.     THE KIA SERVICE ADVISOR TRIES TO HELP, BUT THE PROBLEM IS NOT GETTING FIXED AND I'M TOLD BY THE DEALERSHIP THAT THERE IS NO ONE ELSE I CAN TALK TO.   AT THIS POINT I DON'T WANT THE CAR BACK UNTIL IT'S REPAIRED, OR REPLACED WITH A SIMILAR VEHICLE.   I CURRENTLY OWE MORE THAN IT'S WORTH IN THE BLUE BOOK, OTHERWISE I'D TRADE IT IN.",
        "vin": "KNDJA723615"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/14/2004",
        "dateOfIncident": "11/11/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054039,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 45 MPH CONSUMER CRESTED A HILL TO COME FACE TO FACE WITH A TRUCK MAKING A TURN IN THE MIDDLE OF THE ROAD. CONSUMER PRESSED THE BRAKES WITH CONSIDERABLE FORCE AND THE SEAT BELT BUCKLE  RELEASED.  THE SEAT BELT LIGHT WAS CONSTANTLY ON WHILE DRIVING.  VEHICLE HAD BEEN IN THE REPAIR SHOP AT LEAST FIVE TIMES.   MANUFACTURER AND  DEALER WERE AWARE OF THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051771,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  CHECK ENGINE LIGHT ILLUMINATED, SHORTLY AFTER THE TRANSMISSION FAILED. *AK",
        "vin": "KNDJB723415"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/04/2003",
        "dateOfIncident": "12/04/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050089,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS AND PADS REPLACED EVERY 12,000 MILES. THE LAST TIME VEHICLE WAS REPAIRED, THE ROTORS, PADS AND CALIPERS WERE REPLACED.  CONSUMER STATED BRAKES WERE REPLACED THREE TIMES. DEALER CLAIMED IT WAS  NOTHING WRONG WITH THE VEHICLE. PLEASE PROVIDE FURTHER INFORMATION.     *PH",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/02/2003",
        "dateOfIncident": "08/22/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046237,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CHECK ENGINE LIGHT APPEARED ON THE DASHBOARD. THE VEHICLE STARTED TO DECELERATE. WHEN CONSUMER PULLED INTO A DRIVEWAY VEHICLE CAUGHT ON FIRE. FIRE DEPARTMENT EXTINGUISHED THE FIRE.  *AK              THE CONSUMER'S ATTORNEY BELIEVED IT WAS A DEFECT IN THE VEHICLE'S STRUCTURE. KIA DENIED ANY RESPONSIBILITY.  (CONSUMER ON BEHALF OF GRANDDAUGHTER)    *PH",
        "vin": "KNDJA723915"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "11/23/2003",
        "dateOfIncident": "07/22/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047427,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD RECURRENT PROBLEMS WITH ENGINE PERFORMANCE IDLE AND RUNNING. ENGINE RACING WITH RPM'S TO 3500 AT STOP SIGN.  HAVE HAD TO TURN VEHICLE OFF TO RESOLVE PROBLEM. I WAS AFRAID THAT IF I DID NOT TURN ENGINE OFF, IDLE WOULD HAVE CONTINUED TO RACE AND \"BLOW UP.\"  ENGINE ALSO HAS VERY ROUGH IDLE/ALTERNATING WITH INTERMITTENT MISFIRES MOST OF THE TIME... \"BOGGING\" DOWN TO ALMOST STALL /THEN RACING TO RPM OF 1500-2500.  THIS PROBLEM OCCURS WHEN ATTEMPTING ACCELERATION ONTO FREEWAY OR WHEN DRIVING AROUND TOWN AT SIGNALS.  VEHICLE HAS BEEN TO DEALER 4 TIMES NOW IN ATTEMPTS TO CORRECT MALFUNCTIONS.  I AM CONCERNED THAT THE OPERATION OF THIS VEHICLE IS UNSAFE.  THE DEALER HAS BEEN HELPFUL BUT UNABLE TO COMPLETELY RESOLVE THE PROBLEM.  THE MANUFACTURER INSISTS THAT PROBLEM WILL BE RESOLVED, BUT I, THE CONSUMER BELIEVE THAT THE VEHICLE IS UNSAFE AND UNRELIABLE.  IT IS ALSO TIME CONSUMING TO REPEATEDLY RETURN THE CAR FOR SERVICE.    *LA",
        "vin": "KNDJB723115"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/20/2003",
        "dateOfIncident": "09/19/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048420,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS MANUFACTURED AND SOLD TO THE CONSUMER WITHOUT AIR BAGS. PLEASE PROVIDE ADDITIONAL INFORMATION.    *PH",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/01/2003",
        "dateOfIncident": "03/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008785,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER REAR ENDED ANOTHER VEHICLE IN MARCH 2002, THE CONSUMER APPLIED THE BRAKES, BUT THE VEHICLE FAILED TO STOP.  IN SEPTEMBER 2002 THE BRAKE LIGHT ILLUMINATED ON THE DASHBOARD AND THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DISCOVERED THE MASTER CYLINDER HAD A MAJOR LEAK. A MONTH LATER THE CONSUMER WAS INVOLVED IN ANOTHER ACCIDENT, THIS TIME THE CONSUMER THE DEALER CALLED IT INTERMEDIATE PEDAL DROP WHERE AT TIMES THE MASTER CYLINDER FAILED TO TRANSFER THE FLUID BETWEEN THE CYLINDERS TO PROVIDE BRAKING TO THE SYSTEM, THE DEALER DENIED ANYTHING WAS WRONG.  *AK  *JB",
        "vin": "KNDJB723715"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/30/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041951,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL SYSTEM FAILED AND CAUSED SEVERAL COMPONENTS TO MALFUNCTION. THE HAZARD WARNING  SIGNAL LIGHT ENGAGED BY ITSELF, WHICH CAUSED A REAR END COLLISION AND DRAINED THE BATTERY.  ALSO, ENGINE LIGHT CONTINUOUSLY ILLUMINATED. THE CAUSE OF THE FAILURE WAS UNDETERMINED BECAUSE THE DEALERSHIP WAS UNABLE TO DUPLICATE THE PROBLEM.*AK",
        "vin": "KNDJA723615"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/07/2003",
        "dateOfIncident": "08/08/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037383,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD PROBLEMS WITH THE CAR SINCE I BROUGHT IT. THE WINDSHIELD WASHER DOESN'T WORK, THE MIRRORS DON'T WORK, 2 BLOWOUTS, THE CHAMBERS THAT HOLD THE SPARK PLUGS NEEDED TO BE REPLACED, IT NEEDS A COMPLETE BRAKE JOB, I HAVE TROUBLE WHEN I PUT THE CAR IN DRIVE. HOW CAN I COMPLAIN TO THE DEALER I THINK I BROUGHT THE LEMON OF THE BUNCH?*AK",
        "vin": "KNDJB723015"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/04/2003",
        "dateOfIncident": "09/03/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038242,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 50 MPH FRONT BUMPER  FELL OFF.  THERE WAS NO ACCIDENT NOR DID THE VEHICLE HIT ANYTHING IN THE ROAD.  AFTER  BUMPER FELL OFF  VEHICLE MOVED AT SUCH A RATE OF SPEED THAT THE IT RAN OVER THE BUMPER .   MANUFACTURER AND THE DEALER HAVE BEEN NOTIFIED.  *AK",
        "vin": "KNDJA723115"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2003",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030576,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING DIFFICULTY WITH MY 2001 MANUAL KIA SPORTAGE CONVERTIBLE.  I FIRST HAVE TROUBLE GETTING IT STARTED IN THE MORNING.  AFTER I GET IT STARTED AND DRIVE IT A SHORT WHILE, THE CAR CUTS OUT ON ME.  IT DOESN'T STALL, IT CUTS OUT AND THERE IS NO GAS WHEN I STEP ON THE PEDAL.  THIS HAS HAPPEN WHILE SHIFTING, WHILE ACCELERATING, WHILE ADJUSTING MY SPEED.  AFTER IT CUTS OUT, I THEN HAVE DIFFICULTY GETTING IT STARTED AGAIN.  SOMETIMES I HAVE TO STEP ON THE CLUTCH AND GAS PEDAL FOR THE CAR RPMS TO CATCH.  AND THEN THE CAR MAY THEN CUT OUT AGAIN.  I HAVE TAKEN IT TO THE SERVICE DEPARTMENT, BUT THEY COULD NOT FIND THE PROBLEM.  THE PROBLEM HAS SINCE GOTTEN WORSE AND I HAVE BEEN PLACED IN DANGEROUS SITUATIONS IN MOVING TRAFFIC.*AK",
        "vin": "KNDJA623015"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": "07/30/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031615,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION LIGHT APPEARED ON THE DASHBOARD, ALSO  ENGINE CHECK LIGHT. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": "06/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030445,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2001 KIA SPORTAGE NEW IN MARCH OF 2001. WITHIN TWO MONTHS IT WAS AT  THE DEALER FOR REPAIRS. OVER THE NEXT 2 YEARS IT HAS BEEN BACK 10 TIMES! THE PROBLEM IS ALWAYS RELATED TO THE FUEL SYSTEM, SPECIFICALLY THE CATALYTIC CONVERTERS.THEY HAVE BEEN REPLACED 6 TIMES! THE LAST TIME WAS IN JUNE 18TH. ON JULY 13TH THE CONVERTERS PLUGGED AGAIN. THIS TIME THEY WERE RED-HOT. I'M LUCKY THEY DID NOT EXPLODE AND/OR CATCH FIRE. CURRENTLY THE VEHICLE IS UNSAFE AND UNDRIVABLE. ATTEMPTS FOR RESOLUTION WITH BOTH MY STATE LEMON LAW AND THE BBB AUTO LINE HAVE FAILED. IF OTHERS ARE HAVING THE SAME KIND OF PROBLEM, SOMEONE IS GOING TO GET HURT. *AK",
        "vin": "KNDJA623115"
    },
    {
        "components": "AIR BAGS,TIRES",
        "crash": true,
        "dateComplaintFiled": "07/25/2003",
        "dateOfIncident": "08/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10031548,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "HANKOOK TIRE MFG. CO.",
                "productMake": "HANKOOK",
                "productModel": "HANKOOK",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE VEHICLE VEERED TO THE RIGHT AND FLIPPED OVER THREE TIMES.  THE AIR BAGS NEVER DEPLOYED.  *MR  *CB   *NLM",
        "vin": "KNDJB723215"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/21/2003",
        "dateOfIncident": "07/12/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029691,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHEN TRYING TO APPLY THE ANTI LOCK BRAKES BRAKES WILL LOCK UP ,CAUSING THE VEHICLE TO HAVE EXTENDED STOPPING DISTANCE. DEALER NOTIFIED.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/11/2003",
        "dateOfIncident": "06/12/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022955,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE WINDSHIELD WIPERS TURNED ON AND OFF INTERMITTENTLY WHICH CAUSED POOR VISIBILITY AND ALMOST CAUSED AN ACCIDENT.  *AK  *CB  *NLM",
        "vin": "KNDJA7231Y5"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2003",
        "dateOfIncident": "06/14/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10027260,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE FUEL SYSTEM FAILED.  THE FAILED PARTS HAD TO BE ORDERED.  *MR   *CB   *NLM",
        "vin": "KNDJA723715"
    },
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "07/08/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026790,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATE VEHICLE BACKED INTO A TREE, THEN INSTEAD OF BUMPER CATCHING THE IMPACT THE SPARE TIRE CARRIER WAS CRUSHED.  BUMPER WAS NOT STRONG AT ALL.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/03/2003",
        "dateOfIncident": "06/14/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024113,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL SYSTEM DID NOT ACCEPT FUEL, AND DIDN'T SHUT OFF, AND GAS POURED OUT.  THE DEALER STATED THE VEHICLE WAS KNOWN FOR FUEL LINE PROBLEMS.  THE MANUFACTURER WASN'T CONCERNED.   *AK   *SCC   *JB",
        "vin": "KNDJA723715"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/20/2003",
        "dateOfIncident": "06/16/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10023466,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 60 MPH, I HYDROPLANED AND LOST CONTROL OF MY 2001 KIA SPORTAGE,  IMPACTING A BARRICADE WITH THE FRONT OF THE VEHICLE.  THE AIR BAGS DID NOT INFLATE AND THE SEAT BELT DID NOT KEEP ME RESTRAINED ALLOWING MY HEAD TO IMPACT THE FRONT WINDSHIELD.   *NLM",
        "vin": "KNDJB723315"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/19/2003",
        "dateOfIncident": "06/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023411,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL: LOOSE BOLTS AT HEAT SHIELD, LOOSE MUFFLER BOLTS, PROBLEM WITH FAN PULLEY, MASTER BRAKE CYLINDER DEFECTIVE, T-STAT, ENGINE LIGHT, DEALERSHIP COULD NOT IDENTIFY MOST RECENT PROBLEM, SAID THEY PUT A NEW COMPUTER IN.  REFLECTED LAST DATE BELOW........   *NLM",
        "vin": "KNDJA723315"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/16/2003",
        "dateOfIncident": "06/02/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023196,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SEEMS TO NOT WANT TO START WHEN IT RAINS, MOISTURE CAUSES SPORTAGE TO STALL NUMEROUS TIMES UNTIL I DRIVE A FEW MILES.   *NLM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/11/2003",
        "dateOfIncident": "01/07/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021401,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR WINDOW STOPPED FUNCTIONING WITHIN 2 MONTHS OF PURCHASING CAR (NOVEMBER2001). DEALER REPLACED REGULATOR/MOTOR.  RIGHT WINDOW FUNCTIONS MOST OF THE TIME, BUT WHEN I GET READY TO TAKE TO DEALER IT FUNCTIONS CORRECTLY. BOTH REAR WINDOWS STOPPED FUNCTIONING SUMMER OF 2003. TOOK TO DEALER & BOTH REGULATORS/MOTORS WERE REPLACED.  GEAR SHIFT IS SLIPPING BETWEEN GEAR BY ITSELF. TOOK TO DEALER AND WAS ADJUSTED JUNE 2003.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "05/02/2003",
        "dateOfIncident": "03/31/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10016912,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A KIA SPORTAGE 2001 AND WAS STRUCK IN THE REAR BY A TRACTOR TRAILER. THE IMPACT WAS SO GREAT IT BROKE THE BACK SUPPORT OF MY SEAT. THE TRUCK FORCED ME INTO THE VEHICLE IN FRONT OF ME SO HARD THAT I CRUMBLED THE TRUNK OF THAT VEHICLE. IN ALL 5 VEHICLES RECEIVED DAMAGE. MY VEHICLE WAS TOTALED. MY SEAT BROKE AND MY AIRBAGS INCLUDING A KNEE AIRBAG DID NOT DEPLOY. I RECEIVED WHIPLASH TO THE NECK AND DAMAGE TO MY RIGHT LEG. I FEEL THAT HAD MY AIRBAGS DEPLOYED I WOULD NOT HAVE RECEIVED THE DAMAGE TO MY LEG. ALSO I BELIEVE HAD MY SEAT BACK SUPPORT STAYED UPRIGHT I WOULD NOT HAVE RECEIVED THE INJURIES AS BAD.   *NLM",
        "vin": "KNDJA723215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/30/2003",
        "dateOfIncident": "04/30/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017889,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED WHILE DRIVING.           *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016313,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP CONTENDS THAT THERE IS NOTHING WRONG WITH MY VEHICLE ALTHOUGH IT OVER HEATED WITH ONLY 34,000 MILES ON IT.  I SPOKE TO TWO INDEPENDENT MECHANICS, INCLUDING ANOTHER DEALERSHIP MECHANIC AND WAS TOLD THAT VEHICLES DO NOT OVERHEAT WITH JUST A \"LITTLE\" COOLANT LOSS.  KIA CLAIMS I WAS A \"LITTLE\" LOW, FILLED IT UP & SENT ME ON MY WAY.     *NLM",
        "vin": "KNDJA723215"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/11/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015307,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS UNSAFE FOR THE DRIVER, PASSENGERS AND OTHER MOTORISTS ON THE ROAD. WHILE DRIVING TWICE, CONSUMER LOSS CONTROL OF THE VEHICLE, AND WAS NEARLY INVOLVED IN  COLLISION. *AK   *JB *TS",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/20/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10012136,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES FRONT POWER WINDOWS FAILED INTERMITTENTLY. DEALER NOTIFIED.    *NLM",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,SEAT BELTS,STRUCTURE,LATCHES/LOCKS/LINKAGES,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2003",
        "dateOfIncident": "09/22/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008205,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Lotus Cars Limited",
                "productMake": "SEAT BELT ASSEMBLY",
                "productModel": "SEAT BELT ASSEMBLY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "OVER THE SPAN OF THE LAST 1 1/2 YEARS I HAVE HAD THE FOLLOWING PROBLEMS  *REAR SEAT BELTS LOCKED UP WOULDN'T LOOSEN FAR ENOUGH TO GET MY CHILD OUT OF THE CAR.  *FRONT SEAT BELTS (BOTH) WOULD COME OPEN WHILE THE VEHICLE WAS IN MOTION.  *DRIVERS SIDE DOOR WOULDN'T LATCH WHEN TRYING TO CLOSE IT, HAD TO JIGGLE THE INSIDE HANDLE  *SPARE TIRE ARM WOULDN'T STAY IN THE LOCKED POSITION WHEN OPEN. STILL WON'T  *FOUR WHEEL DRIVE WOULDN'T ENGAGE  *LIFTER NOISE--COLLAPSED LIFTER  *HEAD WARPED  *CHECK ENGINE LIGHT HAD COME ON A FEW TIMES   *CUP HOLDERS (FRONT AND REAR) FELL APART  *OUTSIDE TRIM WAS FALLLING OFF.  *JB",
        "vin": "KNDJA723615"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "02/17/2003",
        "dateOfIncident": "01/29/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10007687,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED BEHIND TWO CARS WAITING TO MAKE A LEFT HAND TURN.  I WAS REARENDED BY A MAN GOING APPROXIMATELY 50MPH AT IMPACT, I WAS SLAMMED IN TO THE PERSON IN FRONT OF ME, AND SHE HIT THE PERSON IN FRONT OF HER KNOCKING THAT SUV IN TO ON COMING TRAFFIC.  ALL FOUR CARS WERE TOTALLED AND EVERYONE'S AIRBAGS WENT OFF EXCEPT FOR MINE.  MY FACE TOOK OUT THE VISOR AND HIT THE STEERING WHEEL.  THE FRONT SEATS RECLINED AT IMPACT AS WELL.",
        "vin": "KNDJA723115"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/15/2003",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007567,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT WAS TIGHT AND IT LOCKED UP.     PH",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,LATCHES/LOCKS/LINKAGES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/11/2003",
        "dateOfIncident": "10/31/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006071,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITION WAS NOT COOLING THE VEHICLE,  THE ENGINE LIGHT ILLUMINATED AND IT WAS  DETERMINED THE GAS CAP WAS LOOSE,  THERE WAS AN ELECTRICAL SHORT IN THE WINDOWS WHICH CAUSED THEM NOT TO WORK, THE PURGE VALVE LEAKED, THE HOLD LIGHT  FLASHED AT TIMES, THE LEFT REAR DOOR DID NOT OPEN FROM THE INSIDE, IT WAS DISCOVERED THE DOOR LOCK WAS OUT OF ADJUSTMENT, THE CUP HOLDER WAS COMING APART, THE BRAKES WERE NOISY AND THE MASTER CYLINDER WAS LEAKING.  *SCC *JB",
        "vin": "KNDJB723815"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "02/09/2003",
        "dateOfIncident": "01/31/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005546,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT LOWER CONTROL ARM BOLTS SHEERED OFF",
        "vin": "KNDJA723315"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2003",
        "dateOfIncident": "11/15/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004213,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL HEAVILY JERK AND THEN THE ENGINE LIGHT WILL COME ON AND STAY ON THE REMAINDER OF THE TIME VEHICLE IS BEING OPERATED.DEALER NOTIFIED. TS",
        "vin": "KNDJB723715"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "01/18/2003",
        "dateOfIncident": "04/22/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002887,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE SYSTEM/ROTORS. THE VEHICLE IS A YEAR OLD AND WAS PURCHASED NEW, TWICE THE ROTORS HAVE BEEN CHANGED DUE TO WARPING.THE INCIDENT DATE IS THE FIRST TIME IT WAS IN THE SHOP, THE SECOND TIME WAS ON 1/13/03",
        "vin": "KNDJA723815"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2003",
        "dateOfIncident": "12/23/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000836,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY AT NIGHT IN THE RAIN, THE CAR HIT BUMP AND THE LIGHTS WENT DIM, WINDSHIELD WIPERS STOPED WORKING, RADIO WENT OFF, INTERIOR LIGHTS DIM, AIR BAG LIGHT FLASHING ON AND OFF, THEN CAR REFUSED TO GO, ALMOST CAUSED WRECK. THIS WAS THE 2ND OCCURANCE, CONTACTED DEALER. THEY KEPT TRUCK FOR A WEEK AND STILL COULD NOT FIND THE PROBLEM. JUST HAPPENED AGAIN TONIGHT(1-8-03) NO BUMP WAS HIT.",
        "vin": "KNDJB723215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/02/2003",
        "dateOfIncident": "12/22/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001821,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT WHILE RIDING AND WITHOUT WARNING THE RADIATOR WOULD OVER HEAT CAUSING A DISTRACTION TO THE CONSUMER DEALER NOTIFIED. TS",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2002",
        "dateOfIncident": "03/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8024124,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHEN DRIVING 55MPH VEHICLE WILL INTERMITTENLY LOSE ALL POWER AND EMIT A \"BURNING WIRE\" SMELL.  DEALER IS UNABLE TO DIAGNOSE CAUSE. TS",
        "vin": "KNDJA723815"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/04/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023711,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CALLED COMPLAINING ABOUT HAVING PROBLEMS WITH THE VEHICLE NOT BEEN STABLE. ALSO STATED THAT WHEN SHE IS DRIVING THE VEHICLE ON THE HIGHWAY ANY VEHICLE THAT PASSES BY THE VEHICLE WITH THE WIND  IT WILL PUSH THE VEHICLE TO LOOSE STABILITY AND WILL SWING LANE BY LANE ON THE HIGHWAY. DEALER WAS CONTACTED AND STATED THAT SINCE SHE HAS MADE HER FIRST PAYMENT YET THAT THEY COULD NOT DO  ANY TYPE OF WORK ON IT. TS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/19/2002",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022985,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED, CONSUMER STATES' VEHICLE GEAR SHIFTER WILL JUMP UP TO NUETRAL, VEHICLE SUDDENLY LOOSES POWER.  CONSUMER FEELS THIS IS UNSAFE BECAUSE VEHICLE LOOSES POWER AT ANYTIME. COULD RESULT IN A REAR END COLLISION.  PLEASE PROVIDE ANY FURTHER INFORMATION. TS",
        "vin": "KNDJA723215"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/01/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769168,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GLASS PORTION (ONLY) OF THE LEFT OUTSIDE REAR VIEW MIRROR WAS BROKEN AND THE DEALER ADVISES THAT REPLACEMENT IS AVAILABLE ONLY AS A COMPLETE ASSEMBLY WHICH THE DEALER SAYS MUST BE PURCHASED AS A COMPLETE ASSEMBLY AT A COST OF APPROXIMATELY $350 INCLUDING PAINTING OF THE MIRROR SURROUND. I LOOKED AT THE UNIT AND FIND THAT THE MIRROR GLASS IS BONDED TO A BLACK PLASTIC BACKING THAT SNAPS IN PLACE.  THERE IS NO REASON OTHER THAN TO PAD THE BILL FOR THE ENTIRE UNIT TO BE REPLACED.  THE DEALER WILL NOT SHOW US THE PARTS FICHE AND KIA CUSTOMER SERVICE IS NON-RESPONSIVE.  CAN YOU PROVIDE A COPY OF THE PARTS BOOK BREAKDOWN OF THE LEFT OUTSIDE REAR VIEW MIRROR FOR THIS VEHICLE?  I WILL APPRECIATE IT AND WILL THEN BE ABLE TO REPLACE THE BROKEN MIRROR AND RESTORE THIS IMPORTANT SAFETY FEATURE AT A REASONABLE COST.  I CAN SEE NO REASON FOR THE BROKEN PART TO COST, AT RETAIL, MORE THAN $35 AND THE INSTALLATION LABOR IS INCIDENTAL AS IT ONLY INVOLVES SNAPPING IT IN PLACE.  THANK YOU VERY MUCH.  DT",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/16/2002",
        "dateOfIncident": "10/08/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020968,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING 60 MPH THE THROTTLE CABLE FELL OFF CAUSING LOST OF ACCELERATION.     MR",
        "vin": "KNDJA723115"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE RADIO FAILED THE RADIO FAILED.  *JG",
        "vin": ""
    },
    {
        "components": "INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOME LIGHT IS DEFECTIVE.  IT HAS BEEN REPLACED.  *JG",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE LIGHT ILLUMINATED.  THE ENGINE SEIZED AND WAS REPLACED.  THE REPLACEMENT HAD A DEFECTIVE OIL PUMP.  *JG.  *JG",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONER MALFUNCTIONED.  *JG",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE NBEDED A COMPLETE BRAKE JOB.  *JG",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567760,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS MAKING NOISES.  THE MUFFLER AND THE TAILPIPE WERE REPLACED.   *JG",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/27/2002",
        "dateOfIncident": "09/26/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019654,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING HEARD A LOUD NOISE. PASSENGER REAR TIRE BLEW OUT.  MODEL RADIAL 798 SIZE R205/75R15.DOT #H2AMYP1H3380.  ORINGINAL TIRE EQUIPMENT.  PLEASE PROVIDE ADDITIONAL INFORMATION.  *MR",
        "vin": "KNDJA723515"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/27/2002",
        "dateOfIncident": "08/02/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8017291,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT ON  VEHICLE WILL CONTINUOUSLY COME ON AND STAY ON. CONTACTED DEALER NINE TIMES ALREADY ABOUT THAT PROBLEM, BUT THEY CANNOT FIND  CAUSE OF  PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/21/2002",
        "dateOfIncident": "04/29/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016888,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ENGINE CHECK LIGHT KEEPS COMING ON. HAD IT CHECKED OUT. DEALERSHIP COULD NOT  FIND LOCATE PROBLEM.*AK",
        "vin": "KNDJB723015"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2002",
        "dateOfIncident": "05/06/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015415,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE FILLING GAS TANK, FUEL WILL SPILL OUT ONTO THE GROUND. DEALER NOTIFIED.*AKCONSUMER STATED WHILE FILLING TANK, A MOTOTRIST INFORMED HER THAT GAS WAS COMING FROM THE BOTTOM OF THE VEHICLE, CONSUMER LOOKED AT THE NOZZLE BUT NOTHING WAS COMING OUT, ALL THE DASH LIGHTS WERE ON AND VEHICLE WAS ACTING IF IT WAS GOING TO STALL, CONSUMER WAS ABLE TO REACH THE DEALER, AND BY THAT TIME THERE WAS A GAS SMELL, CONSUMER WAS INFORMED THAT VEHICLE WAS UNSAFE TO DRIVE, CONSUMER STATED AFTER 3 ATTEMPTS, THE PROBLEM WAS WITH THE CHAROCOAL CANISTER AND WAS FINALLY REPLACED.*JB",
        "vin": "KNDJA723815"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "07/26/2002",
        "dateOfIncident": "07/20/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8014900,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A REAR END COLLISION AT 40 MPH. DRIVER'S SIDE SEATBACK COLLAPSED ON IMPACT ONTO A SMALL CHILD SITTING IN CHILD SAFETY SEAT IN REAR.  CONSUMER FELT IT WAS DANGEROUS FOR SEAT TO COLLAPSE ON A SMALL CHILD. *AK      THE SEAT DID NOT SUPPORT CONSUMER WHO SUSTAINED INJURIES TO THE BACK.  THE CHILD HOWEVER WAS NOT INJURED.  *JG",
        "vin": "KNDJB723315"
    },
    {
        "components": "ELECTRICAL SYSTEM,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/20/2002",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012272,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING LOSS ALL POWER/DASH LIGHT, AND EVERYTHING WENT DEAD ON  HIGHWAY.    CAUSE UNKNOWN.  PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "VISIBILITY,VEHICLE SPEED CONTROL,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/03/2002",
        "dateOfIncident": "07/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762598,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL IS PEELING, I HAVE HAD IT REPLACED BUT THE NEW ONE IS DOING THE SAME THING. THE WINDOW STRIPS ARE ALL TWISTED UP AND MAKE A ROARING SOUND WHEN I DRIVE. I HAVE HAD THEM REPLACED BUT THEY STILL ROAR. THE DASH RATTLES, BUT THEY DIDN'T FIX IT. THE REAR WINDOWS DO NOT ROLL DOWN. THE RADIO HAS STATIC MOST OF THE TIME. IT DOESN'T SEEM TO WANT TO GO WHEN I ACCELERATE. IT KIND OF SPUTTERS AND THEN GOES. THE BANDS SQUEAL BAD. THEY HAVE BEEN REPLACED BUT THEY STILL SQUEAL.",
        "vin": "KNDJB723915"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/30/2002",
        "dateOfIncident": "05/28/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010724,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE TRAVELING AT 40 MPH, CONSUMER HIT A DEER ON THE FRONT PASSENGER SIDE OF VEHICLE.  CONSUMER STATES FURTHER DOWN THE ROAD HIT ANOTHER DEER ON DRIVERS SIDE AND NONE OF THE AIRBAGS DEPLOYED.  PLEASE PROVIDE ANY FURTHER INFORMATION.*JB",
        "vin": "KNDJB623215"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/30/2002",
        "dateOfIncident": "05/23/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010786,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES VEHICLE CUTS OFF AT ANY GIVEN TIME WITHOUT WARNING.   CONSUMER STATES HE ALMOST HAD AN ACCIDENT WHEN THE AUTO CUT OFF IN THE MIDDLE TRAFFIC.  THIS HAS HAPPENED TWICE.*JB",
        "vin": "KNDJB723915"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/13/2002",
        "dateOfIncident": "10/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009661,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER DOOR DOES NOT LATCH CORRECTLY. WHEN OPENING DOOR CONSUMER HAS TO PULL UP ON THE DOOR. TOOK VEHICLE TO DEALER, AND THEY REPLACED  VEHICLE WITH ANOTHER SAME MAKE AND MODEL.  CONSUMER STATES  NEW VEHICLE IS DUPLICATING THE SAME PROBLEM. PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/24/2002",
        "dateOfIncident": "11/30/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008555,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES AND ROTORS WEAR OUT WITHOUT EXCESSIVE USE. HAD IT REPLACED TWICE WITHIN 2000 MILES.*AK",
        "vin": "PLEASE IN F"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/23/2002",
        "dateOfIncident": "10/26/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008388,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS HAVING CONTINUOUS PROBLEMS WITH FRONT BRAKES. HAS HAD THEM REPLACED BY DEALERSHIP.*AK DEALER FOUND ROTORS WERE WARPED AND REPLACED ROTORS AND PADS.  *TT",
        "vin": "KNDJA723715"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/22/2002",
        "dateOfIncident": "04/17/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8008216,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT COLLISION AT 6 MPH, IMPACT WAS ON FRONT RIGHT. NEITHER AIRBAG DEPLOYED, DAMAGE TO VEHICLE WAS $ 6500.00, CONSUMER SUFFERED LIGHT INJURIES.*AK",
        "vin": "KNDJA723115"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,VISIBILITY,VEHICLE SPEED CONTROL,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/27/2002",
        "dateOfIncident": "01/19/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758735,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER MALFUCTIONED/JUMPED AT APPROX. 30MPH TO 40 MPH THEN BACK DOWN TO 20 TOOK BACK 3X. SUV SHIMMIED AT 60+ MPH 3X'S TOOK BACK TO DEALER DEALER REPLACED TIRES, ELECTRIC BACK WINDOWS 3X'S  TO DEALER REPLACED TWICE, WIRING ASSY-ENGINE, COIL IGNITION, CONV. ASSY-CAT. REPLACED (MAY HAVE CAUSED SPEEDOMETER , WINDOWS ETC TO OPERATE IMPROPERLY. R/R MAIN WIRE HARNESS, R/R BOTH CAT CONVERTORS, R/R COIL AND SPARK PLUGS, REPAIRED FUEL INJECTOR WIRE HARNESS. VEHICLE IDLED AT HIGH RPM (SUV POWER SURGED TO 80 MPH, THE SLOWEST I COULD GET THE VEHICLE TO GO WAS 40MPH AND HAD TO USE THE EMERGENCY BRAKE. (THROTTLE CABLE IN WRONG POSS. AT THIS TIME TRANSMISSION IS STILL SLIPPING VEHICLE AT DEALERSHIP PLUS I AM GOING THROUGH THE LEMON LAW AND BBAUTOLINE. THIS IS THE 10 DAY LIMIT. KIA HAS NOT BEEN VERY HOSPITABLE ABOUT THIS SITUATION, I DO NOT FEEL SAFE IN THEIR VEHICLE.",
        "vin": "KNDJB723815"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/11/2002",
        "dateOfIncident": "07/15/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003878,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING FOR SOME TIME AND COMING TO A COMPLETE STOP THE VEHICLE WILL HAVE TROUBLE ACCELERATING.  CONSUMER WILL STEP ON GAS  PEDAL, BUT  VEHICLE WILL JUST  DO NOTHING.  *AK",
        "vin": "N/A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/07/2002",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003742,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SURGES AND STOPS WITHOUT PRIOR WARNING.   DEALERSHIP IS AWARE OF  PROBLEM.  *AK",
        "vin": "KNDJB723215"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/30/2002",
        "dateOfIncident": "11/21/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8003167,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING APPROXIMATELY 35 MPH  VEHICLE WAS INVOLVED IN A FULL FRONTAL CRASH.  BOTH FRONTAL AIR BAGS FAILED TO DEPLOY, RESULTING IN INJURY TO DRIVER.  VEHICLE HAS NOT BEEN EXAMINED TO DETERMINE  CAUSE OF  FAILURE.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION / DOCUMENTATION.*AK",
        "vin": "KNDJA723815"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/30/2002",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003187,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BETWEEN 20 AND 30 MPH  SPEEDOMETER WOULD JUMP. COULD NOT TELL WHAT SPEED WAS DRIVING.  TOOK TO DEALER, AND DEALER PUT IN NEW MODULATOR, BUT PROBLEM STILL EXISTS.  *AK",
        "vin": "KNDJB723815"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/30/2002",
        "dateOfIncident": "01/24/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003195,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH VEHICLE WOULD VIBRATE. TOOK TO DEALER, AND DEALER BALANCED TIRES, BUT PROBLEM STILL EXISTS.  *AK",
        "vin": "KNDJB723815"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/30/2002",
        "dateOfIncident": "01/23/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003199,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  VEHICLE IS STARTED  ENGINE  CHECK LIGHT COMES ON DUE TO A PROBLEM WITH  CABLE HARNESS.ALSO WHILE DRIVING  VEHICLE VIBRATES AND COMPLETELY SHUTSDOWN. PLEASE GIVE ANY FURTHER DETAILS.*AK",
        "vin": "KNDJB723815"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/30/2002",
        "dateOfIncident": "01/29/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003224,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 40MPH VEHICLE KEPT ACCELERATING ON ITS OWN. APPLIED BRAKES, BUT BRAKES WOULD NOT STOP VEHICLE .HAD TO USE  EMERGENCY BRAKE TO STOP VEHICLE. DEALER CONTACTED.*AK",
        "vin": "KNDJB723815"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "01/25/2002",
        "dateOfIncident": "12/18/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 757306,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STOPPED AT A STOP LIGHT AND REAR ENDED.  THE BACK OF MY SEAT WENT HORIZONTAL AND COMPLETELY BROKE THE SEAT.*AK",
        "vin": "KNDJB723715"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756759,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PULLS FROM LEFT TO RIGHT 20-60 MPH, ESPECIALLY ON MAIN HWY, PULLS SO HARD AT TIMES THAT IT FEELS LIKE IT COULD FLIP OVER VERY EASILY OR THROW ME INTO ANOTHER LANE.  HAD DEALERSHIP CHECK THE SWAY BAR OR OTHER PARTS THAT COULD CAUSE THIS TO HAPPEN WHEN CAR WAS IN FOR OTHER MULTIPLE REPAIRS. DEALERSHIP SAID THEY FOUND NOTHING WRONG WITH IT, HOWEVER THEY ONLY DROVE IT 4 MILES INSIDE CITY LIMITS WHERE THE SPEED LIMIT IS APPROX 25-35 MILES PER HOUR.  VEHICLE HAS BEEN BEEN IN REPAIRS NUMEROUS TIMES SINCE I BOUGHT IT BRAND NEW IN 10/01.*AK",
        "vin": "KNDJA723715"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/03/2002",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001430,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED FUEL WILL NOT ALLOW THE TANK TO FILL UP WITH FUEL, CONSUMER TOOK VEHICLE TO DEALER AND HAD SOME PARTS REPLACED, THE VEHICLE HAS BEEN BACK TO THE DEALER 4 TIMES AND THE PROBLEM STILL EXISTS.*AK  CONSUMER ALSO STATED THE VEHICLE PULLS FROM LEFT TO RIGHT, AND THE CHECK ENGINE LIGHT ILLUMINATED.*SLC",
        "vin": "KNDJA723715"
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/02/2002",
        "dateOfIncident": "03/07/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001369,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, GEAR SHIFT AUTOMATICALLY POPS INTO ANOTHER GEAR. HAD TAKEN TO DEALER. *AK  CONSUMER STATES THERE IS WIND NOISE COMING FROM ALL FOUR DOORS.   *YD",
        "vin": "KNDJA723215"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/31/2001",
        "dateOfIncident": "09/14/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756232,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER WINDOWS IN REAR ON BOTH LEFT AND RIGHT HAVE STOP WORKING FROM TIME TO TIME.*AK",
        "vin": "KNDJB723015"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/31/2001",
        "dateOfIncident": "10/17/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756234,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO SEPARATE TIMES THE ENGINE BELTS HAVE STARTED TO SQUEAK/CHIRP. FIRST TIME DEALER REPLACED BELTS AND SECOND TIME DEALER ADJUSTED BELTS.*AK",
        "vin": "KNDJB723015"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/31/2001",
        "dateOfIncident": "07/30/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756236,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK VEHICLE IN FOR WATER DRIPPING ON TO PASSENGER SIDE FLOOR FROM AIR CONDITIONER UNDER DASH. FIRST TIME DEALER CLEANED OUT DRIP PAN AND SECOND TIME, REPLACED DRIP PAN.  *AK",
        "vin": "KNDJB723015"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/31/2001",
        "dateOfIncident": "12/27/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756238,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING IS HARD TO TURN AT TIMES, ESPECIALLY WHEN COLD FROM PARALLEL PARKING SPOT. DEALER SAID THEY COULD NOT FIND PROBLEM. PROBLEM UNRESOLVED. *AK",
        "vin": "KNDJB723015"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/31/2001",
        "dateOfIncident": "08/13/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756240,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED AFTER WASHING CAR THAT RIGHT HEAD LAMP CLEAR COVER WAS FRACTURED ON THE INSIDE. DEALER REPLACED COVER. SECOND TIME WAS 12/27/01, NOTICED WHILE TRAVLING IN FRONT OF KIA DRIVEN BY WIFE WHILE I WAS IN ANOTHER VEHICLE THAT THE RIGHT HEAD LAMP BEAM WAS MUCH HIGHER THAN THE RIGHT. WAS BLINDING SO I HAD DEALER ADJUST BEAM.*AK",
        "vin": "KNDJB723015"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/26/2001",
        "dateOfIncident": "12/25/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001095,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING ABOUT 60MPH ON  HIGHWAY AND  VEHICLE SKIDDED ON SOME BLACK ICE INTO  METAL RAIL.  THEN, SPINNED AND SWERVED  THREE OR MORE TIMES, AND THEN STOPPED.   UPON IMPACT, AIRBAGS DIDN'T GO OFF AT ALL.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/17/2001",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000774,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER AND PASSENGER  AIRBAGS, FAILED TO DEPLOY AFTER CONSUMER WAS INVOLVED IN A ROLL OVER CRASH. DEALER HAS YET TO BE CONTATCED. PLEASE PROVIDE FURTHER DETAILS.*AK",
        "vin": "N/A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/10/2001",
        "dateOfIncident": "11/14/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 563853,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CRASHED INTO THE FRONT END OF ANOTHER VEHICLE AND BOTH AIRBAGS FAILED TO DEPLOY, CONSUMER SUFFERED FROM SOFT TISSUE DAMAGE, CERVICAL LUMBAR SPRAIN, NUMBNESS OF LEFT ARM, AND STIFFNESS OF UPPER AND LOWER BACK.   *SLC",
        "vin": "KNDJB723015"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/10/2001",
        "dateOfIncident": "11/14/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 563853,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CRASHED INTO THE FRONT END OF ANOTHER VEHICLE AND BOTH AIRBAGS FAILED TO DEPLOY, CONSUMER SUFFERED FROM SOFT TISSUE DAMAGE, CERVICAL LUMBAR SPRAIN, NUMBNESS OF LEFT ARM, AND STIFFNESS OF UPPER AND LOWER BACK.   *SLC",
        "vin": "KNDJB723015"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/27/2001",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899505,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE AND PASSENGER'S SIDE AIRBAGS FAILED TO DEPLOY WHEN CONSUMER WAS INVOLVED IN A  40 MPH  COLLISION. DEALER HAS YET TO BE CONTACTED. PLEASE PROVIDE FURTHER DETAILS.*AK",
        "vin": "N/A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/05/2001",
        "dateOfIncident": "10/15/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754125,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TOLD BEFORE PURCHASING THE KIA-THAT  THE 5-YR WARRANTY COVERS  BUMPER-TO-BUMPER. THE WINDSHIELD SMASHED WITH LITTLE IMPACT WHEN A LARGE SOFT INFLATABLE BALL HIT THE ANTENNA. THE WINDSHIELD HAS A MANUFACTURED UNSAFE DEFECT. *AK",
        "vin": "KNDJB723915"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/15/2001",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 897711,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR POWERED REGULATOR WINDOWS HAVE BEEN REPLACED IN VEHICLE 6 TIMES SINCE APRIL 2001.*AK  *SLC",
        "vin": "KNDJB723315"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/15/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9004931,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CONTINUES TO EMIT SULPHUR DEOXIDE FROM EXHAUST WHICH FELLS PASSENGER COMPARTMENT.",
        "vin": "KNDJA623X15"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/15/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9004931,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CONTINUES TO EMIT SULPHUR DEOXIDE FROM EXHAUST WHICH FELLS PASSENGER COMPARTMENT.",
        "vin": "KNDJA623X15"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/04/2001",
        "dateOfIncident": "09/28/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 897335,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 55 TO 60 MPH ANOTHER  VEHICLE SUDDENLY STOPPED, CAUSING A CHAIN REACTION OF ACCIDENTS.  CONSUMER'S VEHICLE FRONT/ REAR END, AND SIDWAYS WAS HIT.   NONE OF  FRONT AIRBAGS DEPLOYED.    PLEASE PROVIDE ANY FURTHER INFORMATI0N.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/05/2001",
        "dateOfIncident": "08/28/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 895794,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  HAD  AIR CONDITIONER  AND  WINDOW  ROLLED HALF WAY UP, AND HE FELL A  SLEEP.  HE WAS SMELLING AN ODOR  INSIDE OF  VEHICLE. *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/27/2001",
        "dateOfIncident": "08/24/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 895201,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE OPENED UP COMPLETEY WHILE DRIVING. DEALER HAS BEEN CONTATCED.*AK  A PIECE OF PLASTIC THAT SHOULD HAVE BEEN REMOVED FROM THE FACTORY AND WAS NOT, GOT WEDGED UNDER THE THROTTLE CABLE AND STUCK THE THROTTLE WIDE OPEN.   *SLC",
        "vin": "KNDJA723215"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/17/2001",
        "dateOfIncident": "06/17/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 893044,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DUST COMING FROM  BRAKE PADS,  WHICH IN TURN, WILL RESULT IN  CONSUMER REPLACING  BRAKE PADS DUE TO EXCESSIVE WEAR.  DEALERSHIP HAS BEEN CONSULTED,AND CONSUMER WAS INFORMED THAT THIS  WAS \"NORMAL\".  PLEASE PROVIDE ANY ADDITIONAL INFORMATION/ATTACHMENTS.*AK",
        "vin": "KNDJB723615"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/14/2001",
        "dateOfIncident": "05/08/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 888150,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVLING AT 35-40 MPH AND RUNNING INTO A TREE HEAD-ON  AIR BAGS DID NOT DEPLOY. HAS NOT CONTACTED DEALER. *AK",
        "vin": "KNDJB723715"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/04/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887442,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A FUSE KEEPS BLOWING OUT WHICH CONTROLS  ENGINE CONTROL UNIT, CAUSING FAILURE OF ODOMETER/ SPEEDOMETER AND TACHOMETER, AND VEHICLE DOES NOT SHIFT PROPERLY.*AK   *SLC",
        "vin": "KNDJA723515"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/11/2001",
        "dateOfIncident": "03/26/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 885724,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PULLING TO  RIGHT. BRAND NEW VEHICLE.  IT WAS TAKEN IN AT 20-30 MILES. DEALER REPLACED  FRONT END.  ALL WORK WAS COVERED UNDER WARRANTY.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/20/2001",
        "dateOfIncident": "01/10/2001",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742761,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1. VEHICLE ROCKS SIDE-TO-SIDE WHEN MAKING TURNS.  2. VEHICLE HAS EXTRA PLAY IN THE STEERING WHEEL.  3. VEHICLE MOVES(SLIDES) RIGHT OF THE ROADWHILE DRIVING.  4. FRONT LEFT-SIDE OF VEHICLE SHAKES(UNTIL YOU CAN LOOK OUT FRONT WINDOW WITHOUT HAVING A HEADACHE)AT 10-60MPH.  5. VEHICLE 'S BODY BOUNCE FORWARD AND BACKWARD A FEW TIMES WHEN VEHICLE COMES TO COMPLETE STOP.  6. FRONT DRIVER SEATBELT LOCKS SOMETIMES(FOR NO REASON).*AK (DOT NUMBER: 5MHCA32900  TIRESIZE: P185/65R14)",
        "vin": "KNAFB161215"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/20/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 880842,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL WAS APPLIED AND BRAKES APPEARED TO BE WORKING FINE. BUT, AS THE VEHICLE WAS COMING TO A COMPLETE STOP  PEDAL WAS HARD, AND  VEHICLE CONTINUED TO ROLL, HITTING ANOTHER VEHICLE IN  REAR.  DEALER HAS NOT BEEN CONTACTED.*AK",
        "vin": ""
    }
]