[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/12/2018",
        "dateOfIncident": "04/11/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084688,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT CAR IN OCTOBER 2017 HAVE HADE TO PURCHES HAD PROBLEMS WITH TIRES FOUR TIME NOW TODAY MAKES FIVE TIMES HAVE TO GO PURCHASE ANOTHER TIRE HAVE TO HAVE IT TOWED IN THE MORNING",
        "vin": "5LMEU27R51L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/19/2017",
        "dateOfIncident": "02/07/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979353,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S CRUISE CONTROL JUST WILL NOT ENGAGE ANY LONGER. HAS WORKED FINE UP UNTIL ABOUT 2 MONTHS AGO.",
        "vin": "5LMFU28R51L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "01/03/2015",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824750,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR. THE CONTACT STATED THAT AFTER RAINY WEATHER, THERE WAS A BURNING ODOR AND AN ABNORMAL SOUND COMING FROM THE VEHICLE AS IF IT WAS ATTEMPTING TO START INDEPENDENTLY. IN ADDITION, THE CONTACT STATED THE WINDSHIELD WIPERS FAILED TO OPERATE INTERMITTENTLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ELECTRICAL SYSTEM FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 135,000.",
        "vin": "5LMEU27A11L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/24/2015",
        "dateOfIncident": "10/23/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806582,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IT MAKES A LOUD NOISE AND NO 1 KNOW WHAT IT IS",
        "vin": "5LMEU27R91L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/11/2015",
        "dateOfIncident": "08/10/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10747790,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR. WHILE THE CONTACT WAS SEATED AND THE ENGINE HAD NOT BEEN STARTED, THE DRIVER SEAT AIR BAG DEPLOYED.  THE CONTACT HEARD AN EXPLOSIVE NOISE AND JUMPED OUT OF THE VEHICLE.  THE CONTACT STATED THAT THE AIR BAG EXPLODED AND SMOKE AND OBJECTS WERE EJECTED. THE CONTACT WAS TAKEN TO THE HOSPITAL AND DIAGNOSED WITH FIRST DEGREE BURNS ON HIS BACK SIDE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 163,000.",
        "vin": "5LMFU28R51L"
    },
    {
        "components": "TIRES,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "10/25/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650746,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE OVERHEATED AND EXHIBITED NUMEROUS OTHER MECHANICAL ISSUES. THE CONTACT STATED THAT THE TIRES WERE BALD, THE AIR BAG LIGHT ILLUMINATED, AND THE BRAKES FAILED TO OPERATE. THE VEHICLE WAS TAKEN TO A DEALER. THE TECHNICIAN DIAGNOSED THAT THE BRAKES, TIRES, AND PARTS OF THE ENGINE NEEDED TO BE REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 118,000.",
        "vin": "5LMFU28A21L"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "07/24/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616162,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON I-95 NORTHBOUND AROUND WOOLBRIGHT ROAD, I RAN OVER TIRE DEBRIS AND CAUSED PART OF MY TIRE TO COME OFF. THE TIRE DID NOT GO FLAT AMAZINGLY, BUT I WILL DEFINITELY NEED A NEW TIRE. I HAVE A NAVIGATOR, SO LUCKILY IT DIDN'T CAUSE ANY MORE DAMAGE LIKE AN ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2014",
        "dateOfIncident": "07/12/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10610069,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SECOND TIME THE SPARK PLUG BLEW OUT OF THE TRITON 54 HEAD.. TRAINED TEC PERFORMED IT THE FIRST TIME SERT INSTALL AND WORKED FINE. HE DIDN'T TOUCH THE FACTORY PLUGS ON THE OTHER CYLINDERS. BUT THOSE BLEW OUT THIS IS A FORD DESIGN ERROR AND FLAW BUT THEY REFUSE TO ACKNOWLEDGE IT. INSTEAD THEY RATHER BLAME THE TECHS AND THE CUSTOMER.  *TR",
        "vin": "5LMFU28R11L"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "05/01/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10566303,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR. THE CONTACT STATED THAT WHILE DECELERATING TO A STOP, THE VEHICLE STALLED. THE VEHICLE WAS RESTARTED AND RESUMED NORMALLY. THE FAILURE WAS RECURRING. ADDITIONALLY, THERE WAS A BURNING ODOR PRESENT INSIDE THE VEHICLE AND THE SOUND OF BURNING MATERIAL WAS COMING FROM THE FRONT DRIVER SIDE AREA NEAR THE FUSE BOX. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE FAILURE COULD NOT BE DIAGNOSED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "5LMEU27R71L"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/28/2013",
        "dateOfIncident": "08/04/2013",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537795,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR. THE CONTACT STATED THAT WHILE PARKED AND UNOCCUPIED, THE VEHICLE SPONTANEOUSLY COMBUSTED. THE FIRE DEPARTMENT WAS SUMMONED TO EXTINGUISH THE FLAMES. A POLICE REPORT WAS ALSO FILED. THERE WERE NO INJURIES. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 129,000.   *TT",
        "vin": "5LMEU27R81L"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/27/2013",
        "dateOfIncident": "02/27/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10500710,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES AFTER PUTTING DRIVER SIDE WINDOW DOWN THE RADIO WILL CUT OFF. HAD VEHICLE SERVICED.THIS IS A RESULT OF AN ELECTRICAL SHORTAGE. DEALERSHIP CANNOT FIX PROBLEM,CONSUMER AFRAID THIS SHORTAGE WILL CAUSE A FIRE.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2012",
        "dateOfIncident": "11/11/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484100,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,      LUCKILY I MADE IT HOME BEFORE THIS HAPPENED AS I WAS TOWING MY TRAILER WITH A COUCH AND CHAIR ON IT.  I GOT HOME AND STOPPED IN FRONT OF MY HOUSE, THEN HAD TO MOVE  THE TRUCK. WHEN I STEPPED ON THE GAS TO MOVE, THERE WAS A HORRENDOUS BANG, A CLUNKING NOISE AND THE REAR OF THE VEHICLE DROPPED DOWN ALMOST TO THE GROUND. UPON JACKING THE VEHICLE UP AND EXAMINING THE DAMAGE, THE REAR LOWER CONTROL ARMS ROTTED ON BOTH SIDE AND COLLAPSED LIKE PRETZELS, ALLOWING THE REAR DIFFERENTIAL TO TWIST, SNAPPING THE DRIVESHAFT FLANGE WHERE THE UNIVERSAL GOES AND BLOWING OUT BOTH REAR SUSPENSION AIR SPRINGS.   AS I SAID, LUCKILY IT WAITED UNTIL I WAS HOME FOR THIS TO HAPPEN. IF IT HAD HAPPEN ON ROUTE 287 ON MY WAY HOME AT 65MPH, I'M SURE THE RESULTS WOULD HAVE BEEN CATASTROPHIC. I CAN'T IMAGINE THAT I WOULD HAVE BEEN ABLE TO CONTROL THE VEHICLE. EXAMINING THE UPPER CONTROL ARMS SHOWED THEY ARE ROTTED TO!   I CONTACTED THE FORD DEALER I HAVE USED FOR REPAIRS AND FORD CUSTOMER SERVICE. THE DEALERSHIP SAID THEY HAVE SEEN IT BEFORE, BUT TO THEIR KNOWLEDGE, FORD IS NOT ASSISTING FOR THIS PROBLEM. WHEN I CONTACTED FORD CUSTOMER SERVICE, THEY TOOK MY VIN NUMBER AND SAID THERE WERE NO OPEN RECALLS ON THE VEHICLE SO FORD WOULD NOT ASSIST EITHER. READING ON LINE THIS SEEMS TO BE A COMMON PROBLEM AND I THINK FORD SHOULD BEE HELD RESPONSIBLE FOR IT. I AM 49 YEARS OLD AND HAVE OWNED ALOT OF CARS, I'VE NEVER SEEN ANYTHING LIKE THIS!   I WORK FOR AN AUDI DEALERSHIP, NEEDLESS TO SAY I DON'T THINK I WOULD BUY ANOTHER FORD.  *TR",
        "vin": "5LMFU28A31L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/19/2012",
        "dateOfIncident": "10/18/2012",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10481184,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 10/16/12 TRUCK STARTED SMOKING TOOK IT TO THE MECHANIC, HE SUGGESTED TO TAKE IT TO THE DEALER TO FIX A RECALL FOR THE VEHICLE SPEED CONTROL SWITCH. ON 10/17/12 DEALER AUTO SHOP REQUESTED WE TAKE THE CAR THE NEXT DAY TO GET FIXED. ON 10/18/12 AROUND 9AM WHILE TRUCK WAS PARKED IT STARTED SMOKING AND THEN IT CAUGHT FIRE. THE WHOLE FRONT OF THE CAR WAS BURNED INCLUDING THE INTERIOR. *TR",
        "vin": "5LMEU27A91L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/15/2011",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440066,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR. THE CONTACT WAS DRIVING 5 MPH WHEN THE REAR TRAILING ARM AND DRIVESHAFT FRACTURED AS A RESULT OF CORROSION. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 140,000.",
        "vin": "5LMFU28A91L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2010",
        "dateOfIncident": "09/08/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359981,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 LINCOLN NAVIGATOR WITH A 5.4L ENGINE. I WAS ON MY WAY TO WORK AND WAS GOING APPROX. 15 MPH WHEN I HEARD A BANG COMING FROM THE FRONT OF THE CAR. AT FIRST I THOUGHT I HAD HIT SOMETHING OR SOMETHING WAS FALLING OFF THE CAR. I PULLED OVER TO THE SIDE OF THE ROAD AND AT THIS TIME THE ENGINE STARTED TO RUN ROUGH. I SHUT IT OFF AND CHECKED UNDER THE HOOD BUT COULD NOT SEE ANYTHING WRONG. I THOUGHT, AFTER RESTARTING THE ENGINE THAT IT MIGHT BE A BAD SPARK PLUG. AS I STARTED OFF THE CAR WAS STILL RUNNING BAD SO I DECIDED TO RETURN HOME.THE NEXT DAY, 10/09/2010, I DECIDED TO CHECK FURTHER AND REMOVED THE THREE OF THE SPARK PLUGS ON THE DRIVERS SIDE, BUT THE LAST ONE WHICH IS AT THE FRONT OF THE ENGINE I NOTICED THE COIL WAS ALL TORN APART AND THE END OF THE COILED WIRE WAS STICKING OUT FROM THE PLUG HOLE. I PULLED  SAID WIRE OUT AND SAW THE SPARK PLUG AT THE BOTTOM OF THE HOLE. IT APPEARED TO HAVE BEEN BLOWN OUT OF ITS THREADS. ALSO TO BE NOTED IS THE SMELL OF GAS WAS VERY APPARENT AND BECAUSE THE SPARK PLUG WAS DAMAGED, THE GROUND WAS FORCED AGAINST THE ELECTRODE AND WAS UNABLE TO SPARK. IF IT DID, I'M SURE THE ENGINE WOULD HAVE CAUGHT ON FIRE. I ALSO FOUND TWO PIECES OF SOME UNKNOWN MATERIAL THAT FELL INTO THE CYLINDER. THE PART APPEARS TO BE A CARBON MATERIAL AND MIGHT BE PART OF THE COP, COIL OVER PLUG.            AFTER DOING SOME RESEARCH ON THE WEB, THIS APPEARS TO BE A COMMON PROBLEM WITH THIS TYPE OF FORD ENGINES. I CALLED THE LINCOLN DEALER I BOUGHT THE VEHICLE FROM AND THEY SAID THEY HAVE NEVER HEARD OF THIS PROBLEM. BUT THEY WOULD GET BACK TO ME IF THEY CAN HELP. FURTHER INQUIRY FOUND THAT FORD RECOMMENDS REPLACING THE CYLINDER HEAD WHEN THIS PROBLEM OCCURS. THIS WOULD COST APPROX. $3500.00. AS I HAVE BEEN UNEMPLOYED FOR FIFTEEN MONTHS, AND FINALLY FOUND A PART TIME JOB,(14 HOURS A WEEK) THIS WOULD BE AN EXPENSE I CAN NOT AFFORD. THE WEB SITES DID STATE THAT FORD IS AWARE OF THIS PROBLEM BUT WILL NOT ADMIT TO THEIR POORLY DESIGNED HEAD. *TR",
        "vin": "5LMFU28R41L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2010",
        "dateOfIncident": "05/11/2010",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339855,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 LINCOLN NAVIGATOR SPONTANEOUSLY IGNITED RESULTING IN DESTRUCTION OF VEHICLE, ADJACENT VEHICLE AND HOME. *TR",
        "vin": "5LMEU27R01U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "07/25/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317033,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR. THE VEHICLE WAS PARKED IN THE DRIVEWAY AND IGNITED INTO MASSIVE FLAMES. THE FIRE DEPARTMENT WAS CALLED TO THE SCENE. THERE WAS EXCESSIVE FIRE DAMAGE TO THE GARAGE, DRIVEWAY, AND TWO OTHER VEHICLES. THE DAMAGES WERE ESTIMATED AT OVER $110,000. AN INVESTIGATION WAS PERFORMED BY THREE INSURANCE COMPANIES. THE FIRE ORIGINATED FROM UNDERNEATH THE HOOD OF THE VEHICLE. THE CAUSE OF THE FAILURE WAS CONTRIBUTED TO A LEAKAGE OF BRAKE FLUID INTO THE SPEED CONTROL SYSTEM. THE VEHICLE EXPERIENCED THE IDENTICAL DEFECT AS STATED IN THE MANUFACTURER RECALL NUMBER 09S. A COMPLAINT WAS FILED WITH THE MANUFACTURER. THE FAILURE MILEAGE WAS 80,000.",
        "vin": "5LMFU28A41L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/26/2009",
        "dateOfIncident": "09/17/2009",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285346,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT 2 HOURS AFTER ME AND MY CHILDREN GOT BACK HOME FROM WAL-MART AND GOT SETTLED IN FOR THE NIGHT MY BROTHER STEPPED OUTSIDE AND CAME BACK IN THE HOUSE YELLING FOR ME TO CALL THE FIRE DEPARTMENT BECAUSE MY 2001 LINCOLN NAVIGATOR WAS ON FIRE. I SERIOUSLY THOUGHT HE WAS PLAYING A JOKE ON ME BUT INSISTED SO I GOT UP AND MY TRUCK WAS ON FIRE IN MY DRIVEWAY. MY HUSBAND HAD TO GET 2 WATER HOSE AND KEEP THE FIRE UNDER CONTROL SO THE WIND WOULDN'T BLOW THE FIRE TOWARDS THE OTHER VEHICLES PARKED IN THE DRIVEWAY. AFTER THE FIRE DEPARTMENT CAME AND PUT THE FIRE OUT WE LOOKED UNDER THE HOOD AND SAW WHERE THE FIRE STARTED WHICH WAS OVER BY THE BRAKE MASTER CYLINDER. AT FIRST I DIDN'T KNOW OF A RECALL I JUST THOUGHT IT HAPPENED AFTER SEARCHING THE WEBSITES I LEARNED OF THE RECALL ON THE SPEED CONTROL SWITCH WHICH IS LOCATED UNDER THE BRAKE MASTER CYLINDER. I CALLED FORD AND DIDN'T GET ANYWHERE AT ALL. WHEN I MENTIONED THE CONTROL SWITCH I WAS TOLD TO BRING IT IN BUT WHEN I TOLD THE LADY THAT IT CAUGHT ON FIRE THE CONVERSATION GOT CUT SHORT. AND SEARCHING SOME MORE I FOUND OUT THAT I NEED TO REPORT IT TO THE NHTSA. AND I'M TAKING OTHER STEPS TO SEE IF FORD WILL TAKE RESPONSIBILITY AND REPLACE MY VEHICLE.  *TR",
        "vin": "5LMFU28R91L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "06/26/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 LINCOLN NAVIGATOR HAS A PROBLEM WITH THE AIR SUSPENSION.  *NJ  THE REAR OF THE VEHICLE DROPPED ALL OF A SUDDEN WHILE DRIVING. THE CONSUMER STATED THERE WAS NO WARNING ON THE INSTRUMENT PANEL. *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/08/2009",
        "dateOfIncident": "07/04/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276083,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR.  THE CONTACT ACTIVATED THE WINDSHIELD WIPERS AND NOTICED THAT THEY BEGAN TO PERFORM AT A VERY HIGH SPEED.  AS A RESULT, THE DRIVER'S SIDE WIPER DETACHED FROM THE VEHICLE.  HE ALSO NOTICED THAT THE WIPERS COULD NOT BE TURNED OFF UNLESS THE VEHICLE WAS TURNED OFF.  IN ADDITION, THE WIPERS WOULD NOT OPERATE AT LOW SPEEDS.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE CURRENT AND FAILURE MILEAGES WERE 126,374.",
        "vin": "5LMFU28R41L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2009",
        "dateOfIncident": "01/09/2009",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254460,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS THE OWNER OF A 2001 LINCOLN NAVIGATOR. I WAS LIVING IN THE STATES FROM 2004 TO 2006 AND I HEARD IN THE NEWS THAT LINCOLN CAR MODELS BETWEEN 1998 TO 2002 WERE SUSCEPTIBLE TO BURN BECAUSE OF A ELECTRICAL FAILURE. I TOOK MY CAR TO THE FORD DEALER LOCATED IN VENTURA BOULEVARD, CA AND THEY TOLD ME MY CAR MODEL WAS NOT ONE OF THOSE WHO HAD THE SWITCH THAT MADE THE CAR BURN. I TOOK MY CAR HOME AND EVERYTHING SEEMED TO BE OK. I WENT BACK TO SPAIN SO I TOOK MY AMERICAN CAR BACK TO  SPAIN TOO. AND EVERYTHING WAS OK, UNTIL YESTERDAY MY LINCOLN NAVIGATOR STARTED TO BURN AND IT WAS TOTALLY PARKED AND SHUT DOWN. *TR",
        "vin": "5LMEU27R51L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/08/2008",
        "dateOfIncident": "06/29/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247988,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE  WAS A HOUSE FIRE CAUSED BY  MY 2001 LINCOLN NAVIGATOR. IT WAS PARKED IN THE GARAGE WHICH WAS ATTACHED TO THE HOME.  THE FIRE WAS CAUSED DUE TO A MALFUNCTION IN THE CRUISE CONTROL SWITCH.  *TR",
        "vin": "5LMFU28A51L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/10/2008",
        "dateOfIncident": "03/05/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237599,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC SUV",
                "productYear": "9999",
                "size": "P265/70R17",
                "type": "Tire"
            }
        ],
        "summary": "DRIVER SIDE REAR TIRE TREAD SEPARATED WHILE TRAVELING AT ABOUT 65 MILES AN HOUR ON THE INTERSTATE. *TR",
        "vin": "5LMFU28R31L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/10/2008",
        "dateOfIncident": "04/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237600,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC SUV",
                "productYear": "9999",
                "size": "P265/70R17",
                "type": "Tire"
            }
        ],
        "summary": "TIRE TREAD STARTED TO SEPARATE.  REMOVED TIRE FROM VEHICLE BEFORE COMPLETE SEPARATION. *TR",
        "vin": "5LMFU28R31L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/10/2008",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237601,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC SUV",
                "productYear": "9999",
                "size": "P265/70R17",
                "type": "Tire"
            }
        ],
        "summary": "MERGED ONTO INTERSTATE.  TRAVELING AROUND 70 MILES PER HOUR WHEN PASSENGER SIDE REAR TIRE TREAD SEPARATED.  COMPLETE TREAD SEPARATION. *TR",
        "vin": "5LMFU28R31L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/18/2008",
        "dateOfIncident": "04/24/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231544,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN NORTH AMERICA, I",
                "productModel": "LT265/70R17 121R LTX A/S LRE TL ORWL MI",
                "productYear": "9999",
                "size": "LT265/70R17",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE HAD MULTIPLE INCIDENTS OF NEW TIRE VALVE FAILURE INVOLVING TIRES PURCHASED AND SERVICED BY SEARS AUTO CENTER, REGENCY SQUARE, RICHMOND, VIRGINIA. THE FIRST FAILURE OCCURRED IN FEBRUARY, FOLLOWED BY THE FAILURE OF THE SAME TIRE VALVE ON THE MORNING OF APRIL 24 TH 2008. MY COMPLAINTS WERE DISMISSED AT THAT TIME, AND AGAIN WERE DISMISSED WHEN THE OPPOSITE TIRE VALVE FAILED THAT AFTERNOON ALMOST CAUSING A SERIOUS ACCIDENT ON I 95 ( I HAVE ALL DOCUMENTATION AND AAA REPORTS). I WAS FORCED BY SEARS TO PAY FOR A NEW TIRE AND AGAIN, THEY FOUND NOTHING REMARKABLE IN THIS NEW VALVE FAILURE. WHEN I AGAIN COMPLAINED AND ASKED THAT ALL VALVES BE CHECKED, SEARS REPLACED ANOTHER VALVE ON A DIFFERENT TIRE. AT PRESENT, I HAVE ONE ORIGINAL VALVE ON MY VEHICLE.  *TR",
        "vin": "5LMFU28R71L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/18/2008",
        "dateOfIncident": "04/03/2008",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224903,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR.  THE CONTACT STARTED THE VEHICLE AND NOTICED SMOKE UNDER THE HOOD.  SHE IMMEDIATELY TURNED OFF THE VEHICLE.  BEFORE SHE COULD REMOVE THE KEY FROM THE IGNITION, SHE NOTICED FLAMES UNDER THE FRONT END OF THE VEHICLE.  A FIRE REPORT WAS FILED.  THE INSURANCE COMPANY STATED THAT THE VEHICLE WAS DESTROYED, BUT THEY   DID NOT INVESTIGATE THE CAUSE OF THE FIRE.  THE MANUFACTURER STATED THAT THEY WOULD NEED A COPY OF THE FIRE DEPARTMENT REPORT BEFORE THEY COULD SPEAK TO HER CONCERNING THE FAILURE.  THE CONTACT STATED THAT SHE TOOK THE VEHICLE TO THE DEALER FOR NHTSA CAMPAIGN ID NUMBER 05V388000 (VEHICLE SPEED CONTROL) IN THE SUMMER OF 2005.   THE CURRENT AND FAILURE MILEAGES WERE 111,000.    UPDATED 07/08/08.  *BF",
        "vin": "5LMFU28R01L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/25/2007",
        "dateOfIncident": "08/03/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206881,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTITRAC SUV",
                "productModel": "P26570R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "A CONTINENTAL CONTITRAC AT SIZE 25575R17 MOUNTED ON THE LEFT FRONT OF A 2001 LINCOLN NAVIGATOR FAILED AT HIGHWAY SPEEDS ON A A THREE LANE HIGHWAY IN MA.  THE SIDEWALL AND TREAD SEPARATED AROUND THE CIRCUMFERENCE IN A CATASTROPHIC FAILURE.  WITH GREAT DIFFICULTY, I KEPT MY VEHICLE FROM HITTING OTHER CARS AND/OR GOING OFF THE ROAD.   CONTINENTAL HAS RECALLED TIRES OF THIS TYPE BUT NOT MY SERIAL NUMBER.  THEY HAVE HAD PREVIOUS SUV CRASHES RESULTING IN DEATHS.  I THINK THE TIRES MOUNTED ON MY VEHICLE ARE ALL POTENTIALLY DEFECTIVE AND ASKED CONTINENTAL TO REPLACE FOUR TIRES AND THE DAMAGED RIM.  THEY HAVE ONLY AGREED TO SHARE 50/50 COST ON ONE NEW TIRE.  IT GETS WORSE.  THE TIRE THAT FAILED IS OUT OF PRODUCTION.  THEY SUPPOSEDLY ARE WORKING ON A REPLACEMENT BUT IT IS IN THE TESTING PHASE.  IN AN ALL WHEEL DRIVE SUV ALL TIRES SHOULD BE THE SAME.  SINCE THE ORIGINAL IS DISCONTINUED, I NEED FOUR NEW TIRES.  I THINK CONTINENTAL SHOULD PAY FOR ALL FOUR AND THE DAMAGED WHEEL.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/29/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201158,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC AW",
                "productYear": "9999",
                "size": "P275/60R17",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 LINCOLN NAVIGATOR.  THE VEHICLE HAS CONTINENTAL CONTITRAC AW, SIZE P275/60R17 TIRES.  WHILE DRIVING 50 MPH, THE STEERING WHEEL VIBRATED.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT THE PASSENGER SIDE FRONT TIRE NEEDED TO BE REPLACED.  THE PASSENGER SIDE REAR TIRE ALSO HAD A KNOT.  THE MANUFACTURER STATED THAT THE TIRES WERE INCLUDED IN NHTSA RECALL NUMBER 02T012000 (TIRES:TREAD/BELT), BUT THEY WOULD NOT COVER THE CHARGE DUE TO THE WEAR AND TEAR.  THE FAILURE MILEAGE WAS 11,550 AND CURRENT MILEAGE WAS 11,650.",
        "vin": "5LMEU27A31L"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/22/2007",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200445,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 LINCOLN TOWN CAR.  WHILE TURNING LEFT AT 10 MPH, THE CONTACT HEARD AN EXTREMELY LOUD SQUEAKING NOISE COMING FROM THE FRONT END OF THE VEHICLE.  HE TOOK THE VEHICLE TO THE DEALER AND THEY DIAGNOSED THE FAILURE AS THE LOWER BALL JOINTS AND/OR THE TIE RODS.  THE CURRENT MILEAGE WAS 72,000 AND FAILURE MILEAGE WAS 70,000.",
        "vin": "1LNHM82W91Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/08/2007",
        "dateOfIncident": "06/29/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195563,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING CONTROL ARM ASSEMBLY AND FRONT  SUSPENSION OF THE  LINCOLN NAVIGATOR BROKE WHILE I  WAS DRIVING HOME. IT WAS LUCKY THAT IT HAPPENED ON THE LOCAL STREET AND THE SPEED LIMIT  WAS 30 MPH.  I WA SABLE PULL THE CAR TO SAFETY. THE YEAR OF THE CAR WAS A 2001 MODEL.  I THOUGHT IT WAS TOO EARLY TO BE BROKEN. WE  WERE NOT AGGRESSIVE DRIVERS. WE JUST USED THE CAR TO COMMUTE FROM HOME TO  WORK ON THE HIGHWAY AND THE LOCAL STREET. WE WENT TO THE DEALER TO FIX THE PROBLEM. THE DEALER BLAMED  IT ON THE EXTREME TIRE, (MICKEY THOMPSON : BAJA CRAWL  RADIAL THAT WE USED. WE WERE  SKEPTICAL   OF  THIS ANSWER.  MAY BE IT WAS A MANUFACTURING DEFECT.  THE STEERING CONTROL ARM ASSEMBLY AND FRONT SUSPENSION SHOULD BE STRONG AND DURABLE TO GAURANTEE THE DRIVER SAFETY. IT SHOULD NOT BE BROKEN EASILY LIKE THIS. COULD  YOU GIVE US SOME ADVICE?  WHO WILL BE RESPONSIBLE FOR THIS CASE? SHOULD WE KEEP OR SELL THIS CAR.  *AK",
        "vin": "5LMFU28R51L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/07/2007",
        "dateOfIncident": "01/31/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10192691,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I APPROACHED MY DRIVEWAY AT C. 5 MPH, MY AUTO, A 2001 LINCOLN TOWNCAR, ACCELERATED SUDDENLY, AND AUTO FINALLY STOPPED C. HALFWAY IN MY DEN.  THE AUTO INSURANCE ADJUSTOR TOOK PHOTOS, AS DID I.  THERE WERE C. 35 FEET OF TIRE SKID MARKS APPROACHING MY DRIVEWAY AND IN MY GARAGE.  I COULD NOT STOP MY CAR!  FORTUNATELY, A NEIGHBOR ASSISTED ME FROM MY VEHICLE BUT I HAD A SORE KNEE SO WENT TO MY DOCTOR TO ARRANGE FOR AN XRAY.  THERE WERE NO BREAKS BUT KNEE SUFFERED TRAUMA SO AM CURRENTLY GETTING PHYSICAL THERAPY TO REGAIN USE OF MY RIGHT KNEE.  WHILE VISITING WITH FAMILY IN CHICAGO C. A MONTH AGO, RELAYED THE DETAILS OF ABOVE INCIDENT AND WAS SURPRISED TO HEAR THAT COUSIN'S HUSBAND, WITH SAME YEAR AND MODEL AUTO AS MINE, EXPERIENCED THE SUDDEN ACCELERATION THREE TIMES WITH HIS VEHICLE.  EACH INCIDENT OCCURED WHILE HE WAS MOVING AT A SLOW RATE OF SPEED AS WAS THE SAME MODE MY CAR WAS IN AT THE TIME OF MY ACCELERATION MISHAP.",
        "vin": "1LNHM83W21Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/05/2007",
        "dateOfIncident": "05/31/2007",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192507,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THURSDAY, MAY 31, I HAD AN ENGINE FIRE IN MY 2001 LINCOLN LS (V8).  THE CAUSE OF THE FIRE IS UNKNOWN AT THIS TIME. THE CAR IS A TOTAL LOSS.  *TR",
        "vin": "1LNHM87A11Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2006",
        "dateOfIncident": "10/01/2006",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169863,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAUGHT FIRE UNDER HOOD BY FUSE BOX/FIREWALL AND WIRING HARNESS TO MOTOR.  FIRE MARSHALL STATED ELECTRICAL SHORT IN WIRING HARNESS. VEHICLE WAS A TOTAL LOSS OF THE FIRE. MY WIFE AND MY 7 YEAR OLD DAUGHTER WERE IN VEHICLE WHEN IGNITED WITH NO NOTICE. I NEVER RECEIVED A NOTICE ABOUT VEHICLE SPEED CONTROL RECALL AND RECALL WAS NEVER PERFORMED AS A RESULT OF THAT.  FIRE OCCURRED IN AREA OF SPEED CONTROL CABLE.  *NM",
        "vin": "5LMFU28R11L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2006",
        "dateOfIncident": "09/29/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE VEHICLE WOULD NOT PROPERLY ACCELERATE WHEN THE ACCELERATOR PEDAL WAS DEPRESSED.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT REPAIR SHOP THAT DETERMINED THE TRANSMISSION WAS BURNING FLUID AND THE TRANSMISSION NEEDED TO BE REBUILT.",
        "vin": "5LMFL2AR81L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/11/2006",
        "dateOfIncident": "08/12/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167859,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE FACTORY TIRES ON THESE VEHICLES ARE GOING TO GET SOMEONE KILLED!  I WAS VERY FORTUNATE THAT NONE OF MY BLOW-OUTS WERE WHEN I WAS TRAVELING 75 MPH. DOWN INTERSTATE 10 !  I HAD JUST HAD MY TIRES ROTATED AND CHECKED, AND ABOUT 3 WEEKS LATER, I NOTICED A TERRIBLE VIBRATION IN MY STEERING.  I TOOK IT TO THE DEALERSHIP, AND WAS TOLD IT WAS MY TIRE.  I HAD THEM CHANGE IT, AND YOU SHOULD HAVE SEEN THE HUGE KNOT ON THAT TIRE. THEN, JUST ABOUT 11 MONTHS LATER, MY STEERING WHEEL STARTED SHAKING AGAIN, I TOOK IT TO A TIRE SHOP HERE, AND HE TOOK THE TIRE OFF, AND LOW AND BEHOLD, HERE IS ANOTHER HUGE KNOT ON THIS TIRE.  WE FINALLY DID WHAT WE SHOULD HAVE DONE THE FIRST TIME THIS HAPPENED, WE PUT A DIFFERENT BRAND OF TIRE ON THE CAR.  THOSE ARE THE WORST TIRES I HAVE EVER DRIVEN ON   BAR NONE....*JB",
        "vin": "5LMEU27R91L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/22/2006",
        "dateOfIncident": "07/08/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2001 LINCOLN NAVIGATOR'S TIRE BLEW OUT.  *TS  THE BLOWOUT CAUSED DAMAGE TO THE VEHICLE'S FRONT FENDER MOLDING, RIGHT FRONT BUMPER, WASHER FLUID HOSE, RIGHT SIDE RUNNING BOARD, SCRATCHED FRONT PASSENGER SIDE DOOR, SCRATCHED RIM AND LOST MUFFLER CLAMP.  *NM",
        "vin": "5LMFU28A21L"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/02/2006",
        "dateOfIncident": "04/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156599,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 LINCOLN NAVIGATOR:  PASSENGER ATTEMPTED TO BUCKLE UP IN THE SEAT DIRECTLY BEHIND THE DRIVER'S SEAT AND FOUND THAT THE SEAT BELT (SEAT BELT IN THIS POSITION IS RARELY USED) WAS UNUSABLE--UNLATCH BUTTON WAS STUCK IN THE DEPRESSED POSITION.  NO CRASH OR INJURY WAS INVOLVED.   A BUTTER KNIFE WAS USED TO RAISE THE LATCH TO SECURE THE SEAT BELT.  ONCE THE RELEASE BUTTON IS DEPRESSED TO RELEASE THE BELT, IT REMAINS IN THE DEPRESSED POSITION.   *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/02/2006",
        "dateOfIncident": "03/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151656,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GOODYEAR",
                "productYear": "1994",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING AT 65 MPH THE SIDE WALL OF THE LEFT REAR TIRE SEPARATED CAUSING A BLOW OUT AND THERE WERE NO WARNING OF ANY DEFECTS ON THE TIRE.  THE DEALERSHIP INSPECTED AND REPLACED THE TIRE.  THE MANUFACTURER WAS NOT ALERTED.",
        "vin": "5LMFU28R31L"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/29/2005",
        "dateOfIncident": "12/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146375,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED WHILE TRAVELING 65 MPH THE HOOD LATCH BROKE CAUSING THE HOOD TO FLY OPEN. THEY MANAGED TO PULL OFF  TO THE SIDE OF THE ROAD. THEY WIRED THE HOOD LATCH TOGETHER WITH WIRE COAT HANGERS AND THEN DROVE THE VEHICLE HOME. THEY TOOK THE VEHICLE TO THE DEALERSHIP TO HAVE THE REPAIRS MADE.*AK  UPDATED 2/7/2006 - *NM",
        "vin": "5LMEU27R81L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/01/2005",
        "dateOfIncident": "10/10/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144107,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATES THERE IS  NHTSA RECALL CAMPAIGN 05V017000  CONCERNING THE VEHICLE SPEED CONTROL: CRUISE CONTROL. THE PARTS NEEDED TO REPAIR THEIR VEHICLE ARE NOT AVAILABLE AT THE LOCAL DEALERSHIP. HE  SPOKE TO THE MANUFACTURER, WHO  CONFIRMED THAT PARTS WERE NOT AVAILABLE.  *AK",
        "vin": "5LMEU27R41L"
    },
    {
        "components": "STEERING,SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/19/2005",
        "dateOfIncident": "09/16/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140194,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2001 LINCOLN NAVIGATOR.  THE CONTACT STATED THE PASSENGER SIDE OUTER TIE ROD BROKE WHILE DRIVING  ON  THE ROAD.  THE VEHICLE WAS SLOWING FROM 60-45 MPH WHEN THIS OCCURRED.  THE CONTACT WAS ABLE TO PULL THE VEHICLE OVER.  ALSO, THIS  BROKE THE INNER BELTS OF THE PASSENGER SIDE FRONT TIRE.  THE VEHICLE WAS TOWED TO THE DEALERSHIP AT THAT TIME.  THE DEALERSHIP DID NOT HAVE A REASON WHY THIS OCCURRED.  THE CONTACT  SPOKE WITH LINCOLN ABOUT THE INCIDENT.  THE DEALERSHIP REPLACED THE OUTER TIE ROD END, AND REALIGNED THE VEHICLE AT THE CONSUMER'S EXPENSE.  THE CONTACT  HAD TO REPLACE THE PASSENGER TIRE, AND CHOSE TO REPLACE THE OTHER TIRES AS WELL.    *AK  UPDATES 1/11/2006 - *NM",
        "vin": "5LMFU28R71L"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/10/2005",
        "dateOfIncident": "10/06/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139220,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 NAVIGATOR CAUGHT FIRE IN MY DRIVEWAY ON 10/06/05. MY CAR IS A TOTAL LOSS. I DID NOT KNOW ABOUT THE CRUISE CONTROL SWITCH BEING RECALLED UNTIL THE FIRE DEPT TOLD ME THAT THE FIRE WAS ELECTRICAL AND THERE WAS A FORD RECALL. I HAVE SOME DAMAGE TO MY HOUSE AS WELL. MY GARAGE DOOR IS MELTED AND THE FRAME IS WARPED.  FORD NEEDS TO MAKE THIS RIGHT. I RECEIVED MY RECALL LETTER THE DAY AFTER THE FIRE. I HAVE THE ENVELOPE WITH THE 10/04/05 POSTMARK. DO I HAVE ANY GROUND TO STAND ON WITH FORD, NOW I HAVE TO COME UP WITH 3,000 FOR A DOWN PAYMENT ON A CAR AND I DON'T HAVE IT. SO I WENT FROM A 30,400 CAR TO BEING CARELESS. THAT IS NOT RIGHT.  *NM",
        "vin": "5LMFU28R91L"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/16/2005",
        "dateOfIncident": "08/26/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136716,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE REAR SEAT HAS NO LOCKING MECHANISM, WHEN THE SEAT IS PUSHED UP THERE IS NO LOCK TO KEEP IT LOCKED. THERE IS AN ARM THAT PULLS OUT AND ATTACHED TO THE BACK. ON THE BACK OF THE SEAT ON THE DIAGRAM IT SHOWS THERE IS A LOCK, BUT ON THE CONSUMER'S  VEHICLE THERE IS NO LOCK. NOTICED THIS ON  AUGUST 26, 2005; WHEN THE SEAT CAME DOWN TO REST IN ITS POSITION, IT MAKES A LOUD NOISE.  IT IS SO LOUD  THAT ONE WOULD THINK THE CONSUMER WAS  INVOLVED IN A CAR ACCIDENT. CONTACTED THE DEALER, THEY DIDN'T KNOW WHAT DIRECTION TO GO WITH THIS. *AK",
        "vin": "5LMFU28R11L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "06/05/2005",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136017,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WE WERE HOME SOMEBODY CAME TO MY APARTMENT TO TELL ME THAT THE CAR WAS ON FIRE. I WENT TO CHECKED IF TI WAS TRUE AND I SAW THAT THE CAR WAS ON FIRE. I CALLED 911 AND THEY RESPONDED. THE FIRE MARSHALL TOOK THE NAVIGATOR FOR INVESTIGATION AND AT THE END OF THE MONTH I RECEIVED A CALL FROM THE POLICE DEPT. TO PICK UP THE REPORT. AFTER THE INVESTIGATION THE FIRE MARSHALL CONCLUDED THAT THE FIRE WAS CAUSED BY MECHANICAL DEFECTS. MY OTHER CAR WAS DAMAGED DUE TO A FIRE.  THE FIRE WAS STARTED BY AN ENGINE FAILURE ON THE CRUISE CONTROL DEVICE. I SAW ON THE NEWS THAT MANY LINCOLN NAVIGATORS BURST INTO FLAMES TOO AND FOR THAT REASON THE FORD COMPANY MADE A WORLDWIDE RECALL THAT MORE THAT 3 MIILION CARS THAT HAVE THE SAME DEFECT.",
        "vin": "5LMEU27R51L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/15/2005",
        "dateOfIncident": "07/18/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10132901,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 LINCOLN NAVIGATOR (PRE-OWNED BY SOMEONE ELSE WHO WAS IN AN ACCIDENT IN THE VEHICLE THE SAME MONTH I GOT IT WHERE HE HIT SOMEONE FROM BEHIND IN A CHAIN-REACTION CAR PILE-UP). I WAS IN AN ACCIDENT WHERE SOMEONE PULLED OUT IN FRONT OF ME.  I WAS GOING ABOUT 40-50 MPH (THAT ROADS SPEED LIMIT WAS 55 MPH).  I HIT THE OTHER DRIVER IN HIS DRIVERS SIDE, SO MY TRUCK LOOKED LIKE A FRONT END COLLISION EXCEPT FOR THE PASSENGER SIDE IN THE FRONT WASN'T DAMAGED.  I SUFFERED A DEEP CUT IN MY NECK FROM THE SEAT BELT TIGHTENING A LITTLE BIT & I HAD JUST HAD ABDOMINAL SURGERY IN MAY SO I GOT MY INCISION SITE RE-BRUISED, & MY KNEES GOT JAMMED UP IN THE DASHBOARD.  I HAD A PASSENGER UP FRONT & MY 5 YEAR OLD SON IN THE BACK, BUT HE WAS OK JUST COMPLAINED OF KNEES HURTING BUT THE FRONT PASSENGER WAS HURT. SHE SUSTAINED A BROKEN TOOTH FROM HER SEAT BELT HITTING HER IN THE MOUTH, HER ANKLE WAS HURT, HER NECK WAS HURT A BIT & OTHER BREATHING ISSUES. MY AIRBAGS NEVER DEPLOYED!! I WAS TOLD BY THE FORD/LINCOLN CONSUMER COMPLAINTS THAT IF A TEST IS DONE TO SHOW THAT THE AIR BAGS AREN'T FAULTY(NOTHING WRONG WITH THEM), THEN NOTHING WOULD BE DONE BECAUSE IT COULD BE THE FORCE OF THE CRASH OR THE FACT THAT I DID HAVE A GUARD-GRILLE ON FRONT OF MY TRUCK & IT COULD HAVE TAKEN THE BRUNT OF THE FORCE WHICH DIDN'T ALLOW MY AIR BAGS TO DEPLOY & THAT'S TOTALLY UNACCEPTABLE TO ME BECAUSE I'M PAYING FOR SOMETHING & IT DOESN'T WORK REGARDLESS OF THE FORCE!   *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/09/2005",
        "dateOfIncident": "01/13/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120237,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKING DOWN TO THE FUSE BOX CAUSING SMOKING AND ELECTRICAL PROBLEMS.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/24/2005",
        "dateOfIncident": "03/22/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115789,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH VEHICLE ACCELERATED. NO IMPACT REPORTED. *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/28/2005",
        "dateOfIncident": "02/22/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10112315,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS EXITING THE HIGHWAY  GOING SOUTH BOUND AT APPROXIMATLY 50 MPH WHEN A CAR RAN THE STOP SIGN FACING EAST AND WEST.  MY WIFE HIT THE CAR HEAD ON  WITH HER NAVIGATOR WHILE  \"T\" BONING THE OTHER VEHICLE.  OUR NAVIGATORS AIR BAGS DID NOT  DEPLOY ON EITHER SIDE, CAUSING SIGNIFICANT AMOUNT OF INJURIES TO BOTH HER AND HER PASSANGER.  ALL THREE VICTOMS WERE TAKEN TO THE HOSP. VIA AMBULANCE.  WHEN I ASKED THE FORD DEALERSHIP WHY THEY HAD NOT DEPLOYED THEY INFORMED ME THAT THE ACCIDENT WASN'T BAD ENOUGH.  MY WIFE AND FRIEND ARE STILL RECEIVING MEDICAL TREATMENT AND THE OTHER PARTY AT FAULT, IS STILL IN THE HOSPITAL.  HIS AIRBAGS DID DEPLOY",
        "vin": "5LMEU27A81L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/07/2005",
        "dateOfIncident": "10/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110058,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A LINCOLN NAVIGATOR IN SEPTEMBER 2004. ONCE THE WEATHER CHANGED AND IT GOT COLDER EVERY NIGHT FOR ABOUT A WEEK THE HORN WOULD START BEEPING CONSISTENTLY AND COULD NOT BE STOPPED UNLESS WE DISCONNECTED THE HORN. WE TOOK THE VEHICLE TO FORD AND THEY EXPLAINED THAT ALTHOUGH THERE HAD NOT BEEN A RECALL, THE DEALERSHIP WAS FAMILIAR WITH THE PROBLEM. HOWEVER, WE WOULD HAVE TO PAY FOR THE REPAIRS AS THEY DID NOT CONSIDER IT A SAFETY ISSUE AND IT WAS NOT COVERED UNDER THE WARRANTY WE HAD PURCHASED WITH THE SUV. I BELIEVE THAT THIS IS A SAFETY ISSUE BECAUSE THE ONLY WAY WE COULD GET IT TO STOP WAS TO DISCONNECT THE HORN. THE FORD DEALERSHIP TOLD US THAT WHEN THE WEATHER GOT COLD, THE LEATHER AROUND THE HORN WOULD CONTRACT CAUSING THE METAL PLATES TO CONNECT AND ACTIVATE THE HORN. I WOULD APPRECIATE IT IF YOU COULD INVESTIGATE THIS MATTER.   *JB",
        "vin": "5LMFU28R21L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2004",
        "dateOfIncident": "07/24/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082614,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "RADIAL X",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "AUGUST 2002, I REPLACED ALL FIVE TIRES ON MY 01 NAVAGATOR WITH 17\" MICHELIN XROSS TERRAIN TIRES DUE TO A SAFETY RECALL ON THE OEM CONTENINTALS.  SINCE THE REPLACEMENT DATE, THREE OF THE TIRES HAVE ALL SUFFERED SIDEWALL FAILURES ON THE HIGHWAY, IN THE SUMMER AND WITH NORMAL LOADING.  ALL THREE WERE ON THE REAR AND ALL WERE CATASTROPHIC FAILURES.    THE FIRST HAPPENED ABOUT LAST SEPTEMBER 2003 WITH APPROXIMATELY 12,000 MILES ON THE TIRES.  THE TIRE HAD A NAIL IN IT AND THE CAUSE FROM THE DEALER WAS MY FAULT, UNDER INFLATED TIRE.  THE SECOND WAS THE FIRST WEEK OF JULY 2004, SAME PROBLEM AND EXACTLY THE SAME CIRCUMSTANCES.  LOCAL HIGWAY DRIVING AT SPEED AND ON A HOT DAY WITH A NAIL IN THE TREAD.  AGAIN, IT WAS MY FAULT DUE TO UNDER INFLATION.      IT HAPPENED A THIRED TIME YESTERDAY AT SPEED, COOL HIGHWAY TEMPS, OVERCAST SKIES AND ABOUT 75 DEGREES, PRESSURE IN THE TIRE WAS SET THE DAY BEFORE AT 36 PSI AND CONFIRMED THAT MORNING BY AIR CAPS (36 PSI UNITS).  NO NAILS IN THE TIRE, JUST A CATROSTROPHIC FAILURE.    I AM CONVINCED THE FIRST TWO TIRES WERE DEFECTED AS IS THIS THIRD ONE.  THESE THREE TIRES ARE FROM THE ORGINAL BUNCH OF FIVE THAT WERE INSTALLED.  I HAVE THE FORTH TIRE ON THE GROUND NOW AS A SPARE AND THE REMAINING ORIGINAL IS ONE OF THE FRONT TIRES.  NOT SURE WHICH.    I AM GOING TO PRESS FOR A MEETING WITH THE HOUSTON AREA TIRE REPRESENTATIVE THIS WEEK AND BRING UP MY CONCERNS WITH HIM DIRECT.  I HAVE HAD TO CHANGE TWO TIRES IN MY ADULT LIFE (44 YEARS OLD).  ONE WAS 6 YEARS AGO WHEN A VALVE STEM FAILED, THE FIRST WAS IN 1980 WITH A BAD TIRE ON THE HIGHWAY, LOADED UP AND HEADING TO COLLEGE.  SINCE THIS TRUCK WAS BOUGHT, I HAVE HAD 4 TIRE FAILURES, ALL ON THE REAR AND ALL AT HIGWAY SPEED AND DURING THE SUMMER.        I AM KEEPING THE LATEST DAMAGED TIRE JUST IN CASE IT NEEDS TO BE STUDIED.  I AM GOING TO CHANGE OUT ALL FIVE TIRES TO ANOTHER BRAND AND TRY SOMETHING NEW TO TRY AND SOLVE THIS PROBLEM.  *AK",
        "vin": "5LMEU27RX1L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/20/2004",
        "dateOfIncident": "07/16/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082302,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2001 LINCOLN NAVIGATOR- 21,000 MILES -CONTITRAC AT-P255/75R17 TIRES - DOT# AD9C 448 5100.  WE HAD BEEN DRIVING FOR ABOUT 2 HOURS ON I-95 AT SPEEDS BETWEEN 65 AND 70 MPH. (POSTED LIMITS ON I-95 ARE 65 AND 70) ON A SUNNY DAY WITH TEMPERATURES AROUND 95 DEGREES. THE REAR PASSENGER SIDE TIRE LOST ALL IT'S TREAD AND IMMEDIATELY BLEW OUT. THIS HAPPENED ON FRIDAY AFTERNOON AROUND 5 PM IN MODERATE TRAFFIC 7/16/2004. FORTUNATELY I WAS ABLE TO KEEP THE CAR UNDER CONTROL AND MOVE TO THE SHOULDER TO CHANGE TIRE. THE TIRE TREAD CAUSED BODY DAMAGE OF APPROXIMATELY $500.00 AND FORCED ME TO REPLACE ALL FOUR TIRES AND ONE WHEEL AT A COST OF $868. (AT MY EXPENSE OF COARSE. THE FORD DEALER WHERE I BOUGHT THE CAR WOULD NOT HAVE IT ANY OTHER WAY.)  I WILL RETAIN THE OLD TIRE AND WHEEL FOR INSPECTION IF NEEDED.    *LA",
        "vin": "5LMFU28R71L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2004",
        "dateOfIncident": "12/22/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065929,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO START CONDITION EVERY ONCE IN A WHILE FOR A BRIEF MINUTE OR TWO TRY TO CRANK IT AGAIN AND THE ENGINE WILL START. OCCURRED ABOUT THREE TO FOUR TIMES UNTIL NO START AT ALL OCCURRED. AFTER TOWING TO THE DEALER, THE PROBLEM ENDED UP TO BE FUEL PUMP FAILURE. *JB",
        "vin": "5LMFU28A61L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL SYSTEM, OTHER,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/03/2004",
        "dateOfIncident": "01/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056449,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL BECOMES HARD TO DEPRESS WHENEVER TEMPERATURE IS BELOW FIFTEEN DEGREES F FOR AN EXTENDED PERIOD. ONCE DEPRESSED, IDLE DOES NOT RETURN. ENGINE RPM STAYS ELEVATED, DROPPING ONLY WHEN GEARS CHANGE, THEN BUILDING BACK UP TO \"STIUCK\" RPM.  WHEN PLACED IN NEUTRAL, ENGINE REVOLUTIONS INCREASE TO ALMOST 5000 RPM; PLACING VEHICLE IN DRIVE CAUSES RPM TO DROP TO APPROXIMATELY 2200, WHICH IS CONSISTENT WITH 70 MPH IN DRIVE.  VEHICLE CANNOT BE STOPPED UNLESS GEARSHIFT IS PLACED IN NEUTRAL OR IGNITION TURNED OFF.  IT WOULD APPEAR THAT CONDITON RELIEVES AFTER ABOUT TWENTY MINUTES OF DRIVING, CONSISTENT WITH SOME INTERNAL COMPONENT WARMING SUFFICIENTLY TO RELIEVE A COLD-ORIGINATED CONTRACTION APPARENTLY CAUSING BINDING.  CONDITION RETURNS RANDOMLY AT SOMEWHAT HIGHER TEMPERATURES AT SPEED, ALMOST AS THOUGH RESPONDING TO WIND CHILL COLD. DEALER OBESERVED CONDITON IN TWO-DAY OBERVATION, DID NOT CURE PROBELM, YET RELEASED VEHICLE IN UNSAFE CONDITION.  NO FOLLOWUP FOLLOWING WEEK;  REPORTED TO LINCOLN CUSTOMER CARE, BUT COMPLAINT IGNORED; NO ACTION TAKEN.  \"WE'LL INVESTIGATE\" THREE WEEKS NOW.*AK",
        "vin": "5LMEU27A51L"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/08/2003",
        "dateOfIncident": "12/08/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEALER REFUSED TO REPAIR RECALL 01S21 FOR REPLACEMENT OF SEAT BELT BUCKLE. *AK",
        "vin": "5LMEU27R61L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/01/2003",
        "dateOfIncident": "04/25/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CONSUMER NOTICED A BAD JERK IN THE TRANSMISSION, WHENEVER THE GEAR WAS SWITCH FROM DRIVE TO REVERSE OR VISE VERSA.  *AK  THE VEHICLE WAS TAKEN TO DEALER WHERE THE CONSUMER REQUESTED THE TRANSMISSION BE LOOKED AT, HOWEVER THE VEHICLE WAS NOT TAKEN FOR A TEST DRIVE AND ONLY THE OUTSIDE OF THE VEHICLE WAS LOOKED AT. THE VEHICLE WAS RETURNED TO THE CONSUMER.  WHILE DRIVING, THE VEHICLE LOCKED UP AND CAME TO A COMPLETE STOP. THE VEHICLE WAS TAKEN TO A TRANSMISSION SHOP AND IT WAS EXPLAINED THAT THE WAY THE CLUTCH WAS DESIGNED IT DID NOT ALLOW THE PROPER AMOUNT OF LUBRICANT TO REACH THE CLUTCH WHICH THEN CAUSED THE CLUTCH TO SEIZE UP. THE DEALER REPLACED THE TORQUE CONVERTER.  *JB",
        "vin": "5LMFU28R61L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/12/2003",
        "dateOfIncident": "07/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029372,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES ACCELERATOR PEDAL IS STICKING, CAUSING VEHICLE TO LOSE CONTROL. DEALER NOTIFIED. *AK  VEHICLE HAS UNEXPECTEDLY ACCELERATED AND OR STUCK IN PASSING GEAR OVER 12 TIMES. ON JULY 14, THE FAILURE OCCURRED WHILE IN REVERSE. THE REMAINING TIMES IN FORWARD WHILE APPROACHING SPEEDS OF 90 TO 95MPH. THE ENGINE WOULD CONTINUE TO \"REV\" UP FOR NO REASON. THE CONSUMER'S ONLY RESOLUTION TO THIS PROBLEM IS TO PUT IT IN NEUTRAL AND TURN THE KEY OFF AND BACK ON TO CONTROL THE STEERING AND HAVE BRAKES POWER TO STOP THE VEHICLE.  THE TRANSMISSION HAD STARTED MAKING A \"CLUNKING\" NOISE WHEN SWITCHING FROM NEUTRAL TO EITHER DRIVE OR REVERSE.    *PH",
        "vin": "5LMFU28A71L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/07/2003",
        "dateOfIncident": "07/06/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025577,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE TRANSMISSION BURNOUT, THAT HAD TO BE REPLACED WITH A NEW ONE. *AK",
        "vin": "5LMEU27R21L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE,TRAILER HITCHES,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026416,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH FUEL PUMP, WINDSHIELD WIPERS, DRIVER'S SEAT, BRAKES, AIR CONDITIONER, GEAR SHIFT, AIR BAG, CD PLAYER, WINDOW MOTORS, DRIVER'S HANDLE DOOR,  SUNROOF.   *MR  PH. ALSO THE FUEL PUMP, TRAILER HITCH, THE LIGHTER EJECTED TO THE FLOOR ,THE IGNITION WAS LOOSE AND THERE WAS AN ELECTRICAL SHORT IN THE WINDOWS.. *JB",
        "vin": "5LMFU28A91L"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/14/2003",
        "dateOfIncident": "05/13/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10018700,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ON THE EXPRESSWAY, THE GAS PEDAL CONTINUED TO ACCELERATE AFTER REMOVING MY FOOT.  I THOUGHT I MAY HAVE SET OFF THE CRUISE CONTROL ON THE STEERING WHEEL, SO I PUSHED THE OFF BUTTON.  THE CAR CONTINUED TO ACCELERATE, SO I HIT THE BRAKES, HOPING THAT WOULD TURN OFF THE CRUISE.  THE BRAKES ON THE CAR WERE STIFF AND THE PEDAL WOULD NOT GO DOWN.  THE BRAKES WERE NOT WORKING AT ALL.   I DOWN SHIFTED TO SLOW THE CAR DOWN , THE CAR JUMPED A LITTLE AND SLOWED DOWN A LITTLE.  I DOWN SHIFTED AGAIN AND THE CAR SLOWED DOWN EVEN MORE.  I CONTINUED TO MOVE FORWARD AT APPROX. 40 MILES PER HOUR AND WAS UNABLE TO STOP.  I FINALLY SHIFTED INTO REVERSE, THE CAR JUMPED A FEW TIMES, THE WHEELS SPUN BACKWARDS THUS MAKING THE CAR GO BACKWARDS.  I THEN TURNED THE WHEEL TO THE LEFT WHICH DIRECTED THE CAR INTO THE MEDIAN OF THE EXPRESSWAY.  AS I CRASHED INTO THE MEDIAN BACKWARDS THE CAR STOPPED, BUT THE WHEELS CONTINUED TO SPIN, AND SMOKE WAS COMING FROM THE TIRES.  I THEN TURNED OFF THE IGNITION.   *NLM",
        "vin": "5LMFU28R01L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/04/2003",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015232,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED WITHOUT WARNING.  *JB  THE VEHICLE STALLED AT LOW SPEEDS WITHOUT WARNING.  THE DEALER FOUND NO PROBLEM.  A FLIGHT RECORDER WAS INSTALLED.  THE ENGINE WOULD STALL AT A LIGHT, RESTART, THEN STALL AGAIN AT A LOW SPEED.  THE CONSUMER REQUESTED TO BE RELEASED FROM THE LEASE AT NO CHARGE.  (THERE IS A TSB FOR THE IDLE)  SCC",
        "vin": "1LNHM87A91X"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/18/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010026,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER REQUESTED REIMBURSEMENT FOR THE CONTINENTAL TIRE VOLUNTARY RECALL, HOWEVER THE CLAIM WAS DENIED, THE MANUFACTURER STATED THE TIRES WERE NOT PURCHASED BETWEEN AUGUST 19, 2001 THROUGH OCTOBER 10, 2002.*AK    *JB",
        "vin": "5LMFU28R41L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/18/2003",
        "dateOfIncident": "03/18/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10012028,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SUSPENSION IS FAULTY.    *NLM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "02/06/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10011918,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS AT A COMPLETE STOP AND WAS HIT HEAD ON BY ANOTHER VEHICLE,  HOWEVER NONE OF THE AIR BAGS DEPLOYED UPON IMPACT. WHICH RESULTED IN THE DRIVER BEING SERIOUSLY INJURED.  *JB",
        "vin": "5LMFU28R01L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/05/2003",
        "dateOfIncident": "02/23/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009941,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN A FRONTAL COLLISION, AND THE AIR BAGS FAILED TO DEPLOY.*JB",
        "vin": "5LMFU28RX1L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2003",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008958,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT STARTED SMOKING.  *JB  THE CONSUMER SMELLED AN ELECTRICAL WIRE BURNING.  THE CONSUMER TURNED OFF THE HEAT WARMER ON THE SEAT.  THE SMELL CONTINUED.  WHEN THE CONSUMER HAD GOTTEN OUT OF THE VEHICLE,  HE VIEWED SMOKE COMING FROM THE SEAT.  THE CONSUMER HAD DIFFICULTY GETTING THE SMOKE TO STOP, EVEN WITH THE IGNITION TURNED OFF.  SCC",
        "vin": "5LMFU28R61L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/10/2003",
        "dateOfIncident": "11/07/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005651,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTITRAC AW",
                "productModel": "P27560R17",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY TIRES WERE SUBJECT TO A VOLUNTARY RECALL AND WHEN TAKEN TO THE DEALER WERE FOUND TO BE DEFECTIVE. I WAS INFORMED BY THE DEALER THAT IT WOULD BE WEEKS BEFORE REPLACEMENT CONTINENTAL TIRES WOULD BE AVAILABLE SO I PURCHASE GOOD YEAR TIRES. I SUBMITTED ALL THE REQUIRED PAPER WORK FOR A REFUND AND THE BILL OF SALE SHOWS THE NEW TIRES WERE PURCHASED 10/4/02. I RECEIVED A REPLY FORM LETTER FROM CONTINENTAL WITH A BOX CHECKED THAT STATES; \"THE PURCHASE DATE OF THE RECEIPT YOU SUPPLIED DOES NOT QUALIFY. THE ONLY PREVIOUSLY PURCHASED TIRES ELIGIBLE FOR REIMBURSEMENT ARE THOSE TIRE(S) PURCHASED BETWEEN AUGUST 19, 2001 AND OCTOBER 10, 2002 AS STATED IN YOUR NOTIFICATION LETTER.\" I DO NOT UNDERSTAND WHY THEY CANNOT SEE WITH THEIR OWN EYES THE RECEIPT I SUPPLIED HAS A PURCHASE DATE OF 10/4/02 AND DOES QUALIFY.",
        "vin": "5LMFU28R41L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": "05/14/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004299,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER DIDN'T RECEIVE RECALL NOTICE.    PH",
        "vin": "5LMEU27K812"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER REPLACED THE TIRES ON THE VEHICLE, HOWEVER THE CLAIM FOR REIMBURSEMENT WAS DENIED, THE MANUFACTURER STATED THE TIRES WERE NOT PURCHASED WITH IN THE TIME FRAME AS STATED.*JB",
        "vin": "51MFU28R412"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/10/2003",
        "dateOfIncident": "10/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002520,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES FAILED WHILE DRIVING. ALSO, ENGINE BLEW OUT WITHOUT WARNING.*JB.  *AK",
        "vin": "5LMFU28R81L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/02/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTINENTAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER HAS A COMPLAINT ABOUT A CLAIM FOR REIMBURSEMENT FILED AGAINST FAULTY TIRES.  CONSUMER FEELS REIMBURSEMENT IS ESSENTIAL.  *JG *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2002",
        "dateOfIncident": "10/11/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020666,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES AFTER  PUTTING  DRIVER SIDE WINDOW DOWN THE RADIO WILL CUT OFF.  HAD VEHICLE SERVICED.THIS IS A RESULT OF AN  ELECTRICAL SHORTAGE. DEALERSHIP CANNOT FIX PROBLEM,CONSUMER AFRAID THIS  SHORTAGE  WILL CAUSE A FIRE.     MR",
        "vin": "5LMFU28A91L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/11/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT THE HORN  BUTTON IS  HARD TO PUSH.   HAVE TO PUSH ON IT  THREE TIMES FOR IT TO WORK.  WHICH MAY CAUSE AN ACCIDENT.     MR",
        "vin": "5LMFU28A91L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/11/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020670,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE MAKING THE SLIGHTEST TURN VEHICLE WILL SCREECH SO  HARD.  WHEEL HAVE NO TRACTION CAUSING VEHICLE TO SLIDE OUT OF CONTROL.   MR",
        "vin": "5LMFU28A91L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/03/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020156,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE MANUFACTURER CONTINENTAL CONTITRACK AD9C4484300; WHILE DRIVING 65 MPH, THE DRIVER NOTICED TRUCK HAD STARTED TO SWAY.  THE DRIVER THEN SLOWED DOWN AND STOPPED THE TRUCK.  THE OWNER CHECKED THE TIRES AND NOTICED THE LEFT REAR TIRE HAD BLOWN THE WHITE SIDEWALL OFF.  THE TIRE LOOKED LIKE IT HAD BEEN SLICED THRU TO THE RIM.    NLM",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/01/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019996,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY THERE WAS A KNOCKING  AND POPPYING NOISE COMING FROM THE REAR WHEEL.  THE DEALERSHIP IS AWARE OF THE PROBLEM.  NLM",
        "vin": "5LMEUZ7R1LJ"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/16/2002",
        "dateOfIncident": "08/15/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567467,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING ON THE FREEWAY, HE FELT A VIBRATING SENSATION WHICH APPEARED TO BE COMING FROM THE TIRES.  AS THE VIBRATIONS WORSENED, THE CONSUMER WITH AN EMPLOYEE AT WINSTON TIRE NOTICED THAT THE LEFT REAR TIRE WAS BADLY SHREDDED, CONSUMER WAS INFORMED THAT THE SHREDDED TIRE WAS DUE TO ROAD DAMAGE, WHICH CONSISTED OF A SMALL NAIL EMBEDDED IN THE TIRE.(CONTINENTAL TIRES)*SCC",
        "vin": "5LMEU27A91L"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/09/2002",
        "dateOfIncident": "07/31/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766901,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING DOWN US HIGHWAY 30 AT 55 MILES PER HOUR  I ATTEMPTED TO CHANGE LANES , WHEN I APPLIED THE GAS PEDAL THERE WAS NO POWER. THE BRAKES, AND STEERING FAILED AND I WAS FORTUNATE TO BE ABLE TO STEER ON THE ROAD BURM UNTIL THE VEHICLE CAME TO STOP. WITHIN  A FEW MINUTES IT STARTED AGAIN. DEALER HAS INSTALLED A COMPUTER TO RECORD ANY IRREGULARITIES IN THE OPERATION OF THE VEHICLE. HOWEVER, I WILL NOT DRIVE THE UNSAFE CAR KNOWING THAT AT ANYTIME I WILL BE INVOLVED IN AN ACCIDENT.*AK",
        "vin": "1LNHM87A41Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/31/2002",
        "dateOfIncident": "05/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015268,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END RAISES UP HIGHER ABOUT 10-12 INCHES THAN  REAR. DUE TO THE VEHICLE BEING UNBALANCED IT CAUSES THE VEHICLE TO WANDER.  VEHICLE WAS SENT IN 5 TIMES  TO  DEALER,AND ONCE TEST DRIVEN BY A AREA REPRESENTATIVE, WHO DETECTED A PROBLEM.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/13/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011807,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  PURCHASING A NEW LINCOLN NAVIGATOR 2001 AFTER DRIVING 14000 MILES ON TRUCK TIRES BEGAN TO WEAR OUT. DEALER HAS BEEN NOTIFIED.*AK",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/02/2002",
        "dateOfIncident": "06/02/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8010905,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A TWELVE YEAR OLD CHILD WAS STUCK IN THE THIRD ROW SEAT BELT DUE SEAT BELT LATCH FAILURE.  WHILE ATTEMPTING TO UNLATCH THE BUCKLE THE RETRACTOR TIGHTENED SO BAD THAT THE CHILD RECEIVED BRUISES ACROSS THE CHEST AREA.  PLEASE DESCRIBE DETAILS",
        "vin": ""
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2002",
        "dateOfIncident": "02/16/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761635,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD A TWO MAJOR INCIDENTS WITH AN EXPENSIVE VEHICLE.  TRANSMISSION FAILED WITH LESS THAN 4000 MILES AND OUR REAR SUSPENSION FAILED DUE TO SOMEONE AT FORD USING ELECTRICAL TAPE ON A HIGH PRESSURE AIR HOSE.*AK",
        "vin": "5LMFU28R71L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2002",
        "dateOfIncident": "02/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008042,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVER SIDE POWER WINDOW IS ACTIVATED IT CAUSES A SHORT AND THE RADIO CUTS OUT. DEALER STATED THERE WAS NO REMEDY FOR THE PROBLEM.   NLM",
        "vin": "5NMFU28A81L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/10/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007328,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN  TURNING ON  SIGNAL LIGHT SWITCH WHILE  HEADLIGHTS ARE ON IT TURNS  HEADLIGHTS  OFF. DEALER CONTACTED.*AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/05/2002",
        "dateOfIncident": "11/02/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757837,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PROBLEM HAS OCCURRED ON NUMEROUS OCCASIONS, I STEP ON THE BRAKE AND THEY DON'T WORK AND THE CAR CONTINUES TO MOVE, I HIT ONE CAR, THE UTILITY SINK IN MY GARAGE, MY GARAGE DOOR AND A TRUCK BACKING OUT OF MY DRIVEWAY, BESIDES HAVE MANY NEAR MISSES,  I TAKEN THE CAR TO THE DEALER AND CALLED LINCOLN, THEY SAY THERE IS NOTHING WRONG, YET THE PROBLEM CONTINUES TO HAPPEN, I KEEP A DISTANCE BETWEEN ME AND OTHER VECHICLES IN TRAFFIC TO TRY AND AVOID HITTING ANY ONE, BUT I'M SCARED DRIVING THIS CAR.  I'M TRYING TO GET LINCOLN TO DO SOMETHING ABOUT IT AND THEY ARE SENT ME FORMS TO FILL OUT, MEAN WHILE I'M A DANAGER TO MYSELF AND OTHERS.*AK",
        "vin": "5LMEU27R91L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/11/2002",
        "dateOfIncident": "01/11/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 756727,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A CAPTAIN WITH THE FIRE DEPARTMENT AND RESPONDED TO A 2 CAR HEAD ON CRASH. OTHER VEHICLE HAD AIRBAG DEPLOYMENT, WHILE THIS NAVIGATOR HAD A MAJOR FRONT END COLLISION AND AIR BAGS WERE LOADED (NOT ACTIVATED) ON OUR ARRIVAL. ONLY ONE OCCUPANT IN THE NAVIGATOR WAS INJURED, MINOR, BUT REQUIRED AMBULANCE TRANSPORTATION. COLTON FIRE ALSO RESPONDED, AND COLTON P.D. WAS THE INVESTIGATIVE AUTHORITY, SGT. STEVE DAVIS WAS THE OFFICER IN CHARGE. THE OWNER OF THE NAVIGATOR, LINDA JONES OF 1245 WEST \"C\" STREET, COLTON CA, 92324 STATED THAT THE AIR BAG WAS NOT DE-ACTIVATED ON THE PASSENGER SIDE. THE FRONTAL IMPACT OF THIS COLLISION SHOULD HAVE CERTAINLY CAUSED AIR BAG DEPLOYMENT.  *AK",
        "vin": "5LMEU27A91L"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/09/2001",
        "dateOfIncident": "07/02/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755446,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE UNJUSTLY LOST THE LEMON HEARING, OUR 2001 HAS 1997 TIRES WHICH THEY REFUSE TO CHANGE, THE BOARD FELT THE VIB, AND OUR TIRES ARE BEGINNING TO DRY ROT.  THIS HAS BEEN FROM DAY ONE WHEN WE PEELED THE PLASTIC OFF AND HEADED HOME, WE HAVE ALL R/O TO BACK OUR CLAIM.  THEY ARE NOW TELLING US THAT IT IS NORMAL FOR A $46,000 CAR TO VIBRATE.   PLEASE HELP ME. (DOT NUMBER: E4 0213797  TIRESIZE: P275/60R17)",
        "vin": "5LMEU27R51L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/29/2001",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755099,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "LINCOLN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE THEY BEEN REPORTS OF BALL BEARING FAILURES IN OTHER 2001 LINCOLN LS MODELS?  MINE WERE REPLACED LAST WEEK AND ALREADY IT SOUNDS LIKE THE NEW ONES ARE GOING BAD.  PLEASE ADVISE.  THANK YOU. *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 743626,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCES DRIVETRAIN VIBRATION AT 60+ MPH. DRIVESHAFT REPLACED, TIRES REPLACED, PROBLEM STILL EXISTS. *AK",
        "vin": "5LMEU27A31L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/26/2001",
        "dateOfIncident": "11/25/2000",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884227,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT PASSENGER'S DOOR DOES NOT SHUT COMPLETELY.   UPPER PART OF  DOOR DOES NOT CLOSE.*AK",
        "vin": "5LMFU28AF1L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "01/19/2001",
        "dateOfIncident": "01/12/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878576,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "NAVIGATOR",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CLAMP THAT IS ATTACHED TO BRAKE FLUID LINE CASUES  BRAKE FLUID TO LEAK OUT, RESULTING IN LOSS OF BRAKES WHICH CAUSED A COLLISION.  DEALER REPLACED  CLAMP AND  BRAKE HOSE.  *AK",
        "vin": "5LMEU27A41L"
    }
]