[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215605,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 330I WITH 110,000 MILES ON IT ABRUPTLY STOPPED GOING IN REVERSE. ONE DAY IT WAS FINE AND RUNNING NORMALLY AND THE NEXT DAY WHEN I WENT TO BACK OUT OF MY GARAGE IT WOULD NOT GO IN REVERSE. I RECENTLY SOLD MY OLD CAR AND BOUGHT A BMW FOR THE \"RELIABILITY\" AND TO GET A HIGH VALUE CAR, INSTEAD I HAVE A MONEY PIT THAT I CAN NOT AFFORD TO FIX AND NOW NEEDS A $6,100 TRANSMISSION. WISH I HAD KEPT MY OLD CAR.  *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/14/2008",
        "dateOfIncident": "01/06/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214695,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BMW X5- I'VE OWNED THE MENTIONED VEHICLE FOR 3 YRS. AND AM UNABLE TO DRIVE IT THE WINTER DUE TO DOOR WILL NOT CLOSE BECAUSE LATCHING MECH FREEZES AND WILL NOT CLOSE UNTIL DOOR THAWS OUT. IT'S BEEN TO BMW DEALERSHIP AND SAYS IT'S A FAULTY CARRIER ON THESE 2000-2001 BMW WILL NOT HONOR THIS POTENTIALLY DANGEROUS SITUATION MY DRIVING WITH THE DOOR OPEN AND HAVING TO HOLD IT SOMEWHAT CLOSED AFTER GETTING IN !! IT'S A WIDESPREAD PROBLEM ACCORDING TO THE DEALERSHIP. YOU MAY READ ABOUT THIS ON THE BMW WEBSITE -WWW.ROADFLY.COM AND SEARCH THE ARCHIVES OF THIS PROBLEM. THEY WANT CLOSE 800.00 TO FIX THIS PROPERLY WITH A NEW DESIGNED \"CARRIER\" .  *TR",
        "vin": "WBAFA53511L"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/30/2007",
        "dateOfIncident": "04/28/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189296,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW 2001 325XI  REAR COIL FAILURE.  COIL FAILED ONE COIL UP FROM BOTTOM.  EVIDENCE OF FATIGUE CRACK-SHINY AREA WITH DUCTILE AREA FROM FINAL LOAD FAILURE.  EVIDENCE OF ADDITIONAL SMALL STARTING CRACK.  EXTERNAL SURFACE COATING FAILED AT POINT OF CONTACT WITH LOWER SUPPORT RUSTED.  *AK",
        "vin": "WBAAV33461E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2007",
        "dateOfIncident": "02/17/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186792,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 BMW X5 4.4I WITH ONLY 66K MLS HAS  TRANSMISSION OIL LEAK AT FRONT SHAFT SEAL TO TORQUE CONVERTER CAUSES CAR TO STALL OUT FROM LOSS OF TRANSMISSION POWER DUE TO LOSS OF LUBRICATION,EXCESSIVE  HEAT AND TRANSMISSION FAILURE  WHEN ACCELERATING",
        "vin": "WBAFB33551L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2007",
        "dateOfIncident": "03/16/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186331,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 16TH 2007 I BROUGHT MY VEHICLE TO THE DEALER TO EVALUATE A FAINT CLICKING NOISE THAT I DETERMINED TO BE A CLAMP ON THE FRONT DIFFERENTIAL BOOT HITTING THE SUSPENSION FRAME.  THE DEALER STATED THERE WAS NO PROBLEM AND INDICATED IT WAS PROBABLY TIRE NOISE.  I PERSISTED THAT THE NOISE WAS NOT NORMAL AND ASKED IF THEY WOULD PUT THE CAR ON THE LIFT SO I COULD SHOW THEM THE PROBLEM.  THE LEFT-HAND ENGINE SUPPORT BOLTS HAD APPARENTLY BEEN BACKING OUT CAUSING THE ENGINE TO SHIFT TO THE LEFT.  THE THREADS OF THE BOLTS WERE NOT DAMAGED AND THE TECHNICIAN INDICATED THAT THEY MAY NOT HAVE BEEN SUFFICIENTLY TIGHTENED.    FURTHER IF I HAD NOT NOTICED THE NOISE AND INSISTED ON EVALUATION THE ONE REMAINING BOLT WOULD LIKELY HAVE BROKEN, AFFECTING THE ABILITY TO DRIVE THE VEHICLE AND RESULTED IN A SERIOUS CRASH.  AS OF MARCH 27TH THE DEALERS HAS DETERMINED THAT THEY CAN NOT SIMPLY RE-TIGHTEN THE BOLTS BECAUSE THEY MOST LIKELY UN-THREAD OVER A PERIOD OF YEARS.  WITH PROLONGED DRIVING, THESE BOLTS BECAME LOOSE CAUSING DAMAGE TO THE ENGINE AND SUSPENSION.  THIS 2001 BMW X5 IS A SPORT UTILITY VEHICLE, AND ALTHOUGH THIS ONE HAS NEVER BEEN OFF ROAD, THIS POWER TRAIN PROBLEM REPRESENTS A SIGNIFICANT SAFETY RELATED DEFECT THAT COULD AFFECT A NUMBER OF VEHICLES IF THE BOLTS SUPPORTING THE ENGINE VIBRATE LOOSE DUE TO IMPROPER TIGHTENING OR TORQUE FORCE.  THE DEALER INSISTS THAT THIS IS NOT SAFETY RELATED DEFECT; THEY HAVE NEVER SEEN THE PROBLEM AND HAVE NO EXPLANATION HOW THIS COULD HAVE OCCURRED IN A VEHICLE THAT HAS NEITHER BEEN OFF ROAD NOR INVOLVED IN AN ACCIDENT.  HOWEVER A SIMILAR NHTSA CAMPAIGN (NUMBER 03V475000) WAS ISSUED ON NOV 03, 2003 FOR 2004 BMX X5 VEHICLES WITH IMPROPERLY TIGHTENED RIGHT SIDE ENGINE SUPPORT BOLTS AND FRONT DIFFERENTIAL BOLTS. THIS IS THE SAME PROBLEM ON THE LEFT SIDE IN A DIFFERENT MODEL YEAR. IT IS MY BELIEF THAT THE MANUFACTURER NEEDS TO INVESTIGATE AND REMEDY THIS POTENTIAL SAFETY RELATED DEFECT. *JB",
        "vin": "WBAFA53561L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/25/2007",
        "dateOfIncident": "02/01/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183427,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "MINI",
                "productModel": "COOPER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A  \"TECHNICAL SERVICE BULLETIN\" ISSUED ON MY BMW REGARDING A BROKEN OR LEAKING VALVE WHICH COULD BREAK IN LOW TEMPERATURE WEATHER CONDITIONS.   I DID BREAK DOWN, FINDING MYSELF IN A SMOKING CAR, BOTH INSIDE AND OUT IN 6 DEGREE WEATHER. IT HAS BEEN THREE WEEKS AND MY CAR IS STILL AT THE DEALERSHIP. THEY SAID I HAVE A CRACKED VALVE COVER. \"ALL\" OF THE PARTS ORDERED ARE NOT IN YET AS OF THIS PAST FRIDAY. I WAS TOLD THAT THEY ARE WAITING FOR THE LAST PART, A DIP STICK. A \"VOR\" ORDER WAS PLACED 3 WEEKS AGO AND I CAN'T IMAGINE WHAT HAS HAPPENED TO MY CAR HERE, THAT IN ADDITION TO WHATEVER ELSE, THE DIP STICK BROKE. THEY ARE NOT CHARGING ME FOR THE REPAIR, WHICH THEY SAY IS $2000. I FIND THIS CURIOUS. I ALSO HAD TO BRING MY CAR BACK TO THE DEALER IN DEC. BECAUSE IT WAS STALLING IN ADDITION TO A FEW OTHER PROBLEMS, THEY DID NOT CHARGE ME THERE EITHER, AGAIN, CURIOUS. MY CAR, A 2001 3 SERIES, HAS 45,000 MILES ON IT. I TAKE  GOOD CARE OF IT AND JUST HAD IT CHECKED OUT IN NOVEMBER WHEN I HAD AN OIL CHANGE. ALSO LAST YEAR, I HAD OVER $1000 OF REPAIRS DONE ON IT. I HAVE BEEN RENTING A CAR FOR THE PAST THREE WEEKS FOR $60 A DAY. I WONDER WHY THEY DID NOT GIVE ME A LOANER AND I SHOULD HAVE TO PAY FOR A RENTAL. I WOULD LIKE TO HAVE BEEN WARNED, OR AT LEAST BEEN GIVEN A CHOICE AS TO WHETHER OR NOT I WOULD LIKE TO HAVE THIS PROBLEM CORRECTED BEFORE IT HAPPENED. I WAS LUCKY THAT I BROKE DOWN IN A SAFE AREA. I WONDER, HOW MANY SERVICE BULLETINS ARE OUT THERE ON CARS THAT WE ARE NOT ADVISED OF AND COULD RESULT IN PUTTING US IN AN UNSAFE SITUATION. AT THE VERY LEAST I THINK THAT THE DEALERSHIP SHOULD HAVE GIVEN ME A LOANER OR SHOULD PAY FOR MY CAR RENTAL. SINCE THEY ARE NOT CHARGING ME FOR THE REPAIR, DOESN'T THAT MEAN THAT THEY ARE RESPONSIBLE FOR THE DAMAGE? SHOULD HAVE TO PAY FOR THE RENTAL, WHICH IS NOT UP TO $1260? LOSS WHEN IT COMES TO THE CAR  I DON'T REALLY UNDERSTAND WHAT IS HAPPENING HERE, BUT IT DOESN'T SEEM RIGHT. CAN YOU HELP, ME AND OTHER CONSUMERS OUT THERE?*JB",
        "vin": ""
    }
]