[
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "10/01/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265531,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUSPENSION ON MY 2001 NISSAN ALTIMA IS VERY LOW LOUD NOISE. THE CAR RATTLES AND SHAKE IN THE REAR SUSPENSION",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "SUSPENSION,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/02/2019",
        "dateOfIncident": "09/30/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11265716,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED THAT THERE WAS A LOUD NOISE UNDERNEATH THE VEHICLE AND IT SWAYED WHILE BEING DRIVEN, ESPECIALLY AROUND A CURVE. THERE WAS ALSO A BURNING ODOR COMING FROM THE VENTS INSIDE THE VEHICLE. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE FAILURE MILEAGE WAS 200,000.",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/25/2017",
        "dateOfIncident": "12/02/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11056330,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN READING  COMPLAINT SECTION MY CAR DOES THE SAME THING STARTING THE ENGINE IT STARTS TO SHAKE AND SPUTTER . SOME TIMES I CAN GIVE IT MORE GAS  AND IT MAY STOP OR WHAT I HAVE BEEN DOING WHEN IT DOES IT AT A TRAFFIC LIGHT  I PUT IT IN PARK AND STEP ON THE GAS PEDDLE, THIS USUALE  STOPS THE PROBLEM. IT ONLY HAPPENS EVERY FEW MONTHS OR SO. I THOUGHT THAT IT WAS BECAUSE THE ENGINE WAS COLD, BUT NOT THE CASE . IT HAS BEEN DOING IT FOR A FEW YEARS NOW. I HAVE LOW MILES ON IT ABOUT 77,5000.  I SEE SOME PEOPLE THINK IT IS A INTAKE MANIFOLD GASKET PROBLEM AND I HAVE THE SAME ISSURE",
        "vin": "1N4DL01D21C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/21/2017",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10956037,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE CRANKSHAFT, CATALYTIC CONVERTERS, EMISSIONS CONTROL, AND SENSORS FAILED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.",
        "vin": "1N4DL01D61C"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "10/23/2016",
        "dateOfIncident": "08/16/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918415,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE STREET AT ABOUT 15 MILES AN HOUR AND MY TIRE  ON THE PASSENGER SIDE TURNED OUT  WORD AND THEN HIT A CAR ON THE SIDE OF THE ROAD.  UPON FURTHER INSPECTION I REALIZED THAT THE CAR HAD COME APART AT THE CONTROL ARM , AT THE HUB AND THE TRANSAXLE HAD SEPARATED AS WELL.  FOUND THESE PARTS AT THE PLACE I PARK IN FRONT OF MY HOUSE AND THE OTHER  ONE ABOUT 50FEET  FROM WHERE THE CAR CAME APART.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/28/2016",
        "dateOfIncident": "02/22/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910259,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. WHILE DRIVING APPROXIMATELY 55 MPH, THE CONTACT RELEASED THE ACCELERATOR PEDAL AND THE VEHICLE CAME TO A COMPLETE STOP WITHOUT THE BRAKE PEDAL BEING DEPRESSED. THE CONTACT TOOK THE VEHICLE TO A CERTIFIED MECHANIC WHO DIAGNOSED THAT THE BRAKE AXLE AND SWAY WELDINGS FAILED, AND THE LOWER CONTROL ARM FRACTURED. THE CONTACT TOOK THE VEHICLE TO THE DEALER WHO INFORMED THE CONTACT THAT THE VEHICLE'S REPAIRS WERE NOT COVERED UNDER WARRANTY. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 187,000. UPDATED 01/06/2017*CT  *TR",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2015",
        "dateOfIncident": "03/18/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 60 MPH, THE VEHICLE STALLED WITHOUT WARNING. AFTER WAITING A FEW MOMENTS, THE VEHICLE RESTARTED AND RESUMED NORMALLY. THE FAILURE RECURRED FIVE TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO WAS UNABLE TO LOCATE THE FAILURE. THE VEHICLE WAS TAKEN TO ANOTHER INDEPENDENT MECHANIC, WHO INFORMED THAT THE FAILURE WAS CONTRIBUTED TO THE CRANK SHAFT SENSOR. THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/21/2015",
        "dateOfIncident": "10/27/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10717615,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SOME DRIVER HAD AN ACCIDENT, DUE TO A DUI, AND HIS CAR WAS STRADDLED ACROSS THE LEFT LANE AND I HIT IT AS I CAME AROUND THE BEND AT APPR. 11:30 P.M. IN A DARK SECTION OF THE HIGHWAY. MY CAR SUFFERED SEVERE FRONT END DAMAGE AND I AND MY SON WAS JERKED, BUT WE WERE BOTH WEARING OUR SEATBELTS. MY AIRBAG DID NOT DEPLOY AND MY ANTI-LOCK BRAKES LOCKED UP. WE WERE NEARLY WIPED OUT ON THE FREEWAY.  THOUGH MY LOCKED UP BRAKES CAUSED ME NOT TO BE ABLE TO GET IN THE NEXT LANE, THUS HITTING THE CAR, IF I HAD MADE IT TO THE LANE TO THE RIGHT OF ME, I WOULD NOT BE HERE TO TELL YOU ABOUT IT, TRUST ME. THOUGH THIS HAPPENED NEARLY 9 YEARS AGO, IT STILL HAPPENED AND I STILL HAVE MY NISSAN. MY SON AND I COULD HAVE BEEN KILLED DUE TO THE BRAKES LOCKING AND THE AIRBAG NOT DEPLOYING.    ALSO, MY EXTERIOR LIGHTS ALWAYS GO OUT, WAY MORE THAN THEY SHOULD AND THEY WERE POORLY DESIGNED. THE WINDOWS DON'T ALWAYS GO UP OR DOWN EITHER.",
        "vin": "1N4DL01A21C"
    },
    {
        "components": "STEERING,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2014",
        "dateOfIncident": "11/18/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659601,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING FROM WORK WHEN I HEARD A CRANKING/SQUEALING SOUND COMING FROM THE REAR PASSENGER SIDE, I STOPPED AND CHECKED COULD NOT FIND ANYTHING, BUT NOTICED THAT ANYTIME I STEPPED ON THE BRAKES/MAKE A TURN THE SOUND WILL COME ON, TOOK IT TO A MECHANIC WHO TOLD ME IT WAS THE MOTOR MOUNT AND ALSO THAT THE BRAKES WERE BEEN AFFECTED AND I COULD NOT DRIVE MORE THAN A CERTAIN MILE ON THE HIGHWAY. ALSO THE ENGINE LIGHT KEEPS COMING ON MY DASHBOARD, AFTER SEVERAL REPAIRS TO WHATEVER THE PROBLEM WAS, IT;S STILL ON, NOW NO ONE CAN TELL IF IT IS RELATED TO THE ISSUE CAR HAD OR NOT, THE HEADLIGHTS ON THE CAR HARDLY COME ON PROPERLY, EVEN IF I PUT THEM ON FULL LIGHT, IT'S STILL LOOKS DIM AND I CAN SEE WITH THEM AT NIGHT WHEN AM DRIVING, THE HEAT SUDDENLY COMES ON EVEN WITHOUT TURNING IT ON, AM REALLY SCARED NOW CAUSE I DON'T WANT TO GET IN AN ACCIDENT. NISSAN NEEDS TO DO SOMETHING ABOUT ALL THIS COMPLAINTS ESPECIALLY WITH SUCH HIGH RECALLS .  *TR",
        "vin": "1N4DL01A01C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "07/25/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10654531,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE REAR ENDED SOMEONE'S VAN WHILE ONLY GOING 15-20 MPH.  THE AIRBAG DEPLOYED AND THEN EXPLODED; CAUSING 2ND & 3RD DEGREE BURNS THROUGHOUT MY UPPER BODY.  SMALL PIECES OF DEBRIS WERE ALSO REMOVED FROM BRUISES I SUSTAINED THROUGHOUT MY UPPER BODY.  I BROKE/FRACTURED MY RIBS, DISLOCATED MY KNEE AND MY PELVIC BONE WAS SHATTERED.  THE AIRBAG MALFUNCTIONED AND THE AUTO BODY IN CHARGE OF REPAIRS FOR THIS CAR \"CONVENIENTLY\" MISPLACED THE AIRBAGS AFTER BEING ASKED SPECIFICALLY TO LEAVE THE AIRBAGS IN THE TRUNK OF THE VEHICLE......UPDATED 11-24/14  *BF",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/25/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649979,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS HIT BY ANOTHER CAR AND FRONT END BUCKLED BY THE CRASH AND AIR BAGS DID NOT DEPLOY......FRONT END DAMAGE WAS APPROX $5500 DUE TO LOW MILES WAS REPAIRED ALTHOUGH WE WOULD LIKE TO KNOW WHY THE AIRBAGS DID NOT DEPLOY?  *TR",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615385,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS IDLING ROUGH AND WILL STALL AT LIGHTS OR ANYTIME STOPPED WHILE IN GEAR. HAS ALMOST CAUSED ME TO BE REAR ENDED ON MANY OCCASIONS BECAUSE IT WILL IDLE THEN STALL.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/27/2014",
        "dateOfIncident": "05/06/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594404,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPED AT A TRAFFIC SIGNAL THE ENGINES RPM WOULD FALL BELOW 500 AND AT TIMES WOULD STALL THE ENGINE MAKING ME VULNERABLE TO A COLLISION. IT GOT SO BAD MY DAUGHTER WOULD NOT DRIVE THE VEHICLE.   I TOOK THE CAR TO SEVERAL MECHANICS OVER THE COURSE OF A YEAR AND NO ONE COULD FIX THE PROBLEM TUNE UPS AND SUCH DID NOT FIX THE PROBLEM, I SPENT HUNDREDS OF DOLLARS TRYING TO ELIMINATE THE PROBLEM TO NO AVAIL.    I FINALLY TOOK IT TO A MECHANIC WITH A SMOKE MACHINE AND HE FOUND THE INTAKE MANIFOLD HAD A LEAK AND THAT WAS THE PROBLEM COST $850.00 PLUS TAX.    I RESEARCHED INTAKE MANIFOLD VACUUM LEAK ON THE 2001 NISSAN ALTIMA AND FOUND THAT THERE WERE HUNDREDS OF NISSAN OWNERS WITH THE SAME VACUUM LEAK!    SEVERAL OF THE NISSAN OWNERS HAD TO MAKE THE REPAIR MORE THAN ONCE, SOME PEOPLE SPENT HUNDREDS OF DOLLARS ON VARIOUS FIXES THAT DID NOT WORK, I WAS TOLD BY ONE MECHANIC THAT IT WAS THE CATALYTIC CONVERTER LUCKILY I DID NOT GO FOR IT.    I BELIEVE IT IS A SAFETY DEFECT BECAUSE WHEN  THE CAR STALLS IN THE MIDDLE OF THE ROAD UNEXPECTEDLY IT LEAVES YOU WIDE OPEN FOR A CRASH OR WORSE!!      I THINK NISSAN, NORTH AMERICA SHOULD BE RESPONSIBLE FOR THE REPAIR, IT SEEMS TO BE A DEFECTIVE INTAKE MANIFOLD GASKET OR POOR ENGINE DESIGN WHICH CAUSE'S THE GASKET TO FAIL- IT MAY ALSO BE TOO CLOSE TO A HEAT SOURCE (THE EXHAUST MANIFOLD) CAUSING THE GASKET TO FAIL.    I THINK IT IS UNFAIR TO THE CONSUMER TO PAY FOR THIS REPAIR BECAUSE IT HAPPENS TO SO MANY NISSAN'S.  *TR",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578159,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED THAT THE FRONT PASSENGER'S SIDE AIR BAG WARNING LIGHT REMAINED ILLUMINATED WITH THE SEAT OCCUPIED. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO HAVE A DIAGNOSTIC PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 45,000 AND THE CURRENT MILEAGE WAS 80,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2013",
        "dateOfIncident": "01/09/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10492083,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED WHILE DRIVING 55 MPH, THE GAUGES ON THE INSTRUMENT PANEL FAILED AND RESET TO ZERO. THE VEHICLE WAS SHUTDOWN AND RESTARTED AND THE GAUGES RETURNED TO NORMAL. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 103,255.",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/11/2012",
        "dateOfIncident": "10/05/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479813,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR AN UNRELATED REPAIR WHEN THE TECHNICIAN ADVISED THE CONTACT THAT BOTH MOTOR MOUNTS WERE DEFECTIVE. THE VEHICLE WAS REPAIRED. THE MOTOR MOUNTS WERE REPLACED THREE TIMES ON SEPARATE OCCASIONS. THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.    UPDATED 11/27/12 *CN",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/21/2012",
        "dateOfIncident": "07/20/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466874,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDOW REGULATOR FAILED ON A CAR THAT WAS TRANSFERRED FROM A NON-\"HOT\" STATE, NEW YORK, TO A \"HOT\" STATE, FLORIDA. THE REGULATOR FAILED AFTER ONLY TWO MONTHS OF HOT WEATHER. THE REGULATORS WHERE NOT REPLACED IN INITIAL SERVICE CAMPAIGN WHICH HAS NOW EXPIRED. NISSAN REFUSES TO ACKNOWLEDGE THAT THERE WAS A CAMPAIGN TO REPLACE REGULATORS AS IT WAS NOT A FULL RECALL ON ALL CARS. THIS ISSUE DOES NOT ONLY AFFECT HOT WEATHER STATES AS YEARS OF SUMMERS IN OTHER STATES CAN STILL WEAR DOWN AND DAMAGE REGULATORS IF THIS FAILURE WAS SO QUICK TO HAPPEN AFTER MOVE.  *TR",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/01/2012",
        "dateOfIncident": "04/01/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457048,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED THAT WHILE STOPPED, THERE WAS A SIGNIFICANT DECREASE IN THE ENGINE RPMS AND THE ENGINE BEGAN TO SHAKE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT AN INTAKE GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 82,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2012",
        "dateOfIncident": "01/23/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445827,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT STATED THAT THE INSTRUMENT PANEL LIGHTS WOULD FAIL SPORADICALLY AND THE VEHICLE WOULD ALSO LOSE POWER INTERMITTENTLY, WITHOUT WARNING. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THERE WAS NOTHING THAT COULD BE DONE TO REPAIR THE VEHICLE.  THE FAILURE MILEAGE WAS 54,205 AND THE CURRENT MILEAGE WAS 75,312.",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/22/2011",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441042,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THE CAR THERE WAS A PIECE OF TAPE OVER THE AIRBAG LIGHT AND AUTO ZONE HELPED ME TAKE IT OFF. THE NISSAN DIED GETTING OFF THE INTERSTATE AND I LOST ALL CONTROL OF THE STEERING AND BRAKES. LATER TO FIND THAT I NEEDED A OXYGEN SENSOR AND NOW ELECTRICAL PROBLEMS WITH THE AIRBAG LIGHT BEING ON. I TOOK THE CAR TO THE DEALERSHIP AND THEY SAID I NEEDED EVAC HOSES BUT ALL THE DEALER DID WAS UNHOOK ONE SO THEY COULD CHARGE ME FOR CODES BECAUSE THEY COULD NOT FIND MY PROBLEM WITH NO ENGINE LIGHT PRESENT. SO MY MECHANIC FOUND THE UNHOOKED HOSE AND PUT IT BACK ON AND IT WAS PREVIOUSLY NOT UNHOOKED. THE CAR DIES RANDOMLY IN TRAFFIC AND IS VERY HAZARDOUS TO BE REAR ENDED OR EVEN TO HIT SOME ONE ELSE WITH THE DEALER NOT EVEN KNOWING HOW TO PROPERLY RESOLVE THIS ISSUE???? MY MECHANIC WILL BE HELPING ME TO MAKE THIS CAR SAFER FOR ME TO DRIVE.  *TR",
        "vin": "1N4DL01A61C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2011",
        "dateOfIncident": "05/29/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405990,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST HAD TO REPAIR/REPLACE THE INTAKE MANIFOLD GASKET ON THE #4 CYLINDER FOR THE 2ND TIME ON MY 2001 NISSAN ALTIMA.  THE FIRST TIME WAS FEB 23, 2005 AT JUST UNDER 57,000 MILES.  NOW, THE MILEAGE IS 123,225.  LUCKILY, MY FIANCE WORKS AT A REPAIR SHOP AND THEY GAVE ME A BREAK ON THE LABOR RATE!  AT A REDUCED LABOR RATE, THE REPAIR WAS $287.00, ALL LABOR EXCEPT $7.13.  MY CAR STARTED TO IDLE ROUGH WHEN STOPPED AT LIGHTS OR STOP SIGNS, ALMOST LIKE IT WANTED TO DIE.  SINCE IT HAD HAPPENED ONCE BEFORE, I KNEW WHAT THE PROBLEM WAS THIS TIME!! *TR",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2011",
        "dateOfIncident": "02/23/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405988,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 NISSAN ALTIMA HAD TO HAVE THE INTAKE MANIFOLD GASKET AT THE #4 CYLINDER REPLACED WHEN THE VEHICLE HAD 56,955 MILES ON IT IN FEB 2005.  THE PART WAS LESS THAN $10.00 BUT THE REPAIR WAS OVER $734.14 DUE TO LABOR.  I JUST HAD TO REPLACE THE EXACT SAME PART A COUPLE OF WEEKS AGO.  THE VEHICLE HAS A LITTLE OVER 123,000 MILES ON IT.  BOTH TIMES, THE VEHICLE WOULD START IDLING EXTREMELY ROUGH WHEN STOPPED AT A LIGHT OR STOP SIGN.  WHEN YOU START TO ACCELERATE, AT TIMES, THE CAR WOULD ACT LIKE IT WAS GOING TO DIE.  *TR",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/15/2011",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10382818,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 ALTIMA SE IDLE PROBLEM WHEN ON A STOP. SIMILAR IDLE PROBLEMS I HAD IN MAY 2005 IN WHICH THE DEALERSHIP REPLACED THE INTAKE MANIFOLD GASKET WHICH IS LEAKING AT #4 CYL. PAID NOTHING BECAUSE ITS STILL UNDER WARRANTY. SAME PROBLEM AGAIN IN MAR 2007, WITH 60,802 MILES, DEALER REPLACED THE SAME INTAKE MANIFOLD GASKET INWHICH THIS TIME, I PAID A LOT OF MONEY TO GET IT FIX. NOW, ON THE THIRD TIME, WITH 120,000 MILES, I'M HAVING SIMILAR IDLE PROBLEM AND PROBABLY I WILL HAVE THE DEALER TO WORK ON IT. THIS IS REALLY A BIG PROBLEM FOR THIS CAR AND I TAUGHT THAT THERE IS A RECALL ON IT. IT'S REALLY UNSAFE AND COULD CAUSE SERIOUS ACCIDENT IF THE DRIVER DOESN'T KNOW HOW TO HANDLE/OPERATE WHEN THIS PROBLEM OCCURS. *TR",
        "vin": "1N4DL01A91C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/02/2011",
        "dateOfIncident": "02/16/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379986,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA. WHILE DRIVING APPROXIMATELY 40 MPH IN SNOWY CONDITIONS, THE DRIVER SIDE WINDSHIELD WIPER LINKAGE FELL OFF. THE CONTACT CONTINUED DRIVING AND LATER REPLACED THE LINK ASSEMBLY. THE A FILURE OCCURRED AGAIN ON THE SAME SIDE. THE VEHICLE WAS REPAIRED AGAIN. THE FAILURE MILEAGE WAS 117,000 AND THE CURRENT MILEAGE IS 128,000.      UPDATED 03/16/11  *BF  UPDATED 09/19/11",
        "vin": "1N4DL01A01C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/11/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376234,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 NISSAN ALTIMA.  I BOUGHT THE CAR WITH 50,000 MILES ON IT, AND GOT AN EXTENDED WARRANTY.  AT 52,000 MILES, I HAD MAJOR SHAKING AT IDLE, TOOK IT IN, AND THEY REPLACED THE INTAKE MANIFOLD GASKET UNDER WARRANTY.  NOW, AT 74,000 MILES, ONLY 22,000 MILES MORE, THE SAME THING IS HAPPENING, AND THE CHECK ENGINE LIGHT CAME ON.  I TOOK THE CAR TO AUTOZONE, AND THEY RAN A DIAGNOSTIC CHECK, WHICH INDICATED THE PROBABILITY OF A VACUUM LEAK, POSSIBLY DUE TO A FAULTY GASKET, ETC.  THIS PROBLEM IS APPARENTLY VERY COMMON WITH THIS YEAR ALTIMA, AND NISSAN HAS NEVER ISSUED A RECALL.   FROM WHAT I CAN GATHER, THERE IS EXCESSIVE HEAT IN THE AREA NEAR THE MANIFOLD GASKET (WHICH IS A 15.00 PART), LEADING TO PREMATURE BREAKDOWN OF THE GASKET.  SIMPLE HEAT SHIELDING WOULD TAKE CARE OF THIS PROBLEM, BUT NISSAN HAS DONE NOTHING.  THIS IS DEFINITELY A SAFETY ISSUE, AS THE CAR COULD DIE AT IDLE AT A STOP LIGHT, AND THE DRIVER COULD BE REAR ENDED.  FROM WHAT I HAVE READ, THIS IS AN INCREDIBLY EXPENSIVE JOB, DUE TO 5 OR MORE HOURS OF LABOR TO GET THE GASKET REPLACED.  *TR",
        "vin": "1N4DL01D91C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/13/2010",
        "dateOfIncident": "02/16/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370366,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA. WHILE DRIVING APPROXIMATELY 55 MPH, THE WINDSHIELD WIPER ON THE DRIVER SIDE STOPPED WORKING DUE TO THE LINKAGE BREAKING OFF. THE CONTACT REPLACED IT AND IT BROKE AGAIN DURING A SNOW STORM. THE VEHICLE WAS NOT TAKEN TO THE DEALER OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 115,000.",
        "vin": "1N4DL01A01C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/24/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368730,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE FREQUENTLY STALLED DURING THE PAST MONTH. NOW ITS MILLAGE IS 105,000.",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2010",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363494,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA. THE CONTACT WAS DRIVING APPROXIMATELY 20 MPH, THE VEHICLE BEGAN TO SHAKE AND THEN THE ENGINE COMPLETELY STALLED WITHOUT WARNING. THE VEHICLE RESTARTED AND RESUMED NORMALLY. THE FAILURE OCCURRED AT VARIOUS SPEEDS WHEN THE VEHICLE WAS IN OPERATION. THE VEHICLE WAS TAKEN TO A DEALER AND INDEPENDENT MECHANIC FOR DIAGNOSIS. THE TECHNICIANS INFORMED THAT THE MANIFOLD GASKET EXHIBITED A LEAKAGE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 51,000.",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357026,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FAILURE I AM WRITING ABOUT IS INTAKE MANIFOLD GASKET IN THE 2001 NISSAN ALTIMA IN DOING RESEARCH IT IS EVIDENT THIS PROBLEM OCCURS IN MOST OF THESE CARS IN ORDER TO FIX HAD TO BRING TO MECHANIC AND PAY $900 FOR A PART THAT COST NO MORE THEN$20 THERE HAS BEEN OTHER COMPLAINTS SUBMITTED TO YOU ABOUT THIS VERY ISSUE FROM OTHERS IT IS EASY TO SEE HOW WIDE SPREAD THIS ISSUE IS WITH ONE QUICK INTERNET SEARCH. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/27/2010",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352335,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLING WHEN NOT IN MOTION, SHUTTING OFF IN THE MIDDLE OF TRAFFIC, OCCURS WHENEVER I DRIVE THE CAR. THE INTAKE MANIFOLD GASKET HAS TO BE REPLACED. MANY OTHER CONSUMERS SHARE THE SAME PROBLEM.  NISSAN ALTIMA 2001 LIMITED EDITION. *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10336713,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RECLINED FRONT PASSENGER SEATS MAKE SEATBELT INEFFECTIVE.  INADEQUATE WARNING TO PASSENGERS.  WARNINGS LISTED IN OWNER'S MANUEL ONLY.  NEED WARNING IN SIGHT OF PASSENGER.  THIS IS A PROBLEM WITH MOST CARS, NOT ONE PARTICULAR MANUFACTURER. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "02/09/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313791,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GASKET ISSUE...CAR STARTS SHAKING AT STOP SIGNS AND ONE HAS TO PUSH THE GAS PEDAL PRETTY HAND. CAN BE DANGEROUS.     THE PART WAS REPAIRED ....BUT BECAUSE IT WAS 100K MILES + ....HAD TO PAY 1200 DOLLARS TO FIX THE ISSUE. LOOKS LIKE A SCAM BY NISSAN AND DEALERS....SEVERAL COMPLAINTS ON THE SAME TOPIC.  *TR",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/30/2010",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303356,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STARTED TO ALMOST DIE AND VIBRATE WHILE STOPPED AT RED LIGHTS. I AM PAYING $636 TO HAVE THE MANIFOLD GASKET REPLACED. THE CAR ONLY HAS 66000 MILES ON IT AND IS GARAGE KEPT AND PERFECTLY MAINTAINED. BASED ON THE LARGE NUMBER OF IDENTICAL COMPLAINTS REPORTED TO NHTSA, I BELIEVE THIS A MANUFACTURER'S DEFECT AND SHOULD BE REIMBURSED BY NISSAN. I ALSO REGISTERED THIS COMPLAINT WITH THE NISSAN WEBSITE TODAY. *TR",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/28/2010",
        "dateOfIncident": "01/09/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303051,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 NISSAN ALTIMA, THAT IS VIBRATING A LOT WHEN I STOP AT A TRAFFIC LIGHT. I CAME TO KNOW IT IS DUE TO INTAKE MANIFOLD GASKET PROBLEM. SO I AM REQUESTING A FREE REPLACEMENT BY NISSAN TO SOLVE THAT ISSUE.  TW*",
        "vin": "1N4DL01A01C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/15/2009",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295745,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 NISSAN ALTIMA ,ROUGH IDLE APPEARS TO ACT AS IF THERE IS A DEAD MISS. CHECKED OUT BY MECHANIC AND ITS THE INTAKE MANIFOLD AND IS A COMMON OCCURRENCE . NISSAN SHOULD TAKE RESPONSIBILITY AND RECALL  THIS. FAILURE MILEAGE 58,000. *TR",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/11/2009",
        "dateOfIncident": "12/11/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295361,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "SECOND TIME MANIFOLD GASKET PROBLEM HAS OCCURRED ON MY 2001 NISSAN ALTIMA.  IT HAS A ROUGH IDLES WHEN STOPPED AT LIGHTS, IN GEAR, NEUTRAL OR IN PARK.  NISSAN NEED TO BE ACCOUNTABLE FOR THIS WIDESPREAD PROBLEM.  BOTH INSTANCES HAVE INCLUDED THE ENGINE STALLING IN THE MIDDLE OF TRAFFIC. *TR",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "08/14/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294070,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 NISSAN ALTIMA HAS A DEFECTIVE INTAKE MANIFOLD GASKET, CAUSES ROUGH IDLE AND CAR TO SHUT OFF WHEN ENGINE IS ON.  THIS LEADS TO LOSS OF CONTROL OF CAR AND STALLING IN TRAFFIC.  THIS IS A COMMON PROBLEM WITH A $10 PART, WHICH COSTS $600+ TO REPAIR.  NISSAN SHOULD BE AWARE OF THIS COMMON PROBLEM AND HAVE IT REPLACED ON THESE CARS. *TR",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/06/2009",
        "dateOfIncident": "11/06/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291283,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXTREMELY ROUGH IDLING THAT DULLS DOWN UPON PUTTING CAR IN PARK BUT DOES NOT STOP. IT SEEMS AS THOUGH THE CAR MIGHT STALL AT TIMES. PROBLEM HAS BEEN GETTING PROGRESSIVELY WORSE FOR THE PAST FEW MONTHS. I WAS STOPPED THE OTHER DAY ON A HILL AND THE CAR LOST ACCELERATION POWER AND ALMOST STALLED. THIS COULD BE A MAJOR SAFETY ISSUE THAT COULD LEAD TO ACCIDENTS WITH STALLING OR THE LOSS OF ACCELERATION POWER. THIS PROBLEM STARTED ABOUT 6 MONTHS AGO. CHECK ENGINE LIGHT HAS ALSO APPEARED AND REMAINED ON CONSTANTLY. TOOK IT IN FOR REPAIR AND APPARENTLY IT IS A INTAKE MANIFOLD GASKET THAT NEEDS REPLACED, WHICH IS A VERY EXPENSIVE REPAIR ($600-$800). IT SEEMS TO BE A COMMON PROBLEM AND POTENTIALLY VERY DANGEROUS ONE THAT NEEDS TO BE ADDRESSED/RECALLED.TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/29/2009",
        "dateOfIncident": "10/28/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290263,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD GASKET, WHICH IS A PROBLEM NISSAN IS AWARE OF ON MOST OF THE 2000-2004 ALTIMA CARS, MAKES THE CAR SHAKE AND SEEM LIKE IT IS GOING TO STALL WHILE IDLE.  SOMETIMES IT DOES IT WHILE DRIVING, AND HAS IN SOME CASES MADE THE CAR GO DEAD WHICH DOESN'T ALLOW THE CAR TO BE STEERED AWAY FROM DANGER. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/28/2009",
        "dateOfIncident": "03/18/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285505,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ONLY 64000 MILES AND THIS CAR SHAKES RATTLES AND ROLLS AT IDLE. I DID A SEARCH IN GOOGLE, IT IS A VERY COMMON ISSUE FOR 2000 AND 2001 NISSAN ALTIMA. THERE ARE ALREADY QUITE A FEW SIMILAR COMPLAINTS FILED. I HAVE TAKEN IT TO THE DEALER, THE REPAIR BILL IS $1175. THEY NEED TO REPLACE THE GAS INTAKE GASKET. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "01/22/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10278664,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A FRONT-END IMPACT ACCIDENT WHILE DRIVING MY 2001 NISSAN ALTIMA GXE. THE CAR WAS TOTALED. THE AIR BAGS DID NOT DEPLOY. I WAS WEARING MY SEATBELT BUT WAS STILL INJURED. I RECEIVED INJURY TO MY RIGHT KNEE, LOWER BACK, AND BOTH WRISTS. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "03/12/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276729,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT FIRST MY CAR STARTED SHAKING AND I WAS TOLD THAT THERE WAS WATER IN MY GAS TANK.  I HAD A TUNE UP DONE ON MY CAR AND THE SHAKING STOPPED MOMENTARILY.  THE SHAKING STARTED AGAIN AND WOULD GET SO BAD THAT MY CAR WOULD SHUT OFF IN THE MIDDLE OF THE STREET.  I WAS DRIVING AND ABOUT TO GET ON THE HIGHWAY AND MY CAR SHUT OFF IN THE MIDDLE OF ONCOMING TRAFFIC.  THANKFULLY, IT WAS EARLY IN THE MORNING AND THERE WERE ONLY FEW CARS ON THE ROAD.  I TOOK MY CAR TO A MECHANIC AND HE STATED THAT THE INTAKE MANIFOLD GASKET NEEDED TO BE CHANGED.  AFTER DOING SOME RESEARCH I HAVE FOUND THAT OTHER PEOPLE WITH THE SAME CAR ARE HAVING THE SAME ISSUE.  *TR",
        "vin": "1N4DL01A51C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "07/08/2009",
        "dateOfIncident": "05/19/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276158,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 NISSAN ALTIMA GXE 2.4 WITH 70,000 MILES.  ON OR ABOUT THIS DAY MY WIFE AND 8 MONTH OLD DAUGHTER WERE DRIVING ON A EXPRESSWAY WHEN A ACCIDENT OCCURRED IN FRONT OF THEM.  MY WIFE WAS ABLE TO STOP AND AVOID THE ACCIDENT. WHILE WAITING FOR THE ACCIDENT TO CLEAR THE CAR STALLED DUE TO THE #4 INTAKE EXHAUST MANIFOLD GASKET FAILURE.  WHILE RESTARTING THE CAR TO ADVANCE TO A SAFER AREA. THAT IS WHEN A CAR HIT THEM IN THE REAR AND PUSHED THEM INTO THE CAR INFRONT OF THEM, CAUSING ALMOST $3000.00 DAMAGE TO OUR CAR.  MY WIFE AND I STILL HAVE DIFFICULTY SLEEPING THROUGH THE NIGHT, THINKING OF THE HARM THAT COULD HAVE HAPPENED TO OUR DAUGHTER.  I STILL HAVE BEEN UNABLE TO AFFORD TO FIX THIS DEFECT ON OUR CAR AND CONTINUE TO DRIVE IT MOST DAYS WHILE IT TRIES TO STALL OUT ON ME.  THIS DEFECT IS CONSISTENT WITH COMPLAINTS #10167168,101451161,10100639 AND#10163901.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/04/2009",
        "dateOfIncident": "03/11/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275759,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN ALTIMA 2001  I JUST WANT JOINT SO MANY CAR OWNER WITH THE SAME PROBLEM ;REPLACING THE INTAKE MANIFOLD GASKET. NISSAN CHARGE $840.00 TO FIX IT.  REFERENCE THE EXISTING COMPLAINTS:  #10167168  #10145161  #10100639  #10163901. *TR",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/27/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275091,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INTAKE MANIFOLD GASKET ON MY 2001 NISSAN ALTIMA GXE IS LEAKING.  I HAD TO PAY OVER $480.00 TO GET IT REPAIRED.  SEVERAL HUNDRED OTHER VEHICLES HAVE HAD THE SAME PROBLEM AND NISSAN SHOULD DO A RECALL OR REIMBURSE MY SELF AND OTHERS FOR THIS DEFECT IN THE PAT OR ENGINEERING FLAW.  THIS IS A MAJOR EMISSION PROBLEM AND I WOULD NOT PASS INSPECTION IN VIRGINIA. *TR",
        "vin": "1N4DL01D71C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/13/2009",
        "dateOfIncident": "06/13/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273713,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH IDLING THAT STARTED ABOUT 6 MONTHS AGO.  THE CAR HAS CUT OFF ABOUT 3 TIMES WHILE I WAS SITTING AT A RED LIGHT.  I HAVE CHANGED SPARK PLUGS, SPARK PLUG WIRES, FUEL FILTER, OXYGEN SENSOR AND NOTHING HAS HELPED. I HAVE A MECHANIC WHO THINKS IT IS POSSIBLY THE FUEL INJECTOR BUT I DON'T WANT TO KEEP SPENDING MONEY FOR SOMETHING THAT SEEMS TO BE A PROBLEM THAT A LOT OF PEOPLE ARE HAVING WITH THIS MAKE AND MODEL.  THERE SHOULD BE RECALL ON THIS FAULTY PART THAT IS CAUSING THE PROBLEM FOR EVERYONE. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/02/2009",
        "dateOfIncident": "06/02/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272697,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER OF A 2001 NISSAN ALTIMA SE 2.4L, BOUGHT NEW IN 2001, ALL SERVICES AND TAKEN GOOD CARE . HAD THE MANIFOLD GASKET REPAIRED , THEN THE O2 SENSOR, AND NOW THE WHOLE CATALYTIC CONVERTER IS FAULTY AND THE ESTIMATE FOR THIS LAST WORK IS $400 (FROM A LOCAL CHEAP MECHANIC, FORGET ABOUT THE BRAND NAME  MECHANICS IN BAY AREA , WOULD BE 3 TIMES I GUESS). MILES ON THE CAR : ONLY 70K AND I AM THE ONLY DRIVER. CHECK CARCOMPLAINTS.COM FOR 100+  NISSAN ALTIMA 2001 CAR ENGINE COMPLAINTS ALONE. PLEASE I WOULD REQUEST THIS ORGANIZATION TO TAKE ACTION AND LET NISSAN PAY FOR THE SERVICES AND LOST TIME BECAUSE OF THIS BAD DESIGN AND COMMON PROBLEM.    THANK YOU.  SHAHID USMAN *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/23/2009",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR VERY ROUGHLY IDLES, AND HAS SHUT OFF ABOUT 3 TIMES. OIL INSIDE THE #1 SPARK PLUG WIRE WHERE IT CONNECTS TO THE PLUG.    CHANGED, FUEL FILTER, AIR FILTER, SPARK PLUGS, PLUG WIRES, ROTOR, DISTRIBUTOR CAP, VALVE COVER GASKET, ANTIFREEZE, OIL AND OIL FILTER. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/07/2009",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267910,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ROUGH IDLING AND VIBRATIONS IN THE ENGINE STARTED IN 2006 AT 102,000 MILES. SERVICE ENGINE LIGHT TURNS ON. THEN, A FEW WEEKS LATER THE ENGINE LIGHT STAYED ON. WENT TO NUMEROUS MECHANICS WHO COULDN'T FIGURE OUT THE PROBLEM.  DROVE THE CAR LIKE THIS FOR THE LAST 3 YEARS TRYING TO FIGURE OUT THE PROBLEM!  ENGINE NOW BUCKS AND STALLS OUT. THE ONLY WAY TO SIT AT A STOP SIGN OR RED LIGHT WITHOUT YOUR CAR STALLING IS TO PUT YOUR FOOT ON THE GAS AND BRAKE AT THE SAME TIME!  YOU HOPE AND PRAY YOU DON'T RUN INTO THE CAR IN FRONT OF YOU!  I'VE HAD THIS PROBLEM FOR ALMOST 3 YEARS! NOW, THERE IS POPPING NOISES COMING FROM THE ENGINE.  YOU CAN PUSH THE GAS PEDAL TO THE FLOOR AND THE CAR WON'T MOVE! AFTER A WHILE THE CAR WILL TAKE OFF!  TRY GETTING ONTO THE HIGHWAY WITH THIS ISSUE!!  AFTER REPLACING SPARK PLUGS, DISTRIBUTOR CAPS, HARNESSES, FUEL INJECTORS, FUEL FILTERS, O-RINGS, ETC. WE FINALLY FIGURED OUT IT WAS THE INTAKE MANIFOLD GASKET!  A CHEAP PART TO BUY BUT EXTREMELY EXPENSIVE TO FIX!  OVER THE LAST THREE YEARS I HAVE SPENT OVER $4,000 TO ACTUALLY FIX MY CAR!  THIS IS ABSOLUTELY RIDICULOUS!  AFTER SEARCHING THE INTERNET TO SEE IF ANYONE ELSE WAS HAVING A PROBLEM, I FOUND 110 COMPLAINTS ABOUT THE SAME ISSUE!  EVERY SINGLE PERSON HAD THE SAME PROBLEMS WITH THE 2000-2001 NISSAN ALTIMA!!  PLEASE RECALL THIS ITEM!  I WOULD HATE TO SEE SOMEONE BECOME SERIOUSLY INJURED OR KILLED BECAUSE OF NISSAN!!  A SIMPLE RECALL TO REPLACE A $10.00 PART TO SAVE A LIFE...... OR A LAWSUIT AND A LOST LIFE!  THIS SHOULD BE A NO BRAINER!!  A RECALL OR A CLASS ACTION LAWSUIT.....NISSAN SHOULD HURRY UP AND TAKE THEIR PICK!!!  I WILL NOT BUY ANOTHER NISSAN!! *TR",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/27/2009",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266850,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "999R5-AR000",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "BACK REAR WINDOW REGULATORS NOT FUNCTIONING. *TR",
        "vin": "1N4DL01D21C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/15/2009",
        "dateOfIncident": "04/14/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265516,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA.  THE CONTACT STATED THAT THE INTAKE MANIFOLD GASKET WAS FAULTY.  THE VEHICLE IDLES ROUGHLY WHENEVER IT IS IN PARK OR STOPPED.  THE VEHICLE WAS TAKEN TO THE DEALER FOR REPAIR, BUT THE AMOUNT FOR THE GASKET WAS ONLY $11.  HOWEVER, THE REPAIR WOULD COST $600.  THE DEALER IS NOT REPLACING THE GASKET.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 122,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/13/2009",
        "dateOfIncident": "03/13/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265063,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA.  THE CONTACT NOTICED THAT THE VEHICLE WOULD STALL WITHOUT WARNING WHILE IDLING.  ON ONE OCCASION, HE NOTICED THAT THE ENGINE WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT CONTROL PANEL PRIOR TO THE FAILURE.  HE TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT THE CAUSE OF THE FAILURE WAS THE INTAKE MANIFOLD GASKET.  THE CONTACT IS IN THE PROCESS OF HAVING THE VEHICLE REPAIRED AT THE ESTIMATED COST OF $900.  THE VIN WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE 130,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/24/2009",
        "dateOfIncident": "10/11/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262935,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "999R5-AR000",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "NISSAN ALTIMA GLE 2001 REQUIRED THE INTAKE MANIFOLD GASKET REPLACEMENT ON 10/11/03 UNDER WARRANTY BECAUSE THE CAR IDLED VERY HIGH WHEN  AT A STOP LIGHT.   THE SAME PROBLEM HAS RECURRED.  WHEN CONSULTING CARCOMPLAINT.COM THERE ARE OVER 80 OF THE SAME COMPLAINTS.  MY DAUGHTER HAD THE SAME PROBLEM AND DID NOT REPORT IT.  SHE HAD IT REPAIRED WITHOUT WARRANTY COVERAGE.  I SUGGEST THAT YOU GO TO WWW.CARCOMPLAINT.COM/NISSAN/ALTIMA/2001 AND READ THE COMPLAINTS.  I AM SURE THIS DEFECT IS NOT LIMITED TO THE 2001 ALTIMA. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/20/2009",
        "dateOfIncident": "01/28/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262558,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 NISSAN ALTIMA SHAKES WHEN IN THE IDLE OR STOP POSITION. HAVE HAD ALL THE REPAIRS DONE TO THAT I COULD AFFORD. WENT ON TO AUTOBEEF.COM AND READ 74 OTHER COMPLAINTS FOR THE SAME PROBLEM. WE ALL HAVE THE SAME QUESTION WHY WASN'T THIS CAR RECALLED OR FIXED BY NISSAN. IT WAS A MISTAKE ON THEIR BEHALF. I AM SCARED TO DRIVE MY CAR AND IT IS MY ONLY MEANS OF TRANSPORTATION. I THINK THAT THIS PROBLEM SHOULD BE RESEARCHED AND TAKING CARE OF AND NOT BY THE CONSUMER OF THESE DANGEROUS CARS. ALSO SOMEONE SHOULD READ THE COMPLAINTS ON THIS MAKE, YEAR AND MODEL OF THIS CAR. IT IS A 2001 NISSAN ALTIMA AND THE MAJOR COMPLAINT IS A FAULTY INTAKE MANIFOLD GASKET. LIKE I SAID IT IS AN ISSUE THAT NEEDS TO BE LOOKED INTO AND SOMETHING DONE ABOUT IT BEFORE THERE ARE ANY DEATHS. OR IS THAT SOMETHING THAT HAS TO HAPPEN BEFORE THE PROBLEM IS TAKEN CARE OF??????? *TR",
        "vin": "1N4DL01D41L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "02/10/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261362,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RPMS JUMPING UP AND DOWN AT IDLE. MECHANIC TOLD ME IT WAS A MISFIRE ON CYLINDER 4 AND I NEEDED A INTAKE MANIFOLD GASKET. (HE KNEW THIS BECAUSE HE SPRAYED CARB CLEANER BY  CYLINDER 4)A $500 JOB. CAR MAYBE 8 YEARS OLD BUT IT ONLY HAS 38,000 MILES ON IT. NO REASON GASKET SHOULD BURN OUT ON ONE SIDE LIKE THAT. *TR",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2009",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253683,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AN INSPECTION OF MY TIRES, I FOUND A CRACK COMPLETELY THROUGH MY ORIGINAL FACTORY 16 INCH ALUMINUM WHEEL ON ONE OF THE SIX SPOKES.  NO SIGNS OF IMPACT FOUND.  I REPLACED WHEEL WITH A USED PART. *TR",
        "vin": "1N4DL01D91C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/08/2008",
        "dateOfIncident": "06/28/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251072,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 NISSAN ALTIMA SE. IT IS A 5 SPEED MANUAL TRANSMISSION. MY CAR STARTED HAVING LOW IDLE PROBLEMS ABOUT 6 MONTHS AGO. I HAD A TUNE UP DONE WHICH INCLUDED NEW SPARK PLUGS, WIRES, DISTRIBUTOR ROTOR AND CAP. THE CAR STILL HAD LOW IDLE PROBLEMS. I THEN RESEARCHED THE ISSUE ON THE INTERNET AND FOUND MANY PEOPLE HAVE THE SAME PROBLEM WITH THEIR 2000-2001 NISSAN ALTIMA. I OWN A 2001 NISSAN ALTIMA SE. THE PROBLEM TURNS OUT TO BE A FAULTY INTAKE MANIFOLD GASKET THAT LEAKS AND IS VERY EXPENSIVE TO FIX. ($600-$1000).   I SEE WHERE NISSAN REFUSES TO ADMIT THIS IS A DESIGN FLAW AND WILL NOT CONSIDER A RECALL. YOU CAN ALSO REFERENCE CASE #10167168, 10145161,10100639, AND 10163901. MY CAR HAS NOT BEEN FIXED YET AND THE IDLE IS GETTING TO THE POINT WHERE MY CAR IS ALMOST STALLING WHEN I COME TO A STOP. *TR",
        "vin": "1N4DL01D41C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/10/2008",
        "dateOfIncident": "08/11/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248228,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 NISSAN ALTIMA. SIMILAR TO WHAT I HAVE READ ON DOZENS OF WEBSITE, IT STARTED IDLING HIGH (AT ONLY 55,000 MILES) AND ULTIMATELY HAD TO REPLACE THE INTAKE MANIFOLD GASKET AT A COST OF $852.05. I WAS TOLD NOT TO DRIVE THE CAR AFTER THE PROBLEM HAD BEEN DIAGNOSED. SADLY FOR ME, IT WAS THREE WEEKS AFTER THE EXTENDED WARRANTY HAD EXPIRED AND NISSAN REFUSED TO OFFER ANY PRICE BREAK ON THE SERVICE. THIS PROBLEM SEEMS TO BE EXCEEDINGLY COMMON - AND OFTEN ON VERY LOW MILEAGE VEHICLES SUCH AS MINE. NISSAN SHOULD ISSUE A RECALL AND FIX THIS PROBLEM. *TR",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/10/2008",
        "dateOfIncident": "04/04/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248241,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 89,000 MILES MY 2001 NISSAN ALTIMA GXE BEGAN EXPERIENCING EXTREMELY ROUGH IDLING.  ENGINE WILL STALL.  THIS HAS HAPPENED TO HUNDREDS OF OTHER ALTIMA OWNERS  I AM ASKING FOR A RECALL TO CORRECT THIS MANUFACTURERS DEFECT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2008",
        "dateOfIncident": "10/28/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248052,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NISSAN ALTIMA GXE MODEL 2001. AFTER A THOROUGH RESEARCH ON THE WEB, I FIND THAT \"INTAKE MANIFOLD GASKET LEAK\" IS A COMMON PROBLEM IN NISSAN ALTIMA. IT COST BETWEEN $700 - $1200 (THOUGH PART IS FOR $15-$30 ONLY). WITH THIS PROBLEM, CAR START SHAKING VIOLENTLY WHEN YOU STOP AT LIGHT. SERVICE ENGINE LIGHT FEQUENTLY LIGHTS UP. CAR STALLS ABRUPTLY IN THE LIGHT. ON A HIGH WAY DRIVE, CAR CAN STALL ANYTIME WHICH IS A GREAT HAZARD, ESPECIALLY WHEN YOU TRAVEL WITH A KID OR AN OLD AGE PEOPLE. NISSAN SHOULD HELP OWNERS FIX THIS AND SHOULD IMMEDIATELY RECALL THIS CARS WITH THIS KIND OF FAULTY PARTS.  *TR",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/28/2008",
        "dateOfIncident": "01/05/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246983,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 NISSAN ALTIMA GXE WITH 89,207 MILES ON IT.  SEVERAL MONTHS AGO, I NOTICED A ROUGH IDLING AT STOPLIGHTS, SO BAD SOMETIMES I THOUGHT MY CAR WAS GOING TO DIE OUT ON ME.  ON SEPTEMBER 19, 2008, I TOOK MY CAR INTO THE MCCARTHY BLUE SPRINGS NISSAN AND WAS TOLD THAT I NEEDED TO REPLACE MY INTAKE MANIFOLD.  THEY HAD TO ORDER THE PARTS, AND WAS ADVISED TO NOT DRIVE MY CAR AGAIN UNTIL IT GETS FIXED.  SO, I HAD TO LEAVE MY CAR AT THE NISSAN DEALERSHIP OVER THE WEEKEND AND WAS NOT ABLE TO PICK IT UP UNTIL SEPTEMBER 22, 2008.  IN OTHER WORDS, I WAS WITHOUT A CAR FOR 4 DAYS.  IN RESEARCHING MY PROBLEM ONLINE TO SEE IF IT'S A NOTABLE PROBLEM WITH NISSAN ALTIMA'S I CAME ACROSS SEVERAL WEBSITES COMPLAINING OF THE SAME THING.  MOST OF WHICH HAD TO REPLACE THE INTAKE MANIFOLD AT MUCH LOWER MILEAGE THAN MINE.  THE REPLACEMENT COSTS SEEMS TO BE ABOUT THE SAME ACROSS THE BOARD, TO BE BETWEEN $700 AND $800 PLUS.  IN RESEARCHING MY PROBLEM I DON'T UNDERSTAND WHY THIS HASN'T BEEN A RECALL FOR ALL NISSAN ALTIMA'S.  THERE ARE MANY WEBSITES COMPLAINING OF THE VERY PROBLEM OF HAVING TO REPLACE THE INTAKE MANIFOLD ON NISSAN ALTIMA'S.  WHEN I TOOK MY CAR IN PREVIOUSLY (JANUARY 5, 2008) FOR THE SAME PROBLEM I WAS TOLD THAT I HAD A BROKEN MOTOR MOUNT.  SO, I PAID TO HAVE THAT FIXED WHICH WAS OVER $450.  MY CAR RAN FINE FOR ABOUT A MONTH, UNTIL I STARTED NOTICING THAT IT WAS IDLING HARD AT STOPLIGHTS, BUT I FIGURED IT WAS JUST DUE TO THE COLD.  WHEN I CALLED NISSAN ABOUT IT, THEY ASKED ME IF MY CHECK ENGINE LIGHT WAS ON, AND IT WASN'T SO THEY JUST SAID IT WAS DUE TO IT BEING COLD.  BUT IT NEVER STOPPED AND CONTINUED TO GET WORSE AND WORSE.  UNTIL I FINALLY WAS ABLE TO TAKE IT BACK INTO NISSAN TO HAVE THEM LOOK AT IT AGAIN AND THAT'S WHEN THEY SAID IT WAS THE INTAKE MANIFOLD.  I'D LIKE TO KNOW HOW MANY COMPLAINTS HAVE BEEN SUBMITTED ON THIS VERY PROBLEM AND HOW MANY IT TAKES FOR YOU TO CONSIDER A RECALL. *TR",
        "vin": "1N4DL01D71C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/16/2008",
        "dateOfIncident": "05/24/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245727,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "999R5-AR000",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON AND UPON DIAGNOSTICS IT SAYS CATALYTIC CONVERTER IS DEFECTIVE HOWEVER AFTER REPLACING CATALYTIC CONVERTER AND SENSOR PROBLEM STILL PERSISTS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/03/2008",
        "dateOfIncident": "10/03/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244349,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 NISSAN ALTIMA GETTING P0304 CODE AT 99,500 MILES.  SEARCHED ON A DISCUSSION BOARD AND THERE ARE MANY OTHER USERS WITH THIS SAME CODE.  THE CODE IS FOR INTAKE MANIFOLD GASKET.  IT SEEMS THAT NISSAN IS ALSO AWARE OF THIS DEFECT BUT IS REFUSING TO RECALL AND PAY FOR REPAIRS.  THIS IS NOT AN ISOLATED CASE THERE ARE MANY OTHERS WITH THE SAME EXACT PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/26/2008",
        "dateOfIncident": "08/18/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243518,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA.  THE CONTACT RECEIVED A WARRANTY LETTER FROM THE MANUFACTURER, WHICH STATED THAT THEY WOULD EXTEND THE WARRANTY FOR THE WINDOW REGULATORS FOR CONSUMERS IN THE \"HOT\" STATES.  SHE CALLED THE DEALER AND WAS INFORMED THAT THE WARRANTY EXPIRED.  THE DEALER FURTHER STATED THAT PENNSYLVANIA WAS NOT A HOT WEATHER STATE.  THE CONTACT NOTICED THAT HER WINDOW REGULATORS FRACTURED AND CAUSED THE WINDOWS TO FAIL.  THE MANUFACTURER STATED THAT THEY WOULD ONLY ASSUME RESPONSIBILITY FOR TWO OF THE REGULATORS.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 50,000 AND CURRENT MILEAGE WAS 68,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2008",
        "dateOfIncident": "08/18/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239120,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE MANY OTHERS, MY 2001 NISSAN ALTIMA WITH ONLY 57,000 MILES ON IT DISPLAYED A CHECK ENGINE SOON LIGHT.  THIS OCCURRED WHILE MY WIFE WAS IDLING AT A TRAFFIC LIGHT.  IT IS NOT A FAILURE BUT IF NOT CORRECTED COULD CRACK THE ENGINE BLOCK. THE ERROR CODE CROSSED TO A MISFIRE IN CYLINDER #4.  I HAVE FOUND AN INORDINATE NUMBER OF FOLKS WITH THE SAME PROBLEM WITH THEIR 2000 NISSAN ALTIMA.  OUR WARRANTY HAS EXPIRED AND I WAS QUOTED $920 TO FIX THIS PROBLEM WHICH APPEARS TO BE THE RESULT OF POOR ENGINEERING DESIGN OR MEDIOCRE MATERIALS USED FOR THE GASKET.  I WOULD LIKE TO REFERENCE FOUR DIFFERENT COMPLAINTS REGARDING THIS SAME ISSUE:  10167168  10145161  10100639  10163901  THIS INFORMATION WAS MINED FROM WWW.CARCOMPLAINTS.COM.    WHAT EXACTLY IS THE MINIMUM CRITERIA USED TO DETERMINE A RECALL OR SOMETHING TO THAT EFFECT?  IS THERE ANY AGENCY THAT CAN COMPEL NISSAN TO MAKE SOMETHING SO OBVIOUS AND PREVALENT AMONG THEIR CUSTOMERS RIGHT AGAIN? *TR",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/26/2008",
        "dateOfIncident": "04/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225771,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR  - 2001 ALTIMA - HAD A ROUGH IDLE AT ALL STOPS.  IT FELT AS IF THE CAR WAS GOING TO STALL.  AN INDEPENDENT MECHANIC FELT A 60,000 MILE TUNE-UP AT A COST OF $600.00 WOULD SOLVE THE PROBLEM. HE EVEN CHECKED NISSAN RECALLS TO AID WITH THE DIAGNOSIS. NONE WERE FOUND THAT APPLIED.  THE PROBLEM PERSISTED AFTER THE TUNE-UP.  THE CAR WAS TAKEN TO NISSAN WHERE IT TOOK THE MECHANIC LESS THAN ONE MINUTE TO DIAGNOSE THE PROBLEM.  HE REPORTED THAT THIS WAS A COMMON PROBLEM WITH THE  MODEL AND YEAR OF THE CAR.  THEY WOULD NEED TO REPLACE  THE INTAKE MANIFOLD GASKET AT A TOTAL COST OF $825.32.  A SUBSEQUENT SEARCH OF THE INTERNET FOUND THAT THIS WAS INDEED A COMMON PROBLEM WITH NISSAN NOT TAKING ANY RESPONSIBILITY FOR THE PROBLEM.  *TR",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/13/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220991,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 NISSAN-ALTIMA INTAKE MANIFOLD GASKET HAS FAILED AT 56,800 MILES. REPAIRS ARE EST. AT $850.00.  DEALER RECOMMENDED TO CHANGE SPARK PLUGS AND WIRE.  *TR",
        "vin": "1N4DL01A51C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/29/2008",
        "dateOfIncident": "02/18/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219717,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE VIBRATES A LOT DURING TRAFFIC LIGHT STOPS. FOUND FROM A MECHANIC THAT IT IS A CYLINDER 4 MISFIRE CAUSED DUE TO GASKET LEAK. WILL COST MORE THAN $600 TO GET IT FIXED. AFTER DOING SOME RESEARCH FOUND THAT THIS IS A MANUFACTURING DEFECT THAT IS AFFECTING MANY NISSAN VEHICLES AND COULD PROVE FATAL IF THE VEHICLE STOPS ON A HIGHWAY. I BELIEVE NISSAN HAS TO TAKE RESPONSIBILITY AND RECALL THESE.  *TR",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "02/20/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218791,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AS SEEN ON THE INTERNET AT LEAST 50 TIMES.  INTAKE MANIFOLD GASKET BLOWN ON #4 CYLINDER, NISSAN REFUSES TO DO A RECALL.  I'LL NEVER BUY ANOTHER .  *TR",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/14/2008",
        "dateOfIncident": "01/18/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218023,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA.  THE CONTACT RECEIVED A NISSAN RECALL NOTICE FOR THE SIDE/REAR WINDOW.  SHE TOOK HER VEHICLE TO AN AUTHORIZED DEALER, BUT THEY COULD NOT HONOR THE RECALL.  THE DEALER STATED THAT THE RECALL WORK COULD BE PERFORMED; HOWEVER, THE CONTACT WOULD BE RESPONSIBLE FOR THE COST BECAUSE THE RECALL EXPIRED IN JUNE OF 2007.  THE CONTACT FEELS THAT SHE SHOULD NOT BE RESPONSIBLE BECAUSE SHE JUST RECEIVED THE NOTICE IN JANUARY OF 2008.  THE RECALL NUMBER WAS UNKNOWN.  THE FAILURE MILEAGE WAS 50,000 AND CURRENT MILEAGE WAS 53,000.",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/22/2007",
        "dateOfIncident": "12/21/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212551,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 NISSAN PATHFINDER WAS PURCHASED 3 YEARS AGO.  A BOSE 6-CD PLAYER CAME INSTALLED IN THE VEHICLE.  THE 6-CD PLAYER STOPPED WORKING, AND DISPLAYS AN ERROR MESSAGE, \"ERR 2\".   MY VEHICLE IS NO LONGER UNDER WARRANTY.  THIS PROBLEM WAS ADDRESSED WITH THE NISSAN DEALER (SERVICE DEPARTMENT) IN BUENA PARK CALIFORNIA ON DECEMBER 21, AT 6:40PM.  I WAS INFORMED THAT I COULD PURCHASE A NEW CD PLAYER, HOWEVER THIS WOULD BE QUITE COSTLY.  THE NISSAN DEALER FURTHER STATED, WHEN A CUSTOMER WHOSE VEHICLE IS UNDER WARRANTY HAS THIS SAME PROBLEM, THEY DO NOT REPAIR THE PROBLEM.  THE CD PLAYER IS REPLACED WITH ANOTHER. NO REPAIR SHOP WILL LOOK AT MY SYSTEM.  APPARENTLY, THIS PROBLEM IS COMMON WITH NISSANS.  OTHER THAN PURCHASING  A NEW CD PLAYER, THERE HAS TO BE SOME TYPE OF CONSUMER REPAIR SHOP.  NISSAN SEEMS UNCONCERNED WITH THIS TYPE OF PROBLEM.  *TR",
        "vin": "JN8DR07X21W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/11/2007",
        "dateOfIncident": "10/15/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211427,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TWO PERSISTENT PROBLEMS WITH MY 2001 ALTIMA.  ISSUE #1:  THE CAR RANDOMLY STALLS AT LOW SPEEDS (0-10MPH) WITH NO CHECK ENGINE LIGHT.  THIS PROBLEM BEGAN IN OCTOBER 2006.  THIS PROBLEM RESULTS IN A LOSS OF POWER STEERING AND POWER BRAKES WHICH HAS CAUSED MANY NEAR ACCIDENTS.  THERE IS NO PATTERN OR SYMPTOM TO FORECAST WHEN STALLING WILL OCCUR.  THE CAR HAS BEEN IN THE SHOP (DEALERSHIP AND OTHERS) NUMEROUS TIMES WITH MECHANICS NEVER ABLE TO \"DUPLICATE\" THE PROBLEM.  AFTER SPENDING HUNDREDS OF DOLLARS ON A NEW BATTERY, LEAD WIRES, NEW SPARK PLUGS AND SPARK PLUG WIRES, MY NISSAN MECHANIC SAID THAT HE DIDN'T KNOW WHAT ELSE TO DO EXCEPT \"THROW PARTS AT IT UNTIL SOMETHING STICKS.\"      ISSUE #2:  THE CAR IDLES ROUGHLY AND SHAKES UNLESS IN NEUTRAL.  THE SHOP SAID THE PROBLEM IS THE INTAKE MANIFOLD GASKET WHICH IS A $600 REPAIR.  A SEARCH ON THE INTERNET PROVIDES AN ABUNDANCE OF COMPLAINTS ABOUT THIS PROBLEM.  THIS SHOULD BE A RECALL ISSUE.  *TR",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2007",
        "dateOfIncident": "10/19/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210351,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS, SHUTTERS, AND RPM'S BOUNCE WHILE STOPPED AT TRAFFIC SIGNS.  HAVE TO TURN A/C ON WHICH HELPS FOR 30 SECS., THEN RPM'S BOUNCE ERRATICALLY AGAIN.  HAVE TO THEN KEEP FOOT ON BRAKE AND GIVE GAS TO KEEP RPM'S UP OR PUT IN PARK,NEUTRAL AND GIVE GAS TO KEEP RPM'S STEADY.  IF YOU DON'T, CAR DIES.  SAFETY HAZARD IN TRAFFIC AND WHILE STOPPED,BECAUSE CAR DIES.  MANY COMPLAINTS FOR THIS YEAR/MODEL WITH SAME PROBLEM ON CARCOMPLAINTS.COM.  *TR",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/20/2007",
        "dateOfIncident": "08/17/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206382,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1) BETWEEN 8/07 & 10/07 THREE  WINDOW REGULATORS HAVE BROKEN  2) WINDOW REGULATORS BROKE & WINDOWS UNABLE TO MOVE UP OR DOWN  3) CAR WAS TAKEN TO AUTO BODY SHOP FOR REPAIR, REPAIRS WERE COMPLETED & MONEY PAID TO AUTO BODY SHOPS.  *TR",
        "vin": "1N4DL01D61C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/20/2007",
        "dateOfIncident": "08/16/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203532,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "FIREHAWK GTX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 NISSAN ALTIMA.  THE VEHICLE HAS FIRESTONE FIREHAWK GTX-02, SIZE P205/55R16 TIRES.  THE CONTACT STATED THAT THE SIDEWALLS WERE CRACKED AND SEPARATING FROM THE TIRES AND THE BELTS WERE ALSO BECOMING LOOSE.  HE FURTHER STATED THAT THE TIRES WERE VIBRATING, MAKING NOISE, AND AIR KEPT LEAKING OUT OF THEM.  ALL FOUR TIRES HAD TO BE REPLACED.  FIRESTONE STATED THAT THEY SHOULD HAVE REPLACED THE TIRES, NOT HIM.    THE CURRENT MILEAGE WAS 38,620 AND FAILURE MILEAGE WAS 37,000. UPDATED 01-14-08.  *KB  UPDATED 12/12/07. *JB",
        "vin": "1N4DL01D21C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/26/2007",
        "dateOfIncident": "03/13/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188963,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHAKING WHILE AT IDLE (STOPPED). PROBABLY CAUSE INTAKE MANIFOLD GASKET AS FACED BY MANY OTHER NISSAN OWNERS. SOME COMPLAINTS REPORTED HEATING OF CAR LEADING TO FIRE. I HAVE NOT FACED FIRE YET BUT WILL NOT TAKE THE CAR TO FAR AS WELL.     SINCE MANY PEOPLE FACED THIS, IT MUST BE A NISSAN DESIGN ISSUE AND SHOULD BE RECALLED. THIS IS A EXPENSIVE FIX AND SO MANY PEOPLE HAVE PAID FROM THEIR POCKETS FOR A DEFECT WHICH NISSAN HAS INTRODUCED. *JB",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/09/2007",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182121,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD GASKET FAILURE AT AROUND 80000 MILES CAUSING ROUGH ENGINE IDLING, ENGINE STALLING, AND AN EXPENSIVE REPAIR.  FOUND 9 SIMILAR COMPLAINTS ON THE WEB.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2007",
        "dateOfIncident": "01/18/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179124,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 NISSAN PATHFINDER 3.5L 4WD SE MODEL STARTED MISFIRING AT 89,000 MILES, WHICH THE JEFF WYLER NISSAN DEALERSHIP IN OHIO ADVISED ON REPLACING AN IGNITION COIL.  CAR RAN OK FOR 2 WEEKS, THEN THE CHECK ENGINE LIGHT CAME ON, AND THIS TIME IT WAS A VALVE TIMING SENSOR.  REPLACED THAT AND 2 WEEKS LATER MORE MISFIRING, AND THE SAME DEALER SAYS IT'S ANOTHER IGNITION COIL.  A LITTLE RESEARCH SHOWS THERE ARE OVER 2500 PEOPLE WITH THE SAME ENGINE TYPE EXPERIENCING THE SAME ISSUES (MAXIMAS), AND OTHER CAR MANUFACTURERS NOT HAVING THIS ISSUE.  THIS IS AN OBVIOUS DEFECT AND NEEDS SERIOUS SCRUTINY OR LEGAL ACTION.",
        "vin": "JN8DR07Y01W"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/04/2007",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177755,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER 2006, MY CHECK ENGINE LIGHT ILLUMINATED (NISSAN ALTIMA 2001) AND I BROUGHT IT TO MY MECHANIC FOR SERVICE. IT WAS DETERMINED THAT THERE WAS A MISFIRE CONDITION IN ONE OF THE ENGINE CYLINDERS. CONSEQUENTLY, THE HEAD GASKET AND VARIOUS ASSOCIATED COMPONENTS WERE REPLACED. HOWEVER, A DAY AFTER GETTING THIS FIXED THE CHECK ENGINE LIGHT CAME BACK ON. IT APPEARS THAT THE REAL PROBLEM WAS WITH THE INTAKE MANIFOLD GASKET, WHICH IS AN EXPENSIVE AND LABOR INTENSIVE JOB. AFTER SEARCHING THE WEB, I HAVE FOUND THAT THIS APPEARS TO BE A COMMON PROBLEM ASSOCIATED WITH NISSAN ALTIMAS MADE AROUND 2001. FOR EXAMPLE, SEE THE FOLLOWING WEBSITE: HTTP://WWW.CARCOMPLAINTS.COM/NISSAN/ALTIMA/2000/ENGINE/INTAKE_MANIFOLD_GASKET_LEAK_CAR_SHAKES.SHTML COMMON TO NEARLY ALL CASES (EVEN THOSE BROUGHT TO NISSAN DEALERS) IS IT TYPICALLY TAKES MULTIPLE ATTEMPTS TO REALIZE THAT THE TRUE PROBLEM IS A FAULTY INTAKE GASKET. BEFORE GETTING IT FIXED THE ENGINE WAS BEGINNING TO GET SHAKY, ESPECIALLY AT IDLE SPEED.  *JB",
        "vin": "1N4DL01D91C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/25/2006",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171825,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN DAYS, THREE OF THE FOUR POWER WINDOW CONTROLLERS HAVE FAILED--LEAVING WIDOWS ROLLED DOWN AND UNABLE TO ROLL UP.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/03/2006",
        "dateOfIncident": "07/05/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164367,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE POWER SEAT WILL MOVE UPRIGHT BUT IT WILL NOT RECLINE BACK.  EVERY ONCE IN A WHILE IT WILL RECLINE BACKWARD WHICH MAKES ME BELIEVE THERE IS A SHORT IN IT.  NISSAN SAYS MY EXTENDED WARRANTY DOES NOT COVER THE POWER SEAT MECHANISM AND THEY ESTIMATED THAT IT WOULD COST $2,000 TO REPAIR.   *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/22/2006",
        "dateOfIncident": "06/09/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10160451,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAGS ON MY 2001 NISSAN ALTIMA DID NOT DEPLOY IN A HEAD ON COLLISION.  *JB",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/22/2006",
        "dateOfIncident": "06/16/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160469,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS IDLED ROUGHLY. OFTEN DROPPING TO BELOW 500 RPM AND SHAKING THE ENTIRE CAR. CAR HAD A LACK OF RESPONSIVENESS AND POWER. NISSAN DEALER CORRECTLY DIAGNOSED THE PROBLEM JUST BY HEARING ME TELL THEM WHAT WAS HAPPENING WITH THE CAR TELLING ME THAT THEY HAD SEEN A LOT OF CARS WITH MY PROBLEM. TOOK THE CAR TO TRUSTED MECHANIC AND GOT SAME DIAGNOSIS. HE SAID HE HAD SEEN A LOT OF 2001 ALTIMAS WITH THAT PROBLEM (BLOWN IN EXACTLY THE SAME LOCATION OF THE GASKET). PROBLEM WAS A BLOWN INTAKE MANIFOLD GASKET, REPAIR COST APPROACHED $600.   A QUICK SEARCH ON GOOGLE.COM YIELDS SEVERAL FORUMS TALKING ABOUT INTAKE GASKET PROBLEMS WITH 2001 ALTIMAS. THE PROBLEM IS SO WIDESPREAD THAT IT IS MENTION IN THE AUTOS SECTION OF THE MSN SITE.    HTTP://AUTOS.MSN.COM/RESEARCH/VIP/RELIABILITY.ASPX?YEAR=2001&MAKE=NISSAN&MODEL=ALTIMA#ENGI  HTTP://WWW.FAMILYCAR.COM/BOARDS/VIEWTOPIC.PHP?P=344&SID=CC46EF56B5E213FB8DC33FE86106BA57.  *NM   UPDATED 07/16/2012 *JS",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2006",
        "dateOfIncident": "10/31/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158642,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST SPEED FROM 40 TO 80 MPH. GAUGES SUDDENLY SHUT DOWN ON THE DASHBOARD. THE ENGINE STILL RUNS. I AM ABLE TO SHIFT INTO NEUTRAL , BACK INTO DRIVE AFTER COASTING. THE ACTS LIKE IT WANTS TO TURN OFF. ON OCT 31, 2005 THE SPEED SENSOR UNIT WAS REPLACED. CAR RAN GREAT UNTIL WARM WEATHER. NOW IT IS SHUTTING DOWN AGAIN, AGAIN, AND AGAIN ON WARM DAYS. DEALERSHIP CAN NOT FIND ANYTHING WRONG WITH THE CAR, BUT IT HAS ACTED THIS WAY ON THEM ALSO.  *NM",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2006",
        "dateOfIncident": "05/11/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157940,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS TO BE SHIFTED FROM PARK ALL THE WAY DOWN THE SHIFTER AND BACK UP TO START SOMETIMES.  I'VE OWNED THIS CAR SINCE APRIL 24, 2001.  DEALER WOULDN'T DO ANYTHING SINCE \"CHECK ENGINE LIGHT\" WASN'T ON.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "02/17/2006",
        "dateOfIncident": "02/14/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10150524,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING AT ABOUT 15-20 MILES AN HOUR IN MY 2001 NISSAN ALTIMA GXE LE.  A TRUCK CUT ME OFF AND I WAS FORCED TO SLAM ON MY BRAKES.  IN TURN MY CAR SLAMMED INTO THE TRUCK IN FRONT OF ME.  MY SEAT BELT DID NOT LOCK AND MY AIRBAG DID NOT DEPLOY.  MY BRAKES LOCKED UP AND MY HEAD BOUNCED OF MY STEERING WHEEL.  I WOULD LIKE TO KNOW WHY MY SEAT BELT DID NOT LOCK AND WHY MY AIRBAG DID NOT DEPLOY.  MY CAR HAS BEEN TOTALED OUT BY MY INSURANCE COMPANY AS A TOTAL LOSS.  AS FAR AS CORRECTIVE ACTION NONE WAS TAKEN AS THE CAR IS DESTROYED.  *JB",
        "vin": "1N4DL01D41C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2006",
        "dateOfIncident": "12/12/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147286,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE GAUGES SUDDENLY STOP WORKING, THE RADIO STILL WORKS BUT ALL THE GAUGES IN THE INSTRUMENT PANEL GO TO ZERO.  ONE TIME THE ENGINE APPEARED TO STOP BUT TURNED BACK ON.  THIS HAS HAPPENED ON FIVE OCCASIONS.  I TOOK IT TO THE DEALER (REGAL NISSAN) BUT THERE WERE NO ERROR CODES SO THEY COULD NOT FIND A PROBLEM.  THEY DID A TUNE UP (REPLACED THE SPARK PLUGS, PLUG WIRES, DISTRIBUTOR AND CAP) BUT THE GAUGES HAVE SHUT OFF TWICE SINCE THE TURN UP.  THE DEALER SAID THAT UNLESS THERE IS AN ERROR CODE, THEY COULD NOT HELP ME.  THE GAUGES SHUT DOWN FOR FIVE MINUTES OR SO, USUALLY THE CAR STILL RUNS.  AFTER TURNING THE CAR OFF AND ON AGAIN, THE GAUGES WORK.    *NM",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/27/2005",
        "dateOfIncident": "10/24/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10141096,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING EASTBOUND ON A THREE LANE LOCAL ROAD AT THE SPEED OF 35 MPH WITH THE RIGHT OF WAY OF A SOLID GREEN LIGHT, A MAN FAILED TO YIELD MAKING LEFT TURN AND ENDED UP COLLIDING WITH ME AND DEFLECTING MY VEHICLE TOWARDS A WALL ON THE ROADSIDE. AT IMPACT MY 2001 NISSAN ALTIMA GXE LIMITED EDITION DEPLOYED BOTH DRIVER AND PASSENGER AIRBAGS. MY SAFETY BELT WAS FASTENED AT THE TIME OF THE COLLISION AND THE SEAT BELT FAILED TO LOCK MY BODY IN PLACE WHICH LED TO MY HEAD BEING PUSHED  INTO THE WINDSHIELD, WHICH LEFT ME TO BLACKOUT AND GLASS STUCK IN VARIOUS PARTS OF MY HEAD. THIS LEFT SCARS ON MY FACE AND SEVERE WHIPLASH ON MY NECK. NOTHING HAS BEEN DONE TO CORRECT THIS DEFECT, THE FRONT END OF MY VEHICLE HAS BEEN TOTALED. THIS WAS AT 35 MPH ONLY AND I HAVE TWO SWOLLEN KNEES, MY WHOLE BACK AND NECK DAMAGED, BOTH WRISTS HAVE BEEN INJURED AND OTHER PARTS OF MY BODY. NOT INCLUDING MY MENTAL HEALTH, CONSTANT ANXIETY AND STRESS. EVEN THE POLICE OFFICERS AND OTHER PEOPLE SAY THAT INJURIES WOULDN'T HAVE BEEN AS BAD IF THE SEAT BELT LOCKED (THE SEATBELT FAILED TO LOCK). *JB",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "03/12/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132522,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST MANIFOLD. I HAD TO CALL NISSAN HQ BACK BOTH TIMES JUST TO GET AND ANSWER THAT YES IT IS COVERED AND NO THEY CAN'T FIX IT.    I AM COMPLETELY OVER NISSANS FAULTY WORKMANSHIP.  I TOOK MY X IN TO HAVE THE 60K MAINT DONE AND THEY HAD THE NERVE TO TELL ME ABOUT MY BRAKES, BUT DIDN'T TELL ME ANYTHING ABOUT THE CRACKED MANIFOLD. THEY EVEN TOLD ME THAT THEY SAW IT BUT DIDN'T THINK IT WAS ANYTHING TO BE CONCERNED ABOUT.    IF IT WASN'T FROM THE DEALER CHARGING ME FOR OVERFILLING MY TRANS FLUID AND NOT TIGHTENING A TRANS HOSE FITTING, I WOULD HAD DROVE THE THING UNTIL THE NEXT TIME TO CHANGE THE OIL AND NOT KNOW ANYTHING ABOUT THE CRACK IN THE MANIFOLD OR RAN THE TRANSMISSION DRY.  NOW THEY ARE TELLING ME THAT IT IS MY FAULT FOR NOT KEEPING AN EYE ON IT.  I ASKED THE LADY AT HQ'S, IF I HAD TAKEN MY X IN WITH 60K MILES ON IT AND THEY HAD FOUND THE CRACK WOULD IT BE COVERED UNDER THE WARRANTY? SHE TOLD ME NO  THEN WENT ON TO TELL ME THAT I WOULD HAVE TO BRING IT IN ON 59999K AND IT WOULD HAD BEEN.   I HAD TAKEN IT IN PRIOR TO THE 60K TO WHICH THE DEALER DID NOTHING OR NOTED NOTHING. THEN AFTER FINDING THE TRANS FLUID LEAK I TOOK IT BACK IN WHICH WAS ABOUT 3 DAYS LATER. WHEN I TOOK IT BACK IN IT WAS OVER THE 60K.    NOW AFTER THE DEALER QUOTED  ME 4 DIFFERENT PRICES RANGING FROM 300-1500 DOLLARS ON REPAIRING THE EXACT SAME THING (EXHAUST MANIFOLD).   I AM PAYING MORE FOR GAS DUE TO THE LOW MILEAGE FROM THE CRACKED/FAULTY MANIFOLD. I CONSTANTLY SMELL EXHAUST DURING TRAVELING(STOPS). AT TIMES IT IS TO THE POINT THAT I MUST KEEP THE WINDOWS OPEN.    *NM",
        "vin": "5N1ED28T11C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "07/15/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125375,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: WHEN APPROACHING AN INTERSECTION  CONSUMER APPLIED THE BRAKES AND THEY LOCKED UP CAUSING  CONSUMER'S VEHICLE TO SLIDE INTO THE VEHICLE IN FRONT OF HER.  *AK   *NM",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2005",
        "dateOfIncident": "01/05/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121722,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: WHEN DRIVING AND COMING TO A STOP, THE VEHICLE DIES. THE CAR HAS BEEN TO THE DEALER, AND THE DEALER CAN'T FIND THE CAUSE OF THE PROBLEM. O2 SENSOR, CATALYTIC CONVERTER (2), AND  FUEL PUMP WERE REPLACED, BUT THE CAR STILL DOES THE SAME THING. THE MANUFACTURE IS SUPPOSE TO CALL THE CONSUMER ON MONDAY. THE CAR STALLS OUT EVERYDAY, AND IT'S ALWAYS GOING SLOW WHEN IT HAPPENS.*AK",
        "vin": "1N4AL11D42C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/16/2005",
        "dateOfIncident": "12/21/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114157,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST SPEED FROM 65 MPH TO 20 MPH , AND ALL THE GAUGES ON THE DASHBOARD SHUT DOWN, BUT THE ENGINE WAS STILL RUNNING. VEHICLE THEN WENT TO 0 AFTER ABOUT 20 SECS. ALL GAUGES WENT DEAD. BATTERY LIGHT BRAKE LIGHT AND AIRBAG LIGHT COME ON. INTERMITTENTLY PRIOR TO THIS OTHER ELECTRICAL ACCESSORIES WOULD BEGIN TO MALFUNCTION HEAT/AIR BLOWERS, WIPERS, LIGHTS DIMMING, ETC. ALTERNATOR CHECKS GOOD, BATTERY REPLACED. RUNS FOR A COUPLE DAYS THEN DOES IT AGAIN. MALFUCTION IS NOT LIMITED TO HIGH SPEED TO LOW. HAS HAPPENED AT VARYING SPEEDS.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "12/30/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109005,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE  LOST SPEED FROM 70 MPH TO 20 MPH ,AND ALL THE GAUGES ON THE DASHBOARD SHUT DOWN, BUT THE ENGINE WAS STILL RUNNING. VEHICLE WAS DRIVEN TO THE DEALER, WHO WAS UNABLE TO LOCATE THE CAUSE OF THE PROBLEM.*AK  THE CONSUMER STATED THAT THE VEHICLE BEGAN RUNNING ON TWO OF THE FOUR CYLINDERS.  *TC",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/10/2005",
        "dateOfIncident": "01/09/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106043,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY USED 2001 NISSAN ALTIMA ON 12/07/2004, ON 01/09/2005 WHILE DRIVING I WENT TO LET MY WINDOW DOWN ON THE DRIVERS SIDE AND IT WOULD NOT GO DOWN. MY WIFE ALSO, HAS A 1999 NISSAN ALTIMA THAT THE WINDOW ON THE DRIVERS SIDE STOP WORKING AND WE HAVE A FRIEND WITH AN ALTIMA AND HER WINDOWS STOP WORKING TOO. I NOTICE THERE ARE SEVERAL COMPLAINTS ABOUT THE SAME PROBLEM AND THE DEALERSHIPS ARE AWARE OF THE PROBLEM BUT THERE IS NO RECALL.  I DO NOT UNDERSTAND THIS.  ALL I KNOW IS I HAD MY CAR FOR 1 MONTH AND MY WINDOW DOES NOT WORK NOW.  HOW CRAZY IS THAT? *AK",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/10/2005",
        "dateOfIncident": "01/09/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107116,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER WINDOW WOULD NOT OPERATE. UNABLE TO OPEN OR CLOSE THE DRIVER'S  SIDE WINDOW. DEALER WAS NOTIFIED. THE DEALER INFORMED THE CONSUMER THAT PART WAS NOT COVERED UNDER A RECALL. *AK........*AK",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/04/2005",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105718,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN USING THE AIR CONDITIIONING UNIT IN THE 2001 NISSAN ALTIMA, THERE IS A BUZZING OR WHIRRING NOISE DURING OPERATION. VEHICLE NOISE IS ANNOYING. I FEEL THE VALUE OF THE VEHICLE IS GREATLY DIMINISHED AS A RESULT OF THE NOISE AND WILL MAKE IT DIFFICULT TO SELL THE VEHICLE AS A RESULT OF THE IMPROPERLY FUNCTIONING A/C. UNDER WARRANTY, I HAVE TAKEN THE VEHICLE BACK NUMEROUS TIMES. THE FIRST TIME, THE DEALER REPLACED A CLUTCH BEARING, THIS DID NOT FIX THE PROBLEM. THE NEXT TIME, THE DEALER REPLACED THE CONDENSING UNIT AND EXPANSION VALVE TO ATTEMPT TO REPAIR THE NOISE. THE NEXT COUPLE OF TIMES THE VEHICLE WAS TAKEN TO THE DEALER AND WAS TOLD THAT A REQUEST OF NISSAN USA WAS MADE TO SEND A FACTORY TECH OUT TO FIND A SOLUTION. NISSAN REFUSES TO SEND ANYONE OUT TO LOOK AT THE VEHICLE. NISSAN WANTED THE DEALER TO FIND A SIMILAR VEHICLE TO COMPARE THE NOISE, THEY HAVE NOT BEEN ABLE TO FIND A COMPARABLE VEHICLE TO DO THAT CHECK. IT HAS BEEN ALMOST A YEAR SINCE MY ORIGINAL COMPLAINT AND THIS HAS NOT BEEN REMEDIED. I AM FED UP WITH NISSAN NOT TAKING CARE OF MY SITUATION.*AK",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "11/19/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102899,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOW WOULD ONLY GO UP AND DOWN SPORODICALLY. WINDOW REGULATORS HAVE FAILED. I DO NOT HAVE USE OF TWO OF THE FOUR WINDOWS. I BOUGHT THE CAR TO THE DEALERSHIP AND THEY HAVE ACKNOWLEDGE A PROBLEM WITH THE WINDOW REGULTORS. ACCORDING TO NISSAN THERE IS AN ACTIVE CAMPAIGN (NOT A RECALL) ON THIS VECHICLE FOR THIS PROBLEM. HOW CAN A COMPANY ACKNOWLEDGE A DEFECT, NOT INFORM IT'S CUSTOMERS, NOT REPAIR THE PROBLEM, AND  RISK LIABILITY FROM THIS PROBLEM? I AM VERY CONCERNED WITH THIS PROBLEM AS I HAVE TWO SMALL CHILDREN WHO MUST BE DRIVEN IN THIS CAR. *AK",
        "vin": "1N4DL01D41C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/09/2004",
        "dateOfIncident": "08/14/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10096903,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STRUCK A GUARD RAIL HEAD ON AT 65 MPH AND THE AIR BAG DID NOT DEPLOY,  THE MANUFACTURER HAS NOT EXAMINED THE VEHICLE, HOWEVER A REQUEST HAS BEEN MADE. *JB  THE CONSUMER WANTED TO BE COMPENSATED BECAUSE THE AIRBAGS DID NOT DEPLOY.  THE VEHICLE WAS CONSIDERED TOTALED.  *TC",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2004",
        "dateOfIncident": "10/05/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098159,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD REPEATED ISSUES WITH THE ELECTRICAL WINDOWS, VIDEO CASSETTE PLAYER, RADIO CONTROLS ON THE STEEING WHEEL, VEHICLE DIFFICULT TO GET OUT OF PARK, A RATTLING IN THE FRONT WHEEL AREA.    A MONTH AGO, THE ELECTRON FUSE BLEW IN THE VEHICLE CAUSING THE VEHICLE NOT TO START, WHEN THE FUSE IS REPLACED IT BLOWS AGAIN. WE WERE TOLD THE MAIN WIRING HARNESS HAS GONE BAD - THIS VEHICLE ONLY HAS 34,000 MILES ON IT!  WE WERE TOLD THERE WAS NOTHING WE COULD HAVE DONE TO PREVENT IT FROM GOING BAD - \"IT JUST WENT BAD\".    THE VEHICLE HAS BEEN INOPERABLE SINCE OCTOBER 5, 2004 - WE HAVE BEEN WAITING FOR A NEW WIRING HARNESS, NISSAN SENT THE WRONG PART TO THE DEALERSHIP TWICE.  THE CORRECT PART WE ARE TOLD IS ON BACKORDER INDEFINATELY - NISSAN HAS NO IDEA WHEN THE PART WILL BECOME AVAILABLE.  A SUPERVISOR FROM NISSAN HAS FAILED TO RETURN MY PHONE CALLS AND THEY WILL NOT COVER THE REPAIR UNDER WARRANTY BECAUSE THE VEHICLE IS 38 MONTHS OLD (EVEN THOUGH IT ONLY HAS 34,000 MILES ON IT).  HOW CAN A VEHICLE THAT IS ONLY 3 YEARS OLD HAVE A PART, THAT THE VEHICLE WILL NOT RUN WITHOUT, BE ON BACKORDER INDEFINATELY? AND, HOW CAN A MAJOR WIRING PART GO BAD SO SOON AND NISSAN NOT BE LIABLE FOR IT?  *AK",
        "vin": "4N2ZN16T41D"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/30/2004",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098045,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN DIESEL",
                "productModel": "CLA83",
                "productYear": "1988",
                "type": "Equipment"
            }
        ],
        "summary": "FLAPPING NOISE COMING FROM ENGINE. WARNING LIGHTS CAME ON AND VEHICLE LOSS POWER.  BELTS CAME APART GOING APPROXIMATED 65 MPH. TOWED INTO DEALERSHIP.  FOUND BELTS MISSING FROM PULLEYS.  DEALERSHIP INSTALLED DRIVE BELTS AND PERFORMS SEVERAL  RECALL SERVICES RELATED TO  03V455000 & 03V4777000.  ENGINE LIGHT STAYS ON.  BATTERY DISCHARGES OVERNIGHT SEVERAL TIMES.  ERRATIC IDLE/STALLS OVER TIME.  AUGUST 2004 CAR STALLS ON FREEWAY DRIVING 65 MPH.  CAR TOWED TO REPAIR SHOP THAT REPORTS LOSS OF SPARK ON CYL 2, BUT FAILS TO FIND PROBLEM.  TOWED TO DEALERSHIP WHO FINDS ECM FAILURE. REQUIRES 800.00 TO FIX.   *JB",
        "vin": "3N1CB51D51L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/28/2004",
        "dateOfIncident": "10/27/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097956,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "(1)HEAVY RAINS DURING THE LAST WEEK IN OCT0BER 2204.  (2)STRUCTURAL FAILURE OF TRUNK LID CAUSING WATER TO LEAK INTO TRUCK DURING HEAVY RAIN.  (3)SECOND OCCURRENCE.  REPAIR SERVICE SCHEDULE FOR NOVEMBER 1, 2004.  ORIGINAL FAILURE AND LEAK REPAIR OCCURRED FEBRUARY.2003 (REPLACED WEATHER STRIPPING).  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2004",
        "dateOfIncident": "08/02/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087302,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CONSUMER TURNED ON THE ENGINE THE BATTERY EXPLODED.   THE CONSUMER SAW SMOKE COMING FROM UNDER THE HOOD.  THE ENTIRE ENGINE COMPARTMENT WAS SPLASHED WITH BATTERY ACID.   *AK   THERE WAS NO EVIDENCE THAT THERE WAS A PROBLEM.  THE CONSUMER SIMPLY TURNED THE KEY AND THE BATTERY EXPLODED.   *SC  *JB",
        "vin": "1N4DL01A31C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/12/2004",
        "dateOfIncident": "05/18/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086690,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A RATTLING NOISE IS APPARENT FROM THE REAR OF THE VEHICLE, ESPECIALLY WHEN GOING OVER BUMPS.  MY MECHANIC INDICATED THE READ STABILIZER BAR HAS A TSB THAT AN IMPROPER SEALER OR BRUSHING WAS USED WHEN THE CAR WAS MADE, HOWEVER I NOW HAVE 57,000 MILES ON THE CAR THAT IS 3.5 YEARS OLD, I.E. OUT OF WARRANTY THEREFORE I AM RESPONSIBLE FOR A MANUFACTURE DEFECT.",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2004",
        "dateOfIncident": "08/01/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081323,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NISSAN ALTIMA WITH 17,000 MILES ON IT WITH WARRANTY LEFT ON THE CAR.  ABOUT 8 OR 9 MONTHS  OF OWNING IT, WHILE DRIVING IT WOULD JUST LOSE POWER DOWN TO ABOUT 10 MILE PER HOUR. THE INSTRUMENT PANEL WOULD GO DEAD,,NO SPEEDOMETER, GAUGES, NOTHING. I TOOK IT THE DEALER, THEY COULD NOT FIND ANYTHING WRONG WITH IT, THEY JUST REPLACED A TIMING CHAIN TENSIONER UNDER WARRANTY.  I FINALLY FIGURED OUT THAT BY PLACING THE GEAR SHIFT IN NEUTRAL IT WOULD RESUME BACK TO  NORMAL SPEED, BUT THE INSTRUMENT PANEL WOULD NOT COME BACK ON.  THE PANEL WOULD COME ON SOMETIMES IN 10 MILE MOSTLY 30 TO 40 MILES DOWN THE ROAD.  THE SAME PROBLEM WOULD OCCUR DURING MY DRIVE MANY TIMES, I WOULD JUST PLACE THE SHIFTER IN NEUTRAL AND THAN BACK TO DRIVE AND I WOULD BACK TO NORMAL SPEED AGAIN.  ALSO, THIS PROBLEM WOULD NOT HAPPEN IF SPEED IS HELD OVER 70 MILES PER HOUR.  THE AFFECTED SPEED IS BETWEEN  35 TO 70 MPH.  I NOW HAVE OVER 81,000 MILES ON THE ALTIMA. *JB",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2004",
        "dateOfIncident": "05/06/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072242,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH VEHICLE STALLED.  CHECK ENGINE LIGHT APPEARED ON THE DASHBOARD AND REMAINED ON.  RESTARTED THE VEHICLE  AND DROVE IT TO THE DEALER FOR INSPECTION, AND MECHANIC REPLACED SPARK PLUGS AND OTHER PARTS.*AK  PLEASE FILL IN ADDITIONAL INFORMATION.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/01/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061199,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT HIGHWAY SPEEDS, THE VEHICLE STALLED. THE ACCELERATOR PEDAL WENT ALL THE WAY TO THE FLOOR AND THE VEHICLE LOST POWER. CONSUMER  PULLED OVER TO THE SIDE OF THE ROAD. *AK  *JB",
        "vin": "1N4DL01D21C"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/24/2004",
        "dateOfIncident": "09/17/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063819,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNIROYAL TIRE CO.",
                "productMake": "UNIROYAL",
                "productModel": "TIGER PAW RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON 9/17/03 I HAD FOUR P205/60R15 UNIROYAL TOUR TR TIRES PLACED ON MY 2001 NISSAN ALTIMA. WITHIN ONE WEEK TWO WERE REPLACED BECAUSE OF VIBRATION. @ TWO WEEKS AGO I HAD THE TIRES ROTATED. THE REAR TIRES WERE PLACED ON THE FRONT. IMMEDIATELY VIBRATION AND PULLING TO THE RIGHT WAS NOTICED. AGAIN TWO NEW TIRES WERE PLACED ON THE VEHICLE. AGAIN THE PULL TO THE RIGHT. THE FRONT TIRES WERE MOVED TO OPPOSITE SIDES AND THE PULL WAS TO THE LEFT. A NEW TIRE WAS PLACED ON THE VEHICLE AND IT STILLS PULL TO THE LEFT. THE CAR IS IN ALIGNMENT. I WOULD THINK THERE IS A DEFECT IN THESE TIRES. I HAVE NOTIFIED UNIROYAL OF THE SAME BY EMAIL.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": "12/08/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050547,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE STOPPED IN HEAVY TRAFFIC WITH  THE ENGINE STILL RUNNING AND WITHOUT ANY WARNING, THE VEHICLE SUDDENLY ACCELERATED. CONSUMER ENGAGED FROM DRIVE TO NEUTRAL.  *AK  *JB",
        "vin": "1N4DL01A01C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069833,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 NISSAN ALTIMA GXE/LE CAR HAS A PROBLEM WITH ITS SUSPENSION. IT MAKES A CRUNCHING/RATTLING NOISE. MY CAR HAS BEEN TO 2 NISSAN DEALERS A TOTAL OF 9 TIMES. IN ALL IT HAS BEEN OUT OF SERVICE FOR 17 DAYS. THEY HAVE REPLACED MANY SUSPENSION PARTS. BUT THE PROBLEM STILL REMAINS. I HAVE CONTACTED THE MANUFACTURER SEVERAL TIMES WITH MY COMPLAINTS VIA PHONE AND LETTERS. I HAVE ALSO DEMANDED A REFUND UNDER THE CALIFORNIA LEMON LAW. BUT NISSAN OF NORTH AMERICA HAS REFUSED.  ON MARCH 2002, I FILED A COMPLAINT WITH THE BBB AUTO LINE PROGRAM. ONCE THE BBB AUTO LINE REVIEWED MY COMPLAINT THEY CONTACTED NISSAN. WE HAD A NISSAN DTS PERSON INSPECT MY CAR. I TEST DROVE WITH HIM AND HE VERIFIED MY EXISTING SUSPENSION PROBLEM. I AGREED TO GIVE THEM ONE MORE CHANCE TO FIX MY CAR ON APRIL 12, 2002. THE DTS PERSON ORDERED BOTH FRONT STRUTS AND SPRINGS REPLACED AGAIN. AS OF SEPTEMBER 2002 THE SAME SUSPENSION PROBLEM HAS RE-OCCURRED.  ON OCTOBER 2002, I FINALLY DECIDED TO CONTACT A LAWYER EXPERIENCED IN THE LEMON LAW CASES.  HE WROTE THE FIRST DEMAND LETTER TO NISSAN. THE LETTER MENTIONED ALL MY PROBLEMS AND DEMANDED A LEMON LAW BUY BACK BECAUSE OF THE SUSPENSION DEFECT. ON DECEMBER 2002 MY ATTORNEY?S OFFICE HAD TO SEND NISSAN ANOTHER LETTER, BECAUSE THEY HAD FAILED TO RESPOND TO THE FIST ONE. WELL JUST RECENTLY ON JANUARY 2003 NISSAN FINALLY DECIDED TO RESPOND TO THE LETTERS AND AFTER NUMEROUS PHONE CALLS THAT WERE MADE TO THEIR OFFICE.  NISSAN SAID THAT BASED ON THE NUMBER OF REPAIR ATTEMPTS, ALONG WITH THE TYPE OF REPAIR THAT WAS PERFORMED TO RESOLVE THE COMPLAINT, WE DO NOT FEEL THAT THERE HAVE BEEN ANY SUBSTANTIAL REPAIRS PERFORMED ON THE VEHICLE FOR THE SAME NON-CONFORMITY.  NISSAN WENT ON TO SAY THAT THEY ARE NOT REQUIRED TO REPURCHASE YOUR CLIENT'S VEHICLE, THEREFORE DEMANDS FOR REPURCHASE AND RESTITUTION OF ASSOCIATED FEES, IS DENIED. THEY AGAIN OFFERED TO HAVE A DTS(DEALER TECHNICAL SPECIALIST) COME OUT AND INSPECT MY VEHICLE. FOR THE ALLEGED SUSPENSION COMPLAINT.",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2003",
        "dateOfIncident": "02/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047268,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2001 I PURCHASED A NISSAN ALTIMA.  IT LEFT ME STRANDED ON NUMEROUS OCCASIONS.  I COULD BE RUNNING ERRANDS AND RIGHT IN THE MIDDLE OF MY ERRANDS THE VEHICLE WOULDN'T START.  I WOULD CALL A TOW TRUCK AND ONCE IT MADE IT TO THE NISSAN DEALER IT WOULD START RIGHT UP (I THOUGHT IT WAS AN ELECTRICAL PROBLEM).  I CONTACTED NISSAN IN DECEMBER OF 2001 REGARDING THIS PROBLEM AND THEY \"COULD NOT DUPLICATE\"  IT AND WOULDN'T DO ANYTHING TO HELP ME OUT.  I LEFT IT AT MY DEALER FOR WEEKS ON 2 SEPARATE OCCASIONS.  SINCE NISSAN WOULD DO NOTHING TO HELP ME OUT AND I LIVE IN MINNESOTA WHERE BEING STRANDED IN COLD WEATHER COULD KILL YOU, I HAD TO TRADE IT OFF.  THEN THE OTHER DAY I SAY AN ARTICLE THAT THEY HAD RECALLED ALL THESE VEHICLES FOR THE SAME PROBLEM THAT I HAD.  SO I CONTACTED THEM AGAIN AND THEY TOLD ME MY VEHICLE WAS NOT INCLUDED IN THE RECALL.  I HAVE NO IDEA HOW THEY DESIGNATE WHAT GETS RECALLED AND WHAT DOESN'T, BUT IT HAS THE SAME PROBLEM AS THE OTHER 2.56 MILLION VEHICLES.    *LA",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/04/2003",
        "dateOfIncident": "10/19/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045461,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 NISSAN ALTIMA, WITH APPROX 89000 MILES, HAS STARTED EXPERIENCING ENGINE FAILURE AT CRUISING SPEEDS (50-70 MPH) ON THE FREEWAY. IT IS INTERMITTENT WITH NO APPARENT WARNING. FIRST, ALL GUAGES, INCLUDING GAS, TEMPERATURE, RPM AND ODOMETER, FALL TO ZERO. THE CAR JERKS AS IF DOWNSHIFTED, AND SLOWS DRASTICALLY, AND THE GAS PEDAL DOES NOT ACCELERATE THE CAR. IT HAS HAPPENED 7-8 TIMES IN THE PAST FEW WEEKS.  THE RADIO DISPLAY LIGHT ALSO BLANKS OUT, NOT SURE IF THIS IS RELATED OR A SEPARATE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/24/2003",
        "dateOfIncident": "10/23/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043531,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 NISSAN ALTIMA, BOUGHT BRAND NEW WITH 35,300 MILES ON IT. NATURALLY THE WARRANTY IS ABOUT TO EXPIRE AND I AM CONCERNED BECAUSE THE REAR BUSHINGS AND STABILIZER BARS HAVE HAD TO BE REPLACED TWICE ALREADY. IS THIS A SAFETY CONCERN? IS THIS A COMMON PROBLEM? IS THERE A RECALL? WHAT ARE MY RIGHTS ONCE MY WARRANTY EXPIRES?  *LA",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2003",
        "dateOfIncident": "09/25/2003",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041003,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTED SMOKING WHILE ON THE PARKWAY,I PULLED OVER ONTO THE GRASS ,BY THAT TIME FLAMES WERE COMING OUT UNDER THE HOOD BY THE FRONT WINDSHIELD, IN 20 MINUTES BEFORE FIRE DEPT ARRIVED THE ENTIRE CAR WAS IN FLAMES ,BY THE TIME FIRE WAS PUT OUT THERE WAS NOTHING LEFT . CAR WAS TOWED AND CAUSE OF FIRE IS UNDER INVESTIGATION BY MY INSURANCE COMPANY, HAD THERE BEEN ANYONE IN THE CAR WITH ME I DOUGHT THEY WOULD HAVE SURVIVED ,THATS HOW QUICK AND INTENSE THE FIRE WAS",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": "08/12/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033773,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMOBILE ACCELERATED WHILE THE CONSUMER'S  FOOT WAS ON THE BRAKE.  THE CONSUMER TOOK THE VEHICLE TO THE DEALER/MECHANIC THREE TIMES AND BECAUSE THE VEHICLE DID NOT DUPLICATE THE PROBLEM, THE MECHANIC WAS UNABLE TO FIND OUT WHAT WAS HAPPENING WITH THE AUTOMOBILE. THE THIRD TIME HE JUST LEFT THE VEHICLE WITH MECHANIC/DEALER SO THAT THEY MAY DRIVE THE AUTOMOBILE TO SEE IF THE PROBLEM RESURFACED.   *AK   THE VEHICLE WAS SHIFTED INTO DRIVE BUT WENT INTO REVERSE.   *SCC     *JB",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2003",
        "dateOfIncident": "06/27/2003",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037144,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED OVERNIGHT IN GARAGE. WHEN KEY WAS TURNED IN THE IGNITION, EXPLOSION OCCURRED UNDER THE HOOD. SMOKE WAS COMING OUT FROM UNDER THE HOOD AND ACID WAS DRIPPING TO THE PAVEMENT. THERE IS A DENT ON THE HOOD FROM THE INSIDE DIRECTLY ABOVE THE BATTERY LOCATION. THERE WAS ALSO ACID ON THE ENGINE AND LOCAL AREAS. *AK",
        "vin": "1N4DL01A51C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/02/2003",
        "dateOfIncident": "08/28/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037066,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM ONE OF MANY WHO HAVE HAD THE OIL DIPSTICK BREAK OFF IN THEIR 2001 NISSAN SENTRA.  I WAS ABLE TO REMOVE MINE USING SUPER GLUE AND A DOWEL ROD SAVING ME HUNDREDS OF DOLLARS.  HOWEVER, ANYONE IS NOT AWARE OF THIS WILL HAVE TO DO WHAT NISSAN SUGGESTS AND THAT IS TO REQUIRE PEOPLE TO USE THEIR SERVICES FOR A DEFECTIVE PART OF NISSSAN'S DESIGN.  I HAVE BEEN EXPOSED TO OTHER PLASTIC FAILURES WHERE UNDER HIGH TEMPERATURE AND PRESSURE (AN O-RING ON THE GROOVE IN THE PLASTIC) CAUSES PLASTIC TO BECOME BRITTLE.*AK",
        "vin": "3N1CB51D11L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/22/2003",
        "dateOfIncident": "08/22/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033322,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 NISSAN ALTIMA. AT APROX 34,000 MILES (CAR NOW HAS 42000) THE INSTRUMENT CLUSTER WOULD FAIL, THE OVERDIRVE LIGHT WOULD START FLAHING THEN OVERDRIVE WOULD DISENGAGE. THE INSTRUMENT CLUSTER AND OVERDRIVE WOULD COME BACK ON THEN MINUTES LATER THE ENGINE WOULD START LURCHING CAUSING THE CAR TO SLOW TO 30 MPH AND EVENTUALLY STOP. THE ENGINE WOULD STILL RUN BUT REVVING IS CHOPPY AND LAGGED. AFTER A FEW MINUTES OR SHUTTING THE ENGINE DOWN AND RESTSTARTING THE ENGINE THE CAR WOULD RETURN TO NORMAL, BUT AFTER A PERIOD OF 10 MINUTES WOULD REPEAT INCIDENT. HAVE TAKEN TO A DEALER ON 4 OCCASIONS, BUT MECHANICS CANNOT DUPLICATE FAILURE. ONLY ONE CODE HAS COME BACK FROM THE DIAGNOSTIC P0500 (SPEED SENSOR FAILURE) AND THE SERVICE ENGINE LIGHT HAS ONLY COME ON ONCE. THIS ISSUE HAS BEEN RE-OCCURRING SINCE APRIL OF 2003 AND NO REPAIRS HAVE BEEN ATTEMPTED DUE TO THE FACT THAT MECHANICS CANNOT FIND NOR DUPLICATE PROBLEM. I HAVE RECORDED 15 OR MORE FAILURES SINCE APRIL AND 9 IN THE PAST 4 DAYS.*AK",
        "vin": "1N4DL01D91C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/18/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033063,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING FROM 10 MONTHS TO THE PRESENT, WHICH IS 14 MONTHS AFTER PURCHASE, BOTH FRONT AND ONE REAR WINDOW REGULATOR ASSEMBLIES HAVE FAILED. THE FIRST TWO ONLY WEEKS APART. I NOW , OF COURSE ASSUME THAT THE FINAL WINDOW COMPONNENT WILL FAIL AS WELL.REPLACEMENT OF THE FOUR REGULATOR ASSEMBLIES WILL COST ME $900. *AK",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2003",
        "dateOfIncident": "08/08/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032835,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BATTERY EXPLODED WHEN KEY TURNED TO \"ON\" POSITION.  CAR WAS IN GARAGE.  IT WAS INITIAL CRANKING OF ENGINE THAT DAY.  A LOUD \"BOOM\" WAS HEARD.  UPON INVESTIGATION DISCOVERED TOP OF BATTERY IN THREE PIECES AND A SPLIT IN CASE NEXT TO NEG TERMINAL.  ACID ON UNDERSIDE OF HOOD AND SURROUNDING AREA OF BATTERY.  POOL OF ACID COLLECTED ON  GARAGE FLOOR.*AK",
        "vin": "1N4DL01A71C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/05/2003",
        "dateOfIncident": "07/17/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032127,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHEN VEHICLE IS PUT IN PARK  ENGINE RACES AND JERKS FORWARD INTREMITTENTLY WHILE FOOT IS ON THE BRAKES.*AK",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": "07/30/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030399,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 NISSAN ALTIMA, PUCHASED WITH APPROXIMATELY 23,000 MILES, A DOCUMNET WAS OBTAINED FROM THE DEALER STATING THAT THE VEHICLE HAD NOT BEEN INVOLVED IN AN ACCIDENT.  THE PROBLEM IS THE CAR WAS VERY QUIET WHEN I TEST DROVE IT AND FOR A FEW WEEKS AFTER THE PURCHASE.  THE CAR NOW HAS MORE RATTLES AND SQUEAKS THAN I CAN DESCRIBE.  I DID TAKE THE CAR IN FOR A SQUEAK ON THE RIGHT SIDE A BUSHING WAS REPLACED ON THE RIGHT DOOR PANEL, THE SQUESKING STOPPED BUT NOW HAS RESTARTED, THE MECHANIC TOLD ME THIS WAS  NORMAL WEAR AND TEAR BECAUSE THESE PARTS ARE MADE OUT OF PLASTIC.  THE CAR HAS ALSO STARTED PULLING TO THE RIGHT, A NEW SET OF TIRES HAS BEEN INSTALLED AND IT HAS BEEN REALIGNED TWICE, THE PROBLEM STILL EXISTS AND IS WEARING MY TIRES OUT.  A NON MECHANICAL COMPLAINT IS THE PAINT JOB, IT APPEARS TO BE VERY THIN AND CHIPS AND FLAKES EASILY AND IS FADING, THE CAR IS WHITE.",
        "vin": "1N4DL01D21C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "05/10/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019615,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS PEDAL BECAME STUCK IN FULL THROTTLE POSITION.      *JB    PH  *JB",
        "vin": "1N4DL01D41C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/21/2003",
        "dateOfIncident": "05/21/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019049,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 NISSAN ALTIMA. DURING THE PAST YEAR, BOTH WINDOW UNITS CONTROLLING THE UP AND DOWN OF THE FRONT WINDOWS HAVE FAILED. MY DEALER INFORMS ME THAT THIS IS A VERY COMMON PROBLEM IN NISSAN ALTIMA, BUT THERE HAS BEEN NO FACTORY RECALL NOTICE SENT TO OWNERS.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2003",
        "dateOfIncident": "05/12/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019680,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER DOORS AND LOCKS WORKED INTERMITTENTLY.         *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/23/2003",
        "dateOfIncident": "04/22/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016433,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "6 TIMES CAR HAS BEEN IN FOR WARPED FRONT BRAKE ROTORS AND PROBLEM STILL NOT RESOLVED.      *JB",
        "vin": "1N4DL01D71C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/03/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009691,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN AN ACCIDENT, AND THE AIR BAGS FAILED TO DEPLOY.*JB",
        "vin": "PLEASE FILL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/14/2003",
        "dateOfIncident": "02/12/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005841,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK LID NOT SEALING, CAUSING WATER TO LEAK INTO TRUCK AND COLLECT IN SPARE TIRE WELL",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": "10/16/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001054,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE DRIVER/PASSENGER SIDE WINDOW STUCK IN THE DOWN POSITION AT DIFFERENT TIMES.  CONSUMER TOOK VEHICLE TO THE DEALERSHIP, AND THEY REPLACED THE CABLE.  CONSUMER FEELS THAT THIS IS UNSAFE BECAUSE IF VEHICLE IS IN AN ACCIDENT THE DRIVER CAN BE TRAPPED.  PLEASE PROVIDE MORE DETAILS. TS",
        "vin": "1N4D001V61C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001062,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING A TURN, STEERING WHEEL MAKES A LOUD NOISE.  CONSUMER HAD VEHICLE SERVICE BY THE DEALERSHIP, AND THEY REPLACE THE STEERING PUMP, BUT THE NOISE STILL EXIST.  PLEASE PROVIDE MORE DETAILS. TS",
        "vin": "1N4D001V61C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": "06/17/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001066,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SWAY BAR BUSHING FELL OFF THE VEHICLE  WHILE DRIVING.  THE DEALERSHIP REPLACED THE BUSHING.  PLEASE PROVIDE MORE DETAILS. TS",
        "vin": "1N4D001V61C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/03/2002",
        "dateOfIncident": "12/02/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023642,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED THE VEHICLE WOULD SWAY IN THE REAR AND MAKE NOISE.  THE DEALER INSPECTED THE VEHICLE AND FOUND THE REAR SWAY BAR WAS DISJOINTED.TS SCC *JB",
        "vin": "1N4DL01D71C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/25/2002",
        "dateOfIncident": "11/23/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770098,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORGINAL OWNER OF THE VEHICLE.  IN THE 2YRS I HAVE OWNED THIS CAR I HAVE BROUGHT 6 NEW TIRES. THERE IS A PROBLEM WITH THE WEAR. ON 11/23 I HAD A TIRE BLOWOUT. THERE WAS A 9 INCH RIP BETWEEN THE TREAD AND SIDEWALL ON EACH SIDE OF THE TIRE. MY MAJOR PROBLEM IS THE WEAR OF THE TIRE WITH THE 01 ALTIMA THE TIRE PRESSURE IS 32.  I HAVE NO IDEA IF THAT CONTRIBUTES TO THE PROBLEMS WITH THE TIRES.  DT",
        "vin": "1N4DL01A21C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2002",
        "dateOfIncident": "10/03/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021944,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STARTING THE ENGINE THERE WAS A VERY LOUD BOOM, CONSUMER STATED SMOKE CAME FROM UNDER HOOD, BATTERY HAD EXPLODED, DENTED THE HOOD OF VEHICLE AND BATTERY ACID WAS INSIDE AND OUTSIDE OF VEHICLE.  CAUSE IS UNKNOWN.  TOOK TO MECHANIC AND THEY REPLACED BATTERY. PLEASE PROVIDE ANY FURTHER INFORMATION.        TS",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/27/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768954,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PATTERN OF FAILURES FOR ALL NISSAN VEHICLES 1998 THRU 2001 (DID NOT SEARCH NHTSA DATABASE FOR ANYTHING EARLIER).  THIS FAILURE INVOLVES THE CAR SUDDENLY ACCELERATING \u0016 USUALLY WHEN THE DRIVER IS EITHER SLOWING DOWN OR BRAKING.  IN OUR CASE, WE COULD NOT STOP THE VEHICLE AND HAD TO SHUT OFF THE ENGINE TO STOP OUR FORWARD MOTION.  THE DATABASE SUMMARIES SHOW THE DEALER RESPONSE IS ALWAYS THE SAME - WE CAN'T REPLICATE, THEREFORE WE CAN'T FIX.  ADDITIONALLY, OUR DEALER CONTACTED NISSAN AND WAS TOLD THEY KNEW NOTHING ABOUT THIS PROBLEM \u0016 WHICH SEEMS VERY UNLIKELY SINCE THE REPORTS IN YOUR DATABASE SHOW THAT THE VEHICLE OWNERS HAVE REPEATED TOLD NISSAN OF THE PROBLEM.  PLEASE BEGIN AN INVESTIGATION INTO THIS PROBLEM AS SOON AS POSSIBLE AND FORCE NISSAN TO ACKNOWLEDGE THE PROBLEM, DETERMINE ITS CAUSE AND RECALL THE VEHICLES.  THIS PROBLEM IS ENDEMIC ACROSS ALL NISSAN MODELS (CARS, TRUCKS, SUVS, VANS) AND ACROSS A NUMBER OF MODEL YEARS (1998-2001).  THIS PROBLEM COULD AFFECT MILLIONS OF CARS.  ODI ID NUMBERS SOME OF THE RELATED PROBLEMS: 746324, 875795, 898284, 8001581, 741992, 854025, 566322, 56065, 758859, 8003876, 893370, 896545, 890278, 725165, 716994, 717202, 851041, 855272, 856147, 878223, 724641, 738694, 8019220, 857221, 863072, 885430, 531657, 558376, 737832, 842113, 553051, 725198, 836694, 855561, 829460, 853157, 785598, 533896.  THANK YOU.  DT",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/25/2002",
        "dateOfIncident": "07/01/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768906,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "METALLIC RATTLEING SOUND FROM SUSPENSION WHEN CROSSING OVER BUMPS OR LANE DIVIDER DOTS. SIMILIAR TO ODI #746528 & #759328.  DT",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/22/2002",
        "dateOfIncident": "09/29/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768735,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN RELATION TO THE NHTSA CAMPAIGN ID# 81V136000 THE RUST WILL CAUSE PROBLEMS IN THE NEAR FUTURE.  I PURCHASED THE VEHICLE ON 09/28/02.  ALL COMPONENTS ON THE UNDERBODY HAS RUSTED.  DT",
        "vin": "1N4DL01D71C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/22/2002",
        "dateOfIncident": "09/24/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567918,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION, THE ENGINE WILL SUDDENLY SHUT DOWN.  THIS HAS HAPPENED QUITE FREQUENTLY.  THE SERVICE MEN COULD NOT DUPLICATE.  THE VEHICLE SHUT DOWN AGAIN AND BOTH STEERING AND BRAKING CONTROL WERE LOST.  THE VEHICLE WAS TAKEN BACK TO THE SERVICE TEAM.  THEY TEST DROVE THE VEHICLE AGAIN AND THIS TIME CONFIRMED THAT THE ENGINE DOES SHUT DOWN.  THEY ARE STILL UNABLE TO GET TO THE CAUSE OF THE PROBLEM. *JG",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/02/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767995,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE SHUTDOWN WHILE DRIVING.  NISSAN SAID IT WAS THE ECM AND REPLACED THE PART.  UNFORTUNATELY, THE CAR CONTINUES TO SHUTDOWN AND HAS BEEN RETURNED TO THE DEALER FOR FURTHER DIAGNOSTIC TESTING.      TS",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/29/2002",
        "dateOfIncident": "09/24/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767884,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SHUTDOWN WHILE CAR IS IN MOTION RESULTS IN LOSS OF STEERING AND BRAKING CONTROL.  CAR DROVE ONTO CURVE.  DEALER DIAGNOSTIC CAN DETECT NO ERROR CODES.   THE DEALER INSISTS THAT IT IS THE ECM WITH NO APPARENT PROOF.   MR",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/08/2002",
        "dateOfIncident": "06/22/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013395,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS LOSING OIL BUT SHOWS NO SIGN OF LEAKAGE. PRESENTLY, IT IS UNKNOWN WHERE OIL IS FLOWING TO DUE TO OIL GAUGE READING BELOW THE FULL MARK. WHILE IDLING IN PARK VEHICLE CUTS OFF, WHEN RESTARTED IT MADE A RATTLING NOISE AND CUT OFF AGAIN.   VEHICLE HAD 3 OIL CHANGES SINCE DECEMBER 2001.  SERVICE TECHNICIAN SAID THAT PISTON RINGS WERE PUT ON TOO TIGHTLY. CONSUMER WAS ASKED TO DRIVE VEHICLE FOR 500 MILES TO SEE IF THE PROBLEM WOULD CORRECT BY ITSELF.*AK  CONSUMER ALSO STATED VEHICLE BURNS FUEL QUICKLY.*JB",
        "vin": "1N4AL11D52C"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "04/24/2002",
        "dateOfIncident": "04/22/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761152,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT DID NOT LOCK IN CRASH.  ALSO, AIRBAG DID NOT DEPLOY.  SPEED WAS BELOW 35, BUT OTHER VEHICLE'S SPEED WAS ALSO BELOW 35 AND IT'S AIRBAGS DID DEPLOY.  OTHER VEHICLE WAS 95 NISSAN MAXIMA.  CALL OR EMAIL WITH ANY QUESTIONS.  THANKS.  *AK",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/20/2002",
        "dateOfIncident": "12/19/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005978,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS  VEHICLE STALLED WHILE DRIVING, DEALER WAS NOTIFIED. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "1N4DL01D41C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/13/2002",
        "dateOfIncident": "10/10/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759328,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS A DEFECT WITH ITS SUSPENSION BOTH FRONT AND REAR. I HAVE TAKEN MY CAR FOR SERVICE TO 2 DIFFERENT DEALERS FOR REPAIRS. IT MAKES A LOUD CRUNCHING,RATTLING AND SQUEAKING NOISE FROM THE FRONT AND REAR SUSPENSION. WHILE DRIVING OVER THE SLIGHTEST BUMPS ON THE ROAD. INFACT IT HAS BEEN TO THE DEALER FOR REPAIRS 8 TIMES IN ALL IT TOTALS 14 DAYS OUT OF SERVICE. AS OF NOW THE PROBLEM STILL REMAINS AFTER THE DEALER HAS REPLACED NUMEROS PARTS. THEY ARE AWARE OF THE EXISTING PROBLEM BUT CANNOT FIX IT.*AK",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/11/2002",
        "dateOfIncident": "06/07/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759212,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SWAY BAR BUSHING HAS BEEN REPLACED \"FIXED\" 4 TIMES ALREADY AND IT IS CURRENTLY BROKEN AGAIN. IT HAPPENED WHILE ENTERING THE DEALERSHIP DRIVEWAY AT APPROXIMATELY 5 MPH. THIS WAS A BRAND NEW CAR AND IT SIMPLY HAS PUT ME OUT! THIS SHOULD NOT BE HAPPENING. I DRIVE MOSTLY ALL HIGHWAY MILES WITH NO BUMPS OR POT HOLES FOR THIS TO BE HAPPENING.  *AK",
        "vin": "1N4DL01D41C"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "02/20/2002",
        "dateOfIncident": "08/16/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 3,
        "numberOfInjuries": 2,
        "odiNumber": 8004301,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 TO 75MPH, VEHICLE STARTED DRIFTING TO THE LEFT, CONSUMER  CORRECTED, BUT VEHICLE KEPT PULLING TO THE RIGHT, VEHICLE THEN ROLLED OVER 1 1/2 TIMES, THE TIE ROD HAD SNAPPED, STRUT ASSEMBLY BROKE, AND CV JOINT SEPARATED, HOUSING BROKE FROM METAL, ROOF CAVED IN, TRUNK SMASHED INTO, AND PUSHED REAR SEAT INWARD KILLING 3 PASSENGERS, FIRE DEPARTMENT CUT 5 PASSENGERS OUT, 2 WERE INJURED, THE VEHICLES STRUCTURE KEPT BUCKLING AND COLLAPSING INWARD. *JG  *AK  *YH",
        "vin": "1N4DL01D21C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564402,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS THE SHIFT ASSEMBLY WOULD STICK IN THE PARK POSITION, MECHANIC REPLACED SHIFTER AND STATED THAT LIQUID OR JUICE CAUSED INTERLOCK RELEASE TO STICK, CONSUMER INVESTIGATED AND FOUND A FAULTY SOLENOID.   *TT",
        "vin": "1N4DL01A91C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564402,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS THE SHIFT ASSEMBLY WOULD STICK IN THE PARK POSITION, MECHANIC REPLACED SHIFTER AND STATED THAT LIQUID OR JUICE CAUSED INTERLOCK RELEASE TO STICK, CONSUMER INVESTIGATED AND FOUND A FAULTY SOLENOID.   *TT",
        "vin": "1N4DL01A91C"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002963,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT TWO SEAT BELTS ARE NOT RETRACTING AT ALL. ONCE THEY ARE PULLED OUT THEY WILL STAY OUT, AND NOT TIGHTEN UP. CONTACTED DEALER.*AK",
        "vin": "1N4DL01D71C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2002",
        "dateOfIncident": "07/20/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9005329,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 70MPH CAR GIVES A BIG JOLT AND WITH NO WARNING, TRANSMISSION DROPS FROM FOURTH GEAR, ENGINE REVS TO 6500 RPM (ENGINE IN RED LINE AT 6300), CAR PULLS SHARPLY TO RIGHT.  ANOTHER HEAVY JOLT, AND ENGINE REVS DROP TO NORMAL AND TRANSMISSION GOES BACK TO FOURTH GEAR.",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/15/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 8002245,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING APPROXIMATELY 30 MPH VEHICLE WAS INVOLVED IN A FULL FRONTAL CRASH WHEN IT BROADSIDED ANOTHER CAR CROSSING HIS LANE OF TRAFFIC, TRAVELING 15 TO 25 MPH.  BOTH FRONTAL AIR BAGS FAILED TO DEPLOY DURING THIS INCIDENT.   DRIVER RECEIVED HEAD/ NECK, AND BACK INJURIES; AND  PERSON IN  FRONT PASSENGER POSITION RECEIVED NECK AND HEAD INJURIES.   VEHICLE HAS NOT BEEN EXAMINED BY THE DEALERSHIP TO DETERMINE A CAUSE FOR THIS PROBLEM.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION / DOCUMENTATION.*AK",
        "vin": "1N4DL01D91C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/04/2002",
        "dateOfIncident": "01/03/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001581,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE OCCASIONS  VEHICLE WOULD SUDDENLY ACCELERATE AND DEACCELRATE  WHILE DRIVING BETWEEN 30-60 MPH. VEHICLE AT DEALER SHOP. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION CONCERNING THIS MATTER.*AK",
        "vin": "KMHDN45D11U"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "11/02/2001",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898673,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING 15MPH SUDDENLY  VEHICLE PULLED TO THE RIGHT.  CONSUMER WENT OFF THE ROAD TRYING TO VEER TO  LEFT, AND  VEHICLE KEPT PULLING TO THE RIGHT. VEHICLE STOPPED ON IMPACT BY HITTING A TREE.  FRONT RIGHT PASSENGER'S SIDE WAS DAMAGED.  OFFICER AT THE SCENE STATED  VEHICLE WASN'T TRAVELING TOO FAST ACCORDING HOW AIR BAG DEPLOYED.  CONSUMER  WAS WAITING FOR  INSURANCE ADJUSTER TO INSPECT VEHICLE.  *AK",
        "vin": "1N4DL01D81C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTOR MOUNT FAILED.  *YH",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SWAY BAR FAILED.  *YH",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS NOT SHIFTING GEARS AT RIGHT SPEED,  BEFORE SHIFTING ALSO HEAR LOUD CLUNCK COMING FROM TRANSMISSION WHEN GOING INTO REVERSE AND DRIVE.  *YH",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER MAKES NOISES AND BLOW OUT COOL AIR AND SOMETIMES GETS REALLY COLD.  *YH",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKS INSIDE THE TRUNK WHEN IT RAINS.  *YH",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/01/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKS INSIDE THE TRUNK WHEN IT RAINS.  *YH",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/26/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898284,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF  DRIVEWAY A LOUD NOISE OCCURRED FOLLOWED BY FUMES FROM UNDER THE HOOD. SECONDS LATER, VEHICLE SUDDENLY ACCELERATED TO 80 MPH AND HIT A BRICK WALL, CAUSE UNKNOWN.  PLEASE GIVE ANY FURTHER DETAILS.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2001",
        "dateOfIncident": "09/28/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753182,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE ENGINE SHUTDOWN AT ANY TIME-NO WARNING.*AK",
        "vin": "1N4DL01D31C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/26/2001",
        "dateOfIncident": "09/17/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 896915,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CONSUMER WAS TRAVELING AT 35 MPH VEHICLE RAN INTO A COMMERCIAL TRUCK HEAD-ON. UPON IMPACT,  AIR BAGS DID NOT DEPLOY. CONTACTED DEALER.*AK",
        "vin": "N/A"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "07/18/2001",
        "dateOfIncident": "02/09/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 748692,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAST METAL RIGHT FRONT WHEEL ASSEMBLY FAILED WHILE IN MOTION, BROKE, WHEEL FELL OFF, AND CAUSED VEHICLE TO CRASH INTO BLOCK WALL.  *AK  THERE WERE INJURIES DUE TO THE ACCIDENT, THE CAST METAL TRANSVERSE LINK FAILED AS WELL AS WHEEL BOLTS, A WITNESS SAW THE VEHICLE WOBBLING OUT OF CONTROL DUE TO THE WHEEL FAILLING OFF BEFORE IT SLAMMED INTO THE BLOCK WALL.   *SLC",
        "vin": "1N40L01081C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/12/2001",
        "dateOfIncident": "06/18/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748331,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SWAY BAR BUSHING HAS FALLEN OUT TWICE. *AK",
        "vin": "1N4DL01D51C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/10/2001",
        "dateOfIncident": "07/04/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 892398,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  WAS TRAVELING ABOUT 30MPH ON  HIGHWAY ON A BRIDGE AND IT WAS RAINING.  HE APPLIED  BRAKES THREE TIMES, AND  BRAKING SYSTEM LOCKED UP BECAUSE THERE WAS ANOTHER VEHICLE IN FRONT OF HIM.   VEHICLE SLID AND HIT  VEHICLE IN FRONT. UPON IMPACT,  AIRBAGS DIDN'T COME OUT, BUT  AIRBAG LIGHT DID COME ON.   DEALERSHIP WAS  AWARE OF  PROBLEM.*AK  CONSUMER STATES THE THREE POINT RESTRAINT SYSTEM ALSO FAILED, 2 PEOPLE WERE INJURED IN ACCIDENT.  *SLC",
        "vin": "1N4DL01D21C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/25/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 891091,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING VEHICLE FOR TWO WEEKS CONSUMER NOTICED A LOUD NOISE COMING FROM LEFT REAR. CONSUMER HAD VEHICLE SERVICED AT DEALER. TECHNICIAN STATED SWAY BAR WAS LOOSE. PLEASE PROVIDE FURTHER INFORMATION. *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/24/2001",
        "dateOfIncident": "06/23/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747314,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEVELOPED BUBBLE IN SIDEWALL. *AK (TIRESIZE: 205/60R15)( DOT NUMBER:  TIRE SIZE: 205/60R15 )",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/21/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 561721,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL 01V065 AND WENT TO DEALER FOR REPAIRS, DEALER ONLY REPLACED THREE OF THE TIRES STATING THE OTHER TIRE WAS NOT INCLUDED DUE TO IT BEING MADE ON A DIFFERENT DAY, CONSUMER REPLACED THE OTHER TIRE AND IS REQUESTING REIMBURSEMENT.   *SLC",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/06/2001",
        "dateOfIncident": "06/04/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746528,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR OF VEHICLE STARTED MAKING A CRUNCHING/RATTLING NOISE OVER EVEN THE SLIGHTEST BUMP. DEALERSHIP DETERMINED IT TO BE NOISEY SWAYBAR LINK. THIS HAPPENED BECAUSE BUSHING PUSHED OUT APPARENTLY. THEY HAD TO INSTALL A WASHER ON SWAT BAR BUSHINGS RETAINER. NOT SURE IF THIS COULD HAVE BEEN A POTENTIAL SAFETY HAZARD WHERE I COULD OF LOST CONTROL OF VEHICLE. I FOUND THIS BAD BECAUSE CAR IS NEW AND ONLY 2 MONTHS OLD AND I DRIVE ALL HIGHWAY INTERSTATE MILES. NO SIDE/OFF ROADS WITH MAJOR BUMPS TO KNOCK THIS OUT. HOPEFULLY PROB WON'T HAPPEN AGAIN.IT IS A CONCERN SINCE VEH IS NEW AND THERE WAS NO EXTREMELY ROUGH DRIVING DONE WITH VEHICLE.",
        "vin": "1N4DL01DX1C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/04/2001",
        "dateOfIncident": "06/03/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 889642,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HEARD A BANGING NOISE IN REAR.  TOOK VHEICLE TO DEALER . DEALER CLAIMED SWAY BAR AND BUSHINGS HAD TO BE REMOUNTED.  *AK  *JB",
        "vin": "1N4DL01D61C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/03/2001",
        "dateOfIncident": "06/01/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746324,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS, IN STOP & GO TRAFFIC, WHILE STOPPED WITH MY FOOT ON BRAKE, THE ENGINE STARTED RACING, WHEN I TOOK THE CAR OUT OF GEAR, THE ENGINE RPMS \"TOOK OFF\"  I SHUT OFF THE ENGINE AND RESTARTED, EVERYTHING WAS FINE.  WHEN THIS FIRST HAPPEND, I TOOK THE CAR BACK TO THE DEALER BUT THEY COULD NOT FIND ANYTHING WRONG.  I THOUGHT IT WAS A FLUKE THE FIRST TIME BUT NOW I THINK THERE IS SOMETHING SERIOUSLY WRONG.  ON BOTH OCCASIONS, I WAS STOPPED WITH MY FOOT ON THE BRAKE, NOT ON THE ACCELERATOR, WHEN THE ENGINE STARTED RACING, THE ONLY WAY TO CONTROL IT WAS TO SHUT OFF THE ENGINE.  I AM TAKING THE CAR BACK TO THE DEALER, HOPEFULLY THEY CAN FIND THE PROBLEM.",
        "vin": "1N4DL01D01C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/28/2001",
        "dateOfIncident": "05/25/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746008,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTING VEHICLE INTO 5TH GEAR, GRINDING NOISE IS HEARD.  VEHICLE ONLY HAS 900 MILES.  DEALER INDICATED THAT TRANSMISSION NEEDED TO BE ADJUSTED.*AK",
        "vin": "1N4DL01AX1C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/10/2001",
        "dateOfIncident": "02/19/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 745144,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "NISSAN",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND AND I WERE INVOLVED IN AN ACCIDENT ON 2-19-01.  WE WERE TRAVELING EAST BOUND ON A CITY STREET WITH THE POSTED SPEED OF 40 MPH.  WE WERE TRAVELING ABOUT 38-40MPH.  A CAR TRAVELING WEST BOUND TURNED IN FRONT OF US, WE HIT THE CAR AND THE HIT A STOP LIGHT POLE.  WE CONTACTED NISSAN, AND THEY SENT US A LETTER STATING THAT WE DID NOT DECELERATE QUICK ENOUGH.  GOING 40MPH AND HITTING A CAR AND THEN A LIGHT POLE, HOW CAN THAT NOT BE A QUICK ENOUGH DECELERATION?  MY VEHICLE WAS TOTALED, AND ALL OF THE DAMAGE WAS IN THE FRONT OF THE VEHICLE, WITH THE LIGHT POLE RESTING IN THE CENTER OF THE HOOD.  EVERYONE AT THE SCENE OF THE ACCIDENT STATED THAT THE AIRBAGS SHOULD HAVE DEPLOYED.  THE POLICE, FIRE DEPT., AND AMBULANCE WOULDN'T EVEN ATTEMPT TO GET ME OUT OF THE VEHICLE UNTIL THE BATTERY WAS DISCONNECTED FOR FEAR THAT THE BAGS WOULD DEPLOY IN ATTEMPT TO GET ME OUT.  I WANT TO KNOW WHY THEY DIDN'T DEPLOY, AND I WANT SOMETHING DONE ABOUT IT.  I LOVE MY EXTERRA, BUT IF EVER THERE SHOULD BE ANOTHER ACCIDENT, I (OR SOMEONE ELSE) MAY NOT BE AS FORTUNATE TO SURVIVE THE CRASH.*AK",
        "vin": "5N1ED28Y31C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/27/2001",
        "dateOfIncident": "02/17/2001",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 881634,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  HAD A HEAD COLLISION AT APPROXIMATELY 30-35 MPH, AND AIR BAGS DID NOT DEPLOY.   TWO PERSON WERE INJURED , DRIVER AND  PASSENGER.  *AK   *SLC",
        "vin": "1N4DL01D11C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/30/2000",
        "dateOfIncident": "10/05/2000",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 875795,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "ALTIMA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WOULD ACCELERATE & GO INTO OVERDRIVE ON ITS OWN. WAS DRIVING 5MPH DOWN ALLEY WAY. PUT INTO NEUTRAL & ENGINE STARTED ROARING,  AND  RPMS WENT RACING HIGH. VEHICLE TOWED TO DEALER. *AK",
        "vin": "1N4DL01D21C"
    }
]