[
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/28/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBJECT: GROSS MECHANIC ERROR , POSSIBLE FIRE / EXPLOSIVE SITUATION    WHILE IN PALM BAY FL, I HAD MY FUEL FILTER CHANGED AT TIRE KINGDOM FOR ABOUT   $90. THEIR MECHANIC INSTALLED A FUEL FILTER THAT RATTLED / DEFECTIVE AND HE   DESTROYER THE FUEL LINE IT MOUNTED TO. THE TIRE KINGDOM MECHANIC, THREW OUT THE   PLASTIC FUEL FILTER BRACKET AND BRAKE LINE HOLDER BECAUSE IT WAS TOO RUSTY. I WAS   TOLD THIS A WEEK LATER BY THE MANAGER.  I LOST ABOUT TWO TANKS OF FUEL GETTING  TO ATLANTA, GA. I STOPPED FOR LUNCH AND NOTICED A 4 FOOT CIRCLE OF FUEL UNDER MY   BRAVADA. I LOOKED UNDER THE VEHICLE AND COULDN'T BELIEVE WHAT A HACK JOB TIRE   KINGDOM DID. MY VEHICLE COULD HAVE CAUGHT ON FIRE AND BLEW UP!! THERE SHOULD   BE FINES FOR SUCH A GROSS  INCOMPETENCE AND CAUSING A DANGEROUS CONDITION.  IF THE FUEL WOULD HAVE SPRAYED ON THE EXHAUST PIPE THE VEHICLE WOULD HAVE CAUGHT ON FIRE.    TO GET ME HOME A LOCAL GARAGE, IN ATLANTA GEORGIA,  FIXED IT TEMPORARILY SO I COULD   MAKE IT HOME, WITH TIE TRAPS, NEW FILTER, REPAIRED FUEL LINE AND O-RING. I AM   OUT ABOUT $446. I HAVE CONTACTED THE TBC CEO & SENIOR STAFF AT TCB CORP   AND EXEC'S AT TIRE KINGDOM, OVER THE LAST 7 WEEKS BY E-MAIL & MAIL AND CERTIFIED   MAIL. TIRE KINGDOM  MANAGER BY PHONE & MAIL. I DO HAVE THE DEFECTIVE PARTS,   PICTURES AND BILLS!  I WAS NOT GIVEN THE DISCARDED BRACKET ASSY..    I HAVE NOT BEEN ABLE TO DRIVE MY BRAVADA IN THE LAST 7 WEEKS FOR FEAR IT COULD   BLOW UP. I NEED TO HAVE MY BRAVADA PUT BACK TO IT'S ORIGINAL STATE WITH THE   PROPER FUEL FILTER AND BRAKE LINE BRACKET ASSY.    THIS IS A VERY SERIOUS PROBLEM BECAUSE MY VEHICLE WAS ABLE TO SPRAY / LEAK TWO   FULL TANKS OF GASOLINE ACROSS TWO STATES. YOU CANNOT JUST THROW AWAY PARTS   BECAUSE THE MECHANIC THINK THEY ARE TOO RUSTY. PLASTIC BRACKETS DO NOT RUST.   I WAS UNEXCEPTIONALLY AND INEXCUSABLE.  *TR",
        "vin": "1GHDT13W612"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2012",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446212,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE HIGHWAY AT THE POSTED 55MPH SPEED LIMIT WHEN ALL OF THE SUDDEN, THE VEHICLE COMPLETELY SHUT OFF.  THERE WAS NO POWER AS IF THE IGNITION FOR THE VEHICLE WAS COMPLETELY TURNED OFF.  WITH THERE BEING NO POWER TO THE VEHICLE, I COULD ONLY ALLOW THE MOMENTUM OF THE VEHICLE ROLL TO THE SHOULDER OF THE HIGHWAY AWAY FROM TRAFFIC.  I HAD NO USE OF TURN SIGNALS OR HAZARD SIGNALS.  ONCE I WAS ABLE TO GET OVER SAFELY, I LOOKED AT THE DASHBOARD AND COLD ONLY SEE THE BATTERY INDICATOR LIGHT ON, NO OTHER LIGHTS WERE ILLUMINATED.  I TURNED THE KEY TO THE OFF POSITION, REMOVED THE KEY FROM THE STEERING COLUMN, REINSERTED THE KEY AND TRIED TO RESTART THE VEHICLE.  AT FIRST, NONE OF THE DASH BOARD LIGHTS WOULD COME ON WHEN I TRIED TO RESTART THE VEHICLE, I HAD TO REPEATEDLY TURN THE KEY BACK AND FORTH AND THEN THE DASHBOARD LIGHTS ALL CAME ON, I WAS THEN ABLE TO RESTART THE VEHICLE AS NORMAL AND LET THE VEHICLE SIT FOR A MOMENT.  I WAS ABLE TO DRIVE THE VEHICLE TO A SAFE LOCATION OFF OF THE HIGHWAY AND BACK HOME.  THIS WAS A VERY SCARY MOMENT SIMPLY FOR THE FACT THIS OCCURRED WHILE I WAS DRIVING AT A VERY HIGH SPEED AND DURING TRAFFIC TIME.  I ALSO HAD MY CHILDREN IN THE VEHICLE.  I AM VERY CONCERNED AND WOULD LIKE TO GET A POSSIBLE SOLUTION.  *TR",
        "vin": "1GHDT13W612"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/05/2010",
        "dateOfIncident": "05/04/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10328948,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 OLDSMOBILE BRAVADA HAD A SPONTANEOUS BRAKE FAILURE.  THE LEFT REAR BRAKE LINE WAS FOUND TO BE EXTREMELY CORRODED.  THE BRAKE FLUID ESCAPED AND THE BRAKES FAILED WITHOUT WARNING.  FORTUNATELY, I HAD STOPPED AT A STORE ON MY WAY TO WORK,  UPON LEAVING, I STARTED THE ENGINE, PRESSED ON THE BRAKE TO SHIFT INTO REVERSE TO BACK OUT OF THE PARKING SPACE, AND THE PEDAL COLLAPSED TO THE FLOOR.  UPON EXAMINATION, THERE WAS BRAKE FLUID ALL OVER THE GROUND AND DRIPPING FROM THE SUSPENSION.   THE  TOWING CHARGE WAS $55.00 AND THE REPAIR TO REPLACE THE CORRODED BRAKE LINE WAS APPROXIMATELY $200.00  I HAVE IN MY POSSESSION THE SECTION OF CORRODED BRAKE LINE.  I HOPE THAT SOMEONE TAKES MY FRIGHTENING EXPERIENCE SERIOUSLY.  [XXX]   INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*TR",
        "vin": "1GHDT13W012"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/08/2008",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1. OLDSMOBILE BRAVADA WITH SMARTRAK AT 48,000 MILES AND GOOD CONDITION DEVELOPED DRIVETRAIN BINDING / LOCKING UP OVER SEVERAL MONTHS.  2. THE PROBLEM STARTED AS A MINOR BINDING WHEN BACKING OUT OR IN TIGHT FORWARD TURNS. NOW DRIVETRAIN ACTUALLY LOCKS UP IN TIGHT TURNING POSITION. HAVE TO PLAY WITH FORWARD/BACKWARD GEARS AND WHEEL DIRECTION TO ALLOW MOVEMENT. THIS HAS BECOME A SERIOUS SAFETY PROBLEM IF MERGING ONTO OR BACKING INTO A TRAFFIC LANE.  3. INITIAL SERVICE AT GM DEALER WAS TO FLUSH AND FILL TRANSFER CASE FLUID, $140.  INSTRUCTED TO DRIVE FOR A WHILE TO OBTAIN IMPROVEMENT. AFTER THREE WEEKS, CONDITION HAS GOTTEN WORSE. AM DEBATING NEXT STEP AND SERVICE PROVIDER. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "07/04/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238677,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 OLDSMOBILE BRAVADA.  WHEN THE CONTACT WOULD ACTIVATE THE HEADLIGHTS ON THE VEHICLE, THE DRIVER SIDE BRAKE LIGHT WOULD NOT WORK.  HE WOULD HEAR A CLICKING SOUND FROM THE INSTRUMENT PANEL AND HE CHANGED THE RELAY, BUT THE ISSUE WAS NOT REMEDIED.  THE DEALER HAS NOT BEEN NOTIFIED.  THE MANUFACTURER STATED THAT HIS VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 01V364000 (EXTERIOR LIGHTING:BRAKE LIGHTS:SWITCH).  THE CURRENT MILEAGE WAS APPROXIMATELY 97,000 AND FAILURE MILEAGE WAS APPROXIMATELY 96,000.",
        "vin": "1GHDT13W712"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2008",
        "dateOfIncident": "07/17/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235363,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMOBILE OVER HEATED BECAUSE THE THERMOSTAT IN THE ENGINE BLOC RUSTED THROUGH AND WATER BOILED OUT.  ACCORDING TO THE MECHANIC OR SUPERVISOR, RAYMOND ROPER, MANY COMPONENTS NEEDED TO BE REPLACED.  I HAD MY CAR MAINTAINED AT A GMC SERVICE AS LONG AS I HAD THE CAR.  ALTHOUGH I HAD NOT HAD IT SERVICED FOR TWO YEARS OR 17 THOUSAND MILES, I FIND IT DIFFICULT TO BELIEVE THAT THE COOLING SYSTEM WOULD SUFFER A COMPLETE RUST THROUGH.  EVERY COMPONENT IN THE COOLING SYSTEM NEEDED TO BE REPLACED.  IT COST $2000.00 TO REPAIR IT.  ALSO SEASIDE BUICK MAINTENANCE HAD ONLY CHANGED MY OIL EACH TIME I BROUGHT IT IN TO THEM.  SEASIDE BEGAN MAINTAINING MY CAR AT ABOUT 28,000 MILE BEFORE THAT IT WAS WELL MAINTAINED BY HOLLIER OLDSMOBILE IN ORLANDO, FLORIDA.  CAR WAS NOT DRIVEN FROM FLORIDA TO CALIFORNIA.  BUT IF THIS HAD HAPPENED ON A LONG TRIP, IT COULD HAVE A MAJOR PROBLEM.  I DO NOT BELIEVE THAT SHOULD EVER HAPPEN AND I SUSPECT SOMETHING IS AMISS.  THERE IS NOTHING BUT ANTIFREEZE IN THE CAR SO WHAT CAN CAUSE RUST.  *TR",
        "vin": "1GHDT13W612"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/24/2008",
        "dateOfIncident": "02/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225622,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 OLDSMOBILE.  THE CONTACT STATED THAT ANYTIME A PASSENGER IS SEATED IN THE REAR OF THE VEHICLE, THE SEAT BELT STRAPS BECOME SO TIGHT THAT THE CONTACT HAS TO REMOVE THE BOLTS IN THE SEAT BELT ASSEMBLY IN ORDER TO EXIT THE VEHICLE.  THE DEALER STATED THAT IT WAS A NORMAL CHARACTERISTIC OF THE VEHICLE.  IN ADDITION, THE CONTACT HAD THE TRANSMISSION REPLACED AND HEARD A LOUD GRINDING NOISE AFTER THE REPAIR WAS MADE.  HE TOOK THE VEHICLE BACK TO THE DEALER ON FOUR OCCASIONS, BUT THEY COULD NOT DUPLICATE THE FAILURE OR PROVIDE A RESOLUTION.  THE VEHICLE MODEL WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE 87,000.",
        "vin": "1GHDX23E31D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/03/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223909,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 OLDSMOBILE SILHOUETTE WITH BAD INTAKE MANIFOLD GASKETS. CONSUMER STATES THAT THE GASKET LEAKED. HE STATED HE HAD THIS PROBLEM REPAIRED BY A INDEPENDENT REPAIR SHOP. CONSUMER WOULD LIKE REIMBURSEMENT FOR REPAIRING THE VEHICLE.  *KB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215643,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 OLDSMOBILE BRAVADA.  THE CONTACT WAS INVOLVED IN A CRASH WITH A DEER.  THE FOLLOWING WEEK HE HEARD A SQUEAKING, CLUNKING, AND HUMMING NOISE WHILE DRIVING OVER 40 MPH.  A MECHANIC STATED THAT THERE WAS FAILURE WITH THE UPPER BALL JOINTS.  GENERAL MOTORS STATED THAT THERE WAS NO RECALL AND THEY WOULD NOT REPAIR THE VEHICLE FOR FREE.  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 60,000.",
        "vin": "1GHDT13W512"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/31/2007",
        "dateOfIncident": "12/29/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 OLDSMOBILE BRAVADA.  WHILE DRIVING APPROXIMATELY 2 MPH, THE ENTIRE LOWER CONTROL ARM BROKE AND CAUSED THE PASSENGER SIDE TO DROP TO THE GROUND.  THE CONTACT HAS PICTURES OF THE FAILED LOWER CONTROL ARM.  HE DID NOT HAVE THE VEHICLE INSPECTED TO DETERMINE WHAT CAUSED THE FAILURE; HOWEVER, THE CV AXLE AND LOWER CONTROL ARM WERE REPLACED.  HE FILED A FORMAL COMPLAINT WITH THE MANUFACTURER.  THE CURRENT AND FAILURE MILEAGES WERE 60,000. UPDATED 01/23/08.   *LJ  UPDATED *JB",
        "vin": "1GHDT13W112"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/18/2007",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191145,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 OLDSMOBILE BRAVADA.  THE CONTACT STATED THAT THE WATER PUMP SEEMS TO BE FAILING.  THE REPAIR WAS COVERED TWICE UNDER WARRANTY.  DURING SPRINGTIME, THE VEHICLE WOULD OVERHEAT AND THE CONTACT WOULD SMELL ANTIFREEZE.  THE FUEL PUMP FAILED LAST YEAR AND THE DEALER STATED THAT IT IS ONLY UNDER WARRANTY FOR 12,000 MILES.  OTHER MECHANICS STATED THAT A WATER PUMP SHOULD LAST ALMOST THE LIFETIME OF THE VEHICLE.  THE CONTACT STATED THAT THIS FAILURE HAS OCCURRED THREE TIMES.  SHE HAS NOT CONTACTED THE MANUFACTURER.  THE VEHICLE DOES NOT QUALIFY FOR HER STATE'S LEMON LAW, HOWEVER SHE WILL CALL FOR VERIFICATION.  THE VIN, ENGINE SIZE, AND # OF CYLINDERS WERE UNKNOWN.  THE CURRENT MILEAGE IS 103,000 AND FAILURE MILEAGE WAS 45,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/17/2007",
        "dateOfIncident": "03/10/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190993,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY EXPERIENCED A FAILURE OF THE UPPER INTAKE MANIFOLD GASKET ON A 2001 ALERO WITH 38000 MILES.  I HAD THE PROBLEM DIAGNOSED BY MY MECHANIC AND CONTACTED GM TO SEE IF ANY ASSISTANCE WITH THE REPAIR WOULD BE AVAILABLE, EVEN THOUGH THE WARRANTY HAD RUN OUT ABOUT 6 MONTHS EARLIER.  I WAS TOLD IT WOULD HAVE TO BE DIAGNOSED BY A GM DEALER EVEN THOUGH IT WAS OBVIOUS WHAT THE PROBLEM WAS.  RESEARCH HAS SHOWN THAT THIS WAS A COMMON PROBLEM, AND THAT GM HAS KNOWN ABOUT IT FOR SOME TIME.  BOTTOM LINE, NO ASSISTANCE FROM GM, BUT THEY OFFERED ME A $1500 CREDIT ON A NEW VEHICLE.  IT WOULD HAVE BEEN CHEAPER TO SPLIT THE BILL WITH ME FOR THE $800 REPAIR, BUT THAT WOULD IMPLY TAKING RESPONSIBILITY FOR THE PROBLEM WHICH THEY NOR THE DEALER WAS WILLING TO DO.*AK",
        "vin": "1G3NL52E61C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/11/2006",
        "dateOfIncident": "11/05/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173210,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIATOR NEEDED TO BE REPLACED AT 63,000 MILES. THIS WAS DUE TO BUILD UP OF GUNK CAUSED BY DEX COOL.  *NM",
        "vin": "1GHDT13W412"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2006",
        "dateOfIncident": "08/09/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE DROVE TO THE STORE AND WHEN SHE LEFT, THERE WAS NO REVERSE GEAR. A STRANGER HAD TO PUSH IT BACKWARDS SO, SHE COULD GET IT HOME. THE TRANSMISSION SUN SHELL GEAR WAS BROKEN SO THE TRANSMISSION HAD TO BE REPLACED.  *JB",
        "vin": "1GHDT13W812"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/27/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141088,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF THE TURN SIGNALS AND HAZARD LIGHTS TO WORK. THERE IS A RECALL FOR THE CAR FOR THE EXACT SAME PROBLEM ON THE INTERNET AND UPON TAKING TO A DEALER THEY STATE THAT MY CAR IS NOT COVERED UNDER THE RECALL. IT WAS MADE WITHIN THE MONTHS OF THE RECALL HOWEVER THEY STATE IT IS ONLY UP TO THE VINS ENDING IN 3000 BUT MINE IS LIKE 3684. NHTSA CAMPAIGN ID NUMBER : 03V327000   THIS IS A VERY LARGE PROBLEM AND HASSLE SINCE THE TURN SIGNALS SOMETIMES WORK AND SOMETIMES DON'T. THEY USUALLY DON'T BUT ONCE IN A WHILE THEY DO. I AM AFRAID TO GET INTO AN ACCIDENT BECAUSE OF THEM. *JB",
        "vin": "1G3NL52T11C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2005",
        "dateOfIncident": "09/07/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140273,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING IN SEPTEMBER, OUR 2001 INTRIGUE DIED WHEN TRYING TO PULL OUT INTO TRAFFIC.  COULD NOT JUMP - TOWED, DEALER SAID NEEDED NEW BATTERY.  WHEN MY SON WAS RUNNING ERRANDS LATER THAT DAY, HE PULLED OUT AND CAR DIED (ALMOST HIT BY TRUCK) - GOT STARTED; HEADED HOME WITH LIGHTS DIMMING, POWER STEERING GOING OUT.  TOOK BACK IN - NEW ALTERNATOR.  PICKED UP - SAME PROBLEM WITHIN 1-2 DAYS - WIRING PROBLEM.  IT IS NOW IN FOR ITS SEVENTH TIME AND STILL NOT RIGHT!  IT IS UNRELIABLE AND UNSAFE.  REPAIR PLACE HAS EVEN TAKEN IT TO THE GM OLDS SERVICE SHOP THE LAST 3 TIMES.  THEY SAID WIRING HAD BROKEN - HAD BEEN FIXED BEFORE - NOT SURE WHAT THE PROBLEM IS.*JB",
        "vin": "1G3WX52H91F"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2005",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131904,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PASS LOCK SECURITY SYSTEM SHUTS CAR OFF AND WILL NOT ALLOW THE CAR TO START AGAIN UNTIL IT IS RESET BY SETTING THE KEY IN THE ON POSITION FOR 10 MINUTES. HAPPENED ON THE EXPRESSWAY.  *NM",
        "vin": "1G3NK12T61C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/25/2005",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CAR IS SHUTTERING AND WILL NOT GO INTO REVERSE. WHEN TRAVELING UPHILL IT SOUNDED LIKE  THE VEHICLE WAS LOSING A GEAR. THE TRANSMISSION  MALFUNCTIONED. THE TRUCK WAS  IN MISSOURI, FORCING THE CONSUEMR TO GET A LOANER TO GET BACK HOME. THE TRUCK HAS BEEN TO THE DEALERSHIP SEVERAL TIMES. THE  DEALERSHIP  REPLACED THE FLUID IN THE TRANSFER CASE. THE CAUSE WAS THE SLIP STICK OF THE CLUTCH PLATES IN THE TRANSFER CASE CLUTCH PAD. THE GEAR WAS STRIPPED IN THE TRANSMISSION. THE DEALERSHIP COULD NOT FIX THIS UNTIL THURSDAY. THE CAR WAS UNSAFE.   THE CONSUMER HAS TALKED TO OLDSMOBILE, AND  WAS WAITING  FOR  THEM TO CALL  BACK.*AK",
        "vin": "1GHDT13W512"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2005",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OLDSMOBILE BRAVADA HAS SERIOUS TRANSFER CASE AND TRANSMITION PORBLEMS.  NON ABUSE FAILURE OF BOTH ITEMS EVEN WITH ROUTINE MAINTENANCE.  NON ABUSE FAILURE OF THE REVERSE GEAR IN BRAVADA TRANSMITION.  THIS PROBLEM HAS BEEN NOTED IN OUR PREVIOUS 1996 BRAVADA AND NOW IN THE 2001 BRAVADA, BOTH WITH 70,000 TO 80,000 MILES ON VEHICLES.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2005",
        "dateOfIncident": "12/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2001 OLDS BRAVADA AND RECENTLY MY COMPLETE TRANSMISSION HAS FAILED.  LAST YEAR I TOOK MY VEHICLE TO THE OLDS DEALER COMPLAINING OF STRAINING TO CHANGE GEARS.  THEY TOLD ME THAT IT WAS NOT MY TRANSMISSION, BUT A PART OF THE EMMISSION AND THEY WERE FIXING THE PROBLEM BECAUSE I HAD PURCHASED THE GMPP (GOOD THING I DID).  A YEAR LATER, THE SAME PROBLEM OCCURED AND I TOOK MY VEHICLE BACK TO THE OLDS DEALER AND BECAUSE IT HAD BEEN \"A FEW DAYS\" PAST THE WARRANTY EXPIRATION DATE, THEY SAID THAT THEY COULDN'T DO ANYTHING.  SO, I HAD TO TAKE MY VEHICLE TO AN OUTSIDE DEALER WHO HAD TO REPLACE MY ENTIRE TRANSMISSION FOR $1700!  NOW, MY OXYGEN SENSOR HAS GONE OUT AND MY GAS GAUGE DOESN'T WORK.  SINCE, I AM STILL RECOVERING FROM THE $1700 TO REPLACE MY TRANSMISSION, I AM UNABLE TO GET THESE TO NECESSITIES FIXED RIGHT AWAY.  I AM HIGHLY DISAPPOINTED IN OLDSMOBILE AND I WILL NEVER PURCHASE ANOTHER OLDSMOBILE AND I WILL TELL EVERYONE I KNOW NOT TO PURCHASE AN OLDSMOBILE!",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/18/2005",
        "dateOfIncident": "12/05/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107477,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AWD SERVICE LIGHT CAME ON WHILE DRIVING, THIS CONDITION PREVENTED THE ALL WHEEL DRIVE FROM ENGAGING WHILE DRIVING UP SNOWY INCLINE. THE AIR BAG LIGHT REMAINED ILLUMINATED. THE DEALER WAS NOTIFIED. THE DEALER INFORMED THE CONSUMER THAT WAS NOT COVERED UNDER A RECALL.   *JB",
        "vin": "1GHDT13S222"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "12/06/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 OLDS AROURA V8  T APPROXIMATELY 44,000 CAR SERVICED FOR BRAKES FOR FIRST TIME EVER  SEVERE RUSTING OF ALL FOUR ROTORS WAS DISCOVERED  INDEPENDENT MECHANIC TOLD ME THE GM HAD BEEN UTILIZING INFERIOR FOREIGN MADE ROTORS THAT WERE RUSTING OUT MAKING IT IMPOSSIBLE TO RESURFACE THEM  HAD TO REPLACE ENITRE MECHANICAL BRAKING SYSTEM AS A RESULT FEEL THAT SEVERE RUSTING COULD BE SAFETY ISSUE.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2004",
        "dateOfIncident": "12/12/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102881,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1) RIGHT HAND TURN AT INTERSECTION;  2) LOUD POP, ENGINE REVED, TRANSMISSIONWILL NOT SHIFT. NO 4TH GEAR, NO REVERSE GEAR  3) TRANSMISSION HAS TO BE REPLACED $1300++;  WAS RUNNING PREFECTLY, IS WELL MAINTAINED ONLY 58300 MILES.  *AK",
        "vin": "1GHDT13W312"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/31/2004",
        "dateOfIncident": "10/27/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098055,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT DOOR HINGE PINS HAVE RUSTED, CAUSING THE DOOR TO MISALIGN. THE HINGE PINS HAVE TO BE REPLACED. THERE IS A DANGER OF THE DOOR FALLING OFF, AND/OR DAMAGE TO THE DOOR AND/OR DAMAGE TO THE LOCK/CATCH.  *JB",
        "vin": "1GHDT13WX12"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/13/2004",
        "dateOfIncident": "04/12/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072537,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 OLDS BRAVADA (APPROX 36000 MILES) HAD TO HAVE THE DRIVE SHAFT REPLACED FOR THE 2ND TIME. THE 1ST INCIDENT (2003) THE SHAFT ACTUALLY DISCONNECTED FROM THE VEHICLE AND WAS REPLACED AT THE DEALERSHIP.  THIS TIME THE CAR MADE A HORRIBLE CLUNKING NOISE AND WAS TAKEN TO THE DEALERSHIP FOR INVESTIGATION AND REPAIR. HARD TO BELIEVE THAT A DRIVESHAFT WOULD HAVE TO BE REPLACED TWICE IN LESS THAN 3 YEARS. *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2004",
        "dateOfIncident": "07/24/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053156,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE I HAVE IS AN OLDSMOBILE BRAVADA HAS A 60000 MILE BUMPER TO BUMPER WARRANTY. THE GAS PEDAL WAS STICKING SO I TOOK THE VEHICLE IN TO GET IT FIXED. THE DEALER (MARTIN BUICK OLDSMOBILE, THE SERVICE MANAGER AT MARTIN NAME IS [XXX] MY INVOICE NUMBER IS [XXX]) CALLED ME LATER AND SAID THE REPAIR WAS NOT COVERED UNDER WARRANTY. THEY SAID THEY HAD TO CLEAN THE THROTTLE BODY AND IT WAS A NORMAL MAINTENANCE ITEM. AFTER REVIEWING WARRANTY BOOK AND OWNERS MANUAL (NEITHER BOOK MENTIONED CLEANING THE THROTTLE BODY AS A ROUTINE OR NORMAL MAINTENANCE ITEM) I ASKED FOR A PHONE NUMBER AT GM TO ASK THEM ABOUT IT. THE NUMBER I WAS GIVEN WAS [XXX]. I FIRST TALKED TO A [XXX] AND AFTER GIVING ME A SERVICE NUMBER [XXX] SHE CALLED THE DEALER WHILE I WAS ON HOLD. AFTER RESUMING THE CONVERSATION I WAS TOLD BY HER THAT THE DEALER SAID IT WAS A NORMAL MAINTENANCE ITEM. AND GM WOULD NOT COVER IT UNDER THEIR WARRANTY. I THEN ASKED TO SPEAK WITH HER MANAGER. [XXX] ANSWERED SHE SAID THAT GM DID NOT HAVE ANY SPECIALISTS AND THEY RELIED ON THE DEALER TO TELL THEM WHAT IS NORMAL MAINTENANCE. AS A MECHANICAL ENGINEER CLEANING THE THROTTLE BODY DOES NOT SEEM TO ME AS A NORMAL MAINTENANCE ITEM.    THE REAL PROBLEMS I HAVE ARE FIRST: WHEN A GM WANTS TO STOP OR AVOID PAYING FOR THE WARRANTY SERVICE ON A VEHICLE THEY CAN JUST SAY THE PROBLEM WAS JUST A NORMAL MAINTENANCE ITEM AND THEREFORE JUST DENY THE CLAIM FOR SERVICE AND THIS WOULD MAKE MY OR ANY ONE ELSE\u0019S WARRANTY USELESS. AND HAVE THEY DONE THIS TO OTHER CUSTOMERS. THE SECOND PROBLEM IS THIS SPECIFIC PROBLEM WITH THE GAS PEDAL STICKING IS A SAFETY PROBLEM. THE SERVICE MANAGER AT MARTIN SAID HE HAS SEEN THE SAME PROBLEM ON MANY CARS. THIS SEEMS TO BE A SOMETHING THAT NEEDS TO BE A RECALL ITEM AND A PERMANENT FIX TO ALL OF THE CARS OR AT LEAST GM SHOULD SEND A NOTICE TO ALL OF THE OWNERS OF THIS SAFETY PROBLEM.  *AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1GHDT13W112"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/12/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041942,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED AFTER THE VEHICLE HAD BEEN SITTING FOR THREE WEEKS, THE BRAKE ROTORS CORRODED.  THE TECHNICIAN WAS UNABLE TO TURN THE ROTORS. *AK  *CB  *JB",
        "vin": "1GHDT13W812"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/29/2003",
        "dateOfIncident": "07/24/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043838,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 OLDSMOBILE BRAVADA  WITH 48,000 MILES ON IT. THE ENGINE LITERALLY EXPLODED WHILE WE WERE DRIVING IT AND NEEDED THE ENGINE AND SEVERAL OTHER PARTS REPLACED. NO REASON WAS GIVEN TO US BY THE DEARLERSHIP FOR THE MALFUNCTION.  NOW OCTOBER, 27,2003. THE ELECTRICAL SYSTEM IS MALFUNTIONING. THE HEADLIGHTS TURN OFF WHEN YOU TURN ON THE TURN SIGNAL, THE TURN SIGNALS TURNS ON WHEN YOU BLOW THE HORN. THIS MORNING THE CAR WAS COMPLETLEY DEAD, CAN'T EVEN TAKE KEYS OUT OF IGNITION.  THE CAR IS ONLY THREE YEARS OLD!*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/27/2003",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043704,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUV NEEDED BOTH FRONT AND REAR ROTORS REPLACED DO TO RUST ON THE BACK SURFACE.  ROTORS WERE TOO THIN TO BE CUT.  VEHICLE IS ONLY 2 YEARS OLD AND HAS BEEN DRIVEN ONLY 27,000 MILES.*AK",
        "vin": "1GHDT13W712"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/24/2003",
        "dateOfIncident": "06/02/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039430,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OLDS BRAVADA 2001 4WD AND SMARTRAK BINDS; FRONT HUBS NEED TO BE REPLACED WHEN VEHICLE IS ONLY 2 YRS; BRAKES SHUDDER/WARPED",
        "vin": "1GHDT13W512"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "03/10/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011293,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKES WERE APPLIED, THE PEDAL WENT TO THE FLOOR, WHICH RESULTED IN EXTENDED STOOPING. THE DEALER INSPECTED THE VEHICLE, HOWEVER THE PROBLEM COULD NOT BE DUPLICATED. *JB",
        "vin": "PROVIDE"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/21/2003",
        "dateOfIncident": "11/22/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003143,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR QUARTER PANEL BODY SEAM SEPARATION CAUSED LEAKING INTO THE PASSENGER AREA CAUSING CARPET STAINING AND MILDEW SMELL IN PASSENGER COMPARTMENT.  WATER INTRUSION TO INTERIOR AS WELL AS ROAD GRIME AND SALT.",
        "vin": "1GHDT13W812"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001076,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HAS A ELECTRICAL PROBLEM SHE HAS NO BRAKES LIGHT FLASHERS.  PLEASE PROVIDE ADDITIONAL INFORMATION.  DEALER IS AWARE OF THE PROBLEM. TS",
        "vin": "1GHDT13W8Y2"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/09/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8024004,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE WILL STALL WITHOUT WARNING.  CONSUMER HAD VEHICLE SERVICED SEVERAL TIMES FOR THIS PROBLEM. THE CAUSE IS STILL UNKNOWN, AND THE DEALERSHIP CAN NOT FIX PROBLEM. PLEASE PROVIDE MORE DETAILS.   PH",
        "vin": "1GHDT13W212"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/03/2002",
        "dateOfIncident": "07/09/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009105,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 65 MPH ENGINE SUDDENLY DIED.  TOOK VEHICLE TO A MECHANIC  AND THEY REPLACED RADIATOR.  PLEASE PROVIDE ANY FURTHER INFORMTION.*AK",
        "vin": "1GHDT13W6R0"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTI-FUNCTION SWITCH FAILS, AND BRAKE LIGHTS DO NOT WORK, TOOK VEHICLE TO DEALER AND HAD PROBLEMS REPAIRED.*AK.  *JB",
        "vin": "1GHDT13W012"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/03/2001",
        "dateOfIncident": "09/29/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 897285,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 30 TO 40 MPH CONSUMER'S VEHICLE REAR ENDED ANOTHER VEHICLE, AND NONE OF THE AIRBAGS DEPLOYED.  CONSUMER'S  BACK WAS BROKEN AS RESULT OF CRASH.  PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/23/2001",
        "dateOfIncident": "08/16/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 895064,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE GETTING A TRAILER HITCH ASSEMBLY TECHNICIAN  WAS UNABLE TO ASSEMBLE IT DUE TO BRAKE LIGHTS  BEING OUT. VEHICLE WAS SERVICED LATER. TECHNICIAN REPLACED MULTI-FUNCTIONAL SWITCH. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": "1GHDT13W912"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/05/2001",
        "dateOfIncident": "04/26/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 889787,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BROADSIDED A 1996 CHEVROLET CAVALIER WHILE TRAVELING AT APPROXIMATELY 50 TO 55 MPH.   FRONTAL AIR BAGS FAILED TO DEPLOY DURING  CRASH. INVESTIGATOR STATED THAT CONSUMER WAS ONLY TRAVELING AT 22 MPH ,AND WHEN BRAKES WERE APPLIED, FRONT END WAS DIRECTED DOWNWARDS, ALLOWING MOST OF  CONTACT TO HIT ON HOOD. PLEASE PROVIDE ANY ADDITIONAL INFORMATION/ATTACHMENTS. *NOTE:  CONSUMER SUFFERED BACK/NECK/KNEE INJURIES, AND DRIVER OF CAVALIER SUFFERED UNKONWN INJURIES.  *AK",
        "vin": "1GHDT13WX12"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/12/2001",
        "dateOfIncident": "02/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 885804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "BRAVADA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  CAN SMELL FUMES IN CAR. CONSUMER HAS HAD  SAME PROBLEM WITH 1999, AND 2000 VEHICLES. *AK",
        "vin": "1GHDT13W112"
    }
]