[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/04/2016",
        "dateOfIncident": "03/31/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10853349,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SAAB 9-5. WHILE DRIVING 15 MPH, THE FRONT DRIVER SIDE WHEEL DETACHED FROM THE VEHICLE WITHOUT WARNING. THE VEHICLE BECAME DIFFICULT TO CONTROL, SLAMMED TO THE GROUND, AND CAME TO A STOP. THE VEHICLE WAS TOWED TO A LOCAL MECHANIC WHERE IT WAS DIAGNOSED THAT THE VEHICLE NEEDED A NEW ROTOR, HUB ASSEMBLY, AND FRONT RIM. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 194,000.",
        "vin": "YS3EF48Z713"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2015",
        "dateOfIncident": "08/19/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10776576,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SAAB 9-5. WHILE DRIVING APPROXIMATELY 55 MPH, THE VEHICLE STALLED WITHOUT WARNING AND FAILED TO RESTART. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS EVENTUALLY ABLE TO RESTART. THE FAILURE OCCURRED ON NUMEROUS OCCASIONS. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 05V399000 (ELECTRICAL SYSTEM). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "YS3EF48Z513"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2014",
        "dateOfIncident": "06/12/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597832,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SAAB 9-5 HAS BEEN EXPERIENCING A CHECK ENGINE LIGHT FOR AWHILE ON AND OFF. THE VEHICLE WILL SOMETIMES STALL RANDOMLY AND NOT START UNTIL ENGINE COOLS DOWN. THE CODES FOR CEL LEAD TO DIRECT IGNITION. A PREVIOUS RECALL ON THESE VEHICLES, ONE MY VEHICLE RECEIVED. I CALLED DEALER AND THEY SAID SEEING AS IT WAS ALREADY TAKEN CARE OF ONCE NOTHING CAN BE DONE. I KNOW I WILL TO HAVE TO GET IT FIXED TO PASS EMISSIONS TESTING DUE TO FAULTY DIRECT IGNITION. NOT TO MENTION HOW UNSAFE IT IS IF IT STALLS.  *TR",
        "vin": "YS3ED48E313"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "06/21/2013",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521786,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS CAR.  THE CHECK ENGINE LIGHT COMES ON INDICATING A SERIOUS PROBLEM.   I HAD THE ERROR CODES CHECKED.  THEY ARE P1312 AND P1334.  THESE CODES INDICATE A PROBLEM WITH THE \"DIC\" (DIRECT IGNITION CONTROLLER).  EARLIER MODELS WERE SUBJECT TO RECALL.  THERE IS APPARENTLY STILL A PROBLEM.  I KEEP CLEARING THE WARNING SIGNAL, BUT IT KEEPS RECURRING. *TR",
        "vin": "YS3ED58E113"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2011",
        "dateOfIncident": "12/07/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439001,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SAAB 9-5. THE CONTACT STATED THAT WHEN DRIVING AT VARIOUS SPEEDS, HE NOTICED AN OVERPOWERING ODOR OF GASOLINE AND THE FUEL WAS BURNING MUCH FASTER THAN NORMAL. AFTER STOPPING THE VEHICLE, HE NOTICED A LEAK. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THEY ADVISED HIM THAT THEY WOULD HAVE TO DROP THE ENTIRE FUEL TANK TO INSPECT THE FAILURE. THE VEHICLE WAS NEITHER INSPECTED NOR REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY ADVISED HIM THAT HE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 07V087000 (FUEL SYSTEM, GASOLINE: DELIVERY: HOSES, LINES/PIPING, AND FITTINGS). THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 122,500.   UPDATED 01/20/12*LJ  UPDATED 03/05/12",
        "vin": "YS3ED45EX13"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/18/2009",
        "dateOfIncident": "08/16/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296363,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 SAAB 9-5.  I HAVE HAD TO REPLACE THE DIRECT IGNITION COIL TWICE IN MY CAR.  I RECENTLY READ THAT THIS ITEMS HAVE BEEN RECALLED AND I WANT TO SEE IF I AM ELIGIBLE FOR A REFUND FOR THE WORK DONE. *TR",
        "vin": "YS3EF48Z513"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SAAB 9-5.  THE CONTACT NOTICED THAT THE ENGINE WARNING LIGHT WOULD SPORADICALLY ILLUMINATE ON THE INSTRUMENT PANEL.  SHE ALSO EXPERIENCED A NO START CONDITION.  WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLS WITHOUT WARNING.  THE IDM WAS THE CAUSE OF THE FAILURES.  THE MANUFACTURER STATED THAT THE VEHICLE WAS REPAIRED ACCORDING TO NHTSA CAMPAIGN ID NUMBER 05V399000 (ELECTRICAL SYSTEM:IGNITION:MODULE) IN 2006; THEREFORE, THEY WOULD NOT ASSUME ANY RESPONSIBILITY.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE AND CURRENT MILEAGES WERE 89,074.",
        "vin": "YS3ED48E513"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/20/2009",
        "dateOfIncident": "06/13/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266149,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST TIME THE OIL LIGHT CAME ON WAS IN MID OCTOBER 2006, AFTER ABOUT AN HOUR OF DRIVING.  THERE WAS NO OTHER INDICATION OF A PROBLEM (NOISE, VIBRATION, CHANGE IN HANDLING, ETC).  THE OIL HAD RECENTLY BEEN CHANGED, BUT IT WAS RECHECKED AND TOPPED OFF ON THE SIDE OF THE ROAD ANYWAY.  EVERYTHING SEEMED GOOD FOR ABOUT 20 MIN WHEN THE OIL LIGHT CAME BACK ON DURING A TURN.  I WAS ON MY WAY TO THE AIRPORT SO I PARKED THE CAR AND TOOK IT TO A SERVICE SHOP TWO DAYS LATER WHEN I RETURNED.  IT WAS GIVEN AN OIL CHANGE AND AN OVERALL CHECK.  THE OIL LIGHT DID NOT COME ON DURING THE TEST DRIVE.  I DROVE IT HOME WITH NO EXPLANATION AS TO WHY THE OIL LIGHT CAME ON IN THE FIRST PLACE.    IN EARLY 2007, THE SAME THING HAPPENED AGAIN.  THIS TIME THE ENGINE LIGHT CAME ON TOO.  EVERYTHING WAS CHECKED OVER AND NOTHING FOUND WRONG.  EVEN THE SENSORS WERE WORKING FINE.   FOR THE NEXT YEAR AND A HALF, THE OIL AND ENGINE LIGHTS WOULD GO ON AND OFF AT ODD INTERVALS ACCOMPANIED BY NO OTHER SIGNS.  SOMETIMES THEY WOULD ONLY FLICKER ON AND OFF DURING A SHORT DRIVE AND OTHER TIMES THEY WOULD STAY ON FOR WEEKS AND THEN GOING OFF AGAIN FOR NO REASON.  EACH TIME, THE OIL AND ENGINE WOULD BE LOOKED OVER AND NOTHING FOUND TO BE WRONG.  THE LAST TIME THERE WAS AN ISSUE WAS ON JUNE 13TH 2008.  I WAS DRIVING FOR ABOUT AN HOUR AND THE OIL LIGHT AND ENGINE LIGHT CAME ON, THIS TIME ACCOMPANIED BY A TICKING SOUND FROM THE ENGINE. I IMMEDIATELY PULLED OVER AT THE NEXT EXIT AND HAD THE CAR TOWED.  AFTER ANOTHER CHECKOVER, WE WERE TOLD THAT THE ENGINE IS FAILING DUE TO SLUDGE BUILD UP AND THAT IT WOULD NEED TO BE REPLACED.  IT HAS 98,300 MILES ON IT.  ALL REGULAR SERVICES WERE DONE, AND OIL CHANGES WERE DONE AT MORE FREQUENT INTERVALS THAN STATED IN THE OWNERS MANUAL.  WE WERE TOLD IT WOULD COST BETWEEN $5000.00 TO $9000.00 DEPENDING ON WHAT TYPE OF REPLACEMENT MOTOR WAS FOUND (NEW OR USED).  THE VEHICLE IS STILL SITTING IN OUR GARAGE AND HAS NOT BEEN DRIVEN.  THE SAAB COMPANY REFUSES ANY RESPONSIBILITY. *TR",
        "vin": "YS3ED48E113"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2009",
        "dateOfIncident": "03/25/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A \"DIRECT IGNITION CASSETTE\" FAILURE ON MY SAAB 9-5 2001.  I FOUND FROM WWW.SAABSERVICES.COM THAT THERE WAS A RECALL ON THIS PART FOR MODEL YEARS 2000-2002.  THE DEALER HAS INDICATED THAT MY VEHICLE, ALTHOUGH IN THAT CATEGORY, DID NOT QUALIFY FOR A RECALL PART REPLACEMENT.  HOWEVER, I HAVE COPIED THE NOTICE BELOW AND AM FILING A COMPLAINT AS INDICATED IN THE NOTICE BELOW.  TAKEN FROM THE WEBSITE:  HTTP://WWW.SAABSERVICES.COM/SAAB%20DIRECT%20IGNITION%20CASSETTE%20FAILURES.HTM  \"SAAB DIRECT IGNITION CASSETTE FAILURES    UPDATE! A RECALL HAS BEEN ISSUED, FOR MODEL YEARS 2000 THROUGH 2002. DI CASSETTES HAVE A SERIAL NUMBER ON THEM. THE COVERED UNITS ARE SERIAL # D000000-D336210 AND B083821-B096117 FOR 4CYL ENGINES, AND C048743-C073404 FOR 6CYL ENGINES. CONTACT YOUR SAAB DEALER FOR MORE INFO! BE AWARE THAT THE PRICE HAS DECLINED SIGNIFICANTLY, BUT WE DO NOT EXPECT THIS TO LAST VERY LONG.    WE HAVE REPLACED MANY OF THESE IGNITION CASSETTES, AND FEEL THAT THEY DO HAVE A LIMITED ( LESS THAN REASONABLE) LIFE. IF YOU HAVE EXPERIENCED A FAILURE, AND YOUR VEHICLE IS OUTSIDE OF THE RECALL GROUP, YOU MAY WISH TO FILE A COMPLAINT WITH THE NHTSA.\" *TR",
        "vin": "YS3EF48Z413"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/06/2008",
        "dateOfIncident": "10/29/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247843,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WEDNESDAY, OCTOBER 30, 2008 AT APPROXIMATELY 4:45 PM I EXPERIENCED A SUDDEN VEHICLE ENGINE STOP.  THIS OCCURRED ON A RESIDENTIAL 4-LANE STREET WHILE TRAVELING IN THE RIGHT HAND LANE AT APPROXIMATELY 30 MPH.    THE VEHICLE WAS A 2001 SAAB 95 ARC WAGON.   .    THE VEHICLE SUDDENLY STARTED TO RUN ROUGH AND THEN THE ENGINE COMPLETELY SHUT OFF.  THIS CAUSED ME TO HAVE TO GLIDE THE AUTO TO THE RIGHT HAND SIDE OF THE ROAD WHERE THERE WAS A CURB.  I THUS REMAINED IN A LANE OF TRAFFIC WITH A DISABLED VEHICLE.    THE CAUSE WAS A DEFECTIVE CRANK SHAFT POSITION SENSOR.  WHEN THIS BECOMES INOPERATIVE THE COMPUTER THAT CONTROLS ENGINE MANAGEMENT SHUTS DOWN AND DISABLES THE CAR.    THIS REQUIRED A TOW TO THE DEALER REPAIR SHOP.  AND IT REQUIRED A NEW CRANK SHAFT SENSOR PART TO BE INSTALLED.  THE OLD PART IS NOT AVAILABLE.    THE MAIN IRK ABOUT THIS IS THIS IS THE SECOND TIME I HAVE REPLACED THIS PART IN 15 MONTHS.  THE ORIGINAL SENSOR THAT CAME WIT THE CAR WHEN I PURCHASED IT NEW LASTED 87,199 MILES AND 5.5 YEARS.  THE SECOND SENSOR WAS REPLACED ON JULY 16, 2007.  THE THIRD SENSOR WAS REPLACED AT 101,507 MILES...A MERE 15 MONTHS AND 13 DAYS WITH A MILEAGE USAGE OF 14,308 MILES.    HAD THIS FAILURE IN OCTOBER 2008 OCCURRED JUST 5 MINUTES BEFORE WHEN I WAS TRAVELING ON A SIX-LANE INTERSTATE AT 60 MPH I WOULD HAVE HAD A SERIOUS PROBLEM DRIFTING ACROSS SEVERAL LANES OF TRAFFIC IN ORDER TO PULL OVER FOR SAFETY.    I BELIEVE THAT SAAB HAS A SUPPLIER PROVIDING THEM WITH AN INFERIOR PART. *TR",
        "vin": "YS3ED58E313"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/22/2008",
        "dateOfIncident": "05/04/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RANDOM ENGINE CUTOFF WHEN DRIVING, LOOSING POWER STEERING CAPABILITY AT THE SAME TIME. MOST OFTEN HAPPENED WHEN APPROACHING INTERSECTION AT THE TIME WHEN CAR SPEED WAS LOWERED. HAPPENED ON MULTIPLE DAYS. *TR",
        "vin": "YS3EF58Z313"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/09/2008",
        "dateOfIncident": "07/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SAAB 9-5.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V087000 (FUEL SYSTEM, GASOLINE:DELIVERY:HOSES, LINES/PIPING, AND FITTINGS).  THE MANUFACTURER INFORMED HER THAT THE VEHICLE WAS INCLUDED IN THE RECALL AND TO TAKE THE VEHICLE TO A DEALER FOR REPAIRS.  SHE DROVE THE VEHICLE TO THE DEALER AND THEY DEVELOPED A SECURING BRACKET TO SECURE THE FUEL LINES TO THE FUEL PUMP.  IMMEDIATELY FOLLOWING THE REPAIRS, THE CONTACT SMELLED GASOLINE INSIDE THE PASSENGER COMPARTMENT, WHICH CAUSED HER TO BECOME LIGHT HEADED.  THE MANUFACTURER STATED THAT A DIAGNOSTIC TEST WOULD BE PERFORMED IN ORDER TO FIND OUT IF THE VEHICLE WAS RELATED TO THE RECALL.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CURRENT MILEAGE WAS 139,000 AND FAILURE MILEAGE WAS 137,500.",
        "vin": "YS3EF48ZX13"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "09/08/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BOSCH ABS MODULE ON 2001 SAAB 9-5 SE V6 WITH 88,000 MILES FAILED WITH ABS, TCS, BRAKE, AND /!\\ FAILURE LIGHTS DISPLAYED ON DASH.  ABS NO LONGER OPERABLE.  TRACTION CONTROL SYSTEM NO LONGER OPERABLE.  ENGINE MANAGEMENT SYSTEM NO LONGER OPERABLE.  SPEEDOMETER NO LONGER OPERABLE.  FROM READING MANY (OVER EIGHT!) MESSAGE BOARDS, THIS AN ENDEMIC PROBLEM WITH THE BOSCH ABS SYSTEMS IN MANY BMW, SAAB, CADILLAC CATERA, VW CARS.  WHY CAN'T THE GOVERNMENT RECOGNIZE THAT THIS IS AN ISSUE?  ABS IS BRAKES AND BRAKES ARE A SAFETY SYSTEM.  PLEASE LOOK INTO THIS.  CONTACT BBA-REMAN IN TAUNTON, MA,  THEY HANDLE FIXING THESE SYSTEMS AND THEIR LOAD IS VERY HEAVY. *TR",
        "vin": "YS3EF48Z013"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/25/2008",
        "dateOfIncident": "08/05/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239651,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON TWO OCCASIONS OUR 2001SAAB,9.5 6 CYLINDER TRANSMISSION CASSETTE FAILED. LEAVING MY HUSBAND AND MY SELF STRANDED WITH A SMOLDERING CAR. ON OCT 19TH 05 WE WERE ABLE TO GET OFF THE HWY IN THE NICK OF TIME, HEAVY SMOKE HAD BEGUN TO POUR OUT FROM UNDER THE HOOD. THE FIRE WAS CONTAINED BUT THE IGNITION CASSETTE,THE CAUSE OF THE FIRE, THE WIRE HARNESS,  BATTERY AND,SPARK PLUGS WERE DESTROYED AND HAD TO BE REPLACED.  AT THE TIME OF THIS INCIDENCE WE WERE  DRIVING IN THE SOUTHERN SIERRAS IN A SEASONAL DRY FOREST  AREA. IT WAS FORTUNATE THAT A WE WERE ABLE TO PULL OFF THE ROAD IN A SAFE SPOT.    ON  AUG.15TH, 08. THE REPLACEMENT PART FAILED AGAIN AND AS BEFORE THE SPARK PLUGS, INSTALLED SEVERAL MONTHS PREVIOUSLY  HAD TO BE REPLACED   THE CONTINUED FAILURE OF THIS  PART IN AN INTRINSIC MANUFACTURING DEFECT.    SPECIFIC VIN NUMBERS OF THIS PART HAS BEEN RECALLED, BUT SAAB/ G.M NEEDS TO BE MADE TO RECALL ALL OF THESE AUTO'S AND REPLACE THE FLAWED IGNITION CASSETTE.  NEITHER OF THE TWO IGNITION CASSETTES INSTALLED IN OUR CAR HAVE HAD THE VIN NUMBERS RECALLED.  *TR",
        "vin": "YS3EF58Z313"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/10/2008",
        "dateOfIncident": "06/27/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233818,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SAAB 9-5 V6. DIRECT IGNITION CASSETTE FAILURE.  RECALL WAS ISSUED,   (RECALL 05V399000: IGNITION DISCHARGE MODULE OVERHEATING) FOR THIS CAR YEAR AND TYPE.  MINE FAILED AND THEY WILL NOT REPLACE, EVEN THOUGH THE PART # MATCHES THE RECALLED PART #.  ALL I WANTED WAS THE PART REPLACED.  THANK YOU  *TR",
        "vin": "YS3EF48Z413"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/11/2008",
        "dateOfIncident": "06/07/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG WARNING LIGHT COMES ON WITHOUT NOTICE,  AND HORN STOPS WORKING, TOOK TO DEALER WHO SAID IT WAS THE CLOCK SPRING AND THIS IS A TYPICAL PROBLEM. IT IS A SAFETY ISSUE AS THE AIRBAG IS NEEDED TO PREVENT INJURIES. I HAVE HEARD OF OTHER PEOPLE BEING INJURED BY THIS.  *TR",
        "vin": "YS3ED58EX13"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/10/2008",
        "dateOfIncident": "06/05/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230536,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BRINGING MY CAR INTO THE DEALER FOR RECALL SERVICE I FOUND THAT THE DEALER HAD NOT PERFORMED SOME OF THE WORK. THE DEALER DID NOT ADDRESS NHTSA CAMPAIGN ID NUMBER : 03V006000, WHICH IS ABOUT THE WHEEL BOLTS. THE DEALER SAID THAT SINCE I HAD MOVED TO FLORIDA THE RECALL WAS NOT VALID EVEN THOUGH IT IS NATIONWIDE. THE VEHICLE CAME FROM OHIO AND HAD  STEEL WHEELS IN OHIO DURING THE WINTER. THE DEALER SHOULD REPLACE THE BOLTS BUT HAVE PUT ME IN DANGER INSTEAD.  *TR",
        "vin": "YS3ED58EX13"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2008",
        "dateOfIncident": "03/14/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222159,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT IS THAT SAAB USA HAS DECLINED TO REPLACE/REIMBURSE THE COST OF THE IDM/DIC WHICH FAILED ON OUR 2001 SAAB 9-5 V-6 VIN # .  THIS WAS A RECALL BY NHTSA IN 2006. (NHTSA CAMPAIGN # IS 05V399000)  SAAB USA DENIED THIS REPAIR AS THEIR DATA BASE DID NOT INCLUDE THIS VIN #. (THIS SERVICE REQUEST # TO SAAB USA IS 17613448567)  THE FINAL DECISION ON THIS FROM SAAB USA CAME FROM AN UN-NAMED SUPERVISOR AT 1-866-790-5600 EXT # 31078.  THE COST FOR THIS REPAIR WAS $677.50, INCLUDING $70.00 FOR TOWING TO A NEARBY FOREIGN AUTO REPAIR FACILITY.  FROM EXHAUSTIVELY SEARCHING THE INTERNET AND ALSO PROVIDED TO ME BY THE REPAIR FACILITY, THE SERIAL NUMBERS OF THE DEFECTIVE IDM/DIC WERE FOUND.  THE FAULTY UNITS FOR A V-6 ENGINE ARE C048743 THROUGH C073404.  THE SERIAL # FROM THIS VEHICLE THAT FAILED IS C061858.  THIS INFORMATION WAS ALSO GIVEN TO THE SUPERVISOR AT SAAB USA (MESSAGE-RECORDING), BUT HAS NEVER RESPONDED TO THIS ADDITIONAL FINDING AND CONTINUED CLAIM FOR COST REIMBURSEMENT.  YOUR ASSISTANCE IS REQUESTED ON THIS MATTER.  FROM INTERNET INFO, OTHERS HAVE BEEN SIMILARLY \"STONEWALLED\" BY SAAB USA COMPLIANCE TO YOUR ORDER.  *TR",
        "vin": "YS3EF58Z013"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2008",
        "dateOfIncident": "03/09/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220523,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BEGAN HAVING PROBLEMS WITH THE ENGINE STALLING AND UPON RECOMMENDATION OF OUR MECHANIC WE LOOKED TO SEE IF THERE WAS A RECALL OR ANY INFORMATION OUT THERE FOR THIS VEHICLE. I CONTACTED SAAB USA AND THERE WAS A VALID OPEN RECALL NOTICE FOR THIS VEHICLE. WE ARRAIGNED TO TAKE THE VEHICLE TO HERITAGE SAAB IN MORROW, GA AND ACCORDING TO THEIR TECH'S THEY COMPLETED THE REPLACEMENT OF THE IDM  IN ACCORDANCE TO THE RECALL NOTICE, BUT IN A MATTER OF A COUPLE OF WEEKS THE PROBLEM RETURNED. NOW WE CAN'T EVEN CRANK THE VEHICLE DUE TO IT CUTTING OFF AS SOON AS YOU CRANK IT. IT WILL APPEAR TO BE RUNNING, BUT THE ENGINE HAS STALLED AND IT SOMETIMES WILL NOT RECRANK UNTIL AFTER A FEW MINUTES HAS GONE BY.   *TR",
        "vin": "YS3EF48Z813"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2008",
        "dateOfIncident": "08/25/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S FUEL LINE DETACHED FROM FUEL PUMP DUE TO BROKEN RETAINING CLIP. FUEL SPILLED ON THE GROUND CREATING A HAZARDOUS SITUATION.  *TR",
        "vin": "YS3EH48GX13"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "02/05/2008",
        "dateOfIncident": "01/23/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217016,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR STALLED AND CAME TO A STOP WHILE TRAVELING AT 50 MPH, THOUGHT IT WAS BATTERY.  GOT RIDE TO PARTS STORE REPLACED THE BATTERY SINCE IT WAS COLD WEATHER AND DIDN'T WANT TO LEAVE VEHICLE ON SIDE OF ROAD.  HOWEVER, THIS WAS NOT THE CASE.  CAR TOWED TO LOCAL SHOP AT A COST OF $100.  THEY HOOKED IT UP AND SAID THAT IT WAS THE FUEL PUMP AND NEEDED REPLACED COSTING $414.54.  JUST RECEIVED A LETTER COUPLE WEEKS PRIOR ON RECALL OF FUEL PUMP RETAINING TABS THAT HOLD FUEL LINES TO FUEL PUMP.  LOOKED UP OTHER COMPLAINTS AND FIND THAT STALLING SEEM TO BE AN ISSUE WITH THIS MODEL, COULD IT HAVE SOMETHING TO DO WITH THE FUEL PUMP?  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2007",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213895,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SAAB 9-5 WITH ENGINE STALLING PROBLEMS. CONSUMER STATES THAT SHE HAS HAD THE ENGINE SHUT OFF WHILE DRIVING AND THE FUEL PUMP REPLACED TWICE.  SHE FEELS THAT HER VEHICLE IS A LEMON.  *KB  THE CONSUMER STATED THE ENGINE LIGHT ILLUMINATED. THE MECHANIC STATED THE BRAKE BOOSTER WAS FAULTY WHICH CAUSED THE ENGINE LIGHT TO COME ON.  THERE WAS A LOUD ROARING NOISE COMING FROM THE REAR OF THE VEHICLE UPON BRAKING. THE DEALER REPLACED THE BRAKES. *JB",
        "vin": "YS3EF48Z913"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/23/2007",
        "dateOfIncident": "10/22/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206628,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SAAB 9-5.  THE CONTACT STATED THAT THE CHECK ENGINE LIGHT ILLUMINATED INTERMITTENTLY.  THE DEALER STATED THAT THE DI CASSETTE WAS THE CAUSE OF THE FAILURE, WHICH IS THE SAME AS THE IGNITION DISCHARGE MODULE.  CURRENTLY, THE VEHICLE IS AT THE DEALER WAITING TO BE REPAIRED.  THE VIN WAS INVALID.  THE CURRENT AND FAILURE MILEAGES WERE 55,000.   THE CONSUMER STATED THERE WAS A RECALL ISSUED FOR THIS VEHICLE, HOWEVER THE MANUFACTURER STATED THE VIN WAS NOT INCLUDED IN THE RECALL. UPDATED 12/12/07  *TR",
        "vin": "YS3ED48E013"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197232,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DIGITAL INSTRUMENTATION PANEL FAILED IN THE FIRST 20,000 MILES AND NOW AGAIN BEFORE 50,000 MILES.  OTHERS I HAVE SPOKEN TO WITH THE SAME MODEL HAVE EXPERIENCED THE SAME PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/21/2007",
        "dateOfIncident": "03/26/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191337,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SAAB/GM ONSTAR IS NOT SUPPORTING VEHICLES WITH ANALOG SYSTEMS STARTING FEBRUARY 2008.  THIS DEPRECIATES THE VEHICLE AND REMOVES A SAFETY COMPONENT THAT WAS A MAJOR PRT OF THE DECISION TO PURCHASE THE VEHICLE.",
        "vin": "YS3EF48Z813"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2007",
        "dateOfIncident": "03/02/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186764,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT STATED THAT WHILE DRIVING  THE 2001 SAAB 9-5  WITH 120000 FAILURE MILEAGE HE SMELLED  A FUEL ODOR.   THE CONTACT PULLED OVER TO THE SIDE OF THE ROAD, EXITED THE VEHICLE, AND DISCOVERED  THAT THERE WAS FUEL GUSHING FROM UNDER THE VEHICLE.  THE VEHICLE WAS TOWED TO A MECHANIC, WHO STATED THAT THE ATTACHMENTS TO THE FUEL PUMP WERE DEFECTIVE.   THERE WAS RECALL 07V087000 ON THIS PARTICULAR YEAR, MAKE AND MODEL VEHICLE ISSUED IN  APRIL 2007.  *AK",
        "vin": "YS3ED55E313"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2007",
        "dateOfIncident": "03/13/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184979,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT  OWNS  A 2000 SAAB 9-5.  THE CONTACT STATED THAT WHEN HE CALLED THE TOLL FREE NUMBER NOTED ON THE SAFETY RECALL #05V399000 FOR THE ELECTRICAL SYSTEM:IGNITION:MODULE, AND PROVIDED  THE  VIN HE WAS TOLD THAT SOMEONE WOULD GET BACK TO HIM.  THE CONTACT BELIEVED THAT HE COULD HAVE BEEN TOLD WHETHER OR NOT THE SAFETY RECALL APPLIED TO THIS  VEHICLE AT THAT TIME. THE RECALL STATED THAT STALLING MAY OCCUR. RECENTLY  THE  VEHICLE STALLED WHILE HE WAS DRIVING  AT  5 - 10 MILES, AND THAT THE  VEHICLE HAD ONLY STALLED ONCE.  THE WEATHER ON 02/06 WAS CHILLY, BUT CLEAR.  THE FAILURE  AND CURRENT MILEAGE WERE BOTH 102467. *AK  CONSUMER STATES MANUFACTURER IS NOT WILLING TO HONOR RECALL. UPDATE *4/23/07 *TR",
        "vin": "YS3EF58Z3Y3"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2007",
        "dateOfIncident": "01/06/2007",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182460,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SAAB SID DISPLAY. THE LINES DISAPPEAR AND THE DISPLAY WILL NOT SHOW ANYTHING THAT IS HAPPENING TO THE CAR. THIS DISPLAYS IS VITAL TO THE OPERATION. IT FAILED WITH LESS THAN 50,00 MILES AND IS A KNOWN PROBLEM WITH THE SAAB'S.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2007",
        "dateOfIncident": "03/01/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181925,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2001 SAAB 9.5 2.3T.  MY WIFE IS A COMMUTER USER OF THE CAR AND CAR HAS VERY LOW MILEAGE.  HER GAS TANK HAS LOST THE COUPLING TO THE FUEL TANK TWICE AND LOST ALL THE GAS ON THE ROAD.  SHE WAS STRANDED BOTH TIMES.  THIS IS COMPLETELY INEXPLICABLE AND THE DEALERSHIP HAS NEVER ANSWERED WHY THIS HAS HAPPENED.  DUE TO SAFETY CONCERNS, WE FELT IT APPROPRIATE TO REPORT.  WE WILL HAVE TO CONFIRM THE INCIDENT DATES IN OUR RECORDS.  *NM",
        "vin": "YS3ED48E913"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2007",
        "dateOfIncident": "11/11/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178721,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THRUWAY,CRUISE WENT OFF SUDDEN LOSS OF SPEED,CK ENGINE LIGHT ON.  ENGINE STALLED WOULD ONLY IDLE AND SHAKE WOULDN'T MOVE.  HAD IT TOWED TO SHOP CLEARED CODE RAN 1/2 DAY OK THEN CK LIGHT CAME BACK ON, PULLED IT BACK INTO MY SHOP.  I SEARCHED INTERNET FOR SOLUTIONS POINTED TO FAULTY THROTTLE BODY.  I\"M A CERTIFIED FOR 34 YEAR MOTORCYCLE TECHNICIAN SO I TOOK IT OFF AND DISASSEMBLED IT AS I WANTED TO GET TO THE BOTTOM AS IT\"S REASON FOR FAILURE. I DISCOVERED EVERYTHING WAS OK EXCEPT ALL OF  THE WIRE INSULATION WITHIN THE INTERNAL AREA OF THE THROTTLE BODY HAD FAILED AND PEELED AWAY CAUSING A ELECTRICAL SHORT OR SPIKE.  THIS IS DUE TO THE USE OF INFERIOR WIRE INSULATION NOT DESIGNED FOR IT\"S APPLICATION.  DLR HAD NEW $457.00 PART IN STOCK. I INSTALLED IT,WORKED FINE DLR INSPECTED IT.  I LEFT THE OLD PART WITH THEM FOR POSSIBLE SPECIAL WARRANTY CONSIDERATION WITH SAAB USA.SAAB DECLINED WARRANTY 01/02/07, I NOW HAVE THE OLD PART. THIS CAR HAS ALSO HAD 12 IGN SWITCH PROBLEMS WHERE 6 TIMES IT WAS REPLACED,THE LAST ONE WAS 11/17/06 COVERED BY WARRANTY,ALSO 6 HEADLIGHTS & 6TAIL LIGHTBULBS REPLACED & COUNTING NOT WARRANTY.  I HAVE ALL WORK ORDERS.  *NM",
        "vin": "YS3ED58E813"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2006",
        "dateOfIncident": "12/03/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175297,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GASOLINE LEAK - I WAS DRIVING WITH MY TWO SMALL CHILDREN IN THE CAR (2001 SAAB 9-5 WAGON (4-CYLINDER) WHEN SOMEONE PULLED UP BESIDE ME TO TELL ME THAT GAS WAS POURING OUR OF MY CAR.  I STOPPED THE CAR AND THE REMAINDER OF THE TANK EMPTIED ON THE GROUND. ONCE THE FIRE CHIEF OKAY'ED THE CAR FOR TRANSPORT, (THIS WAS REQUIRED BY THE TOWING COMPANY.) I HAD THE CAR TOWED TO THE DEALERSHIP.  THE DEALERSHIP INDICATED THAT THE CLIP FOR THE FUEL LINE HAD COME UNDONE AND THAT THE FUEL LINE HAD COME LOOSE. THEY ALSO INDICATED THAT \"THEY HAD SEEN THIS BEFORE\".   THEY REMOVED THE FUEL TANK, REPLACED THE FUEL LINE, REPLACED THE FUEL TANK AND PLACED A CLAMP OVER THE LINE.   THERE IS A RECALL FOR THE SAAB 9-3 FOR A RELATED FUEL CLIP PROBLEM.  BASED ON MY EXPERIENCE (AND OTHER 9-5 DRIVERS I HAVE SEEN VIA THE INTERNET), I THINK SAAB NEEDS A RECALL OR CHECK ON THIS...*JB",
        "vin": "YS3ED55E113"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/17/2006",
        "dateOfIncident": "11/04/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173772,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE ENGINE DIED WHILE THE VEHICLE WAS TRAVELING 60 MPH, ALMOST CAUSING AN ACCIDENT.  THE SERVICE DEALER DETERMINED THE VEHICLE NEEDED A NEW ENGINE.  THE CONSUMER HAD THE ENGINE REPLACED. UPDATED 01/26/07. *JB",
        "vin": "YS3ED58E413"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2006",
        "dateOfIncident": "10/18/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171613,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 60 MPH, A DRAMATIC DECREASE IN THE GAS GAUGE WAS NOTICED.  THE VEHICLE WAS TOWED TO THE DEALER WHO REPLACED THE GAS LINE TO THE FUEL PUMP WHICH CAUSED A RAPID LOSS OF FUEL.  THERE WAS A NHTSA RECALL, # 04V557000, REGARDING THE HOSES, LINES/PIPING AND FITTINGS.  THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.",
        "vin": "YS3ED48E913"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/02/2006",
        "dateOfIncident": "10/02/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169805,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM NOT SURE IF THIS IS WHERE I FILE A POTENTIAL FIRE HAZARD  MY 2001 SAAB 9-5 CE ,THE HEAD ON THE ENGINE IS LEAKING OIL DOWN THE ENGINE BLOCK, NEAR AND ONTO THE EXHAUST PIPE. THE LEAK IS ON THE BACK REARWARD SIDE OF THE ENGINE TOWARD THE DRIVE BELT.   HAVING BEEN ON THE SAABNET.NET FORUM  FOR SAAB OWNERS , I REALIZE THAT I AM NOT ALONE WITH THIS PROBLEM.  *JB",
        "vin": "YS3ED48E813"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/22/2006",
        "dateOfIncident": "09/21/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168968,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS IN HEAVY TRAFFIC, THE ENGINE STALLED WITHOUT WARNING.  THERE WAS A LOSS OF ALL VEHICLE POWER, AND THE ENGINE WOULD NOT RESTART.  THE VEHICLE WAS TOWED TO A DEALERSHIP WHO DETERMINED THE SERPENTINE BELT NEEDED TO BE REPLACED.  AFTER THE REPLACEMENT OF THE SERPENTINE BELT, THE PROBLEM PERSISTED.  THE VEHICLE WAS AGAIN INSPECTED BY A DEALER WHO DETERMINED THE THROTTLE BODY CASING NEEDED TO BE REPLACED.  THE MANUFACTURER WAS NOT NOTIFIED.",
        "vin": "YS3ED48E613"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2006",
        "dateOfIncident": "07/31/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164889,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE  CONTACT STATED THE RECALL WORK FOR NHTSA RECALL # 05V399000, PERTAINING TO THE ELECTRICAL SYSTEM IGNITION MODULE WAS PERFORMED UNSATISFACTORILY.  THE DEALER SERVICE MANAGER WAS CONTACTED, WHO DETERMINED  A SECOND REPAIR WOULD NOT BE DONE WITHOUT CHARGE.  THE MANUFACTURER WAS ALSO CONTACTED ON SEVERAL OCCASIONS, HOWEVER THERE WAS NO RETURN CALLS PROVIDED.",
        "vin": "YS3EH48G813"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2006",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164523,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING THERE WAS A NOTICEABLE LOSS OF POWER. THE VEHICLE WAS TAKEN THE SERVICE DEALER WHERE A 24 POINT INSPECTION WAS PREFORMED AND THE THROTTLE BODY WAS CLEANED.  WHILE TRAVELING AT 35 MPH., ON THE INTERSTATE HIGHWAY, ON A CLEAR, DRY DAY, THERE WAS LOSS OF ALL POWER. THE VEHICLE WAS TOWED TO THE SERVICE DEALER WHERE THE CONTACT WAS INFORMED THE ENGINE SUFFERED A COMPLETE ENGINE FAILURE AND NEEDED TO BE REBUILT. THE MANUFACTURER OFFERED TO COVER $2,000.00 OF THE ESTIMATED REPAIR COST HOWEVER THE CONTACT WAS UNABLE TO PROCEED WITH THE REPAIR WORK. SINCE THEN A RECALL NOTICE (05V399000) WAS RECEIVED REGARDING THE IGNITION DISCHARGE MODULE (SAAB RECALL # 05087). THE CONTACT BELIEVED THAT THE RECALL DEFECT WAS RESPONSIBLE FOR THE ENGINE FAILURE.",
        "vin": "YS3EF48Z213"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/03/2006",
        "dateOfIncident": "08/03/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164441,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 8:00 PM THIS EVENING, I WENT TO DINNER. EVERYTHING WAS WORKING NORMALLY ON MY CAR. AT 8:20 PM, TWENTY MINUTES LATER, I START MY CAR AND IT ENTERS \"LIMP-HOME\" MODE WITH A BLINKING CHECK ENGINE LIGHT, INDICATING MISFIRE. GIVEN THE WAY THE CAR WAS ACTING, THE TIMING BELT HAS BROKEN. IN MY RESEARCH, I HAVE FOUND THIS MOTOR IS A GM L81 MOTOR, 3.0L V6. THIS MOTOR HAS ALSO BEEN USED IN THE SATURN VUE AND CADILLAC CATERA. ACCORDING TO THE NHTSA RECORDS, THERE WAS A RECALL ON TIMING BELTS FOR THE 97-2002 CATERAS. AS STATED EARLIER, THIS IS THE SAME MOTOR IN MY 2001 SAAB 9-5 SE V6 3.0L. *JB",
        "vin": "YS3EF48Z613"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2006",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162650,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SAAB 9-5, CONSUMER HAS NOT RECEIVED REIMBURSEMENT FOR THE RECALL WORK DONE ON THE VEHICLE. *KB  THE CONSUMER RECEIVED A RECALL LETTER IN THE MAIL ONE MONTH LATER, AFTER THE REPAIRS WERE ALREADY PAID FOR.  WHEN THE CONSUMER CALLED TO INQUIRE ABOUT HER REFUND, SHE WAS TOLD BY THE MANUFACTURER, THAT THEY DIDN'T HAVE ALL OF THE PAPERWORK AND ALSO THEY DIDN'T HAVE HER ADDRESS. NINE MONTHS LATER, THE CONSUMER STILL HAS NOT RECEIVED REIMBURSEMENT. THE CATALYTIC CONVERTER WAS REPLACED.  *JB",
        "vin": "YS3EF48Z813"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2006",
        "dateOfIncident": "04/10/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157741,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IDM (IGNITION CASSETTE) FAILURE    1ST OCCURRENCE:  10/11/2005 (48,000 MILES)  2ND OCCURRENCE:  4/10/2006  (54,000 MILES).  *NM",
        "vin": "YS3EF58Z213"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/27/2006",
        "dateOfIncident": "03/14/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157342,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SAAB 9-5 IDM IS DEFECTIVE, CONSUMER WAS TOLD THAT ALL THE SPARK PLUGS NEED TO BE REPLACED.  *TS   *NM***NAR***",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/26/2006",
        "dateOfIncident": "03/15/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157292,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED A LETTER FROM SAAB STATING THAT PROBLEMS WITH THE IDM COULD CAUSE REDUCED POWER AND ROUGH OPERATION.  THE CONSUMER EXPERIENCED THIS PROBLEM WITH HIS 2001 SAAB 9/5.  *NM  THE CHECK ENGINE LIGHT BEGAN TO FLASH PRIOR TO THE VEHICLE STALLING.  *NM",
        "vin": "YS3EF48Z513"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2006",
        "dateOfIncident": "05/26/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155206,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SAAB 9-5 RUNS ROUGH  THE CONSUMER HAD TO REPLACE THE IDM DUE TO FAILURE.  *TS ***NAR***  AFTER THE IDM REPAIRS WERE MADE THE CONSUMER RECEIVED A RECALL NOTICE WHICH REFERENCED THE PROBLEM THE CONSUMER HAD REPAIRED.  THE CONSUMER SUBMITTED A CLAIM REQUESTING REIMBURSEMENT.  *NM",
        "vin": "YS3EF58Z713"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/10/2006",
        "dateOfIncident": "01/09/2006",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147327,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION MODULE FAILED WHILE DRIVING, LEADING TO LOSS OF POWER MAKING VEHICLE INOPERABLE.  CATALYTIC CONVERTER WAS DAMAGED AND IT AND THE IGNITION MODULE NEEDED TO BE REPLACED.  SECOND TIME WAS AFTER IGNITION MODULE REPLACE IN 10/05.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2005",
        "dateOfIncident": "11/16/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143287,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP SPRANG A LEAK PUMPING GASOLINE UNDER VEHICLE AS LONG AS ENGINE CONTINUED RUNNING.  CAR WAS FLATBEDDED TO DEALER.  NEW FUEL PUMP COST $810.00.  *NM",
        "vin": "YS3EF48Z913"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2005",
        "dateOfIncident": "11/16/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143090,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED AFTER A SHORT DRIVE THERE WAS A FUEL SMELL.  HE LOOKED UNDER THE VEHICLE AND FOUND A SPOT OF FUEL.  HE INSPECTED THE VEHICLE, AND FOUND THERE WAS  A LEAK WHERE THE FUEL PUMP COMES OUT OF THE GAS TANK.  THE DEALERSHIP HAS BEEN CONTACTED, BUT THE PROBLEM HAS NOT BEEN CORRECTED AT THIS TIME.  *AK",
        "vin": "YS3EF48Z913"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/06/2005",
        "dateOfIncident": "10/09/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141851,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING VEHICLE 2001 SAAB 9-5 SE (V6 ENGINE) WAGON  AT 45-50 MPH WHEN IT SUDDENLY LOST POWER AND DECELERATED. I KNEW ABOUT DI CASSETTES FAILURE AND STOPPED IMMEDIATELY. NO WARNING LIGHTS ILLUMINATED PRIOR OR AFTER THIS EPISODE. VEHICLE WAS TOWED  TO LOCAL SAAB DEALER.  PROBLEM WAS DIAGNOSED AS A FAULTY DIRECT IGNITION CASSETTE AND REPLACED WITH A NEW PART FOR FREE DUE TO FUTURE RECALL (DI CASSETT ONLY). THE CATALYTIC CONVERTER WAS DAMAGED DUE FAILURE OF THE IDM TOO, BUT IT  DOES NOT COVERED AND IT WAS REPLACED AT COST OF $2026.48. +10 DAYS I WAS WATING FOR PARTS.  THIS CAR HAS HAD OTHER \"SMALL\" ELECTRICAL PROBLEMS LIKE MULTIPLE LIGHT BULB BURN OUTS, LOSS OF PIXELS ON THE SID DISPLAY, SUDDEN INCREASE BRIGHTNESS OF ALL LIGHTS, FAILURE OF REAR SEATS HEATER.   *NM",
        "vin": "YS3EF58Z713"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/01/2005",
        "dateOfIncident": "05/16/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141484,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SAAB 9-5 STALLED ONE DAY ALL OF A SUDDEN AFTER I REACHED A SHOPPING MALL.  I TOOK IT TO A LOCAL SAAB DEALER AND THEY REPLACED MY IGNITION SYSTEM FOR A CHARGE CLOSE TO 600 DOLLARS. THEY SPOKE TO ME THAT IT WAS AN ISOLATED EVENT.    FROM THE RECALL NOTICE YOU RELEASE I REALIZE THAT IT WAS INTRINSIC MANUFACTURING DEFECT. THANK YOU ALL FOR THE GOOD WORK. I HOPE I WILL GET A REFUND.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "09/24/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137639,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A 2001 SAAB 9-5 SE (V6 ENGINE) STATIONWAGON WHILE DRIVING ON AN INTERSTATE HIGHWAY, THE CAR SUDDENLY LOST POWER AND THE CHECK ENGINE LIGHT STARTED FLASHING. AS I PULLED THE CAR OFF THE HIGHWAY ONTO AN EXIT RAMP (WITHIN LESS THAN A MINUTE OF THE MALFUNCTION), THE CAR STALLED AND A BURNING SMELL WAS DETECTED INSIDE THE CAR AFTER WHICH THE CAR WAS TURNED OFF AND PARKED.  THE CAR WAS TOWED TO THE LOCAL SAAB DEALER WHERE THE IGNITION DISCHARGE MODULE ON THE REAR CYLINDER BANK WAS DETERMINED TO HAVE FAILED. FAILURE OF THE IDM ON ONLY 3 OUT OF 6 CYLINDERS CAUSED UNBURNED GAS TO BE DISCHARGED INTO THE EXHAUST WHERE IT REACTED IN THE CATALYTIC CONVERTER, CLOGGING THE CONVERTER AND STALLING THE ENGINE. THE CATALYTIC CONVERTER WAS RUINED WHICH CAUSED THE BURNING SMELL. NO FIRE WAS DETECTED. THE IDM AND CATALYTIC CONVERTER WERE REPLACED. *JB",
        "vin": "YS3EF58Z213"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137693,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 SAAB AERO 9-5.  I HAVE TAKEN THIS VEHICLE INTO THE SAAB SERVICE DEPARTMENT OVER 15 TIMES TRYING TO FIX MY PROBLEM.  MY VEHICLE SHUTS DOWN WHILE DRIVING AND MANY TIMES WILL NOT RESTART.  I HAVE ALSO HAD MANY ELECTRICAL ISSUES WITH MY VEHICLE INCLUDING BUT NOT LIMITED TO THE ELECTRICAL MODULES FOR THE HEAT AND AIR CONDITIONING, HEATED AND AIR CONDITIONED SEATS NOT WORKING AND MANY OTHER ELECTRICAL MODULES GOING OUT.  *NM",
        "vin": "YS3EH48G513"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/31/2005",
        "dateOfIncident": "08/23/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135009,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SAAB 9-5 FUEL PUMP CLIP FAILED SPRAYING GASOLINE UNDER PRESSURE OVER EXHAUST SYSTEM BELOW REAR PASSENGER SEAT.  THERE IS AN ACTIVE RECALL FOR THE 2001 SAAB 9-3 FOR THE SAME EXACT PROBLEM. NO RECALL FOR THE 2001 SAAB 9-5.  *NM",
        "vin": "YS3EF48Z213"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/28/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134817,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DIRECT IGNITION CASSETTE FAILED ON TWO SEPARATE OCCASIONS, CAUSING CAR TO LOSE POWER AND STOP.   VEHICLE IS A SAAB 95, 2001, V6, SE WAGON, DATE OF SECOND INCIDENT IS BELOW.*JB",
        "vin": "YS3EF58ZX13"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2005",
        "dateOfIncident": "08/05/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131920,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION CASSETTE FAILED WHILE DRIVING CAR.  CAR SPEED WAS APPX 40 MPH, CHECK ENGINE LIGHT FLASHED AND I LOST ENGINE POWER.  PULLED CAR OVER AND FOUND BLACK SMOKE COMING OUT OF IGNITION CASSETTE.  CASSETTE WAS VERY HOT AND I WAS CONCERNED IT WOULD CATCH ON FIRE.  CAR WOULD NOT START THEREAFTER.    *NM",
        "vin": "YS3EF48ZX13"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2005",
        "dateOfIncident": "08/19/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130261,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN '01 9-5 AND HAVE HAD THE DI CASSETTES FAIL TWICE, ONCE CAUSING DAMAGE TO THE CATALYTIC CONVERTER.    THE FIRST DIC FAILURE WAS ON 8/19/2003 AT 62,453 MILES WITHOUT WARNING.  I WAS DRIVING 45 MPH AND THE VEHICLE STALLED WITHOUT WARNING AND WOULD NOT RESTART.   I HAD ONE DI CASSETTE AND 6 SPARK PLUGS REPLACED ON 8/20/2003.    ON 12/22/2003 (4 MONTHS LATER) WITH 64,080 MILES ON THE VEHICLE, WHILE DRIVING 60 MPH ON THE HIGHWAY, THE ENGINE LIGHT CAME ON AND SUDDENLY I WAS ONLY ABLE TO TRAVEL AROUND 20-30 MPH WITH MUCH SHAKING TO THE VEHICLE. THIS DIC FAILURE CAUSED THE CATALYTIC CONVERTER TO BURN UP. THE TECHNICIAN SAID THAT BOTH DI CASSETTES HAVE TO BE REPLACED WHEN ONE FAILS OR YOU RUN THE RISK OF RECURRENCE.   I HAD TWO DI CASSETTE, ONE CATALYTIC CONVERTER, ONE THERMOSTAT, AND SPARK PLUGS REPLACED ON 12/23/2003 (ONE DIC WAS CREDITED BECAUSE OF THE PREVIOUS WORK ON 8/20/2003).    I WAS ADVISED ON 7/22/2005 THAT I DO NOT HAVE THE LATEST SAAB 9-5 TRIONIC UPDATE THAT INCLUDES CHANGES TO PROTECT AGAINST DI CASSETTE FAILURES.  PERHAPS THERE WERE ERRORS IN THE OLD CODE THAT WERE CAUSING ALL THE DIC FAILURES, OR PERHAPS THIS IS AN UPDATE TO ADD FAIL-SAFES TO MINIMIZE THE CHANGE OF DIC FAILURES.",
        "vin": "YS3EF48Z713"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/12/2005",
        "dateOfIncident": "07/12/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128526,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2000 SAAB 9-3 AND A 2001 SAAB 9-5. I HAV HAD THE LUG NUTS REPLACED ON MY 9-5 TWICE DUE TO EXCESSIVE RUSTING. THE DEALER REPLACED THE NUTS WITH THE IDENTICAL TYPE. AFTER COMPLAINING ABOUT THESE CONTINUING TO RUST THEY SAID, JUST BRING THE CAR BACK AND THEY WILL CONTINUE TO REPLCE THEM. BOTH OF MY CARS ARE EXPERIENCING THE SAME PROBLEM. I HAVE SPOKEN WITH OTHER SAAB OWNERS WHO ARE FRUSTRATED BY THE SAME ISSUE. ALL WHERE CONCERNED THAT THE LUG NUTS WOULD WEAKEN OVER TIME AND FAIL CAUSING AN ACCIDENT. I AM LOOKING FOR A PERMANENT FIX WITH A LUG NUT THAT WILL NOT RUST / FAIL. NONE OF MY OTHER CARS (OTHER BRANDS) HAVE EVRY HAD THIS PROBLEM. CLEARLY THEY ARE EITHER MIS-MANUFACTERED OR NOT SPECED PROPERLY.  YOUR ASSISTANCE IS REQUESTED TO REMEDY THIS SITUATION, WITH A PERMANENT FIX.",
        "vin": "YS3ED48E213"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/01/2005",
        "dateOfIncident": "06/30/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127270,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING VEHICLE AT APPROXIMATELY 30 MPH WHEN IT SUDDENLY LOST POWER AND DECELERATED TO 3-5 MPH.  VEHICLE STALLED ABOUT 30 SECONDS LATER AND COULD NOT BE RESTARTED.  NO WARNING LIGHTS ILLUMINATED PRIOR TO THIS PROBLEM AND THE CAR SEEMED FINE IMMEDIATELY BEFORE POWER LOSS. I OBSERVED HEAVY SMOKE COMING FROM ENGINE COMPARTMENT AND DETECTED A STRONG BURNING ODOR.  VEHICLE WAS TOWED FROM SCENE TO LOCAL SAAB DEALER.  PROBLEM WAS DIAGONOSED AS A FAULTY DIRECT IGNITION CASSETE AND REPLACED WITH A NEW PART AT A COST OF $500.  DAMAGED PART IS AVAILABLE.",
        "vin": "YS3EF58Z513"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125167,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2001 95 SAAB AT APPROXIMATELY 40 MPH  THE ENGINE ABRUPTLY DIED IN TRAFFIC , THIS I FOUND OUT WAS DUE TO THE DI MODULE , IT APPEARS THAT MANY SAABS ARE HAVING THIS ISSUE ACCORDING TO MY DEALER, THEY HAVE HAD MANY FAILURES RECENTLY WITH NO WARNING(S) TO THE DRIVER. FORTUNATLEY I WAS ABLE TO PULL TO THE SIDE OF THE ROD TO AVOID ANY COLLISION. I STRONGLY FEEL THAT THIS SHOULD BE INVESTIGATED AS A SAFETY HAZARD AND A RECALL FOR ALL SAAB 9-5 VEHICLES BE GENERATED , AS I AM SURE MANY OF THESE INSTANCES ARE NOT REPORTED",
        "vin": "YS3EF48Z513"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "06/05/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124568,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ADD MY 2001 SAAB 9-5 WAGON, 6 CYL, TO THE LIST OF THOSE WITH DI CASSETTE FAILURE.  TRAVELING AT ABOUT 50 MPH ON A BEAUTIFUL JUNE MORNING THE ENGINE SUDDENLY LOST POWER.  WHEN I PULLED OFF THE ROAD, A PUFF OF SMOKE CAME FROM UNDER THE HOOD AND THERE WAS A DISTINCT BURNT ELECTRICAL SMELL WHEN I RAISED THE HOOD.  MY MECHANIC BELIEVES THE FAULTY DI CASSETTE MAY HAVE BEEN THE CAUSE FOR THE 2 PREVIOUS CATALYTIC CONVERTER FAILURES.  THE CAR HAS HAD OTHER ELECTRICAL IDIOSYNCRACIES, INCLUDING FREQUENT LIGHT BULB BURN OUTS, LOSS OF PIXELS ON THE MAIN DISPLAY SCREEN, SUDDEN EXTREME BRIGHTNESS OF ALL DISPLAY SCREENS, AND SPORADIC TRACTION CONTROL AND ABS FAILURE WARNINGS ON STARTING.  THE LATTER GENERALLY GOES AWAY WHEN THE CAR IS RESTARTED.  THE SAAB DEALER IN FLINT AND THE DEALER REP HAVE BEEN UNRESPONSIVE TO THE POINT OF NEGLIGENCE ON THE CAT FAILURES, LUCKILY I HAVE A GOOD AND HONEST LOCAL SAAB MECHANIC AT RALLYE IMPORTS IN MIDLAND.  SAAB SHOULD RECALL FOR THE DI CASSETTE AND SHOULD REIMBURSE FOR REPLACEMENT OF THE DISPLAY SCREEN.  IN 40 YEARS OF DRIVING, THIS IS THE MOST UNRELIABLE CAR I'VE EVER OWNED.",
        "vin": "YS3EF58Z113"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "05/28/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123890,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS ONLY 50,000 MILES. NO WARNING, NO ESCALATION, JUST SUDDEN. SID L.C.D. DISPLAY IS MISSING DOTS AND LINES CAUSING UNREADABLE DISPLAY. CHECKED SEVERAL \"SAAB\" DISCUSSION FORUMS AND APPERANTLY THIS IS A VERY COMMON PROBLEM WHICH DAMAGES THE VALUE OF A $40,000+ CAR. I AM AFRAID TO FIND OUT HOW MUCH THIS IS GOING TO COST TO REPAIR AFTER SEEING HOW MANY 9-5 OWNERS HAVE POSTED \"HOME REMEDY\" REPAIR METHODS FOR THIS. UPPER RADIATOR HOSE- THIRD ONE IN FIFTY THOUSAND MILES FROM MYSELF AND THE PREVIOUS OWNER WHOM I KNEW. THEY ALL BURST IN THE SAME PLACE. PRESSURE RELIEF CAP TESTED OK. THERE IS NO AFTERMARKET MANUFACTURER OF THIS HOSE THAT I KNOW OF TO FALL BACK ON FOR A POSSIBLY MORE RELIABLE PRODUCT. AND ALSO, I AGAIN AFTER SEARCHING THROUGH DISCUSSION FORUMS DISCOVERED I AM NOT THE ONLY ONE WITH THIS PROBLEM. HOOD BADGE. ENAMEL CRACKED AND FLACKED OFF OF THE HOOD BADGE ON THIS GARAGE KEPT CAR. LUCKILY I HEAR (BECAUSE I'M NOT THE ONLY ONE) THAT THESE ARE CHEAP.  MY CAR HAS LOST VALUE TO NO FAULT OF MINE AND I AM GOING TO HAVE TO HAVE THESE THINGS REPAIRED (ALTHOUGH THEY SHOULD NOT NEED TO BE) TO REGAIN THAT LOST VALUE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2005",
        "dateOfIncident": "05/18/2005",
        "fire": true,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121771,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  DRIVING AT APPROXIMATELY 40MPH, COMPLETE ENGINE FAILURE WITH OUT ANY WARNING.    2.  CAR COULD BREAK BUT POWER ASSISTED STEERING WAS NON FUNTIONAL, STEERING FUNCTIONED WITH OUT POWER ASSISTANCE, BUT VERY HARD TO SAFELY STEER VEHICLE.  3.  WAS ABLE TO MOVE CAR OFF ROAD INTO GRASS DITCH AWAY FROM REAR TRAFFIC.    4.  BLACK SMOKE CAME FROM DRIVERS SIDE OF ENGINE WITH SMELL OF BURNT PLASTIC AND RUBBER.  5. CERTIFIED SAAB MECHANIC DIAGNOSED CAR AND FOUND THAT THE IGNITION CASSETTE FAILED AND BURNED FROM WITHIN.  REPLACED IGNITION CASSETTE AT A COST OF $500.    6.  THERE ARE TWO IGNITION CASSETTES IN THE SAAB 95.  THE REMAINING UNIT HAS 60,000 MILES ON IT.  7.  IF THIS FAILURE TOOK PLACE ON A HIGHWAY IN FAST MOVING TRAFFIC, A TRAGIC ACCIDENT  COULD RESULT.  THERE IS NO WARNING OF THE FAILURE.  I HAD THREE CHILDREN IN THE VEHICLE.  8.  THERE WAS SOME MINOR SMOKE DAMAGE IN THE VEHICLE COMPARTMENT, THE FIRE WAS INTERNAL TO THE FAILED UNIT AND DID NOT SPREAD.  HOWEVER TOXIC LIKE FUMES FROM THE BURNING PLASTIC EXISTED IN THE PASSENGER COMPARTMENT CAUSING PASSENGERS TO COUGH.  9.  SAAB USA KNOWS OF THIS PROBLEM.  AFTER THE INCIDENT I REVIEWED MANY SAAB WEBSITES AND FOUND OTHER INCIDENTS OF COMPLETE ENGINE FALURE DUE TO THIS PROBLEM.  IT IS AN EXPENSIVE PROBLEM TO FIX.  IT ALSO POSES A MAJOR SAFETY ISSUE THAT COULD RESULT IN TRAGIC CONSEQUENCES.  10.  SAAB USA SHOULD FIX THIS PROBLEM AT NO COST TO THE CONSUMER.",
        "vin": "YS3EF58Z713"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2005",
        "dateOfIncident": "05/15/2005",
        "fire": true,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120960,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ADD YET ANOTHER DIRECT IGNITION CASSETTE FAILURE TO THIS LIST OF COMPLAINTS!!    DRIVING HOME FROM THE GROCERY STORE THE CAR QUIT IN THE MIDDLE OF A VERY BUSY INTERSECTION. SMOKE AND FIRE ENSUED.  WHERE IS THE RECALL??!?!?!?",
        "vin": "YS3ED45E013"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "10/15/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120099,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  VEHICLE STALLED ON THE HIGHWAY.  DRIVING AT ABOUT 50 MPH ,AND THE VEHICLE JUST STALLED AND STOPPED.  VEHICLE WAS TOWED TO THE DEALER, AND DEALER REPORTED THAT THE IGNITION DISCHARGE MODULE WAS DEFECTIVE.*AK",
        "vin": "YS3ED48E413"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2005",
        "dateOfIncident": "09/16/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117971,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 65MPH IN FAR LEFT LANE OF HIGHWAY AND SUDDEN LOSS OF SPEED--COULD ONLY GO 20-30 MPH FOR A FEW MINUTES BEFORE BURNING SMELL.  WAS ABLE TO COME TO RIGHT SHOULDER WHILE DODGING HIGHWAY TRAFFIC.  DIRECT IGNITION CASSETTE (DIC) FAILURE 1 OF 2 DIC'S IN 6 CYLINDER ENGINE).  SECOND VISIT REQUIRED FOR CHECK ENGINE LIGHT--WAS CATALYTIC CONVERTER. THIRD VISIT FOR ANOTHER CEL FOR SECOND DIC FAILURE.*AK",
        "vin": "YS3EF48Z113"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/26/2005",
        "dateOfIncident": "07/29/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112200,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A SAAB 9-5 WAGON, 2001.  WHEN IT WAS ONLY 3000 MILES OUT OF WARRANTY,  TWICE THE UNIT (ALARM SYSTEM) FAILED, PRESUMABLY BECAUSE IT HAD GOTTEN WET.  SAAB SAYS THAT WHEN THE AC DRAINS ARE BLOCKED, IT CAN BACK UP INTO THE PASSENGER COMPARTMENT OF THE VEHICLE, THUS CAUSING DAMAGE TO THE TWICE UNIT.  WHEN THE TWICE UNIT FAILS, IT BURNS OUT ALL 5 DOOR LOCK MOTORS, SINCE IT ERRONEOUSLY SENDS A CONSTANT ELECTRICAL SIGNAL TO THE MOTORS.    I SEE THIS PROBLEM AS A MAJOR DESIGN FLAW.  THE TWICE UNIT SHOULD NOT BE LOCATED UNDER THE DRIVER'S SEAT AND SHOULD NOT BE SUSCEPTIBLE TO WATER DAMAGE.  ALSO, THE AC DRAINS SHOULD NOT GET BLOCKED SO EASILY, CAUSING THOUSANDS OF DOLLARS WORTH OF DAMAGE.  AND THE FAILURE OF THE ALARM SYSTEM SHOULD NOT CAUSE THE DOOR LOCK MOTORS TO BURN OUT.  SAAB DOES NOT HAVE A VEHICLE SERVICE BULLETIN FOR THIS PROBLEM AND DOES NOT CONSIDER IT A MAJOR DEFECT OR DESIGN FLAW.  IT COSTS THE CONSUMER OVER $2500 TO REPAIR.  I HAVE HAD THE TWICE UNIT REPLACE, BECAUSE THE CAR WOULD NOT OPERATE WITHOUT A FAILED UNIT.  THE DOOR LOCKS HAVE NOT BEEN REPAIRED. *JB",
        "vin": "YS3ED58E213"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2005",
        "dateOfIncident": "01/05/2005",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106474,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ADD ME TO THE LIST OF DRIVERS STRANDED ON THE HIGHWAY WITH TOTAL LOSS OF POWER BECAUSE DIRECT IGNITION CASSETTE BURNT UP.  THE CAR ONLY HAD 62,000 MILES.  IT COST OVER $1,300 TO REPLACE.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2005",
        "dateOfIncident": "12/24/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105773,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE TIMES THE CAR, WHEN WARM WILL JUST WITHOUT WARNING.  ALL ELECTRICAL AND ENGINE SIMULTANEOUSLY QUITS LEAVING THE DRIVER TO DEAL WITH A SITUATION OF NO POWER BRAKES AND STEERING.  MULTIPLE TRIPS TO DEALER HAS RESULTED IN NO DIAGNOSIS AND GENEARL APATHY ABOUT THE PROBLEM.  THE CAR IS STIL UNDER WARRANLTY BUT IT OFFERS NO VALUE.  CLEAR SAFETY ISSUE AS THE LAST EVENT WAS AT A ELEMENARY SCHOOL WHERE A CHILD WAS ALMOST HIT AS THE LACK OF BRAKING AND STEERING POWER.  HOW CAN SUCH A SYMPTOM BETREATED WITHSUCH APATHY.  WE WILL BE FORCED TO SEL THE CAR FOR SAFETY REASONS AND NO RESPONSIBILITY IS TAKEN BY SAAB.  IRONICALLY WE HAD A SIMILAR PROBLEM WITH A 1994 9000.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2004",
        "dateOfIncident": "12/16/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104428,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A FAILED FUEL LINE RETAINING TAB AT THE FUEL PUMP ON MY 2001 SAAB 1995.  NHTSA RECALL # 04V557000 IS THE SAME PROBLEM I HAD WITH MY SAAB, BUT I OWN A 1995, NOT A 1993. THIS DEFECTIVE TAB ALLOWED GASOLINE TO SPRAY FREELY TO THE GROUND MUST BE CONSIDERED A SAFETY RELATYED ISSUE.*AK",
        "vin": "YS3EF48Z313"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "11/29/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100756,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WAS DRIVING ON HWY US 202 SB AND SUDDENLY THE CAR DIES WITHOUT ANY WARNING. SHE ALMOST GOT REAR ENDED BY THE TRAFFIC BEHIND HER. LUCKILY SHE WAS ABLE TO COAST TO THE SHOULDER.  HE CAR WAS TOWED TO A DEALER AND THEY REPLACED THE DIRECT IGNITION MODULE.*AK",
        "vin": "YS3EH48G913"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/15/2004",
        "dateOfIncident": "10/14/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095839,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE NO UNUSUAL EVENTS LEADING TO THE FAILURE.  MY WIFE WAS DRIVING A 2001 SAAB 9-5 STATION WAGON WHEN THE ENGINE SHUT DOWN AND SHE LOST ALL POWER.  THANKFULLY SHE WAS DRIVING ON A LOCAL ROAD AND MANAGED TO PULL OVER TO THE SIDE.  THE ENGINE WOULD NOT RESTART AND WE HAD IT TOWED TO A LOCAL GARAGE.  THE PERSON WHO TOWED SAID HE THOUGHT IT WAS A \"CRANK SENSOR\" THAT FAILED AND WHEN IT FAILS IT COMPLETELY SHUTS DOWN THE GAS TO THE ENGINE.  I HAD IT REPAIRED AND THE LOCAL MECHANIC CONFIRMED THAT IT WAS A SENSOR THAT HE CALLED DIRECT IGNITION WHICH INCLUDES THE CAM SENSOR .  MY CONCERN IS THAT IF IT HAPPENED ON A HIGHWAY AT 65 MPH, THERE WOULD HAVE BEEN A SERIOUS ACCIDENT.  I DON'T UNDERSTAND HOW A CAR CAN TOTALLY SHUT DOWN LIKE THAT WITHOUT ANY WARNING.  SAAB WOULD NOT TAKE MY COMPLAINT BECAUSE I DID NOT HAVE IT CHECKED AT THEIR GARAGE.  I THINK THAT POLICY, WHEN IT COMES TO SAFETY, IS LUDICROUS!  *AK",
        "vin": "YS3ED58E913"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/06/2004",
        "dateOfIncident": "10/03/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093700,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SAAB 9-5 HAS JUST UNDER 80,000 MILES AND HAS GONE THROUGH 2 CATALYTIC CONVERTERS.  IT ALSO BURNS OUT A LOT OF LIGHTS--HEADLIGHTS, TAIL LIGHTS, BRAKE LIGHTS, ETC. EVERY FEW MONTHS.   ALSO THE LED DISPLAY ON THE DASH HAS A LOT OF PIXELS OUT.  I'M WONDERING IF THE ELECTRICAL CURRENT IS PERHAPS A LITTLE TOO HIGH AND THAT COULD BE WHAT'S CAUSING ALL OF THE PROBLEMS?*AK",
        "vin": "YS3EF58Z113"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2004",
        "dateOfIncident": "06/09/2004",
        "fire": true,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075126,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXITING THE HIGHWAY ON AN OVERPASS BRIDGE THE ENGINE STOPPED WITHOUT WARNING AND WOULD NOT RESTART.  A FEW MOMENTS LATER SMOKE WAS VISIBLE FROM UNDER THE DIRECT IGNITION COVER AND SMALL FLAME WAS APPARENT.  THE FLAME WENT OUT AFTER A FEW MOMENTS.  HOWEVER, WE WERE LEFT STRANDED ON AN UNLIT BRIDGE OVERPASS THAT WAS UNDER CONSTRUCTION AT DUSK (WITH AN INFANT AND TODDLER).  SAAB ROADSIDE ASSISTANCE WAS CONTACTED (THEY SUGGESTED WE WAIT WITH THE VEHICLE FOR APPROXIMATELY AN HOUR UNTIL A TOW TRUCK COULD REACH US.)  THIS INCIDENT FOLLOWS A STRING OF MINOR ELECTICAL / ELECTRONIC \"BUGS\" IN WHICH ERRONEOUS SIGNALS ABOUT LIGHT FAILURES WERE DISPLAYED AND THE HEADLIGHTS FAILED TO TURN OFF WHEN THE KEY WAS REMOVED (THIS IS AN AUTOMATIC FEATURE ON SAABS).*AK",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/07/2004",
        "dateOfIncident": "06/07/2004",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074910,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A PRIOR RECALL ADDRESSED EXTREME CORROSION ON ALLOY WHEELS OF SAABS, IN THE VICINITY OF THE WHEEL BOLTS.  MY CONCERN IS THE EXTREME AMOUNT OF CORROSION OCCURING WHERE THE ALLOY WHEEL MEETS THE STEEL HUB.  THERE IS AN ORANGE COLORED POWDER, AND DEFORMATION OF THE INSIDE SMALLEST DIAMETER OF THE ALLOY WHEEL, WHERE IT OTUCHES THE HUB.  IS THIS A LOAD BEARING SURFACE?  IS THIS A CONCERN TO ANYONE?? *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2003",
        "dateOfIncident": "06/15/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036863,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN COMPLETE POWER FAILURE ON HIGHWAY! RELATIVLY NEW CAR 2001 WITH LOW MILES.TRACED TO BAD DIRECT IGNITION (DI) MODULE. IS A SAFETY HAZARD. NO INJURIES THANKFULLY.*AK",
        "vin": "YS3ED48E513"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2003",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10028525,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND BEGAN EXITING WHEN THE SAAB COMPLETELY DIED.  NO WARNING..ALL LIGHTS CAME ON AND THE CAR HAD NO POWER.  I COASTED DOWN THE RAMP.  WHAT WOULD HAVE HAPPENED HAD I BEEN IN THE LEFT LANE?  SAAB QUICKLY DIAGNOSED THIS AS A SHORTED OUT DIRECT IGNITION CASSETTE.  THEY REPAIRED IT RETURNED THE CAR.  IT NEEDED TO GO BACK AS IT HAD NO POWER.  THE CASSETTE'S FAILURE DESTROYED THE CATALYTIC CONVERTER AS WELL.  I HAVE NOW HEARD OF THIS INCIDENT THREE TIMES ON 2001 SAAB 9-5'S.  WHERE IS THE RECALL?*AK",
        "vin": "YS3ED55EX13"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2003",
        "dateOfIncident": "06/25/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025942,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE ON OUR 2001 SAAB 9.5 WAGON COMPLETELY SHUT DOWN AS WE EXITED I-10 NORTH OF SAN ANTONIO TEXAS. THE VEHICLE WAS AT A SPEED OF 65 MPH AND THE ENGINE JUST QUIT. WE WERE ABLE TO STOP THE CAR AT THE EXITS INTERSECTION BECAUSE OF ITS LENGTH OF ABOUT 1/4 MILE. THERE WAS NO WARNING, JUST NO ENGINE AND NO RESTART. THE DIRECT IGNITION CASSETTE WAS REPLACED. *AK",
        "vin": "YS3ED58E413"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2003",
        "dateOfIncident": "03/08/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019072,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING AT A HIGH SPEED ON THE BRONX RIVER PKWY AND MY PASSENGER REACHED INTO THE BACK SEAT.  HER LEG HIT THE KEY AND TURNED THE CAR OFF WHILE I WAS TRAVELING AT 60 MPH.  LUCKILY NOBODY WAS HURT.  THE CAR LOCKED UP AND I SHIFTED INTO NEUTRAL.  IT TOOK A FEW ANXIOUS MOMENTS/MINUTE OR TWO BEFORE I REALIZED WHAT HAD HAPPENED.  THIS HAPPENED TWO MORE TIMES WHEN I DECIDED TO CONTACT SAAB.  THEIR RESPONSE IN A LETTER IS AS FOLLOWS \" WE HAVE REVIEWED YOUR CONCERNS ABOUT THE PLACEMENT OF THE IGNITION SWITCH WITH GARDEN CITY SAAB, CORPORATE TECHNICIANS, AND FIELD REPRESENTATIVES.  SAAB CARS USA, INC. HAS DETERMINED YOUR VEHICLE IS OPERATING AS DESIGNED.\" !!!!!   SO, THEY HAVE DESIGNED A CAR TO SWITCH OFF WHILE DRIVING.  ALL I ASKED WAS TO BE LET OUT OF MY LEASE AS THIS IS A DANGEROUS CAR AND I NO LONGER FEEL SAFE DRIVING IN IT.  THEY, BY MEANS OF THIS LETTER, ARE REFUSING AND TELLING ME THEY HAVE NO ISSUE.  FYI THE 9.3 KEY IS BELOW THE SEAT, IN THE 9.5 THEY DECIDED TO RAISE IT ABOVE THE SEAT.  THIS IS PROBABLY WHY THEY HAVEN'T ADDRESSED IT YET.  I GUESS THEY ARE WAITING FOR SOMEONE TO GET REALLY HURT OR KILLED.  CAN ANY ONE HELP????  *JB",
        "vin": "YS3ED48E013"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2003",
        "dateOfIncident": "03/05/2003",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010313,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY WAS TOUCHED BY A BABY BOTTLE (VERY GENTLY). THE CAR SHUT OFF ON A BUSY EXPRESSWAY. LUCKILY NOBODY  WAS KILLED. I WENT TO THE CAR SERVICE AND GENTLY TAPPED THE KEY AND REPRODUCED THE KEY TURNING. THE SERVICE PERSON SAID THAT WAS NORMAL! PLEASE HELP BEFORE SOME ONE IS KILLED.*JB",
        "vin": "YS3EF48Z413"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2002",
        "dateOfIncident": "09/23/2002",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019772,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING SMOKE STARTING COMING FROM THE ENGINE.VEHICLE  STALLED OUT.HAD VEHICLE SERVICED,FIRE WAS A RESULT OF A PROBLEM WITH IGNITION CASSETTE.  NLM",
        "vin": "YS3ED58E213"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/05/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564966,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER PURCHASING VEHICLE, CONSUMER BEGAN TO EXPERIENCE FREQUENCY OF NOXIOUS FUMES COMING THROUGH THE INTERIOR OF THE VEHICLE FROM THE EXHAUST, WHEN CONSUMER TOOK THE VEHICLE TO THE DEALERSHIP TO REPORT THE PROBLEM HE WAS GIVEN A SERVICE BULLETIN WHICH IDENTIFIED THE EMISSION AS HYDROGEN SULFIDE AND THE BULLETIN FURTHER STATED THERE WAS NO WAY TO CORRECT THE PROBLEM, THE MANUFACTURER HAS ACKNOWLEDGED THE PROBLEM BUT HAS FAILED TO DISCLOSE THE INFORMATION.(LAWYER, JEFFREY MILLER ON BEHALF OF CLIENT)*JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563124,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS STALLED TWICE WITHOUT WARNING, ON THE SECOND OCCASION THE VEHICLE WAS ABLE TO BE RESTARTED, IN THE FIRST INSTANCE THE DEALER REPLACED THE D1 CASSETTE BECUSE IT MALFUNCTIONED BUT IN THE SECOND INSTANCE DIAGNOSTIC TEST DID NOT REVEAL A CAUSE FOR THE SHUT DOWN.  NLM",
        "vin": "YS3ED48E613"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/18/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563124,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ONSTAR SYSTEM FAILED.  NLM",
        "vin": "YS3ED48E613"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/18/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563124,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS STALLED TWICE WITHOUT WARNING, ON THE SECOND OCCASION THE VEHICLE WAS ABLE TO BE RESTARTED, IN THE FIRST INSTANCE THE DEALER REPLACED THE D1 CASSETTE BECUSE IT MALFUNCTIONED BUT IN THE SECOND INSTANCE DIAGNOSTIC TEST DID NOT REVEAL A CAUSE FOR THE SHUT DOWN.  NLM",
        "vin": "YS3ED48E613"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/18/2001",
        "dateOfIncident": "07/06/2001",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563124,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ONSTAR SYSTEM FAILED.  NLM",
        "vin": "YS3ED48E613"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2001",
        "dateOfIncident": "08/24/2001",
        "fire": false,
        "manufacturer": "SAAB CARS USA, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751097,
        "products": [
            {
                "manufacturer": "SAAB CARS USA, INC.",
                "productMake": "SAAB",
                "productModel": "9-5",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHITE SMOKE EXITS THE EXHAUST AFTER THE CAR HAS BEEN DRIVEN FOR A PERIOD OF TIME AND SITS, AND IS STARTED AGAIN.  SAAB CUSTOMER SERVICE FIRST TOLD ME A TSB WOULD BE ISSUED CONCERNING THE PROBLEM.  POQUET AUTO AND MORRIES SAAB BOTH STATED \"SOME\" SAABS HAVE A PROBLEM.  ACCORDING TO THE CSR, THE INJECTORS RELEASE TOO MUCH FUEL UPON STARTUP WHEN THE ENGINE IS COLD AND THAT CAUSES THE SMOKE.  WHEN THE SAAB IDLES, IT STOPS.  I WAS INFORMED THAT SAAB WAS WORKING ON THE PROBLEM AT FIRST.  NOW I AM TOLD, THERE IS NO PROBLEM.  THIS DEFECT SERIOUSLY DIMINISHES THE OVERALL VALUE OF A $40K CAR.*AK",
        "vin": "YS3EF48Z313"
    }
]