[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/12/2016",
        "dateOfIncident": "11/19/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846270,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUT OF A CURBSIDE PARKING PLACE ON A CITY STREET THE ENGINE STARTED RACING AND I COULD NOT CONTROL IT BY STOMPING ON THE BRAKES OR APPLYING THE EMERGENCY BRAKE. AS I WAS WRESTLING TO KEEP THE SURGING CAR UNDER CONTROL ANOTHER CAR CAME DRIVING BY AND WAS SIDESWIPED.  ON TWO PRIOR OCCASIONS I HAD TAKEN THIS CAR TO CHECK OUT THE SURGING WHICH TAKES PLACE WHEN THE CAR IS STARTING UP. THE DEALERSHIP AND THE INDEPENDENT REPAIR SHOP THAT I CONSULTED BOTH ASSURED ME THAT THEY HAD ADJUSTED THE IDLE AND THE CAR WAS NOW SAFE TO DRIVE.  BUT IS IT?",
        "vin": "JF1SF65511H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817377,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TEMPERATURE GETS COLD AND I TURN ON THE DEFROST TO WARM UP THE CAR WHILE PARKED I CAN SMELL GAS IN THE VEHICLE. IT GOES AWAY ONCE I START DRIVING. THIS IS A PROBLEM MANY SUBARU OWNERS HAVE BECAUSE A HOSE LOOSENS AND ALLOWS GAS TO LEAK OUT. ONCE THE CAR WARMS UP THE HOSE TIGHTENS AND THE PROBLEM GOES AWAY. THIS CAN POTENTIALLY CAUSE MY CAR TO CATCH ON FIRE.",
        "vin": "JF1SF635X1H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811361,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER THE OUTSIDE TEMPERATURE DROPS BELOW 20 DEGREES FAHRENHEIT, THERE IS A STRONG ODOR OF GASOLINE IN AND AROUND THE CAR.  WHEN TAKEN TO A MECHANIC, I WAS INFORMED THAT ALL OF THE HOSE CLAMPS ON THE FUEL LINES WERE LOOSE.  THEY WERE THEN TIGHTENED BUT EVERY TIME THE OUTSIDE TEMPERATURE DROPS, IT HAPPENS AGAIN.  IT HAPPENS WHETHER PARKED OUTSIDE OR IN A GARAGE.",
        "vin": "JF1SF65601H"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "12/01/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811362,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN DECEMBER, LESS THAN 3 MONTHS AFTER BUYING THE CAR USED, WHILE DRIVING I HEARD WHAT SOUNDED LIKE A FLAT TIRE.  I WAS ONLY A FEW HUNDRED FEET FROM A SERVICE STATION SO DROVE TO IT, BUT DRIVING THAT SHORT DISTANCE RUINED THE TIRE.  I HAD JUST PUT AIR IN THE TIRES, BUT DIDN'T KNOW ABOUT THE PROBLEM WITH ALUMINUM RIMS.  OFTEN, AFTER PUTTING AIR IN THE TIRES, THEY WOULD BE FLAT BY THE TIME I GOT HOME (JUST A FEW MILES).  THIS HAPPENED IN 2003.  I HAVE HAD TO HAD THE RIMS TAKEN OFF, GROUND/SMOOTHED OFF, THEN RESEALED EVERY YEAR OR TWO.     ANOTHER PROBLEM WITH THE TIRES/WHEELS IS THAT WHEN DRIVING THROUGH SNOW, THE SNOW PACKS ITSELF AROUND THE TIRES COMPLETELY FILLING THE SPACE THAT IS SUPPOSED TO BE BETWEEN THE TIRES AND THE WHEEL WELLS.  IF I DON'T MANUALLY REMOVE THE IMPACTED SNOW, IT GETS TO THE POINT WHERE THE WHEELS CANNOT BE TURNED.    BOTH OF THESE PROBLEMS, THE RIMS CORRODING BREAKING THE SEAL AND THE SNOW FILLING THE WHEEL WELLS, ARE SAFETY HAZARDS.",
        "vin": "JF1SF65601H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811363,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TURNING THE TURN SIGNALS ON, THE HEADLIGHTS GO OFF.   THIS HAPPENS FREQUENTLY, SUDDENLY PLUNGING YOU INTO DARKNESS.  THE HEADLIGHT COVERS ARE MADE OF INFERIOR PLASTIC THAT CLOUDS OVER WITH AGE, MAKING IT IMPOSSIBLE TO SEE AT NIGHT.  I HAD TO HAVE THEM REPLACED BECAUSE IT LOOKED AS IF THE HEADLIGHTS WERE NOT ON WHEN THEY WERE.",
        "vin": "JF1SF65601H"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "12/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811364,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT BELT DOES NOT RETRACT.  THEN IT GETS CLOSED IN THE DOOR BECAUSE IT HANGS LOOSE.    IN THE BACK SEAT, THE MIDDLE SEAT BELT HAS THE WRONG PART SO IT CANNOT BE LATCHED. BECAUSE OF THIS, I CANNOT SAFELY DRIVE WITH MORE THAN 2 PASSENGERS IN THE BACK SEAT.",
        "vin": "JF1SF65601H"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/21/2015",
        "dateOfIncident": "08/20/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10750361,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU FORESTER. WHILE DRIVING APPROXIMATELY 55 MPH AND ENGAGING THE BRAKE PEDAL, THE ABS MALFUNCTIONED AND ERRONEOUSLY ACTIVATED, WHICH PREVENTED THE BRAKES FROM STOPPING THE VEHICLE. THE DRIVER LOST CONTROL OF THE VEHICLE AND CRASHED INTO A CONCRETE MEDIAN, WHICH CAUSED SIGNIFICANT DAMAGE TO THE FRONT END OF THE VEHICLE. THE CONTACT FAILED TO INDICATE IF ANY INJURIES WERE SUSTAINED OR IF A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE ABS WAS FAULTY. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 194,503.",
        "vin": "JF1SF65571H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/19/2015",
        "dateOfIncident": "03/16/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10695453,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU FORESTER. WHILE DRIVING APPROXIMATELY 35 MPH, THE REAR END OF THE VEHICLE SWAYED FROM SIDE TO SIDE WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THE SUBFRAME NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "JF1SF65621H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2015",
        "dateOfIncident": "12/01/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680623,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU FORESTER SMELLS OF GAS INSIDE CAB WHEN WEATHER IS COLD. GAS LEAK VISIBLE FIRST TIME IT OCCURRED IN 2013. I TIGHTENED A CLAMP AND LEAK STOPPED. THIS WINTER I CANNOT SEE THE LEAK, BUT THE FUEL SMELL OVERTAKES MY CAR ABOUT 5 MINUTES INTO WARMING UP. EVENTUALLY IT DISSIPATES BUT I DO BELIEVE THAT THERE IS A LEAK SOMEWHERE IN THE VEHICLE. THIS SEEMS TO BE EPIDEMIC IN SUBARUS.   *TR",
        "vin": "JF1SF655X1H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/18/2014",
        "dateOfIncident": "11/19/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667117,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2001 SUBARU FORESTER. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 30 MPH, THE REAR CROSS MEMBER BECAME FRACTURED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE REAR CROSS MEMBER FAILED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 190,000.",
        "vin": "JF1SF63521G"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/09/2014",
        "dateOfIncident": "02/05/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563597,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES JUST DO NOT WORK ON SNOW, ICE (ABS DOES NOT KICK IN), AND THE WHEELS DO NOT TURN.  HAPPENED SEVERAL TIMES, RAN INTO AN INTERSECTION ON RED AT LEAST 4 TIMES.  ACCIDENT WAITING TO HAPPEN; NOTICED OTHER COMPLAINTS OF ACCIDENTS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2014",
        "dateOfIncident": "12/18/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562040,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER WE GET A STRONG FUEL SMELL. THE SMELL ENTERS THE CAR AND GIVES EVERYONE A HEADACHE. OTHER SUBARU OWNERS WE KNOW HAVE THE SAME PROBLEM. SUBARU KNOWS OF THIS PROBLEM BUT WILL NOT MAKE A RECALL. ESTIMATES FOR A FIX RUN ABOUT $300.  *TR",
        "vin": "JF1SF63571H"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "01/27/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561841,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS BELOW 25 DEGREES FAHRENHEIT, FUEL LINES AND RELATED COMPONENTS (INCLUDING RETAINING CLIPS AND FITTINGS) LEAK GASOLINE, CAUSING GAS FUMES TO ENTER THE PASSENGER COMPARTMENT. THIS PROBLEM IS SOMETIMES REFERRED TO AS A FUEL LINE SEEP. FUMES THEN ENTER THE PASSENGER COMPARTMENT VIA THE HEATING VENTILATION SYSTEM OR THROUGH GENERAL AMBIENT ENTRY. EVEN WHEN THE HEAT IN THE PASSENGER COMPARTMENT IS OFF, FUMES ENTER THE COMPARTMENT. THIS EXPOSES PASSENGERS TO HARMFUL CARBON MONOXIDE AND HYDROCARBONS AS WELL AS POSING A FIRE RISK. THIS HAPPENS AT ALL SPEEDS FROM STAND-STILL TO 75 MPH. IN MODERATE COLD (25-15 DEGREES FAHRENHEIT), THE LEAKING STOPS AFTER THE ENGINE HAS WARMED. IN COLDER TEMPERATURES, THE LEAKING CONTINUES NO MATTER HOW LONG I DRIVE THE CAR. THE PROBLEM CAN BE TEMPORARILY SOLVED BY TIGHTENING THE HOSE CLAMPS ON THE FUEL LINES, BUT WHEN THE TEMPERATURE DROPS AGAIN, THE HOSE CLAMPS MUST AGAIN BE TIGHTENED. SOME OF THE CLAMPS ARE UNDERNEATH ENGINE COMPONENTS THAT ARE DIFFICULT TO REMOVE, SO THE PROCESS IS VERY TIME INTENSIVE AND DOES NOT ALWAYS STOP THE FUMES. THIS IS A COMMONLY DISCUSSED TOPIC IN AUTOMOTIVE DISCUSSION BOARDS ONLINE. THEREFORE, I BELIEVE IT IS WIDESPREAD. HERE ARE SEVERAL EXAMPLES: HTTP://WWW.SUBARUFORESTER.ORG/VBULLETIN/F88/GASOLINE-ODOR-INSIDE-CABIN-45495/ HTTP://WWW.SUBARUFORESTER.ORG/VBULLETIN/F87/SMELL-GAS-COLD-STARTS-41319/ HTTP://COMMUNITY.CARTALK.COM/DISCUSSION/1986611/COLD-WEATHER-GAS-SMELL-2003-SUBARU-FORESTER.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2014",
        "dateOfIncident": "01/04/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10558346,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS BELOW 25 DEGREES FAHRENHEIT, FUEL LINES AND RELATED COMPONENTS (INCLUDING RETAINING CLIPS AND FITTINGS) LEAK GASOLINE, CAUSING GAS FUMES TO ENTER THE PASSENGER COMPARTMENT. THIS PROBLEM IS SOMETIMES REFERRED TO AS A FUEL LINE SEEP. FUMES THEN ENTER THE PASSENGER COMPARTMENT VIA THE HEATING VENTILATION SYSTEM OR THROUGH GENERAL AMBIENT ENTRY. EVEN WHEN THE HEAT IN THE PASSENGER COMPARTMENT IS OFF, FUMES ENTER THE COMPARTMENT. THIS EXPOSES PASSENGERS TO HARMFUL CARBON MONOXIDE AND HYDROCARBONS AS WELL AS POSING A FIRE RISK. BOTH MY HUSBAND AND I HAVE EXPERIENCED HEADACHES AND NAUSEA FROM THE FUMES SINCE WINTER 2012 WHEN OUR FORESTER FIRST STARTED LEAKING. THIS HAPPENS AT ALL SPEEDS FROM STAND-STILL TO 75 MPH.    IN MODERATE COLD (25-15 DEGREES FAHRENHEIT), THE LEAKING STOPS AFTER THE ENGINE HAS WARMED. IN COLDER TEMPERATURES, THE LEAKING CONTINUES NO MATTER HOW LONG I DRIVE THE CAR. THE PROBLEM CAN BE TEMPORARILY SOLVED BY TIGHTENING THE HOSE CLAMPS ON THE FUEL LINES, BUT WHEN THE TEMPERATURE DROPS AGAIN, THE HOSE CLAMPS MUST AGAIN BE TIGHTENED. SOME OF THE CLAMPS ARE UNDERNEATH ENGINE COMPONENTS THAT ARE DIFFICULT TO REMOVE, SO THE PROCESS IS VERY TIME INTENSIVE AND DOES NOT ALWAYS STOP THE FUMES. THIS IS A COMMONLY DISCUSSED TOPIC IN AUTOMOTIVE DISCUSSION BOARDS ONLINE. THEREFORE, I BELIEVE IT IS WIDESPREAD.    HERE ARE SEVERAL EXAMPLES:     HTTP://WWW.SUBARUFORESTER.ORG/VBULLETIN/F88/GASOLINE-ODOR-INSIDE-CABIN-45495/     HTTP://WWW.SUBARUFORESTER.ORG/VBULLETIN/F87/SMELL-GAS-COLD-STARTS-41319/    HTTP://COMMUNITY.CARTALK.COM/DISCUSSION/1986611/COLD-WEATHER-GAS-SMELL-2003-SUBARU-FORESTER.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/10/2013",
        "dateOfIncident": "09/27/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547521,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU FORESTER. THE CONTACT STATED THAT WHEN THE VEHICLE STOPPED MOVING, IT ACCELERATED WITHOUT THE ACCELERATOR BEING DEPRESSED INTERMITTENTLY AND WITHOUT ANY WARNING. THE CONTACT ALSO CRASHED INTO ANOTHER VEHICLE FIFTEEN FEET AWAY AND ALMOST HIT A PEDESTRIAN WHEN THE FAILURE OCCURRED.  THERE WERE NO INJURIES. A POLICE REPORT WAS NOT FILED. THE VEHICLE WAS TAKEN TO A DEALER AND THE MECHANIC STATED THAT THE PROBLEM WAS UNKNOWN. THE CONTACT RESEARCHED THE PROBLEM AND STATED THAT THE THROTTLE POSITION SENSOR CAUSED THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED. THE FAILURE MILEAGE WAS 78,000. THE CURRENT MILEAGE WAS 178,000.  UPDATED 1/7/14*CN",
        "vin": "JF1SF63541H"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/12/2013",
        "dateOfIncident": "06/10/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519550,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MONDAY AT 4:50 PM I WAS DRIVING N A SCHOOL ZONE AND REALIZED THAT I WAS HAVING TO RIDE MY BRAKES I ALSO THOUGHT THERE WAS SOME FUNNY NOISE FROM THE ENGINE. I ROLLED DOWN MY WINDOW AND COULDN'T HEAR ANY THING. AS I APPROACHED THE STOP SIGN MY CAR WOULD NOT STOP AND I PRESSED MY BRAKES ALL THE WAY DOWN. THE RPMS WENT ALL THE WAY INTO THE RED AND MY CAR CONTINUED ABOUT 4 TO 6 FEET WITH BRAKES ALL THE WAY DOWN. WHEN CAR FINELY CAME TO A STOP I PLACED IT IN PARK BECAUSE I THOUGHT THIS MY STOP MY CAR FROM GOING INTO GEAR AGAIN AND THE RPMS CONTINUED TO RISE MORE INTO THE RED. I WAS AFRAID AND PLACED IT IN DRIVE WITH FOOT ON BRAKE TO GET IT INTO THE PARKING LOT I TOOK A RIGHT. WHEN I HAD TO STOP IN THE LOT THE CAR WOULD NOT STOP AND THE RPMS WENT UP ALL THE WAY AS MY FOOT WAS ON THE BRAKE IT WENT ABOUT 3 EXTRA FEET BEFORE COMING TO A STOP. I PLACED IT IN PARK AND QUICKLY TURNED THE CAR OFF. I TURNED THE CAR ON TO SEE IF IT WOULD RESET BUT THE RPM WENT ALL THE WAY UP AGAIN. A MAN CLAIMING TO BE A MECHANIC LOOKED AT MY THROTTLES TO MAKE SURE THEY WERE NOT STUCK AND TOOK ONE FINGER AND TAPPED ON THE THROTTLE SENSOR. I STARTED THE CARE AGAIN AND THE RPMS WERE BACK TO A NORMAL AMOUNT. THE DEALERS HAVE NOT BEEN ABLE TO REPLICATE AND HAVE FOUND NO FAULT IN THE DIAGNOSTIC TESTING. CAUSE UNKNOWN. *TR",
        "vin": "JF1SF63541H"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2013",
        "dateOfIncident": "02/25/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10509215,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE FREEWAY AT NIGHT WHEN I HEARD A LOUD BANG NOISE AND LOOKED BEHIND ME AND SAW BLACK SMOKE AND HAD LOST ALL POWER, NO POWER STEERING, NO BRAKES AND NO LIGHTS I HAD TO TRY TO CROSS 2 LANES OF TRAFFIC TO GET MY CAR TO THE SHOULDER WHILE IT WAS DECELERATING. I GOT THE CAR TO THE SHOULDER AND NOTICED SMOKE COMING FROM THE ENGINE COMPARTMENT, AND WAS WORRIED OF A POSSIBLE FIRE.  I GOT OUT AND CALLED A TOW TRUCK AND HAD IT TOWED.  THE RESULT WAS A BLOWN HEAD GASKET THAT HAD BLOWN THE ROD THROUGH THE BACK PILLAR AND SPRAYED OIL OVER EVERYTHING CAUSING THE BATTERY TO SHORT OUT WHICH LED TO THE POWER LOSS.  THE WHOLE ENGINE ON THE CAR NEEDED TO BE REPLACED FOR THE SECOND TIME.  BOUGHT CAR WITH A REBUILT ENGINE FROM SAME PROBLEM AT 141,000 MILES.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2012",
        "dateOfIncident": "07/14/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468878,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING N ON I5 HIGHWAY WHEN CAR MADE NOISES, PULLED OVER & WOULD NOT START AGAIN. TOWED IN. WAS TOLD THAT ENGINE WAS DEAD. CAR HAD JUST BEEN SERVICED BY DEALER. HAD TO BUY NEW ENGINE. SUBARU WOULD NOT TAKE ANY RESPONSIBILITY. CAR HAD VERY LOW MILEAGE & WAS IN GOOD SHAPE. WHEN DOING RESEARCH, FOUND THAT THIS WAS AN ONGOING AND COMMON PROBLEM WITH ALL VEHICLES WITH 2.5L ENGINE AND DUE TO DEFECTIVE HEAD GASKET.  *TR",
        "vin": "JF1SF63571H"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/11/2011",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10391168,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY AT 75 MPH WITH CRUISE CONTROL SET.  TRIED TO CANCEL CRUISE CONTROL WITH STALK, IT DID NOT DISENGAGE.  TRIED REPEATEDLY, IT DID NOT DISENGAGE.  HIT THE BRAKES TO CANCEL CRUISE CONTROL, IT DID NOT DISENGAGE (BRAKES ONLY SLOWED CAR DOWN).  STEPPED ON THE CLUTCH TO CANCEL CRUISE CONTROL, IT DID NOT DISENGAGE.  WHEN I STEPPED ON THE CLUTCH AND SHIFTED INTO NEUTRAL, THE ENGINE REVVED ALL THE WAY TO REDLINE AND REMAINED THERE (MEANING THE CRUISE CONTROL WAS STILL ENGAGED).  COASTED TO SIDE OF ROAD WITH CLUTCH IN, ENGINE CONTINUED TO REV AT REDLINE... CONTINUED HITTING CANCEL ON THE STALK, EVENTUALLY REVS SETTLED DOWN TO IDLE.  MANUAL TRANSMISSION WAS NON-OPERATIONAL AFTER THIS INCIDENT.",
        "vin": "JF1SF63571G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/05/2011",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380845,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE IS IN REGARD TO MY 2001 SUBARU FORESTER, WHEN THE WEATHER COOLS OFF TO BELLOW 0, A STRONG SMELL OF GASOLINE DEVELOPS INSIDE THE PASSENGER CABIN. I HAVE SMALL KIDS AND ASIDE FROM A POSSIBILITY OF AND ENGINE FIRE AM ALSO WORRIED ABOUT IMPACT OF BREATHING THE STRONG GASOLINE FUMES IN THE CABIN.    FROM OTHER SUBARU OWNERS FEEDBACK (SEE BELLOW FROM SUBARU BLOG), THIS APPEARS TO BE WIDESPREAD ON THE FORESTER MODELS UP TO 2003 AND EVEN IN OTHER SUBARU MODELS, THE SUBARU DEALER AND OTHER MECHANICS HAVE INDICATED THE POSSIBILITY OF FUEL HOSE SHRINKAGE DURING COLD WEATHER AS THE CAUSE FOR SOME FUEL LEAKS IN THE ENGINE COMPARTMENT AND REPLACEMENT CAN BE EXPENSIVE WITHOUT GUARANTEEING IT WILL CORRECT THE CONDITION.    WHATEVER THE REASON MAY BE, THIS IS NOT AN ISOLATED CASE WHICH I THINK WARRANTS A FULL INVESTIGATION TO DETERMINE THE DEFECT AND FIND A CORRECTION TO BE PAID BY SUBARU.  I COUNT ON YOU FOR SOME HELP ON THIS.  THANK YOU.  *TR",
        "vin": "JF1SF65591H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/13/2011",
        "dateOfIncident": "08/03/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376491,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONE IN A 2001 SUBARU FORESTER AROUND 3PM ON A SUNNY AUGUST DAY IN 2010. HEADING SOUTH ON A 2 LANE ROAD IN TALLAHASSEE, FL, I APPROACHED A RED STOPLIGHT AHEAD WITH TWO VEHICLES STOPPED IN FRONT OF ME. AS I STARTED TO BRAKE, THE VEHICLE ABRUPTLY ACCELERATED, I SWERVED INTO THE ONCOMING LANE TO AVOID THE STOPPED CARS IN MY LANE AS THE VEHICLE CONTINUED TO ACCELERATE TO ABOUT 40 MILES/HR. A VEHICLE HAD JUST MADE A TURN AT THE LIGHT INTERSECTION INTO THE ONCOMING LANE, SO I HAD TO STEER THE FORESTER  TO THE LEFT, UP OVER A CURB ONTO AN EMBANKMENT TO GET AROUND THE ONCOMING CAR TO AVOID A HEAD ON COLLISION, THEN STEER BACK ONTO THE ROAD TO AVOID A TELEPHONE POLE. THE VEHICLE CAREENED BACK ACROSS INTO THE ORIGINAL LANE I STARTED IN WHILE THE TRAFFIC WAS STILL STOPPED AT THE LIGHT. I PASSED IN FRONT OF THE STOPPED CARS AND MISSED THEM .  AT THAT POINT I SMACKED HARD AGAINST THE OTHER CURVE IN THE ORIGINAL SOUTHBOUND LANE I WAS TRAVELING IN AND THE VEHICLE CAME TO REST. THREE OF FOUR TIRES WERE DAMAGED FROM IMPACT WITH THE CURBS ON EITHER SIDE OF THE ROAD AND HAD TO BE REPLACED. NO ONE WAS INJURED AND THERE WAS NO PROPERTY DAMAGE OTHER THAN TO THE THREE TIRES ON MY VEHICLE AND THE FRONT LEFT WHEEL ASSEMBLY. I HAD PURCHASED THIS CAR WITH 98,000 MILES ON IT, HAD  EXTENSIVE REPAIRS DONE ON IT  AND HAD DRIVEN IT ABOUT 6,000 MILES BEFORE THIS OCCURRENCE. I HAD NOTED NO INCIDENCE OF  ABRUPT ACCELERATION WITH THIS VEHICLE PRIOR TO THIS OCCURRENCE, NOR IN THE ADDITIONAL 5,000 MILES I HAVE DRIVEN IT SINCE. I TOOK THE VEHICLE TO THE SUBARU DEALERSHIP WHO SENT ME TO A BODY SHOP. I TOOK THE REPAIRED VEHICLE BACK TO THE DEALERSHIP AND ASKED THEM TO CHECK THE ACCELERATOR. THEY SAID NOTHING WAS WRONG WITH THE ACCELERATOR PEDAL OR LINKAGE SYSTEM.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "12/23/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372476,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 STANDARD TRANSMISSION SUBARU FORRESTER FAILED TO RELEASE CRUISE CONTROL WHEN BRAKE WAS USED. I HAD DIFFICULTY, BUT WAS ABLE TO GAIN CONTROL AND SHIFT INTO NEUTRAL ON THE SHOULDER.  AFTERWARD, BRAKES SEEMED TO WORK FINE. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/19/2010",
        "dateOfIncident": "07/19/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344126,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCELERATING WHILE BRAKES ENGAGED AND FOOT OFF GAS PEDAL. HIT ANOTHER CAR AND BRICK WALL WHILE USING THE EMERGENCY BRAKE. ENGINE AFTERWARD REVVED UP SO FAST WHEN CAR TURNED ON SEVERAL TIMES. RETURNED TO NORMAL. DROVE CARE TO DEALER. NOTHING WRONG CAN BE FOUND. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/15/2010",
        "dateOfIncident": "06/14/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336399,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU FORESTER. THE CONTACT STATED THAT ON JUNE 14, 2010, WHILE AT A STOP SIGN, THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO THE VEHICLE IN FRONT OF HER. THERE WERE NO INJURIES BUT THE VEHICLE SUSTAINED MINOR DAMAGES. NO POLICE REPORT WAS  FILED. THE VEHICLE WAS TAKEN TO A REPAIR CENTER WHERE IT WAS CURRENTLY BEING INSPECTED. THE CONTACT HAD NOT CALLED THE DEALERSHIP OR THE MANUFACTURER AT THE TIME OF THE COMPLAINT. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 150,000.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/06/2009",
        "dateOfIncident": "09/22/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286535,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU FORESTER. WHILE THE CONTACT WAS EXAMINING HER VEHICLE, SHE NOTICED THAT THE CHECK ENGINE LIGHT WAS ILLUMINATED. A LOCAL MECHANIC STATED THAT THE KNOCK SENSOR HAD TO BE REPLACED. THE CONTACT ALSO NOTICED THAT THE INSIDE OF HER VEHICLE BECAME VERY WARM WHILE SHE WAS DRIVING. THE CURRENT AND FAILURE MILEAGES WERE 99000.",
        "vin": "JF1SF65671H"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2009",
        "dateOfIncident": "01/10/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253966,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE ARE TWO ORGANIC TUBES THAT CARRY FUEL, ABOVE THE ENGINE.  IN COLD WEATHER, THEY LEAK WHERE CLAMPED TO METAL TUBES AND FITTINGS.  THE FUEL LEAKS ONTO THE ENGINE.  THE INDICATION IS A SMELL OF GASOLINE IN THE PASSENGER COMPARTMENT. *TR",
        "vin": "JF1SF65531H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/08/2008",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251058,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU FORESTER 87500 MILES ON IT.  12/2007 HAD REAR WHEEL BEARINGS REPLACED AT INDEPENDENT SHOP.  NOW IT IS 12/2008 WITH ONLY 92K MILES ON IT, AND THE DRIVER'S SIDE REAR WHEEL BEARING IS HOWLING LIKE A BANSHEE.  PASSENGER REAR WHEEL BEARING GETTING LOUDER BUT NOT AS BAD.  MIGHT HAVE DEALER REPLACE THEM THIS TIME AND CHECK HUB ASSEMBLY FOR DAMAGE ETC. *TR",
        "vin": "JF1SF63531G"
    },
    {
        "components": "VISIBILITY",
        "crash": true,
        "dateComplaintFiled": "07/01/2008",
        "dateOfIncident": "01/09/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10232891,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 SUBARU FORESTER WITH A DEFECTIVE MAGNA DONNELLY AUTO DIMMING REARVIEW MIRROR.  THIS MIRROR IS IN A NUMBER OF DIFFERENT MAKES OF CARS, AND HAS BROADLY FAILED, IN SOME INSTANCES LEAKING (EVEN BURSTING) CAUSTIC CONTENTS THAT HAVE DISSOLVED PLASTIC COMPONENTS IN CARS.  SOME CERTIFIED AUTO MANUFACTURERS MECHANICS HAVE STATED TO OWNERS OF FAILED MIRRORS THAT ONE CONSTITUENT OF THE PATENTED \"A72 ELECTROLYTE\" IN THE MIRROR IS A FORM OF MERCURY.  THE MSDS THAT I REQUESTED FROM MAGNA DONNELLY LISTS 7 OF 8 CONSTITUENTS AS TRADE SECRETS, AND HENCE NO DETAIL.  THE FACT REMAINS THAT THIS MIRROR FAILS WELL BEFORE THE AUTO HAS AGED.  IT HAS BEEN KNOWN TO SPEW CAUSTIC CONTENTS.  IT IS A SAFETY DEVICE THAT FAILS AND SHOULD BE RECALLED.  A SIMPLE LOOK AT TWO ONLINE FORUMS DEALING WITH THIS DEVICE CAN BE FOUND AT:  WWW.ACURAMDX.ORG/FORUMS/SHOWTHREAD.PHP?THREADID=25607 AND HTTP://WWW.ACURAMDX.ORG/FORUMS/SHOWTHREAD.PHP?S=&THREADID=19282&HIGHLIGHT=MIRROR+BLOB.  MAGNA DONNELLY DID REPLACE THESE MIRRORS AT NO COST UP UNTIL LAST YEAR.  THEY NO LONGER DO.  BUT MORE IMPORTANTLY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/29/2008",
        "dateOfIncident": "08/23/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219746,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT MY 2001 FORESTER USED WITH APPROXIMATELY 64,000 MILES ON IT. AFTER OWNING IT FOR ABOUT 6 MONTHS NOTICED HESITANCY WHEN TRYING TO PULL OUT. SLOWLY STARTED GETTING WORSE. CAR WOULD SIT FOR ABOUT 10 TO 15 SECONDS AFTER BEING PUT INTO DRIVE BEFORE ENGAGING AND IF FOOT IS NOT ON BRAKE, HAS A HARSH ENGAGEMENT (WHIPLASH TYPE THING WHERE IT THROWS YOU FORWARD). SO, AFTER MUCH RESEARCH AND FINDING OUT THAT THERE ARE PROBABLY 1000S OF OTHER FORESTER OWNERS WITH THE EXACT SAME PROBLEM, I CONTACTED SUBARU OF AMERICA WHO OF COURSE TOLD ME TO TAKE IT TO MY LOCAL DEALER AND IF THEY FOUND ANYTHING WRONG, SUBARU MIGHT GIVE ME SOME GOODWILL ASSISTANCE. WELL AS THEY FOUND THAT THE TRANSMISSION FILTER WAS NOT A SUBARU BRAND AND NOR WAS THE FLUID, THEY WANTED TO CHANGE IT AND THEN RUN A DIAGNOSTIC TEST, SAYING THAT MAYBE THAT OTHER FILTER CAUSED THE PROBLEM.  I TRIED EXPLAINING THAT THE REASON WE CHANGED IT WAS BECAUSE OF THE PROBLEM,  NOT WHAT CAUSED THE PROBLEM. WE CHANGED IT TO SEE IF THAT WOULD HELP AND OF COURSE IT DIDN'T. THEN, OF COURSE, SUBARU WOULD NOT DO ANYTHING AS I DID NOT WANT TO HAVE TO PAY FOR THEM TO CHANGE THE FILTER AND FLUID ONLY TO CHARGE ME FOR THAT AND THEN TELL ME THAT THERE WAS NOTHING WRONG WITH IT. I POINTED OUT ALL THE OTHER COMPLAINTS ABOUT THE EXACT SAME PROBLEMS, BUT THEY INSIST IT IS NOT A DEFECT, WHEN APPARENTLY THERE IS A MAJOR PROBLEM WITH THESE TRANSMISSIONS.  *TR",
        "vin": "JF1SF65541H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/18/2007",
        "dateOfIncident": "12/18/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212246,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT REAR WHEEL BEARING HAS BEEN REPLACED TWICE.  RIGHT REAR WHEEL BEARING NEEDS TO BE REPLACED NOW.  DEALER SERVICE PERSONNEL TOLD ME THAT THE WHEEL WAS ABOUT TO FALL OFF OF THE VEHICLE THE FIRST TIME I HAD THE BEARING REPLACED.  *TR",
        "vin": "JF1SF63541G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/16/2007",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212011,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "01 FORESTER WAS BOUGHT FROM VAN BORTEL SUBARU ON 4/24/04 COMING OFF A LEASE WITH 29,000 MILES. I HAD TO NEGOTIATE THAT DEALER TO CHECK CAR FOR SERVICE BULLETINS AND RECALLS AND ASKED FOR THE 30K MAINTENANCE TO BE COMPLETED. MINIMAL WORK WAS COMPLETED AND SUBSEQUENTLY MAJOR PROBLEMS SUCH DUE TO DEFECTIVE PARTS SUCH AS HEAD GASKET FAILURE AND WHEEL BEARING FAILURE HAD TO BE DONE. VEHICLE HAS BEEN REGULARLY SERVICED AT DEALER AND COMPLAINTS OF ROAD NOISE HAD BEEN SHARED WITH DEALER. TIRES WERE REPLACED AT OWNER EXPENSE IN RESPONSE. HEAD GASKET COST WAS COVERED BY WARRANTY BUT ONE REAR WHEEL BEARING ($400) WAS NOT COVERED AND PAID BY OWNER. THESE PROBLEMS HAVE BEEN WELL DOCUMENTED BY OTHER OWNERS SINCE 2002 AND NEITHER SUBARU NOR VAN BORTEL INFORMED OWNERS OF PROBLEMS. AS A RESULT THEY PLACED OWNERS AT RISK OF SERIOUS MECHANICAL FAILURE AND INCREASED COST OF REPLACEMENT OF ENTIRE REAR AXEL AND POSSIBLE SERIOUS ACCIDENT/INJURY.  *TR",
        "vin": "JF1SF65561H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/26/2007",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209981,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT LENSES ARE TOO CLOUDED OVER TO USE SAFELY. REGULAR EXTERIOR MAINTENANCE (WASHING, WAXING WHERE INDICATED) HAS NEVER MADE A DIFFERENCE MATERIALS USED WERE SUB-STANDARD & DID NOT EVEN OUTLIVE OUTLIVE THE ORIGINAL MFR. WARRANTY.  *TR",
        "vin": "JF1SF63591G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/13/2007",
        "dateOfIncident": "09/10/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10202883,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU FORESTER.  WHILE DRIVING 5 MPH WITH THE CONTACT'S FOOT OFF THE ACCELERATOR PEDAL, THE VEHICLE SUDDENLY ACCELERATED TO 30 MPH.  SHE DEPRESSED THE BRAKE PEDAL, HOWEVER, THE VEHICLE CONTINUED TO ACCELERATE AND CRASHED INTO A TREE.  THE VEHICLE WAS DESTROYED.  THE DRIVER SUSTAINED BRUISES FROM THE SEAT BELT.  THE CURRENT AND FAILURE MILEAGES WERE 64,000.",
        "vin": "JF1SF63571H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/18/2007",
        "dateOfIncident": "08/18/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200005,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "64669AC260MU",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AS SOON AS THE CAR AGED TO 75,000 MILES I STARTED HAVING PROBLEMS.  THE CLOSEST SUBARU DEALER IS 51 MILES AWAY FROM MY CURRENT LOCATION. NOT EASY TO GET TO. MY IN TOWN MECHANIC HAS ONLY BEEN TRYING TO TREAT THE SYMPTOMS.  I'VE HAD THERMOSTAT, HEATER CORE, VALVE COVERS, SPARK PLUG WIRES REPLACED, HOSES REPLACED, AND STILL HAS NOT FIXED THE ISSUE.      I TOOK IT TO A SUBARU DEALER THIS MORNING, STILL OVERHEATING, AND HE SAYS I HAVE A BLOWN HEAD GASKET AND I WILL HAVE TO REPLACE VALVE COVERS, WIRES, OBVIOUSLY THE HEAD GASKET AND POSSIBLY A FEW OTHER PARTS.  LABOR ALONE IS A 1000 DOLLARS.      SUBARU SHOULD TAKE FULL RESPONSIBILITY FOR THIS AS I AM NOTICING THAT THERE ARE SEVERAL POSTS AND SEVERAL WEBSITES WITH OWNERS HAVING THE EXACT SAME ISSUES.      I REALLY HAVE ENJOYED OWNING A SUBARU UP UNTIL NOW. I DON'T KNOW WHAT ELSE CAN BE DONE. *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/18/2007",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188285,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED USED \"AS IS\" 02/01/2007 FROM DEALER THAT LISTED 2001 FORESTER AT  $9800.00, THEN WHEN I WENT TO BUY THEY REDUCED COST TO $5200.00 JUST TO  MOVE THEIR USED VEHICLES OFF LOT.  THEY DID NOT DISCLOSE ANY PROBLEMS AND SAID FORESTER WENT THOROUGH VEHICLE  INSPECTION AND VEHICLE WAS IN EXCELLENT CONDITION MECHANICALLY.  (1) FAILURE OF EMISSION SYSTEM IE,OXYGEN SENSORS (2) FRONT AND REAR LOCATIONS. SECOND DAY AFTER PURCHASE. (2) FAILURE OF LEFT FRONT CV JOINTS (2) AND AXLE. THIRD DAY AFTER PURCHASE. (3) AUTOMATIC TRANSMISSION WOULD ONLY GO INTO REVERSE AND NOT ANY DRIVE OR  FORWARD GEARS WHILE COMING HOME FROM WORK ON \"5TH\" DAY OF OWNERSHIP AND  THIS BEING THE \"THIRD\" TIME TO HAVE FORESTER TOWED TO SERVICE CENTER.      I CONTACTED THE MULTI-FRANCHISED (INCLUDING SUBARU) FOR HELP AND INFORMATION.  THEY RESPONDED THE FORESTER WAS SOLD AS IS AND DIDN'T CARE EVEN IF THE VEHICLE FELL IN HALF ONCE IT LEAVES THEIR LOT.      MY NEXT STEP IS I CONTACTED SUBARU AMERICA OF MY VEHICLE AND DEALER PROBLEMS BY EMAIL. I RECEIVED RETURNS FROM THEM WITH VAUGE AT BEST REASONS BUT NO RECALL  OR TSB INFORMATION. THEY GAVE ME A CASE NUMBER AND WAITING FOR A PERSONAL  REPLY VIA POSTAL MAIL OR TELEPHONE CALL.  IN TOTAL I HAVE BEEN TOWED 3 TIMES, TWO DIFFERENT SERVICE CENTERS AND CERTIFIED.  MECHANICS. PAID $300. FOR FRONT AXLE, $429.00 FOR EMMISISON REPAIRS, $150 FOR A TRANSMISSION FLUSH,FILTERS (2 ONE INTERNAL ONE EXTERNAL SPIN-ON)  AND SUBARU TRANSMISSION.  CONDITONER. FINALLY AFTER ALL THAT I STILL HAVE THE TRANSMISSION PROBLEM AND RARELY USE IT  BECAUSE I AM AFFRAID TO DRIVE IT WITH MY TWO BABIES I HAVE, I USE MY FATHERS CAR.  CAN SOMEONE HELP ME PLEASE.  *AK",
        "vin": "JF1SF63571H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/29/2006",
        "dateOfIncident": "10/04/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172101,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWN HEAD GASKETS, CRACKED SHORT BLOCK, AND O2 SENSORS ALL REPLACED AT AROUND 100,000 MILES.  O2 SENSORS REPLACED TWICE.  UNKNOWN WHEN PROBLEM FIRST OCCURRED AND WHICH WAS CAUSE AND WHICH EFFECT.  HEAD GASKETS SHOULD BE COVERED BY PROGRAM WWP-99, BUT SUBARU WILL NOT CONSIDER NOR DISCUSS ANY ACCOMMODATION.  *NM",
        "vin": "JF1SF65501H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/04/2006",
        "dateOfIncident": "07/30/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164509,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU 2001 FORESTER, 71,440 MILES, ONE OWNER, PURCHASED 04/2000.  WHILE DRIVING, GRINDING NOISE FROM REAR OF VEHICLE.  TALKED WITH SUBARU AND TWO INDEPENDENT GARAGES, AND ALL WITH SAME CONCLUSION - DEFECTIVE WHEEL BEARING.  ALL STATED THIS WAS/IS A KNOWN PROBLEM WITH THIS VEHICLE BECAUSE PART WAS NOT STRONG ENOUGH.  SUBARU MECHANIC DIAGNOSED RIGHT REAR WHEEL BEARING IS PROBLEM AND IT WAS REPLACED.  ASKED FOR AND RECEIVED REPLACED PART.  *NM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2006",
        "dateOfIncident": "07/26/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164048,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1)  GRINDING NOISE WHEN ACCELERATING ESPECIALLY GOING UP HILL.  2) 4WD DIFFERENTIAL FAILURE  3) DIFFERENTIAL CAN ONLY BE REPLACED AS PART OF THE WHOLE TRANSMISSION.  4) VEHICLE ONLY HAS 86300 MILES, SEEMS LIKE A TRANSMISSION/DIFFERENTIAL SHOULD LAST LONGER THAN THAT.  COST FOR REPLACEMENT OVER $3,700.  *NM",
        "vin": "JF1SF65631H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/03/2006",
        "dateOfIncident": "06/14/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10161301,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS BACKING OUT OF A PARKING PLACE. MY 2001 SUBARU FORESTER SUDDENLY ACCELERATED.  I HAD NOT PUT MY FOOT ON THE ACCELERATOR PEDAL.  I COULD NOT MAKE THE CAR STOP WITH THE BRAKE ALTHOUGH I PRACTICALLY STOOD ON THE BRAKE.  MY RIGHT LEG WAS INJURED BECAUSE THE LIGAMENT WERE STRAINED BY THE FORCE I USED TO TRY TO STOP THE CAR.   THE CAR SMASHED INTO ANOTHER CAR IN THE PARKING LOT AND SUDDENLY CAME TO A STOP. SOMETHING SIMILAR HAPPENED IN NOVEMBER, 2005 WHEN THE CAR SUDDENLY SURGED FORWARD AND SMASHED INTO ANOTHER CAR AS I WAS COMING TO A STOP.  I ASSUMED THEN THAT I HAD MADE A MISTAKE, BUT NOW, WITH THIS SECOND INCIDENT, I THINK THERE IS SOMETHING WRONG WITH THE CAR. THE CAR IS CURRENTLY BEING REPAIRED.  I HAVE ASKED THE MECHANIC TO CHECK THE ACCELERATOR.  *NM",
        "vin": "JF1SF63521H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/28/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161598,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER 2001 FORESTER ACCELERATOR PEDAL STICKS.  *TS  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/30/2006",
        "dateOfIncident": "05/30/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158526,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I SHIFT INTO DRIVE (ANY OF THE DRIVE GEARS), THE CAR HESITATES TO ENGAGE (MOVE FORWARD) FOR ANYWHERE BETWEEN 2-3 SECONDS AND UP TO 1 MINUTE.  THIS DOES NOT HAPPEN WHEN SHIFTED INTO REVERSE.  THE WAIT TIME IS RANDOM SO I NEVER KNOW HOW LONG IT WILL TAKE.  THE OTHER DAY, I HAD TO REVERSE TO GET OUT OF A PARKING SPOT AND THEN THE CAR WOULDN'T ENGAGE INTO DRIVE FOR ANOTHER 45 SECONDS AND I ALMOST GOT REAR ENDED BY A CAR COMING UP BEHIND ME.  THIS IS A SAFETY ISSUE!  I'VE READ ABOUT HUNDREDS OF OTHER COMPLAINTS BY OTHER SUBARU FORESTER (1999 - 2001) OWNERS ON-LINE.  THIS LEADS ME TO BELIEVE THAT IT IS A MANUFACTURER'S DEFECT.  I SPOKE WITH BOTH THE DEALER AND SUBARU REPRESENTATIVE AND THEY WON'T COVER THE COST OF A NEW TRANSMISSION BECAUSE I AM OUT OF WARRANTY.  I THINK THIS IS UNACCEPTABLE AND AM LOOKING INTO THE LEGAL IMPLICATIONS FURTHER. *JB",
        "vin": "JF1SF65641H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/28/2006",
        "dateOfIncident": "05/12/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158477,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF REAR WHEEL BEARINGS.  *NM",
        "vin": "JF1SF635X1H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/20/2006",
        "dateOfIncident": "03/08/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10153213,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTHER WAS BACKING HER 2001 SUBARU FORESTER INTO HER PARKING SPACE AT WORK, WHEN IT SUDDENLY ACCELERATED IN REVERSE.  THE CAR CONTINUED OVER A PARKING MEDIAN, OVER A GUARD RAIL AROUND THE PARKING LOT, THROUGH A ROW OF BUSHES BEFORE EVENTUALLY STRIKING A TELEPHONE POLE AND STOPPING.   *JB",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/26/2005",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146069,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL TIMES, DRIVER'S SEAT RECLINES ALL THE WAY BACK UNEXPECTEDLY. WITH A CAR SEAT BEHIND THE DRIVER, THE CAR SEAT RECLINES DIRECTLY INTO THE CHILD SAFETY SEAT.  *NM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2005",
        "dateOfIncident": "12/15/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145879,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AROUND 100K MILES MY 2001 SUBARU FORESTER (MANUAL TRANSMISSION) EXPERIENCED SEVERE HESITATION AND MISSING (BUCKING) IN ALL GEARS, RESULTING IN A LOSS OF POWER.  THE TIMING BELT WAS REPLACED AND MECHANIC ASSURED ME EVERYTHING WITH THE TIMING BELT AND CLUTCH WAS OK.  WITHIN A FEW DAYS THE CAR EXPERIENCED THE SAME SEVERE JOLTING AS BEFORE.   IN LOWER GEARS CAR ACCELERATES EXTREMELY SLOWLY, AND OFTEN STALLS AFTER THE SEVERE SHAKING.  THIS IS A POTENTIALLY VERY DANGEROUS PROBLEM; WHILE TAKING A LEFT OUT OF MY NEIGHBORHOOD, MY CAR BEGAN TO SHAKE VIOLENTLY AND STALLED, AND I WAS ALMOST STRUCK BY ONCOMING TRAFFIC.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/25/2005",
        "dateOfIncident": "10/25/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140722,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWN HEAD GASKET @ 75,000 MILES (OIL LEAKS).  NOT COVERED BY SERVICE PROGRAM WWP-99.  *NM",
        "vin": "JF1SF65611H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/03/2005",
        "dateOfIncident": "01/24/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135252,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN THREE SUBARU VEHICLES ONE OF WHICH IS A 2001 FORESTER-L. I HAVE HAD TO REPLACE THE R/R WHEEL BEARING ON MY FORESTER TWICE @ 28017 MILES AND AT 75375 MILES. THE FIRST INCIDENT WAS COVERED UNDER THE VEHICLE WARRANTY. I WAS REIMBURSED BY SUBARU FOR HALF THE COST FOR SECOND INCIDENT. IN DISCUSSION WITH OTHER FORESTER OWNERS AND LOCAL MECHANICS THIS APPEARS TO BE A RECURRING PROBLEM (PLEASE SEE VQ 7510621 AND VQ 7510621). I HAVE ALSO HAD TO REPLACE BOTH FRONT WHEEL BEARINGS ON MY 1998 LEGACY L WAGON, BUT IN FAIRNESS THIS WAS AT 112, 000 MI. MY FEAR HERE IS THAT I WILL ALSO INCUR THIS REPAIR ON MY 2002 IMPREZA. *JB",
        "vin": "JF1SF63591G"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/05/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10131665,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE WAS DRIVING OUR 2001 SUBARU FORESTER.  SHE GOT TOO CLOSE TO EDGE OF PAVED SURFACE ON NARROW SECONDARY ROAD AND TIRES DROPPED OFF EDGE.  INSTEAD OF THERE BEING THE REQUIRED FLAT SHOULDER OR BERM, THERE IS A 4+ INCH DROP AT THAT POINT.  THE DROP AND CORRECTING TO THE ROADWAY CAUSED HER TO LOSE CONTROL AND THE VEHICLE ENDED UP ROLLING TWO OR THREE (WITNESS ACCOUNTS VARIED) TIMES AND ENDING UPRIGHT IN A FIELD.  DURING THE VERY FIRST ROLLOVER MY WIFE WAS AWARE OF THE SEAT BELT COMING UNLATCHED.  OBVIOUSLY, SHE THEN BECAME AN OBJECT BEING TOSSED ABOUT IN THE VEHICLE DURING THE REST OF THE CRASH SEQUENCE.  THERE IS NO EVIDENT, PHYSICAL DAMAGE TO THE BELT OR BUCKLE MECHANISM.  THE INERTIA LOCK STILL FUNCTIONS; THE BELT WILL CLICK INTO THE BUCKLE AND REMAIN THERE WITH A TUGGING MOTION IS APPLIED.  OBVIOUSLY I CAN NOT DUPLICATE THE TYPE OF FORCES THAT WERE APPLIED DURING THE CRASH.  I CONTACTED SUBARA OF AMERICA AT THEIR CUSTOMER SERVICE DEPT WITH THIS INFORMATION AND THEY WOULD ONLY LOOK INTO THIS IN THE EVENT THE INSURANCE COMPANY SEEKS TO SUBROGATE THE CLAIM TO THEM.  THIS WILL NOT HAPPEN AS THE SEATBELT DID NOT CAUSE THE ACCIDENT (FOR COLLISION LOSS PART OF CLAIM) AND PENNSYLVANIA LAW DOES NOT ALLOW SUBROGATION FOR MEDICAL CLAIMS.  I WAS NOT SEEKING A LITIGATION SETTLEMENT IN CONTACTING SUBARU... I THOUGHT IT WOULD BE SOMETHING THEY WOULD WANT TO INVESTIGATE BEFORE SOMEONE WAS KILLED.  *JB",
        "vin": "JF1SF63581G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/19/2005",
        "dateOfIncident": "05/20/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10129326,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER STATES ON MARCH 10, 2005, SHE TOTALED  VEHICLE.  THE VEHICLE ACCELERATED ON ITS OWN, IT WENT INTO A DITCH.  THIS WAS THE SECOND TIME THIS  HAPPENED.  THE FIRST TIME WAS IN MAY 2004.  THIS TIME, THE VEHICLE WENT ACROSS TRAFFIC INTO A DITCH.  SHE HAD TO CALL A TOW TRUCK.  SHE TOOK THE VEHICLE TO THE DEALERSHIP; HE TEST DROVE THE VEHICLE AND REPLACED A TIRE THAT WENT FLAT.  THE MECHANIC TOLD HER THE VEHICLE WAS FINE.  THE SECOND TIME, WHEN GOING AROUND A CORNER ON A WINDING MOUNTAIN ROAD IT WENT ACROSS THE ROAD AGAIN.  IT ENDED UP IN A DITCH AND THE VEHICLE WAS TOTALED.  THERE WAS A POLICE REPORT.   SHE HASDTWO CRACKS ON L-1 AND BOTH T-9 AND T-10 NEED SURGERY.  SHE ALSO HAS A CRACKED STERNUM.  SHE HAD TO STAY IN THE HOSPITAL FOR FIVE DAYS.  SHE IS CURRENTLY SEEING A SPECIALIST AND AN ORTHOPEDIC SURGEON.  SHE FOUND AN ARTICLE IN THE SACREMENTO BEE ON APRIL 13, 2005 TITLE, CLICK AND CLACK.  THIS ARTICLE WAS IN REFERENCE TO SUDDEN ACCELERATION IN SUBARU'S.*AK",
        "vin": "JF1SF63561H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/26/2005",
        "dateOfIncident": "06/21/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10126619,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "(EVENT)MY WIFE WAS DRIVING OUR 2001 SUBARU FORESTER AT 55MPH WHEN SHE WAS HIT FROM BEHIND, CAUSING OUR CAR TO SWERVE.  SHE HIT A LAMPOST WITH THE FRONT OF THE FORESTER HARD ENOUGH TO KNOCK THE POST DOWN, STOPPING OUR CAR.  NOBODY WAS CRITICALLY INJURED.  (FAILURE) THE AIR BAGS DID NOT DEPLOY.  (FOLLOWUP) THE CAR HAS BEEN DECLARED A TOTAL LOSS.  WE ARE WORKING OUT COMPENSATION WITH THE INSURANCE COMPANY OF THE CAR THAT HIT OURS.  I AM CALLING SUBARU TO TELL THEM ABOUT THE AIR BAG FAILURE.",
        "vin": "JF1SF63521H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "02/12/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121902,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THIS IS THE THIRD TIME THAT THE REAR WHEEL BEARINGS ON THE PASSENGER SIDE NEED TO BE REPLACED.  THERE WAS A LOUD NOISE IN THE BACK WHILE THE VEHICLE WAS IN MOTION.  GOT LOUDER ON TURNS, MOSTLY TO THE RIGHT. *AK  *SB   *NM",
        "vin": "JF1SF65641H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "06/07/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124558,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT : ON 6/7/05 THE OWNER WAS DRIVING  AND NOTICED THAT IT WAS DARK AND THAT HEADLIGHTS WERE FLICKERING ON AND OFF. DRIVER HAS TO HOLD THE SWITCH ALL THE WAY IN TO KEEP LIGHTS ON THE WAY HOME. NEVER NOTICED THIS BEFORE. OWNER CHECKED BUT COULDNT FIND A RECALL, AND HAS CONTACTED THE DEALER AND ARRANGED FOR REPAIRS. *AK",
        "vin": "JF1SF63581H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "05/09/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121016,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD GASKET BLOWN AFTER SERVICE AT DEALERSHIP",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/13/2005",
        "dateOfIncident": "05/12/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120833,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "USING THE TURN SIGNAL LEVERL CAUSES THE HEADLIGHTS TO GO OUT.  INITALLY THE HEADLIGHTS FLICKERED BRIEFLY AND STAYED ON, BUT THEY ARE NOW REQUIRING SOME JIGGLING OF THE TURN SIGNAL LEVEL TO STAY ON. ALSO, THE HEADLIGHTS GO OUT IN SWITCHING  BETWEEN HIGH BEAM AND LOW BEAM, USING THE SAME LEVER.I AM CONTACTING THE DEALER TODAY.BELOW IS LISTED THE NUMBER OF FAILURES OVER THE LAST COUPLE WEEKS.  I DIRECTED MYSELF TO THIS SITE, BUT YOU DON'T HAVE THAT ON YOUR LIST.",
        "vin": "JF1SF65641G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/29/2005",
        "dateOfIncident": "02/12/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119348,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN CITY LIMITS CONSUMER HEARD A NOISE.  AS SOME TIME PASSED THE NOISE BECAME LOUDER.  WITHIN TWO YEARS THE RIGHT REAR WHEEL BEARING WAS REPLACED TWICE.  SEVERAL MILES LATER, THE LEFT REAR WHEEL BEARING WAS REPLACED TWICE. CURRENTLY,  NOISE  RECURRED AGAIN WITH OWNER NOT SURE WHICH REAR WHEEL BEARING HAS FAILED. *AK",
        "vin": "JF1SF63511H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/14/2005",
        "dateOfIncident": "04/06/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117888,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT STRIP ON WINDSHIELD CRACKED THE WINDSHIELD.  *AK",
        "vin": "JF1SF655X1G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/24/2005",
        "dateOfIncident": "02/09/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115797,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "RECALL WW-99 WAS ISSUED BY THE MANUFACTURER THAT WAS NOT  FOUND AT THIS TIME. THERE WAS EXTERNAL COOLANT LEAK INTO THE HEAD GASKET, WHICH COULD CAUSE THE VEHICLE TO OVERHEAT.  DEALER WAS ONLY FLUSHING THE SYSTEM, AND WAS UNABLE TO REMEDY THE PROBLEM.  ALSO, YOKOHAMA TIRES THAT WERE UNDER THE PROPER INFLATION FOR THE VEHICLE CAUSED IT TO SLIP AND SLIDE EVEN THOUGH IT WAS ALL WHEEL DRIVE.*AK  *NM",
        "vin": "JF1SF65671H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2004",
        "dateOfIncident": "12/28/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104780,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SUBARU FORESTER HAS A BLOWN HEAD GASKET. IT APPEARS, AFTER SEARCHING THE INTERNET AND OTHER SOURCES, THAT THIS IS A MAJOR PROBLEM THAT AFFECTS ALL PHASE 2 2.5 L ENGINES MADE BY SUBARU BETWEEN 1999 & 2002. THERE ARE NUMEROUS INTERNET WEB PAGES WITH COMPLAINTS FROM ALL OVER THE COUNTRY. WHY HASN'T SUBARU BEEN ORDERED TO RECALL THESE ENGINES, THEY'RE ADANGER TO THE DRIVING PUBLIC!   *AK",
        "vin": "JF1SF63541G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/04/2004",
        "dateOfIncident": "10/31/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099414,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED  REAR WHEEL BEARING WORE OUT PREMATURELY. THIS PART WAS REPLACED FOUR TIMES. *AK",
        "vin": "JF1SF63511H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/01/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098130,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGAN AS INTERMITTENT CLUTCH SLIPPING (JUDDER) WHEN COLD OR DAMP. IT IS NOW OCCURRING MORE FREQUENTLY AND I TOOK IT BACK TO THE DEALER THIS MORNING. THEY EXPERIENCED THE PROBLEM, KNEW ALL ABOUT IT AND THE TSB THAT SUBARU HAD ISSUED AND ADVISED THEY WOULD CALL ME WHEN THE PARTS CAME IN.  WHEN I CAME HOME FROM WORK, I HAD A MESSAGE THAT THE VEHICLE WAS NO LONGER UNDER BASIC WARRANTY (36000 MILES) AND SINCE MINE WAS 48,000, I WOULD HAVE TO PAY FOR THE REPAIR. IT WOULD SEEM TO ME SINCE SOA IS AWARE OF THIS PROBLEM AND I WAS TOLD BY THE SVC MGR, HAS REMEDIED IT ON NEW MODELS, THIS IS A DEFECT.  I LIVE ON A STATE ROAD WITH HEAVY TRAFFIC AROUND A CURVE. WHEN I ACCELERATE OUT OF MY DRIVEWAY, I EXPECT THAT THE CAR WOULD SAFELY AND QUICKLY MOVE ME INTO TRAFFIC.  THIS IS JUST AN ACCIDENT WAITING TO HAPPEN AND SHOULD BE RECALLED AND REPAIRED BY SOA. THERE ARE NUMEROUS COMPLAINTS ABOUT THIS ON THE INTERNET IF ANYONE WAS LOOKING FOR THIS.  AND EVEN THOSE WHO HAD REPAIRS MADE WITHIN THE WTY PERIOD COMPLAINED OF CONTINUING FAILURES.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2004",
        "dateOfIncident": "07/10/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081093,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUAL TRANSMISSION SUBURU FORESTER PURCHASED MAY 12, 2001 IN CHICAGO, ILLINOIS.  IN MAY OF 2004 CAR BEGAN TO HAVE SLOW START UP IN LST. AND 2ND. GEARS.  DEALER SAID HE DID NOT FIND A PROBLEM.  HOWEVER, PROBLEM WORSENED AND PROGRESSED INTO 3RD, 4TH. AND 5TH. GEARS.  UNTIL ONE DAY IN JULY WHILE ON HIGHWAY CLUTCH EXPLODED.  DEALERSHIP SUGGESTED CAR HAD BEEN DRIVEN AS THOUGH BY A RACE CAR DRIVER WHICH CAUSED THE PROBLEM.  DEALER SUGGESTED IN MY JUNE 04 PHONE CALL THAT CAR MIGHT NEED A TUNE UP WHICH IS WHY I DID NOT HESITATE TO DRIVE IT WITH MY CHILDREN IN IT AT HIGHWAY SPEEDS.  AFTER LOOKING AT ATTORNEY INTERNET COMPLAINT SITE I FOUND NUMEROUS SIMILAR IF NOT EXACT COMPLAINTS AS I HAVE MADE TO DEALERSHIP.  AT PRESENT DEALER HAS MY VEHICLE IN ANOTHER STATE AND TELLS ME I MUST PAY FOR THE 'CLUTCH DISC\" AT L39. AND THE COST OF MY RENTAL CAR AT 30. DAY , REPAIR COULD TAKE 4-7 DAYS.  ALSO, I PAID FOR THE TOW OFF THE HIGHWAY-THE FIRST TOW.  THIS PROBLEM COULD COST ME $500.  IF THE DEALER WOULD HAVE FOUND THE PROBLEM INITIALLY IN MAY THIS WOULD HAVE NEVER OCCCURED ON THE HIGHWAY WITH CHILDREN IN CAR.  VEHICLE LOST 20 MILES SPPED IN LESS THAN 10 SECONDS CAUSING ME TO QUICKLY AND CALMLY MOVE OFF TO THE SIDE OF ROAD AND AWAIT STATE TROOPER HELP.  MECHANICS TELL ME THAT DEALERSHIP MECHANIC SHOULD HAVE INVESTIGATED CLUTCH PROBLEMS WHEN I MADE COMPLAINTS OF LOSS OF POWER IN 1ST. AND 2ND. GEARS.  *AK",
        "vin": "JF1SF63521G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/26/2004",
        "dateOfIncident": "03/31/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074292,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE COASTING, THE VEHICLE ACCELERATED WITHOUT WARNING. THE PROBLEM FORCED THE CONSUMER OFF THE ROAD. THE CONSUMER MANAGED TO HAVE THE VEHICLE TOWED. PLEASE PROVIDE MORE INFORMATION.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/22/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071410,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INQUIRY AS TO WHY THE 2001 SUBARU LEGACY CRUISE CONTROL RECALL DIDN'T APPLY TO THE FORRESTER.  *PH  CONSUMER EXPERIENCED THE SIMILAR PROBLEM STATED ON RECALL ON SUBARU LEGACY.  *LA",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/20/2004",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057624,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI LOCK BRAKES FAILED TO STOP VEHICLE IN A TIMELY MANNER WHEN THE TWO RIGHT TIRES WERE ON ICE ,AND THE TWO LEFT TIRES WERE ON DRY PAVEMENT.  WHEN THIS OCCURRED IT ALMOST CAUSED AN ACCIDENT. THE DEALERSHIP INDICATED THAT THIS PROBLEM  WAS DUE TO A DESIGN FLAW.  *AK   *NM",
        "vin": "JF1SF63571G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/12/2004",
        "dateOfIncident": "05/31/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065990,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "\"CLUTCH SHUDDER\"  OCCURS SHORTLY UPON STARTUP, FIRST APPLICATION OF 1ST GEAR OK \u0013 STOP ONCE AND APPLY 1ST GEAR AGAIN AND THE SHUDDER IS SEVERE, SHAKING AND COMPLETE LOSS OF ACCELERATION; THIS WILL CONTINUE FOR NEXT 2-3 MILES \u0013 \u001cWARMING\u001d THE CAR DOES NOT REMOVE THE PROBLEM.  THIS IS AN EXTREME SAFETY HAZARD - THERE IS NO FORWARD ACCELERATION.  TEMP IT FREQUENTLY OCCURS 56 \u0013 62 DEGREES,  HOWEVER ONCE IT BEGINS IT CAN RE-OCCUR AT HIGHER TEMPS LATER IN THE DAY.   OCCURRENCE IS INTERMITTENT.  I REPORTED PROBLEM TO SUBARU IN SAN JOSE,  THEY SAID \"NO PROBLEM FOUND\" AFTER I LEFT THE CAR IN SERVICE FOR 3 DAYS - THEY SAID THEY COULD NOT REPEAT THE PROBLEM.   THE CLUTCH SHUDDER  HAPPENS TO ME FREQUENTLY DURING THE TEMPS RECORDED ABOVE - I LIVE IN CALIFORNIA \u0013 WE HAVE THOSE TEMPS OFTEN IN THE MORNING SPRING/FALL.  THE # OF 600 FAILURES IS AN ESTIMATE - I COULD NOT ENTER \"ESTIMATE\" IN THIS FORM.  I HAVE HAD THE CAR OVER 3 YEARS AND THE PROBLEM SEEMS WORSE.  MY SISTER\u0019S SUBARU OUTBACK HAS SAME PROBLEM WITH SAME RESPONSE FROM SUBARU SERVICE.  *AK",
        "vin": "JF1SF63571G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/04/2004",
        "dateOfIncident": "03/31/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064505,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 3/31/2004 I WAS EXITING THE PARKING LOT OF A SUPERMARKET IN JACKSON, WHEN SUDDENLY, MY 2001 FORESTER LURCHED FORWARD AND CONTINUED TO ACCELERATE EVEN AS I WAS BREAKING. IT WENT OUT INTO COOPER STREET (A VERY BUSY STREET). FORTUNATELY THERE WERE NO ONCOMING CARS. IT CONTINUED OVER THE CURB AND HIT SEVERAL TREES BEFORE IT STOPPED.   *NM",
        "vin": "JF1SF63501H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2004",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064206,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU FORESTER (MANUAL TRANSMISSION) EXPERIENCES TERRIBLE \"CLUTCH SHUDDER\" (ALSO CALLED CLUTCH CHATTER AND CLUTCH JUDDER) STARTING FROM A STOP IN 1ST GEAR, AND OCCASIONALLY IN 2ND GEAR, MOST OFTEN WHEN CAR IS COLD (MORNING). THE SHUDDER IS EXTREMELY SEVERE, SHAKING THE WHOLE CAR AND RESULTS IN LOSS OF POWER. SINCE THIS HAPPENS STARTING FROM A STOP, THE PROBLEM CREATES A HAZARD WITH INTERSECTIONS; THERE IS ENOUGH POWER TO GET THE CAR INTO AN INTERSECTION, THEN THE CLUTCH SHUDDER REQUIRES COMPLETE REAPPLICATION OF THE CLUTCH, CAUSING THE CAR TO REMAIN IN THE INTERSECTION FOR AN INORDINATE AMOUNT OF TIME.*AK",
        "vin": "JF1SF635X1G"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/04/2004",
        "dateOfIncident": "11/29/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061370,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "YOKOHAMA RUBBER CO. LTD.",
                "productMake": "YOKOHAMA",
                "productModel": "ALL SEASON RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHEN DRIVING IN COLD TEMPERATURES TIRES LOOSE AIR.  TIRES NEEDED AIR EVERY 10 MILES.  THIS COULD BE CAUSED BY THE ALUMINUM RIMS BEING USED. THEY CORRODED AND LOST THEIR SEAL.*AK",
        "vin": "JF1SF65601H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/24/2004",
        "dateOfIncident": "10/19/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054813,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SUBARU FORESTER HAS HAD A CLUTCH SHUDDER WHEN STARTING THE CAR COLD SHORTLY AFTER I LEASED THE VEHICLE. IT IS AN INTERMITTENT PROBLEM WHICH I BROUGHT TO THE ATTENTION OF MY SUBARU TECHNICIAN IN JAN OF 2001. THEY SAID THEY CHECKED OUT THE CLUTCH AND EVERYTHING \"LOOKS FINE\". IT STILL HAS THE SAME PROBLEM, BUT IF I CAN'T REPRODUCE IT FOR THEM THEY CAN'T FIX IT. I HAVE READ OTHER COMPLAINTS FROM OTHER FORESTER OWNERS ABOUT THIS AND SUBARU HAS ISSUED A TSB # 03-51-02R. WHY DOES THE CONSUMER HAVE TO TELL THESE PEOPLE HOW TO FIX THE VEHICLES THEY SERVICE?  *LA",
        "vin": "JF1SF63561G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/20/2004",
        "dateOfIncident": "12/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054540,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE PINGING NOISE RESULTING FROM SHORT SKIRT VALVE DESIGN FAILURE. REQUESTED ADVICE FROM MANUFACTURE WAS TOLD TO TAKE VEHICLE TO A DEALER. DEALER REFUSED TO ACKNOWLEDGE PROBLEM. ENGINE LIFE IS GREATLY REDUCED BY THIS PROBLEM. DEALER RECOGNITION HAS OCCURED REGARDING THIS FLAW. THIS IS THE SECOND SUBARU I HAVE PURCHASED. SIMILAR PROBLEM  IN FIRST VEHICLE RESULTED IN DEALER REPLACEING SHORT BLOCK. ALTHOUGH DISAPPOINTED AT FLAW CUSTOMER SERVICE AT FIRST DEALER PROMPTED PURCHASE OF SECOND VEHICLE. *AK",
        "vin": "JF1SF635X1H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/20/2004",
        "dateOfIncident": "12/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054542,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE PINGING NOISE RESULTING FROM SHORT SKIRT VALVE DESIGN FAILURE. REQUESTED ADVICE FROM MANUFACTURE WAS TOLD TO TAKE VEHICLE TO A DEALER. DEALER REFUSED TO ACKNOWLEDGE PROBLEM. ENGINE LIFE IS GREATLY REDUCED BY THIS PROBLEM. DEALER RECOGNITION HAS OCCURED REGARDING THIS FLAW. THIS IS THE SECOND SUBARU I HAVE PURCHASED. SIMILAR PROBLEM  IN FIRST VEHICLE RESULTED IN DEALER REPLACEING SHORT BLOCK. ALTHOUGH DISAPPOINTED AT FLAW CUSTOMER SERVICE AT FIRST DEALER PROMPTED PURCHASE OF SECOND VEHICLE. *AK",
        "vin": "JF1SF635X1H"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069669,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT MY 2001 SUBARU FORESTER S. I NOTICED THAT THERE WAS A SMALL PAINT CHIP ON THE HOOD. I ASKED THE SALESMAN IF THIS WOULD HAPPEN ALL OVER THE CAR. HE TOLD ME TO CHECK WITH THE SERVICES DEPARTMENT.THEY ALSO TOLD ME THAT IT WASN'T GOING TO BE A PROBLEM. WELL NOW I HAVE LOTS OF CHIPPING ON MY CAR.I CALLED SUBARU OF AMARICA,THEY SENT A REP TO LOOK AT IT,HE TOLD ME IT WAS STONE CHIPPING.I POINTED OUT THE FACT THAT I HAD A SPOT WHEN I BOUGHT IT,HE TOLD ME TO TAKE IT UP WITH THE SALES PERSON.I CALLED SUBARU BACK AND EXPRESSED MY DISSATISFACTION, WITH THERE REP AND HOW HE HANDLED THE SITUATION.I WAS TOLD THAT THEY WILL BE CALLING ME AFTER THEY DO SOME INVESTIGATING. I TOOK MY CAR TO SEVERAL AUTOBODY SHOPS AND THEY SEEM TO THINK THAT IT IS A PAINT DEFECT .I'M LOOKING FOR ANYONE ELSE THAT MAY HAVE THE SAME PROBLEM OR ANY INFO ON THIS SITUATION.",
        "vin": "JF1SF65581H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2004",
        "dateOfIncident": "01/02/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053081,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE ENGINE SPUTTERS, SURGES AND SHAKES INTERMITTENTLY.  SOMETIMES STALLS WHEN STOPPED.  SOMETIMES ACCELERATOR SIGNIFICANTLY HESITATES PROVIDE ENGINE SPEED.  VERY DANGEROUS WHEN CROSSING TRAFFIC OR MERGING.  MECHANIC REPLACED COIL PACK, SPARK PLUGS, WIRES, PCV VALVE, ADJUSTED THROTTLE POSITION SENSOR.  DEALER REPORTS PROBLEM UNKNOWN AND NOT UNDER WARRANTY AT 43,000 MILES",
        "vin": "JF1SF63561H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/31/2003",
        "dateOfIncident": "12/31/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051432,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A SNOW STORM I NOTICED MY 2001 SUBARU FORESTER WOULD NOT DRIVE ON SLIPPERY SURFACES. I PUSHED THE ACCELERATOR, THE WHEELS SPUN AND NOT MUCH ELSE HAPPENED. I TOOK IT TO THE DEALERSHIP ON 12/19/03 AND THEY LOOKED AT ME LIKE I WAS NUTS TO COMPLAIN THAT A CAR DIDN'T DRIVE PROPERLY ON PACKED SNOW AND ICE.  THE ORIGINAL THOUGHT WAS THAT IT MUST BE POOR TIRES (BOUGHT NEW ALL SEASONS ON 10/02) OR THAT I NEEDED TO PURCHASE SNOW TIRES (FOR AN AWD?). AFTER PUSHING THE ISSUE, THE SERVICE MANAGER BROUGHT IT BACK INTO THE GARAGE, PUT IT ON THE LIFT AND HAD SOMEONE GUN THE ENGINE. THE FRONT WHEELS SPUN FAST (AS THEY SHOULD) AND THE BACK WHEELS WENT VERY SLOWLY. THEY SCRATCHED THEIR HEADS AND CALLED SUBARU OF AMERICA FOR SOME HELP ON THE ISSUE. TURNS OUT THE VALVE THAT SUPPLIES FLUID TO THE REAR WHEELS MALFUNCTIONED/BURNT OUT/NO LONGER WORKED. THERE WAS ABSOLUTELY NO WARNING THAT THIS HAD HAPPENED. THE DEALERSHIP SAID NO SUCH LIGHT TO INDICATE A MALFUNCTION IN THE AWD SYSTEM HAS EVER EXISTED. THE SERVICE DEPARTMENT CROSSED THEIR FINGERS THAT THE ONLY REPAIR I WOULD NEED WAS THE VALVE ($460 PARTS AND LABOR) AND WARNED ME THAT IF THIS HAD BEEN HAPPENING FOR A WHILE I COULD BE IN FOR SOME MORE SERIOUS REPAIRS. I WAS ALLOWED TO TAKE THE CAR HOME BECAUSE I COULD DO NO FURTHER DAMAGE TO THE CAR (WAS TOLD IT SHUT DOWN). BROUGHT IT IN 12/31/03 FOR A REPLACEMENT OF THE VALVE AND THEY DISCOVERED THERE WAS EXTENSIVE DAMAGE AND THE CLUTCH WAS COMPLETELY BURNT. THE COST IS NOW ($1500). THIS PROBLEM WOULD HAVE BEEN SIGNIFICANTLY CHEAPER TO FIX IF THERE HAD BEEN A WARNING THAT THERE WAS A PROBLEM. A VALVE FOR THE AWD SYSTEM SHOULD NEVER MALFUNCTION. THE DEALERSHIP SAID THEY HAD NEVER SEEN IT HAPPEN BEFORE.  THE CAR IS NOT OLD ENOUGH (3 YEARS 60K MILES) TO HAVE A PROBLEM LIKE THIS!",
        "vin": "JF1SF63541H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/24/2003",
        "dateOfIncident": "11/11/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047836,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED THE RPM'S WERE ACTING ERRATIC. THE DEALER INSPECTED THE VEHICLE AND STATED THE CLUTCH  NEEDED TO BE REPAIRED. CONSUMER STATED THE VEHICLE WAS STILL UNDER WARRANTY, BUT THE MANUFACTURER AND DEALER REFUSED TO COVER THE COST.  PLEASE PROVIDE FURTHER INFORMATION.    *PH  *JB",
        "vin": "JF1SF65561G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2003",
        "dateOfIncident": "03/15/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048899,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 SUBARU FORESTER L. MY HUSBAND AND I PURCHASED THE VEHICLE NEW AND IT NOW HAS 41000 MILES. IT HAS EXPERIENCED REPEATED FAILURES OF THE REAR WHEEL BEARINGS, AT (RIGHT REAR) 16000, (LEFT REAR) 25000. THE VEHICLE NOW HAS SYMPTOMS OF A THIRD FAILURE AT 41000 MI.  THE VEHICLE WAS SERVICED BY A DEALER FOR EACH COMPLAINT.   I HAVE ESTIMATED DATE OF FIRST FAILURE AS I DO NOT EXACTLY REMEMBER..*AK",
        "vin": "JF1SF63561G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/30/2003",
        "dateOfIncident": "11/04/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048901,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON PICKING UP MY SUBARU FORESTER IN 2001, I COMPLAINED TO THE DEALER THAT THE CAR WAS NOT DRIVING CORRECTLY.  WAS TOLD CAR WAS FINE.  BROKE DOWN 1 DAY LATER.  ONGOING PROBLEMS WITH CLUTCH.  GOING FROM NEUTRAL TO FIRST CAR SHUDDERS.  TOLD CAR IS FUNCTIOING AS DESIGNED.  ON 11/4/03 BROUGHT CAR INTO NETWORK MAZDA SUBARU WITH COMPLAINT ABOUT CLUTCH TOLD IT WAS FINE AND FUNCTIONING AS DESIGNED..  BROKE DOWN ON 11/9/03, CLUTCH PLATE BROKEN.  NEVER EXPERIENCED SUCH A THING IN THE 30 YEARS I'VE BEEN DRIVING A MANUAL TRANSMISSION.  PURCHASED CAR AT NEIL SUBARU, WENT TO GREGORIS SUBARU, NO SATISFACTION, WENT TO DEALERSHIP STATED ABOVE.  SERVICE MANAGER RUDE AND TALKED DOWN TO ME, I FELT BECAUSE I WAS A WOMAN.  MANUAL TRANS. NOT WORKING PROPERLY SINCE THE DAY I PICKED IT UP AND NO ONE WILL LISTEN.  GREGORIS REPLACED CLUTCH AND SAID SOMETHING WAS BROKEN.  NO SATISFACTION FROM SUBARU OR THE 3 DEALERS I HAVE WORKED WITH SO FAR.  NEED YOUR ASSISTANCE.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/06/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046484,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A NOISE COULD BE HEARD WHILE DRIVING THE VEHICLE.  THE DEALER DETERMINED THAT THE RIGHT REAR WHEEL BEARING MUST BE REPLACED.  *AK",
        "vin": "JF1SF63571H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2003",
        "dateOfIncident": "09/24/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039536,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE CLUTCH SHUDDER ESPECIALLY WHEN COLD. DEALER WON'T FIX. SAYS IT'S A GAS PROBLEM. IT'S NOT",
        "vin": "JF1SF63571G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039246,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING WITH THE CRUISE CONTROL ENGAGED FOR 10+ MINUTES, THE CAR SPEED BEGINS TO DRAG AND SURGE (SUDDENLY SLOWS, THEN RESUMES SET SPEED). THE CAR SEEMS TO BE ACTIVELY PULLING BACK AGAINST THE THROTTLE IF I PUT MY FOOT ON THE GAS TO ACCELERATE PAST THE CRUISE SETTING, THE DRAGGING BACK AGAINST THE THROTTLE STILL OCCURS. IF THE CRUISE IS LEFT ENGAGED, THE LURCHING WORSENS, AND WHEN I EXIT THE FREEWAY THE (AUTOMATIC) TRANSMISSION DOESN'T WANT TO DOWN SHIFT. IT RESISTS UNTIL THERE'S A LOUD NOISE, THE REAR OF THE CAR BUCKS, AND THEN IT GOES INTO THE NEXT LOWEST GEAR. THIS HAPPENS THROUGH EVERY GEAR, AND THEN AGAIN UPSHIFTING FROM A STOP: THE RPMS WIND UP HIGHER THAN NORMAL, THE CAR RESISTS SHIFTING, AND THEN THE TRANSMISSION SLAMS INTO THE NEXT GEAR.  THE PROBLEM REMAINS UNTIL I STOP AND TAKE THE CAR OUT OF DRIVE, WHICH APPARENTLY RESETS IT. THE PROBLEM IS MOST LIKELY TO OCCUR IN WEATHER UNDER 70 DEGREES. THE DEALER HAS REPROGRAMMED AN ENGINE CONTROL MODULE PER RECALL #WWF89, AND HAS ALSO REPLACED THE ALTERNATOR AND THE IGNITION RELAY, BUT THE PROBLEM PERSISTS. I BELIEVE THIS PROBLEM IS DANGEROUS, PARTICULARLY WHEN IT'S WINDING UP TO SHIFT INTO FOURTH GEAR AT 60 MILES AN HOUR, AND IT VIOLENTLY BUCKS INTO GEAR. ALSO, THE PROBLEM IS  GETTING WORSE AND MORE UNPREDICTABLE. MOST RECENTLY, I WAS TESTING THE CRUISE CONTROL TO SEE IF THE PROBLEM WOULD OCCUR IN RAINY WEATHER. WHEN IT BEGAN SURGING, I IMMEDIATELY DISENGAGED IT, BUT THE DRAG-BACK ON THE THROTTLE CONTINUED ANYWAY (THIS WAS THE FIRST INCIDENT IN WHICH  THE LURCHING CONTINUED AFTER I TURNED OFF THE CRUISE CONTROL). I AM CONCERNED THIS PROBLEM IS GOING TO OCCUR WITHOUT THE CRUISE CONTROL BEING ENGAGED AT ALL, AND ALSO THAT THE TRANSMISSION IS GOING TO SEIZE UP WITHOUT WARNING.  (NOTE: THE \"INCIDENT DATE\" ON THIS FORM IS THE DATE THE FIRST REPAIR WAS ATTEMPTED, BUT THE PROBLEM ACTUALLY STARTED HAPPENING IN APRIL, 2003. THE \"NUMBER OF FAILURES\" IS AN ESTIMATE -- IT HAPPENS AS OFTEN AS I TEST IT.)*JB",
        "vin": "JF1SF63501H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2003",
        "dateOfIncident": "09/10/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037509,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BEING TOLD THAT IT IS NORMAL FOR SUBARU CLUTCHES TO HAVE CLUTCH JUDDER, AND NOW OUT OF MY 60,000 WARRANTY, I FIND THAT SUBARU HAS ISSUED A TSB TO FIX THE CLUTCH JUDDER PROBLEM.  I FEEL THIS IS A RECALL ISSUE AND I SHOULD GET A WARRANTIED REPAIR OF MY CLUTCH AS SHOULD OTHER SUBARU OWNERS WITH THIS MAUFACTURER'S DEFECT.*AK",
        "vin": "JF1SF63511G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2003",
        "dateOfIncident": "08/09/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033350,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU FORESTER REPEATEDLY DECELERATES AND/OR SPONTANEOUSLY ACCELERATES AT ALL SPEEDS, TRAFFIC CONDITIONS, WEATHER CONDITIONS. POTENTIAL FOR CATASTROPHE. ALREADY SOME NEAR MISSES.*AK",
        "vin": "JF1SF63541G"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031601,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER COMPRESSOR FAILED ON 06/01/03.  DEALER ADVISED CONSUMER TO REPLACE IT WITH A BRAND NEW COMPRESSOR.   REPLACEMENT COMPRESSOR FAILED ON 07/01/03.  DEALER REPLACED COMPRESSOR AND \"RECEPTACLE\".  ON 07/26/03 WHILE DRIVING, CONSUMER TURNED ON AIR CONDITIONING AND VEHICLE STALLED.  VEHICLE IS CURRENTLY BEING CHECKED BY DEALER.   2001, SUZUKI XL7 UNLIMITED.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/22/2003",
        "dateOfIncident": "06/06/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023553,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 SUBARU FORESTER.  IN THE FALL OF 2002, THE RIGHT REAR WHEEL BEARING WENT BAD AND WAS REPLACED BY THE DEALER (LESS THAN 30,000 MILES ON THE CAR).  IN FEBRUARY 2003, THE LEFT REAR WHEEL BEARING WENT BAD AND WAS REPLACED BY THE DEALER.   IN JUNE 2003, THE LEFT WHEEL BEARING WENT BAD AGAIN AND WAS REPLACED/REPAIRED AGAIN BY THE DEALER.  THERE IS A SERIOUS DEFECT IN THESE VEHICLES BECAUSE THE REPAIRS ARE NOT EVEN LASTING SIX MONTHS.  DEALERS SERVICE DEPT. HAS BEEN COURTEOUS AND ALL REPAIRS HAVE BEEN COVERED AT NO CHARGE.   *NLM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "06/20/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024536,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE/GAS PEDALS ARE LOCATED TOO CLOSE TOGETHER. THIS RESULTS IN ACCIDENTAL ACCELERATION WHEN BRAKES ARE DEPRESSED.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "04/22/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016371,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL LUGS BOLTS:  AT 40720 MILES (4/9/03) CAR WAS IN SUBARU DEALER FOR REAR BRAKES.  TWO LUG BOLTS FROM THE RIGHT REAR WHEEL WERE FOUND TO BE SNAPPED AND FELL OFF IN THE MECHANICS HAND.  THAT WAS A WEEK AGO.  TODAY AFTER ABOUT 900 MILES TWO LUG BOLTS ON THE SAME WHEEL HAD SNAPPED OFF.  DEALER TOWED THE CAR IN FOR REPAIRS.      *JB",
        "vin": "JF1SF65681H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "02/11/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010599,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 25,000 MILES MY 2001 FORESTER STALLED 3 TIMES IN MY DRIVEWAY AND SHOOK A BIT.  I HAD THE IDIOT-NEW-OWNER-PACKAGE WITH THE DEALER WHERE THEY DID ALL THE MAINTENANCE, ETC. AND WAS SCHEDULED FOR AN OIL CHANGE/WHATEVER MAINTENANCE ANYWAY SO I ASKED THEM TO CHECK IT OUT.  THEY COULD NOT REPRODUCE THE PROBLEM AND IT DID NOT HAPPEN AGAIN TO ME UNTIL SEVERAL MONTHS LATER.      NOW AT 38,000 MILES (3000 MILES AFTER WARRANTY AND AFTER THE END OF THE IDIOT-PACKAGE) IT HAPPENED AGAIN.  THIS TIME IT STALLED ON SEVERAL OCCASIONS BOTH IN PARKING LOTS AND AT STOP LIGHTS.  IT SHOOK AT AN IDLE AND THE CHECK ENGINE LIGHT CAME ON.  A LOCAL SHOP DIAGNOSED THE PROBLEM AS A FAILED COIL PACK.  HE ALSO NOTED THAT THE APPARENT CAUSE WAS THAT IT APPEARED NO MAINTENANCE HAD EVER BEEN DONE.  THE SPARK PLUG CHANGE AND A 30K MILE TUNE UP THAT WERE ON MY SERVICE TICKETS AS HAVING BEEN PERFORMED WERE PROBABLY NOT ACTUALLY DONE.  THERE WAS NO WAY TO PROVE THAT WITHOUT TOWING THE CAR TO SUBARU AT MY EXPENSE AND THEN PROBABLY HAVING THEM STILL CLAIM THE SERVICE HAD BEEN DONE.      I DRIVE VERY CONSERVATIVELY, DON'T SPEED, DON'T TAKE OFF QUICKLY AND LIVE IN A MODERATE TEMPERATURE/WEATHER AREA (NORTHERN VA).  THERE IS NO REASON THAT WITH PROPER MAINTENANCE THIS SHOULD HAVE HAPPENED.  SUBARU OF AMERICA SAYS IT IS A DEALER PROBLEM.  THE DEALER CLAIMS NO WRONG DOING.  I CAN DISPUTE THE POINT AND HAVE IT TOWED TO ANOTHER DEALER FOR VERIFICATION OF THE LACK OF PROPER MAINTENANCE, WHICH WE ALL KNOW WILL NOT BE THEIR FINDING OR PAY THE $530 REPAIR STRAIGHTAWAY.  I CHOSE THE LATTER.  IS THERE ANYTHING I CAN DO NOW TO GET SUBARU TO REFUND THE COST OF REPAIR?   *NLM",
        "vin": "JF1SF63531H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/13/2003",
        "dateOfIncident": "03/12/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011661,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WHEEL BEARING FAILED, HOWEVER THE MANUFACTURER DID NOT AGREE TO CORRECT THE PROBLEM.   *JB.  *AK",
        "vin": "JF1SF65611G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "02/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009524,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STALLED ON SEVERAL OCCASIONS.*DT  *JB",
        "vin": "JF1SF65521G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/27/2003",
        "dateOfIncident": "02/27/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008211,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS WERE PACKED WITH LEAVES AND STONES.  CAR NEEDED TO BE PLACED ON LIFT TO REMOVE THE DEBRIS.  COULD NOT DRIVE DUE TO HIGH PITCHED SQUEAL AND CONCERN ABOUT CAUSING FURTHER DAMAGE.  SUBARU TOOK FOUR HOURS TO PICK UP CAR.  WHEN TAKEN TO DEALER FINALLY, WAS TOLD THAT IT WAS NOT A SUBARU PROBLEM AND THEY INDICATED I SHOULD BE CHARGED FOR A HALF HOUR LABOR AND WOULD NOT PAY FOR TOW. I WAS ALSO INFORMED THIS HAPPENED BECAUSE I WAS DRIVING ON DIRT ROADS (ISN'T THAT WHAT SUV'S ARE DESIGNED FOR?) I THINK THERE MUST BE A FLAW IN DESIGN OF FORESTER SUV.  SERVICE MANAGER INFORMED ME IT HAPPENS TO HIS WIFE FREQUENTLY, AND HE CORRECTS PROBLEM HIMSELF.  SEEMED TO BE SUGGESTING I  DO THE SAME WHICH SOUNDS UNREASONABLE FOR A CAR UNDER WARRANTY COVERAGE AND ONLY 11,000 MILES.  I RECEIVED VERY POOR SERVICE FROM SUBARU. HOW COULD I HAVE KNOWN BASED ON SYMPTOMS AND ADVISE OF DRIVER TO GO AHEAD WITH TOW THAT THIS WOULD NOT BE A SUBARU PROBLEM ,AND WHY DID THEY MAKE ME WAIT FOUR HOURS AND CHASE THEM BY TELEPHONE BEFORE THEY FINALLY PICKED UP CAR?*JB",
        "vin": "JF1SF63561H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2003",
        "dateOfIncident": "02/12/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007715,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BLOWN HEAD GASKET CAUSING LEAK OF COOLANT AT 75,000 MILES ON A 2001 SUBARU FORESTER",
        "vin": "JF1SF63571H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/08/2003",
        "dateOfIncident": "02/07/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005513,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST FUMES SOME CO POISONING SYMPTOMS 2001 SUBARU FORESTER  POSTED BY DAVE ON FEBRUARY 08, 03 AT 06:52:29:    I FUELED MY FORESTER WITH 91 OCTANE PREMIUM FUEL AND   TOOK OFF ON A 5 HR DRIVE TO DENVER. THERE WERE EXTREME  DRIVING CONDITIONS 40 MPH WINDS AND GROUND BLIZZARDS.  SET THE CRUISE CONTROL AT 75 MPH AND IT WAS ALL THE  CAR COULD DO TO MAINTAIN 70 MPH IN HIGH GEAR AND ON SOME HILLS IT WOULD DOWNSHIFT TO A LOWER GEAR TO SATISFY THE COMPUTER SETTING OF 75. AFTER 2+ HOURS OF DRIVING I NOTICED A STRONG SMELL OF EXHAUST FUMES. I DEVELOPED A HEADACHE. I OPENED THE BRRRRR WINDOWS AND WROTE A NOTE TO THE EFFECT THAT IF I SUCCOMED TO CO  FUMES AND DIED FOR MY SURVIVORS TO SUE SUBARU. IN THE  STATE CAPITOL, I STOPPED AT THE D.O.T. AND WENT INTO THE TESTING LAB AND BORROWED A CO TESTER THEN WENT BACK  ONTO THE INTERSTATE (THE CAR WAS IDLING WHILE IN THE LAB). I WAS WOOZIE AND DISORIENTED CLASSIC CO SYMPTOMS.  SCARIE! ANYHOW BACK ONTO THE ROAD FOR A 15 MIN ATTEMPT  TO REPRODUCE THE SCENARIO. THE FUMES WERE GONE THE CO DETECTOR STAYED AT ZERO/PPM, I SUPPOSE THE CONVERTOR HAD COOLED OFF. ON THE RETURN TRIP THE WIND HAD DIED AND THE ENGINE DID NOT HAFTO WORK QUITE AS HARD THERE WERE STILL SOME TIMES OF SLIGHT SMELL OF THE FUMES BUT NOT AS INTENSE AS ON THE   INITIAL 2 HOUR EXPERIENCE. I ALSO REFUELED AT THE 2 HR MARK WITH 87 OCTANE FUEL. I BELIEVE THAT THE PURCHASE OF A SMALL CO DETECTOR MAY BE A GOOD IDEA FOR SAFETY.  AND I BELIEVE THAT THE MANUFACTURER SHOULD INVESTIGATE THIS AS A POSSIBLE SERIOUS HAZARD BUT HAVE NO IDEA HOW TO GO ABOUT INITIATING SUCH A THING. THIS POST IS TO FURTHER THAT CAUSE. CC: SUBARU MFG.COM",
        "vin": "JF1SF63561H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004572,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ALL WHEEL DRIVE DID NOT PERFORM AS DESIGNED, THERE WAS A SEVERE VIBRATION WHICH ALMOST CAUSED CONSUMER TO LOOSE CONTROL OF THE VEHICLE, CONSUMER PULLED OVER AND NOTICED A LOT OF SNOW WAS PACKED IN THE WHEELS.*JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/28/2003",
        "dateOfIncident": "12/21/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10003532,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU FORESTER 2001 - WAS BACKING UP AND ACCELERATOR GOT STUCK - FLYING BACK IN REVERSE ABOUT 50 FEET - HITTING TREE AND COMING FORWARD ABOUT 20 FT.",
        "vin": "JF1SF65681H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/28/2003",
        "dateOfIncident": "01/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004846,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER INSTALLED  ON THE HOOD AN ORIGINAL WINDSHIELD  DEFLECTOR, SIX MONTHS AFTER PURCHASE OF THE VEHICLE. WHILE DRIVING AT 60MPH  THE WINDSHIELD REFLECTOR  COLLAPSED AND DEALER TOLD CONSUMER GUARANTEE IS OVER. PLEASE PROVIDE FURTHER INFORMATION. TS *TR",
        "vin": "PROVIDE"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/06/2003",
        "dateOfIncident": "03/03/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001435,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT AFTER A SNOW STORM THE WHEELS ON THE VEHICLE WILL BECOME IMPACTED WITH SNOW CAUSING VERY SEVERE VIBRATIONS THAT COULD LEAD TO LOSS OF CONTROL.  *JG *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/27/2002",
        "dateOfIncident": "06/15/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019712,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT VEHICLE STARTED MAKING NOISES FROM THE BRAKES.  DEALER AND SUBURU MANUFACTORY WERE NOTIFIED.  *MR",
        "vin": "PLEASE PROV"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/26/2002",
        "dateOfIncident": "09/26/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767781,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SCREECHING SHOUND COMING FROM WHEELS.   MR",
        "vin": "JF1SF63561H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/31/2002",
        "dateOfIncident": "08/30/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766503,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE KEEPS STALLING OUT IN THE MIDDLE OF OPERATION, HIGHWAY, STREET.  *AK",
        "vin": "JF1SF63561H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/14/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8016278,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55 MPH REAR ENDED ANOTHER VEHICLE AND DRIVER'S SIDE AIR BAG DID NOT DEPLOY.  CONSUMER WAS INJURED. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/24/2002",
        "dateOfIncident": "07/21/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 764679,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ACCELERATION..CAR WAS IDLING FEW MINUTES IN PARK IN MY DRIVEWAY,BEFORE ENTERING GARAGE.    WHEN SHIFTED TO DRIVE, WITH FOOT STILL ON BRAKE, CAR REVVED UP, ACCELERATED, CRASHED THROUGH GARAGE WALL INTO FAMILY ROOM OF HOME. BRAKES DID NOT WORK;ONLY IMPACT STOPPED CAR. AIRBAG DID NOT OPEN.*AK",
        "vin": "CAR TOWED A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/25/2002",
        "dateOfIncident": "10/29/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8012563,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 55 MPH, OWNER SAW A DEAD COW LEFT IN THE ROADWAY.  WHILE ATTEMPTING TO MANUEVER DRIVER STRUCK THE COW AND VEHICLE BECAME AIR-BORN.  VEHICLE HIT THE GROUND WITH NOSE/FRONT. UPON IMPACT, AIR BAGS DID NOT DEPLOY.  *AK  ONE PERSON WAS INJURED IN ACCIDENT.   *SLC",
        "vin": "JF1SF63581H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/17/2002",
        "dateOfIncident": "05/09/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566095,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT BRIDGESTONE DUELLER 683 (P205-70-R15, DOT# UNKNOWN)  ORIGINAL EQUIPMENT TIRES ARE SOFTER AND WEAR OUT QUICKLY.    *TT",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009459,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 60 MPH AND WITHOUT WARNING VEHICLE WILL LOSE POWER /DROPS TO 5 MILES. THEN GOES BACK TO 60 MPH.  DEALER HAS BEEN NOTIFIED 6 TIMES, AND COULD  NOT FIND CAUSE. *AK",
        "vin": "JF1FF63541H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2002",
        "dateOfIncident": "05/20/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008381,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SPUTTERS AND SHAKES INTERMITTENTLY AFTER FIRST TAKING OFF.  ALSO, STALLED AT VARIOUS SPEEDS 3 TIMES. DEALER CANNOT REMEDY THE PROBLEM.*AK",
        "vin": "JF1SF6V591G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/23/2002",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008383,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN BUMPER HIGH SNOW FOR 5 MILES VEHICLE WOULD NOT SHIFT FROM 3 RD TO 4 TH GEAR.  CONSUMER HAD TO FORCE IT INTO 4 TH GEAR.  DEALER DETERMINED SNOW HAD ACCUMULATED AROUND TRANSMISSION AND CAUSED THE PROBLEM.*AK",
        "vin": "JF1SF6V591G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/21/2002",
        "dateOfIncident": "03/20/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759635,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRIGGERRING MECHANISM FOR THE ABS SEEMS TOO DELICATE. THE CAR STARTS SKIDDING EVEN IN VERY LIGHT SNOW. THIS HAS CAUSED 3 INCIDENTS OF RUN-OFF-ROAD CRASHES ONTO THE CURB WITH MINIMAL PROPERTY DAMAGE. THE CAR GETS OUT OF CONTROL VERY EASILY IN SLIPPERY CONDITIONS WHICH DEFEATS THE PURPOSE OF A 4WD VEHICLE WITH ABS.*AK",
        "vin": "JF1SF65551H"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/26/2002",
        "dateOfIncident": "02/22/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004554,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALARM SYSTEM REENGAGES BY ITSELF AFTER BEING DISENGAGED BY DEALER, VEHICLE WOULD NOT ALLOW CONSUMER TO GAIN ENTRANCE WHEN THIS OCCURS.  *AK  CONSUMER STATED THAT HER BABY WAS LOCKED IN THE VEHICLE AND HAD TO BE RESCUED OUT BY THE FIRE DEPARTMENT, CONSUMER STATED SHE PAID SUBARU TO HAVE THEM REMOVE THE ALARM SYSTEM AT THE TIME OF LEASING THE VEHICLE, SUBARU STATED THAT THE PANIC BUTTON WAS SOMEHOW DEPRESSED AND CAUSED DOORS TO LOCK AND LIGHTS TO FLASH, CONSUMER STATED THERE WAS NO WAY THE PANIC BUTTON WAS DEPRESSED BECAUSE THE KEYS WERE LYING ON THE FRONT SEAT WHEN SHE HAD EXITED THE VEHICLE.   *SLC",
        "vin": "JF1SF63551H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/22/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004419,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PLACING VEHICLE IN PARK VEHICLE JUMPED OUT OF GEAR AND ACCELERATED FORWARD, RESULTING INTO AN ACCIDENT. THIS OCCURRED SEVERAL TIMES.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/08/2002",
        "dateOfIncident": "02/07/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003769,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES TO PARK, VEHICLE SUDDENLY ACCELERATED, JUMPING A CURB AND HITTING TWO PARKED VEHICLES.  PROBLEM WAS INTERMITTENT. SUBARU WAS CONTACTED TO INSPECT VEHICLE.*AK  *YH",
        "vin": "JF13F63531H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/03/2002",
        "dateOfIncident": "12/03/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757691,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BROUGHT MY VEHICLE BACK TO THE DEALER IN DELRAY BEACH FL AND IT STILLS PULLS TO THE RIGHT AND I HAD THE CUDTOMER SERVICE REP DRIVE IT WITH ME IN THE CAR AND HE AGREED THAT IT HAS A PULL TO THE RIGHT . I HAVE SPOKEN TO SUBARU AND THEY HAVE DONE NOTHING TO TAKE CARE OF THIS PROBLEM. IT IS A SERIOUS SAFETY ISSUE.*AK",
        "vin": "4S3BH806627"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/03/2002",
        "dateOfIncident": "10/18/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756362,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD TO HAVE THE DRIVER'S SIDE REAR WHEEL BEARING REPLACED TWICE IN THE LAST THREE MONTHS ON A 2001 VEHICLE.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/26/2001",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785824,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THE LEFT AND RIGHT REAR WHEEL BEARINGSFAILED. *JG",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/26/2001",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785824,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THE LEFT AND RIGHT REAR WHEEL BEARINGSFAILED. *JG",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/13/2001",
        "dateOfIncident": "11/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755614,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TACK THAT IS IN PLACE TO HOLD THE DRIVER'S SIDE MAT IN PLACE  DOES NOT WORK.  THE MAT CONTINUOUSLY FALLS OFF THE TACK.  I FIRST MADE THE DEALERSHIP AWARE OF IT AND COULD FIND NOTHING TO FIX.  WE LOOKED AT OTHER SUBARUS AND THEY ALL HAD THE SAME ISSUE.  I RECENTLY COMMUNICATED THIS TO SUBARU VIA THEIR WEB SITE WITH LITTLE INTEREST ON THEIR PART. THE PROBLEM OCCURS WHEN THE MAT SLIPS OFF THE TACK IT RUNS UP INTO THE PEDALS. THIS MEANS THE FLOATING TACK COULD ACTUALLY CAUSE MORE PROBLEMS THEN NOT HAVING ONE THERE AT ALL.  OUR OTHER CAR (HONDA) HAD A TACK THAT IS FIRMLY PLACED IN THE FLOORBOARD NOT TACKED TO THE CARPET ONLY AND AS A RESULT IT DOES NOT HAVE A PROBLEM.*AK",
        "vin": "JF1SF65511H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/11/2001",
        "dateOfIncident": "03/09/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563855,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS EXPERIENCING BRAKE PROBLEMS, ON ONE OCCASION WHILE DRIVING, CONSUMER PUT HIS FOOT ON THE BRAKE PEDAL, HOWEVER VEHICLE DID NOT STOP, VEHICLE GLAZED AGAINST ANOTHER CAR CAUSING DAMAGE.   *SLC",
        "vin": "JF1SF65511H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/11/2001",
        "dateOfIncident": "03/09/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563855,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER SHIFTED TO DRIVE AND CAR THROTTLED FORWARD OVER EMBANKMENT ACROSS STREET IN FRONT OF HIS HOUSE.  *YD",
        "vin": "JF1SF65511H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/11/2001",
        "dateOfIncident": "03/09/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563855,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS EXPERIENCING BRAKE PROBLEMS, ON ONE OCCASION WHILE DRIVING, CONSUMER PUT HIS FOOT ON THE BRAKE PEDAL, HOWEVER VEHICLE DID NOT STOP, VEHICLE GLAZED AGAINST ANOTHER CAR CAUSING DAMAGE.   *SLC",
        "vin": "JF1SF65511H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/11/2001",
        "dateOfIncident": "03/09/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 563855,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER SHIFTED TO DRIVE AND CAR THROTTLED FORWARD OVER EMBANKMENT ACROSS STREET IN FRONT OF HIS HOUSE.  *YD",
        "vin": "JF1SF65511H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/26/2001",
        "dateOfIncident": "10/15/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898344,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS ON A SIDE STREET  AND WAS TRAVELING ABOUT 20MPH,  ANOTHER VEHICLE JUMPED IN FRONT OF CONSUMER'S VEHICLE,   CONSUMER APPLIED  BRAKES AND  PEDAL WENT ALL THE WAY DOWN TO THE FLOOR.    UPON IMPACT,  AIRBAGS DIDN'T GO OFF.   DEALERSHIP  WAS AWARE OF  PROBLEM. MECHANIC LOOKED AT THE VEHICLE THREE TIMES ALREADY.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/10/2001",
        "dateOfIncident": "10/07/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753051,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS ATTEMPTING TO BACK INTO DRIVEWAY WHEN SUDDENLY THE CAR MOVED FORWARD. ENGAGING THE BRAKES FAILED TO STOP CAR AND IT WENT OVER AN EMBANKMENT. IN PREVIOUS YEARS SUBARUS WERE RECALLED FOR BRAKE PROBLEMS.ALSO FOR PROBLEMS WITH AUTOMATIC TRANSMISSION. *AK",
        "vin": "JF1SF65511H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9004451,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "UNUSUAL HEAT IN THE INSTRUMENT CONTROL PANEL WHEN THE RHEOSTAT CONTROLLED LIGHTS WERE ON HIGH, IMPOSSIBLE TO USE TAPE DECK BECAUSE OF THE HEAT GENERATED, OVERHEATING RHEOSTAT CONTROL FOR THE DASHBOARD LIGHT, EITHER THE INSTRUMENT PANEL GAUGE IN THE RHEOSTAT OR THE INCORRECT WATTAGE IN THE INSTRUMENT PANEL DEGREES.",
        "vin": "JF1SF63561G"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/17/2001",
        "dateOfIncident": "07/19/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 896415,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING INTO DRIVEWAY ACCELERATOR GOT STUCK, CAUSING VEHICLE TO HIT A PAKRED CAR, CONSUMER STATED ACCELERATOR HAS STUCK IN THE PAST BUT ONLY WHILE IN REVERSE.*SLC",
        "vin": "JF1SF63551H"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751186,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A LEAK/SEVERE CONDENSATION PROBLEM FOLLOWING RAINSTORMS/HIGH HUMIDITY.  WATER LEAKS FROM EITHER MOON ROOF OR TOP OF WINSHIELD AND DRIPS IN FROM ROOF WETTING CLOTH OVER MIDDLE OF DRIVER'S SIDE WINDSHIELD VISOR.  DEALERSHIP COULD NOT REPLICATE PROBLEM BUT IT CONTINUES TO OCCUR IN WEATHER CONDITIONS CITED.  TEN TO TWELVE DROPS OF WATER ACCUMULATE ON EITHER DRIVER, DASH OR STEERING WHEEL WHEN THIS OCCURS USUALLY WHEN STARTING CAR AND PROCEEDING TO DRIVE IN THE MORNING.  THIS IS STARTLING WHEN IT OCCURS, APPROXIMATELY ON SIX OCCASIONS TO DATE, AND  MAY RESULT IN AN ACCIDENT.*AK",
        "vin": "JF1SF65691H"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/26/2001",
        "dateOfIncident": "08/25/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751155,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON EXITING DOORWAY OF DRIVE-THU CARWASH, TOOK CAR OUT OF NEUTRAL AND CAR LUNGED FORWARD ACCELERATING OUT OF CONTROL INTO TRAFFIC CRASHING INTO ANOTHER VEHICLE.APPLYING ANTILOCK BRAKES DID NOT SLOW/STOP ACCELERATION,AIRBAGS DID NOT GO OFF DESPITE SIGNIFICANT IMPACT. *AK",
        "vin": "JF1SF65601H"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/24/2001",
        "dateOfIncident": "01/08/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751062,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALREADY HAD TO CHANGE BROKEN BEARINGS IN BOTH REAR WHEELS OF MY 2001 SUBARU FORESTER.  I AM TRAINED TO MONITOR NOISE AND VIBRATION AND WAS ABLE TO CATCH THE PROBLEM IN-TIME.  THE REPLACEMENT WAS MADE BY A SUBARU DEALER WITH NO COST TO ME.  I THINK THAT MOST DRIVERS WOULD NOT BE ABLE TO CATCH THE PROBLEM AND THE SITUATION MAY BE LIFE THREATENING IF THE BEARING FINALY COMPLETELY BREAKS AT HIGH SPEED AND FREEZE THE WHEEL.  I SENT ACOMPLAIN TO SUBARU COMPANY.  THE COMPANY RESPONSE (CASE # 332444): \"THE PARTS THAT YOU HAD REPLACED ARE MECHANICAL.  AS YOU KNOW, MECHANICAL PARTS CAN FAIL.\"  I DO NOT THINK THAT IT IS NORMAL IF WHEEL BEARINGS FAIL IN A NEW CAR IN THE FIRST YEAR.*AK",
        "vin": "JF1SF63541H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/16/2001",
        "dateOfIncident": "08/14/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 894536,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 35 MPH APPLIED BRAKES, AND VEHICLE SLOWED DOWN TO 25 MPH. THEN,  BRAKES LOCKED UP. PEDAL FELT SOFT.*AK    DEALER FOUND NO PROBLEM WITH THE BRAKES.  LEFT REAR TAIL LIGHT BULB BURNED AND WAS REPLACED.  *SLC",
        "vin": "GF1FF65601H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2001",
        "dateOfIncident": "06/15/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 561804,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE TRAVELING, THE TIRE SUDDENLY BURST AND COLLAPSED AROUND THE ENTIRE CIRCUMFERENCE OF THE SIDEWALL,BY THE TIME CONSUMER GOT THE VEHICLE UNDER CONTROL AND STOPPED THE TIRE WAS COMPLETELY DESTROYED, THE TIRE IS A YOKOHAMA P215/60R16/94H RADIAL TUBELESS GEOLANDAR H/T. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 890852,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY WHEN BRAKES ARE APPLIED ENGINE WILL REV UP AND SURGE FORWARD SUDDENLY AND UNEXPECTEDLY WITHOUT WARNING.   DEALER HAS INSPECTED VEHICLE, BUT HAS YET TO DUPLICATE OR CORRECT THE PROBLEM.  PLEASE PROVIDE ADDITIONAL INFORMATION.  *AK",
        "vin": "JF1SF65591H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/05/2001",
        "dateOfIncident": "05/26/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 3,
        "numberOfInjuries": 3,
        "odiNumber": 889768,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S VEHICLE COLLIDED WITH ANOTHER VEHICLE HEAD-ON AND  FRONT AIR BAGS DIDN'T DEPLOY.  CONSUMER WAS GOING 35MPH.  CONSUMER HAD NO IDEA IF  SUBARU DEALER WILL INSPECT  VEHICLE.*AK  CONSUMER LISTED THERE WERE 3 INJURIES AND 3 FATALITIES, HOWEVER DID NOT SPECIFICALLY MENTION IN THE STATEMENT OF ANY DEATHS.   *SLC",
        "vin": "JF1SF63501H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/02/2001",
        "dateOfIncident": "03/07/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 744865,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS MAKING A LEFT TURN AND WAS HIT HEAD ON DAMAGING THE RIGHT FRONT OF MY VEHICLE.  THE DAMAGE TOTALED OVER 8000.00 .  DAMAGE INCLUDED THE FRONT HOOD, RIGHT FRONT FENDER, FRONT BUMPER COVER AND REINFORCEMENT , RADIATOR SUPPORT AND THE RADIATOR.  ALSO, THE AC CONDENSOR, THE WHOLE FRONT WAS BENT TO THE LEFT RESULTING IN DAMAGE TO THE CHASSIS.  THE ENGINE WAS TILTED, THE WINDSHIELD CRACKED, AND THE SUB RAIL , WHERE THE AIRBAG SENSOR IS, CRACKED IN TWO. THERE WAS ADDITIONAL DAMAGEALSO.  WITH ALL THIS DAMAGE, THE AIRBAGS, FAILED TO DEPLOY, SHOCKING THE POLICE , THE INSURANCE COMPANY AND THE REPAIR SHOP.  I CONTACTED SUBARU TO INFORM THEM THAT THERE MAY BE A PROBLEM WITH THE AIR BAG SYSTEM AND WAS TOLD NOT TO TOUCH THE CAR.  THEY SAID THEY WOULD SEND ENGINEERS TO INSPECT THE CAR WITHIN 72 HOURS. A WEEK LATER,I CONTACTED THEM AGAIN AND THEY REQUESTED COPIES OF THE POLICE REPORT AND INSURANCE INFORMATION. I COMPLIED AND FOR THE NEXT THREE WEEKS , I WAITED FOR AN ANSWER.  FINALLY, AN EMPLOYEE OF SUBARU CONTACTED ME AND TOLD ME TO BRING THE CAR TO A DEALER TO CHECK IF THE AIR BAGS ARE WORKING.  I TOLD THEM OBVIOUSLY, THEY DIDN'T WORK WHEN I NEEDED THEM TOO, ESPECIALLY SINCE THE IMPACT WAS RIGHT OVER THE SENSOR.  HE THEN SAID WHY  WAS I WORRYING  , THAT THE DAMAGE WAS PAID.  I EXPLAINED THAT I NO LONGER FELT SAFE IN THE VEHICLE AND THAT MAYBE OTHER PEOPLE MIGHT EXPERIENCE THE SAME PROBLEM WITH SERIOUS CIRCUMSTANCES.    TO DATE, I AM DRIVING A RENTAL CAR AND INCURRING EXPENSES FOR THE RENTAL AND ALSO STORAGE FEES OF MY DAMAGED VEHICLE. ON A TV PROGRAM, FEATURING BRIAN O'NEILL, FROM THE INSURANCE INSTITUTE FOR HIGHWAYTEST SAFETY, AIR BAGS SHOULD DEPLOY AT AN IMPACT OF 12-25 MPH, RESULTING IN DAMAGE COST OF $585.  MY QUESTION TO SUBARU WAS, WHY DIDN'T THE AIRBAGS DEPLOY IN A IMPACT THE RESULTED IN $8000 IN DAMAGE?*AK",
        "vin": "JF1SF65621H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/06/2001",
        "dateOfIncident": "03/29/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 885315,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING WITH FOOT ON BRAKES AND VEHICLE SUDDENLY ACCELERATED OVER CEMENT BLOCK. HAD HIT A FEW BUSHES AND THEN A BUILDING. UPON IMPACT,  AIR BAGS FAILED TO DEPLOY. HAD VEHICLE TOWED TO A MECHANIC BASED ON REFERRAL FROM DEALERSHIP.*AK",
        "vin": "JF1SF63551H"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "04/02/2001",
        "dateOfIncident": "03/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884880,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL  WHEELS ARE COLLECTING ICE AND MUD WHILE DRIVING AND CAUSING SEVERE VIBRATION WHEN TRAVELING 60 OR MORE MPH.  DEALER / MANUFACTURER NOTIFIED.   *AK  ACCORDING TO THE CONSUMER'S OBSERVATION, THE VIBRATION WAS DUE DEFECTIVE ALLOY WHEEL, COMMON AT ALL ALLOY WHEELS.  *YH",
        "vin": "JF15F65622H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/12/2001",
        "dateOfIncident": "02/24/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742315,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "JF1SF65681H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/21/2001",
        "dateOfIncident": "02/06/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 880962,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 35 MPH WAS HIT ON FRONT QUARTER, NEITHER AIRBAG DEPLOYED. VEHICLE HAS SIDE AIRBAGS. LIKELY TO BE TOTALLED.  *AK",
        "vin": "JF1SF65661H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/07/2001",
        "dateOfIncident": "12/24/2000",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 740555,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE MAY HAVE OTHER FACTORS TO THE CAR SKIDDING (SNOWY).  *AK",
        "vin": "JF1SF65511H"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/24/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878895,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 40 MPH ON SNOW WHILE TRYING TO SLOW DOWN CONSUMER RAN OFF ROAD .AIR BAGS DID NOT DEPLOY WITH FRONT END DAMAGE.   *AK THE SEAT BELT NOT ADQUATELY RESTRAIN THE DRIVER.  *YH",
        "vin": "JF1SF63541H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/24/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 739891,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES LIGHTLY APPLIED DUE TO SLUSH ON ROADWAY,BRAKES DID NOT WORK VEHICLE CRASHED, DRIVER SUFFERED CONCUSION AS HEAD HIT WINDSHIELD AND AIR BAGS DID NOT DEPOLY. SEAT BELT DID NOT HOLD DRIVER FIRMLY. SUBARU HOME OFFICE NOTIFIED, CHRIS, CUSTOMER SERVICE REP APPEARS NOT VERY CONCERNED AND ALMOST CALLOUS IN RESPONSE TO OUR CONCERNS. INS CO HAS ELECTED TO FURTHER INVESTIGATION THE VEHICLE.  *AK",
        "vin": "JF1SF63541H"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/07/2001",
        "dateOfIncident": "01/06/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 738943,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AOTOMOBILE SKIDDED OF ROAD D/T SNOW/SLUSH STOPPING IN CULVERT. DAMAGE TO FRONT END CONSIDERED SUBSTANTIAL. AIR BAGS DID NOT DEPLOY AND SEAT BELT APPARENTLY DID NOT HOLD OCCUPANT SINCE HER HEAD HIT THE WINDSHIELD.  SHE WAS TRANSPORTED TO LOCAL ER.  THE FACT THAT THE AIRBAGS DID NOT DEPOLY IMPRESSED THE POLICE AND EMTS AT THE ACCIDENT SITE.*AK",
        "vin": "JF1SF63541H"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/29/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 557664,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER EXPERIENCED FOOT TOUCHING BOTH THE BRAKE PEDAL AND THE ACCELERATOR PEDAL AT THE SAME TIME, DEALERSHIP ADJUSTED THE BRAKE PEDAL HEIGHT AS STATED IN SERVICE BULLETIN 6-29-00 OPERATION #A543-008, HOWEVER CONSUMER FEELS THIS IS INADEQUATE AND THEY SHOULD BE SEPARATED APART.   *MJS",
        "vin": "JF1SF63541H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/09/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874752,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD SCRATCHES TOO EASILY. THIS IS A GREAT DISTRACTION TO  DRIVER,  ESPECIALLY FROM THE REFLECTION OF SUN. *AK  THE PLASTIC PART OF THE FRONT WINDSHIELD CAUSES THE SCRATCHES.  *YH",
        "vin": "JF1SF65651H"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/17/2000",
        "dateOfIncident": "09/13/2000",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731717,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS NOT ENOUGH ROOM ON THE QUESTIONNAIRE TO SHOW THE ENTIRE DOT NUMBER WHICH IS DOT EL YT CHB 1000.  THIS TIRE FAILED AT 55 DEGREES TEMPERATURE, AT 60 MPH ON THE FREEWAY.  THE ODOMETER HAD ONLY 1563 MILES ON IT.  I HEARD A CLUNKING SOUND THAT ALARMED ME, SO I GOT INTO THE SLOW LANE.  AFTER A FEW MINUTES THE CLUNKING SOUND STOPPED.  A MINUTE OR SO LATER, THE TIRE FAILED.  THERE WAS NO EVIDENCE OF NAILS OR OTHER ROAD HAZARD, BUT THE TIRE DID HAVE A LOT OF TIRE DUST INSIDE IT.  I DID NOT GO IN TO WORK THAT DAY, SO I COULD REPLACE ALL MY TIRES AS SOON AS POSSIBLE.  I REPLACED 4 TIRES WITH MICHELINS AT A COST OF $408.29, AND I INTEND TO REPLACE THE 5TH TIRE AS SOON AS COSTCO GETS A NEW SHIPMENT IN.  I HAVE RETAINED ALL THE TIRES I REPLACED.  I HESITATED TO TAKE THE  TIRE TO FIRESTONE FOR EVALUATION, BECAUSE I DID NOT THINK THEY WOULD BE IMPARTIAL.( DOT NUMBER: ELYTCHB100 TIRE SIZE: P205/70R15 )",
        "vin": "JF1SF63501H"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/12/2000",
        "dateOfIncident": "05/20/2000",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 870239,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING AT NIGHT CONSUMER IS UNABLE TO SEE THE ROAD CLEARLY BECAUSE OF FAULTY HEADLIGHTS.*AK  NO LEFT OR RIGHT ADJUSTMENT FOR HEAD LIGHTS AND NOT ENOUGH LIGHT TO SEE THE EDGE OF THE ROAD.  ALSO HEAD LIGHTS ARE TO HIGH ON BRIGHT TO LOW ON DIM.  *YH",
        "vin": "JF1SF63511H"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/12/2000",
        "dateOfIncident": "07/20/2000",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 870263,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 30 MPH  AND AS A RESULT OF AN ACCIDENT CONSUMER RAN HEAD-ON INTO A POLE, AND AIR BAGS DID NOT DEPLOY. *AK",
        "vin": "JF1SF63551H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/25/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 724518,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE. *AK",
        "vin": "JF1SF65601H"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/01/2000",
        "dateOfIncident": "04/26/2000",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 861178,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "FORESTER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT IS FASTENED UNDER THE HIP, AND IT'S LIKE T SHAPE DESIGN.  SEAT BELT PINCHES CONSUMER IN THE SIDE, TO THE POINT THAT IS REALLY HARD TO GET BUCKLE UNLOOSENED.  IN AN ACCIDENT IT MAY BE HARD TO GET OUT OF VEHICLE.  *AK",
        "vin": "JF1SF63571H"
    }
]