[
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/08/2019",
        "dateOfIncident": "10/29/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11206351,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I CONTACTED SUBARU'S CUSTOMER SERVICE NUMBER AND TOLD THEM THAT THE SUBFRAME WAS BROKEN AND THAT THEY NEEDED TO FIX THE PROBLEM AND THEY SAID I WOULD HAVE TO PAY OUT OF POCKET AND THAT THE RECALL WAS COMPLETED IN AUGUST 2005 BUT THE SUBFRAME IS COMPLETELY RUSTED OUT AND BROKEN PLEASE CONTACT SUBARU AND GET THEM TO OPEN ANOTHER RECALL ON THESE CARS BECAUSE THE FIX THAT THEY USED DIDN'T WORK",
        "vin": "4S3BH806317"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "11/15/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818691,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD WEATHER, THERE IS A VERY STRONG SMELL OF GASOLINE INSIDE THE CAR. IT'S COMING FROM A FUEL LEAK NEAR THE PASSENGER SIDE OF THE ENGINE. I FIRST NOTICED IT ABOUT 4 YEARS (60,000 MILES) AGO. THE CAR CURRENTLY HAS 150,000 MILES ON IT. IT HASN'T BEEN FIXED YET. IT HASN'T CAUGHT FIRE YET EITHER.",
        "vin": "4S3BH686217"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "12/23/2015",
        "dateOfIncident": "05/23/2015",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10812003,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING THIS CAR ON MAY 23, 2015 WHEN HE WAS INVOLVED IN A SINGLE CAR ACCIDENT. THE CAR WAS IMMEDIATELY ENGULFED IN FIRE AND HE DIED AS A RESULT OF THE FIRE.",
        "vin": "4S3BH675517"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/04/2015",
        "dateOfIncident": "07/27/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10808438,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR SERVICE AND IT WAS DIAGNOSED THAT THE REAR SUB-FRAME WAS SEVERELY CORRODED. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN THE NHTSA CAMPAIGN NUMBER: 03V153000 (SUSPENSION). THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 157,000.",
        "vin": "4S3BH896317"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/04/2015",
        "dateOfIncident": "09/04/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761539,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC BECAUSE THE CHECK ENGINE LIGHT WAS ILLUMINATED. WHILE THE VEHICLE WAS BEING LIFTED, THE MECHANIC NOTICED THAT THE REAR SUBFRAME WAS EXTREMELY CORRODED. THE CONTACT WAS INFORMED BY THE MECHANIC THAT THE REAR SUBFRAME OF THE VEHICLE WAS CORRODED AND WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 113,000.",
        "vin": "4S3BH665X17"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713123,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. WHILE AT AN INDEPENDENT MECHANIC FOR A ROUTINE SERVICE REPAIR, THE TECHNICIAN STATED THAT THE REAR SUBFRAME WAS CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CONTACT WAS AWARE OF NHTSA CAMPAIGN NUMBER: 03V153000 (SUSPENSION), BUT THE VIN WAS NOT INCLUDED. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "4S3BH896217"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2015",
        "dateOfIncident": "03/29/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10702984,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SUNDAY 29 2015 AT 12.30 AM .. MY SON WAS DRIVING AND A LOUD NOISE WAS COMING FROM UNDER THE CAR . HE HAD SOME TROUBLE TO TURN AND STOP ON THE SIDE. HE DID IT ,WE HAD TO TOW THE CAR.  THE S ARM BROKE SUBFRAME  BROKE OFF. WAS ALL RUSTED ..  *TR",
        "vin": "4S3BH675X17"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/01/2015",
        "dateOfIncident": "01/31/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680429,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OUTSIDE TEMPERATURE WAS 25 DEGREES F. I WAS LEAVING FROM THE PARKING LOT AT WORK. AS I APPROACHED THE INTERSECTION THE BRAKES BECAME SO HARD THAT I COULDN'T PRESS THEM ANY FARTHER. I SIS SOME RESEARCH AND APPARENTLY LOTS OF OTHER SUBARU OWNERS HAVE EXPERIENCED THIS PROBLEM. IT APPEARS THAT THE CHECK VALVE ON THE BRAKE BOOSTER LINE FREEZES UP. IF I HAD BEEN MOVING ANY FASTER I WOULD HAVE WENT INTO THE INTERSECTION POSSIBLY CAUSING AN ACCIDENT OR WORSE.  *TR",
        "vin": "4S3BH806217"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/23/2015",
        "dateOfIncident": "01/22/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678569,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU LEGACY OUTBACK. THE CONTACT STATED THAT THE SUB FRAME WAS RUSTED. THE VEHICLE WAS TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT CORROSION HAD IMPAIRED THE FRAME. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 210,000.",
        "vin": "4S3BH896117"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2014",
        "dateOfIncident": "11/21/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667515,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU OUTBACK LIMITED. WHEN COLD WEATHER ARRIVES, VERY STRONG SMELL OF GASOLINE IN THE PASSENGER COMPARTMENT. MUST OPEN WINDOWS TO LET IT VENT. CONTINUES THROUGH COLD WEATHER YEAR AFTER YEAR.  *TR",
        "vin": "4S3BH686117"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/20/2014",
        "dateOfIncident": "02/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10659840,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT STATED THAT DURING COLD TEMPERATURES, STRONG FUEL FUMES EMITTED IN AND AROUND THE VEHICLE. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 102,000.",
        "vin": "4S3BH675417"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/17/2014",
        "dateOfIncident": "11/12/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10658755,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE COLD WEATHER STARTED NOV. 12, 2014 I HAVE SMELLED A RAW GAS SMELL IN MY 2001 SUBARU OUTBACK  WHEN I START IT.  IN TIME IT FADES AWAY, LIKE PERHAPS IT EVAPORATES ONCE THE ENGINE WARMS UP. I CAN ONLY GUESS AND SOME MORNINGS WHEN COLD THE SMELL IS OVERWHELMING, A RAW GAS ORDER ~ NOT A FAINT SMELL OF GAS.  VERY CONCERNED BREATHING THESE FUMES WHICH CAN'T BE HEALTHY OR SAFE.   THERE ARE PLENTY OF PEOPLE HAVING THIS PROBLEM AND IF ANYONE ENTERS...SUBARU OUTBACK COLD WEATHER GAS SMELL.. ON YOUR BROWSER YOU WILL LATTERLY SEE HUNDREDS IF NOT MORE PEOPLE LOOKING FOR HELP.  SOMETHING MUST BE DONE TO RECTIFY THIS PROBLEM.  *TR",
        "vin": "4S3BH675X17"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/14/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622302,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. WHILE PARKING, THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO A FENCE. THERE WERE NO INJURIES. THE VEHICLE WAS TAKEN TO THE DEALER, BUT THE FAILURE COULD NOT BE DUPLICATED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 53,000.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/13/2014",
        "dateOfIncident": "08/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621925,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON I-84 IN CT WHEN MY PASSENGER SIDE REAR TIRE BLEW. THE CAR FISHTAILED BUT I GOT IT SLOWED DOWN AND OVER TO THE SHOULDER WITHOUT GETTING INTO AN ACCIDENT. WHEN THE GARAGE PUT THE CAR UP ON A LIFT IT WAS DETERMINED THAT THE REAR SUBFRAME HAD BROKEN RIGHT WHERE THE UPPER CONTROL ARM CONNECTED TO IT WHICH ALLOWED THE TIRE TO LEAN IN TOWARDS THE BODY OF THE CAR WHERE IT RUBBED AGAINST THE BODY, HEATED UP AND THEN RUPTURED. THESE TIRES HAD JUST BEEN INSTALLED 3 DAYS EARLIER. LOOKING AT THE SUBFRAME IT WAS BADLY RUSTED, THE VARIOUS CONTROL ARMS ATTACHED TO IT HAD SOME SURFACE RUST BUT NOTHING LIKE THE SUBFRAME. THE UNDERSIDE OF THE CAR WAS NOT RUSTED.    THE SUBARU DEALER GAVE ME AN ESTIMATE OF $2000 TO REPLACE THE SUBFRAME, SINCE THE CAR WAS WORTHLESS OTHERWISE I TOLD HIM TO PROCEED.     I FOUND OUT THAT MY VEHICLE HAD BEEN SUBJECT TO A RECALL FOR \"CERTAIN REAR SUSPENSION SUBFRAME COMPONENTS WERE PRODUCED WITH POOR PAINT QUALITY \" ...\"WHICH, AFTER CONTINUED EXPOSURE TO CORROSIVE ROAD SALTS FOR A PERIOD OF SEVERAL YEARS, COULD RESULT IN RUST-OUT OF THE COMPONENT AND POSSIBLE BREAKAGE OF THE SUBFRAME. IF SUCH BREAKAGE OCCURS WHILE THE VEHICLE IS BEING OPERATED, CONTROL OF THE VEHICLE COULD BE AFFECTED, INCREASING THE RISK OF A CRASH.\" MY VEHICLE GOT \"TREATED\" FOR THE RECALL WHICH INCLUDED CLEANING THE SUBFRAME AND PAINTING IT.    I CALLED SUBARU OF AMERICA AND ASKED IF THEY WOULD BE WILLING TO SHARE IN THE COSTS SINCE IT WAS OBVIOUS THAT THE RECALL \"TREATMENT\" DID NOT WORK AND THERE WAS NO REASON, EXCEPT A DEFECTIVE PAINT JOB, FOR A SUBFRAME TO FAIL ON A 13 YEAR OLD CAR. THE DECLINED TO HELP ME CITING THE AGE OF THE CAR AND THE FACT THAT THE RECALL \"WORK\" HAD BEEN PERFORMED. THEY ALSO OFFERED A $500 COUPON IF I WANTED TO BUY A NEW SUBARU.    I BELIEVE THAT THESE VEHICLES NEED TO BE RECALLED AND THE REAR SUBFRAME REPLACED ON SUBARU DIME.  *TR",
        "vin": "4S3BH675417"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/17/2014",
        "dateOfIncident": "06/13/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598864,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT STATED THAT WHILE DRIVING 15 MPH, HE LOST CONTROL OF THE VEHICLE AND SPUN OUT OF CONTROL, CRASHING INTO AN EMBANKMENT. AFTER INSPECTING THE VEHICLE, THE CONTACT NOTICED THAT THE REAR DRIVER SIDE TIRE WAS COMPLETELY BENT INWARD AND THE SUBFRAME WAS FRACTURED DUE TO CORROSION. A POLICE REPORT WAS NOT FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC, WHO VERIFIED THE FAILURE AND STATED THAT THE REAR SUB FRAME NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE HAD PREVIOUSLY BEEN REPAIRED UNDER RECALL NHTSA CAMPAIGN NUMBER: 03V153000 (SUSPENSION). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 250,000.",
        "vin": "4S3BH686217"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/07/2014",
        "dateOfIncident": "03/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567874,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I CURRENTLY OWN AND DRIVE A 2001 SUBARU OUTBACK.  I WAS RECENTLY MADE AWARE OF AN ISSUE WITH MY SUB FRAME ROTTING OUT.  THERE WAS A RECALL PLACED ON THIS ISSUE AND THE RECALL WAS APPARENTLY PERFORMED ON MY VEHICLE.  THE SUBSEQUENT PAINTING OF THE SUB FRAME ONLY MASKED THE PROBLEM, LEADING TO WHAT SEEMS AN UNAVOIDABLE FAILURE OF THE PART.  WITH SOME INVESTIGATION I FOUND THAT NEARLY EVERY SUBARU THAT WAS INCLUDED IN THIS RECALL, IS NOW FAILING AND IS UNSAFE TO DRIVE.  THE DEALER I BROUGHT MY CAR TO EVEN STATED THAT THIS IS A COMMON REPAIR IN THEIR SHOP.  THE TOTAL QUOTE FOR REPAIR IS AROUND $1400, WHICH I CANNOT AFFORD AT THIS TIME.  MY PROBLEM WITH THIS IS THAT NUMEROUS CAR OWNERS ARE UNAWARE OF THIS FAILURE, AND THAT THE RECALL WORK DID NOTHING TO ABSOLVE THE SITUATION.  SUBARU STATED BECAUSE OF THE AGE OF THE VEHICLE, THEY COULD NOT ASSIST WITH THE REPAIR, BUT OTHER THAN THIS PROBLEM, THE CAR IS IN PERFECT WORKING ORDER.  THE RECENT RECALL BY TOYOTA SEEMS EXTREMELY SIMILAR, AND I WAS HOPING THAT THIS WOULD BE RESOLVED IN A SIMILAR WAY.  ANY INFORMATION ON HOW TO PROCEED WOULD BE GREATLY APPRECIATED.  THANK YOU  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/20/2014",
        "dateOfIncident": "03/30/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10565158,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT STATED THAT THE REAR SUSPENSION AND SUB FRAME WAS FOUND SEVERELY TO BE CORRODED DURING A ROUTINE INSPECTION. THE SUB FRAME AND SUSPENSION WERE ALSO FRACTURED. THE DEALER ADVISED THE CONTACT THAT NHTSA CAMPAIGN NUMBER: 03V153000 (SUSPENSION) WAS PREVIOUSLY PERFORMED AND DENIED ANY FURTHER ASSISTANCE WITH THE REPAIR. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE.  THE FAILURE AND CURRENT MILEAGE WAS 184,000.   ..UPDATED 04-22-14 *BF UPDATED 08/03/2017*JS",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/20/2013",
        "dateOfIncident": "11/17/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553133,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON AN INTERSTATE HIGHWAY IN THE MIDDLE LANE AT 65-70 MPH WITH CRUISE CONTROL SET WHEN TRAFFIC SLOWED DOWN SUDDENLY. MY FIRST REACTION IN THIS CASE IS  TO PULL THE SPEED CONTROL LEVER TOWARDS ME TO DISENGAGE IT AND TAKE MANUAL CONTROL OF THE CAR TO SLOW DOWN BY BRAKING OR DOWNSHIFTING, AS PER USUAL PROCEDURE. IN THIS CASE THROTTLE FAILED TO DECELERATE AFTER SEVERAL ATTEMPTS, UPON WHICH I THEN REPEATEDLY STAMPED THE BRAKE PEDAL, WHICH WAS ALSO UNRESPONSIVE (DID NOT CANCEL ACCELERATION OR SLOW THE VEHICLE). OUT OF OPTIONS, I SWERVED TO THE LEFT TO AVOID THE TRACTOR-TRAILER DIRECTLY IN FRONT OF ME AND REAR ENDED A MOVING VEHICLE IN THE LEFT LANE. WITH BRAKES STILL UNRESPONSIVE, I MANAGED TO CUT ACROSS TO THE SHOULDER WHERE I WAS ABLE TO STOP THE CAR BY DOWNSHIFTING IN ADDITION TO USING THE HANDBRAKE.   *TR",
        "vin": "4S3BH665116"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2013",
        "dateOfIncident": "10/10/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549530,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SMELLS LIKE FUEL WHEN IDLING ON A COLD DAY. RUBBER FUEL LINES AND FUEL FILTER WERE LOOSE AND AFTER TIGHTENING THEM FUEL SMELL TEMPORARILY STOPPED. SMELL HAS RETURNED AND AFTER CALLING SUBARU DEALERSHIP THEY ACKNOWLEDGED THE ISSUE WAS RELATED TO RUBBER FUEL LINES THAT NEEDED REPLACING. THIS IS A COMMON PROBLEM WITH SUBARU'S AND NEEDS TO BE ADDRESSED BY SUBARU. DEALERSHIP IS ASKING OVER $300 TO REPLACE FOUR RUBBER FUEL LINES LOCATED UNDER THE MANIFOLD AND THIS IS AT LEAST EVERY YEAR IT HAS TO BE DONE THAT'S SOUNDS LIKE A RECALL ISSUE TO ME         I TIGTHEN THE SCREWS A FEW TIME AND SOMEHOW WHEN IT'S COLD WEATHER IT TEND TO GET LOOSE AND VAPOR COMES OUT VERY DANGEROUS I CHECK THIS ISSUE ONLINE USING GOOGLE SEARCH AND NOTICE THIS IS A KNOWN ISSUES AND GOES BACK MANY YEARS THERE SHOULD BE A RECALL JUST LIKE THE 2002 IT IS THE SAME HOSE SAME AREA. THIS MAKES NO SENSE THAT SUBARU WOULD NOT FIX IT FOR FREE WITH A BETTER SOLUTION THAN REPLACE THE HOSES AND CLAMPS EVERY YEAR.  *TR",
        "vin": "4S3BH675017"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/19/2013",
        "dateOfIncident": "06/29/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536084,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS PURCHASED AT APPROXIMATELY 150K MILES TWO YEARS AGO AND HAS JUST OVER 167K MILES NOW. WHILE BEING LOOKED AT BY MECHANIC IN JUNE 2013, MECHANIC NOTED THAT THE REAR SUBFRAME WAS ROTTED AND REAR TRAILING ARM BUSHINGS NEEDED TO BE REPLACED. SUBARU ACKNOWLEDGED THIS ISSUE, WITH RECALL NUMBER WWM-96 (NHTSA RECALL NO. 03V153). I USE THIS CAR ON A DAILY BASIS FOR WORK AND HAVE KEPT UP WITH MAINTENANCE AND CARE, REPLACING ALL WHEEL BEARINGS AND THE HEAD GASKETS WITHIN THE FIRST YEAR OF OWNING THE VEHICLE. ON 8/19/2013, I CALLED SUBARU TO SPEAK WITH A CUSTOMER SERVICE REPRESENTATIVE TO HOPEFULLY RESOLVE THE SUBFRAME RECALL ISSUE, AND THEY REFUSED TO REPLACE THE AFFECTED PART OR EVEN WORK WITH ME ON A SOLUTION. I WAS TOLD, \"THERE IS NOTHING WE CAN DO FOR YOU,\" LEAVING ME WITH A VEHICLE THAT IS UNSAFE TO DRIVE, BECAUSE OF A POOR QUALITY PART MADE BY SUBARU. I WAS OFFERED NO ASSISTANCE OTHER THAN BEING TOLD TO CONTACT MY LOCAL SUBARU DEALER FOR REPAIRS. AFTER DOING MUCH RESEARCH ONLINE, I'VE DISCOVERED THAT I AM NOT ALONE IN THIS BATTLE, AND I AM HOPING THAT SUBARU OR NHTSA CAN DO SOMETHING TO HELP KEEP ME SAFE WHILE DRIVING MY VEHICLE.  *TR",
        "vin": "4S3BE686217"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/29/2013",
        "dateOfIncident": "01/22/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10495129,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE WEATHER GETS VERY COLD (BELOW FREEZING) THE CAR BEGINS TO GET A FUEL SMELL.  IT IS EXTREMELY STRONG INSIDE THE VEHICLE, ALTHOUGH YOU CAN SMELL IT OUTSIDE THE CAR AS WELL.  THE FIRST TIME I NOTICED IT HAPPENING WAS IN 2006.  TOOK IT TO DEALER WHO CHECKED IT AND FOUND NO LEAKS. ODOR WENT AWAY AFTER A FEW DAYS SITTING OUTSIDE DEALERSHIP SO THEY DID NOT DO ANYTHING (WEATHER MAY HAVE WARMED UP). IT HAPPENED AGAIN IN 2008 AND THIS TIME THEY SAID THERE WAS A FUEL LEAK SO THEY REPLACED THE FUEL HOSE AND CLAMP. IT WORKED UNTIL THE FOLLOWING YEAR WHEN IT GOT COLD AGAIN.  LOOKING AT VARIOUS POSTS ON THE INTERNET FOUND MANY OTHERS WITH THE SAME PROBLEM.  I TIGHTENED THE CLAMPS AROUND SOME OF THE HOSES AROUND THE FILTER AND IT MOSTLY WORKED.  WHEN THE WEATHER IS WARMER THERE IS NO PROBLEM.  THIS IS A TEMPORARY FIX AND SOMETIMES DOES NOT WORK SO WELL, ESP. WHEN REALLY COLD OUT.  THERE HAS TO BE ANOTHER ANSWER TO THIS PROBLEM.  WHAT IS SUBARU'S RESPONSE?  REPLACING HOSES AND CLAMPS EVERY YEAR IS NOT A SOLUTION!  *TR",
        "vin": "4S3BH665617"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/18/2012",
        "dateOfIncident": "04/20/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458889,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN 03V153000, WHICH RESULTED IN MANUFACTURER RECALL WWM96-REAR.  THIS RECALL WAS PERFORMED ON MY VEHICLE ON 4/13/2004 AT 36,339 MILES WITH THE INTENDED PURPOSE OF HALTING PREMATURE RUST-OUT OF THE REAR SUB-FRAME COMPONENT.  IN THE PROCESS OF RECENTLY REPLACING EXHAUST COMPONENTS AT APPROXIMATELY 130,000 MILES IT WAS NOTED THAT THE REAR SUB-FRAME COMPONENT IS NOW PERFORATED BY RUST EVEN THOUGH SIMILAR COMPONENTS ARE NOT, WHICH WOULD SEEM TO INDICATE THAT THE ORIGINAL REPAIR WAS NOT ADEQUATE.  AN EXCHANGE OF EMAILS AND TELEPHONE CALLS WITH SUBARU OF AMERICA HAS RESULTED IN A DECISION BY THEM TO DECLINE REPAIR OR REPLACEMENT OF THE COMPONENT AT THEIR EXPENSE DUE TO THE AGE OF THE VEHICLE.  THE ONLY REMEDY OFFERED WAS A $500 CREDIT TOWARD THE PURCHASE OF A NEW SUBARU.  SINCE REPLACEMENT IS NOT AN OPTION FOR ME AT THIS TIME I HAVE NO CHOICE BUT TO CONTINUE OPERATING THE VEHICLE IN ITS CURRENT CONDITION.  MY SAFETY CONCERN IS THAT IN OPERATING THE VEHICLE TO WHAT I CONSIDER A REASONABLE POINT (200,000 MILES), THE CONSEQUENCE NOTED IN CAMPAIGN 03V153000 MAY OCCUR.  I HAVE PICTURES OF THE SUB-FRAME COMPONENT AND COPIES OF THE EMAIL EXCHANGE WITH SUBARU OF AMERICA WHICH I CAN SEND TO YOU IF YOU SO DESIRE. *TR",
        "vin": "4S3BH686017"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/19/2012",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452188,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SMELLS LIKE FUEL WHEN IDLING ON A COLD DAY.  RUBBER FUEL LINES AND FUEL FILTER WERE LOOSE AND AFTER TIGHTENING THEM FUEL SMELL TEMPORARILY STOPPED.  SMELL HAS RETURNED AND AFTER CALLING SUBARU DEALERSHIP THEY ACKNOWLEDGED THE ISSUE WAS RELATED TO RUBBER FUEL LINES THAT NEEDED REPLACING.  THIS IS A COMMON PROBLEM WITH SUBARU'S AND NEEDS TO BE ADDRESSED BY SUBARU.  DEALERSHIP IS ASKING OVER $300 TO REPLACE FOUR RUBBER FUEL LINES LOCATED UNDER THE MANIFOLD.    *JS",
        "vin": "4S3BE686917"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2012",
        "dateOfIncident": "03/10/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451137,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT WAS HAVING AN OIL CHANGE PERFORMED AND WAS ADVISED BY THE MECHANIC THAT THERE WAS EXCESSIVE RUST ON THE FRAME. THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN I.D. NUMBER:  03V153000 (SUSPENSION:REAR) IN WHICH AN ANTI- RUST COATING WAS APPLIED TO THE VEHICLE. THE CONTACT CALLED THE MANUFACTURER REGARDING THE REPAIR THAT WAS PERFORMED UNDER THE RECALL AND THE RECENT RUST FAILURE. THE MANUFACTURER ADVISED THAT THEY HAD PERFORMED THE RECALL IN 2003 AND COULD NOT ASSIST WITH THE RECENT FAILURE.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 195,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/11/2012",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443484,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT STATED THAT THE VEHICLE WAS PARKED AND HE NOTICED THAT BOTH FRONT SENT BELTS WOULD NOT PROPERLY RETRACT, LEAVING A LOT OF SLACK BETWEEN VEHICLE OCCUPANTS AND THE SEAT BELTS. THE VEHICLE WAS NOT TAKEN TO HAVE THE FAILURE DIAGNOSED OR REPAIRED. THE CONTACT ALSO STATED THAT THE ENGINE WAS LEAKING OIL ONTO THE EXHAUST MANIFOLD. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT THE REAR MAIN ENTRANCE SEAL ON THE ENGINE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURES, BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 165,000.",
        "vin": "4S3BH675817"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2011",
        "dateOfIncident": "10/13/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441603,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2001 SUBARU OUTBACK WHEN THE TEMPERATURE OUTSIDE IS BELOW FREEZING AROUND 28 DEGREES OR LOWER, THERE IS A STRONG ODOR OF GASOLINE INSIDE THE PASSENGER AREA. I MADE AN APPOINTMENT WITH A SUBARU DEALER FOR JANUARY 5TH, HOWEVER I RESEARCHED ONLINE AND FOUND THIS PROBLEM IS COMMON WITH NO CLEAR FIX. I DON'T WANT TO TAKE IT TO THE DEALER IF THIS PROBLEM ISN'T GOING TO BE FIXED. WHAT REMEDY HAS SUBARU OFFERED FOR THIS PROBLEM?   *KB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2011",
        "dateOfIncident": "09/22/2011",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428285,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. WHILE DRIVING APPROXIMATELY 65 MPH, THE CONTACT NOTICED A BURNING SMELL IN THE VEHICLE.  SUDDENLY, THERE WERE FLAMES UNDER THE BUTTONS OF THE FRONT DRIVER SIDE ARM REST. THE CONTACT STOPPED THE VEHICLE AND WAS ABLE TO EXTINGUISH THE FIRE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTICS. THE MECHANIC STATED THERE WAS A SHORT IN THE WIRES CONNECTED TO THE SIDE VIEW MIRROR DEFROSTER. THE VEHICLE WAS REPAIRED.  THE APPROXIMATE FAILURE MILEAGE WAS 142,000.   UPDATED 12/22/11*LJ  THE CONSUMER STATED WITHIN A MINUTE, THE FIRE OPENED A HOLE IN ON THE INSIDE OF THE DRIVERS DOOR. APPROXIMATELY TWO INCHES WIDE WITH FLAMES. UPDATED 12/28/11",
        "vin": "4S3BH806917"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/27/2011",
        "dateOfIncident": "07/11/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415388,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT STATED THE FRAME UNDER THE VEHICLE WAS RUSTED AND CORRODED. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO INSPECTED THE VEHICLE AND CONFIRMED THE FAILURE.  THE VEHICLE WAS THEN TAKEN TO THE DEALER WHO ADVISED THAT THERE WERE NO RECALLS FOR THE FAILURE. THE MANUFACTURER WAS CONTACTED WHO OFFERED NO FURTHER ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 106,000. UPDATED 08/31/2011 *LN  THE CONSUMER STATED THE VEHICLE WAS RECALLED IN 2003 FOR DEFECTIVE PAINT ON THE FRAME, WHICH COULD RESULT IN FRAME RUST. THE CONSUMER CONTACTED SUBARU BY PHONE AND LETTER AND THEY REFUSED ANY ASSISTANCE. THEY CLAIMED THE WERE NOT LIABLE REGARDING OF CRASH DANGER.  UPDATED 09/01/11   *TR",
        "vin": "4S3BH675717"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/09/2011",
        "dateOfIncident": "05/07/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399599,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 SUBARU OUTBACK. THE CONTACT WAS DRIVING 35 MPH WHEN THE SUB FRAME OF THE VEHICLE FRACTURED. THE CONTACT STATED THAT THE DEALER ADVISED THAT NHTSA CAMPAIGN ID NUMBER: 03V153000 (SUSPENSION: REAR) WAS PERFORMED ON THE VEHICLE IN 2004. THE RECALL REQUIRED THE MANUFACTURER TO SPRAY AN ANTI RUST AND WAX ONTO THE SUB FRAME AND AXLE. THE CONTACT STATED THAT THE RECALL REPAIR DID NOT PREVENT THE FAILURE FROM OCCURRING AND THE SUB FRAME AND REAR AXLE WERE BOTH FRACTURED DUE TO RUST. THE VIN WAS UNAVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 125,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/04/2011",
        "dateOfIncident": "02/03/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380211,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 20 DEGREE WEATHER (FAHRENHEIT) AN OVERWHELMING GASOLINE ODOR FILLED THE CABIN OF MY 2001 SUBARU LEGACY WAGON (OUTBACK). THIS HAPPENED ON THREE DIFFERENT TRIPS AROUND TOWN YESTERDAY. I HAVE A 2.5L ENGINE, USING 87 OCTANE GASOLINE. THE CHECK ENGINE LIGHT DID NOT ELIMINATE DURING THESE EPISODES. I LIFTED THE ENGINE COMPARTMENT HOOD WHEN THIS HAPPENED A THIRD TIME AND FOUND THE VAPOR SMELL WAS STRONGEST NEAR THE INTAKE MANIFOLD. THERE WAS NO EVIDENCE OF FUEL LEAKING FROM ANY NEOPRENE OF STEEL LINES. OBVIOUSLY THE ODOR WAS COMING FROM THE ENGINE COMPARTMENT THROUGH THE HEATING SYSTEM VENTS (THE CLIMATE CONTROL FAN WAS TURNED TO HIGH). THE ODOR WAS SO STRONG, IT WAS OVERWHELMING EVEN WHEN THE VENTS WERE BLOWING RECIRCULATED AIR FROM THE BEGINNING OF THE TRIP. I BELIEVE A SPARK COULD HAVE EASILY RESULTED IN AN EXPLOSION.  *TR",
        "vin": "4S3BH675916"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2011",
        "dateOfIncident": "02/02/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380087,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU LEGACY OUTBACK. FUEL VAPOR SMELL IN CABIN WHEN TEMPERATURES FALL BELOW FREEZING. THIS HAS BEEN A PERSISTENT PROBLEM FOR THE THREE WINTERS WE HAVE OWNED THE CAR. THIS FALL I FOUND SEVERAL COMMENTS ONLINE WHICH PROMPTED ME TO TIGHTEN THE HOSE CLAMPS ON FUEL LINES RUNNING TO/FROM THE ENGINE COMPARTMENT FUEL FILTER. THIS SEEMED TO HELP UNTIL THE LAST 2-3 DAYS WHEN WE EXPERIENCED PROLONGED TEMPERATURES OF 0 TO -15F. NOW THE SMELL IS BACK AND THE LOCAL SUBARU DEALER SUGGESTS THE PROBLEM OFTEN INVOLVES FUEL HOSES BENEATH THE INTAKE MANIFOLD, WHICH THEY ESTIMATE $370 TO REPAIR. BASED ON NUMEROUS COMPLAINTS AND COMMENTS I HAVE FOUND ONLINE, SOME DATING BACK TO 2003, I AM SHOCKED THAT SUBARU HAS BEEN AWARE OF THIS PROBLEM FOR SO LONG AND FAILED TO ISSUE A RECALL. GASOLINE VAPOR IS A SIGNIFICANT HEALTH HAZARD. NOT ONLY IS IT A CARCINOGEN AND KNOWN TO CAUSE BRAIN DAMAGE, BUT SHORT TERM EXPOSURE AT THE VERY LEAST MAY CONTRIBUTE TO DIZZINESS AND IMPAIRED DRIVING ABILITY, LEADING TO POSSIBLE INJURY OR DEATH... NOT TO MENTION THE RISK OF FIRE, ALSO WITH POTENTIALLY DIRE CONSEQUENCES. THIS IS OUR FAMILY'S PRIMARY VEHICLE AND I CANNOT IN GOOD CONSCIENCE ALLOW MY WIFE AND CHILD TO TRAVEL UNDER SUCH HAZARDOUS CONDITIONS. I WISH SUBARU SHARED MY OPINION. WE WILL NOT USE THE VEHICLE UNTIL REPAIRS CAN BE PERFORMED, ALBEIT AT MY OWN COST RATHER THAN THE MANUFACTURER.  *TR",
        "vin": "4S3BH665317"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2011",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379604,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 SUBARU OUTBACK STATION WAGON.  ON VERY COLD DAYS, THERE IS A STRONG SMELL OF FUEL THAT PERVADES THE PASSENGER CABIN.  WE HAD TO DRIVE WITH WINDOWS OPEN EVEN WHEN 20-DEGREES OUTSIDE OR EXPOSE MY 3YR SON TO THE GAGGING FUMES.  THIS PROBLEM IS A KNOWN ISSUE (THERE ARE LITERALLY 1000'S OF POSTS ON SUBARU OWNERS WEB BOARDS)  BUT MY LOCAL MECHANIC WAS INITIALLY NOT ABLE TO FIND THE PROBLEM. SUBARU OF AMERICA HAS NOT ISSUED A TECHNICAL SERVICE BULLETIN TO MAKE OWNERS AWARE OF THIS COMMON FAILURE IN SUBARU FUEL LINES.  ONCE WE FOUND EXPLANATORY MATERIAL ON THE WEB, WE HAD THE LOCAL MECHANIC REPLACE THE FUEL LINES FOR ABOUT $300.  GIVEN HOW COMMON THE PROBLEM IS AND HOW POTENTIALLY DANGEROUS A FUEL LINE LEAK IN THE ENGINE COMPARTMENT COULD BE, THE NHTSA SHOULD FORCE SUBARU TO ADDRESS THIS PROBLEM.  IN ADDITION TO THE IMMEDIATE DANGER, THEIR LACK OF ACTION ALSO IS LEADING TO OWNERS EXPOSING THEMSELVES TO FUEL FUMES IN THE PASSENGER CABIN AS THE PROBLEM IS INTERMITTENT AND THUS HARD FOR MECHANICS TO DIAGNOSE AND REPAIR.  *TR",
        "vin": "4S3BH665227"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2011",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378806,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDERHOOD FUEL HOSES ARE ALLOWING LEAKAGE AT LOW TEMPERATURES.  *TR",
        "vin": "4S3BH686417"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2011",
        "dateOfIncident": "12/15/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376744,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU OUTBACK, 4 CYL. STRONG GAS SMELL WHEN OUTSIDE AIR/HEATER IS ON AND TEMPERATURE IS AROUND FREEZING OR BELOW. IT HAS HAPPENED LAST 3 YRS AND FUMES CAN BE AVOIDED BY CHANGING TO RECIRCULATING AIR. DEALER AND OTHER MECHANIC COULD NOT FIND PROBLEM. *TR",
        "vin": "4S3BH686317"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/17/2010",
        "dateOfIncident": "12/10/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371033,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 SUBARU OUTBACK, THAT WHEN THE WEATHER GETS COLD, SOMEWHERE AT AND BELOW 30 DEGREES, I GET A GAS ODOR IN AND OUTSIDE THE CAR. I HAVE RESEARCHED THIS ON THE INTERNET AND FOUND THAT THIS IS AN *EXTREMELY* COMMON PROBLEM WITH THE CAR'S GAS LINES AND THAT SUBARU IS ONLY ACKNOWLEDGING THE ISSUE ON 2002 AND NEWER MODELS. HAVE YOU RESEARCHED THIS ISSUE BEFORE AND CAN YOU TELL ME WHY NO RECALL ON 2001S WAS EVER DONE? THANK YOU. *TR",
        "vin": "4S3BE686717"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2010",
        "dateOfIncident": "12/28/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369735,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU OUTBACK. WHILED DRIVING APPROXIMATELY 50 MPH, THE CONTACT SMELLED AN ODOR INSIDE THE VEHICLE. ALL THE PASSENGERS COMPLAINED OF A HEADACHE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO REPAIRED A LEAKING FUSE HOSE. THE FAILURE OCCURRED AGAIN AND WAS NO LONGER DRIVABLE. THE VEHICLE HAD NOT BEEN REPAIRED AGAIN. THE FAILURE MILEAGE WAS APPROXIMATELY 113,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 120,000.",
        "vin": "4S3BH665217"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "05/23/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341732,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU OUTBACK HAS STRONG GASOLINE SMELL INSIDE CABIN UPON STARTING ENGINE.  OUTSIDE TEMPERATURE IS ABOVE 80- DEGREES...NOT COLD.  SMELL DISSIPATES AS CAR RUNS AFTER ABOUT 3 MINUTES. *TR",
        "vin": "4S3BH665817"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": true,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "10/26/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303598,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING A MCDONALD'S DRIVE-IN WITH VEHICLES CLOSE TO BUMPER TO BUMPER WITH MY FOOT SECURELY ON THE BRAKE. MY 2001 SUBARU OUTBACK SUDDENLY ACCELERATED WILDLY AND, BEFORE I COULD SHIFT INTO NEUTRAL AND PRESS HARDER ON THE BRAKES, CAREENED INTO THE CAR DIRECTLY AHEAD. MY AUTO ACTUALLY PUSHED THE AUTO AHEAD SOME 5-6 FT. BEFORE I COULD GET IT UNDER CONTROL.I REPORTED THE ACCIDENT TO THE POLICE AND INSURANCE CO.IT COST ME A $500 DEDUCTIBLETO HAVE MY VEHICLE REPAIRED. I BROUGHT MY AUTO TO A SUBARU DEALER FOR REVIEW.   THEY CLAIM TO HAVE FOUND NOTHING AWRY. I HAVE EXPERIENCED SIMILAR INSTANCES OF UNINTENDED ACCELERATION ON 4-5 OCCASIONS. DRIVING THIS AUTO IS NOW QUITE FRIGHTENING. *TR",
        "vin": "4S3BH675717"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/18/2010",
        "dateOfIncident": "12/01/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10300199,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR IS A SUBARU OUTBACK 2001.  COMPLAINT IS STRONG FUEL SMELL AND VAPORS IN  THE CAR CABIN WHEN OUTSIDE AIR TEMPERATURE FALLS BELOW 30 DEGREES OR SO.  SMELL PERMEATES OUR CLOTHING TO THE EXTENT THAT WHEN WE LEAVE THE CAR AND ENCOUNTER PEOPLE, THEY COMMENT THAT WE SMELL LIKE GASOLINE.  FUEL LINES HAVE BEEN CHECKED AS HAVE CLAMPS AND HOSES.  NO RESOLUTION.  WE MUST DRIVE BREATHING STRONG FUMES.  OPENING WINDOWS DISSIPATES FUMES SOMEWHAT, BUT NOT COMPLETELY.  PROBLEM IS WORSE WITH HEATER RUNNING, SO WE TURN IT OFF.  ADDITIONAL CONCERN IS THAT WHEN DRIVING WITHOUT HEAT, THE FRONT WINDSHIELD DEFROSTER IS NOT OPERATIONAL, RESULTING IN THE WINDSHIELD BEING ICED OVER AND/OR COVERED WITH CONDENSATION. THIS CAUSES VISUAL IMPAIRMENT AND IS A DRIVING HAZARD. *TR",
        "vin": "4S3BH665116"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "01/05/2010",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298344,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DOES NOT BRAKE PROPERLY WHEN COLD IN SUB-FREEZING WEATHER CONDITIONS.  VEHICLE CONSISTENTLY HAS GREATLY INCREASED STOPPING DISTANCES WHEN IT IS VERY COLD OUT AND THE CONDITION RESOLVES ONCE THE VEHICLE HAS WARMED UP. *TR",
        "vin": "4S3BH806717"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/04/2010",
        "dateOfIncident": "12/28/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298045,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 SUBARU OUTBACK THAT WHEN THE WEATHER GETS COLD, SOMEWHERE AT AND BELOW 30 DEGREES, I GET A GAS SMELL IN AND OUTSIDE THE CAR. I HAVE RESEARCHED THIS ON THE INTERNET AND FIND THIS IS A COMMON PROBLEM  WITH THE CAR'S GAS LINES AND THAT SUBARU IS ONLY ACKNOWLEDGING THE ISSUE ON 2002 AND NEWER MODELS. HAVE YOU RESEARCHED THIS ISSUE BEFORE AND CAN YOU TELL ME WHY NO RECALL ON 2001S WAS EVER DONE? THANK YOU. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2009",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296069,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE STRONGLY AGREE WITH THE COMPLAINT FILED 12/9/09 LISTED BELOW.  WE ALSO HAVE A 2001 SUBARU OUTBACK AND HAVE HAD THE SUBARU DEALERSHIP CHECK OUT THIS PROBLEM SEVERAL TIMES.  WE HAVE HAD FUEL HOSES REPLACED AND CLAMPS TIGHTENED AND REPLACED MANY TIMES AND THE PROBLEM REMAINS.  OBVIOUSLY THE PROBLEM IS ELSEWHERE IN THE FUEL SYSTEM.    WHILE EVERY WINTER FOR AT LEAST THE LAST 5-6 WINTER SEASONS OUR FAMILY SMELLS AND BREATHES IN GASOLINE FUMES AND HAVE TO OPEN WINDOWS TO AIR OUT THE CABIN FROM THE STRONG GASOLINE SMELL.  WE ALSO REFRAIN FROM USING THE HEATING SYSTEM AT TIMES BECAUSE THE SMELL IS MUCH MORE NOTICEABLE WHEN WE RUN THE HEATER.      WE HAVE ALSO FOUND COUNTLESS COMPLAINTS ONLINE REGARDING THIS SUBARU ISSUE.  DOES A FIRE, DAMAGE, CRASH, INJURY OR DEATH HAVE TO OCCUR BEFORE SUBARU OR THE NHTSA WILL ADDRESS THIS PROBLEM?    COMPONENT: FUEL SYSTEM, GASOLINE    DETAILS: IN COLD WEATHER, MY 2001 SUBARU OUTBACK HAS AN EXTREMELY STRONG SMELL OF GASOLINE. A QUICK SEARCH WILL REVEAL HUNDREDS OF COMPLAINTS ON THE SAME ISSUE. THERE HAS BEEN A TECHNICAL SERVICE BULLETIN ISSUED BY SUBARU ON THIS ISSUE--NHTSA ITEM # 616334, SERVICE BULLETIN # 010101. THE TSB RECOMMENDS AN \"INSPECTION PROCEDURE FOR POSSIBLE REPLACEMENT OF 3 FUEL HOSES\". HOWEVER, THE SUBARU DEALER INDICATES THE ISSUE CALLS FOR A REPLACEMENT OF THE ENTIRE FUEL RAIL--COSTING MORE THAN $400. I CANNOT BELIEVE THAT NEITHER THE NHTSA NOR SUBARU HAVE NOT CATEGORIZED A SYSTEMIC PROBLEM WITH LEAKING GASOLINE AS A SAFETY ISSUE. *TR    OCCURRENCES: 1 INJURIES: 0   FAIL DATE: 12/07/2005 DEATHS: 0   DATE ADDED TO DATBASE: 12/9/2009",
        "vin": "4S3BH665416"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "12/07/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295091,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER, MY 2001 SUBARU OUTBACK HAS AN EXTREMELY STRONG SMELL OF GASOLINE.  A QUICK SEARCH WILL REVEAL HUNDREDS OF COMPLAINTS ON THE SAME ISSUE.  THERE HAS BEEN A TECHNICAL SERVICE BULLETIN ISSUED BY SUBARU ON THIS ISSUE--NHTSA ITEM # 616334, SERVICE BULLETIN # 010101.  THE TSB RECOMMENDS AN \"INSPECTION PROCEDURE FOR POSSIBLE REPLACEMENT OF 3 FUEL HOSES\".  HOWEVER, THE SUBARU DEALER INDICATES THE ISSUE CALLS FOR A REPLACEMENT OF THE ENTIRE FUEL RAIL--COSTING MORE THAN $400.  I CANNOT BELIEVE THAT NEITHER THE NHTSA NOR SUBARU HAVE NOT CATEGORIZED A SYSTEMIC PROBLEM WITH LEAKING GASOLINE AS A SAFETY ISSUE. *TR",
        "vin": "4S3BH665417"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258764,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER VERY STRONG FUEL ODOR IN PASSENGER COMPARTMENT. SMELL IS STRONG ENOUGH TO MAKE PASSENGERS FEEL ILL.  THIS HAPPENS ALL THE TIME WHEN OUTSIDE TEMP GOES BELOW FREEZING. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/20/2009",
        "dateOfIncident": "01/17/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255780,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE WEATHER IS VERY COLD OUT (IT WAS -15 TO -20 CELSIUS WHEN THIS HAPPENED) THERE IS NO VACUUM ASSIST FOR THE BRAKES.  THIS IS A COMMON PROBLEM (CHECK AT WWW.SUBARUOUTBACK.ORG).  THE VEHICLE IS A 2001 SUBARU OUTBACK AND THE PROBLEM SEEMS TO BE A CHECK VALVE IN THE VACUUM LINE RUNNING TO THE BRAKE BOOSTER.  IN COLD WEATHER, THE CHECK VALVE FREEZES AND THERE IS NO VACUUM TO THE BRAKE BOOSTER.  THIS MAKES THE BRAKE PEDAL EXTREMELY HARD TO PUSH AS THE IS NO POWER ASSIST WHEN THERE IS NO VACUUM TO THE BOOSTER.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2008",
        "dateOfIncident": "12/08/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251401,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS FREQUENTLY A STRONG SMELL OF FUEL WITHIN THE VEHICLE COMPARTMENT WHEN THE CAR IS RUNNING, EITHER STANDING STILL OR OTHERWISE BEING DRIVEN.    THERE WAS A THIRD PARTY SERVICE BULLETIN ISSUED (WXZ-83-FUEL HOSE EXPLAINING THE PROBLEM WHICH IS THAT CERTAIN AFFECTED VEHICLES MAY HAVE BEEN PRODUCED WITH UP TO 3 IMPROPERLY MANUFACTURED FUEL HOSES IN THE ENGINE COMPARTMENT.  OVER TIME AND IN COLD WEATHER THE HOSES COULD LEAK CREATING THE POTENTIAL FOR A FIRE IN THE ENGINE COMPARTMENT.   I FOUND OUT WHAT THE PROBLEM WAS ON THE INTERNET.    SUBARU SAYS THERE WAS A RECALL FOR THIS BUT THAT MY VEHICLE WAS NOT ONE OF THE VEHICLES UNDER THE RECALL AND THAT I WOULD HAVE TO PAY FOR ANY REPAIRS -  THEY SAID IT COULD BE THE FUEL RAIL ASSEMBLY THAT IS THE PROBLEM.    THIS DOES NOT SEEM FAIR OR RIGHT.  IF ITS A DEFECT (WITH SERIOUS SAFETY IMPLICATIONS) AND MY CAR WAS AFFECTED BY THE PROBLEM DESCRIBED (AND WHO KNOWS HOW MANY OTHERS), THEN THE MANUFACTURER SHOULD FIX ALL CARS WITH THE PROBLEM AT THEIR EXPENSE. *TR",
        "vin": "4S3BH806X17"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2008",
        "dateOfIncident": "01/06/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249424,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU OUTBACK.  WHILE DRIVING APPROXIMATELY 30 MPH ON NORMAL ROAD CONDITIONS, THE CONTACT SMELLED A STRONG ODOR OF FUEL COMING FROM THE VEHICLE.  THE ODOR WAS ONLY NOTICED IN 25 DEGREE WEATHER AND BELOW.  THE VEHICLE WILL BE TAKEN TO AN INDEPENDENT MECHANIC FOR INSPECTION AND REPAIRS.  THE CAUSE OF THE FAILURE HAS NOT BEEN DETERMINED.  THE CONTACT WAS CONCERNED OF THE SAFETY RISK INVOLVED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 50,000 AND CURRENT MILEAGE WAS 151,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2008",
        "dateOfIncident": "09/02/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241579,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU OUTBACK.  WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT HEARD A LOUD CLICKING NOISE AND THEN THE VEHICLE STALLED.  HE NOTICED THAT THE TRANSMISSION HAD FALLEN OUT OF THE VEHICLE ONTO THE ROAD.  THE VEHICLE WAS TOWED TO HIS RESIDENCE.  HE IS IN THE PROCESS OF NOTIFYING THE DEALER TO DETERMINE THE CAUSE OF THE FAILURE.  THE FAILURE AND CURRENT MILEAGES WERE 75,000.",
        "vin": "4S3BH896617"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2008",
        "dateOfIncident": "05/29/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236231,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU OUTBACK.  THE CONTACT NOTICED THAT THE ENGINE WARNING LIGHT WOULD CONSISTENTLY ILLUMINATE ON THE INSTRUMENT CONTROL PANEL.  HE TOOK THE VEHICLE TO THE DEALER AND A TECHNICIAN ERASED THE FUEL TEMPERATURE CODE.  TWO WEEKS AFTER THE DIAGNOSTIC, THE CONTACT NOTICED THAT THE ENGINE WARNING LIGHT HAD RESURFACED ON THE INSTRUMENT CONTROL PANEL.  HE TOOK THE VEHICLE BACK TO THE DEALER AND A TECHNICIAN REPLACED THE KNOCK SENSOR AT THE COST OF $317.  SEVERAL DAYS AFTER THE REPAIR, THE ENGINE WARNING LIGHT ILLUMINATED AGAIN.  HE TOOK THE VEHICLE TO THE DEALER AGAIN AND THE TECHNICIAN STATED THAT THE FUEL TEMPERATURE SENSOR NEEDED TO BE REPLACED AT THE COST OF $520.  THE VEHICLE IS CURRENTLY BEING REPAIRED.  THE MANUFACTURER WOULD NOT ASSIST.  THE FAILURE MILEAGE WAS 53,378 AND CURRENT MILEAGE WAS 53,923. UPDATED 10/16/08.  *LJ  UPDATED   THE DEALER REPLACED REPAIRED A LOOSE CONNECTION AT THE FUEL PUMP SENSOR. *JB",
        "vin": "4S3BH675217"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2008",
        "dateOfIncident": "03/29/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223809,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUTOMATIC TRANSMISSION PARK MECHANISM DOES NOT ENGAGE PROPERLY.  WITH SELECTOR LEVER IN \"PARK \" AND CAR TURNED OFF AND IGNITION KEY REMOVED, THE CAR ROLLS.  IN THE EARLY YEARS, THE CAR ROLLED ONLY SLIGHTLY AND FINALLY \"ENGAGED\":  NOW, THE CAR ROLLS SEVERAL FEET AND DOES NOT ALWAYS ENGAGE, REQUIRING USE OF THE EMERGENCY BRAKE FOR ALL PARKING.  BECAUSE THE PROBLEM IS GETTING WORSE, WE SEARCHED FOR REPAIR & RECALL INFORMATION.  WE FOUND THAT ALTHOUGH OUR MODEL & YEAR ARE ON THE RECALL LIST FOR THIS PARK MECHANISM, OUR VIN# IS NOT.  *TR",
        "vin": "4S3BH675417"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2008",
        "dateOfIncident": "01/14/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218445,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SUBARU OUTBACK 4 CYLINDER ENGINE DEVELOPED A FUEL LEAK APPROXIMATELY 1 MONTH AGO. THE VEHICLE HAS APPROX. 51,000 MILES ON IT. WHEN I CONTACTED THE DEALER, THEY INDICATED THE FUEL INJECTOR HOSES LEAKING AT THE CLAMPS WAS NOT UNUSUAL DURING COLD WEATHER ON THIS TYPE OF VEHICLE. ESTIMATED COST TO DIAGNOSE THE LEAKS & REPAIR WAS APPROX $150- BUT THEY WOULD LET ME KNOW THE EXACT COST ONCE THEY HAVE EXAMINED THE VEHICLE.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/13/2008",
        "dateOfIncident": "09/28/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217926,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU OUTBACK LEAKS FUEL IN COLD WEATHER. READ ON THE WEB ABOUT HUNDREDS OF OWNERS WITH THIS COMPLAINT.  LIVE IN MASSACHUSETTS AND WHEN THE WEATHER GETS BELOW ABOUT 25 DEGREES FUEL SMELL FILLS THE PASSENGER CABIN.  APPEARS TO COME FROM UNDER THE ENGINE MANIFOLD.  HOPE TO NOT PASS OUT FROM FUEL VAPORS.  HAVEN'T HAD A FIRE YET.  2ND ISSUE IS HEAD GASKET LEAK WHICH WAS A $1500 REPAIR.  ALSO APPEARS TO BE A COMMON ISSUE WITH SUBARU.  *TR",
        "vin": "4S3BH686517"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2008",
        "dateOfIncident": "05/10/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217820,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING AROUND 62K MILES, I HEARD A WHINING NOISE FROM THE FRONT OF THE CAR. THE NOISE GOT LOUDER AND HIGHER WITH WHEEL SPEED. WHEN I TOOK IT TO A MECHANIC, THEY DIAGNOSED A BAD DIFFERENTIAL BEARING, AND INFORMED ME THAT THE RECOMMENDED FIX WAS REPLACEMENT OF THE ENTIRE TRANSMISSION, INCLUDING BOTH DIFFERENTIALS. WHEN I WENT TO THE DEALER TO CONFIRM THIS, THEY QUOTED ME $6,000-$8,000 FOR THE REPAIR. I TRIED TO GET SOME RELIEF FROM SUBARU OF AMERICA, SINCE THE POWERTRAIN WARRANTY GOES FOR 60K MILES, BUT THEY WERE UNWILLING. THIS CAUSED THE VALUE OF MY CAR TO GO TO ZERO, SINCE IT'S WORTH ABOUT $8,000 WITHOUT THE TRANSMISSION PROBLEM.  *TR",
        "vin": "4S3BH665317"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2008",
        "dateOfIncident": "01/17/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10215986,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER OUR CAR BEGAN EMITTING A VERY STRONG FUEL SMELL IN THE PASSENGER COMPARTMENT. OUR SUBARU DEALER DENIES THERE IS ANYTHING WRONG THAT WOULD WARRANT A SAFETY RECALL OR BULLETIN. THEY WILL NOT ACCEPT IT IS A DESIGN DEFECT WHEN CLEARLY THE FUEL LINES BEGIN TO LEAK IN COLD (SUB-FREEZING) TEMPERATURES. AS GASOLINE IS A SERIOUS CARCINOGEN AND EXPOSURE TO ITS FUMES CAUSES BRAIN DAMAGE, THIS SHOULD BE REGARDED AS AN EXTREMELY SERIOUS HEALTH ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/21/2008",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215508,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD GASKET FAILURE. PROBLEM HAS BEEN WELL DOCUMENTED AND KNOWN BY THE CAR MANUFACTURER. $2,800 REPAIR REQUIRED; SERVICE DONE AT CARTER SUBARU, SEATTLE.  *TR",
        "vin": "4S3BH665516"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2007",
        "dateOfIncident": "12/05/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211298,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2001 OUTBACK, 2.5L ENGINE, ONE OF THOUSANDS OF SUBARUS IMPACTED BY SUBARU'S  BULLETIN FOR DEFECTIVE HEAD GASKETS.   ON DEC. 6, 2007, I PAID THE OFFICIAL SUBARU DEALER IN ALASKA, CONTINENTAL SUBARU, $1,330 TO DO A HEAD GASKET REPAIR JOB (ALSO A TIMING BELT CHANGE). GO HERE FOR THAT BULLETIN: HTTP://WWW.SUBARUPROBLEMS.COM/INDEX.HTM.     ON DEC. 6, 2007, I CALLED SUBARU OF AMERICA'S CORPORATE OFFICE IN AND SPOKE WITH A REP NAMED \"DAVE.\" (HE WOULD NOT GIVE A LAST NAME.). HE SAID HIS COMPANY WOULD NOT COVER THIS WORK (THOUGH IT IS PART OF SUBARU?S RESPONSE TO A FAILURE IN POTENTIALLY THOUSANDS OF SUBARU ENGINES FROM 1999-2002). THE CAR HAD LITTLE OVER 93,000 MILES WHEN THE PROBLEM WAS DISCOVERED AND SERVICED.     THE EXPLANATION THAT \"DAVE\" AND CONTINENTAL SUBARU PROVIDED WAS THAT THAT THE HEAD GASKET FAILURE/LEAKING PROBLEM WAS INSIDE THE BLOCK, NOT AN EXTERNAL COOLANT LEAK, AND THUS NOT COVERED BY THE SERVICE BULLETIN/RECALL. THAT A LEAK INSIDE SOMEHOW IS NOT CONSIDERED IMPACTED BY THIS DEFECT, RATHER THAN A LEAK OUTSIDE SEEMS SPURIOUS AT BEST. I HAVE NO WAY OF VERIFYING THAT THE CONTINENTAL SUBARU MECHANIC THE CORPORATE OFFICE SPOKE WITH WAS TELLING THE THE FULL STORY. ALL I CAN SAY IS, I CANNOT TRUST THE WORD OF THIS DEALER BECAUSE THEY FAILED TO RAISE THE BULLETIN ISSUE AND THE ISSUE OF WELL-KNOWN PROBLEM FOR THIS ENGINE WHEN I BROUGHT THE CAR IN. THEY BARELY ACKNOWLEDGED THIS WARRANTY POSSIBILITY ONLY AFTER I TOLD THEM I KNEW ABOUT IT.    I'M WAITING TO SEE IF SUBARU'S CORPORATE OFFICE WILL REIMBURSE ME IN PART OR FULL FOR THE GASKET JOB. I WAS TOLD TO SEND THEM EVERY SERVICE RECORD FOR THE CAR THAT I HAVE. I DID. THIS PROBLEM WITH SUBARUS OF THIS VINTAGE IS WIDESPREAD. GO HERE: HTTP://SCOTT.MCGERIK.COM/2004/02/18/SUBARU-OUTBACK-HEAD-GASKET-LEAK/; AND HERE: HTTP://WWW.CARSURVEY.ORG/VIEWCOMMENTS_REVIEW_56499.HTML. *TR",
        "vin": "4S3BH665216"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "12/06/2007",
        "dateOfIncident": "11/18/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10210985,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU OUTBACK.  WHILE DRIVING 70 MPH WITH THE CRUISE CONTROL ACTIVATED, THE VEHICLE VEERED TO THE RIGHT.  THE CONTACT APPLIED THE BRAKES TO RELEASE THE CRUISE CONTROL; HOWEVER, IT WOULD NOT RELEASE.  SHE THEN HEARD A LOUD NOISE COMING FROM THE REAR PASSENGER SIDE AND THE VEHICLE ROLLED EIGHT TIMES INTO ONCOMING TRAFFIC.  THE STEERING FAILED TO RESPOND.  THE CONTACT WAS TRANSPORTED FROM THE SCENE UNCONSCIOUS.  SHE SUSTAINED CRACKED RIBS, BRUISES, AND SPRAINS.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS DESTROYED.  SHE HAS NOT YET NOTIFIED THE DEALER OR MANUFACTURER.  THE FAILURE AND CURRENT MILEAGES WERE 64,000.",
        "vin": "4S3BH665417"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/29/2007",
        "dateOfIncident": "11/23/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210264,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR OVERHEATED. THIS IS THE 2ND TIME. I DID NOT GET ANY NOTICE FROM SUBARU REGARDING HEAD GASKET FAILURES. I HAVE A 2001 OUTBACK LIMITED SEDAN. AND NOW I HAVE OVER 100,000 MILES AND NO CHANCE OF WARRANTY. SUBARU KNOWS ALL ALONG ABOUT THIS PROBLEM AND YET NO RECALL.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/02/2007",
        "dateOfIncident": "10/02/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204693,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT OUTBACK FROM NATE WADE SUBARU IN SALT LAKE CITY IN NOV. OF 2006.  I WAS TOLD THAT NATE WADE PERFORMED A COMPLETE INSPECTION OF THE VEHICLE, AND WAS TOLD BY THE SALESMAN, BRYCE, THAT THE VEHICLE WAS IN GOOD CONDITION.  AFTER PURCHASING THE CAR(ALONG WITH POWERTRAIN WARRANTY), I NOTICED THAT IN COLD WEATHER, THE BELT SQUEALED.  TALKED TO DEALER, AND DEALER FIXED THE PROBLEM, BUT NOW I'M VERY INSECURE ABOUT THE ACTUAL CONDITION OF THE CAR.  I'M NOT SO SURE THAT THE SALESMAN OR THE DEALER WAS BEING HONEST ABOUT THE CONDITION OF THE CAR.  ONCE THE WEATHER BEGAN HEATING UP, THE CAR WOULD OVERHEAT.  I TOOK IT INTO NATE WADE SERVICE.  THEY SAID ALL THAT NEEDED TO BE DONE WAS A NEW RADIATOR CAP AND FLUSHED THE LINES.  PAID FOR THAT.  THE PROBLEM PERSISTED, SO I TOOK THE CAR BACK IN.  SERVICE TOLD ME THEN THAT I NEEDED A NEW RADIATOR.  APPARENTLY, THIS WAS NOT A PROBLEM THAT COULD HAVE BEEN DISCOVERED WHEN I VISITED NATE WADE SERVICE A WEEK PRIOR.  I TOOK THE CAR TO ANOTHER MECHANIC FOR A SECOND OPINION, AND HE TOLD ME THAT IT WAS NOT OVERHEATING DUE TO THE RADIATOR BECAUSE THE RADIATOR LEAK WAS MINIMAL.  NATE WADE REFUSED TO DO ANYTHING FURTHER TO FIGURE OUT WHAT WAS WRONG WITH THE VEHICLE BESIDES REPLACING THE RADIATOR.  RECENTLY THE CAR HAS BEEN LOSING POWER AND A SEVERE DECREASE IN FUEL MILEAGE.  TOOK THE CAR TO NATE WADE.  NATE WADE SAID THAT THERE WAS NOTHING WRONG WITH THE CAR AT ALL, BUT THAT I COULD GET A TUNE UP FOR 150.  BUT, THERE IS NOTHING WRONG WITH THE SPARKPLUGS OR THE TIMING.  I KNOW THERE IS A PROBLEM WITH THE CAR, BUT ALL THE DEALERSHIP WANTS ME TO DO IS THROW MONEY AT THE PROBLEM, AND STALL UNTIL THE WARRANTY EXPIRES THIS NOVEMBER.  THEY REFUSE TO IDENTIFY THE PROBLEM, BUT WANT ME TO JUST KEEP SPENDING MONEY TO ELIMINATE THE POSSIBILITIES FOR THEM.  I'M CONCERNED THAT THE CAR WAS NOT IN GOOD CONDITION WHEN I BOUGHT IT, AS WAS PROMISED BY BRYCE, THE SALESMAN.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/20/2007",
        "dateOfIncident": "07/20/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200158,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU OUTBACK.  WHILE DRIVING 65 MPH, THE CONTACT APPLIED THE BRAKES, BUT THE VEHICLE CONTINUED TO ACCELERATE.  HE ATTEMPTED TO DECELERATE AND STOP THE VEHICLE.  THE DEALER REPLACED THE THROTTLE CABLE AND NO OTHER FAILURES HAVE OCCURRED SINCE.  A VALID VIN WAS UNAVAILABLE.  THE CURRENT MILEAGE WAS 150,000 AND FAILURE MILEAGE WAS 149,000.",
        "vin": "4S3BH686217"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/17/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199972,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU OUTBACK AT 90K AFTER 2.5 ENGINE IS STARTED IT RATTLES LIKE THE VALVE LIFTERS ARE NOT GETTING OIL LUBRICATION. IT LAST FOR ABOUT 10 MINUTES OR UNTIL THE ENGINE TEMP GAUGE IS IN THE NORMAL RANGE.  IT DOES THIS WHEN THE ENGINE HAS BEEN SITTING MORE THAT 8 HOURS WITHOUT STARTING. CHANGING OF OIL IN CRANKCASE, DID NOT CHANGE THE RATTLING SOUND.  UPON TAKING THE VEHICLE TO THE SUBARU DEALER, THE SERVICE MANAGER INFORMED ME THIS WAS A NORMAL CHARACTER FEATURE OF 2001 AND NEWER SUBARU'S THAT HAD THE 2.5 ENGINE AND WAS CAUSED BY PISTON SLAP IN THE ENGINE. THE CORRECT THE NOISE  THE OWNER WOULD HAVE TO HAVE THE ENGINE REBUILT TO STOP THE PISTON SLAP. *JB",
        "vin": "4S3BH665417"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/14/2007",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199535,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 SUBARU OUTBACK.  THE CONTACT STATED THAT THE ENGINE LIGHT CONTINUES TO ILLUMINATE ON THE INSTRUMENT PANEL AND THE ENGINE SEIZED TWO WEEKS AGO.  SHE NOTIFIED THE DEALER AND THE MANUFACTURER AND THEY REQUESTED THAT SHE SEND THE INVOICES FROM THE DEALER, WHERE THEY WOULD MOSTLY LIKELY REPLACE THE ENGINE.  THE CONTACT STATED, HOWEVER, THAT THE INVOICES AND REPAIRS WERE DONE SOMEWHERE OTHER THAN AN AUTHORIZED DEALER.  THE FAILURE MILEAGE WAS 30,000 AND CURRENT MILEAGE WAS 54,500.",
        "vin": "4S3BH665516"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2007",
        "dateOfIncident": "01/11/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182844,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1) UPON COLDER WEATHER STARTING AND DURING THE FIRST 30-40 MINUTES OF OPERATION OUR 2001 SUBARU OUTBACK GETS FUEL VAPORS IN THE PASSENGER COMPARTMENT.   2) FUEL SMELLS CAUSE USE TO ROLL WINDOWS DOWN TO KEEP BREATHABLE AIR AVAILABLE. FUEL VAPOR IS A CARCINOGEN, OF COURSE.  OCCUPANTS COMPLAINED OF NAUSEA AND HEADACHES.   3) TOOK CAR TO PAUL BROS. SUBARU AND THEY TOLD US THIS WAS A COMMON COMPLAINT BUT NOTHING TO WORRY ABOUT.  4) SUBSEQUENTLY, LEARNED OF HUNDREDS OF LIKE COMPLAINTS AND A SUBARU SERVICE BULLETIN REGARDING LEAKY HOSES DUE TO LOOSE FUEL CLAMPS AND POOLING FUEL ON CREVICES ON THE ENGINE BLOCK.  CONSIDERED NOT A \"ENGINE/DRIVETRAIN ISSUE IN WARRANTY AND COST TO REPLACE HOSES HAS BEEN CHARGED TO OWNERS AT MORE THAN $600.     PERSONS \"INJURED\" IS HARD TO DETERMINE DUE TO CHRONIC EXPOSURE OF FUMES IS AN UNCLEAR CONNECTION TO A SINGULAR INJURY.     THIS SITUATION SHOULD BE ADDRESSED BY A RECALL AND REPLACEMENT OF HOSES AT SUBARU'S EXPENSE.  THE HOSES PERFORMANCE IN COLD WEATHER WAS KNOWN TO SUBARU BEFORE I PURCHASED THE CAR (IN CANADA THIS IS A FAR LARGER ISSUE BTW). I SHOULD EXPECT HOSES TO PERFORM OVER THE PUBLISHED OPERATING TEMPERATURE OF THE VEHICLE OR IN WHAT EVER REGION SUBARUS ARE SOLD.  *JB",
        "vin": "4S3BH686X17"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/10/2007",
        "dateOfIncident": "03/31/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182184,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD EXCESSIVE BRAKE PROBLEMS AND AFTER REPEATED ATTEMPTS TO THE DEALER, MY HUSBAND FOUND THERE IS A PIN THAT THE CALIPERS SLIDE ON AND IT WAS LOCKED UP. HE TOOK IT APART, LUBED WITH \"NEVER SEIZE\" AND PROBLEM SOLVED. UNFORTUNATELY, AFTER MUCH $$$$ PAID TO DEALERS WITHOUT ANY HELP.  *NM",
        "vin": "4S3BH686X17"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/07/2007",
        "dateOfIncident": "02/05/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181847,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IT'S BEEN RATHER COLD HERE THE PAST COUPLE DAYS (SINGLE DIGITS, -20   WIND CHILL). I WAS SITTING IN MY 2001 OUTBACK YESTERDAY EVENING LETTING  IT WARM UP. I TURNED ON THE DEFROSTER, WINDSHIELD WIPER DEFROSTER INCLUDED. AFTER A FEW MINUTES, I ACTUALLY WATCHED THE WINDSHIELD CRACK FROM BOTH ENDS OF THE DEFROSTER ELEMENT! WHEN I GOT HOME I CHECKED IT OUT FURTHER. THE CRACK EXTENDS THE FULL LENGTH OF THE DEFROSTER ELEMENT ON THE WINDSHIELD. THERE WAS NO IMPACT OF ANY KIND. AS THIS IS OBVIOUSLY UNSAFE, I AM HAVING TO PAY $300 FOR A WINDSHIELD REPLACEMENT. THIS APPEARS TO BE AN ONGOING ISSUE WITH THE SUBARU OUTBACKS. I FEEL THAT THIS IS A DEFECTIVE COMPONENT AND A MAJOR SAFETY RISK. THOUGH THE GLASS MAY NOT BLOW IN, THE SHATTER WHILE DRIVING DOWN THE EXPRESSWAY AT 65 MPH WOULD CERTAINLY CAUSE A MAJOR ACCIDENT. *JB",
        "vin": "4S3BH675316"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/05/2007",
        "dateOfIncident": "02/02/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181736,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU OUTBACK.   WHEN THE TEMP FALLS BELOW 20, AND THE CAR HAS SAT FOR SEVERAL HOURS, BRAKES WILL MOMENTARILY NOT WORK.  SPECIFICALLY, I APPLY THE BRAKES TO SLOW DOWN, THEY WILL FEEL HARD TO PUSH AND WILL SLOW THE CAR, I LET UP AND PUSH AGAIN, THEY FEEL EVEN HARDER, AND WILL NOT SLOW THE CAR.  USUALLY THE FOURTH TIME I PUMP THEM THEY RETURN TO NORMAL OPERATION.  THIS HAS HAPPENED IN THE PAST, I TOOK THE CAR TO THE SHOP, WHO SAID THERE WAS NOTHING WRONG.  PADS WERE FINE, NO WATER IN THE FLUID.  FLUID WAS CHANGED AND PROBLEM HAS RECURRED SINCE THEN.  *NM",
        "vin": "4S3BH686816"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2006",
        "dateOfIncident": "12/28/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177394,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SUBARU OF SCOTTSDALE FINALIZED THE REPAIR OF THE HEAD GASKET PROBLEM ON DECEMBER 28, 2006 ON OUR SUBARU OUTBACK WAGON.  WHILE IN FOR REPAIR FOR THE HEAD GASKET, THE DEALER NOTED THAT THE TIMING BELT TENSIONER NEEDED TO BE REPLACED.  POWER SUBARU REPLACED THE TENSIONER WITH A NEW SUBARU TENSIONER (PART #13033AA042.)  IT DOES NOT APPEAR THAT POWER SUBARU TEST DROVE THE CAR AFTER THE REPAIRS BASED ON THE MILEAGE IN AND OUT SHOWN ON THE SERVICE INVOICE.  THE CAR HAD A CATASTROPHIC ENGINE FAILURE APPROXIMATELY 12 MILES FROM THE DEALERSHIP ON STATE HIGHWAY 87 WHILE BEING DRIVEN AT THE POSTED HIGHWAY SPEED OF 65 MILES PER HOUR AS WE LEFT THE DEALER THAT DID THE REPAIR.  THAT ENGINE FAILURE CREATED A SAFETY HAZARD FOR MY WIFE, MARGARET, WHO HAD TO COAST DOWN THE HIGHWAY TO A SMALL ROAD TO SAFELY PULL OFF.  IF THE ROAD/PULL OUT AREA HAD NOT BEEN AVAILABLE TO HER, SHE WOULD HAVE HAD TO PARTIALLY BLOCK THE HIGHWAY LANE OF TRAFFIC SHE WAS IN.  SHE COULD HAVE BEEN HIT BY ANOTHER CAR COMING BEHIND HER AT A HIGH RATE OF SPEED INJURING/KILLING HER OR POSSIBLY OTHERS.  IT APPEARS THAT THIS PART HAS FAILED ON OTHER SUBARU VEHICLES CREATING CATASTROPHIC ENGINE FAILURE AND A VERY HAZARDOUS SITUATION.  POWER SUBARU TOLD ME SINCE THAT THE ENGINE WILL REQUIRE A COMPLETE REBUILD SINCE THE FAILURE OF THE TENSIONER THEY INSTALLED SUBSEQUENTLY CAUSED THE NEW TIMING BELT TO BREAK WHICH THEN CAUSED SEVERE DAMAGE TO THE ENGINE.  SUBARU HAS OFFERED TO REPLACE THE ENGINE WITH A MANUFACTURE REBUILT ENGINE AND WILL WARRANTY THE ENGINE FOR 36,000 MILES OR THREE YEARS, BUT HAVE FAILED TO PROVIDE US WITH A RENTAL CAR REPLACEMENT FOR THE TWO WEEK REPAIR TIME.  WE NEED AN ALL-WHEEL DRIVE OR 4 WHEEL DRIVE REPLACEMENT VEHICLE SINCE WE HAVE SNOW.  THEY ONLY OFFERED TO PAY FOR 1/2 THE RENTAL COST OF A SMALL TWO WHEEL DRIVE VEHICLE WHICH IS NOT ADEQUATE.  SUBARU SHOULD CHANGE THE MANUFACTURING OF IT'S TIMING BELT TENSIONER SINCE THIS FAILURE HAS HAPPENED IT'S OTHER VEHICLES AND IS HIGHLY DANGEROUS. *NM",
        "vin": "4S3BH686X16"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/17/2006",
        "dateOfIncident": "12/16/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176318,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 4 YEARS, MY SUBARU OUTBACK VCD NEEDED 3 SETS OF BRAKES AND 4 SETS OF ROTORS (NOT INCLUDING THE \"RESURFACING\" TO EXTEND THE ROTORS).  EVERYTIME WHEN I BROUGHT THE CAR TO THE DEALERSHIP, THEY ATTRIBUTE THE PROBLEMS TO MY DRIVING PATTERN.  BUT I OWNED THREE OTHER CARS BEFORE (ALL WERE LESS EXPENSIVE), AND NEVER NEEDED TO REPLACE BRAKES NOR ROTORS.  AS POSTED IN THIS WEBSITE, THERE ARE 13 OTHER COMPLAINS, WITH VIRTUALLY IDENTICAL PROBLEMS.  I STRONGLY RECOMMEND NHTSA ENGINEERS TO ANALYZE THE 2001 SUBARU OUTBACK BRAKES AND ROTORS.  NOT ONLY IT IS A PUBLIC SAFETY ISSUE, IT IS ALSO A COMPANY RESPONSIBILITY ISSUE:  SUBARU SHOULD BE RESPONSIBLE FOR ALL REPAIR COST, NOT TO MENTION THE INCONVENIENCE, OUR TIME, EMOTIONAL STRESS CAUSED TO THE VEHICLE OWNERS.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/30/2006",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176412,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 OUTBACK HAD A HEAD GASKET PROBLEM THAT NEEDED TO BE REPLACED.  *TS  THE CONSUMER WAS INFORMED BY CUSTOMER SERVICE THAT A RECALL HAD BEEN ISSUED REGARDING THE PROBLEM THEY WERE HAVING, AND THE VEHICLE NEEDED TO BE TAKEN TO AN AUTHORIZED SERVICE DEALER. THE CONSUMER HAD ALREADY HAD THE WORK DONE BY HIS LOCAL REPAIR SHOP. THE CONSUMER WAS THEN TOLD TO TAKE THE VEHICLE TO AN AUTHORIZED DEALER TO HAVE THEM VERIFY THAT THE WORK WAS DONE. THE CONSUMER LEARNED THAT THE HEAD GASKET HAD BEEN REPLACED PRIOR TO HIM PURCHASING THE VEHICLE. THE CONSUMER ALSO DISCOVERED THE HEAD GASKET USED WAS 3 PIECES AND THE WORK DONE PREVIOUSLY ONLY 1 PIECE WAS REPLACED, WHICH WAS OPPOSITE FROM THE # CYLINDER. THE LOCAL REPAIR SHOP THAT REPLACED THE HEAD GASKET FOR THE THIRD TIME, TOLD THE CONSUMER HE UTILIZES ONLY A SOLID ONE PIECE GASKET AND HAD THE BEEN DONE ORIGINALLY, THE CONSUMER MAY NOT HAVE HAD ANY PROBLEMS. *JB",
        "vin": "4S3BH665317"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/14/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154063,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER SUBARU OUTBACK TAIL LIGHTS BURNED OUT QUITE OFTEN. AFTER REPLACING THE BULB CONSUMER NOTICED THAT THE SOCKET WAS CORRODED.  *TS  THE ENGINE STALLED WHILE DRIVING UP A SMALL HILL. THE VEHICLE WAS TOWED WHERE IT WAS DISCOVERED A BLOWN 30 AMP FUSE IN THE MOTOR SIDE FUSE BOX. THE INCIDENT HAPPENED A SECOND TIME AND THE VEHICLE WAS TAKEN TO A DIFFERENT DEALER WHERE THE PROBLEM WAS DIAGNOSED AS A BLOWN FUSE AGAIN. WHEN THE CONSUMER OPENED THE HATCH, WATER WAS POURING OUT OF THE LITTLE DOORS THAT HOUSED THE TAIL LIGHTS BULBS AND WIRES. THE CONSUMER BELIEVED THE LEAKING HATCH WAS RESPONSIBLE NOT ONLY FOR THE BURNED OUT TAIL LIGHTS AND ROTTING WIRES, BUT ALSO FOR THE ELECTRICAL SHORTS THAT BLEW OUT THE 30 AMP FUSE IN THE ENGINE COMPARTMENT AND CAUSED THE ENGINE THE DIE.*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/20/2006",
        "dateOfIncident": "01/18/2006",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150664,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FLEXIBLE FUEL HOSE CONNECTING THE #1 CYLINDER FUEL LINE LEAKS.  THIS IS LOCATED APPROXIMATELY FOUR INCHES FROM THE #1 CYLINDER FUEL INJECTOR.  THE HOSE CLAMP SCREWS/NUTS ARE NOT SELF-LOCKING AND HAVE LOOSENED OVER TIME CAUSING FUEL TO LEAK ONTO THE HOT EXHAUST MANIFOLD WHICH LED TO A FIRE INSIDE THE ENGINE COMPARTMENT.  *NM",
        "vin": "4S3BH686217"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/16/2006",
        "dateOfIncident": "12/19/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10150866,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "\"THIS IS GRAPHIC EVIDENCE OF WHAT HAPPENS WHEN SOMEONE LIKE SUBARU 'FORGETS' TO FIT A $1 SPRING CLIP. THE THROTTLE PROBABLY STUCK AT AROUND 3/4 OPEN AS SHE HAD JUST BEEN TRAVELING UP A STEEP HILL LESS THAN 2 MILES FROM OUR HOUSE. THE ROAD THEN DIPS DOWN AND GOES INTO A SERIES OF S BENDS, SHE LEFT THE ROAD DOING ABOUT 80MPH AND HIT A TREE  5 FOOT UP IN AIR FROM THE ROAD'S SURFACE.  IT WAS A BRIGHT SUNNY DAY, NO PRECIPITATION, SHE WAS TRAPPED IN THERE FOR 45 MINS AND AS YOU CAN SEE FROM THE DOOR PILLARS THEY TRIED TO CUT WITH THEIR HURST CUTTERS THE CAR SURVIVED REMARKABLY. BUT ALL THE PEOPLE WHO HAVE SEEN THIS WRECK SAID IT WAS NOT A SURVIVABLE ACCIDENT. I WONDER IF THE PEOPLE IN THEIR BIG CORPORATIONS EVER CONSIDER THESE TYPE OF THINGS, OR WHETHER THEY SLEEP AT NIGHT???\"",
        "vin": "4S3BH806117"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/15/2005",
        "dateOfIncident": "11/15/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142781,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES REQUIRE FREQUENT SERVICING. FRONT ROTORS AND PADS WORN AFTER 37,000 MILES, NEEDING FULL REPLACEMENT. REAR ROTORS TURNED AND REAR PADS REPLACED AT 30,000 MILE SERVICE CHECK. SERVICE MECHANIC INDICATED PROBLEM IN THE DESIGN OF THE ROTORS FOR WEIGHT AND WHEEL SIZE OF VEHICLE.  *NM",
        "vin": "4S3BH675216"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2005",
        "dateOfIncident": "06/23/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128509,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 SUBARU OUTBACK.  AFTER HEARING A WHINING NOISE IN THE FRONT OF THE CAR, I TOOK MY CAR INTO MY MECHANIC.  HE INFORMED ME THAT I PROBABLY NEEDED TO HAVE THE FRONT DIFFERENTIAL REPLACED AND REFERRED ME TO THE DEALERSHIP.  THE DEALERSHIP TOLD ME I NEEDED THE ENTIRE TRANSMISSION REPLACED.  BECAUSE THE MILAGE ON MY CAR WAS AT 62,000 MILES, THE DEALERSHIP WOULD NOT HONOR MY WARRANTY BECAUSE IT ONLY EXTENDED TO 60K.  ASTOUNDED THAT ANY CAR WITH ONLY 62K MILES ON IT WOULD NEED ITS ENTIRE TRANSMISSION REPLACED, I APPEALED TO SUBARU CUSTOMER SERVICES AND ASKED THEM TO OWN UP TO THE DEFECT. THEY DECLINED MY REQUEST.",
        "vin": "4S3BH665617"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "10/28/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126796,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: UNINTENDED ACCELERATION  AND BRAKING, WHEN DEPRESSING THE GAS PEDAL IT TAKES RIGHT OFF, CAN TAKE FOOT OFF THE GAS PEDAL AND IT STILL SURGES FORWARD. IT IS HARD TO SLOW DOWN THE VEHICLE WHEN HITTING BRAKES. THIS PROBLEM GOT SO BAD THAT IT WOULDN'T LET CONSUMER MAKE A TURN.  HAD TO KEEP GOING FORWARD INSIDE.   RAILROADS TRACKS WERE THERE AND HIT THE MOUND. HAD TO REPLACE BRAKE PADS AND ROTORS.  IT WAS  1000.00 MILES  WHEN IT  WAS DONE LAST JUNE.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/27/2005",
        "dateOfIncident": "06/26/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126653,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH CHATTER: MY CLUTCH IS CHATTERING OR SHUTTERING WHEN THE CAR IS COLD OR I AM DRIVING IT FOR THE FIRST TIME IN THE DAY.  THIS HAS BEEN A PROBLEM SINCE I PURCHASED THE VEHICLE 2 YEARS AGO.",
        "vin": "4S3BH686416"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "06/04/2005",
        "dateOfIncident": "11/30/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124215,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER I PURCHASES A NEW 201 SUBARU OUTBACK (FIRST 500 MILES  THE BRAKE ROTORS WERE WARPED.  I WAS TOLD BY THE DEALERE THAT THE CAR HAD BEEN SERTTING A LONG TIOME AND THE ROTORS WERE RUSTED BUT IT WOULD CLEAR UP.  IT DIDN'T AND THEY TURNED THE ROTORS AND THEN REPLACED THEM STATING THAT IT WAS MY DRIVING THAT CUASED THE PROBLEM.  I AM STILL DRIVING THE CAR AND THE FRONT BRAKES ARE DEFECTIVE AND HAVE BEEN EVER SINCE IT WAS NEW.  SOMW OF MY FRIENDS HAVE HAD THE SAME PROBLEM.  I FEEL THAT THE BRAKES ARE UNSAFE AND ARE NOT AS EFFECTIVE AS THEY SHOULD BE WHEN STOPPING AT FREEWAY SPEEDS. THE BRAKES ARE NOE OUT OF WARRANTY HOWEVER, I FEEL THAT THE MANUFACTURER SHOULD CORRECT THE BRAKE PROBLEM.",
        "vin": "4S3BH675X17"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": true,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "05/20/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10124030,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE HAD AN ACCIDENT IN OUR 2001 SUBARU OUTBACK THAT WAS CAUSED BY THE CAR ACCELERATING AT SLOW SPEED WITH FOOT OFF THE GAS PEDAL WHILE PULLING INTO A PARKING SPACE.  THIS IS IDENTICAL TO ODI ID NUMBER : 742080.  THE CAR RAN INTO A BUILDING, CAUSING DAMAGE TO THE BUILDING AND THE CAR AND INJURING MY WIFE.",
        "vin": "4S3BE686517"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "05/20/2005",
        "dateOfIncident": "05/19/2005",
        "fire": true,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121731,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "64669AC260MU",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "IN 2003 AT 74,000 MILES THE LEFT GASKET WAS REPLACED ON 2001, SUBARU OUTBACK LTD. WAGON.  IN 2003 AT 94,000 MILES RIGHT GASKET WAS REPLACED.  20 MONTHS LATER  LEFT GASKET WAS BLOWN OUT AGAIN.  TWO INDEPENDENT MECHANICS TOLD CONSUMER  THAT RIGHT GASKET WAS  DEFECTIVE  AS WELL ALTHOUGH THE DEALERSHIP TOLD CONSUMER  NO.  SUBARU OF AMERICA PAID FOR THE REPAIRS OF BOTH OF THE INITIAL GASKET REPLACEMENTS, BUT DUE TO THE MILEAGE ON THE CAR THEY REFUSED TO COVER THIS DEFECTIVE PART.  IN 2004 CAR WAS RECALLED TO RECEIVE A SEALANT ADDITIVE TO ADDRESS THE GASKET PROBLEM.  CLEARLY IT DIDN'T WORK.  MANY OF CONSUMER  FRIENDS AND NEIGHBORS ARE SUBARU OUTBACK OWNERS, AND 2 OTHERS I HAVE SPOKEN WITH HAVE HAD BLOWN GASKETS ON FAIRLY NEW  VEHICLES. *AK",
        "vin": "4S3BH686X16"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "05/14/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121092,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKED IN NEUTRAL, WITH THE EMERGENCY BRAKE ON, AND NO OCCUPANTS, OUR STANDARD TRANSMISSION VEHICLE ROLLED BACKWARDS OUT OF OUR DRIVEWAY, ACROSS THE STREET & INTO THE YARD ACROSS THE STREET. OUR DRIVEWAY HAS ONLY A VERY SLIGHT GRADE (LESS THAN 5%), SO I'M ALRARMED WITH THE EASE WITH WHICH THIS HAPPENED. THERE WERE ABOUT 8 CHILDREN PLAYING AROUND THE STREET & YARDS. MY NEIGHBOR & I BOTH CONFIRMED THAT THE EMERGENCY BRAKE WAS IN THE UPRIGHT POSITION, WHICH I ALWAYS ENGAGE BEFORE EXITING THE CAR.   WE DO NOT KNOW IF THERE IS A PROBLEM WITH THE EMERGENCY BRAKE ITSELF, OR IF I SIMPLY DID NOT PULL UP ENOUGH ON THE BRAKE; HOWEVER, IF THIS CAN HAPPEN TO A SAFETY HOUND LIKE ME, I'M ASSUMING I'M NOT THE ONLY ONE & THAT IT'S A COMMON ENOUGH OCCURENCE TO WARRANT SOME KIND OF INDICATOR TO ALERT THE DRIVER AS TO WHETHER THE PARKING BRAKE IS ACTUALLY ENGAGED.",
        "vin": "4S3BH665016"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/05/2005",
        "dateOfIncident": "03/31/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119949,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE ODOMOTER WAS NOT READING CORRECTLY.  ON 2 SEPARATE OCCASIONS  THE CONTACT  TESTED THE ODOMETER AND THE RESULTS WERE NOT CORRECT.  THE CONTACT BELIEVED THAT IF THE ODOMETER WAS NOT READING CORRECTLY THEN THE SPEEDOMETER WAS NOT READING CORRECTLY.  *NM    *AK",
        "vin": "4S3BH686917"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/04/2005",
        "dateOfIncident": "05/03/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119851,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE DAY ONE, THE CLUTCH HAS SHUDDERED AT ENGAGEMENT WHEN ENGINE/DRIVETRAIN IS COLD.  THE TREMORS ARE VIOLENT ENOUGH TO SHAKE THE ENTIRE VEHICLE DISTURBINGLY.  THIS HAS BEEN A NUISANCE AND SOMEWHAT OF A SAFETY ISSUE AS YOU CANNOT ACCELERATE QUICKLY IF NECESSARY.  OVER THE LAST 10000 MILES OR SO, I'VE NOTICED A BURNING SMELL WHEN ENGAGING THE CLUTCH ON AN UPHILL START.  DEALERSHIP SAYS THE CLUTCH IS SLIPPING AND WILL NEED REPLACEMENT SOON AND I ONLY HAVE 61500 HIGHWAY MILES ON THE CAR!  I'VE HAD PLENTY OF CARS GO OVER 150000 MILES WITH NO CLUTCH PROBLEMS.  SUBARU HAS A DEFINITE DESIGN FLAW IN THESE HYDRAULIC CLUTCHES THAT THEY ARE REFUSING TO OWN UP TO!  REGRETTABLY, I MAY HAVE PURCHASED MY LAST SUBARU.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/09/2005",
        "dateOfIncident": "09/09/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116655,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SUBARU OUTBACK SUDDENLY ACCELERATES, ON ITS OWN, WHILE MY FOOT IS LIGHTLY ON THE BRAKE.  THIS HAPPENS MOSTLY IN PARKING LOTS/PULLING INTO PARKING SPACES.*AK",
        "vin": "4S3BH806117"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/09/2005",
        "dateOfIncident": "03/28/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116656,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2001 SUBARU OUTBACK WITH THE H6 ENGINE. WHEN GOING VERY SLOWLY, SUCH AS PARKING IN THE GARAGE, THE ENGINE WILL SUDDENLY SURGE. YOU MUST KEEP ONE FOOT ON THE BRAKE TO PREVENT A SUDDEN UNINTENDED ACCELERATION. I HAVE BEEN TOLD BY THE DEALER THAT THIS IS JUST THE WAY IT IS WITH THE COMPUTER CONTROL AND THE H6 ENGINE. I HAVE NOT HAD AN ACCIDENT , BUT IT IS A POTENTIAL HAZARD. A SUDDEN LURCH COULD DAMAGE ANOTHER VEHICLE IN A PARKING LOT OR A PERSON IN FRONT OF THE CAR. I HAVE LIVED WITH IT, BUT SOMEONE WROTE TO CLICK AND CLACK COMPLAINING ABOUT THE SAME PROBLEM. SO, I DECIDED TO CONTACT YOUR AGENCY TO ALSO VOICE MY CONCERNS. THANK YOU. *AK",
        "vin": "4S3BH806217"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/14/2005",
        "dateOfIncident": "12/18/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114093,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2001 SUBARU OUTBACK SEEMS TO HAVE AN UNUSUALLY HIGH INCIDENCE OF NEEDING BRAKE REPAIRS.  WE ARE ON OUR 2ND BRAKE JOB IN  UNDER 40,000 MILES.  THE DISC ROTORS HAVE WARPED TWICE, RESULTING IN STRONG VIBRATION (NOT ABS) WHEN STOPPING. THE BRAKES ALSO SQUEAL IN REVERSE, ANNOYING, AND POSSIBLY A SYMPTOM OF AN UNDERLYING PROBLEM. THE DEALER HAS PREFORMED A PAD REPLACEMENT ,EVEN THOUGH THERE WAS ADEQUATE MATERIAL REMAINING,  AND ROTOR TURNING 2 TIMES.  MY ON-LINE RESEARCH, AND THE CONSUMER REPORTS DOCUMENTATION REPORTS A SIGNIFICANT  PERCENTAGE , OVER 14%  HAVE SUFFERED SIMILAR PROBLEMS.  IF THIS WERE OCCURING IN A LESS CRITICAL COMPONENT I WOULDN'T BE AS CONCERNED.HOWEVER THIS SEEMS TO BE A VERY SHORT LIFESPAN FOR BRAKES IN A NON-HIGH PERFORMANCE VEHICLE. ADDITIONALLY THE PADS AREN'T WEARING, BUT THE ROTORS ARE FAILING.*AK",
        "vin": "4S3BH806317"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/08/2005",
        "dateOfIncident": "03/08/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112696,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 SUBARU OUTBACK.  I BOUGHT IT NEW AND OVER THE LAST 4 YEARS IT HAS REQUIRED 3 COMPLETE BRAKE JOBS (ROTORS AND PADS), SO CURRENTLY THE CAR HAS IT'S 4TH SET OF BRAKES.  I HAVE NEVER OWNED ANY CAR THAT HAS REQUIRED THAT MANY BRAKES JOBS IN SUCH A SHORT PERIOD OF TIME.   I HAVE HAD ALL MY REPAIRS DONE AT SUBARU DEALERSHIPS AND HAVE BEEN TOLD BY THE SERVICE TECHNICIANS THAT THE DESIGN AND MATERIALS OF THE BRAKES CAUSE THE ROTORS TO WARP AND WEAR OUT PREMATURELY, REQUIRING BOTH THE PADS AND ROTORS NEEDING TO BE REPLACED EACH TIME, WHICH IS EXPENSIVE.  AS THE WEAR PROGRESSES, THE STEERING WHEEL WOBBLES AND THE WOBBLE GETS WORSE VERY QUICKLY OVER TIME.  THE FIRST 2 BRAKE JOBS WERE COVERED UNDER WARRANTY.  I HAD TO PAY FOR THE LAST ONE.  I HAVE SINCE LEARNED THAT THERE ARE MANY OTHER SUBARU OWNERS LIKE ME EXPERIENCING THE SAME PREMATURE BRAKE WEAR.  FOR JUST ONE EXAMPLE OF OTHER TESTIMONIALS, VISIT THE WEBSITE WW.AUTOBYTEL.COM/CONTENT/RESEARCH/FORUMS/INDEX.CFM/ACTION/POSTS/FID/1959   AND YOU CAN SEE THAT I AM NOT ALONE IN MY COMPLAINT.  I BELIEVE THE BRAKE DESIGN IS A FACTORY DEFECT.  I THINK SUBARU SHOULD REDESIGN THEM AND IN THE MEAN TIME BE MADE TO COVER THE COST OF THESE REPEATED REPAIRS.  I HAVE BEEN IN CONTACT WITH SUBARU OF AMERICA ABOUT THIS PROBLEM BUT THEIR POSITION IS THAT IT IS \"A WEAR ISSUE\".  I REALIZE, LIKE TIRES, CERTAIN ITEMS ON CARS DO WEAR OUT OVER TIME AND REQUIRE REPLACEMENT AS PART OF THE NORMAL MAINTENANCE OF A CAR.  HOWEVER, I DO NOT AGREE THAT THE PROBLEM WITH THE BRAKES ON MY SUBARU IS SIMPLY A WEAR ISSUE AND APPARENTLY, NEITHER DO THEIR OWN MAINTENANCE TECHNICIANS.  *AK",
        "vin": "4S3BH806117"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/07/2005",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112626,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE ROTORS HAVE BEEN REPLACED 4 TIMES IN 60,000 MI.  ROTORS WARP AND CAUSE FRONT END SHAKING WHEN BRAKES APPLIED.  *AK",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/16/2005",
        "dateOfIncident": "12/15/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106664,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 50 MPH  FRONT PASSENGER SIDE WHEEL STUDS SHEARED OFF. AS A RESULT, THE WHEEL SEPARATED FROM THE VEHICLE.  NO COLLISION REPORTED. *AK   *NM",
        "vin": "4S3BH675X16"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/06/2005",
        "dateOfIncident": "01/27/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109936,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) EVENTS LEADING TO FAILURE---JUST DRIVING THE CAR, THEN CHECK ENGINE LIGHT CAME ON, THEN ENGINE STARTED TO GET HOT, SO CAR WAS TOWED TO DEALER.  (2) FAILURE AND ITS CONSEQUENCES--$1900 REPAIR BILL-TWO HEAD GASKET IN ENGINE---FROM ARLINGTON, MA SUBARU DEALER--ESTIMATE REDUCED TO $1700 UPON REQUEST.  GETTING REPAIR DONE WITH OTHER SHOP (3) GETTING TWO HEAD GASKETS AND OTHER ENGINE GASKETS REPLACED.  *JB",
        "vin": "4S3BH686217"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2005",
        "dateOfIncident": "01/24/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107791,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG SMELL OF FUEL IN PASSENGER COMPARTMENT DURING EXTREMELY COLD WEATHER.   *NM",
        "vin": "4S3BH675517"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2005",
        "dateOfIncident": "12/09/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103538,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE WAS PARKED THE SRS LIGHT APPEARED ON THE DASHBOARD AND REMAINED ON.  VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION.  *AK  *TC",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/04/2005",
        "dateOfIncident": "01/04/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106756,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  WAS ON A SLIGHT INCLINE AND FOOT WAS PLACED ON THE BRAKES AND VEHICLE SUDDENLY ACCELERATED.  THE BRAKE PEDAL WENT TO THE FLOOR, AND CONSUMER'S VEHICLE  REAR ENDED THE  VEHICLE IN FRONT. UPON IMPACT,  BOTH AIR BAGS  FAILED TO DEPLOY.  NO INJURIES TO REPORT.  VEHICLE WAS TOWED TO THE DEALER.  HOWEVER,  MECHANIC INFORMED CONSUMER  THAT THE PROBLEM COULD  NOT BE DUPLICATED. *AK",
        "vin": "4S3BH686117"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "09/21/2004",
        "dateOfIncident": "09/12/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094357,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMERS CHILD ACCIDENTALLY BUMPED THE SHIFT MECHANISM CAUSING VEHICLE TO ROLL BACKWARDS.  THE KEYS WERE NOT IN THE IGNITION WHEN THE CONSUMERS SON BUMPED INTO THE SHIFT. IT WAS VERIFIED THAT THE SAFETY INTERLOCK WAS NOT OPERATING AS DESIGNED.  (A PIN HAD COME DISCONNECTED)   *SC  *JB",
        "vin": "4S3BH665817"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "09/15/2004",
        "dateOfIncident": "09/12/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091032,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 4  YR OLD SON WENT INTO THIS CAR WHICH WAS IN PARK IN OUR DRIVEWAY.  THE KEYS WERE NOT IN THE CAR.  HE BUMPED INTO THE SHIFT MECHANISM WHICH SUBSEQUENTLY ALLOWED THE CAR TO DRIFT BACKWARDS FROM THE SLIGHT GRADE. FORTUNATELY, THERE WAS NO INJURY, BUT THERE WAS CONSIDERABLE DAMAGE AND UNDER DIFFERENT CONDITIONS, IT COULD HAVE BEEN TRAGIC.  THE CAR WAS RETURNED TO SUBURU WHO VERIFIED THAT THE SAFETY INTERLOCK WAS NOT OPERATING AS DESIGNED.  SUBURU INSISTS THAT THIS SAFETY INTERLOCK IS NOT THEIR RESPONSIBILITY AS THE CAR IS BEYOND THE GENERAL 3 YR, 36,000 MILE WARRANTY (THE CAR HAS APPROX 46,000 MILES).  THEY HAVE NO EXPLANATION OTHER THAN A \u001cPIN\u001d CAME DISCONNECTED.*AK",
        "vin": "4S3BH665817"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "08/12/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088209,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CRUISE CONTROL FAILED TO DISENGAGE WITH BRAKE OR CLUTCH.  *AK",
        "vin": "4S3BH675016"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "06/25/2004",
        "dateOfIncident": "06/25/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10078784,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 SUBARU OUTBACK VDC.  SINCE PURCHASE I HAVE HAD REPEATED PROBLEMS WITH WARPING OF THE FRONT BRAKE ROTORS.  THE ROTORS HAVE BEEN TURNED TWICE, THEN REPLACED BY SUBARU IN APRIL 2003.  THE ROTORS HAVE NOW WARPED AGAIN AND ARE NO LONGER UNDER WARRANTLY.  THIS CONDITION LEADS TO UNCONTROLLABLE WHEEL AND FRONT END SHAKING WHEN BRAKING AT HIGH SPEEDS.  THERE HAVE BEEN NUMEROUS OTHER COMPLAINTS FOR THIS VEHICLE.*AK",
        "vin": "4S3BH896417"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2004",
        "dateOfIncident": "01/07/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072779,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE GONE THROUGH ONE HEAD GASKET ON JAN 2003.  THE HEAD GASKET WENT OUT IN DEC OF 2003 AND THE WHOLE ENGINE HAD TO BE REPLACED.  IN JANUARY OF 2004 I HAD THE OVERHEAD CAMGASKETS GO OUT ON THE CAR AS WELL AS THE THE OXYGEN SENSOR.  I HAVE HAD MORE ISSUES BUT IT WOULD BE A SMALL BOOK.  SUBARU HAS BEEN RELATIVLY UNRESPONSIVE EVEN AFTER MANY PHONE CALLS AND LETTERS TO MY CONCERNS.  EVERY PART WAS REPLACED HOWEVER THERE SEEMS TO BE A POROBLEM WITH MY NEW ENGINE SINCE THERE IS NOW AN INVESTIGATION WITHIN SUBARU.  THEY REFUSE TO PAY THE DEALERSHIP FOR THE NEW ENGINE REPLACEMENT WHICH RAISES THE QUESTION OF WAS THIS A NEW ENGINE OR WHAT IS WRONG WITH THE NEW ENGINE.  *AK",
        "vin": "4S3BH675017"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/14/2004",
        "dateOfIncident": "03/07/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072644,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE PADS WORE OUT AT LESS THAN 36,000. DEALER REPLACED THE PADS UNDER THE WARRANTY. COME TO FIND OUT THE ROTORS ARE WARPED TOO. WE DID NOT REALIZE IT UNTIL A LITTLE OVER 36,000 MILES. DEALER WILL NOT FIX ROTORS UNDER WARRANTY BECAUSE WE BROUGHT FOR SERVICE AFTER WARRANTY EXPIRED. A LITTLE RESEARCH HAS IDENTIFIED THAT WE ARE NOT THE ONLY PEOPLE WITH THIS PROBLEM ON THIS CAR. WE ARE NOT AT ALL HARD ON THE BRAKES EITHER. ONLY LOGICAL EXPLANATION FOR THIS FAILURE IS A.) CAR WAS MANUFACTURED WITH A DEFECTIVE PART(S) OR B.) SUBARU HAS NOT DESIGNED / INSTALLED SUFFICIENT ROTORS ETC. FOR THIS VCEHICLE. I'M GUESSING THAT OPTION B IS THE PROBLEM HERE!*AK",
        "vin": "4S3BH686317"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": "09/25/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072418,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CLUTCH SHUDDERS WHEN COLD AND SOMETIMES WHEN WARMED UP.  BEEN HAPPENING SINCE AROUND 20K MILES.  TOOK TO DEALER AT 25K MILES BUT THEY COULDN'T DUPLICATE PROBLEM.  THEY SAID BRING IT BACK WHEN PROBLEM WORSENS.  BROUGHT BACK TO DEALER AT 56K MILES, AND DEALER SAID CLUTCH WAS BAD.  WOULDN'T COVER IT UNDER WARRANTY SINCE THEY SAID IT WAS \"USER WEAR\". YEAH, RIGHT!  I HAD TO PAY FULL COST TO REPLACE THE CLUTCH!!  I THINK THIS SHOULD BE INVESTIGATED SINCE MANY PEOPLE WITH OUTBACK CLUTCHES HAVE SIMILAR PROBLEMS.  I'VE LOOK AT OUTBACK MODEL YEARS 2000-2003 ON THE NHTSA COMPLAINT WEB SITE AND THERE ARE MANY INCIDENCES ABOUT THE DEFECTIVE CLUTCHES.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2004",
        "dateOfIncident": "05/03/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071973,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 50 MPH THERE WAS VIBRATION IN THE CENTER OF THE VEHICLE.  CONSUMER TOOK VEHICLE  TO THE DEALERSHIP, AND  TECHNICIAN DETERMINED REAR DIFFERENTIAL UNIT NEEDED TO BE REPLACED.  *AK",
        "vin": "4S3BH896117"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/23/2004",
        "dateOfIncident": "04/20/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067720,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 SUBARU OUTBACK HAS A CLUTCH  SHUDDER ( JUTTER ) THAT IS REPORTED TO OCCUR IN ALL SUBARU MODELS WITH THE 2.5 LTR ENGINE. THERE ARE INUMERABLE CONSUMER COMPLAINTS ABOUT THE PROBLEM AND YET SUBARU BURRIES ITS HEAD IN THE SAND AND PRETENDS THERE IS NO PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/13/2004",
        "dateOfIncident": "04/13/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066091,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE ABOUT 10,000 MILES THE CLUTCH SHUDDERS WHEN TRYING TO ACCELERATE.  USUALLY ONLY WHEN ENGINE IS COLD BUT NOT 100% OF THE TIME.  HAVE COMPLAINED TO SUBARU DEALER BUT THEY COULD NOT DUPLICATE THE PROBLEM.  APPARENTLY A KNOWN PROBLEM WITH SOME SUBARUS BUT NOT ALL DEALERS ADDRESS IT.",
        "vin": "4S3BH665916"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/07/2004",
        "dateOfIncident": "11/01/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065746,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH ON OUR 2001 SUBARU OUTBACK LIMITED SHUDDERS WHEN THE CAR AND/OR TEMPERATURE IS COLD.  IT HAS DONE THIS FOR THE LAST 30-40,000 MILES.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": "01/16/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059306,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EMITTED WHITE SMOKE THROUGH THE AIR VENTS. THE VEHICLE WAS TAKEN TO THE DEALER BUT THE PROBLEM STILL EXIST.  *NM",
        "vin": "FILLIN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "11/15/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069493,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ODOR MOST LIKELY DESCRIBED AS HEATED ANTIFREEZE, ALSO ROTTEN EGG ODOR - AT LEAST TEN DIFFERENT ATTEMPTS TO IDENTIFY ODOR AND FIND CAUSE. CAR NOW HAS 59,000 MILES.",
        "vin": "4S3BH686X17"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2003",
        "dateOfIncident": "01/08/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049222,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH SHUDDER PROBLEM SINCE 20K MILES. HAPPENS WHEN COLD OR DAMP OUT, HESITATES WHEN ACCELERATING IN FIRST GEAR, FROM STOPPED POSITION.  THE VEHICLE WAS TAKEN TO THE DEALER 3 TIMES, INCLUDING TEST DRIVE W/ MECHANIC,CAN'T FIND THE PROBLEM.    *NLM",
        "vin": "4S3BH675316"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/21/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048437,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER IS UNABLE TO GET AN APPOINTMENT SINCE JULY 2003 TO HAVE THE RECALL WORK PERFORMED.  THE RECALL IS FOR REAR SUSPENSION SUB FRAME CORROSION (3V153000) .    *NLM",
        "vin": "4S3BH665727"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/12/2003",
        "dateOfIncident": "10/09/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042673,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 03V153000 CONCERNING REAR SUSPENSION SUB FRAME ASSEMBLY: VEHICLE WAS TAKEN TO THE DEALER FOR RECALL REPAIRS.  THE CONSUMER  WAS TOLD THAT THE REPAIRS COULD NOT BE DONE BECAUSE NO SPRAY BOOTH WAS  AVAILABLE.  THE DEALER REFUSED TO HELP THE CONSUMER FIND A DEALER WITH A SPRAY BOOTH.*AK   *JB   *NLM",
        "vin": "4S3BE686117"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2003",
        "dateOfIncident": "09/26/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041409,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SUBARU OUTBACK UNLIMITED 2001 NEEDS A TRANSMISSION REPLACED AFTER ONLY 74,000. ALL THE REPAIRS AND SERVICE WERE PERFORMED AT THE DEALERSHIP INCLUDING THE 60,00 MILE MAJOR TUNE-UP. ALL THE SERVICE WAS DONE TIMELY AND AS RECOMMENDED. THE DEALER FIRST SAID THE NOISE WAS THE ALTERNATOR AND REPLACED THE ALTERNATOR, BUT THE NOISE CONTINUED. I TOOK THE CAR TO ANOTHER SUBARU DEALER WHO SAID THE PROBLEM WAS THE TRANSMISSION AND SUSPECTED IT WAS NOT SERVICED APPROPRIATELY. I RETURNED THE CAR TO THE ORIGINAL DEALER AT THEIR REQUEST. THEY THEN REMOVED THE REPLACED ALTERNATOR AND RETURNED MY ORIGINAL ALTERNATOR, BUT REFUSED ANY RESPONSIBILITY FOR MY TRANSMISSION FAILURE. *JB",
        "vin": "4S3BH686717"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/06/2003",
        "dateOfIncident": "09/24/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041337,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WILDERNESS M&S",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE SIDEWALL BLOWOUT, FIRESTONE WILDERNESS. DOOR PLATE SHOWS 30 PSI, TIRE SHOWS 44 PSI, DIFFERENCE OF 14 POUNDS--TOO MUCH DIFFERENCE. *JB",
        "vin": "4S3BH675417"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2003",
        "dateOfIncident": "09/16/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040618,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED AND OFF.  PLEASE PROVIDE ANY FURTHER INFORMATION.  *NLM   THE VEHICLE MOVED FORWARD TOWARDS THE FENCE.  *LA",
        "vin": "4S3BH665317"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/23/2003",
        "dateOfIncident": "09/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039364,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TOLD BY DEALER THAT LEFT HEAD GASKET IS LEAKING COOLANT.  $1,600 TO HAVE HEAD REMOVED, PLANED AND REGASKETED, AND REINSTALLED.  75,000 HIGHWAY MILES ON VERY WELL KEPT VEHICLE.  I DID NOT SMELL COOLANT UNTIL AFTER A SERVICE IN MID AUG. 03 DURING WHICH THEY FLUSHED MY COOLANT SYSTEM.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/10/2003",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037583,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 SUBARU OUTBACK, 22000 MILES. CLUTCH NEEDED REPLACEMENT.  *JB",
        "vin": ""
    },
    {
        "components": "INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/06/2003",
        "dateOfIncident": "12/12/2000",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037352,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR LIGHTS TYPICALLY DO NOT GO OFF WHEN SHUTTING DOORS OR LIFT GATE. TO GET LIGHTS TO TURN OFF, DOORS NEED TO BE SLAMMED SO HARD I'M AFRAID THE GLASS WILL SHATTER. SUBARU DEALER HAS REFUSED TO REPAIR UNDER 3/36 WARRANTY. THEY SAID TO JUST TURN LIGHTS OFF WITH THE INTERIOR SWITCHES SO THAT THEY DO NOT TURN ON WHEN DOORS ARE OPENED. THIS HAS BEEN A PROBLEM SINCE THE CAR WAS NEW.*AK",
        "vin": "4S3BH686617"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/03/2003",
        "dateOfIncident": "08/17/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037147,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKES DO NOT WORK PROPERLY WHEN COLD, ABS DOESN'T SEEM TO ENGAGE; MY ROTORS HAVE WARPED ON 4 DIFFERENT OCCASSIONS AND HAVE BEEN \"TURNED\" 3 TIMES AND REPLACED ONCE. MY VEHICLE IS ONLY 2 YEARS OLD AND HAS 37,000 MILES. I HAVE FOUND SEVERAL OTHER PEOPLE WITH THE EXACT SAME VEHICLE AND THEY HAVE ALSO EXPERIENCED THE SAME PROBLEMS, ESPECIALLY THE FREQUENT WARPING OF THE ROTORS.*AK",
        "vin": "4S3BH686X17"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/08/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032459,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE SUN ROOF EXPLODED.  *JB",
        "vin": "4S3BH686317"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/03/2003",
        "dateOfIncident": "05/16/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030676,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBARU 2001 LL BEAN 3.0 OUTBACK. FRONT DISC BRAKE PADS WORE OUT AT 13800 MILES - SQUEAKER WAS TOUCHING, PADS WERE GONE, AND ROTOR WAS SCORED. CAR WAS UNSAFE TO DRIVE SO REPLACED PADS AND SURFACED ROTORS AT LOCAL SHOP ON WEEKEND. AT ABOUT 20,000 MILES HAD DEALER INSPECT BRAKES - PADS AND ROTOR WERE WORN AGAIN. ROTORS WERE WARPED. SUBARU REFUSED TO REPLACE PADS UNDER WARRANTY (WE PAID) BUT DID REPLACE ROTORS UNDER WARRANTY. AT 31,600 ROTORS WERE EXPERIENCING SHAKING AT BRAKE INITIATION. TOOK CAR IN, ROTORS WERE \"WARPED DUE TO HEAT\" AND PADS (FRONT AND BACK) WERE AGAIN WORN OUT. DEALER REPLACED FRONT AND BACK ROTORS AND PADS. SAID THAT OUR \"DRIVING\"  MIGHT BE THE PROBLEM - USING THE BRAKES TOO MUCH AND SHOULD SHIFT DOWN ON HILLS.  AT 33000 MILES FRONT PADS AND ROTORS ARE AGAIN SHOWING WEAR.  AFTER MANY CALLS AND VISITS ANOTHER DEALER'S SERVICEMAN INTIMATED THAT REALLY THE \"ROTORS ARE TOO SMALL\" FOR THE NEW 3.0 LITER ENGINE WEIGHT.  SUMMARY - BRAKES WEAR OUT EVERY 10-12,000 MILES AND ROTORS ARE SENSITIVE TO ANY HEAVY OR PROLONGED BRAKING (FOR EXAMPLE - GOING DOWN A LONG STEEP HILL). DEALERS HAVE BEEN HELPFUL AND SYMPATHETIC BUT CANNOT FIX THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024546,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH VEHICLE SURGING FORWARD WHEN DRIVING AT LOW SPEEDS OR WHEN PARKING.  *MR *TS",
        "vin": "4S3BH806217"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/28/2003",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10021749,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN HIT ON THEIR FRONT LEFT SIDE OF THE VEHICLE THE AIR BAG DID NOT DEPLOY CAUSING MINOR INJURIES TO THE CONSUMER.        *TT",
        "vin": "PLEASE PROV"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/15/2003",
        "dateOfIncident": "03/10/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019902,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE WAS INVOLVED IN A COLLISION BUT THE AIR BAG DID NOT DEPLOY. THE DEALER WAS NOTIFIED.   *NLM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "02/25/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018329,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WILDERNESS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "HI,  ON FEBRUARY 25, 2003 WHILE DRIVING ON THE HIGHWAY MY LEFT REAR FIRESTONE TIRE ON MY SUBARU OUTBACK BLEW UP.  I WAS VERY LUCKY THAT NO ONE WAS NEXT TO MY CAR AT THE TIME THE TIRE BLEW AND I WAS ABLE TO PULL TO THE SIDE.  THE TIRE WAS FIRESTONE WILDERNESS 225 60-16  H-RATED.  PART # 074772.  THE CAR IS A SUBARU 2001 AND IT HAD ONLY 21000 MILES WHEN THE TIRE BLEW.  I CONTACTED FIRESTONE CUSTOMER SERVICE DEPT. AND THE FIRESTONE SHOP ON DEMPSTER IN SKOKIE, ILLINOIS AND WAS INFORMED THAT I WILL HAVE TO PURCHASE 4 NEW TIRES BECAUSE IF I REPLACE ONLY THE TIRE THAT BLEW, IT WILL DAMAGE MY TRANSMISSION.  I ASKED WHY THE TIRE BLEW WITH ONLY 21,000 MILES ON IT AND THEY COULD NOT EXPLAIN BUT SAID THEY WILL SEND IT BACK TO THEIR FACTORY FOR INVESTIGATION.  THEY WERE WILLING TO PRORATE ONLY THE TIRE THAT BLEW, NOT ALL 4 NEW TIRES.  I HAD TO PAY CLOSE TO $400 FOR 4 NEW TIRES.    I CONTACTED YOUR OFFICE BY PHONE THE SAME WEEK AND EXPLAINED MY PROBLEM TO A LADY IN YOUR OFFICE.  I WAS TOLD THAT I WILL GET A FORM IN THE MAIL TO BE FILLED OUT BY ME BUT I DID NOT GET IT SO I DECIDED TO CONTACT YOU BY E-MAIL.  A FEW WEEKS LATER, WHEN I CHANGED MY OIL AT THE SUBARU DEALER ON GRAND AVENUE IN NAPERVILLE ILLINOIS, AN EMPLOYEE IN THE SERVICE DEPARTMENT STATED THAT HE WAS AWARE OF ANOTHER INCIDENT ABOUT A MONTH EARLIER THAT A LADY CAME INTO THE SHOP WITH A SIMILAR BLOW OUT ON THE SAME FIRESTONE TYPE WILDERNESS TIRE AND SHE HAD TO BUY 4 TIRES ALSO.  I AM CONCERNED THAT THERE MIGHT BE MORE SUCH INSTANCES AND SOMEONE NEEDS TO INVESTIGATE THIS ISSUE BEFORE SOMEONE GETS KILLED.     THE TIRE SEPARATED 360 DEGREES ON ITS SIDE AROUND WHERE THE WHITE CIRCLE IS ON THE SIDEWALL.  I TOOK A NUMBER OF DIGITAL PICTURES OF THE TIRE THAT BLEW BEFORE FIRESTONE TOOK IT.  I WOULD LIKE TO SEND THEM TO YOU EITHER BY E-MAIL OR I CAN MAKE PRINTS.   *JB  PLEASE ADVISE.  ZELIG",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/05/2003",
        "dateOfIncident": "05/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018125,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A PULSATION IN THE STEERING WHEEL WHEN BRAKES ARE APPLIED, DUE TO BRAKE/ROTOR FAILURE. THESE PART ARE CONTINUOUSLY REPLACED. THE DEALERSHIP INDICATED THAT DUE TO THE SIZE OF THE TIRE A THINNER BRAKE PAD WAS USED TO COMPENSATE.",
        "vin": "4S3BE686617"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2003",
        "dateOfIncident": "12/20/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016962,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE CLOSING THE DRIVERS DOOR, INNER PANELS OR STRUCTURES PARTIALLY SEPARATED OR DELAMINATED FROM THE OUTER METAL PORTION OF THE DOOR IN TWO LAYERS.  DATE IS AN ESTIMATE, IT WAS WINTER  *JB",
        "vin": "4S3BH686216"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/02/2003",
        "dateOfIncident": "03/15/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018028,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE ROTORS WORE AND CAUSED THE VEHICLE TO EXPERIENCE EXTENDED STOPPING DISTANCE WHEN BRAKING.  *NLM",
        "vin": "FILL IN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/30/2003",
        "dateOfIncident": "09/20/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016743,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE BEEN EXPERIENCING CONTINUED BRAKE PROBLEMS WITH MY 2001 SUBARU OUTBACK LTD. THIS CAUSES  SHUDDERING AND PULL TO BOTH LEFT & RIGHT UPON APPLICATION OF BRAKES. DEALER HAS TURNED ROTORS ETC. ( 1ST @ 18000 MILES)  BUT PROBLEM STILL EXISTS (CURRENT MILAGE 28500) I HAVE BEEN HEARING OF OTHER INDIV. WITH THE SAME PROBLEMS IN THIS MODEL YEAR...RUMOR : ROTORS ARE TOO THIN /UNDERSIZED? FOR CAR HEAT BUILD UP ETC. I FEEL THIS TO BE A SAFETY ISSUE AS WELL . CAR IS HARD TO STOP IN A STRAIGHT LINE...I AM ALSO CONCERNED AS TO SUBARU BACKING UP THEIR WARRANTY ON THIS PROBLEM, AS I'VE BEEN HEARING SOME \"HORROR STORIES\" . CAN YOU EXPLORE THE SAFETY/WARRANTY ISSUES ON THIS PROBLEM?",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/21/2003",
        "dateOfIncident": "03/20/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016268,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD TO REPLACE THE BRAKES IN MY 2001 SUBARU OUTBACK AFTER 20,000 MILES.  I LIVED THE LAST TWO YEARS IN ALASKA AND WAS TOLD BY THE DEALER SERVICE DEPARTMENT IN SEATTLE THE SALT FROM THE ROADS CREATED EARLY CORROSION ON THE BRAKE PADS AND DISC.  THE OUTBACK IS DESIGNED FOR MORE RUGGED DRIVING AND FOR GEOGRAPHIC LOCATIONS WITH HARSHER WINTERS.  SOMETHING ABOUT THE DESIGN OF THE BRAKES CAUSES THE SALT AND DIRT FROM WINTER ROADS TO CHANNEL UP THROUGH THE BRAKE SYSTEM AND CAUSE EXCESSIVE WEAR AND TEAR.  I JUST PAID FOR A COMPLETE BRAKE REPLACEMENT AS THE FRONT PADS WERE NO LONGER ENGAGING CORRECTLY AND THE BRAKES ARE VERY WORN DUE TO THE SALT.*JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/14/2003",
        "dateOfIncident": "03/12/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011715,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WILDERNESS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE RIGHT REAR TIRE BLEW OUT WITH NO WARNING.  *JB  THE CONSUMER EXCESSIVELY CHECKED FOR CRACKS WHICH WERE FOUND ON ALL FOUR TIRES.  SCC",
        "vin": "453BH675117"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/11/2003",
        "dateOfIncident": "03/05/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010279,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS SIGNIFICANT HESITATION DURING PERIODS OF ACCELERATION, USUALLY AROUND 2500-3500 RPM.  POTENTIALLY DANGEROUS IN MANY DRIVING SITUATIONS. HAVE REPORTED TO DEALER MULTIPLE TIMES.   RESPONSE IS ALWAYS \"CANNOT REPRODUCE - COMPUTER SHOWS OPERATING AS DESIGNED\".  CAR ALSO HAS SPONTANEOUS ACCELERATION AT LOW SPEED, SUCH AS FIRST TAKING FOOT OFF BRAKE.*JB",
        "vin": "4S3BH896017"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/27/2003",
        "dateOfIncident": "02/23/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009497,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE STEEL PROD. CO.",
                "productMake": "FIRESTONE",
                "productModel": "FIRESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE FRONT PASSENGER TIRE BLEW OUT, WHICH CAUSED THE CONSUMER TO PULL OVER. *JB",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2003",
        "dateOfIncident": "02/27/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002568,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION AND DESCENDING A STEEP GRADE THE VEHICLE WILL INTERMITTENTLY ACCELERATE ON ITS OWN UP TO 4500 AND 5000 RPM'S.  DEALER IS UNABLE TO DUPLICATE THE PROBLEM.  *JG",
        "vin": "4S3BH806417"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "01/21/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003147,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD WEATHER (TODAY WAS 15 F), BRAKES DO NOT WORK ON FIRST APPLICATION FROM  A COLD START. BRAKES HAVE BEEN SERVICE TWICE (PADS REPLACED, ROTORS TURNED) BUT  DEALER CANNOT REPLICATE PROBLEM SINCE THE CAR HAS WARMED UP.",
        "vin": "4S3BH806717"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/18/2003",
        "dateOfIncident": "08/19/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002897,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR HEADRESTS DO NOT LOCK INTO UPRIGHT AND DOWN POSITIONS BECAUSE THE METAL SLEEVE  INSIDE SEAT SLIPS OVER TIME. HAPPENED EVEN AFTER BEING FIXED ONCE BY DEALER.",
        "vin": "4S3BH806817"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/18/2003",
        "dateOfIncident": "06/25/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002900,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO CATASTROPHIC WIRING FAILURES IN MAIN COMPUTER WIRING LED TO VEHICLE SUDDENLY GOING DEAD.  FIRST AT 3000 MILES TRACED TO SHORT IN MAIN RELAY WHICH WAS REPLACED. SECOND AT 16,000 MILES TRACED TO SHORT IN WIRE HARNESS UNDER THE PASSENGER FOOTWELL.  POOR DESIGN PLACED THE ESSENTIAL COMPUTER WIRES UNDER THE PASSENGER FOOTWELL WHERE IT GETS CONSTANT PRESSURE WEAR. DEALER REPLACED WIRES INSIDE HARNESS AND ADDED CUSHIONING AROUND IT. THE SECOND FAILURE CREATES DOUBT THAT THE FIRST FAILURE WAS DUE TO A DEFECTIVE MAIN RELAY. BOTH FAILURE CAUSED THE VEHICLE TO BE DEAD. BOTH HAD NO WARNING EXCEPT THE FIRST TIME THE TEMPERATURE LIGHT CAME ON IMMEDIATELY BEFORE THE CAR WENT DEAD.",
        "vin": "4S3BH806817"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/10/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002557,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WILDERNESS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE TRAVELING AT 65 MPH, CONSUMER STATES RIGHT REAR TIRE BLEW 2 1/2 INCHES FROM THE RIM, AND THERE WERE SPLITS GOING ALL THE WAY AROUND TIRE.  PLEASE PROVIDE ANY FURTHER INFORMATION.*JB",
        "vin": "4S3BH665017"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/31/2002",
        "dateOfIncident": "11/08/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001729,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE DRIVING AND NO WARNING THE FRONT AND REAR WHEELS WOULD GET STUCK. DO TO DRIVING IN THE SNOW. CONSUMER STATES THE RIM SIZE ON THE VEHICLE IS 16\". DEALER NOTIFIED. TS",
        "vin": "FILL IN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": "12/12/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001077,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT ANY SPEED AND APPLIED THE BRAKES, THE VEHICLE CAN EXPERIENCE EXTENDED STOPPING DISTANCE, VEHICLE SUFFERED SUDDEN ACCELERATION. DEALER HAS INSPECTED THE VEHICLE AND COULD NOT DUPLICATE OR CORRECT THE PROBLEM. PLEASE PROVIDE FURTHER INFORMATION. TS",
        "vin": "4S3BH806617"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/13/2002",
        "dateOfIncident": "11/12/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022682,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS LEAKING FROM THE SUNROOF ASSEMBLY (HINGES). DEALER REPAIR AN CONSUMER STATES THE PROBLEM IS REOCURRING. PLEASE PROVIDE FURTHER INFORMATION. WE DON'T HAVE NO RECALL LIKE THIS PROBLEM.   MR",
        "vin": "4S3BH686X17"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/21/2002",
        "dateOfIncident": "02/15/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567184,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE BEGAN ACCELERATING ON ITS OWN WHILE DESCENDING A 1.5 MILE GRADE. THE PROBLEM REOCCURRED SEVERAL TIMES, BUT THE DEALER WAS UNABLE TO DUPLICATE THE PROBLEM. THE CONSUMER BELIEVES THE VEHICLE IS DEFECTIVE.  *YH",
        "vin": "4S3BH806417"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/13/2002",
        "dateOfIncident": "05/30/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765590,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DANGEROUS CLUTCH SHUDDER WHEN SHIFTING IN LOW GEARS.  CAR CAN STALL IN BAD INTERSECTIONS.  THIS IS DANGEROUS.  THERE IS A LOT OF PUBLIC DISCUSSION ABOUT THIS PROBLEM HERE:   HTTP://PUB1.EZBOARD.COM/FULTIMATESUBARUMESSAGEBOARDSTHENEWGENERATIONOFSUBARUS.SHOWMESSAGE?TOPICID=3533.TOPIC",
        "vin": "4S3BH686316"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/23/2002",
        "dateOfIncident": "10/26/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764634,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL JACK COLLAPSED WHILE JACKING UP FRONT END DRIVER SIDE.  THE JACK WAS REPLACED AND AGAIN COLLAPSED WHILE JACKING UP THE DRIVER SIDE.  IT APPEARS THE SHANK IS TOO LONG TO SUPPORT THE WEIGHT OF THE CAR.*AK",
        "vin": "4S3BH806017"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764455,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ATTEMPTS TO ACCELERATE WHEN APPLYING BRAKES TO COME TO A STOP. ENGINE ROARS AND IT IS DIFFICULT TO STOP CAR. PROBLEM HAPPENS INTERMITTENTLY AND USUALLY WHEN THE CAR IS GOING 5 MILES PER HOUR OR LESS. BRAKE PEDAL GOES ALL THE WAY DOWN WHEN ATTEMPTING TO STOP CAR.*AK",
        "vin": "4S3BH806617"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2002",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013989,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SEVERE HESITATION WHEN PRESSING ON GAS PEDAL.  CONSUMER IS AFRAID OF BEING REAR ENDED. *AK  CONSUMER STATED THAT VEHICLE HAD A BAD HESITATION ON ACCELERATION FROM A STOP. ALSO BATTERY WAS DEAD.  *YH",
        "vin": "4S3BH806717"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "06/11/2002",
        "dateOfIncident": "06/11/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762933,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE LOSES HOLD OVERNIGHT AND CAR ROLLS DOWN HILL IF NOT IN GEAR. (5 SPD). *AK",
        "vin": "4S3BH665316"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/06/2002",
        "dateOfIncident": "05/15/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762723,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2001 OUTBACK SEDAN IN SEPT OF 2000 AND HAVE HAD IT INTO THE DEALER FOR REPAIR 7 TIMES NOW FOR FRONT BRAKE ROTOR WARPAGE, THEY HAVE TURNED THE ROTORS TILL THEY COULDNT BE TURNED ANYMORE, THEN SUBARU OF AMERICA AUTHORIZED A NEW SET OF ROTORS AND THEY TOO HAVE WARPED AND CAUSE SEVERE SIDE TO SIDE SHAKING OF THE STEEERING WHEEL IN ALL BRAKING.AFTER SPEAKING WITH ALL SUBARU OF AMERICA REPS THEY HAVE SAID THEY WILL DO NO MORE TO THE CAR, AND AGREED THAT THEY ARE SEEING IT OTHER IDENTICAL OUTBACKS AND IT IS A PROBLEM BUT THEY REFUSE TO ACCEPT RESPONSIBILITY THAT THE ROTORS ARE NOT ADEQUET FOR THE STOPPING POWER OF THE CAR. THEY HAVE TOLD ME THAT I NEED TO NOT DRIVE IN THE CITY WITH IT, AND WHEN I DO TO RELEASE MY FOOT FROM THE PEDAL WHEN AT STOP LIGHTS, TRAFFIC ETC SO AS NOT TO HEAT THE ROTORS UP. NUMEROUSE OUTBACKS HAVE BEEN HAVING THE SAME PROBLEM AND THIS IS A MAJOR SAFTEY ISSUE SINCE THIS CAR WAS DESIGNED PARITICULARY FOR THE WINTER ELEMENTS, SNOW DRIVING ETC. WHEN YOU GO TO BRAKE IN ANY ELEMENT THE CAR SHAKES EXTREMLY BAD AND THEY HAVE BEEN IN THE CAR AND SEEN WHAT IT DOES, BUT CONTINUE TO BLAME THE PROBLEM ON THE DRIVERS.THE BRAKE ROTORS I AM TOLD ARE BEING MANUFACTURED SMALLER AND THINNER THEREFORE DO NOT DISAPATE HEAT AND THEN WARP. THIS PROBLEM BEGAN AT 4000 MILES AND IT HAS BEEN A MAJOR SAFTEY ISSUE AS I DO EXTREME MOUNTAIN PASS DRIVING IN ALL CONDITIONS. I AM ASKING FOR HELP NOT ONLY FOR MYSELF BUT FOR THE OTHER OWNERS OF SUBARUS WITH THE SAME DEFECT.THEY REFUSE TO HONOR THE WARRANTY WORK AND SAY THAT THE ROTORS ARE NOT DEFECTIVE, EVEN THOUGH THEY HAVE REPLACED THEM UNDER WARRANTY ONCE, AND HAVE TURNED THEM UNDER WARRANTY TIME AND TIME AGAIN AND NOW THEY WILL NOT DO ANYTHING. THERE ARE REPORTS OF OWNERS MODIFYING THE FRONT ENDS TO ALLOW MORE AIR TO COOL THE ROTORS. THIS I FIND UNACCEPTABLE. IS THERE ANY HELP OUT THERE IF SO PLEASE HELP US.*AK",
        "vin": "4S3BE686917"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/09/2002",
        "dateOfIncident": "04/25/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9006771,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUDDENLY ACCELERATES WHILE DESCENDING STEEP HILL IN 1ST GEAR USING ENGINE AS BRAKE",
        "vin": "4S3BH806417"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009201,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH-SHUDDER PROBLEM HAS BEEN GOING ON SINCE THIS WINTER. IT HAPPENS MOST OFTEN IN THE MORNING, COLD SEEMS TO BE A FACTOR MOST OF THE TIME, AND IT SHUDDERS WHEN YOU GO FROM STOP TO GO. FIRST GEAR IS ALMOST IMPOSSIBLE TO GET OUT OF SMOOTHLY WITHOUT THE SHUDDERING. THE DEALER CANT SEEM TO REPLICATE THE PROBLEM, BUT I HAVE READ THE OTHER SUBARU OWNERS COMPLAINTS OF THE SAME PROBLEM ON THE SUBARU MESSAGE BOARD, SO I KNOW ITS MORE OF A PROBLEM THAN JUST OUR CAR. *TS  ***DIMSII IVOQ ENTRY POSTED AFTER 12-12-02 CUT OVER TO ARTEMIS***761667",
        "vin": "4S3BH665216"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/15/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005776,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TURNING STEERING WHEEL AND WITHOUT WARNING VEHICLE VIBRATED VIOLENTLY. DEALER AND MANUFACTURER HAVE BEEN NOTIFIED. THEY  STATED THAT THEY  WERE AWARE OF MALFUNCTION ON STEERING COLUMN;  HOWEVER, HAVE NOT FOUND OUT WHAT THE CAUSE WAS.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/06/2002",
        "dateOfIncident": "03/05/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759004,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE ORIGINAL RECALLS OF THE WILDERNESS TIRES OCCURRED WE WERE TOLD BY SUBARU AND FIRESTONE THAT OUR SIZE TIRE WAS NOT EFFECTED.  THESE TIRES WERE THE ORIGINAL EQUIPMENT ON THE CAR.  LAST NIGHT WE WERE DRIVING HOME AT ABOUT 11:00 AND COMING DOWN THE EXIT RAMP FROM ROUTE 270 ONTO MIDDLEBROOK ROAD IN GERMANTOWN.  MY HUSBAND HEARD A HISSING SOUND AND AT FIRST WE DISMISSED IT.  ABOUT A HALF MILE LATER AT A LIGHT WE HEARD AN ADDITIONAL SOUND AND REALIZED THE REAR PASSENGER SIDE TIRE HAD GONE FLAT.  MY HUSBAND PULLED OFF THE ROAD AND GOT OUT TO DISCOVER THE SIDEWALL HAD SEPARATED AND THE TIRE WAS EXTREMELY HOT.  IT DID NOT SEPARATE TO THE POINT OF RIPPING THE TIRE ALL THE WAY THROUGH, BUT ENOUGH OF A GAP YOU COULD PUT YOUR FINGER IN.  IT LOOKS LIKE THE SEPARATION GOES AT LEAST HALF WAY AROUND THE SIDE WALL (180 DEGREES) AND PROBABLY MORE.  WE ROAD ON THE FLAT (AT A SNAIL'S PACE) THE MILE TO OUR HOME SINCE WE STILL HAD RUBBER BETWEEN THE RIM AND ROAD.  THE SCAREY PART IS THAT IT WAS LATE, DARK AND IF WE'D GOTTEN STUCK ON ROUTE 270 IT WOULD NOT HAVE BEEN PLEASANT FOR MY HUSBAND TO CHANGE A TIRE UNDER THOSE CONDITIONS--IN FACT IT WOULD HAVE BEEN DOWNRIGHT DANGEROUS.  ISN'T THIS THE SAME THING THAT HAPPENED TO ALL THOSE OTHER WILDERNESS TIRES--THAT THE SIDEWALL SEPARATED, RIPPED AND THE TIRE WRAPPED AROUND THE AXLE AND FLIPPED VEHICLES?!  LUCKILY, BY THE GRACE OF GOD, OURS DIDN'T GO THAT FAR, BUT IT COULD HAVE.  OUR OUTBACK IS A WONDERFUL CAR AND WE LOVE EVERY MINUTE OF DRIVING IT, BUT FOR A STATIONWAGON ITS CENTER OF GRAVITY IS A LITTLE HIGHER THAN AVERAGE.  JUST LIKE THOSE SUVS WE COULD HAVE FLIPPED OUR BEAUTIFUL CAR IF THINGS DIDN'T TURN OUT THE WAY THEY DID.  NEEDLESS TO SAY, MY HUSBAND IS PISSED OFF.  HE CALLED THE FITZGERALD SUBARU IN GAITHERSBURG FOR ADVICE AND THEY SAID WE'LL HAVE TO DEAL WITH FIRESTONE.  DO I NEED TO FEAR THE THREE OTHER TIRES ON MY CAR NOW?   THANKS!   JOYCE MCDONALD. *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758689,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL VIBRATION AT HIGHWAY SPEED (50-70 MPH) (TIRESIZE: 225/60/R16)",
        "vin": "4S3BH686X16"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/11/2002",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003833,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS VIBRATION COMING FROM FRONT RIGHT SIDE OF VEHICLE.   IF VEHICLE HITS A BUMP STEERING WHEEL ALMOST JERKED OUT OF DRIVER'S HAND.   DEALER HAS BEEN CONTACTED.  *AK",
        "vin": "4F3BH665817"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/11/2002",
        "dateOfIncident": "09/24/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003836,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERDRIVE LIGHT ILLUMINATED. DRIVER HAD VEHICLE TOWED TO MECHANIC.  MECHANIC STATED THAT TRANSMISSION NEEDED TO BE  REPLACED. *AK",
        "vin": "1YVGE22C7V5"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/11/2002",
        "dateOfIncident": "09/04/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003841,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE  CHECK LIGHT ILLUMINATED AND STAYED ON. TOOK VEHICLE TO DEALER, AND STATED THAT  OXYGEN SENSOR WAS BAD.  *AK",
        "vin": "4F3BH665817"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "03/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757429,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE NEW, THE CLUTCH IN THIS CAR HAS HAD A BAD SHUDDER WHEN COLD OUTSIDE -- BAD ENOUGH TO SHAKE THE ENTIRE CAR AS THE CLUTCH ENGAGES.  IT ONLY HAPPENS WHEN IT'S COLD, BUT NOT ALL THE TIME WHEN IT'S COLD, MAKING IT NIGH IMPOSSIBLE FOR THE DEALER TO DO ANYTHING ABOUT IT.  20K MILES LATER, THE PROBLEM STILL EXISTS FOR ME AND APPARENTLY MANY, MANY OTHER OUTBACK DRIVERS.  INTERNET POSTS CONFIRM THAT THIS IS A \"COMMON\" SUBARU PROBLEM, ALTHOUGH A FIX IS NOT READILY AVAILABLE.  THE DEALER ACKNOWLEDGES THAT THERE ARE KNOWN PROBLEMS WITH SOME LEGACY/OUTBACK CLUTCHES, BUT UNTIL THE CLUTCH WILL RELIABLY FAIL WHILE THEY HAVE IT, THEY CANNOT DO ANYTHING ABOUT IT.  MOST PEOPLE, LIKE ME, JUST DEAL WITH THE HORRIBLE SHAKING, BUT I CAN CERTAINLY SEE HOW THIS COULD LEAD TO A HAZARDOUS SITUATION WHEN SOMEONE TRIES TO PULL INTO TRAFFIC AND BECOMES STARTLED BY THE SHUDDERING CAR, BACKING OFF THE GAS AND POSSIBLY GETTING HIT.",
        "vin": "4S3BH665716"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2002",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757370,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLUTCH OR FLYWHEEL APPEARS DEFECTIVE. THE CLUTCH SHUDDERS OR CHATTERS WHEN ENGAGED WHICH CAUSES THE CAR TO HESITATE UPON ACCELERATION. THIS PROBLEM STARTED AROUND 9,000 MILES AND HAS CONTINUED INTERMITTENTLY TILL NOW AT 18,000 MILES. SUBARU HAS AGREED TO REPLACE MY CLUTCH AND FLYWHEEL, BUT I AM CONCERNED REGARDING THIS PROBLEM. THIS PROBLEM IS WIDESPREAD AMONG OTHER SUBARU DRIVERS AND THE SERVICE TECHS REPORT THAT THIS PROBLEM IS COMMEN AND NORMAL FOR SUABRUS. I BELIEVE THIS IS A SAFETY ISSUE AND DEFECT IN THE DESIGN OR MANUFACTORING OF THE CLUTCH AND FLYWHEEL ASSEMBLY. PLEASE LOOK INTO THIS PROBLEM. I WOULD BE HAPPY TO SPEAK TO ANYONE REGARDING THIS ISSUE. WHEN YOU ENGAGE THE CLUTCH UPON ACCELERATION THE CAR JERKS AND TREMBLES, CHATTERS, SHUDDERS BEFORE ENGAGING. THIS SHOULD NOT BE ACCEPTED AS NORMAL OPERATION. THANK YOU.*AK",
        "vin": "4S3BH665116"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/16/2002",
        "dateOfIncident": "12/31/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756943,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES ARE UNEVEN AND UNDEPENDABLE. CAR BUCKS FROM SIDE TO SIDE IN DOWNHILL BRAKING APPLICATION",
        "vin": "4S3BH686X17"
    },
    {
        "components": "STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002089,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SIX OCCASIONS WHILE DRIVING, THE DRIVER'S FOOT SLIPPED FROM THE BRAKE PEDAL TO  ACCELERATOR PEDAL UNEXPECTEDLY.  THE CONSUMER BELIEVED THERE WAS A DESIGN PROBLEM DUE TO INSUFFICIENT SPACE BETWEEN THE BRAKE PEDAL AND THE ACCELERATOR PEDAL.  THE BRAKE PEDAL AND  ACCELERATOR PEDAL ARE TOO CLOSE.  *AK  ON TWO OTHER OCCASIONS, WHILE MOVING SLOWLY AHEAD, THE VEHICLE HAD GONE OUT OF CONTROL.  SCC",
        "vin": "4S3BH686717"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "01/12/2002",
        "dateOfIncident": "12/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756745,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 30 MPH IN A CURVE ON CR73 FROM CONIFER TO EVERGREEN, CO. IN 3RD GEAR, STEERING RACK  AND PINION BROKE, AND CAR DID A 360 DEGREE SPIN ON DRY PAVEMENT AND SLID INTO A DIRT MOUND. ONLY BY THE GRACE OF GOD, HAPPENING WITH NO TRAFFIC, AND IN THIS LOCATION, WAS MY WIFE'S LIFE SPARED.POLICE REPORT WITH COLORADO STATE PATROL ON FILE.*AK",
        "vin": "4S3BH806417"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/22/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754807,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "4S3BH806317"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/20/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753458,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO FAILURE HAS OCCURRED.  SUBARU HAS ACKNOWLEDGED IN PRINT, 'DRIVE' MAGAZINE THAT THEIR EXPENSIVE VDC SYSTEM IS A LIBILITY IN CERTAIN COMMON WINTER DRIVING CONDITIONS AND HAVE INCLUDED ON ALL NEW MODELS AN 'OFF' SWITCH AS STANDARD EQUIPMENT.  WINTER IS COMING,  AND WE HAVE A VEHICLE WHICH COULD ACTUALLY BE RENDERED IMMOBILE BY ITS TRACTION CONTROL SYSTEM.  WE HAVE REQUESTED TWICE THAT A SWITCH BE ADDED AND HAVE  BEEN REFUSED WITH SUBARU ONLY SAYING THAT THE MATTER IS BEING REFERRED TO MARKETING AND ENGINEERING.  WE HAVE THE ARTICLE AND INFORMATION FROM THE NEW MODELS CONCERNING THIS AND WOULD BE PLEASED TO FORWARD THEM TO YOU.  REGARDS, BETSY KUC. *AK",
        "vin": "4S3BH896417"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/13/2001",
        "dateOfIncident": "09/10/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 896268,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDEWALL ON  RIGHT/REAR TIRE SHREDDED WHILE  VEHICLE WAS TRAVELING AT ABOUT 65 MPH. THEN,  RIGHT REAR TIRE DROPPED, AND  CONSUMER PULLED OFF THE ROAD. ORIGINAL EQUIPMENT, 6000 MILES MOUNTED ON A 2001, SUBARU, OUTBACK WAGON.*AK *YD",
        "vin": "4S3BH665017"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/22/2001",
        "dateOfIncident": "03/25/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 894915,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE  GOES TO THE RIGHT.  CONSUMER HAS TAKEN  VEHICLE TO DEALER, BUT NO NOTATION HAS BEEN MADE CONCERNING THE PROBLEM. ONE OF THE DEALERSHIPS EMPLOYEE'S TEST DROVE  VEHICLE WITH CONSUMER, AND DID NOT  NOTICE  WHEEL TURNING.   DEALER HAS SHOWEN NO CONCERN TO RECTIFY THE PROBLEM.  PLEASE ADD THE VIN#  AND MILEAGE TO FORM.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/20/2001",
        "dateOfIncident": "08/19/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750785,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE SIDEWALL SEPARATED AND THE TIRE DEFLATED RAPIDLY.  THE CAR HANDLED WELL BUT THE TIRE WAS DEFECTIVE.*AK",
        "vin": "4S3BH686716"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2001",
        "dateOfIncident": "06/22/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 891260,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC LOCKING SYSTEM CAN BE TRIGGERED BY TWO  BUTTONS INSIDE OF VEHICLE. ALSO, THIS LOCKS ALL DOORS IN VEHICLE.  HAVEN'T CONTACTED DEALER YET. *AK  AUTOMATIC  LOCKING SYSTEM EASILY ENGAGES WITH THE MOTOR RUNNING, LOCKING KEYS INSIDE. THE DEALER STATES THAT THERE SHOULD BE AN ADDED SAFE GUARD AGAINST LOCKING KEYS INSIDE,PARTICULARLY WITH MOTOR RUNNING. *YH",
        "vin": "4S3BH665X17"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/02/2001",
        "dateOfIncident": "02/10/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746298,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOV EVEHICLE.  *AK (TIRESIZE: 225/60/16)( DOT NUMBER:  TIRE SIZE: 225/60/16 )",
        "vin": "4S3BH686X16"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/17/2001",
        "dateOfIncident": "05/01/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 561254,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY, CONSUMER EXPERIENCED TOTAL BRAKE FAILURE, CONSUMER WAS ABLE TO STOP VEHICLE BY DEPRESSING BRAKE PEDAL ALL THE WAY TO THE FLOOR, SLOWLY THE VEHICLE CAME TO A FULL STOP, VEHICLE WAS TAKEN INTO DEALERSHIP AND MECHANIC DISCOVERED THERE WAS A DEFECTIVE MASTER CYLINDER.         *JB",
        "vin": "4S3BH675317"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/04/2001",
        "dateOfIncident": "04/29/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887459,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON LINE BEHIND ANOTHER VEHICLE CONSUMER PUT FOOT ON BRAKE PEDAL AND ACCELERATOR AT  SAME TIME. CONSUMER ACCELERATED INTO  REAR OF SOMEONE'S CAR. CONSUMER FELT THERE WAS A MANUFACTURER'S DEFECT IN THESE PEDALS.*AK  THE CONSUMER STATES THAT BRAKE PEDAL AND ACCELERATOR ARE POORLY LOCATED DUE TO DESIGN FLAW.  *YH",
        "vin": "4S3BH686X17"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/03/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887354,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 20MPH AND WHEN STOPPING AT A  LIGHT DEPRESSED  BRAKE PEDAL, NOTICED PEDAL TRAVELING TO FLOORBOARD, AND  LOST  BRAKE POWER. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/30/2001",
        "dateOfIncident": "02/15/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744755,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "4S3BH686X16"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/15/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744090,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU PUT CAR IN R AND START TO GO ALL 4 TIRES DONT ENGAGE AT THE SAME TIME.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/07/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742080,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE ACCELERATES SPONTANEOUSLY AT SLOW SPEED ENTERING GARAGE WITH FOOT OFF THE GAS PEDAL WHILE BRAKING TO KEEP SPEED LOW.",
        "vin": "4S3BH806917"
    }
]