[
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/03/2020",
        "dateOfIncident": "06/20/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11343042,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPLACED O2 SENSORS TWICE TO GET RID OF THE CHECK ENGINE LIGHT FOR CODES THAT HAVE POPPED YOU P1135 & P1155. TOOK CAR TO TWO DIFFERENT MECHANICS AND TOYOTA DEALERSHIP AND NO ONE COULD FIGURE OUT WHY THE LIGHT IS STILL ON. ALL SENSORS HAVE BEEN REPLACED WITH DENSO PARTS. THIS SEEMS LIKE A RECALL IF NOT EVEN THE TOYOTA DEALER COULD FIX THE PROBLEM. THERE ARE MANY PEOPLE HAVING THE SAME ISSUE WITH TOYOTA'S. I NEED MY CAR TO PASS A SMOG AND IT COULD NOT BECAUSE OF THIS ISSUE. CAR ONLY HAS 62,000 MILES AND RUNS GREAT.",
        "vin": "4T1BF28B21U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/23/2020",
        "dateOfIncident": "08/10/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 11330320,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 TOYOTA AVALON. THE CONTACT STATED THAT WHILE HER BROTHER WAS STOPPED AT A SIGN, A VEHICLE CRASHED INTO ANOTHER VEHICLE CAUSING THAT VEHICLE TO CRASH INTO THE CONTACT'S VEHICLE FROM THE REAR. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT STATED THAT THE DRIVER SUSTAINED CRACKED RIBS, NECK AND BACK INJURIES AND THE DRIVER IN ONE OF THE OTHER VEHICLE SUSTAINED UNKNOWN INJURIES THAT NEEDED MEDICAL ATTENTION. THE VEHICLE WAS TOWED TO A TOWING LOT. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 99,000.",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/16/2018",
        "dateOfIncident": "08/07/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120236,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WENT TO GET OUR TRUCK INSPECTED AT AN INDEPENDENT GARAGE AND HE SAID HE COULDN'T INSPECT IT BECAUSE THE FRAME WAS TO RUSTED. WE CONTACTED OUR TOYOTA DEALER OVER THE TELEPHONE AND EXPLAINED TO THEM WHAT HAPPENED AND SAID IT WAS UNDER RECALL WHICH WE HAD JUST FOUND OUT.  THEY THEN TOLD US THEIR IS NOTHING THEY COULD DO.  WE TOLD THEM WE WOULD HAVE ADDRESSED THIS SITUATION EARLIER IF WE WOULD HAVE GOTTEN NOTIFICATION THAT THEY WERE BEING RECALLED NOW OUR TRUCK IS NOT SAFE TO DRIVE DUE TO THE RUSTED FRAME AND A TOYOTA DEALER NEVER EVEN LOOKED AT OUR VEHICLE",
        "vin": "5TBBT44161S"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/18/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006177,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON 4/21/14, I PURCHASED  2 CROSSWIND TIRES(20560R16) THE SELLER GAVE ME, IN WRITING, TREAD WEAR WARRANTY OF 50,000 MILES. HOWEVER, I HAVE ONLY DRIVEN APPROX. 19,000 MILES AND 90% OF TREADS ARE GONE. I HAVE CONTACTED THE SELLER, HE TOLD ME TO CONTACT THE MANUFACTURER. THE MANUFACTURER REFUSED TO HONOR THEIR WARRANTY. I EVEN CONTACTED MY CREDIT CARD CO. TO HELP, BUT THEY REFUSED IT TOO. I PAID $129.00 PLUS $40.00 FOR INSTALLATION. PLEASE HELP ME GET  MY MONEY BACK.",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "06/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005976,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4/21/14, I PURCHASED  2 CROSSWIND TIRES. THE SELLER GAVE ME, IN WRITING, TREAD WEAR WARRANTY OF 50,000 MILES. HOWEVER, I HAVE ONLY DRIVEN APPROX. 19,000 MILES AND 90% OF TREADS ARE GONE. I HAVE CONTACTED THE SELLER, HE TOLD ME TO CONTACT THE MANUFACTURER. THE MANUFACTURER REFUSED TO HONOR THEIR WARRANTY. I EVEN CONTACTED MY CREDIT CARD CO. TO HELP, BUT THEY REFUSED IT TOO. IT IS DANGEROUS TO DRIVE ON THESE TIRES. I PAID $129.00 PLUS $40.00 FOR INSTALLATION. PLEASE HELP ME GET  MY MONEY BACK.",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/06/2017",
        "dateOfIncident": "03/26/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10970903,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 TOYOTA AVALON. WHILE DRIVING 45 MPH, THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER WITHOUT WARNING. AS A RESULT, THE CONTACT CRASHED INTO AN EMBANKMENT AFTER THE VEHICLE ROLLED OVER THREE TIMES. THE AIR BAGS FAILED TO DEPLOY. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED BRUISES AND CUTS TO THE BODY, INJURIES TO THE NECK, BOTH KNEES, AND THE LEFT ANKLE. MEDICAL ATTENTION WAS REQUIRED. THE VEHICLE WAS TOWED AND DEEMED DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 200,000.",
        "vin": "4T1BF28B21U"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2015",
        "dateOfIncident": "05/01/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714040,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON. THE CONTACT STATED THAT THE CHECK ENGINE AND CATALYTIC CONVERTER WARNING LIGHTS WERE ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 189,047.",
        "vin": ""
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/24/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10638744,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 TOYOTA AVALON. WHILE DRIVING 5 MPH, THE VEHICLE ACCELERATED WITHOUT WARNING. AS A RESULT, THE VEHICLE CRASHED INTO A STORE WINDOW. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED CHEST INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "03/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10630811,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON.  CONSUMER WRITES IN REGARDS TO VEHICLE UNINTENDED ACCELERATION.  *SMD  THE CONSUMER STATED AS HE PULLED INTO A PARKING SPACE, AT LESS THAN 5 MPH, WITH HIS FOOT ON THE BRAKE, THE VEHICLE SUDDENLY ACCELERATED AT A HIGH RATE OF SPEED. THE VEHICLE DID NOT STOP EVEN WITH HIS FOOT ON THE BRAKE AT FULL FORCE AND EVENTUALLY HE CRASHED ONTO A LARGE 12 BY 10 WINDOW OF A BUILDING SOME 50 FEET AWAY. THE AIR BAGS DID NOT DEPLOY. THE CONSUMER SUFFERED SOME BRUISING. THE VEHICLE WAS TOTALED. *JB",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/07/2014",
        "dateOfIncident": "09/04/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631307,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE VEHICLE TO WORK IN AM. NOTICED KEY DIDN'T \"CATCH\" FIRST TIME, THOUGHT IT WAS HUMAN ERROR AND WROTE IT OFF AND DROVE TO WORK. WENT TO LEAVE WORK AND TURNED KEY IN IGNITION, LIGHTS AND RADIO LIGHT UP BUT KEY FREELY TURNED LIKE BUTTER AND STEERING FELT TIGHTER THAN NORMAL. COULD NOT START VEHICLE. HAD MECHANIC REMOVE IGNITION ASSEMBLY ON SITE TO DETERMINE THAT THE LINKAGE IN BETWEEN THE LOCK CYLINDER AND IGNITION SWITCH HAD A BROKEN METAL PIECE STUCK OFF INTO THE SWITCH. THIS LINKAGE IS CONTAINED IN A METAL HOUSING UNIT WITH 3 HOLES. WENT TO TOYOTA DEALER AND ASKED FOR THE LINKAGE PART, WAS SHOWN THE HOUSING UNIT IT WAS CONTAINED IN, ONLY AVAILABLE FROM TOYOTA. WAS TOLD BY EMPLOYEE THAT THE PIECE HE WAS SHOWING ME CAME OFF A CAR LIKE MINE THEY HAD JUST REPAIRED BECAUSE OF A RECALL ON THE STEERING LOCK BAR, THIS PIECE IS CONNECTED TO THE PIECE THAT I NEED TO REPLACE. I FEEL MY ISSUE OCCURRED BETWEEN DRIVING AND PARKING AT MY WORK AND IT IS BECAUSE OF THE RECALL ON THIS PIECE. CAR IS NOW AT TOYOTA DEALERSHIP, SO FAR THEY HAVE PICKED UP THE TOWING BILL BUT GIVEN ME GRIEF THAT I HAVE A \"13 YEAR OLD CAR\" REGARDLESS OF THE CAR'S AGE I FEEL THAT IF THAT PIECE I NEED CAME OFF A REPAIRED CAR DUE TO RECALL, THEY NEED TO COVER THE BILL FOR THIS REPAIR.  *TR",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/17/2014",
        "dateOfIncident": "05/03/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10592127,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 3RD 2014 I WAS ON MY WAY TO WORK I LOOKED DOWN AND RAN OFF THE ROAD I WAS TRYING TO SLOWLY GET BACK ON THE ROAD. I DIDN'T STOMP THE BRAKE BECAUSE I WAS AFRAID I WOULD FLIP MY CAR. I FORGOT I HAD MY CRUISE CONTROL ON. MY CAR WAS FRONT WHEEL DRIVE AND AS THE TIRES GRABBED IT THROUGH ME IN TO THE GUARD RAIL ON THE OPPOSITE SIDE OF THE ROAD. MY CAR WENT INTO A SPIN AND FINALLY STOPPED. MY SEAT BELT GRABBED AND KNOCKED THE BREATH OUT OF ME. MY SEAT BELT DID NOT COME OUT. I AM STILL RECOVERING. THE ADJUSTER SAID IT WAS TOTALED. [XXX] MAY 17TH 2014.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    *JS",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/12/2014",
        "dateOfIncident": "01/31/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564135,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN SOUNDED SQUEAKY, THEN INOPERATIVE.  AIRBAG LIGHT WENT ON.  CRUISE NO LONGER WORKED.  TOYOTA DIAGNOSED THE SPIRAL CABLE A/K/A CLOCK NEEDED REPLACEMENT.  OTHER VEHICLES, INCLUDING TOYOTAS, HAD RECALLS ON THIS.  IT SHOULD NOT HAVE MALFUNCTIONED AT THIS AGE OF THE CAR, ONLY 108,000 MILES.  SHOULD HAVE BEEN A RECALL, PAID BY TOYOTA.  IT COST ME NEARLY $500 TO GET IT FIXED.    MAYBE THE CABLE WAS DAMAGED WHEN THE STEERING LOCK BAR WAS FIXED, ON A PREVIOUS RECALL (YEARS PRIOR).???  *TR",
        "vin": "4T1BF28BX1U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "06/10/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10534826,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON. THE CONTACT STATED AFTER THE VEHICLE STOPPED MOVING AND HE RELEASED HIS FOOT OFF OF THE BRAKE PEDAL, THE RPMS INCREASED, THE VEHICLE JERKED FORWARD AND SUDDENLY ACCELERATED. THE CONTACT WAS FORCED TO DEPRESS THE BRAKE PEDAL WITH EXCESSIVE FORCE IN ORDER TO COME TO A STOP. WHEN THE FAILURE RECURRED THE CONTACT PLACED THE VEHICLE IN NEUTRAL. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS . *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/02/2013",
        "dateOfIncident": "02/16/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10514716,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK TIRE PRESSURE USUALLY THE FIRST WEEK OF THE MONTH AND NEVER HAD PROBLEM OF TIRES LOSING 60% OF AIR BETWEEN CHECKUPS.  I THOUGHT THAT THERE WAS A PUNCTURE AND TOOK IT TO DISCOUNT TIRE IN ROMEOVILLE(WHERE I BOUGHT YOKOHAMA TIRES).  CHECKED ALL THE FOUR TIRES AND FOUND NO NAILS OR OTHER.  THEY HOWEVER FOUND TWO WHEELS WITH CORROSION(WHITE FLAKING) AND THEY SUGGESTED THAT I REPLACE THE WHEELS FOR THIS WEATHER DAMAGE WILL ONLY ACCELERATE.  THESE ARE SUPPOSED TO BE ALLOY WHEELS  AND HOW CAN THERE BE WEATHER DAMAGE.    I HAD ALL THE FOUR WHEELS GROUND AND BUFFED.  SIX MONTHS LATER, AIR LEAKAGE WAS BACK WITH VENGEANCE AND SINCE IT COST ME ONLY $19.00 A WHEEL TO GRIND AND BUFF - I HAVE BEEN DOING THIS INSTEAD OF SHELLING OVER $500.00 TO HAVE THE WHEELS REPLACED.    THESE WHEELS ARE NOT GENUINE TOYOTA.  I HAD CELICA ST BACK IN THE 70S AND 80S AND I HAD NONE OF THIS NONSENSE WITH ITS ALLOY WHEELS.  *TR",
        "vin": "4T1BF28B91U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/16/2013",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512164,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON.  CONSUMER WRITES IN REGARDS TO DEFECTIVE VEHICLE WHEELS LEAKING AIR.  *SMD",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/25/2013",
        "dateOfIncident": "03/01/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON. THE CONTACT STATED THAT THE AIR BAG WARNING LAMP ILLUMINATED.  IN ADDITION, THE HORN AND THE CRUISE CONTROL FUNCTION WERE INOPERABLE. THE VEHICLE WAS TAKEN TO A MECHANIC AND THE TECHNICIAN DIAGNOSED THAT THE CLOCK SPRING NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 225,000 AND THE CURRENT MILEAGE WAS 230,000.  *TR",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/07/2013",
        "dateOfIncident": "03/07/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501910,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA KEEPS SENDING ME SAFETY RECALL NOTICES, BUT THE TOYOTA DEALERSHIP HERE IN THE UNITED STATES VIRGIN ISLANDS(USVI) REFUSES TO DO THE WORK. THEY KEEP SAYING MY VEHICLE IS NOT IN THEIR SYSTEM, AND THEY WON'T PUT IT IN THEIR SYSTEM. HOW DO I SOLVE THIS PROBLEM?   *TR",
        "vin": "4T1BF28B11U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/01/2012",
        "dateOfIncident": "12/19/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450002,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON.  THE CONTACT STARTED THE IGNITION AND AS THE ACCELERATOR PEDAL WAS ENGAGED, THE VEHICLE EXHIBITED A SUDDEN INCREASE OF ACCELERATION WITHOUT WARNING. THE VEHICLE RAPIDLY INCREASED SPEED AND COULD NOT BE STOPPED EVEN THOUGH THE BRAKES WERE APPLIED NUMEROUS TIMES. THE VEHICLE SWERVED OFF THE ROAD UNCONTROLLABLY AND CRASHED INTO THREE CURBS BEFORE ACCELERATING DOWN A SLIGHT EMBANKMENT. THE REAR DRIVER'S SIDE, FRONT DRIVER AND PASSENGER SIDE TIRES EXPLODED. THERE WAS NO PERSONAL INJURY AND A POLICE REPORT WAS FILED OF THE INCIDENT. THE VEHICLE WAS DECLARED AS DESTROYED AND TOWED TO A SAVAGE FACILITY.  THE MANUFACTURER WAS NOTIFIED OF THE UNINTENDED ACCELERATION. THE APPROXIMATE FAILURE MILEAGE WAS 60,000.",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/23/2011",
        "dateOfIncident": "11/23/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436897,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START WHEN THE KEY WAS INSERTED INTO THE IGNITION. AFTER REPEATED ATTEMPTS, THE CONTACT WAS ABLE TO EVENTUALLY START THE VEHICLE. THE IGNITION SWITCH WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT TAKEN TO AN AUTHORIZED DEALER. THE FAILURE MILEAGE WAS 64,000.",
        "vin": "4T1BF28BX1U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2011",
        "dateOfIncident": "11/14/2011",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436056,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON. THE CONTACT STATED THAT THE STEERING WHEEL SEIZED WHILE DRIVING 2 MPH AND HE BEGAN TO SMELL A BURNING ODOR. THE VEHICLE WAS SHUT OFF AND TOWED TO AN INDEPENDENT REPAIR SHOP. THE CONTACT WAS INFORMED THAT THE CRANK SHAFT PULLEY CAME APART AND TWO OF THE BELTS WERE DISENGAGED AS A RESULT. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE FAILURE AND THE CURRENT MILEAGES WERE 67,000.",
        "vin": "4T1F288B81U"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/05/2011",
        "dateOfIncident": "03/30/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10429748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "3/30/11  COMING OUT OF A RIGHT HAND TURN, IT LOOKED LIKE THE STEERING LOCKED INTO A POSITION WHICH CAUSED THE DRIVER TO LOSE THE ABILITY TO STEER.  THE CAR SLID AND THE DRIVER'S SIDE DOOR WAS CRUSHED INTO A TREE.  THE DRIVER SIDE AIRBAG DID NOT WORK.  THE DRIVER WAS INJURED AND WAS LATER PRONOUNCED DEAD AT THE HOSPITAL FROM INTERNAL INJURIES.  THE CAR HAS BEEN PRESERVED AT A STORAGE FACILITY IN TEXAS SINCE SHORTLY AFTER THE ACCIDENT.  IT IS AVAILABLE FOR INSPECTION.  NOT SURE WHETHER THE GAS PEDAL STUCK OR NOT.  I WAS TOLD THAT THERE WAS A BLACK BOX IN THESE CARS WHICH COULD POSSIBLY LEAD TO ANSWERS.  THE STEERING ON THE VEHICLE WAS RECALLED AND THE VEHICLE WAS BROUGHT TO THE TOYOTA DEALERSHIP FOR THE REPAIR IN JANUARY 2011.  I HAVE COPIES OF THE REPAIR BILL.  PLEASE SEE THAT NO OTHERS ARE HURT.  UPDATED 10/31/11  *BF",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "07/22/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415078,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA G019 GRID",
                "productYear": "9999",
                "size": "P205/60R16",
                "type": "Tire"
            }
        ],
        "summary": "FLAT TIRE, JAN 2011, WHILE DAUGHTER WAS DRIVING. TIRE WAS SEPARATED AT TREAD-SIDEWALL ON BRIDESTONE POTENZA, 205/60/16. I ASSUMED MY DAUGHTER DID NOT PULL OVER IMMEDIATELY AND THAT CAUSED THE SEPARATION. DAUGHTER SWEARS OVER THE BIBLE SHE WASN'T FAR FROM DRIVEWAY (STILL IN NEIGHBORHOOD) WHEN SHE REALIZED SHE HAD A FLAT AND PULLED OVER IMMEDIATELY. THE SEPARATION BETWEEN TREAD AND SIDEWALL HAD ME DOUBT MY DAUGHTER, AT LEAST UNTIL JULY 2011.  JULY 2011, TOOK SAME VEHICLE TO THE SAME DEALER THAT REPLACED THE FLAT IN JANUARY, (AUTO TIRE OF ST. LOUIS), FOR TIRE ROTATION, BALANCE, AND ALIGNMENT DUE TO EXCESSIVE VIBRATION IN STEERING WHEEL. AUTO TIRE IMMEDIATELY CALLED ME TO STATE THAT THREE OF MY TIRES, (BRIDESTONE POTENZA, 205/60/16) WERE DEFECTIVE AND NEED TO BE REPLACED. I ASKED DEALER TO SHOW ME THE DEFECT AND THE DEFECT WAS EXACTLY THE SAME AS THE TIRE THAT WAS REPLACED IN JANUARY, EXCEPT NOT AS SEVERE - MEANING THE SEPARATION WAS ONLY A FEW INCHES IN LENGTH AND SEPARATION WAS MUCH LONGER ON THE TIRE THAT HAD GONE FLAT. IN JANUARY, I ASSUMED THE SEPARATION WAS CAUSED BY DAUGHTER DRIVING AFTER TIRE HAD GONE FLAT. I DID NOT SUSPECT IT TO BE A DEFECTIVE TIRE SINCE BRIDGESTONE IS A REPUTABLE COMPANY. THE DEFECTS ON THE THREE TIRES REPLACED AT NO CHARGE IN JULY 2011 WERE IDENTICAL TO WHAT WAS OBSERVED ON THE TIRE REPLACED IN JANUARY 2011. THE DEALER, AUTO TIRE, DID NOT MAKE A WARRANTY CLAIM TO BRIDGESTONE IN JAN 2011AS THEY SHOULD HAVE, THEY TREATED IT AS A FLAT REPLACEMENT AND NOT A DEFECT AND BRIDGESTONE WOULD NOT COMPENSATE ME FOR THE FLAT TIRE I REPLACED. SO WHY AM I FILING THIS COMPLAINT? TO WARN OTHER CONSUMERS THAT BRIDGESTONE IS AWARE THEY HAVE A DEFECTIVE LOT OF BRIDESTONE POTENZA, 205/60/16 AND AS A CONSUMER YOU MAY HAVE A FLAT AND NOT KNOW THAT IT SHOULD BE CONSIDERED A WARRANTY DEFECT.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2011",
        "dateOfIncident": "01/19/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10377899,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON. THE CONTACT STATED THAT THE VEHICLE SKID CONTROL, ABS AND CHECK ENGINE WARNING LIGHTS WERE ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO THE DEALER WHO PERFORMED A DIAGNOSTIC TEST AND CONCLUDED THAT THE STEERING POSITIONING SENSOR WAS DEFECTIVE AND NEEDED REPLACING. THE CONTACT DID NOT INFORM THE MANUFACTURER OF THE FAILURE NOR WAS THE VEHICLE REPAIRED. THE CURRENT MILEAGE WAS APPROXIMATELY 173,000 AND THE FAILURE MILEAGE WAS APPROXIMATELY 140,000.",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "10/16/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10362253,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2001 TOYOTA AVALON ON THE FREEWAY. A CAR CUT ME OFF SO I SWERVED TO AVOID IT. AFTER THAT,  I COULD NOT CONTROL THE STEERING IN MY CAR. I HEADED TOWARD A WALL AND TRIED TO TURN AWAY FROM IT, BUT THE STEERING DID NOT RESPOND EVEN THOUGH I WAS TURNING THE STEERING WHEEL. I CRASHED HEAD FIRST INTO THE WALL.  *TR",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362301,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA AVALON. WHILE DECELERATING APPROXIMATELY 5 MPH, THE VEHICLE SUDDENLY SURGED FORWARD WHICH RESULTED IN A CRASH; THE VEHICLE DID NOT STOP ACCELERATING UNTIL THE CONTACT TOOK THE KEY OUT OF THE IGNITION. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES. THE VEHICLE HAD NOT BEEN INSPECTED OR REPAIRED. THE VIN WAS UNAVAILABLE. THE CURRENT AND FAILURE MILEAGES WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/16/2010",
        "dateOfIncident": "09/07/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355900,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA AVALON. WHILE THE VEHICLE WAS PARKED SHE ATTEMPTED TO OPEN THE DRIVER'S SIDE DOOR AND SHE HEARD A SNAPPING NOISE. SHE THEN STATED THAT SOMETHING IN THE DOOR LATCH WAS BROKEN. THE DOOR WOULD NOT OPEN FROM THE INSIDE. SHE HAD TO ROLL THE WINDOW DOWN AND OPEN THE DOOR FROM THE OUTSIDE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. SHE CALLED THE MANUFACTURER AND WAS TOLD THAT IT WAS A WEAR AND TEAR ISSUE NOT A SAFETY ISSUE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 84,000.",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/27/2010",
        "dateOfIncident": "08/25/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10352399,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON  WHILE DRIVING IN A RESIDENTAL AREA AND TURING RIGHT FROM ONE STREET TO ANOTHER, THE STEERING WHEEL LOCKED AND I WAS UNABLE TO STRAIGHTEN THE WHEEL.  I HAD TO APPLY THE BRAKES TO AVOID RUNNING INTO A RESIDENTAIL WALL.  AFTER APPLYING THE BRAKES, I MOVED THE TRANSMISSION FROM DRIVE TO NEUTRAL AND THEN REVERSE.  THE STEERING WHEEL UNLOCKED.  I DROVE THE TWO BLOCKS TO MY HOME AND HAD THE CAR TOWED TO THE NEAREST TOYOTA DEALERSHIP.  THEY SAY THEY HAVE FIXED THE PROBLEM. *TR",
        "vin": "4T1BF28B91U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/17/2010",
        "dateOfIncident": "08/14/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350043,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 TOYOTA AVALON THAT I PURCHASED USED FROM KINGS TOYOTA IN JULY 2005.  THE CAR WAS TOYOTA CERTIFIED.  MY CAR'S ENGINE DIED ON 8/14/2010 50 MILES FROM MY MECHANIC.  I HAD THE CAR TOWED ON 8/14/2010 AND HE CALLED ME TO SAY HE COULD PUT A JASPER MOTOR IN MY CAR FOR $6700.  I CALLED TOYOTA CUSTOMER SERVICE AND HEARD FROM THEM THE FOLLOWING DAY THAT I WAS TOO LATE TO GET THE ENGINE REPAIRED.  I EXPLAINED THAT I NEVER RECEIVED ANY LETTERS FROM TOYOTA ABOUT THE VOLUNTARY RECALL AND I WAS TOLD TOO BAD.  THE GOVERNMENT NEEDS TO PROTECT ITS CITIZENS FROM FAULTY TOYOTA ENGINES.  OIL GEL OR SLUDGE CAUSED MY ENGINE TO SEIZE.  IT IS SITTING DEAD AT MY MECHANIC'S SHOP WAITING FOR ME TO DECIDE WHERE TO MOVE IT TO NEXT. *TR",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330077,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA AVALON. WHILE PULLING INTO A  PARKING SPACE AT 5 MPH WITH HER FOOT APPLYING THE BRAKES, THE VEHICLE  ABNORMALLY ACCELERATED AND CRASHED INTO A BRICK WALL. THE AIR BAGS DEPLOYED UPON IMPACT BUT THERE WERE NO INJURIES. THE VEHICLE WAS DESTROYED. THE VEHICLE WAS TOWED BY THE INSURANCE COMPANY AND THE  MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 98,000.",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324269,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON.  CONSUMER STATES UNINTENDED ACCELERATION.  *TGW  THE CONSUMER STATED HIS DAUGHTER WAS ATTEMPTING TO PARK THE ABOVE REFERENCED VEHICLE, WHEN IT ACCELERATED OUT OF CONTROL AND HIT A FENCE. THE CONSUMER DROVE TO WORK THE NEXT DAY AND SHE NOTICED SHE COULD NOT ACCELERATE MORE THAN 45  MPH.  *JB  UPDATED 05/25/10.*JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "10/07/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10324350,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    ON OCT. 7, 2009, AT ABOUT 3:00 PM EDT ON A SUNNY DAY IN BRADENTON, FL, I WAS DRIVING ALONE WHILE SOBER, ALERT, AND HEALTHY AT ABOUT 35 MPH ON A PAVED SIDE ROAD [XXX] APPROACHING A RED STOPLIGHT AT U.S. 41 SO. WITH 2 OR 3 CARS STOPPED AHEAD OF ME FOR THE LIGHT. ABOUT 100 YARDS BEFORE THE STOPLIGHT, I APPLIED MY FOOTBRAKE,[XXX]  (OK WHEN INSPECTED &DRIVEN A WEEK EARLIER AS PART OF OIL CHANGE &GENERAL CHECKUP). THE FOOT PEDAL WENT TO THE FLOOR, WITH NO BRAKING EFFECT. I SWERVED TO THE LEFT OF THE CARS AHEAD OF ME AND MADE A SHARP LEFT TURN WHEN I REACHED U.S. 41, TO AVOID HITTING/BEING HIT BY ONCOMING TRAFFIC. MY CAR ROLLED OVER AND CRASHED. I HIT MY HEAD ON THE CAR'S ROOF[XXX] . I NEVER LOST CONSCIOUSNESS, BUT THE PAIN WAS TERRIBLE. I BLED, UPSIDE DOWN, FOR ABOUT 10-15 MINUTES, FEARING ANOTHER CRASH FROM ONCOMING CARS, HANGING FROM MY SEATBELT. A BYSTANDER STANCHED THE BLOOD EVENTUALLY. THE PARAMEDICS SHOWED UP IN AN AMBULANCE& TOOK ME TO THE EMERGENCY ROOM AT MANATEE MEMORIAL HOSPITAL IN BRADENTON. THE DR. CLEANED VERY PAINFUL GLASS SHARDS FROM MY MULTIPLE SCALP WOUNDS, THEN PUT IN FIVE STAPLES& RELEASED ME. TWO SHERIFF'S DEPUTIES INTERVIEWED ME& SAID MY CAR'S TIRE-MARKS SHOWED SIGNS OF ACCELERATION. I DENIED ACCELERATING; IT MADE NO SENSE TO ME UNTIL RECENT STORIES IN THE NEWSPAPER ABOUT TOYOTA BRAKE PROBLEMS AND SUDDEN UNEXPLAINED ACCELERATION IN OTHER CASES. A FRIEND PICKED ME UP. THE NEXT DAY I WENT TO THE GARAGE OF ELMER'S TOWING, WHICH HAD TOWED MY TOTALLY WRECKED CAR. I ASKED FOR THE FOOT BRAKES TO BE CHECKED. THEY WERE NORMAL. I FOUND THIS VERY PUZZLING; IT ONLY MADE SENSE RECENTLY AS I READ AND HEARD ON TV ABOUT SIMILAR PROBLEMS BY OTHER WITH TOYOTAS. SHELLY DEVANE OF ELMER'S IS A WITNESS TO THE REPORT OF OK BRAKES. I STRONGLY BELIEVE THAT AN INTERMITTENT ELECTRONIC PROBLEM WITH THE BRAKES CAUSED THE WRECK. I DID NOT FILE THIS COMPLAINT EARLIER BECAUSE THE EVIDENCE IS CIRCUMSTANTIAL & THE CAR NOW GONE. *TR",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "03/16/2010",
        "dateOfIncident": "03/14/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320260,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING HOME ON NORTH ON LOS OLIVOS RD (25 MPH ZONE) AND ROLLING TO A FOUR WAY STOP CROSSING MANZINITA RD (NE SANTA ROSA, CA) MY 2001 AVALON ACCELERATED AT FULL THROTTLE (ROAR).  I HAD MY FOOT ON BRAKE SO I WAS SHOCKED. PRESSING HARD ON BRAKE THE ACCELERATOR DISENGAGED AFTER ABOUT 3 SECONDS. I TOLD MY WIFE THAT I HAD A SENIOR MOMENT, THINKING I HAD PRESSED ACCELERATOR AND BRAKE AT  SAME TIME. NEVER HAPPENED AGAIN. SEEING 2001 AVALON MENTIONED USA TODAY MOTIVATED THIS. *TR",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "10/25/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA AVALON.  WHILE DRIVING 5 MPH INTO THE DRIVEWAY THE VEHICLE SUDDENLY ACCELERATED. THE VEHICLE CRASHED INTO THE GARAGE.  NO ONE WAS INJURED DURING THE CRASH.  THE VEHICLE SUFFERED DAMAGE TO THE BUMPER.  THE CONTACT STATED THAT HER FOOT WAS ON THE BRAKE PEDAL WHILE THE VEHICLE WAS ACCELERATING.  THE CONTACT DOES NOT KNOW WHAT CAUSED THE VEHICLE TO ACCELERATE.  THE FAILURE MILEAGE WAS 34,700.          UPDATED 4/13/10 *CN  UPDATED 0/17/10*JB",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/01/2010",
        "dateOfIncident": "11/26/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315153,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 11/26/2005 I EXPERIENCED AN ACCELERATION PROBLEM WITH MY 2001 TOYOTA AVALON WHILE BACKING MY CAR INTO OUR GARAGE. WHILE SLOWLY BACKING IN, THE CAR ACCELERATED & I BACKED INTO OUR FAMILY ROOM WALL. I PUT THE CAR IN DRIVE, THE ENGINE CONTINUED TO REV UP AND THE CAR SHOT OUT OF THE GARAGE LIKE A BULLET (ONE NEIGHBOR WITNESSED IT). I QUICKLY TURNED TO AVOID A 2ND NEIGHBOR'S BRICK HOUSE ACROSS THE STREET, BRAKING DIDN'T SEEM TO HELP. I HIT A 3RD NEIGHBOR'S CAR PARKED IN HIS DRIVE AND ENDED UP IN A 4TH NEIGHBOR'S DRIVE ON MY SIDE OF THE STREET!. AS I GOT OUT OF THE CAR, I REMEMBER SAYING TO THE 1ST NEIGHBOR THAT I COULDN'T STOP THE CAR. IT'S A MIRACLE I DIDN'T HIT NEIGHBOR #2 WHO IS ALWAYS OUT IN HIS YARD,  ANY ONE OF A NUMBER OF KIDS OR PEOPLE WHO WALK THEIR DOGS IN THE NEIGHBORHOOD OR ANOTHER VEHICLE COMING DOWN THE STREET. I WAS ALSO NOT INJURED. THERE WAS DAMAGE TO OUR HOUSE, MY CAR AND MY NEIGHBOR'S CAR. I WAS TOLD BY SOMEONE AT TOYOTA ORLAND PARK, IL (WHERE MY 2008 CAMRY IS BEING SERVICED TODAY) THAT THE ACCELERATION PROBLEM IN THE 2001 AVALON IS OF A DIFFERENT NATURE THAN THE CURRENT PROBLEMS.  *TR",
        "vin": "4T1BF28B91U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/26/2010",
        "dateOfIncident": "06/23/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10314628,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 23, 2001 MY FATHER WAS DRIVING A TWO-WEEK-OLD 2001 TOYOTA AVALON ON WV ROUTE 2 NEAR HUNTINGTON, WV.   ACCORDING TO EYE WITNESS ACCOUNTS, MY FATHER WAS DRIVING NORTH AT AN ACCELERATING SPEED AND QUICKLY CAME UPON ANOTHER NORTHBOUND CAR FROM THE REAR.  HE CUT OVER IN THE ONCOMING LANE, PASSED THE CAR, RETURNED TO THE NORTHBOUND LANE AND CONTINUED OUT OF SIGHT.  THE DRIVER OF THE CAR ESTIMATED MY FATHER WAS TRAVELING PROBABLY 90 MPH.   AT THE INTERSECTION OF THREE MILE AND WV ROUTE 2, MY FATHER'S CAR LEFT THE RIGHT SIDE OF THE ROADWAY, CONTINUING AT A HIGH RATE OF SPEED ACROSS A GRASSY YARD AND OVER A KNOLL, WHERE THE CAR BECAME AIRBORNE AND FLIPPED MULTIPLE TIMES ACCORDING TO A SECOND WITNESS.  THE CAR TORE THROUGH SOME TREE LIMBS, THEN SHEARED A TELEPHONE POLE AND CAME TO REST IN THE DITCH NEXT TO THE HIGHWAY.  MY FATHER WAS KILLED INSTANTLY.  AFTER LEAVING THE HIGHWAY, THE VEHICLE TRAVELED 250' ACROSS THE GRASSY AREA, THEN WENT AIRBORNE AND TRAVELED ANOTHER 278' BEFORE LANDING IN THE DITCH NEXT TO THE HIGHWAY. THERE WAS NEVER ANY GOOD EXPLANATION FOR WHY HE WAS TRAVELING THAT FAST PRIOR TO THE ACCIDENT, BUT IN LIGHT OF THE RECENT NEWS ABOUT THE TOYOTA SUDDEN ACCELERATION PROBLEMS, WE NOW BELIEVE MY FATHER'S DEATH WAS THE RESULT OF A FAULTY VEHICLE. I HAVE THE ETCS (ELECTRONIC THROTTLE CONTROL SYSTEM) MODULE FROM THE CAR IN MY POSSESSION.   UPDATED 04/05/10  *BF  *TR  UPDATED 08/06/10*JB UPDATED 9/29/2011*CW",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "05/24/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313732,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON HAS A MALFUNCTIONING ELECTRONIC BRAKES CONTROL MODULE, REPAIRED ONCE UNDER WARRANTY. THE SAID MODULE MALFUNCTIONED. PURCHASED NEW MODULE FROM TOYOTA $1200. AND  INSTALLED $800.. SINCE I PURCHASED THE CAR HAVE NO BRAKES WHEN TRAVELING ON ROUGH OR BUMPY ROADS ALWAYS. *TR",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314021,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SLUDGE IS CREATING EXCESSIVE SMOKING AND THE CAR USES 2 QUARTS OF OIL EVERY 2 FILLUPS.  THE VEHICLE STARTED SMOKING IN JULY OF 2009 AT 120,000 MILES AND WAS STILL UNDER AN 8 YEAR WARRANTY ON THE ENGINE.  TOOK THE VEHICLE TO THE DEALERSHIP IN REDDING AND THEY REFUSED TO HONOR THE 8 YEAR WARRANTY BECAUSE I WAS UNABLE TO PROVIDE ENOUGH RECEIPTS THAT I HAD CHANGED THE OIL ON A REGULAR BASIS.  THEY SAY THE ENGINE IS RUINED. *TR",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/21/2010",
        "dateOfIncident": "11/20/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312499,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AVALON XLS V6  AUTOMATIC TRANSMISSION   46,000 MILES  I HAD JUST BACKED OUT OF MY GARAGE AND I STOPPED TO LOWER THE GARAGE DOOR. THE CAR WAS IN STILL REVERSE AND I WENT TO ACCELERATE AND THE GAS PEDAL WENT TO THE FLOOR AND THE CAR WENT BACKWARD IN REVERSE ALL THE WHILE I WAS TRYING TO STOP IT WITH THE BRAKE PEDAL. I WENT IN A FULL 20 FOOT CIRCLE AND WAS ABOUT HALF WAY THROUGH A SECOND CIRCLE WHEN MY HUSBAND REACHED OVER AND TURNED THE KEY 1 CLICK TO KILL THE ENGINE. WE TRIED TO FIGURE OUT IF I HAD PUT MY FOOT ON BOTH THE BRAKE AND ACCELERATOR BUT IT WAS ALMOST  IMPOSSIBLE TO DO IT WITH MY SMALL FOOT. WE LOOKED UNDER THE HOOD AND FOUND NOTHING OUT OF ORDER. FINALLY, WE STARTED THE ENGINE AND CAREFULLY MOVED THE CAR BACK INTO THE DRIVE WAY AND CONTINUED ON OUR ERRAND. MY 2001 AVALON NOW HAS 47,000 MILES WHICH IS LESS THAN 500 MILES PER MONTH. WE DAMAGED THE FRONT DRIVER FENDER AND WHEEL RIM WHEN WE WENT UP AGAINST OUR HOUSE AND WE HAD IT REPAIRED. *TR",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "02/08/2010",
        "dateOfIncident": "02/03/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307553,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1. MY WIFE WAS DRIVING INTO A PARKING SPACE AT THE LOCAL COSTCO STORE.  2.AS SHE WAS SLOWING INTO THE SPACE, THE ACCELERATOR SEEMED TO JAM AND THE CAR RACED FORWARD,JUMPED THE CONCRETE BARRIER,HIT THE PARKING POLE AND COLLIDED WITH A ROW OF SHOPPING WAGONS.  3. WE HAVE NOTIFIED OUR TOYOTA DEALER,THE TOYOTA HEADQUARTERS,OUR INSURANCE WHO HAVE SAID THEY MAY HAVE TO TOTAL THE CAR, THE CAR WAS TOWED TO OUR DEALER'S AUTO SHOP.",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/05/2010",
        "dateOfIncident": "08/10/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10306264,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AT LEAST 3 OCCASIONS WHERE MY TOYOTA AVALON GAS PEDAL STUCK. I TOOK MY CAR TO THE TOYOTA DEALER AND TOLD THEM ABOUT IT. THEY TOOK IT FOR A DRIVE AND SAID THERE WAS NOTHING WRONG. MY CAR IS A 2001 AVALON. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "11/22/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303559,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA AVALON. SHE NOTICED THAT THE ENGINE BEGAN SURGING WHENEVER THE BRAKES WERE ENGAGED ON 25 OCCASIONS SINCE NOVEMBER 2000 INTERMITTENTLY. SHE WOULD DEPRESS THE BRAKE PEDAL AND THE RPMS WOULD RAPIDLY INCREASE; HOWEVER, SHE WOULD SHIFT THE VEHICLE INTO PARK AND TURN IT OFF.  SHE TOOK THE VEHICLE TO THE DEALER MORE THAN TEN TIMES BUT THE DEALER COULD NOT DUPLICATE THE FAILURE. SHE PROVIDED DETAILED INFORMATION TO A TOYOTA REPRESENTATIVE. THE DEALER STATED THAT THEY COULD NOT REPAIR THE VEHICLE SINCE THEY COULD NOT DUPLICATE THE FAILURE.   THE CURRENT MILEAGE WAS APPROXIMATELY 41,390. THE FAILURE MILEAGE WAS 441. UPDATED 03/04/10. *LJ  UPDATED 09/16/10",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/11/2009",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295335,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CANT GET RID OF ENGINE CODE PO330. TRIED CHANGING TO HIGHER OCTANE GAS, CHANGE AIR FILTER, CHECKED VACUUM AND AIR HOSES ALL OK. CLEARED ERROR SEVERAL TIMES AND LIGHT KEEPS COMING BACK ON. DOES THE CODE MEAN THE SENSOR IS BAD OR DOES IT MEAN SOMETHING WRONG WITH THE CAR? *TR",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/25/2009",
        "dateOfIncident": "04/09/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10293580,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LET ME EXPLAIN FIRST, I CAN'T SUBSTANTIATE THE CLAIM I AM MAKING ABOUT THE POSSIBLE CAUSE OF THE ACCIDENT THAT KILLED MY WIFE WHEN DRIVING A 2001 TOYOTA AVALON.  THE REASON THE ACCIDENT OCCURRED IS THAT SHE DID NOT STOP AT AN INTERSECTION CONTROLLED WITH A STOP SIGN. THE ACCIDENT OCCURRED IN CALLAHAN COUNTY, TEXAS AT THE INTERSECTION OF FM 1750 AND HIGHWAY 36 ON APRIL 9, 2007 AT APPROXIMATELY 8:30 PM.  SHE DROVE UNDER THE TRAILER OF AN 18 WHEELER, WAS KILLED INSTANTLY AND DRAGGED UNDER THE TRAILER FOR 800 TO 900 FIT.  IT TOOK THE ABILENE FIRE DEPARTMENTS EXPERTISE TO REMOVE HER BODY FROM THE WRECKAGE. THE LOCAL VOLUNTEER FIRE DEPARTMENTS DID NOT WANT TO ATTEMPT IT.  THERE WERE NO SKID MARKS.  SHE HAD DRIVEN THIS ROUTE COUNTLESS TIMES AND WAS AWARE OF THE STOP SIGN.  I CHECKED CELL PHONE RECORDS AND THERE WAS NO EVIDENCE THAT SHE COULD HAVE BEEN ON THE PHONE.  ADMITTEDLY SHE WAS UPSET.  SHE WAS DRIVING FROM ABILENE TO MEXIA, TEXAS TO BE WITH HER ELDERLY MOTHER WHO WAS IN A DIABETIC COMA WHEN SHE LAST SPOKE TO SOMEONE.  HOWEVER, SHE WAS A GOOD DRIVER.  I CAN'T BELIEVE THAT SHE WAS SO DISTRACTED TO ALLOW THIS TO HAPPEN.  IN LIGHT OF THE RECENT RECALL BY TOYOTA, I BELIEVE THAT HER AVALON SUDDENLY ACCELERATED OUT OF CONTROL.  NO SKID MARKS WERE AT THE SCENE ONLY CUTOUTS IN THE PAYMENT THAT WERE CAUSED BY HER CAR AS IT WENT UNDER THE TRAILER.  WHY NO SKID MARKS?  AS SHOWN ON CONSUMER REPORT INTERNET VIDEO, THE BRAKES ARE NOT ABLE TO SLOW THE CAR DOWN AS IT IS ACCELERATING AND SKID MARKS WOULD NOT HAVE BEEN POSSIBLE. THERE IS NO OTHER EXPLANATION IN MY MIND AS TO HOW SHE COULD HAVE MISSED THE STOP SIGN.  THE CAR WAS OUT OF HER CONTROL AND IT KILLED HER.  IF YOU WOULD LIKE TO HAVE THE VIN, PLEASE CONTACT ME.  I WILL PULL IT OUT OF THE RECORDS I HAVE.  THANK YOU FOR YOUR CONSIDERATION AND ANY RESPONSE.  THIS IS SUCH A TRAGEDY THAT UNTIL THE RECALL LEFT ME WITHOUT ANY EXPLANATION THAT WAS BELIEVABLE.  I NOW BELIEVE I KNOW WHAT HAPPENED. *TR   UPDATED 03/08/10 *BF  UPDATED 07/06/10.*JB",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/30/2009",
        "dateOfIncident": "09/30/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285881,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON XLS: VIBRATION FELT IN STEERING, TYPICALLY ABOVE 60 MPH ON INTERSTATE OR BRAKING GOING DOWN A HILL.  ALIGNED FRONT END, RE-BALANCED TIRES/WHEELS, REPLACED TIRES, REPLACED FRONT ROTORS TWICE WITHIN A FEW THOUSAND MILES, BRAKE PADS, CALIPER PINS, REGREASED CALIPER PINS WITH APPROPRIATE PIN GREASE, ENSURED PROPER AIR IN TIRES - NONE OF THIS HAS ADDRESSED THE VIBRATION.  NOTED A FAIR NUMBER OF OTHER AVALON OWNERS SEARCHING THE INTERNET ON THE WORDS '2001 TOYOTA AVALON VIBRATION'.  VEHICLE HAS NOT SUSTAINED ANY DAMAGE, SUCH AS JUMPING A CURVE OR BEING STRUCK BY ANOTHER VEHICLE.  NO OTHER SUGGESTED REPAIRS FROM TOYOTA. *TR",
        "vin": "4T1BF28B21U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/13/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230937,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA AVALON.  WHILE DRIVING AT LOW SPEEDS IN REVERSE, THE VEHICLE WOULD SPORADICALLY STALL.  THE CONTACT MUST ALSO MAKE SEVERAL ATTEMPTS TO START THE VEHICLE.  SHE IS IN THE PROCESS OF REPAIRING THE GR VALVE AT THE DISCOUNTED PRICE OF $250.  THE FAILURE AND CURRENT MILEAGES WERE 63,000.",
        "vin": "4T1BF28BX1U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/07/2007",
        "dateOfIncident": "09/06/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202231,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MXV4",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA AVALON.  THE VEHICLE HAS MICHELIN MXV4, SIZE P205/65R15 92VMS TIRES.  WHILE DRIVING 70 MPH, THE REAR PASSENGER SIDE TIRE BLEW OUT.  THE CONTACT STATED THAT HE DID NOT DRIVE OVER ANYTHING THAT MAY HAVE CAUSED THE FAILURE.  THE TIRES ON THE VEHICLE WERE REPLACEMENTS THAT WERE PURCHASED FROM COSTCO MORE THAN A YEAR AGO.  HE STATED THAT ALL FOUR TIRES WERE LEAKING AIR, CAUSING HIM TO PLACE MORE AIR IN THEM EACH WEEK.  THE FAILURE CAUSES THE VEHICLE TO WOBBLE WHILE DRIVING.  THE DEALER ROTATED AND BALANCED THE TIRES, HOWEVER, THE FAILURE PERSISTS.  THE LATEST REPAIR ON THE VEHICLE WAS PERFORMED ON AUGUST 27, 2007.  THE DOT NUMBER AND SPEED WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 54,000.",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2007",
        "dateOfIncident": "08/26/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200895,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA AVALON.  ON AUGUST 26, 2007, THE CONTACT STARTED THE VEHICLE AND THE STEERING WHEEL REMAINED LOCKED, EVEN WHILE DRIVING.  HE JIGGLED THE WHEEL AND IT UNLOCKED.  HE STATED THAT THE INTERLOCK FAILS TO RELEASE.  THE FAILURE STILL PERSISTS.  THE PURCHASE DATE AND SPEED WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 81,740.     UPDATED 12/12/07 *BF    THE DEALER REPLACED THE IGNITION CYLINDER BRACKET",
        "vin": "4T1BF28B91U"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/27/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA SEQUOIA.  THE CONTACT STATED THAT THE WELDING ON THE SEAT FRAME OF THE MIDDLE ROW DETACHED AND CAUSED THE SEAT TO SWIVEL AND MOVE.  THE DEALER INSPECTED THE VEHICLE AND PERFORMED THE REPAIR,  BUT WAS UNABLE TO DETERMINE THE CAUSE OF FAILURE.  THE CURRENT MILEAGE IS 109,000 AND FAILURE MILEAGE WAS UNKNOWN.*AK",
        "vin": "5TDBT44A21S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2007",
        "dateOfIncident": "01/03/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177789,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT TOOK THE  2001 TOYOTA AVALON  TO  THE DEALER ON 01/03/07 BECAUSE THE  AIRBAG INDICATOR LIGHT WAS ON.  AT THE DEALERSHIP THE MECHANIC STATED TO THE CONTACT THAT THE  AIR BAGS WOULDN'T DEPLOY,. ALSO, THE  CRUISE CONTROL AND  HORN WERE NOT FUNCTIONING PROPERLY. THE MECHANIC  DETERMINED THAT THE REASON FOR THE AIR BAGS, HORN AND CRUISE CONTROL NOT WORKING WAS BECAUSE THE SPIRAL CABLE ASSEMBLY WAS CREATING A SHORT CIRCUIT IN THE STEERING COLUMN.  CONTACT FELT THAT THIS INCIDENTWAS A MANUFACTURING DEFECT, AND COULD  PROVIDE A COPY OF THE INVOICE REPAIR IF NEEDED. *AK  UPDATED 01/31/07. *JB",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/08/2006",
        "dateOfIncident": "05/30/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10167652,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN FRONT-OFFSET TYPE ACCIDENT AND THE SEAT BELT DID NOT LOCK.   CONSEQUENTLY, I SLID FORWARD AND SLAMMED INTO THE STEERING WHEEL EDGE (OFFSET CRASH). THE CAR HAD A BROKEN RIGHT FRONT WHEEL AND THE CAR WAS TOTALED.  WHY DID THE SEAT BELT NOT LOCK?  I HAVE READ THE OWNERS MANUAL, AND IT SEEMS THE SEAT BELT IS ONLY SUPPOSED TO LOCK IN THE EVENT OF A FRONT CRASH.  WHAT GOOD IS THAT?  IT SEEMS TO ME, IT SHOULD LOCK ON ANY SUDDEN MOVEMENT, PERIOD, OR WHY BOTHER WITH IT?  *NM",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/22/2006",
        "dateOfIncident": "02/11/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10153422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TRAVELING 15-20 MPH ON ICY ROADS THE DRIVER LOST CONTROL OF THE VEHICLE.  THERE WAS PRIOR BRAKING AND THE VEHICLE PASSENGER SIDE FRONT DOOR STRUCK A TREE.  THE AIRBAGS DID NOT DEPLOY.  THERE WAS A POLICE REPORT TAKEN AT THE SCENE.  BOTH OCCUPANTS WERE WEARING SEATBELTS, BUT THE PASSENGER SUSTAINED A MINOR CUT.  THE VEHICLE WAS TOWED TO THE DEALERSHIP WHERE THE INSURANCE COMPANY DEEMED THE VEHICLE TOTALED.  THE MANUFACTURER SENT AN ENGINEERING ANALYST ASSOCIATE WHO DETERMINED THE AIRBAGS SHOULD NOT HAVE DEPLOYED.",
        "vin": "4T1BF28B91U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2005",
        "dateOfIncident": "11/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141650,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATES  VEHICLE HAD A DEFECTIVE CLUTCH.  THE CLUTCH HAS REPEATEDLY MALFUNCTIONED.  HE CONTACTED THE DEALERSHIP.  THE DEALERSHIP  REPLACED THE CLUTCH TWICE WITHIN THREE YEARS.  ALSO,  CONTACTED THE MANUFACTURER, AND THEY DID NOT OFFER ANY ASSISTANCE.  NO FURTHER CORRECTIONS HAVE BEEN MADE AT THIS TIME. *AK",
        "vin": "2T1CF22P11C"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "05/30/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126416,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:STEERING WHEEL VIBRATES AT SPEEDS FROM 60 TO 75 MPH. CONSUMER TOOK THE VEHICLE TO SEARS TWICE TO BALANCE AND ROTATE THE TIRES. THIS DID NOT FIX THE PROBLEM.  THE CONSUMER TOOK THE  VEHICLE TO TOYOTA AND HAD THE TIRES BALANCED AGAIN AND THE VEHICLE LUBRICATED. THIS DID NOT FIX THE PROBLEM EITHER. VEHICLE HAS 22000 MILES. CONSUMER SAYS THAT IT FEELS LIKE SOMETHING IS LOOSE UNDER THE CARRIAGE.    *JB  WHEN THE CONSUMER APPLIED THE BRAKES THERE WAS A VIBRATION.",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "06/02/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123961,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER IS HAVING PROBLEMS WITH THE BRAKES.  AT 17217 WHILE DRIVING DOWN A STEEP HILL, THE WERE APPLIED AND THERE WAS A FEELING OF METAL ON METAL.  THE BRAKES AND ROTORS WERE REPLACED AT THIS TIME.  AT 27000 MILES THE BRAKES HAD TO BE REPLACED AS WELL AS THE ROTORS.  THE DEALER REPORTED THAT THE PROBLEM WAS DUE TO A LACK OF USE OF THE VEHICLE AND THE ROTORS HAD RUSTED CAUSING THE NEED FOR REPLACEMENT.  THE PROBLEM HAS BEEN REPORTED TO TOYOTA WHO ADMITS THE PROBLEM BUT WILL NOT PROVIDE DOCUMENTATION.   *TT   THERE WAS NO WARNING.   *SC  *JB",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "09/07/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122602,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON EXPERIENCING PROBLEMS WITH THE BRAKES, AND WINDOWS.   *MR   THERE WAS A PERSISTENT PROBLEM WITH NOISE THAT SEEMED TO ORIGINATE FROM THE FRONT END.  THE NOISE WAS INTERMITTENT AND NOTICEABLE AFTER THE VEHICLE WAS WARMED, WHEN MAKING TURNS OR WHEN APPLYING THE BRAKES.  AN INSPECTION REVEALED THAT THE CALIPER SLIDE WAS STICKING ONTO THE LEFT FRONT SIDE.  THE BRAKE ROTORS SHOWED SIGNS OF GLAZE, THERE WAS  A WOBBLY FEELING WHEN THE BRAKES WERE APPLIED, THE PASSENGER SIDE HEATED SEAT WAS INTERMITTENT,  THE VEHICLE WAS PULLING TO THE LEFT, THE DRIVERS WINDOWS WOULD GO UP AND DOWN, THE STRIPPING ON THE BUMPER WAS COMING OFF, THE STEERING WOULD SHAKE AT TIMES, THE FUEL GAUGE FLUCTUATED, THE RADIO BUTTONS WERE FADING, THE CASSETTE WAS INOPERATIVE, THERE WAS BURNING SMELL COMING FROM THE VENT, THE VEHICLE STALLED WITH NO WARNING, THE WIPER BLADE(S) WERE NOISY, THE WINDSHIELD HAD \"MILLION\" OF DOTS ALL OVER IT, AND THE FRONT PANEL WAS LIT FOR THE BACK LIGHTS AND THERE WAS A LIMITED AMOUNT OF AIR/HEAT THAT WOULD BLOW ON THE DRIVERS FEET.  THE ROTORS WERE MACHINED AND THE FRONT AND REAR BRAKE PADS WERE REPLACED.  THE FRONT STRUTS WERE CRACKED AND CAUSED THE FRONT END NOISE.  THE RADIO,STEERING ANGLE SENSOR AND THE FRONT STRUTS WERE REPLACED.   *SC",
        "vin": "4T1BF28B21U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "04/25/2005",
        "dateOfIncident": "04/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119092,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH BRAKE EQUIPMENT ON 2001 TOYOTA AVALON WHILE DRIVING AT 45 MPH.*MR    WHEN THE CONSUMER APPLIED LIGHT PRESSURE TO THE BRAKES, THERE WAS A THUMP SOUND.  THE CONSUMER CONTINUED TO APPLY THE BRAKES BUT THEY DID NOT HOLD AND ONLY MILD DECELERATION OCCURRED.   CONSEQUENTLY THE CONSUMER REAR ENDED ANOTHER VEHICLE. *JB  *NM",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/12/2005",
        "dateOfIncident": "04/12/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116827,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD HUMMING NOISE FROM REAR OF CAR.  PREMATURE FAILURE REAR WHEEL BEARING AT 22,000 MILES.  *AK",
        "vin": "4T1BF28B81U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/26/2005",
        "dateOfIncident": "06/05/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107940,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT CAME ON. I TOOK IT TO THE DEALERSHIP AND THEY \"DIAGNOSED\" THE CAR FOR 8 DAYS. THEY SAID THEY COULDN'T LOCATE THE PROBLEM. THEY FINALLY INDICATED IT WAS BECAUSE OF BUILD-UP ON THE #1 FUEL INJECTOR AND IT HAD TO BE REPLACED AT A COST OF OVER $600. THEY ALSO INDICATED IT WAS NOT COVERED UNDER WARRANTY. THE CAR HAD 42,000  MILES ON IT AT THE TIME. IT SEEMED ODD TO ME THAT THE POWERTRAIN IS COVERED UNTIL 60,000 MILES BUT THE FUEL INJECTORS ARE NOT CONSIDERED PART OF THE POWERTRAIN. APPROXIMATELY 10 DAYS AFTER GETTING MY CAR BACK THE CHECK ENGINE LIGHT CAME ON AGAIN AND BEEN ILLUMINATED SINCE.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2004",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH VISORS (L&R) HAVE BROKEN. WHEN THE VISOR IS LATCHED OUT OF THE WAY THERE IS UNDUE STRESS ON THE HINGE AND ANCHOR CAUSING THE HINGE ASSEMBLY TO BREAK APART . THIS STRESS ALSO CAUSES THE ANCHOR THAT TO HOLDS THE VISOR AT REST TO RIP OUT. THIS IS CLEARLY IS A DESGIN FLAW AND SHOULD BE REPAIRED BY TOYOTA. I WAS TOLD OUT OF WARRANTY AT 39,000 MILES, SORRY.*AK",
        "vin": "4T1BF28B11U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2004",
        "dateOfIncident": "08/23/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL TIRE",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE HAD 2 OF THE 4 GENERAL TIRES THAT CAME ON MY 2001 TOYOTA AVALON FAIL RECENTLY.  FORTUNATELY NEITHER ONE CAUSED AN ACCIDENT.  THE FIRST FAILURE WAS DISCOVERED WHEN I TOOK MY CAR TO THE DEALER FOR A WHEEL ALIGNMENT BECAUSE THE CAR WAS PULLING TO THE RIGHT.  THE DEALER INFORMED ME THAT THE TIRE HAD SEPARATED AND I HAD THEM REPLACE IT WITH THE SPARE TIRE.  I DISCOVERED THE SECOND TIRE HAD FAILED WHEN I TOOK IT TO A TIRE STORE BECAUSE IT WAS LOW AND I SUSPECTED A PUNCTURE IN THE TIRE.  I ASKED THEM TO CHECK THE TIRE FOR A PROBLEM BECAUSE I HAD EXPERIENCED A SLIGHT FRONT END SHIMMY BETWEEN 5 AND 10 MPH.  WHILE THE TIRE WAS BEING CHECKED THE MECHANIC DISCOVERED THAT THE TIRE HAD A SEPARATION.  THESE TIRES HAVE ONLY 26,000 MILES ON THEM AND I HAVE ALWAYS KEPT THEM PROPERLY INFLATED AND I ROTATED AND BALANCED THEM EVERY 6,000 MILES.   HAVE NOT CHECKED THE OTHER TWO TIRES THAT CAME WITH MY CAR BUT HAVE NOT NOTICED A PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2004",
        "dateOfIncident": "06/29/1999",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CONTINUOUSLY ILLUMINATED ON THE DASHBOARD. AS A RESULT, THE AIR BAGS WERE INOPERATIVE,  THE DEALER INSPECTED  THE VEHICLE 13 TIMES  AND COULD NOT DUPLICATE OR CORRECT THE PROBLEM.*AK THE DEALER REPLACED ALL THE WIRING, HOWEVER THE PROBLEM CONTINUED. *JB",
        "vin": "4T1BF18B4XU"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/23/2004",
        "dateOfIncident": "06/23/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063502,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY AT A STOP  VEHICLE SURGED. CONSUMER HAD TO PRESS HARD ON THE BRAKE PEDAL AND PUT VEHICLE INTO PARK TO STOP.  *AK  THE COSUMER STATED THE DEALER WAS UNABLE TO DUPLICATE THE PROBLEM.  *JB",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/14/2004",
        "dateOfIncident": "11/25/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10076162,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT STAYED ON. THE DEALER STATD  THE INDICATOR SWITCH NEEDED TO BE REPLACED. *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/11/2004",
        "dateOfIncident": "01/13/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073469,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL 01V072000 CONCERNING  SUB FRAME FAILURE:  AT ANY SPEED WHEN THE VEHICLE HITS A DIP THE BOTTOM HITS THE GROUND.  THIS HAS CAUSED UNNECESSARY WEAR TO THE FRONT BUMPER AND THE UNDER SIDE OF THE VEHICLE.  THIS MODEL/MAKE, AND  YEAR IS ON RECALL, BUT CONSUMER'S VEHICLE WAS NOT INCLUDED IN THE  RECALL DUE TO VIN.  *AK",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/29/2004",
        "dateOfIncident": "12/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071793,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE COMES EQUIPPED WITH A DEVICE THAT AUTOMATICALLY CIRCULATES THE AIR IN THE VEHICLE OR BRING FRESH AIR INTO THE VEHICLE. THE DEVICE CANNOT BE TURNED OFF MANUALLY, NOT BY THE CONSUMER OR THE DEALERSHIP. THIS POSSES A HEALTH HAZARD BECAUSE THE AIR QUALITY IN THE STATE WHERE CONSUMER LIVES IN IS BAD, AND WHEN THE DEVICE BRINGS THE BAD AIR INTO THE VEHICLE THE AIR MAKES THE OCCUPANTS SICK. *AK",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/01/2004",
        "dateOfIncident": "02/15/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062774,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA AVALON SURGED FORWARD WITH THE ACCELERATOR STUCK IN THE DEPRESSED POSITION RESULTING IN A COLLISION WITH THREE PARKED CARS IN A BUSY MALL PARKING LOT.  THANKS TO A SNOWBANK AND THE IMPACT OF HITTING THE THREE CARS, THE VEHICLE CAME TO A STOP WITHOUT INJURING THE DRIVER OR ANYONE ELSE.  THE AIR BAGS ALSO DID NOT DEPLOY.*AK *MR",
        "vin": "4T1BF28B214"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/24/2004",
        "dateOfIncident": "03/24/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PROBLEM WITH A DISTRACTING LIGHT THAT INTERFERES WITH MY NIGHT OPERATION OF THE CAR. AT NIGHT, AWAY FROM LIGHTS, I SEE THE 140 FROM THE SPEEDOMETER AND THE E FROM THE FUEL GAGE, REFLECTED IN THE WINDSHIELD. THE IMAGE IS UPSIDE DOWN AND THE LIGHT IS A SAFETY CONCERN AS IT IS DEAD AHEAD IN THE FIELD OF TRAVEL. I HAVE ADJUSTED MY SEAT SO I AM AS LOW AS POSSIBLE, THE TOP OF MY HEAD IS ABOUT 1\" FROM THE CEILING. I'VE CONTACTED THE TOYOTA DEALER. THEY STATED THEY COULD NOT SEE THE REFLECTION, BUT IF IT IS THERE, THEY REPORT \"THIS IS A DESIGN FLAW AND NOTHING CAN BE DONE\".  *JB",
        "vin": "4T1BF28B21U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/23/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065084,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SLID TO THE LEFT AND RIGHT WITH THE WHEELS LOCKED ON A SNOWY AND ICY ROAD AT 35 MPH.  *PH  THE VEHICLE ENDED UP SLIDING INTO A DITCH.  NONE OF THE VEHICLE'S OCCUPANTS WERE INJURED DURING THIS ACCIDENT.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/20/2004",
        "dateOfIncident": "02/19/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058558,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SENSOR THAT CAUSES THE REAR WINDSHIELD DEFROSTER TO TURN OFF MALFUNCTIONED AND CAUSED THE BACK GLASS TO OVERHEAT AND SHATTER.  I HAVE A MR2 WHICH WAS NOT LISTED IN THE VARIOUS MODELS.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "06/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069101,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OIL LIGHT CONTINUES TO BE ILLUMINATED DESPITE FREQUENT OIL & FILTER CHANGES .  THE CHECK ENGINE LIGHT HAS ALSO BEEN ILLUMINATED. THE ENGINE IS REQUIRING OIL APPROXIMATELY EVERY 500 MILES.",
        "vin": "4T1BF28B91U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "09/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070778,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN OIL ENGINE SLUDGE PROBLEM THAT TOYOTA IS TRYING TO PLACE THE CAUSE ON MY SHOULDERS.  MY HUSBAND PERFORMED OIL CHANGES AT REGULAR INTERVALS AT ABOUT 4500 MILES BETWEEN EACH CHANGE. TWICE WE HAVE HAD OTHER CHANGE THE OIL. ONCE THE DEALERSHIP AND ONCE A TEXACO EXPRESS LUBE, BOTH WHICH WE WERE ABLE TO OBTAIN RECEIPTS FOR. THE PROBLEM BEGAN WHEN WE DID NOT SAVE THE RECEIPTS FROM OUR OIL AND FILTER PURCHASES. ANY AND ALL WORK DONE ON THE CAR WAS ENTERED INTO OUR MAINTANANCE MANUAL.  A FEW YEARS BACK WE RECEIVED A LETTER FROM TOYOTA EXPLAINING THE SLUDGE PROBLEM AND WHAT THEY WOULD DO IF IT OCCURRED. EVIDENTLY WHAT THEY SAID ISN'T WORTH THE PAPER IT WAS WRITTEN ON.  THEY WANT ME TO PAY $750 TO THE DEALERSHIP BEFORE THEY WILL DO ANY WORK ON THE CAR. $250 IS FOR INCIDENTIAL WORK THAT MIGHT HAVE TO BE DONE IN RELATION TO THE SLUDGE PROBLEM AND THE OTHER $500 IS A DEDUCTABLE.  EXCUSE ME BUT NO WHERE IN THE LETTER OR MY WARRANTY AND OWNERSHIP MANUALS DOES IT STATE THAT IF WE PERFORM THE WORK WE ARE REQUIRED TO KEEP OUR RECEIPTS. I SPOKE WITH THE SERVICE MANAGER AT THE DEALERSHIP, WHO TRIED TO REFUSE TO GIVE ME THE NAME OF THE DISTRICT MANAGER, AND DID REFUSE TO GIVE ME A PHONE NUMBER THAT I COULD REACH HIM AT. HE SAID OUR LOG OF THE WORK WASN'T GOOD ENOUGH FOR THE TOYOTA CORP., AND THAT PEOPLE HAD BEEN KNOWN TO FALSIFY RECORDS. I HAVE NEVER HAD MY INTEGRITY QUESTIONED BEFORE BUT NOW BECAUSE OF TOYOTA'S BUILDING OF AN ENGINE PRONE TO THIS TYPE OF FAILURE ALL THE SUDDEN I'VE BECOME A LIAR.",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "11/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071233,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL SLUDGE BUILD UP IN  3.0 LITER IMZ V6 ENGINE. WAS TOLD THE ENGINE WOULD HAVE TO BE COMPLETELY REBUILT NEW PISTONS, RINGS, BEARINGS ETC. HAVE NOT BEEN TOLD OF ANY EXTENDED WARRANTY, WAS TOLD I WOULD ONLY HAVE THE REMAINING WARRANTY ON CAR. I WAS ALSO TOLD THAT THEY DIDN'T KNOW WHAT CAUSED THE SLUDGE BUILD UP. IF THIS IS TRUE HOW CAN THEY REPAIR THE ENGINE? IF THEY DON'T KNOW WHAT CAUSED IT TO FAIL IN THE FIRST PLACE. THEY CAN REBUILD THE ENGINE BUT IT WILL JUST BUILD UP WITH SLUDGE AGAIN IF THEY DON'T FIX THE PROBLEM....AND WHAT ABOUT RESALE VALUE?  NO ONE WILL BUY THIS CAR WITH THIS ENGINE IN IT IF THEY KNOW ABOUT IT. AS FOR ME I WANT SOMETHING ELSE, I WANT BACK WHAT THIS CAR'S ENGINE PROBLEMS HAS COST ME!!",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2003",
        "dateOfIncident": "12/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050542,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER WAS NOT WORKING PROPERLY,  IT PROVIDED WRONG INFORMATION. DEALER NOTIFIED.  DEALER STATED SORRY NO WARRANTY. *AK",
        "vin": "4T1BF28B81U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/28/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048758,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED TIRES WORE OUT PREMATURELY.  THE TIRES HAD BEEN REPLACED 5 TIMES. CONSUMER BELIEVED THAT VEHICLE WAS MISALIGNED.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/28/2003",
        "dateOfIncident": "11/28/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047722,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WARNING LIGHT AND VSC AND VSC OFF LIGHT WENT ON WHILE DRIVING!. DEALER INDICATED THAT A VALVE IN THE CHARCOAL CANISTER ASSY. WAS SHORTING OUT. THE COMPONENT IS PART OF THE EMISSIONS SYSTEM AND THE VSC IS PART OF THE SAME CIRCUIT HENCE BOTH SETS OF WARNING LIGHTS WENT ON. DEALER INDICATED THAT IF YOU TOP OFF THE TANK THE EXTRA GAS SPILLS OVER INTO THE CANNISTER AND CAN OVERWHELM THE VALVE CAUSING EXCESSIVE USAGE AND POSSIBLE SHORTING. I INDICATED THAT I HAVE NEVER TOP'D OFF THE TANK IN THIS CAR, DEALER HAD NO OTHER EXPLANATION. PART IS NOT COVERED UNDER THE TOYOTA $1200 EXTRA CARE GOLD EXTENDED WARRANTY, AND COST TO REPLACE UNIT WAS $507.32, INCLUDING $85.00 CHARGE FOR COMPUTER DIAGNOSTIC. NOTE:53K ON CAR AND HAVE HAD NO UNSCHEDULED WORK DONE ON CAR SINCED IT WAS PURCHASED NEW. *AK",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/2003",
        "dateOfIncident": "11/19/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048232,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER TOOK VEHICLE  TO DEALER FOR ROUTINE SERVICE, AND   TECHNICIAN INDICATED THAT BOTH REAR WHEEL BEARINGS NEEDED TO BE REPLACED. VEHICLE WAS NO LONGER UNDER WARRANTY, AND WILL COST $1,200 AT CONSUMER'S  EXPENSE. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/03/2003",
        "dateOfIncident": "09/26/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041174,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OIL GELLING.  MY 2001 AVALON XLS HAS 42,000 MILES AND IS IN THE SHOP FOR EXTENSIVE REPAIRS DUE TO OIL GELLING.  I CHANGED THE OIL REGULARLY AND THERE IS NO REASON FOR THIS TO HAPPEN ABSENT A DEFECT IN THE DESIGN.  I HAVE BEEN A LOYAL TOYOTA CUSTOMER AND THIS IS MY 4TH TOYOTA CAR.  DEPENDABILITY IS THE NO. 1 PRIORITY FOR ME.  TO ADD INSULT TO INJURY, BECAUSE I MUST DEPEND ON MY VEHICLE WHILE IT WAS IN THE SHOP I DECIDED TO TRADE IT IN FOR A 2004 LEXUS. IMAGINE MY DISGUST WHEN THE DEALER DISCOUNTED THE VALUE OF THE TRADE-IN BECAUSE OF OIL GELLING.  A LOT OF PEOPLE ARE HAVING THIS PROBLEM.  *LA",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": "08/21/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10034541,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30 MPH, THE DRIVER SWERVED TO AVOID HITTING A SQUIRREL, THE VEHICLE LEFT THE ROAD AND HIT TWO TREES AND NONE OF THE AIR BAGS DEPLOYED. DRIVER SUFFERED BRUISES, DAMAGE TO VEHICLE WAS NOT KNOWN.  *AK   PLEASE PROVIDE VIN NUMBER UPON RECEIPT OF THIS COMPLAINT.  VEHICLE WAS TOTALED.    *PH  *JB",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/02/2003",
        "dateOfIncident": "08/25/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DUNLOP TIRE CORPORATION",
                "productMake": "DUNLOP",
                "productModel": "SP SPORT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THIS TIRE COMPLETELY SHREDDED.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2003",
        "dateOfIncident": "07/13/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029662,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY AND WITHOUT PRIOR WARNING THE ENGINE AND VEHICLE SKID CONTROL LIGHT APPEARED ON THE DASHBOARD.  *AK  THE DEALER INFORMED THE CONSUMER THERE WAS A PROBLEM WITH THE FUEL TANK CAP WHICH CAUSED THE LIGHTS TO ILLUMINATE. THE LIGHTS ILLUMINATED AT LEAST FIVE TIMES, AND THE DEALER WAS UNABLE TO RESOLVE THE PROBLEM. ALSO THE VEHICLE LUNGED FORWARD AT TIMES, HOWEVER THE DEALER FOUND NO PROBLEM.  *JB   *NLM",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/31/2003",
        "dateOfIncident": "05/10/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT IS ON AND TWO TOYOTA DEALERS (ROCKLAND TOYOTA AND PAUL MILLER TOYOTA) ARE NOT ABLE TO FIX THIS PROBLE.  ACCORDING TO TOYOTA MANUAL, I SHOULD NOT BE DRIVING THIS CAR.     *PH",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10017579,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE SUDDENLY ACCELERATED, THE CONSUMER LOSS CONTROL OF THE VEHICLE AND HIT A PICKUP TRUCK AND CRASHED INTO A TREE.  THE DRIVER SUSTAINED MINOR INJURIES, AND PASSENGER IN PICKUP TRUCK SUSTAINED MAJOR INJURIES. VEHICLE WAS BADLY DAMAGED. *AK   *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/11/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10015300,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 35 MPH VEHICLE SUDDENLY ACCELERATED OUT OF CONTROL HIT A PICKUP TRUCK, AND THEN HIT A TREE. THE DRIVER APPLIED THE BRAKES, BUT BRAKES FAILED TO STOP VEHICLE. THE PASSENGER IN THE PICKUP TRUCK SUSTAINED INJURIES AS WELL AS THE CONSUMER.*AK  *JB *TS",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/01/2003",
        "dateOfIncident": "03/31/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013772,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUNK OPENS, NOT FULLY, JUST AJAR, BY ITSELF. THIS HAS HAPPENED APPROXIMATELY (6) TIMES IN (2) YEARS. THE TRUNK IS NOT OPEN SUFFICIENTLY FOR THE TRUNK OPEN LIGHT TO GO ON.  THIS HAS HAPPEN APPROXIMATELY (3) TIMES ON THE ROAD AND (3) TIMES PARKED. WHILE ON THE ROAD IT WILL BE ANOTHER DRIVER WHO WILL SIGNAL THAT IT IS AJAR OR IN ONE CASE IT WAS A GAS STATION ATTENDANT (STILL ATTENDANT SERVICE IN NEW JERSEY!). ONE TIME THE TRUNK WAS FOUND AJAR IN THE MORNING AT A MOTEL STOP (NOTHING TAKEN), AND A COUPLE OF TIMES IT WAS FOUND OPEN WHILE PARKED IN THE GARAGE.  ON THIS AUTOMOBILE, 2001 TOYOTA AVALON, THE TRUNK OPENER IS ON THE DASH AND IS ELECTRONIC WHILE THE GAS CAP OPENER IS ON THE FLOOR AND IS MECHANICAL SO THERE CAN BE NO MISTAKING THE TWO. BECAUSE THIS HAS HAPPENED NUMEROUS TIMES, I WILL LIST THE MOST RECENT DATE AS THE \"INCIDENT DATE\". THANK YOU.*JB",
        "vin": "4T1BF28B21U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/26/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011429,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE AND GAS PEDAL WERE DESIGNED TOO CLOSE TOGETHER, WHEN  THE CONSUMER ATTEMPTED TO STEP ON THE BRAKE PEDAL, HIS FOOT SLIPPED AND DEPRESSED THE GAS PEDAL.  *AK  *JB",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/25/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009236,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD INDICATOR LIGHTS FLASHED INTERMITTENTLY, THE VEHICLE WAS SERVICED 6 TIMES FOR THE PROBLEM, HOWEVER THE PROBLEM STILL OCCURRED.*JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2002",
        "dateOfIncident": "05/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001213,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES VEHICLE HAS AN \"STRONG\" VIBRATION WHILE DRIVING WHICH IS CAUSING TIRES AND ROTORS TO WEAR EXCESSIVELY.  DEALER DIAGNOSED BAD ALIGNMENT PROBLEM WHICH HAS BEEN REPAIRED 6X TO NO AVAIL. TS",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2002",
        "dateOfIncident": "05/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001232,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES VEHICLE HAS A STRONG VIBRATION WHILE DRIVING WHICH HAS CAUSED THE TIRES AND ROTORS TO WEAR EXCESSIVELY.  DEALER HAS DIAGNOSED VEHICLE WITH AN ALIGNMENT PROBLEM.  CONSUMER HAS ATTEMPTED TO GET ALIGNMENT CORRECTED 6X WITH NO SUCCESS. TS",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/16/2002",
        "dateOfIncident": "12/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000125,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL SOMETIMES REQUIRES EXTRA FORCE TO MOVE CAUSING LURCHING OF VEHICLE.  40K MILES. TOYOTA AVALON XL.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/08/2002",
        "dateOfIncident": "12/08/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770609,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT (OUTBOARD) REAR SEAT BELT ASSEMBLY MALFUNCTIONING. THE MOUNTING POINT IS SELF-ACTIVATING AND CAUSING THE BELT TO OVERTENSION RENDERING THE BELT UNUSABLE AND UNSAFE.  DT",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/25/2002",
        "dateOfIncident": "10/24/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021602,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SUFFERED SUDDEN ACCELERATION WHEN SHIFTED FROM NEUTRAL INTO DRIVE, VEHICLE COLLIDED WITH A DOOR. DEALER AND MANUFACTURER HAS BEEN NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION.      TS",
        "vin": "4TIBF28B11U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 567983,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE VEHICLE IN PARK AND THE ENGINE RUNNING THE CONSUMER STEPPED OUT OF THE VEHICLE, SUDDENLY THE GEAR JUMPED INTO REVERSE CAUSING THE OPEN DOOR TO KNOCK THE DRIVER OVER, AS A RESULT THE LEFT FRONT WHEEL RAN OVER THE RIGHT LEG OF THE DRIVER, THE DRIVER HAS HAD FOUR LEG OPERATIONS.  NLM",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2002",
        "dateOfIncident": "07/31/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8020297,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES IF VEHICLE IS IN PARK IT SLIPS INTO REVERSE. *MR  THE CONSUMER STEPPED OUT WITH THE ENGINE RUNNING, ALL OF A SUDDEN THE VEHICLE STARTED TO MOVE BACKWARDS. DRIVER TRIED TO GET IN THE VEHICLE TO STOP IT, BUT THE DOOR KNOCKED HIM DOWN, THE DRIVERS RIGHT LEG WAS UNDER THE VEHICLE AND THE LEFT FRONT WHEEL DRUG THE LEG, THE DRIVER HAS HAD 4 OPERATION ON THE RIGHT LEG *YH",
        "vin": "4T1BF28B310"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2002",
        "dateOfIncident": "09/14/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767692,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE ON 9/13/02 AT 65MPH, THERE WAS A TOTAL FAILURE IN THE ELECTRICAL SYSTEM FOR A SPLIT SECOND.  I DISREGARDED IT THINKING THAT IT WAS MY IMAGINATION.  HOWEVER, THE VERY NEXT DAY THE ENTIRE ELECTRICAL SYSTEM ON THE CAR WAS DEAD MAKING THE CAR INOPERATIVE.  CAUSE:  DISINTEGRATION OF NEGATIVE BATTERY CABLE TERMINAL END WHICH CAUSED THE NEGATIVE CABLE TO DISCONNECT FROM ELECTRICAL SYSTEM.  I HAVE RESEARCHED THIS PROBLEM WITH OTHER TOYOTA OWNERS AND FOUND THAT THIS IS A COMMON PROBLEM.  FAILURE OF ELECTRICAL SYSTEM IS A SAFETY RELATED FUNCTION IN THAT IT COMPLETELY DISABLES THE VEHICLE.   NLM",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2002",
        "dateOfIncident": "07/31/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 767717,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING LEVER SLIPPED FROM PARK INTO REVERSE, MOTOR RUNNING AS PERSON WAS GETTING OUT OF CAR THE CAR WENT INTO REVERSE THE OPEN DOOR KNOCKED THE PERSON DOWN AND HER LEG WENT UNDER THE TIRE WHICH DRAGGED THE LEG. THE INJURED PARTY WAS IN THE HOSPITAL FOR 3 WEEKS AND HAS HAD 4 OPERATIONS ON THE LEG.  NLM",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "SUSPENSION,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/06/2002",
        "dateOfIncident": "06/06/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018063,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS CONSTANT VIBRATION AT 60-75 MPH, AND VEHICLE PULLS TO THE LEFT, SELDOM TO THE RIGHT. DEALER REPLACED TIRES AND RIMS, IT DID NOT REMEDY THE PROBLEM.*AK  TWO TIRES SHOWED EXCESSIVE WEAR AND WERE REPLACED. WHILE DRIVING THE LUG NUTS CAPS FELL OFF AND WERE REPLACED.  *YH",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/13/2002",
        "dateOfIncident": "08/09/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE STOPPING VEHICLE BRAKE PEDA LWENT TO THE FLOOR, BRAKES STARTED PULSATING , AND THEY DIDN'T HOLD. HAD TO PULL EMERGENCY BRAKE TO STOP VEHICLE. CONTACTED DEALER.*AK",
        "vin": "PLEASE   FI"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/09/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764011,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG SENSORS WERE KNOCKED COMPLETELY OFF AND NEITHER AIRBAG WAS DEPLOYED, THE OTHER PERSON WAS DRIVING A 1992 OLDER MODEL CAR AND HIS AIRBAGS DEPLOYED RIGHT AWAY.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566291,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED A BUBBLE ON THE SIDEWALL OF HIS MICHELIN TIRE (NO TIRE INFORMATION).  CONSUMER WAS ADVISED THAT THE BUBBLE IN THE SIDEWALL WAS ALMOST CERTAINLY CAUSED BY A TRAUMATIC INJURY TO THE TIRE, HOWEVER, WHEN THE TIRE WAS REMOVED, NO EVIDENCE WAS FOUND.  AS A RESULT TIRE DEALER OFFERED A 25% DISCOUNT ON THE PURCHASE OF A REPLACEMENT.  *TT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE IN THIS CAR, THE TOYOTA V6 1MZ 3.0L HAS BEEN PROVEN TO BE DEFECTIVE.  *AK",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2002",
        "dateOfIncident": "07/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011171,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A THUMPING NOISE IN REAR WHEN COMING TO A STOP AND PULLING OFF FROM A STOP.  GAS IS SHIFTING AROUND IN GAS TANK.  *AK   THE NOISE WAS PROMINENT.  THE SERVICE MANAGER AGREED THAT THE VEHICLE WAS IN NEED OF A NEW TANK. THE ORDER WAS PLACED FOR A NEW TANK BUT WAS CANCELLED BY A REPRESENTATIVE BECAUSE IT WOULD MEAN THAT TOYOTA ADMITS THERE IS A PROBLEM WITH THE FUEL TANKS ON THESE VEHICLES. THE PROBLEM, BECAUSE THE TANK COULDN'T BE REPLACED, BECAME MUCH WORSE.  CONSUMER IS NO LONGER IN POSSESION OF THE VEHICLE.  *JG",
        "vin": "4T1BF28B81U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/11/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761776,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE BRAKE SYSTEM IS OF CONCERN.  OCCASIONALLY  WHEN THE VEHICLE IS BROUGHT TO A STOP THE BRAKE PEDAL WILL MOVE DOWN TOWARD THE FLOOR A FEW SECONDS AFTER THE CAR IS STOPPED.  THE TWO TIMES I HAVE BROUGHT THIS TO THE ATTENTION OF THE DEALER, I AM BEING TOLD THAT THIS IS NORMAL FOR THE VEHICLE AND THAT ALL OF THEM DO THIS.    THIS IS THE SECOND AVALON I HAVE OWNED AND  THE FIRST ONE DID NOT HAVE THE SITUATION HAPPEN.  OTHER AVALON OWNERS I HAVE SPOKEN TO HAVE NEVER HAD THIS HAPPEN.   THE MOVEMENT OF THE BRAKE PEDAL DOWNWARD AFTER STOPPING DOES NOT OCCUR ALL THE TIME.  IT LOOKS TO OCCUR AFTER DRIVING THE VEHICLE FOR A PERIOD OF TIME AT HIGHWAY SPEEDS AND IN LOCAL TRAFFIC THAT REQUIRES CONSTAND STOPPING AND STARTING.   THE PEDAL MOVEMENT OCCURS ABOUT 10 TO 15 SECONDS AFTER STOPPING BUT DOES NOT OCCUR EVERY TIME.  THIS BRAKE PEDAL MOVEMENT IS OF CONCERN SICE I HAVE BEEN DRIVING FOR OVER 40 YEARS.  BRAKE PEDAL MOVEMENT AFTER STOPPING A VEHICLE HAS ALWAYS BEEN A SIGN OF FAILURE WITHIN THE SYSTEM.  USUALLY A FAILING MASTER CYLINDER.  THE MOVEMENT OF THE BRAKE PEDAL AFTER STOPPING IS NOT A CONFORTABLE FEELING AND ALL THAT I HAVE TALKED TO (BOTH TOYOTA OWNERS AND OTHER MFG'S) NO ONE HAS EXPERIENCE THIS PEDAL MOVEMENT.  THIS INCLUDES CARS THAT HAVE SKID CONTROL SYSTEMS.  I AM CONCERNED ENOUGH ABOUT THIS BRAKE PEDAL ISSUE AND WANT CONFIRMATION FROM THE VEHICLE MANUFACTURER (NOT THE DEALER) THAT THIS IS NOT A SAFETY ISSUE.   CLOSING NOTE, TALKED TO A FEW LEXUS OWNERS, NONE HAVE EXPERIENCED THIS BRAKE PEDAL MOVEMENT.  *AK",
        "vin": "4T1BF28B21U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/01/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565535,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT THE BRAKES FEEL SPONGY AND GO HALFWAY TO THE FLOOR, THE DEALER HAS BLED THE BRAKES AND REPLACED THE MASTER CYLINDER, HOWEVER THE PROBLEMS STILL EXIST, CONSUMER GIVES 2 ADDRESSES AND 2 PHONE NUMBERS, 394 CASA GRANDE, EDGEWATER, FL  32141, 386-427-2455, FLORIDA IS WHERE THEY SPEND THE WINTER.   *SLC",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/22/2002",
        "dateOfIncident": "03/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008249,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LIGHTS ON VSC STAY ON ALL THE TIME.  AUTO HAS BEEN IN THE SHOP 6 TIMES.   KEPT HAVING ALL KINDS OF ELECTRICAL PROBLEMS.   WINDOWS GO UP AND DOWN ALL THE TIME BY THEMSELVES. BATTERY FAILED. DEALER REPLACED STEERING ANGLE SENSOR.  DID NOT REMEDY PROBLEM. TRUNK OPENS BY ITSELF.  DEALER FOUND LATCH NOT HOLDING SECURELY ON LATCH LOCK BAR. *AK *TT",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/19/2002",
        "dateOfIncident": "04/15/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008140,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO DESCRIPTION GIVEN.  NLM",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564271,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED RECALL (01V-072), BUT THE DEALER REFUSED TO CORRECT THE DEFECTIVE PART. *YH",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564271,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED RECALL (01V-072), BUT THE DEALER REFUSED TO CORRECT THE DEFECTIVE PART. *YH",
        "vin": "4T1BF28B61U"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/30/2002",
        "dateOfIncident": "05/15/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003241,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN AT A STOP OR WHILE PARKING ENGINE REVS AND RPMS GO UP TO 7000. CONSUMER HAS TO APPLY  BRAKES HARD AND PUT VEHICLE IN NEUTRAL TO STOP THE REVVING, THIS HAPPENS 2-3 TIMES A MONTH. VEHICLE HAS BEEN TAKEN TO DEALER 3 TIMES, CAN NOT DUPLICATE THE PROBLEM.*AK     *YD",
        "vin": "4TIBF28BX1U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2002",
        "dateOfIncident": "01/27/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757426,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER AND MANUFACTURER HAVE ATTEMPTED NUMEROUS TIMES TO CORRECT PROBLEMS WITH THE ELECTRICAL SYSTEM, BUT HAVE NOT SUCCEEDED.   HEADLIGHT FAILURE IS THE MOST SERIOUS INCIDENT TODATE.   FORTUNATELY, THERE WAS NO OTHER VEHICLES TRAVELING AT THE SAME TIME ALONG THE HIGHWAY, AND WE WERE ABLE TO STOP THE VEHICLE PROMPTLY AND WITHOUT INCIDENT.*AK",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/25/2002",
        "dateOfIncident": "01/25/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PROBLEM WITH A DISTRACTING LIGHT THAT INTERFERES WITH MY NIGHT OPERATION OF THE CAR.  AT NIGHT, AWAY FROM LIGHTS, I SEE THE \u0013140\u0014 FROM THE SPEEDOMETER AND \u0013E\u0014 FROM THE FUEL GAGE, REFLECTED IN THE WINDSHIELD.  THE IMAGE IS UPSIDE DOWN AND THE LIGHT IS A SAFETY CONCERN AS IT IS DEAD AHEAD IN THE FIELD OF TRAVEL.  I\u0012VE ADJUSTED MY SEAT SO I\u0012M AS LOW AS POSSIBLE, THE TOP OF MY HEAD IS ABOUT 2\u0014 FROM THE CEILING.   I'VE CONTACTED THE DEALER THAT ATTEMPTED TO SERVICE THIS, REGIONAL AND NATIONAL TOYOTA OFFICES (CASE # 200110160534).  THEY REPORT \"THIS IS A DESIGN FLAW AND NOTHING CAN BE DONE\".*AK",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/13/2002",
        "dateOfIncident": "10/25/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756783,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL PROCEEDS ALL THE WAY TO FLOOR WHEN PRESSED AT STANDSTILL. *AK",
        "vin": "4T1BF28BX1U"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "12/21/2001",
        "dateOfIncident": "11/28/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 755911,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES TOO NARROW AND SMALL FOR GROSS WEIGHT OF AVALON CAR. (DOT NUMBER: 205  TIRESIZE: 205 60 R)",
        "vin": "4T1BF28821U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/14/2001",
        "dateOfIncident": "03/06/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755636,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE FAILURE OF INSTRUMENT PANEL AND INFORMATION PANEL LIGHTING.   DEALER UNABLE TO FIX PROBLEM.   MANUFACTURER CONTACTED -- BUT NO RESPONSE TO DATE.",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2001",
        "dateOfIncident": "05/04/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 898616,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING ABOUT 35 MHP ON A SIDE STREET AND NOTICED THAT  VEHICLE WAS SLOWING DOWN, CONSUMER TURNED OFF  THE VEHICLE BECAUSE WHEN APPLYING GAS PEDAL, VEHICLE WOULD BEGAN TP COAST, CONSUMER WAS ABLE TO PULL OVER TO   SHOULDER AND NOTICED THAT GASOLINE WAS LEAKING FROM UNDERNEATH  VEHICLE,   VEHICLE WAS TOWED, AND MECHANIC STATED THAT CONNECTION TO FUEL AND IGNITION WAS DEFECTIVE. *AK. CONSUMER WAS TOLD THAT THE GASOLINE LINE HAD DISCONNECTED FROM THE MOTOR, AND THAT THE FLANGE ON THE CONNECTOR APPARENTLY HAD NOT ENGAGED PROPERLY.    *YD",
        "vin": "4T1BF28B81U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/24/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753624,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING NIGHT DRIVING A PORTION OF THE SPEEDOMETER REFLECTS OFF WINDSHIELD, CREATING A DISTRACTION. TOYOTA CLAIMS MY VIN REPRESENTS THE VEHICLES THAT WERE CORRECTED DURING PRODUCTION, BUT THE REFLECTION STILL EXISTS.*AK",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/26/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 896925,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ODOMETER IS GIVING A FALSE READING. ALSO, VEHICLE WAS DESIGNED FOR A 15 INCH WHEEL, AND VEHICLE HAS A 16 INCH WHEEL.  CONTACTED DEALER, AND DEALER STATED  SPEEDOMETER WAS OKAY.*AK",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/13/2001",
        "dateOfIncident": "05/14/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752161,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS AS MUCH A QUESTION AS AN ACTUAL REPORT.  DRIVER'S SIDEVIEW MIRROR HAS TREMENDOUS BLIND SPOT - CONVERSELY - A SMALL VIEWING AREA. TYPICALLY A CONSCIENTIOUS DRIVER, I HAVE CUT OFF 2 OR MORE DRIVERS THAT JUST WEREN'T VISIBLE TO ME.  I THINK THIS SHOULD BE REVIEWED. PERHAPS THIS IS MY OWN PROBLEM, BUT I'VE NEVER HAD THIS PROBLEM WITH A CAR IN THE PAST.  MY BELIEF IS THAT THE SIDEVIEW MIRROR SHOULD BE MORE CONCAVE - OR AT LEAST PROVIDE A LARGER VIEWING AREA.*AK",
        "vin": "4T1BF28B31U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/13/2001",
        "dateOfIncident": "08/12/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 894111,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHILD WAS SITTING  IN  BACK SEAT AND REACHED OVER TO UNLATCH  SEAT BELT TO GET OUT.  SEAT BELT LAYED ACROSS HIS CHEST, AND WHEN TUGGING ON IT TO SNAP IT BACK IN POSITION  SEAT BELT RAPPED AROUND  CHILD'S NECK.  CHILD'S MOTHER PULLED ON  SEAT BELT WHICH WOULD NOT RELEASE.  CHILD  BLACKED OUT, AND SEVERAL MEN COULD NOT GET  SEAT BELT TO LOOSEN.  SEAT BELT WAS FINALLY CUT TO RELEASE  CHILD.  CHILD'S NECK WAS BRUISED AND IRRITATED. DEALERSHIP WAS OF NO HELP, AND REFUSED THE RIGHT OF  CONSUMER TO SPEAK TO A SUPERVISOR.  MANUFACTURER WAS CONTACTED, AND WILL  ORDER A NEW SEAT BELT. ALSO, WILL CALL THE DEALERSHIP.*AK",
        "vin": "4T1BF28B41U"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 749337,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING WITH 4 AVERAGE SIZE ADULTS IN THE AVALON (2 FRONT/2 REAR) - THE REAR BOTTOMS OUT (AXLES/SUSPENSION) AND THE FRONT SCRAPS WHEN GOING UP DRIVEWAYS, OVER SPEEDBUMPS, LEAVING DRIVEWAYS, ETC. THE FRONT BUMPER/PAINT, MIDDLE UNDERSIDE, AND/OR THE REAR BUMPER/PAINT SCRAP SEVERELY ALONG THE GROUND AND/OR BUMP IN THE ROAD. EVERYTHING CAN BE FELT WHEN DRIVING AND THERE IS A LOT OF SCRAPING ALONG THE GROUND. OBVIOUSLY SOMETHING IS WRONG WITH THE AXLES/STRUTS/SUSPENSION - THE DEALER SAYS THERE IS NOTHING WRONG AND THE CAR JUST HAS A SOFT RIDE. THE STEERING WHEEL MAKES SQUEAKING/RUBBING NOISES - AGAIN THE DEALER SAYS THERE IS NOTHING WRONG AND JUST LUBRICATED IT. THE FRONT PAINT IS CHIPPING AFTER A FEW MONTHS DESPITE IT BEING CHIP RESISTANT PAINT. THE CHIPS LOOK LIKE THE EDGES ARE READY TO FLAKE. THE FUEL TANK NOZZLE IS JAMBED AGAINST THE LEFT SIDE OF THE GAS DOOR OPENING, THUS REQUIRING A PERSON'S HAND TO SCRAP AGAINST THE CAR TO OPEN THE FUEL TANK.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/13/2001",
        "dateOfIncident": "07/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 892770,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT NIGHT THERE IS A GLARE ON  WINDSHIELD FROM  INSTRUMENT PANEL. HAS CONTACTED DEALER, DEALER   WAS NOT WILLING TO DO ANYTHING ABOUT THAT.*AK",
        "vin": "N/A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/13/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 892795,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS INVOLVED IN A FRONT AND REAR END COLLISONS WHILE TRAVELING 30-35MPH.   AIRBAG SENSOR WAS SCRAPED, AND EXPOSED; BUT THE AIRBAGS FAILED TO DEPLOY. THERE WAS NO PRIOR WARNING THAT  AIRBAGS WERE INOPERATIVE. MANUFACTURER HAS BEEN CONTACTED, BUT NO RESPONSE AS OF YET. PLEASE PROVIDE FURTHER DETAILS.*AK",
        "vin": "4T1BF28B914"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/13/2001",
        "dateOfIncident": "07/13/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 892799,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FILL ING UP WITH FUEL  INDICATOR LIGHTS COME UP ON  DASHBOARD. THERE  WAS A PROBLEM WITH  FUEL.   *AK  CONSUMER TOOK THE VEHICLE TO DEALER THREE TIMES BECAUSE THE ENGINE LIGHT KEPT COMING ON GAS, THEN THEY DISCOVERED THE FLEXHOSE HAD COME OFF THE CHARCOAL CANISTER. *YH",
        "vin": "4T1BF28BX1U"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/06/2001",
        "dateOfIncident": "06/16/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 892137,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS AT STANDSTILL IN TRAFFIC AND  WAS REARENDED. TRUNK WAS PUSHED INTO BACKSEAT. VEHICLE WAS PUSHED INTO VEHICLE IN FRONT, VEHICLE IN FRONT AND CONSUMER'S VEHICLE  WERE TOTALLED.  SEATBELT DID NOT RESTRAIN DRIVER. HE HIT HIS HEAD ON STEERING WHEEL, REQUIRED 20 STITCHES.  *AK  PASSENGERS SEAT BELT WORKED, HOWEVER DRIVERS DID NOT, PASSENGER SUSTAINED MINOR INJURIES, CONSUMER LIST THAT VEHICLE HAS MOTORBELTS AND REGULAR SEAT BELTS.   *SLC",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/06/2001",
        "dateOfIncident": "06/16/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 892139,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS AT STANDSTILL WHEN IT  WAS REARENDED WITH GREAT SPEED AND PUSHED INTO VEHICLE IN FRONT.  TRUNK WAS PUSHED INTO BACK SEAT.  VEHICLE IN FRONT AND CONSUMERS VEHICLE WERE TOTALLED. AIRBAGS DID NOT DEPLOY, CONSUMER HIT STEERING WHEEL, AND REQUIRED 20 STITCHES IN HIS FACE.*AK",
        "vin": "4T1BF28B71U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/22/2001",
        "dateOfIncident": "02/07/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 3,
        "numberOfInjuries": 0,
        "odiNumber": 9003041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DID NOT OPEN, DURING THIS ACCIDENT THERE WERE 3 DEATHS.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/25/2001",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 745894,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE \"WANDERS\"  IE, AT HIGHWAY SPEEDS THE PERCEIVED FEELING IS THAT THE VEHICLE IS BEING DRIVEN IN DEEP ROUTES OR OVER TROLLEY TRACKS, MUCH LIKE THE FEELING WHEN DRIVING OVER A BRIDGE SURFACE THAT IS CONSTRUCTED OF METAL GRATING.  THIS CREATES AN OVERALL FEELING THAT I HAVE NO REAL CONTROL OVER THE VEHICLE.",
        "vin": "4T1BF28B51U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/10/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 745151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA REQUIREMENT OF WARNING LABELS POSTED ON THE VISOR HAS RESULTED IN GLUE RESIDUE ON THE VISOR WHICH I CANNOT REMOVE.  WHAT CAN USE TO CLEAN OFF THE GUMMY AREA?*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/23/2001",
        "dateOfIncident": "01/14/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 741400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN ONE WEEK OF OWNERSHIP, THE VEHICLE STARTED TO BOG DOWN WHEN MAKING A TURN FROM A DEAD STOP. A DAY LATER THE ENGINE LIGHT CAME ON. THE PROBLEM WAS BROUGHT TO THE DEALERS ATTENTION AND THE REPLY WAS THAT; \"WE DON'T KNOW WHAT'S WRONG, WHEN WE FIND OUT WE'LL LET YOU KNOW...UNTIL THEN, BE CAREFUL\"  THAT WAS OVER A MONTH AGO AND I HAVEN'T HEARD ANYTHING FROM THEM. I CALLED TO FIND OUT WHAT WAS GOING ON AND WAS TOLD THAT THEY STILL DIDN'T HAVE A CLUE WHAT WAS WRONG. THE VEHICLE IS UNPREDICTABLE WHEN TAKING OFF AND HAS ALREADY RESULTED IN A COUPLE OF CLOSE CALLS WHEN PULLING OUT INTO TRAFFIC. THE GENERAL ATTITUDE IS NONCHALANT AND NOBODY HAS MADE ANY ATTEMPT TO NOTIFY ME OF ANYTHING. FROM WHAT I WAS TOLD BY THE DEALERSHIP. ALL THE 2001 HIGHLANDERS ARE EXPERIENCING THE SAME PROBLEM.",
        "vin": "JTEGD21A010"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/10/2001",
        "dateOfIncident": "01/13/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 740723,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A LARGE STEER AT NIGHT WHILE ACCELLERATING FROM A STOP.  IMPACT WAS SEVERE AND RESULTED IN A TOTAL LOSS OF THE CAR.  THE AIR BAGS DID NOT DEPLOY.  WAS TOLD BY DEALER THAT BECAUSE THE INITIAL IMPACT WITH THE STEER WAS HIS LEGS AND LITTLE RESISTANCE WAS NOT ENOUGH TO TRIGGER THE AIR BAGS.  THE SEVERITY OF DAMAGE TO FRONT END, HOOD, AND ROOF MADE ME WONDER IF ANOTHER SENSOR WOULD BE APPROPRIATE HIGHER UP WHICH WOULD TRIGGER THE AIR BAGS.   YOUR OPINION AND COMMENTS WOULD BE APPRECIATED.       HOOD, LI*AK",
        "vin": "4T1BF28BX1U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/18/2001",
        "dateOfIncident": "01/18/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 878526,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT  DASHBOARD LIGHT WILL REFLECT ON WINDSHIELD GLASS, AND WILL INTERFERE WITH DRIVER'S VISION IN  DARK.  *AK  THE REFLECTION ON TO WINDSHIELD WAS DUE TO DESIGN FLAW.  THE DASBOARD DOES NOT EXTEND FAR ENOUGH TO BLOCK THE REFLECTION FROM THE INSTRUMENT PANEL.   *YH",
        "vin": "4T1BS28B91U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/22/2000",
        "dateOfIncident": "12/22/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738149,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE IS LOW-PROFILE DESIGN STANDARD ON PRIUS. EXPLOSIVE SEPARATION OCCURRED ON DRY ROADWAY WITHOUT DEBRIS. OUTSIDE AIR TEMPERATURE WAS APPROXIMATELY 78 DEGREES. THANK GOODNESS THAT THE TIRE WAS ON THE REAR. DRIVER WAS ABLE TO INITIATE A CONTROLLED STOP FROM THE NUMBER ONE LANE TO THE RIGHT SHOULDER. THE SEPARATION CAUSED DAMAGE TO THE LEFT REAR QUARTER-PANEL, THE ALLOY RIM AND OF COURSE THE TIRE. BRIDGESTONE CUSTOMER CARE WAS CONTACTED AT 800-847-3272 AND I WAS ADVISED THAT THEY WOULD SEND A CLAIM PACKAGE WITHIN 5 DAYS. THERE IS NO REFERENCE NUMBER ASSIGNED. THEY INDICATED THAT THEY WOULD PAY FOR REPAIRS. SERIAL NUMBER FOR ALL 4 TIRES IS: CHA3700. IT IS LIKELY THAT THIS LOT OF TIRES IS ON ALL OF THE PRIUS VEHICLES SITTING AT THE LONG BEACH, CALIFORNIA STORAGE FACILITY. THE TIRE PRESSURE ON THE VEHICLE WAS CHECKED THE DAY BEFORE THE INCIDENT AND ALL TIRES WERE INFLATED ACCORDING TO SPECIFICATIONS.  *AK (DOT NUMBER: EL9P  TIRESIZE: P17565 R14)",
        "vin": "JT2BK12U310"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/12/2000",
        "dateOfIncident": "12/06/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737687,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING FEEDBACK BECOMES TOO LIGHT AND UNSTABLE AT HIGHT SPEED (65MPH). ON THE SECOND VISIT TO THE DEALER, THE TECHNICIAN WHO TEST DROVE THE CAR ADMITTED \u0013THIS CARS STEERING FEELS LOOSER\u0014. DEALER ADJUSTED THE ALIGNMENT WITH NO POSITIVE CHANGES TO THE PROBLEM.  *AK",
        "vin": "4T1BF28B81U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/12/2000",
        "dateOfIncident": "12/05/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737688,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR MAKES A JERKY MOVE WHEN TRYING TO ACCELERATE FROM A SLOW ROLLING SPEED (10 MPH).*AK",
        "vin": "4T1BF28B81U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2000",
        "dateOfIncident": "12/03/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737435,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MULLER TOYOTA TECHNICIAN STATED THAT FUEL LINE FELL OFF FILTER.  INCIDENT:  CAR STALLED WHILE PROCEEDING ON NYC STREET.  PULLED OUT OF TRAFFIC.  WHEN ATTEMPTING TO RESTART, LARGE AMOUNT OF GASOLINE FLOWED OUT FROM UNDER CAR.  GOT THE THREE PEOPLE OUT OF CAR TO SIDEWALK. NYC FIRE DEPARTMENT CALLED OUT-THEY COULD NOT DETERMINE SOURCE OF GASOLINE AND ADVISED THAT NOT SAFE TO DRIVE.  CAR WAS FLATBEDDED TO MULLER TOYOTA IN CLINTON, NJ. ADDITIONAL GASOLINE SPILL NOTICED ON FLATBED. OWNER WAS TOLD THAT FUEL LINE CONNECTION CAME APART AND TECHNICIAN CLICKED IT BACK TOGETHER. THEY SUGGESTED THAT THE FUEL LINE CONNECTION CAME APART AS A RESULT OF AN IMPACT WITH AN OBJECT, A ROAD BUMP, OR IMPROPER FACTORY ASSEMBLY. NO EVIDENCE OF ANYTHING IMPACTING A COMPONENT WAS FOUND. I BELIEVE THIS IS A SERIOUS SAFETY DESIGN DEFECT IN THE DESIGN OF THE FUEL LINE THAT COULD HAVE HAD A CATASTROPHIC RESULT WITH FATALITIES IF THE FUEL LINE SEPARATION OCCURED ON A HIGHWAY, AT SOME HIGHER SPEED, OR WITH THE CAR AT A HIGHER TEMPERATURE. IT MAY REQUIRE A REDESIGNED COMPONENT PRECLUDES AN UNSAFE INSTALLATION AND RESISTS SEPARATION DUE TO NORMAL ROAD BUMPS.",
        "vin": "4T1BF28B11U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/13/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 874807,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING DURNING RAIN WINDSHIELD GIVES OFF POOR VISIBILITY.  *AK",
        "vin": "4T1BF28B01U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/13/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 736233,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "AVALON",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "4T1BF28B81U"
    }
]