[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/16/2018",
        "dateOfIncident": "07/16/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111799,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME ON 7/15/18 AND AS I WAS PULLING INTO MY GARAGE A LOUD NOISE STARTED BUZZING FROM MY DASHBOARD AND MY BRAKE LIGHT, ABS, AND VSC LIGHTS ALL CAME ON AT ONCE.  MY BRAKES HAD COMPLETELY FAILED WITHOUT ANY WARNING.  THE PEDAL WENT RIGHT TO THE FLOOR WHEN I PRESSED IT AND IT WOULD NOT STOP THE VEHICLE.  I ALMOST WENT RIGHT THROUGH THE OTHER SIDE OF MY BRICK GARAGE.  LUCKILY THE EMERGENCY BRAKE ALLOWED ME TO STOP BEFORE THIS HAPPENED.  I HAD JUST GOTTEN OFF THE HIGHWAY TRAVELING AT 70 MPH.  I CANNOT IMAGINE IF THE BRAKES COMPLETELY FAILED  AT THIS SPEED.  I HAVE OWNED THIS VEHICLE FOR 17 YEARS AND I HAD NEVER HAD A DASH LIGHT OR SOUND COME ON.  THERE SHOULD HAVE BEEN MORE OF A WARNING!  BRAKES SHOULD NOT JUST COMPLETELY FAIL WITHOUT ANY INCIDENT OR WARNING.  I HAVE SEEN A FEW OTHER POSTS ABOUT THIS HAPPENING FOR OTHER LAND CRUISER OWNERS AND TOYOTA NEEDS TO BE HELD ACCOUNTABLE.  THIS IS A MAJOR SAFETY ISSUE AND IT SHOULD NEVER HAVE HAPPENED ON THE KING OF SUV'S.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2015",
        "dateOfIncident": "05/05/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723042,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPARE TIRE IS HELD IN PLACE WITH A STEEL CABLE THAT BROKE SPONTANEOUSLY AFTER 14 YEARS OF STRESS SUPPORTING THE WEIGHT OF A HEAVY SPARE TIRE.  IF THIS HAPPENED ON THE HIGHWAY IT MAY HAVE CAUSED A SERIOUS ACCIDENT.  I SUSPECT THAT THIS MIGHT HAPPEN TO ANY VEHICLE THAT DEPENDS ON A SINGLE STEEL CABLE TO HOLD UP A SPARE TIRE.",
        "vin": "JTEHT05J212"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/24/2013",
        "dateOfIncident": "05/29/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521473,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 29,2013 AT APPROXIMATELY 1 PM, I WAS STOPPED AT A TRAFFIC LIGHT WAITING FOR APPROACHING TRAFFIC TO CLEAR SO THAT I COULD MAKE A LEFT TURN. SUDDENLY, I HEARD A BUZZER ALARM AND NUMEROUS DASH BOARD LIGHTS LIT UP, INCLUDING ABS, VSC, BRAKE, ETC.COMPLETING THE TURN,  I REALIZED THAT THE BRAKES WERE VIRTUALLY NON FUNCTIONAL AND REQUIRED EXTREME FORCE TO SLOW DOWN THE VEHICLE. I DROVE TO MY NEARBY HOME AT A VERY SLOW SPEED AND PARKED THE VEHICLE IN MY GARAGE.  UPON RETURNING FROM A TRIP I HAD THE TOWING COMPANY  FLATBED THE VEHICLE TO THE DEALER. THEIR DIAGNOSTICS CONCLUDED THAT THE HYDRAULIC BRAKE BOOSTER HAD FAILED AND NEEDED REPLACEMENT. TOTAL COST IS $3100 INCLUDING A SLIGHT DISCOUNT SINCE I HAVE BEEN A CUSTOMER FOR OVER 16 YEARS. THE SERVICE MANAGER COULD NOT RECALL A SIMILAR REPAIR DURING HIS 18 YEARS WITH THE TOYOTA AGENCY.  I CONSIDER MYSELF FORTUNATE THAT THE FAILURE OCCURRED WHEN I WAS STOPPED. HAD IT HAPPENED AT FREEWAY SPEEDS OR DRIVING DOWN THE LONG AND STEEP ROADS IN MY COMMUNITY I COULD HAVE HAD A SERIOUS AND PERHAPS A FATAL ACCIDENT.  I HAVE A PHD IN MECHANICAL ENGINEERING  WITH OVER 32 YEARS OF INDUSTRIAL EXPERIENCE. THE BRAKE SYSTEM ON THIS VEHICLE HAS A LATENT DESIGN FLAW WITHOUT A FAIL SAFE BACKUP. TOYOTA SHOULD BE HELD ACCOUNTABLE, REDESIGN THE FAULTY COMPONENTS, NOTIFY OWNERS OF THE PROBLEM AND RECALL ALL AFFECTED VEHICLES.  I SPOKE WITH A REPRESENTATIVE TO HAVE TOYOTA PICK UP THE REPAIR COST. OF COURSE, THEY DID NOTHING, QUOTING THE EXPIRATION OF THE WARRANTY, ETC,ETC.I BELIEVE THE ONLY RECOURSE IS FOR THE NHTSA TAKE ACTION AGAINST TOYOTA.  *TR",
        "vin": "JTEHT05J212"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "01/09/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400059,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA LAND CRUISER. THE CONTACT WAS DRIVING 5 MPH OVER A SPEED BUMP WHEN THE SPARE TIRE CABLE FAILED, CAUSING THE SPARE TIRE TO SEPARATE FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO INSPECTED THE VEHICLE AND FOUND THAT THE TIRE CABLE WAS DEFECTIVE AND SUFFERED METAL FATIGUE. THE DEALER ALSO STATED THAT THE CONTACT HAD CUT THE SPARE TIRE CABLE. THE MANUFACTURER WAS CONTACTED AND ADVISED THAT THE VEHICLE WAS OUT OF WARRANTY AND THEY WOULD NOT ASSIST WITH THE REPAIR. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 76,000 AND THE CURRENT MILEAGE WAS 80,000.",
        "vin": "JTEHT05J012"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/22/2010",
        "dateOfIncident": "08/14/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/14/10 AT APPROXIMATELY 6 PM, I WAS TRAVELING WITH MY FAMILY SOUTHBOUND ON INTERSTATE 5-FREEWAY IN NORTH LOS ANGELES COUNTY (CITY OF VALENCIA) WHEN AN AUDIBLE DASH ALARM AND SEVERAL DASH PANEL LIGHTS LIT UP ON MY DASH PANEL. SHORTLY AFTER THIS OCCURRED, I LOST ALL POWER ASSIST IN MY BRAKING SYSTEM AND WAS FORCED TO USE BOTH EXTREME FOOT PRESSURE ON THE BRAKE PEDAL AND THE HAND BRAKE TO BRING MY CAR TO A STOP. I WOULD CLASSIFY THIS AS A CATASTROPHIC FAILURE OF THE BRAKING SYSTEM. THE CAR WAS TOWED TO A TOYOTA DEALERSHIP, WHERE THE PROBLEM WAS DIAGNOSED AS A FAILURE OF THE ABS ACTUATOR SYSTEM. COST TO REPAIR EXCEEDED $2700. TOYOTA CUSTOMER CARE WAS NOTIFIED - AN ATTEMPT TO OBTAIN GOOD-WILL REPAIR BASED ON THE CIRCUMSTANCES OF THE PROBLEM WAS DENIED BY TOYOTA. TOYOTA HAS NOT OFFERED ANY RESPONSE TO ME REGARDING THE SYSTEM FAILURE AND THE EXTREME DANGER THAT MY FAMILY AND MYSELF WERE EXPOSED TO. BASED ON INTERNET RESEARCH, THIS SAME PROBLEM HAS BEEN REPORTED BY OTHER TOYOTA LANDCRUISER OWNERS, AND TOYOTA HAS BEEN NOTIFIED IN EACH CASE AND CHOSEN TO DO NOTHING TO INVESTIGATE THE REPORTED FAILURE. THIS TYPE OF CATASTROPHIC FAILURE OF A BRAKING SYSTEM HAS THE POTENTIAL TO CAUSE FATAL ACCIDENTS AND SHOULD BE INVESTIGATED BY TOYOTA AND THE NHTSA. THE LACK OF ANY TYPE OF FAIL-SAFE SYSTEM THAT WOULD PROVIDE BRAKING BACK-UP REPRESENTS A SERIOUS DESIGN FLAW IN THIS MODEL LANDCRUISER. TOYOTA NEEDS TO DEVELOP A FIX FOR THIS PROBLEM AND A RECALL NOTICE SHOULD BE SENT OUT TO OWNERS FOR ALL LANDCRUISER MODELS FOR WHICH THIS DESIGN FLAW EXISTS. *TR",
        "vin": "JTEHT05J212"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/15/2008",
        "dateOfIncident": "10/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245599,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SKID CONTROL LOCKS UP FRONT WHEEL AT LOW SPEEDS AND MAKES IT IMPOSSIBLE TO CLEAR INTERSECTION.  OBJECTS AND PASSENGERS ARE VIOLENTLY THROWN FORWARD. DEALER HAS BEEN UNSUCCESSFUL IN RESOLVING THIS DANGEROUS CONDITION, EVEN AFTER I PAID TO REPLACE THE YAW SENSOR, THE WARNING LIGHTS FOR ABS AND VSC CAME ON  THE WAY HOME AFTER REPAIR.  THIS PROBLEM HAD BEEN DISCUSSED FOR YEARS ON THE IH8MUD LAND CRUISER ENTHUSIAST SITE.  SOME OWNERS REPORT WHEELS LOCKING UP AT HIGHWAY SPEEDS PUTTING VEHICLE IN DANGER OF ROLLOVER ACCIDENT. *TR",
        "vin": "JTEHT05J812"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/27/2007",
        "dateOfIncident": "04/15/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189102,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE PAST FEW WEEKS I HAVE ENCOUNTERED A SITUATION WHICH I FEEL IS QUITE DANGEROUS.  THE FOLLOWING HAS HAPPENED ON FOUR OCCASIONS WHILE ON HIGHWAYS AND INTERSTATES.  WHAT OCCURS IS THAT I WILL BE DRIVING ON A HIGHWAY AT ABOUT 65-70 MILES/HR WHEN SUDDENLY THE TRANSMISSION SHIFTS INTO A MUCH LOWER GEAR.  I AM NOT SURE WHICH GEAR IT IS, BUT IT IS INTO A VERY LOW GEAR.  TWO THINGS HAPPEN.  THE CAR SUDDENLY SLOWS DOWN RAPIDLY WITHOUT THE BRAKE LIGHTS COMING ON WHICH CAUSES THE CAR BEHIND ME TO COME CLOSE TO REAR-ENDING ME.  BUT A WORSE SITUATION IS THAT THE SUDDEN DROP INTO A LOW GEAR CAUSES THE CAR TO SUDDENLY DODGE TO THE RIGHT - I ASSUME BECAUSE OF THE ENORMOUS TORQUE GENERATED BY THIS SHIFT THAT OCCURS WITHOUT THE ENGINE SLOWING DOWN FIRST.  THIS HAS OCCURRED  TWICE ON INTERSTATES AND TWICE ON TWO LANE HIGHWAYS, ALWAYS AT HIGH SPEEDS BETWEEN 65 AND 70 MPH.  WHEN THIS HAPPENED LAST WEEK ON A TWO LANE HIGHWAY, THE CAR DODGED TO THE RIGHT.  TO KEEP FROM GOING DOWN AN EMBANKMENT I STEERED HARD TO THE LEFT AND OVER STEERED A LITTLE, ALMOST HITTING A MOTORCYCLE IN THE ONCOMING LANE.   ON TWO OF THE OCCASIONS, ABOUT A HALF-HOUR BEFORE THE CAR DID THIS, I WAS DRIVING WITH THE CRUISE CONTROL ON AT ABOUT 65 MPH AND THE CRUISE CONTROL WENT OFF BY ITSELF FOR NO REASON.  I TOOK THE CAR TO A AAA DESIGNATED TRANSMISSION SHOP YESTERDAY.  THEY TOOK IT FOR A TEST DRIVE AND RAN A SCAN BUT FOUND NOTHING.  THEY THOUGHT IT WOULD BE IN THE CRUISE CONTROL OR ELECTRONICS OR SENSORS.*JB",
        "vin": "JTEHT05J412"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/11/2004",
        "dateOfIncident": "03/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061901,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SUDDENLY ACCELERATED WHEN I PRESSED THE BRAKES GOING DOWN AN INCLINE.*AK",
        "vin": "JTEHT05J812"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/20/2002",
        "dateOfIncident": "07/15/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765931,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "LAND CRUISER",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT PEELING (BLACK MATTE FINISH) FROM FACTORY INSTALLED ROOF RACK - ALL SIDES. *AK",
        "vin": "JTEHT05J112"
    }
]