[
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/12/2019",
        "dateOfIncident": "04/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 30,
        "odiNumber": 11195818,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER HIT A STOPPED CAR AT APPROX 30 MPH. SHE HIT THE STEERING WHEEL AND THEN THE AIRBAGS DEPLOYED TOO LATE. SHE WAS DRIVING ON A CITY STREET. SHE WAS GOING STRAIGHT.",
        "vin": "1NXBR12EX1Z"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2018",
        "dateOfIncident": "05/01/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133326,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2001 TOYOTA WE NOTICED THAT THE CHECK ENGINE LIGHT WOULD COME ON EVERY MONTH AND SO I TOOK THE CAR TO AUTOZONE FOR A FREE DIAGNOSTIC TEST EACH TIME WITH THE RESULT SHOWING THAT THE CAR HAS AN ELECTRIC SHORT CIRCUIT PROBLEM. THIS IS A DEFECT IN THE TIMING CHAIN AND A PART CALLED A CAM. TO FIX THE PROBLEM IT WOULD COST ME AROUND 800 DOLLARS. I REPORTED THE  PROBLEM BUT THEY JUST IGNORED ME. THE RESULT IS I HAVE TO DO AN OIL CHANGE EVERY 1200 MILES AS THERE IS NO OIL IN THE ENGINE AFTER 800 MILES. NORMALLY ONE WOULD HAVE AN OIL CHANGE DONE EVERY 3000 MILES. SO THE CHECK LIGHT COMES ON EVERY 400 MILES INTERVALS. THIS PROBLEM HAS BEEN REPORTED BY MANY PEOPLE ON FORUMS ABOUT THE 2001 COROLLA, BUT TOYOTA NEVER BOTHERED FIXING. IN ADDITION TO THIS PROBLEM THE PLASTIC LINING AROUND OUR CAR WINDOWS, ON ALL FOUR DOORS HAS PEELED OFF. I REPORTED THIS TO THE TOYOTA DEALER LAST SPRING. THE ASSISTANT SERVICE MANAGER ACKNOWLEDGED THAT TOYOTA KNOWS ABOUT THIS LINING PROBLEM AND YET THE DEALER IGNORED ME ON THIS. INSTEAD THEY ASKED ME TO COUGH UP $450 TO FIX THE PROBLEM. IF THIS IS NOT A RIPOFF ON THAMERICAN CITIZENS THEN WHAT IS? ALSO THE HEADLIGHTS AND BLINKERS DONT STAY IN THE CAR I USE WIRE TO WIRE THEM TO THE FRAME OR THEY FALL OUT WHICH HAPPENED TO ME ALREADT THANK GOD IT WAS DAYLIGHT  HERE ARE SOME HTTP://WWW.COROLLAND.COM/FORUMS/INDEX.PHP?/TOPIC/18973-2001-COROLLA-CHECK-ENGINE-LIGHT-ISSUE/ HTTP://WWW.FIXYA.COM/CARS/T1082872-CHECK_ENGINE_LIGHT_2001_TOYOTA_COROLLA HTTP://WWW.TUNDRASOLUTIONS.COM/FORUMS/COROLLA-MATRIX/69501-2001-COROLLA-CHECK-ENGINE-P0446/ HTTP://WWW.2CARPROS.COM/FORUM/2001-TOYOTA-COROLLA-CHECK-ENGINE-LIGHT-IS-ON-VT126177.HTML THE SAME PROBLEM OF THE CHECK ENGINE LIGHT HAS BEEN REPORTED ON COROLLAS 2000, 2001, 2002, 2003,... WILL THE DEPT. OF TRANSPORTATION ACT AGAINST TOYOTA AND HELP US FIX OUR CARS? *TR",
        "vin": "1NXBR12E31Z"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/27/2018",
        "dateOfIncident": "03/13/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114128,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT NOT GOING OFF EVEN AFTER REPLACING THE PARTS",
        "vin": "1NXBR12E31Z"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2018",
        "dateOfIncident": "12/11/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092060,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DAYTIME RUNNING LIGHTS DO NOT TURN AUTOMATICALLY.  THE HIGH BEAM INDICATOR LIGHT FLASHES.  I TURN THE LIGHTS ON AND THE HIGH BEAM INDICATOR LIGHT STOPS FLASHING.  I HAVE REPLACED THE DAYTIME RUNNING LIGHT RELAY TWICE AND NEITHER ONE FIXED THE PROBLEM.  THE DAYTIME RUNNING LIGHT RELAYS WERE USED NOT NEW.",
        "vin": "1NXBR12E31Z"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "01/03/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058472,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSIDE DOOR HANDLES AND EXTERIOR DOOR LOCKS BREAK ONCE EVERY TWO OR THREE MONTHS I HAVE REPLACED THEM ALL WITH FACTORY TOYOTA DOOR HANDLES AND AFTERMARKET DOOR HANDLES AND OUT SIDE DOOR LOCKS I HAVE HAD THEM REPAIRED AT THE TOYOTA DEALERSHIP AND BY A COUPLE DIFFERENT MECHANIC SHOPS I HAVE HAD TO ORDER AND REPLACE THEM MYSELF NO MATTER HOW GENTLE I AM NOT EVEN THE SLIGHTEST BIT OF PRESSURE AND THEY SNAP I HAVE ACTUALLY BEEN LOCKED INSIDE MY CAR TO THE POINT I HAVE HAD TO OPEN THE WINDOW AND OPEN THE DOOR HANDLES TO KEEP THEM IN ONE PIECE LONG ENOUGH TO MAKE THEM LAST THE TRIP FROM LOUISIANA TO IOWA 980 MILES ONE WAY THAT'S THE ONE WAY THEY HAVE NOT BROKEN BY NOT USEING THEM AS EXPECTED I HAVE THEM ON ORDER RIGHT NOW IT'S NOT BEEN ONE CALLANDER MONTH SINCE I BOUGHT THE CAR I HAVE BEEN ABLE TO NOT REPLACE THEM IT'S NOW TO THE POINT I HAVE 2 SETS ON ORDER THIS WAY WHEN THEY BREAK EXCEPT FOR WHEN I HAVE USED THE OUTSIDE DOOR HANDLES AS ENTRY AND EXIT  POINTS I WOULD LIKE TO SAY THAT IT'S FUNNY BUT WHEN I WAS UNABLE TO GET THE WINDOW OPEN AND I COULDN'T EXIT THE CAR IT WAS A HORRIBLE FEAR AFTER STRUGGLING WITH THEM I HAPPENED TO BE LOOKING FOR SOMETHING TO BRAKE THE WINDOW AND A MAN PARKED BESIDE ME SEEN MY STRUGGLE AND THE FEAR ON MY FACE AND HE CAME TO THE DOOR ASKED ME IF HE COULD OPEN IT FROM THE OUTSIDE IN RELIEF I WAS NOT GOING TO HAVE TO BREAK MY WINDOW I NOW ROLL THE WINDOW COMPLETELY UP EVEN IN FREEZING OR RAINING WEATHER I ALSO KEEP MY BACK SEAT WEDGED OPEN FOR THE ABILITY TO EXIT THE TRUCK IF IT'S EVER NESSARY",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/04/2018",
        "dateOfIncident": "02/03/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11058462,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BEST WAY TO DESCRIBE HOW MUCH TROUBLE I HAVE HAD GOTTEN A NEW SET OF TIRES EVERY 90-120 DAYS SINCE I HAVE OWNED MY CAR THE SHOCKS ARE ALWAYS PROFESSIONALLY INSTALLED THEY HAVE BROKEN ONE AND THEN BEFORE I CAN GET TO THE SHOP WITHIN 3 DAYS OF FEELING LIKE I AM DRIVING ON SQUARE TIRES THEY START TO FEEL LIKE I AM ONLY ON RIMS WITH IN 50 HWY AND INTERSTATE MILES THEY START TO COME DOWN AND THE TIRES ARE RUBBING ON THE CAR CAUSING THE DAMAGE TO THE TIRES AND THE PADS HAVE BROKEN TWICE I HAVE TRIED DIFFERENT SHOPS BUT THE SAME OUTCOME BROKEN",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "11/17/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11047048,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2001 TOYOTA COROLLA. WHILE DRIVING 60 MPH, ANOTHER VEHICLE REAR ENDED THE CONTACT'S VEHICLE. THE DRIVER'S SEAT DETACHED AND MOVED BACKWARDS. AS A RESULT, THE CONTACT COULD NOT REACH THE PEDALS. NONE OF THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A NECK, HEAD, AND MID BACK INJURIES THAT REQUIRED MEDICAL ATTENTION. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS DESTROYED AND TOWED. THE MANUFACTURER WAS CONTACTED AT 800-331-4331 AND STATED THAT THEY WOULD INSPECT THE VEHICLE WITHIN FIVE DAYS. THE CONTACT WAS ADVISED TO KEEP THE VEHICLE FOR 30 DAYS AND THE MANUFACTURER WOULD CONTACT THEIR LEGAL DEPARTMENT. THE APPROXIMATE FAILURE MILEAGE WAS 118,000.",
        "vin": "1NXBR12E11Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/04/2017",
        "dateOfIncident": "08/04/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11012869,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA COROLLA. THE CONTACT STATED THAT THE LOW BEAM HEADLIGHTS ILLUMINATED TO SEE APPROXIMATELY 10 FEET OF THE ROAD. THE VEHICLE WAS TAKEN TO THE DEALER (COX TOYOTA OF BURLINGTON, NORTH CAROLINA FOR DIAGNOSTIC TESTING. THE DEALER HAD NOT RENDERED A DIAGNOSIS. THE VEHICLE WAS STILL AT THE DEALER GETTING REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 100,000.",
        "vin": "2T1BR12E81C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/10/2017",
        "dateOfIncident": "03/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959937,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2001 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V340000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1BU4EE0BC"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/03/2016",
        "dateOfIncident": "02/02/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10882386,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2009 I WAS INVOLVED IN A MAJOR CAR ACCIDENT.  I HIT MY HEAD AND BECAME UNCONSCIOUS  AND MY AIRBAGS DEPLOYED WHEN I REGAINED CONSCIOUSNESS.  I WAS ADMITTED TO THE HOSPITAL I HAD A GASH ON MY FOREHEAD.  WHEN I TOUCHED MY LEFT EYEBROW IT FELT LIKE I HAD PIECES OF GLASS IN THERE.  BUT NOW WITH THE RECALLS OF THE AIRBAGS, I WONDERED IF IT WAS METAL FRAGMENTS, SCHRAPRAL THAT IS STILL IN MY LEFT EYEBROW.  WOULD YOU PLEASE RECALL MY VEHICLE SO I COULD HAVE MY AIRBAGS REPLACED.  WHEN I REGAINED CONSCIOUSNESS I SAW DIRT AND OTHER STUFF POWDER COMING OUT OF MY DRIVERS AIRBAG.  PLEASE LOOK INTO THIS MATTER AND EMAIL ME BACK AT [XXX]    THANK YOU.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "2T1BR12E41C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/29/2016",
        "dateOfIncident": "08/17/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10862168,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA COROLLA. THE CONTACT STATED THAT WHILE EXITING THE VEHICLE, THE DRIVER SIDE DOOR HANDLE FRACTURED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE DOOR HANDLE WAS REPLACED. IN ADDITION, THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR AN OIL CHANGE, THE MECHANIC OPENED THE DRIVER SIDE DOOR AND THE EXTERIOR DOOR HANDLE FRACTURED. THE DOOR HANDLE WAS REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 75,452.",
        "vin": "1NXBR12E01Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/28/2015",
        "dateOfIncident": "07/18/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10744307,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER AIR BAG CAME OUT N BURNED MY ARM ACTUALLY BOTH DID BY I HAD NO PASSANGER THO IT BROKE WINDSHIELD,ANYWAY IT'S BEEN TEN DAYS MY SKIN IS RAW SEVERE PAIN NO SIGNS OF GETTING BETTER THE BRUISEB GOES ALL WAY AROUND WHOLE BK OF ARM I AM GOIN BK TO DRS. AS I'VE BEEN CARING FOR IT W CLEAN NON STICK PADS N HV TO APPLY TRIPLE ANTIBIOTIC OINTMENT LITERALLY A 13$ TUBE LASTS TWO DAYS I THEN WRAP N AT NITE LET AIR GET IT.THERE IS NO SIGN OF HEALING BURNT THRU ALL LAYERS OF SKIN TO NOW IT IS RAW TO THE MEAT THE PAIN IS CRAZY U WUD XPECT SO SORT OF RELIEF AFTER WAY TEN DAYS I AM GOING TO FURTHER MY RESEARCH.WAY CHEMICALS ARE IN THESE AIRBAGS THAT'S WAY I WANT TO KNOW.",
        "vin": "2T1BR12E91C"
    },
    {
        "components": "AIR BAGS,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "12/21/2014",
        "dateOfIncident": "04/22/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10667472,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 4/22/2008 [XXX], THE OWNER OF A PT.CRUISER, HIT MY TOYOTA HEAD ON AFTER CROSSING THE CENTER LANE  AND WAS DRIVING 35 MPH, WHILE I WAS ALMOST STOPPED ON FALLING WATER DRIVE IN EAGLE RIVER.. IT FLATTENED THE RIGHT FRONT AND LATER LEFT FRONT TIRE, AND BUMPER AND QUARTER PANELS ON THE LEFT.  I FELT LIKE I HAD AN ELECTRIC SHOCK TO MY SPINE THE DRIVERS SIDE AIRBAG DID NOT DEPLOY AND MY SEAT BELT WAS ON. , I  COULDN'T  LIFT THE COMPACT SPARE TIRE TO CHANGE THE FLAT WITHOUT MY NECK HURTING. I HAD CHIROPRACTIC TREATMENT BUT MY NECK WAS STILL SORE    . A YEAR LATER I WENT TO MY GP DR. BARNES AND HE ORDERED AN MRI. THE MRI SHOWED BLOWN DISCS AND /DR. BARNES ORDERED PT. PT. UNSUCCESSFUL  AND WENT TO NEUROSURGEON DR. KRALICK . WHO SUGGESTED  POSTERIOR CERVICAL. LAMINECTOMY AND SPINAL FUSION C-3-C7 AND HAD SAME 4-7-2010. UNFORTUNATELY I  DEVELOPED SEROMA AND ABSCESS AT PROV. HOSPITAL.  I CODED BLUE TWICE. I HAD MASSIVE DISABILITY   AND WAS ALMOST PARALYZED BY THE INFECTION.     I HAD MASSIVE REHAB AND MED EXPENSES IN EXCESS OF $500,000 I AM STILL RECOVERING 4 YEARS LATER AND HAVE TO TQKE FLEXIRIL AND PERKASET FOR PAIN. I HAVE PROFOUND NEUROPATHY IN MY FEET  AND HANDS CRAMPING IN MY LEFT HIP, KNEE AND CALF AND SHARP PAIN AT THE SITE OF THE INCISION. IF THE AIRBAG HAD DEPLOYED AS IT SHOULD, I WOULD NOT HAVE BEEN HURT SO BADLY IN MY SPINE..   *TR",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/23/2014",
        "dateOfIncident": "05/26/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10627757,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS TOTALED IN FRONT END COLLISION. AIR BAGS DEPLOYED.  IT IS MY UNDERSTANDING CERTAIN TOYOTAS OF THIS YEAR HAD ISSUES WITH AIR BAG PROPELLENT AND MINUTE FRAGMENTS OF SHRAPNEL BEING PROPELLED DURING DEPLOYMENT.  SINCE THE CAR WAS TOTALLED, I WOULD LIKE INFORMATION ON ANY RECALLS REGARDING TYPE OF AIR BAG PROPELLENT USED IN THIS MODEL AND ANY OTHER RECALLS REGARDING THE AIR BAG ISSUES IF ANY.   *TR",
        "vin": "1NXBR12E31Z"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/06/2014",
        "dateOfIncident": "06/06/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596705,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLED DURING DRIVING, OCCURRED TO BOTH OF MY CARS THIS ONE IS 2001 COROLLA, HAPPENED TO MY 2006 COROLLA A WEEK AGO. VERY CONCERNING ABOUT COROLLA'S DRIVING SAFETY ISSUE. RE-IGNITE THE CAR, RUN NORMALLY.  *TR",
        "vin": "2T1BR12EX1C"
    },
    {
        "components": "SERVICE BRAKES, AIR,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/15/2014",
        "dateOfIncident": "05/12/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588539,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA COROLLA. THE CONTACT STATED THAT THE ABS SENSOR ILLUMINATED INTERMITTENTLY. THE VEHICLE WAS  INSPECTED, DIAGNOSED AND REPAIRED BY AN AUTHORIZED DEALER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 107,900.",
        "vin": "1NXBR12E81Z"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "04/11/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578616,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA COROLLA.  THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 20 MPH, THE BRAKES FAILED AND TRAVELED TO THE FLOORBOARD WHEN DEPRESSED.  THE FAILURE RECURRED FOUR TIMES IN ONE MONTH.  THE VEHICLE WAS NOT TAKEN TO A DEALER AND  THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM.  THE APPROXIMATE FAILURE MILEAGE WAS 40,000.",
        "vin": "2T1BR12E11C"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/14/2014",
        "dateOfIncident": "01/12/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA COROLLA. THE CONTACT STATED THAT ALL FOUR INTERIOR DOOR HANDLES WERE BROKEN. THE CONTACT REPLACED ALL FOUR DOOR HANDLES THREE TIMES BUT THE FAILURES WERE RECURRING. THE CONTACT DID NOT TAKE THE VEHICLE TO THE DEALER. THE FAILURE MILEAGE WAS 108,000.  UPDATED 02/24/14*LJ  THE CONSUMER STATED THE INSIDE DOOR HANDLES BROKE OFF AT DIFFERENT MILEAGE INTERVALS AND WERE REPLACED BY HIM, ON ALL FOUR DOORS.  UPDATED 02/24/14",
        "vin": "1NXBR12E11Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/03/2013",
        "dateOfIncident": "02/28/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10501096,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 20YO DAUGHTER WAS AT A STOP LIGHT COMPLETELY STOPPED. LIGHT TURNED GREEN, EVERYONE STARTED TO GO, SHE TOOK HER FOOT OFF THE BRAKE ROLLED INTO THE CAR IN FRONT OF HER, TAPPED THE CAR AND HER AIRBAGS WENT OFF, BROKE HER JAW, DISLOCATED HER JAW, BROKE 5 TEETH IN THE BACK, AND LACERATED HER LIP. LUCKILY NO ONE WAS IN THE PASSENGERS SIDE. SHE HAD HER SEATBELT ON, HER WINDSHIELD WAS SHATTERED BY THE AIRBAGS, NO DAMAGE TO ANY OTHER PART OF THE VEHICLE. SHE HAD TO HAVE SURGERY, AND HER JAW WIRED SHUT FOR 4-6 WEEKS NOW. SHE WILL HAVE TO HAVE ROOT CANALS AND CAPS PUT ON HER TEETH AFTER HER JAW HEALS. SHE DID GO UNCONSCIOUS AT IMPACT. LUCKILY SHE HAD BRACES BEFORE AND HAD A RETAINER BRACKET ON HER LOWER TEETH WHICH THE ORAL SURGEON SAID SAVED HER TEETH BELOW OR THEY WOULD HAVE ALL BEEN OUT. I WAS SO SHOCKED THAT JUST A TAP OF THE BUMPER IN FRONT COULD CAUSE THE AIRBAGS TO GO OFF AND CAUSE SO MUCH DAMAGE TO SOMEONE'S FACE. SHE IS A FULL TIME STUDENT AND HAS TWO PART TIME JOBS, SO SHE WILL BE OUT FOR A FEW WEEKS.  *TR   UPDATED 3/32/13 *CN",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "07/07/2012",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10464555,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND WAS DRIVING ON THE HIGHWAY.  HE WAS DRIVING A 2001 TOYOTA COROLLA.  THE TRUCK IN FRONT OF HIM WAS GOING SLOW-SO HE DECIDED TO PASS THE GUY.  AS HE WAS DOING SO-THE TRUCK TURNED LEFT.  MY HUSBAND HIT HIM HEAD-ON AND THEN THE CAR ROLLED ONTO ITS TOP.  NEVER DID THE AIRBAGS GO OFF.  FORTUNATELY HE HAD HIS SEATBELT ON.  HE WAS TAKEN BY AMBULANCE TO HOSPITAL.  THE MOST DAMAGE HE RECEIVED WAS HIS LEFT HAND AND ARM WERE BADLY INJURED.  HE STILL HAS TO HAVE SURGERY THIS NEXT WEEK.  WHY DIDN'T THE AIRBAG DEPLOY?  *TR",
        "vin": "1NXBR12E31Z"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/06/2011",
        "dateOfIncident": "06/05/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404582,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A 2001 TOYOTA COROLLA WITH 420,000 KM ON IT. IT WAS DRIVEN ON THE HIGHWAY ON SAT JUNE 4TH. ON JUNE 5TH WHILE APPROACHING 60 KM ON AN IN TOWN ROAD IN NEWMARKET ON THE FRONT HOOD RELEASED AND FLEW BACKWARD SMASHING THE WINDSHIELD AND DAMAGING THE HOOD, AND SOME OF THE CHASSIS.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2011",
        "dateOfIncident": "01/24/2011",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379363,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA COROLLA. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT NOTICED SMOKE COMING FROM UNDER THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN STATED THE FAILURE WAS CAUSED BY A BURNT  GROUND WIRE AND THE DAYLIGHT RUNNING LIGHT WHICH FAILED DUE TO THE BURNT WIRE. THE RELAY ASSEMBLY AND RUNNING LIGHT WERE REPLACED. THE MANUFACTURER WAS CONTACTED AND STATED DUE TO THE AGE OF THE VEHICLE, THEY COULD NOT PROVIDE ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 86,000.",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/25/2010",
        "dateOfIncident": "05/08/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322161,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA COROLLA. THE CONTACT WAS ATTEMPTING TO PARK THE VEHICLE. A SUDDEN ACCELERATION OCCURRED AND THE VEHICLE CRASHED INTO A BUILDING. THE FRONT END OF THE VEHICLE BUMPER SUSTAINED DAMAGES, AND NO PERSONAL INJURIES. THE VEHICLE WAS TOWED TO AN AUTO BODY SHOP WITH REPAIRS PERFORMED. THERE WAS NO MENTION OF A POLICE REPORT FILING. THE FAILURE MILEAGE WAS 60,000.    ACCORDING TO THE LETTER THE CONSUMER SENT IN, SHE CRASHED INTO A PARKED VEHICLE, WHEN HER VEHICLE SUDDENLY ACCELERATED OUT OF CONTROL AND THEN CRASHED INTO THE RESTAURANT BUILDING. THE CONSUMER ALSO STATED SHE OWNS A 2006 TOYOTA COROLLA AND HER HUSBAND WAS DRIVING THE VEHICLE WHEN IT ACCELERATED OUT OF CONTROL AND HIT FIVE PARKED CARS. UPDATED 06/17/10*JB",
        "vin": "2T1BR12E61C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/16/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320310,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING CAR CHECK ENGINE LIGHT CAME ON ALONG WITH OIL LIGHT AND ENGINE RATTLED.  SHUT CAR OFF AND HAD TOWED TO TOYOTA.  THEY CHANGED CAM GEAR.  DROVE CAR HOME OIL LIGHT CAME ON AND ENGINE RATTLED.  DEALER DID HAVE IT TOWED BACK.  DEALER STATED THAT IF THEY FIND THIS PART WAS NOT THE FIX THEY WOULD CREDIT ME COST.  THEY THEN CHANGED OIL CONTROL VALVE, AND CHARGED ME $100.00 MORE ALONG WITH STATING THE CAM GEAR WAS STILL NECESSARY FOR FIX.  BROUGHT CAR HOME AND CHECK ENGINE LIGHT CAME ON AGAIN.  CHANGED OIL AND OIL LIGHT HAS NOT COME BACK ON, BUT DON'T FEEL THAT CAR IS REALLY FIXED.  PAID $900.00  FOR ALL THIS AND NOT COMFORTABLE THAT CAR IS REALLY FIXED.  CALLED TOYOTA CUSTOMER SERVICE AND THEY WOULD NOT HELP, JUST STATED THAT THIS IS IN THE DEALERS HANDS.  GREAT THE DEALER WATCHING OUT FOR ITSELF WITH TOYOTA HAVING A HANDS OFF APPROACH TO TAKING CARE OF THIS. *TR",
        "vin": "1NXBR12E91Z"
    },
    {
        "components": "STEERING,PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "03/19/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10319617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THAT TOYOTA ONLY RECALL 2009/2010 COROLLA. BUT MY COROLLA HAD FATAL PROBLEM ON 2001 MODEL, AND CRASHED ON 2004/03.  ON HIGHWAY 680 ON 03/19/2004, DOVE AS NORMAL SPEED. THE CARS IN FRONT OF ME WERE FAR AWAY, MAYBE ABOUT 200 METERS. THERE IS NO CAR WAS CLOSELY ASIDE OF MY LANE. I DIDN'T STEP BRAKE OR TRY CHANGE LANE, JUST KEPT THE LANE AND SPEED AS NORMAL. SUDDENLY, THE STEERING WHEEL OUT OF CONTROL. IT RUSHED TO RIGHT, THEN LEFT, THEN RIGHT, LEFT, I TRIED VERY HARD BUT COULDN'T CONTROL THE STEERING. AT THE FIRST SECOND WHEN I NOTICED THE CAR WENT WRONG DIRECTION, I STEPPED THE BRAKE AS HARD AS I COULD, NO USE. STEERING AND BRAKE WERE OUT OF CONTROL. THE CAR HIT THE BARRIER WALL WITH HIGH SPEED, ROLLING OVER AND OVER.   MILPITAS OR SAN JOSE CHP WAS ON SITE, AND HAD A ACCIDENT REPORT.  THE CAR WAS TOTAL DAMAGED, MY HEAD GOT HIT AND START BLEEDING INSIDE BUT DIDN'T CHECK IT OUT AFTER ACCIDENT. 2 MONTHS LATER I HAD A HEAD SURGERY TO STOP THE BLEEDING INSIDE AND TOOK OUT A BIG CHUNK OF BLOOD.  AFTER YEARS, TILL TODAY, I AM STILL SUFFERED BY THE HEAD WOUNDS/HIT.  BUT THE RECALL IS ONLY FOR 2009/2010 MODEL, LEAVE SO MANY DRIVERS STILL IN DANGEROUS SITUATION. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/26/2010",
        "dateOfIncident": "08/12/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE ON MY 2001 TOYOTA COROLLA S HAD THE TIMING CHAIN JUMP, THE ENGINE SUFFERED DAMAGED VALVES, 3 PISTONS WERE BROKEN AND DAMAGED OTHERS.  MY CAR HAD ONLY SLIGHTLY OVER 66,000 MILES ON IT.  THE TOYOTA DEALER WHERE I PURCHASED THE CAR WOULDN'T DO ANYTHING BECAUSE THE CAR WAS OUT OF WARRANTY, BUT I HAVE NEVER HEARD OF A TOYOTA ENGINE GOING BAD WITH SUCH LOW MILEAGE.  IT WAS LUCKY THIS HAPPENED ON A CITY STREET AND NOT ON THE FREEWAY. *TR",
        "vin": "1NXBR12E21Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/18/2010",
        "dateOfIncident": "11/12/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10311898,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA COROLLA WOULD NOT STOP WAS GOING BACKWARDS AND CRASHED INTO HOUSE. NOV 12. 2009. I TURNED THE ENGINE OFF HALFWAY THROUGH THE TRAVEL FROM POINT A TO POINT B. *TR",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "08/06/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10311408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA COROLLA. WHILE DRIVING APPROXIMATELY 40 TO 50 MPH APPROACHING A TRAFFIC LIGHT HE WAS REAR ENDED AND PUSHED INTO THE VEHICLE IN FRONT OF HIM. THE DRIVERS SEAT BASE FAILED CAUSING THE SEAT TO MOVE FORWARD PUSH HIM UNDER THE DASHBOARD. THE DRIVER?S FRONTAL AIR BAG DID NOT DEPLOY. HE SUSTAINED INJURIES TO HIS BACK AND KNEE. THE INSURANCE COMPANY SOLD THE VEHICLE TO A DEALER. REPORT NUMBER 0908117300 WAS FILED WITH THE MANUFACTURER MANUFACTURER ALSO STATED THAT AN INSPECTOR WOULD INSPECT THE VEHICLE; HOWEVER, THEY HAVE DENIED THE CLAIM SINCE THE CONTACT NO LONGER OWNS THE VEHICLE AND THEY ARE NOT OBLIGATED TO DO SO. THE WACO POLICE DEPARTMENT REPORT NUMBER WAS 09-18449. THE FAILURE AND CURRENT MILEAGES WERE 106,268.",
        "vin": "1NXBR12E81Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311542,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2001 TOYOTA COROLLA THAT WE PURCHASED IN JULY 2000 FROM DON MCGILL TOYOTA IN HOUSTON. IN NOV 2008 WE NOTICED THAT THE CHECK ENGINE LIGHT WOULD COME ON EVERY MONTH AND SO I TOOK THE CAR TO AUTOZONE FOR A FREE DIAGNOSTIC TEST EACH TIME WITH THE RESULT SHOWING THAT THE CAR HAS AN ELECTRIC SHORT CIRCUIT PROBLEM. THIS IS A DEFECT IN THE TIMING CHAIN AND A PART CALLED A CAM. TO FIX THE PROBLEM IT WOULD COST ME AROUND 800 DOLLARS. I REPORTED THE PROBLEM TO THE DEALER DON MCGILL IN HOUSTON AND THEY SIMPLY IGNORED ME. I THEN CALLED UP TOYOTA IN CALIFORNIA AND THEY TOO IGNORED ME. THE RESULT IS I HAVE TO DO AN OIL CHANGE EVERY 1200 MILES AS THERE IS NO OIL IN THE ENGINE AFTER 1200 MILES. NORMALLY ONE WOULD HAVE AN OIL CHANGE DONE EVERY 3000 MILES. SO THE CHECK LIGHT COMES ON EVERY 1000 MILES INTERVALS. THIS PROBLEM HAS BEEN REPORTED BY MANY PEOPLE ON FORUMS ABOUT THE 2001 COROLLA, BUT TOYOTA NEVER BOTHERED FIXING.   IN ADDITION TO THIS PROBLEM THE PLASTIC LINING AROUND OUR CAR WINDOWS, ON ALL FOUR DOORS HAS PEELED OFF.  I REPORTED THIS TO THE TOYOTA DEALER LAST SPRING. THE ASSISTANT SERVICE MANAGER ACKNOWLEDGED THAT TOYOTA KNOWS ABOUT THIS LINING PROBLEM AND YET THE DEALER IGNORED ME ON THIS. INSTEAD THEY ASKED ME TO COUGH UP $450 TO FIX THE PROBLEM. IF THIS IS NOT A RIPOFF ON THE AMERICAN CITIZENS THEN WHAT IS?     HERE ARE SOME URLS OF FORUMS, OF THE CHECK ENGINE PROBLEM ON THE 2001 COROLLA   HTTP://WWW.COROLLAND.COM/FORUMS/INDEX.PHP?/TOPIC/18973-2001-COROLLA-CHECK-ENGINE-LIGHT-ISSUE/  HTTP://WWW.FIXYA.COM/CARS/T1082872-CHECK_ENGINE_LIGHT_2001_TOYOTA_COROLLA  HTTP://WWW.TUNDRASOLUTIONS.COM/FORUMS/COROLLA-MATRIX/69501-2001-COROLLA-CHECK-ENGINE-P0446/  HTTP://WWW.2CARPROS.COM/FORUM/2001-TOYOTA-COROLLA-CHECK-ENGINE-LIGHT-IS-ON-VT126177.HTML    THE SAME PROBLEM OF THE CHECK ENGINE LIGHT HAS BEEN REPORTED ON COROLLAS 2000, 2001, 2002, 2003,...    WILL THE DEPT. OF TRANSPORTATION ACT AGAINST TOYOTA AND HELP US FIX OUR CARS? *TR",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/16/2010",
        "dateOfIncident": "06/22/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10310841,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENTERED FREEWAY DRIVING 2001 TOYOTA COROLLA. ACCELERATED TO 70 MPH AND WHILE MOVING INTO THE LEFT-HAND LANE, GAS PEDAL WOULD NOT RELEASE AND TRIED BRAKING BUT THEY WOULD NOT ENGAGE AND STEERING WOULDN'T RELEASE. WENT INTO THE MEDIAN AND ROLLED OVER THREE TIMES.  COMPLETELY TOTALED THE CAR AND I WAS TAKEN BY AMBULANCE TO NEARBY HOSPITAL WHEN I WAS EVALUATED AND RELEASED.  HAVE HAD 10 SURGERIES SINCE ACCIDENT INCLUDING A TOTAL HIP REPLACEMENT AND NOW A 3RD TOTAL KNEE REPLACEMENT.  I ALSO SUFFERED A CONCUSSION. POLICE DOCUMENTATION ON TRAFFIC CRASH REPORT VERIFIES THAT GAS PEDAL/BRAKE NOT ENGAGING WAS CAUSE OF ACCIDENT. *TR",
        "vin": "1NXBR12EX1Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/16/2010",
        "dateOfIncident": "02/06/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311000,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA COROLLA. WHILE THE CONTACT WAS DRIVING 35MPH SHE SUDDENLY NOTICED THAT THE CHECK ENGINE LIGHT HAD APPEARED ON THE DASHBOARD. THE CONTACT DID NOT NOTICE ANY DIFFERENCES IN THE VEHICLE BEFORE OR AFTER NOTICING THE CHECK ENGINE LIGHT. THE VEHICLE HAD NOT BEEN DIAGNOSED BY THE DEALERSHIP. THE CURRENT AND FAILURE MILEAGES WERE 65000.",
        "vin": "2T1BR12E21C"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304811,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A SLOW DRIVER AND OBEY SPEED LIMITS.  I KNEW I WAS COMING UP TO A STOP SIGN ON A 25 MPH ROAD, AND I ALWAYS DO A REAL STOP, NOT A SLOW DOWN AND CREEP FORWARD.  A BLOCK OR TWO PRIOR TO THE ACCIDENT, I PASSED SEVERAL POLICE CARS AND EVEN AN UNSAFE DRIVER WOULD HAVE CAREFULLY OBEYED THE TRAFFIC LAWS.     I HAVE NO MEMORY OF THE COUPLE OF SECONDS IMMEDIATELY PRIOR TO AND DURING THE ACCIDENT, AND MY FIRST MOMENT I SAW WHAT WAS HAPPENING, I HAD MY FOOT ALREADY ON THE BRAKE PUSHING DOWN HARD ON IT BUT HEADING TO THE CURB ANYWAY.  I THINK THE CURB STOPPED THE CAR.  MY AIR BAGS DID NOT DEPLOY AND THE OFFICER AT THE SCENE WAS SURPRISED.     I BELIEVE THIS FITS THE COMPLAINTS ABOUT SUDDEN ACCELERATION.  MY CAR WAS TOTALED AND I HAD TO GET A NEW CAR.  I'VE ASKED MY INSURANCE COMPANY TO INVESTIGATE, BUT THEY HAVE NOT GOTTEN BACK TO ME. *TR",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/15/2009",
        "dateOfIncident": "09/08/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE READ ABOUT ISSUES CONCERNING TOYOTAS STALLING OUT. I HAVE A 2001 COROLLA AND MY CAR HAS STALLED OUT 4 TIMES IN THE LAST THREE MONTHS. THERE WAS NO PRECURSOR THAT WAS SIMILAR TO EACH EVENT. EACH TIME I WAS IN A PARKING GARAGE OR SLOWING TO STOP AT A STOPLIGHT. HOWEVER, I SHUDDER TO THINK IF THIS HAPPENS ON THE FREEWAY. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/29/2009",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285698,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA COROLLA 2001 S - THE DRIVER'S SIDE WINDOW WAS DEFECTIVE. THE AUTOMATIC DOOR HAS 2 NON-METAL HOLDERS TO HOLD UP THE GLASS (GLUED TO THE GLASS). ONE OF THEM GOT BROKEN THAT CAUSE THE GLASS TO GO OUT OF BALANCE AND GET STUCK WHEN ROLLING UP/DOWN. THE MOTOR GOT OVER WORKED AND FAIL SHORTLY AFTER THAT. COULD NOT FIND A PART TO REPLACE EXCEPT FOR THE WHOLE GLASS. THIS HAPPENED AROUND THE END OF 2004/ EARLY 2005.  I HAD TO KEEP THE DRIVER'S SIDE WINDOW CLOSED ALL TIME. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2009",
        "dateOfIncident": "01/31/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281562,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: UNSAFE REBUILT TRANSMISSION, 2001 TOYOTA COROLLA    WE PURCHASED THE VEHICLE ON 7/29/2008.  IN JANUARY 2009, THE ENGINE DUMPED OIL AND BURNED OUT, AND HAD TO BE REPLACED.  ABOUT TWO DAYS LATER THE TRANSMISSION FELL APART.  OUR MECHANIC DISCOVERED THAT IT WAS FROM A SALVAGE YARD AND WAS BEING HELD TOGETHER WITH EPOXY.  THE TRANSMISSION MOUNT WAS BENT, INDICATING TO THE MECHANIC THAT THE CAR MIGHT HAVE BEEN IN SOME KIND OF ACCIDENT.  ALSO I BELIEVE THE MECHANISM FOR THE BOLT TO GO THROUGH (TO HOLD THE TRANSMISSION IN PLACE) WAS MISSING ALONG WITH THE BOLT.      ALL INFORMATION ABOUT THE PROBLEMS WITH THE CAR SHOULD BE VERIFIED WITH HARRY, OWNER OF IMPORT AUTO, AT 2583 UNIVERSITY AVE, MADISON, WI 53705; PHONE 608-231-1221.  HE HAS BEEN KEEPING THE TRANSMISSION FOR INSPECTION BY INTERESTED AUTHORITIES.  HARRY CALLED THE TRANSMISSION A \"FRAUD.\"  IT SHOULD HAVE NEVER BEEN INSTALLED LIKE THAT.    THE TRANSMISSION WAS UNSAFE.   I ALLOW MY GRANDSON TO DRIVE THIS CAR.  HE IS A STUDENT, AGE 19.  HE HAS A PART-TIME JOB WITH PIZZA HUT, DELIVERING PIZZAS.  HE IS ALSO IN A BAND.  TWO DAYS BEFORE THE TRANSMISSION WENT OUT, HE WANTED TO DRIVE THE CAR A LONG DISTANCE FOR A GIG.  I TOLD HIM TO TAKE MY OTHER CAR.  IF HE HAD TAKEN THE COROLLA, THE TRANSMISSION COULD HAVE COME APART AT HIGH SPEED ON FREEWAY IN THE DEAD OF WINTER.  HE AND OTHERS COULD HAVE BEEN KILLED.    MY MECHANIC ORDERED ANOTHER REBUILT TRANSMISSION, BUT IT TOO HAD SIMILAR PROBLEMS.  HE IS FLABBERGASTED THAT THESE TRANSMISSIONS ARE BEING SOLD, AND HE TOLD US HE HAD NEVER SEEN THIS BEFORE IN HIS 40-YEAR CAREER.  WE OPTED TO INSTALL A NEW TRANSMISSION.    BOTTOM LINE: BAD, UNSAFE TRANSMISSIONS ARE BEING SOLD AND UNSCRUPULOUS MECHANICS OR CAR OWNERS ARE INSTALLING THEM.    WE HAVE PHOTOS AND MORE INFORMATION. *TR",
        "vin": "1NXBR12E31Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "06/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278119,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ON JUNE 22, 2009 ON INTERSTATE 75 GOING NORTH AND ANOTHER DRIVER STRUCK ME FROM BEHIND AND THE IMPACT OF HIS TRUCK HIT ME ON THE RIGHT BACK QUARTER PANEL UNDER THE RIGHT REAR LIGHT AND ON THE BUMPER IN THE SAME AREA.  MY CHECK ENGINE LIGHT CAME ON IN MY CAR ON JULY 5TH.  I HAVE TAKEN MY VEHICLE TO AN LOCAL AAMCO FOR SERVICE AND IT REGISTERED TO GAS CAP.  THE GAS CAP HAS BEEN REPLACED WITH A NEW ONE AND 6 DAYS LATER ON JULY 14, 2009, CHECK ENGINE LIGHT CAME BACK ON.  THE CAUSE OF THE LIGHT MAY HAVE BE TRIGGERED FROM THE AUTO ACCIDENT.  I WILL BE TAKING MY CAR TO THE TOYOTA DEALER ON FRIDAY, JULY 24 IN THE MORNING FOR DIAGNOSTICS OF THE CHECK ENGINE LIGHT.  I WILL POST AGAIN AN UPDATE OF MY VEHICLE STATUS AFTER THIS WEEKEND AND UPCOMING WEEK BASED ON THE DEALERSHIP ASSESSMENT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/15/2009",
        "dateOfIncident": "06/03/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273903,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2001 COROLLA UPHILL ITS TIMING CHAIN BROKE AND THE ENGINE TURNED OFF. I HAD MAINTENANCE  DONE VIA TOYOTA AT 90K AND IT HAPPENED AT 92K. I HAVE NO OTHER PROBLEMS OR RECOMMENDATIONS FROM TOYOTA.    THIS IS BIG TICKET ITEM AND IT COST ABOUT 2K TO FIX THE CAR. *TR",
        "vin": "1NXBR12E81Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/01/2009",
        "dateOfIncident": "05/26/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10272477,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 26, 2009, A NISSAN SENTRA MADE AN ILLEGAL LEFT TURN WHICH RESULTED IN MY 2001 TOYOTA COROLLA 'S' BEING TOTALED.  MY SEAT BELT ALLOWED ME TO FLY FORWARD AND MY CHEST HIT THE STEERING WHEEL.  MY AIR BAGS DID NOT DEPLOY.  I FIND THIS INCOMPREHENSIBLE.  I WAS TRAVELING APPROXIMATELY 30-35 MPH.  IF I HAD BEEN ON THE FREEWAY I PROBABLY WOULD HAVE BEEN KILLED. *TR",
        "vin": "1NXBR12E71Z"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2008",
        "dateOfIncident": "08/17/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238577,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PAINT STARTING TO FADE PROGRESSIVELY. *TR",
        "vin": "2T1BR18E2WC"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/11/2008",
        "dateOfIncident": "08/11/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237674,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA COROLLA.  WHILE DRIVING 55 MPH, THE FRONT HOOD OF THE VEHICLE RELEASED, BLOCKING THE CONTACT'S VIEW OF THE HIGHWAY.  THE HOOD SMASHED AGAINST THE WINDSHIELD, WHICH CAUSED IT TO BEND OUT OF SHAPE AND BECOME DESTROYED.  THE CONTACT PULLED OVER AND STOPPED THE VEHICLE.  THE WINDSHIELD WAS CRACKED AND THE ROOF ABOVE THE WINDSHIELD WAS ALSO DAMAGED.  THE VEHICLE WAS NO LONGER UNDER WARRANTY AND THE DEALER STATED THAT THE CONTACT WAS RESPONSIBLE FOR THE REPAIR COSTS.  THE FAILURE AND CURRENT MILEAGES WERE 119,170.",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2008",
        "dateOfIncident": "06/22/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233501,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA COROLLA.  WHILE DRIVING BETWEEN 25-40 MPH, THE VEHICLE MADE A CLUNKING SOUND.  A MECHANIC DISCOVERED THAT THE VEHICLE WAS WOBBLING AND SHAKING ON THE PASSENGER SIDE, AND THAT THE DIFFERENTIAL WAS WORN AND DEFECTIVE.  THE COST FOR THE REPAIR WAS $1,700.  THE CURRENT MILEAGE WAS 45,300 AND FAILURE MILEAGE WAS 45,000. UPDATED 07/29/08. *LJ",
        "vin": "2T1BR12E41C"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/30/2008",
        "dateOfIncident": "04/21/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226128,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EMISSION EQUIPMENT FAILURE.  *TR",
        "vin": "1NXBR12EX1Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "12/27/2007",
        "dateOfIncident": "06/08/2004",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10212991,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1- THERE WAS AN ODOR OF GASOLINE IN THE CAR.     2- SMOKE CAME IN FROM DASHBOARD VENTS; SECONDS AFTER THAT THE BRAKES FAILED; FLAMES CAME IN THROUGH THE DASHBOARD VENTS THEN THE CAR BURST INTO FLAMES CAUSING THE DRIVER TO HAVE TO LEAP FROM THE VEHICLE WHILE IT WAS IN MOTION.  MOMENTS LATER THE CAR EXPLODED AND WAS FULLY ENGULFED IN FLAMES.    3 - THE CAR WAS UNRECOGNIZABLE AFTER THE EXPLOSION AND COMPLETELY TOTALED.  THE TIRES AND ALL NON-METAL PARTS OF THE CAR WERE GONE.  WE HAVE REQUESTED A REPORT AS TO THE CAUSE OF THE PROBLEM FROM THE TOYOTA DEALER AND FROM TOYOTA.  TO DATE, THERE HAS BEEN NO WRITTEN RESPONSE OR ACKNOWLEDGEMENT OF THIS EVENT.  THE CHARRED REMAINS OF THE AUTOMOBILE WERE REVIEWED BY A TOYOTA REPRESENTATIVE, AND AFTERWARD THE TOYOTA DEALER COMMUNICATED VERBALLY THAT IT WAS IMPOSSIBLE TO TELL THE CAUSE OF THE EXPLOSION.  THIS COMPLAINT IS BEING FILED NOW AS THERE HAVE BEEN PROBLEMS WITH FUEL LINES IN OTHER SUBSEQUENTLY OWNED COROLLAS; AND THAT TOYOTA AND THE TOYOTA DEALERSHIP HAVE INDICATED NO CONCERN FOR THE SERIOUS COROLLA FUEL LINE PROBLEMS THAT PRESENTS A CLEAR DANGER TO ANYONE OWNING AND DRIVING THIS CAR.  *TR",
        "vin": "2T1BR12E31C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/20/2007",
        "dateOfIncident": "11/23/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212419,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 TOYOTA COROLLA HAD A HEAD GASKET FAILURE WHICH ACCORDING TO THE SHOP FOREMAN WAS VERY COMMON FAILURE AT A COSTS TO US OF $931.66. IT SEEMS THE GASKET FAILS ON THE REAR OF THE ENGINE IN FRONT OF THE GLOVE BOX. THE FAILURE IS SO COMMON NO TEST WERE PERFORMED SUCH AS LOOKING FOR COOLANT IN THE OIL, ACCORDING TO THE TOYOTA DEALERSHIP SHOP FOREMAN.  *TR",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2007",
        "dateOfIncident": "09/27/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211086,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8-20-07 I BROUGHT THE COROLLA TO TOYOTA TO HAVE THE OIL CHANGED AND TO CHECK A HISSING SOUND AND THE BRAKE LIGHT THAT WAS GOING ON AND OFF.  THE COURTESY INSPECTION SHOWED THAT THE BRAKES, THE DRIVE BELT TENSIONER, TIMING CHAIN AND THE AUTOMATIC TRANSMISSION THROTTLE CABLE HAD TO BE REPLACED.  I HAD ALL OF THE WORK DONE.  ON 9-27-07 I BROUGHT THE CAR BACK TO TOYOTA BECAUSE THE CAR SLIGHTLY HESITATED  WHEN I BACKED UP ON A HILL. I WAS INFORMED THAT THE AUTOMATIC TRANSMISSION NEEDED TO BE REPLACED DUE TO A PROBLEM WITH THE REVERSE GEAR. I WAS TOLD THAT THE CAR WAS NOT SAFE TO DRIVE HOME AND THAT THE TRANSMISSION COULD GO WITH FLUIDS LEAKING EVERYWHERE. THE CAR ONLY HAD 53,821 MILES ON IT. I WAS TOLD THAT TOYOTA WOULD NOT COVER THE TRANSMISSION SINCE THE CAR WAS 6 YEARS OLD.  I HAD THE CAR REPAIRED WITH A USED TOYOTA TRANSMISSION BECAUSE I COULD NOT AFFORD THE PRICE OF A NEW TRANSMISSION.   *TR",
        "vin": "2T1BR12E61C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/30/2007",
        "dateOfIncident": "04/05/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207423,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 TOYOTA COROLLA LE WITH ABOUT 68,000 MILES, MY CHECK ENGINE LIGHT CAME ON. I HAD MY MECHANIC RUN THE OBD CODE, WHICH RETURNED THE CODE OF P0446 (EVAPORATIVE EMISSION CONTROL SYSTEM VENT CONTROL CIRCUIT). MY MECHANIC DETERMINED THE PROBLEM WAS WITH THE CHARCOAL CANNISTER SYSTEM THAT CONTROLS THE EMISSIONS OF THE COROLLA. WHEN I WAS READING ON HERE I FOUND SEVERAL PEOPLE WHO HAVE THE SAME PROBLEM AND I WANT THIS RESOLVED TO NO EXPENSE TO ME. I DON'T HAVE THE MONEY IT WILL TAKE TO FIX THIS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/25/2007",
        "dateOfIncident": "07/12/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA COROLLA.  THE CONTACT STATED THAT THE VEHICLE FAILED TO START.  HE CHECKED THE FAN BELT AND HEARD A KNOCKING SOUND.  HE HAS NOT TAKEN THE VEHICLE TO THE DEALER BECAUSE HE HOPED THERE WAS A RECALL AVAILABLE.  THE FAILURE AND CURRENT MILEAGES WERE 65,000.",
        "vin": "2T1BR12E91C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/26/2007",
        "dateOfIncident": "07/14/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200822,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "WINSTON WINNER",
                "productModel": "LT24575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED A SET OF WINSTON WINNER 185/60R14 82 H  THE TIRES WERE ROTATED AND AT ABOUT HALF OF THE LISTED LIFETIME OF THE TIRES, AND WITH PLENTY OF TREAD, ONE OF THE TIRES BLEW OUT AT 60MPH ON THE INTERSTATE.  THE TIRE APPARENTLY BLEW OUT AROUND THE LETTERING OF THE TIRE AT THE T OF WINSTON.  UPON CLOSER INSPECTION IT APPEARED AS IF A FEW OF THE OTHER LETTERS WERE CRACKING AT THE EDGE OF THE LETTERS ON THE SIDEWALL.  THIS APPEARS TO BE A MANUFACTURING FLAW AND NOT A CUT OR SOME ROAD DEBRIS.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/21/2007",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191372,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA COROLLA.  THE FAILURE MILEAGE WAS 48000 AND THE CURRENT MILEAGE WAS 49000.  THE CANISTER FILTER WILL HAVE TO BE REPLACED.  THE VEHICLE CONTINUES TO RUN NORMAL.",
        "vin": "2T1BR12E61C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/09/2007",
        "dateOfIncident": "04/23/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190234,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OWN COROLLA 2001 WITH 45,000 MILES, ENGINE LIGHT ON. I TOOK IT FOR DIAGNOSTIC, IT WAS CHARCOAL CANISTER. EXTENDED WARRANTY DID  NOT COVER PART & LABOR. SEARCHING IN THE NET ME MANY SAME MODEL OWNERS WITH EXACT SAME PROBLEM. TOYOTA IS DEFINITELY  IGNORED THIS ISSUE WHILE SELLING THE CARE. AWARE THAT AFTER 35,000 MILES  THE PART MUST BE REPLACED. LABOR AND PART EVERYWHERE OVER $400.*AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/27/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA SEQUOIA.  THE CONTACT STATED THAT THE WELDING ON THE SEAT FRAME OF THE MIDDLE ROW DETACHED AND CAUSED THE SEAT TO SWIVEL AND MOVE.  THE DEALER INSPECTED THE VEHICLE AND PERFORMED THE REPAIR,  BUT WAS UNABLE TO DETERMINE THE CAUSE OF FAILURE.  THE CURRENT MILEAGE IS 109,000 AND FAILURE MILEAGE WAS UNKNOWN.*AK",
        "vin": "5TDBT44A21S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/16/2007",
        "dateOfIncident": "08/14/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188069,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HAVING A PROBLEM WITH MY TOYOTA COROLLA 2001.    I DO NOT KNOW WERE THE ENGINE OIL GOES, I HAVE THE OIL CHANGED EVERY 3000 MILES BUT WHEN I CHECK THE OIL DIP STICK THERE IS NO OIL AND THEN THE OIL LAMP COMES ON.    I CHECK FOR LEAKS AND MY CAR DOES NOT LEAK OIL..   THE VEHICLE WAS CHECKED BY THE DEALER AND THEY SAID NOTHING WAS WRONG WITH IT BUT I STILL GET THE CHECK OIL LAMP IN DASHBOARD.    WHERE DOES THE OIL GO?  *JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/16/2007",
        "dateOfIncident": "07/15/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182745,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR DOOR HANDLES: IN OCTOBER OF 2002, THE FRONT DRIVER-SIDE INTERIOR DOOR HANDLE BROKE (THE SPRING INSIDE THE DOOR HANDLE BROKE THROUGH THE PLASTIC), AND HAD TO BE REPLACED. THE FRONT PASSENGER-SIDE INTERIOR DOOR HANDLE BROKE. ABOUT A WEEK LATER THE DRIVER'S SIDE BACK SEAR DOOR HANDLE BROKE AS WELL. BOTH,  DURING NORMAL USAGE OF OPENING THE DOOR.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/16/2007",
        "dateOfIncident": "08/15/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182746,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD IS SHOWING CHECK ENGINE LIGHT.  THE DEALER TOLD ME THAT THE CHARCOAL CANISTER AND VSV HAVE TO BE REPLACED.   I FEEL TOYOTA 800-331-4331, IS AWARE OF THE PROBLEM WITH THIS CANISTER AND IS DELIBERATELY IGNORING INSTEAD OF RECALL OR FREE PARTS AND LABOR. I FOUND A SIMILAR KIND OF ISSUES RAISED BY OTHER COROLLA OWNERS ON THE NET. PLEASE DO THE NECESSARY INVESTIGATION IN THIS MATTER.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/04/2007",
        "dateOfIncident": "12/15/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177752,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT OF MY 2001 TOYOTA COROLLA LE REPEATEDLY COMES ON.  WHEN CHECKED IT STATES THERE'S AN PROBLEM WITH THE O2 SENSORS OR CONVERTER SYSTEM.  I HAVE HAD THESE REPLACED SEVERAL TIMES.  I AM TOLD OTHER YEARS OF THE TOYOTA COROLLA HAVE BEEN RECALLED FOR THIS PROBLEM.  SEVERAL MECHANICS HAVE STATED THE SENSORS ARE TOO CLOSE TOGETHER AND THUS THE CHECK ENGINE LIGHT GETS TRIGGERED ON.  I HAVE SPENT THOUSANDS OF DOLLARS REPLACING BOTH O2 SENSORS THREE TIMES, AND THE CONVERTER AT LEAST TWICE AND THE CHECK ENGINE LIGHT STILL COMES ON WITH THE SAME CODES FOR THESE SAME ISSUES. *JB",
        "vin": "1NXBR12E91Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2006",
        "dateOfIncident": "11/08/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173378,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2001 TOYOTA COROLLA LE WITH ABOUT 60,000 MILES, MY CHECK ENGINE LIGHT CAME ON. I HAD MY MECHANIC RUN THE OBD CODE, WHICH RETURNED THE CODE OF P0446 (EVAPORATIVE EMISSION CONTROL SYSTEM VENT CONTROL CIRCUIT). MY MECHANIC DETERMINED THE PROBLEM WAS WITH THE CHARCOAL CANNISTER SYSTEM THAT CONTROLS THE EMISSIONS OF THE COROLLA. I RESEARCHED THIS ISSUE ONLINE AND FOUND THAT MANY COROLLA OWNERS HAVE EXPERIENCED THE SAME SITUATION. THE REPAIR OF THIS PART ON MY COROLLA TOTALLED ABOUT $640 AND I FEEL THAT TOYOTA NEEDS TO CORRECT THIS ISSUE AS IT BEING REPORTED BY SEVERAL INDIVIDUALS OWNING COROLLA'S (AND OTHER MODELS OF TOYOTA). MY HOPE IS THAT TOYOTA WILL BE REQUIRED TO REIMBURSE THE COST OF REPAIRING THIS PART DUE TO THE LACK OF ATTENTION GIVEN TO A MALFUNCTIONING SYSTEM.  *NM",
        "vin": "2T1BR12E11C"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "08/25/2006",
        "dateOfIncident": "08/25/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166543,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Britax Child Safety, Inc.",
                "productMake": "BRITAX",
                "productModel": "BRITAX",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE LOCKS ON EACH SIDE OF THE CHILD SAFETY SEAT WERE NOT SECURE.   THE BELT THAT WAS THREADED THROUGH THE LOCKS BECAME LOOSE AND WAS FREE TO MOVE AROUND.   THE SEAT WAS BRITAX, MODEL # E9L06-D5.  THE MANUFACTURER DATE WAS 7-13-06. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/15/2006",
        "dateOfIncident": "08/13/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165550,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE HAD FAULTY EQUIPMENT WHICH CAUSED ENGINE OIL TO LEAK.  THE OIL LIGHT NEVER ILLUMINATED WHICH RESULTED IN THE ENGINE DYING AND THE VEHICLE NEEDING A NEW ENGINE.  THE VEHICLE WAS NOT TAKEN TO A SERVICE DEALER.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/07/2006",
        "dateOfIncident": "06/15/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161776,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A COROLLA 2001, 65K MILES ON IT TODAY.  AT 56K MILES, ENGINE LIGHT CAME ON, STARTED MISFIRING, TOOK TO TOYOTA DEALERSHIP, CHANGED OUT POINTS AND PLUS.  ENGINE LIGHT CAME BACK ON, DEALERSHIP PERFORMED \"INDUCTION\" THROUGH ENGINE.  ENGINE LIGHT CAME BACK ON.  DEALERSHIP COULD NOT FIND CAUSE BECAUSE COMPUTER READINGS VAGUE; GOT FRUSTRATED AND TOOK CAR TO INDEPENDENT MECHANIC SHOP THAT SPECIALIZES IN FOREIGN CARS; THEY DETERMINED IT WAS A COIL.  REPLACED COIL.  CAR STARTED BURNING OIL PROFUSELY (1 QUART A WEEK IN IN-TOWN DRIVING).  NOW SAME SHOP HAS DETERMINED THAT THE HEAD GASKET ON ENGINE NEEDS REPLACED.  (CAR HAS 65K MILES).  CAR IS SCHEDULED TO GO IN FOR A COMPLETE ENGINE TEAR-DOWN AND HEAD GASKET REPAIR/REPLACEMENT AT A COST OF $1500-$1600.  THIS 01 COROLLA IS THE 5TH TOYOTA AUTO I HAVE OWNED AND I HAVE HAD AN SUPERIOR EXPERIENCE WITH ALL -- EXCEPT THE 2001 COROLLA WHICH I BROUGHT BRAND NEW FROM A TOYOTA CAR LOT.",
        "vin": "2TLBRL2E51C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/27/2006",
        "dateOfIncident": "04/19/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156210,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE CHECK ENGINE LIGHT ILLUMINATED WHEN THE ENGINE WAS STARTED.  THE VEHICLE WAS TAKEN TO THE DEALER WHO DETERMINED THE CATALYTIC CONVERTER NEEDED TO BE REPLACED.",
        "vin": "2T1BR12E91C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/11/2006",
        "dateOfIncident": "10/09/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147411,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING AT A NORMAL HIGHWAY SPEED THE STEERING WHEEL SUDDENLY BECAME DIFFICULT TO MANEUVER. THERE WAS NO WARNING PRIOR TO THE INCIDENT. THE CONTACT TOOK THE VEHICLE TO TWO INDEPENDENT REPAIR SHOPS,  AND BOTH DETERMINED THE RACK AND PINION STEERING  WORE OUT AND NEEDED TO BE REPLACED. *AK  UPDATED 2/7/2006 - *NM",
        "vin": "1NXBR12E81Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2005",
        "dateOfIncident": "11/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141650,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATES  VEHICLE HAD A DEFECTIVE CLUTCH.  THE CLUTCH HAS REPEATEDLY MALFUNCTIONED.  HE CONTACTED THE DEALERSHIP.  THE DEALERSHIP  REPLACED THE CLUTCH TWICE WITHIN THREE YEARS.  ALSO,  CONTACTED THE MANUFACTURER, AND THEY DID NOT OFFER ANY ASSISTANCE.  NO FURTHER CORRECTIONS HAVE BEEN MADE AT THIS TIME. *AK",
        "vin": "2T1CF22P11C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/07/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139002,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONTACTS STATED THE CHECK ENGINE LIGHT CAME ON  AUGUST 1, 2005, CONSUMER  TOOK  THE VEHICLE TO AN INDEPENDENT MECHANIC, AND THEY REPLACED TWO DIFFERENT OXYGEN SENSORS. NOW, THE LIGHT CAME BACK ON AGAIN AND  STAYED ON.  TOOK THE VEHICLE BACK TO THE INDEPENDENT MECHANIC, THEY PUT IN NEW SPARK PLUGS.  THEY SAID IT COULD BE A LOT OF THINGS.  IT HAD STAYED OFF A FEW DAYS.  HOWEVER, THE CHECK ENGINE LIGHT STAYED ON AND CONSUMER WAS TAKING THE VEHICLE TO THE INDEPENDENT FOR THE FOURTH TIME. THE TOYOTA DEALER HAD NOT CHECKED THE VEHICLE. *AK",
        "vin": "1NXBR12E21Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/20/2005",
        "dateOfIncident": "09/19/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137135,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE BLOWOUT.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/12/2005",
        "dateOfIncident": "09/11/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10136181,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO ACCIDENT WHERE CAR WAS TOTALED AND AIR BAG DID NOT DEPLOY.  *JB",
        "vin": "1NXBR12E91Z"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "05/15/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132230,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE DASHBOARD HAS A BLACK BACKGROUND AND THE LETTERS ARE RED,   AND WITH CERTAIN LIGHTING IT IS  ALMOST IMPOSSIBLE TO READ.  CAN'T SEE QUICKLY.  HAS TO CONCENTRATE  AND STUDY, WHICH TAKES THE CONSUMER'S  EYES OFF THE ROAD. CONTACTED TOYOTA, THEY CAN'T DO ANYTHING ABOUT IT.  HOWEVER, ON  2005 MODELS THEY HAVE CHANGED IT BACK TO WHITE.*AK  *JB",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "08/06/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10133854,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON STRAIGHT HIGHWAY APPROX 60 MPH WITH CRUISE ON - LET RIGHT FRONT TIRE DRIFT OFF EDGE OF PAVEMENT.  RIGHT FRONT TIE ROD BROKE RESULTING IN LOSING CONTROL AND CRASHING.  CAR TOTALED.  SUFFERED SEVERE BRUISING.",
        "vin": "1NXBR12E81Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "02/10/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127148,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE VEHICLE WAS ONLY ABLE TO HOLD ONE OR TWO GALLONS OF GAS AT A TIME.  THE CONSUMER CALLED THE ATTENDANT, WHO TOLD HER THAT THERE WAS A PROBLEM WITH GAS TANK. THE CONSUMER TOOK THE VEHICLE TO THE DEALER, WHO COULDN'T FIND A PROBLEM. THE DEALER REPRESENTATIVE WENT WITH OWNER TO THE GAS STATION, AND SAW THE SAME PROBLEM. AFTER USING THE REST OF THE GAS THE CAR WAS RETURNED TO THE DEALER. THE CARBON CANISTER HAD TO BE REPLACED. THE REPAIR WAS DONE AT THE DEALER. THE COST WAS $585. THE OWNER WROTE A LETTER TO TOYOTA, AND ASKED FOR THE OLD CANISTER FROM THE DEALER, AND THE THEY REPORTED THAT IT WAS A DEFECT IN THE GAS TANK. OWNER NOW HAS THE OLD CANISTER. TOYOTA ASKED FOR A COPY OF BILL, AND OWNER SENT ONE.  SHE CONTACTED THEM AGAIN AND THEY ASKED FOR THE COMPLAINT LETTER AGAIN AND A COPY OF BILL AGAIN. THE OWNER IS UPSET BECAUSE SHE HAD TO PAY FOR A PART TO BE REPAIRED THAT WAS A DEFECTIVE PART. OWNER WAS CONCERNED THAT THIS  WAS A SAFETY SITUATION. BECAUSE IF SHE RAN OUT OF GAS FAR AWAY FROM A GAS STATION, AND SHE WAS BY HERSELF.  THIS WAS A SAFETY HAZARD.*AK",
        "vin": "1NXBR12E8YZ"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/07/2005",
        "dateOfIncident": "06/22/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127810,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED VEHICLE FROM KEYES TOYOTA ONE YEAR AGO.  IT WAS ADVERTISED CERTIFIED, HOWEVER WHEN I BOUGHT THE CAR THEY WOULD NOT HONOR IT.  I HAVE BEEN BACK AND FORTH TO THE DEALERSHIP WITH REPAIRS.  RECENTLY THE CHECK ENGINE LIGHT CAME ON AND I SPENT OVER $700 REPLACING THE 02 SENSORS AND FLUSHING MY BRAKES.  THIS DID NOT FIX THE PROBLEM AND I HAVE TO SPEND ANOTHER $4-$500 REPLACING THE AIR FLOW METER.  THE MECHANIC TOLD ME THAT THESE PROBLEM SHOULD NOT BE HAPPENING TO SUCH A YOUNG CAR.",
        "vin": "1NXBR12E71Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/25/2005",
        "dateOfIncident": "04/25/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118365,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WASENT RUNNING CORRECTLY FOR THE PAST FEW DAYS, CHECK ENGINE LIGHT CAME ON.  VEHICLE WAS BROUGHT TO IRA TOYOTA IN TEWKSBURY, MA TOYOTA CALLED ME BACK STATING IT NEEDED A CHARCOAL CANISTER.  VEHICLE HAS 40,000 MILES... JUST 4,000 MILES OUT OF WARRANTY, I CALLED TOYOTA HEADQUARTER'S THEY DID NOT HELP, ALSO MELINDA ROSSO FROM IRA TOYOTA OF TEWKSBURY DECLINED TO HELP US AS LOYAL TOYOTA CUSTOMERS. TOTAL BILL WAS NEAR 450.00 US.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/20/2005",
        "dateOfIncident": "02/17/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111852,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE TRAVELING FROM TX TO SC USING CRUISE CONTROL (CC) ON MY 2001 TOYOTA COROLLA LE.  HEAT WAS NOTED ON THE CC SWITCH ON 2/16/05.  ON 2/17/2005 THE CRUISE CONTROL WAS ENGAGED AT 75 MPH.  THE CC FAILED TO DISENGAGE WHEN BRAKES WERE APPLIED; CC FAILED TO DISENGAGE AT THE SWITCH.  THE ACCELERATION WOULD NOT STOP DESPITE BRAKE APPLICATION.  THE TRANSMISSION SELECTOR WAS PUT INTO NEUTRAL AND THE CAR WAS  STOPPED WITH FOOT AND EMERGENCY BRAKES THE ENGINE CONTINUED TO RACE AT HIGH RPMS UNTIL THE ENGINE WAS TURNED OFF.  AN I-10 ALABAMA LAW ENFORCEMENT AGENT DISABLED THE CC BY REMOVING THE CC FUSE DISCONNECTING SOMETHING AT THE THROTTLE BODY.  THIS INCIDENT NEARLY CAUSED A HIGH SPEED COLLISION.  THE COROLLA 1NXBR12E5Z534307 WILL BE SERVICED AT THE TOYOTA DEALERSHIP IN FLORENCE, SC.",
        "vin": "1NXBR12E51Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2004",
        "dateOfIncident": "12/13/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103808,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GEARS TEND TO POP FROM DRIVE TO NEUTRAL, CAUSING THE VEHICLE TO JUMP FORWARD, ALMOST HITTING THE VEHICLE IN FRONT. CONSUMER WILL TAKE THE VEHICLE  TO DEALER FOR CHECK UP.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "12/02/2004",
        "dateOfIncident": "11/27/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10100972,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE 22 EAST ON NOV 27 '04 930 AM. ABOUT 6 SECONDS BEFORE I CHANGED LANES, THEIR WAS A 3 SECOND  THEIR WAS A SPRINKLE OF RAIN. I CHANGED LANES AND NOTICED A STOPED CAR ABOUT 330 FEET IN FRONT OF ME, WHILE TRAVELING AT 60. I APLIED MY FOOT ON THE BRAKE AND I SLID WITH BRAKES LOCKED. I THEN REPRESSED THE BRAKES AND AGAIN SLID WITH BRAKES LOCKED. I THEN REMOVED THE PRESSURE AND NOTICED THAT THE BRAKES DIDN'T UNLOCK. I THEN APLIED AND REMOVED MY PRESSURE TRYING TO UNLOCK THE BRAKES, BEFORE HITTING THE CAR.  MY CAR IS SITTING WAITING FOR REPAIR.",
        "vin": "1NXBR12E11Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/25/2004",
        "dateOfIncident": "09/06/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097608,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "GOODYEAR",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHEN DRIVING TIRE WENT FLAT.  CONSUMER PULLED OVER, AND CHANGED THE TIRE. DEALERSHIP INFORMED THE CONSUMER THAT THE TIRE WORE  OUT FROM THE INSIDE WHICH CAUSED IT TO GO FLAT. GOODYEAR, P185/65R14.  *AK",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/16/2004",
        "dateOfIncident": "08/31/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091135,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME UP ON 8/31/04. COULD NOT DRIVE. TOOK IT TO DEALER. DIAGNOSED AS CHARCOAL CANISTER PROBLEM. PAID ABOUT $460 (PARTS AND LABOR) TO FIX THIS PROBLEM.  *JB",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2004",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092195,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN AN INCLINE, THE VEHICLE SUDDENLY ACCELERATED.  *JB  THE VEHICLE WAS TAKEN TO THE DEALER BUT THEY WERE UNABLE DETERMINE THE CAUSE.  *NM",
        "vin": "2T1BR12E21C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/01/2004",
        "dateOfIncident": "05/07/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10083117,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1.   V1(OTHER PARTY)  WAS EASTBOUND ON U.S. HWY 80 TURNING NORTH INTO WALMART PARKING LOT. V2 (MYSELF) WAS WESTBOUND ON U.S. HWY 80 GOING THROUGH THE INTERSECTION OF U.S. 80 AND BELVEDERE DR.,V2 (MYSELF) THEN COLIDED WITH WITH THE PASSENGER SIDE OF V1(OTHER PARTY) WHO FAILED TO YIELD A RIGHT OF WAY.V1 AND V2 CAME TO FINAL REST APPROXIMATLY 3 FT NORTH OF INITIAL IMPACT.MY ESTIMATED SPEED BEFORE IMPACT WAS 45 MPH AND HAD ONLY SECONDS TO HIT THE BRAKES. MY CAR SUFFERED SEVERE FRONTAL DAMAGE .  2. THE DRIVER OR PASSENGER AIRBAGS IN MY CAR DID NOT DEPLOY LEADING TO UNECESSARY INJURY TO THE DRIVER(MYSELF) AND SEVERE INJURY TO THE PASSENGER(MY MOTHER).  3. NOTHING WAS DONE TO CORRECT THE FAILURE .  *AK",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/09/2004",
        "dateOfIncident": "05/07/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068530,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING REGARDING AN ISSUE WITH MY 2001 TOYOTA COROLLA. I RECENTLY HAD MY CHECK ENGINE LIGHT COME ON. I NEED TO REPLACE AN EMISSIONS CONTROL DEVICE IN MY CAR, A CHARCOAL CANISTER DUE TO IT BEING CLOGGED OR MAYBE A VACUUM LEAK.  *AK  I AM CONCERNED THAT THIS MAY BE A WIDE-SPREAD PROBLEM BECAUSE ON THE DAY THAT I HAD MY CAR FOR AN ESTIMATE, I MET ANOTHER PERSON AT THE TOYOTA SERVICE STATION WITH THE SAME ISSUE AND WHO ALSO HAD A 2002 TOYOTA COROLLA. HOWEVER, FORTUNATELY FOR HER SHE WAS STILL UNDER WARRANTY SO SHE DID NOT HAVE TO PAY FOR THE REPAIR. THE WARRANTY FOR THIS PART IS 3 YEARS OR 36,000 MILES. UNFORTUNATELY FOR ME, I WAS AT THE 42,000 MARK ON MILEAGE AND SO I WAS OUT OF WARRANTY.          MY CONCERN IS HOW MANY CLOGGED CHARCOAL CANISTERS HAD TO BE REPLACED IN THE 1998-2002 MODEL OF A TOYOTA COROLLA. A FRIEND OF MINE DID CONTACT THE U. S. DEPARTMENT OF TRANSPORTATION, NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION AND FILED A REPORT REGARDING THE FAILURE ON THIS PART AND HOPE THAT OTHERS WOULD DO THE SAME. DO I AM DOING TI AS WELL. OVERALL,  I ALSO FEEL THAT AN EMISSIONS CONTROL DEVICE SHOULD LAST LONGER THAN JUST TWO YEARS. MY FAMILY HAS OWNED SEVERAL DIFFERENT MODELS OF TOYOTA AUTOMOBILES OVER THE PAST 15 YEARS AND WE HAVE NEVER HAD TO REPLACE SUCH A DEVICE. THE TOYOTA COROLLA MODEL, BEING A MODEST CAR, SHOULD NOT REQUIRE TO REPLACE A $300 PART EVERY TWO YEARS THAT IS NEEDED TO KEEP OUR ENVIRONMENT CLEAN.  I READ SOMEHWRE THAT WARRANTY ON EMISIIONS ARE 80,000 IS THIS CORRECT?",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/22/2004",
        "dateOfIncident": "04/16/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A NEW TOYOTA COROLLA IN SEPT  2001 AND IT HAS APPROX 32000 MILES TILL NOW.  IT WAS ALWAYS SERVICED AT THE TOYOTA DEALER. I GOT MY 30000 MILES SERVICING DONE IN SEPT 2003 AND SINCE THEN WE WERE NOT USING THE CAR MUCH.  IN APRIL 2004 SUDDENLY THE DASHBOARD WAS SHOWING CHECK ENGINE LIGHT.  I THOUGHT IT WAS  7 MONTHS THAT I GOT SERVICED(ALTHOUGH I TRAVELLED LESS THEN 2000MILES DURING THIS PERIOD) AND IT NEEDS SIMPLE OIL CHANGE AND TOOK THE CAR TO THE DEALER.  THE DEALER TOLD ME THAT THE CHARCOAL CANISTER AND VSV HAVE TO BE REPLACED.  ALTHOUGH I MISSED THE 36 MONTHS WARRANTY MY CAR WAS STILL UNDER 36000 MILES.  THE DEALER DIDNT CONSIDER MY REQUEST FOR A FREE REPLACEMENT AND WAS ASKING ME TO PAY APPROX. 700 $ FOR PARTS AND LABOR.  BUT WHEN I CALLED COUPLE OF OTHER DEALERS THEY TOLD IT IS VERY UNCOMMON TO HAVE CHARCOAL CANISTER REPLACED SO SOON.    WHEN I CALLED TOYOTA CUSTOMER SERVICE 800-331-4331, THEY AGREED TO REPLACE THE PART BUT STILL THE DEALER IS CHARGING ME 200 $ FOR LABOR.  I FEEL TOYOTA IS AWARE OF THE PROBLEM WITH THIS CANISTER AND IS DELIBERATELY IGNORING INSTEAD OF RECALL OR FREE PARTS AND LABOR.  I FOUND A SIMILIAR KIND OF ISSUES RAISED BY OTHER COROLLA OWNERS ON THE NET.  PLEASE DO THE NECESSARY INVESTIGATION IN THIS MATTER.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2004",
        "dateOfIncident": "01/23/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062671,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOP OF MY STEERING WHEEL IS DETERIORATING.  I ONLY CLEAN THE INTERIOR WITH WINDEX.  NOTHING ELSE IS \"BREAKING DOWN\" BUT THE TOP OF THE STEERING WHEEL.  THE MANUFACTURER REFERRED MY EMAIL TO THE LOCAL TOYOTA DEALER.  THE TOYOTA DEALER JUST SAID IT WASN'T COVERED. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2004",
        "dateOfIncident": "01/04/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060850,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA COROLLA - REGARDING SUDDEN SURGE. I HAVE NOTICED ON MANY OCCASIONS THAT MY COROLLA WILL SURGE FORWARD(FROM A STOP). I JUST EQUATED IT WITH THE DEFROSTER TURNING ON(AC PUMP). MAYBE THERE IS MORE TO IT?",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "12/15/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068753,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION FUSE IS ALL THEY CAN GUESS.  I WIGGLE THE FUSE WHEN THE CAR WON'T FIRE AND IT WORKS EVERY TIME.  SINCE THEY CANNOT DUPLICATE THE PROBLEM AT THE DEALERSHIP THEY ARE AT A LOSS AS TO HOW TO HELP ON A NEW CAR.  RIGHT?!",
        "vin": "1NXBR12E01Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069481,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO ENGINE SLUDGE, THE ENGINE WAS NOT LUBRICATED ENOUGH TO KEEP THE SEALS INTACT.  NOW OIL IS GETTING INTO THE SPARK PLUGS CAUSING MISFIRE.  DIAGNOSTICS RESULTED IN A TOTAL ENGINE REPLACEMENT (ENGINE COST NOT INCLUDING LABOR) $5,000.00.  TOYOTA SHOULD COVER THIS, THE RENTAL CAR NEEDED IN THE INTERIM, AND EXTEND THE WARRANTEE TO 120,000 MI COVERING SIMILAR REPEATED PROBLEMS, AS IT IS A MANUFACTURER DEFECT.",
        "vin": "2T1BR12E01C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/11/2004",
        "dateOfIncident": "03/16/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052838,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKING SYSTEM. HAD TO REPLACE FRONT BRAKE PADS AT 25600 AND 42200 MILES. REAR PADS DO NOT SEEM TO BE WEARING AT ALL, INDICATING PROPORTION VALVE PROBLEM OR POOR DESIGN. TOYOTA DEALER JUST SHRUGS SHOULDERS.*AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/03/2003",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045336,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE GRADUALLY BECAME  LESS RESPONSIVE TO DEPRESSION OF THE ACCELERATOR OVER A PERIOD OF A COUPLE MONTHS AND HAS NOW DIED SEVERAL TIMES.  IT WAS NOT NOTICEABLE AT FIRST TO THE USUAL DRIVER OF THE VEHICLE BUT WAS IMMEDIATELY NOTICED BY ANOTHER DRIVER.  THE VEHICLE WAS TAKEN TO A DEALER AND THEY DID NOT TRY VERY HARD TO FIX THE PROBLEM.  IT'S CURRENTLY, AND HAS BEEN FOR 2 MONTHS NOW, AT A SHOP BUT  STILL CANNOT DETERMINE THE PROBLEM.  IT IS UNSAFE IN MY OPINION TO DRIVE IN THE CITY BECAUSE OF STOP AND GO CONDITIONS AND HIGHWAY ON-RAMP NECESSITIES.  *LA",
        "vin": "1NXBR12E11Z"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2003",
        "dateOfIncident": "09/29/2003",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65 MPH ON THE HIGHWAY, THE CONSUMER HEARD A  NOISE COMING FROM UNDER THE VEHICLE.  THE CONSUMER PULLED TO THE SHOULDER WHERE BLACK SMOKE HAD BILLOWED FROM UNDER THE HOOD.  THE FIRE QUICKLY CONSUMED THE FRONT END OF THE VEHICLE.  THE INSURANCE COMPANY HAD BEEN INVESTIGATING THE INCIDENT.   *AK   *SCC   *JB",
        "vin": "1NXBR12E01Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037759,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 55/65 MPH THE DRIVER WAS  SUDDENLY  UNABLE TO CHANGE GEARS. IT WA SDETERMINED THAT THE STANDARD CLUTCH FAILED WITHOUT WARNING.  *AK",
        "vin": "2T1BR12E81C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/08/2003",
        "dateOfIncident": "12/31/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025643,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION FUSE ISSUES.  DEALERSHIP HAS TRIED AND TRIED AND CANNOT DUPLICATE OR CORRECT PROBLEM WITH STARTING VEHICLE.*AK",
        "vin": "1NXBR12E01Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2003",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026367,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CONTINUALLY ON   THE INSTRUMENTAL PANEL. DEALER REPLACED THE ENVIRONMENT MODULE, AND PROBLEM STILL  RECURRING. *AK",
        "vin": "1NXBR12E11Z"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "05/27/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021627,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE STEERING WHEEL WANDERED FROM LEFT TO RIGHT ESPECIALLY ON WINDY DAYS.   *NLM.  *AK   STEERING RACK WAS FASTENED TO LIGHT METAL INSTEAD OF THE FRAME OR SUBFRAME, CONSEQUENTLY WHEN THE CAR FLEXED DUE TO ROAD IRREGULARITIES OR SLOPE, TRUCKS PASSING OR CROSS WINDS A STEERING CORRECTION HAD TO BE MADE BY THE DRIVER.    *TT.  THE CONSUMER ALSO A 1998 COROLLA WHICH EXPERIENCED THE SAME PROBLEM.   *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/09/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022645,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SYSTEM HAS A FAILURE THAT CAUSES  VEHICLE TO CONTINUOUSLY PULL TO THE RIGHT OR LEFT WHILE DRIVING.*AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/07/2003",
        "dateOfIncident": "05/24/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021213,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR DOOR HANDLES: IN OCTOBER OF 2002, THE FRONT DRIVER-SIDE INTERIOR DOOR HANDLE BROKE (THE SPRING INSIDE THE DOOR HANDLE BROKE THROUGH THE PLASTIC), AND HAD TO BE REPLACED.  IN MAY OF 2003, THE FRONT PASSENGER-SIDE INTERIOR DOOR HANDLE BROKE (THE PLASTIC MOLDING AROUND THE DOOR HANDLE BROKE), THIS ALSO HAD TO BE REPLACED.  BOTH DOOR HANDLES BROKE DURING NORMAL USAGE OF OPENING THE DOOR.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2003",
        "dateOfIncident": "05/23/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020913,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 01 TOYOTA COROLLA \"S\" SERIES.  WHEN AIR CONDITIONER WAS ON AND  OUTSIDE VERY HOT ENGINE STALLED,ENGNE LIGHT CAME ON.  TOOK INTO THE DEALERSHIP, FOUND THAT THERE WAS A RANDOM MISFIRE OF THE FUEL INJECTORS.WOULD COST $1000 TO FIX. COULD NOT CONFIRM IF THAT  TRUELY WAS THE PROBLEM.THEY COULD NOT  RECREATE THE PRBLEM,BU IT CONTINUED TO REOCCUR.DEALERSHIP DID NOT KNOW THE CAUSE.VEHICLE WAS THREE YEARS OLD AND HAD MAINTAINED SERVICE. COROLLA BULLETIN INDICATED THAT  THAT IN  2000 HAD TO REPLACE INJECTORS DUE TO A MANUFACTURER'S DEFECT.  *AK",
        "vin": "1NXBR12E81Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/05/2003",
        "dateOfIncident": "05/05/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018171,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS AT AN IDLE IN THE PARK  GEAR THE ENTIRE VEHICLE SHAKES SEVERELY.",
        "vin": "2T1BR12E11C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/29/2003",
        "dateOfIncident": "04/19/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017775,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55 MPH THE VEHICLE HIT A BARRICADE WALL YET THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS ALSO IN A SIMILAR ACCIDENT WHEN THE VEHICLE WAS FIRST PURCHASED AND THE AIR BAGS DID NOT DEPLOY.   *NLM",
        "vin": "1NXBR12E21Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/31/2003",
        "dateOfIncident": "09/27/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003921,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAGS DID NOT DEPLOY ON IMPACT.  THE CONSUMER REQUEST A REFUND FROM THE DEALER.  SCC",
        "vin": "2T1BR12E610"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/03/2002",
        "dateOfIncident": "11/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE ENGINE WILL MISFIRE.  CONSUMER TOOK VEHICLE INTO THE DEALERSHIP TO HAVE CHECKED.  THE DEALERSHIP REPLACED SEVERAL ENGINE PARTS. THE PROBLEM REACCURED, NOW THE DEALERSHIP IS REPLACING THE ENGINE.  PLEASE PROVIDE DETAILS. TS",
        "vin": "PLEASE FILL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 568213,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL SHAKES WHEN GOING 60 MPH.  WHEN VEHICLE WAS TAKEN IN FOR INSPECTION OF THIS DEFECT IT WAS FOUND THAT THE RIGHT FRONT TIRE WAS CHOPPED AND THE OTHERS HAD TREAD WHICH WAS WORN.  THIS CAUSED THE VEHICLE TO SHAKE.  ALL 4 TIRES WERE REPLACED.  (P175 65 R14 AMERI* G4S 81S BSW) *JG        *JB",
        "vin": "2T1BR12E11C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2002",
        "dateOfIncident": "03/31/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 769086,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN DRIVING NORTH ON THE MAINE TURNPIKE WITH MY CRUISE CONTROL ON. IT WAS A CLEAR NIGHT AND THE ROADS WERE DRY.   AS I APPROACHED THE TOLL BOTH I TRIED TO TURN MY CRUISE CONTROL OFF, THE CAR DID NOT RESPOND.  I THEN TURNED THE CRUISE CONTROL SYSTEM OFF AND THE CAR WAS STILL NOT RESPONDING.  I HIT THE BRAKES AND WAS STILL UNABLE TO SLOW THE CAR DOWN. I THEN PUT THE CAR IN NEUTRAL AND SLAMMED ON THE BRAKES AND WAS STILL UNABLE TO GET THE CAR TO RESPOND.   AT THAT POINT I WAS TOO CLOSE TO THE TOLL BOTH TO TRY TO SWITCH LANES AND WAS UNABLE TO STOP THE CAR AND HIT THE CAR IN THE TOLL PLAZA IN FRONT OF ME.  AFTER THE IMPACT, THE CAR EVENTUALLY COASTED TO A STOP.   UNTIL THIS HAPPENED, I HAD NO PROBLEM WITH ANYTHING ON THE CAR. THE CAR HAS NOT BEEN USED SINCE THE ACCIDENT, IN FACT HAS NOT BEEN REPAIRED UNTIL NOW.  THERE WERE SOME INJURIES IN THIS CASE. I HAVE A SHOULDER INJURY, WHICH I AM STILL TRING TO GET RESOLVED. I WANT THE INCIDENT TO BE REPORTED DUE TO THE SERIOUSNESS OF BEING UNABLE TO DISENGAGE THE CRUISE CONTROL SYSTEM.  AN ACCIDENT REPORT WAS FILED WITH THE MAINE STATE POLICE BUREAU OF MOTOR VEHICLES ACCIDENT SECTION.  DT",
        "vin": "2T1BR1SE91C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/23/2002",
        "dateOfIncident": "10/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021446,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY WHEN HE APPLY HIS HIGHBEAM THE LAMPS SEAM BEAM THE REFRACTION .  CAUSING A PROBLEM SEEING AND A DISTRACTION.  THE DEALERSHIP IS AWARE OF THE PROBLEM.    MR",
        "vin": "PLEASE FILL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/23/2002",
        "dateOfIncident": "09/02/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019233,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED, NOTICE A LOUD NOISE COMING FROM THE TIRES. ON A 2003 TOYOTA COROLA. ORIGINAL EQUIPMENT, TIRES SIZE P195/65R15 DOT#W2C6T_ _ _ _ _ (PROVIDE THE REST OF DOT#). DEALER HAS BEEN NOTIFIED. PROVIDE FURTHER INFORMATION.*JB",
        "vin": "1NXBR32E63Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/24/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764668,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRIGHT BEAMS REFLECTED FROM EACH HEADLIGHT FORM AN \"X\" RIGHT IN FRONT OF THE DRIVER'S FIELD OF VIEW WHEN DRIVING IN SNOW OR FOG.  THE BEAMS ARE BRIGHT ENOUGH TO CREATE A REAL DISTRACTION TO THE DRIVER.*AK",
        "vin": "2T1BR12EX1C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "06/06/2002",
        "dateOfIncident": "05/10/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011264,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THEY HAVE OBJECTS IN THE REAR SEAT AND  VEHICLE IS IN PARK, AND THE IF THE SUN IS SHINING THROUGH, IT WILL BURN A HOLE IN  SEAT. CAUSE UNKNOWN. DEALER NOTIFIED.*AK",
        "vin": "NXBR12E91Z5"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/09/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009537,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  STEERING WHEEL STARTED TO ROTATE. CONSUMER TRIED TO STOP IT, AND PUT  VEHICLE BACK INTO CONTROL.  THIS ALSO WAS A RENTAL VEHICLE.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/11/2002",
        "dateOfIncident": "02/20/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8007436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A HEAD ON COLLISION  GOING 40MPH. FRONT AIR BAGS DID NOT DEPLOY WHICH CAUSED SERIOUS FACIAL INJURY TO  CONSUMER.  VEHICLE WAS TOTALED. PLEASE PROVIDE MORE INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/11/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRAVELING DOWN HILL WITH THE DEALER INSTALLED CRUISE CONTROL ON, VEHICLE WILL CHUG AS IF IT IS LOSING POWER OR OUT OF GAS.  ALSO, WHEN IT'S RAINING.   WHEN VEHICLE IS TRAVELING ON AN INCLINE, TIRES WILL SPIN.   CRUISE CONTROL WILL DECELERATE.*AK   CONSUMER STATES HEADLIGHTS ARE ADJUSTED TOO LOW, HESISTATION FEELING WHEN TRAVELING SLIGHTLY DOWN HILL, DEALER ADJUSTED THROTTLE CABLE BUT CONDITION STILL EXSISTS.*YD",
        "vin": "1NXBR12E51Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/25/2002",
        "dateOfIncident": "01/27/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004488,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING UNDER WET CONDITIONS TIRES FEEL LIKE THEY ARE SLIDING INSTEAD OF GRIPPING THE PAVEMENT. VEHICLE DOES NOT SLOW DOWN OR STOP.  *JG  *AK",
        "vin": "1NXBR12E21Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/12/2002",
        "dateOfIncident": "12/21/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003967,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT AND PUT HEADLIGHTS ON HIGH BEAM, LIGHTS POINTS UPWARD. THERE IS A GLARE  ON FRONT OF VEHICLE. *AK  CONSUMER STATES WHILE DRIVING, THE HIGH BEAMS SHOOT UP TOWARDS THE SKY.   *JB",
        "vin": "2T1BR12E31C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "01/24/2002",
        "dateOfIncident": "12/17/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002810,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE WHILE DRIVING 60 MPH; BRAKE PEDAL WAS APPLIED, BUT VEHICLE DID NOT STOP, INSTEAD IT LOST CONTROL AND  WAS INVOLVED IN  A FRONTAL COLLISION. DEALER WAS NOT NOTIFIED AT THIS TIME. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/24/2002",
        "dateOfIncident": "12/17/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002811,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 60 MPH, VEHICLE WAS INVOLVED IN A FRONTAL COLLISION AND NEITHER AIR BAG DEPLOYED. DEALER WAS NOT NOTIFIED AT THIS TIME.*AK",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2001",
        "dateOfIncident": "12/21/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON  HIGHWAY AT 35 MPH  VEHICLE STALLS.  ABLE TO RESTART ENGINE, BUT  VEHICLE WILL NOT MOVE.  VEHICLE WAS TOWED TO  DEALER. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION CONCERNING THIS MATTER.*AK",
        "vin": "1NXBR12E91Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/18/2001",
        "dateOfIncident": "10/08/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 755774,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE. *AK",
        "vin": "2T1BR12E81C"
    },
    {
        "components": "POWER TRAIN,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/10/2001",
        "dateOfIncident": "06/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900653,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING ABOUT 65MPH ON HIGHWAY AND FRONT LEFT TIRE BLEWOUT. SHE HEARD A NOISE, AND WAS ABLE TO PULL OVER TO THE SHOULDERS. GOODYEAR, INTEGRITY, P175/65R14, DOT M68JC9032200.  DEALERSHIP MECHANIC TOLD CONSUMER THAT ALL FOUR TIRES NEEDED TO BE REPLACED.  ALSO, TO REPLACE RIMS. *AK TRANSMISSION FAILED AND REPLACED.   *YH",
        "vin": "2T1BR12E71C"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "11/21/2001",
        "dateOfIncident": "11/18/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 754773,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING ON STRAIGHT SECTION OF ROAD.  REAR DRIVER SIDE AXLE SHEARED IN HALF, CAUSING  VEHICLE TO ROLL OVER.*AK",
        "vin": "2T1BR12E41C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751181,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT HIGH BEAM SHOOT UP INTO THE SKY IN THE DIRECT VISION OF THE DRIVER, DISTRACTING DRIVER, TOYOTA SAYS IT IS A DESIGN DEFECT. *AK",
        "vin": "1NXBR12E81Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/20/2001",
        "dateOfIncident": "07/19/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9003581,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEPPED ON THE BRAKES, BUT THEY FAILED TO STOP, AIRBAG ALSO FAILED, BRAKES FADE TO THE FLOOR, RESULTED IN HITTING ANOTHER VEHICLE.  AIR BAG DID NOT OPEN.",
        "vin": "2T1BR12E01C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/16/2001",
        "dateOfIncident": "07/15/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 748511,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER WAS TRYING TO PARK THE CAR, THUS THE CAR WAS TRAVELLING AT VERY LOW SPEED.  CAR SUDDENLY SURGED AFTER THE DRIVER APPLIED THE BRAKE.  CAR WENT OVER THE CEMENT TIRE STOPPER, UP A SMALL HILL, HIT A WALL, AND STOPPED.  THIS CANNOT POSSIBLY HAVE BEEN CAUSED BY THE DRIVER HITTING THE ACCELERATOR PEDAL.  THIS IS A SERIOUS SAFETY PROBLEM.  WE WILL CONTACT THE DEALER AND THE MANUFACTURER ON JULY 16, 2001.  *AK",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/05/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CURIOUS ABOUT THE INSIDE TRUNK RELEASE ON MY VEHICLE, ONE OF MY FRIENDS SAT IN THE TRUNK TO SEE IF HE COULD GET HIMSELF OUT.  TO OUR SURPRISE, HE COULDN'T BECAUSE THE HANDLE WHICH IS SUPPOSED TO GLOW IN THE DARK DIDN'T BECAUSE IT IS ALMOST NEVER EXPOSED TO NATURAL LIGHT.  I THINK THE GLOW IN THE DARK TRUNK RELEASE HANDLES ARE AN EXCELLENT IDEA AND A STEP IN THE RIGHT DIRECTION BUT WITHOUT A METHOD TO KEEP THEM GLOWING (PERHAPS AN ELECTRIC LIGHT WHICH TURNS ON WHEN THE CAR IS RUNNING), THEY ARE USELESS TO A PERSON TRAPPED INSIDE A TRUNK.  YOU CAN CONTACT ME AT PHS11@CORNELL.EDU. *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/02/2001",
        "dateOfIncident": "06/22/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 891865,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING OUT OF A PARKING SPACE CONSUMER NOTICED A NOISE. DEPRESSED  BRAKES AND  NOISE GOT LOUDER. THEN  VEHICLE ACCLERATED, CAUSING VEHICLE TO RUN INTO WALL.  *AK  CONSUMER STATES THAT THE ACCELERATION TOOK PLACE WHILE SHE WAS SWITCHING INTO DRIVE FROM REVERSE, EVEN THOUGH BRAKE WAS PRESSED, VEHICLE CONTINUED TO MOVE, AIRBAGS DEPLOYED CAUSING THE WINDSHIELD TO BREAK, CONSUMER WAS SLIGHTLY BRUISED AND BUMPED DUE TO DEPLOYMENT OF THE AIRBAGS.   *SLC",
        "vin": "2T1BR12E11C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/28/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 891613,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S VEHICLE WAS TRAVELING ABOUT 55MPH ON AND ANOTHER VEHICLE VEERED INTO IT.   CONSUMER APPLIED   BRAKES, AND  ANTI- LOCK BRAKING SYSTEM DIDN'T KICK IN.  DEALERSHIP  WAS AWARE OF  PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/22/2001",
        "dateOfIncident": "02/07/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 3,
        "numberOfInjuries": 0,
        "odiNumber": 9003041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DID NOT OPEN, DURING THIS ACCIDENT THERE WERE 3 DEATHS.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/01/2001",
        "dateOfIncident": "06/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 746265,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE  BLOW OUT  FROM SIDEWALL.  MANUFACTURER REFUSED TO REPLACE.  CHARGED $70.00 PER TIRE.  *AK (TIRESIZE: 185 65 14)( DOT NUMBER:  TIRE SIZE: 185 65 14 )",
        "vin": "1NXBR12E31Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/08/2001",
        "dateOfIncident": "04/24/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S CAR REAR ENDED ANOTHER DRIVER AT ABOUT 10 MPH, AND NONE OF  FRONTAL  AIRBAGS DEPLOYED, BUT  SENSOR LIGHT CAME ON. *AK",
        "vin": "1NXBR12E61Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/30/2001",
        "dateOfIncident": "04/24/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 887129,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED OUT AND DIED AT HIGHWAY SPEEDS. DEALER HAS INSPECTED  VEHICLE AND DETERMINED THAT THERE WAS A WHOLE IN  OIL PAN. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/25/2001",
        "dateOfIncident": "04/24/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744527,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER DRIVING ON THE INTERSTATE I CAME INTO TOWN GOING 30 MILES PER HOUR WHEN THE CAR SOUNDED LIKE A \"JET ENGINE TAKING OFF\" ALL THE LIGHTS WENT ON THE CAR STARTED JERKING AND DIED.  THE CAR WAS TOWED TO THE DEALER AND THE SERVICE PERSON AT THE DEALERSHIP STATED AN \"UNMOVEABLE OBJECT HAD BEEN HIT CAUSING A HOLE IN THE OIL PAN THUS CAUSING THE ENGINE TO BLOW UP.  THIS WAS CLEARLY A HOLE CREATED BY SOMETHING INSIDE CRASHING THROUGH THE OIL PAN.*AK",
        "vin": "2T1BR12E51C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2001",
        "dateOfIncident": "02/10/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 881932,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE CHECK LIGHT CAME ON. DEALER CHECKED, BUT FOUND NOTHING. ON FEBRUARY 17, 2001 DEALER DIS COVERED THAT  FUEL HOSES HAD BEEN IMPROPERLY ASSEMBLED AT  FACTORY. *AK",
        "vin": "FILL IN"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/28/2001",
        "dateOfIncident": "01/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 881735,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 60MPH ON  HIGHWAY  VEHICLE  CUT OFF, AND  HAD TO BE TOWED TO DEALER.   *AK",
        "vin": "FILL IN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/27/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 741622,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I VISITED SEVERAL TOYOTA DEALERS BECAUSE I AM HELPING A FRIEND IN BYING A NEW COROLLA. DESPITE I ADVISE HER TO INCLUDE THE SAFETY FETAURES: SIDE AIRBAGS AND ABS NO DEALEAR MAKE THEM AVAILABLE IF NOT INCREASING THE LEASE BY 50% (WHILE THE INCREASE IN VALUE IS ABOUT 10%)  AND ASKING TO WAIT 3 MONTHS. MAKING SO PRACTICALLY IMPOSSIBLE TO HAVE THEM.  SOME DEALERS REACHED THE POINT TO SAY THAT THOSE ITEMS ARE NOT AVAILABLE ON THE COROLLA. SUCH A BEHAVIOUR IT IS NOT ACCEPTABLE. CAR MANUFACTURERS ARE SUPPOSED TO PROMOTE THE SENSIBILITY TOWARD SAFETY NOT TO BOYCOTT IT.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/23/2001",
        "dateOfIncident": "01/14/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 741400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN ONE WEEK OF OWNERSHIP, THE VEHICLE STARTED TO BOG DOWN WHEN MAKING A TURN FROM A DEAD STOP. A DAY LATER THE ENGINE LIGHT CAME ON. THE PROBLEM WAS BROUGHT TO THE DEALERS ATTENTION AND THE REPLY WAS THAT; \"WE DON'T KNOW WHAT'S WRONG, WHEN WE FIND OUT WE'LL LET YOU KNOW...UNTIL THEN, BE CAREFUL\"  THAT WAS OVER A MONTH AGO AND I HAVEN'T HEARD ANYTHING FROM THEM. I CALLED TO FIND OUT WHAT WAS GOING ON AND WAS TOLD THAT THEY STILL DIDN'T HAVE A CLUE WHAT WAS WRONG. THE VEHICLE IS UNPREDICTABLE WHEN TAKING OFF AND HAS ALREADY RESULTED IN A COUPLE OF CLOSE CALLS WHEN PULLING OUT INTO TRAFFIC. THE GENERAL ATTITUDE IS NONCHALANT AND NOBODY HAS MADE ANY ATTEMPT TO NOTIFY ME OF ANYTHING. FROM WHAT I WAS TOLD BY THE DEALERSHIP. ALL THE 2001 HIGHLANDERS ARE EXPERIENCING THE SAME PROBLEM.",
        "vin": "JTEGD21A010"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/15/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 740969,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE \"CRUISE\" LIGHT APPEARS IN THE INSTRUMENT PANEL WHEN THE CRUISE CONTROL IS TURNED ON, BUT NOT ACTIVATED. WHEN THE CONTROL IS ACTIVATED, AND CONTROLING THE SPEED OF THE VEHICLE, THERE IS NO CHANGE IN THE INFORMATION IN THE INSTRUMENT PANEL. I BELIEVE IT SHOULD BE CLEAR TO THE DRIVER WHEN THE CONTROL IS ACTIVE, CONTROLING THE SPEED OF THE VEHICLE. PERHAPS THE \"CRUISE\" LIGHT SHOULD ONLY BE ON WHEN THE SYSTEM IS ACTIVE. OR, AN ADDITIONAL LIGHT TO TELL THE DRIVER THE SYSTEM IS ACTIVE.  *AK",
        "vin": "1NXBR12E11Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/22/2000",
        "dateOfIncident": "12/22/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738149,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE IS LOW-PROFILE DESIGN STANDARD ON PRIUS. EXPLOSIVE SEPARATION OCCURRED ON DRY ROADWAY WITHOUT DEBRIS. OUTSIDE AIR TEMPERATURE WAS APPROXIMATELY 78 DEGREES. THANK GOODNESS THAT THE TIRE WAS ON THE REAR. DRIVER WAS ABLE TO INITIATE A CONTROLLED STOP FROM THE NUMBER ONE LANE TO THE RIGHT SHOULDER. THE SEPARATION CAUSED DAMAGE TO THE LEFT REAR QUARTER-PANEL, THE ALLOY RIM AND OF COURSE THE TIRE. BRIDGESTONE CUSTOMER CARE WAS CONTACTED AT 800-847-3272 AND I WAS ADVISED THAT THEY WOULD SEND A CLAIM PACKAGE WITHIN 5 DAYS. THERE IS NO REFERENCE NUMBER ASSIGNED. THEY INDICATED THAT THEY WOULD PAY FOR REPAIRS. SERIAL NUMBER FOR ALL 4 TIRES IS: CHA3700. IT IS LIKELY THAT THIS LOT OF TIRES IS ON ALL OF THE PRIUS VEHICLES SITTING AT THE LONG BEACH, CALIFORNIA STORAGE FACILITY. THE TIRE PRESSURE ON THE VEHICLE WAS CHECKED THE DAY BEFORE THE INCIDENT AND ALL TIRES WERE INFLATED ACCORDING TO SPECIFICATIONS.  *AK (DOT NUMBER: EL9P  TIRESIZE: P17565 R14)",
        "vin": "JT2BK12U310"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/12/2000",
        "dateOfIncident": "12/12/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 876387,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON  HIGHWAY AT 45 MPH APPLIED  ACCELERATOR PEDAL TO PASS, AND  ACCELERATOR PEDAL REMAINED STUCK  TO THE FLOOR AND WOULD NOT RETURN, CAUSING VEHICLE TO SUDDENLY TAKE OFF. CONSUMER WAS ABLE TO SWITCH OFF  VEHICLE, AND COACH ONTO THE SIDE OF  ROAD. DEALER WAS NOT CONTACTED AT THIS TIME. PLEASE FEEL FREE TO PROVIDE ANY FURTHER DETAILS ON THIS MATTER.  *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/27/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 736931,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY EXCESSIVE FRONT BRAKE PAD WEAR. I HAVE REPLACED THE FRONT BRAKE PADS 5 TIMES IN 16000 MILES. I HAVE REPLACED THE PROPORTIONING VALVE WHICH DID NOT SOLVE THE PROBLEM. I HAVE ALSO REPLACED AND ADJUSTED THE REAR BRAKE SHOES WHICH DID NOT SOLVE THE PROBLEM.  *AK",
        "vin": "2T1BR12E11C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/14/2000",
        "dateOfIncident": "08/01/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 736293,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY LISTED FOR ABOVE VEHICLE.  *AK",
        "vin": "2T1BR12E31C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/19/2000",
        "dateOfIncident": "10/15/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 873385,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 45 - 50 MPH, A FLATBED TRAILER WAS SIDEWAY IN THE DARK ON THE OPPOSITE SIDE OF  HIGHWAY.  VEHICLE DID NOT SEE THE FLATBED TRUCK AND HIT IT.WENT UNDER THE TRUCK WHICH CAUSED DAMAGE TO THE FRONT END, CRUSHED THE RADIATOR, WINDSHIELD, ETC.   UPON IMPACT,  DRIVER'S AND PASSENGER'S AIRBAGS DID NOT DEPLOY, AND DID NOT PROTECT  OCCUPANST IN THIS CRASH.  PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": "1NXBR12E812"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "09/27/2000",
        "dateOfIncident": "09/01/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732700,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NEVER EXPERIENCED A PROBLEM INSTALLING AND PROPERLY SECURING CAR SEATS IN AUTOMOBILES.  HOWEVER, SINCE I PURCHASED THIS CAR, THE DEALERSHIP, MYSELF NOR MY FAMILY MEMBERS ARE ABLE TO GET A CAR SEAT INSTALLED IN THE VEHICLE PROPERLY AFTER FOLLOWING THE INSTALLATION DIRECTIONS OF BOTH THE CAR SEAT AND THE VEHICLE.  ANY OF THE SEAT BELTS WILL NOT SECURE A CAR SEAT.  WE EVEN BOUGHT A NEW CAR SEAT TO SEE IF THAT WAS THE PROBLEM.  ONCE THE SEAT BELT IS AS TIGHT AS IT COULD POSSIBLY EVER BE, YOU CAN STILL LIFT THE CAR SEAT OFF OF THE SEAT BY ABOUT 12 INCHES AND THE CAR SEAT DOES NOT FEEL AS THOUGH IT IS EVEN HOOKED INTO THE SEAT BELT.  I STOPPED BY THE DEALER WHERE I PURCHASED THE AUTOMOBILE ABOUT 2 WEEKS AGO, AND THEY COULDN'T GET THE CAR SEAT SECURED EITHER.  IF THE CAR SEAT CAN'T BE SECURED PROPERLY, HOW IS IT THAT A PERSON IS SAFE WITH THE SEAT BELT?  IS THIS A PROBLEM WITH THE NEW COROLLA'S?  MY DAUGHTER HAS A 1995 TOYOTA COROLLA AND THE CAR SEATS IN HER VEHICLE CAN'T BE BUDGED!  IS THIS A DEFECT WITH MY CAR ONLY?  I FEEL THAT THIS IS A VERY SERIOUS SITUATION.  HOW DO I KNOW THAT MY FAMILY IS SAFE IN THIS CAR AND THAT THE SAFETY RESTRAINTS ARE WORKING CORRECTLY?  PLEASE INVESTIGATE THIS MATTER AS SOON AS POSSIBLE.  I AM CONCERNED FOR MY FAMILY AND MY OWN SAFETY.  THANK YOU FOR YOUR TIME.  *AK",
        "vin": "1NXBR12E91Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/22/2000",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 732220,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE HIGH-BEAMS ARE ACTIVATED, THEY SHINE A BEAM OF LIGHT VERTICALLY FROM BOTH LENSES. THE BEAMS FORMSAN \"X\" THAT CROSSES DIRECTLY IN FRONT OF THE DRIVERS FIELD OF VISION- IT IS SO PRONOUNCED THAT IT LIGHTS UP TREES ABOVE THE CAR. I CONTACTED TOYOTA SERVICE AND ASKED IF IT WAS A LENS PROBLEM WITH MY VEHICLE- THEY SAID THEY HAVE RECEIVED COMPLAINTS BEFORE BUT HAVE NO PLANS TO REDESIGN HEADLIGHT LENSES. THIS SITUATION IS A DISTRACTION TO THE DRIVER, AND AFFECTS VISABILITY - ESPECIALLY IN RAIN OR HAZE WHEN LIGHT BEAM BOUNCES OFF AND OBSCURES FORWARD VISION.",
        "vin": "2T1BR12E51C"
    }
]