[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/27/2007",
        "dateOfIncident": "09/30/2007",
        "fire": false,
        "manufacturer": "THOR INDUSTRIES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210061,
        "products": [
            {
                "manufacturer": "THOR INDUSTRIES",
                "productMake": "THOR",
                "productModel": "WINDSPORT",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 2 MILES FROM MY HOME A MOTORIST STOPPED AND INFORMED ME SMOKE WAS POURING FROM THE RIGHT REAR OF MY FIFTH WHEEL TRAVEL TRAILER. UPON CLOSE INSPECTION I FOUND THE FRAME CRACKED AND ALLOWED THE REAR AXLE TO SHIFT FORWARD. THE REAR TIRE THEN RUBBED ON THE FRONT TIRE CREATING THE TIRES TO OVERHEAT. WE JACKED THE REAR AXLE INTO PLACE AND BLOCKED IT SO WE COULD RETURN HOME. IN ANOTHER ONE MILE WE WOULD HAVE BEEN TRAVELING ON INTERSTATE HIGHWAYS FOR 250 MILES TO OUR DESTINATION. IF I HAD NOT BEEN WARNED BY THE PASSING MOTORIST THIS COULD HAVE RESULTED IN A BAD SITUATION CAUSING A FIRE OR ACCIDENT. THE TRAILER IS GOING INTO A FRAME SHOP ON DECEMBER 3, 2007 FOR FURTHER STUDY AND REPAIR. THIS TRAILER IS 6 YEARS OLD AND SHOULD NOT HAVE THIS PROBLEM. I CONTACTED THE MANUFACTURER AND WAS TOLD THEY DO NOT HAVE A FRAME PROBLEM AND THAT I SHOULD CONTACT MY INSURANCE COMPANY. I DO NOT BELIEVE THIS IS AN INSURANCE PROBLEM BUT A MANUFACTURER DESIGN FLAW OR EQUIPMENT FAILURE. THIS IS A FIFTH AVENUE TRAILER MODEL 34RLRD WHICH DOES NOT SHOW ON YOUR LISTING.  *TR",
        "vin": "47CFFFS211P"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": "11/17/2003",
        "fire": false,
        "manufacturer": "THOR INDUSTRIES",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048559,
        "products": [
            {
                "manufacturer": "THOR INDUSTRIES",
                "productMake": "THOR",
                "productModel": "WINDSPORT",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "SAMSUNG ELECTRONICS CO., LTD",
                "productMake": "SAMSUNG MICROWAVE",
                "productModel": "MR5493G",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE CONSUMER HAD AN APPOINTMENT TO HAVE THE MICROWAVE REPAIRED UNDER RECALL.  UPON ARRIVAL AT DEALERSHIP, THE CONSUMER WAS INFORMED HIS MICROWAVE WAS NOT PART OF THE RECALL. SAMSUNG CONFIRMED THE RECALL AND PROVIDED THE CONSUMER WITH A ALTERNATE DEALERSHIP.  DEALER TO REFUSE RECALL: TELETRON SERVICE CO. 4415 AURORA AVENUE SEATTLE WA 98103 206-633-0789.  *JB",
        "vin": ""
    }
]