[
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "12/12/2019",
        "dateOfIncident": "12/11/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11288564,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS GETTING OFF THE FREEWAY AND DRIVING 40 MPH ON THE OFF RAMP, WHEN THE 2001 TOYOTA PRIUS DID A UNWANTED LEFT TURN OF THE STEERING WHEEL, I TRIED TO TURN THE STEERING WHEEL BACK TO CORRECT THE CAR ANGLE, BUT HE STEERING FORCE WAS TOO STRONG FOR ME TO CORRECT BACK TO STRAIGHT AHEAD, THE LEFT FRONT CAR THE CONCRETE BARRIER, AND THE CAR TURN 360 DEGREE AROUND. THE  REAR RIGHT BUMPER HIT THE CONCRETE BARRIER. LUCKY THERE WAS NO OTHER CARS AROUND ME.",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/10/2019",
        "dateOfIncident": "09/09/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11254342,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING RECALL    I CALLED TOYOTA THEY SAID THEY COULDN'T DO IT AND IT SAYS ONLINE IT'S GOOD FOR 10 YEARS AFTER RECALL DATE.",
        "vin": "JT2BK12U910"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/05/2019",
        "dateOfIncident": "01/04/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11165312,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR ACCELERATED WITHOUT WARNING AT HIGH SPEED ON IT'S OWN IN A PARKING LOT AND RAMMED ITSELF INTO THE WALL DEPLOYING AIRBAGS. MY MOTHER WAS DRIVING AND WAS SENT TO THE E.R. SHE WAS SLOWLY BACKING UP WHEN THE CAR ACCELERATED FIRST IN REVERSE HITTING A WALL AND THEN SWITCHED IN DRIVE ON IT'S OWN WITH HIGH ACCELERATION RUNNING INTO THE OPPOSITE WALL WHICH DEPLOYED THE BAGS. AFTER READING ONLINE ABOUT THESE VEHICLES, THE ACCELERATION SURGING IS A COMMON PROBLEM.",
        "vin": "JT2BK12U610"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2018",
        "dateOfIncident": "02/01/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128777,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR IS EXPERIENCING WHAT IS KNOWN ONLLINE AS \"THE BIG HAND SYNDROM\". WHILE DRIVING, THE ACCELERATOR PEDAL CHANGES RESISTANCE AND IT FEELS LIKE SOMEONE GRABS THE CAR AND IT DRAMATICALLY SLOWS. YOU THEN HAVE TO PRESS HARDER ON THE ACCELERATOR PEDAL TO MAINTAIN SPEED. WELL ONE DAY, THE CAR STOPPED WORKING, NO MATTER HOW HARD I PRESSED ON THE PEDAL IT WOULD NO ACCELERATE. I WAS ON THE HIGHWAY. I TOOK MY CAR IN TO THE LOCAL AUTHORIZED TOYOTA DEALER AND WAS TOLD THAT THE ACCELERATOR PEDAL WAS BAD AND NEEDED TO BE REPLACED. WE REPLACED THE PEDAL AND EXPERIENCED THE SAME ISSUES, AND REPLACED THE ACCELERATOR PEDAL AGAIN. I'M STILL EXPERIENCING THE SAME ISSUSES AND THE TOYOTA DEALER SAID THERES NOTHING THEY CAN DO EXCEPT KEEP REPLACING THE PEDAL CAUSE THATS THE CODE IT IS THROWING UP. THIS IS A MAJOR SAFETY ISSUE FOR MY VEHICLE AS I CAN AND DO LOSE ACCELERATION AT ANY GIVEN TIME. IT DOESNT SEEM TO MATTER HOW FAST IM GOING OR THE DRIVING CONDITIONS. IT IS COMPLETELY RANDOM, AND CANNOT BE REPLICATED ON COMAND. THE DATE LISTED IS THE FIRST INSTANCE, AND IT HAS HAPPENED TOO MANY TIMES TO COUNT OR MAKE RECORD.",
        "vin": "JT2BK12U510"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,ENGINE",
        "crash": true,
        "dateComplaintFiled": "09/18/2017",
        "dateOfIncident": "09/16/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11024048,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA PRIUS. WHILE DRIVING 20 MPH, THE VEHICLE LOST COMPLETE POWER AND BRAKING ABILITY WITHOUT WARNING. AS A RESULT, THE CONTACT DROVE OVER THE MEDIAN AAND CRASHED INTO A POLE. THE AIR BAGS DEPLOYED. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES. THE VEHICLE WAS TOWED TO THE LOCAL DEALER (TITUS-WILL TOYOTA, 3506 S SPRAGUE AVE, TACOMA, WA 98409). THE VEHICLE WAS NOT DECLARED DESTROYED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE AND VIN WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2017",
        "dateOfIncident": "01/10/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10953939,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA PRIUS. WHILE DRIVING 65 MPH, THE STEERING WHEEL SHOOK VIOLENTLY WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 143,000.",
        "vin": "JT2BK12U010"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/22/2016",
        "dateOfIncident": "10/22/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10918020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PS WARNING LIGHT DISPLAY, CAR WILL NOT START. PARKED IN HOME DRIVE WAY.",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/14/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790550,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA PRIUS. THE CONTACT STATED THAT THE STEERING WHEEL BECAME STIFF WHILE MAKING A LEFT TURN AND THE POWER STEERING LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V304000 (STEERING). THE FAILURE MILEAGE WAS APPROXIMATELY 13,620.",
        "vin": "JT2BK12U710"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,HYBRID PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/23/2015",
        "dateOfIncident": "06/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726901,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SUDDENLY LOST POWER WITHOUT ANY WARNING WHILE DRIVING 65+ MPH ON THE FREEWAY. THE CHECK HYBRID WARNING LIGHT CAME ON. THE CAR BECAME DANGEROUSLY UNRESPONSIVE, LUCKILY WE WERE NEAR AN EXIT AND WERE ABLE TO COAST TO SAFETY. THE HYBRID SYSTEM WAS EXPECTING INFORMATION FROM THE ACCELERATOR, AND WHEN IT DOESN'T RECEIVE IT, EITHER THE GAS ENGINE, OR THE ELECTRIC ENGINE, OR BOTH ENGINES FAIL TO OPERATE. TOYOTA HAS SERVICE BULLETIN   2001 TOYOTA PRIUS UNKNOWN OR OTHER SERVICE BULLETIN 117006        ACTION NUMBER: 635861      SERVICE BULLETIN NUMBER: 117006...    REPORT DATE: SEP 12, 2002      COMPONENT: UNKNOWN OR OTHER....      SUMMARY: SOME VEHICLES MAY EXHIBIT A MASTER, HYBRID AND MALFUNCTION INDICATOR WARNING LIGHT ON WITH DIAGNOSTIC TROUBLE CODE P1120.  ,,,                      P1120 TOYOTA DESCRIPTION  ACCELERATOR PEDAL POSITION SENSOR IS MOUNTED ON THE THROTTLE BODY AND IT HAS THE 2 SENSORS TO DETECTS THE ACCELERATOR POSITION AND A MALFUNCTION OF THE ACCELERATOR POSITION.  THE ACCELERATOR PEDAL POSITION SENSOR IS CONNECTED WITH THE ACCELERATOR PEDAL BY THE ACCELERATOR WIRE.    THE ECM JUDGES THE CURRENT OPENING ANGLE OF THE ACCELERATOR PEDAL FROM THESE SENSOR SIGNAL INPUTS AND IT CONTROLS THE THROTTLE MOTOR BASED ON THESE SIGNALS.  IF THE THE P1120 CODE IS STORED, THE ECM SHUTS DOWN THE POWER FOR THE THROTTLE MOTOR AND THE MAGNETIC CLUTCH, AND THE THROTTLE VALVE IS FULLY CLOSED BY THE RETURN SPRING.  HOWEVER, THE OPENING ANGLE OF THE THROTTLE VALVE CAN BE CONTROLLED BY THE ACCELERATOR PEDAL THROUGH THE THROTTLE CABLE.  I HAVE SINCE LEARNED THAT THE ACCELERATOR SENSOR ASSEMBLY IS PROBABLY AT FAULT, WHICH IS A HIGH COST ITEM $300 DOLLARS OR MORE WHICH TOYOTA WOULD BALK AT REPLACING IN A RECALL. THIS HAPPENED ONCE BEFORE, BUT I DON'T RECALL THE DATE.....UPDATED 08/24/15 *BF",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "01/23/2015",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678640,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE STARTED HAVING AN INTERMITTENT POWER STEERING ISSUE. AS I AM DRIVING THE STEERING WHEEL BEGINS TO SHAKE AND I RECEIVE AN ERROR MESSAGE THAT THERE IS AN ISSUE WITH THE POWER STEERING SYSTEM. THEN THE ERROR CLEARS AND SAYS THE PROBLEM IS SOLVED. THIS ISSUE HAPPENS INTERMITTENT AND SOMETIMES LASTS LONGER. I KNOW IN THE PAST THERE WAS A RECALL ON THE POWER STEERING UNIT IN THE PAST. I BELIEVE THE PREVIOUS OWNER HAD THE RECALL SERVICE DONE, BUT I DO NOT UNDERSTAND THAT IF THE SERVICE WAS PERFORMED WHY MY VEHICLE IS HAVING THIS ISSUE WITH MY PRIUS.  *TR",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/10/2014",
        "dateOfIncident": "08/20/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632055,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLETE BRAKE FAILURE, SHOP SAID IT WAS THE TURBO BRAKE BOOSTER.  *TR",
        "vin": "JT2BK12U110"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "03/24/2014",
        "dateOfIncident": "03/21/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10574340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA PRIUS.  THE CONTACT STATED WHILE DRIVING APPROXIMATELY 50 MPH, THE BREAKS FAILED WITHOUT WARNING.  THE BREAKS PEDAL TRAVELED TO THE FLOORBOARD WITH NO RESPONSE. THE CONTACT THEN CRASHED INTO ANOTHER VEHICLE AND THE AIR BAG DID NOT DEPLOY. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED OF THE INCIDENT. THE VEHICLE WAS TOWED TO SALVAGE LOT FOR FURTHER INSPECTION.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 84,000.",
        "vin": "JTDKN3DU5B5"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/19/2014",
        "dateOfIncident": "02/16/2014",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564996,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 PRIUS WAS PARKED IN GARAGE ~6HRS, FIRE STARTED AND SMOLDERED, APPARENTLY USING UP OXYGEN INSIDE THE CAR.  I WENT IN THE GARAGE FOR SOMETHING ELSE, NOTICED THE HEADLIGHTS WERE ON AND OPENED THE CAR DOOR TO TURN THEM OFF.  WHEN THE DOOR WAS OPENED, ACRID SMOKE POURED OUT, AND THE FIRE WAS GIVEN FRESH OXYGEN, AND IT TOOK OFF.  WINDSHIELD CRACKED FROM HEAT, LEFT FRONT DASH MELTED.  FIRE DEPT PUT OUT THE FIRE QUICKLY, BUT THE CAR IS RUINED AND THE CAUSE UNKNOWN.  THANKFULLY NO DAMAGE TO GARAGE, HOUSE OR PEOPLE.  I HAD SMELLED A FUNNY SMELL HOURS BEFORE, BUT THOUGHT IT WAS SOMETHING OUTSIDE, SO THE FIRE HAD BEEN SMOLDERING FOR SOME TIME.  LIGHTS APPARENTLY WENT ON BECAUSE THE FIRE/HEAT HAD SHORTED SOMETHING.    *TR",
        "vin": "JT2BK12U910"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/25/2013",
        "dateOfIncident": "08/18/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537132,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A RENTER FROM RELAYRIDES.COM WAS DRIVING MY VEHICLE, THE BRAKE PEDAL WENT TO THE FLOOR AND THE ABS, TRACTION CONTROL AND BRAKE LIGHTS CAME ON. LUCKILY HE DIDN'T HAVE TO STOP IMMEDIATELY AND WAS ABLE TO SLOWLY GET THE CAR TO STOP WITH THE BARE LITTLE BRAKES LEFT. THERE WAS VERY LITTLE BRAKING POWER LEFT, EVEN WITH PUMPING.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2013",
        "dateOfIncident": "03/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494532,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RAPIDLY ACCELERATED WITHOUT MY FOOT ON THE GAS PEDAL AND DID NOT SLOW DOWN UNTIL MY FOOT HIT THE BRAKE.  BROUGHT THE VEHICLE TO MCGEE TOYOTA AND THEY REPLACED THE GAS PEDAL.  IT WAS A $600.+ REPAIR.  WITHIN THE YEAR THE NEWS REPORTED ABNORMAL ACCELERATION WITH THE PRIUS LINE AND I QUICKLY CONTACTED TOYOTA MANAGEMENT.   THEY DENIED MY CLAIM SAYING THAT THESE INCIDENCES WERE AS A RESULT OF FLOOR MATS?  I REPORTED IT TO [XXX](MA) REPRESENTATIVE FOR CONSUMER PROTECTION AND HAVE NOT RECEIVED A RESPONSE (THIS WAS OVER TWO YEARS AGO).  I RECENTLY HEARD ABOUT  YOUR AGENCY AND DECIDED TO FILE A REPORT.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2012",
        "dateOfIncident": "01/31/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488713,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IF THE PRIUS ENGINE DOES NOT START IMMEDIATELY WHEN THE COMPUTER TELLS IT TO, THE COMPUTER STOPS TRYING TO START IT  AND LEAVES YOU WITH ONLY THE BATTERY POWER...VERY DANGEROUS WHEN THIS HAPPENS IN FAST TRAFFIC OR ON AN ON-RAMP. IT CAN BE RESTARTED IF ONE PULLS OFF THE ROAD AND  SHUTS OFF THE CAR AND RESTARTS IT. AFTER NUMEROUS INCIDENTS AND ATTEMPTS TO DETERMINE THE REASON FOR THE OCCASIONAL NON-STARTS, IT TURNED OUT THAT THE AIR INTAKE FLAP IN THE ENGINE CAN GET DIRTY AND STICK, WHICH CAUSES THE ENGINE TO SOMETIMES TAKE SEVERAL TRIES TO RESTART. (THIS WAS INITIALLY MISDIAGNOSED AS A COMPUTER PROBLEM, HOWEVER THAT WAS NOT THE CAUSE.) BESIDES MAKING THE FLAP CLEANING PART OF MAINTENANCE, THE COMPUTER SHOULD ALSO BE FIXED SO THAT IT WILL ATTEMPT TO RESTART THE ENGINE WHILE THE VEHICLE IS BEING DRIVEN, SINCE THINGS COULD CAUSE THE ENGINE TO NOT START ON THE FIRST TRY (SUCH AS SLOSHING FROM LOW GAS.) I DON'T KNOW IF THIS IS STILL A PROBLEM ON NEWER PRIUSES, HOWEVER AS MORE OF THEM HAVE HIGH MILEAGE, THIS CAN BE EXPECTED TO BE MORE OF A PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/04/2011",
        "dateOfIncident": "12/08/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10428635,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS. CONSUMER STATES PROBLEM WITH THE RACK AND PINION *TGW  THE CONSUMER STATED NOT LONG AFTER SHE PURCHASED THE VEHICLE. SHE EXPERIENCED PROBLEMS WITH THE RACK AND PINION STEERING SYSTEM, INCLUDING STEERING WHEEL SHAKING AND LOSS OF POWER STEERING. THE CONSUMER TOOK THE VEHICLE IN FOR SERVICE AND WAS INFORMED THE ENTIRE RACK AND PINION ASSEMBLY NEEDED TO BE REPLACED.  THE CONSUMER BELIEVED THE REPAIR MAY BE RELATED TO THE PINION SHAFT PROBLEM THAT WAS JUST RECENTLY IDENTIFIED UNDER A RECALL.  THE CONSUMER IS SEEKING REIMBURSEMENT FOR THE PREVIOUS REPAIR. *JB  UPDATED 12/28/11. *JB  THE CONSUMER STATED SHE BEGAN TO EXPERIENCE THE SAME PROBLEM, AS SHE DID IN 2006 WITH THE VEHICLE LOOSING POWER STEERING INTERMITTENTLY. THE DEALER ADJUSTED THE TORQUE SENSOR AND RECOMMENDED A REPLACEMENT OF THE SENSOR AND THE RACK AND PINION ASSEMBLY, IF THE PROBLEM RETURNED AGAIN.  A FEW DAYS AFTER THE SENSOR ADJUSTMENT, THE POWER STEERING PROBLEM DID RESUME AGAIN, AND IT CONTINUES TO GO OUT INTERMITTENTLY.  UPDATED 04/16/14*JB",
        "vin": "JT2BK12U210"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2011",
        "dateOfIncident": "08/03/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417673,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA PRIUS. THE CONTACT RECEIVED THE RECALL NOTICE ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 11V304000 (STEERING:ELECTRIC POWER ASSIST SYSTEM). AN AUTHORIZED DEALER WAS NOTIFIED AND THE CONTACT WAS INFORMED THAT THEY WOULD INSPECT THE VEHICLE BEFORE PERFORMING REPAIRS. THE CONTACT STATED THAT ACCORDING TO THE RECALL NOTICE, THE DEALER WAS SUPPOSED TO REPAIR THE VEHICLE IF IT WAS INCLUDED IN THE RECALL. THE MANUFACTURE WAS NOTIFIED AND OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT YET TAKEN TO THE DEALER TO FIND OUT WHETHER OR NOT REPAIRS WERE NEEDED. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "JT2BK12U810"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/09/2011",
        "dateOfIncident": "06/08/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405799,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIUS, 2001 BOTH REAR AXLE HUB ASSEMBLIES REPLACED AFTER BEARING FAILURES WITH UNDER 90K MILES ON MY CAR, OWNED NEW SINCE JUNE 2001. THERE ARE NOT OPTIONS TO REPLACE THE FAILED BEARINGS, JUST THE COMPLETE REAR HUB ASSEMBLY THAT INCLUDES THE ATTACHED ABS SENSOR. FAILED ASSEMBLIES HAVE BEEN RETAINED AND ARE AVAILABLE. I AM NOW CONCERNED ABOUT MY 2002 PRIUS, AS WELL.  *TR",
        "vin": "JT2BK12U610"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/25/2011",
        "dateOfIncident": "05/25/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402702,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING INTO A FREEWAY OUR 2001 TOYOTA PRIUS EXPERIENCED A VIOLENT SHAKING OF THE STEERING WHEEL AND THE PS AND EXCLAMATION WARNING LIGHTS CAME ON. MY WIFE PULLED OVER AND SHUT THE VEHICLE OFF AND THE ERROR CLEARED. I DECIDED TO DRIVE THE VEHICLE TO THE DEALER THE PREVIOUS OWNER DONE ALL THE SERVICE AND REPAIR. AS I PULLED INTO THE SERVICE AREA THE VIOLENT SHAKING HAPPENED AGAIN. I RESEARCHED THE ISSUE ONLINE AND FOUND THE THERE WAS A RECALL OF THE POWER ASSIST STEERING UNIT DUE TO A FAULTY SENSOR. WHEN I QUESTIONED THE DEALER REGARDING THE RECALL THE SERVICE GUY BECAME DEFENSIVE AND SAID IT IS NOT COVERED UNDER RECALL AND WARRANTY IS EXPIRED SO IT IS A CHARGEABLE REPAIR. I REVIEWED THE RECALL NOTICE AND WARNINGS BUT MY VEHICLE IS NOT IN THE VIN RANGE BUT THE PROBLEM IS EXACTLY THE SAME AND COST $4000 TO REPAIR. I DON'T BELIEVE THIS IS A FAIR PROCESS IF SOME VEHICLES WERE REPAIRED WHILE OTHERS HAVE TO BE PAID FOR BY OWNERS.  *TR",
        "vin": "JT2BK12U310"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/29/2011",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379559,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL, UNCONTROLLABLE SHUDDER, WILL LITERALLY RIP ITSELF OUT OF YOUR HAND OR GRIP. USUALLY HAPPENS DURING THE FIRST OF THE DAY WHEN IT'S RELATIVELY COLD. WHILE SLOWLY MOVING THE VEHICLE, THE STEERING WHEEL WILL START TO VIBRATE VIOLENTLY, IN AN UN CONTROLLABLE MANNER. SOMETIMES THE POWER STEERING WILL JUST ERROR OUT WHILE DRIVING DOWN THE STREET DURING THE DAY, LOOSING ALL POWER STEERING AS WELL. *TR",
        "vin": "JT2BK12U410"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/20/2011",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378036,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 PRIUS.  I BOUGHT IT IN 2003.  EVER SINCE I BOUGHT IT, THE STEERING WHEEL SOMETIMES WOBBLES WHEN I BACK UP AND TURN THE WHEEL.  THIS HAS BEEN CONSISTENT SINCE 2003.  THIS WINTER, WHEN THE WEATHER HAS BEEN VERY COLD, THE STEERING WHEEL HAS SHUDDERED VIOLENTLY SEVERAL TIMES, WOBBLED WHILE DRIVING FORWARD TWICE, AND NOW THE WARNING LIGHT FOR POWER STEERING IS ON.  I AM TAKING IT TO THE DEALER TOMORROW, JAN 21 2011.    I HAVE READ ABOUT THE WOBBLING STEERING WHEEL WHILE BACKING UP SINCE I BOUGHT THE CAR.  I AM ALSO SEEING THAT THERE WAS AN EXTENSION OF THE WARRANTY ON THE STEERING COLUMN, BUT I NEVER RECEIVED NOTICE, AND MY DEALER DENIES ANY RECALL REGARDING THIS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/02/2010",
        "dateOfIncident": "12/02/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368646,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA PRIUS. THE CONTACT STATED WHILE DRIVING 30 MPH, AN UNKNOWN WARNING LIGHT ILLUMINATED AND THE STEERING WHEEL IMMEDIATELY BECAME STIFF AND HARD TO CONTROL. THE FAILURE WOULD OCCUR INTERMITTENTLY AND WHEN DOING SO, THE STEERING WHEEL WOULD ALSO SHAKE ABNORMALLY. THE CONTACT WOULD SHUT OFF THE VEHICLE AND WHEN RESTARTING, THE STEERING WOULD RESUME NORMAL OPERATION.  THE MANUFACTURER WAS CONTACTED AND ADVISED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 00V285000 (STEERING: GEAR BOX -OTHER THAN RACK AND PINION) THEREFORE THEY WOULD NOT ASSIST WITH THE REPAIR. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 150,000 AND THE CURRENT MILEAGE WAS 205,000.",
        "vin": "JT2BK12U110"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/14/2010",
        "dateOfIncident": "10/14/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360541,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PREMATURE WEAR AND CROWNING OF TIRES DUE TO MANUFACTURING DEFECT OF REAR AXLE. CAN ONLY BE CORRECTED BY AFTER MARKET PLASTIC SHIMS INSTALLED AT AN EXPENSE OF APPROXIMATELY $500 OR OVER INFLATE TIRES TO 50 PSI AND LOOSE ROAD TRACTION OR INFLATE TIRES TO TOYOTA SPECIFICATIONS FOR PREMATURE WEAR DUE TO TOE OUT DEFECT. *TR",
        "vin": "JT2BK12U610"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "06/13/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358567,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 TOYOTA PRIUS STEERING 'GROANS' WHEN THE WHEELS ARE TURNED FAR LEFT OR RIGHT.  THIS DEFECT OCCURS MORE OFTEN IN WARM WEATHER AND AFTER THE CAR HAS BEEN DRIVEN.  THE VEHICLE HAS NOT BEEN IN ANY ACCIDENTS.  *TR",
        "vin": "JT2BK12U410"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/02/2010",
        "dateOfIncident": "08/26/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353479,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS. WHILE MAKING A LEFT TURN AT APPROXIMATELY 25 MPH SHE NOTICED THAT THE STEERING WHEEL WAS EASY TO TURN TO THE LEFT AND SHE HAD TO APPLY EXTREME PRESSURE IN ORDER TO GET THE STEERING WHEEL TO RETURN TO THE CENTER POSITION.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE SHE WAS INFORMED OF A STEERING RECALL. THE MANUFACTURER INFORMED HER THAT HER VIN WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 00V285000, STEERING:GEAR BOX (OTHER THAN RACK AND PINION).  THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 103,000.",
        "vin": "JT2BK12U210"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "04/27/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346219,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING REPEATEDLY FAILS ON 2001 TOYOTA PRIUS REQUIRING THAT VEHICLE BE STOPPED AND RESTARTED TO CLEAR FAILURE. EXTREME SAFETY HAZARD WHEN DRIVING ON ROADS AT ALL SPEEDS AND IN CURVES. OCCURS AFTER VEHICLE DRIVEN MORE THAN 500 MILES CONTINUOUSLY.  POWER STEERING STILL FAILING AS OF 7/29/2010.  DEALER REFUSES TO FIX DESPITE WARRANTY ENHANCEMENT NOTICE.  REQUEST NHTSA ISSUE NATIONWIDE RECALL FOR ALL 2001-2002 TOYOTA PRIUS WITH SIMILAR POWER STEERING PROBLEM AS FAILURE OF POWER STEERING UNIT IS EXTREME HAZARDOUS CONDITION. *TR",
        "vin": "JT2BK12U610"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/17/2010",
        "dateOfIncident": "08/07/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10336860,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS. THE CONTACT DETECTED TOXIC LEVELS OF MERCURY INSIDE OF THE VEHICLE. THE CONTACT STATED  THE MERCURY PROBLEM WAS CONTRIBUTED TO A SPECIFIC TYPE OF METAL CONTENT IN THE BRAKE PADS. THE CONTACT WAS ADVISED BY A PHYSICIAN THAT A CHRONIC EXPOSURE OF MERCURY WAS IN HIS BODY WHICH RESULTED TO SUCH SYMPTOMS AS FATIGUE, ITCHY SKIN, HAIR LOSS AND A TINGLY SENSATION WITHIN THE BODY. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THEY DID NOT HAVE THE EQUIPMENT TO PERFORM A DIAGNOSIS FOR LEVELS OF MERCURY. THE CONTACT PLANNED TO REPLACE THE BRAKE PADS DUE TO THE SAFETY RISK INVOLVED. THE FAILURE MILEAGE WAS APPROXIMATELY 175,000.",
        "vin": "JT2BK12U110"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/07/2010",
        "dateOfIncident": "06/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335007,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS. WHILE DRIVING AT APPROXIMATELY 65 MPH, THE POWER STEERING WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND THE VEHICLE LOST POWER STEERING. THE CONTACT PULLED OVER AND RESTARTED THE VEHICLE. UPON  RESTART, THE VEHICLE OPERATED AS NORMAL FOR APPROXIMATELY 30 MINUTES BEFORE THE FAILURE RECURRED. THE FAILURE OCCURRED ABOUT TWELVE TIMES WHILE DRIVING FOR AT LEAST 30 MINUTES. THE CONTACT CALLED THE MANUFACTURER WHO INFORMED THE CONTACT THAT THE VEHICLE WAS SERVICED BY A PRIOR OWNER FOR THE RECALL 00V285000 (STEERING: GEAR BOX (OTHER THAN RACK AND PINION). THE VEHICLE HAD NOT BEEN REPAIRED AT THE TIME OF THE COMPLAINT. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 109,000.     UPDATED 10/20/10 *BF  THE CONSUMER STATED THE VEHICLE STILL HAS NOT BEEN REPAIRED.   UPDATED 10/21/10*JB",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "03/13/2010",
        "dateOfIncident": "01/11/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319401,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY 2001 TOYOTA PRIUS CONSISTENTLY WORE OUT THE FRONT TIRES ON THE INSIDE PART OF THE TREAD, NOT EASILY VISIBLE FROM THE STREET.  THE TIRES WORE DOWN TO THE CORDS IN LESS THAN 10,000 MILES.  MY WIFE HAD AN ACCIDENT WHERE SHE COULD NOT STOP THE CAR IN TIME TO AVOID IT.  MY YOUNG DAUGHTER WAS IN THE CAR AT THE TIME.  THESE CARS ARE STILL ON THE ROAD.  I COMPLAINED TO TOYOTA BUT THE COMPLAINT FELL ON DEAF EARS. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319241,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 TOYOTA PRIUS HYBRID. WHILE DRIVING AT SPEEDS OF 65 MPH, THE STEERING WHEEL BEGAN SHAKING EXCESSIVELY.  IMMEDIATELY, THE POWER STEERING WARNING LIGHT ILLUMINATED ON THE WARNING PANEL FOR A FEW MINUTES. THE CONTACT ALSO STATED THAT WHILE TRAVELING DOWNHILL WITH HER FOOT ON THE BRAKE PEDAL, THE PEDAL WOULD VIBRATE. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE VEHICLE WAS REPAIRED THREE SEPARATE TIMES UNDER VARIOUS RECALL CAMPAIGNS BY THE PREVIOUS OWNER. THEY WERE UNWILLING TO ASSIST WITH ANY FURTHER REPAIRS TO THE VEHICLE. THE VIN WAS NOT AVAILABLE AT THE TIME OF THE COMPLAINT. THE APPROXIMATE FAILURE MILEAGE WAS 116,000 AND THE CURRENT WAS 118,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318566,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON THE FREEWAY EARLY AM, STILL DARK, GAS ENGINE FAILED, ECU FAILURE SHOWN ON SCREEN.  ELECTRIC MOTOR WAS GOING AT MAXIMUM WITH NO \"GAS\" PEDAL APPLIED.  PULLED OVER, TURNED OFF.  300V BATT ALREADY FULLY DISCHARGED WHEN IT GOT TO THE DEALER.  THEY CHARGED IT AND IT HAS NOT HAPPENED AGAIN BEFORE SELLING IN 2006. 2001 PRIUS.  LATER ON HAD TWO BAD RACK & PINION, THE 2ND ONE FAILED A COUPLE MONTHS AFTER REPLACEMENT ON A LONG FREEWAY TRIP AT MILE 300.  VERY HARD TO STEER EVEN AT HIGHWAY SPEEDS.  TOYOTA REPLACED AGAIN. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2010",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318139,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS, I EXPERIENCED UNINTENDED ACCELERATION IN MY 2001 TOYOTA PRIUS.  THE FIRST TIME IT HAPPENED, IT HAPPENED I THOUGHT I MIGHT HAVE PRESSED THE ACCELERATOR BY MISTAKE.  I HAD TO SLAM ON THE BRAKES TO STOP THE CAR.  I DIDN'T BELIEVE ANYONE WOULD BELIEVE MY STORY BECAUSE OF THE AUDI 5000 INCIDENTS.  THEN IT HAPPENED AGAIN.  THEN TOYOTA BEGAN ITS RECALLS.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315757,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNED A 2001 TOYOTA PRIUS. THE CONTACT WAS DRIVING APPROXIMATELY 30 MPH ON NORMAL ROAD CONDITIONS. THE \"HYBRID\" (EXCLAMATION MARK) WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. IMMEDIATELY, THE ENGINE STALLED. THE WARNING LIGHT REMAINED ILLUMINATED UNTIL THE ENGINE WAS TURNED OFF. THE IDENTICAL FAILURES OCCURRED ON TWENTY SEPARATE OCCASIONS. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING. THE ENGINE STARTED AND RESUMED NORMAL OPERATION. THE FAILURE MILEAGE WAS 16,000. THE CONTACT NO LONGER OWNED THE VEHICLE.             UPDATED 4/5/10 *CN  THE CONSUMER HAS SINCE SOLD THE VEHICLE. UPDATD 06/14/10.*JB",
        "vin": "JT2BK12U310"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "02/17/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311502,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 TOYOTA PRIUS' STEERING WHEEL SHAKING VIOLENTLY  THIS SYMPTOM HAS BEEN HAPPENED TO MY 2001 PRIUS SINCE 2008. I HAD BEEN TRYING TO CONTACT TOYOTA FOR A REPLACEMENT BUT NO FEEDBACK. LATELY THE SYMPTOM GETTING WORSE UNTIL NOW. *TR",
        "vin": "JT2BK12U310"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/16/2010",
        "dateOfIncident": "12/18/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311151,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL ON MY 2001 TOYOTA PRIUS SUDDENLY STARTS SHAKING VIOLENTLY WHEN I START UP THE CAR.  IT SEEMS TO OCCUR DURING COLD WEATHER.  I HAVE TO STOP THE CAR WHEN IT HAPPENS BECAUSE STEERING IS NO LONGER POSSIBLE WHEN THE SHAKING HAPPENS.  THIS SHAKING HAS OCCURRED AT LEAST 5 TIMES.  IF I LET THE CAR WARM UP FOR A FEW MINUTES BEFORE DRIVING IT SEEMS TO REDUCE THE OCCURRENCE OF THE SHAKING. *TR",
        "vin": "JT2BK12U210"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/13/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING MY 2001 PRIUS DOWN RT 95 IN CT.  SUDDENLY LOST POWER.  I WAS ABLE TO DRIVE - ELECTRIC DRIVE ONLY, NO GAS POWER.  I MADE TO  THE EXIT IN WESPORT AND FOUND A TOYOTA DEALERSHIP OPEN.  THE DIAGNOSIS, VIA CODES, WAS FAILED ACCELERATOR PEDAL.  RESETTING THE COMPUTER AND RESTARTING THE CAR A FEW TIMES ALLOWED IT TO WORK ENOUGH FOR ME TO GET HOME.  I HAVE STILL NOT REPAIRED THE ACCELERATOR.  LATELY THIS PROBLEM HAPPENS NEARLY EVERY TIME I START THE CAR...THE ENGINE STALLS IMMEDIATELY OR LOSES POWER DOWN THE ROAD.  RESTARTING  2 OR 3 TIMES \"FIXES\" THE PROBLEM MOST OF THE TIME. MY RESEARCH HAS SHOWN THAT THIS PROBLEM IS COMMON, AND CALLED \"BIG HAND SYNDROME\" AMONG 1ST GENERATION PRIUS OWNERS, AND ACCELERATOR PEDAL REPAIR IS THE COMMON FIX.  I BELIEVE THE 2001-2003 PRIUS SHOULD BE INCLUDED IN THE TOYOTA ACCELERATOR PEDAL RECALL. *TR",
        "vin": "JT2BK12U210"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "05/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308484,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS. WE HAD A TOYOTA PRIUS HYBRID GAS/ELECTRIC CAR THE FIRST THAT CAME INTO THE USA.  THE CAR  WOULD REACH A CERTAIN MILEAGE AND  THE COMPUTER WHICH CONTROLLED EVERYTHING IN THE CAR WOULD GO BAD. WE WOULD GET A FEW MILES FROM HOME AND THE CAR WOULD NOT WORK.  IT WOULD SHUT OFF.  WE WOULD HAVE TO SIT FOR A FEW MINUTES AND THAN THE CAR WOULD ONLY GO 35 MILES AN HOUR OR LESS AND WE WOULD HAVE TO TURN AROUND AND GO HOME.  ON ONE TRIP TO CALIFORNIA, WHEN WE GOT TO  COLORADO THE SCREEN SAID THE GO TO A SERVICE DEALER.  WE HAD TO SPEND THE NIGHT IN NORTHGLENN COLORADO AND WENT TO THE DEALER .  WE HAD TO TAKE THE CAR INTO THE DEALER SO MANY TIMES.  THEY WOULD REPLACE THE COMPUTER AND ALL THE PARTS,  EVEN THE GAS TANK. THE CAR WOULD ALSO LOCK YOU INSIDE AND YOU COULD NOT GET OUT.  THE COMPUTER AND THE ELECTRICAL SYSTEM IN OF THIS MODEL ARE ALL BAD.  THEY REACH A CERTAIN MILEAGE AND BAD.  THEY WERE DOING ALL THE RECALLS FROM OUR CAR.  THEY PROMISED US A NEW PRIUS SIGNATURE TOYOTA  IN BENTON HARBOR MI, AND NEVER GOT IT.  FINALLY IN 2005 THEY SAID THEY WOULD TRADE OUR PRIUS CAR FOR ANOTHER CAR COROLLA, BUT THEY CHARGED US $8,000.00 MORE.  PLEASE HELP US GET OUR MONEY BACK.  NO LAWYER WILL TAKE IT SINCE COMES FROM JAPAN.  WE HAD TRIED EVERYTHING AND COULD GET NO HELP. WROTE TOYOTA AND NEVER GOT THEM TO REPLY TO US.  TRIED THEIR MEDIATION AND THEY   HELD THE PAPERS UNTIL THE TIME RAN OUT THAN SENT US A PAPER SAYING NOT VALID ANY MORE.  HELP US GET OUR MONEY BACK.  LET PEOPLE KNOW THAT PRIUS CARS ARE BAD.  DO NOT BUY. *TR  THE CONSUMER ALSO STATED THE GAS PEDAL WOULD BECOME STUCK AT TIMES, WHICH CAUSED THE VEHICLE TO INCREASE IN SPEED.  UPDATED 04/27/10  UPDATED 10/29/10",
        "vin": "JT2BK12U210"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "02/09/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308078,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM BRAKING AND GO OVER A BUMP OR DIP IN THE ROAD THE BRAKES STOP WORKING AND I IMMEDIATELY HAVE TO LET UP ON THE BRAKE AND REAPPLY.  THIS HAS HAPPENED SEVERAL TIMES BUT DID NOT THINK ANYTHING OF IT UNTIL THE LATEST RECALLS FOR TOYOTA.  THIS IS HAPPENING WITH MY 2001 PRIUS.  YES I SAID 2001.  THIS HAS HAPPENED MANY TIMES IN THE PAST 9 YEARS.  I THOUGHT IT WAS NORMAL UNTIL THE RECENT REPORTS OF NEWER VEHICLES HAVING THIS ISSUE.  MY VEHICLE IS 9 YEARS OLD.  *TR",
        "vin": "JT2BK12U510"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/08/2010",
        "dateOfIncident": "02/08/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307373,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA HAS ANNOUNCED A RECALL OF THE NEWEST GENERATION OF PRIUS CARS TO INSTALL SOFTWARE TO REPAIR A BRAKING PROBLEM.  I AM THE OWNER OF A FIRST GENERATION (2001) PRIUS.  MY CAR HAS ALWAYS HAD THAT BRAKING PROBLEM.  WHEN THE ROAD IS WET OR BUMPY OR AT UNPREDICTABLE TIMES DUE TO ROAD CONDITIONS, THE BRAKES MOMENTARILY FAIL TO ENGAGE AND IT IS AS THOUGH THERE ARE NO BRAKES.  THE TOYOTA DEALER HAS NEVER BEEN WILLING TO ADMIT THAT THERE WAS A PROBLEM.  I THINK THAT ALL MODELS OF PRIUS HAVE THIS PROBLEM BECAUSE OF THE UNIQUE NATURE OF THE BRAKING/CHARGING SYSTEM INHERENT IN THE CAR'S DESIGN.  SINCE IT IS A SAFETY ISSUE, EARLIER MODELS OF THE PRIUS SHOULD BE INVESTIGATED AS WELL.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/08/2010",
        "dateOfIncident": "02/08/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307671,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 (YES, THAT IS 2001) PRIUS HAS THE SAME ISSUE THAT IS BEHIND THE RECALL OF THE 2010 PRIUS:  \"MOMENTARY LOSS OF BRAKING CAPABILITY WHILE TRAVELING OVER AN UNEVEN ROAD SURFACE, POTHOLE OR BUMP.\"  MOMENTARY = LESS THAN A SECOND.  *CN",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305408,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 PRIUS THAT ALSO HAS A PROBLEM WITH BRAKING, SIMILAR TO THAT DESCRIBED WITH THE 2010 MODEL. AT LOW SPEEDS WHEN THE CAR HITS A BUMP OR POTHOLE THE BRAKING IS MOMENTARILY LOST, BUT THEN RESUMES WITHIN 1-2 SECONDS. IN ~ 2003 I HAD A VERY LOW SPEED COLLISION FROM THIS (ABOUT $1000 DAMAGE TO THE HOOD SHEET METAL), BUT HAVE NOW LEARNED TO COMPENSATE FOR IT (BASICALLY APPLY BRAKES HARD AND WAIT FOR BRAKING TO RESUME AFTER THE PAUSE). I HAD REPORTED THIS TO THE DEALER ON SEVERAL EVALUATIONS, INCLUDING AFTER THE ACCIDENT, AND WAS TOLD THAT NO PROBLEM COULD BE IDENTIFIED.    I AM REPORTING THIS BECAUSE IT IS REMARKABLY SIMILAR TO WHAT IT PURPORTED TO BE A NEW PROBLEM WITH THE 2010 PRIUS. IT IS NOT NEW. PLEASE FEEL FREE TO CONTACT ME  IF YOU WOULD FIND OTHER INFORMATION USEFUL. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "05/17/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305738,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE INVESTIGATING THE PRIUS FOR ACCELERATOR ISSUES, I THINK YOU SHOULD ALSO FOLLOW-UP ON THE WELL KNOWN POWER STEERING ISSUE WITH THE '01 AND '02 MODELS. THERE ARE LIKELY STILL HUNDREDS OF THESE VEHICLES STILL ON THE ROAD. WORSE, EVEN THOUGH THIS ISSUE WAS ADDRESSED BY A FACTORY RECALL  (NHTSA ASSIGNED RECALL NO. 00V-285) TOYOTA PLACED A 5 YEAR LIMIT ON THE WARRANTY SERVICE. WHAT IS WORSE, ONCE THE RECALL REPLACEMENT HAS BEEN PERFORMED, TOYOTA WILL NO LONGER PERFORM FURTHER REPLACEMENTS AT THEIR COST. IF THE FAILURE SHOULD HAPPEN AGAIN, AS IT DID FOR ME AS A THIRD OWNER OF THE VEHICLE, IT IS AN EXPENSIVE REPLACEMENT (AT OVER $1,300 USD). AT THIS POINT TO MY BEST KNOWLEDGE ANY CURRENT OWNER OF AN '01 PRIUS OR CERTAIN MODELS OF THE '02 PRIUS ARE GAMBLING THAT AN ESSENTIAL SAFETY RELATED COMPONENT OF THE CAR SUCH AS THE ELECTRIC ASSIST POWER STEERING WILL NOT FAIL. IT REMAINS COMPLETELY UNCLEAR TO ME THAT THE REPLACEMENT POWER STEERING ASSIST UNITS ON THESE MODELS ARE ANY MORE HEALTHY AND IMMUNE TO THE PROBLEM THAT WERE THE ORIGINAL UNITS THAT WERE SUBJECT TO RECALL, SINCE MINE FAILED ON ME AFTER HAVING BEEN REPLACED.    AS FURTHER EVIDENCE I CITE THE OPERATION FLOW CHART I IN THE SSC Y05 TECHNICAL INSTRUCTION UPDATE  FROM YOUR OWN WEBSITE AT WHICH SHOWS THAT EVEN FOR VEHICLES THAT FELL WITHIN THE WARRANTY TIME PERIOD, TOYOTA FELT THAT IF THE WORK HAD BEEN DONE ONCE, IT DID NOT HAVE TO BE DONE AGAIN.    HTTP://NHTHQNWWS112.ODI.NHTSA.DOT.GOV/ACMS/DOCSERVLET/ARTEMIS/PUBLIC/RECALLS/2000/V/RCORRD-00V285-3651.PDF    IN MY CASE, THE REPAIR WAS EXPENSIVE ENOUGH I TRADED THE VEHICLE RATHER THAN REPAIR IT. I DO NOT KNOW WHETHER THE DEALER REPAIRED THE VEHICLE BEFORE IT WAS RESOLD AND THAT IS MY GREATEST CONCERN.    I URGE THE NHTSA TO RE-OPEN AN INVESTIGATION INTO THIS ISSUE, SINCE THE PRIUS IS ALREADY UNDER INVESTIGATION FOR ACCELERATION ISSUES. *TR",
        "vin": "JT2BK12U610"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "12/21/1996",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305949,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/21/06 THE BRAKE PEDAL WENT TO THE FLOOR, AS I TRIED TO STOP FOR A LIGHT. HAD TO USE THE PARK BRAKE TO STOP. PRIOR TO THIS MY WIFE COMPLAIN SEVERAL TIME THAT THE PEDAL WAS SOFT AND WENT DOWN. WE COMPLAIN SEVERAL TIME ABOUT THAT AND THE ABS LIGHT COMING ON, ANSWER WE CAN NOT FINE ANYTHING. ON 01/10/07 THE ABS LIGHT DID NOT GO AWAY THEY REPLACED THE MASTER BRAKE CYL. NOT FIX THEY REPLACED ABS ACTUATOR ASSY FIX  12/10/09 BRAKE LIGHT AND ABS ON, BRAKE PEDAL TO THE FLOOR. *TR",
        "vin": "JT2BK12U210"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "02/03/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304253,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2001 TOYOTA PRIUS, PURCHASING THE CAR IN 2002.  EVER SINCE I HAVE HAD IT, I HAVE NOTICED IT TEMPORARILY LOSES BRAKING AFTER DRIVING RELATIVELY SLOWLY -- 5 TO 20 MPH -- OVER A POTHOLE THAT HITS JUST ONE WHEEL.  IT IS A RECURRING PROBLEM.  I COMPLAINED TO THE DEALERSHIP IN 2002 AND WAS TOLD THAT THERE WAS NO PROBLEM AND THAT IT WAS PROBABLY THE WAY THE ANTI-LOCK BRAKE SYSTEM WORKED.  I NOW KNOW THAT IF THERE IS A POTHOLE NEAR WHERE I WANT TO COME TO A STOP, I MAY HAVE TO LIFT MY FOOT OFF THE BRAKE AND THEN REAPPLY THE BRAKE WHEN GOING SLOW OR JUST PRESS HARDER ON THE BRAKE.  IT DOES NOT HAPPEN THAT OFTEN, BUT IT DOES RECUR; WHILE I HAVE INDICATED A DATE IN ANOTHER FIELD OF THIS REPORT, IT IS TODAY'S DATE BECAUSE THE PROBLEM IS RECURRENT, ALTHOUGH PROBABLY NOT MORE OFTEN THAN A FEW TIMES PER YEAR, AND I CANNOT SAY WHEN IT LAST HAPPENED WITH ANY PRECISION.  I AM NOW REPORTING THIS TO YOU BECAUSE I NOTICED AN ARTICLE IN THE NY TIMES REGARDING WHAT SOUNDS LIKE THIS VERY SAME PROBLEM.  I HAVE NOT HAD ANY ACCIDENTS AS A RESULT OF THE PROBLEM. *TR",
        "vin": "JT2BK12U110"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "08/20/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304256,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWNED A 2001 TOYOTA PRIUS.  IN AUGUST 2009 AT ABOUT 113,000 MILES IT LOST BRAKE. THERE WAS A VERY VERY LITTLE BIT BRAKE. IF YOU WANT TO STOP IN 50 FEET IT WOULD STOP IN ABOUT 200 FEET.  SINCE IT WAS VERY UNSAFE TO DRIVE I TRADED IT IN AND BOUGHT ANOTHER CAR.    I STRONGLY BELIEVE IT WAS A SOFTWARE PROBLEM NOT A MECHANICAL PROBLEM.  WHEN THE PROBLEM STARTED THE ABS, BRAKE AND BIG CAUTION SIGN LIGHTS CAME ON, AND ALSO A CONTINUOUS SHARP AND ANNOYING BEEP STARTED.  ON MY WAY HOME AFTER I MADE A DEAL TO TRADE IN THE PRIUS, THE BEEP WENT AWAY, BUT THE LIGHTS STILL ON,  AND THE BRAKE STARTED TO WORK PROPERLY.  THE NEXT DAY SEPTEMBER 1ST 2009 WHILE DRIVING IN TOWN ALL THE LIGHTS ALSO WENT AWAY AND THE CAR BECAME PERFECTLY NORMAL.  I DROVE THE CAR ONLY ABOUT 30 MILES, WHICH WAS TO THE NEW CAR DEALER AND BACK, SINCE THE PROBLEM STARTED IN AUGUST.     I HAD ALL THE SAME LIGHTS CAME ON IN FEBRUARY 2008.  HOWEVER, THE BRAKES WERE WORKING A LITTLE SLOW WITH A DIFFERENT FEELING.  TO REPAIR THIS ONE DEALER ASKED $2500 AND ANOTHER DEALER REPAIRED IT FOR $400.  THEY SAID THEY FOUND A BROKEN WIRE IN THE ABS SYSTEM.  NOW I SUSPECT IT MIGHT HAVE BEEN A SOFTWARE PROBLEM ALSO.    THE BRAKE PROBLEM PEOPLE ARE REPORTING MAY EXIST IN MANY MORE VEHICLES THAN REPORTED.  THE CARS MAY BE GETTING TOO MUCH ELECTRONICS THAN NEEDED.  TOO MUCH OF ANYTHING IS NOT GOOD.  *TR",
        "vin": "JT2BK12U810"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "01/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304278,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I SAW THAT THE JAPANESE GOVERNMENT IS MAKING TOYOTA LOOK INTO THE FOLLOWING COMPLAINT IN NEWER MODEL PRIUSES.  \"THE VEHICLE SURGED FORWARD OR TEMPORARILY LOST BRAKING AFTER DRIVING OVER A POTHOLE OR OTHER UNEVEN SURFACE.  THIS IS A REOCCURING PROBLEM.\"  MY 2001 PRIUS HAS THIS PROBLEM ALL THE TIME.        IN ADDITION THE CAR HAD THE HYBRID BATTERIES CATCH ON FIRE , THE CATALYTIC CONVERTER FAIL, THE ECU FOR THE BRAKES FAIL, THE POWER STEERING FAIL, THE BRAKE PUMP LEAK, THE COMPUTER FAIL (WHICH CAUSED THE CAR TO IMPROPERLY SHIFT GEARS).  THESE ISSUES WERE ALL FIXED FOR FREE BY TOYOTA EXCEPT THE ECU FOR THE BRAKES AND THE BRAKE PUMP WHICH WERE FIXED, BUT AT MY EXPENSE.  NO INJURIES OCCURED.  *TR",
        "vin": "JT2BK12U110"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304385,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ALONG ON INTERSTATE, GOT WARNING TRIANGLE AND LOW MAIN BATTERY INFORMATION. IMMEDIATELY, CAR BEGAN TO SPEED-UP ON ITS OWN. I APPLIED VERY HARD BRAKING TO TRY AND SLOW DOWN WHILE TRYING TO MOVE TO THE RIGHT LANE WITH TRAFFIC ON MY RIGHT. CAR DID NOT SLOW DOWN BUT I MANAGED TO AVOID TRAFFIC AND GET ONTO THE RIGHT LANE, WHERE THERE WAS AN EXIT FROM THE INTERSTATE. I MADE THE EXIT AND WAS ABLE TO GET CONTROL OF THE ACCELERATION. I THEN DROVE THE ROUGH RUNNING CAR TO THE MY DEALER OFF THAT EXIT. THEY REPLACED THE MAIN BATTERY, AND EVERYTHING IS NOW FINE. I FEEL THAT I WAS VERY LUCKY THAT NOBODY GOT HURT! *TR",
        "vin": "JT2BK12U510"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/11/2010",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299020,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS. HE STATED THAT THE POWER STEERING CONTINUED TO FAIL INTERMITTENTLY. HE HAD TO STOP AND SHUT THE ENGINE OFF AT EACH FAILURE IN ORDER FOR THE STEERING TO RESET ITSELF. THE MANUFACTURER WAS CONTACTED AND ALTHOUGH THERE WAS A RECALL, HIS VIN WAS NOT INCLUDED IN THE RECALL CAMPAIGN NUMBER  00V285000, STEERING GEAR BOX, OTHER THAN RACK AND PINION. NO REPAIRS WERE MADE TO DATE. THE CURRENT AND FAILURE MILEAGES WERE UNDER 105,256.",
        "vin": "JT2BK12U310"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/08/2009",
        "dateOfIncident": "12/04/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 TOYOTA PRIUS.  SPORADICALLY, THE STEERING WILL SHAKE VIOLENTLY.  IT SEEMS TO HAPPEN WHEN I TURN THE STEERING WHEEL.  MECHANICS CANNOT FIGURE OUT WHAT IS WRONG.  THIS PAST WEEKEND THE POWER STEERING WARNING LIGHT WHEN ON AND I LOST POWER STEERING.  IT CAME BACK ON WHEN I STOPPED THE CAR SO IT MAY BE A COMPUTER GLITCH.  THE SHAKING IS GETTING WORSE. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "07/13/2009",
        "dateOfIncident": "08/25/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10276529,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS.  WHILE DRIVING 65 MPH, THE VEHICLE LOST ALL POWER AND ALL OF THE INSTRUMENT PANEL LIGHTS ILLUMINATED.  THE VEHICLE BEGAN TO LOSE SPEED AND THE CONTACT WAS ABLE TO SAFELY MANEUVER IT TO THE SHOULDER.  WHILE ON THE SHOULDER, THE VEHICLE RESTARTED WITHOUT WARNING AND REVERSED FULL THROTTLE INTO THE GUARD RAIL.  THE CONTACT SUSTAINED HEAD AND EYE INJURIES AND A BROKEN RIB.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY PERFORMED A DIAGNOSTIC, WHICH DID NOT PRODUCE ANY ERROR CODES.  THE FAILURE COULD NOT BE DUPLICATED.  THE BODY DAMAGE WAS REPAIRED AT THE COST OF $500, BUT THE FAILURE WAS NOT CORRECTED.  THE MANUFACTURER STATED THAT IF A FAILURE OCCURRED, THE VEHICLE WOULD CORRECT ITSELF AND WOULD NOT DISPLAY ANY FAILURE CODES TO DETERMINE THE CAUSE OF THE FAILURE.  THE CONTACT WAS ADVISED TO TAKE THE VEHICLE BACK TO THE DEALER FOR FURTHER INSPECTION.  THE CONTACT HAS EXPERIENCED MULTIPLE FAILURES WITH THE VEHICLE SINCE IT WAS PURCHASED.  SHE IS CURRENTLY NOT DRIVING THE VEHICLE AND IT IS AT THE REPAIR SHOP BEING INSPECTED FOR THE REVERSING FAILURE AND FOR RESETTING THE COMPUTER MEMORY.  THE FAILURE MILEAGE WAS 32,000.",
        "vin": "JT2BK12U410"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/02/2009",
        "dateOfIncident": "09/09/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10275614,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS.  WHILE DRIVING BETWEEN 65-70 MPH, THE VEHICLE DID NOT RESPOND WHEN THE ACCELERATOR PEDAL WAS DEPRESSED.  ALL OF THE INSTRUMENT PANEL INDICATORS ILLUMINATED AND THE ENGINE SUDDENLY STALLED.  THE VEHICLE COASTED TO THE SIDE OF THE ROAD AND THE ENGINE FAILED TO RESTART.  WHILE THE GEAR SHIFTER WAS PLACED IN PARK, THE VEHICLE ACCELERATED UNEXPECTEDLY AND CRASHED INTO A GUARDRAIL.  THE DRIVER SUSTAINED A WHIPLASH AND A POLICE REPORT WAS FILED.  THE VEHICLE SUSTAINED SEVERE DAMAGE AND WAS TOWED TO AN AUTHORIZED DEALER.  THE VEHICLE WAS REPAIRED FOR BODY STRUCTURE DAMAGES.  THE TECHNICIAN PERFORMED DIAGNOSTIC TESTS, BUT WAS UNABLE TO DUPLICATE THE FAILURES.  THE VEHICLE WAS TAKEN BACK TO THE AUTHORIZED DEALER ON FIVE SEPARATE OCCASIONS FOR IDENTICAL FAILURES, BUT THERE WERE NO RESOLUTIONS.  THE FAILURE MILEAGE WAS 42,000 AND CURRENT MILEAGE WAS 68,000.",
        "vin": "JT2BK12U410"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2009",
        "dateOfIncident": "11/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260512,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HV BATTERY FAILURE,  PRIOR TO FAILURE OF HV BATTERY VEHICLE EXHIBITED ERROR CODES INDICATING THAT AT LEAST TWO BATTERY MODULES HAD A GREATER THAN 1.2 VOLTS BETWEEN MAX MODULE VOLTAGE AND MIN MODULE VOLTAGE (HV BATTERY CONSIST OF 38 BATTERY MODULES 7.2 VOLTS EACH).   HOWEVER, VEHICLE STILL OPERATED ALTHOUGH IN A FAIL SAFE MODE (NO CRUISE CONTROL IN FAIL SAFE MODE, ETC).  UPON ATTEMPTING TO START VEHICLE HEARD LOUD EXPLOSIVE POP SOUND AND VEHICLE WOULD THEN NOT START.        AFTER REMOVAL AND DISASSEMBLY THE HV BATTERY PACK I DISCOVERED THA  TWO BATTERY MODULES, OUT OF THE TOTAL OF 38, HAD A CIRCULAR BURN BETWEEN THEIR AJOINING PLASTIC CASES AND THE TOP OF ONE OF THE TWO MODULES HAD EXPLODED OPEN -- EXPOSING THE BATTERY PLATES INSIDE (BOTH BURNED CELLS NO LONGER MEASURED 7.2 VOLTS, BUT ABOUT 0.32 VOLTS).  BURNT SMOKE RESIDUE SHOWED ON TOP OF THE HV BATTERY PACK INSIDE METAL HOUSING AS WELL AS ON THE ONE BATTERY MODULE THAT HAD AN EXPLODED TOP.  I REPLACED THE HV BATTERY PACK NO FURTHER ERROR CODES HAVE BEEN NOTED SINCE REPLACEMENT.  DAMAGED MODULES SHOWED EVIDENCE OF AN EXPLOSIVE FORCE OCCURRING AND BURNING OR SHORTING BETWEEN BATTERY MODULES. *TR",
        "vin": "JT2BK12U610"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/15/2009",
        "dateOfIncident": "01/02/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258719,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKES VIOLENTLY WHEN BACKING WHEN BACKING UP AFTER MORNING START UP, THIS HAS BEEN REPORTED TO DEALER SEVERAL TIMES AND THEY WERE UNABLE TO CONFIRM PROBLEM, THE PROBLEM CONTINUES AND WE NOW HAVE LIGHT MOVEMENT OF THE STEERING WHEEL WHEN MOVING FORWARD AT HIGHWAY SPEEDS IN A STRAIT LINE THIS MOVEMENT IS A SLIGHT TUG FROM LEFT TO RIGHT. THE WARNING INDICATOR HAS COME ON AND IS RESET WHEN RESTARTING, LOOKING AT THE 2000 RECALL IT SOUNDS LIKE THE SAME CONDITION. *TR",
        "vin": "JT2BK12U810"
    },
    {
        "components": "ELECTRICAL SYSTEM,STEERING",
        "crash": false,
        "dateComplaintFiled": "11/25/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250308,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FROM SENATOR BROWN ON BEHALF OF CONSTITUENT, RE PROBLEMS WITH HIS 2001 PRIUS.  *NJ  A SAFETY ALERT WAS ISSUED FOR THE FAILURE OF THE MAIN COMPUTER, WHICH RESULTED IN THE ENGINE SHUTTING ITSELF OFF. THE CONSUMER STATED THE COMPUTER FAILED ON HIS VEHICLE AFTER 1 YEAR OF SERVICE. IT TOOK TOYOTA 18 MONTHS TO IDENTIFY THE PROBLEM.  AFTER A COSTLY REPLACEMENT OF THE ACCELERATOR PEDAL, THE ECM WAS FINALLY REPLACED.  THE CONSUMER DISCOVERED A TECHNICAL SERVICE BULLETIN HAD BEEN ISSUED REGARDING THE REPLACEMENT OF THE ECM. THE CONSUMER STATED THE ECM WAS DEFECTIVE WHEN IT LEFT THE FACTORY, HOWEVER TOYOTA WAS NOT WILLING TO TAKE ANY RESPONSIBILITY FOR THE REPAIRS, BECAUSE THE CAR WAS TOO OLD. THE POWER STEERING HAD TO BE REPLACED TWICE.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2008",
        "dateOfIncident": "11/05/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247848,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL ON 2001 TOYOTA PRIUS FAILED. TOYOTA KNOWS ABOUT THE PROBLEM AND REFUSES TO ACKNOWLEDGE. THEY HAVE HAD ENOUGH FIXES THAT THEY HAD TO GO BACK AND FIX THE REPAIR MANUAL. THEY CHOSE TO IGNORE THE ISSUE AND SAY IT'S NOT A PROBLEM. LUCKILY I WAS DRIVING ON A NON MAJOR ROAD AND WAS NOT KILLED.*TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/28/2008",
        "dateOfIncident": "10/26/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247098,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE'S 2001 TOYOTA PRIUS WITH 108K MILES STOPPED BEING ABLE TO BE DRIVEN WHEN SHE WAS DRIVING IT HOME.  IT STOPPED ON A MAJOR HIGHWAY AND MORE WARNING LIGHTS THAN I'D EVER SEEN CAME ON.  IT WOULD NOT DRIVE MORE THAN A FEW MPH AND WOULD SHAKE AND RUN ROUGHLY.  IT HAD TO BE TOWED APPROX 81 MILES TO A TOYOTA DEALER NEAR OUR HOME.  THEY TOLD US THE TRANSMISSION NEEDS TO BE REPLACED FOR ABOUT $7000 INCLUDING LABOR.  AFTER DOING SOME RESEARCH ONLINE, I FOUND THAT THIS IS A SOMEWHAT COMMON PROBLEM WITH OTHER OWNERS (PRIUSCHAT.COM).  ALSO, THAT THERE WERE SEVERAL REFERENCES TO TOYOTA COVERING PART OR MOST OF THE BILL, EVEN ON VEHICLES NOT UNDER WARRANTY.  IF THAT'S NOT ADMITTING A DEFECT, I DON'T KNOW WHAT IS. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/27/2008",
        "dateOfIncident": "10/17/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246780,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 PRIUS.  MY CAR HAS THE SAME PROBLEM FOR WHICH THE NHTSA ISSUED A SAFETY ALERT IN 2005, FAILURE OF THE MAIN COMPUTER, RESULTING IN THE GASOLINE ENGINE'S SHUTTING ITSELF OFF.  THE COMPUTER FAILED AFTER ONE YEAR OF SERVICE.  IT TOOK TOYOTA 18 MONTHS TO IDENTIFY THE PROBLEM.  I HAVE INVOICES DOCUMENTING ALL THE EVENTS THAT OCCURRED.  THE DEALER HAD ME REPLACE THE ACCELERATOR PEDAL ASSEMBLY AT MY COST OF $450 AND REPLACED THE WRONG COMPUTER (THE ONE CONTROLLING THE POWER STEERING).  THIS MONTH I GAVE UP AND HAD A COMPETENT DEALER REPLACE THE ECM.  THE DOCUMENTS I RECEIVED INCLUDED TECHNICAL SERVICE BULLETIN OF JUNE 12, 2003.  THE BULLETIN STATES THAT FOR THE ECM IN THE 2001-2003 MODEL YEAR PRIUS THE ECM PART NUMBER HAS BEEN REVISED.  THE RELEVANT INFORMATION TABLE IS LABELED \"PRODUCTION CHANGE INFORMATION.\"  IN OTHER WORDS THE ECM IN MY CAR WAS DEFECTIVE FROM THE TIME THE CAR LEFT THE FACTORY BUT TOYOTA IS REFUSING TO PAY FOR THE REPAIRS BECAUSE NOW THE CAR IS TOO OLD.  THIS CAR IS A LEMON.  IT IS ONE OF THE FIRST PRIUS GENERATION MARKETED IN THE U.S.  THE POWER STEERING HAD TO BE REPLACED TWICE.  THERE WERE 2 OR 3 OTHER RECALLS AS WELL.  HOWEVER, I AM A RETIRED PROFESSOR AND NOW THAT I HAVE FIXED THE PROBLEM AT MY EXPENSE I NEED TO KEEP THE CAR IN ORDER TO GET TO MY PART-TIME TEACHING JOB.  THE REPAIRS TO THE ECM ALONE HAVE COST ME $1848.19.  I WANT TOYOTA TO REIMBURSE ME.  THANK YOU IN ADVANCE FOR ANY HELP YOU CAN PROVIDE.  BY THE WAY, A SAFETY ALERT ON THESE MODELS AS USED PURCHASES MIGHT BE A GOOD IDEA.  G.JAY WEINROTH *TR",
        "vin": "JT2BK12U910"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2008",
        "dateOfIncident": "05/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235448,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF A 2001 TOYOTA PRIUS. IN 2002, WE EXPERIENCED A SHUTTER AND LOSS OF POWER STEERING WHEN TURNING THE STEERING WHEEL AT LOW SPEEDS. THE ELECTRIC MOTOR-ASSISTED POWER STEERING (EMPS) RACK HAD FAILED AT 13,396 MILES. TOYOTA REPLACED THE EMPS RACK UNDER WARRANTY. IN 2006 AT 65,427 MILES, WE REPORTED TO TOYOTA THAT THE POWER STEERING FAILED WHILE MAKING A TURN AND THE INSTRUMENT WARNING LIGHTS ILLUMINATED. FORTUNATELY, WE WERE ABLE TO BRING THE VEHICLE TO A SAFE STOP. TOYOTA REPLACED THE SECOND RACK AT NO CHARGE. IN 2008 AT +105,000 MILES, WE EXPERIENCED A NOISE IN THE FRONT END THAT SOUNDED LIKE RUBBER BUSHINGS SQUEAKING WHEN THE STEERING WHEEL WAS TURNED FROM LEFT TO RIGHT. TOYOTA INFORMED US THE EMPS RACK HAD FAILED A THIRD TIME. TOYOTA ALSO TOLD US THAT IT IS NOT THEIR RESPONSIBILITY TO CORRECT THE PROBLEM, BUT WAS WILLING TO PAY FOR THE NEW PARTS AND NOT THE LABOR.    A CHECK OF THE INTERNET BLOGS INDICATES THAT FAILURE OF THE EMPS IS A COMMON PROBLEM WITH THE FIRST GENERATION PRIUS, FIRST INTRODUCED IN 2001. NUMEROUS OWNERS HAVE REPORTED EMPS FAILURE ON THEIR VEHICLES. SECOND OWNERS OF THE PRIUS APPEAR TO BE LESS LIKELY TO GET A SATISFACTORY RESOLUTION OF THIS PROBLEM FROM TOYOTA THAN FIRST OWNERS.    UNEXPECTED LOSS OF POWER STEERING WHILE TURNING THE VEHICLE CAN BE A SCARY AND UNEXPECTED EVENT POTENTIALLY LEADING TO LOSS OF CONTROL OF THE VEHICLE AND PERSONAL INJURY.     I STRONGLY RECOMMEND THAT NHTSA INVESTIGATE THIS SITUATION.  *TR",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/19/2008",
        "dateOfIncident": "04/14/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224988,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2007 I HAD A SIDE IMPACT WITH MY VEHICLE.  I TOLD TOYOTA TO CHECK FOR ANY DAMAGE WITH THE COMPUTER COMPONENTS IN THE CAR.  THEY SAID THEY CHECKED EVERYTHING OUT AND SAID IT WAS FINE.  MONDAY I HAD THE COMPUTER AND INVERTER GO OUT ON MY 2001 TOYOTA PRIUS AND I ASKED MY INSURANCE COMPANY AAA TO CHECK IF IT COULD BE RELATED TO THE ACCIDENT.  THERE RESPONSE SAID IT WAS INTERNAL SHORTS IN THE SYSTEM NOT CAUSED BY THE ACCIDENT.  THE HYBRID COMPUTER AND ELECTRONIC SYSTEM JUST DECIDED TO SHORT OUT.  THE COST TO GET IT REPAIR IT IS $4,800.00.  THE MILEAGE IS 190,000, PAST WARRANTY.  NOTHING IS WRONG WITH THE ENGINE PART JUST THE COMPUTER ELECTRICS PART.  I DON'T HAVE THAT KIND OF MONEY AND I STILL OWE $10,100 ON IT YET.  *TR",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/21/2008",
        "dateOfIncident": "03/05/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221958,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS.  WHILE DRIVING AT ANY SPEED, THE STEERING WHEEL VIBRATES.  THE FAILURE WORSENS WHEN MAKING LEFT AND RIGHT TURNS.  THE FAILURE HAS OCCURRED EVER SINCE THE VEHICLE WAS PURCHASED.  THE VEHICLE HAS NOT BEEN TAKEN TO A DEALER.  THE CURRENT MILEAGE WAS 69,110 AND FAILURE MILEAGE WAS 69,012.",
        "vin": "JT2BK12U810"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "10/15/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205762,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 PRIUS FUEL TANK WAS DISCOVERED TO HAVE A PIN LEAK AND HAD TO BE REPLACED. PRIOR TO FINDING RIGHT AFTER 100,000 MILES THE CHECK ENGINE LIGHT STARTED COMING ON.  *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/12/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202803,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS.  WHILE DRIVING BETWEEN 2-5 MPH, THE STEERING WHEEL WOULD INTERMITTENTLY SHAKE.  THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE.  THE FAILURE MILEAGE WAS 26,000 AND CURRENT MILEAGE WAS 27,000.  UPDATED 01/11/08.  *LJ  THE CONSUMER WAS TOLD HE WOULD BE CHARGED FOR REPLACING THE STEERING RACK. UPDATED *JB",
        "vin": "JT2BK12U610"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/20/2007",
        "dateOfIncident": "08/11/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200183,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A 2001 TOYOTA PRUIS I OWN HAS DEVELOPED AN INTERMITTENT BUT SEVERE STEERING WHEEL SHAKE OVER THE LAST 4 MONTHS. IT IS CONSISTENT WITH A WARRANTY ENHANCEMENT NOTICE WE RECEIVED FROM TOYOTA IN 2004 (NHTSA ITEM NUMBER 10007669). TO DATE THE PROBLEM HAS ONLY OCCURRED AT VERY LOW SPEEDS, MOSTLY WHEN BACKING OUT OF A PARKING SPOT OR THE DRIVEWAY. THE SHAKING / RATTLE IS EXTREMELY SEVERE, SHAKING THE STEERING WHEEL SO HARD IT IS IMPOSSIBLE TO HOLD ON TO IT. IT LASTS FROM LESS THEN ONE TO 4 OR 5 SECONDS. IF IT WAS EVER TO OCCUR AT ANY REAL SPEED, LOSS OF CONTROL IS A CERTAINTY. DUE TO THE INTERMITTENT NATURE, I HAVE NOT BEEN ABLE TO GET MY DEALER TO \"DIAGNOSE\" THE PROBLEM, WHEN I TOOK IT IN WITH THIS COMPLAINT. SINCE THEN,  I HAVE DISCUSSED THE ISSUE WITH FREMONT TOYOTA'S CUSTOMER SERVICE REPRESENTATIVE, THE DEALERS SERVICE MANAGER, E-MAILED TOYOTA'S NATIONAL HEADQUARTERS (THEY RECORDED IT AS FILE NUMBER 200706250915); AND CALLED TOYOTA'S CUSTOMER EXPERIENCE CENTER WITHOUT A SATISFACTORY RESULT. I AM TOLD THE SERVICE CENTER NEEDS TO EXPERIENCE THE PROBLEM BEFORE TOYOTA WOULD AUTHORIZE A REPAIR. DUE TO THE INTERMITTENT NATURE, I EITHER HAVE TO BEAR THE COST OF SUBSTITUTE TRANSPORTATION WHILE LEAVING THE CAR AT THE DEALER FOR AN EXTENDED PERIOD OF TIME UNTIL A DIAGNOSIS IS MADE, OR CONTINUE DRIVING THE CAR UNTIL THE PROBLEM BECOMES SEVERE ENOUGH TO CAUSE AN ACCIDENT. GIVEN THAT THIS PROBLEM IS KNOWN TO TOYOTA, I FAIL TO SEE WHY A REPAIR IS NOT AUTHORIZED. I CANNOT BELIEVE THAT THIS KNOW PROBLEM CANNOT BE VERIFIED WITHOUT ACTUALLY EXPERIENCING IT EMPIRICALLY. *TR",
        "vin": "JT2BK12U910"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/14/2007",
        "dateOfIncident": "08/03/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199569,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS.  SHE STATED THE VEHICLE WOULD SHUDDER AND THE STEERING WHEEL WOULD VIBRATE WHEN SHIFTED INTO REVERSE.  THE POWER STEERING WARNING LIGHT ILLUMINATED.  THERE IS A SAFETY RECALL FOR POWER STEERING GEAR RACK AND PINION (NHTSA CAMPAIGN #00V285000).  THE CURRENT MILEAGE WAS 92,000 AND THE FAILURE MILEAGE WAS 91,000.    UPDATED 01-15-08.  *KB  UPDATED *JB",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2007",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197602,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS.  THE CONTACT STATED THAT THE STEERING WHEEL SHAKES WHEN TURNING IT IN ANY DIRECTION.  THE FAILURE HAS BEEN PRESENT SINCE THE SUMMER OF 2006.  ON JULY 16, 2007, THE VEHICLE WAS TAKEN TO THE DEALER.  THE DEALER STATED THAT THE STEERING GEAR RACK AND PINION ASSEMBLY HAS AN INTERNAL GEAR THAT FAILED.  THE MANUFACTURER STATED THAT THE CONTACT COULD PAY FOR THE REPAIR IN FULL AND THEY WOULD REIMBURSE HIM FOR THE PARTS.  THE POWERTRAIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 33,837 AND FAILURE MILEAGE WAS 30,000.",
        "vin": "JT2BK12U810"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2007",
        "dateOfIncident": "07/16/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197158,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 PRIUS HAS ALWAYS BEEN STALLING (AT LEAST 30 TIMES), USUALLY UPON STARTUP, (AND ESPECIALLY IN HOT WEATHER WHEN AC IS ON AT STARTUP) BUT ON 4 OCCASIONS, STALLS OCCURRED DURING CRITICAL DRIVING IN DANGEROUS AREAS RESULTING IN TOTAL POWER LOSS AND NEAR DEATH EXPERIENCES.  I INFORMED TOYOTA PRESIDENT WATANABE, AND THEY RECALLED FOR THE \"CRANKSHAFT POSITION SENSOR\", TO FIX THE STALLING PROBLEM, BUT IT OBVIOUSLY DIDN'T FIX SITUATION BECAUSE CAR IS STILL STALLING.  DEALER IS BEYOND IGNORANT AND CLUELESS AND NO LONGER WORTH TALKING TO, AS THEY ARE AS INFORMED AS A ROCK ON A CLIFF.  I AM WONDERING IF DEALER EVEN PERFORMED THE RECALL FIX PROPERLY.  WOULD LIKE A TRUSTWORTHY TOYOTA TECHNICIAN FROM JAPAN'S TMC (A JAPANESE PERSON) TO PERSONALLY INSPECT MY CAR.",
        "vin": "JT2BK12U910"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/20/2007",
        "dateOfIncident": "06/03/2007",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193834,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA PRIUS.  THE CONTACT WALKED OUTSIDE AND NOTICED THAT THE VEHICLE'S WINDOWS WERE BLACK.  SHE OPENED THE DOOR AND SMOKE BILLOWED OUT OF THE VEHICLE.  SHE SHUT THE DOOR AND CALLED THE FIRE DEPARTMENT.  THE WEATHER WAS DRY AND SUNNY.  THE PURCHASE DATE AND POWERTRAIN WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 79,000.",
        "vin": "JT2BK12U710"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2007",
        "dateOfIncident": "06/04/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193389,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUXILIARY BATTERY ON TOYOTA PRIUS 2001 AND TOYOTA PRIUS 2004 FAIL IF THE CAR IS NOT DRIVEN AT LEAST EVERY 7-10 DAYS.  THIS PREVENTS THE CAR FROM STARTING.  WE PURCHASED A 2001 PRIUS USED MARCH 2004, AND A NEW 2004 PRIUS IN JUNE 2004.  THE AUXILIARY BATTERY FAILED ON THE 2001 PRIUS TWICE, AND WE REPLACED IT ONCE.  RECENTLY THE DEALER SERVICE REP TOLD US THAT IT IS A KNOWN PROBLEM THAT THE BATTERY WILL NOT HOLD A CHARGE UNLESS DRIVEN EVERY 7-10 DAYS, AND SHOULD BE \"DISCONNECTED\" IF PARKED FOR \"PROLONGED TIME.\"  THIS IS POTENTIAL SAFETY PROBLEM FOR CAR NOT STARTING, SUCH AS IF RETURNING ON PLANE AFTER 2-3 WEEK VACATION AND NOT BEING ABLE TO START THE CAR, RISK FOR VULNERABILITY AWAITING JUMP START.  TOYOTA'S ONLY RESPONSE IS \"WELL, IT'S A HYBRID.\"  THEY SAY THE \"HUNDREDS OF COMPUTERS IN THE CAR DRAIN THE BATTERY WHEN PARKED.\" THEY COULD HAVE DESIGNED IN SOME AUTOMATIC OR SIMPLE SWITCH TO ADDRESS THIS.  THEY ALSO COULD NOTIFY THE POTENTIAL CUSTOMER OF THIS DESIGN FLAW.  THEY DID NOT INFORM US, OR ANY OF THE OTHER PRIUS OWNERS WE HAVE RECENTLY DISCUSSED THE ISSUE WITH.  THE OWNER'S MANUAL FOR 2001 MODEL MAKES NO MENTION OF IT.  IN THE 2004 MANUAL, THERE IS A BRIEF MENTION OF NEED TO DISCONNECT THE BATTERY IF PARKED FOR \"PROLONGED TIME\" BUT DOES NOT DEFINE THAT.  ALTHOUGH WE HAVE BEEN HAPPY WITH OTHER FEATURES OF THE PRIUS AND OTHER TOYOT AS WE OWNED IN THE PAST, WE CONSIDER THIS TO BE A SERIOUS AND RISKY DESIGN FLAW.  FURTHERMORE, WE CONSIDER TOYOTA'S SALES PEOPLE AND SALES BROCHURES FAILURE TO NOTIFY US OF THIS PROBLEM TO BE A SIGNIFICANT BREACH OF GOODWILL AND RESPECT FOR CUSTOMER SAFETY AND SATISFACTION.  *AK",
        "vin": "JT2BK12U310"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/22/2007",
        "dateOfIncident": "02/09/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I  OWN A 2001 PRIUS SINCE MARCH OF 2006. IT RAN FINE FOR ONE YEAR, BUT AFTER THAT ALL I HAD  WAS PROBLEMS.TRANSMISSION EXHAUST SYSTEM AND COMPUTER BOARD ALL OF THIS HAPPENED ONE AFTER ANOTHER TOTAL COST OVER $10,000. TOYOTA  DID NOT WANT TO TAKE RESPONSIBILITY.*AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/27/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189106,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 TOYOTA SEQUOIA.  THE CONTACT STATED THAT THE WELDING ON THE SEAT FRAME OF THE MIDDLE ROW DETACHED AND CAUSED THE SEAT TO SWIVEL AND MOVE.  THE DEALER INSPECTED THE VEHICLE AND PERFORMED THE REPAIR,  BUT WAS UNABLE TO DETERMINE THE CAUSE OF FAILURE.  THE CURRENT MILEAGE IS 109,000 AND FAILURE MILEAGE WAS UNKNOWN.*AK",
        "vin": "5TDBT44A21S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/11/2007",
        "dateOfIncident": "04/05/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187628,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL TIMES WHEN THE ACCELERATOR WAS PRESSED AND THE CAR SLOWED  DOWN THE CHECK ENGINE LIGHT CAME  ON.  VEHICLE WILL DRIVE NORMALLY FOR AWHILE, BUT PROBLEM SEEMED  TO OCCUR AT LEAST ONCE EVERY 1-2 YEARS.  THE LAST TIME, I SPENT $900 TO REPLACE AN ACCELERATOR SENSOR.  THIS TIME, THE DEALERSHIP STATED  I NEEDED  TO REPLACE THE ECM, AND THE CATALYTIC CONVERTER FOR A TOTAL CHARGE OF $3500.  THERE  WERE NO GENERIC CATALYTIC CONVERTERS, THE  ONE  TO BE USED  WAS  $1700.  ALSO, HAD  BEEN SEVERAL INCIDENTS WHERE THERE HAD BEEN ISSUES FOLLOWING AN OIL CHANGE WHERE THE DEALER SAID THAT OIL WAS  WHERE IT SHOULDN'T BE.*AK",
        "vin": "JT2BK12U910"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/10/2006",
        "dateOfIncident": "08/26/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173144,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS  SUDDEN LOSS OF POWER AT HIGHWAY SPEEDS  THREE INCIDENTS    LATE AUG 2006    FIRST WEEK OCT 2006    SECOND WEEK OCT 2006  IN ALL CASES VEHICLE WILL NOT START FOR 15 MINUTES BUT THEN RUNS NORMALLY.  BROUGHT TO DEALER AFTER FIRST INCIDENT AND THEY COMPLETED A RECALL REPLACEMENT OF CRANKSHAFT POSITION SENSOR.  BROUGHT TO DEALER AFTER THIRD INCIDENT    THEY HAVE BEEN UNABLE TO DIAGNOSES PROBLEM OR REPRODUCE AFTER 90 MILES TEST DRIVING.   CALL TO TOYOTA CUSTOMER SERVICE LINE REVEALED    TOYOTA HAS NO CENTRAL POINT TO COLLECT VEHICLE SAFETY PROBLEMS    WHEN SPECIFICALLY ASKED IF TOYOTA WAS INTERESTED IN DISCOVERING THE SAFETY PROBLEM IN MY VEHICLE, THE ANSWER WAS \"NO\"  I HAVE BEEN REASSURED BY TOYOTA THAT    THE CRANKSHAFT POSITION SENSOR REPLACEMENT WAS PERFORMED PROPERLY    THERE IS NO SOFTWARE PROBLEM WITH 2001 PRIUS SIMILAR TO THE 2004 PRIUS PROBLEM WHICH RESULTED KIN SUDDEN LOSS OF POWER AND LEAD TO RECALL ACTION.    THEY ARE UNAWARE OF ANY PROBLEM SIMILAR TO MINE WITH 2001 PRIUS.  *JB",
        "vin": "JT2BK12U510"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/05/2006",
        "dateOfIncident": "11/04/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172651,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PT901-42601-45",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "REPEATED INCIDENTS OF STALLING OF THE GASOLINE ENGINE. BATTERY CONTINUES TO FUEL VEHICLE AT LOW SPEED. WILL RESTART AFTER SHUTTING THE ENGINE OFF. CONTINUES TO DO THIS AT ANY AND ALL SPEEDS.  HAVE HAD VEHICLE GAS TANK BLADDER REPLACED AT OUR EXPENSE (OVER 600.00) COMPUTERS REPLACED (MULTIPLE) ON RECALLS. NOT ONLY A NUISANCE BUT VERY DANGEROUS. DEALER HAS GIVEN NO HELP IN FINDING THE CAUSE.   *NM",
        "vin": "JT2BK12U910"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/25/2006",
        "dateOfIncident": "09/20/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169225,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRIEND WAS DRIVING MY 2001 TOYOTA PRIUS ON THE HIGHWAY, GOING 65 MPH.  I WAS IN THE PASSENGER SEAT.  A WARNING SYMBOL WITH THE TRIANGLE/EXCLAMATION MARK APPEARED ON MY SCREEN.  THE ENGINE IMMEDIATELY DIED.   WE TRIED TO GET OFF OF THE ROAD.  MACK TRUCKS WERE SWERVING INTO THE EXIT LANES TO GET OUT OF THE WAY.     <P>    WE WERE ABLE TO PULL OFF ONTO THE SHOULDER.  THIS IS EXTREMELY DANGEROUS FOR ME, MY PASSENGERS AND OTHER DRIVERS ON THE HIGHWAY.    <P>    YOUR AGENCY HAS INVESTIGATED THIS EXACT PROBLEM, WHICH LED TO A RECALL BY TOYOTA.  TOYOTA BLAMED THE PROBLEM ON A \"SOFTWARE GLITCH.\"  THE PROBLEM IS GOES MUCH DEEPER THAN A ''SOFTWARE GLITCH'' -'' IT REMAINS UNRESOLVED.  I HAD MY CAR SERVICED FOR THIS ''SOFTWARE GLITCH'' RECALL (ENGINE'S COMPUTER (ECM) REPLACED AND CIRCUIT OPEN RELAY CHECKED), BUT THE PROBLEM STILL PERSISTS.  THE ENGINE STILL CUTS OUT AT HIGH SPEEDS.      MY CAR HAS HAD THIS EXACT PROBLEM BEFORE AND AFTER GETTING IT SERVICED BASED ON THE RECALL ON THREE SEPARATE OCCASIONS.  THIS LIFE AND DEATH DEFECT NEEDS A BETTER SOLUTION THAN SIMPLY ATTRIBUTING IT TO A \"SOFTWARE GLITCH.\" *JB",
        "vin": "JT2BK12U710"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2006",
        "dateOfIncident": "09/06/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167510,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLING OCCURRING RANDOMLY WHILE CRUISING AT HIGHWAY SPEED BETWEEN APPROX. 54 TO 64 MPH CAUSING VEHICLE TO SLOW DOWN ON THE FREEWAY.   THIS PROBLEM IS POTENTIALLY HAZARDOUS BECAUSE ENGINE STALLS AT FREEWAY SPEED WHICH COULD RESULT IN REAR END CRASH FROM ON-COMING VEHICLES TRAVELING BEHIND AT FREEWAY SPEEDS --- FURTHERMORE THE VEHICLE MUST BE STOPPED AT THE FREEWAY EDGE TO BE RESTARTED BEFORE PROBLEM IS CORRECTED.   RESTARTING VEHICLE IMMEDIATELY CORRECTS PROBLEM.  HOWEVER, THIS PROBLEM SHOULD BE MADE A MANDATORY RECALL ITEM.  [PRIUS SCANNER SHOWS DTC CODE P1120 FOR ACCELERATOR PEDAL ASSEMBLY PROBLEM AND THERE IS A MANUFACTURER TSB CONCERNING THIS PROBLEM (TSB EG018-02)].    THIS VEHICLE HAS HAD THE CRANKSHAFT SENSOR REPLACED PURSUANT TO THE RECENT RECALL NOTICE AND THE CRANKSHAFT SENSOR HAD BEEN  LEAKING OIL PRIOR TO REPLACEMENT.   ALSO DRIVERS REAR AXLE HUB BEARING FAILED PREMATURELY AND WAS RECENTLY REPLACED.   *JB",
        "vin": "JT2BK12U610"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/28/2006",
        "dateOfIncident": "08/13/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166811,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS, 60649 ODOMETER MILES.  AFTER BACKING OUT OF A DRIVEWAY AND COMING TO A FULL STOP, THE STEERING WHEEL SHOOK VIOLENTLY BACK AND FORTH (RIGHT AND LEFT), TRAVELING AT LEAST 1 (MAYBE 2) INCHES IN EACH DIRECTION.  BETWEEN 5 AND 10 OSCILLATIONS OCCURRED. I WAS NOT TRYING TO TURN THE WHEEL AT THE TIME AND THE MOTION JERKED THE STEERING WHEEL OUT OF MY HANDS (I WAS QUITE SHOCKED).  IT WAS ALL OVER IN LESS THAN 2 SECONDS. I THEN DROVE THE CAR BACK INTO THE DRIVEWAY (NO PROBLEM) AND HAD IT TOWED TO THE CAR DEALER.   DEALER FOUND BAD SENSOR IN THE STEERING RACK REQUIRING REPLACEMENT OF THE ENTIRE RACK.  *NM",
        "vin": "JT2BK12U910"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/20/2006",
        "dateOfIncident": "08/17/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166051,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "POTENTIAL FOR FATAL INJURY DUE TO LOSS OF CONTROL BECAUSE OF FAULTY DRIVER'S SIDE REAR AXLE HUB BEARING FAILURE WITH SEPARATION OF WHEEL FROM VEHICLE AT 137,758 MILES (SUCH BEARINGS SHOULD HAVE EFFECTIVE LIFE, OR MTBF, OF GREATER THAN 300,000 MILES) -- INTERMITTENT NOISE BEGAN IN 2003 AND CONTINUED TO GET PROGRESSIVELY WORSE CULMINATING IN 80-100 DECIBEL SOUND LEVEL IN PASSENGER COMPARTMENT -- INSPECTION OF VEHICLE INDICATED REAR AXLE HUB BEARING GRINDING NOISE ON DRIVERS SIDE REAR AXLE HUB  -- REPLACED REAR AXLE HUB ASSEMBLY ON AUGUST 17, 2006 AND NOISE IS NOW COMPLETELY GONE  -- THE REMOVED HUB IS NEARLY AT A COMPLETE FAILURE POINT WITH SEVERE GRINDING IN ITS SEALED BEARING  -- I HAVE RETAINED REMOVED HUB AND CAN SHIP TO NHTSA OR NTSB FOR INSPECTION -- PLEASE ADVISE AT FSCORPIO@SBCGLOBAL.NET OR 209-937-0644 (OFFICE DAY PHONE).  *NM",
        "vin": "JT2BK12U610"
    },
    {
        "components": "VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/18/2006",
        "dateOfIncident": "08/11/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165986,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCE: DRIVING A 2001 TOYOTA PRIUS BETWEEN 60 AND 65 MPH ON I-494 IN EAGAN MINNESOTA.   THE SENSOR ON THE VEHICLE'S ACCELERATOR PEDAL ASSEMBLY FAILED I.E. THE ABILITY TO GET GAS TO THE ENGINE STOPPED. THE CAR WAS TOWED TO AN AUTHORIZED REPAIR DEALER AND THE PART, WHICH FAILED, WAS REPLACED.   MY COMPLAINT HAS TWO PARTS:   (1) TOYOTA DOES NOT RECOGNIZE A CRITICAL PART LIKE THE SENSOR ON THE ACCELERATOR PEDAL ASSEMBLY AS A PART OF MAJOR SIGNIFICANCE. I BELIEVE IT IS MAJOR SAFETY ISSUE AND MUST BE CORRECTED BY TOYOTA. I WAS TOLD BY TOYOTA'S CUSTOMER ASSISTANCE CENTER THE PART WAS NOT DEFECTIVE AND IT FAILED BECAUSE NORMAL USE.  I AM APPALLED TO LEARN THAT A 6 YEAR OLD CAR WITH 50,226 MILES IS EQUIPPED WITH ACCELERATOR UNIT WHICH CAN FAIL WHEN THE AVERAGE USE IS 8,371 MILES PER YEAR. I AM ALSO AMAZED THE CUSTOMER SERVICE CENTER IS NOT INTERESTED IN LOOKING AT THIS PERFORMANCE AS A MAJOR DEFECT. THEY TOLD ME THEY HAD NO RECORD OF OTHER INCIDENTS WITH THIS PART. YET WHEN I TALKED TO THE PRIUS SERVICE TEAM SUPERVISOR AT TWO DIFFERENT DEALERSHIPS,  I WAS INFORMED BY EACH ONE THEY HAD REPLACED 4 TO 5 OF THEM. IF MY SMALL SURVEY REVEALED THAT NUMBER I CAN ONLY GUESS WHAT A NATIONWIDE SURVEY WOULD REVEAL.      2) IN RESPONSE TO MY ASKING TOYOTA TO REIMBURSE ME FOR THE $810.41 BILL THEIR RESPONSE WAS I SHOULD SUBMIT MY REQUEST FOR REIMBURSEMENT TO MY INSURANCE COMPANY OR TO THE FIRM WHICH OWNS THE CAR. CLEARLY, A SITUATION OF SHIFTING THE RESPONSIBILITY OF MAKING QUALITY OEM PARTS TO A THIRD PARTY TO ABSORB THE COST AND IGNORING THE MAJOR SAFETY IMPLICATIONS CREATED WHEN THE ACCELERATOR STOPS FUNCTIONING  IN  A VEHICLE DRIVEN LESS THAN THE AVERAGE CAR.  *JB",
        "vin": "JT2BK12U610"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/21/2006",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163126,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS, ONE WHEN MY CAR (2001 TOYOTA PRIUS) HAD 71,000 MILES AND ONE AT 80,000, A SPOKE ON A WHEEL CRACKED, REQUIRING REPLACEMENT OF THE WHEEL.  ON BOTH OCCASIONS, AN INDEPENDENT TIRE DEALERSHIP DIAGNOSED THE PROBLEM AS A DEFECT IN THE WHEEL.  BOTH SAID THIS IS A SAFETY ISSUE AND THAT TOYOTA SHOULD REPLACE THE DEFECTIVE WHEELS.  THE TOYOTA OFFICE THAT HANDLES THESE MATTERS CONTENDS THAT THE WHEEL WAS DAMAGED WHILE DRIVING (BASED ON THE TOYOTA DEALERSHIPS ASSESSMENT) ON BOTH OCCASIONS.  HOWEVER, THE TIRE DEALERSHIPS SAID THERE IS NO DAMAGE THAT CAN WARRANT SUCH AN ASSESSMENT.  FOR MYSELF AND OTHER PRIUS OWNERS, I AM CONCERNED THAT THIS PROBLEM WILL RESULT IN A SERIOUS ACCIDENT AS OTHER WHEELS BEGIN TO CRACK.",
        "vin": "JT2BK12U610"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2006",
        "dateOfIncident": "06/15/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160423,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 6, 2006  I TOOK OUR 2001 TOYOTA PRIUS TO A LOCAL TOYOTA DEALER  BECAUSE IT HAD BEEN LOSING POWER WHILE DRIVING.  THE PRIUS MECHANIC TOLD ME THAT IT WAS \"NORMAL\" AND THAT THERE WAS \"NOTHING WRONG.\"  I  RESPONDED THAT I KNEW THAT SOMETHING WAS WRONG WITH THE VEHICLE.  ON JUNE 15, 2006 ON THE WAY INTO WORK, THE CAR COMPLETELY LOST POWER WHILE DRIVING ON THE INTERSTATE.  FORTUNATELY, WE WERE ABLE TO PULL OVER AT A RELATIVELY SAFE SPOT.   HAD IT STALLED IN HEAVIER TRAFFIC OR IN A DIFFERENT LANE, WE COULD HAVE DIED THERE.   THE SCREEN SHOWED \"MAIN BATTERY FAILURE,\" AND THE CAR WOULDN'T MOVE.  I HAD IT TOWED TO THE DEALER.  THE TECHNICIAN TESTED IT AND THE ONLY CODE SHOWN WAS AN \"ACCELERATOR ASSEMBLY PEDAL.\"    NEITHER I NOR THE TECHNICIAN FELT THAT THIS WAS THE PROBLEM; THE TECHNICIAN FELT THAT THE PROBLEM IS IN THE INVERTER--THE PART THAT CYCLES POWER BACK AND FORTH BETWEEN GAS AND ELECTRIC.  HOWEVER, TOYOTA REGIONAL REFUSED TO REPLACE THE INVERTER, SAYING \"WE ARE NOT JUST GOING TO THROW PARTS AT THE PROBLEM TRYING TO SOLVE IT.\"  I WAS TOLD BY THE DEALER THAT I WOULD HAVE TO REPLACE THE ACCELERATOR ASSEMBLY PEDAL AT MY EXPENSE, EVEN THOUGH THAT WILL LIKELY NOT RESOLVE THE PROBLEM, BECAUSE TOYOTA \"WILL NOT DO ANYTHING ELSE UNLESS YOU DO.\"  THIS TYPE OF POWERING DOWN AND STOPPING IS A KNOWN ISSUE WITH TOYOTA PRIUS CARS, MORE SO WITH 2004-05 (FOR WHICH AN NHTSA INVESTIGATION HAS BEEN OPENED), BUT ALSO WITH 2001-03.  THERE WERE FEWER OF THE 2001-03 CARS ON THE ROAD, SO THE NUMBER OF REPORTED INSTANCES IS LESS, BUT THE INTERNET CONTAINS MANY COMPLAINTS FROM TOYOTA PRIUS OWNERS REGARDING THIS ISSUE.  THIS IS A VERY SERIOUS SAFETY ISSUE.  AS PRIUS CARS AGE, THIS SAFETY DEFECT WILL BECOME INCREASING APPARENT AND HAZARDOUS.   *JB",
        "vin": "JT2BK12U610"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/03/2006",
        "dateOfIncident": "05/30/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158903,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON IN VEHICLE. TOOK TO DEALER FOR SERVICE AND WAS TOLD THE POWER STEERING RACK HAD A MALFUNCTION AND NEEDED REPLACED. THEY REPLACED THE RACK AND ELECTRIC LINK ASSEMBLY AND DID A FRONT END ALIGNMENT AT A COST TO ME OF $1500 DOLLARS. THE SERVICE ADVISOR TOLD US THAT THIS WAS THE THIRD TIME THIS YEAR THAT HE HAD SEEN THIS PROBLEM . AFTER RESEARCHING THIS PROBLEM FURTHER, I FOUND THAT MANY PEOPLE HAVE HAD THIS SAME PROBLEM. WHY SHOULD I HAVE TO PAY FOR A FAULTY PART?  *NM",
        "vin": "JT2BK12U210"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2006",
        "dateOfIncident": "04/08/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154873,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 PRIUS PURCHASED JULY OF 2001 MY WIFE AND I HAVE HAD A NEAR STALL SO MANY TIMES WE HAVE LOST COUNT. THE FIRST TIME WAS IN THE FIRST WEEK OF PURCHASE 2001 AND WE HAVE HAD THE CAR CHECKED AND HAVE BEEN TOLD THEY CANNOT FIND THE PROBLEM SINCE THEY CAN NOT RECREATE THE PROBLEM. I GUESS WE HAVE BEEN LUCKY OUR PRIUS DOES NOT STALL COMPLETELY JUST SLOWS TO  15-37 MILES PER THEN WE HAVE TO STOP AND WAIT FOR THE LIGHTS TO CLEAR. IT HAS GOTTEN TO THE POINT WHERE THIS IS HAPPENING ALMOST DAILY.  THE LAST TIME WE TOOK IT IN FOR SERVICE AND HAD THEM CHECK TO FIND THE PROBLEM THEY DID NOT INFORM US THAT THERE HAS BEEN A  PROBLEM ALL ALONG.  WE LOVE THE CAR AS FAR AS MILEAGE AND ENJOY DRIVING THE PRIUS.  WE HAVE ALWAYS SPOKEN HIGHLY OF THE TOYOTA CORPORATION BUT WE ARE GETTING RATHER ANNOYED THEY CANNOT FIX OUR PROBLEM OR THE PROBLEMS OF OTHER PRUIS OWNERS. WE WOULD LIKE TO KNOW IF TOYOTA HAS SENT OUT A WARNING TO ALL OWNERS. WE HAVE NEVER BEEN NOTIFIED OF ANY PROBLEMS AND WE HAVE OWNED THIS CAR FOR FIVE YEARS.  WE HAD ONE RECALL THE BATTERIES WERE REDONE, BUT NO STALL WARNINGS. THANK YOU FOR YOUR TIME PETER KALOUS.  *NM",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/22/2006",
        "dateOfIncident": "03/13/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153478,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING WHEEL AND COLUMN OF MY 2001 TOYOTA PRIUS INTERMITTENTLY SHAKES VERY VIOLENTLY!  I HAVE TAKEN THE CAR BACK TO THE DEALER BUT THEY SAY THAT THEY CANNOT REPRODUCE THE PROBLEM.  WHEN I COMPLAINED TO TOYOTA USA HEADQUARTERS IN TORRANCE, CA, THEY TOLD ME THAT THEY COULD NOT FIX THE PROBLEM IF THE DEALER COULD NOT REPRODUCE IT.  I TOLD THEM THAT MY WIFE IS SCARED TO DRIVE THE CAR BECAUSE OF THE VIOLENT SHAKING AND THAT I CANNOT BELIEVE THEY COULD BE SO CAVALIER AND NEGLIGENT ABOUT A SAFETY PROBLEM WITH THE CAR'S STEERING SYSTEM.  ON TOP OF THIS, I HAVE COME TO FIND OUT THAT TOYOTA HAS ISSUED A TECHNICAL BULLETIN TO ITS DEALERS ABOUT DEFECTS AND FAILURES IN THE POWER STEERING SYSTEM OF THE 2001 PRIUS!  IT TURNS OUT THAT THEY HAD TO COMPLETELY REDESIGN THE POWER STEERING SYSTEM FOR THEIR HYBRID VEHICLES AND THERE WERE PROBLEMS WITH STEERING SYSTEMS OF THE EARLY PRIUS MODELS.  THEY ARE JUST BEING TOO CHEAP TO FIX THE PROBLEM THEY CREATED.    I THINK THESE CARS SHOULD BE RECALLED SO THAT THIS PROBLEM CAN BE FIXED FOR ALL OF THE OWNERS TO AVOID ACCIDENTS, INJURIES AND DEATH.    ON BEHALF OF MY FAMILY AND ON BEHALF OF THEIR SAFETY THANK YOU FOR YOUR TIME AND HELP IN THIS MATTER!    SINCERELY,    JOSEPH  KREBS  AUSTIN, TX.  *NM",
        "vin": "JT2BK12U310"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": true,
        "dateComplaintFiled": "02/04/2006",
        "dateOfIncident": "07/11/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149453,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRES ON VEHICLE ARE COMING APART ON THE INSIDE TREAD LINE AFTER APPROXIMATELY 5,000 MILES OF USE.  WE HAD ONE CRASH WHERE CAR COULD NOT BE STOPPED IN TIME.  DID NOT PUT THE CRASH TOGETHER WITH THE TIRE PROBLEM UNTIL RECENTLY.  *NM",
        "vin": "JT2BK12U710"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "09/14/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148359,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING AT 65MPH, THE VEHICLE STALLED AND OPERATED AT A REDUCED SPEED WHICH OCCURRED WITHOUT PRIOR WARNING.  DURING THE INCIDENT, ALL DASH PANEL WARNING LIGHTS ILLUMINATED.  THE ENGINE DID NOT STALL OUT COMPLETELY AND THE VEHICLE WAS DRIVEN TO A DEALERSHIP.  THE SERVICE DEPARTMENT DETERMINED THE ELECTRONIC CONTROL MODULE FAILED AND NEEDED TO BE REPLACED.",
        "vin": "JT2BK12U410"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2006",
        "dateOfIncident": "01/13/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147929,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONSUMER STATED THERE IS AN INVESTIGATION PE05029 CONCERNING THE ELECTRONIC CONTROL MODULE. THE VEHICLE DISPLAYED THE SAME PROBLEMS AS INDICATED IN THE INVESTIGATION, BUT WAS EXCLUDED FROM THE SPECIAL SERVICE CAMPAIGN DUE TO THE VIN.  THE VEHICLE STALLED AT HIGHWAY SPEED, OPERATED AT A REDUCED SPEED, AND ULTIMATELY STALLED OUT.  WHEN THIS OCCURRED, VARIOUS WARNING LIGHTS ON THE DASH PANEL ILLUMINATED.  THE ENGINE DID NOT RESTART AND THE VEHICLE WAS TOWED TO A DEALER.  THE DEALER REPLACED THE ELECTRONIC CONTROL MODULE.   *JB",
        "vin": "JT2BK12U610"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "08/24/2005",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141958,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR (2001 PRIUS) WAS AT A DEALERSHIP (MARINA DEL REY TOYOTA) FOR SERVICE. WHILE PARKED, WITH NO ONE INSIDE AND THE IGNITION OFF, THE MAIN PROPULSION BATTERY CAUGHT FIRE AND BURNED THROUGH THE VEHICLE INTERIOR, CAUSING A TOTAL LOSS. TOYOTA BLAMES THE FIRE ON A BATTERY DEFECT. *JB",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/03/2005",
        "dateOfIncident": "11/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141650,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATES  VEHICLE HAD A DEFECTIVE CLUTCH.  THE CLUTCH HAS REPEATEDLY MALFUNCTIONED.  HE CONTACTED THE DEALERSHIP.  THE DEALERSHIP  REPLACED THE CLUTCH TWICE WITHIN THREE YEARS.  ALSO,  CONTACTED THE MANUFACTURER, AND THEY DID NOT OFFER ANY ASSISTANCE.  NO FURTHER CORRECTIONS HAVE BEEN MADE AT THIS TIME. *AK",
        "vin": "2T1CF22P11C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/21/2005",
        "dateOfIncident": "09/24/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140482,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) NORMAL DRIVING, NO ABNORMALITIES WHATSOEVER  (2) AT FREEWAY SPEED, IN BUSY TRAFFIC, WITHOUT WARNING:  THE CAR LOST ALL MOTIVE POWER (NEITHER GAS NOR ELECTRIC WORKING);  THE HYBRID SYSTEM WARNING ICON DISPLAYED ON THE MULTI-FUNCTION DISPLAY.  LUCKILY, IN BOTH INSTANCES, WE WERE ABLE TO MOVE TO THE SHOULDER WHILE DECELERATING. AFTER COMING TO A COMPLETE STOP, WE REFERRED TO THE OWNER'S MANUAL WHICH SUGGESTED TURNING THE IGNITION KEY COMPLETELY OFF AND THEN ATTEMPTING A RESTART. IN BOTH CASES THE CAR STARTED UP AGAIN AND WAS DRIVABLE (ALTHOUGH IN THE FIRST CASE THE WARNING ICON REMAINED DISPLAYED FOR APPROXIMATELY 10 MILES).  (3) TOOK CAR TO TOYOTA DEALER WHO VERIFIED FAILURE CODE(S) STORED IN ONBOARD MEMORY; DEALER REPLACED ACCELERATOR PEDAL/POSITION SENSOR ASSEMBLY.  *JB",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/17/2005",
        "dateOfIncident": "10/10/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140006,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING HAS HAPPENED ON 4 DIFFERENT OCCASIONS, 3 TIMES I HAVE BEEN DRIVING ON THE INTERSTATE SEVERAL HUNDRED MILES FROM  HOME AT SPEEDS OF 65 TO 70 MILES PER HOUR.  ON THESE OCCASIONS THE DASHBOARD WARNING LIGHTS HAVE COME ON AND THE GASOLINE ENGINE SHUTS DOWN. THE VEHICLE'S ELECTRIC MOTOR WILL CONTINUE OPERATING IN A LIMITED CAPACITY, SO I CAN STEER TO THE SIDE OF THE ROAD. THE  ENGINE WILL START WORKING AGAIN WHEN I TRY TO RESTART THE VEHICLE, BUT NOT FOR A CONSIDERABLE AMOUNT OF TIME,  THIS HAS BEEN VERY FRIGHTENING, AS I AM USUALLY ALONE IN THE CAR.  THE LAST TIME THIS HAPPENED I  HAD TO WAIT APPROXIMATELY 30 MINUTES ON THE SIDE OF THE ROAD AT DUSK BEFORE THE CAR STARTED AGAIN. I HAD CALLED SEVERAL TOW TRUCKS, BUT THEY TOLD ME THEY COULD NOT COME FOR ANOTHER 45 MINUTES TO 2 HOURS AS THEY WERE THAT BUSY.  I HAVE HAD MY CAR INTO THE TOYOTA SHOP EVERY TIME THIS HAPPENED AND THEY KEEP TELLING ME NOTHING IS WRONG.  WELL, SOMETHING IS WRONG...I CAN'T BELIEVE I AM THE ONLY PERSON HAVING THIS TROUBLE.  IS THERE ANYTHING THAT CAN BE DONE TO MAKE THEM FIX THIS PROBLEM.  I BOUGHT THIS CAR USED AND IN GOOD FAITH, OBVIOUSLY BECAUSE OF GAS PRICES. BUT NOW I GUESS I KNOW WHY IT WAS TRADED IN AFTER ONLY 2 YEARS. THE LAST TIME THIS HAPPENED WAS OCTOBER 10TH, 2005. *JB",
        "vin": "JT2BK12U310"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/15/2005",
        "dateOfIncident": "10/08/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139771,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS: ACCELERATOR SENSOR FAILURE  FOR SEVERAL WEEKS LEADING UP TO THE FAILURE, THERE WAS A SLIGHT (BUT DEFINITE) SENSATION OF DECELERATION WHEN TRYING TO MAINTAIN STEADY SPEED. AT THE TIME OF FAILURE, THE VEHICLE HESITATED/STALLED AND THE \"MASTER WARNING LIGHT\" CAME ON. LOCAL DEALER (355 TOYOTA, ROCKVILLE, MD) REPLACED THE PART AT A COST OF $700.00. SHOULD A PART THIS EXPENSIVE (AND SO CRITICAL TO VEHICLE FUNCTION) BE FAILING AT 4 YEARS?  *NM",
        "vin": "JT2BK12U010"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/13/2005",
        "dateOfIncident": "10/07/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139562,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED THAT 2001 TOYOTA PRIUS WAS HAVING TROUBLE WITH THE STEERING WHEEL. WHEN THE WHEEL WAS IN CERTAIN POSITION IT  SHUTTERED VIOLENTLY. THE PROBLEM WAS INTERMITTENT. THIS HAPPENED  JUST A FEW TIMES SINCE 2001,  AND IN THE LAST WEEK, IT WAS HAPPENING DAILY. THE  CONTACT  HAD NOT TAKEN  THE CAR  TO THE REPAIR  SHOP PRIOR TO THIS WEEK. THE CONTACT WAS TAKEN VEHICLE TO DEALER FOR A CHECK UP ON THE STEERING. THERE HAS BEEN NO SUCCESS IN CONTACTING TOYOTA AS OF NOW. SHE  WILL CONTACT  TOYOTA SOON.  THE CONTACT STATED THAT THE VEHICLE WAS VERY UNSAFE TO DRIVE. THERE HAS BEEN NO NEAR MISSES, BUT THIS CONDITION  WAS VERY SCARY.*AK  UPDATED 12/27/05. *JB",
        "vin": "JT2BK12U010"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/13/2005",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139629,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 TOYOTA PRIUS HAS STALLED TWICE AT HIGH SPEEDS (~75 MPH) WHILE ON THE HIGHWAY.  IN BOTH INCIDENCES IT WAS ONLY DUE TO GOOD DRIVING AND TO LUCK THAT I WAS ABLE TO GET OFF OR TO THE SIDE OF THE HIGHWAY.  I HAVE CONTACTED MY DEALER AND IN BOTH CASES THEY LOOKED AT THE ENGINE AND CLAIMED THAT THEY HAD NEVER SEEM THE PROBLEM WITH ANY OTHER VEHICLES.  I WAS TO BRING THE CAR BACK IF IT HAPPENED AGAIN. *JB",
        "vin": "JT2BK12U610"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "08/31/2005",
        "dateOfIncident": "07/25/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134923,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: VEHICLE STALLED/DIED, AND LOST POWER WHILE DRIVING 5 MPH. THROTTLE BODY MODULE FAILED. THERE WAS A NHTSA  RECALL BUT THIS INVOLVED A CHEMICAL IN THE PRUIS CAR BATTERY.*AK    L. YES.  CAR HAS BROKE DOWN SEVERAL TIMES SINCE.  THE STALLING IS STILL A PROBLEM.",
        "vin": "JT2BK12U710"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "06/13/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125783,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATES WHILE DRIVING  THE VEHICLE STOPPED.  THE ACCELERATOR PEDAL WAS REPLACED. *AK  *JB",
        "vin": "JT2BK12U710"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2005",
        "dateOfIncident": "07/06/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129860,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1. I WAS DRIVING AT SUSTAINED SPEEDS OF 55 TO 65 MPH ON AN US ROUTE 101 FOR APPROXIMATELY 40 MINUTES IN MY 2001 TOYOTA PRIUS.  2. THE INTERNAL COMBUSTION ENGINE SUDDENLY STOPPED OPERATING, LEAVING ONLY THE ELECTRIC MOTOR OPERATING. THIS CAUSED A SUDDEN LOSS OF POWER AND DECELERATION.  3. THE ACCELERATOR PEDAL ASSEMBLY HAD TO BE REPLACED. THE OLD PART IS NOT AVAILABLE.",
        "vin": "JT2BK12U910"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "05/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126948,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD PROBLEMS WITH MY 2001 PEIUS FOR THE PAST YEAR WITH THE ENGINE STOPING AT FREEWAY AND LOCAL HIGHWAY SPEEDS.  MY CAR HAS NOW SET AT STANGER TOYOTA IN ST. GEORGE FOR THE PAST MONTH WITH NO CURE FOR THE PROBLEM.  THE DEALERSHIP HAS INSTALLED A NEW INVERTER, TRACED ALL WIRING, RESET CODES AND STILL WE HAVE THE SAME PROBLEM OF THE CAR QUITING OR GOING INTO STELTH MODE.      THE CAR IS NO LONGER RELIABLE ON TRIPS OVER ONE HOUR.  THE PROBLEM HAS HAPPENED IN HIGH AND LOW TEMP. CONDITIONS.  MY DEALERSHIP SAYS THEIR IS NOTHING LEFT FOR THEM TO DO AND I WILL JUST HAVE TO KEEP DRIVING THE CAR AND BRINGING IT BACK TO RESET THE WARNING LIGHTS.  THIS IS NUTS!      TOYOTA SHOULD RECALL THIS CAR AT ONCE, IT IS UNSAFE, UNREALIABLE AND A DISGRACE TO OWN.  I HAVE BEEN A TOYOTA OWNER FOR THE PAST 30 YEARS AND HAVE ALWAYS \"LOVED MY TOYOTAS\"  BUT THE PRIUS IS A NIGHTMARE, AND I HOPE THE NHTS WILL INVESTIGATE THIS ON GOING MATTER WITH THE PRIUS AND PUSH TOYOTA FOR A RECALL TO FIX THIS PROBLEM ONCE AND FOR ALL.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123729,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  WHILE DRIVING  VEHICLE SHUT DOWN AND WOULD NOT RESTART.   ALL 3 TIMES THAT THIS HAPPENED  CONSUMER WAS ON THE FREEWAY.  CONSUMER OWNED THE CAR FOR 1 YEAR BEFORE IT STARTED STALLING,  AND IT HAS STALLED TWO MORE TIMES SINCE THEN. EACH TIME THE CAR WAS TAKEN  TO TOYOTA, AND EACH THEY TIME THEY WERE UNABLE TO FIGURE OUT WHAT THE CAUSE OF THE PROBLEM WAS.*AK  *SB   *NM",
        "vin": "JT2BK12U710"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/21/2005",
        "dateOfIncident": "06/21/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126158,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE INTERMITTENT STALLING. ENGINE RUNS ROUGH AND GIVES CODE \"171 LEAN MISSFIRE\" DEALER ATTEMPS TO FIX THE PROBLEM INVOLVE ADDING FUEL INJECTOR CLEANER AND RESETTING THE CODE. UP TILL TODAY STALLS HAVE BEEN EITHER AT 55 TO 65 FOR SHORT PERIOD OF TIME APROX. 2 SECONDS. TODAY VEHICLE LIMPED HOME ABOUT 5 MILES. SAME CODE DISPLAYED. \"!\" ALSO DISPLAYED ON DASH AND TROUBLE CODE 171. AFTER THREE ON OFF CYCLE ON THE KEY \"!\" WAS NO LONGER DISPLAYED. CAR RUNS AGAIN.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/04/2005",
        "dateOfIncident": "06/06/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124172,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS STALLED 3 DIFFERENT TIMES AT HIGHWAY SPEEDS OVER 12 MONTH TIME.  CAR WOULD NOT RESTART AND HAD TO BE TOWED TO LOCAL TOYOTA DEALERSHIPS (I-10 TOYOTA AND TOYATA OF THE DESERT)",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "04/17/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124047,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 PRIUS HAS BEEN IN FOR CPU REPLACEMENTS 4 TIMES AND A ENGINE REBUILD @ 69000 MILES FOR THE PROBLEM THIS SITE MENTIONED IN THE NEWS ABOUT THE 04-05 PRIUS STALLING.  THEY SAID IT WAS LOW COMPRESSION ON THE LAST SERVICE CALL. WELL THE PROBLEM IS BACK!! EVEN AFTER A REBUILD. SO NOW WHAT? OH AND WHAT IS WORST IS THAT I HAVE TO TAKE A PHOTO OF THE PROBLEM LIGHTS BECAUSE WHEN THE PROBLEM HAPPENS IT PRODUCES NO CODES?!?! SO THEY CHARGED ME $75 AND DID NOTHING ONCE. NICE SERVICE.  WHERE I TAKE MY PRIUS: FOX TOYOTA-SCION 415 TAUNTON AVENUE EAST PROVIDENCE, RI 02914  PHONE (401) 438-0350 , FAX (401) 434-4574",
        "vin": "JT2BK12U710"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "11/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA PRIUS 2001 HAS STALLED TWICE, WHILE ON THE FREEWAY.  I WENT FROM 60 MPH TO 10 MPH WITHIN SECONDS.  IT WAS EXTREMELY DANGEROUS.  THE GAS ENGINE SHUT OFF AND ALL I HAD WAS ELECTRIC POWER.  TOYOTA REPLACED MULTIPLE COMPUTER PARTS BOTH TIMES.",
        "vin": "JT2BK12U810"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "06/02/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123913,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 TOYOTA PRIUS HAS INTERMITTANTLY STALLED, FORCING ME TO PULL OVER, TURN OFF THE IGNITION AND RESTART.  THIS APPEARS TO HAPPEN AT ANY SPEED, AND HAS HAPPENED 20-30 TIMES OVER THE PAST 18 MONTHS.  I TOOK IT TO THE DEALER TWICE FOR THIS PROBLEM APPROXIMATELY A YEAR AGO.  THEY DID A REGULARLY SCHEDULED MAJOR SERVICING BUT THAT DID NOT SOLVE THE PROBLEM.  THE PROBLEM DID NOT OCCUR OVER THE WINTER BUT HAS SINCE RESURFACED WITH WARMER WEATHER.    I BELIEVE THIS IS THE SAME PROBLEM THAT NHTSA JUST ANNOUNCED WAS BEING INVESTIGATED IN 2004,2005 PRIUS MODELS.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "05/15/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123954,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 TOYOTA PRIUS. SEVERAL TIMES IN THE LAST FEW MONTHS I HAVE EXPERIENCED A LOSS OF POWER COMBINED WITH MY DASH WARNING LIGHTS. I HAD ONE SIMILAR INCIDENT LAST YEAR. THE DEALERSHIP CLAIMS THEIR DIAGNOSTICS FIND NO PROBLEM (NO CODES = NO PROBLEM). THEREFORE NOTHING IS RESOLVED AND THE CAR REMAINS PRONE TO LOSS OF POWER, A DANGEROUS CONDITION WHEN TRAVELING ON ANY FREEWAY.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/19/2005",
        "dateOfIncident": "05/13/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121390,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING AT HIGHWAY SPEED, CAR SUDDENLY LOST POWER, SLOWED DOWN TO A MAX. SPEED OF 37 MPH, RUNNING MOSTLY ON ELECTRICAL POWER. MASTER WARNING LIGHT (TRIANGLE WITH EXCALMATION POINT) LIT UP. GAS ENGINE WOULD PERIODICALLY START UP, BUT WAS NOT RESPONDING TO ACCELLERATOR PEDAL.  AFTER PULLING OVER AND SHUTTING DOWN VEHICLE, I WAS ABLE TO RESTART AND CONTINUE NORMALLY.",
        "vin": "JT2BK12U210"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2005",
        "dateOfIncident": "05/12/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121427,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 TOYOTA PRIUS. ON 05/12/05 I WAS DRIVING TO WORK. I WAS DRIVING ABOUT 65 MPH ON THE 405 FREEWAY. THE CAR SUDDENLY HESITATED, THEN LOST MOST OF ITS POWER AND THE WARNING LIGHTS CAME ON. I WAS BARELY ABLE TO GET IT TO THE SIDE  OF THE ROAD AND TURNED THE CAR OFF. I RESTARTED IT. THE LIGHTS STAYED ON, BUT IT DROVE OK. I TOOK IT TO A DEALER. THEY RESET THE WARNING LIGHTS AND TOLD ME THE GAS PEDAL SENSOR WAS BAD. I DID NOT GET IT REPLACED. CAR HAS RUN OK SINCE THEN.  THIS IS THE SECOND OCCURENCE. IT ALSO HAPPENED ABOUT ONE AND A HALF YEARS AGO. SIMULAR SYMTOMS. TOOK CAR TO DEALER AND THEY RESET THE WARNING SYSTEM. NO OTHER WORK WAS DONE OR PERFORMED. THEY SAID THEY COULDN'T FIND ANYTHING WRONG WITH IT. VERY HAZARDOUS. CAR JUST STUMBLES AND LOSES MOST OF ITS POWER.  A SECOND MAJOR DEFECT WAS THE FRONT END, WHICH STARTED TO HAVE STEERING PROBLEMS TOYOTA REPLACED ENTIRE FRONT END UNDER WARRENTEE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/18/2005",
        "dateOfIncident": "11/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121362,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS STARTED IN NOVEMBER 2003.  HAD OIL CHANGED AND AN HOUR LATER ALL THE WARNING LIGHTS CAME ON IN THE VEHICLE.  IMMEDIATELY RETURNED TO THE DEALERSHIP WHERE IT TOOK 2 WEEKS TO REPLACE THE FUEL PUMP (37,000 MILES).  SINCE THEN THE CAR HAS BEEN BACK TO THE DEALERSHIP AN ADDITIONAL 9 TIMES TO THE CURRENT DATE (MAY 2005) FOR SEVERAL DIFFERENT THINGS.  THE COMPUTER HAS BEEN REPLACED TWO TIMES.  THE ENGINE HAS BEEN REPLACED.  THE INJECTORS CLEANED, THEN A FEW MONTHS LATER HAD TO BE COMPLETELY REPLACED.  THE THROTTLE BODY HAS BEEN REPLACED.  I HAVE BEEN DRIVING THE CAR WHEN IT WOULD NOT ACELERATE AND HAD TO PULL OVER IN TRAFFIC.  THE FIRST TIME THE DEALERSHIP SAID THERE WERE NO WARNING LIGHTS WHEN THE CAR GOT TO THE DEALERSHIP AND THEY COULD NOT RECREATE THE CODES OR SITUATION SO THEY COULD NOT DO ANYTHING.  THE SECOND TIME (APRIL 2005) ALL FOUR INJECTORS WERE REPLACED AS WELL AS THE MASS AIR FLOW SYSTEM.  THE CAR HAS BEEN IN THE SERVICE DEPARTMENT AT OUR TOYOTA DEALERSHIP FOR A TOTAL OF 17 TIMES SINCE THE CAR ARRIVED AT APPROXIMATELY 180 DAYS!!!  10 OF THOSE 17 TIMES HAS BEEN BECAUSE THE WARNING LIGHTS HAVE COME ON.  HAVE ENTERED INTO ARBITRATION AND WE ARE AWAITING AN ANSWER ON THE DECISION.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/17/2005",
        "dateOfIncident": "03/10/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121229,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 TOYOTA PRIUS-SUDDEN DROP IN SPEED-COULD NOT EXCEED 17 MPH.  DANGEROUS IN TRAFFIC  TOYOTA REPLACED COMPUTER-OLD PARTS NOT AVAILABLE  INCIDENT DATE IS APPROXIMATE-TOOK 2 1/2 MONTHS TO REPAIR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2005",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121228,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE COMING DOWN A STEEP MOUNTAIN COASTING, THE VEHICLE ELECTRICAL SYSTEM SHOWED A FAILURE AND I WAS ABLE TO RESUME AFTER A TECH TOLD ME TO SHUT IT DOWN AND RESTART.   ADDITIONALLY , WHEN IN STALLED SLOW TRAFFIC THE BATTERY SEEMED TO DRAIN EXCESSIVELY ON ONLY ONE OCCASION. NEITHER OF THESE EVENTS HAS RECURRED.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "04/29/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121100,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": "P205/60R16",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE SERIOUS AND REPEATING PROBLEMS WITH SUSPENSION/ TIRES ON MY TOYOTA PRIUS 2001 CAR (MANUFACTURED 06/01).  THREE TIMES THE FRONT TIRES WHERE ABNORMALLY AND SIGNIFICANTLY WORN (DURING APPROX 7,500 MILES) WITH, WITH SIDE AND TOP SCARS ETC. TOYOTA ALREADY CHANGED THE TIRES FOUR TIMES  BUT THEY ARE UNABLE TO SOLVE PROBLEM.     HOWEVER, THE SAME PROBLEM IS LIKELY REPEAT ITSELF AGAIN AND AGAIN, AND CHANGING THE TIRES IS NOT A SOLUTION. I DO NOT LIKE DRIVING ON SUCH DANGEROUSLY WORN TIRES; MOREOVER, IT IS AGAINST THE LAW TO DRIVE ON TIRES IN SUCH CONDITION). CAR WAS REGULARLY IN SCHEDULED TOYOTA SERVICE (INCLUDING TIRES ROTATION, PRESSURE CHECK ETC.).",
        "vin": "JT2BK12U210"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "05/16/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121119,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ONGOING AND GETTING WORSE.  2001 TOYOTA PRIUS FAILS TO START PROPERLY, STALLS WHILE DRIVING, AND MORE OFTEN THAN NOT FEATURES AN ENGINE WARNING LIGHT.",
        "vin": "JT2BK12U710"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/12/2005",
        "dateOfIncident": "07/21/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118907,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A READER OF THE SAN DIEGO UNION-TRIB WHEELS SECTION RESPONDED TO AN ARTICLE REGARDING UNEXPECTED ACCELERATION FROM ELECTRONIC THROTTLES AND THE EDITOR FORWARDED THE LETTER TO NHTSA.***NO ANSWER REQUIRED***. *MR    WHILE PARKING IN A DIAGONAL PARKING SPACE THE CONSUMER'S VEHICLE ACCELERATED SUDDENLY ACROSS A SIDEWALK AND HIT AN ELECTRIC BOX.  THIS SUDDEN ACCELERATION PROBLEM HAPPENED AGAIN WHILE THE CONSUMER WAS PARKING.  THAT TIME NOT ACCIDENT OCCURRED.  *BF  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/15/2005",
        "dateOfIncident": "07/29/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110593,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CAR LOST POWER AND WOULD START UP AGAIN, BUT WOULD NOT STAY RUNNING. CAR WAS TOWED IN AND THE DEALER PUT A NEW ENGINE ECU- (COMPUTER).  THIS TOOK A MONTH, AS THE COMPUTER HAD TO BE MADE IN JAPAN.  A YEAR AND A HALF LATER, THE NEW COMPUTER HAS BEEN REPLACED AND THE CAR CONTINUES TO NOT START UP.  IT HAS BEEN IN THE SHOP FOUR TIMES THIS MONTH, EACH TIME THE CAR IS RETURNED TO ME AND WILL NOT START THE NEXT DAY.",
        "vin": "JT2BK12U110"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "09/28/2004",
        "dateOfIncident": "07/21/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095351,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING THE CONSUMER'S VEHICLE ACCELERATED SUDDENLY. *NM  THE CONSUMERS VEHICLE HIT AN ELECTRIC BOX AS A RESULT OF THE UNEXPECTED ACCELERATION WHILE TRYING TO PARK.  A SECOND OCCURANCE OF THIS PROBLEM HAPPENED IN A MALL PARKING LOT.  *TC",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "08/11/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087883,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER INSPECTED  THE TIRES AND THE BELTS WORE INTO THE STEEL.  TIRES WERE REPLACED ON THE FRONT FOUR TIMES. VEHICLE WAS ALIGNED SEVERAL TIMES BUT THE TIRES CONTINUED TO WEAR.  THEY WERE REPLACED WITH THE SAME MAKE/MODEL TIRE.*AK",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2004",
        "dateOfIncident": "08/16/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089612,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE LOST POWER. THE WARNING LIGHT ILLUMINATED ON THE DASH OARD. HOWEVER, THE PROBLEM HAD NOT BEEN RESOLVED. *AK",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/08/2004",
        "dateOfIncident": "01/15/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075845,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE FISH TAILED WHEN DRIVING ON A WINDY DAY OR WHEN AN 18 WHEELER PASSES OR IF A SUDDEN LANE CHANGE IS MADE. THIS STARTED OCCURRING ONLY WHEN SPEED WAS AT 55 MPH, BUT HAS PROGRESSED. CURRENTLY, IT'S OCCURRING AT 50 MPH AND SLOWER.  THE DEALERSHIP REPLACED ALL FOUR TIRES, THE CONTROL BUSHING, AND THE REAR STRUTS IN AN ATTEMPT TO CORRECT THE PROBLEM. BUT PROBLEM RECURRED. *AK",
        "vin": "JT2BK12U410"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2004",
        "dateOfIncident": "03/19/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064005,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS MOTOR FAILED TO CONTINUE OPERATING WHILE DRIVING ON THE ROAD TWICE. ONCE IN AUGUST,2003,AGAIN MARCH,2004.VEHICLE LOST POWER BOTH TIMES-CREATED A SERIOUS SAFETY HAZARD BECAUSE I CCOULD NOT MAINTAIN SPEED ON ROADS WHERE SPEED LIMITS WERE 40 AND 50 MPH.THERE WAS TRAFFIC AROUND THE VEHICLE IN BOTH INSTANCES. ON SECOND INCIDENT-NARROWLY AVOIDED A COLLISION FROM THE REAR.OTHER VEHICLE SWERVED TO AVOID MY VEHICLE.  DEALER REPLACED DEFECTIVE COMPUTER IN 2003 AND DEFECTIVE ACCELERATOR SENSOR UNIT 2004.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/21/2004",
        "dateOfIncident": "03/23/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058654,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE FRONT TIRE WEAR, SAID BY TOYOTA TO BE \"INHERENT IN A HYBRID VEHICLE\" BUT NOT ADVERTISED TO PURCHASERS ANYWHERE IN THEIR SALES BROCHURES OR WARRANTY PACKET,  IS A SAFETY HAZARD TO ANYONE EXPECTING TIRES TO LAST MORE THAN 12,000 MILES.  TOYOTA BLAMES THE TIRE MANUFACTURER;  BRIDGESTONE BLAMES TOYOTA. TOYOTA ALSO REFUSES TO SPECIFY WHETHER THE 2004 MODEL, WHICH HAS SUBSTANTIALLY LARGER TIRES, WILL BE ANY BETTER.  THEY SIMPLY WON'T ADMIT THAT THERE IS A PROBLEM.  *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/14/2004",
        "dateOfIncident": "02/14/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2001 TOYOTA PRIUS HAS A FAULTY ACCELERATOR PEDAL AND SHOULD BE COVERED UNDER THE 8-YEAR HYBRID SYSTEM WARRANTY. NOT ONLY ARE THERE SAFETY ISSUES WITH THIS PROBLEM (E.G. SUDDEN LOSS OF ACCELERATION THAT COULD CAUSE ACCIDENTS, INCORRECT COMMUNICATION BETWEEN THE ACCELERATOR AND THE HYBRID SYSTEM, ETC.) BUT THERE IS A LACK ON TOYOTA'S PART TO ADMIT THAT THE ACCELERATOR IS A CRITICAL COMPONENT OF THE HYBRID SYSTEM. WHEN THE ACCELERATOR FAILS, IT CAUSES THE \"CHECK HYBRID SYSTEM\" LIGHT TO APPEAR ON THE DASHBOARD AND CAN MAKE THE CAR DANGEROUSLY UNRESPONSIVE (ESPECIALLY ON THE FREEWAY). THE HYBRID SYSTEM IS EXPECTING INFORMATION FROM THE ACCELERATOR, AND WHEN IT DOESN'T RECEIVE IT, EITHER THE GAS ENGINE, OR THE ELECTRIC ENGINE, OR BOTH ENGINES FAIL TO OPERATE.     EVEN THOUGH TWO TOYOTA DEALERS (STEVENS CREEK TOYOTA AND CAPITOL TOYOTA) AGREE THAT THIS IS A SERIOUS SAFETY ISSUE, BOTH CLAIM THAT THIS REPAIR IS NOT COVERED UNDER THE 8-YEAR HYBRID SYSTEM WARRANTY. HOWEVER, IF THIS ACCELERATOR PROBLEM IS NOT DIRECTLY RELATED, THEN WHY DOES THE WARNING LIGHT COME ON WHEN THE ACCELERATOR SENSOR FAILS? ALSO, WHY DID THE DEALER WHO PERFORMED THE $654.52 REPAIR TELL ME THAT THE COMPLETE ACCELERATOR ASSEMBLY PART HAD JUST BEEN RECENTLY REVISED BY TOYOTA? (I MIGHT ADD THAT AN INDEPENDENT ELECTRICAL ENGINEER ANALYZED THE PART AND CONCLUDED THAT THE ACCELERATOR HAS AN MTBF OF 1500 HOURS. HE CONCLUDED THAT EVERY PRIUS OWNER WOULD BE SUBJECT TO THIS SAME HAZARDOUS PROBLEM SEVERAL TIMES DURING THE LIFETIME OF THE CAR!!)    I HAVE SUBSTANTIAL EVIDENCE FROM OTHER PRIUS OWNERS WHO ARE EXPERIENCING THE SAME PROBLEMS AND WOULD BE HAPPY TO SHARE THIS INFORMATION WITH YOUR INVESTIGATION TEAM. IN MY OPINION, THESE PROBLEMS ARE SERIOUS ENOUGH TO MERIT CONSIDERATION FOR EITHER A RECALL OR A REVISION OF TOYOTA'S \"HYBRID SYSTEM\" WARRANTY POLICIES. I APPRECIATE ANY ASSISTANCE YOU CAN PROVIDE ME IN THIS MATTER AND I HOPE THAT TOGETHER WE CAN PREVENT NEEDLESS DEATHS FROM THIS UNSAFE ACCELERATOR.  *AK",
        "vin": "JT2BK12U810"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "06/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070475,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE 3RD SET OF TIRES I HAVE HAD TO PUT ON THE CAR DUE TO UNEVEN WEAR.  I ONLY HAVE 48000 MILES ON THE CAR.  THE TIRES WEAR AS THOUGH THEY ARE UNDER INFLATED, BUT I AM CAREFUL TO BE SURE THAT I AM FOLLOWING THE MANUFACTURERS RECOMMENDATION FOR TIRE INFLATION.  SINCE THIS IS THE ONLY TIRE USEABLE ON THIS CAR, I AM VERY DISAPPOINTED IN TOYOTA'S RESPONSE TO THE PROBLEM.  SINCE TOYOTA PROBABLY GAVE THE SPECS TO BRIDGESTONE TO MANUFACTURE THE TIRE, IT IS TOYOTA'S RESPONSIBILITY TO ASSURE THAT THE TIRE WAS DESIGNED TO BE TO HAVE A NORMAL TREAD LIFE AS WELL AS HELP THE CAR FUNCTION EFFICIENTLY.  IT IS REALLY TOUGH TO HAVE TO PAY $80.00 A TIRE AND HAVE IT ONLY LAST 25000 MILES.  YES I HAVE HAD THE DEALER SERVICING THE CAR AND ROTATING THE TIRES AND THE ALIGNMENT IS FINE.  THE PROBLEM IS THE TIRE THAT TOYOTA REQUIRES TO BE USED ON THE PRIUS.",
        "vin": "JT2BK12U71D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/10/2003",
        "dateOfIncident": "10/22/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047749,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "RADIAL TIRE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT 35MPH, THE FRONT PASSENGER TIRE BLEW OUT. (SIZE # P175/65R14) (DOT # UNKNOWN.) THE MANUFACTURER HAS BEEN CONTACTED. PLEASE PROVIDE FURTHER INFORMATION.    *PH                         TIRES WERE ROTATED WHEN THE OIL WAS CHANGED. DEALER STATED TIRES FAILED DUE TO LACK OF ROTATION. ON ONE OCCASION, CONSUMER THOROUGHLY CHECKED THE TIRE BEFORE DRIVING. TOOK VEHICLE TO THE DEALER AND THEY FOUND A WORM NAIL AFTER LOOKING FOR OVER AN HOUR. CONSUMER HAS THE TIRES. AFTER THE FIRST FAILURE, THE CONSUMER CONTACTED WENT TO FIRESTONE FOR REPLACEMENT TIRES. FIRESTONE STATED THEY COULD ANOTHER TIRE AND GET THE SAME EFFECT SINCE THEY DIDN'T HAVE IT IN STOCK. TOYOTA STATED DIFFERENTLY AND NOR DID THEY HAVE THE TIRE IN STOCK. AFTER DAYS OF THREATS, TOYOTA HAD THE SAME EXACT TIRE AVAILABLE FOR THE CONSUMER.   *PH",
        "vin": "JT2BK12U110"
    },
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/28/2003",
        "dateOfIncident": "07/09/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043788,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPECTED QUALITY ISSUE RESULTING IN PREMATURE WEAR OF FRONT DRIVER'S SIDE TIRE, LEADING TO POTENTIALLY UNSAFE DRIVING/HANDLING SITUATIONS.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/23/2003",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031352,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHILE DRIVING AT ANY SPEED AND WITH NO WARNING THE STEERING BOLTS BECAME LOOSE AND CAUSED THE STEERING WHEEL TO JUMP AROUND, WHICH MADE THE VEHICLE DIFFICULT TO STEER. DEALER NOTIFIED.*AK   VEHICLE PULLED SIGNIFICANTLY WHILE DRIVING.  THE TIRES WERE INSPECTED AT 15,536 MILES, BUT AT 18,800 MILES ONE OF THE TIRE BLEW REVEALING THE TIRES WERE BALD. LATER, IT WAS DISCOVERED THE ALIGNMENT WAS OUT AND TIRE NEEDED TO BE REPLACED AGAIN.   *PH  *JB",
        "vin": "JT2BK18U320"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": "08/11/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033544,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DESCRIPTION:  PASSENGER VEHICLES.  INSUFFICIENT ELECTRICAL CONTACT CAN OCCUR IN THE TORQUE SENSOR THAT CONTROLS THE POWER ASSIST OPERATION OF THE ELECTRIC POWER STEERING GEAR BOX.  THE TORQUE SENSOR COULD SEND IMPROPER ELECTRICAL SIGNALS. DEALERS WILL REPAIR THE ELECTRIC STEERING GEAR BOX.*AK   RIGHT TURN SIGNAL DOES NOT CANCEL AFTER A HARD RIGHT TURN. VEHICLE WOULD PULL OUT IN FRONT OF THE CONSUMER BECAUSE THEY THINK HE'S GOING TO MAKE A RIGHT TURN.   *PH  *JB",
        "vin": "JT2BK12U710"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/11/2003",
        "dateOfIncident": "09/10/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038724,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 TOYOTA PRIUS.  SEVERAL TIMES IN THE LAST FEW MONTHS I HAVE EXPERIENCED A LOSS OF POWER COMBINED WITH MY DASH WARNING LIGHTS.  I HAD ONE SIMILAR INCIDENT LAST YEAR.  THE DEALERSHIP CLAIMS THEIR DIAGNOSTICS FIND NO PROBLEM (NO CODES = NO PROBLEM).  THEREFORE NOTHING IS RESOLVED AND THE CAR REMAINS PRONE TO LOSS OF POWER, A DANGEROUS CONDITION WHEN TRAVELING ON ANY FREEWAY.  BY LOOKING AT THE CHAT BOARDS (YAHOO IN PARTICULAR) IT'S EVEDINT AI AM NOT AN ISOLATED CASE.  I BELIEVE TOYOTA HAS AN OBLIGATION TO ADDRESS AND CORRECT THIS ISSUE.  THANK YOU FOR YOUR TIME.    RICHARD TOROK",
        "vin": "JT2BK12U710"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/01/2003",
        "dateOfIncident": "07/28/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036983,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BRIDGESTONE POTENZA TIRES, P175/65R14- ON JULY 28, 2003 HAD TO REPLACE TIRES ON THE 2001 TOYOTA PRIUS. ONE TIRE WAS FLAT. I NOTICED THAT THE TIRE HAD A BIG CRACK AND THE CORDS WERE VISIBLE. I LOOKED AT IT CLOSER AND NOTICED THAT THERE WERE CRACKS HALFWAY AROUND THE TIRE. I LOOKED AT  THE OTHER 3 TIRES AND NOTICED THAT THEY HAD CRACKS ALSO. THE TIRES LOOKED LIKED THEY WERE VERY OLD. *AK",
        "vin": "JT2BK12U110"
    },
    {
        "components": "STEERING,CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "08/29/2003",
        "dateOfIncident": "12/21/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036879,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "CHILD SAFETY SEAT",
                "productModel": "CHILD SAFETY SEAT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "FOR THE SECOND TIME IN LESS THAN 6 MONTHS ANOTHER FRONT TIRE BLEW OUT WHILE DRIVING.  FIRST BLOWOUT WAS IN AUGUST 2002 WITH ABOUT 21,000 MILES ON VEHICLE.   SECOND TIRE  BLOWOUT  OCCURRED WITH 27,000 MILES ON AN EIGHTEEN  MONTH OLD CAR.  THERE WAS NO ACCIDENT, BUT IT WAS VERY SCARY, AND IT FELT UNSAFE.   WHEELS VIBRATED FOR A FEW MONTHS, SMALL AMOUNT, BUT DEALER SAID NOTHING  WAS WRONG.  FINALLY, DEALER  INFORMED  CONSUMER THAT SOMETHING WAS WRONG WITH RACK AND PINION STEERING,  AND IT NEEDED REPLACEMENT.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2003",
        "dateOfIncident": "08/02/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036657,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TWICE NOW I HAVE HAD WARNING LIGHTS APPEAR ON MY  2001 TOYOTA PRIUS SCREEN. THE FIRST TIME WAS THREE WEEKS AGO WHILE I WAS DRIVING ON A FREEWAY IN HOT WEATHER. I PULLED OVER AS I WAS LOSING POWER. THE GAS ENGINE WOULD NOT TURN ON. I WAS ON BATTERY POWER ONLY. I LIMPED TO AN EXIT AND PARKED THE CAR.  I HAD THE CAR TOWED TO THE NEAREST TOYOTA DEALER. HE FIXED A STEERING RECALL PART AND THOUGHT IT MIGHT BE THE PROBLEM. HE COULD FIND NO ERROR CODES. I DROVE OFF.     YESTERDAY IT HAPPENED AGAIN UNDER THE SAME CONDITIONS. I PULLED OVER, WAITED TWENTY MINUTES AND STARTED THE CAR AGAIN. THE WARNING LIGHTS WERE THEN OFF AND THE POWER WAS NOW  NORMAL. I IMMEDIATELY TOOK IT TO MY HOME DEALER. HE TESTED IT AND TODAY TOLD ME THAT HE COULD FIND NOTHING. HE SAID THAT IF HE COULD NOT RECREATE THE PROBLEM IN THE SHOP, THERE WAS NOTHING HE COULD DO.    THERE IS NO  QUESTION THAT THIS IS A SIGNIFICANT SAFETY HAZARD AS THE LOSS OF POWER PARTICULARLY DURING AN ACCELERATION ONTO A FREEWAY COULD CAUSE A MAJOR ACCIDENT.  MY FAMILY WILL NOW NOT DRIVE  THE CAR ON A FREEWAY.*AK",
        "vin": "JT2BK12U210"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/25/2003",
        "dateOfIncident": "12/31/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033437,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WITHIN 9 MONTHS OF VEHICLE PURCHASE I HAD THREE FLAT TIRES AND REPLACED THE BRIDGESTONE POTENZA TIRES WITH A DIFFERENT BRAND RATHER THAN RIST ADDITIONAL FAILURES.  *AK",
        "vin": "JT2BK12U110"
    },
    {
        "components": "STEERING,SUSPENSION,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/11/2003",
        "dateOfIncident": "05/16/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022058,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE LOST POWER WHEN THE CONSUMER ATTEMPTED TO ACCELERATE. *AK ALSO THE VEHICLE PULLED TO THE RIGHT THE TIRES WERE REPLACED SEVERAL TIMES AND THE VEHICLE HAD NUMEROUS ALIGNMENTS.  THE RACK AND PINION WAS REPLACED AND THE FUEL TANK ASSEMBLY WAS REPLACE. *JB",
        "vin": "JT2BK12U010"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,TIRES,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "08/05/2003",
        "dateOfIncident": "08/03/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10030856,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CROWN",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "EXTREME TIRE BLOW OUT(ONLY SHREDS LEFT)HESITATION RESULTING IN LOSS OF POWER IN TRAFFIC/GAS PEDAL SENSOR?*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/02/2003",
        "dateOfIncident": "08/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030620,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "6/2001 PRIUS; MILEAGE ~20,000; BRIDGESTONE POTENZA 175/65/R14RX ORIGINAL TIRES; WHILE DRIVING APPROXIMATELY 40 MPH ON SURFACE STREETS, REAR RIGHT PASSENGER TREAD SEPARATED FROM THE TIRE. DEALER RECOMMENDED GOING TO TIRE VENDOR FOR WARRANTEE REPLACEMENT. PLAN TO PURSUE ISSUE WITH TOYOTA.*AK",
        "vin": "1G3AM69A9DM"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/29/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031479,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING FUEL IN VEHICLE IS CONSUMED FASTER THAN IT SHOULD BE. THE GAS TANK HAVE BEEN REPLACED TWICE, AND THE VEHICLE IS IN THE SHOP AT THIS TIME FOR ANOTHER FUEL TANK. CONSUMER FEELS THAT VEHICLE MAY HAVE BEEN DAMAGED DURING TRANSPORT TO DEALERSHIP BECAUSE THE FRONT END IS OUT OF ALIGNMENT. VEHICLE HAS HAD FIVE FRONT END ALIGNMENTS SINCE OWNERSHIP. *AK",
        "vin": "JT2BK12U010"
    },
    {
        "components": "STEERING,TIRES",
        "crash": false,
        "dateComplaintFiled": "07/23/2003",
        "dateOfIncident": "07/21/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029003,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "POTENZA 175/65/R14XL (OEM TIRES) WHICH ARE SPECIFICALLY MADE FOR THE PRIUS, WEAR QUICKLY AND ON THE EDGES.  THIS RESULTED IN MY TIRE TREAD HAVING A 1/32 RATING, WHILE THE MIDDLE OF THE TIRE STILL HAD A LONG LIFE LEFT.*AK    WHEN MAKING SHARP TURNS AT LOW SPEEDS (ESPECIALLY WHEN THE CAR IS COLD), THE STEERING WHEEL WILL VIBRATE (SOMETIMES AUDIBLY, SOMETIMES NOT). WERE THIS TO HAPPEN AT EVEN A SLIGHTLY HIGHER SPEED, ACCIDENTS MAY OCCUR. THIS PROBLEM HAS BECOME MORE FREQUENT IN THE LAST FEW WEEKS.  IT NOW OCCURS AT LEAST EVERY OTHER DAY.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/12/2003",
        "dateOfIncident": "06/20/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025944,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PREMATURE TIRE WEAR ON TOYOTA PRIUS.  *AK",
        "vin": "JT2BK12U010"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/11/2003",
        "dateOfIncident": "07/11/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025859,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THERE IS A TIRE SEPARATION PROBLEM WITH THE LATEST SET OF BRIDGESTONE TIRES THAT WE RECEIVED FROM THE TOYOTA DEALER FOR OUR PRIUS. THE ORIGINAL TIRES WERE RECALLED DUE TO PREMATURE WEAR. THE REAR LEFT TIRE SEPARATED AND MY DAUGHTER LUCKILY WAS ABLE TO CONTROL THE VEHICLE ON THE FREEWAY AT UNDER 55 MPH. SHE NOTICED THE PROBLEM IMMEDIATELY WHEN SHE GOT ON THE FREEWAY OR SHE MIGHT HAVE LOST CONTROL.    FOR AN EXAMPLE OF THE SEPARATION, SEE:   HTTP://WWW.FIRESTONE-TIRE-RECALL.COM/PAGES/ADVOCATE/11-13.HTML    WE HAD THE SAME PROBLEM WITH THE LEFT REAR AND SAME NEW CONDITION AS LINK ABOVE.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/08/2003",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025654,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING RACK PROBLEM.....NEEDS REPLACEMENT DUE TO A BROKEN ITEM IN THE STEERING RACK.   CAUSES HIGH PITCHED NOISE WHENEVER STEERING WHEEL IS TURNED.   TOYOTA AGREED TO REPLACE PART, BUT REQUIRES US TO PAY FOR THE LABOR TO REPLACE THE PART.  ($500).  *AK",
        "vin": "JT2BK12U910"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/07/2003",
        "dateOfIncident": "07/07/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026662,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ABOUT 70MPH ON THE HIGHWAY WITHOUT PRIOR WARNING THE DRIVER SIDE FRONT TREAD SEPARATED FROM THE VEHICLE.  THE TIRE BRIDGESTONE POTENXA RE92 175/65R14.  DEALER  IS AWARE OF PROBLEM. THIS IS THE CORRECT TIRE 175/65R14 XL845. *AK",
        "vin": "JT2BK12U310"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/23/2003",
        "dateOfIncident": "05/29/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023582,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE TIRES ON OUR 2001 PRIUS CONTINUALLY FAIL AFTER ABOUT 15,000 MILES. WE HAVE HAD STATE INSPECTIONS FAIL BECAUSE OF TREAD WEAR, REFUSED SERVICE AT BRIDGESTONE DEALERS BECAUSE OF TREAD WEAR. WITH LESS THAN 50K MILES WE ARE WORKING ON THE THIRD SET OF TIRES. WE CHECK PRESSURE AND ROTATE OUR TIRES REGULARLY.  SINCE TOYOTA CLAIMS THERE ARE NO REPLACEMENTS AND NO TREAD WEAR WARRANTIES, WE THINK THE CAR SHOULD NO LONGER BE ALLOWED ON THE US MARKET.    *NLM",
        "vin": "JT2BK12U710"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/25/2003",
        "dateOfIncident": "11/04/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009888,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE CONSUMER EXPERIENCED A FLAT TIRE.  THE CONSUMER NOTICED THE TIRE WAS WORN BADLY ON THE INSIDE.  THE MANUFACTURER OFFERED A SUPPLEMENTAL TIRE WARRANTY, IN WHICH THE CONSUMER DID QUALIFY, DUE TO THE FACT THE TIRES WEREN'T ROTATED.  SCC",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/30/2002",
        "dateOfIncident": "09/21/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567990,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT TIRES WORE OUT UNEVENLY.  THE OUTSIDE OF THE TIRES WORE TO THE POINT THAT AIR WAS LEAKING OUT.  CONSUMER TIRES WERE NOT APART OF A RECALL TOYOTA ISSUED ACCORDING TO THE VIN OF THE VEHICLE.  THE TIRES ARE BRIDGESTONE POTENZA RE 92, TUBELESS STEEL BELTED RADIAL M+S.  P175/65 R14 84S.  DOT # EL 9P T9902, JDH 2301 E92Z.  CONSUMER REQUEST RECALL INFORMATION ON THESE TIRES STATED ABOVE. *JG",
        "vin": "JT2BK12U810"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/30/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 568076,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATES THAT THE VEHICLE HAD GONE OUT OF CONTROL.  THE CONSUMER WAS COASTING INTO THE DRIVEWAY, WHEN SHE PLACED HER FOOT ON THE BRAKE, THE VEHICLE SURGED INTO THE GARAGE AND DAMAGED ITEMS.  THE CONSUMER NO LONGER WANTS THE VEHICLE BECAUSE SHE FEELS UNSAFE.  THE CONSUMER SAID THAT TOYOTA DIDN'T WANT TO EXCEPT RESPONSIBILTY, EVEN THOUGH THE SERVICE MANAGER DID REPORT THAT THE GAS ENGINE SURGE COULD OCCUR IN ORDER TO CHARGE THE BATTERY.  *SCC    *DT",
        "vin": "JT2BK12U510"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/22/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567927,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES HE CAN NOT SEE ANY OF THE INSTRUMENTS ON THE PANEL IN THE DAYLIGHT FROM THE CRUISE CONTOL LIGHT, TO THE DIRECTIONAL SIGNAL, AS WELL AS NOT BEING ABLE TO HEAR THE DIRECTIONAL SIGNALS, AND THE SPEEDOMETER READING CAN'T BE READ AS WELL, CONSUMER CAN'T NOT SEE THE PRE SET READING FOR THE RADIO UNLESS IT IS NIGHT TIME, ALSO THE GAS LEVEL BAR NO LONGER LIGHTS UP TO WARN THE CONSUMER THAT THE FUEL IS LOW.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768628,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SITTING FOR AS MANY AS 2 DAYS WITHOUT DRIVING, THERE IS A BATTERY FAILURE.  THIS HAS OCCURRED ON NUMEROUS OCCASIONS (8-10 TIMES), AND THE DEALER HAS SENT A TOW TRUCK OUT TO EITHER START THE CAR OR TOW THE CAR INTO THE DEALERSHIP.  AT ONE POINT, THE CAR WAS IN THE DEALERSHIP FOR 3 WEEKS WHILE THEY WORKED ON SOLVING THE PROBLEM.  THEY HAVE PUT IN SEVERAL NEW BATTERIES, BUT THE PROBLEM CONTINUES.  THE LATEST OCCASION WAS THIS PAST WEEK (OCTOBER, 2002).  I WAS WITHOUT THE CAR FOR 3 DAYS.  NO PROBLEMS WERE FOUND AT THE DEALERSHIP EXCEPT FOR BATTERY FAILURE.  IN THE PAST THE DEALERSHIP HAS PROVIDED ME WITH A BATTERY CHARGER, BUT THE BATTERY CHARGER IS CURRENTLY NOT WORKING PROPERLY.  DT",
        "vin": "JT2BK12U510"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/24/2002",
        "dateOfIncident": "08/10/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019339,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES DROVE HIS NEW AUTO APPROX 300 MILES AND HAD IT PARKED, WHEN HE WENT TO GET HIS AUTO THE PANEL LIGHTS WERE LIT, WARNING THAT SOMETHING WAS WRONG.   AFTER CALLING A DEALER AND DRIVING HIS AUTO, HE WAS TOLD THAT NOTHING WAS WRONG WITH THE AUTO.  CONSUMER STATES THAT THIS SAME PROBLEM IS ON OUR WEB SITE.  NLM",
        "vin": "JT2DK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/17/2002",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HYBRID ELECTRIC VEHICLE; STEERING RACK FAILED CAUSING VEHICLE TO PULL FROM SIDE TO SIDE.   *AK  *NLM",
        "vin": "JT2BK12U510"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/19/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764479,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE POWER STEERING CUTS OUT AT RANDOM TIMES. THE DEALER SAYS I NEED A NEW STEERING RACK, BUT IT HAS BEEN WEEKS AND NO RACK HAS SHOWN UP. NOW I'M HEARING FROM OTHER PRIUS OWNERS THAT THIS PROBLEM IS WIDESPREAD AND TOYOTA IS REDESIGNING THE WHOLE STEERING SYSTEM. MEANWHILE I'M STUCK WITH A CAR WHERE THE POWER STEERING CAN CUT OUT AT ANY TIME.",
        "vin": "JT2BK12U510"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2002",
        "dateOfIncident": "06/26/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012772,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL EQUIPMENT HAD WORN DOWN TO THE TREAD.  WHILE DRIVING AT 50 MPH IN A 2001 TOYOTA, PRIUS LEFT REAR TIRE HAD A BLOWOUT.  REPLACEMENT EQUIPMENT TIRE SIZE P175/65R14, DOT# EL9PJDH0102. BRIDGESTONE AND MANUFACTURER WERE NOTIFED. *AK CONSUMER BELIEVES VEHICLE IS TOO HEAVY FOR TIRES.  *TT",
        "vin": "JT2BK12U910"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/14/2002",
        "dateOfIncident": "09/14/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763062,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUED EXCESSIVE TIRE WEAR POSSIBLE CAUSE VEHICLE WEIGHT AND ALIGNMENT PROBLEM.  I AM ON MY THIRD SET OF TIRES IN 30,000 MILES AND THE TIRES THAT ARE NOW ON THE CAR ARE WEARING POORLY AFTER LESS THEN 5,000 MILES.  TOYOTA IS REFUSING TO HELP ME WITH THIS PROBLEM ANY FURTHER THEN THEY HAVE.  THE CAR WONDERS IN SLIGHTLY WINDY CONDITIONS AND FREEWAY DRIVING WHICH FELLS UNSAFE.  TOYOTA HAS HAD TO REPLACE THE COMPUTER AND DO A VALVE JOB DUE TO THE LOSS OF POWER I EXPERIENCED, WHICH COULD HAVE BEEN A VERY DANGEROUS SITUATION.*AK",
        "vin": "JT2BK12U410"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/14/2002",
        "dateOfIncident": "06/07/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763071,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER INFORMS THAT 2 OTHER VEHICLES ARE IN FOR REPAIR FOR THE SAME FAILURE.  ALL THREE VEHICLES CAME IN WITHIN A 2 WEEK PERIOD.  I HAVE BEEN GIVEN AN ESTIMATE OF TIME TO REPAIR RANGING FROM 2 TO 4 WEEKS BECAUSE OF UNAVAILABILITY OF PARTS.  DEALER'S SERVICE DEPARTMENT FEELS THAT THE CAR IS UNSAFE TO DRIVE.  STEERING WHEEL EXPERIENCES \"MINOR JERKS OR TICS\".  SERVICE WRITTER SAYS THIS IS BECAUSE OF ERRANT ELECTRICAL SIGNALS BEING SENT TO POWER ASSIST.*AK",
        "vin": "JT2BK12U610"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/23/2002",
        "dateOfIncident": "08/02/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 762189,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A TIRE SEPARATE AT 75MPH IN THE REAR.  A COUPLE WEEKS LATER THE FRONT RIGHT TIRE SEPARATED AT 70MPH.  THE CAR HAD APPROX. 20000 ON IT.  WHEN TOYTOTA RAISED THE CAR THEY FOUND A THIRD FRONT LEFT TIRE HAD BEGUN TO SEPERATE.  I SAID I DID NOT TRUST THESE BRIDGESTONE/FIRESTONE TIRES SO THEY PUT ON MICHELIN TIRES.  THE DEALER THEN CALLED AND SAID NO OTHER TIRE COULD SUPPORT THE WEIGHT OF THE PRIUS.  THEY HAD ALREADY PUT THE MICHELINS ON.  I CALLED ALL THE TIRE MANUFACTURES TO FIND OUT THAT ONLY THE FACTORY BRIDGESTONE/FIRESTONE TIRES COULD SUPPORT THE WEIGHT OF THE HYBRID PRIUS.  I PHONED TOYOTA AND FIRESTONE.  BOTH SAID THEY WOULD CALL ME BACK WITHIN THREE WEEKS.  NO ONE HAD CALLED.  TOYOTA SAID IT IS A TIRE MANUFACTURER  PROBLEM, BUT THEY USE  THEIR TIRES.  I WENT TO THE DEALER TO BE TOLD SINCE I TOOK THE CAR IN THEY HAD THREE OTHER PRIUS'S COME IN WITH BLOWN TIRES ALL WITH ABOUT 20000 MILES ON THEM.  I WENT TO SEARS IN SAN BERNARDINO AND WAS TOLD THAT THEY TOO HAD TWO PRIUS'S WITH BLOWN TIRES.  I HAVE LOST OVER $2000.00 AND SPENT THREE WEEKS WITH A PAINFUL KNEE AND TOYOTA DOESN'T CARE.  I GOT THREE FRIENDS TO BUY TOYOTA PRIUSS AND I NOW WORRY ABOUT THEIR TIRES.  SINCE THIS STARTED TOYOTA EMAIL ME AND SAID DO NOT DRIVE THE CAR OVER 85 MPH FOR THE TIRES CAN NOT SUPPORT THE CAR AND SPEED.  WHY WEREN'T WE TOLD THIS AT TIME OF PURCHASE?  NO OTHER TIRE IS MADE FOR THE CAR AND THE BRIDGESTONE/FIRESTONE TIRES ARE NOT UP TO SUPPORTING THE CAR SAFELY EVER.  I WILL TAKE MY CHANCES WITH THE MICHELINS.  OTHER PRIUS OWNERS HAVE TOLD ME THEY WILL TAKE THEIR CHANCES WITH OTHER BRANDS EVEN  IF THEY ARE NOT RATED FOR CAR. *AK *JB",
        "vin": "JT2BK124610"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/23/2002",
        "dateOfIncident": "08/02/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 762189,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAD A TIRE SEPARATE AT 75MPH IN THE REAR.  A COUPLE WEEKS LATER THE FRONT RIGHT TIRE SEPARATED AT 70MPH.  THE CAR HAD APPROX. 20000 ON IT.  WHEN TOYTOTA RAISED THE CAR THEY FOUND A THIRD FRONT LEFT TIRE HAD BEGUN TO SEPERATE.  I SAID I DID NOT TRUST THESE BRIDGESTONE/FIRESTONE TIRES SO THEY PUT ON MICHELIN TIRES.  THE DEALER THEN CALLED AND SAID NO OTHER TIRE COULD SUPPORT THE WEIGHT OF THE PRIUS.  THEY HAD ALREADY PUT THE MICHELINS ON.  I CALLED ALL THE TIRE MANUFACTURES TO FIND OUT THAT ONLY THE FACTORY BRIDGESTONE/FIRESTONE TIRES COULD SUPPORT THE WEIGHT OF THE HYBRID PRIUS.  I PHONED TOYOTA AND FIRESTONE.  BOTH SAID THEY WOULD CALL ME BACK WITHIN THREE WEEKS.  NO ONE HAD CALLED.  TOYOTA SAID IT IS A TIRE MANUFACTURER  PROBLEM, BUT THEY USE  THEIR TIRES.  I WENT TO THE DEALER TO BE TOLD SINCE I TOOK THE CAR IN THEY HAD THREE OTHER PRIUS'S COME IN WITH BLOWN TIRES ALL WITH ABOUT 20000 MILES ON THEM.  I WENT TO SEARS IN SAN BERNARDINO AND WAS TOLD THAT THEY TOO HAD TWO PRIUS'S WITH BLOWN TIRES.  I HAVE LOST OVER $2000.00 AND SPENT THREE WEEKS WITH A PAINFUL KNEE AND TOYOTA DOESN'T CARE.  I GOT THREE FRIENDS TO BUY TOYOTA PRIUSS AND I NOW WORRY ABOUT THEIR TIRES.  SINCE THIS STARTED TOYOTA EMAIL ME AND SAID DO NOT DRIVE THE CAR OVER 85 MPH FOR THE TIRES CAN NOT SUPPORT THE CAR AND SPEED.  WHY WEREN'T WE TOLD THIS AT TIME OF PURCHASE?  NO OTHER TIRE IS MADE FOR THE CAR AND THE BRIDGESTONE/FIRESTONE TIRES ARE NOT UP TO SUPPORTING THE CAR SAFELY EVER.  I WILL TAKE MY CHANCES WITH THE MICHELINS.  OTHER PRIUS OWNERS HAVE TOLD ME THEY WILL TAKE THEIR CHANCES WITH OTHER BRANDS EVEN  IF THEY ARE NOT RATED FOR CAR. *AK *JB",
        "vin": "JT2BK124610"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/02/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006823,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SUSPENSION HAS BEEN WEARING  OUT FRONT TIRES.  WARRANTY OF  TIRES EXPIRED. *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/22/2002",
        "dateOfIncident": "01/15/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006206,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES ON 2001, TOYOTA, PRIUS, ORIGINAL EQUIPMENT, TIRE SIZE P175/65R14, DOT# EL 9P CHA 2700 AND EL 9P CHA 2800 ARE WEARING UNUSUALLY.  MANUFACTURER WAS NOTIFIED. *AK  *YH",
        "vin": "JT2BK12U110"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/20/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED TIRES HAD TO BE REPLACED AT LESS THAN 15,000 MILES, THE RIGHT FRONT AND LEFT FRONT TIRE FAILED FROM EXCESSIVE WEAR, CONSUMER STATED TIRES ON A NEW VEHICLE SHOULD NOT SHOW SIGNS OF EXCESSIVE WEAR IN 15,000, THE DEALER INFLATED THE TIRE PRESSURE TO 32PSI, HOWEVER CONSUMER WAS LATER INFORMED THAT TIRE NEEDED TO BE INFLATED BETWEEN 45 AND 50 PSI, CONSUMER IS REQUESTING REIMBURSEMENT SINCE ORIGINALLY THE DEALER UNDER INFLATED THE TIRES.*JB",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE STEERING RACK WAS REPLACED.*JB",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE STEERING RACK WAS REPLACED.*JB",
        "vin": "JT2BK12U710"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/26/2002",
        "dateOfIncident": "04/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757380,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING HAS PROBLEM OF POOR RETURN REQUIRES CONSTANT INPUT TO THE STEERING WHEEL TO KEEP THE CAR ON THE ROAD. *AK",
        "vin": "JT2BK12U110"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/04/2001",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 899809,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED FOUR BLOWOUTS ON ORGINAL EQUIPMENT BRIDGESTONE TIRES, SIZE P17565R14. FRONT SIDE AND REAR PASSENGER SIDE TIRES HAD TWO OF THE FOUR BLOWOUTS. THIRD BLOWOUT OCCURED WHILE VEHICLE WAS BEING TEST DRIVEN AT  DEALERSHIP. ALL BLOWOUTS HAVE OCCURRED AT LOW SPEEDS, EXCEPT FOR BLOWOUT AT THE DEALERSHIP. *AK  *SLC",
        "vin": "JT2BK12U310"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/11/2001",
        "dateOfIncident": "11/10/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 30,000 MILE SERVICE I WAS TOLD MY CAR WAS \"NOT SAFE TO DRIVE.\" THE TIRES WERE WORN TO THE CORDS. TOYOTA REPLACED THEM FOR FREE, BUT I WAS TOLD THAT THE PRIUS WAS KNOWN FOR HAVING \"PROBLEMS\" WITH THEIR TIRES. HAD I NOT BEEN TOLD ABOUT THE CONDITION OF MY TIRES, I MIGHT HAVE HAD AN ACCIDENT. OTHER PRIUS OWNERS SHOULD BE NOTIFIED OF THIS.*AK (TIRESIZE: P175/65R14)",
        "vin": "JT2BK12U610"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/06/2001",
        "dateOfIncident": "10/04/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785719,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALTHOUGH THE TIRES ON THIS VEHICLE WERE SPECIFICALLY DESIGNED FOR IT BY BRIGESTONE, THE TREAD COMPOUND IS TOO WEAK TO CARRY THE HIGH WEIGHT OF THE VEHICLE WITHOUT FAILING.",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/06/2001",
        "dateOfIncident": "10/04/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785719,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALTHOUGH THE TIRES ON THIS VEHICLE WERE SPECIFICALLY DESIGNED FOR IT BY BRIGESTONE, THE TREAD COMPOUND IS TOO WEAK TO CARRY THE HIGH WEIGHT OF THE VEHICLE WITHOUT FAILING.",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/04/2001",
        "dateOfIncident": "08/28/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751635,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS ADVISED DURING A ROUTINE OIL CHANGE THAT MY TIRES WERE UNSAFE TO DRIVE ON.  I WAS ALSO ADVISED THAT TIYOTA KNOWS THAT THESE UNIQUE TORES FAIL AT  ABOUT 10,000 MILES.  TOYOTA SAYS THAT THESE TIRES ARE THE ONLY TYPE ACCEPTABLE FOR USE ON THIS VEHICLE AND TO USE ANOTHER MANUFACTURER WILL VOID THE WARRANTY.  THERE ARE NO REPLACEMENT TIRES AVAILABLE AND THEY (THE DEALER) ESTIMATES AT LEAST ONE MONTH WAIT.  *AK (TIRESIZE: P175/65R14)",
        "vin": "JT2BK12U010"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2001",
        "dateOfIncident": "08/11/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 895092,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER TOOK VEHICLE TO A SHOP FOR A ROUTINE CHECK UP AND MECHANIC INSPECTED  FRONT TIRES, AND NOTICED THAT ON  BOTH TIRES  TREAD BEGAN TO  SEPARATE.   THEY  WERE BRIDGE STONE/ FIRESTONE  TIRES.  DEALERSHIP  WAS AWARE OF  PROBLEM.*AK",
        "vin": "JT2BK12U310"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,WHEELS",
        "crash": true,
        "dateComplaintFiled": "08/21/2001",
        "dateOfIncident": "08/12/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750847,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 45MPH ON DRY PAVEMENT, CLEAR WEATHER CONDITIONS I DISENGAGED  CRUISE CONTROL BY TAPPING BRAKES.  SO THAT I COULD ACCELERATE INTO TRAFFIC. THE VEHICLE PULLED HARD TO THE LEFT. I THEN FOUND MYSELF IN A COUNTERCLOCKWISE SKID ACROSS THE PAVEMENT AS I LEFT THE PAVEMENT I FELT THE REAR OF THE VEHICLE DROP. NOW SPINNING I  BOUNCED OFF A TREE AND INTO A DRAINAGE DITCH WITH ABOUT 1 AND 1/2 FOOT OF MUD AND WATER. IT WAS THEN I NOTICED THAT ONE OF THE WHEELS (LEFT REAR) HAD SEPARATED FROM THE VEHICLE AND WAS ON THE OTHER SIDE OF THE DITCH. IT ALL HAPPENED SO FAST I HAVE NO IDEA OF THE ACTUAL CAUSE. THE STUDS WHICH HOLD THE WHEEL TO THE AXEL SHEAREDOFF,  ANS AXLE  SNAPPED, THE UNDERCARRAGE AND SUPPORTS WERE TANGLED. FHP OFFICER AT SITE INDICATED IT COULD HAVE BEEN MECHANICAL MALFUNCTION OF SOME SORT. BECAUSE OF CONDITIONS I CONTACTED TOYOTA AS WELL AS INSURANCE CO (PROGRESSIVE). NO ONE HAS YET EVALUATED THE CAUSE. TOYOTAS FIRST COMMENT WAS \"WHAT DO YOU EXPECT FROM AN INVESTIGATION\" MY ANSWERWAS \" TO PREVENT A SIMILAR EVENT IN THE FUTURE\". AS I RELATED THE EVENT TO EVERY ONE I ALSO NOTED THAT THE STEERING DIDNOT LET ME CORRECT THE SKID. THE VEHICLE IS CURRENTLY HELD IN LIMBO BY INSURANCE AND TOYOTA. WHILE I AM WALKING. ALL SAFETY EQUIPMENT FUNCTIONED PROPERLY.*AK",
        "vin": "JT2BK17UO10"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2001",
        "dateOfIncident": "08/19/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 750886,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FOUR DIFFERENT DATES, 5/01, 8/9/01, 8/10/01, 8/19/01, THE ABOVE MENTIONED PRIUS HAS LOST POWER IN INTERSTATE TRAFFIC CAUSING DRIVER TO MOVE TO THE SHOULDER OF THE ROAD AND PROCEED ON BATTERY POWER TO NEXT EXIT.  THIS WOULD BE A VERY DANGEROUS SITUATION IN AREAS OF OUR STATE WHERE HIGHWAYS ARE UNDER CONSTRUCTION AND CONCRETE BARRICADES TAKE THE PLACE OF SHOULDERS.  AFTER THE FOURTH INCIDENT THE DEALER IS ORDERING SOME REPLACEMENT COMPUTER PART.  WE ARE CONCERNED ABOUT THE FREQUENCY OF THIS PROBLEM WITH OTHER SIMILAR VEHICILES SINCE THEY ARE NEW TO THE UNITED STATES DRIVING COMMUNITY.*AK",
        "vin": "JT2BK12UX10"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/01/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9002274,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE SENSITIVITY TO WIND AND CROSS WINDS EVEN AT LOW WIND VELOCITY. VEHICLE WANTS TO WANDER DUE TO WIND. VEHICLE SHAKES IN THE WAKE OF A 18 WHEELER AND OTHER TRUCKS. THE SIDEVIEW MIRRORS ARE SET TOO FAR FROM THE BODY OF THE VEHICLE. THIS INCREASES THE EXTENT OF THE BLIND SPOTS.",
        "vin": "JTZBK1ZU310"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2001",
        "dateOfIncident": "01/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 891396,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL EQUIPMENT BRIDGESTONE 13INCH TIRES FOR THE 2001, TOYOTA, TIRES HAD TO BE REPLACED 3 TIMES IN A FIVE MONTH PERIOD FOR  FRONT PASSENGER AND DRIVER SIDES OF VEHICLE.*AK  TIRES CONTINUALLY WEAR ON THE INSIDE TREAD OF THE TIRE, CONSUMER STATES THIS HAPPENS ALMOST EVERY 3000 MILES, WEAR IS PRIMARILY WITH THE LEFT FRONT WHERE THE ELECTRIC BATTERY/MOTOR ARE.   *SLC",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/22/2001",
        "dateOfIncident": "02/07/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 3,
        "numberOfInjuries": 0,
        "odiNumber": 9003041,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG DID NOT OPEN, DURING THIS ACCIDENT THERE WERE 3 DEATHS.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/23/2001",
        "dateOfIncident": "01/14/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 741400,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN ONE WEEK OF OWNERSHIP, THE VEHICLE STARTED TO BOG DOWN WHEN MAKING A TURN FROM A DEAD STOP. A DAY LATER THE ENGINE LIGHT CAME ON. THE PROBLEM WAS BROUGHT TO THE DEALERS ATTENTION AND THE REPLY WAS THAT; \"WE DON'T KNOW WHAT'S WRONG, WHEN WE FIND OUT WE'LL LET YOU KNOW...UNTIL THEN, BE CAREFUL\"  THAT WAS OVER A MONTH AGO AND I HAVEN'T HEARD ANYTHING FROM THEM. I CALLED TO FIND OUT WHAT WAS GOING ON AND WAS TOLD THAT THEY STILL DIDN'T HAVE A CLUE WHAT WAS WRONG. THE VEHICLE IS UNPREDICTABLE WHEN TAKING OFF AND HAS ALREADY RESULTED IN A COUPLE OF CLOSE CALLS WHEN PULLING OUT INTO TRAFFIC. THE GENERAL ATTITUDE IS NONCHALANT AND NOBODY HAS MADE ANY ATTEMPT TO NOTIFY ME OF ANYTHING. FROM WHAT I WAS TOLD BY THE DEALERSHIP. ALL THE 2001 HIGHLANDERS ARE EXPERIENCING THE SAME PROBLEM.",
        "vin": "JTEGD21A010"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/26/2001",
        "dateOfIncident": "01/26/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 739977,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL THE LIGHTS CAME ON NOT TO DRIVE THE VEHICLE WHEN I STARTED IT.  IT HAS BEEN AT THE TOYOTA DEALER EVER SINCE, OVER A MONTH AGO.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/22/2000",
        "dateOfIncident": "12/22/2000",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 738149,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE IS LOW-PROFILE DESIGN STANDARD ON PRIUS. EXPLOSIVE SEPARATION OCCURRED ON DRY ROADWAY WITHOUT DEBRIS. OUTSIDE AIR TEMPERATURE WAS APPROXIMATELY 78 DEGREES. THANK GOODNESS THAT THE TIRE WAS ON THE REAR. DRIVER WAS ABLE TO INITIATE A CONTROLLED STOP FROM THE NUMBER ONE LANE TO THE RIGHT SHOULDER. THE SEPARATION CAUSED DAMAGE TO THE LEFT REAR QUARTER-PANEL, THE ALLOY RIM AND OF COURSE THE TIRE. BRIDGESTONE CUSTOMER CARE WAS CONTACTED AT 800-847-3272 AND I WAS ADVISED THAT THEY WOULD SEND A CLAIM PACKAGE WITHIN 5 DAYS. THERE IS NO REFERENCE NUMBER ASSIGNED. THEY INDICATED THAT THEY WOULD PAY FOR REPAIRS. SERIAL NUMBER FOR ALL 4 TIRES IS: CHA3700. IT IS LIKELY THAT THIS LOT OF TIRES IS ON ALL OF THE PRIUS VEHICLES SITTING AT THE LONG BEACH, CALIFORNIA STORAGE FACILITY. THE TIRE PRESSURE ON THE VEHICLE WAS CHECKED THE DAY BEFORE THE INCIDENT AND ALL TIRES WERE INFLATED ACCORDING TO SPECIFICATIONS.  *AK (DOT NUMBER: EL9P  TIRESIZE: P17565 R14)",
        "vin": "JT2BK12U310"
    }
]