[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/09/2004",
        "dateOfIncident": "09/08/2004",
        "fire": false,
        "manufacturer": "TRADEWINDS CONVERSIONS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090689,
        "products": [
            {
                "manufacturer": "TRADEWINDS CONVERSIONS",
                "productMake": "TRADEWINDS",
                "productModel": "MOTORHOME",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "XRV",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY MOTORHOME, A 2001 TRADE WINDS HAD TWO BLOWOUTS AT THE SAME TIME, THE RIGHT FRONT AND THE RIGHT INSIDE DUAL AT THE SAME TIME ON I-10 NEAR LIVE OAK FLORIDA.  THERE ARE 25,000 MILES ON THE TIRES AND THIS IS THE SECOND AND THIRD BLOWOUT.  THE FIRST OCCURRED AT THE END OF SEPTEMBER 2003 AND DAMAGED THE MOTORHOME.  NHTSA SHOULD DO SOMETHING ABOUT THESE TIRES AS MICHELIN IS THE ONLY ONE THAT MAKES THEM AND THEY ARE DANGEROUS.*AK",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/06/2004",
        "dateOfIncident": "01/01/2001",
        "fire": true,
        "manufacturer": "TRADEWINDS CONVERSIONS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057904,
        "products": [
            {
                "manufacturer": "TRADEWINDS CONVERSIONS",
                "productMake": "TRADEWINDS",
                "productModel": "MOTORHOME",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MOTORHOME'S WINDSHIELD WIPERS QUIT WORKING TWICE, FRESH WATER TANK BEGAN TO LEAK WATER, AUTOMATIC STEPS CEASED TO WORK, AND A RECALL ON THE ACCELERATOR SPRING WHICH PROVED TO BE A MISTAKE.   *LA   THE GENERATOR IDLER FOR THE BELT TENSION NEVER STAYED IN ADJUSTMENT, THE FRONT DOOR WOULD NOT OPEN ON SEVEN OCCASIONS, THE ENGINE SMOKED, THE ALTERNATOR WENT OUT, THE TIE WRAP HAD BROKE AND CAUSED OVERHEATING, THE LEFT FRONT AUTOMATIC LEVELING JACK DID NOT RETRACT, THE ENGINE BLEW DUE TO THE CAT AIR CLEANER BEING BUILT WRONG, THE RADIATOR HOSE BROKE, THE FRAME CAVED IN, THE COOLANT HOSE HAD GONE BAD, THE SERPENTINE BELT SLIPPED, THE FRESH WATER PUMP MODULE HAD GONE BAD, THE GENERATOR HAD GONE OUT ON FOUR OCCASIONS, THE GENERATOR IDLER PROBLEM RECURRED, THE STARTER HAD GONE OUT, THE HYDRAULIC LINE HAD BLOWN OUT, THE STEERING HAD BLOWN OUT TWICE, THE EXHAUST HEADER PIPE HAD FALLEN OFF, THE RADIATOR CLAMP RUSTED OFF, THE INSIDE TAIL PIPE RUSTED OUT, AND EXHAUST FLAMES WOULD CATCH INSIDE THE FIBERGLASS OF THE COACH BODY AND CAUSED THE MUDFLAPS TO CATCH FIRE.  2001 TRADEWINDS 37 FT. 9 INCH MOTORHOME.   *SC   *JB",
        "vin": ""
    }
]