[
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2017",
        "dateOfIncident": "08/07/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11014142,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70. WHILE DRIVING 35 MPH, THE VEHICLE INDEPENDENTLY STOPPED. THE VEHICLE WAS ABLE TO RESTART; HOWEVER, IT SHOOK VIOLENTLY. THE VEHICLE WAS TAKEN TO A LOCAL DEALER (MITCHELL VOLVO CARS OF SIMSBURY 384 HOPMEADOW STREET, SIMSBURY, CT 06070) WHERE IT WAS DIAGNOSED THAT THE THROTTLE MODULE NEEDED AN UPDATE. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED BACK TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE THROTTLE MODULE FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER SENT AN ELECTRICAL SPECIALIST TO THE LOCAL DEALER TO PROPERLY DIAGNOSE THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 105,000.",
        "vin": "YV1SZ58D211"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "08/17/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896566,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70. THE CONTACT STATED THAT THE HATCHBACK DID NOT OPEN WITHOUT ELECTRICITY. WHEN THE VEHICLE'S BATTERY FAILED, THE CONTACT WAS UNABLE TO OPEN THE HATCH. THE CONTACT ALSO STATED THAT THERE WAS NO HANDLE OR ANY MEANS TO UNLOCK THE HATCH FROM OUTSIDE OR INSIDE THE VEHICLE WITHOUT POWER, MAKING IT A DEATH TRAP IN AN EMERGENCY SITUATION FOR THOSE SEATED IN THE BACK ROWS. THE CONTACT MADE THE MANUFACTURER AWARE OF THE FAILURE AND WAS INFORMED THAT HIS CONCERN WOULD BE NOTED. THE FAILURE MILEAGE WAS 174,810. UPDATED 01/10/2017*CT",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/25/2013",
        "dateOfIncident": "01/25/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494710,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2001 VOLVO XC70 HAS NEVER FAILED TO START UNTIL THIS OCCURRENCE  WHEN ATTEMPTED TO START IT CHUGGED HORRIBLY & ENGINE FAILURE & ENGINE SYSTEM SERVICE URGENT CODE APPEARED  THE CAR DIED & REPEATED ATTEMPTS TO STAR IT FAILED  DIAGNOSIS REVEALS A NON-SERVICE LISTED ISSUE AS WE HAVE ALWAYS HAD THIS CAR PROPERLY SERVICED PROMPTLY AS NEEDED. THE ISSUE IS A \"THROTTLE BODY FAILURE\".  ACCORDING TO THE VOLVO SERVICE SHOP THIS WILL COST ME $800 TO $1000 TO FIX!!  LAST JANUARY I HAD TO PURCHASE A WIRE HARNESS FOR THIS CAR THAT WAS $1400!!  I HAVE READ MANY COMPLAINTS ON THIS THROTTLE BODY ISSUE AND WISH TO ADD MY COMPLAINT FOR THIS AS WELL AS THE WIRE HARNESS I PAID SO MUCH FOR LAST YEAR.  FOR A CAR THAT COSTS THIS MUCH AND MORE THAN 50% MORE TO MAINTENANCE THAN ANY OTHER VEHICLE I HAVE OWNED IN 40YRS THESE KINDS OF FAILURES SHOULD NOT BE ABSORBED BY THE CONSUMER  VOLVO SHOULD OFFER SOME KIND OF COMPENSATION TO HELP PROPERLY REPLACE THESE KINDS OF FAULTY SYSTEMS AND BEAR AT LEAST 1/2 THE COST.  *TR",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/01/2012",
        "dateOfIncident": "09/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446172,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70. THE CONTACT WAS DRIVING 35 MPH WHEN THE VEHICLE FAILED TO SHIFT GEARS PROPERLY. THE VEHICLE WAS THEN TAKEN TO AN AUTHORIZED DEALER. THE MANUFACTURER WAS NOT NOTIFIED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 85,000 AND THE CURRENT MILEAGE WAS 103,000.   UPDATED 02/22/12 *BF  THE CONSUMER TOOK THE VEHICLE TO THE DEALER ON 02/04/11. SHE MENTIONED THE FAILURE OF THE GEARS NOT SHIFTING PROPERLY AND THE DEALER PERFORMED A SOFTWARE DOWNLOAD, WHICH DID NOT FIX THE PROBLEM.  THE CONSUMER WENT BACK TO THE DEALER EIGHT MONTHS LATER FOR THE 9,500 MAINTENANCE SERVICE AND THE PROBLEM WAS MENTIONED AGAIN. FINALLY AT 103,000 ON JAN 31, 2012 THE TRANSMISSION WAS REPLACED WITH A RE-MANUFACTURED ONE. UPDATED 03/01/12",
        "vin": "YV1SZ58D611"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2011",
        "dateOfIncident": "11/23/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440352,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IS SLIPPING BETWEEN GEARS 2-3 AND 3-4. MECHANICS RECOMMENDS TRANSMISSION REPLACEMENT. CAR HAS 94,000 MILES. THIS IS A FAMILY CAR AND NOT DRIVEN HARD. I'VE HAD 3 CARS OVER HUNDRED THOUSAND MILES AND THIS IS THE FIRST TIME I'VE HAD A TRANSMISSION FAILURE ON THE MOST EXPENSIVE CARE I'VE OWNED.   *TR",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/06/2011",
        "dateOfIncident": "07/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410792,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "NORMAL DRIVING, AT APPROXIMATELY 142,000 MILES TRANSMISSION SERVICE REQUIRED LIGHT CAME ON AFTER TRANSMISSION BEGAN SLIPPING AND \"CLUNKING\". TRANSMISSION FAILURE ON 2001 VOLVO XC70. $4,000+ REPAIR, COMMON TO THE 2001 XC70 MODEL.  *TR",
        "vin": "YV1SZ58D211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2011",
        "dateOfIncident": "06/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10408570,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70.  THE CONTACT STATED THAT WHEN ATTEMPTING TO DRIVE IN REVERSE, THE VEHICLE WOULD SHIFT INTO DRIVE AND ACCELERATE FORWARD. THE DEALER NOR MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT INSPECTED OR REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 95,000.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/12/2011",
        "dateOfIncident": "05/12/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10400638,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70.  THE CONTACT STATED THAT THE VEHICLE WOULD EXHIBIT A LOUD, ABNORMAL NOISE WHEN SHIFTING GEARS.  THE NOISE WOULD ALSO OCCUR WHILE THE VEHICLE DOWNSHIFTED AND SPORADICALLY, WOULD NOT ACCELERATE OVER 45 MPH.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 129,000.",
        "vin": "YV1SZ58D011"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/09/2011",
        "dateOfIncident": "05/01/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399694,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 VOLVO XC70 WAGON HAD THE COIL SPRING SNAP ON THE DRIVER'S SIDE FRONT SIDE. MY WIFE WAS DRIVING WHEN SHE HEARD A LOUD NOISE IN THE FRONT END OF THE VEHICLE. I HAVE CHECKED ONLINE AT VOLVO REPAIR SITES AND IT APPEARS THIS IS A FAIRLY COMMON PROBLEM WITH THIS MODEL CAR.     IT IS A GREAT CONCERN TO ME AS BELIEVE IT IS A POTENTIALLY SERIOUS SAFETY ISSUE SINCE THE BROKEN SPRING A DIRECTLY ABOVE THE FRONT TIRE, WHICH COULD CAUSE IT TO PUNCTURE AT HIGH SPEED DRIVING.     COULD YOU PLEASE INVESTIGATE THIS ISSUE AND HOPEFULLY AVOID SOMEONE HAVING THIS HAPPEN, CAUSING A PUNCTURED TIRE AND POTENTIAL SERIOUS ACCIDENT.    IF POSSIBLE COULD YOU LET ME KNOW IF THIS IS A WIDE SPREAD PROBLEM THAT VOLVO SHOULD BE MADE AWARE OF. THANK YOU!  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2011",
        "dateOfIncident": "05/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399312,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FAILURE JUST BEGAN AT AROUND 100K MILES, NO SPECIFIC EVENT. THE CAR LURCHES WHEN I AM PULLING INTO A PARKING SPACE AFTER I HAVE BROUGHT IT TO A COMPLETE STOP. CAR JERKS WHILE DOWN SHIFTING INTO RIGHT HAND TURNS. CAR JERKS AT INTERSECTIONS WHILE SLOWING DOWN AND/OR ACCELERATING. I AM AFRAID IT IS GOING TO JERK FORWARD AND HIT SOMETHING THAT I, AS A DRIVER, SHOULD NOT BE AT RISK OF HITTING. THIS JERKING BEGAN INTERMITTENTLY AND THE CAR WOULD RUN MORE SMOOTHLY ON THE STREETS AFTER A HIGHWAY TRIP OF SOME DISTANCE, BUT NOW IT HAPPENS ALMOST CONSTANTLY AND THE JERKING IS MORE SEVERE. TO CORRECT THE FAILURE, I SAW VOLVO AND ASKED THEM TO MAKE SURE THE SOFTWARE PKG WAS UP TO DATE - THEY ASSURED IT WAS. A YEAR LATER I RETURNED AS THE PROBLEM HAD WORSENED, VOLVO WANTED TO FLUSH MY TRANSMISSION - I DECLINED AND WENT TO A LOCAL TRANSMISSION SPECIALIST WHO IDENTIFIED THE PROBLEM AS A HYDRAULIC AND ELECTRICAL MALFUNCTION. I HAVE JUST AGREED TO HAVE THE PROBLEM FIXED, AND IF NECESSARY HAVE THE ENTIRE TRANSMISSION REBUILT.  *TR",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/13/2011",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395761,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO XC70.  THE CONTACT STATED THAT THE VEHICLE WOULD LOSE POWER WHEN ATTEMPTING TO ACCELERATE AND WOULD SHIFT WITH DIFFICULTY BETWEEN GEARS.  SHE NOTICED THAT THE RPM'S WOULD INCREASE AND THEN THE VEHICLE WOULD JERK VIOLENTLY.  THE DEALER ADVISED THE CONTACT TO HAVE THE TRANSMISSION REPLACED.  THE CONTACT DID NOT INFORM THE MANUFACTURER NOR WAS THE VEHICLE REPAIRED DUE TO COST.  THE CURRENT MILEAGES WERE 141,000 AND THE FAILURE MILEAGES WERE UNKNOWN.  THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2011",
        "dateOfIncident": "10/15/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394391,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70. THE CONTACT STATED THAT THE VEHICLE WOULD SHIFT HARD WITHOUT WARNING WHEN DRIVING APPROXIMATELY 22 MPH. THE VEHICLE CORRECTED ITSELF AND DROVE AS NORMAL BUT THE FAILURE CONTINUED TO RECUR SPORADICALLY AND WHEN BRAKING TO A COMPLETE STOP. THE FAILURE WAS ONGOING FOR FIVE MONTHS AND THE VEHICLE WAS TAKEN TO TWO DIFFERENT AUTHORIZED DEALERS WHERE SHE WAS ADVISED BY BOTH MECHANICS TO REPLACE THE TRANSMISSION. SHE STATED THAT BOTH MECHANICS PERFORMED A DIAGNOSTIC TEST BUT DID NOT GENERATE ANY CODES INDICATING THAT THE TRANSMISSION WAS FAULTY. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 115,000 AND THE CURRENT MILEAGE WAS 125,000.",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/02/2011",
        "dateOfIncident": "03/31/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394058,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE EXPERIENCE 2-3 UPSHIFT FLARE, SLIPPING OF TRANSMISSION, TACHOMETER NEEDLE JUMPING UP AND THE ENGINE RACING DURING A SHIFT.  *TR",
        "vin": "YV1SZ58D611"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/23/2011",
        "dateOfIncident": "01/06/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392669,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO XC70. THE CONTACT STATED THAT THE TRANSMISSION HAD AN INTERNAL HYDRAULIC FAILURE WHICH CAUSED THE TRANSMISSION TO SHIFT SLOWLY, DURING ACCELERATION IT WOULD ALSO JERK AND SLIP WHEN THE CONTACT WAS TRYING TO STOP THE VEHICLE. THE DEALER INFORMED THE CONTACT THAT THE TRANSMISSION COULD NOT BE REPAIRED AND NEEDED TO BE REPLACED. THE FAILURE MILEAGE WAS 105,000 AND THE CURRENT MILEAGE WAS 109,000.  UPDATED 06/06/11  *BF     UPDATED 1/17/2012  THE CONSUMER STATED THE CAR WONT ENGAGE IMMEDIATELY AFTER FULL STOP. *TR",
        "vin": "YV1SZ58D611"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/06/2011",
        "dateOfIncident": "07/20/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386587,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERIOR AUTOMATIC DAY/NIGHT REAR VIEW MIRROR IMAGE HAS BECOME DISTORTED/OBSCURED WITH A FLUID LEAKING INTERNAL TO THE MIRROR ITSELF THAT MAKES IT VERY DIFFICULT TO SEE ANY REFLECTED IMAGES DURING THE DAY AND USELESS AT NIGHT. IMAGES ON MIRROR ARE BOTH LIGHTER AND DARKER AT THE SAME TIME AND NOT CONSISTENT OVER THE MIRROR SURFACE CREATING A TUNNEL VISION PROSPECTIVE. MIRROR IS SURFACE IS NOT CRACKED, DAMAGED EXTERNALLY OR PREVISIOUS SUBJECT TO ABUSE.  DEFECT IN MIRRIOR OCCURRED WITHOUT WARNING, LEAKED A SMALL AMOUNT OF OILY FUILD INITIALLY AND HAS NOT CORRECTED ITSELF.  DEALER CANNOT REPLACE MIRRIOR. HOWEVER, DEALER CAN REPLACE MIRROR AND MIRRIOR HOUSING UNIT (FOR APPROX. $700, LESS LABOR) THAT CONTAINS CONTROLS FOR MIRROR AND REMOTE DOOR LOCKING SYSTEM. IF THE MIRROR HOUSING UNIT IS REPLACED IN ITS ENTIRETY, THEN A NEW A NEW COMPUTER SOFTWARE UPGRADE IS REQUIRED AS WELL AS THE REPROGRAMING OF ALL REMOTE DOOR LOCK KEY FOBS. ACCORDING TO A WEB SEARCH OF VOLVO FORUM WEBSITES, THIS APPEARS TO BE A COMMON PROBLEM NOT JUST COMMON TO MY PARTICULAR MODEL AND YEAR OF VOLVO.  *TR",
        "vin": "YV1SZ58DX11"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/01/2011",
        "dateOfIncident": "12/08/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386092,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70. THE CONTACT STATED THAT WHEN FIRST DEPRESSING THE ACCELERATOR OR RELEASING THE ACCELERATOR, THE TRANSMISSION WOULD SPORADICALLY HESITATE AND SURGE ABNORMALLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE CONTACT WAS ADVISED THAT THE TRANSMISSION WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 130,000 AND THE CURRENT MILEAGE WAS 140,000. UPDATED 03/24/11*LJ  THE TRANSMISSION FLUID, COILS AND ETM WERE ALL REPLACED TO TRY AND RESOLVE THE PROBLEM. UPDATED 09/16/11",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/24/2010",
        "dateOfIncident": "11/24/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367365,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO HAS FAULTY TRANSMISSION THAT CAUSES UNEXPECTED ACCELERATION FAILURES, ABRUPT ACCELERATIONS, AND JERKING. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/10/2010",
        "dateOfIncident": "11/10/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365274,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 100,100 MILES ON THE 2001 VOLVO XC, THE DEALER HAD REPLACED FRONT STRUT DUE TO WEAR. PICKED THE CAR UP AND DROVE THE CAR ~3 MILES HOME. LEFT FRONT COIL SPRING BROKE TURNING THE CAR AROUND IN THE DRIVEWAY THE NEXT MORNING. *TR",
        "vin": "YV1SZ58DX11"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350447,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD A TRANSMISSION SOFTWARE UPDATE THAT SOLVED A NEUTRAL SHIFT PROBLEM, WHERE THE TRANS WOULD LURCH INTO GEAR FROM A STOP.  NOW THE TRANSMISSION SLIPS AS I DRIVE, ESPECIALLY WHEN TURNING A CORNER.  IF I ACCELERATE NORMALLY, THE VEHICLE REVS THEN CLUNKS INTO GEAR.  THE DEALER ON THE TRANS SHOPS SAY THE TRANS NEEDS TO BE REPLACED.  NOW, I HAVE 183000 MILES ON THE CAR AND BOUGHT IT, HOPING IT WOULD BE A RELIABLE CAR...I WAS SO WRONG!    I PURCHASED THE CAR FOR $16,000 FIVE YEARS AGO WITH 64K ON IT.  I NOW HAVE ABOUT $12,000 IN REPAIRS INTO THIS CAR.  NEEDLESS TO SAY I AM NOWHERE NEAR HAPPY OR SATISFIED.  THIS IS, BY FAR THE WORST VEHICLE I'VE EVER OWNED.  IT IS LIKE A MONEY PIT.  I JUST WISH A COMPANY LIKE VOLVO, THAT ONCE HAD A GREAT REPUTATION, WOULD OWN UP TO THE JUNK THEY ARE PUTTING OUT AND MAKE SOME RECALLS.  AT THIS POINT, I WILL NEVER PURCHASE A VOLVO AGAIN AND AM SPREADING THE WORD.    COME ON VOLVO, JUST OWN UP TO THE PROBLEMS AND FIX THEM.  DO THE RIGHT THING AND YOU WILL BE NOTICED. DO NOTHING AND AGAIN, YOU WILL BE NOTICED BUT NOT FOR A GOOD THING. *TR",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2010",
        "dateOfIncident": "06/08/2010",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339267,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO XC70. WHILE ATTEMPTING TO REFUEL THE VEHICLE WITH GASOLINE, THE CONTACT STATED GASOLINE CONTINUED TO SPEW OUT FROM THE FILLER NOSE AND THE EMISSIONS WARNING LIGHT WAS ILLUMINATED. THE DEALER ADVISED THERE WAS A SPIDER WEB IN THE VENT WELL OF THE FUEL TANK AND TRIGGERING THE EMISSIONS WARNING LIGHT. THE DEALER MADE UNKNOWN REPAIRS TO THE VEHICLE. ON A LATER DATE, WHILE DRIVING AT UNKNOWN HIGHWAY SPEEDS, THERE WAS SMOKE COMING FROM THE HOOD AND THE VEHICLE BEGAN TO LOSE POWER. THE CONTACT MOVED THE VEHICLE FROM THE ROADWAY JUST AS THE VEHICLE ERUPTED IN FLAMES. THE FIRE DEPARTMENT WAS ABLE TO EXTINGUISH THE FIRE AND THE VEHICLE WAS TOWED TO A LOCAL GARAGE. THE CONTACT STATED THERE WAS A RECALL FOR HER YEAR, MAKE AND MODEL HOWEVER, THE RECALL DID NOT APPLY TO VEHICLES LOCATED WITHIN HER STATE (NHTSA CAMPAIGN ID NUMBER: 09V483000: FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP). THE CONTACT BELIEVED THE RECALL SHOULD APPLY FOR HER PARTICULAR STATE AS WELL. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGES WERE 79,000.",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "POWER TRAIN,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/08/2010",
        "dateOfIncident": "11/10/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298702,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL COMPUTER PROBLEMS THAT AROSE SUDDENLY.1)  TRANSMISSION LIGHTS FAIL TO LIGHT TO INDICATE PROPER GEAR AND CAR ENTERS LIMP HOME MODE (I.E., SLUGGISH ACCELERATION) WHEN STARTING CAR.   NO ACCIDENTS.  OCCURS WHEN STARTING COLD ENGINE AND GOES AWAY AFTER SEVERAL MINUTES OF WARMING THE ENGINE (INCONSISTENT TIMES).  DEALER HAS  INSTALLED A SOFTWARE UPGRADE, BUT IT HAS NOT CORRECTED THE PROBLEM.  THE PROBLEM BEGAN WITHOUT WARNING OR OTHER INCIDENT AND HAPPENS DURING WARM OR COLD WEATHER.    2) OTHER SAFETY ISSUES THAT AROSE AT THE SAME TIME INCLUDE REAR SEAT PASSENGERS BEING UNABLE TO OPEN REAR DOORS (STUCK IN CHILD LOCK OVERRIDE MODE) AND DRIVER OVERRIDE BUTTON IS NONFUNCTIONAL.  FAILURE HAS NOT BEEN CORRECTED (DEALER WANTS $900 TO FIX AND I RARELY HAVE REAR SEAT PASSENGERS). *TR",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2009",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291864,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO XC70 - TRANSMISSION FAILURE - WHEN STEPPING ON ACCELERATOR ENGINE WILL INCREASE RPM BUT NOT SPEED, THEN A SURGE/BUMP AS ENGINE SEEMS TO ENGAGE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2009",
        "dateOfIncident": "07/23/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278702,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE ON VOLVO MODEL YEAR 2001.  FAILURE NOT DUE TO ABNORMAL DRIVING CONDITIONS.  NORMAL DRIVING CONDITIONS, MOSTLY HIGHWAY TRANSMISSION FAILED AT 99,000 MILES.  THE VEHICLE WAS WELL MAINTAINED WITH ALL DEALER SUGGESTED MAINTENANCE COMPLETED.  TRANSMISSION FAILURE, ACCORDING TO TRANSMISSION EXPERTS DUE TO POORLY MANUFACTURED \"CHEAP\" COMPONENTS. *TR",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "02/18/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265253,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE FRONT COIL SPRING ON OUR 2001 VOLVO XC70 SNAPPED. THE CAR HAD BEEN SITTING IN OUR GARAGE FOR TWO WEEKS AND WHEN I BACKED IT OUT I HEARD THIS AWFUL NOISE FROM THE FRONT END. UPON EXAMINATION THE BROKEN SPRING WAS DISCOVERED. DROVE SLOWLY TO GARAGE WHERE BOTH SPRINGS AND SEATS WERE REPLACED DUE TO INDICATIONS OF CORROSION AND TO ENSURE SPRING RATES WOULD BE THE SAME. IF THIS HAD OCCURRED AT HIGHWAY SPEEDS THE CONSEQUENCES COULD HAVE BEEN SERIOUS AS THE SPRINGS ARE VERY CLOSE TO THE TIRES. THE CAR HAD 117,000 KM ON IT AT THE TIME,HAD ONLY BEEN DRIVEN ON PAVEMENT,ALL SERVICES DONE AND METICULOUSLY MAINTAINED. I DO NOT HAVE THE OLD PART AS VOLVO DIDN,T SEEM INTERESTED AND IT WAS ONLY WHILE BROWSING THAT I FOUND YOUR SITE WITH A SIMILAR COMPLAINT AND DECIDED TO AD MINE. HOPE THIS IS OF USE AND THANKS. *TR",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/22/2009",
        "dateOfIncident": "02/21/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259596,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER COIL SPRING BROKE. THE FRONT DRIVER SIDE COIL SPRING BROKE OFF MY 2001 VOLVO XC70. THE COIL SPRING JUST SPLIT AND YOU COULD HEAR A LOUD CLACKING NOISE. THE COIL SPRING COULD HAVE RUPTURED MY TIRE BUT THANKFULLY MY FAMILY AND I WERE OK. AFTER FURTHER RESEARCH, IT TURNS OUT THERE HAVE BEEN A LOT OF FORUMS THAT COMPLAIN ABOUT THE COIL SPRING SNAPPING ON THE DRIVER SIDE OF THE VOLVO XC SERIES. FORD ALREADY HAD CALLED A RECALL ON THEIR SPRINGS DUE TO CORROSION AND I'M WONDERING IF VOLVO RECEIVED THE SHIPMENT. IT IS VERY DANGEROUS SITUATION AND MY FAMILY COULD HAVE BEEN SERIOUSLY INJURED. I HAVE PHOTOS OF THE SNAPPED SPRING IF THEY COULD PROVIDE ANY ASSISTANCE. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/05/2008",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250817,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENGINE SURGES WITHOUT TOUCHING GAS PEDAL AND CAR ACCELERATES WITHOUT WARNING. ENGINE OFTEN STALLS WHEN TRYING TO ACCELERATE. ENGINE IDLE SPEED CHANGES CONSTANTLY.     DEALERSHIP UPDATED PROGRAM TWICE AND CLEANED THE THROTTLE TWICE AND CAR IS OK FOR ABOUT 3 DAYS AND THEN ALL THE SAME PROBLEMS RETURN.  DEALERSHIP WILL NOT REPLACE THROTTLE  UNDER THE WARRANTY OR EVEN IF I PAY FOR IT MYSELF.. *TR",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2008",
        "dateOfIncident": "03/15/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215499,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION ASSEMBLY AND FINAL DRIVE ASSEMBLY ON MY 2001 VOLVO XC70 DEGRADED PREMATURELY DUE TO A DEFECTIVE DESIGN AND NOW REQUIRED REPLACEMENT @ 70K MI.    $7,500 IS THE ESTIMATE TO MAKE THE CAR DRIVABLE.    VOLVO NA WILL ONLY OFFER A 10% DISCOUNT ON REPAIRS.  *TR",
        "vin": "YV1SZ58D211"
    },
    {
        "components": "POWER TRAIN,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/10/2008",
        "dateOfIncident": "01/07/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10214435,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD EXPERIENCED SOME INSTANCES OF A DELAY IN RESPONSE BY THE THROTTLE IN MY 2001 XC70 FOR SEVERAL MONTHS. MOST TIMES IT WAS FOLLOWING AN EXIT FROM A FREEWAY AND THE SUBSEQUENT ATTEMPTED ACCELERATION AFTER STOP WAS VERY HESITANT AND FELT AS IF THE CLUTCH WAS SLIPPING. I HAD AN ETM DIAGNOSTIC RUN IN MAY OF 2007 AT BARRIER MOTORS VOLVO IN BELLEVUE WA. AND THEY FOUND NOTHING WRONG BUT SAID THEY COULD NOT GET THE CAR TO REPEAT THE PROBLEM.  I HAD ALSO EXPERIENCED SOME INFREQUENT  INSTANCES OF EXTRA ACCELERATION WITH MINIMAL GAS PEDAL PRESSURE DURING THE SAME TIME.  ON JANUARY 7, 2008 I WAS IN LINE APPROACHING A ROUND-ABOUT AND AFTER THE SECOND SLOW MOVE FORWARD, I HAD NO MORE THAN TOUCHED THE GAS PEDAL THAN MY CAR SURGED FORWARD INTO THE REAR OF THE VAN IN FRONT OF ME. I WAS ONLY ABLE TO GET MY FOOT POISED OVER THE BREAK PEDAL BEFORE IMPACT. THE CAR DIED AND WHEN I TRIED TO RESTART IMMEDIATELY NOTHING WOULD WORK.  THE PEOPLE IN THE VAN HAD NECK INJURIES, MY SEATBELT DEPLOYED AND THE RETRACTION UNIT FAILED.    ONLY THE WEEK PRIOR TO THIS I HAD STARTED DOING AN ON-LINE SEARCH ABOUT MY TRANSMISSION AND FOUND MANY BLOG COMPLAINTS ABOUT SIMILAR PROBLEMS BUT HAD NOT BEEN TO NHTSA SITE YET.  NOW I SEE THERE APPEARS TO BE A CONCERTED EFFORT ON THE PART OF VOLVO NA TO PRACTICE THE SAME KIND OF OBFUSCATOR GAMES THAT FORD MC HAS PLAYED ALL ALONG.  IT REMINDS ME VERY MUCH OF THEIR SOP FOR DEALING WITH THE PINTO PROBLEM IN THE '70S.    IN LOOKING AT THE NHTSA INVESTIGATIONS AND COMPLAINTS I FIND, BY LOOKING IN ALL THE APPLICATIONS OF TOPIC AND SEVERAL OTHER BROAD CATEGORY SEARCHES THE OVERALL CONCLUSION I HAVE REACHED IS THAT VOLVO NA/FORD MC ARE NOT BEING HELD ACCOUNTABLE FOR ALL THE EXPENSES AND GRIEF THEY ARE CAUSING THE CONSUMERS.  A FULL CLASS ACTION INVESTIGATION IS PROBABLY WARRANTED AND PROBABLY AN INVOLVEMENT OF A CONGRESSIONAL OVERSIGHT BY THE U.S. DEPARTMENT OF TRANSPORTATION.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/11/2007",
        "dateOfIncident": "08/18/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206087,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70XC WITH VEHICLE SPEED CONTROL MALFUNCTION. CUSTOMER STATES THE VEHICLE LOST ALL POWER WHEN THEY HIT THE CRUISE CONTROL RESUME BUTTON. DEALER CLEANED THE ETM AND DEALER TOLD THE CONSUMER THE PROBLEM WAS INTERMITTENT.   *KB  *TR",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/21/2007",
        "dateOfIncident": "06/21/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193939,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE OTHER DAY, MY '01 VOLVO V70 CROSSCOUNTRY DEVELOPED A \"REDUCED PERFORMANCE\" WARNING ON THE DASH.  TWO MINUTES LATER WHILE SLOWLY APPROACHING A RR TRACK THE CAR LUNGED AND STOPPED, RIGHT ON THE TRACK.  FROM A DISTANCE I COULD HEAR A TRAIN'S WARNING BLAST.  MY NINE YEAR-OLD WAS ASLEEP IN THE BACK SEAT SO I ENDEAVORED TO RESTART THE CAR ASAP.  IT WOULDN'T.  THIS IS A PRETTY RURAL AREA AND I STILL COULDN'T SEE THE TRAIN BUT KNEW IT WAS APPROACHING.  IT TOOK LITERALLY 30 SECONDS TO GET THE CAR GOING.  EASILY THE LONGEST HALF MINUTE OF MY LIFE.    I HAVE SINCE REPLACED THE FUEL FILTER AND MASS AIRFLOW METER BUT THE CAR IS GETTING WORSE.  DIES.  MY APPT WITH VOLVO IS TOMORROW MORNING BUT SOME RESEARCH ON THE WEB HAS LED ME TO BELIEVE IT'S A FAULTY ELECTRONIC THROTTLE MODULE ETM.  APPARENTLY, THIS EXPENSIVE AND DANGEROUS ISSUE IS WELL-KNOWN TO VOLVO.  I BOUGHT THIS CAR FOR ITS SAFETY FEATURES; NOW I FEEL LIKE I'VE PUT MY FAMILY IN JEOPARDY.  PLEASE HELP WITH THIS VERY DANGEROUS AND FRANKLY DISHONEST SITUATION.",
        "vin": "YV1SZ58DX11"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/19/2006",
        "dateOfIncident": "11/01/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176566,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 VOLVO XC70.  THE TRANSMISSION HAS BEEN CLUNKING INTO AND OUT OF GEAR IN THE 20 - 40 MPH ZONE SINCE I HIT 95000 MILES.  I HAVE TAKEN IT TO THE DEALER WHO SIMPLY REPROGRAMMED THE CAR BUT THE ISSUE IS NOT RESOLVED.  THE CAR HESITATES WHEN I STEP ON THE GAS.  SOMETIMES IT GOES AND OTHER TIMES IT DOES NOT.  THIS MAKES THE CAR EXTREMELY DANGEROUS TO DRIVE.   *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/07/2006",
        "dateOfIncident": "09/18/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170193,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE DRIVEN VOLVOS SINCE 1983. WE NOW HAVE A 2001 XC WAGON. IT HAS BECOME THE MOST EXPENSIVE CAR WE HAVE EVER OWNED, AND A FEW YEARS OF EXPENSIVE REPAIRS CULMINATED IN A WHEEL HUB BREAKDOWN ON THE OHIO TRURNPIKE A FEW WEEKS AGO. AFTER PAYING ANOTHER THOUSAND BUCKS FOR THE TOW/REPAIR, THE NEXT WEEK WE HAD A MINOR EMERGENCY, GOT IN THE CAR, AND IT RAN LIKE AN OLD STEAM ENGINE. SEEMS THAT VOLVO HAD A NON-RECALL RECALL: A THROTTLE BELT SOFTWARE PROBLEM THAT THEY POSTED IN THE NEWSPAPER AND DID NOT ALERT OWNERS TO. THIS WEEK WE DUMP THE CAR. IT IS ONE THING TO HAVE REPAIR ISSUES. IT IS QUITE ANOTHER TO HAVE SAFETY ISSUES THAT THE COMPANY DUCKS.  NOW VOLVO DID SEND OUT A SHORT LETTER ABOUT THE PROBLEM, BUT IT WAS INCOMPREHENSIBLE. THE VOLVO DEALER TOLD ME THAT HE DID NOT EVEN UNDERSTAND THE LETTER THEY SENT OUT, AND THAT THEY HAVE HAD LOTS OF CUSTOMER COMPLAINTS ABOUT IT.  NOTE: WHILE OUR CAR WAS AT THE DEALER, THERE WERE APPARENTLY 2 OTHER NON-RECALL RECALL UPGRADES THAT WE HAD TO HAVE DONE THAT WE HAD MISSED OUT ON.  THIS COMPANY HAS SLIPPED MANY MANY NOTCHES.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2006",
        "dateOfIncident": "09/25/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169556,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR FAMILY OWNS A 2001 XC70 THAT WE BOUGHT SECOND HAND.  THANKFULLY, I PURCHASED AN EXTENDED WARRANTY.  WE DID RECEIVE THE DEC 2005 SOFTWARE UPGRADE WHICH APPEARED ODD, BUT WE COMPLIED.  SINCE THEN THE CAR ACTUALLY STARTED TO RUN MORE POORLY. WE BROUGHT THE CAR TO THE LOCAL DEALERSHIP IN ANN ARBOR SEVERAL TIMES.  AFTER I SPOKE TO THE SERVICE MANAGER AND SUGGESTED THAT I HAD READ ABOUT THE ETM FAILURE AND WAS CONCERNED, I WAS TOLD THAT THEY WOULD FIX IT UNDER WARRANTY.  DEALERSHIP WAS VERY COURTEOUS, BUT I SUSPECT THAT THEIR HANDS ARE TIED AS ONE OF THE SERVICE MANAGERS TOLD ME THAT VOLVO WARRANTY REQUIRED THEM TO DO THE SOFTWARE UPGRADE, THEN THE CLEANING AND THEN THEY COULD REPLACE THE ETM.      MY CONCERN IS THAT THE NEW ETM WILL FAIL AGAIN AND POSE A DANGER TO MY FAMILY.  MY WIFE USES THE VOLVO TO TRANSPORT OUR THREE CHILDREN IN.  I FIND IT OUTRAGEOUS THAT IF IT IS TRUE THAT VOLVO INTENTIONAL MISLEAD THE PUBLIC ABOUT THIS SAFETY DEFECT GIVEN THAT I DID NOT HAVE A PROBLEM PAYING PREMIUM DOLLAR FOR OUR FIRST VOLVO BECAUSE OF ITS REPUTATION AND ADVERTISING REGARDING ITS EXEMPLARY SAFETY RECORD.  I WOULD BE WILLING TO HELP YOUR AGENCY INVESTIGATE THIS PROBLEM IF YOU NEED ME.  *JB",
        "vin": "YV1SZ58D411"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/08/2006",
        "dateOfIncident": "06/08/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159359,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WARNING LIGHT ON THE MESSAGE BOARD OF MY 2001 VOLVO XC70 DISPLAYED \"PERFORMANCE REDUCED\"  AND \"ENGINE SERVICE SYSTEM URGENT\".  THE CAR LACKS APPROPRIATE ACCELERATION AND SHAKES AS IF IT WERE GOING TO STALL.  AFTER TAKING IT TO BE REPAIRED, I WAS INFORMED THAT THE ELECTRONIC THROTTLE ON MY CAR WAS FAULTY.  *NM",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/31/2006",
        "dateOfIncident": "05/29/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158691,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE FRONT COIL SPRING ON OUR 2001 VOLVO XC70 SNAPPED EITHER WHILE THE CAR WAS DRIVEN INTO THE DRIVEWAY OR WHILE SITTING OVERNIGHT. BACKING THE CAR OUT OF THE DRIVEWAY INTO A DIP PRODUCED A NOISE THAT INDICATED A SERIOUS PROBLEM WITH THE FRONT SUSPENSION. UPON EXAMINING THE FRONT SUSPENSION I DISCOVERED THE BROKEN COIL SPRING. THE LOWER PORTION OF THE SPRINGS POWDER COAT HAD PEELED AND THE SPRING HAD A COATING OF RUST ON THE LOWER COIL. THE BROKEN EDGES OF THE SPRING SHOWED SIGNS OF RUST PENETRATING INTO THE INTERIOR METAL OF THE SPRING, SUGGESTING THAT THE SPRING MAY HAVE BEEN CRACKED FOR SOME TIME BEFORE FAILING. SINCE THE SPRING IS VERY CLOSE TO THE TIRE THERE COULD HAVE BEEN A SERIOUS SITUATION IF THE BROKEN EDGE OF THE SPRING HAD CONTACTED THE TIRE AT HIGH SPEED. WHEN I EXAMINED THE UNBROKEN PASSENGER SIDE SPRING I FELT ROUGHNESS UNDER THE POWDER COATING ALONG THE LOWER PART OF THE SPRING, SUGGESTING THAT CORROSION IS ALSO TAKING PLACE IN THE SAME AREA ON THAT SPRING.  BOTH FRONT COIL SPRINGS ARE GOING TO BE REPLACED. I HAVE THE BROKEN SPRING AS WELL AS PHOTOS IF THEY CAN BE OF ANY ASSISTANCE.  *JB",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/11/2006",
        "dateOfIncident": "05/09/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157379,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO XC70 TRANSMISSION FAIL AT 97K MILES.  TRANSMISSION HAS NEVER BEHAVED APPROPRIATELY, UP/DOWN SHIFT ERRATIC, ETC.  VEHICLE HAS BEEN THE RECIPIENT OF NUMEROUS SOFTWARE UPGRADES, TRANSMISSION FLUSH/FILTER, AND A NEW VALVE BODY.  TRANSMISSION STILL FAILED AND VOLVO SAYS I'M OUT OF LUCK.  BOUGHT NEW IN 2001 FOR $42,000.  VEHICLE ALSO FAILED TO OPERATE MARCH OF 2006 WHERE A \"PERFORMANCE REDUCED\" MESSAGE WAS EXHIBITED.  AFTER TURNING CAR OFF FOR SEVERAL MOMENTS, THE CAR RAN FINE.  I SUSPECTED A POSSIBLE ISSUE WITH THE ETM.  PORTLAND VOLVO INSTALLED AN ETM SOFTWARE UPGRADE ON APRIL 6, 2006.  CAR HAS NOT HAD A REPEAT OCCURRENCE OF THIS NATURE BUT WAS SHIFTING ODDLY AS PREVIOUSLY DESCRIBED.  *JB",
        "vin": "YV1SZ58D411"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/08/2006",
        "dateOfIncident": "04/22/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156972,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO XC 93K MILES [XXX] ETM ISSUES. VEHICLE HAS PROBLEMS WITH THE ELECTRONIC THROTTLE MODULE. AFTER ABOUT 5 MILES DRIVING THE VEHICLE DOES NOT IDLE AND STALLS AT INTERSECTIONS OR ON HIGHWAY WHEN FOOT IS TAKEN OFF THE THROTTLE. ALSO GOES INTO LIMP MODE SOMETIMES WITH REDUCED PERFORMANCE. ONLY SETS TEMPORARY CODE NOT PERMANENT. SAFETY HAZARD. *JB   UPDATED 07/16/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "YV1SZ58D411"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2006",
        "dateOfIncident": "11/16/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151744,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING UP AND STOPPING, I HEARD A \"THUNK\" FROM UNDER THE CAR. PROCEEDING, THERE WAS A NEW NOISE, WHICH I CHECKED OUT. THE RIGHT ANGLE DRIVE NO LONGER POWERED THE REAR WHEELS, AND I WAS ADVISED TO REPLACE IT, AT A COST OF ABOUT $1,300. WHEN THE GARAGE TOOK THE OLD DRIVE OFF, THEY FOUND THAT THE SPLINED SHAFT BETWEEN THE RIGHT ANGLE DRIVE AND THE TRANSMISSION WAS STRIPPED OF ITS SPLINES, AND THE MATING PART ON THE TRANSMISSION WAS LIKEWISE STRIPPED. VERDICT: NEEDS NEW TRANSMISSION, TOO. I GOT A VOLVO REBUILT TRANSMISSION AND RIGHT ANGLE DRIVE, TOTAL COST $6,100. THE VOLVO DEALER INDICATED THAT THIS PROBLEM WAS NOT AN ISOLATED PROBLEM. BECAUSE THE CAR HAD 90,000 MILES, IT WAS OUT OF WARRANTY. VOLVO AND THE DEALER REFUSED TO HELP AT ALL-TOUGH LUCK! IT IS DEFINITELY A DESIGN AND MANUFACTURING PROBLEM. VOLVO ACTED AS IF ANY PROBLEM OUT OF WARRANTY WAS MINE. I FEEL THAT A RECURRING PROBLEM LIKE THIS, WITH SUCH A HUGE COST, SHOULD BE COVERED, OUT OF CONCERN FOR VOLVO'S AND FORD'S REPUTATION, AND THE RESALE MARKET FOR PEOPLE CONSIDERING BUYING NEW VOLVOS. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/18/2006",
        "dateOfIncident": "01/08/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148035,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD PROBLEMS WITH THIS CAR STALLING FOR OVER TWO YEARS.  I HAVE HAD THE THROTTLE BODY REPLACED TWICE.  IN THE MONTH THE CAR HAS BEEN STALLING AT ALL SPEEDS AND SURGING WHEN BRAKING.  THIS LAST STALLING EPISODE OCCURRED WHILE PULLING OUT INTO A THOROUGHFARE WHILE I WAS ACCELERATING TO GO SLIGHTLY UPHILL.  SINCE I HAD NO POWER, I COULD NOT EVEN STEER THE CAR OFF TO THE SIDE OF THE ROAD QUICKLY.  IT WAS AT NIGHT, THEREFORE AN EXTREMELY DANGEROUS SITUATION.  THESE PROBLEMS HAVE BEEN OCCURRING OVER AND OVER AGAIN, DESPITE ALL OF THE SERVICE THAT I HAVE HAD DONE ON THIS CAR.  *NM",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/27/2005",
        "dateOfIncident": "08/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143732,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 01 VOLVO V-70 XC HAD BEEN ACTING A LITTLE OFF, KIND OF SURGING A LITTLE WHILE AT HIGHWAY SPEEDS, DEALER COULDN'T FIND A PROBLEM.. SO WE TRIED TO IGNORE IT.  ONE DAY A FEW MONTHS AGO MY WIFE (8 MO. PREGNANT) TOOK THE CAR TO THE CITY.  ALONG THE WAY, SHE WAS GOING UP A HILL ON A TWO-LANE HIGHWAY, WHEN THE CAR STARTED LOOSING POWER AND FINALLY JUST QUITTING RIGHT THERE ON THE ROAD....NO SHOULDER...CARS WHIZZING BY.  BY THE TIME I GOT THERE, THE CAR STARTED FINE, SO I SWITCHED HER VEHICLE AND SHE CONTINUED ON.  UPON CALLING THE DEALER, I WAS INFORMED THAT I'D PROBABLY NEED TO HAVE THE \"ETM THROTTLE\" REPLACED.  CAR STALLED OUT TWO MORE TIMES BEFORE WE WERE ABLE TO GET IT TO DEALER.  $900 LATER, THE CAR WORKS FINE NOW.  UPON LOOKING INTO THIS PROBLEM,  IT SOUNDS LIKE IT'S HAPPENING TO ALL THE VOLVOS LIKE OURS!  THIS CAN BE A VERY DANGEROUS PROBLEM! WHAT CAN NHTSA DO ABOUT MAKING VOLVO REPLACE THESE FAULTY THROTTLES WITH BETTER ONES? *JB",
        "vin": "YV1SZ58D211"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/16/2005",
        "dateOfIncident": "12/04/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143213,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 10, 2004 VOLVO XC-70 (2001) STALLED WITHOUT WARNING WHILE DRIVING 55 MPH ON 695 WEST IN BALTIMORE JUST BEFORE THE EXIT FOR I-83.  THE CAR WAS ALMOST HIT BY A SEMI TRAILER,  AND SEVERAL OTHER CARS.   THE CONTACT'S CAR HAD TO BE TOWED, AND THE ELECTRONIC THROTTLE BODY WAS REPLACED.  HOWEVER, ON DECEMBER 1, 2004, THE SAME PROBLEM OCCURRED WHEN  CAR STALLED AT AN INTERSECTION BUT WAS ABLE TO RESTART IT.  THE ELECTRONIC THROTTLE WAS REPAIRED AGAIN.    *NM  X-REF 10130923 2 REPLACEMENTS, SMCH.  *AK",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/08/2005",
        "dateOfIncident": "10/26/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142075,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF REAR SUSPENSION SYSTEM DUE TO UNKNOWN CAUSE. THIS RESULTED IN THE REPAIR OF THE AUTO TO THE REAR SUSPENSION SYSTEM. THE CAUSE OF THIS IS UNKNOWN WITH NO KNOWN IMPACT TO THE AUTO (2001 VOLVO XC 70).  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/03/2005",
        "dateOfIncident": "10/13/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141663,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY WHILE DRIVING MY ELDERLY MOTHER IN MY 2001 VOLVO XC 70 FROM OREGON TO CALIFORNIA WE HAD A VERY UNPLEASANT EXPERIENCE THAT COULD HAVE COST US OUR LIVES. ALL OF A SUDDEN WE LOST TOTAL POWER IN 70+ MPH TRAFFIC, HAD TO SIT ON A VERY BUSY FREEWAY FOR 2 HOURS IN 100 DEGREE HEAT (UNABLE TO RUN THE AIR CONDITIONER) UNABLE TO GET OUT OF THE VEHICLE DUE TO HEAVY TRUCK TRAFFIC FLYING PAST US. MY DEAR MOTHER AND I WERE FINALLY RESCUED AND TOWED TO SAFETY SOME 70 MILES TO THE NEAREST VOLVO DEALER. THERE WE WERE TOLD THAT OUR ETM HAD FAILED. I AM CONCERNED ABOUT THIS VERY DANGEROUS PROBLEM AS I HAVE NOW BEEN TOLD THAT THE PART THAT THEY REPLACED (A $1200.00 REPAIR) IS SIMPLY ANOTHER OF THE SAME KNOWN FAULTY PART. MY ETM FAILD AT ONLY 50,000 MILES AND COULD HAVE CAUSED A MAJOR FATALITY. WE WERE REALLY LUCKY BUT WHAT HAPPENS NEXT TIME? FROM NHTSA WEB SITE.",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/01/2005",
        "dateOfIncident": "10/31/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141460,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR 2001 VOLVO XC70 FROM A REPUTABLE DEALER IN IOWA CITY, IA WITH 72,000 MILES IN FEBRUARY OF 2005. THE DEALER REPORTED IT HAD BEEN WELL MAINTAINED PRIOR TO PURCHASE AND WE HAVE HAD IT CAREFULLY MAINTAINED, SINCE.    ON OCTOBER 31ST OF 2005, ON MY WAY TO AN IMPORTANT INTERVIEW THE VOLVO BEGAN STUTTERING AND RUNNING ROUGHLY.  THE VEHICLE REPORTED \"REDUCED PERFORMANCE\" ON THE DIAGNOSTIC DISPLAY AND THE \"SERVICE ENGINE\" LIGHT TURNED ON.  I COULDN'T MAINTAIN A REASONABLE SPEED SO I PULLED OVER AND TURNED OFF THE CAR.  THE CAR HAD DIFFICULTY STARTING BUT I WAS ABLE TO EVENTUALLY START IT AND DRIVE TO A NEARBY REPAIR SHOP.  I WAS REFERRED TO A VOLVO SPECIALIST AND THEY REPORTED IT WAS A PROBLEM WITH THE ELECTRONIC THROTTLE MODULE AND I WOULD HAVE TO TAKE IT TO A DEALER AT A COST OF ABOUT  $1200.    I DON'T FEEL THAT AN ESSENTIAL PIECE OF EQUIPMENT LIKE THIS SHOULD FAIL SO EARLY ON A WELL MAINTAINED VEHICLE.  THIS FAILURE STRIKES ME AS A POOR DESIGN - SIMILAR TO THE PROBLEMS WITH THE ELECTRIC FAN ON THIS VEHICLE THAT WAS FACTORY RECALLED.  I UNDERSTAND THAT MANY OTHER PEOPLE HAVE BEEN EXPERIENCING THIS PROBLEM AND THERE IS A CLASS ACTION SUIT BEING TRIED IN CALIFORNIA.  I UNDERSTAND THAT LATER MODEL CARS HAVE A DIFFERENT ETM AND HAVE FEWER PROBLEMS WHICH LEADS ME TO BELIEVE VOLVO IS AWARE OF THE ISSUE AND HAS TAKEN STEPS TO RECTIFY IT, BUT ONLY FOR LATER MODEL CARS.    I BELIEVE VOLVO SHOULD ALSO BE ACCOUNTABLE FOR CARS OF THE  2001 VINTAGE AND ISSUE A FACTORY RECALL.    THE COSTS TO BE FOR THIS PROBLEM HAVE BEEN:  BEING LATE TO MY SECURITY INTERVIEW FOR MY NEW JOB.  4 HOURS OF VACATION TIME FROM WORK  6+ HOURS OF PERSONAL TIME  $1200 IN REPAIR COSTS  3+ HOURS DRIVING WIFE TO WORK BECAUSE RELIANCE ON 1 CAR  ADDITIONAL FUEL COSTS BECAUSE OF BACK AND FORTH FERRYING WIFE TO WORK    PLEASE PRESSURE VOLVO TO ACCEPTING RESPONSIBILITY FOR THIS PROBLEM AND HAVE THEM ISSUE A RECALL FOR THIS DEFECT.  THANKS.  *NM",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/25/2005",
        "dateOfIncident": "10/21/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140720,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO STALLED WITHOUT WARNING LEAVING MY WIFE AND 3 CHILDREN STRANDED ON THE SIDE OF A VERY BUSY HIGHWAY. WHEN VEHICLE STALLED A \"REDUCED POWER\" MESSAGE WAS RECEIVED ON VEHICLE DISPLAY. AFTER LETTING VEHICLE SIT FOR 10 MINUTES, VEHICLE RESTARTED WITHOUT ERROR MESSAGE. DROVE FOR APPROX 15 MINUTES AND VEHICLE STALLED/CUT-OUT AGAIN; AGAIN STRANDING MY FAMILY ON THE SIDE OF THE ROAD. HAD TOWED TO DEALERSHIP; VOLVO DIAGNOSED A FAILED \"ELECTRONIC THROTTLE MODULE\". THE ETM WAS REPLACED AT A COST OF $1016 TO ME. THIS INCIDENT OCCURRED AT APPROX 58,000 MILES. THANK GOD NOTHING HAPPENED TO MY FAMILY AS A RESULT OF THIS SERIOUS SAFETY HAZARD.  *NM",
        "vin": "YV1SZ58D611"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/18/2005",
        "dateOfIncident": "10/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140162,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE JUST BOUGHT A USED 2001 VOLVO V70XC WITH 70,000 MILES AND A 90 DAY WARRANTY. THE DAY I REMOVED THE 30 DAY TEMP TAG THE TROUBLE. ON THE INTERSTATE GOING 70 MPH AT 1:00AM ABOUT 6 HOURS FROM HOME THE CAR LOST POWER AND DIED. IT RESTARTED AFTER A FEW MINUTES. WE THOUGHT IT WAS BAD FUEL. LATER THAT WEEKEND, OCT 15, 2005, WE LOST POWER GOING THROUGH A TUNNEL. I THOUGHT WE WERE GOING TO DIE. LUCKILY WE MADE IT OUT. FOUND OUT IT WAS THE ETM. NOT COVERED BY WARRANTY AND NOT REPAIRABLE BY ANYONE BUT VOLVO WHO ACCORDING TO THEM-NEVER HAVE PROBLEMS WITH THIS PART. PLEASE ADVISE. I AM SCARED TO DEATH AND I DO NOT HAVE $1200.00 TO FIX THIS PROBLEM.  *NM",
        "vin": "YV0SZ58DX11"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/19/2005",
        "dateOfIncident": "09/19/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136898,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE ON OUR 2001 VOLVO XC PERIODICALLY BEGINS TO BUCK AND THEN GOES INTO LIMP HOME MODE WITH THE \"REDUCED ENGINE PERFORMANCE\" ERROR MESSAGE DISPLAYED.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/13/2005",
        "dateOfIncident": "09/11/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136373,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPECT FAILURE OF ELECTRONIC THROTTLE CONTROL MODULE.  VEHICLE STALLS WITHOUT WARNING AND DOES NOT ALWAYS RESTART UNTIL VEHICLE COOLS.  A FOREIGN CAR SERVICE TECHNICIAN LOOKED AT THE PROBLEM AND INFORMED ME THAT THE CURRENT ELECTRONIC THROTTLE CONTROL WAS NOT FUNCTIONING IN HIS OPINION.  ON 9/13/05 I CALLED VOLVO SERVICE REPRESENTATIVE B.J. ALGER AT DON BEYER VOLVO, DULLES, VIRGINIA WHO ADVISED ME TO BRING IT N FOR REPAIR IMMEDIATELY.  ALGER SAID THE PROBLEM IS UNDER INVESTIGATION BY NHTSA AND THAT VOLVO NORTH AMERICA WOULD REIMBURSE MY PAYMENT FOR THE REPAIR IF THE INVESTIGATION RESULTED IN A RECALL.  ALGER ESTIMATED THE REPAIR AT $1,200.00. *JB",
        "vin": "YV1SZ58D611"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2005",
        "dateOfIncident": "09/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136074,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,  THE ETM (ELECTRONIC THROTTLE MODULE) IN OUR 2001 VOLVO XC70 FAILED ON MY WIFE IN THE MIDDLE OF HEAVY TRAFFIC ON COLORADO HIGHWAY 83.  SHE WAS IN THE MIDDLE LANE OF THREE AND WAS TRAVELING ABOUT 50 MPH.  THE ENGINE DIED COMPLETELY AND SHE HAD A HARD TIME MAKING IT THROUGH TRAFFIC TO THE SIDE OF THE ROAD.  SHE HAD TO LET TRAFFIC PASS BEFORE DOING SO.  SHE HAD TO SIT ON THE SHOULDER FOR ABOUT 15 MINUTES BEFORE THE CAR WOULD START AGAIN.    I DISCUSSED THE HEAVY FAILURE RATE OF VOLVO ETMS WITH MCDONALD VOLVO OF DENVER, CO AND TOLD THEM VOLVO WAS RECALLING THIS PART IN SWEDEN AND THAT AT LEAST ONE CLASS ACTION SUIT WAS FILED.  THEY SAID THAT THERE WAS NO RECALL NOR WOULD THEY PERFORM A GOODWILL REPLACEMENT.  WE HAD TO REPLACE IT AT A COST OF $1,090.45.  THE MILEAGE ON OUR VOLVO WAS 67,487.    DO YOU HAVE ANY MORE INFORMATION REGARDING THE SAFETY ISSUES AND THE UNUSUALLY HIGH FAILURE RATE OF VOLVO ETMS?  MY WIFE AND I ARE CONCERNED ABOUT OUR SAFETY IN OUR VOLVO.    RURIK LUBINSKI. *JB",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2005",
        "dateOfIncident": "03/10/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136075,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED (POWER LOST) SEVERAL TIMES EVEN AFTER DRIVING FOR AWHILE.   STALLED OUT AT STOP SIGN, RED LIGHT, AND WHILE DRIVING AT LOW RATE OF SPEED.  TOOK TO MARTENS VOLVO DEALER.  THEY CHARGED US $400+ TO CLEAN THE THROTTLE AND SOME PART NEAR THE THROTTLE.  *JB",
        "vin": "YV1SZ58D011"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "08/19/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132826,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  VEHICLE STALLED/DIED, AND LOST POWER DUE TO THROTTLE BODY FAILURE.  *AK  WHILE DRIVING THE CONSUMER NOTICED THAT THE VEHICLE WAS NOT HOLDING AT A CONSTANT SPEED.  THIS OCCURRED WHETHER THE CONSUMER USED THE CRUISE CONTROL OR MANUALLY OPERATED THE ACCELERATOR PEDAL.  THE CONSUMER CONTACTED THE DEALER WHO DETERMINED THAT EH PROBLEM WAS THE THROTTLE BODY.  *NM",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/07/2005",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135573,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1) IN THE 6 WEEKS PRIOR TO THE FAILURE WE HAD NOTICED WORSENING SYMPTOMS OF WHAT WE NOW KNOW IS THE FAILURE OF THE ELECTRONIC THROTTLE MODULE (ETM) IN OUR 2001 VOLVO XC70.   AT HIGHWAY SPEEDS THERE WOULD BE INTERMITTENT SURGING THAT WAS NOT CAUSED BY THE DRIVER  2) ON SEPT. 1, 2005, THERE WERE TWO SEPARATE INSTANCES WHERE THE VEHICLE SUDDENLY LOST SPEED AND THE MOTOR BEGAN TO VIOLENTLY SHAKE AS IF ABOUT TO STALL; THE DASHBOARD INDICATOR SAID \"PERFORMANCE REDUCED.\"  BOTH TIMES THE MOTOR WAS SHUT OFF BRIEFLY, THEN RESTARTED AND THE CAR WAS DRIVABLE AGAIN.  3) THE CAR WAS TAKEN TO A VOLVO-CERTIFIED SERVICE FACILITY WHERE THE ON-BOARD COMPUTER CODE WAS USED TO DIAGNOSE THROTTLE FAILURE.   THIS OCCURRED WHILE ON TRAVEL OUT OF TOWN AND WE HAD NO CHOICE BUT TO AUTHORIZE THE REPLACEMENT OF THE ETM.   THE ENTIRE REPAIR JOB WAS DONE AT A COST TO ME OF $1110.  *NM",
        "vin": "YV1SZ58D011"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "08/17/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135425,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR  IS A VOLVO 2001 AWD XCV70 AND IT WAS STALLING AND LOOSING RPM WHILE TRAVELING AT HIGHWAY SPEEDS, RUNNING VERY ROUGH AND ACCELERATING  WITHOUT PRESSING ON THE ACCELERATOR, FOR EXAMPLE WHEN AT A STAND STILL IN TRAFFIC. THE DEALER SAID THAT THE ELECTRONIC THROTTLE MODULE (ETM)   NEEDED TO BE REPLACED AND THAT THE PART WAS $1,000 PLUS.  THEY SAID THAT THE CAUSE WAS MY FAILURE TO USE PREMIUM GAS.  IT WAS NOT UNTIL AFTER I GAVE THEM THE GO AHEAD TO FIX IT THAT I DISCOVERED ALL THE OTHER COMPLAINTS.  THIS MORNING I FOUND OUT THAT THEY HAVE ALREADY INSTALLED THE NEW PART AND ARE  ROAD TESTING IT TO SEE IF ANY OF THE OTHER DIAGNOSTIC FAILURES HAVE CLEARED UP.    THE OTHER KICKER IS THAT I HAD ALREADY TAKEN THE CAR TO A NON-VOLVO MECHANIC THAT DIAGNOSED THE PROBLEM AS A MASS AIR SENSOR, OXYGEN SENSOR AND HEAT CONTROL SENSOR.  THOSE REPAIRS,  TOTALING 650,  DID NOT CORRECT THE PROBLEM.  I CAN NOT FIND TOO MUCH FAULT WITH THIS MECHANIC SINCE HE WAS REPLACING PARTS THAT THE DIAGNOSTIC INDICATED WERE BAD.  NOW I FIND OUT THAT THE DIAGNOSTICS ARE ALL CONTROLLED BY THE FAILURE CODE FOR THE ETM AND THAT THOSE REPAIRS WERE PROBABLY NOT NECESSARY.  MORE THAN A LITTLE FRUSTRATED.   THE CAR WAS UNSAFE TO DRIVE AND NOW I AM CONCERNED ABOUT THE FAILURE OF THE REPLACEMENT PART.  *JB",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/29/2005",
        "dateOfIncident": "08/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134628,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2001 VOLVO XC70 CROSS COUNTRY STATION WAGON.   THE VEHICLE STALLED/DIED AND LOST POWER. THIS OCCURRED ON AUGUST 27, 2005.   THE  ELECTRONIC THROTTLE  MODULE (ETM) NEEDED TO BE  REPLACED.  *AK",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "08/17/2005",
        "dateOfIncident": "02/10/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133151,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILED ON 2001 VOLVO V70 XC ON TRIP TO NORTH CAROLINA.  SUBSEQUENTLY, IT RESTARTED, OPERATING UNDER \"REDUCED POWER\".  I BROUGHT THE CAR TO A VOLVO DEALER IN MYRTLE BEACH WHO DIAGNOSED THE PROBLEM AS A THROTTLE MODULE FAILURE AND REPAIRED IT AT A COST OF $656.00.  THE CAR HAD 61,685 MILES (BEYOND THE 50,000 MILE WARRANTY) AND WAS PURCHASED ON 9/9/2000.  IT IS MY UNDERSTANDING THAT THERE HAVE BEEN WIDESPREAD FAILURES OF THIS COMPONENT AND THAT THERE ARE VARIOUS ACTIONS IN PROCESS THAT MIGHT RESULT IN RECALL.  I WOULD LIKE TO ADD MY PROBLEM TO THE LIST. *JB",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2005",
        "dateOfIncident": "08/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132763,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF  KENT RASMUSSEN  ELECTRONIC THROTTLE MODULE ON 2001 VOLVO XC70.  *NM",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "07/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132178,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR ABOUT A WEEK THE CAR WAS RUNNING ROUGH WITH HESITATION AND A JERKING FEELING OF LOSS OF POWER.  THEN AS MY WIFE WAS DRIVING HOME WITH OUR CHILDREN THE NIGHT OF THE 27TH OF JULY THE CAR STARTED TO LOSE POWER COMPLETELY TO THE POINT WHERE SHE WAS FORCED TO PULL THE CAR OFF THE ROAD.  THE INFORMATION CENTER ON THE CAR INDICATED \"PERFORMANCE REDUCED\" BUT OFFERED NO OTHER INFORMATION AND THE MANUAL OFFERED NO OTHER NARRATIVE.  THE CAR WAS TAKEN TO TOM WOOD VOLVO IN INDIANAPOLIS WHERE THE TECHNICIAN HAD A HUNCH RIGHT AWAY THAT IT WAS A FAULTY ETM.  ITEM WAS REPLACED WITH NEW WHICH RESULTED IN A BILL OF $1100.  SINCE THE PROBLEM I HAVE BEEN MADE AWARE THAT THIS IS A COMMON PROBLEM WITH THIS VEHICLE.   *NM",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "08/07/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132239,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING SOUTH ON I95 NEAR CLINTON,CONNECTICUT WITH TWO OTHER SUV'S FOR ABOUT TWO HOURS - MEDIUM TO HEAVY FLOW TRAFFIC CONDITIONS.  DRIVING NORMAL SPEEDS IN THE LEFT LANE WHEN THE CAR FELT LIKE IT WAS STARVED FOR FUEL AND WOULDN'T REACT TO THE THROTTLE CONTROL.  TOP SPEED WAS ONLY ABOUT 35-40 MPH AND AN INDICATOR LIGHT FLASHED \"PERFORMANCE DEGRAGATION\" OR SOMETHING LIKE THAT.  THE CAR WAS ABLE TO GET INTO THE RIGHT LANE, BUT THEN DIED AND WOULD NOT START FOR A PERIOD OF TIME.  A STATE TROOPER DID PULL UP BEHIND ALL THREE CARS AND LENDED SOME TRAFFIC ASSISTANCE.  AFTER A WHILE THE CAR DID START AGAIN AND WE WERE ABLE TO GET TO THE NEAREST EXIT.  SINCE WE WERE STILL 2 HOURS FROM HOME AND AAA COULDN'T GET US PHYSICALLY HOME, WE WAITED 1 HOUR AND TRIED OUR LUCK.  THE CAR DID GET US HOME, BUT THERE WAS A VERY SLIGHT MISFIRE PRESENT MOST OF THE WAY HOME THAT MIGHT HAVE GONE UNNOTICED IN DIFFERENT CIRCUMSTANCES.    THE NEXT DAY VOLVO OF WESTPORT FIXED THE CAR AND SAID IT WAS THE ELECTRONIC THROTTLE SYSTEM - THEY REPLACED IT, BUT SAID THEY COULDN'T GUARANTEE THAT IT WOULDN'T HAPPEN AGAIN IN THE NEAR FUTURE.    WE LOVE OUR VOLVO XC90 AND PURCHASED IT FOR SAFETY ONLY, BUT THIS PROBLEM IS A SERIOUS CONCERN FOR US, ESPECIALLY SINCE WE HAD 7 ADULTS AND THREE KIDS RANGING FROM 16 MONTHS TO 6 YEARS OF AGE STRANDED ON I95 DURING HEAVY TRAFFIC!!!!!    THE CAR IS A VOLVO XC90 2001 - I WAS ASSURED BY THE WESTPORT DEALER THAT THE PROBLEM WAS FIXED IN THE 2003+ MODELS AND WE ARE CONSIDERING AN UPGRADE - IF WE CAN TRUST VOLVO AGAIN.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "11/15/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131628,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO XC70:  ENGINE STOPPED RUNNING DURING NORMAL OPERATIONS DRIVING DOWN A DIVIDED HIGHWAY.  THERE WERE 4 SEPARATE INCIDENTS OVER ABOUT A AN 18 MONTH TIME PERIOD TIME FROM APPROXIMATELY NOV 2002 TO MAY 2004.  THE CAR'S ENGINE NEEDED TO BE TURNED OFF AND THE CAR PLACED IN NEUTRAL, AND THEN RESTARTED.  IT WOULD OFTEN TAKE 2 - 3 ATTEMPTS TO GET THE CAR STARTED.  NO ACCIDENTS OCCURRED, AND IT ENDED UP JUST BEING AN INCONVENIENCE, BUT ONLY BECAUSE THERE WAS NEVER ANY TRAFFIC ON THE ROAD.  IT WAS TAKEN TO THE VOLVO DEALERSHIP TWICE.  INSPECTED BY THE MECHANICS, BUT I WAS TOLD THAT SINCE THE CAR WAS RESTARTED THAT THE CODES HAD CLEARED SO THERE WAS NOTHING THAT COULD BE DONE.  I WOULD NEED TO BRING THE CAR IN WHILE THE PROBLEM OCCURRED--AN OBVIOUS PROBLEM SINCE THE CAR WOULD NOT RUN, SO I COULD NOT BRING IT IN. *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/16/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131110,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE INTERSTATE AT ROUGHLY 70 MPH IN MODERATE TRAFFIC WITH MY WIFE AND 2 YOUNG BOYS WHEN THE ACCELERATOR NO LONGER RESPONDED.  THE VEHICLE WOULD SURGE WHEN I STEPPED ON THE GAS THEN \"STALL\".  THE CHECK ENGINE LIGHT APPEARED WITH A MESSAGE \"PERFORMANCE REDUCED\".   FORTUNATELY WE ROLLED OFF THE HIGHWAY OVER THE MEDIAN AND ONTO THE FRONTAGE ROAD AND INTO A PARKING LOT WHERE WE STOPPED THE CAR AND RESTARTED IT.  WE CALLED THE DEALER WHO INSTRUCTED US TO BRING IT IN RIGHT AWAY TO HAVE IT DIAGNOSED.  THIS WAS ACTUALLY THE SECOND OCCURRENCE OF THIS FAILURE THE FIRST BEING A WEEK EARLY ON JULY 9TH WITH SIMILAR CIRCUMSTANCES.  IN THE FIRST ONE OUR STEERING WHEEL LOCKED UP AS WE ENTERED A GAS STATION.  WE WERE TOLD WE NEEDED A NEW THROTTLE BODY APPROXIMATELY $900 TO REPLACE.  WE  ONLY HAD THE VEHICLE FOR 6 WEEKS SO WERE OBVIOUSLY UNHAPPY.  ALTHOUGH NO ONE WAS HARMED IN THE CASE OF OUR FAILURES THERE CERTAINLY WAS THE POTENTIAL GIVEN THE HIGH SPEED OF TRAVEL AND TRAFFIC SURROUNDING US.  WE ARE FORTUNATE TO HAVE BEEN DRIVING IN THE RIGHT HAND LANE IN BOTH INSTANCES.  THE VOLVO DEALER RETAINED THE OLD ETM. *JB",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131155,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST ALL POWER WHILE DRIVING ON I695, NEAR TOWSON, MD.  WAITED 30 MINUTES AND RE-STARTED VEHICLE.  TOOK THE VEHICLE TO A REPAIR SHOP, AND WAS TOLD THAT THE ETM THROTTLE MODULE NEEDED TO BE CLEANED.  MECHANIC ALSO SAID THAT THE ETM SHOULD BE REPLACED, AS HE HAD SEEN MANY OTHER VOLVO ETM FAILURES.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/18/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131177,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 VOLVO V70 CROSS COUNTRY HAS LOST POWER AND STALLED THREE TIMES IN THE LAST MONTH. ONCE AS MY WIFE AND CHILD WERE CROSSING A DOUBLE SET OF RAILROAD TRACKS AND ONCE WHEN MY WIFE AND A FRIEND WERE BISECTING A BUSY INTERSECTION. I UNDERSTAND THIS HAS HAPPENED TO OTHER VOLVO OWNERS AND THAT THERE IS A KNOWN PROBLEM WITH THE ETM (ELECTRONIC THROTTLE MODULE). IT SHOULD BE RECALLED. I REPAIRED THE PROBLEM BECAUSE OF THE IMMEDIATE SAFETY CONCERNS AT A COST OF $1,000.*JB",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "09/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130923,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 10, 2004, MY VOLVO XC-70 (2001) STALLED WITHOUT WARNING WHILE I WAS DRIVING 55 MPH ON 695 WEST IN BALTIMORE JUST BEFORE THE EXIT FOR I-83N (EXIT 24).  I WAS ALMOST HIT BY A SEMI AND SEVERAL OTHER CARS.  MY CAR HAD TO BE TOWED AND THE ELECTRONIC THROTTLE BODY WAS REPLACED.  HOWEVER, ON DECEMBER 1, 2004, THE SAME PROBLEM OCCURRED WHEN MY CAR STALLED AT AN INTERSECTION BUT WE WERE ABLE TO RESTART IT.  THE ELECTRONIC THROTTLE WAS REPAIRED AGAIN.    *NM",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "07/24/2005",
        "dateOfIncident": "07/22/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129833,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED MY 2001 VOLVO XC70 WITH 16,535 MILES IN AUGUST 2004, I HAVE HAD IT INTO THE DEALER (BORTON VOLVO) FOUR TIMES TO FIX THE SAME ISSUE:  GASOLINE SHOOTING OUT OF THE TANK UPON COMPLETION OF FILLING.  THIS OCCURS AT ANY AND ALL GAS STATIONS, EVEN AFTER THE FOLLOWING REMEDIES HAVE BEEN TAKEN:  VENT CLEANING, FUEL CONTROL REPLACEMENT, FUEL TANK REPLACEMENT, SENDING UNIT REPLACEMENT, EVAPORATION CANNISTER REPLACEMENT, AND FILLER NECK REPLACEMENT.  I BELIEVE THIS TO BE A SAFETY ISSUE AND AN ENVIRONMENTAL ISSUE WITH THE VEHICLE.  EVEN FOLLOWING REPLACEMENT OF THE AFORMENTIONED PARTS, THE PROBLEM STILL EXISTS.",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2005",
        "dateOfIncident": "06/02/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124173,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY ELECTRONIC THROTTLE MODULE.  I HAVE ONLY 61000 MILES ON MY CAR AND THEY HAD TO REPLACE THIS. ON MOST CARS THIS PART HAS LIFETIME WARRANTY OR AT LEAST 70,000 MILES.  I WAS DRIVING 70MPH WHEN MY CAR STARTED SUDDENLY SHAKING, CRUISE CONTROL STOPPED WORKING AND I HAD TO STOP. MANUAL DID NOT HAVE ANYTHING ABOUT \"PERFORMACE REDUCED\" ERROR AND I CALLED THE DEALERSHIP.  THEY TOLD ME THAT IT'S THROITTLE AND IT NEEDS TO BE REPLACED. $1200 LATER DEALERSHIP IS SAYING THAT THIS IS NOT COVERED BY WARRANTY AND THEY WOULD NOT GIVE ME ANY BREAKS.  I THINK THIS WRONG FOR VOLVO NOT TO RECOGNIZE THA THERE IS A PROBLEM, EXTEND THE WARRANTY, AND RECALL ALL THE BAD PARTS.",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/30/2005",
        "dateOfIncident": "04/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118739,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "XC70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR RIGHT FRONT BRAKE WAS MISSING CALIIPER TENSION SPRING-FELL OFF.   *AK",
        "vin": "YV1SZ58D011"
    }
]