[
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/14/2022",
        "dateOfIncident": "01/30/2022",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451932,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2001 Volvo V70. The contact stated that while the vehicle was idling, the engine caught fire. The air bag warning light was illuminated. There was damage to the garage. There were no reported injuries. The fire department extinguished the fire and confirmed the origin of the fire was the engine.  A police report was filed. The vehicle was towed to an independent mechanic. The local dealer was not contacted. The vehicle was not diagnosed or repaired. The manufacturer was not contacted. The failure mileage was approximately 178,000.",
        "vin": "YV1SW53D012"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/13/2022",
        "dateOfIncident": "12/14/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11451736,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "Been trying to get the airbags serviced and replace since I received the notice from  Volvo on Dec.14 2021. I have made several appointments in my area to get this matter fixed, Dealers in my area either don't have replacement in stock or don't know of the recall contract Volvo CarUSA LLC they could not help me, now I am receiving text message on dash saying SRS Airbag service Urgent. Any help would be appreciated. Sincerely [XXX]  INFORMATION Redacted PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "YV1SW61N012"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2022",
        "dateOfIncident": "01/10/2022",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11447515,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "Received an airbag recall. There is no local dealer but there are authorized non-dealer service shops that do replace airbags.  Under the recall a Volvo dealer must do the replacement. The nearest Volvo dealer is 300 miles away.  Volvo will only reimburse for 25 miles of towing. The recall states \"If you are unable to have this procedure performed without charge....\".  Towing cost would be approximately $800.00.  How do I, and several others in my area, resolve this issue?",
        "vin": "YV1SW53D512"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/18/2021",
        "dateOfIncident": "12/18/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11444282,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I was notified of the recall. Because I live 300 miles away from the nearest volvo dealership, there is no option for me to replace the airbag free of charge.  Additionally, there is no plan in place to provide me with a safe vehicle until such a time that my volvo can be repaired.  Until I undertake a great risk by traveling 300 miles at great inconvenience and expense,  to have this problem resolved, I am expected to take a daily risk by driving this unsafe vehicle.",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/06/2021",
        "dateOfIncident": "06/05/2021",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11419842,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "Heater core burst causing severe burn on drivers right foot. An inch and a half deep puddle of boiling hot antifreeze poured out with no warning from center console over gas pedal. Passenger floor area also had boiling antifreeze. Daughter was driving and taken to hospital treated for second degree burns.",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/28/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331366,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE SEATBELT DOES NOT ROLL SMOOTHLY EITHER BEING PULLED OUT OR ALLOWED TO RETRACT.WHEN YOU PULL OUT ' OR RELEASE TO RETURN THE DRIVER'S SIDE SEATBELT, IT CATCHES IN THE BOTTOM OF THE SLOT IN THE SIDE POST WHERE IT CURVES FORWARD SO THAT IT EITHER WON'T COME OUT FAR ENOUGH TO LATCH, OR IF YOU CAN PULL IT OUT AND INSERT IT IN THE LATCH, IT STICKS WHEN YOU LET IT GO SO THAT IT STAYS SLACK AND DOES NOT RETRACT TO KEEP THE BELT TIGHT.  EVEN IF YOU MANAGE TO GET IT OUT AND PROPERLY INSERTED, IT WILL NOT RETRACT WHEN RELEASED. .  THE BELT HAS TO BE KEPT UP IN THE HIGHEST PART PF THE SLOT IN THE POST THAT IT COMES OUT OF, OR IS RETRACTED BACK INTO, WITH MY LEFT HAND WHILE BEING PULLED OUT OR ALLOWED TO RETRACT, OR ELSE IT GETS STUCK IN THE BOTTOM OF THE SLOT..  IT IS NOT SAFE.  EVEN IF PROPERLY CLICKED IN, YOU COULD NOT COUNT ON IT TO RETRACT TIGHTLY IF THERE IS A COLLISION OR SUDDEN STOP.",
        "vin": "YV1SW58D911"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/18/2019",
        "dateOfIncident": "04/01/2019",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11280896,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT NOTICED A FUEL ODOR AROUND AND INSIDE THE VEHICLE. THE CONTACT ALSO NOTICED FUEL LEAKING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 69,000.",
        "vin": "YV1SW61R312"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEATS",
        "crash": false,
        "dateComplaintFiled": "05/31/2019",
        "dateOfIncident": "09/01/2017",
        "fire": true,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11217130,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70.  THE CONTACT STATED THAT WHILE DRIVING 60 MPH, THE FRONT DRIVER AND PASSENGER SEATS WERE MELTING AND BLACK SMOKE WAS EMERGING FROM THE SEATS. ADDITIONALLY, THERE WAS AN ABNORMAL BURNING SMELL EMERGING FROM THE VEHICLE. THE CONTACT STATED THAT THE BATTERY WAS REPLACED IN THE VEHICLE PRIOR TO THE FAILURE. THE CONTACT DISCONNECTED THE CIRCUITS TO THE SEATS. THERE WERE NO WARNING LIGHTS ILLUMINATED. THERE WERE NO INJURIES SUSTAINED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DETERMINE THE FAILURE. THE LOCAL DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 105,000. THE VIN WAS INVALID.",
        "vin": "YV1SW58DX12"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11144519,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT THE REAR BRAKE LIGHTS INTERMITTENTLY FAILED TO FUNCTION. THE BRAKE WARNING LIGHT ILLUMINATED STATING CHECK REAR BRAKE LIGHTS. THE VEHICLE WAS NOT TAKEN TO A DEALER OR AN INDEPENDENT MECHANIC FOR A DIAGNOSTIC TESTING OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT COVERED UNDER THE CAMPAIGN NUMBER: 04V051000 (EXTERIOR LIGHTING) AND DID NOT OFFER FURTHER ASSISTANCE. THE APPROXIMATE FAILURE MILEAGE WAS 206,000.",
        "vin": "YV1SW61R112"
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/13/2018",
        "dateOfIncident": "01/10/2018",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11093551,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I AM DRIVING IN 5TH GEAR THE TRANSMISSION WILL DROP INTO 4TH GEAR, AT THAT TIME I LOOSE 1ST, 3RD AND 5TH GEARS I CAN SHIFT BETWEEN 4TH AND  2ND. THE SHIFT IS VERY HARD AND CAUSES A JERK AND CLUNKING NOISE. I HAVE TO STOP AND SHUT OFF THE VEHICLE. I TURN THE CAR IMMEDIATELY BACK ON AND ALL THE GEARS ARE FUNCTIONAL. I'M NOT SURE WHY THERE'S SO MANY COMPLAINTS ABOUT THIS ISSUE YET NO ACTION HAS BEEN TAKEN TO FIX THIS PROBLEM",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2018",
        "dateOfIncident": "04/01/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11088688,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. WHILE OPERATING THE VEHICLE, THE ODOR OF FUEL WAS PRESENT INSIDE THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TOP OF THE FUEL TANK WAS LEAKING AND THE FUEL PUMP NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER AND LOCAL DEALER (MAPLE HILL VOLVO IN KALAMAZOO, MI) WERE NOTIFIED OF THE FAILURE. THE CONTACT WAS INFORMED BY THE DEALER THAT THE VEHICLE WAS PREVIOUSLY INSPECTED PER NHTSA CAMPAIGN NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE), BUT THE FAILURE STILL OCCURRED. THE FAILURE MILEAGE WAS 160,000.",
        "vin": "YV1SW58D012"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005928,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT THE KEY FOB WOULD NOT FUNCTION INTERMITTENTLY, THE DOOR LOCKS WORKED INTERMITTENTLY, AND THE TURN SIGNALS WORKED INDEPENDENTLY. ALSO, VARIOUS OTHER ELECTRICAL SYSTEMS BEGAN EXPERIENCING ISSUES. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND STATED THAT THERE WERE NO RECALLS ON THE VEHICLE. THE FAILURE MILEAGE WAS APPROXIMATELY 135,000.",
        "vin": "YV1SW58D811"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/15/2016",
        "dateOfIncident": "07/15/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885148,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "KELLY",
                "productModel": "CHARGER HPT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "1.) TIRE #1 WAS PUNCTURED BY A PIECE OF GRAVEL AT ABOUT 25,000 MILES  2.) TIRE #2 MECHANIC REFUSED TO ROTATE TIRES BECAUSE BELT WAS SEPARATING FROM TIRE. TIRES WERE BOUGHT NEW AUGUST 2014. TIRES HAVE LESS THAN 34000 MILES",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2016",
        "dateOfIncident": "05/23/2016",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10877072,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT DISCOVERED THAT FLUID WAS LEAKING FROM THE VEHICLE WHEN ANTI FREEZE WAS ADDED. IN ADDITION, WHEN THE AIR CONDITIONER WAS ACTIVATED, WARM AIR EMITTED FROM THE VENTS. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE COOLING FAN NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT MENTIONED THAT THE VEHICLE WAS PREVIOUSLY SERVICED PER NHTSA CAMPAIGN NUMBER: 04V451000 (ENGINE AND ENGINE COOLING) YEARS AGO. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 190,000. THE VIN WAS NOT PROVIDED. UPDATED 09/22/16*LJ  CONSUMER STATED \"RECALLED PART COOLANT FAN MODULE\" AGAIN BECAME DEFECTIVE. IT CAUSED DAMAGED TO THE VEHICLE, INCLUDING A RADIATOR AND COOLANT RESERVE TANK, IN ADDITION TO REPLACEMENT OF THE DEFECTIVE MODULAR/ COOLANT FAN ASSEMBLY. UPDATED 6/19/18*JB",
        "vin": "YV1SW58D211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/18/2016",
        "dateOfIncident": "11/02/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820848,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A KNOWN SAFETY ISSUE WITH THIS 2001 VOLVO V70 XC AWD TRANSMISSION AND IT NEEDS TO BE ADDRESSED ASAP. VOLVO AND THE NHTSA BOTH KNOW ABOUT THIS ONGOING PROBLEM AND REFUSE TO FIX THE PROBLEM. THE TRANSMISTION SLIPS BAD AND STOPS WORKING AND LOSES POWER AND THE DEALERS STATES THE COMPUTER UPDATES WILL FIX THE PROBLEM AS EVEN TOLD BYE THE DEALER ITS A KNOWN ISSUE THAT VOLVO REFUSES TO RECTIFY UNFORTUNATELY. BUT THIS IS A SAFTY ISSUE AT THIS POINT THERE ARE SO MANY COMPLAINTS AND I WANT TO KNOW WHY NOTHING IS BEING DONE AFTER ALL THESE YEARS ? I WANT A REBUILT OR NEW SAFE TRANSMISSION INSTALLED AT THE COST OF VOLVO FOR NOT FIXING THE ONGOING PROBLEMS THEY KNEW ABOUT BACK IN 2001 AND THERE COMPLETE WRONG MAINTENANCE ON THE TRANSMISSION STATING NOT TO CHANGE THE FLUID UNTIL 90K. I BELIEVE THE  NHTSA HAS MANY COMPLAINTS IN REFRANCE TO THIS SAME ISSUE WHY IS NOTHING BEING DONE ?",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2015",
        "dateOfIncident": "06/05/2015",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10724316,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. WHILE THE VEHICLE WAS AT AN INDEPENDENT MECHANIC FOR ROUTINE INSPECTION, IT WAS DISCOVERED THAT THE FUEL PUMP WAS FRACTURED AND LEAKING DUE TO DEFECTIVE MATERIAL. THE FUEL PUMP WAS REPLACED. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 106,000.",
        "vin": "YV1SW58D612"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/28/2015",
        "dateOfIncident": "05/17/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721930,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION HAS HAD PROBLEMS FOR ABOUT THREE YEARS. WE WERE TRAVELING ON THE HWY AND THE CAR STARTED SHAKING, THEN STOPPED. WE HAD TO HAVE IT TOWED TO OUR MECHANIC. NEEDS NEW TRANSMISSION AND ALTERNATOR WHICH WOULD COST MORE THAN IT IS WORTH. OUR MECHANIC HAS SEEN A NUMBER OF 2001S WITH PROBLEMATIC TRANSMISSIONS. WE ARE VERY DISAPPOINTED IN VOLVO FOR NOT FIXING THIS PROBLEM. NOW THIS BEAUTIFUL CAR IS SITTING IN OUR DRIVEWAY UNUSED.",
        "vin": "YV1SW58D412"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "04/27/2015",
        "dateOfIncident": "12/19/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10713148,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRST TIME, WAS IN A DRIVE THROUGH & JUST TOOK OFF, HOPPED THE CURB, AND HIT TALK BOX.  NEXT 2 TIMES WERE STOPPED QUICKLY BY ME PUTTING IN NEUTRAL.  LAST TIME WAS  JUST LEAVING PARKING SPACE, AND CAR JUMPED CURB AND I STOPPED 4 FT. FROM BRICK WALL.    HAVE HAD IT TESTED 2-3 TIMES BY MECHANICS W/O SUCCESS.  *TR",
        "vin": "YV1SW58D712"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/22/2014",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667711,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED THE TAIL LIGHT BRAKE BULBS WERE BURNING OUT QUICKLY. AFTER GETTING A TICKET I STOPPED DRIVING IT UNTIL I COULD DETERMINE THE CAUSE. VOLVO LISTS A BRAKE RELAY RECALL. BRAKE LIGHT FUSES AND RELAYS ARE IN 4 LOCATIONS IN THE CAR. THEY ARE:  1. UNDER THE HOOD IN THE ENGINE CONTROL UNIT ECU, 2.THE PASSENGER COMPARTMENT A. CENTRAL CONTROL UNIT CCU AND B. FUSE PANEL BY DRIVERS SIDE DOOR POST 3. REAR CONTROL UNIT IN THE CARGO COMPARTMENT.  THE PROBLEM WAS AN ELECTRICAL ENGINEERING DESIGN WHERE A STEEL RACE THAT SURROUNDS THE TAILLIGHT BULBS TRANSFERS THE ELECTRICAL CURRENT IS DESIGNED TO FAIL. AS THE BULB HEATS UP IT TRANSFERS THE HEAT TO THE PLATE AND PLASTIC PINS THAT HOLD IT IN PLACE UNDER PRESSURE FROM THE SPRING STEEL PARTS OF THE REMOVABLE BULB SOCKET UNIT.  AS THE PLASTIC PINS WEAKEN AND MOVE AWAY  UNDER PRESSURE AND HEAT FROM THE BULB SOCKET SPRING STEEL KEEPERS, AND CONDUCTORS OF VOLTAGE AND CURRENT, THE CURRENT IS THROTTLED DOWN TO A PIN POINT AS THE PLATE MOVES AWAY FROM THE  BULB  CREATING MORE HEAT AND ARCING TO MELT THE STEEL RACE SURROUND THE BULBS THAT SUPPLY THE CURRENT.   THE REPLACED BULBS SEEM TO WORK FOR A SHORT TIME AS THE CONNECTION IS REESTABLISHED WHEN THE BULB SOCKET IS REMOVED  AND REPLACED, AND THE CONNECTION IS REESTABLISHED FOR A TIME, BUT IT WILL SOON OVER HEAT AND FAIL FROM THE WEAKENED AND MELTED PLASTIC LENS.  BRAKE LIGHT FAILURE RESULTS NOT FROM A  FAILED PART, RELAY, FUSE OR WIRE, BUT FROM AN ENGINEERING DESIGN FLAW THAT WAS RECOGNIZED AND ELIMINATED IN THE 2005 MODELS. FORD AND VOLVO NEVER MENTION THIS. A RECALL COULD AMOUNT TO SIX HUNDRED TO A THOUSAND DOLLARS PER CAR FOR THE 4 LENSES WITH LABOR.  THE ARCING IN THE WIRING MAY ALSO CAUSE OTHER COMPUTER FAILURES AS THE TRANSMISSION ALSO HAS AN ELECTRICAL PROBLEM IN THE KICKDOWN PROCESS THAT CAUSES AN ABNORMAL DELAY IN NEUTRAL GEAR AND HARD ENGAGEMENT OF THE LOWER GEAR.  *TR",
        "vin": "YV1SW53D511"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/17/2014",
        "dateOfIncident": "05/12/2014",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592111,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION IS SHUT OFF MOMENTARILY AS THE TRANSMISSION ATTEMPTS TO DOWNSHIFT CAUSING IT TO SLIP INTO NEUTRAL THEN ENGAGE THE LOWER GEAR HARD AS THE TRANSMISSIONS COMPUTER REESTABLISHES CONTROL.     THIS ACTION IS RECORDED ON A VIDEO CAR CAMERA OPERATED BY THE IGNITIONS ON AND OFF POSITION.     THE HARD SHIFTING PROBLEM THOUGHT TO BE FIXED BY SOFTWARE UPDATE MAY BE ADDRESSING THE SYMPTOM NOT THE CAUSE.   ACCELERATION IS ALSO  AFFECTED AT OTHER TIMES WHERE THE FOOT PEDAL IS INOPERABLE, BUT REESTABLISHED WHEN SHUTTING THE IGNITION OFF AND ON.     THE DRIVE TRAIN BECOMES WOBBLY AFTER A SHORT PERIOD OF TIME AT HIGHWAY SPEEDS MAKING TRAVEL BETWEEN CITIES UNSAFE.     A CLUNKING SOUND  FROM THE REAR, AS BROKEN SPRING  OR  LOOSE BOWLING BALL MAKES, IS HEARD AT TIMES OF MILD ACCELERATION AT LOWER SPEEDS.      PERHAPS A GROUNDING STRAP MY ALLEVIATE STATIC BUILDUP IN THE IGNITION SYSTEM.    *JS",
        "vin": "YV1SW53D511"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/02/2014",
        "dateOfIncident": "05/29/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586226,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED THE CAR, PLACED THE CAR IN DRIVE GEAR AND IDLED THROUGH THE PARKING LOT TRAFFIC TO THE INTERSECTION BUT THE CAR WOULD NOT ACCELERATE THROUGH THE INTERSECTION THOUGH THE CONDITION RESTORED AFTER I PULLED OVER AND TURNED OFF THE IGNITION AND RESTARTED IT. THEN THE ACCELERATOR FUNCTIONED NORMALLY.HAD A SEMI TRUCK BEEN COMING ALONG, I WOULD NOT BE HERE TO WRITE YOU THIS LETTER.  *TR",
        "vin": "YV1SW53D511"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2014",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10567240,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN TO NOTICE A FUEL SMELL AND DRIP MARKS UNDER THE VEHICLE AFTER PARKING THE VEHICLE IN THE GARAGE IN THE EVENING. UPON INVESTIGATION, I NOTED FUEL DRIPS ON THE UNDERBODY OF THE VEHICLE IN AN AREA SLIGHTLY IN FRONT OF THE FUEL TANK AND A DEVELOPING FUEL PUDDLE IMMEDIATELY UNDER THE VEHICLE. FOLLOWING AN INSPECTION AT THE VOLVO DEALER, IT WAS DETERMINED THAT THE ELECTRIC FUEL PUMP WAS LEAKING FUEL. IT WAS EXPLAINED TO ME THAT THE FUEL PUMP HOUSING WAS CRACKED AND LEAKING FUEL AT AN UNSAFE CONDITION. I WAS ADVISED TO REPLACE THE PUMP IMMEDIATELY DUE TO THE HIGH LEVEL OF FUEL LEAKAGE. I WAS ALSO ADVISED THAT THE FUEL TANK SENDING PUMP WAS ALSO DEFECTIVE AND REQUIRED IMMEDIATE REPLACEMENT.",
        "vin": "YV1SW61RX12"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2013",
        "dateOfIncident": "10/15/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557644,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN TO NOTICE A FUEL SMELL AND DRIP MARKS UNDER THE VEHICLE AFTER PARKING THE VEHICLE AFTER DRIVING INTO THE GARAGE IN THE EVENING. UPON INVESTIGATION, I NOTED FUEL DRIPS ON THE UNDERBODY OF THE VEHICLE IN THE AREA SLIGHTLY IN THE FRONT OF THE FUEL TANK. I ALSO NOTICED THE DEVELOPMENT OF A FUEL PUDDLE IMMEDIATELY UNDER THE VEHICLE IN THAT LOCATION. I IMMEDIATELY CONTACTED THE VOLVO DEALER FOR SERVICING. ONCE AT THE DEALER, IT WAS DETERMINED THAT THE ELECTRIC FUEL PUMP WAS LEAKING FUEL. IT WAS EXPLAINED TO ME THAT THE FUEL PUMP HOUSING WAS CRACKED AND LEAKING FUEL AT AN UNSAFE CONDITION. I WAS ADVISED TO REPLACE THE PUMP IMMEDIATELY DUE TO THE HIGH LEVEL OF FUEL LEAKAGE. I WAS ALSO ADVISED THAT THE FUEL TANK SENDING PUMP WAS ALSO DEFECTIVE AND REQUIRED IMMEDIATE REPLACEMENT. THE VOLVO DEALER, JENKINS IMPORTS, REPLACED THE DEFECTIVE UNITS ON 22 OCTOBER 2013. I HAVE RETAINED THE DEFECTIVE PARTS.  *TR",
        "vin": "YV1SW61RX12"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2013",
        "dateOfIncident": "09/01/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10541842,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SHIFTS WITH A CLUNK INTO 2ND AND 3RD GEARS AS WELL AS INTO FIRST. HESITANT TO SHIFT INTO FIRST GEAR WHEN MOVING FROM A STOP. TRANSMISSION NOT SAFE!!!!",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/09/2013",
        "dateOfIncident": "02/04/2013",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505612,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT THE TRANSMISSION SERVICE WARNING LIGHT ILLUMINATED. THE CONTACT STATED THAT THE ENGINE RPMS INCREASED AND THE VEHICLE SHIFTED SLOWLY, GOING THROUGH EVERY GEAR. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS TOLD THAT THE TRANSMISSION NEEDED TO REPLACE. THE WAS NOT REPAIRED. THE CURRENT MILEAGE WAS 113,448 AND THE FAILURE MILEAGE WAS UNKNOWN.  *TR",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "12/17/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490861,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK PUMP AND SEALS HAVE BEGUN LEAKING GAS DUE TO CRACKS IN THE PLASTIC AND SEALS. GAS LEAKS DOWN THE SIDE OF THE GAS TANK ONTO THE GROUND AND THERE ARE GAS FUMES IN THE CAR.  *TR",
        "vin": "YV1SW53D411"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2012",
        "dateOfIncident": "07/14/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465992,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT WHILE BRAKING TO A STOP, THE VEHICLE ERRONEOUSLY SHIFTED INTO NEUTRAL AND THEN RETURNED TO DRIVE INDEPENDENTLY. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE DEALER STATED THAT THEY NEEDED TO REPLACE THE TRANSMISSION. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 135,000 AND THE CURRENT MILEAGE WAS 178,000.",
        "vin": "YV1SZ58D011"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/03/2012",
        "dateOfIncident": "07/03/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10464150,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT THE AUTOMATIC WINDOW WOULD NOT AUTOMATICALLY STOP WHEN ACTIVATED.  AS A RESULT, THE WINDOW CLOSED ON A PASSENGER'S FINGER. THE VEHICLE WAS NOT TAKEN TO THE DEALER AND THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE.  THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND THE CURRENT MILEAGE WAS 171,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2012",
        "dateOfIncident": "06/06/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462385,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT WHILE DRIVING 65 MPH, THE TRANSMISSION FAILED.  THE TRANSMISSION SERVICE REQUIRED LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE THEY INFORMED THE CONTACT THAT THE TRANSMISSION NEEDED REPLACING. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE FAILURE MILEAGE WAS 170,000.",
        "vin": "YV1SZ58D511"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/04/2012",
        "dateOfIncident": "06/04/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460544,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 VOLVO XC AND BOUGHT THIS CAR FOR ITS RELIABILITY AND AS A FAMILY VEHICLE.  I USE THIS VEHICLE TO COMMUTE 150 MILES PER DAY FOR MY JOB.  DROVE THE CAR ON JUNE 3, 2012 WITH MY SON TO RUN ERRANDS AND THERE WERE NO PROBLEMS.  THE NEXT DAY, JUNE 4, 2012 I GOT IN THE CAR TO GO TO WORK IN THE MORNING.  THE MINUTE I STARTED PULLING OUT OF THE DRIVEWAY I HEARD A NOISE COMING FROM THE CAR.  I GOT MY HUSBAND AND HAD HIM LOOK AT THE CAR SINCE IT WAS FINE THE DAY BEFORE.  HE DISCOVERED THE BROKEN SPRING.  LUCKILY THE SPRING BROKE OVERNIGHT WHILE IT WAS SITTING IN THE DRIVEWAY AND NOT WHILE I WAS DRIVING IT ON THE HIGHWAY.  WE HAVE DONE RESEARCH ON THIS PART BREAKING AND FOUND NUMEROUS OTHER VOLVO OWNERS WHO HAVE ALSO HAD THIS PART BREAK.  *TR",
        "vin": "YV1SZ58D811"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/03/2012",
        "dateOfIncident": "09/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457243,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST PURCHASED MY 2001 VOLVO V70 USED FROM A REPUTABLE DEALER WHEN MY WIFE NOTICED THAT THE TRANSMISSION WOULD OCCASIONALLY \"SLIP\" IN AND OUT OF GEAR.  I DID NOT DRIVE THE CAR VERY OFTEN, SO I DID NOT EXPERIENCE THE PROBLEM FOR ANOTHER MONTH OR SO.  WHEN YOU TAKE YOU FOOT OFF THE GAS TO COAST OR SLOW DOWN FOR A TURN THE TRANSMISSION COMPLETELY DISENGAGES.  WHEN YOU PUSH ON THE GAS EXPECTING TO CONTINUE TO KEEP GOING THE ENGINE REVS - BECAUSE THERE IS NO TRANSMISSION ENGAGED- AND THEN SUDDENLY \"SLAMS' BACK INTO GEAR.  THIS CONDITION HAS BEEN WITH US NOW FOR SEVERAL YEARS.  THE CAR HAS BEEN TO THE VOLVO SHOP TWICE AND THEY CLAIMED THERE WERE NO CODES SHOWING UP ON THEIR TEST EQUIPMENT...AND BY THE WAY THAT'LL BE ANOTHER $300!  I'VE LEARNED TO BABY THE CAR, AND DRIVE WITH THIS DANGEROUS CONDITION BECAUSE I KNOW A NEW TRANSMISSION FOR THIS CAR WOULD COST MORE THAN THE CAR IS WORTH.  AFTER CHECKING WITH EDMUDS, I HAVE COME TO REALIZE THERE ARE DOZENS IF NOT HUNDREDS OF PEOPLE OUT THERE WITH THE EXACT SAME PROBLEM AS MINE, AND VOLVO APPEARS TO EITHER BE CLUELESS, OR NOT WILLING TO DO ANYTHING ABOUT IT.  MY CAR HAS BEEN ACTING THIS WAY SINCE I PURCHASED IT WITH ONLY 70,000 MILES.  *TR",
        "vin": "YV1SW58D111"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2012",
        "dateOfIncident": "03/01/2012",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449873,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70. CONSUMER WRITES IN REGARDS TO REPAIRS UNDER RECALL NOTICE  EA05021  *TGW   THE CONSUMER STATED THE PROBLEM OF THE VEHICLE SURGING FORWARD HAD BEEN UNDIAGNOSED SEVERAL TIMES BY MECHANICS. THE CONSUMER ALSO STATED AT THE TIME OF PURCHASING THE VEHICLE, THE DEALERSHIP DID NOT DISCLOSE THE RECALL AND SHE NEVER RECEIVED A NOTICE ABOUT THE RECALL.  THE VEHICLE WAS ALSO TAKEN TO THE DEALER DUE TO A MALFUNCTION WITH THE SECURITY SYSTEM. *JB",
        "vin": "YV1SW58D911"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/26/2011",
        "dateOfIncident": "09/10/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441200,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM NOW THE OWNER OF A 2001 VOLVO V70 T5. I BOUGHT THE CAR FROM ITS ORIGINAL OWNER. THE CAR HAS HAD THE AUTOMATIC TRANSMISSION REPLACED 2 TIMES BY THE ORIGINAL OWNER AND NOW I AM FORCED TO REPLACE THE TRANSMISSION AS WELL. WE (ORIGINAL OWNER AND MYSELF) HAVE HAD THE VOLVO RECOMMENDED SOFTWARE UPDATES, FLUID FLUSHING, AND STILL WE HAVE BEEN FORCED TO CHANGE THREE TRANSMISSIONS. I HAVE SPOKEN WITH NUMEROUS VOLVO MECHANICS AND THEY HAVE INFORMED ME THAT THEY ARE AWARE THAT THEIR IS A PROBLEM BUT VOLVO IS OFFERING TO DO NOTHING TO FIX IT. I AM IN THE US ARMY AND STATIONED IN GERMANY, I HAVE SPOKEN TO THE VOLVO MECHANICS HERE IN GERMANY AND THEY HAVE INFORMED ME THAT THEY CAN REPLACE THE TRANSMISSION FOR 4100 EURO BUT THAT THEY WILL OFFER NO WARRANTY AS VOLVO KNOWS IT IS A PROBLEM. THE FIRST TRANSMISSION WAS REPLACED AT 51000 MILES, THE SECOND AT 128567 AND NOW AGAIN I MUST DO IT AT 203000. AT WHAT POINT WILL THE NHTSA STEP UP TO PROTECT US AS THE CONSUMER? I HAVE SCANNED THE MESSAGE BOARDS AND FORUMS ONLINE AND THERE ARE HUGE COMPLAINT POOLS WITH EVERYONE HAVING THE SAME ISSUE WITH THE TRANSMISSION. I HAVE CALLED VOLVO NA 18 TIMES AND AM YET TO TALK TO A PERSON. THEIR SYSTEM ROUTES YOU TO A DEAD END AND THEN HANGS UP. I HAVE EVEN GONE THE ROUTE OF CALLING VOLVO IN GOTHENBURG SWEDEN AND THEY AT LEAST TALKED TO ME. I WAS TOLD THAT SINCE MY CAR WAS MANUFACTURED WHILE VOLVO WAS OWNED BY FORD THAT THEY (VOLVO) ARE NOT RESPONSIBLE. *TR",
        "vin": "YV1SW53D211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2011",
        "dateOfIncident": "07/28/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437547,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT WHILE DRIVING 5 MPH, THE VEHICLE JERKED VIOLENTLY AND WOULD NOT SHIFT IN OR OUT OF GEAR. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE WHO OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 97,000.",
        "vin": "YV1SW58D511"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/01/2011",
        "dateOfIncident": "10/28/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433826,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION ISSUE.  AT APPROXIMATELY 75,000 MILES, SHIFTING BETWEEN GEAR 2 TO 3 AND 3 TO 4 IS ACCOMPANIED BY HIGH RPMS INTO NEUTRAL BEFORE ENGAGING GEAR.  RESULTS IN A HARD SHIFT WHEN GEAR ENGAGES.  INITIAL DEALER SOLUTION WAS SOFTWARE DOWNLOADS.  WHEN PROBLEM PERSISTED AND A \"TRANSMISSION SERVICE REQUIRED\" MESSAGE BEGAN DISPLAYING, THE DEALER SOLUTION IS TO REPLACE THE TRANSMISSION AT A COST OF $7500 WITH NO EXPLANATION OF WHAT THE ACTUAL UNDERLYING PROBLEM IS.  THIS IS VERY SIMILAR TO NUMEROUS COMPLAINTS IN THE NHTSA DATABASE AND OTHER WEB-BASED VOLVO FORUMS.  *TR",
        "vin": "YV1SW53D612"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2011",
        "dateOfIncident": "10/02/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433524,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNING LEFT OUT OF DRIVEWAY, RIGHT (PASSENGER) BALL JOINT SEPARATED, PULLING THE CV JOINT APART AND DAMAGING THE RIGHT FRONT FENDER.  I MOVED A TOTAL OF THREE FEET.  *TR",
        "vin": "YV1SW53D911"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/18/2011",
        "dateOfIncident": "09/28/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430679,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN LOCK LOCKED UP WHILE DRIVING. KEY STILL WORKED AND CAR STILL RUNNING BUT WAS UNABLE TO STEER. WOULD HAVE BEEN A DISASTER IF I WAS DRIVING ANY FASTER. VERY SCARY AND SHOULD BE SAFETY RECALL!!!  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/18/2011",
        "dateOfIncident": "04/01/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419980,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT WHEN TRAVELING AT VARIOUS SPEEDS, THE VEHICLE WOULD JERK ABNORMALLY AND EXPERIENCE A DECELERATION OF BETWEEN 10-20 MPH. THE VEHICLE WAS TAKEN TO THE DEALER WHERE REPAIRS WERE PERFORMED UNDER NHTSA CAMPAIGN ID NUMBER: 06V441000 (VEHICLE SPEED CONTROL).THE FSAILURE PERSISTED AND NO FURTHER REPAIRS WERE PERFORMED. THE FAILURE MILEAGE WAS 130,000 AND THE CURRENT MILEAGE WAS 135,000.",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/31/2011",
        "dateOfIncident": "07/27/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10416406,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 VOLVO V70 WITH 110,000 MILES.  THE TRANSMISSION HAS BEEN SLIPPING FOR THE LAST 2 YEARS.  LAST WEEK THE CAR WAS BARELY DRIVABLE.  MY VOLVO MECHANIC STATES THAT THE TRANSMISSION NEEDS TO BE REPLACED (APPROX. $4700).  I HAVE HEARD OF MANY OTHER VOLVO OWNERS HAVING THE SAME PROBLEM. *TR",
        "vin": "YV1SW61NX12"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2011",
        "dateOfIncident": "12/23/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413530,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS THE VEHICLE WOULD JERK UNEXPECTEDLY. THE VEHICLE WAS TAKEN TO THE DEALER AND THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS NOTIFIED AND THEY OFFERED NO ASISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 105,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/09/2011",
        "dateOfIncident": "06/08/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411639,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY V70 ALWAYS HESITATES WHEN SHIFTING BETWEEN R AND D GEAR. AND I CAN HEAR A LOUD CLANK!!!   SOMETIME IT DOES A HORRIBLE UP- OR DOWN-SHIFTING AROUND 25 MPH. THE TRANSMISSION MUST GET WORSE AND WORSE SINCE THE \"CLANK\" CONTINUES EVERYDAY.   *TR",
        "vin": "YV1SW53D912"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2011",
        "dateOfIncident": "06/28/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410279,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2001 VOLVO V7 WAGON WITH 61,000 MILES. (IT WAS A ONE OWNER CAR THAT HAD BEEN REPOSSESSED). WITHIN A WEEK, THE CAR WAS GOING INTO NEUTRAL WHILE I WAS DRIVING ON THE HIGHWAY AND JERKING. THE TRANSMISSION HAS TO BE REPLACED. BECAUSE OF ITS AGE, VOLVO REFUSES TO HELP WITH THE COST OF REPLACING THE TRANSMISSION. YET, NO MATTER HOW OLD THE VEHICLE, THE TRANSMISSION SHOULD HAVE LASTED MUCH LONGER. NEITHER VOLVO USA OR VOLVO INTERNATIONAL WOULD HELP.  *TR",
        "vin": "YV1SW58DX12"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2011",
        "dateOfIncident": "01/30/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407692,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. THE CONTACT STATED THAT WHILE ATTEMPTING TO ACCELERATE AND MERGE INTO TRAFFIC FROM AN ON-RAMP, THE VEHICLE LOST ABNORMALLY POWER. THE VEHICLE WAS TOWED TO THE LOCAL VOLVO SPECIALIST WHO PERFORMED A DIAGNOSED THAT LOCATED THE FAILURE AT THE THROTTLE BODY. THE VOLVO SPECIALIST REPROGRAMMED THE SOFTWARE BUT ADVISED THE THROTTLE BODY WOULD NEED TO BE REPLACED. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED FOR THE SAME FAILURE UNDER NHTSA CAMPAIGN ID NUMBER: 06V441000 (VEHICLE SPEED CONTROL). THE VEHICLE WAS NOT FURTHER REPAIRED. THE MANUFACTURER WAS CONTACTED BUT DENIED ASSISTANCE WITH THE REPAIR. THE FAILURE MILEAGE WAS 98,788 AND THE CURRENT MILEAGE WAS 180,000.",
        "vin": "YV1SW6AR412"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/26/2011",
        "dateOfIncident": "04/25/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397936,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "*EVENTS LEADING UP TO - RANDOM  *FAILURE - TRANSMISSION SHIFTING OUT OF GEAR - NO THROTTLE RESPONSE- THEN SLAMMING INTO GEAR. HARD DOWN SHIFT / UP-SHIFT.    * THROTTLE BODY REPLACED, CVVT SOLENOID CLEANED, TRANNY FLUID CHANGED.... NO CORRECTION TO PROBLEM.  *TR",
        "vin": "YV1SW58D011"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2011",
        "dateOfIncident": "01/15/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393725,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2001 VOLVO V70. WHILE DRIVING APPROXIMATELY 20 MPH WHEN HE BEGAN TO SMELL AND OVERPOWERING FUEL ODOR INSIDE OF THE VEHICLE. HE WAS UNABLE TO DETERMINE THE SOURCE OF THE ODOR. MONTHS LATER, THE VEHICLE WAS TAKEN TO THE DEALER FOR THE FAILURE. THE DEALER DETERMINED THAT THERE WAS A LEAK IN THE FUEL PUMP AND STATED THAT THE FUEL PUMP AND CONTROL UNIT WOULD NEED REPLACING. THE DEALER AND THE MANUFACTURER ADVISED HIM THAT HIS VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 09V483000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP). THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED HE WILL CALL THE MANUFACTURER AND FILE A COMPLAINT. THE FAILURE MILEAGE WAS 155,000 AND THE CURRENT MILEAGE WAS 162,000.",
        "vin": "YV1SW53D211"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/03/2011",
        "dateOfIncident": "02/19/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386370,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 25 MPH GOING THROUGH THE TOLL BOOTH ON THE FREEWAY, AFTERWARDS ACCELERATING AND IMMEDIATELY NOTICED TRANSMISSION SLIP AS THE RPM GAGE WENT UP AND BEYOND 6,000 RPM. THERE WAS NO SIGN LEADING UP TO THE SLIPPING. AFTERWARDS I CONTINUED TO DRIVE FOR ANOTHER 25 MILES, STOPPED TO CHECK UNDER THE HOOD TO SEE WHAT HAPPENED. NOTHING TO DO EXCEPT DRIVE HOME. THE TRANSMISSION CONTINUED TO SLIP UPON ACCELERATION. THE TRAFFIC BEGAN TO STOP AND GO FOR MANY MILES. THE TRANSMISSION AT SOME POINT AFTER STOPPING WOULDN'T ENGAGE INTO ANY GEAR. I WAS UNABLE MOVE THE CAR OUT OF THE FAST LANE. CALLED AAA FOR A TOW TRUCK AND THE CHP. THE CAR WAS TOWED TO A VOLVO REPAIR FACILITY WHERE IT WAS INSPECTED. I WAS TOLD THAT THE TRANSMISSION NEEDED TO BE REPLACED BY A NEW ONE OR A REBUILT TRANSMISSION, WHICH IN EITHER CASE WOULD COST IN EXCESS OF $5,000. TRANSMISSION SERVICE WAS PERFORMED ON THIS CAR 3-4 MONTHS PRIOR TO THIS INCIDENT. THERE WAS NEVER ANY INDICATION THAT THE TRANSMISSION WAS FAILING IN THIS CAR. THERE WERE NO WARNING LIGHTS OR NOTICES ON THE DASH BOARD TO INDICATE A PROBLEM WITH THE TRANSMISSION.  THE VEHICLE IS IN A REPAIR FACILITY AWAITING MY DECISION TO EITHER REPLACE THE TRANSMISSION OR DONATE THE CAR. *TR",
        "vin": "YV1SJ527072"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/28/2011",
        "dateOfIncident": "01/07/2011",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379496,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO V70 TRANSMISSION FAILURE FOR 2001, 2002, 2003, 2004 MODEL YEARS. *TR",
        "vin": "YV1SW58D611"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2011",
        "dateOfIncident": "05/11/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376277,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70. WHILE DRIVING APPROXIMATELY 55 MPH THE CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CHECK ENGINE LIGHT WAS RESET AND THE O RING SEAL WAS TIGHTENED IN THE FUEL SYSTEM. THE CONTACT EXPERIENCED THE FAILURE AGAIN. THE CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD AND THERE WAS A STRONG FUEL SMELL COMING FROM THE REAR OF THE VEHICLE. THE VEHICLE WAS TAKEN BACK TO THE SAME REPAIR SHOP. THE TECHNICIAN STATED THAT THERE WAS A LEAK AROUND THE FUEL SYSTEM. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND STATED THAT THERE WAS A RECALL   (NHTSA CAMPAIGN ID NUMBER: 09V483000,  FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP) BUT THE VIN WAS NOT INCLUDED. THE APPROXIMATE FAILURE MILEAGE WAS 136,000.    UPDATED 02/14/11  *BF  UPDATED 02/22/11",
        "vin": "YV1SW58D612"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/06/2011",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374940,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT STATED THAT WHEN THE GEARS WERE SHIFTED, HE WOULD HEAR A BANGING NOISE, WHICH CAUSED THE TRANSMISSION TO FAIL. THE DEALER WAS NOTIFIED AND THEY ADVISED THE CONTACT TO TAKE THE VEHICLE IN. THE MANUFACTURER OFFERED NO ASSISTANCE. THE VEHICLE WAS REPAIRED. THE CURRENT MILEAGE WAS APPROXIMATELY 116,000. THE FAILURE MILEAGE WAS APPROXIMATELY 90,000.",
        "vin": "YV1SW58DX11"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/17/2010",
        "dateOfIncident": "08/02/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371087,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70. WHILE DRIVING APPROXIMATELY 30 MPH, THE CONTACT DEPRESSED THE ACCELERATOR PEDAL AND HEARD A THUMPING NOISE. THE FAILURE HAD BEEN OCCURRING SINCE AUGUST 2010. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE CONTACT WAS INFORMED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE FAILURE MILEAGE WAS APPROXIMATELY 130,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 132,000.   UPDATED 02/10/11  *BF   SECOND OWNER OF THIS CAR. UPDATED 12/01/2011 *LN",
        "vin": "YV1SW53D211"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/13/2010",
        "dateOfIncident": "11/07/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370405,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED A FUEL ODOR IN THE VEHICLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO REPLACED THE FUEL PUMP UNIT AND O RINGS. THE CONTACT REFERENCED RECALL 09V483000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP BUT WAS INFORMED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 164,668.",
        "vin": "YV1SW61N712"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356768,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION ON 2001 VOLVO V70 2.4T - TRANSMISSION SERVICE REQUIRED LIGHT IS ON, CHECK ENGINE WARNING LIGHT IS ON, AS WELL AS ORANGE EXCLAMATION. ALSO NO DELAYED SHIFTS. GOT THE FEELING THIS SHOULD BE A RECALL ITEM. WHILE STOPPED AT A LIGHT OR STOP SIGN I HEAR THE TRANSMISSION ?FALLING OUT OF PLACE? AND SHORTLY AFTER THE GAS PEDAL IS APPLIED THE TRANSMISSION GRABS WITH A HARD SLAM/AUDIBLE CLUNKING NOISE BUT FOR A SECOND YOU HAVE NO CONTROL OF VEHICLE AND IF ON A HILL IT ROLLS A LITTLE BIT BEFORE TRANSMISSION KICKS IN. NO ACCIDENTS YET, BUT I FEAR DRIVING IT AT ALL, SINCE THE SLIP COULD RESULT IN TOTAL LOSS OF POWER TO THE WHEELS WHILE THE AUTOMATIC TRANSMISSION SHIFTS. I HAVE TOLD THE SERVICE TECHNICIANS AT VOLVO IN TULSA, OK ABOUT THIS ISSUE, BUT THEY HAVE NOT RESOLVED THE PROBLEM. THEIR ADVICE IS TO PURCHASE A NEW CAR ON TRADE-IN OR SPEND $5,000 ON A NEW TRANSMISSION. THIS SHOULD NOT BE HAPPENING TO VOLVO EVEN AT 140,000 MILES. I FIRMLY BELIEVE THE PROBLEM IS A POTENTIALLY DEADLY ONE IN THAT IT COULD HAPPEN TO ANYONE AT ANYTIME AND ANYWHERE IN STOP AND GO TRAFFIC. NOW THE VEHICLE'S ELECTRONIC CLIMATE CONTROL IS DEAD (NO POWER TO IT) AND THE SAME SERVICE TECHNICIANS AT THE SAME DEALER NOW TELLS ME IT NEEDS TO BE REPLACED FOR $1400. THE SUNROOF ALSO HAS A MIND OF ITS OWN AND WORKS WHENEVER IT WANTS. SOUNDS LIKE A LOT OF ELECTRIC ISSUES AT THE SAME TIME WHICH LEADS ME TO BELIEVE IT IS NOT A TRANSMISSION PROBLEM BUT A COMPUTER/ELECTRIC ISSUE. *TR",
        "vin": "YV1SW58D611"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2010",
        "dateOfIncident": "08/23/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351545,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A MAJOR SAFETY HAZARD. ENGINE SURGED TO APPROXIMATELY 2000 RPM WHILE STOPPING FOR A TRAFFIC LIGHT, CAR WAS PLACED INTO NEUTRAL, CAR STOPPED AND ENGINE SUBSEQUENTLY DIED. ENGINE WAS RE-STARTED AND VEHICLE CONTINUED TO OPERATE WITH NO CAUTION/ WARNING LIGHTS VISIBLE. DURING ATTEMPT TO DRIVE VEHICLE ON THE FOLLOWING DAY, THE VEHICLE WOULD NOT ACCELERATE BEYOND 20 MPH. THE PERFORMANCE REDUCED WARNING LIGHT WAS THEN VISIBLE. *TR",
        "vin": "YV1SW53D911"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/10/2010",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335653,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 VOLVO V-70 T-5 WITH 105,000 MILES ON THE VEHICLE.  I HAVE NOTICED THE CAR IS SURGING WHILE DRIVING ON THE HIGHWAY.   WHILE TRYING TO PASS ANOTHER VEHICLE THE CAR BEGAN TO SURGE AND I HAD TO BRAKE AND GET BACK INTO THE RIGHT LANE.  AFTER DOING SOME INVESTIGATING I HAVE FOUND OUT THAT THIS IS PROBABLY THE RESULT OF THE VOLVO ETM PROBLEM THAT IS KNOWN TO EXIST.  THIS INCIDENT IS A REAL CONCERN TO ME AS VOLVO MARKETING IS KNOWN TO MENTION \"SAFETY\" AT EVERY TURN.  THIS IS NOT A GOOD SITUATION AND THIS COULD CAUSE SEVERE ACCIDENTS IN THE FUTURE.  THIS PROBLEM FIX SHOULD GO BEYOND THE 10 YEAR 200,000 MILE THAT VOLVO HAS INITIATED.  THIS SHOULD BE A LONG TERM RECALL. *TR",
        "vin": "YV1SW53D812"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/06/2010",
        "dateOfIncident": "04/02/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329116,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPUTER REPROGRAMMED 2 YEARS AGO AND CAR IS NOW \"SURGING\" FORCEFULLY WHEN ATTEMPTING TO STOP . ELECTRONIC THROTTLE MODULE (ETM)  IDENTIFIED AS CAUSE . VOLVO REFUSES TO COVER UNDER CONDITIONS OF RECALL WHICH REQUIRES REPLACEMENT OF ETM . REASON FOR REFUSAL , MY CAR WAS FOUND TO BE A \" SALVAGE VEHICLE\" .  IN LIGHT OF SAFETY ISSUES ARE THEY REQUIRED TO HELP ME ? *TR",
        "vin": "YV1SW58D711"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "03/27/2010",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322746,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVE ABOUT 45 MPH ON A BUSY ROAD AND SUDDENLY MY CAR LOST ACCELERATION AND CHECK ENGINE LIGHT CAME ON AND DASH BOARD SHOWING \"PERFORMANCE REDUCED\". IT RECREATED A UNSAFE SITUATION AND I HAD TO TURN THE EMERGENCY LIGHT ON AND SLOWLY PULLED OF TO THE SIDE OF THE ROAD. IT HAS OCCURRED TWICE NOW.  NEXT BUSINESS DAY I TOOK THE CAR TO A VOLVO DEALER AND I PERFORMED A SOFTWARE UPGRADE ON THE ETM. BUT I DON'T THINK THAT WILL SOLVE THE PROBLEM, IT ONLY LESSEN THE SENSITIVITY OF THE ETM TO MASK THE PROBLEM, SOONER OF LATER, THIS \"PERFORMANCE REDUCED\" WILL COME BACK AGAIN  AND AN UNSAFE SITUATION COULD BE MORE DANGEROUS DEPENDING ON THE WHERE AND THE DRIVING CONDITIONS.  *CN",
        "vin": "YV1SW53D211"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/10/2009",
        "dateOfIncident": "11/18/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295229,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "A STRONG GAS SMELL FROM THE BOTTOM OF THE CAR INDICATING GAS LEAK FROM EITHER A FAULTY FUEL PUMP OF CRACKED GAS TANK. *TR",
        "vin": "YV1SW61R412"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/19/2009",
        "dateOfIncident": "02/10/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10288962,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "01 VOLVO V70 WGN : TRANS BEGINS BANGING IN DOWNSHIFT IN '07. COMES AND GOES UNTIL MID '09 WHEN HAD TRANS \"FIXED\" BY TRANS SHOP. (SOLENOIDS VALVES REPLACED) STILL BANGING ,BUT MUCH LESS PRONOUNCED. ALSO NO DELAYED SHIFTS GOING FORWARD AS PRIOR TO FIX. CHECK ENGINE LIGHT  JUST CAME ON,SO THE JOURNEY CONTINUES(OR DOESN'T) WITH 01 VOLVO TRANS. GOT THE FEELING THIS SHOULD BE A RECALL ITEM.CLASS ACTION ANYONE? *TR",
        "vin": "YV1SW58DX11"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/11/2009",
        "dateOfIncident": "02/14/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10280143,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION ON 2001 VOLVO V70 T5 IS TRIGGERING CHECK ENGINE WARNING LIGHT ON DASH. NO SIGNIFICANT PERFORMANCE PROBLEMS AS YET BUT WILL LIKELY BE UNABLE TO PASS MY NEXT EMISSION TEST DUE TO THE CHECK ENGINE WARNING LIGHT. NEED TO KNOW HOW TO SOLVE THIS WITHOUT REPLACING THE TRANSMISSION. *TR",
        "vin": "YV1SW53D712"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/19/2009",
        "dateOfIncident": "11/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262455,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 VOLVO V70T HAS BEEN LUNGING FORWARD DURING LOW-SPEED DRIVING MANEUVERS AND HAS HAD VEHICLE HESITATION UPON ACCELERATION.  THE DEALERSHIP, NALLEY VOLVO IN ATLANTA  HAS HAD MY CAR FOR ALMOST A MONTH.  VOLVO WAS INVOLVED IN A LAWSUIT WHICH LED TO A RECALL .RECALL CAMPAIGN NUMBER:06V441000.  MY CAR RECEIVED THE SOFTWARE UPGRADE A FEW YEARS AGO BUT MY SYMPTOMS ARE EXACTLY WHAT THE RECALL WAS FOR.  VOLVO AND DEALER SHIP SAID UNTIL THEY RECEIVE A HARD CODE THEY WONT DO ANYTHING EXCEPT REPLACE TRANSMISSION OR TRADE IN MY CAR FOR NEW ONE. UPON RESEARCH I FOUND MANY OTHERS HAVING THE SAME ISSUE EVEN CAR GOING INTO LIMP MODE AND ALSO HAD THE SOFTWARE UPDATE.   I SHOULDN'T HAVE TO WAIT UNTIL MY CAR GOES INTO LIMP MODE WHILE TRAVELING ON THE INTERSTATE FOR VOLVO TO FIX THIS DEFECT. *TR",
        "vin": "YV1SW58D411"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "03/07/2009",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10261270,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70.  WHEN THE CONTACT OPENED THE SUNROOF IN HER VEHICLE, A METAL BAR CRASHED DOWN ON HER HEAD.  SHE SUSTAINED MINOR INJURIES AND A SLIGHT LACERATION TO HER HEAD.  THE DEALER STATED THAT THEY COULD NOT ASSIST BECAUSE THERE WERE NO RECALLS AVAILABLE.  NO REPAIRS HAVE BEEN MADE TO THE VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE LESS THAN 115,636.      UPDATED 04-24-09 *BF  UPDATED 04/27/09.*JB",
        "vin": "YV1SW53D812"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "09/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261324,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO V70 2001 HESITATING TO CHANGE GEAR, PROBLEM  OCCURS MORE FREQUENTLY DURING SLOW COMMUTE AT APROX. 20-40 MILES/HR.  ONE DAY DRIVING THROUGH I-285 IN ATLANTA, GA CAR SUDDENLY STOPPED. THANK GOD I WAS AT AN EXIT AREA AND WAS ABLE TO SLIDE CAR TO A NON TRAFFIC AREA. CAR WAS ABLE TO START ENGINE AGAIN APROX. WITHIN 5-10 MINUTES. CAR PROBLEM WAS REPORTED TO NORTH POINT VOLVO, ALPHARETTA, GA. THE CAR HAD A \"SENSOR PROBLEM\" AND WAS \"CORRECTED\", PER THE DEALER..  TODAY CAR IS STILL HAVING PROBLEMS - HESITANT TO CHANGE GEAR. I AM WORRIED IT WILL TURN OFF AGAIN ONE DAY.   RESEARCHING IN THE INTERNET FOUND A LOT OF PEOPLE WITH SAME PROBLEMS. VOLVO COMPANY SHOULD BE INVESTIGATED. *TR",
        "vin": "YV1SW58D511"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/02/2009",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260397,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SIBLING FILING COMPLAINT FOR FATHER (MY EMAIL HIS NAME AND ADDRESS LISTED). HEATED SEAT ELECTRICAL WIRE BURNT HOLE THROUGH LEATHER UPHOLSTERY. INSTRUCTED TO REMOVE FUSE FOR HEATED SEATS. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/24/2008",
        "dateOfIncident": "11/24/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249644,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION BEGAN SLIPPING AT ABOUT 80,000 MILES.  REPLACED TRANSMISSION LAST YEAR, NOW JERKS AT 3RD GEAR.  92,000 MILES. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/19/2008",
        "dateOfIncident": "11/19/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249320,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 VOLVO V70 AND I WAS DRIVING SOUTH ON I-95 WHEN THE CAR FAILED TO ACCELERATE, JUST WENT LIMB, I TRIED TO ACCELERATE AND NOTHING HAPPENED, THE CAR BEHIND ALMOST HIT ME AND THE SAME WITH THE 2 BEHIND HIM. THIS IS THE SECOND TIME SOMETHING LIKE THIS HAPPEN, THAT ME ALONG WITH MY FAMILY ARE EXPOSED TO SUCH A DANGER. THE FIRST TIME I CHECKED THE RECALLS AND TOOK IT TO THE DEALER WHERE THEY SUPPOSEDLY FIXED WHAT WAS WRONG, 8 MONTHS AFTER THE MENTIONED REPAIR THE CAR IS DOING THE SAME BUT NOW WITH WORSE CONSEQUENCES BECAUSE NOW I AM SO AFRAID TO DRIVE THAT JUST THINKING ABOUT IT MAKES ME TREMBLE. THE VOLVO DEALER DO NOT WANT TO BE RESPONSIBLE AND DOT SAYS THAT JUST WHEN BIG ACCIDENTS HAPPEN THEY CAN DO SOMETHING. I WONDERED IF MY FAMILY WOULD BE DEAD RIGHT NOW, WHO WOULD BE FILING THIS COMPLAINT?..IT IS JUST NOT ACCEPTABLE THAT A DEALERSHIP OR THE DOT FAIL TO ACT WOULD COST NOT JUST MINE, BUT ANY FAMILY THEIR LIVES. M *TR",
        "vin": "YV1SW61R112"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2008",
        "dateOfIncident": "10/20/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246753,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION OF MY CAR MAKES MY CAR LURCH FORWARD WHEN GOING BETWEEN GEARS.  THE RPMS REV UP AND THEN THE GEAR GRABS, SENDING MY CAR FORWARD IN A GIANT LURCH.  AFTER ALMOST HITTING CARS IN FRONT OF ME SEVERAL TIMES, I NOW MAKE SURE TO KEEP EXTRA DISTANCE BETWEEN MYSELF AND THE CAR IN FRONT OF ME.  AFTER HAVING THE \"TRANSMISSION NEEDS MAINTENANCE\" AND ENGINE CHECK LIGHTS COME ON, THE DEALER HAS DIAGNOSED A PROBLEM WITH THE ELECTRONIC SYSTEM THAT CONTROLS THE TRANSMISSION. I AM HAVING THIS REPLACED FOR $500.00.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "10/13/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245380,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION SLIPS WHEN SHIFTING FROM 1ST TO 2ND AND 2ND TO 3RD.  THIS PRESENTS A SERIOUS HAZARD FOR COLLISIONS FROM THE SIDE AND REAR BECAUSE THE CAR DOES NOT ACCELERATE FROM A STOP OR WHEN CROSSING A STREET.  *TR",
        "vin": "YV1SW53D112"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/06/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237225,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION AND RADIATOR ON MY 2001 VOLVO V70 FAILED AND HAD TO BE REPLACED.  I DID QUITE A BIT OF RESEARCH ON 2001 VOLVO V70 AND FOUND THAT MANY OF THIS PARTICULAR MAKE AND MODEL HAVE TRANSMISSION FAILURE.  IN MY PARTICULAR CASE, THE TRANSMISSION GAVE ME \"PROBLEMS\" SEVERAL MONTHS PRIOR TO NEEDING TO BE REPLACED.  I BROUGHT THE VEHICLE TO THE DEALERSHIP ON THREE SEPARATE OCCASIONS TO HAVE IT LOOKED AT.  EACH TIME THE REPAIRS MADE NO DIFFERENCE.  ON MY FINAL ATTEMPT TO HAVE THE PROBLEM RESOLVED (AFTER THE WARRANTY HAD EXPIRED) I WAS TOLD THE TRANSMISSION AND RADIATOR NEEDED TO BE REPLACED.  *TR  THE CONSUMER STATED THE TRANSMISSION WOULD HESITATE WHEN SHIFTING GEARS. THE CONSUMER STATED SHE IS ON HER 3RD TRANSMISSION. UPDATED 08/26/08. *JB",
        "vin": "YV1SW53D312"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/20/2008",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231699,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2001 V70 T5 VOLVO WAGON. WE BOUGHT THE CAR NEW, AND WHEN IT WAS ABOUT 1 YEAR OLD THE RECEPTACLE OF THE SAFETY BELT WHICH LATCHED IN MY SON'S CAR SEAT CRACKED STRAIGHT DOWN THE MIDDLE. I ONLY DISCOVERED IT WHEN I WAS CHECKING THE BASE OF HIS INFANT CAR SEAT TO MAKE SURE IT WAS STILL TIGHT. VOLVO REPAIRED THE RECEPTACLE FOR FREE, AS THE CAR WAS UNDER WARRANTY. THE CAR IS NOW SEVEN YEARS OLD, AND IT HAS HAPPENED AGAIN, WITH A DIFFERENT SEAT BELT RECEPTACLE, ALSO IN THE BACK SEAT. THERE SEEMS TO ME TO BE SOMETHING FUNDAMENTALLY WRONG ABOUT SEAT BELT RECEPTACLES SPLITTING IN HALF FROM ROUTINE USE. THAT IT HAS HAPPENED TWICE IN THIS SEVEN YEAR OLD CAR STRIKES ME AS SUSPICIOUS. THANK YOU FOR YOUR CONCERN.  *TR",
        "vin": "YV1SW53D212"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/20/2008",
        "dateOfIncident": "10/02/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225175,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG FUEL ODOR AT THE REAR OF THE VEHICLE.  THREE DEALER VISITS, A NEW FUEL PUMP AND $800 LATER IT IS FIXED.  I HAVE READ NUMEROUS COMPLAINTS ON THIS ISSUE.  IT CONCERNS ME GREATLY, AS I BOUGHT THE CAR WITH SAFETY IN MIND, YET THIS MATTER HAS NEVER BEEN ADDRESSED ACROSS THE BOARD BY VOLVO.  *TR",
        "vin": "YV1SW61R012"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2008",
        "dateOfIncident": "04/05/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10223746,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70.  WHILE DRIVING 30 MPH, RADIATOR FLUID SATURATED THE DRIVER SIDE FLOORBOARD UNDERNEATH THE ACCELERATOR PEDAL.  THE DEALER STATED THAT THE SEALS OR HEATER CORE COULD HAVE CAUSED THE FAILURE.  AS OF APRIL 8, 2008, THE DEALER HAD NOT REPAIRED THE VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE 86,000.",
        "vin": "YV1SW53D311"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2008",
        "dateOfIncident": "01/29/2008",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216392,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SMELL AT THE REAR OF THE CAR.  VOLVO DEALERSHIP JUST CALLED AND SAID THAT THE PROBLEM IS A BAD FUEL PUMP.  COST IS $876.77+TAX  TO REPLACE IT.  THIS SEAMS TO BE A COMMON COMPLAINT FOR THE 2001 V70 CARS.  A RECALL WAS ISSUED JUST FOR NV AND AZ HOWEVER, THIS SHOULD BE EXTENDED TO ALL OWNERS OF THESE VEHICLES.  IT IS A SAFETY ISSUE ESPECIALLY THOSE OF US THAT HAVE SMALL CHILDREN.  THAT IS WHY WE PURCHASE VOLVOS IS FOR THE PROVEN RECORD OF THE SAFETY OF THE CAR.  PLEASE CONSIDER ISSUEING A SAFETY RECALL TO REPLACE THE FUEL PUMP.  *CN",
        "vin": "YV1SW53D212"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2007",
        "dateOfIncident": "11/30/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211973,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A STRONG FUEL SMELL AND DROPS OF GAS ON THE FLOOR, I TOOK THE CAR TO MY MECHANIC HE SAID IT WAS A FUEL LEAK IN THE FUEL PUMP.  THE FUEL PUMP ASSEMBLY AND SENDING UNIT HAD TO BE REPLACED WITH NEW ONES.  *TR",
        "vin": "YV1SW53D412"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2007",
        "dateOfIncident": "12/03/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210659,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF A 2001 VOLVO V70 STATION WAGON WITH 88,000 MILES ON IT.  IT HAS RECEIVED ITS REGULARLY SCHEDULED SERVICING. I HAVE BROUGHT THIS VEHICLE BACK TO THE DEALER NUMEROUS TIMES, ONCE WHILE UNDER AN EXTENDED WARRANTY AND NOW WHILE IT IS NO LONGER UNDER EXTENDED WARRANTY SERVICE. THE REASON WAS TO  HAVE THEM CHECK AND REPAIR THE SLIPPING TRANSMISSION. THE SLIP OCCURS BETWEEN 1ST & 2ND, AND 2ND & 3RD. THIS IS ABOUT THE 20-40MPH RANGE. WHEN IT SLIPS, THE TRAN SOMETIMES REVS UP TO 4,000 AND THE ENGINE JUST REVS UP FOR A FEW SECONDS, (IN A STALLING-LIKE FASHION) THEN THE TRANSMISSION GRABS WITH A HARD SLAM/AUDIBLE CLUNKING NOISE. I HAVE TOLD THE DEALER THAT THIS IS VERY DANGEROUS AS IT LEAVES YOU IN AN \"OUT-OF-CONTROL\" STATE. THEY DEALER CAN FIND NO CODES ON THE TRANSMISSION TO DOCUMENT THE PROBLEM, BUT DOES AGREE THAT THE SLIPPAGE OCCURS.  THEY HAVE DONE S/W UPDATES TO MAKE IT SHIFT BETTER. WE JUST SPENT $1500.00 ON MAKING THE PROBLEM GO AWAY, BUT YET IT IS STILL THERE. THE TRANSMISSION HAS BEEN SLIPPING SINCE BEFORE THE LAST EXTENDED WARRANTY SERVICING, BUT HAS RECENTLY BECOME VERY MUCH ESCALATED SINCE EVEN COMING OUT OF SERVICE.  I DON'T KNOW HOW THEY COULD EVEN HAVE SENT US HOME IN THIS CAR WITH MY FAMILY IN IT.  IT IMMEDIATELY WENT BACK FOR REPAIR THE NEXT DAY AFTER THE $1500 SERVICING.   NO ACCIDENTS YET, BUT I FEAR DRIVING IT AT ALL, SINCE THE SLIP COULD RESULT IN TOTAL LOSS OF POWER TO THE WHEELS WHILE THE AUTOMATIC TRANSMISSION SHIFTS FROM 1ST TO 2ND GEAR. I HAVE TOLD THE SERVICE TECHNICIANS AT VOLVO OF THIS CONCERN, BUT THEY HAVE NOT RESOLVED THE PROBLEM.  THEIR ADVICE IS TO PURCHASE A NEW CAR ON TRADE-IN OR SPEND $5,000 ON A NEW TRANSMISSION.  THIS SHOULD NOT BE HAPPENING TO A CAR DRIVING ONLY ON CITY STREETS FOR LESS THAN 45 MINUTES AT A TIME AND AT ONLY 88,000 MILES.  I FIRMLY BELIEVE THE PROBLEM IS A POTENTIALLY DEADLY ONE IN THAT IT COULD HAPPEN TO ANYONE AT ANYTIME AND ANYWHERE IN STOP AND GO TRAFFIC.  *TR",
        "vin": "YV1SW53D211"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2007",
        "dateOfIncident": "11/20/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209635,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70 T5  (1) RECOGNIZED STRONG SMELL OF GASOLINE IN GARAGE OVER PERIOD OF 2-3 DAYS.  I INSPECTED THE VEHICLE AFTER A SHORT DRIVE (5-6 MILES) AND DISCOVERED GASOLINE LEAKING FROM THE GAS TANK AREA, STAINING THE BOTTOM OF THE TANK AND DRIPPING ONTO THE GROUND.    (2) VEHICLE REPRESENTED A SAFETY AND HEALTH HAZARD DUE TO THE LEAKING FUEL.    (3) VEHICLE WAS IMMEDIATELY TOWED TO A LOCAL VOLVO DEALER SERVICE CENTER AND DIAGNOSED WITH A \"CRACK IN TOP OF FUEL PUMP.\"  THE DEALERSHIP \"REPLACED FAULTY FUEL PUMP (58R) OBSERVING NO FURTHER LEAKS AT THIS TIME\" AT OWNER'S EXPENSE.    NOTE: FURTHER INVESTIGATION BY THE OWNER REVEALED VOLVO RECALL NO. R176 (NHTSA RECALL # 07V152000) DISCOVERED FAULTY FUEL PUMPS OF THE SAME TYPE AND MANUFACTURE ON 2001-02 VOLVO S60 SEDANS SOLD OR REGISTERED IN ARIZONA AND NEVADA.    THIS IS OBVIOUSLY A DEFECTIVE FUEL PUMP, POSES A THREAT TO PERSONAL AND PUBLIC SAFETY AND I BELIEVE VOLVO SHOULD ACCEPT RESPONSIBILITY FOR REPLACING THESE FUEL PUMPS FREE OF CHARGE TO VEHICLE OWNERS AND/OR REIMBURSING REPLACEMENT EXPENSES.  *TR",
        "vin": "YV1SW53D512"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209230,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 VOLVO V70.  THE FUEL PUMP HAS STARTED TO LEAK CAUSING A FUEL SMELL AND DIFFICULTY IN STARTING.  VOLVO WILL APPARENTLY NOT ACKNOWLEDGE THIS PROBLEM.  *TR",
        "vin": "YV1SW61R812"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/28/2007",
        "dateOfIncident": "09/28/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207110,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BEGAN TO LEAK FUEL FROM TOP OF FUEL TANK NEAR EXHAUST.  INVESTIGATION DETERMINED THE FUEL PUMP ASSEMBLY DEVELOPED A CRACK NEAR FUEL LINE CONNECTION, CAUSING FUEL LEAKAGE WHEN SYSTEM PRESSURIZED DURING OPERATION.  DEALER REPLACED ENTIRE FUEL PUMP ASSEMBLY.  *TR",
        "vin": "YV1SW61RX12"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2007",
        "dateOfIncident": "09/21/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206891,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) STRONG GASOLINE ODOR COMING FROM THE CAR.  TOOK VEHICLE TO VOLVO DEALER WHO CLAIMED THEY COULD NOT DISCERN ANY ODOR NOR FIND ANY GAS LEAK (THEY DID CHARGE A $95 DIAGNOSTICS CHARGE FOR THE GAS ODOR, AND DID MANAGE TO \"FIND\" MULTIPLE OTHER SERVICE \"REQUIREMENTS\" DURING THIS VISIT).  PICKED UP CAR AND RETURNED HOME WITH GASOLINE SMELL STILL APPARENT.  (2) THE FOLLOWING DAY THE SMELL WAS SO BAD THAT THE VEHICLE WAS BARELY DRIVABLE, AND I WAS CONCERNED ABOUT THE SAFETY HAZARD CREATED BY OBVIOUSLY UNCONTAINED FUEL .  TOOK THE VEHICLE TO LOCAL SERVICE STATION WHO CONFIRMED THE STRONG ODOR AND INVESTIGATED.  (3) PROBLEM WAS ISOLATED TO A BROKEN GAS LINE INTERNAL TO THE FUEL PUMP BY THE GAS TANK.  FUEL PUMP WAS REPLACED AND THE PROBLEM WAS RESOLVED.  *TR",
        "vin": "YV1SW61R112"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/12/2007",
        "dateOfIncident": "09/26/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205516,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70.  WHILE DRIVING 10 MPH, THE VEHICLE BEGAN TO SURGE WITHOUT WARNING.  THE CONTACT TOOK THE VEHICLE TO AN INDEPENDENT VOLVO SHOP AND THEY STATED THAT THERE WAS AN ETM CODE OF ECM91A7.  THEY ADVISED HIM TO TAKE THE VEHICLE TO AN AUTHORIZED VOLVO DEALER BECAUSE OF NHTSA CAMPAIGN ID NUMBER 06V441000 (VEHICLE SPEED CONTROL).  THE CONTACT TOOK THE VEHICLE TO POWER VOLVO AND THEY PERFORMED A DIAGNOSTIC, WHICH CONFIRMED THAT THERE WAS AN ETM FAILURE.  VOLVO NORTH AMERICA HAS NOT GIVEN THEIR CONSENT TO THE DEALER TO PERFORM THE RECALL REPAIR.  THE CONTACT SPOKE WITH VOLVO AND THEY STATED THAT THE PREVIOUS OWNER ALREADY HAD THE RECALL WORK PERFORMED.  THE CONTACT STATED THAT THERE IS A WARRANTY ON THE PART FOR 200,000 MILES/TEN YEARS AND VOLVO AGREED.  THE CURRENT AND FAILURE MILEAGES WERE 84,917.",
        "vin": "YV1SW53D612"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/09/2007",
        "dateOfIncident": "10/09/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205265,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 VOLVO V70 T5 AND HAD AN INDEPENDENT VOLVO SHOP BRING UP CODE ECM 91A7 WHICH IS AN ( ETM ) RECALL AND WARRANTY ISSUE . (CARB) HAS INCREASED AN ADDITIONAL 10 YEARS AND OR 200,000. WARRANTY ON THE ETM. MY INDEPENDENT SHOP ERASED THE CODE BUT KEPT A PRINT OUT OF THE FAILURE. POWER VOLVO IN CERRITOS CALIFORNIA OWN MECHANIC AND SERVICE MANAGER AGREE THAT THE ETM IS EXHIBITING ALL THE ISSUES WITH THE ETM CONCERNS. NORTH AMERICAN  VOLVO CAN'T WARRANTY THE MODULE UNTIL IT SHOWS A CODE FOR THE ETM. THEY WANT ME TO DRIVE IT UNTIL IT SHOWS THE CODE AGAIN. I DO NOT WANT TO DRIVE IT SINCE NHTSA WROTE THAT IN CERTAIN TRAFFIC SITUATIONS , THIS CONDITION COULD CAUSE AN UNSAFE SITUATION AND POSSIBLY A CRASH.  *JB",
        "vin": "YV1SW53D612"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2007",
        "dateOfIncident": "09/14/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204393,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 VOLVO V70.  THE CONTACT STATED THAT FUEL LEAKED FROM THE VEHICLE ONTO THE GARAGE FLOOR.  THE MECHANIC STATED THAT THE FUEL SENDING UNIT CRACKED AND CAUSED THE LEAK.  THE UNIT WAS REPLACED.  THE DEALER WAS NOT NOTIFIED.  THE CURRENT AND FAILURE MILEAGES WERE 91,000.",
        "vin": "YV1SW61R912"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2007",
        "dateOfIncident": "06/07/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200942,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION WARNING LIGHT APPEARED.  BROUGHT TO DEALER AND THE 'UPDATED' THE SOFTWARE WHICH WAS NOT COVERED BY MY WARRANTY.  CAR NOW JERKS INTO GEAR.  WARRANTY NOW EXPIRED, AND DEALER SAYS THE TRANSMISSION IS 'GOING OUT AND TIME TO TRADE UP' (BUY A NEW VOLVO) *JB",
        "vin": "YV1SW58D712"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/11/2007",
        "dateOfIncident": "06/27/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10196063,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ROAD: 2 LANES EACH WAY, WIDE MEDIAN, PAVED SHOULDERS WHICH ROLLED OFF INTO A DRAINAGE DITCH, 60 MPH LIMIT WITH STO PLIGHTS. WHILE IN LEFT  BEGAN TO PASS VEHICLE2 [SUV] IN RIGHT LANE. VEHICLE 2  MOVED INTO LEFT LANE FORCING ME ONTO SHOULDER. WHILE ON SHOULDER AND ATTEMPTING TO REENTER LANE AFTER COMPLETING PASS BEGAN TO LOSE CONTROL OF CAR. THAT WAS THE LAST MEMORY OF THE EVENTS LEADING UP TO THE ACCIDENT. AT THIS POINT, I BELIEVE THAT THE DRIVER'S AIRBAG DEPLOYED PREMATURELY. IT KNOCKED ME UNCOUNCIOUS, PREVENTING ME FROM TRYING TO CONTROL THE CAR. THE CAR ENDED UP CROSSING THE ROAD TO THE RIGHT SHOULDER. IT LEFT THE ROADWAY AT 20-30 DEGREE ANGLE. IT WENT DOWN INTO A DITCH, AND ROLLED UP A BANK 2-3 TIMES. IT CAME TO REST ON THE DRIVER'S SIDE. THE UPPER PASSENGER SIDE WAS CRUSHED, AND THE CAR  WAS TOTALED. THE ROOF OF THE CAR WAS CUT SO THAT I COULD GET OUT RATHER THAN CRAWL THROUGH THE WINDSHIELD. THE SIDE IMPACT AIRBAGS DID NOT DEPLOY IN THE ROLLOVER. THE PASSENGER AIRBAG DID DEPLOY. MY SHOULDER/SEAT BELT WAS ON. *AK     I WAS EXTREMELY FORTUNATE  TO ONLY HAVE MINOR INJURIES.     HOW CAN I INDISPUTABLY DETERMINE WHEN THE AIRBAG DEPLOYED? IS THERE A DATA RECORDER? DO I NEED TO HIRE AN ACCIDENT INVESTIGATOR?",
        "vin": "YV1SW53DX12"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2007",
        "dateOfIncident": "01/30/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195988,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BEGINNING JANUARY 2007, OUR 2001 V70 WOULD \"SHIFT HARD\" WHEN SHIFTING FROM \"P\" TO \"D\" OR FROM \"R\" TO \"D\" OR WHEN ACCELERATING FROM A LOW SPEED.  WE THOUGHT IT WAS THE WEATHER CAUSING THE ISSUE DUE TO IT BEING INTERMITTENT.  IT BECAME WORSE AND SHIFT BECAME HARDER.  APPT IN APRIL CONCLUDED IT \"MAY BE\" THE TCM.  SOFTWARE WAS UPGRADED AND WE WERE TOLD THERE WOULD BE AN \"ADJUSTMENT\" PERIOD.  ALL UNDER WARRANTY.  TOOK A WEEK TO FIX WHAT WAS NOTED AS ONLY NEEDING 30 MINUTES TO FIX.  END OF JUNE, CALLED TO STATE SAME THING IS HAPPENING THAT THE ISSUE WASN'T FIXED.  VOLVO CHECKED WARRANTY AND CONTRACT ENDED JUST THREE WEEKS PRIOR.  JULY 10, TOOK V70 IN FOR \"DIAGNOSTIC\" AND WE NEED A \"NEW TRANSMISSION\".  VOLVO WILL NOT TAKE RESPONSIBILITY NOR SEE THE PROBLEM AS PRE-EXISTING. NOR WILL THEY SEE THE ISSUE AS UNRESOLVED FROM THE INITIAL VISIT.  NO DIAGNOSTIC APPARENTLY DONE THE FIRST TIME.  COINCIDENTALLY DEALER REPORTED THERE WERE MORE ISSUES WITH THE CAR SUCH AS SUSPENSION WHICH WAS FIXED JUST RECENTLY.  WE HAD PUT NO MORE THAN A FEW HUNDRED MILES ON THE CAR SINCE THE LAST VISIT AND ALL OF THESE ISSUES ARE JUST APPEARING, COINCIDENTALLY AFTER WARRANTY EXPIRED.  THERE WERE NO ISSUES LESS THAN 60 DAYS AGO, AT LEAST NONE REPORTED TO US.  THIS INCIDENT HAS HAPPENED TO OTHER CONSUMERS AT THE SAME DEALERSHIP.  VOLVO IS NOT COOPERATIVE AND WE HAD CAUGHT THE MECHANICS IN DECEITFUL STATEMENTS BY \"REMINDING\" THEM THAT WAS ALREADY DEALT WITH...FUNNY HOW IT WAS NO LONGER SOMETHING THAT NEEDED TO BE FIXED.  THE \"NEW TRANSMISSION\" IS STILL NEEDED APPARENTLY AFTER A TOTAL OF ONLY 80K MILES ON THE CAR.  IT WAS AT ABOUT 42K WHEN WE BOUGHT IT IN DEC OF 2003.  *TR",
        "vin": "YV1SW53D912"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/13/2007",
        "dateOfIncident": "06/11/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193103,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 V70 HEADLIGHT BULB SOCKET ON RUNNING LIGHTS H& BULB BURNED UP.  THIS CAUSED THE HEADLIGHT ON DRIVERS SIDE TO FAIL.",
        "vin": "YV1SW58D711"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/08/2007",
        "dateOfIncident": "06/04/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192801,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CUSTOMER'S SEAT BELT ON A 2001 VOLVO V70 WOULD NOT PULL OUT. THE PLASTIC TRIM PIECE IN THE \"B\" PILLAR WHERE THE SEAT BELT SLIDES THROUGH HAD BROKEN, CAUSING THE BELT TO DOUBLE UP ON RETRACTION AND SEIZE UP. THIS IS A BRITTLE PIECE OF PLASTIC AND BREAKS FAIRLY OFTEN WITH MINOR IMPACTS. THIS WOULD SEEM TO BE A CRITICAL FAULT IN A MAJOR SAFETY DEVICE.",
        "vin": "YV1SW58D012"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/23/2007",
        "dateOfIncident": "03/21/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188673,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 VOLVO V70.  I GOT A MESSAGE THAT THE LEFT HAND TURN SIGNAL BULB WAS OUT. I BOUGHT A NEW BULB TO REPLACE IT, AND IT DID NOT FIX THE PROBLEM. THE DEALER FOUND THAT IT WAS A PROBLEM WITH THE SOCKET, AND SUBSEQUENTLY REPLACED IT. THIS SOLVED THE PROBLEM. MY COMPLAINT IS THAT A RECALL FOR THIS VERY PROBLEM WAS ISSUED FOR VOLVO V70S FROM 1998-2000, (NHTSA CAMPAIGN ID NUMBER :  00V405000 ). IT SEEMS TO ME THAT THIS RECALL SHOULD BE CHANGED TO INCLUDE 2001 MODELS, AS CLEARLY, THE ISSUE WAS NOT RESOLVED WITH THE NEW MODEL YEAR. *JB",
        "vin": "YV1SW58D611"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/13/2007",
        "dateOfIncident": "09/10/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187757,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON I-25 AT 65 MPH THE GLASS SUN OOF EXPLODED AND SHOWERED BOTH OF US WITH SHARDS OF GLASS.  THERE WAS NO WARNING. JUST A LOUD BOOM AND THE GLASS BROKE.  2001 VOLVO STATION WAGON V-70.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/02/2007",
        "dateOfIncident": "01/27/2007",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181406,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTILOCK SYSTEM AND STABILITY TRACKING SYSTEM FAILED ABRUPTLY DURING BREAKING.  NO CRASH OCCURRED, ONLY THE SYSTEM'S WARNING LIGHTS CAME ON AND STAYED ON.  LUCKY I WAS NOT IN A PANIC BREAK POSITION AS THEN THE ABS WOULD NOT HAVE FUNCTIONED.  I HAVE MADE ARRANGEMENTS TO REPAIR THE SYSTEM INDEPENDENT OF THE VOLVO DEALERSHIP SINCE IT IS MUCH CHEAPER AND A MORE EFFECTIVE FIX IS POSSIBLE THAN USING VOLVO PARTS WHICH AFTER WEB SEARCHING IS CLEARLY DEFECTIVE.  SEEMS EVERY VEHICLE WITH THIS SYSTEM IS FAILING AT ABOUT 65 TO 80K MILES.  MY 2001 V70 T5 FAILED AT 70K.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/31/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181629,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER'S 2001 VOLVO V70 IS BEING RECALLED. **CC  THE CONSUMER IS CURRENTLY STATIONED OVERSEAS AND WOULD LIKE TO KNOW HOW TO HAVE THIS RECALL WORK REPAIRED.  *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/05/2006",
        "dateOfIncident": "12/05/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175249,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE SUSPENSION CONTINUED TO FRACTURE AND HAD TO BE REPLACED ONCE EVERY YEAR.  THE SERVICE DEALER DETERMINED A PART WITHIN THE SUSPENSION NEEDED TO BE REPLACED.  THE CONTACT WAS UNSURE OF WHICH PART NEEDED TO BE REPLACED, TO RESOLVE THE ISSUE.",
        "vin": "YV1SW58D012"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/21/2006",
        "dateOfIncident": "11/07/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173960,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70 SURGES WHILE UNDERWAY, SURGES AND STALLS AT IDLE, GOES INTO REDUCED PERFORMANCE MODE (20 MPH OR LESS).  CAR RUNS NORMALLY WHEN COLD (UP TO 1 MILE AFTER STARTING IN MORNING), THEN BEGINS TO SURGE AND FAIL.  NEED TO PULL OVER TO SHOULDER, STOP ENGINE FOR 3 MINUTES, AND RESTART.  IF ENGINE IS STOPPED FOR LESS THAN 3 MINUTES, IT RESTARTS IN 20 MPH MODE.  THIS HAS HAPPENED DAILY FOR 2 WEEKS.  INDEPENDENT MECHANIC REPLACED IGNITION COIL BASED ON OBD CODE, BUT PROBLEM RECURRED THE NEXT DAY.  HAVE APPOINTMENT WITH VOLVO SERVICE DEPARTMENT 11/22/06.  *JB",
        "vin": "YV1SW53D811"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/25/2006",
        "dateOfIncident": "10/19/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171862,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LIFT GATE ELECTRICAL WIRING HARNESS HAS WIRES SEVERED DUE TO THE LIFTGATE HINGE.  THIS PROBLEM RESULTED IN A FAILURE OF THE CENTER REAR MOUNTED BRAKE LIGHT,   A WARNING INDICATOR THAT THE REAR GATE IS AJAR, AND FAILURE OF THE REAR DEFROSTER.  DEALERSHIP MECHANIC INDICATED THAT VEHICLE HINGE CUT THE WIRING HARNESS AND THAT THE ROUTING OF THE WIRING HARNESS AND DESIGN WAS THE CAUSE OF THE PROBLEM.   *NM",
        "vin": "YV1SW53D312"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2006",
        "dateOfIncident": "08/08/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165824,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2001 VOLVO V70 <TURBO> .. AND HAVE HAD REPEATED EXPERIENCES WITH THE VEHICLE EITHER STALLING WHILE IN GEAR AND / OR \"SURGING\" FORWARD WHILE AT A STOP WITH THE BRAKE PEDAL DEPRESSED ...    THE VEHICLE HAS BEEN BROUGHT TO AN AUTHORIZED VOLVO REPAIR SHOP AND TO THE DEALER FOR THESE PROBLEMS A MINIMUM OF 4 TIMES    UPON THE RETURN OF MY VEHICLE TO ME <AFTER HAVING WORK DONE UNDER CAMPAIGN 155> THE VEHICLE EXHIBITED THE SAME PROBLEMS .. THE MOST RECENT EVENT HAVING TAKEN PLACE ON 08.08.06    AT THIS MOST RECENT INCIDENT I HAD MY TWO GRANDDAUGHTERS IN MY VEHICLE AND I BELIEVE THAT THIS EVENT PUT ALL OUR LIVES IN DANGER .. THIS IS DEFINITELY A SAFETY ISSUE / HAZARD !     I <YESTERDAY> PLACED A CALL TO THE DEALERSHIP <BOZZANI VOLVO IN COVINA, CA> ONLY TO BE GIVEN THE \"RUN-AROUND\" FROM JON, TONY, AND GLORIA ...     JON BURNHAM SUGGESTED THAT I LET THEM HAVE MY VEHICLE TO DRIVE UNTIL THE \"PROBLEM\" IS DUPLICATED ..    GLORIA MASTERLY <A SERVICE ADVISOR> SAID I SHOULD NOT TAKE MY CAR TO MY LOCAL VOLVO APPROVED  REPAIR SHOP ... THAT I SHOULD HAVE IT TOWED TO THEM, INSTEAD <WHICH I HAVE ALREADY HAD DONE <HAVING IT TOWED> BOTH THRU ASC AT NO CHARGE ... AND AT MY EXPENSE NUMEROUS TIMES>    TONY RIVAS TOLD ME THAT HE HAD TO MAKE A CALL AND THAT HE WOULD GET BACK TO ME ...     NO ONE GOT BACK TO ME ... NOR HAS ANYONE <AS OF NEARLY 12 NOON, TODAY < RETURNED A CALL TO ME ...    I HAVE BEEN MADE AWARE OF THE EXISTING <AND WELL KNOWN> ISSUES WITH THE MAGNATE MARELLI ETM AND AM APPALLED AT THE DEVIL MAY CARE ATTITUDE THAT VOLVO IS TAKING  TOWARDS THIS WHOLE AFFAIR    I BOUGHT VOLVO <THIS BEING OUR THIRD> BECAUSE OF THEIR REPUTATION FOR SAFETY !    I AM NOW AFRAID TO DRIVE MY CAR ... AND AM RECEIVING NO ASSISTANCE FROM ANY VOLVO ADVISORS OR REPRESENTATIVES    I AM NEARLY 80 YEARS OLD .. AND WOULD HATE TO LOSE WHAT YEARS I DO HAVE LEFT TO AN AVOIDABLE PROBLEM WHICH MAY VERY WELL TAKE MY LIFE <AS WELL AS OTHERS, POSSIBLY>",
        "vin": "YV1SW53D211"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/07/2006",
        "dateOfIncident": "06/02/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164857,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 6/2/06 I WAS DRIVING ON THE FREEWAY ( AT ABOUT 60 MPH), AND SUDDENLY MY CAR SLOWED DOWN AND I COULD NOT ACCELERATE, FORTUNATELY I WAS IN THE RIGHT HAND LANE AND ABLE TO EXIT THE FREEWAY AND SLOWLY MOVE TO THE SIDE OF THE ROAD, A WARNING LIGHT WAS ON STATING\" ENGINE PERFORMANCE REDUCED\".  I TURNED OFF THE IGNITION AND WAITED A FEW MINUTES.  I RESTARTED THE ENGINE AND THE WARNING LIGHT WAS NOT ON, HOWEVER, I WAS VERY CONCERNED AND CALLED THE DEALER AND WAS TOLD TO BRING THE CAR IN. THE CAR WAS A LITTLE HESITANT AT FIRST BUT I WAS ABLE TO DRIVE SLOWLY ON SIDE STREETS, TO THE DEALER.  HE KEPT THE CAR OVERNIGHT AND DIAGNOSED A PROBLEM WITH THE ETM, HE CLEANED THE ETM AND DOWNLOADED NEW SOFTWARE. IT WAS $20 FOR THE PARTS AND $307.00 FOR THE LABOR! I HAVE NOT HAD A RECURRENCE OF THIS PROBLEM WITH THE ETM.   HOWEVER, I HAVE BECOME AWARE OF NUMEROUS COMPLAINTS ABOUT THIS ETM AND SPOKE TO THE SERVICE DEPARTMENT AT MY DEALER, WHO HAD NEVER MENTIONED IT TO ME, AND HAD NEVER OFFERED TO CHECK OR CLEAN THE ETM BEFORE THIS HAPPENED.  HE WAS AWARE OF THE ETM FAILURES.  I ASKED ABOUT THE EXTENDED THE WARRANTY VOLVO HAS PUT IN PLACE ON THE ETM BUT THE DEALER SAYS THAT IS ONLY FOR SERVICE AFTER THE CLEANING IS TRIED ONCE.  THIS MEANS I WILL HAVE TO HAVE ANOTHER DANGEROUS FAILURE OF THE SYSTEM BEFORE THEY WILL REPLACE AND PAY FOR THE SERVICE!  I FEEL THAT VOLVO SHOULD HAVE WARNED THE CAR OWNERS ABOUT THIS POSSIBLE PROBLEM AND SHOULD GIVE THE WARRANTY TO ALL THEIR CARS.  *JB",
        "vin": "YV1SW53D412"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/26/2006",
        "dateOfIncident": "07/04/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163570,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OUR CAR HOME FROM 4TH OF JULY VACATION ON INTERSTATE, CAR SHUT DOWN BY  ITSELF AND COULD ONLY DO ABOUT 7 MPH, WITH A NEAR MISS OF TRAFFIC I WAS TO PULL THE CAR OVER TO THE SHOULDER OF THE ROAD.   THIS SAME PROBLEM HAS HAPPENED 2 ADDITIONAL TIMES UNTIL WE DECIDED TO NOT DRIVE THE CAR AT ALL DUE OUR CONCERN FOR GETTING INTO A ACCIDENT.  THE LOCAL DEALERSHIP COULD NOT SEE US FOR 3 WEEKS WE WERE TOLD, THE CAR WAS TOWED TO THE DEALERSHIP AND WE ARE STILL WAITING TO FIND OUT WHAT THEY WILL TELL US.  *NM",
        "vin": "YV1SW53D812"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2006",
        "dateOfIncident": "06/27/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162239,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SIDE WHEEL BROKE OFF AS A RESULT OF BALL JOINT BREAKING LEADING TO AN AXLE BREAK. ALSO DAMAGED WERE BUMPER AND FENDER WHEN HIT BY THE WHEEL BREAKING OFF.   MY WIFE WAS LEAVING O'HARE AIRPORT AT AROUND 9:00 PM ON 6/27/06. WHEN CRUISING AT 20-30 MPH SHE HEARD A CRACKING NOISE AND THEN SUDDENLY THE CAR TURNED RIGHT. SHE STEPPED ON A BRAKE PEDAL TRYING NOT TO HIT CARS ON THE NEXT LINE. WHEN SHE STOPPED AND GET OUT OF THE CAR SHE REALIZED THAT THE FRONT PASSENGER SIDE WHEEL CAME OFF. IT WAS KEPT IN PLACE JUST BY THE SHOCK ABSORBER. SHE AND MY TWO SONS (AGE 3 AND 6) SPENT NEARLY TWO HOURS ON A HIGHWAY WAITING FOR A TOW TRUCK TO COME.   THE CAR HAS 5 YEARS AND 98,500 MILES ON IT. THE FRONT SUSPENSION WAS ALREADY REPAIRED TWICE. ONCE 2 YEARS AGO AND THEN HALF A YEAR AFTER THAT. BEFORE THE ACCIDENT DESCRIBED ABOVE THERE WERE NO SIGNALS/NOISES THAT WOULD INDICATE ANY PROBLEMS WITH NEITHER THE WHEEL NOR THE SUSPENSION. THE CAR WAS ALWAYS DRIVEN ON NORMAL STREETS AND HIGHWAYS. NO OFF ROAD ADVENTURES OR REALLY BAD ROADS.  I HAD MANY CARS IN MY LIFE BUT I'VE NEVER HAD SUCH A PROBLEM BEFORE. HOW CAN VOLVO CLAIM THAT THEY MAKE RELIABLE AND SAFE CARS WHEN SOMETHING LIKE THAT HAPPENS?  I SENT AN E-MAIL TO VOLVO CUSTOMER SERVICE BUT HAVE NOT HEARD BACK FROM THEM. NOW I HAVE TO PAY OVER $2,500 IN REPAIR FEES ($1000 TO REPAIR BROKEN BALL JOINT AND AXLE PLUS ADDITIONAL $1500 TO REPAIR BUMPER AND FENDER). I DO HAVE AN EXTENDED WARRANTY BUT, SURPRISE SURPRISE, THEY SAID THEY CAN ONLY COVER THE COST OF REPAIRING THE BALL JOINT. EVERYTHING ELSE, EVEN THOUGH IT WAS DAMAGED BECAUSE OF THE BALL JOINT, THEY WOULD NOT COVER. AND, OF COURSE, THE COST OF REPLACING THE BALL JOINT IS LESS THAN MY DEDUCTIBLE SO ... THEY WASHED THEIR HANDS.  *JB",
        "vin": "YV1SW53D611"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/24/2006",
        "dateOfIncident": "05/20/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158206,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR ON SATURDAY MORNING WHEN SUDDENLY WITH NO WARNING THE ENGINE WENT INTO \"LIMP HOME\" MODE.  I WAS ABLE TO GET TO A VOLVO DEALER, WHO TOOK THE CAR IN, DOWN LOADED A SOFTWARE PATCH FOR THE THROTTLE COMPUTER AND RETURNED THE CAR TO ME.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/22/2006",
        "dateOfIncident": "05/21/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157996,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SURGING, MISSING, SKIPPING WHILE IDLING IN GEAR.  IT MAY SURGE, MISS, SKIP WHILE OUT OF GEAR, BUT IT IS HARD TO DETECT.  I HAVE HAD THE ETM SOFTWARE UPDATE AND THEN THEY CLEANED IT.  THE DEALER DOES NOT KNOW WHAT TO DO WITH IT NOW AND IT IS STILL HAPPENING.  THEY HAVE NOT YET DONE THE VOLVO CAMPAIGN TO REPLACE FAULTY ETM'S BECAUSE THE GUIDELINES ARE STRICT.  (SOMEONE HAS TO DIE FIRST, THEN THEY WILL REPLACE IT)  THIS HAS BEEN GOING ON FOR OVER THREE MONTHS NOW.  *JB",
        "vin": "YV1SW58D912"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/07/2006",
        "dateOfIncident": "05/04/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156942,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE WAY TO AN APPOINTMENT MY WIFE WAS DRIVING OUR VOLVO V70 T5 ON A MAJOR HIGHWAY WHEN SUDDENLY THE CAR LOST POWER AND A MESSAGE STATING \"PERFORMANCE REDUCTION\" WAS VISIBLE ON THE CONSOLE. THE CAR FELT LIKE IT WAS ABOUT TO STALL AT ANY MINUTE AND WAS ONLY ABLE TO BE DRIVEN AT 20 MPH. SHE WAS ABLE TO PULL THE CAR OVER TO THE HARD SHOULDER BUT AS SHE WAS ABOUT TO ENTER A SECTION WHERE ROAD WORKS HAD REMOVED ANY HARD SHOULDER SHE DECIDED TO STOP AND CALL FOR HELP.     WE ARRANGED FOR A TOW TRUCK TO PICK THE CAR UP AND TAKE IT TO OUR NEAREST VOLVO DEALER. WHEN WE ARRIVED THERE AND EXPLAINED WHAT HAD HAPPENED THE FIRST QUESTION ASKED BY THE SERVICE REP WAS \"HAVE YOU HAD THE ETM RECALL PERFORMED ?\" I STATED THAT WE WERE NOT AWARE OF ANY RECALL AND HAD NOT RECEIVED ANY LETTER FROM VOLVO OF NORTH AMERICA.     2 DAYS LATTER ONCE THE CAR HAD BEEN DIAGNOSED BY THE DEALER IT WAS DISCOVERED THAT IT HAD BEEN CAUSED BY AN ETM/ECM FAILURE. THE REPLACEMENT PART NUMBER WAS 30785453. I ALSO SPOKE WITH VOLVO OF NORTH AMERICA AND WAS INFORMED THAT THERE WAS NO RECALL BUT A WARRANTY EXTENSION ON THAT PARTICULAR PART. I ASKED WHY I HAD NOT RECEIVED A LETTER YET CONCERNING IT AND WAS INFORMED THAT THEY WE STILL IN THE PROCESS OF SENDING THEM OUT. SINCE THEN I HAVE DISCOVER EVIDENCE THAT THE LETTER WAS AVAILABLE SINCE NOVEMBER 2005.  *JB",
        "vin": "YV1SW53D912"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/26/2006",
        "dateOfIncident": "07/17/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156277,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ETM CLEANED & ADJUSTED AT 48,474 MILES FOR STALLING AND ENGINE SURGING: 10/13/03 ETM REPLACED FOR STALLING; 4/13/05 ENGINE SURGING DIAGNOSED AS ETM AT 79,386, 4/27/05 SOFTWARE UPDATE TO CORRECT SURGING, DID NOT HELP.  5/26/05 ETM REPLACED FOR SURGING IDLE AND TRANS BANGING INTO GEAR, ALSO SOFTWARE UPDATED; 4/24/06 ETM SOFTWARE UPGRADE FOR ENGINE SURGING AND BEING IN LIMP HOME MODE TWICE [S.MCH FROM E-MAIL]",
        "vin": "YV1SW53D711"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/14/2006",
        "dateOfIncident": "04/14/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155358,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  WHILE BRAKING THE CHECK BRAKE LIGHTS WARNING ILLUMINATES.  THERE IS A NHTSA RECALL, # 04V051000, REGARDING THE BRAKE LIGHTS.  THE VEHICLE HAS THE SAME PROBLEMS AS INDICATED IN THE RECALL; HOWEVER, IT IS NOT INCLUDED IN THE RECALL DUE TO THE VIN.  UPDATED 5/10/2006 - THE RIGHT AND LEFT BRAKE LIGHTS DID NOT WORK, ONLY THE CENTER BRAKE LIGHT WORKED.  *NM",
        "vin": "YV1SW61R212"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/14/2006",
        "dateOfIncident": "04/11/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155362,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I STEP ON THE BRAKES, SOMETIMES I GET A WARNING ON MY DASHBOARD TO CHECK BRAKE LIGHTS, WHEN I CHECK, I GET THE WARNING WHENEVER THE LEFT AND RIGHT BRAKE LIGHTS DO NOT LIGHT UP, AND ONLY THE CENTER DOES.  IF I PRESS MULTIPLE TIMES THEY MAY WORK.  I FOUND A SIMILAR RECALL ON THE 2002 MODEL, I HAVE THE 2001 MODEL THE NUMBER IS 04V051000.  *NM",
        "vin": "YV1SW61R212"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/31/2006",
        "dateOfIncident": "03/16/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154317,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC THROTTLE MODULE FAILED ON 2001 VOLVO V70 T5 AT 75,400 MILES. FAILURES OF THIS COMPONENT ARE COMMON DUE TO POOR DESIGN OF ETM. VEHICLE GOES INTO \"LIMP HOME\" MODE AT UNPREDICTABLE TIMES. MOST RECENT FAILURE WAS AS MY WIFE WAS MERGING WITH TRAFFIC ONTO FREEWAY. FROM 55 MPH VEHICLE SUDDENLY LOST POWER AND REDUCED SPEED TO 20 MPH IN TRAFFIC!. MY WIFE CREPT OVER TO THE SHOULDER AND CALLED A TOW TRUCK.  *NM",
        "vin": "YV1SW53D012"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/28/2006",
        "dateOfIncident": "03/27/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153932,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF \"ELECTRONIC THROTTLE MODULE (ETM)\". LOSS OF POWER WHILE DRIVING WITH NO ADVANCED WARNING OR OTHER INDICATION IMMANENT FAILURE. CAR WENT INTO \"LIMP HOME MODE\" WHICH PROVIDES ENOUGH POWER FOR THE VEHICLE TO BE DRIVEN, BUT BECAUSE THE ENGINE MANAGEMENT COMPUTER ATTEMPTS TO KEEP A FIXED, SOMEWHAT ABOVE IDLE, THROTTLE SETTING, RELEASING THE THROTTLE DOES NOT RESULT IN ENGINE BRAKING AS NORMAL FOR A MANUAL TRANSMISSION VEHICLE. NEITHER SITUATION, LOSS OF POWER OR LOSS OF THROTTLE CONTROL, IS ACCEPTABLE AND COULD CAUSE AN ACCIDENT. THE SUDDEN LOSS OF POWER NEARLY RESULTED IN MY BEING REAR ENDED, LUCKILY THE DRIVER BEHIND ME REACTED QUICKLY ENOUGH TO AVOID HITTING ME. THE DEALER INSTALLED NEW SOFTWARE IN THE ETM IN AN ATTEMPT TO RECTIFY THE PROBLEM.  *JB",
        "vin": "YV1SW61RX12"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/22/2006",
        "dateOfIncident": "03/21/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153407,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY BEGAN HAVING PROBLEMS WITH MY 2001 VOLVO V70 STATION WAGON. IT TURNS OUT THAT THE PCV SYSTEM HAD BECOME CLOGGED AS A RESULT OF PROBLEMS WITH THE ETM. WHEN THEY TESTED THE VEHICLE AT THE DEALERSHIP THEY DID NOT FIND ANY COMPUTER CODES RELATED TO THE ETM SO THEY ARE REFUSING TO COVER THE DAMAGE DONE TO THE PCV BY THE FAULTY ETM UNDER WARRANTY. WHEN THEY CLEAN OR REPLACE THE ETM THEY SERVICE THE PCV AS PART OF THE REPAIR THEY HAVE INDICATED TO ME THAT UNTIL THE ETM FAILS COMPLETELY THEY ARE UNWILLING TO COVER THE PCV PROBLEM UNDER THE EXTENDED WARRANTY. *JB",
        "vin": "YV1SW61R712"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2006",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150852,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 V70 DID NOT SHIFT PROPERLY AND CLUNKED IN AND OUT OF GEAR. CONSUMER WAS TOLD THAT THE STABILIZER MOTOR MOUNT WAS FAULTY.  *TS THE THROTTLE BODY, CAM SHAFT SENSOR AND VACUUM BOOST SENSOR NEEDED TO BE REPLACED.  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2006",
        "dateOfIncident": "04/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149294,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING THE VEHICLE TRAVELING 30- 40 MPH THE VEHICLE IDLES ROUGHLY.  ALSO WHILE STOPPED AT STOP SIGNS THE VEHICLE LURCHED FORWARD.  THE VEHICLE STARTED HAVING DIFFERENT ERROR CODES ILLUMINATE IN THE VEHICLE.  IT HAS BEEN TAKEN TO THE DEALERSHIP A TOTAL OF THREE TIMES.  AFTER DIAGNOSTICS WERE RAN ON THE VEHICLE THE PROBLEM WAS THE ELECTRONIC THROTTLE BODY MODULE.  ALL PROBLEMS WITH THE VEHICLE ARE DUE TO THE THROTTLE BODY MODULE FAILING.  THE DEALERSHIP WILL CLEAN THE MODULE BUT THEY WILL NOT REPLACE IT UNTIL IT COMPLETELY FAILS.  THE MANUFACTURER HAS BEEN ALERTED.",
        "vin": "YV1SW53D511"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/10/2006",
        "dateOfIncident": "01/09/2006",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147375,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS ON ONE OF THE BUSIEST FREEWAYS IN SOUTHERN CALIFORNIA DURING RUSH HOUR TRAFFIC, WHEN OUR 2001 V-70 BEGAN MISSING AND LOSING POWER.  BY THE TIME SHE LIMPED HOME TO THE NEXT OFF RAMP, SHE WAS TRAVELING AT APPROXIMATELY 20 MILES AN HOUR, IN TRAFFIC MOVING NEARLY 60 MILES AN HOUR.  OBVIOUSLY, THIS CREATED A SIGNIFICANT SAFETY HAZARD FOR MY WIFE AND OTHER TRAVELERS.    SHE WAS ABLE TO DRIVE THE CAR TO THE DEALER, CALABASAS VOLVO, AT ABOUT 20-30 MILES PER HOUR.  AT THE DEALER, SHE WAS INFORMED THAT THE GAS PEDAL LINKAGE REQUIRED REPLACEMENT AT APPROXIMATELY $300 (COPY ENCLOSED), AND THAT THE ETM WOULD BE CLEANED.  I HAD ALREADY FOUND INFORMATION ON THE WEB THAT SHOWED CLEANING WAS INEFFECTIVE, AND THE LIKELIHOOD OF CONTINUED SAFETY RISK.  IN FACT, THE INFORMATION ON THE WEB EXPLAINED THAT VOLVO HAS AGREED TO AN EXTENSION OF THE WARRANTY ON THIS PART TO 200,000 MILES OR 10 YEARS.  I, FRANKLY, WAS STUNNED THAT A CAR MANUFACTURER WOULD ACKNOWLEDGE SUCH A FUNDAMENTAL DESIGN FLAW AND COMMIT TO SUCH A LONG PERIOD OF TIME FOR REPLACEMENTS FOR THE EFFECTIVE LIFE OF THE CAR.  IT APPEARS THAT SOMEONE AT VOLVO DOES RECOGNIZE THAT THE ETM FAILURE COULD CAUSE INJURY OR EVEN DEATH OF THE VEHICLE OPERATOR AND OCCUPANTS.   I CALLED THE SERVICE DEPARTMENT AND URGED THEM TO REPLACE THE ETM.  TO MY ABSOLUTE SURPRISE, THEY EXPLAINED THAT VOLVO HAS DIRECTED DEALERS TO CLEAN FIRST, REPLACE LATER, ALTHOUGH THEY AGREED THAT THE ETM WOULD PROBABLY FAIL WITHIN A SHORT PERIOD OF TIME.    NOW MY WIFE IS MUCH NICER THAN ME, AND SINCE I HAD SOME DISCUSSIONS WITH THE CALABASAS VOLVO SERVICE DEPARTMENT REGARDING THEIR INCOMPETENCE WITH THE FAN RECALL, THEY CHOSE TO GIVE HER THE CAR BACK AFTER THE CLEANING AND SHE ACCEPTED IT.   WITHIN TWO MILES, THE CAR WAS EXPERIENCING THE EXACT SAME SYMPTOMS THAT IT HAD EARLIER IN THE DAY.  IN OTHER WORDS, VOLVO POLICY HAS PLACED MY WIFE AND FAMILY AT RISK OF DEATH OR INJURY.   *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/03/2006",
        "dateOfIncident": "12/23/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146842,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE INTERMITTENT FAILURE OF THE DIPPED BEAMS IN MY 2001 VOLVO V70 T5. I SEE AN ERROR REPORT ON THE DASH: BULB FAILURE. DIPPED BEAMS.  BUT THERE IS NOTHING WRONG WITH MY BULBS. THERE IS AN ELECTRICAL PROBLEM THAT IS TOTALLY UNPREDICTABLE LEADING TO LOSS OF LOW BEAMS.  VOLVO SERVICE MANAGERS SAY THEY DON'T KNOW WHAT CAUSES THE PROBLEM.  AM I THE ONLY PERSON TO REPORT THIS DEFECT?  IT STARTED ABOUT 2 YEARS AGO IN THE WINTER OF 2003 BUT IS NOW MORE REGULAR BUT NOT ALWAYS.  *NM",
        "vin": "YV1SW53D611"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/02/2006",
        "dateOfIncident": "12/26/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WARMED UP CAR FOR 2 MINUTES;  DROVE 2 MILES TO DRUG STORE--LET ENGINE IDLE WHILE WIFE IN THE STORE;  DROVE .1 MILE AND ENGINE BEGAN ACTING VERY ERRATIC!  SPUTTERING AND STALLING AND NO ENGINE POWER CAR DIED INTO PARKING LOT;  VERY LIGHT TRAFFIC IN MIDTOWN ALLOWED ME LIMP CAR TO DROP FAMILY AT TRANSIT STATION AND LEFT VOLVO AT OFFICE .3 MILES AWAY;  AFTER RETURNING FROM VACATION CAR RAN OK--CHECK ENGINE LIGHTS STILL ON + TWO URGENT ERROR MESSAGES.  DEALERSHIP REFUSED TO REPLACE ETM DESPITE THE CHECK ENGINE LIGHT BEING ON.  *NM",
        "vin": "YV1SW53D512"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/27/2005",
        "dateOfIncident": "06/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146183,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED WHILE DRIVING THE VEHICLE  LOST SPEED.  WHEN STOPPING AT A STOP SIGN OR AT A  RED LIGHT THE ENGINE STALLED.  SHE CONTACTED THE DEALERSHIP, AND THEY SAID THE  THROTTLE MODULE NEEDED TO BE REPLACED.  ALSO, SHE  CONTACTED THE MANUFACTURER.  THEY STATED THIS PROBLEM WAS UNDER INVESTIGATION.  NO REPAIRS HAVE BEEN MADE.*AK",
        "vin": "YV1SW58DX11"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/22/2005",
        "dateOfIncident": "05/25/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146461,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE  10143655 FOR SECOND ETM REPLACEMENT, FIRST REPLACED AT 42,000 MILES, WAS STALLING , HESITATING, ROUGH ID. E.  HARD TO START AFTER STALLS. SMCH     *AK",
        "vin": "YV1SW58D211"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/21/2005",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145873,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A  2001 VOLVO V70 T5. THIS CAR HAS THE HIGH FAILURE RATE ELECTRONIC THROTTLE MODULE COMPONENT.  DURING HIGHWAY DRIVING, I EXPERIENCED A SUDDEN LOSS OF POWER WHILE IN PASSING LANE OF A 2 LANE HIGHWAY. THE MESSAGE WINDOW ON THE DASH FLASHED \"PERFORMANCE REDUCED\" THIS OCCURRED DURING WHILE PASSING A SEMI WITH OTHER CARS FOLLOWING CLOSELY BEHIND IN A CARAVAN. IT WAS IN POURING RAIN WITH WATER FROM THE SEMI SPLASHING OVER THE WINDSHIELD.    NEEDLESSTOSAY, THIS WAS A NERVOUS MOMENT WHEN POWER WAS SUDDENLY LOST. I WAS ABLE TO SLOW DOWN AND PULL OFF TO THE NEXT EXIT RAMP WHERE THE ENGINE WAS SPUTTERING WHILE IDLING. SHUTTING OFF THE ENGINE AND RESTARTING MADE THE PROBLEM DISAPPEAR.    ABOUT 3 MONTHS LATER, I'M GETTING \"PERFORMANCE REDUCED\" MESSAGE NEARLY EVERY DAY. FINALLY TRACE IT DOWN TO THE ETM INTERNAL FAULT USING A OBDII READER I PURCHASED TO DIAGNOSE THIS PROBLEM. VOLVO DEALER CONFIRMED THE FINDING AND REPLACED THE ETM.  *NM",
        "vin": "YV1SW53D011"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/19/2005",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147519,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70 BRAKING SYSTEM FAILED AND ENGINE COMPLETELY SHUT DOWN WITHOUT WARNING.  *TS  *NM *** NO ANSWER REQUIRED***",
        "vin": "YV1SW58D111"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/13/2005",
        "dateOfIncident": "07/26/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145055,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70 - TRAVELING ON MAJOR HIGHWAY IN THIS VEHICLE, IT LOST ACCELERATION AND STARTED TO REDUCE POWER, EVENTUALLY RESULTING IN COMPLETE STALLING.  CAUGHT BETWEEN TRUCKS AND CARS GOING APPROXIMATELY 65 - 75 MPH. I FELT HOPELESS TO HELP MYSELF, FEARING I WOULD BE KILLED BY TRAFFIC.  *NM",
        "vin": "YV1SW58D211"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/05/2005",
        "dateOfIncident": "12/03/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144472,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO, 2001 V70 - VIN [XXX]   THIS SPECIFIC VEHICLE IS UNRELIABLE AND UNSAFE.  SINCE PURCHASED NEW, CAR HAS HAD MULTIPLE SYSTEM FAILURES LEADING TO VARIOUS UNSAFE DRIVING CONDITIONS INCLUDING BRAKE SYSTEM FAILURE AND ENGINE FAILURE (INCLUDING LOSS OF BRAKING AND STEERING SYSTEMS).  MANUFACTURER HAS ACKNOWLEDGED UNUSUAL NATURE OF THIS PARTICULAR VEHICLE QUALITY DEFECTS - CONCERNED THAT CAR MUST BE TAKEN OFF ROAD TO AVOID SERIOUS CRASH.  PLEASE ADVISE.  *NM  UPDATED 07/17/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "YV1SW58D111"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/25/2005",
        "dateOfIncident": "05/25/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143655,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED THE ELECTRONIC THROTTLE MODULE (ETM) FAILED.  THE ENGINE IDLE DROPPED, AND  SURGED UPON STARTING THE VEHICLE.  WHILE DRIVING THE VEHICLE IT SURGED AND THEN  LOST POWER.  THE VEHICLE STALLED WHILE AT A STOP LIGHT AND WOULD NOT IMMEDIATELY START BACK.  THE VEHICLE STARTED AGAIN AFTER THE FOURTH ATTEMPT.  THE ETM WAS REPLACED APPROXIMATELY A YEAR AGO, BUT NOW THE VEHICLE EXPERIENCED THE SAME PROBLEMS AGAIN.  *AK  AFTER THE REPAIRS THE CONSUMER CONTINUED TO EXPERIENCE PROBLEMS. UPDATED 01/04/06. *JB",
        "vin": "YV1SW58D211"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/21/2005",
        "dateOfIncident": "09/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144237,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON I-695 NEAR BALTIMORE EXPERIENCED SIX EPISODES OF SUDDEN DECELERATION ,AND A ALMOST  STALLING. ALSO,  WAS ALMOST REAR ENDED BY A DUMP TRUCK ON ONE OCCASION ,AND  ON ANOTHER OCCASION BY AN 18-WHEELER BEFORE THE CONTACT COULD CROSS SLOWLY THROUGH LANES TO THE SIDE OF THE ROAD. TO MAKE MATTERS WORSE, DUE TO ROAD CONSTRUCTION, DURING TWO OF THESE UNPLANNED STOPS, THERE WAS NO SHOULDER AND THE CONTACT BLOCKED A LANE OF TRAFFIC. THE MESSAGE ON THE DASHBOARD READ REDUCED ENGINE PERFORMANCE. THE CONTACT TURNED THE CAR OFF, AND THEN A FEW TIMES, NOTED A VERY ROUGH IDLE AND THE SAME MESSAGE.  THEN , TURNED THE CAR OFF FOR A FEW MINUTES ,AND INSTEAD OF THE REDUCED ENGINE PERFORMANCE WARNING RECEIVED A NEEDED IMMEDIATE REPAIR SERVICE OR SOME SIMILAR MESSAGE,  AND THE CHECK ENGINE LIGHT WAS ON. HE DROVE  A FEW MILES AT 60-65 MPH, BUT THE ENGINE WAS RUNNING VERY ROUGH. THIS WHOLE EPISODE REPEATED  BY ITSELF 5 TIMES DURING 50 MILES DRIVE. THE CONTACT  MADE  IT HOME SAFELY WITH THREE YOUNG CHILDREN IN THE BACK SEAT.  THESE PROBLEMS  WERE EXACTLY THOSE DOCUMENTED WITH THE DEFECTIVE ELECTRONIC THROTTLE  (ETM)    IN MOST  1999-2001 VOLVOS. HAS AN APPOINTMENT WITH  LOCAL DEALER, AND HE  WILL BE CHARGED THE USUAL $1000-$1200  TO REPLACE THE ETM MODULE. UNFORTUNATELY, THE REPLACEMENT MODULE WAS NOT BETTER THAN THE ORIGINAL MODULE.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/21/2005",
        "dateOfIncident": "10/30/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143299,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR'S CHECK ENGINE LIGHT CAME ON WHILE ON INTERSTATE AT 65 MPH.  DROVE CAR ADDITIONAL 15 MINUTES TO GET HOME.   FOLLOWED ON-DASH & OWNER'S MANUAL  INSTRUCTIONS TO GET CHECKED AT EARLIEST CONVENIENCE.  CAR BROKE DOWN NEXT DAY ON WAY TO MECHANIC.  CAR BUCKED AND SURGED, DECELERATING AND ACCULTURATING WITHOUT ANY WARNING. CEL CAME ON.  DISPLAY READ \"PERFORMANCE REDUCED\".  COULD GO NO FASTER THAN 20-25 MPH.    IN NO POSITION TO STOP VEHICLE. ON BUSY ROAD WITH NO USABLE SHOULDER.  CAR REQUIRED TOWING.  ONBOARD DIAGNOSTICS (OBD) SAID THERMOSTAT WAS BAD, BUT MECHANIC SUSPECTED FAILED ETM. HE SAID THIS IS A KNOWN ISSUE WITH CAR.  THE THERMOSTAT WAS REPLACED. CAR WAS DRIVABLE.  USED APPROXIMATELY  5 MILES MORE.  CAR BROKE DOWN ON WAY HOME, STRANDING ME IN INTERSECTION.  SAME ISSUE. CAR WENT INTO \"LIMP HOME\" MODE.  SHUT IT OFF. AFTER FIVE MINUTES, CAR RETURNED TO NORMAL OPERATION. WAS ABLE TO DRIVE BACK TO MECHANIC.  THIS TIME OBD REPORTED TELL-TALE CODES FOR FAILED ETM.  ELECTRONIC THROTTLE MODULE WAS REPLACED AT TOTAL COST OF $1200.  I PHONED STILLMAN VOLVO WHERE I PURCHASED THE CAR.  THEY DENIED KNOWLEDGE OF ANY WIDESPREAD, WELL-KNOWN ISSUE REGARDING ETM ON 2001 VOLVOS.  I CALLED VOLVO AMERICA CUSTOMER CARE AND THEY ACKNOWLEDGED A NHTSA INVESTIGATION UNDERWAY AND THAT THEY HOPED TO HAVE A RESOLUTION IN A COUPLE OF WEEKS.  THE REPRESENTATIVE, HOWEVER, TOLD ME THAT IT WOULD BE UNLIKELY THAT I WOULD GET ANY COST ASSISTANCE FROM VOLVO OR MY VOLVO DEALERSHIP SINCE I HAD THE WORK DONE BY AN INDEPENDENT MECHANIC.    I AM FILING THIS COMPLAINT BECAUSE I DID A LITTLE RESEARCH ON-LINE WITH OTHER VOLVO OWNERS.  I NOW UNDERSTAND THAT VOLVO AMERICA HAS KNOWN ABOUT THIS ISSUE FOR YEARS AND HAS NOT ISSUED A RECALL.    I AM UPSET REGARDING THEIR STATEMENT REGARDING INDEPENDENT MECHANICS.  BUT I AM FURIOUS THAT THIS CAR MANUFACTURER WOULD RISK THE LIVES OF THEIR CUSTOMERS AND THEIR PASSENGERS BY FAILING TO TAKE ACTION ON THIS ISSUE.  *JB",
        "vin": "YV1SW53DX12"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/14/2005",
        "dateOfIncident": "10/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142567,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED  VEHICLE WAS LOSING POWER WHILE ACCELERATING AND WOULD ONLY GO 15 MPH.  HE WOULD COAST TO THE SIDE OF THE ROAD AND TURN THE VEHICLE OFF AND BACK ON.  THIS HAPPENED DAILY.  HE TOOK THE VEHICLE TO THE DEALERSHIP,  AND THE THROTTLE BOX WAS REPLACED.  THE PROBLEM HAS NOT COME BACK SINCE THE REPAIRS. *AK  UPDATED 12/27/05.  *JB",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/09/2005",
        "dateOfIncident": "11/09/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142270,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING THE VEHICLE, THE FOLLOWING WARNING COMES ON THE DASH BOARD \"PERFORMANCE REDUCTION\".  CAR STARTS TO SHUDDER, SLOWS DOWN AND DOES NOT RESPOND WHEN PRESSING ON THE GAS.  *NM",
        "vin": "YV1SW58D111"
    },
    {
        "components": "STEERING,SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "09/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142138,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINT REGARDING VOLVO ELECTRONIC THROTTLE DEFECT. *TS  UPDATED 11/7/2005 - WHILE DRIVING THE PERFORMANCE REDUCED LIGHT AND SES LIGHT ILLUMINATED ON THE DASH.  THE VEHICLE WAS TAKEN TO THE DEALER WHO DETERMINED THAT THE ELECTRONIC THROTTLE NEEDED TO BE REPLACED.  NEITHER THE DEALER NOR MANUFACTURER AGREE TO REPLACED THE THROTTLE FREE OF CHARGE BECAUSE THE VEHICLE WAS OUT OF WARRANTY. DURING INSPECTION THE TECHNICIAN FOUND THE FRONT CONTROL ARM AND UPPER SPRING SEAT BROKEN.  THE POWER STEERING FLUID LEAKED DUE TO A FAULTY HOSE CLAMP.  *NM",
        "vin": "YV1SW53DX11"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "10/04/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141957,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED VEHICLE SURGED FORWARD AFTER PLACING IT INTO GEAR.  SHE TRIED TO STOP THE VEHICLE BY APPLYING THE BRAKES, BUT THEY WOULD NOT WORK.  SHE LOST CONTROL OF THE VEHICLE AND STRUCK A POLE.  THE VEHICLE HAS NOT BEEN INSPECTED TO DETERMINE THE CAUSE OF THE PROBLEM.  *AK  UPDATED 11/29/2005 - THE FEW WEEKS PRIOR TO THIS ACCIDENT THE VEHICLE HAD A COMPUTER PROBLEM AND THE PASSENGER DOOR, WINDOW AND TURN SIGNAL WERE INOPERATIVE.  THESE PROBLEMS WERE FIXED BY THE DEALER.  *NM",
        "vin": "YV1LW5641V2"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "10/25/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141972,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE VOLVO V70 T5 WAGON WITH REDUCED PERFORMANCE AND UNEXPECTED ACCELERATION AND REDUCTION OF ACCELERATION.  THE VEHICLE STOPPED ON TRAFFIC AND I WAS ALMOST REAR ENDED.  THE VEHICLE ACCELERATED  WHILE ENTERING THE GARAGE AND CAUSING DAMAGE TO THE BODY OF THE VEHICLE.  ADDITIONALLY,  THE CLIMATE CONTROL IN THE CAR STOPPED WORKING.  MY DEALER ED SCHMIDT VOLVO IN PERRYSBURG,OHIO NOW SAIDS THAT I NEED TO REPLACE MY THROOTTLE MODULE ($1300) AND THE PROCESSOR FOR THE CLIMATE CONTROL ($1400). THE VEHICLE IS ONLY THREE THOUSAND MILES BEYOND WARRANTY.  I HAVE A DANGEROUS LEMON IN MY HANDS AND THERE IS NOTHING I CAN DO.  I THANK GOD THAT MY YOUNG CHILDREN WHERE NOT NEAR THE GARAGE WHEN THE CAR ACCELEARTED OUT OF CONTROL. PLEASE FEEL FREE TO CONTACT ME.  THIS CAR SHOULD NOT BE ON THE ROAD IN ITS PRESENT CONDITION.  *NM",
        "vin": "YV1SW53D211"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/07/2005",
        "dateOfIncident": "10/17/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142010,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED WHILE DRIVING A MESSAGE APPEARED THAT READ ENGINE SYSTEM SERVICE REQUIRED WHICH INTERNALLY MADE THE CRUISE CONTROL FAIL. HE TOOK THE VEHICLE TO VOLVO, AND ALSO A PRIVATE MECHANIC.  THE PROBLEM WAS THE ELECTRONIC THROTTLE MODULE .THE VEHICLE REPAIRS WILL BE AT  THE CONTACT'S EXPENSE. THE CONSEQUENCE OF NOT HAVING THIS REPAIR MADE COULD RESULT IN THE VEHICLE LURCHING FORWARD AT ANY SPEED OR IT COULD CAUSE THE VEHICLE TO STALL OUT AT ANY TIME.   HE IS CURRENTLY NOT EXPERIENCING ANY PROBLEMS, HOWEVER THE VEHICLE IS PARKED AT THIS TIME.*AK  UPDATED 11/30/2005 - VOLVO COVER THE COST OF THE NEW PART AND HAS EXTENDED THE WARRANTY ON THE PART TO 200000 MILES OR 10 YEARS.  *NM",
        "vin": "YV1SW61R411"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/02/2005",
        "dateOfIncident": "10/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141576,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED WHILE DRIVING AT ANY SPEED THE VEHICLE STALLED.  THE COMPUTER SHOWED REDUCED PERFORMANCE.  THE VEHICLE WAS TAKEN TO A MECHANIC ,AND THEY WERE UNABLE TO DIAGNOSE  THE  PROBLEM.*AK",
        "vin": "YV1SW53D512"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/01/2005",
        "dateOfIncident": "10/21/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141463,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIALLY NOTICED ERRATIC ACCELERATION, THEN MY WIFE WAS ACCELERATING FROM A STOP LIGHT AND THE VEHICLE ACTUALLY LOST ACCELERATION AND SHE WAS HIT BEHIND BY A PICKUP TRUCK.  THE DASH READOUT SHOWED THE MESSAGE \"PERFORMANCE REDUCED\".  OUR INSURANCE PAID FOR THE $2600 IN DAMAGES.  OUR VOLVO MECHANIC DETERMINED THAT THE PROBLEM WAS IN THE ELECTRONIC THROTTLE MODULE AND SAID THAT THIS WAS A FAIRLY COMMON OCCURRENCE IN THIS YEAR MODEL.  *NM",
        "vin": "YV1SW58D811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "10/14/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140568,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 14 OCT 05 AS I TURNED OFF A MAJOR INTERSTATE HIGHWAY IN RICHMOND, VA MY 2001 VOLVO V70 T-5 BEGAN RUNNING REALLY ROUGH AND A RED WARNING TRIANGLE ILLUMINATED AND I RECEIVED A MESSAGE WARNING ME THAT THE ENGINE WAS NOT OPERATING PROPERLY. IT CLEARED AFTER I STOPPED AND RESTARTED THE CAR AND I WAS ABLE TO RETURN HALF WAY TO CHARLOTTESVILLE BEFORE IT STARTED RUNNING ROUGH AGAIN. IT CONTINUED TO CYCLE BETWEEN NORMAL OPERATION AND ROUGH RUNNING UNTIL I REACHED THE VOLVO DEALER IN CHARLOTTESVILLE. ON 18 OCT 05, THE DEALER, VOLVO OF CHARLOTTESVILLE,  INFORMED ME THAT I NEEDED A NEW ELECTRONIC THROTTLE MODULE AND REPLACED IT AT A COST OF $916.32. I LOOKED ON THE WEB TO FIND OUT EXACTLY WHAT AN ETM IS AND DISCOVERED THE CASE AGAINST VOLVO CONCERNING ETM FAILURES. THIS IS A USED CAR THAT I PURCHASED IN OCT04 SO I HAVE NO WAY OF TELLING IF THIS HAS HAPPENED BEFORE.  *JB",
        "vin": "YV1SW53D211"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "10/22/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140648,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE CAR WAS PURCHASED THERE HAVE BEEN ROUGH START AND ROUGH IDLE ISSUES AND ACCELERATION ISSUES.  THE ISSUES WERE RAISED TO THE DEALER ON THREE OCCASIONS ALL WITH NO RESOLUTION.  THE DEALER HAS NOW IDENTIFIED THE ISSUE AS A FAILURE IN THE ETM AFTER THE SERVICE ENGINE LIGHT CAME ON AND REMAINED LIT.  DEALER QUOTES REPAIR COSTS OF $1,100.  *NM",
        "vin": "YV1SW53D211"
    },
    {
        "components": "VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/23/2005",
        "dateOfIncident": "10/19/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140542,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "TOW HITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "FAULTY ELECTRONIC THROTTLE MODULE NEEDED CLEANING AND THE MECHANIC FEARS IT WILL ULTIMATELY FAIL, AS HE IS SEEING THEM FAIL AT HIGH RATES AT HIS VOLVO GARAGE.  CAR WAS SURGING AND STALLING AT STOPS, AND JUST STALLING IMMEDIATELY AFTER STARTING.   *NM",
        "vin": "YV1SW53D612"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/18/2005",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137332,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:   THE CALLER SAID  ON JULY 19, 2005 AFTER DRIVING TWO HOURS THE REDUCED PERFORMANCE WARNING LIGHT CAME ON. THE VEHICLE STARTED SHAKING AND  HAD NO ACCELERATION.  THE CALLER SAID THE REDUCED PERFORMANCE LIGHT CAME ON AGAIN ON THE WAY HOME. SHE GOT VEHICLE OFF THE ROAD AND WAITED A FEW MINUTES AND THE VEHICLE STARTED BACK UP. VEHICLE WAS TAKEN TO THE DEALER AND THE THROTTLE WAS REPLACED. THE CALLER JUST WANTED TO LET NHTSA KNOW ABOUT THE FAILURE. THE CALLER SAID DEALER WAS VERY NICE ABOUT THE REPAIR WORK. *AK  *NM",
        "vin": "YV1SW58DX11"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/17/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140001,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  2001 VOLVO V70 ALL WHEEL DRIVE CROSS-COUNTRY  THE THROTTLE MODULE FAILED  AND  IT  HAD TO  BE REPLACED.   THE CONSUMER DONE RESEARCH AND FOUND THAT VOLVO MODELS 1999- 2001, AND  BETWEEN 40,000-60000 MILES THE THROTTLE MODULE HAS TO BE REPLACED ON ALL THOSE VEHICLES.  CONSUMER'S  VEHICLE T WA SOWED OVER 100 MILES TO NEAREST DEALERSHIP.  THEY SAID THE THROTTLE MODULE MALFUNCTIONED  AND NEEDED REPLACEMENT.  ALSO, SAID THAT IF A RECALL EVER CAME OUT IN THE FUTURE ON THE 2001 VOLVOS FOR THIS SAME PROBLEM  THE CONSUMER  WOULD BE REIMBURSED.  THERE HAVE BEEN NO ACCIDENTS.  *AK",
        "vin": "YV1SZ58D211"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/12/2005",
        "dateOfIncident": "10/10/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139416,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS MODULE SHOWS INTERMITTENT ERRORS.   WHEN ABS MODULE HAS ERRORS THE ABS SYSTEM DOES NOT WORK.  DEALER SUGGESTS THAT IT BE REPLACED AT MY COST OF $915.*JB",
        "vin": "YV1SW53D912"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/11/2005",
        "dateOfIncident": "08/06/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139375,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR AT HIGHWAY SPEED (APPROXIMATELY 65 MPH) THE VOLVO V70 T5 LOST POWER AND BEGAN RUNNING EXTREMELY ROUGH.   CAR HAD TO BE PULLED OVER IMMEDIATELY TO THE BREAK DOWN LANE.   ON THE DASH, THE INDICATOR PANEL STATED PERFORMANCE REDUCED.   AFTER TURNING ENGINE OFF AND RESTARTING, CAR BEGAN TO RUN FINE AGAIN ONLY TO HAPPEN AGAIN A FEW MILES DOWN THE ROAD.  CAR HAD TO BE LIMPED TO THE DEALER.   DEALER REPLACE THE ENGINE THROTTLE MODULE (ETM) AT COST OF $1032.00. *JB",
        "vin": "YV1SW53D812"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/09/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139162,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1) NORMAL DRIVING 65 MPH WESTBOUND ON I-25/I-40 INTERSECTION, PASSING A SEMI-TRUCK ON THE LEFT.  2)ENGINE WARNING LIGHT  CAME ON, CAR SLOWED TO 20 MPH, SWERVED TO AVOID ALL TRAFFIC DUE TO SUBSTANTIAL LOSS OF SPEED  3)TOWED TO VOLVO DEALERSHIP, REPLACED ELECTRONIC BRAKE SENSOR, THROTTLE BODY ASSEMBLY, AND HAD TO BUY NEW CODING FOR COMPUTER:$1300 REPAIR COST.  OLD PARTS AT CORROLEY VOLVO, ALBUQUERQUE, NM.  *NM",
        "vin": "YV1SW58D511"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "08/26/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138950,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO V70 2001 WHEN USING CRUISE CONTROL ACCELERATES ON ITS ON TO EXCESSIVE SPEEDS AND DOES NOT RESPOND TO EITHER BRAKING OR TURNING OFF CRUISE CONTROL.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/28/2005",
        "dateOfIncident": "09/19/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137999,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SEVERAL MONTHS PRIOR TO FAILURE, ENGINE TORQUE WOULD FLUCTUATE AT STEADY HIGHWAY SPEEDS WITH OR WITHOUT CRUISE CONTROL ON. ALTHOUGH IT DID NOT AFFECT THE SPEED OF THE VEHICLE VISIBLY, I COULD FEEL IT IN THE SEAT OF MY PANTS. AFTER GETTING OFF OF THE HIGHWAY (IN A BAD DETROIT NEIGHBORHOOD AND IN THE MIDDLE OF AN INTERSECTION), THE ENGINE FAILED TO ACCELERATE THE CAR AND THE INFORMATION DISPLAY INDICATED \"PERFORMANCE REDUCED.\"  I PROCEEDED FIVE MILES TO MY HOME AT NO MORE THAN 10-20 MPH WHICH WAS ALL THE CAR COULD MUSTER. THE CAR RESTARTED NORMALLY THE FOLLOWING MORNING AND I WAS ABLE TO TAKE IT TO THE DEALER.  THE DEALER REPLACED THE ELECTRONIC THROTTLE MODULE AND ASSOCIATED GASKETS ALONG WITH A SOFTWARE UPGRADE FOR APPROX. $1062 *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "09/26/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137796,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCES SUDDEN, UNEXPECTED, DECELERATION AND ACCELERATIONS WHILE DRIVING UNDER NORMAL CONDITIONS.  MUST TURNOFF VEHICLE AND ATTEMPT TO RE-START.  DOESN'T ALWAYS RESTART IMMEDIATELY.  *NM",
        "vin": "YV1SW58D411"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "08/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137591,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED A 2001 VOLVO V70 2.4T WAGON 12-16-01 FROM THE DEALER, WHO HAD USED IT AS A LOANER VEHICLE.  THIS COMPLAINT IS REGARDING THE THROTTLE CONTROL.  FOR ABOUT A MONTH IT WOULD FEEL AS IF A PLUG WAS BAD OR A FUEL LINE CLOGGED WHEN DRIVING AT A STEADY SPEED.  IT WASN'T AT FIRST NOTICEABLE DURING ACCELERATION.  THEN A \"REDUCED PERFORMANCE\" MESSAGE CAME ON THE DASH.  FINALLY, ON 8-20-05, THE CAR STALLED ON THE WAY TO THE DEALER IN RENO TO GET IT REPAIRED.  FORTUNATELY, WE WERE IN THE RIGHT LANE AND MANAGED TO PULL OFF THE ROAD OUT OF TRAFFIC.  JUST A MATTER OF TIMING AND THIS PROBLEM COULD WELL HAVE BEEN DEADLY.  IT RESTARTED AND WE MADE IT INTO THE DEALER.  THE THROTTLE BODY WAS REPLACED AND THE PVC SYSTEM CLEANED, AS THE SERVICE MANAGER STATED THE PROBLEM CAUSED IT TO NEED CLEANING.  THE TOTAL BILL WAS $1,336.49.  I FEEL VOLVO HAS A SERIOUS PROBLEM HERE, AND JUDGING BY THE NUMBER OF COMPLAINTS, WHICH MUST BE ONLY A FRACTION OF THE NUMBER OF INCIDENTS, IT IS ONLY A MATTER OF TIME BEFORE IT CAUSES DEATHS ON THE HIGHWAY IF IT HASN'T ALREADY.  *JB",
        "vin": "YV1SW58D711"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/21/2005",
        "dateOfIncident": "09/21/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137240,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING 65 MILES PER HOUR AND MY VEHICLE BEGAN TO SLOW DOWN. I GOT A \"REDUCED PERFORMANCE\" WARNING, AND MY SPEED REDUCED GRADUALLY. I TOOK MY CAR TO THE DEALER AND HE STATED THAT THIS WAS NOT A RECALL ITEM EVENTHOUGH I HAD HEARD OF IT HAPPENING TO OTHER VOLVO OWNERS ON THE NEWS BROADCAST. THIS IS UNSAFE AND HOW CAN MANY PEOPLE HAVE THE SAME PROBLEM.",
        "vin": "YV1SW53D912"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2005",
        "dateOfIncident": "06/10/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137056,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2001 VOLVO V70 SPONTANEOUSLY LOST POWER AND DIED. I WAS STRANDED FAR FROM HOME WITH MY DAUGHTER ON A FRIDAY NIGHT.  AFTER SUPPOSEDLY BEING REPAIRED AT THE DEALERSHIP, SEVERAL MONTHS LATER ON A ROAD TRIP, AGAIN FAR FROM HOME, MY CAR ALL OF A SUDDEN STARTED COUGHING AND LOSING POWER, ON THE HIGHWAY AT HIGHWAY SPEED, PUTTING ME AND MY PASSENGERS AT RISK.  I WAS ABLE TO CRIPPLE IT ON, AND THE DEALERSHIP EVENTUALLY REPLACED THE THROTTLE BODY AND RELATED COMPUTER MODULE, BUT I UNDERSTAND THAT IT COULD POSSIBLE HAPPEN AGAIN.  I LIVE IN A REMOTE AREA AND NEED TO BE ABLE TO DEPEND ON MY CAR.  I CANNOT BE STRANDED ON THE OPEN ROAD AT ANY HOUR AND IN ANY WEATHER. *JB",
        "vin": "YV1SW58D912"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2005",
        "dateOfIncident": "08/06/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136647,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SEE EXISTING NHTSA ACTION NUMBER PE05041 FOR THIS FAILURE TYPE  (1) DROVE THROUGH PUDDLE  (2) \"ENGINE SYSTEM SERVICE REQUIRED\" LIGHT; LOSS OF POWER (LIMP-HOME MODE)  (3) FAILED ELECTRONIC THROTTLE MODULE REPLACED (TOTAL COST $1106.82);  FAILED MODULE IS AVAILABLE ALTHOUGH I TOOK IT APART TO FIND PROBLEM - WORN-THROUGH BUTTERFLY VALVE POSITION SENSOR AS DESCRIBED AT HTTP://VEXEDVOLVO.ORG/. *JB",
        "vin": "YV1SW53D711"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/14/2005",
        "dateOfIncident": "05/12/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136464,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 8,000 MILES, MY 2001 (PURCHASED SUMMER 2002) VOLVO V70 SUDDENLY STOPPED WHEN I SLOWED DOWN ON A ROAD NEAR MY HOME.  THE CAR RESTARTED, BUT DID NOT SEEM TO HAVE THE SAME PICK-UP AS BEFORE.  I SUBSEQUENTLY TOOK THE CAR INTO THE VOLVO DEALERSHIP AND WAS TOLD THE THROTTLE MECHANISM NEEDED CLEANING.  AFTER THIS WAS DONE, THE CAR SEEMED FINE FOR SEVERAL MONTHS.  AT ABOUT 15,000 MILES, THE SAME THING HAPPENED ON A DIFFERENCE STRETCH OF ROAD.  THE SEEMED WEAKER THAN BEFORE AND IT TOOK LONGER TO RESTART.  THE VOLVO DEALERSHIP AGAIN DIAGNOSED A DIRTY THROTTLE, CLEANED IT, AND RETURNED IT TO ME.  THE CAR SEEMED NORMAL UNTIL ABOUT 24,000 MILES, WHEN I WAS UNABLE TO START THE CAR AFTER IT HAD BEEN PARKED FOR ABOUT TWO HOURS.  THIS TIME, I TRIED MANY TIMES TO START THE VEHICLE, BUT ULTIMATELY HAD TO CALL A TOW TRUCK.  IT WAS TOWED TO VOLVO, WHERE THEY TOLD IT WAS A THROTTLE PROBLEM AGAIN.  AFTER CLEANING, IT APPEARED NORMAL.  THE CAR IS CURRENTLY AT ABOUT 30,000 MILES, BUT I TAKE IT IN EVERY THREE MONTHS TO GET THE THROTTLE MECHANISM CLEANED AS A PRECAUTION. *JB",
        "vin": "YV1SW61R422"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/12/2005",
        "dateOfIncident": "08/16/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136262,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD BEEN EXPERIENCING A HESITATION FOR APPX SIX MONTHS, JUST WONDERING WHEN THE CAR WOULD FINALLY FAIL AND WHERE. I DROVE THE CAR HOME ON LIMP MODE TWICE. I'D TAKEN THE CAR TO THE DEALERSHIP ON 4 SEPARATE OCCASIONS TO FIGURE OUT THE PROBLEM. EACH TIME THEY COULD NOT FIGURE OUT THE PROBLEM AND CHARGED ME TO LOOK AT THE CAR. THE FOURTH TIME THE CAR PUT OUT AN ETM CODE AND THEY REPLACED THE ETM.   *NM",
        "vin": "YV1SW53D611"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "08/05/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131660,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: VEHICLE STALLED/LOST POWER AND HESITATED. THROTTLE BODY MODULE FAILED AND WAS REPLACED. *AK  *NM",
        "vin": "YV1SZ58D411"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "08/04/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131684,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT OWNED 2001  A VOLVO. HE COMPLAINED ABOUT THROTTLE BODY PROBLEM. THE VEHICLE WAS TAKEN TO THE DEALER TWICE WITH WHAT HE THOUGHT WAS A TRANSMISSION PROBLEM. THEY COULD NOT ADJUST THE TRANSMISSION. CURFRENTLY, THEY TOLD HIM THAT IT WA STHE THROTTLE BODY. TO REPLACE IT WOULD COST CONSUMER $800.00. HE ENDED UP PAYING $250.00  FOR  THROTTLE BODY REPLACEMENT.  WHEN HE DROVE THE CAR HOME  IT SURGED BETWEEN SHIFTS CHANGES. HE CALLED THE DEALER BACK  AND INFORMED THEM  IT WAS DOING THE SAME THING. THEY SAID A TECHNICIAN NEEDED TO RIDE AROUND WITH HIM TO FIND THE PROBLEM. THE CONSUMER SAID THE PROBLEM WAS INTERMITTENT.*AK    *JB",
        "vin": "YV1SW61R812"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/07/2005",
        "dateOfIncident": "08/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135699,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE THROTTLE MODULE ON 2001 VOLVO, MODEL V70, IS DEFECTIVE.  ENGINE RPM SURGES BACK AND FORTH AND CAR SOMETIMES STALLS.  TODAY, SEPT. 7, 2005, RPM INCREASED DRAMATICALLY BY SEVERAL THOUSAND FOR NO REASON.  TOOK TO VOLVO 1 WEEK AGO AND THEY WANTED 834.00 + TAX TO FIX.  VEHICLE HAS ONLY 53,000 MILES.  PART IS DEFECTIVE.*JB",
        "vin": "YV1SW53D811"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/07/2005",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135691,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2001 VOLVO V70 WOULD SURGE AND THEN STALL OR HESITATE DURING CITY DRIVING AND AT  HIGHWAY SPEEDS.  THE VEHICLE SPEED WAS NOT CONTROLLABLE.  THE CAR WOULD RESTART MOST OF THE TIME, BUT THEN IT WOULD NOT START AT ALL UNTIL THE NEXT DAY.  THE DEALER REPLACED THE ELECTRONIC THROTTLE MODULE, OLD PART IS NOT AVAILABLE. *JB",
        "vin": "YV1SW53D311"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "08/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131668,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2001 VOLVO STATION WAGON V70. VEHICLE STALLED/DIED AND LOST POWER WHILE DRIVING AT 25 MPH. THROTTLE BODY SENSOR WAS REPLACED.  *AK  THE UPPER ENGINE MOUNT BROKE AND OIL LEAKED FROM THE TURBO RETURN LINE SEALS.  *NM",
        "vin": "YV1SW53D612"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2005",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134893,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIALLY, I TOOK MY 2001 VOLVO V70 STATION WAGON TO THE DEALER BECAUSE THE CRUISE CONTROL FUNCTION WAS NOT WORKING AND THE \"CHECK ENGINE\" LIGHT CAME ON.  THEY RAN A DIAGNOSTIC COMPUTER CHECK AND TOLD ME THAT EVERYTHING CAME BACK FINE -EVEN THOUGH IT WAS OBVIOUS THAT THE CRUISE CONTROL WAS NOT WORKING WHEN WE DROVE IT AROUND THE LOT.  THEY SAID THAT IF THE COMPUTER DID NOT DETECT AN ERROR THEY WERE NOT ABLE TO FIX ANYTHING, ALTHOUGH THEY SUSPECTED THAT THE ELECTRONIC THROTTLE CONTROL MIGHT BE CAUSING THE PROBLEM.  THEY RESET THE COMPUTER SO THAT THE \"CHECK ENGINE\" LIGHT WENT OFF.  A MONTH LATER, I WAS PULLING OUT INTO TRAFFIC FROM MY DRIVEWAY WITH MY THREE-YEAR OLD IN THE BACK SEAT AND LOST ALL POWER.  THE MAX SPEED I COULD GO WAS ABOUT 10 MPH.  FORTUNATELY, I WAS ABLE TO PULL OFF TO THE SIDE OF THE ROAD.  IT IS A VERY BUSY UNCONTROLLED ACCESS - I WAS FORTUNATE THAT THERE WASN'T MORE TRAFFIC AS AN ACCIDENT WOULD HAVE OCCURRED.  THERE WAS NO WARNING LIGHTS OR INDICATION THAT THIS WAS GOING TO OCCUR - IT JUST STOPPED.  I HAD THE CAR TOWED TO THE VOLVO DEALER WHO DIAGNOSED A MALFUNCTIONING ELECTRONIC THROTTLE MODULE.  THE CAR HAD 72,000 MILES ON IT.  I EXPRESSED MY DISAPPOINTMENT THAT A CAR WITH A REPUTATION FOR SAFETY WOULD FAIL IN SUCH A WAY THAT COULD CAUSE A TERRIBLE ACCIDENT.  I ALSO LODGED A COMPLAINT WITH VOLVO CUSTOMER SERVICE.  RECENTLY, I HEARD ABOUT THE INVESTIGATION ON THIS SAME ISSUE.  I WAS DIRECTED TO YOUR WEBSITE WHEN I SEARCHED FOR ADDITIONAL INFORMATION ON THE INTERNET.  *JB",
        "vin": "YV1SW61R312"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/31/2005",
        "dateOfIncident": "08/31/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135007,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2001 VOLVO V70 STATION WAGON. WHILE DRIVING 35 MPH A LIGHT CAME ON , AND THE LIGHT READ REDUCED PERFORMANCE, AND VEHICLE  STALLED.  HOWEVER, THERE WAS NO REDUCED PERFORMANCE , IT WAS A SUDDEN STALL. THE VEHICLE WAS TOWED TO A DEALERSHIP ON AUGUST 31, 2005. THE DEALER PERFORMED DIAGNOSTIC  TESTING  BUT THE PROBLEM WAS NOT RESOLVED.  THE VEHICLE RESTARTED, AND AS SOON AS IT STARTED,  THE VEHICLE STALLED AGAIN. *AK",
        "vin": "YV1SW58D812"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/15/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131023,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER WAS HAVING PROBLEMS WITH  VOLVO 2001 V-70 CROSS COUNTRY WAGON. THE VEHICLE WAS STALLING AT RANDOM SPEEDS STARTING IN MID-AUGUST OF 2004. CONSUMER TOOK THE VEHICLE TO A REPAIR SHOP, AND THE MECHANIC SUSPECTED THE THROTTLE WAS THE ISSUE. THE PROBLEM WAS RANDOM AND IT WOULD NOT DO THIS FOR SEVERAL DAYS. THE VEHICLE STALLED ON THE HIGHWAY WHILE THE CONSUMER WAS MERGING INTO TRAFFIC. THE VEHICLE WOULD START AFTER  CONSUMER  LET THE CAR SIT FOR A FEW MINUTES. LATER THAT DAY THE CAR STALLED AGAIN. CONSUMER  HAD TO HAVE THE CAR TOWED TO A DEALERSHIP FOR REPAIRS. THIS TIME THE CAR DID NOT START. THE DEALER REPLACED THE THROTTLE MODULE, LOADED SOFTWARE; THROTTLE BODY, CABLE TIE AND ETM RELOADED. THE CAR WAS RUNNING OKAY AT TIMES, BUT THE ENGINE WAS RACING VERY HIGH FOR SECONDS AND THEN RETURNS BACK TO THE NORMAL RATE. THE MOTORWAS REVVING AND THE  TACHOMETER WAS REGISTERING HIGH FOR A MOMENT. CONSUMER CONSIDERED RETURNING THE VEHICLE BECAUSE OF THE PROBLEMS.  THE TOTAL COST ON REPAIRS HAS BEEN OVER $800.00.  NHTSA INVESTIGATION, PE05041. *AK  *JB",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/29/2005",
        "dateOfIncident": "07/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134593,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ON WEDNESDAY AUGUST 24,2005 I WAS DRIVING ON THE INDIANA TOLL ROAD TOWARD CHICAGO WHEN  MY 2001 VOLVO V70 WHICH HAS LESS THAN 40,000 MILES ON IT, STOPPED RESPONDING TO MY FOOT ON THE GAS PEDAL. A MESSAGE LIGHT THAT SAID \"PERFORMANCE REDUCED\" CAME ON AND I COASTED WITHOUT ANY CONTROL OVER THE SPEED OR POWER OF THE CAR. I WAS FORTUNATE TO BE CLOSE TO A TOLL BOOTH AND WAS ABLE TO PULL OVER TO THE SAFETY LANE PAST THE BOOTH.  I WAS FORTUNATE TO BE IN A SAFE PLACE ESPECIALLY AS I HAD MY 7 YEAR OLD SON AND DOG IN THE BACK OF THE CAR. I TURNED OFF THE CAR AND SAT FOR ABOUT 10 MINUTES TRYING TO FIGURE OUT WHAT TO DO (EVEN THOUGH THE CAR HAS ONLY 39500 MILES ON IT, WHICH IS NO LONGER UNDER WARRANTY). I STARTED THE CAR 10 MINUTES AFTER THIS EVENT, IT STARTED UP FINE, AND THERE WERE NO WARNING LIGHTS OR MESSAGES. I DECIDED WE WOULD BE SAFER GETTING OFF THE TOLL ROAD EVEN THOUGH I WAS TAKING A RISK THAT THIS COULD HAPPEN AGAIN.  I DROVE THE REMAINING 15 MILES HOME WITHOUT A PROBLEM (NO MESSAGES OR WARNINGS). I WAS ABLE TO BRING THE CAR TO A MECHANIC WHO IS AN AUTHORIZED VOLVO DEALER, HE CALLED ME ONE HOUR LATER AND TOLD ME THE PROBLEM WAS THE THROTTLE MODULE AND HE WOULD WORK TO FIX IT.  BECAUSE I DIDN'T THINK SOMETHING LIKE THIS SHOULD HAPPEN TO A 4 YEAR OLD CAR WITH VERY LITTLE MILEAGE, I DECIDED TO CHECK THE INTERNET TO SEE IF THERE WAS ANY NEWS REGARDING VOLVO. I GOGGLED VOLVO THROTTLE AND FOUND TWO REFERENCES TO A NEWLY OPENED INVESTIGATION THAT DESCRIBED A SCENARIO VERY SIMILAR TO WHAT WE EXPERIENCED. I DECIDED TO CHECK THIS WEB SITE TO LEARN MORE.  AS OF TODAY, AUGUST 29, 2005, MY CAR IS STILL NOT REPAIRED. THE MECHANIC IS WORKING WITH VOLVO. THE MECHANIC HAS BEEN TOLD SINCE AUG. 25, THAT THE VOLVO COMPUTER, WHICH IS NECESSARY FOR THE THROTTLE REPLACEMENT DOWNLOAD, HAS BEEN DOWN FOR 4 BUSINESS DAYS. IN ADDITION TO BEING PUT IN A DANGEROUS SITUATION ON THE TOLL ROAD WITH MY YOUNG SON, MY CAR WILL COST CLOSE TO $1000 TO FIX, AND I HAVE NOT HAD USE OF MY CAR FOR 5 DAYS!",
        "vin": "YV1SW58D612"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2005",
        "dateOfIncident": "08/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134627,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING LIGHTS HAD BEEN COMING ON, BUT WITHOUT SYMPTOMS.  NOW \"PERFORMANCE REDUCED\" LIGHT COMES ON, CAR WILL ONLY GO ABOUT 20-25 MPH, NON-RESPONSIVE TO GAS PEDAL.  DEALER DIAGNOSIS - ETM FAILURE. *JB",
        "vin": "YV1SW53D411"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "05/20/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133869,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: VEHICLE STALLED/DIED, AND LOST POWER DUE TO THROTTLE BODY FAILURE.  *AK",
        "vin": "YV1SW53D311"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "05/24/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133891,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLVO V70 2001 STATION WAGON.  CAR ACCELERATING AND TRAVELING IN THE 40 TO 50 MPH RANGE VIBRATING AS IF PROBLEM MAINTAINING PRESSURE TO HOLD THE SPEED.  TOOK TO 2 DIFFERENT DEALERS - 1 REPLACED CARS MAIN COMPUTER (WAS UNDER WARRANTY)- PROBLEM WAS NOT CORRECTED, THEN PROBLEM WAS DIAGNOSED AS A SECONDARY COMPUTER, REPLACED AT A COST OF ALMOST $1500.  PROBLEM APPEARS TO BE REDUCED BUT STILL HAPPENS.  VIBRATION IN THE 40 TO 50 MPH RANGE --LIKE THE CAR IS LUGGING IN TOO LOW OF A GEAR OR NOT GETTING ENOUGH GAS-- HAVE BEEN AFRAID TO TAKE CAR ON HIGHWAY TRIPS BECAUSE IT WAS AFTER/DURING THESE TRIPS PROBLEM WAS MOST PRONOUNCED.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133938,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR WAS SHAKING WHEN STARTED. IT ALSO HAD A HORRIBLY LOUD NOISE.   I CALLED TO HAVE IT TOWED TO THE VOLVO DEALERSHIP BUT THEY WERE CLOSED SO I HAD IT TOWED TO THE LOCAL MECHANIC IN MY TOWN.  HE CHECKED THE SYSTEM AND SAID THE THROTTLE WAS DEFECTIVE AND THAT I SHOULD HAVE THIS DONE BY WARRANTY FROM THE VOLVO DEALERSHIP. WHEN I CALLED THE VOLVO DEALERSHIP IN SANTA ROSA, CA. THEY SAID THAT IT COULD BE CAUSED BY A DIRTY THROTTLE  AND I SHOULD HAVE THE CAR CHECKED FIRST TO MAKE SURE THIS WAS NOT THE CASE. MY MECHANIC CHECKED THIS AND IT COST ME $129.35 FOR HIM TO TROUBLE SHOOT THE SITUATION TO MAKE SURE THIS WAS A WARRANTY ISSUE.  HE THEN CALLED THE VOLVO DEALERSHIP AND SPOKE TO ALEX IN SERVICE AND TOLD HIM THAT THE PROBLEM WAS THE THROTTLE DEFECT.  THE CAR WAS THEN TOWED TO THE DEALERSHIP/SERVICE DEPARTMENT. THEY CHECKED IT AND SAID A PART IN THE THROTTLE WAS DEFECTIVE. THEY REPLACED THAT PART AND THEN HAD TO REPLACE THE ENTIRE ETM SYSTEM. THEY HAD PROBLEMS DOWNLOADING THE NEW SOFTWARE BUT FINALLY WERE ABLE TO GET IT TO RUN.  THEY GAVE ME A LOANER CAR BUT WOULDN'T PAY FOR MY CHARGES TO HAVE THE PROBLEM DIAGNOSED. ($129.00).  I WOULD HAVE HAD IT TAKEN TO THEM IN THE FIRST PLACE BUT THEY WERE CLOSED.  THIS WAS VERY FRIGHTENING! IT TOOK 5 DAYS TO REPAIR THE VEHICLE",
        "vin": "YV1SW61R411"
    },
    {
        "components": "FUEL SYSTEM, OTHER,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "08/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133731,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD A SUDDEN LACK OF POWER AND IN SOME TURNS WOULD STALL. THESE WOULD CAUSE A DANGEROUS SITUATION IN TRAFFIC. I TOOK THE CAR TO THE DEALER AND THEY HAD THE ELECTRONIC THROTTLE MODULE AND THROTTLE BODY HAD TO BE REPLACED. THIS IS VERY EXPENSIVE AND SHOULD NOT OCCUR.",
        "vin": "YV1SW58D712"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/18/2005",
        "dateOfIncident": "07/27/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133329,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY, THE MESSAGE CENTER IN MY VEHICLE INDICATED THAT THE EMISSIONS SYSTEMS EXPERIENCED A FAILURE. I TOOK THE CAR IN AND THE DEALER SAID THAT THE ETM NEEDED TO BE REPLACED.  I OWN 2001 VOLVO V70 T5 WAGON. *JB",
        "vin": "YV1SW53DX12"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2005",
        "dateOfIncident": "08/15/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132975,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70 ETM FAILURE. \"PERFORMANCE REDUCED\" WARNING MESSAGE ON DASH, CAUSING LOSS OF POWER AND SEVERE SURGING/BUCKING..VERY SCARY AND UNSAFE, RELUCTANT TO DRIVE CAR IN THIS COND.   *NM",
        "vin": "YV1SW58D111"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132421,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2001 VOLVO V70 2.4 T  1. POWER LOSS UNDER NORMAL OPERATIONAL CONDITIONS. SEVERAL TRIPS TO DEALERSHIP. SERVICE LIGHT COMING ON AND OFF.  2. DIED IN TRAFFIC WITH MY WIFE AND OR SHE AND OUR CHILDREN IN THE CAR ON SEVERAL OCCASIONS. WOULD SIT, THEN BE FINE AGAIN. I THOUGHT BAD GAS OR SOMETHING. RESEARCHED SYMPTOMS/CONDITIONS ON THE WEB AND FOUND THAT WHAT WE WERE EXPERIENCING SOUNDED LIKE PRELUDE TO CATASTROPHIC FAILURE OF ETM. WE TOOK IT TO AN INDEPENDENT MECHANIC INSTEAD OF THE DEALERSHIPS WHICH FOUND NOTHING WRONG AND ASKED THEM TO CHECK THE ETM. COULDN'T GET CODES OF ABOUT IT BECAUSE IT RESETS ITSELF EVEN AFTER CODES COME ON AND CLEARS THE CODES. FINALLY GOT RIGHT IN WHEN IT HAPPENED AND SURE ENOUGH, ETM WAS FAILING  3. WE HAD TO REPLACE IT OUT OF OUR OWN POCKET FOR $800 TO $900. WE WERE TOLD BY THE MECHANICS THAT IT WASN'T FIXED FOREVER, THAT IT WOULD LIKELY START TO FAIL AGAIN AT SOME POINT BECAUSE IT'S A DESIGN FLAW.   THE INCIDENT DATE IS NOT CORRECT...IT WAS SEVERAL MONTHS AGO WHEN WE GOT IT FIXED BUT I CAN'T FIND THE REPAIR SLIP ATM FOR EXACT DATE. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "11/29/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132210,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: VEHICLE STALLED/DIED, AND LOST POWER DUE TO THROTTLE BODY FAILURE.  *AK",
        "vin": "YV1SZ58D411"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "01/12/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132281,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ETM (ETS)  FAILURE ON MY 2001 VOLVO V70 T5. SLUGGISH RUNNING, NOT RELIABLE, ALMOST STALLING AND UNSAFE. GAVE WARNINGS THAT WOULD CLEAR WHEN THE IGNITION WAS TURNED OFF AND THEN BACK ON. VOLVO DEALER SAID THROTTLE BODY WAS BAD. AFTER REPLACEMENT AT 92303 MILES, CAR RAN FINE. [XXX].  *JB UPDATED 07/19/2012 *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "YV1SW53D611"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2005",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132137,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 VOLVO V70 T5 (TURBO WAGON)  I HAD TO REPLACE THE ETM WITH YEAR.  I SEE YOU ARE INVESTIGATING VOLVO FOR THIS.  I WOULD LIKE TO BE PART OF THAT INVESTIGATION.  PLEASE CONTACT ME FOR ANY FURTHER DETAILS NEEDED.  *NM",
        "vin": "YV1SW53DX11"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/08/2005",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132007,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INTERESTED TO HEAR OF THE 2001 VOLVO V70 INVESTIGATION.  LAST FALL, MY CAR REPEATEDLY DID NOT ACCELERATE WHEN I PRESSED ON THE GAS PEDAL.  THE DEALERSHIP REPLACED THE TRANSMISSION.  I HAVE TWICE FELT THE PROBLEM MOMENTARILY, BUT THEN THE CAR RETURNED TO NORMAL FUNCTION.*JB",
        "vin": "YV1SZ58D311"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2005",
        "dateOfIncident": "04/14/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131786,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REPEATED SKIPPING AND HESITATION OF OUR V70 T5 SW  ALONG WITH A \"REDUCED PERFORMANCE ERROR\" MESSAGE RESULTED IN OUR GOING TO THE DANBURY CT DEALERSHIP, WHERE THEY TOLD US THE THROTTLE AND SOFTWARE NEEDED REPLACEMENT. THE COST WAS $899.17. WE SERVICE OUR CAR REGULARLY AND HAVE THE DOCUMENTATION TO PROVE IT. WE HAVE HAD NO ACCIDENTS WITH THE CAR PRIOR TO THIS ENGINE PROBLEM. BECAUSE OF WIDESPREAD REPORTS OF THE SAME PROBLEM OCCURRING ON OTHER VOLVO V70 STATION WAGONS, WE BELIEVE THE CAUSE OF THE ENGINE SKIPPING TO BE AN INHERENT STRUCTURAL FLAW AND WE REQUEST REIMBURSEMENT OF OUR EXPENSES.  THE DEALER WHO MADE THE $899.17 REPAIR WAS VOLVO OF DANBURY, 203-743-4667.*JB",
        "vin": "YV1SW53DX11"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/06/2005",
        "dateOfIncident": "03/19/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131806,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN LOSS OF POWER - HAD TO PULL OVER TO THE SIDE OF A 65 MPH HIGHWAY. THIS HAPPENED 3 TIMES ON THE SAME DAY. IMMEDIATELY TOOK TO MY AUTO REPAIR SHOP (KOTLAR) WHO DIAGNOSED THE PROBLEM AS A BAD THROTTLE BODY FAILURE. THE THROTTLE BODY WAS REPLACED BY KOTLAR AUTO REPAIR AND THEN MY CAR HAD TO BE TOWED TO BIG DEE VOLVO DEALER IN WHITE PLAINS WHO DOWNLOADED THE APPROPRIATE SOFTWARE. TOTAL CHARGES WERE $929.40. LUCKILY I WAS IN THR RIGHT HAND LANE WITH LIMITED TRAFFIC ON THE HIGHWAY OR ELSE THIS COULD HAVE BEEN A HUGE SAFETY ISSUE. *JB",
        "vin": "YV1SW53D712"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/05/2005",
        "dateOfIncident": "11/12/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131707,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON EXPRESSWAY AT APPROX. 60 MPH, CAR LOST SPEED AND POWER STEERING.  TOWED INTO VOLVO DEALERSHIP IN OKLAHOMA CITY.  REPAIRS COSTING APPROX. $1,200 WERE MADE TO ELECTRONIC THROTTLE OR TRANSMISSION.  I CAN PROVIDE THE STATEMENT INDICATING THE REPAIRS.   *JB",
        "vin": "YV1SW58D612"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/05/2005",
        "dateOfIncident": "12/27/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131733,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER  WAS  TRAVELING FROM CHARLOTTE TO CINCINNATI IN  2001 VOLVO V70 WHEN  VEHICLE SUDDENLY LOST POWER . COULD NOT DRIVE FASTER THAN 20 MPH.  WAS ABLE TO EXIT ONTO THE HIGHWAY SHOULDER. MESSAGE LIGHT SAID PERFORMANCE REDUCED,  BUT THERE WAS NO EXPLANATION FOR THIS MESSAGE IN THE SERVICE MANUAL. VOLVO ROADSIDE SERVICE CLAIMED TO BE UNAWARE OF WHAT COULD BE WRONG, AS DID THE NEAREST DEALER. AFTER TWENTY MINUTES THE CAR RESTARTED AND RAN WELL FOR TWO DAYS . THIS WAS A HOLIDAY WEEKEND AND CONSUMER COULD NOT OBTAIN SERVICE. HOWEVER, ON RETURN TRIP TO CHARLOTTE VEHICLE EXPERIENCED THE SAME FAILURE 4 OR 5 TIMES, A VERY SCARY AND DANGEROUS CONDITION FOR INTERSTATE DRIVING. WHEN CONSUME R SCHEDULED AN APPOINTMENT WITH  LOCAL DEALER SERVICE DEPARTMENT THE SERVICE MANAGER CLAIMED TO BE UNAWARE OF ANY SUCH PROBLEM WITH OTHER VOLVOS. BY THE TIME  CONSUMER ARRIVED FOR THE APPOINTMENT SHE RESEARCHED THE ISSUE ON THE INTERNET AND  LEARNED ABOUT THE ELECTRONIC THROTTLE CONTROL MODULE (ETM) FAILURE. THE SERVICE DEPARTMENT AGAIN DENIED KNOWING ABOUT THIS FAILURE  BUT ADNITTED THAT THE THROTTLE   FAILED ON  THIS VEHICLE.  IT WAS REPLACED AT A COST OF OVER $900.  CONSUMER  ATTEMPTED TO PURSUE COMPENSATION AND A RECALL DUE TO SAFETY ISSUES BUT VOLVO  REFUSED TO DISCUSS THE MATTER WITH  CONSUMER.  *AK",
        "vin": "YV1SW53DX11"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "06/22/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131607,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE PURCHASED OUR 2001 VOLVO V70 STATION WAGON 12 MARCH AND HAVE SINCE HAD THE CAR INTO THE DEALER 3 TIMES FOR PROBLEMS WITH THE TRANSMISION.  IT STALLS AND TENDS TO NOT GAIN SPEED.  WE HAD IT SERVICED 2 TIMES AND THIS LAST TIME THAT STATED THEY REPLACED IT.  WE ARE STILL EXPERIENCING THE SAME PROBLEM WITH THE ENGINE THOUGH.  *JB",
        "vin": "YV1SW58D511"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "08/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10131627,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR LOST POWER OCCASIONALLY WHEN SHIFTING BETWEEN FIRST AND SECOND GEARS.  IT WOULD NOT ACCELERATE, BUT IT REVVED TO OVER 6,000 RPMS.  THE CAR WOULD PULL BACK AND THEN LUNGE INTO GEAR.  IT HAD A WHIPLASH EFFECT ON THE DRIVER AND PASSENGERS.  AFTER 18 VISITS TO THE DEALER AND PROBABLY AS MANY CALLS TO VOLVO OF N. AMERICA, I FOUND ANOTHER DEALER.  THEY REPLACED THE VALVE BODY LAST YEAR AND IT HASN'T HAPPENED SINCE. I CAN'T ANSWER THE NEXT QUESTION BECAUSE IT HAPPENED SEVERAL TIMES A WEEK FOR 3 YEARS. *JB",
        "vin": "YV1SW61R312"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131248,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE(2001 VOLVO V70) STALLED AT INTERSECTIONS 5 TIMES. SAME TROUBLE IN 2004 AND REPAIRED AT DEALERSHIP. NO ACCIDENT YET.*JB",
        "vin": "YV1SW58D612"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "06/06/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131445,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED ON TWO OCCASIONS VEHICLE LOST POWER.  THE FIRST TIME THERE WAS A COMPUTER MESSAGE THAT DISPLAYED REDUCED PERFORMANCE. THEN VEHICLE STALLED, BUT IMMEDIATELY STARTED UP.  THE SECOND TIME WHILE CONSUMER WAS DRIVING  40-45 MPH THE VEHICLE STALLED.  THE REDUCED PERFORMANCE LIGHT WAS DISPLAYED AGAIN, BUT THE CAR DID NOT IMMEDIATELY START UP. *AK",
        "vin": "YV1SW53D012"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131477,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNED A 2001 VOLVO V70. THE NHTSA ACTION NUMBER WAS PE05041. VEHICLE STALLED/LOST POWER DUE TO ELECTRICAL PROBLEMS.  *AK",
        "vin": "YW15W53D012"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "06/22/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130975,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2001 VOLVO V70 T5. THE CAR SUDDENLY AND WITHOUT WARNING SIMPLY STOPPED RUNNING WHILE I WAS DRIVING AT HIGHWAY SPEEDS ON THE INTERSTATE. NO POWER STEERING, NOTHING. IT WAS SHOCKING. THE REPAIR SHOP SAID THAT IT WAS THE THROTTLE BODY THAT NEEDED TO BE REPLACED... FOR A LOT OF MONEY.    HE ALSO SAID THAT THIS IS A VERY COMMON PROBLEM WITH THESE CARS, AND THAT THE PART INSTALLED BY THE FACTORY WAS \"ENGINEERED TO FAIL\" DUE TO THE DESIGN.  *NM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "02/07/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130989,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I READ IN OUR LOCAL PAPER THAT THE NHTSA WAS INVESTIGATING THE LOSS OF SPEED  AND STALLING OF THE ENGINE IN VOLVO WAGONS IN THE 2001 MODEL YEAR.  I TOO HAVE HAD THE SAME ISSUE.  THE VEHICLE WOULD LOOSE POWER AND SLOW TO VERY LOW SPEEDS AND OPERATE IMPROPERLY.  THE REASON FOR THE PROBLEM WAS THE COMPUTER MODULE THAT REGULATES THE FUEL FLOWING TO THE ENGINE.  I HAD TO HAVE IT REPLACED AT A COST OF OVER $1000.  THAT HAS APPEARED TO SOLVE THE ISSUE.  VERY EXPENSIVE PART TO HAVE GO BAD AND VERY DANGEROUS SITUATION.  MY WIFE WAS DRIVING THE CAR WHEN IT FIRST OCCURRED.  THE CAR SLOWED UNEXPECTEDLY IN HEAVY TRAFFIC AND A LARGE TRUCK ALMOST RAN UP ON THE CAR FORTUNATELY SHE WAS ABLE TO TURN OFF THE ROAD AND THE TRUCK WAS ABLE TO SLOW DOWN IN TIME SO NO INJURY OCCURRED.   *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "07/30/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131093,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:   A 2001 VOLVO V70.  THE ENGINE STALLED ON 7-30-04 WHILE DRIVING.  THE PERFORMANCE DECREASED AND  WARNING LIGHT CAME ON.   CONSUMER CONTACTED THE DEALERSHIP AND THEY TOLD HER NOT TO WORRY ABOUT IT SINCE THERE WAS NO PERFORMANCE DECREASE AT THAT TIME.  THE NEXT DAY VEHICLEWOULD START BUT WOULD NOT ACCELERATE.  THE ENGIN STUTTERED AND THEN STALLLED.  WITHIN A WEEK THIS OCCURRED AT LEAST 6 TIMES.   CONSUMER TOOK VEHICLE TO THE DEALERSHIP, BUT, SHE DID NOT REMEMBER EXACTLY WHAT THEY DID.   SERVICE RECORDS WERE AVAILABLE.   THERE WERE NO MORE PROBLEMS AGAIN UNTIL 1-2005.   THIS TIME THE DEALERSHIP COULD NOT FIND THE CAUSE OF THE  PROBLEM.  THEY DID NOTHING TO ALTER THE VEHICLE.  AT THIS POINT THERE HAVE BEEN NO OTHER PROBLEMS WITH THE VEHICLE.  *AK",
        "vin": "YV1SW58D811"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "03/10/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131127,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A V70 VOLVO 2001 WAGON AND IT HAS STALLED SEVERAL TIMES ESPECIALLY WHILE STOPPED.  WE TOOK IT IN TO THE DEALER CENTURY VOLVO IN HUNTSVILLE ALABAMA AND THEY REPLACED THE ELECTRONIC THROTTLE MODULAR AN $800.00 PART PLUS LABOR FOR A TOTAL OF $1100.  I NOW SEE THAT THE FEDS ARE INVESTIGATING THIS PROBLEM.  WHAT ARE MY OPTIONS, WILL I GET REIMBURSED FROM THE DEALER OR VOLVO, WILL THERE BE A RECALL?  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130845,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATES THE CAR HAS ON NUMEROUS OCCASIONS SHUT DOWN WHILE DRIVING. IT GENERALLY RESTARTED BUT NOT ALWAYS.   HAD TO HAVE IT TOWED FROM TIME TO TIME. HAS BEEN HAVING THIS PROBLEM SINCE THE FALL OF LAST YEAR. THE DEALER ATTEMPTED TO DIAGNOSE THE PROBLEM, AND FELT IT NEEDED A NEW STARTER.  HAD A NEW STARTER PUT ON AND THEN A NEW IGNITION , AND THAT INITIALLY SOLVED THE PROBLEM.  BUT THEN THE PROBLEM RECURRED, VEHICLE STALLED AND  DIED ON THE HIGHWAY. *AK",
        "vin": "YV1SW61R312"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "07/15/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130857,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ALTERNATOR HAS INTERMITTENT CHARGING PROBLEMS, LEFT STRANDED WITH DEAD BATTERY.  WHEN I SPOKE WITH VOLVO THE SERVICE MANAGER SAID THAT IT IS NOT UNCOMMON PROBLEM.  I TOOK THE CAR TO A SERVICE STATION AND THEY HAD SEEN THE PROBLEM ON MULTIPLE VOLVOS AS WELL.  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2005",
        "dateOfIncident": "06/29/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128492,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NO EVENT LEADING TO FAILURE.  CAR HAS OPERATED PERFECTLY SINCE PURCHASED, JUNE 2004.  2. FAILURE OCCURED WHILE DRIVING FROM LUNCH.  CAR WAS DRIVEN APPROXIMATELY FIFTY-FIVE (55) MILES TO GET TO WORK.  UPON RETURING FROM LUNCH CAR STALLED, WOULD ONLY IDLE, SO ONLY 20-30 MPH SPEED WAS ACHEIVED.  LIMPED INTO WORK PARKING LOT AND HAD HIGH IDLE.  SHUT DOWN VEHICLE.  CAME BACK NEXT MORNING, CAR STARTED BUT TOOK TO INDEPENDANT REPAIR SHOP.  CAR HAD CODES OF MAF SENSOR FAILURE AND ETS SENSOR FAILURE.  THEY CLEARED CODES AND CAR WAS DRIVABLE.  I DROVE HOME THAT EVENING BUT CAR EXIBITED SAME FAILURE ON CA HWY 58.  I DISCONNECTED BATTERY-CLEARING CODES AND MADE IT TO RESIDENCE.  3. TOOK VEHICLE TO VOLVO DEALER IN BAKERSFIELD, CA. TOOK ONE WEEK TO REPRODUCE TROUBLE CODES.  DEALER REPLACED ETS-ELECTRONIC THROTTLE SENSOR AND CHARGED $855.20 FOR REPAIR.  TRIED TO GET THE OLD ETS BUT WAS TOLD THE PART HAD A \"CORE\" CHARGE AND WAS NOT RETURNABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127291,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER STATED  THE VEHICLE STALLED WHILE DRIVING WITHOUT ANY WARNING SIGNS.  THE ELECTRONIC THROTTLE MODULE (EMT) WAS REPLACED, BUT THIS DID RESOLVE THE PROBLEM.   CONTACT TRIED TO  NOTIFY THE MANUFACTURER BUT DID NOT SUCCEED.  CONTACT CALLED THE VOLVO DEALERSHIP AND THEY WERE AWARE OF THIS PROBLEM.  THE PROBLEM WAS WORKED ON  BEFORE SHE PURCHASED THE VEHICLE.*AK",
        "vin": "YV1SZ58D711"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/14/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115676,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DAMPER MOTOR AND RECIRCULATION MOTOR IN THE CONSUMER'S 2001 VOLVO V70 FAILED AND AS A RESULT THE HEATING AND COOLING SYSTEM MALFUNCTIONED.  *NM  *JB",
        "vin": "YV1SW61R011"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/09/2004",
        "dateOfIncident": "11/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099725,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE REMOTE TO OPEN AND CLOSE THE DOOR LATCHES FAILED ON NUMEROUS OCCASIONS.  CONSUMER CONTACTED THE DEALER FOR INSPECTION.  *AK",
        "vin": "YV1SW58D411"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2004",
        "dateOfIncident": "05/01/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093824,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A CERTIFIED PREOWNED V70 16000 MILES.  SHORTLY AFTER PURCHASE I'VE EXPERIENCED INTERMITTENT ,SEVERAL SECOND HIGH ENGINE REV WHEN AUTOMATIC SHIFTS FROM 1ST GEAR TO 2ND GEAR.  DEALER CANNOT FIND ANYTHING WRONG.   *NM",
        "vin": "YV1SW61R412"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2004",
        "dateOfIncident": "08/10/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089533,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING ACCELERATION WHEN CRUISE CONTROL IS ENGAGED BUT NOT EXCLUSIVELY THE VEHICLE LOSES POWER.  AS A RESULT, CONSUMER HAS TO PULL OVER TO THE SIDE OF THE ROAD AND RESTART THE VEHICLE. *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/16/2004",
        "dateOfIncident": "03/16/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079384,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY WHEN ACCELERATING AT ANY SPEED  GEARS DID NOT MESH PROPERLY, AND  VEHICLE  REVVED  FOR A FEW SECONDS. THIS PROBLEM OCCURRED TWENTY TIMES SINCE MARCH OF 2004.  DEALER  INSPECTED THE VEHICLE, BUT COULD NOT FIND THE CAUSE OF THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/20/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074021,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH WINDSHIELD AND HEADLIGHTS.   *MR   THE WINDSHIELD PRESENTED A GLARE WHILE THE VEHICLE WAS IN MOTION, AT NIGHT, THE LOW BEAM SETTING RESULTED IN INSUFFICIENT LIGHT PROTECTION, AND THE HIGH BEAM HAD LIMITED USE.   *SC  *JB",
        "vin": "YV1SZ58D111"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/06/2004",
        "dateOfIncident": "02/02/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065670,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THROTTLE BODY (ACCORDING TO DEALER) FAILURE CAUSES VEHICLE'S COMPUTER MANAGEMENT SYSTEM TO REDUCE PERFORMANCE UNEXPECTEDLY.  THIS UNEXPECTED FAILURE AND PERFORMANCE DEGRADATION POSES HIGH RISK IF TRAVELING ON BUSY HIGHWAY AT TIME OF FAILURE.  *LA",
        "vin": "YV1SW53D311"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2004",
        "dateOfIncident": "02/09/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065671,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILED AT HIGHWAY SPEED.  REPAIR FACILITY UNABLE TO OBTAIN NEW PARTS FOR REBUILD AND REMANUFACTURED ORDER THROUGH VOLVO AT SOME OWNER EXPENSE ABOVE WARRANTY (MILEONE ELITE: WWW.MILEONE.COM) ALLOWANCE.  REPAIR FACILITY VISUALLY DESCRIBED FAILURE AS A HARD PART FAILURE (TECH SAID IT LOOKED AS THOUGH IT  \"EXPLODED\" DUE TO EXCESS PRESSURE FROM THE VALVE BODY).  THE CAR WAS REPAIRED AND RETURNED TO THE OWNER OVER 4 WEEKS LATER.  DELAY WAS CAUSED BY WARRANTY COMPANY UNABLE TO DELIVERING THE CORRECT USED TRANSMISSION (3X).  OWNER EXPENSE WAS INCURRED WHEN DECISION WAS MADE TO PURCHASE A REMANFACTURED TRANSMISSION.  *LA",
        "vin": "YV1SW53D311"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/05/2004",
        "dateOfIncident": "03/05/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061500,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WILL PROVIDE FURTHER INFORMATION ON  GISLAVED NORTH FROST TIRES. *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/12/2004",
        "dateOfIncident": "02/07/2004",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058038,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 30 MPH  VEHICLE WAS INVOLVED IN A FRONTAL CRASH. UPON IMPACT,  DUAL AIR BAGS DID NOT DEPLOY. NO INJURIES REPORTED. *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/22/2003",
        "dateOfIncident": "09/06/2003",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038620,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN ROOF EXPLODED WHILE THE CONSUMER WAS DRIVING.   *JB   *TS   *SCC  *JB",
        "vin": "YV1SW530012"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/03/2003",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001974,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PURCHASED IN 07/01.  CONSUMER ADVISED WHILE DRIVING, NOTICED VEHICLE WOULD INTERMITTENTLY LOSE TRACTION ON DRY PAVEMENT.  ONCE INCLEMENT WEATHER ARRIVED(I.E. RAIN, LIGHT SNOW), NOTICED TRACTION CONTROL TURNS ON/OFF ERRATICALLY CAUSING WHEELS TO SLIDE, ESPECIALLY WHEN VEHICLE IS ON A SLIGHT TO MAJOR INCLINE.  WHEN ON AN INCLINE, CONSUMER HAS TO LET VEHICLE SLIDE BACKWARD TO MORE LEVEL GROUND BEFORE IT WILL ACCELERATE.  VEHICLE HAS BEEN CHECKED BY DEALER WHO HAS BEEN UNABLE TO DUPLICATE OR DETERMINE CAUSE.  CONSUMER IS CONCERNED THAT DEALER DID NOT ATTEMPT TO DUPLICATE PROBLEM IN \"LIKE\" CONDITIONS I.E. RAIN OR LIGHT SNOW ON AN INCLINE. TS",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "12/04/2002",
        "dateOfIncident": "12/02/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770448,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT MY VOLVO THE 17 RIMS WERE ALREADY ON THE CAR.  I FEEL I WAS NOT SUFFICIENTLY EDUCATED ABOUT THESE WHEELS SO THAT I COULD MAKE N INFORMED CHOICE WHETHER TO KEEP THEM OR NOT.  I CURRENTLY HAVE THE 6TH AND 7TH BENT RIM ON MY CAR.  I HAVE ALL THE RECEIPTS FROM THE OTHER FIVE RIM REPAIRS IN LESS THAN TWO YEARS. TODAY I ORDERED NEW 16 RIMS COSTING $1,000 AND IT WILL COST ANOTHER $1,000 TO BUY THE NEW TIRES AND HAVE THEM INSTALLED.  I HAVE SPENT ALMOST $1200.  ON RIM REPAIRS AND REPLACING DAMAGED TIRES.  I WANT ALL THAT MONEY BACK IT IS ABSURD TO SPEND $40,000 ON A CAR THAT KEEPS COSTING SO MUCH MONEY.  DT",
        "vin": "YV1SW53DX11"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/30/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8017679,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI LOCK BRAKES WILL GRAB, NOT STOPPING SMOOTHLY WHEN PEDAL IS DEPLOYED. OCCUPANTS ARE SLUNG FORWARD.  THIS IS COMMON FOR THIS PARTICULAR MODEL, \"QUALITATIVE PROBLEM\".  PLEASE DESCRIBE DETAILS.  *AK",
        "vin": "YV1SW53D412"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/20/2002",
        "dateOfIncident": "08/16/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016724,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "STABILZER BAR ON THE LEFT FRONT WHEEL BROKE WHILE  CONSUMER WAS DRIVING. CONTACTED DEALER, AND THE DEALER WAS NOT WILLING TO DO ANYTHING.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "05/29/2002",
        "dateOfIncident": "05/14/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010688,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED 2 OTHER VEHICLES ALMOST COLLIDED WITH EACH OTHER, AND A HYDRAULIC SOUND WAS COMING FROM BRAKE PEDAL WHEN BRAKES WERE APPLIED, THEN VEHICLE VIBRATED AND SKIDDED ACROSS THE LANE OF THE HIGHWAY.*AK  *MJ",
        "vin": "YP1SCI8D011"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/22/2002",
        "dateOfIncident": "10/15/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757209,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TAILGATE DOOR WILL NOT LOCK AND IS SAFETY HAZARD. *AK",
        "vin": "YV1SW53D011"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "01/09/2002",
        "dateOfIncident": "01/09/2002",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8001903,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED INSIDE A PARKING LOT.  VEHICLE WAS IN DRIVE AND DRIVER REMOVED KEY FROM IGNITION.  WHEN SHE RETURNED TO PICK HER CAR UP, VEHICLE HAD ROLLED DOWN THE HILL, AND HIT A PARKED VEHICLE.  DEALERSHIP WAS AWARE OF  PROBLEM.*AK *TT",
        "vin": "YV1SW58D110"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/05/2001",
        "dateOfIncident": "11/04/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 754090,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF BLEW IN WHILE GOING THROUGH A CAR WASH DRYING CYCLE. *AK",
        "vin": "YV1SW61R711"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/24/2001",
        "dateOfIncident": "10/01/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753602,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH PROBLEM: 5 SPEED MANUAL TRANSMISSION. CLUTCH STICKS AFTER PRESSING IT IN, WHEN IT COMES BACK UP. THIS HAPPENS WHEN TEMPERATURE IS COLD. DEALER CHECKED OUT 4 TIMES, COULD NOT REPRODUCE PROBLEM. INDEPENDENT MECHANIC FOUND PROBLEM AT ONCE AND STATES THAT CLUTCH BEARING NEEDS LUBRICATED OTHERWISE WILL WEAR PREMATURELY. DEALER REFUSES TO DO THIS. LIGHT PROBLEM: PROBLEM EXACTLY THE SAME AS 99-00 RECALL NHTSA CAMPAIGN ID: 00V405000. YEAR 2001 SHOULD GET INCLUDED IN RECALL. DEALER \"FIXED\" PROBLEM ONCE BY \"CLEANING THE SOCKET\"  PROBLEM REOCCURED. REQUIRED RECALL FIX IS TO REPLACE BULB AND SOCKET AND NOT \"CLEAN SOCKET\".",
        "vin": "YV1SW53D111"
    },
    {
        "components": "STEERING,SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/16/2001",
        "dateOfIncident": "06/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 753269,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "HEARD LOUD \"KNOCKING\" WHEN TURNING RIGHT AND LEFT, DECELERATING, AND ENTERING/EXITING PARKING LOTS.  TOOK CAR TO DEALERSHIP THREE TIMES AND TOLD NOTHING WAS WRONG.  IT WAS SIMPLY A VERY HEAVY CAR AND MIGHT MAKE THAT NOISE IN THOSE CIRCUMSTANCES.  PROBLEM WORSENED.  TOOK TO INDEPENDENT MECHANIC AND HE FOUND BROKEN MOTOR MOUNTS WHICH LEFT ENGINE SITTING ON TOP OF STEERING COLUMN.  HE STATED IT WAS A DESIGN FLAW THAT HAS NOW DAMAGED THE STEERING AND POSSIBLY ALIGNMENT, SUSPENSION, ETC.  ALSO NOTED THAT PLACEMENT OF ENGINE ON TOP OF STEERING COLUMN WILL PROBABLY CAUSE THE MOTOR MOUNTS TO BREAK AGAIN WITHIN SIX MONTHS.*AK",
        "vin": "YV1SW53D311"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2001",
        "dateOfIncident": "09/03/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 9004884,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER MAKING A NUMEROUS OF RIGHT TURNS THE STEERING WHEEL LOST ALL POWER ASSIST, HAD TO GO STRAIGHT BECAUSE THE VEHICLE WAS UNABLE TO TURN, REPLACE STEERING RACK.",
        "vin": "YV1SW530811"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/18/2001",
        "dateOfIncident": "09/16/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 896450,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO MAKE A LEFT TURN VEHICLE IT STALLED WITHOUT WARNING.  INDICATOR LIGHTS FLASHED ACROSS DASH,  AND VEHICLE STALLED.  CONTACTED DEALER ,AND COULDN'T FIND  CAUSE. *AK",
        "vin": "YZ1SZ58D011"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/13/2001",
        "dateOfIncident": "09/13/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752156,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES TRAVEL TO WITHIN 1 INCH OF FLOOR AND ARE TOO NEAR ACCELERATOR. POSSIBLE TO SIMULTANEOUSLY ACCELERATE AND BRAKE AT SAME TIME WITH A SIZE 11/2 SHOE.*AK",
        "vin": "YV1SZ58D911"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/18/2001",
        "dateOfIncident": "06/06/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 747000,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "IF PEDAL BRAKE WAS NOT APPLIED, CAR WOULD HAVE ROLLED FORWARD ON HILL EVEN THOUGH TRANSMISSION WAS IN REVERSE GEAR.",
        "vin": "YV1SW61R812"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/17/2001",
        "dateOfIncident": "12/29/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785008,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHILE TRAVELING AT HIGH SPEED ENGINE SUDDENLY SHUT DOWN, VEHICLE WAS TOWED TO DEALERSHIP AND AFTER INSPECTION OF THE VEHICLE IT WAS DETERMINED THAT DEBRIS WAS LEFT IN THE FUEL TANK, THAT AT CERTAIN FUEL LEVELS CLOG THE FUEL LINE THAT CAUSES ENGINE TO SHUT DOWN, THE DEALER HAS SOLVED THE PROBLEM BY USING A FUEL FILTER, HOWEVER DEALER STILL HAS THE VEHICLE BECAUSE THEY HAVE DISCOVERED THAT THE TANK RUNS DRY WHILE STILL INDICATING 75 MILES OF GAS ON THE INSTRUMENTATION.       *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/01/2001",
        "dateOfIncident": "02/28/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 560997,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDEWALL OF THE RIGHT FRONT TIRE FAILED, THE CONSUMER REQUEST REIMBURSEMENT (MICHELIN XSE 205/55/R16).  NLM",
        "vin": "YV1AX8858J1"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/24/2001",
        "dateOfIncident": "02/28/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 744451,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "SIDEWALL OF THE TIRE FAILED.  THERE WAS NO UNUSUAL ROAD CONDITION TO INITIATE FAILURE.  MANUFACTURER CLAIMS TIRE FAILURE RESULTED FROM IMPACT WHICH IS NOT COVERED UNDER WARRANTY.*AK (TIRESIZE: 205/55/R16)( DOT NUMBER:  TIRE SIZE: 205/55/R16 )",
        "vin": "YV1AX8858J1"
    },
    {
        "components": "AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2001",
        "dateOfIncident": "03/30/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 885323,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER PUT COFFEE INTO CUP HOLDER AND IT LEAKED THOUGH HOLDER INTO COMPUTER, BENEATH IT.  AIRBAG LIGHT CAME ON READING \"URGENT SRS SEE DEALERSHIP\".  DEALER SAYS THAT LIQUID CORRODED COMPUTER, AND WAS HOLDING CONSUMER RESPONSIBILE FOR REPAIRS.  *AK  *YH",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/26/2001",
        "dateOfIncident": "03/01/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 884223,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DOORS WILL NOT CATCH WHEN TRYING TO OPEN  DOOR, AND SLAMS ITSELF CLOSED ON A MODERATE SLOPE.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION/ATTACHMENTS.*AK",
        "vin": "YV1SW53D612"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/21/2001",
        "dateOfIncident": "06/01/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 883713,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC THROTTLE PEDAL FAILS TO WORK PROPERLY. THERE IS A MAJOR DELAY OF FUEL GETTING INTO  ENGINE. HAVE TAKEN TO DEALERSHIP, AND MECHANIC HAS NO CORRECTIVE SOLUTION FOR  REPAIR. HAS BEEN TO DEALERSHIP WITH PROBLEM 3 TIMES SO FAR. VOLVO V70T5.*AK   ENGINE IDLE WAS TOO LOW CAUSING DELAY IN THROTTLE. *YH",
        "vin": "YV1SW53D311"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/12/2001",
        "dateOfIncident": "03/11/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742290,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "MANUFACTURER CLAIMS ROAD HAZARD NOT TIRE DEFECT. HOWEVER, THE TIRE DEALER SAYS THAT THESE WHEELS AND TIRES WILL CONTINUE TO FAIL BECAUSE THEY ARE NOT APPROPRIATE FOR NJ ROADS. WE HAVE A MERCURY SABLE WHICH WE HAVE DRIVEN ON THE SAME ROADS FOR THE EQUIVALENT AVERAGE MIOLEAGE WITHOUT TIRE FAILURE. AT THESE MILEAGES THREE TIRE FAILURES  IN A MONTH IS MORE THAN WE THINK IS NORMAL FOR A CAR BEING DRIVEN ON NORMAL CITY  STREETS AND HIGHWAYS.  WE WILL CONTINUE TO TALK TO THE DEALER, HOWEVER AT THIS POINT THEY WILL NOT TAKE ANY RESPONSIBILITY.*AK (DOT NUMBER: XTCUCO41 2)",
        "vin": "YV1SW53D612"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2001",
        "dateOfIncident": "03/10/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 742247,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "BULB FAILED AND BULB FAILURE WARNING LIGHT CAME ON ON WAY HOME FROM DEALERSHIP.  WE RETURNED TO DEALERSHIP AND THEY SAID THEY WERE NOT AWARE OF ANY PROBLEMS WITH THIS COMPONENT ON THIS MODEL.  THEY ATTEMPTED TO REPAIR BUT WERE NOT ABLE TO REPAIR BECAUSE THEY DID NOT HAVE A SERVICE TECHNICIAN ON SITE.  THEY OFFERED ANOTHER CAR BUT WE DECLINED.  SIGNAL HAS BEEN INTERMITTENT SINCE THE FIRST INCIDENT.*AK",
        "vin": "YV1SW53D211"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2001",
        "dateOfIncident": "10/29/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 740277,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "2 DAYS AFTER I PICKED UP MY US SPEC VOLVO; THE ENGINE STOPPED DEAD WHILE TRAVELING 70 MPG ON A MAJOR EUROPEAN HIGHWAY.  VOLVO COULD NOT FIND THE PROBLEM AND SENT ME A LETTER INDICATING THERE WAS NOTHING WRONG WITH MY CAR.  2 DAYS AGO THE ENGINE STOPPED DEAD AGAIN WHILE DRIVING THROUGH A BUSY CITY INTERSECTION.  EITHER OF THESE ACCIDENTS COULD HAVE EASILY BEEN FATAL AS THE CAR GAVE NO WARNING BEFORE THE ENGINE STOPPED COMPLETELY LEAVING ME WITHOUT POWER BRAKES OR STEERING AND STRANDED IN TRAFFIC.  THE DEALER NOW TELLS ME THAT VOLVO HAS ISSUED A TECHNICAL BULLETIN STATING THAT SEVERAL NEW S80 AND V70 MODELS HAVE A \"WEAK\" FUEL PUMP WHICH CAUSES THE ENGINE TO STOP DUE TO LACK OF GAS ALTHOUGH THERE IS PLENTY OF GAS IN THE TANK.  DESPITE THE PUBLICATION OF THIS BULLETIN SEVERAL WEEKS AGO, NEITHER VOLVO NOR MY DEALER NOTIFIED ME THAT I NEEDED A NEW PUMP (DESPITE THE PREVIOUS BREAKDOWN), SO I AND MY FAMILY WERE NEEDLESSLY SUBJECTED TO ANOTHER HARROWING VEHICLE FAILURE.  THIS DEFECT IS DANGEROUS AND VOLVO SHOULD BE FORCED TO CORRECT IT ON ALL AFFECTED VEHICLES WITHOUT WAITING FOR THEM TO HAVE A SECOND UNEXPLAINED ENGINE STOPPAGE, AS THE BULLETIN APPARENTLY INDICATES, BEFORE REPLACING THE PUMP.  THE DEALER THAT SERVICES MY CAR SAID THAT THEY HAVE SEEN 4 NEW CARS INCLUDING MINE WITH THIS PROBLEM IN THE LAST THREE MONTHS.  IF THIS IS HAPPENING TO MY NEW US SPEC VOLVO XC, IT MUST BE HAPPENING TO OTHERS AS THEY ARE ALL PRODUCED IN THE SAME FACTORY IN SWEDEN.  PLEASE DO SOMETHING ABOUT THIS BEFORE ONE OF THESE CARS IS INVOLVED IN A SERIOUS ACCIDENT THAT COULD HAVE AVOIDED HAD VOLVO BEEN RESPONSIBLE IN NOTIFYING CUSTOMERS OF THIS POTENTIALLY FATAL DEFECT.  I AM CURRENTLY STATIONED WITH THE US ARMY IN HEIDELBERG, GERMANY, AND MY PHONE NUMBER IS +[XXX] IF YOU NEED FURTHER INFORMATION OR MY E-MAIL IS [XXX]. *AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "YV1SZ58D811"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/10/2001",
        "dateOfIncident": "01/08/2001",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 877981,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER USING  REAR OUTLET WITH A COOLER ON BATTERY WENT DEAD, AND CONSUMER COULD NOT OPEN  HATCH DOOR BECAUSE IT WORKED ELECTRONICALLY, AND TO OPEN IT HAD TO DO IT MANUALLY.  *AK",
        "vin": "YV1SW58DO12"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/29/2000",
        "dateOfIncident": "09/27/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 737025,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "I LEASED A 2001 VOLVO V70 WAGON ON 9/27/00.  I IMMEDIATELY NOTICED THAT THERE WAS A SEVERE AMOUNT OF REFLECTION FROM TOP OF  DASHBOARD ONTO THE INSIDE OF THE WINDSHIELD.   REFLECTION IS POSITIONED HIGH UP ON THE WINDSHIELD IN THE AREA WERE THE DRIVER WOULD NORMALLY LOOK OUT OF THE CAR.  WHEN DIRECT SUNLIGHT IS ON THE DASHBOARD TOP, THE REFLECTION IN THE WINDSHIELD IS SO GREAT THAT IT MAKES IT VERY DIFFICULT TO SEE THROUGH THE WINDSHIELD.  EVEN IN LOWER LIGHT SITUATIONS (AS WITH NIGHTTIME STREET LIGHTING AND OVERCAST DAYS), THE REFLECTION POPS UP AND IS DISTRACTING TO THE DRIVER. IT APPEARS THAT THE REFLECTION IS DUE TO THE RAKE OF THE WINDSHIELD AND THE ANGLE OF THE DASHBOARD TOP.  I BROUGHT THIS TO THE ATTENTION OF THE VOLVO DEALER AND THEY IN TURN NOTIFIED THE VOLVO REPRESENTATIVE.  THE RESPONSE WAS \"CONDITION NORMAL TO ALL 01 MODELS\".  I NOTE THAT THE DEALER'S SERVICE DEPT INDICATED THAT OTHER OWNERS HAD ALSO COMPLAINED OF THIS PROBLEM. I AM 53 AND HAVE DRIVEN AND OWNED MANY CARS, BUT HAVE NEVER EXPERIENCED THIS TYPE OF SAFETY IMPAIRMENT IN ANY OTHER CAR.  TO FIND OUT IF I WAS ALONE IN MY PERCEPTION, I POSTED A NOTE ON EDMUNDS.COM AND WITHIN SEVERAL HOURS I RECEIVED THE FOLLOWING  RESPONSE: \"YEP, I'M SURE EVERYONE HAS THIS PROBLEM.\"  THE AMAZING THING ABOUT THIS REFLECTION IS THAT IT APPEARS TO EXIST IN THE FULL LINE OF VOLVO'S NEW MODELS.  MY GUESS IS THAT OVER TIME THERE WILL BE NUMEROUS ACCIDENTS RELATED TO THE DRIVER'S INABILITY TO FOCUS THROUGH THE REFLECTION OR DUE TO THE DISTRACTION CAUSED BY IT POPPING UP IN CHANGING LIGHT SITUATIONS SUCH AS TRANSITIONS DRIVING FROM SHADE TO SUNLIGHT ON A TREE LINED STREET.  FOR MY PART, ALTHOUGH IT WILL BE A SIGNIFICANT FINANCIAL LOSS, I AM GOING TO DISPOSE OF THE CAR AS SOON AS POSSIBLE BECAUSE I BELIEVE IT IS UNSAFE TO DRIVE. I KNOW THIS SOUND ALMOST IMPOSSIBLE THAT A COMPANY SUCH AS VOLVO COULD PRODUCE A CAR WITH THIS DEFECT, BUT SIT IN ONE WHEN THERE IS LIGHT SHINING ON THE DASH TOP AND YOU WILL UNDERSTAND.",
        "vin": "YV1SW53D112"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/21/2000",
        "dateOfIncident": "08/30/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 875325,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "DESIGN OF DASHBOARD AND WINDSHIELD IS OF SUCH AN ANGLE THAT CONSUMER CANNOT SEE ON A BRIGHT DAY.  GLARE IS BAD ENOUGH, AND SHE DOES NOT FEEL SAFE DRIVING.  CONTACTED VOLVO WHO OFFERED NO ASSISTANCE.*AK  CONSUMER FEELS IF THE DASHBOARD WERE A DARKER COLOR, THE GLARE WOULD NOT BE THERE.   *SLC",
        "vin": "YV1SW53D712"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/17/2000",
        "dateOfIncident": "08/01/2000",
        "fire": false,
        "manufacturer": "Volvo Car USA, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 731698,
        "products": [
            {
                "manufacturer": "Volvo Car USA, LLC",
                "productMake": "VOLVO",
                "productModel": "V70",
                "productYear": "2001",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REFLECTION OF THE DASHBOARD IN SUNLIGHT ON THE WINDSHIELD IS VIRTUALLY BLINDING.  THE COLOR OF THE INTERIOR OF OUR CAR IS A CREAM BEIGE WITH A MATCHING DASHBOARD.  WHEN DRIVING INTO THE SUN, THE REFLECTION IS SO BAD THAT 60% TO 70% OF YOUR VISION IS IMPAIRED.  WE HAVE HAD 3 NEAR COLLISIONS SINCE WE HAVE BEEN UNABLE TO MAKE OUT A LIGHT COLORED CAR ENTERING AN INTERSECTION.  IN FILTERED SUN LIGHT, THE REFLECTION CONTINUES FROM A LARGE RADIO SPEAKER GRILL (THE SIZE OF A DINNER PLATE) AND FROM THE DEFROSTER GRATE THAT RUNS THE FULL WIDTH OF THE DASHBOARD.  IT LOOKS LIKE PROJECTION \"TV\" AND IS VERY DISTRACTING AND TIRING SINCE IT POPS UP AND OFF WHEN DRIVING DOWN TREE LINED STREETS OR BEHIND BUILDINGS OR TRUCKS.  THIS CAUSES HEAVY EYE STRAIN AND MAKES IT VERY DANGEROUS ON LONGER TRIPS.  VOLVO USE TO USE A DARKER BROWN DASHBOARD ON THIS CAR WHICH DID NOT REFLECT THE SUNLIGHT.  MY LINCOLN LS HAS THE SAME COLOR INTERIOR AND IT TOO HAS A DARKER BROWN DASHBOARD TO ABSORB LIGHT.  THE ANALOGY I WOULD USE TO REPLICATE THE PROBLEM IS DRIVING A CAR WITH A WHITE SHEET ON THE DASHBOARD.  VOLVO INDICATED NO DESIRE TO INVESTIGATE THE CONCERN AND SAID IT IS MY CHOICE IF I WANT TO CHANGE THE DASHBOARD FOR ABOUT $1,000.  THEY SAID THEY HAVE HAD NO OTHER COMPLAINTS.  WE PURCHASED THE FIRST 2001 MODEL SOLD IN MAINE AND THE FIRST WITH THIS COLOR INTERIOR.  FROM AN ASTHETIC STANDPOINT, THE DASHBOARD IS VERY ATTRACTIVE.  FROM A SAFETY ISSUE, THIS IS AN ACCIDENT WAITING TO HAPPEN DUE TO SEVERELY IMPAIRED VISION IN SUNNY DRIVING CONDITIONS.  I HAVE DRIVEN SINCE 1966 AND HAVE HAD OVER 50 CARS AND HAVE NEVER HAD A VISION PROBLEM LIKE THIS.",
        "vin": "YV1SZ58D811"
    }
]