[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/08/2005",
        "dateOfIncident": "06/17/2005",
        "fire": false,
        "manufacturer": "ACRO TRAILER COMPANY",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127861,
        "products": [
            {
                "manufacturer": "ACRO TRAILER COMPANY",
                "productMake": "ACRO",
                "productModel": "TRAILER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SEA DOO SPORTBOAT WITH A MATCHING TRAILER.    APPROXIMATELY 2 WEEKS AGO WE HAD  BLOWOUT ON THE TRAILER.ONLY TO ENCOUNTER ANOTHER BLOWOUT 5 MILES DOWN THE ROAD.      WE BEGAN TO INVESTIGATE THE TRAILER FOR ITS WEIGHT RATING.  THE \"MATHCING\" TRAILER HAD A GAWR OF 2965# AND THE ORIGINAL TIRES WERE RATED AT 1250# EACH  THE GVWR WAS 2965#.  I REALIZED THAT THE TRAILER WAS SUPPLIED WITH TIRES THAT DID NOT MATCH THE WIEGHT CARRYING CAPACITY OF THE TRAILER ITSELF.       NEXT, ON THE WAY HOME I DECIDED TO GO BY THE PUBLIC SCALE IN OUR TOWN AND HAVE THE BOAT AND TRAILER WEIGHED .  THE BOAT HAD APPROXIMATELY 10 GALLONS OF FUEL AND THE NECESSARY MARINE SAFETY EQUIPMENT TO COMPLY WITH THE CALIFORNIA LAW.  I WAS SHOCKED WHEN THE WEIGH TICKET STATED THAT THE BOAT AND TRAILER COMBO WIEGHED IN AT 2940#, WITHOUT A FULL TANK OF GAS OR ANY WATER EQUIPMENT, NOR A SPARE TIRE.  THE SEA DOO UTOPIA 185 WEIGHS IN AT 2110#  HOLDS 40 GALLONS OF FUEL 3 GALLONS OF OILTHE TRAILER WEIGHS 465#.  ADD THESE ITEMS UP AND IT GIVES YOU APPROXIMATELY 2880# WITH NO SAFETY EQUIPMENT, SPARE TIRE, RECREATIONAL PRODUCTS, OR THE TOW COVER(45#).       NOW SAFETY BECAME A CONCERN TO ME AND MY FAMILY.  SO I PROCEEDED TO CALL THE DEALERSHIP THAT I MADE THE PURCHASE FROM.  THE STORE OWNER MADE A CALL TO SEA DOO AND KARAVAN TRAILERS TO SEE WHAT THEY MIGHT SAY.  AFTER A WEEK OF NO WORD, I PROCEEDED TO GIVE BOTH A CALL ON MY OWN.  ACCORDING TO KARAVAN TRAILER, THE TRAILER CANNOT CARRY MORE THAN 2500# CARGO OR 2965# CARGO AND TRAILER.  THE CUSTOMER SERVICE REPRESENTATIVE STATED THEY ONLY SUPPLY THE TRAILER TO SEA DOO AND THAT SEA DOO CHOOSES WHICH ONE TO PUT UNDER WHICH BOAT. HESTATED THAT THIS BOAT SHOULD BE PUT ON A LARGER TRAILER.  SO I CALLED SEA DOO AND  THE CUSTOMER SERVICE MANAGER TOLD ME THIS TRAILER IS SAFE TO TRAILER THE BOAT COMPLETELY EMPTY AND THAT I \"CHOOSE\" TO MAKE IT UNSAFE BY PUTTING FUEL, OIL, MARINE SAFETY EQUIPMENT, COVER, SPARE TIRE, AND OTHER NECESSITIES IN THE VESSEL.",
        "vin": "5KTBS19121F"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "ACRO TRAILER COMPANY",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063045,
        "products": [
            {
                "manufacturer": "ACRO TRAILER COMPANY",
                "productMake": "ACRO",
                "productModel": "TRAILER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER WAS PULLED OVER BY A POLICE OFFICER THAT GAVE HER A WARNING FOR THE REAR PASSENGER BRAKE LIGHT BEING OUT.  ALSO,  ENGINE DIED, AND VEHICLE HAD TO BE TOWED TO DEALER.  CONSUMER BELIEVED  IT WAS AN IGNITION PROBLEM. *AK",
        "vin": "1GNDT13S522"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "06/23/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "ACRO TRAILER COMPANY",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024686,
        "products": [
            {
                "manufacturer": "ACRO TRAILER COMPANY",
                "productMake": "ACRO",
                "productModel": "TRAILER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN PARK WITH ENGINE OFF THE VEHICLE WAS ON A SLIGHT INCLINE WITH PARKING BRAKE ENGAGED WHEN ANOTHER VEHICLE BACKED INTO CONSUMER'S VEHICLE AND CAUSED VEHICLE TO ROLL DOWN THE HILL.  *AK",
        "vin": "1GNES16S426"
    }
]