[
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2021",
        "dateOfIncident": "10/04/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11420657,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I FIRST GOT THE VEHICLE IT WOULD START WITH NO ISSUES AND NOW IT WONT START AN I CANT FIGURE OUT WHY AND NOT SURE IF THIS IS THE REASON I CANT THINK OF WHAT ELSE IT COULD BE IT ACTS LIKE ITS NOT GETTING ANY FUEL OR SOMETHING TO GET STARTED.",
        "vin": "WAULT64B32N"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "02/11/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 3,
        "odiNumber": 11405964,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBRUARY 11, 2021, MR. TRAVIS WAS TRAVELING ON I-70 IN VANDALIA ILLINOIS WHEN HE WAS REAR ENDED AT HIGH SPEEDS BY MR. FREE. MR. TRAVIS' 2002 AUDI A6 SUSTAINED SERIOUS DAMAGE BUT THE AIRBAGS DID NOT DEPLOY. MR. TRAVIS SUSTAINED FATAL INJURIES AS A RESULT OF THE CRASH.",
        "vin": "WAULD64B92N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "09/01/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354327,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ARE SHORTING OUT AND CRACKING AND BARE WIRES TOUCHING",
        "vin": "WAULD64B12N"
    },
    {
        "components": "UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2020",
        "dateOfIncident": "05/04/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11325248,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY CAR TO DETAIL IT AND AFTER I WENT TO DRIVE TO THE STORE AND MY CAR WASN'T REACHING ABOVE 4000 RPMS AND WOULDN'T GO OVER 60 MPH ...ITS ACTING LIKE THERE IS A REV LIMITER AND THROW 2 NEW CODES...NEVER GOT ENGINE BAY WET JUS OUTER BODY OF VEHICLE ...DIAGNOSTIC CODES ARE P0322 AND P0421 I BELIEVE ONE IS FOR THE ENGINE IGNITION DISTRIBUTOR NO SIGNAL  AND ALSO CATALYTIC SYSTEM BELOW THRESHOLD BANK 1 .....AFTER I PARKED CAR AGAIN I TRIED TO START AND NOTHING HAPPENED   ....I'VE BOUT NEW C.O.P'S ....AND STILL NOTHING I WAS DRIVING MY VEHICLE WHEN THIS HAPPENED AND ALSO NOTICE THAT THE FUEL FILLER JUST INSIDE THE PORT WAS ALL CRACKED AND WHEN I FILLED WITH FUEL ITS LEAKED ALOT OF MY GAS ...THE  *TR",
        "vin": "WAUVT64B12N"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2020",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11298091,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FILLED GAS TANK AND NOTICED FUEL LEAKING FROM TOP OF THE TANK TO THE GROUND NEAR THE INSIDE OF THE PASSENGER SIDE REAL WHEEL. FUEL STOPS LEAKING AFTER IT DROPS BELOW 3/4 FULL. TOOK THE CAR TO THE AUDI DEALERSHIP THINKING IT WAS FAILURE OF THE ROLLOVER/FILLER NECK VALVE RECALL AGAIN (NHTSA RECALL #08V157000). AUDI SAID THE FILLER NECK WAS DRY, BUT THERE IS A LEAK SOMEWHERE ON TOP OF FUEL TANK ON THE SAME SIDE AS THE FILLER NECK. THEY SAID THEY COULD NOT SEE WHERE THE LEAK WAS COMING FROM WITHOUT DROPPING THE FUEL TANK FROM THE CAR. AUDI QUOTED THE REPAIR FOR COMPLETELY REPLACING THE FUEL TANK AT ~$3400. A FUEL TANK SHOULD NEVER LEAK, AND THIS IS AN EXTREME SAFETY CONCERN, NOT ONLY FOR THE DRIVERS AND PASSENGERS OF THE CAR, BUT ALL OTHERS ON THE ROAD. THIS IS ALSO A FAILURE OF AN EMISSIONS COMPONENT THAT AUDI NEEDS TO BE RESPONSIBLE FOR SINCE THERE IS RAW FUEL LEAKING ALL OVER THE ROAD.",
        "vin": "WAULD64B22N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "11/24/2017",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076530,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2002 AUDI A6. WHILE DRIVING APPROXIMATELY 55 MPH, THERE WAS AN ODOR OF SMOKE. THE CONTACT OBSERVED SMOKE COMING THROUGH THE VENTS ON THE FRONT DRIVER'S SIDE. IN ADDITION, THE VEHICLE CAUGHT FIRE UNDER THE HOOD. THERE WERE NO INJURIES SUSTAINED. A FIRE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOWING FACILITY. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE VIN WAS NOT AVAILABLE. THE VEHICLE WAS DESTROYED. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2013",
        "dateOfIncident": "08/24/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537099,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AT ABOUT 65 MPH. I WENT TO PASS ANOTHER CAR IN A PASSING ZONE SO I ACCELERATED FULL THROTTLE. THE GAS PEDAL STUCK AND THE CAR CONTINUED TO ACCELERATE. I BRAKED AND MANEUVERED THE CAR TO THE SIDE OF THE ROAD AND TURNED IT OFF. AFTER A WHILE IT RELEASED. I STARTED THE CAR AGAIN AND CONTINUED HOME, NOT PUSHING THE PEDAL DOWN ANY FARTHER THAN NECESSARY. I WILL TAKE IT IN TO BE FIXED. THERE WAS NOTHING OBSCURING THE PEDAL AND THE FLOOR MAT WAS CLICKED INTO PLACE. I FOUND NO EVIDENCE OF A RECALL, BUT MANY AUDI OWNERS HAVE REPORTED SIMILAR EXPERIENCES, SO I AM NOT SURE WHY THIS ISN'T A RECALL ISSUE.  *TR",
        "vin": "WAUVT64B22N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/25/2013",
        "dateOfIncident": "07/06/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10531869,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL VAPORS AND LEAKING FUEL APPEARS WHEN THE FUEL TANK IS FILLED BEYOND 3/4 TANK. THIS IS UNSAFE FOR THE CAR TO BE PARKED INSIDE OF THE GARAGE. THE FUMES MAKE PASSENGERS FEEL ILL. AUDI SERVICE DEPARTMENTS WANT TO CHARGE OVER $2500 TO REPAIR. A RECALL FOR THE ROLLOVER VALVE HAS BEEN PERFORMED; HOWEVER THE AUDI SERVICE TECHS SAY THE LEAKAGE IS COMING FROM SMALL CRACKS IN THE DEFECTIVE TANK. UNABLE TO HAVE THE REPAIR DONE BECAUSE OF COSTS I HAVE DRIVEN THE CAR WITH LESS THAN1/2 TANK OF FUEL FOR SEVERAL YEARS . THE STATE OF UTAH WILL NO LONGER PASS MY VEHICLE INSPECTION DUE TO THE EMISSIONS ISSUE. MY FEAR IS THE LEAKING FUEL COULD BE IGNITED BY ANY NUMBER OF SOURCES INCLUDING EXHAUST/HEAT FROM THE VEHICLE. PASSENGERS SHOULD NEVER HAVE TO BE SUBJECT TO VAPORS INSIDE OF A VEHICLE. I HAVE BEEN TO 3 DIFFERENT UTAH AUDI DEALERSHIPS AND 1 INDEPENDENT AUDI REPAIR GARAGE. I HAVE ALSO CONTACTED AUDI CUSTOMER RELATIONS @ 1-800-253-2834. ALL OF THE AUDI REPRESENTATIVES AND TECHNICIANS HAVE PLAYED DUMB REGARDING THIS ISSUE; YET THE ISSUE CAN BE FOUND IN A NUMBER OF FORUMS WHERE OTHERS HAVE DEALT WITH THE SAME ISSUE. AUDI REFUSES TO TAKE RESPONSIBILITY OR EVEN SHOW REAL CONCERN FOR THIS SAFETY AND ENVIRONMENTAL ISSUE.  *TR",
        "vin": "WAULT64B12N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2013",
        "dateOfIncident": "03/28/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10510423,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE WHILE DRIVING ON FREEWAY.  FOURTH TIME IN 3 YEARS.  EACH TIME THE TRANSMISSION WAS REPLACED.  AUDI REFUSES TO ACKNOWLEDGE THE FAILURE OF THE CVT TRANSMISSION ON THAT MODEL.  IT IS A DANGER TO PUBLIC SAFETY.  *TR",
        "vin": "WAUJT64B82N"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2013",
        "dateOfIncident": "11/03/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499473,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY BOUGHT MY AUDI AND THROUGHOUT THE SUMMER IT DROVE JUST FINE, BUT ONCE WINTER CAME AROUND AND THE TEMPERATURES DROPPED, I NOTICED THE SMELL OF GAS IN MY CAR AS SOON AS IT WAS STARTED. I OPENED THE HOOD AND THERE WAS GAS SPRAYING FROM WHAT LOOKED LIKE ALL SIX FUEL INJECTORS. SO I TOOK THE CAR TO A MECHANIC, WHERE THEY REPLACED NUMEROUS THINGS (FUEL PRESSURE REGULATOR, O RINGS, VALVE SYSTEM, AND ALL 6 FUEL INJECTORS) ALL TO NO AVAIL. NOBODY CAN TELL ME WHAT IS WRONG, NOBODY KNOWS. I CALLED AUDI AND THEY TOLD ME I COULD TAKE IT TO A DEALERSHIP BUT THAT THEY COULDN'T PROMISE THEY CAN FIX THE CAR. I CAN'T DRIVE THE CAR, IT IS A SAFETY HAZARD. I HAVE LOOKED ON MANY FORUMS AND THERE HAVE BEEN A FEW OTHER PEOPLE WITH THE SAME PROBLEM BUT NOBODY CAN FIGURE OUT WHAT IS WRONG. IS THERE A RECALL, OR ANY INFORMATION YOU CAN GIVE AS TO HOW TO FIX THIS PROBLEM??  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2012",
        "dateOfIncident": "10/05/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479603,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUDI WAS STOPPED AT A STOP LIGHT WHEN THE RPM METER STARTED TO DROP REVS SUDDENLY. ONCE THE CAR WAS IN MOTION THE ENGINE FELT ROUGH. THE CAR WAS DRIVEN 3 MILES WITH NO FURTHER INCIDENCE AND WAS PARKED FOR THE NIGHT. THE NEXT DAY WHEN THE CAR WAS STARTED IN THE MORNING THE CHECK ENGINE LIGHT CAME ON AND THE ENGINE STARTED TO GET VERY SLUGGISH AND SHUDDERING. THE CAR WAS IMMEDIATELY STOPPED AND THE DIAGNOSTIC CODES WERE PULLED. THE CODES SHOWED MULTIPLE CYLINDER MISFIRES WITH SPECIFIC MISFIRES IN CYLINDER 2 AND THREE. THE CAR WAS TOWED TO AN AUDI DEALER WHERE THIS WAS CONFIRMED. THE DEALERSHIP MENTIONED THAT THERE WAS A VOLUNTARY RECALL FOR EXACTLY THIS ISSUE. THIS IS A SAFETY ISSUE.  *TR",
        "vin": "WAULT64B52N"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/03/2012",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478460,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TYPICAL AUDI FUEL LEAK PROBLEM. THEY SAY IT IS A ROLL OVER VALVE. THEY FIXED IT. IT STILL LEAKS AND NOW IT IS MY PROBLEM AT $2800.  *TR",
        "vin": "WAUVT64B02N"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/10/2012",
        "dateOfIncident": "01/02/2011",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10465158,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING THE CAR IT CAUGHT ON FIRE FROM THE DASHBOARD THE FIREMEN CAME AND EXTINGUISHED THE FIRE AND SAID IT WAS FROM THE ELECTRICAL FIRE FROM THE DASHBOARD.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/23/2012",
        "dateOfIncident": "03/15/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459381,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 AUDI A6. WHILE DRIVING APPROXIMATELY 25 MPH THE VEHICLE BEGAN TO HESITATE WHILE ACCELERATING. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC. THE TECHNICIAN STATED THE TRANSMISSION CLUTCH PLATE WOULD HAVE TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 55,700.",
        "vin": "WAUJT64B92N"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2012",
        "dateOfIncident": "04/24/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10458209,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS CAR HAS BEEN GREAT TO ME. ASIDE FROM A FUEL PUMP GOING,  JUST RECENTLY I WAS DRIVING ON THE FREEWAY AND THE CAR DIED. THE EPC LIGHT ON THE DASH POPPED UP AND LUCKILY I WAS ABLE TO COAST TO THE SIDE OF THE ROAD. I ATTEMPTED TO START THE CAR SEVERAL TIMES BEFORE CALLING AAA  (15-20 MIN) WHILE ON THE PHONE WITH AAA I ATTEMPTED TO START THE CAR AGAIN AND IT FIRED RIGHT UP.  THINKING IT WAS JUST A ONE TIME ISSUE I GOT BACK ON THE FREEWAY  WHERE 10 MILE OR SO LATER SAME THE SAME THING HAPPENED.  ANOTHER 20 MIN OF WAITING BEFORE IT CRANKED AGAIN AT THIS POINT I WAS IN A B AD AREA WITH MY FAMILY AND EVERYONE WAS GETTING NERVOUS.  AFTER IT STARTED THE EPC LIGHT STAYED ON THIS TIME AND I EXPERIENCED LOSS OF POWER AND THE CAR COUGHED AND STUMBLED TERRIBLY WHEN I NEEDED IT MOST.  I MANAGED TO MAKE IT HOME AND LET THE CAR SIT FOR A DAY. HOPED IN AND IT CRANKED RIGHT UP. NO PROBLEMS 15 MILES LATER IT HAPPENED AGAIN.    AFTER TALKING WITH OTHER VALUED AUDI OWNERS AND LOOKING OVER THE AUDI OWNER FORUMS. I HAVE FOUND THIS TO BE A QUITE COMMON PROBLEM WITH THE AUDI ACROSS THE RANGE OF THERE A SERIES FROM 1997-2011.   PLEASE HELP!  *TR",
        "vin": "WAUVT54B02N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/07/2011",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438843,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 AUDI A6. THE CONTACT STATED THE CHECK ENGINE LIGHT REMAINED ILLUMINATED. THE VEHICLE WAS TAKEN TO THE LOCAL MECHANIC WHO PERFORMED A DIAGNOSTIC, WHICH LOCATED THE FAILURE AT THE FUEL TANK. THE FUEL TANK WAS LEAKING FUEL. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, AND ADVISED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 08V157000 (FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 116,000.",
        "vin": "WAULT64EX2N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/19/2011",
        "dateOfIncident": "07/25/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430871,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CHECK ENGINE LIGHT IS MARKING MISFIRE BUT I HAVE GOTTEN A COMPLETE TUNE-UP, CHANGED ALL 6 COILS ON THE ENGINE CHANGED ALL THE SPARK PLUGS, I'VE DONE EVERYTHING POSSIBLE AND CHANGED EVERYTHING I CAN THAT HAS TO DO WITH THE ENGINE ALL BRAND NEW AND NOTHING HAS WORKED AND ITS STILL SAYING MISFIRE...I'VE GOOGLED THIS PROBLEM FOR AUDI'S AND THERE WERE SO MANY PEOPLE COMPLAINING ABOUT THE SAME THING... ALSO, I AM HAVING A PROBLEM WITH THE ELECTRICAL SYSTEM AS WELL ONE DAY MY WINDOWS WORK THE NEXT IT DOESN'T SOMETIMES MY LIGHTS WILL WORK AND SOMETIMES IT DOESN'T, SOMETIMES MY RADIO WILL WORK SOME TIMES IT DOESN'T, THE INFORMATION ON MY DASH SOMETIMES DOESN'T LIGHT UP AND I CAN'T SEE ANYTHING AT NIGHT TIME, I HAVE CONSTANTLY BEEN TO THE MECHANICS TRYING TO FIGURE OUT WHAT'S GOING ON BUT WE CAN'T FIND THE PROBLEM, I'VE SPENT SO MUCH MONEY ON THIS CAR TRYING TO FIX THE PROBLEMS BUT ITS REALLY MAKING IT HARD FOR ME TO KEEP SPENDING MONEY ON MY CAR AND NOT BEING ABLE TO FIGURE OUT WHAT'S WRONG WITH IT. THIS IS VERY DANGEROUS BECAUSE IF I'M DRIVING AT NIGHT TIME AND MY LIGHTS END UP NOT WORKING I CAN CAUSE A VERY BIG ACCIDENT I AM VERY VERY CONCERNED ABOUT THESE DEFECTS, MY SAFETY AND OTHERS SAFETY AND WOULD REALLY APPRECIATE IF YOU CAN PLEASE INVESTIGATE THIS PROBLEM BECAUSE ITS HAPPENED TO SO MANY PEOPLE. I ALSO THINK SOMETHING IS WRONG WITH THE FUEL SYSTEM I'LL PUT $60 IN GAS AND TWO DAYS LATER IT'LL ALMOST MARK EMPTY I REALLY DON'T UNDERSTAND HOW THAT IS POSSIBLE BUT IF THERE'S AN ANSWER I WOULD REALLY WANT TO KNOW. THANK YOU SO MUCH AND I REALLY APPRECIATE YOUR TIME.  *TR",
        "vin": "WAULT64B02N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/10/2011",
        "dateOfIncident": "04/10/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395414,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 3 MAJOR CONCERNS REGARDING MY 2002 AUDI A6 3.0 QUATTRO. I WILL START WITH THE MOST DANGEROUS PROBLEM FIRST...1) THE ANTI-LOCK BRAKES THAT KICK IN UNEXPECTEDLY. THE ABS/ESP PROBLEM STARTED IN MAY, 2007, WITH THE ABS/ESP LIGHT COMING ON INTERMITTENTLY, RESULTING IN US REPLACING THE BRAKE LIGHT SWITCH. THE PROBLEM DIDN'T HAPPEN AGAIN UNTIL THE ANTI-LOCK BRAKES KICKED IN, IN AUG., 2009. WITH NO DEFINITE, INEXPENSIVE FIX FROM THE DEALER, WE DECIDED TO SEE IF THE PROBLEM PERSISTED. IT DID, BRINGING THE CAR BACK IN SEPT., 2009 & AGAIN IN JUNE, 2010. AT THIS TIME, I HAD A PRIVATE IMPORT GARAGE REPLACE THE ROTATION RATE SENSOR, WHICH WAS WHAT THE DEALER SAID THE PROBLEM COULD BE. THE PROBLEM PERSISTED FURTHER, WITH THE LIGHT COMING ON EVERY FEW MONTHS, UNTIL THE BRAKES KICKED IN WHILE GOING 60 MPH, MAKING THE CAR SKID & JERK TO A STOP, PULLING ME OFF THE ROAD IN LATE SEPT, 2010. IT WAS ABSOLUTELY TERRIFYING! I HAD THE CAR BACK TO THE DEALER IMMEDIATELY, WHERE THEY WERE UNABLE TO VERIFY THE CONCERN.  SINCE THEN, I HAVE NOT HAD PROBLEMS WITH IT AGAIN UNTIL APRIL, 2011, WHEN THE LIGHT STARTING COMING BACK ON AT RANDOM MOMENTS & NOW YESTERDAY, THE ANTI-LOCK BRAKES KICKED IN WHILE THE CRUISE WAS SET ON 60 MPH. I AM TERRIFIED TO CONTINUE TO DRIVE THIS VEHICLE. I CONTACTED AUDI OF AMERICA IN OCTOBER 2010 WITH NO HELP AVAILABLE! NOW ON TO PROBLEM #2)THE FLOODING IN THE INTERIOR FLOORBOARD CAUSING THE TRANSMISSION MODULE TO HAVE TO BE REPLACED. I SPENT THOUSANDS IN OCT, 2010 TO FIX PROBLEMS CAUSED BY A WATER LEAK IN THE CAR. THE DEALER REPLACED THE RIGHT REAR WINDOW & DOOR CHANNELS & SEALS, SAYING THIS WAS THE PROBLEM. I FOUND THE FLOORBOARD WET AGAIN IN MARCH, 2011 & HAD TO PAY FOR THE CRACKED POLLEN FILTER HOUSING TO BE FIXED. A LITTLE HELP FROM AUDI ON THAT, BUT THESE WELL-DOCUMENTED PROBLEMS WITH MY CAR CONTINUE TO BE UN-FIXABLE. I'VE FOUND COMPLAINTS OF THESE PROBLEMS FROM OTHERS, AM CONTACTING A LAWYER ABOUT MY STATE'S LEMON LAW, & AM SO DISAPPOINTED IN AUDI!  *TR",
        "vin": "WAULT64BX2N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/05/2011",
        "dateOfIncident": "03/23/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394322,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 AUDI A6 QUATTRO. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER FOR REPAIRS TO THE IGNITION COIL UNDER AN UNKNOWN RECALL. THE DEALER PERFORMED A DIAGNOSTIC AND ADVISED THAT THE CATALYTIC CONVERTER WAS FAILING. THE MANUFACTURER WAS CONTACTED AND ADVISED THAT BECAUSE OF THE MILEAGE AND AGE OF THE VEHICLE, THEY WERE UNABLE TO OFFER ANY ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 103,000.",
        "vin": "WAULT64B42N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/25/2011",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392930,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA CAMPAIGN NUMBER:  08V157000    VOLKSWAGEN IS RECALLING 68,240 MY 2001-2004 AUDI A6 QUATTRO VEHICLES EQUIPPED WITH 2.7L, 2.8L, OR 3.0L ENGINES AND MY 2001-2005 ALLROAD QUATTRO VEHICLES EQUIPPED WITH 2.7L OR 4.2L ENGINES. THE AGING OF THE PLASTIC MATERIAL IN THE FUEL TANK ROLLOVER VALVE COMBINED WITH BENDING STRESS FROM THE ALUMINUM VENTILATION LINE TO THE ROLLOVER VALVE NIPPLE MAY LEAD TO CRACKING OF THE NIPPLE. IF THIS HAPPENS, A FUEL LEAK MAY RESULT.    THIS IS THE 3RD TIME I'VE MADE A COMPLAINT. I HAVE A 2002 AUDI A6 WITH THIS PROBLEM AND YET NO ONE WILL LISTEN TO ME. THE REASON IS THAT MY ENGINE IS NOT INCLUDED IN THE RECALL. IT IS THE 4.2 V8 IN THE SEDAN. AUDI COVERED THAT ENGINE ON THE ALLROAD VERSION AND ALL OTHER ENGINES ON THE SEDAN, SO MY ENGINE WAS THE ONLY VERSION NO COVERED. I PERSONALLY SPENT $1200 ATTEMPTING TO FIX THE PROBLEM, BUT I'M TOLD THE LEAK HAS RETURNED AND THE NOTICEABLE SMELL OF GAS IS A TELL-TALE SIGN. THE MECHANIC STATED AND I AGREE, THAT THE ENGINE DISPLACEMENT HAS NOTHING TO DO WITH THE LEAK. ALL THE TANKS ARE THE SAME AND THE 4.2L SHOULDN'T BE OMITTED FROM THIS RECALL. THE SMELL AND POTENTIAL DANGER IS MOST EVIDENT WHEN I FILL THE TANK BEYOND 3/4 FULL. EVERY TIME I START MY CAR, I WONDER IF THIS WILL BE THE EXPLOSION DAY. PLEASE DON'T WAIT UNTIL MY CAR EXPLODES TO AGREE WITH ME.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUML64B92N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/17/2011",
        "dateOfIncident": "01/10/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383128,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 AUDI A6. WHILE THE VEHICLE WAS BEING INSPECTED FOR EMISSIONS 01/10/2011, THE CONTACT WAS INFORMED THAT THE ENGINE WAS MISFIRING DUE TO A DEFECTIVE COIL. THE FAILURE LED TO DAMAGE TO THE CATALYTIC CONVERTER WHICH NEEDED TO BE REPLACED ALONG WITH THE COIL. THE LOCAL AUTHORIZED DEALER REPLACED THE COIL. THE CONTACT CALLED THE MANUFACTURER WHO OFFERED NO ASSISTANCE. THE CONVERTER WAS NOT REPLACED. THE FAILURE MILEAGE WAS 99,370 AND THE CURRENT MILEAGE WAS 99,410.",
        "vin": "WAULT64B62N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/01/2010",
        "dateOfIncident": "06/04/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368493,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 AUDI A6. THE VEHICLE WAS TAKEN TO THE DEALERSHIP ON JUNE 4, 2010 FOR THE MANUFACTURERS VOLUNTARY COIL SPRING RECALL; HOWEVER, THE DEFECTED COIL SPRINGS CAUSED THE CATALYTIC CONVERTER TO FAIL. THE CATALYTIC CONVERTER WAS REPLACED; AND THE COIL SPRING REPAIR DIDN'T CORRECT THE FAILURE.  THE VEHICLE LOST POWER WHILE ATTEMPTING TO ACCELERATE. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO LOCATED THE FAILURE AS THE VEHICLES SIX ENGINE CYLINDER. THE MANUFACTURER WAS CONTACTED ADVISED THE CONTACT THAT THEY WOULD NOT REIMBURSE HIM FOR THE CATALYTIC CONVERTER. THE VEHICLE WASN'T REPAIRED. THE FAILURE MILEAGE WAS 90,476 AND THE CURRENT MILEAGE WAS 93,400.",
        "vin": "WAUVT64B52N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "10/22/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362198,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 AUDI A6. THE CONTACT STATED THAT WHILE AT THE DEALER FOR REPAIRS, THE DEALER INFORMED HER THAT THE SAUTER JOINT FOR THE AIR BAGS WAS NOT SAUTERED PROPERLY. SHE WAS INFORMED THAT EITHER IT WOULD NOT DEPLOY IN AN ACCIDENT OR SUDDENLY DEPLOY WHILE SHE WAS DRIVING. THE VEHICLE HAD NOT BEEN REPAIRED. THE CONTACT CALLED THE MANUFACTURER WHO OFFERED HER A CHEAPER PRICE FOR THE PART BUT OFFERED NO FURTHER ASSISTANCE. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 130,000.",
        "vin": "WAUVT64B32N"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/22/2010",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10361791,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 AUDI A6. WHILE TRAVELING 55 MPH, A VEHICLE CRASHED INTO THE FRONT END OF THE VEHICLE; HOWEVER, NONE OF THE AIR BAGS DEPLOYED. THE CONTACT SUFFERED INJURIES TO HIS SPINE AND HEAD. A POLICE REPORT WAS FILED. THE FAILURE WAS NOT DIAGNOSED AND THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 102000. UPDATED 02/03/11*LJ  THE CONSUMERS WIFE WAS ALSO INJURED . UPDATED 03/22/11",
        "vin": "WAUML64B02N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2010",
        "dateOfIncident": "03/29/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361572,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 AUDI A6. THE CONTACT STATED THAT THE VEHICLE WOULD HESITATE WHEN THE ACCELERATOR WAS DEPRESSED. THE VEHICLE WOULD DRIVE EXTREMELY SLUGGISH UNTIL THE VEHICLE WOULD REACH A SPEED OF 20 MPH. THE VEHICLE WAS INSPECTED BY A MECHANIC THAT ADVISED THE CONTACT THAT THE FUEL PUMP WAS FAILING. THE VEHICLE WAS NEITHER INSPECTED NOR REPAIRED FOR THE FAILURE. THE FAILURE MILEAGE WAS 88,000 AND THE CURRENT MILEAGE WAS 92,538.",
        "vin": "WAUVT64B52N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/20/2010",
        "dateOfIncident": "07/20/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10361433,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 AUDI A6. WHILE DRIVING APPROXIMATELY 40 MPH, THE ABS ENGAGED SUDDENLY AND THEN THE VEHICLE WENT BACK TO NORMAL FUNCTION. THE FAILURE OCCURRED INTERMITTENTLY. THE VEHICLE HAD NOT BEEN INSPECTED OR REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 78,000 AND THE CURRENT MILEAGE WAS 83,787.",
        "vin": "WAULT64BX2N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2010",
        "dateOfIncident": "08/22/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355231,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 AUDI A6. THE VEHICLE WAS RECENTLY PURCHASED USED AND TAKEN TO A LOCAL REPAIR FACILITY FOR ROUTINE MAINTENANCE. THE MECHANIC ADVISED THE CONTACT THAT THE VEHICLE WAS PREVIOUSLY INVOLVED IN A CRASH AND THAT THE REAR CROSS MEMBER WAS FRACTURED AND HAD BEEN RE-WELDED IN FOUR DIFFERENT LOCATIONS. THE MECHANIC ALSO ADVISED THAT ONE OF THE FRACTURES WAS ONLY PARTIALLY WELDED AND THE VEHICLE WAS NOT SAFE TO DRIVE. THE MECHANIC STATED THAT IF THE WELD WAS TO FRACTURE AGAIN, IT WOULD POTENTIALLY CAUSE A CRASH AND THE CONTACT WOULD NOT BE ABLE TO MAINTAIN CONTROL OF THE VEHICLE. THE VEHICLE WAS NOT REPAIRED AND LEFT WITH THE DEALER. THE FAILURE AND CURRENT MILEAGE WAS 92,764.",
        "vin": "WAUJT64B62N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "09/05/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316904,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY WHEN ENGINE STARTED RUNNING VERY ROUGH, ENGINE LIGHT CAME ON. STOPPED AND CONSULTED MANUAL REGARDING ENGINE LIGHT, SAID TO DRIVE AT REDUCED SPEED TO AUDI DEALER. ENGINE RAN ROUGH, FLOOR OF CAR HEATED UP, SMOKE AND ODOR  STARTED COMING FROM EXHAUST. DEALER HAD TO REPLACE IGNITION COILS, CATALYTIC CONVERTER AND O2 SENSOR. CONSEQUENCES: CAR BECAME INTEROPERABLE AND EXTREME TOXIC AIR POLLUTION. *TR",
        "vin": "WAULT64B22N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308343,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NORMAL USE HAS LEAD TO THE FAILURE.  2. THE FAILURE IS THAT THE WIPER BLADES LEAVE A 4\" - 6\" WIDE STREAK ACROSS THE LINE OF VISION OF THE DRIVER. THIS OCCURS WITHIN A COUPLE OF WEEKS OF REPLACING THE BLADES WITH NEW BLADES FROM THE DEALER, WHICH IS THE ONLY PLACE THESE PARTICULAR STYLE BLADES CAN BE PURCHASED. ONCE IT STARTS, THE FAILURE OCCURS AT EVERY USE UNTIL REPLACED BY NEW BLADES. I PURCHASED A NEW PAIR OF BLADES TWO WEEKS AGO AND THE DRIVER'S SIDE HAS FAILED ALREADY.  3. I HAVE REPLACED THE BLADES WITH NEW BLADES WHICH ONLY SOLVES THE PROBLEM FOR A VERY SHORT, WEEK OR TWO, PERIOD OF TIME. I HAVE ASKED THE DEALER IF THERE WERE ALTERNATE DESIGN WIPER ARMS THAT COULD BE PURCHASED AND RETROFITTED AND WAS TOLD NO. THE STOCK ARMS ARE DESIGNED TO BE USED WITH \"AERO\" STYLE BLADES AND SEEM TO BE THE ROOT CAUSE OF THE PROBLEM. *TR",
        "vin": "WAULD64B52N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2009",
        "dateOfIncident": "10/18/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296031,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A KNOWN ISSUE WITH THE AGING OF PLASTIC MATERIAL ON AUDI A6 MODELS YRS 2001-2005.THE AGING OF THE PLASTIC MATERIAL IN THE FUEL TANK ROLLOVER VALVE COMBINED WITH BENDING STRESS FROM THE ALUMINUM VENTILATION LINE TO THE ROLLOVER VALVE NIPPLE MAY LEAD TO CRACKING OF THE NIPPLE.IF THIS HAPPENS, A FUEL LEAK MAY RESULT.  THIS EXACT  ISSUE HAS BEEN DIAGNOSED BY AN AUDI MECHANIC ON MY 2002 AUDI A6 4.2.  IT IS CONSTANTLY LEAKING A FUEL AND IF AN IGNITION SOURCE GETS NEAR IT THERE IS GOING TO BE A VEHICLE FIRE.  THE RECALL NUMBER FOR THIS ISSUE IS 08V157000:  FUEL TANK ROLLOVER VALVE MODIFICATION.  ALTHOUGH THIS IS A KNOWN ISSUE IT ONLY COVERS AUDI A6 MODES WITH 2.7, 2.8, AND 3.0 ENGINES.MY AUDI A6 HAS A 4.2 ENGINE, SO IT IS NOT COVERED BY THE RECALL, BUT THE RECALL DOES COVER THE AUDI ALLROAD EQUIPPED WITH 2.7 AND 4.2 ENGINES.  I'VE CALLED AUDI AND THEY REFUSE TO COVER MY VEHICLE UNDER THIS RECALL BECAUSE THEY HAVE NOT HAD ENOUGH REPORTS OF IT OCCURRING WITH MY SPECIFIC ENGINE MODEL.  I HAVE A DAUGHTER AND THIS POSES A VERY DANGEROUS THREAT, ITS EXPENSIVE TO REPAIR ON MY OWN AND IS A KNOWN ISSUE REPORTED ON THE SAME VEHICLE I OWN BUT BECAUSE I HAVE THE 4.2 MODEL THEY REFUSE TO COVER IT UNDER THEIR RECALL. *TR",
        "vin": "WAUML64B92N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/09/2009",
        "dateOfIncident": "11/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291555,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 AUDI A6 WITH A 3.0 V-6 ENGINE. WHEN THE GAS TANK IS FILLED UP MORE THAN 3/4 FULL THE GAS TANK ON THE DRIVERS SIDE LEAKS ALL OVER THE PLACE.  ON THE INTERNET THERE ARE MANY COMPLAINTS EXPLAINING THE SAME EXACT PROBLEM. AUDI HAS A RECALL PROGRAM FOR 2001 TO 2004 AUDI A6 3.0 LITRE MODELS, BUT TELL ME MY CAR IS NOT ONE THAT GOT RECALLED BECAUSE OF MY VEHICLE CODE NUMBER. I EXPLAINED THAT MY PROBLEM IS EXACTLY LIKE THEY EXPLAIN ON THEIR WEBSITE AND IT MATCHES THE OTHER COMPLAINTS ON THE WEB ALSO. THE DEALER SAID THEY WERE SURE THE GAS TANK HAS DISSOLVED BECAUSE OF THE GASOLINE AND SAID THEY WANT $2,200 FOR A NEW GAS TANK AND A $100 PER HOUR TO FIX THEIR ENGINEERING PROBLEM. THIS IS A MAJOR SAFETY AND POLLUTION PROBLEM THAT IS WIDE SPREAD THROUGHOUT OUR COUNTRY AND NEEDS TO BE ADDRESSED ASAP.  HELP ! *TR",
        "vin": "WAULT54B92N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/05/2009",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279502,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS COMPLAINT IS RELATED TO AN AUDI RECALL #PE08008 ISSUED IN MAY, 2008 AND RELATES TO THE FAILURE OF THE A PLASTIC NIPPLE ON THE GAS TANK THAT FAILS DUE TO STRESS. ACCORDING TO AUDI, MY VEHICLE DID NOT FALL WITHIN THE PARAMETERS OF THE RECALL PER MY VIN . ACCORDING TO YOUR NOTICE IT COVERS MY 2002 AUDI, BUT ONLY FOR THE 2.8, 2.7 AND 3.0 ENGINE ON THE QUATTRO SEDAN AND THE 2.7 AND 4.2 ON THE ALLROAD. MY AUDI IS A QUATTRO 4.2 SEDAN. 2 YEARS AGO, I NOTICED THE SMELL OF FUEL AROUND THE REAR OF THE CAR AND TOOK IT TO MY REPAIR FACILITY WHERE THEY DIAGNOSED THE EXACT SAME PROBLEM AS DESCRIBED IN YOUR RECALL. MY REPAIR INVOLVED DROPPING THE BACK-END TO ACCESS THE TANK AND ACTUALLY WELDING THE PLASTIC NIPPLE. I ONLY FOUND OUT ABOUT THE RECALL BY CHANCE AND CALLED AUDI, BUT THEY TELL ME MY CAR IS NOT PART OF THE RECALL. I DON'T UNDERSTAND HOW IT CAN'T BE. *TR",
        "vin": "WAUML64B92N"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/18/2009",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274514,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 AUDI A6 HAS A PROBLEM WITH INTERIOR FLOODING DUE TO RAINY WEATHER AND IT CAUSES THE TRANSMISSION MODULE TO SHORT OUT.   *NJ  THE CONSUMER STATED DURING HEAVY RAIN, THE WATER FROM THE WINDSHIELD RUNOFF DOES NOT DRAIN FAST ENOUGH THROUGH THE DRAIN HOLE, WHICH IS LOCATED UNDER THE BATTERY. THE DRAIN IS WELL HIDDEN AND CAN NOT BE INSPECTED VISUALLY OR CLEANED EASILY. THE WATER BACKS UP INTO THE PASSENGER COMPARTMENT THROUGH THE FRESH AIR INTAKE. THE TRANSMISSION MODULE WHICH IS LOCATED DIRECTLY UNDER THE PASSENGERS FEET HAD TO BE REPLACED TWICE, BECAUSE OF THE FLOODING PROBLEM. THE MECHANIC STATED HE TOOK OUT THE RUBBER GROMMET FROM THE DRAIN THEREFORE MAKING THE DRAIN OPENING MUCH LARGER TO ALLEVIATE ANY FUTURE PROBLEM. *JB",
        "vin": "WAULT64B72N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/22/2009",
        "dateOfIncident": "02/21/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259604,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 02/21/09  I PURCHASE A 2002 AUDI A6 3.0 IN FREDERICK, MARYLAND FOR THE AMOUNT OF 5,808.00. I DROVE BACK THE VEHICLE TO SELINSGROVE, PA I  ALMOST DID NOT MAKE IT. I NOTICED A LOTS OF WHITE SMOKE COMING FROM THE EXHAUST SYSTEM AND THE CAR WAS SHAKEN REALLY HARD. I PULLED OVER CAUSE THE CHECK ENGINE LIGHT CAME ON. THEN I HAS TO GET OUT OF THE ROAD 11/15 AS SOON AS POSSIBLE SO I ONLY COULD DRIVE 40 MILES PER HOUR OR THE CAR WILL SHAKE MORE. I PURCHASED THE VEHICLE WITH A PERSONAL CHECK. I WANT THIS VEHICLE BACK TO THE DEALER AS SOON AS POSSIBLE. I DO NOT WANT IT . CAN I CANCEL THE CHECK? I HAVE A SENIOR BANK ACCOUNT AND I WROTE THE CHECK FOR $5,808.00 TO SOUTH STREET AUTO SALES IN FREDERICK, MARYLAND. I WILL WRITE A REVIEW ONLINE TO CONSUMERS ABOUT THE BAD BUSINESS OF THIS DEALERSHIP. *TR",
        "vin": "WAUJT64B12N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2009",
        "dateOfIncident": "07/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256378,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "APPARENTLY AUDI HAVE KNOWN FOR AGES THAT THE CVT CLUTCH HAS NEEDED UPGRADING ON THIS ENGINE, BUT HASN'T RECALLED THE CARS. WE OWN A 2002 AUDI A6 (3.0 ENGINE & MULTITRONIC CVT). *TR",
        "vin": "WAUJT64B42N"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/21/2008",
        "dateOfIncident": "03/07/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239183,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "AUTOMATIC EQUIPMENT",
                "productModel": "AUTOMATIC EQUIPMENT",
                "productYear": "1985",
                "type": "Equipment"
            }
        ],
        "summary": "OWN 2002 AUDI A6 3.0 LITER SEDAN. MODULE(COMPUTER) REPLACED AND COMPLAINED OF TRANSMISSION NOT  WORKING PROPERLY. BROUGHT AUTO BACK TO DEALER AND AFTER CHECKING THE TRANSMISSION FOUND NOTHING WRONG. TRANSMISSION STILL NOT WORKING PROPERLY. WHEN PUT IN DRIVE AUTO DOESN'T MOVE FORWARD. HAVE TO PLAY AROUND WITH LEVER FROM REVERSE TO DRIVE TO ENGAGE THE TRANSMISSION. WHEN IT  MOVES FORWARD IT LUNGES NOT SMOOTHLY. NOT SAFE DRIVING. *TR",
        "vin": "WAUJT64BX2N"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/15/2008",
        "dateOfIncident": "03/07/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221267,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING FROM NJ TO UPSTATE NY FOR SKI TRIP TO HUNTER MOUNTAIN.  HEAVY RAIN DURING DRIVE UP ON FRIDAY EVENING, RAIN ALL DAY SATURDAY.  GOT IN THE CAR TO GO SKIING ON SUNDAY MORNING AND NOTICED SEVERAL INCHES OF WATER IN REAR PASSENGER FOOTWELL.  I WAS ABLE TO BALE OUT SOME OF THE WATER BUT INTERIOR CARPETING WAS SOAKED.  WHILE GOING TO HUNTER, WATER WAS SLOSHING BETWEEN PASSENGER FOOTWELL AND REAR.  AFTER DROPPING OFF THE SKIERS I DECIDED TO HEAD HOME ON THE NY STATE THRUWAY.  AFTER APPROX 50 MILES - DIGITAL DASH DISPLAY DISAPPEARED, CAR STARTED TO JERK AROUND AND BUCK.  SPEED WAS DROPPED DOWN TO 20 MPH, I WAS ABLE TO MAKE IT TO A REST STOP.  ANYWAY - REMAINDER OF SKI PARTY PICKED ME UP AND I HAD THE CAR TOWED BACK TO NJ - $700.  MECHANIC STATES THAT TCU UNIT WAS UNDER WATER.  RAIN WATER APPARENTLY CAME IN THROUGH THE POLLEN FILTER HOUSING AND FLOODED THE CAR.  TOTAL DAMAGE TO THE CAR $2300.  THERE ARE A NUMBER OF COMPLAINTS THROUGHOUT THE INTERNET AND VARIOUS FORUMS DETAILING THIS EXACT PROBLEM.  I BELIEVE THIS IS A DESIGN FLAW AND AUDI SHOULD BE HELD RESPONSIBLE FOR THIS PROBLEM.  I'D LIKE TO GET REIMBURSED FOR MY COST.  INDIVIDUALS WITH THIS PROBLEM SHOULD CONTACT AUDI CUSTOMER SERVICE AT 800-822-2834.  *TR",
        "vin": "WAULT64B22N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2008",
        "dateOfIncident": "03/03/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220593,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 AUDI A6 WITH A BELT FAILURE. CONSUMER STATES THAT HE DID RESEARCH ABOUT THIS FAILURE AND FOUND OUT OTHER PEOPLE HAVE HAD THE PROBLEM TOO. HE STATED THAT WHEN THE WATER PUMP AND THERMOSTAT WAS REPLACED OR FIXED THE TIMING BELT WAS NOT.  *KB  THE CONSUMER STATED HIS ENGINE OVERHEATED AND SMOKE BEGAN TO EMIT FROM THE ENGINE. THE CONSUMER WAS INFORMED THE WATER PUMP TO THE COOLANT WASN'T FUNCTIONING PROPERLY. PRIOR TO THE INCIDENT, THE CHECK ENGINE LIGHT ILLUMINATED, FAULTY COILS WERE REPLACED AND THE VEHICLE HAD A LEAKING COOLANT BOTTLE.  *JB",
        "vin": "WAULT64BX2N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/26/2007",
        "dateOfIncident": "11/24/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209928,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 AUDI A6.  WHILE DRIVING 25 MPH, THE ENGINE SHUT OFF WITHOUT WARNING.  THE VEHICLE WAS RESTARTED AFTER FOUR ATTEMPTS.  THERE WERE NO WARNING INDICATOR LIGHTS UNTIL AFTER THE VEHICLE RESTARTED.  THE ESP WARNING INDICATOR LIGHT ILLUMINATED.  THE VEHICLE IS CURRENTLY AT THE DEALER.  THE CURRENT AND FAILURE MILEAGES WERE 82,000.",
        "vin": "WAUJT64B32N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/17/2007",
        "dateOfIncident": "10/16/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206150,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM CONCERNED WITH THE SAFETY INVOLVED WITH THE CATALYTIC CONVERTER ON MY AUDI A6.  MY CHECK ENGINE LIGHT APPEARED AND I TOOK IT INTO MY LOCAL MECHANIC WHO SHOWED THE FAULT AS THE CATALYTIC CONVERTER. I THEN TOOK MY VEHICLE TO THE LOCAL AUDI DEALER WHERE THEY INSISTED IT WAS THE OXYGEN SENSOR.  I THEN HAD THIS REPLACED AND AUDI VERIFIED THAT EVERYTHING WAS CORRECT. ONCE AGAIN MY CHECK ENGINE LIGHT APPEARED 200 MILES LATER AND I TOOK THE VEHICLE BACK TO THE AUDI DEALER.  I REQUESTED THAT THEY CHECK THE CATALYTIC CONVERTER AGAIN AND THEY INSISTED THAT IT WAS ONCE AGAIN THE OXYGEN SENSOR.  THE WARRANTY ON THIS PART IS APPROACHING THE END.  I ASKED, \"IF THIS IS ONCE AGAIN REPLACED AND THE LIGHT COMES ON AGAIN IN A COUPLE HUNDRED MILES, MY WARRANTY WILL BE UP, WILL YOU COVER IT?  THEIR RESPONSE WAS, \"IF IT IS ONE MILE PAST THE WARRANTY, WE DON'T HAVE TO COVER IT.\"  FROM THIS COMMENT ONE WOULD CONCLUDE THEY ARE GIVING ME THE RUN AROUND UNTIL MY WARRANTY IS UP SO THEY WILL NOT BE HELD RESPONSIBLE.  MY CONCERN IS THAT AUDI IS FAILING TO COMPLY WITH A FEDERALLY MANDATED WARRANTY.  THEY SIMPLY DO NOT WANT TO REPLACE THE CONVERTER WHICH IS PLACING MY LIFE IN DANGER CONSIDERING A CAR CAN CATCH ON FIRE IF THE CATALYTIC CONVERTER IS NOT WORKING PROPERLY.   *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/02/2007",
        "dateOfIncident": "08/19/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204708,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER FROM AIR CONITIONING SYSTEM LEAKED INTO PASSENGER COMPARTMENT AND FLOODED AND DISABLED TRANSMISSION CONTROL MODULE.  TRANSMISSION WENT INTO \"LIMP MODE,' ALLOWING VEHICLE TO ONLY OPERATE IN 4TH GEAR.  *TR",
        "vin": "WAULD64B82N"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/04/2007",
        "dateOfIncident": "07/27/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198488,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT SWITCH (DIRECTLY ATTACHED TO BRAKE PEDAL) HAS FAILED TWICE.  ONCE IT ALLOWED THE BRAKE LIGHTS TO COME ON AT ANY TIME, EVEN WHEN THE VEHICLE WAS NOT BEING OPERATED.  THE SECOND TIME IT WAS NOT ACTIVATING THE BRAKE LIGHTS WHEN THE PEDAL WAS DEPRESSED.  IT HAS BEEN REPLACED BOTH TIMES.  VOLKSWAGEN VEHICLES HAVE BEEN RECALLED FOR A SIMILAR PROBLEM. *JB",
        "vin": "WAULT64B22N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/26/2007",
        "dateOfIncident": "03/10/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188943,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ENGINE FAILED WHILE DRIVING AT 35 MPH ON ROUTE 375 IN WOODSTOCK, NY. THE FAILURE WAS A RESULT OF ASSEMBLY BOLTS ON THE REVERSE SIDE OF THE EXHAUST CAM SHAFT VARIABLE VALVE TIMING SPROCKET LOOSENING AND FALLING OUT AGAINST THE CYLINDER HEAD, STALLING THE THE CAMSHAFT AND BREAKING THE TIMING BELT. INSPECTION OF BOLTS SHOW NEITHER A LOCK WASHER OR THREAD LOCK ADHESIVE WERE PRESENT TO PREVENT THE LOOSENING DUE TO HEATING AND COOLING OR VIBRATION. FURTHER SERVICE OF BOLTS CANNOT BE PERFORMED AS THERE ARE NO TIGHTENING SPECIFICATION FOR THESE BOLTS. AN EASY FIX FOR THIS MECHANICAL FAILURE WOULD BE TO REMOVE BOTH VALVE COVERS AND REPLACE THE BOLTS ON THE TIMING GEAR SPROCKETS WITH NEW BOLTS WITH ADHESIVE ON THE THREADS. THIS IS AN INTERFERENCE ENGINE, WHICH RESULTS IN A CATASTROPHIC FAILURE IN THE BENDING OF VALVES AND TOTAL ENGINE DESTRUCTION. *TR",
        "vin": "WAULT64B42N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/03/2007",
        "dateOfIncident": "10/31/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186805,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 AUDI A6.  THE CONTACT STATED THAT DURING THE COLD WEATHER SEASON THE  BRAKE BOOSTER FILLED WITH WATER AND  CAUSED THE BRAKES TO FAIL.  THE ABS INDICATOR ILLUMINATED.  THE CONTACT DISCOVERED THAT THE MASTER CYLINDER WAS RUSTED  AND NEEDED TO BE REPLACED ALONG WITH THE BRAKE BOOSTER.  THE MANUFACTURER WILL NOT REIMBURSE THE CONTACT FOR THE REPAIRS BECAUSE THEY WERE NOT DONE AT AN AUDI DEALER.  THE CONTACT POSSESSES THE REPAIR INVOICES.  THE CURRENT MILEAGE WAS 56,000, AND FAILURE MILEAGE WAS 54,000.*AK",
        "vin": "WAULD64B82N"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/28/2007",
        "dateOfIncident": "03/28/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186425,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT SWITCH FAILURE.  2002 AUDI A6.  CAR WAS HAVING PROBLEMS RUNNING, BRAKE LIGHTS WOULD STAY ON EVEN WHEN CAR WAS OFF, WAS WONDERING WHY VEHICLES WERE HONKING AT ME WHEN I WAS DRIVING.  SINCE CAR IS MADE BY VW AND THEY HAVE A MAJOR RECALL ONGOING WITH BRAKE SWITCH FAILURES JUST LIKE I ENCOUNTERED, AUDI SHOULD RECALL ALL THEIR MODELS TO FIX THIS PROBLEM TOO (FREE OF CHARGE!) UNLIKE ME WHO HAS TO PAY. *JB",
        "vin": "WAUML54B92N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/15/2006",
        "dateOfIncident": "08/20/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176238,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE TRAVELING VARIOUS SPEEDS, THE VEHICLE ACCELERATED SUDDENLY WITHOUT WARNING.  THE BRAKE PEDAL WAS DEPRESSED WHICH STOPPED THE VEHICLE.  THIS OCCURRED ON THREE OCCASIONS.  IT WAS TAKEN TO THE SERVICE DEALER, WHO WAS NOT ABLE TO IDENTIFY THE PROBLEM.",
        "vin": "WAUJT64B82N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/15/2006",
        "dateOfIncident": "08/23/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168384,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TRAVELING 30 MPH THE VEHICLE STOPPED AND HAD TO BE PULLED OVER.  THE CONTACT ATTEMPTED TO MOVE FORWARD WHEN THE FRONT END BEGAN TO SMOKE.  THE VEHICLE WAS DRIVEN TO AN INDEPENDENT REPAIR SHOP AT A SLOW SPEED WHERE IT WAS DETERMINED THAT THE BRAKES LOCKED UP.  THE VEHICLE WAS TOWED TO ANOTHER INDEPENDENT REPAIR SHOP WHO DETERMINED THE ABS PUMP FAILED AND WAS REPLACED.  UPDATED 10/6/2006 - *NM",
        "vin": "WAULT64B22M"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/14/2006",
        "dateOfIncident": "09/14/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168262,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED RECALL NOTICE #04V133000 WAS RECEIVED FOR A 2000 AUDI A6 PERTAINING TO ELECTRICAL SYSTEM. THE CONTACT ALSO OWNS A 2002 AUDI A6 WHICH A RECALL NOTICE WAS NOT RECEIVED FOR.  WHEN THE CONTACT RESEARCHED THE RECALL ON THE NHTSA WEBSITE, A LETTER IN THE DOCUMENT SEARCH FROM VOLKSWAGEN TO THE NHTSA IDENTIFIED THAT THE VIN FOR THE 2002 AUDI A6 MODEL WAS INCLUDED IN THE RECALL. WHEN THE CONTACT ALERTED THE MANUFACTURER WITH THE VIN, THEY INDICATED THERE WAS NO INFORMATION REGARDING THE RECALL OR VEHICLE IN QUESTION.",
        "vin": "WAULD64B52N"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/27/2006",
        "dateOfIncident": "05/28/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166643,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "EQUIP. MFG.,",
                "productMake": "EQUIP MFG,",
                "productModel": "EQUIP MFG,",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON AROUND MAY 28TH 2006- UPON RETURN FROM WORK THAT EVENING, THE FLOOR OF MY CAR WAS FLOODED- I WAS IN TOTAL SHOCK. I WAS ABOUT TO GO ON VACATION, I DRIED ALL THE FLOOR AND AIRED IT OUT ETC.  UPON MY RETURN FROM VACATION, IT WAS WORSE THAN EVER- THE FLOOR WAS AGAIN SOAKED, IT IN TURN HAD DAMAGED THE COMPUTER SYSTEM IN MY CAR AND THAT IN TURN HAD CAUSED THE BATTERY TO DRAIN. I HAD IT TOWED TO MY MECHANICS SHOP- THE FOLLOWING HAPPENED, THE ENGINE SEIZED AS A RESULT OF ALL THE WATER THAT MADE ITS WAY INTO THE CAR, AND COMPUTER SYSTEM TOTALLY DESTROYED.  THEY DRAINED AT LEAST 15 GALLONS OF WATER FROM THE CAR. THIS IS INCREDIBLE AND UNBELIEVABLE.  THE MECHANIC SAID THE CAR WAS CLOGGED AND EVEN HE HAD A HARD TIME ACCESSING, AND I AS OWNER HAD NO WAY OF FINDING OUT.  I BOUGHT THE CAR IN 05, IT  IS AN A6 3.0 YEAR 2002. WITH AROUND 54 THOUSAND MILES UP, AND I HAD ONLY PUT 1000 MILES UP ON THE CAR.  THE WARRANTY - EXTENDED, SAID IN TURN THE CAR IS NOT COVERED DUE TO MOTOR DAMAGE, AND A NEW ENGINE WOULD COST $8700 NOT TO MENTION THE MECHANIC FEES.  UPON FURTHER INVESTIGATION ONLINE, I SEE THAT THERE ARE SEVERAL REPORTS OF THIS PROBLEM WITH THIS YEAR AUDI AND OTHER YEARS AND VW PASSATS ALSO. I PAID NEARLY $26000 FOR THIS CAR AND FEEL I HAVE BEEN SCAMED BY AUDI, MAJOR AUTOMOTIVE WHO SOLD ME THE CAR AND THE GM PROTECTION PLAN WHO PROVIDES THE EXTENDED WARRANTY, - THE SALES PERSON ADVISED IT WAS BUMPER TO BUMPER COVERAGE- I NOW FIND OUT THAT I HAVE TO PAY FOR MY NEW ENGINE?? I FEEL ALL PARTIES SHOULD BE HELD RESPONSIBLE AND WANT TO KNOW IF ANYONES IS FILING A CLASS ACTION LAW OR DOING ANYTHING ABOUT THIS, WHERE IS THE PROTECTION FOR THE CONSUMER, PLEASE HELP ME, I AM NOT RICH, I SPENT ALL MY SAVINGS FOR THIS CAR, I AM CURRENTLY PAYING INSURANCE AND ALSO CAR PAYMENTS ON THIS CAR, I CANT AFFORD A NEW ENGINE, EVEN IF I COULD IS THE SAME PROBLEM GOING TO ARISE AGAIN. PLEASE HELP ME.  THANK YOU, E. MORRISSEY  (THERE IS NOT A SELECTION FOR AUDI UNDER VEHICLE. *JB",
        "vin": "WAULT64B42N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/03/2006",
        "dateOfIncident": "07/25/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164313,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED A PUDDLE OF GAS WAS OBSERVED UNDER THE VEHICLE.  IT WAS TAKEN TO THE DEALER WHERE THEY  DISCOVERED A GAS LEAK. A SEALANT WAS PLACED ON THE GAS TANK HOWEVER THE PROBLEM PERSISTED.                 UPDATED 09/12/06.*JB",
        "vin": "WAUVT64B42N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/05/2006",
        "dateOfIncident": "04/13/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158997,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ENGINE HAD STOPPED IN THE MIDDLE OF A BUSY HIGHWAY. THE FUEL GAUGE SHOWED THAT THERE WAS HALF A TANK OF GAS LEFT. IN REALITY THERE WAS NO FUEL IN THE CAR. CAR HAD TO BE TOWED AT OWNERS EXPENSE. FUEL SENDER UNIT HAD TO BE REPLACED AT OVER $500. THERE WAS A RECALL FOR THE SAME REASON FOR THE SAME PROBLEM FOR 2001 MODEL, BUT NOT 2002 WHICH HAS THE SAME PROBLEM. EXTREME DANGER TO A SAFETY OF THE DRIVER. THE CAR CAN RUN OUT OF FUEL WITH A FUEL GAUGE SHOWING THAT THERE IS A HALF A TANK OF GAS LEFT.  *NM",
        "vin": "WAULD64B22N"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2006",
        "dateOfIncident": "02/17/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152463,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE PURCHASED A 2002 AUDI A6 2.7T FROM SUNNYSIDE IN MIDDLEBURG HTS OHIO.  THE CAR HAD A VIBRATION FELT IN THE STEERING WHEEL AND FLOORBOARD WITH OEM WHEELS AND TIRES.  WENT BACK AND FORTH TO THIS SPECIFIC DEALER WITH NO RESULTS.  OTHER AREA DEALER, FRED BAKER WAS ABLE TO ALLEVIATE THE PROBLEM, BUT I ASKED IF PURCHASING NEW WHEELS AND TIRES WOULD FIX MY PROBLEM.  I WAS TOLD YES, AS LONG AS I GET WHEEL AND TIRES WITH MANUFACTURER'S SPECS. PURCHASED NEW WHEELS AND TIRES WITH THE FOLLOWING SPECS:  5X112MM BOLT PATTERN, WHEEL BORE TO FIT HUB BORE OF 57.1MM WITH HUBCENTRIC RING.   THE OFFSET OF THE TIRE IS 35MM (SAME AS OEM TIRE) AND THE VIBRATION BECAME WORSE.  THIS IS AT HIGHWAY SPEEDS.   DEALER TECH MANAGER DID NOT EVEN INSPECT THE VEHICLE, EVEN UNDER WARRANTY, JUST BLAMED THE WHEELS AND TIRES.  CONTACTED THE WHEEL SELLER, EDGERACING IN FLORIDA AND WAS TOLD THEY BUILD WHEELS FOR AUDI AND VW TO SPECS AND NEVER HAD ANY PROBLEMS BEFORE.  DEALER TECH MANAGER ASKED ME HOW I WANT TO PROBLEM FIXED.  MANUFACTURER'S MANUAL DOES NOT SAY THAT I SHOULD NOT BE UPGRADING MY CAR'S WHEEL TO MORE THAN SPECS. MY TIRE RATIO AND OFFSET REMAINED TO MANUFACTURER'S SPECS, AND I DO NOT FEEL THAT MY CAR IS SAFE WHEN DRIVING ON THE HIGHWAY. I DO NOT HAVE THE MONETARY RESOURCES TO INSPECT THE CAR TO SEE IF IT WAS EVER INVOLVED INTO AN ACCIDENT AND NEVER REPORTED TO CARFAX.  I HAVE BEEN DRIVING FOR 12 YEARS AND I CAN DIFFERENTIATE BETWEEN ROUGH DRIVING DUE TO LOWER PROFILE TIRES (PIRELLI PZERO NERO M/S 235/40/18) AND STEERING WHEEL VIBRATION AND FLOOR BOARD VIBRATION DUE TO SOME MECHANICAL PROBLEM THAT DEALER WILL EITHER NOT DISCLOSE OR ARE TRYING TO HIDE.  THEY DID DROP THE SALES PRICE FROM 26,995 TO 23,250 WHEN I PURCHASED THE CAR FROM THEM.  THE CAR IS STILL UNDER WARRANTY AND I HAVE CONTACTED THE AUTO MANUFACTURER IN GERMANY TO INFORM THEM OF THE POTENTIAL SAFETY ISSUE. PLEASE ADVISE ME HOW TO HANDLE THIS SITUATION, I FEEL THAT THE CAR HAS A MECHANICAL PROBLEM THAT THE DEALER IS TRYING TO HIDE.  *NM",
        "vin": "WAULD64B72N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/17/2005",
        "dateOfIncident": "11/04/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142968,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SERVICE BRAKES PULSATE DURING NORMAL USE AT ALL VEHICLE SPEEDS RESULTING IN UNEVEN BRAKING ACTION AND LONGER STOPPING DISTANCES.  DURING SCHEDULED WARRANTY SERVICE, REAR BRAKE ROTORS WERE FOUND TO BE WARPED BEYOND MANUFACTURER'S ALLOWABLE LIMITS. DEALER STATED THAT REPAIR WOULD NOT BE COVERED UNDER WARRANTY DUE TO AN \"OUTSIDE INFLUENCE.\"  WRITTEN MANUFACTURER'S WARRANTIES (\"AUDI ADVANTAGE\" AND \"AUDI WARRANTY\") DO NOT EXCLUDE BRAKE ROTORS.  COMPLAINT NUMBER WITH AUDI OF AMERICA IS 50426113.  REQUEST THAT DEALER BE DIRECTED TO MAKE REPAIRS UNDER STATED WARRANTIES TO RETURN BRAKES TO NORMAL, SAFE OPERATING CONDITION. *JB",
        "vin": "WAULT64B42N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/20/2005",
        "dateOfIncident": "10/15/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140377,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  CAR SEIZED AFTER GOING THROUGH CAR WASH; PRIOR TO THAT, CAR HAD EXPERIENCED ODD ELECTRICAL ISSUES, SUCH AS THE RADIO TURNING ITSELF ON AND OFF AND THE ALARM GOING OFF FOR NO APPARENT REASON.    CAR IS STILL UNDER BOTH THE AUDI OF AMERICA WARRANTY AND MAINTENANCE PROGRAMS.  2. ENGINE SEIZED.    3. THE REPAIRS REQUIRE AT LEAST A NEW ENGINE AT THE COST OF AT LEAST $13,000.00.      HERE IS MY ANALYSIS OF WHY I THINK AUDI IS TRYING TO PREVENT THIS DESIGN DEFECT FROM REACHING STATE AND FEDERAL REGULATORS.  IN SHORT, I BELIEVE THAT AUDI IS PURPOSEFULLY DENYING WARRANTY CLAIMS TO PREVENT A RECALL AND ALSO TO PREVENT A WRITTEN RECORD OF THIS DEFECT IN THE CASE OF CLASS ACTION OR PERSONAL INJURY LAW SUIT.  SPECIFICALLY, I BELIEVE AUDI OF AMERICA'S LEGAL DEPARTMENT HAS MADE A VERY CALCULATED DECISION: SINCE THE DAMAGE INVOLVES WATER, MOST COMPREHENSIVE INSURANCE POLICIES WILL COVER THE DAMAGE (IN FACT, MY INSURANCE CARRIER AGREED TO COVER THE CLAIM, ALTHOUGH THEY SAID THEY WOULD SEEK SUBJUGATION FROM AUDI).  FOR THOSE CUSTOMERS WHO PUSH HARD, AUDI WILL COVER THE REPAIRS OUT OF WARRANTY SO THAT AUDI WILL NOT HAVE TO REPORT THIS DEFECT TO STATE AND FEDERAL REGULATORS AND RISK A RECALL AND/OR PROVIDE EVIDENCE IN A CLASS ACTION OR PERSONAL INJURY LAW SUIT.    IN FACT, IT WASN'T UNTIL I EXPLAINED MY SUSPICIONS (SOME OF WHICH THE SERVICE MANAGER AT THE DEALERSHIP HAD CONFIRMED) TO AN AUDI OF AMERICA SUPERVISOR THAT I WAS ABLE TO MAKE ANY HEADWAY BEYOND, I'M SORRY, THIS IS NOT COVERED BY WARRANTY  ONCE I SET FORTH THE FACTS AND MY ANALYSIS OF THE SITUATION, HE CHANGED HIS MANNER AND EXPLANATION IMMEDIATELY.  HE EXPLAINED THAT AUDI MANAGEMENT AND LEGAL WERE WELL AWARE OF THE PROBLEM.  THAT AUDI HAD MADE A DETERMINATION NOT TO COVER REPAIRS CAUSED BY THE CLOGGED DRAIN HOLES UNDER WARRANTY BUT THAT THE DEALER COULD REQUEST A SPECIAL OUT OF WARRANTY SERVICE AND AUDI OF AMERICA WOULD REIMBURSE THE DEALER AT 100% OF ITS COST.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/18/2005",
        "dateOfIncident": "07/15/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133310,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNED THIS CAR FOR NEARLY 3 YEARS AND HAVE HAD TO REPLACE PADS/ROTORS 5-6X. AUDI NO LONGER COVERS THE REPLACEMENTS OF THE ROTORS AFTER ORIGINALLY COVERING THEM UNDER THE WARRANTY. THIS IS AN EXPENSIVE PROBLEM THAT CONTINUES TO REOCCUR. DEALER IN PORTLAND, OR IS OF NO HELP.*JB",
        "vin": "WAUML54B72N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/14/2005",
        "dateOfIncident": "06/25/2005",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128710,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER A SHORT DRIVE (ABOUT 3 MILES IN TOWN), THE CAR WAS PULLED INTO MY GARAGE A FEW MINUTES LATER MY WIFE NOTICED SMOKE COMING FROM UNDER THE HOOD.  I BACKED THE CAR INTO THE DRIVEWAY, OPENED THE HOOD AND SIGNIFICANT WHITE SMOKE WITH THE SMELL OF BURNING PLASTIC CAME FROM THE PASSENGER SIDE OF THE ENGINE COMPARTMENT, BELOW THE ENGINE, NEAR THE FIREWALL.  I USED A GARDEN HOSE TO EXTINGUISH THE FIRE.  I COULD NOT DETERMINE THE EXACT ORIGIN OF THE FIRE.  ON MONDAY, JUNE 27TH  I REPORTED THE INCIDENT  TO AUDI OF AMERICA.  A REFERENCE NUMBER OF 50231796 WAS ASSIGNED BY AUDI TO THE INCIDENT.  ON JUNE 29TH I WAS CONTACTED BY JAMES CRUZ AT AUDI WHO TOLD BE THAT HE WOULD BE TURNING THE INCIDENT OVER TO ENGINEERS WHO WOULD DECIDE WHAT THEY WANTED TO DO NEXT.  ON JULY 5TH JAMES CRUZ CALLED ME BACK AND SAID AUDI WAS NOT INTERESTED IN DOING ANY OTHER FOLLOW UP AND THAT I SHOULD JUST FILE A CLAIM WITH MY INSURANCE COMPANY.",
        "vin": "WAULT64B62N"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "06/07/2005",
        "dateOfIncident": "06/07/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124438,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALER AND FACTORTY HAVE REFUSED TO SEND ME MY ORIGINAL WARRANTY AND THE TECHNICAL SERVICE BULLETIN FOR BRAKE/ROTER REPAIR/REPLACEMENT.  WHEN THE CAR WAS SERVICED LAST YEAR THEY SAID THE BRAKES & ROTARS WERE NOT READY YET, BUT TODAY THEY SAY THE BRAKES AND ROTARS ARE NO LONGER COVERED. CONNECTICUT PUBLIC ACT 90-52 REQUIRES THEM TO DISCLOSE THIS INFORMATION.",
        "vin": "WAULD64B32N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/27/2005",
        "dateOfIncident": "05/24/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122311,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "ZEON 2XS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED NEW COOPER TIRES FROM GRAHAM AUTOMOTIVE @801 WEST 41ST ST, SIOUX FALLS, SD 57105 ON MAY 10TH OF 2004.  MY AUDI HAD 24,105 MILES ON IT WHEN I PICKED IT UP.  ON NOV. 17TH, 2004 I WAS RETURNING FROM SIOUX FALLS, SD @ ABOUT 11PM AND I HAD A BLOWOUT ON THE DRIVERS FRONT.  IT HAD 10,753 MILES ON IT.  I HAD TO CALL SEVERAL TIMES TO GET THEM TO GIVE ME 75.00 ON THE TIRE I HAD TO GET.  WELL ON MAY 23RD, 2005 I HAD RON LOBAN FROM DALE'S ALIGNMENT OF BROOKINGS, SD LOOK AT MY TIRES.  THE 3 WERE SO WORE OUT HE RECOMMENED THAT I NOT DRIVE THE CAR.  I DROVE IT TO MY RESIDENCE WHICH ABOUT 8 MILES FROM MY OFFICE.  ON THE WAY TO WORK I WAS ABOUT A MILE FROM WORK AND I BLEW THE DRIVERS SIDE FRONT TIRE OUT AGAIN.  THE TIRES ARE AT DALE'S ALINMENT @1006 MAIN AVE S. BROOKINGS, SD 57006-  PHONE # FOR THEM IS 605-692-5712.  GRAHAM AUTOMOTIVE SAID THEY CAN'T HELP.  I FEEL THAT WITH THE MILEAGE OF 40805 WHEN THE SECOND BLOW OUT OCCURED.  THAT MEANS I HAD 16,700 MILES ON 3 OF THEM AND THEY WERE SHOT AND THE 4TH BLEW WITH ONLY 10,755 ON IT THERE HAD TO BE SOMETHING WRONG WITH THEM.  PLEASE HELP IN GETTING SOME HELP FOR THIS.  I THANK YOU.   ILA K. SWENNING",
        "vin": "WAULD64B02N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/18/2005",
        "dateOfIncident": "04/19/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121335,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE OWNER OF A 2002 AUDI A6 4.2.  THIS IS THE SECOND EXACT MAKE AND MODEL THAT I HAVE OWNED.  MY COMPLAINT IS TWO FOLD.  FIRST AND FOREMOST, THIS PARTICULAR AUDI HAS NO REAR BRAKE PAD WEAR SENSOR.  BOTH VEHICLES I OWNED HAD REAR BRAKE FAILURE. THE SECOND VECHICLE I HAD THE IDEA TO CONTINOUSLY CHECK THE REAR BRAKES.  I FEEL THAT THE NTSHA SHOULD LOOK IN TO AUDI AND THE LACK OF A BRAKE FAILURE WARING SYSTEM.       SECONDLY,  THE FIRST FAILURE I HAVE WAS COMPLETELY COVERED BY WARRANTY.  THE CURRENT CAR WAS NOT COVERED.   AUDI HAS UNILATERALLY CHAGED THER WARRANTY POLICY.  THE HAVE DECIDED NO LONG TO WARRANTY WEARABLE PARTS.  FOR THE RECORD THE WARRANT STATED  THAT WEARABLE BRAKE PARTS ARE COVERED.",
        "vin": "WAUML64B32N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/04/2005",
        "dateOfIncident": "04/25/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119758,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A6 3.0 2005  68,000 MI.  PREMATURE WATER PUMP FAILURE  PREMATURE TIMING BELT FAILURE  AS I WAS PULLING INTO A SHOPPING CENTER PARKING SPOT ON 4/25/05, THE CAR BEGAN TO FEEL DIFFERENT AND THE POWER STEERING WAS NOT WORKING. I SHUT CAR OFF IMMEDIATELY AND IT WAS STEAMING. I TURNED KEY ON AGAIN WITHOUT STARTING ENGINE IN ORDER TO CHECK GUAGES.  THERE WAS NO INDICATION OF OVERHEATING.  OUTSIDE THE CAR THE COOLANT HAD LEAKED ONTO THE GROUND.         I HAD IT TOWED BY FLATBED TO WINNER AUDI IN WILMINGTON, DE.  THEY DIAGNOSED THAT WATER PUMP FAILED AND RESULTED IN TIMING BELT FAILURE, ALSO. QUOTED $2380.00 TO REPAIR THE TIMING BELT AND WATER PUMP.  ONCE THIS IS COMPLETED, FURTHER DIAGNOSTICS ARE REQUIRED TO DETERMINE IF MORE DAMAGE EXISTS.  SERVICE ADVISOR, MICHELLE SUGGESTED I CALL AUDI FOR ASSISTANCE. SHE SAID THAT SOMETIMES THEY WILL AGREE TO HAVE THE REPAIR DONE FOR THE CUSTOMER AT THE WARRANTY RATE, WHICH IS HALF THE REGULAR RATE.       I CONTACTED AUDI AMERICA CUSTOMER RELATIONS @ 800-822-2834 FOR ASSISTANCE.  WILLIE MOORE TOOK MY INFORMATION AND INDICATED THAT EVEN THOUGH THE VEHICLE WAS OUT OF WARRANTY, HE WOULD REVIEW THE PROBLEM WITH THE DEALER FOR POSSIBLE ASSISTANCE WITH MY REPAIR.  AFTER PUTTING ME OFF TWICE, SAYING THAT \"THE DEPARTMENT WAS CLOSED FOR A FEW DAYS\" EACH TIME, HE FINALLY CALLED ME WITH AN ANSWER AFTER 8 DAYS.  THE ANSWER WAS THAT SINCE THE VEHICLE WAS OUT OF WARRANTY, AUDI WOULD NOT ASSIST ME IN ANY WAY.  I COULD NOT HELP BUT WONDER, WHY PUT ME THROUGH 8 DAYS OF WAITING AND FALSE HOPE IF THE ANSWER WAS AS SIMPLE AS THAT! ALL OF US KNEW FROM THE START THAT THE CAR WAS OUT OF WARRANTY!",
        "vin": "WAULT64B02N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/06/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117589,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 AUDI A6 BRAKE EQUIPMENT FAILS IN COLD WEATHER.   *MR   THIS WOULD OCCUR WHEN THE TEMPERATURES BELOW 10 DEGREES.   *SC",
        "vin": "WAULT64B22N"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/31/2005",
        "dateOfIncident": "10/19/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109362,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE WILL  SHUT DOWN, AND THE STEERING WILL LOCK UP. THIS  HAPPENED FOUR TIMES.*AK",
        "vin": "WAUJT64B32N"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/14/2004",
        "dateOfIncident": "12/05/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10098832,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WET ROADS, ACCELERATION UP HILL, CAR SLID OVER HILL CRASHED INTO SEVERAL TREES, RESTRAINED FS PASSENGER WITH SEVERE BONE, SOFT TISSUE AND NERVE DAMAGE.  NO AIRBAG DEPLOYMENT, QUESTION OF SEATBELT FAILURE.  STATUTE SOON TO EXPIRE, MANUFACTURER WILL NOT RESPOND RE:TESTING POSSIBLE FAULTY PARTS.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/11/2004",
        "dateOfIncident": "12/05/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10098703,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WET ROADS, LARGE HILL  CAR OVER CLIFF T BONE TREE, NO AIRBAG DEPLOYMENT, QUESTION OF SEAT BELT FAILURE.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/09/2004",
        "dateOfIncident": "12/05/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10098567,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A-6, 2000, WET ROAD CONDITIONS, APROXIMATELY 36 DEGREES, STEEP HILL CAR SLID OFF ROAD, DOWN EMBANKMENT FRONT/SIDE CRASH  NO AIRBAG DEPLOYMENT AND QUESTION OF SEATBELT FAILURE  RESTRAINED FS PASSENGER WITH COMMINUTED, SEGMENTAL HUMERUS FRACTURE, NERVE AND SOFT TISSUE DAMAGE  CAR SAT IN GARAGE FOR 10 MONTHS, AUDI REFUSED TO RESPOND TO CORRESPONDANCE ABOUT POSSIBLE FAILURE OF VEHICLE.  *AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/14/2004",
        "dateOfIncident": "08/11/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086825,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GANS",
                "productMake": "PIRELLI",
                "productModel": "PIRELLI",
                "productYear": "1998",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2002 AUDI A6 WAS TAKEN TO  SUNSET AUDI IN PORTLAND OR IN DEC.2003 BECAUSE APPEARED TIRES WERE WEARING-SHAVING ON EDGES AND MIDDLE,THEY ALIGNED THE CAR.  ON AUGUST 11TH  ONE OF THE TIRES WENT FLAT.  ON THE NEXT FRIDAY THE CAR WAS TAKEN TO LES SCHWAB WHICH IS THE WARRANTY AGENT FOR PIRELLI.LES SCHWAB TIRE STORE SAID THAT THEY JUST HAD ANOTHER AUDI IN THE SAME THING ON THE EXACT SAME TYPE OF CAR AND THEY HAD SEE  MANY OTHERS THAT HAD BEEN COMING IN FORTHE SAME PROBLEM. PIRELLI HAS THEM SEND BACK THE TIRES AND WOULD DETERMINE IF ANY MONEYWOULD BE RETURNED.  BESIDES THE FLAT TIRE ALL THE TIRES HAD TO BE REPLACED.LES SCHWAB SAID THAT IT DID NOT IN ANY WAY LOOK LIKE ALIGNMENT PROBLEM THAT INSTEAD THEY THOUGHT THAT THE RUBBER COMPOUND WAS NOT ADEQUATE.  MY CAR IS 2 YEARS OLD WITH ONLY 10,000 MI  AUDI SAYS THEY HAVE NO RESPONSIBILITY FOR THE TIRES AS THAT IS A WARRANTY WITH PIRELLI HOWEVER SINCE IT MAY BE THAT EITHER AUDI DID NOT SPECIFY THE RIGHT TIRE OR  PIRELLI GAVE TIRES IN ADEQUATE IN THE THICKNESS OF THE RUBBER.  THE BOTTOM LINE WAS THAT I A 77 YEAR OLD  FEEL THAT I HAVE BEEN TAKEN,I HAD TO PAYOUT  A LITTLE OVER $400 FOR FOUR NEW TIRES ON MY LOW MILEAGE CAR. IN ADDITION I ONLY DRIVE ON WELL PAVED ROADS AND NO FREEWAYS.  I FEE THAT SOMEONE IS NOT BEING ACCOUNTABLE FOR THE SAFEY OF MYSELF AND OTHERS.  SINCE AUDI SENDS ALL THE TIRE PROBLEMS TO PERRILE THEY NEVER HEAR BACK IF THERE ARE PROBLEMS. MY CONCERN IS THAT NOT ONLY ONE TIRE BLEW OUT BUT ALL F OUR COULD HAVE GONE OUT AT ONCE--HOW MANY OTHER  AUDI OWNERS ARE OUT THERE WITH TIRES SHREDDING.  I HAVE ASKED AUDI TO FIND OUT IF THE TIRE COMPANY WILL BE GIVING ME MY  MONEYBACK--THEY TOLDME AT THE DEALER THAT THE ONLY MONEY THE TIRE COMPANY GIVES BACK IS  IF THERE IS A DEFECT AND THEY  HAVE NEVER KNOW THIS TIRE COMPANY TO FIND DEFECTS--THUS AUDI DOES NOT HAVE  TO PAY  FOR TIRES AND NEITHER WILL THE TIRE CO.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/15/2004",
        "dateOfIncident": "05/24/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074174,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING INSIDE OF THE GARAGE, THE VEHICLE SUDDENLY ACCELERATED. THIS CAUSED THE VEHICLE TO SKID INTO THE BACK WALL OF THE CONSUMERS HOME.  NO INJURIES REPORTED.  THE VEHICLE  WAS TOWED TO THE DEALER FOR INSPECTION.   *AK   *SC *JB",
        "vin": "WAUJT64B22N"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/10/2004",
        "dateOfIncident": "05/05/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075187,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I ATTEMPT TO ACCELERATE IMMEDIATELY AFTER USING THE BRAKES, NOTHING HAPPENS. THE CAR'S THROTTLE APPEARS TO HAVE NO EFFECT FOR 2+ SECONDS, EVEN WHEN PRESSED ALL THE WAY TO THE FLOOR.  ON SEVERAL SEPARATE OCCAISIONS, WHILE TRYING TO MERGE INTO TRAFFIC, I HAVE NEARLY BEEN HIT BY AN ONCOMING VEHICLE WHILE WAITING FOR MY CAR TO UNDERSTAND THAT I INTENDED TO ACCELERATE.  THIS IS NOT TURBO LAG; IT IS COMPUTER-INDUCED THROTTLE LAG.  (THE ENGINE RPMS DO NOT CHANGE DURING THESE OCCURRENCES.)  THIS IS A CLEAR SAFETY ISSUE THAT AUDI MUST ADDRESS.  (A REPRESENTATIVE OF MY DEALERSHIP TOLD ME HE IS QUITE AWARE OF THE PROBLEM AND HAS PERSONALLY EXPERIENCED IT.  BUT AUDI INFORMED HIM IT DOES NOT SEE THIS AS A PROBLEM.)   *AK",
        "vin": "WAULD64B22N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/16/2004",
        "dateOfIncident": "01/26/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062365,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WIPER BLADES NOT FUNCTIONAL IN WINTRY CONDITIONS.  BLADE DOES NOT REMOVE SNOW AND THUS FREEZES AND BECOMES A LAYER OF ICE.  CAN'T SEE. VERY DANGEROUS.  DEFROSTER MELTS THE SNOW HOWEVER THE OEM BLADE ISN'T STRONG ENOUGH TO REMOVE & THUS MORE ICE. NO WINTER BLADES ARE AVAILABLE AS THE MANUFACTURER - AUDI-  HAS REDESIGNED THE BLADE CONNECTION. *JB",
        "vin": "WAUVT64B22N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/09/2004",
        "dateOfIncident": "02/09/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057777,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN INCLEMENT WEATHER  WINDSHIELD WIPERS WILL NOT CLEAR OFF THE SNOW ON THE FRONT WINDSHIELD. DEALER INDICATED THAT   IT WAS A MANUFACTURING  DESIGN FLAW, AND THERE WAS NO SOLUTION  TO THE PROBLEM. *AK  *LA",
        "vin": "WA1YD64B42N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070745,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SOUND OF METAL RATTLING TOWARDS THE FRONT END OF THE CAR.  SOUNDS AS IF SOMETHING IS GOING TO FALL OFF THE CAR.  AUDI COULD NOT IDENTIFY THE PROBLEM FOR 10 DAYS AND THEN SAID THEY IDENTIFIED THE PROBLEM AS FRONT BREAK PADS COMING LOOSE.  THEY REPAIRED WHAT THEY THOUGHT TO BE THE PROBLEM.  WE RETURNED TO CAR TO THEIR SERVICE CENTER 5 WEEKS LATER WITH THE SAME PROBLEM.  THEY CAN NOT IDENTIFY WHAT IS WRONG WITH THE CAR AND WILL NOT GIVE US A GUARANTEE IN WRITING THAT THE VEHICLE IS SAFE TO DRIVE.  MY WIFE IS 4 MONTHS PREGNANT AND WE ARE NOT COMFORTABLE HAVING HER DRIVE A CAR WITH A FRONT BRAKE PROBLEM.  AUDI IS REFUSING TO BUY THE CAR BACK.",
        "vin": "WAULD64BX2N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040275,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION COIL SPRING FAILED AND DAMAGED THE ENGINE. CONSUMER INDICATED THAT THE COIL SPRING WAS SERVICE TWICE UNDER THE RECALL FOR THIS ISSUE PRIOR TO THIS INCIDENT. RECALL NOT FOUND. *AK",
        "vin": "WAULT64B02N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": "09/11/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038750,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OUT OF CONTROL EXPERIENCE DUE TO UNWANTED ACCELERATION OF VEHICLE.   THE VEHICLE ACCELERATED WHEN THE GAS PEDAL WAS RELEASED, THE ENGINE REVVED PAST THE REDLINE, AND THE VEHICLE DID NOT SLOW DOWN WHEN THE BRAKES WERE ENGAGED AND WE ALMOST DID NOT MAKE THE TURN INTO OUR NEIGHBORHOOD.   EVEN WHEN WE PUT THE VEHICLE IN NEUTRAL,THE ENGINE DID NOT STOP REVVING. WE CHECKED TO MAKE SURE THE CRUISE CONTROL WAS NOT ON AND TRIED THE ENGINE AGAIN, ONLY TO HAVE THE ENGINE REV THROUGH THE REDLINE WHEN ONLY THE BRAKE PEDAL (AND NOT THE GAS) WAS ENGAGED.  WE TURNED THE CAR OFF AND PUSHED IT TO A SAFE LOCATION WHERE WE LEFT IT, AND CALLED THE POLICE (WHO WOULD NOT MAKE AN INCIDENT REPORT) AND LEFT A MESSAGE AT THE DEALERSHIP.   *PH",
        "vin": "WA1YD64B12N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "03/22/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026415,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 AUDI A6 BREAKDOWN.  NAR 06/26/2003   *MR  THE CONSUMERS VEHICLE BROKE DOWN AND HAD TO BE TOWED TO THE NEAREST DEALERSHIP UPON  ARRIVAL ALL OF THE IGNITION COILS HAD TO BE  REPLACED. HOWEVER, THE AUDI DEALERSHIP DID NOT MAKE THE CUSTOMER AWARE OF THE  IGNITION COILS BEING INOPERATIVE UNTIL THE INCIDENT HAD OCCURRED. THE CONSUMER WAS VERY DISSATISFIED THAT AUDI DID NOT MAKE CUSTOMERS AWARE OF THE VEHICLE DEFECT.  THE CONSUMER WOULD LIKE FURTHER INVESTIGATIONS ON ANY UPDATED DEFECTS TO DATE.    *CB  *JB",
        "vin": "WAULT64BX2N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/15/2003",
        "dateOfIncident": "03/08/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014409,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DELAYED THROTTLE RESPONSE.  *JB",
        "vin": "WAUVT64B12N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "05/18/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010056,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE JERKED HEAVILY, WHILE DRIVING.*JB",
        "vin": "FULLFILL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2003",
        "dateOfIncident": "02/01/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006716,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION COILS ARE DEFECTIVE AND ARE REDUCING THE PERFORMANCE OF VEHICLE.  CONSUMER RECEIVED A LETTER FROM THE MANUFACTURER ACKNOWLEDGING DEFECTIVE COILS, BUT WILL ONLY REPLACE WHEN THEY FAIL.       PH",
        "vin": "WAUVT64B12N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/30/2003",
        "dateOfIncident": "01/04/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004948,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTER COILS ON MY 2002 AUDI A6 FAILED.  DEALER REPLACED 4 FAILED STARTER COILS, BUT UNABLE TO REPLACE OTHER 2 UNTIL THEY FAIL.  RECENT NEWS ARTICLE CITED A4'S, BUT MY A6 HAD PROBLEM",
        "vin": ""
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "01/22/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003188,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 AUDI A6 AS OUR \"FAMILY CAR.\" DURING THE PURCHASE PROCESS I INQUIRED ABOUT THE SAFETY REGULATIONS IN REGARDS TO THE SIDE AIRBAGS (REAR SEAT) AND CHILD SAFETY SEATS. I WAS TOLD THAT AS LONG AS THEY WERE POSTIONED PROPERLY THAT THERE WAS NO DANGER TO A CHILD IN A PROPERLY INSTALLED SEAT. NOT LONG AFTER RECIEVING THE VEHICLE, WE FOUND OUT THE \"FAMILY\" WAS IMMINENT. DURING MY RESEARCH INTO WHAT CHILD SAFETY SEAT TO PURCHASE, I WAS SHOCKED TO FIND OUT THAT THE DEALERSHIP PROVIDED ME WITH INACCURATE INFORMATION. I ALSO FOUND OUT THAT YOU ARE NOT SUPPOSED TO PLACE A REAR-FACING CAR SEAT IN FRONT OF A FOLD DOWN ARM REST. THIS BASICALLY RULED OUT MY ENTIRE BACK SEAT!! I BEGAN TO WORK WITH AUDI TO SOLVE THE PROBLEM. I HAVE SPOKEN WITH THE GENERAL MANAGER, SERVICE MANAGER AND ANYONE WHO WOULD LISTEN. I REALIZED JUST HOW IGNORANT THEY ARE ON THE SUBJECT AND THAT I WAS SOLD THIS VEHICLE (WITH THE UPGRADES/AIRBAGS) UNDER FALSE PRETENSES AND INACCURATE INFO FROM THOSE WHO ARE SUPPOSED TO KNOW THEIR CARS. I HAVE WORKED WITH THE LOCAL FIRE DEPARTMENT AUTHORIZED TO CHECK THE INSTALLATION OF CAR SEATS AND WE HAVE FOUND A SOLUTION. BUT I AM NOT HAPPY WITH THE FACT I MUST \"FIND A SOLUTION\" TO A PROBLEM THAT SHOULD HAVE NEVER OCCURED. OF COURSE AUDI WILL DO ANYTHING I AM WILLING TO PAY FOR, YET I DON'T FEEL I SHOULD BE REQUIRED TO PAY FOR THEIR INACCURATE INFORMATION. THEY WILL NOT DISABLE MY REAR AIRBAGS EITHER! WHAT COURSE OF ACTION DO YOU RECOMMEND? IS THERE A WAY TO HAVE THEM DISABLE MY AIRBAGS? IS THERE SOME WAY THAT I CAN MAKE AUDI TAKE RESPONSIBILTY FOR THE KNOWLEDGE, OR LACK THERE OF WITH THEIR EMPLOYEES?",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2003",
        "dateOfIncident": "12/20/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003716,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE  HAD A DEFECTIV IGNITION COILS.  DEALER WOULD NOT REPLACE THE COILS. TS.  *AK",
        "vin": "WAUVT54BX2N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006649,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION COILS HAVE FAILED ON THREE SEPARATE OCCASIONS, WHICH IS NOT ONLY INCONVENIENT BUT DANGEROUS AS THE CAR LOSES POWER WITHOUT WARNING.  AUDI ADMITS THAT THE COILS ARE DEFECTIVE BUT WILL NOT REPLACE THE REMAINING THREE UNTIL THEY ACTUALLY FAIL.  THIS MAKES THE CAR UNRELIABLE AS WELL AS DANGEROUS AS THE CAR LOSES POWER WITHOUT WARNING.  AUDI ACKNOWLEDGES THAT THE IGNITION COILS ARE DEFECTIVE BUT WILL NOT REPLACED THEM UNTIL THEY FAIL.  AS THERE ARE SIX OF THEM ON MY CAR, AUDI ACKNOWLEDGES THAT THE REMAINING THREE MAY ALSO FAIL (ONE IGNITION FAILED TWICE SO FOUR MORE MAY FAIL).  ACCORDINGLY THE CAR IS UNRELIABLE AS WELL AS DANGEROUS BUT AUDI REFUSES TO PUT IN NON DEFECTIVE IGNITION COILS.   *JB    ****DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT-OVER TO ARTEMIS*****770841****",
        "vin": "WAUVT54BX2N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2003",
        "dateOfIncident": "01/05/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000835,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 AUDI A6 AVANTE WAGON AUTOMATIC TRANSMISSION - THERE IS A SIGNIFICANT\"HESITATION\" ON ACCELERATION SUCH THAT THE CAR DOES NOT INITIALLY RESPOND WHEN THE ACCELERATOR IS DEPRESSED BUT DOES SO SUDDENLY A SHORT TIME RESLTING IN A HESITATION.  I CONSIDER THIS TO BE A SIGNIFICANT SAFETY CONCERN SINCE THE ACCELERATION OF THE CAR IS UNPREDICTABLE.  THE CAR HAS BEEN TAKEN TO TWO DEALERS TO DEAL WITH THIS PROBLEM, BOTH REPORTING THAT THIS IS NORMAL FOR THE \"FLY-BY-THE-WIRE\" SYSTEMS WHICH IS USED IN THE CAR AND THAT THERE IS NO ADJUSTMENT OR CORRECTION FOR THIS.  I FIND IT TO BE OF CONCERN AND A SAFGETY ISSUE THAT AAUDI SHOULD DEAL WITH BEFORE THERE IS A SERIOUS ACCIDENT.",
        "vin": "WAUVT64B42N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/30/2002",
        "dateOfIncident": "12/23/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000641,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I AM ADDING TO A PREVIOUS COMPLAINT [ODI 768857 - REF 704187] REPORTING 2 GOODYEAR SIDE WALL TIRE FAILURES. I HAVE NOW EXPERIENCED A 3RD SIDE WALL BUBBLE AND FAILURE. AGAIN THERE IS NO RIM DAMAGE AND PROPER TIRE PRESSURES HAVE BEEN MAINTAINED. THE CAR HAS NOT BEEN OPERATED OFF ROAD. I'M CAUGHT BETWEEN AUDI WHICH TAKES NO RESPONSIBILITY FOR THE TIRES ON THEIR CARS AND GOODYEAR. I HAVE NEVER HAD TIRE FAILURES ON ANY OF THE OTHER 5 CARS WE OWN AND CONTINUE TO BE SURE THAT THIS MUST BE A COMMON PROBLEM CAUSED BY WEAK SIDE WALLS.",
        "vin": "WA1YD64B72N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/20/2002",
        "dateOfIncident": "11/29/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001334,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE JERKS FORWARD.  THE MECHANIC INDICATED THAT THE ONE OUT OF THE SIX CYLINDER COIL HAD BROKE, AND THIS IS COMMON PROBLEM WITH THIS VEHICLE BECAUSE OF THE DESIGN.  THEY ALSO INDICATED THAT THE REMAINING FIVE COILS WILL ALSO BREAK.  TS *JG",
        "vin": "WAULT64B42N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2002",
        "dateOfIncident": "12/04/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770550,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS WAS THE SECOND TIME A COIL FAILED ON MY CAR; THE FIRST TIME WAS LAST SPRING. AUDI ACKNOWLEDGES PROBLEM BUT REFUSES TO REPLACE ALL COILS, SAYING IT WILL ONLY REPLACE THOSE THAT HAVE ALREADY FAILED, LEAVING A POTENTIAL FOR SIX FAILURES. AUDI SAYS UPGRADED COILS ARE ON BACK ORDER AND ARE THEREFORE UNAVAILABLE TO MOST DEALERS. MY DEALER HAS AT LEAST TWO CARS WAITING FOR REPAIR. THIS DEFECT MAKES THE CAR TOTALLY UNRELIABLE, SINCE THE FAILURE HAPPENS WITHOUT WARNING AND RENDERS THE CAR VIRTUALLY IMMOBILE. DRIVING IT AFTER THE FAILURE ALSO RISKS DAMAGE TO THE CATALYTIC CONVERTER AND OTHER COMPONENTS. THERE SHOULD BE IMMEDIATE NOTIFICATION OF OWNERS SO THEY CAN AT LEAST TRY TO AVOID LATE NIGHT DRIVING OR OTHER SITUATIONS WHERE THEY AND THEIR PASSENGERS MIGHT BE AT RISK IN CASE OF COIL FAILURE. THERE SHOULD BE A RECALL AS SOON AS THE  COILS ARE AVAILABLE.  DT",
        "vin": "WAUVT54BX2N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/13/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769658,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO TRANSMISSION LAGS UP TO 1 SECOND IN RESPONDING WHEN ACCELERATOR PEDAL IS DEPRESSED. THIS HAS CAUSED A FEW CLOSE CALLS WHEN TRING TO MAKE TURNS INTO TRAFFIC. TRANS ALSO LAGS WHEN SHIFTING FROM REVERSE INTO DRIVE. ENGINE REVS BUT DRIVETRAIN DOES NOT CATCH. THEN CAR TAKES OFF WITH A JOLT. ALSO, EXPERIENCING A VIBRATION FROM CAR WHEN DRIVING EVEN AFTER CHECKING BRAKE ROTORS, WHEEL BALANCE AND ALIGNMENT. SEEMS TO COME AND GO. COULD BE TRANSMISSION RELATED.  DT",
        "vin": "WA1YD64B62N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/25/2002",
        "dateOfIncident": "09/17/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768903,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM I AM EXPERIENCING IS A LAG IN THROTTLE RESPONSE. WHEN THE ACCELERATOR IS DEPRESSED THERE IS  A MOMENT WHERE NOTHING  HAPPENS THEN, A SECOND LATER THE CAR ACCELERATES VERY RAPIDLY. THIS ESPECIALLY NOTICEABLE WHEN DRIVING IN STOP-AND-GO TRAFFIC WHERE YOUR FOOT GOES FROM THE BRAKE TO THE THROTTLE FREQUENTLY.  MY WIFE ALMOST HAD AN ACCIDENT DUE TO THIS DELAY; SHE WAS MAKING A LEFT TURN ACROSS THE ONCOMING LANE, WHEN AN OPENING APPEARED, SHE DEPRESSED THE ACCELERATOR AND FOR A MOMENT NOTHING HAPPENED, THEN THE CAR FINALLY GOES AND PUTS HER RIGHT INTO THE PATH OF ONCOMING TRAFFIC. HAD THE ONCOMING CAR NOT BRAKED, SHE FEELS SHE WOULD HAVE BEEN HIT.  IT IS FOR THIS REASON THAT I BELIEVE THIS IS A SAFETY ISSUE AND NOT A CONVENIENCE ISSUE. I CONTACTED AUDI VIA E-MAIL TO LET THEM KNOW ABOUT THIS AND THEY INSTRUCTED ME TO BRING THE CAR TO THE DEALER FOR A DIAGNOSIC AND ROAD TEST WHICH I DID. THE DEALER STATED THAT THE CAR IS \"OPERATING WITHIN MANUFACTURER'S SPECS'' AND THERE IS NOTHING WRONG WITH THE CAR. WHEN I FOLLOWED UP WITH AUDI THEY CONCURRED WITH THE DEALER AND AGAIN STATED THAT THERE IS NOTHING THAT CAN BE DONE. I LOGGED-ON TO AN AUDI ALLROAD FORUM(AUDIWORLD.COM) AND MANY OTHER ALLROAD OWNERS ARE EXPERIENCING THE SAME PROBLEMS, AND GETTING THE SAME RESULTS WHEN THEY CONTACT AUDI, WHICH IS NO AKNOWLEDGEMENT OF THE PROBLEM. SOME OWNERS REPORT TO HAVE HAD CLOSE CALLS. MANY OWNERS FEEL IT IS THE DRIVE BY WIRE ACCELERATOR WHILE OTHERS FEEL IT IS THE TRANSMISSION. EITHER WAY IT IS DANGEROUS AND SHOULD BE ADDRESSED BY AUDI .  DT",
        "vin": "WA1YD64B32N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/24/2002",
        "dateOfIncident": "07/01/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768857,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD 2 SEPARATE SIDE WALL FAILURES ON THE FRONT TIRES. THE FIRST WAS IN LESS THAN 10,000 MILES AND THE SECOND WAS ON A NEW TIRE IN LESS THAN 5,000 MILES ON A NEW REPLACEMENT. NEITHER FAILURE SHOWED ANY EVIDENCE OF RIM DAMAGE OR OTHER EXTERNAL EVENT. WE ARE CAUGHT BETWEEN AUDI AND GOODYEAR EACH OF WHICH WANT US TO CALL THE OTHER PARTY. THIS APPEARS TO BE A SYSTEMIC PROBLEM RELATED TO THE AUDI TT TIRE RECALL.  DT",
        "vin": "WA1Y064B72N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019392,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHIFTS FROM AUTOMATIC MODE TO MANUAL MODE INADVERTENTLY.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP.  PLEASE DESCRIBE DETAILS.  *MR",
        "vin": "WAULT64B42N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/24/2002",
        "dateOfIncident": "02/15/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019267,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THE WINDSHIELD IS DISTORTED, DEALER REPLACED WINDSHIELD. THE NEW WINDSHIELD IS OF SAME DESIGN, AUDI HAS STATED ALL WINDSHIELDS HAVE THIS DISTORTION. PLEASE PROVIDE ADDITIONAL INFORMATION.*JB",
        "vin": "ADD"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/03/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766643,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS SEVERE HESITATION IN ACCELERATION.*AK",
        "vin": "WAULT64B02N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "07/09/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013699,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WILL SLOW DOWN WITHOUT AND SHUT DOWN WITHOUT PRIOR WARNING.    DEALERSHIP IS AWARE OF  PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/14/2002",
        "dateOfIncident": "01/02/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011867,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING RIGHT OR LEFT TURNS  VEHICLE WILL SHUTOFF OR WILL START TO LOOSE POWER. CONTACTED DEALER, AND THE DEALER WAS NOT WILLING TO DO ANYTHING.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/24/2002",
        "dateOfIncident": "02/28/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010463,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT  WINDSHIELD IS BENT OR DISTORTED. UNABLE TO SEE OUT OF WINDSHEILD CLEARLY. HAD  WINDSHIELD REPLACED,  PROBLEM REOCCURRED. *AK",
        "vin": "PLEASE FILL"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/20/2002",
        "dateOfIncident": "05/16/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762087,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE AND CAR HAVE BEEN MAINTAINED TO MANUFACTURER SPECS, TIRES HAVE AUTOMATIC TIRE PRESSURE MONITORS.  AT ABOUT 11000 MI I NOTICED SOME FEATHERING OF ALL 4 TIRES.  I TOOK IT IN AT ABOUT 11700 AND DEALER AGREED ALL 4 TIRES WERE WEARING ABNORMALLY.  THEIR FACTORY REP BLAMES GOODYEAR, DELAER STATED 4 WHEEL ALIGNMENT WAS OFF.  THEY HAVE DONE NOTHING TO DATE ABOUT THE TIRES PREMATURELY WEARING.  AT ABOUT 12600 MI THE TIRE PRESSURE MONITOR INDICATED A SUDDEN DECREASE IN PRESSURE FOR THE RR TIRE.  I WAS GOING ABOUT 15 MPH AND WAS NEAR A TIRE SHOP.   WHEN I ARRIVED AT THE SHOP, THE TIRE WAS NEARLY FLAT.  THEY REPAIRED THE TIRE, BUT INFORMED ME THAT THREE OF THE FOUR TIRES WOULD NOT PASS SAFETY INSPECTION.  THE RIGHT FRONT AND RIGHT REAR HAVE NOT TREAD LEFT AND THE THE LR IS NEARLY GONE.  THE LF WOULD PASS BUT IS BADLY FEATHERED FOR ONLY 12600 MILES.  THE CAUSE OF THE FLAT TIRE WAS A NAIL I HAD PICKED UP IN THE NEARLY BALD RR TIRE.  THE SHOP SAID IF IT HAD HAPPENED AT FREEWAY SPEEDS IT WOULD HAVE BEEN VERY DANGEROUS.  THEY STATED A NORMALLY TREADED TIRE WOULD NOT HAVE PICKED UP THE NAIL, BUT BECAUSE OF EXCESSIVE WEAR, THE NAIL IMMEDIATLELY PUNCTURED THE TIRE.  THE FACTORY REP TOLD ME THAT AUDI HAD BEEN EXPERIENCING SOME PROBLEMS WITH THE GOODYEAR TIRE DESIGNED ESPECIALLY FOR THE ALLROAD MODEL AND THEY HAD NOT SEE MUCH PROBLEM WITH THE PIRELLI TIRES FOR THE SAME MODEL.  I THINK SOMEONE NEEDS TO LOOK INTO THE MANUFACTURE AND SAFETY LEVEL OF THE GOODYEAR WRANGLER MADE ESPECIALLY FOR THE AUDI ALLROAD.  PEOPLE WHO BUY THESE CARS COUNT ON THEM BEING SAFE AND ABLE TO PERFORM.  TIRES SHOULD CERTAINLY LAST MORE THAN 10000 MILES AND ALL FOUR SHOULD WEAR EVENLY.*AK",
        "vin": "WA1YD64B22N"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/15/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761923,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL XENON HEADLAMPS SHOULD BE BANNED.  THEY BLIND ONCOMING DRIVERS !!!",
        "vin": ""
    }
]