[
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2017",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946361,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW Z4. AFTER THE VEHICLE WAS PURCHASED, THE CONTACT DISCOVERED THAT THE POWER STEERING BECAME DIFFICULT TO CONTROL. THE CONTACT TOOK THE VEHICLE TO A DEALER WHERE IT WAS DIAGNOSED THAT THE POWER STEERING WAS DEFECTIVE. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 63,000.",
        "vin": "4USBT53555L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/28/2014",
        "dateOfIncident": "09/27/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639592,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONIC POWER STEERING LIGHT CAME ON WHILE DRIVING DOWN THE HIGHWAY LOST POWER ASSISTED ABILITY. STEERING WHEEL WAS DIFFICULT, BACK TO THE OLD MANUAL DAYS.. NEVER THOUGHT TO ASK WHY..BUT VEHICLE ALWAYS HAD A DETENT QUIRK SINCE 2003..JUST THOUGHT IT TYPICAL FOR HOW A SPORTS CAR WAS DESIGNED. AFTER CHECKING OTHERS SIMILAR PROBLEMS I GUESS I'VE BEEN MISLED INTO BELIEVING THAT WAS TYPICAL AFTER ALL THIS TIME.TAKING IT TO THE DEALER IN THE NEXT FEW DAYS TO SERVICE PROBLEM. IF YOU HAVE A PROBLEM LIKE THIS DETENT THING GET IT CHECKED OUT BEFORE A BAD SITUATION REALLY HAPPENS.  *TR",
        "vin": "4USBT53423L"
    },
    {
        "components": "POWER TRAIN,WHEELS,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/19/2013",
        "dateOfIncident": "03/16/2005",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10520603,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BUT BOUGHT WITH LESS THAN 12,500 MILES, THEY FOUND TURNED UNSTABLE SITUATION, HAS BEEN UNABLE TO FIND WHAT THE REASON, AT TIMES ALMOST A MAJOR ACCIDENT WHEN DRIVING, THE TIRE DOES NOT FEEL STICKY, BUT ON THE HIGHWAY, THE CAR IS ALL OVER THE PLACE (LIKE A DRUNK DRIVER), THE STEERING FEELS VERY LOOSE, NOT TOO SENSITIVE. IF I DO ANYTHING MORE THAN A SLIGHT ROTATION, DYNAMIC STABILITY CONTROL SYSTEM HAS BEEN STARTED,  IF THE CURVE WENT TO THE RIGHT, I HAD TO \"JERK\" TO GO STRAIGHT TO RECTIFY THE SAME, IF IT WENT. WHEN A STRAIGHT ROAD, IT WILL FEEL VERY STICKY, MOVING WHEELS. THIS IS VERY SCARY, BECAUSE IT CAN NOT BE DIVERTED AT ANY TIME, I WILL LEAVE THE ROAD AND DOWN MILES OF CANYON CREEK.    THIS SITUATION WILL NOT OCCUR AT LOW SPEEDS.      UNFORTUNATELY, I HAVE A LOT OF PROBLEMS WITH MY 2003 BMW Z4 STEERING WHEEL. THIS IS COMPLETELY UNSTABLE.  FOR EXAMPLE:  1) TO MAINTAIN PULL TO THE LEFT OR RIGHT. IT REQUIRES CONSTANT ADJUSTMENT, SO THAT I CAN KEEP THE CAR ALIGNED OR CENTER.  2) I MET A SUDDEN TWITCH TO THE LEFT OR RIGHT WHEN THE ROAD CONTEMPT IMBALANCES. I CAN NEVER PREDICT THE ROAD THE CAR PULLED ME. I STRUGGLED FOR MANY CENTERS TO STOP AT ANY RED LIGHTS KEEP TURNING.  3) SOMETIMES, THE STEERING FEELS LIKE BEING STUCK.  4) I BELIEVE THAT IF ELDERLY PEOPLE TRYING TO DRIVE THIS CAR, SUCH A PROBLEM, THERE WILL BE A CATASTROPHIC COLLAPSE. THIS IS MAINLY BECAUSE THE DRIVER MUST BE A LOT OF ATTENTION TO KEEP THE CAR CENTERED FACT. OTHERWISE, ANY SECOND, YOU MIGHT FIND YOURSELF SOMEWHERE OFF THE ROAD, OR UNDER A TRUCK.  5) I'VE BEEN READING ON THE INTERNET, MANY Z4 OWNERS HAVE ENCOUNTERED SIMILAR PROBLEMS, I DO.  *TR",
        "vin": "4USBT53473L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "05/04/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358581,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "Z4",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW Z4. THE CONTACT STATED THAT THE STEERING WHEEL BECAME VERY HARD TO HANDLE WHILE ATTEMPTING TO MAKE A TURN CAUSING THE VEHICLE TO SHIFT INTO THE NEXT LANE. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO STATED THAT THE POWER STEERING ELECTRONIC SENSOR FAILED. THE MANUFACTURER ADVISED HER THAT THEY WERE NOT AWARE OF THE FAILURE. THE VEHICLE WILL BE TAKEN TO THE DEALER TO BE REPAIRED. THE FAILURE MILEAGE WAS 56,000 AND THE CURRENT MILEAGE WAS 56,419.",
        "vin": "4USBT534XX3"
    }
]