[
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/09/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11407235,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. THE CONTACT STATED WHILE DRIVING 35 MPH, THE HOOD INADVERTENTLY UNLATCHED CAUSING DAMAGE TO THE HOOD. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH NEEDING THE HOOD SHOCKS AND HOOD HINGES TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS INFORMED OF THE FAILURE. THE CONTACT WAS STILL AWAITING A RESPONSE FROM THE MANUFACTURER. THE FAILURE MILEAGE WAS APPROXIMATELY 117,000.",
        "vin": "5UXFA53592L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/01/2021",
        "dateOfIncident": "03/17/2021",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11406007,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. THE CONTACT STATED THAT HE DID NOT SECURE THE VEHICLE'S HOOD LATCH WHEN HE PUT THE HOOD DOWN. THE CONTACT THEN DROVE THE VEHICLE AT 35 MPH, WHEN THE HOOD FLUNG UP. NO WARNING LIGHTS ILLUMINATED. BMW OF NORTH LIBERTY (525 MADISON AVE, NORTH LIBERTY, IA 52317) WAS CONTACTED AND MADE AWARE OF THE ISSUE. THE DEALER INFORMED THAT THEY COULD NOT COME TO A CONCLUSIVE DECISION AS TO DETERMINE IF THE VEHICLE WAS EQUIPPED WITH THE HOOD WARNING SYSTEM. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE SHOCKS INSIDE THE HOOD HAD RIPPED LOOSE AND THE HOOD NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT INFORMED THAT THE REARVIEW MIRROR WOULD ALERT, IF THE HOOD WAS OPEN AND THE COMPLAINT WOULD BE FORWARDED TO THEIR SAFETY ENGINEER, HOWEVER SINCE THE VEHICLE WAS NOT TAKEN TO A CERTIFIED BMW MECHANIC FOR ROUTINE MAINTENANCE, NO FURTHER ASSISTANCE WAS PROVIDED. THE FAILURE MILEAGE WAS 117,000.",
        "vin": "5UXFA53592L"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/02/2021",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405711,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED. I TRIED TO UNLOCK MY CAR WITH THE KEY FOB AND NOTHING HAPPENED. I UNLOCKED THE DOOR WITH THE KEY AND AFTER GETTING IN THE CENTRAL LOCKING SYSTEM WOULD NOT WORK. AFTER RESEARCHING THE PROBLEM I FOUND THAT THE GMIII CONTROLS THE CENTRAL LOCKING AS WELL AS OTHER ITEMS LIKE THE WINDSHIELD WIPERS, INTERIOR LIGHTS, SUN ROOF, AND REAR UPPER AND LOWER HATCH. I ORDERS A NEW ONE AND WHEN I TOOK THE OLD ONE OUT TO REPLACE IT I FOUND THAT IT HAD CAUGHT ON FIRE AND BLEW FUSE 14. IT APPEARS A THYRISTOR OR TIAC GOT TO HOT AND SET THE BOARD AND CASE ON FIRE. I HAD SMELT A PLASTIC SMELL EARLIER WHILE DRIVING SO IT MAY HAVE BEEN BURNING BEFORE I PARKED.  I AM ATTACHING PHOTOS.",
        "vin": "5UXFB33592L"
    },
    {
        "components": "AIR BAGS,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "08/01/2020",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365964,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. THE CONTACT STATED THAT SEVERAL WARNING LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL AT VEHICLE START-UP. THE CONTACT ATTEMPTED TO REPAIR THE VEHICLE INDEPENDENTLY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 17V047000 (AIR BAGS). THE CONTACT SPOKE WITH MOSS MOTORS BMW (1401 SURREY ST, LAFAYETTE, LA 70501) WHERE THEY OFFERED NO ASSISTANCE. THE MANUFACTURER WAS ALSO NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 153,000.",
        "vin": "5UXFA53522L"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/05/2020",
        "dateOfIncident": "11/05/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11320264,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING HOME AND MY DASH LIGHTS STARTED TO FLASH ON AND OFF AFTER I SHUT THE CAR OFF MY  AND PULLED THE KEYS OUT MY LEFT REAR TAIL LIGHT STAYED ON  THE NEXT MORNING  MY BATTERY WAS DEAD. SO I PULLED THE BATTERY AND CHARGED IT NOW WHEN I CONNECT THE BATTERY ALL MY LIGHTS FLASH RANDOMLY WITH NO KEY IN IT. I HAVE NOT DRIVEN THE CAR FOR 3 MONTHS IT IS NOT SAFE AND THE NEAREST BMW SERVIES IS 40 MILES AWAY . I HAVE A RECALL FOR THE AIR BAG , BUT NOT TAKING A CHANCE ON DRIVING IT TO GET FIXED",
        "vin": "5UXFA535X2L"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "03/29/2020",
        "dateOfIncident": "03/29/2020",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319639,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASHBOARD WENT DARK, ONLY GAUGE THAT WORKED WAS THE TACHOMETER WHICH I COULDNT SEE BECAUSE I HAD NO DASHBOARD LIGHTS. STOPPED VEHICLE AND TOOK THE KEYS OUT COULDNT TURN MY LIGHTS OFF HAD NO TURN SIGNALS,THE 3RD BRAKE LIGHT WAS ON ALL NIGHT LONG KILLING THE BATTERY I TRIED EVERY FUSE. ALSO MY HEADLIGHTS WOULDNT TURN OFF THE LIGHTING CONTROLS WERE USELESS, AND JUST KEPT SMELLING AN ELECTRONIC BURNING SMELL. I MANAGED TO DISCONNECT ALL THE LIGHTS EXCEPT THE 3RD BRAKE LIGHT. COULDNT DISCONNECT THE BATTERY BECAUSE THE LIFT GATE TO GET INTO THE BACK WOULDN'T WORK AND THE CENTER CONSOLE HAZARDS STUCK ON AND DOOR LOCKS DIDN'T WORK  I HAD TO REMOVE THE GLOVE BOX AND ALL THE PANELING AND TRACK DOWN THE SMELL. TURNS OUT THE PROBLEM WITH THIS VEHICLE IS THAT THE RAIN MANAGES TO WORK ITSELF DOWN THE INSIDE OF THE A FRAME ON BOTH DRIVER AND PASSENGER SIDES OF THE VEHICLE ON DRIVER SIDE IT DESTROYS THE OBD MODULE BUT ON THE PASSENGER SIDE IT TRICKLES DIRECTLY INTO THE LCM LIGHTING CONTROL MODULE WHICH COMPLETELY TAKES YOUR EYES OFF THE ROAD WHEN YOU CANT SEE THE DASHBOARD YOUR HEADLIGHTS START STROBING ON AND OFF AND THEN HALF GET STUCK ON AND HALF JUST DONT WORK BUT WHEN YOU SPEND THE HOURS GETTING TO THE LCM TO FIND OUT IT HAS MELTED RIGHT INTO THE SIDE OF YOUR VEHICLE AND YOU CAN TELL IT WAS ON FIRE !!  AND THIS HAS HAPPENED TO NUMEROUS PEOPLE ON THE BMW FORUMS  IM JUST HAPPY MY 3 YEAR OLD SON WASN'T WITH ME. AND THE REAL KICKER IS THAT I HAVE NO VEHICLE NOW AND IT COST 600$ FOR A NEW LCM THAT HAS TO BE PROGRAMMED TO YOUR VEHICLE WHICH WILL COST ANOTHER 300$ WHEN I COULD HAVE HURT SOMEONE ELSE OR MYSELF WHEN YOU CANT SEE BUT YOU CAN SMELL SOMETHINGS BURNING ITS A HAZARD TO EVERYONE ON AND OFF THE ROAD .",
        "vin": "5UXFA53542L"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/04/2019",
        "dateOfIncident": "03/29/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11266415,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. AFTER THE VEHICLE WAS REPAIRED PER NHTSA CAMPAIGN NUMBER: 17V047000 (AIR BAGS), THE HORN ACTIVATED ON ITS OWN. THE VEHICLE WAS TAKEN FIVE TIMES TO BMW OF MURRAY (LOCATED AT 4735 STATE ST, MURRAY, UT 84107, (801) 262-2479) FOR REPAIRS, BUT THE FAILURE RECURRED. AFTER THE LAST REPAIR, THE STEERING WHEEL WAS NOT ALIGNED AND THE CRUISE CONTROL DID NOT FUNCTION. ALSO, THE VOLUME CONTROL BUTTON AND HORN FAILED TO FUNCTION. THE CONTACT STATED THAT THE AIR BAG WARNING INDICATOR ILLUMINATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 150,368.",
        "vin": "5UXFA53512L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/23/2019",
        "dateOfIncident": "09/13/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11257323,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A NOTICE FROM DMV OF VIRGINIA THAT THE AIR BAG IS RECALLED AND NEEDS TO BE REPLACED.  UPON CALLING THE BMW RECALL LINE, THEY SAID THE RECALL IS NEW AND IS DATED JANUARY 2019.  SET UP AN APPOINTMENT TO HAVE THE BAG REPLACED AT FLOW BMW IN WINSTON-SALEM, NC ON SEPTEMBER 13, 2019, THEY INFORMED THE BAG HAD ALREADY BEEN REPLACED AND THAT NO REPAIR WAS NECESSARY.  I CHECKED MY RECORDS ON THIS VEHICLE AND THE AIR BAG HAS NEVER BEEN REPLACED.  HOW DOES THIS MAKE SENSE WHEN THE RECALL IS DATED JANUARY 2019 AND MY VEHICLE HAS NOT BEEN SERVICED DURING 2019 BY A BMW DEALER.",
        "vin": "5UXFA53572L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2019",
        "dateOfIncident": "09/17/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11256713,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2002 BMW X5. THE CONTACT RECEIVED A RECALL NOTIFICATION FOR NHTSA CAMPAIGN NUMBER: 19V015000 (AIR BAGS). THE MANUFACTURER WAS CONTACTED TO SCHEDULE AN APPOINTMENT TO HAVE THE VEHICLE REPAIRED AND THEY REQUESTED A PHOTOGRAPH OF THE STEERING WHEEL. ONCE THE MANUFACTURER RECEIVED THE PHOTOGRAPH, THEY SENT AN E-MAIL TO THE CONTACT STATING THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE DEALER WAS NOT CONTACTED TO CONFIRM IF THE E-MAIL WAS RECEIVED. THE MANUFACTURER PROVIDED CASE NUMBER: LP48169. THE VEHICLE WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCED A FAILURE. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "5UXFA53532L"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/25/2019",
        "dateOfIncident": "02/15/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11182412,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA INFLATOR REPLACES ON DRIVERS AIRBAG REPLACED APPROXIMATELY 2 YEARS AGO. THEN THE PASSENGER AIRBAG LIGHT SHOWED DEFECTIVE SENSOR. BMW SAID THE WOULD EXTEND WARRANTY 15 YEARS BUT CAR IS NOW 17 YEARS OLD. HAD TO PAY FOR REPAIR OUT OF POCKET. ALSO HAD TO REPLACE GENERAL MODULE FOR REMOTE OPENING OF AND LOCKING DOORS.",
        "vin": "5UXFA53512L"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2019",
        "dateOfIncident": "01/15/2019",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181196,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5 SERIES",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 525I WHICH I DROVE TO WORK ON JANUARY 15, 2019.  AFTER BEING IN WORK FOR 15 MINUTES, I WAS NOTIFIED THAT THE ENTIRE FRONT END OF MY CAR WAS ENGULFED IN FLAMES.  THE TOP OF THE HOOD, UNDER THE HOOD, AND UNDER THE FRONT END OF MY CAR WAS COMPLETELY ON FIRE.  I HAVE READ ABOUT THE PVC RECALL FOR 2007-2011, BUT I ALSO READ \"BMW HAD LOOKED INTO HEAT DAMAGE INVOLVING THE HEATING AND COOLING SYSTEM AS EARLY AS 2007 BUT STEPPED UP ITS ANALYSIS WORK IN SEPTEMBER.\"  THAT WAS FROM A CHRONOLOGY REPORT PROVIDED BY BMW TO NHTSA, AND QUOTED FROM ABCNEWS.GO.COM. WHAT THIS TELLS ME IS BMW DIDN'T LOOK BACK ANY EARLIER THAN 2007.  IT WAS TERRIFYING, AND THANK GOD NO ONE WAS HURT.  WHAT IS BMW DOING ABOUT THIS?  AND WHAT IS MY NEXT COURSE OF ACTION?",
        "vin": "WBADT43462G"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "01/03/2019",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11169931,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUSPENSION/SUBFRAME OF THE VEHICLE IS ROTTED. ALSO, THE ELECTRICAL SYSTEM IS WACKY. MY SPEEDOMETER AND ABS LIGHT TURN ON AND OFF - INCLUDING MY ENGINE AND TRANSMISSION LIGHT FLASH ON AND OFF. THE VEHICLE HAS BEEN CHECK AND THERE IS ANYTHING WRONG WITH THE ENGINE OR TRANSMISSION.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/07/2018",
        "dateOfIncident": "05/20/2018",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11100317,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "'TAKATA RECALL '        WHEN STARTING MY VEHICLE IT IS A ROUGH START LOTS OF SHAKING CAUSING THE ENGINE TO FAIL AFTER HEATING DRIVES NORMALLY BUT DOES THIS EVERYDAY NO ENGINE CHECK LIGHT . CAR HAS SHUT OFF TWICE PRIOR WHILE DRIVING ON CITY STREETS DUE TO ENGINE FAILURE",
        "vin": "5UXFA53562L"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/29/2018",
        "dateOfIncident": "03/28/2018",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11082006,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE FIRE WAS PARKED FOR A COUPLE OF DAYS AND OWNER WENT TO CAR AND NOTICE THAT THE INTERIOR OF THE VEHICLE HAD A PAST TENSE FIRE.  THE AIRBAGS WERE DEPLOYED EXPECT FOR THE ONE ON THE PASSENGER  SIDE DOOR. NO EXTERIOR DAMAGE NOTED TO THE VEHICLE OR IN THE ENGINE COMPARTMENT.  THE FIRE ORIGIN WAS ON THE PASSENGER SIDE DASHBOARD BEHIND THE GLOVE COMPARTMENT AND AIRBAG, PLEASE CONTACT SIOUX CITY FIRE RESCUE FOR FURTHER INFORMATION.",
        "vin": "5UXFB33542L"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/06/2018",
        "dateOfIncident": "09/08/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11076447,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BELT LIGHT IS ALWAYS ON, DRIVERS SIDE MAY BE THE PROBLEM. LIGHT GOES ON AS SOON AS THE CAR IS STARTED. I BOUGHT IT USED AND LIGHT WAS ON. MILAGE WAS 91,050.  BMW X5  3.0L6 DOHC 24V",
        "vin": "5UXFA53512P"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/06/2017",
        "dateOfIncident": "11/06/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11043659,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A CODE IS BEING THROWN THAT TRANSLATES TO \"SEAT BELT TENSIONER, DRIVER'S SIDE\".   I SEE A RECALL IN YOUR DATABASE FOR THIS ISSUE AND 2002 BMW X5'S BUT WHEN I CALL THE DEALERSHIP (BMW OF THE MAINLINE) AND PROVIDE THEM MY VIN#, THEY SAID THE RECALL DOESN'T COVER MY PARTICULAR CAR.    UNSURE WHY THAT WOULD BE AS I HAVE THE SAME PROBLEM W/THE SAME YEAR AND MODEL CAR AS IN THIS RECALL.   OBVIOUSLY, MY CAR SUFFERS FROM THE SAME ISSUE AND SHOULD BE RECITIFIED BY BMW FREE OF CHARGE.   THANKS",
        "vin": "5UXFA53582L"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/10/2017",
        "dateOfIncident": "06/06/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959966,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL AND SEAT BELT BUCKLE, PURCHASED FROM HOMELAND SECURITY AUCTION, HAD A LOT OF DAMAGE TO FRONT SECTION AND INTERIOR WAS TORN APART BY HOME LAND SECURITY. I SAW PICTURES OF IT ON THE INTERNET BUT THEY ARE NO LONGER AVAILABLE",
        "vin": "5UXFA53512L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2017",
        "dateOfIncident": "02/14/2017",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10954802,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR CAN NOT BE INSPECTED BECAUSE OF AIR BAG LIGHT STAYS ON.",
        "vin": "5UXFA53512L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2016",
        "dateOfIncident": "01/11/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10894038,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN CUT.CAR DOESN'T START OR RUN.BUT WITH VERY CLEAN BODY IN & OUT.WANTS TO KNOW IF THIS SUV IS UNDER GOVT. RECALL.ODOMETER IS 130,000.",
        "vin": "5UXFB33552L"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/18/2016",
        "dateOfIncident": "01/10/2016",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820759,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE DAY I GOT IN MY CAR TO GO OUT, WHEN I CLOSED THE DOOR THE LATCH WOULDN'T CATCH. I KEPT TRYING AND MY DOOR WOULD NOT CLOSE. AFTER WAITING A FEW HOURS I TRIED AGAIN THIS TIME STANDING OUTSIDE. THE DOOR DID CLOSE, BUT I COULD  NOT GET IT BACK OPEN. THE NEXT DAY I WENT TO GET IN FROM THE OTHER SIDE AND I DID, BUT THIS DOOR ON THE PASSENGER SIDE WOULD NOT CLOSE. I FINALLY DID GET IT CLOSE, BUT IT WOULD NOT OPEN. I HAD TO GET IN FROM THE BACK SEAT AND CRAWL OVER TO THE FRONT SO THAT I COULD TAKE IT IN TO THE DEALER. WHAT I WAS TOLD WAS THAT THE LATCH WAS PROBABLY FROZEN. SO DOES THIS MEAN YOU CAN ONLY DRIVE A BMW IN WARM WEATHER? HE ALSO SAID IT COULD BE A BUILDUP OF DIRT. SO I GUESS BOTH MY DOORS GOT A BUILDUP OF DIRT AT THE SAME TIME. SO HE SAID WE WOULD PROBABLY JUST REPLACE THE LATCH. THERE ARE A LOT OF PEOPLE HAVING THIS PROBLEM. WHY WON'T BMW TAKE RESPONSIBILITY AND FIX THE PROBLEM BEFORE SOMEONE GET KILLED BECAUSE THEY CAN'T GET OF THEIR CAR.",
        "vin": "5UXFA53572L"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/14/2015",
        "dateOfIncident": "08/24/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763466,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. WHILE DRIVING AT LOW SPEEDS, THERE WAS AN ABNORMAL NOISE COMING FROM THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE BRAKE HOSE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "5UXFB33592L"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2015",
        "dateOfIncident": "06/19/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10735800,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. WHILE REVERSING THE VEHICLE INTO A PARKING SPACE, THE FRONT DRIVER AND PASSENGER SIDE AIR BAGS DEPLOYED. THERE WERE NO INJURIES. THE CONTACT MENTIONED THAT VARIOUS WARNING LIGHTS WERE ILLUMINATED AFTER THE FAILURE AND THE VEHICLE FAILED TO RESTART. THE VEHICLE WAS TOWED TO THE DEALER, WHERE IT WAS DIAGNOSED THAT THE BATTERY SAFETY TERMINAL FAILED DUE TO A THERMAL EVENT. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 155,003.",
        "vin": "5UXFA53582L"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/22/2015",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726659,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER OF 2014 MY 2002 BMW X5 FRONT PASSENGER SIDE POWER WINDOW FAILED IN THE DOWN POSITION.  UPON TAKING IT INTO MY ORIGINAL DEALER, IT WAS MANUALLY RAISED-CLOSED AND I HAD TO RETURN DAYS LATER FOR INSTALLATION OF A NEW \"REGULATOR\" AT A COST OF ABOUT $500.  I WAS TOLD THIS PROBLEM WAS \"UNUSUAL\".  NOW, NINE MONTHS LATER AND LESS THAN AN ADDITIONAL 5,000 MILES ON THIS VEHICLE (76,710) THE FRONT DRIVER SIDE WINDOW AND REAR PASSENGER SIDE WINDOW HAVE FAILED; THE FRONT MANUALLY TWEAKED INTO THE CLOSED POSITION AND THE REAR OPENING COVERED WITH CARDBOARD EXPOSED TO THE ELEMENTS AND THEFT WHILE THE SAME ORIGINAL DEALER AWAITS  PARTS DELIVERY FOUR DAYS FROM NOW BEFORE SCHEDULED REPAIR...AT I EXPECT  ANOTHER COST TO ME OF ABOUT $1000!...I HAVE REVIEWED THE MANY COMPLAINTS IN THIS SECTION ABOUT THIS SAME ISSUE!!  TO WIT, IT WAS WELL SAID BY THIS ONE QUOTED HERE: \"2002 BMW X5 WINDOW REGULATOR. CAR HAS 41K MILES AND ALREADY GOING ON 5TH WINDOW REGULATOR ISSUE. ALL FOUR WINDOW REGULATORS HAVE BEEN REPLACED AND THE ISSUE OCCURRED TWICE ON THE DRIVER'S SIDE WINDOW. I HAVE BEEN TOLD MULTIPLE EXPLANATIONS FROM THE DEALER INCLUDING LACK OR USE OR TOO MUCH USE BUT THIS ISSUE OCCURS ON ALL BMW MAKES AND MODELS. BMW STILL HAS NO SOLUTION THAT FIXES THIS ISSUE PERMANENTLY AND CHARGES $300 TO $600 FOR EACH WINDOW DEPENDING ON FRONT OR REAR. TOO MUCH TO PAY FOR A BAD DESIGN. *TR\"    I AGREE!!...IT IS TIME FOR A RECALL ON THIS ISSUE.  NOW.....UPDATED 08/17/15 *BF  UPDATED 08/20/15*JB",
        "vin": "5UXFB33562L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2015",
        "dateOfIncident": "02/22/2015",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10689794,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON CRUISE CONTROL 70 MPH AND WE HEARD A BIT BAMMMMMM AND SMOKED COMING OUT OF THE CRACK OF THE DOOR . IT TOOK  A MINUTE TO REALIZE THAT THE AIR BAGS HAS JUST WENT OFF FOR NOT APPARENT REASON. SCARE THE [XXX] OUT OFF ME!!!    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5UXFA53532L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2015",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680661,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPLACED THE OIL SEPARATOR  AT BMW DEALERSHIP 1/10/08 BECAUSE OIL WAS BECOMING POLLUTED WITH WATER EVEN AFTER I EXPLAINED TO DEALERSHIP PREVIOUS TIMES THE OIL LOOKED MILKY WHEN I DID A DIPSTICK CHECK. THE DEALER TOLD ME THE PART FAILED BEFORE IT CAUSED EXTENSIVE DAMAGE AND A CONDITION KNOWN AS HYDROLOCK, WHICH COULD CAUSE ENGINE TO SEIZE. LAST WEEK IN VERY COLD WEATHER CONDITIONS,1/13,2015 MY CARS CABIN FILLED WITH BLACK SMOKE. I PULLED OVER AND FOUND THE ENGINE SPOILED WITH SMOKING OIL, I TOOK IT TO AN INDEPENDENT REPAIR SHOP AND IT WAS THE OIL SEPARATOR AGAIN. THE PART IS ALSO KNOWN AS THE CRANKCASE VENT VALVE I HAD IT CHANGED/REPAIRED, IT IS EXPENSIVE AND CAN CAUSE SERIOUS VEHICLE DAMAGE AND ACCIDENTS.  I THINK FOR THIS TO HAPPEN TWICE POINTS TO A DANGEROUS VULNERABLE PART. THIS TIME MY CAR COULD HAVE EASILY CAUGHT ON FIRE, THANKFULLY I WAS CLOSE TO  THE REPAIR SHOP.INCIDENTLY THEY HAD THREE BMW'S ASIDE FROM MINE WITH THE SAME PROBLEM. ALSO THE TWO SEPARATE INCIDENTS WERE REPAIRED WITH COLD WEATHER/INSULATED KITS. I COULD NOT EVEN OPEN MY DRIVERS SIDE DOOR WINDOW TO GET AIR IT WAS INOPERABLE WHEN THE CABIN FILLED WITH SMOKE WHICH WAS ALMOST INSTANTANEOUS.  *TR",
        "vin": "5UXFA53552L"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "12/29/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668801,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE HAD TO REPLACE ALL 4 WINDOW REGULATORS, MY REAR HATCH SEEMS TO OPEN FOR NO REASON, MY REAR WINDOW WIPER IS WORKING WITH THE SWITCH IN THE OFF POSITION, LED'S ARE GOING OUT AGAIN AND NOW THE DREADED APPARENT OIL SEPARATOR WITH TONS OF GREY SMOKE BILLOWING OUT THE BACK OF THE CAR AFTER BEING LEFT IN AN AIRPORT PARKING LOT FOR 4 DAYS WHILST IT SNOWED OUTSIDE.  SEEMS I'VE HAD EVERY TYPICAL PROBLEM OTHER THAN THE CAR CATCHING FIRE FOR NO APPARENT REASON.  I HAVE OWNED BMWS IN GERMANY AND THE US FOR A LONG TIME, HOWEVER, I THINK I'LL BE SWITCHING BRANDS WITH MY NEXT VEHICLE.  BMW DOESN'T SEEM TO BE PROACTIVE ENOUGH FOR MY LIKING WITH SOME OF THESE WAY TOO COMMON ISSUES.  THIS IS A VERY LOW MILE VEHICLE FOR IT'S AGE AND IT'S ACTING LIKE A MODEL T.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": true,
        "dateComplaintFiled": "07/01/2014",
        "dateOfIncident": "06/12/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607249,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5 SERIES",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT 50 MPH I WAS BEING HARASSED BY ANOTHER MOTORIST BECAUSE I WAS DRIVING THE SPEED LIMIT. I DECIDED TO LET HIM PASS BUT FIRST I HAD TO SPEED UP TO 58 MPH INORDER TO COMPLETELY OVERTAKE A PASSENGER CAR TO MY RIGHT (PASSENGER SIDE) I GAVE THE THROTTLE SOME GAS AND THE CAR WENT NOWHERE. THE NEEDLE WENT ALL THE WAY INTO THE RED ZONE ON THE TACHOMETER. THE DRIVER BEHIND ME (ANOTHER BMW 3 SERIES),TAILGATED ME. IT SCARED ME SO BAD, THAT I DID NOT SEE A DEEP POT HOLE IN THE ROAD SURFACE. I HIT IT SO HARD, THAT I SPUN AROUND AND ALL OF MY WHEELS WERE DAMAGED. I HAD ALL FOUR WHEELS REPAIRED AND TIRES AT A COST OF $2000.THE DAY BEFORE, I NOTICED THE SERVICE ENGINE SOON LIGHT WAS ON. OF COURSE, I WANT THIS CHECKED OUT.SO I SCANNED THE CAR. IT WAS DISPLAYING 000030 BMW/ OR FOR/ P CODE P0741  \" TORQUE CONVERTER CLUTCH VALVE STUCK OFF .SO I WENT TO A BMW DEALER. EXPLAINED EVERYTHING. THEY SHOW ME THE CODES PULLED FROM THE CAR. THE CODE FOR THE TC CLUTCH VALVE NOT WORKING WAS SHOWN.(THEIR EQUIVALENT TO P0741) THEY TELL ME IT IS THE DISA VALVE.????  IS BMW TRYING TO COVER THIS UP?.DISA HAS ZERO TO DO WITH THE TORQUE CONVERTER. I SEE HOW MANY HAVE FAILED AND BMW DOES NOTHING? I COULD HAVE BEEN KILLED. THE CAR DID NOT RESPOND WITH MY REQUEST IN A MANNER THAT AFFECTED MY WELL BEING. IF THIS PROBLEM IS INVOLVED WITH MANY, MANY CLAIMS BECAUSE OF A PART THAT IS PROVEN TO BE DEFICIENT AS IT SOUNDS, I AM SURE IF INVESTIGATED YOU WILL FIND SOME INJURIES AND/OR DAMAGES AND DEATHS HAVE OCCURRED AND WHEN THE DEALER SEES A BAD ONE, THEY TRY TO BILL IT OUT AS SOMETHING ELSE. I CAN NOT BE THE ONLY ONE. AND WHY DID THE BMW DEALER TRY TO RIP ME OFF? I LIKE MY CAR BUT THE LETTERS BMW PUT A BAD TASTE IN MY MOUTH. RIGHT DOWN TO THE JERK WHO TRIED TO RUN ME OFF OF THE ROAD.  BMW= ?   ANYONE ELSE? ANYONE WHO WAS TOLD SOMETHING ELSE WAS BAD WHEN IT IS A BAD SEAL INSIDE THE TORQUE CONVERTER?  *TR",
        "vin": "WBADT63412C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/17/2014",
        "dateOfIncident": "04/02/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583360,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FLUID WARNING LIGHT CAME ON DUE TO LOW BRAKE FLUID. UPON INSPECTION, BRAKE LINE HAD CORRODED AND WAS LEAKING. GIVEN THE AGE OF THE VEHICLE THIS WOULD APPEAR TO BE QUITE PREMATURE. DESCRIPTION BY MECHANIC OF OEM REPLACEMENT LINE WAS SIGNIFICANTLY MORE DURABLE THAN LINE REPLACED.",
        "vin": "5UXFB335X2L"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/10/2014",
        "dateOfIncident": "04/05/2014",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578900,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER SEVERAL OCCASIONS, THE CAR ENGINE SHUT DOWN WHILE WE ARE DRIVING. WE CAN TURN IT ON JUST AFTER WHEN WE CAN GET THE CAR TO A SAFE SPOT. I TOOK THE CAR TO THE BMW AND THEY TELL ME NOTHING IS WRONG WITH THE CAR!! THIS IS A MAJOR SAFETY ISSUE AND MY WIFE HAD ALMOST HAD A BAD ACCIDENT FOR THIS.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/09/2014",
        "dateOfIncident": "11/05/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559164,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. THE CONTACT STATED THAT THE FRONT DRIVER AND PASSENGER'S SIDE LOCKS FAILED TO WORK WHEN THE TEMPERATURE DROPPED. THE CONTACT MENTIONED THAT THERE WAS AN OCCASION WHERE SHE WAS DRIVING IN THE HIGHWAY AND THE DOOR OPENED INDEPENDENTLY WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE LOCKS NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 78,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2013",
        "dateOfIncident": "02/06/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499408,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. THE CONTACT STATED THAT WHEN ATTEMPTING A TURN IN EITHER DIRECTION, THE STEERING WHEEL SEIZED AND REQUIRED TREMENDOUS FORCE TO STRAIGHTEN THE WHEELS. THE FAILURE RECURRED NUMEROUS TIMES. THE VEHICLE WAS NOT DIAGNOSED FOR THE FAILURE. THE FAILURE AND CURRENT MILEAGE WAS 180,000.",
        "vin": "5UXFA53532L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/09/2013",
        "dateOfIncident": "02/09/2013",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10497592,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MANY OCCASIONS BEFORE AS WELL AS TODAY I HAD A PROBLEM WITH THE FRONT DOOR LOCKS LATCHES MALFUNCTIONING, USUALLY, IN COLD WEATHER. EITHER THE DOORS CANNOT BE OPENED AT ALL OR. IF OPENED (USUALLY MANUALLY) THEY CANNOT BE CLOSED/LATCHED AT ALL, THIS USUALLY HAPPENS IN COLD WEATHER AND THE PROBLEM GOES AWAY WHEN THE TEMPERATURE OUTSIDE GOES UP. THIS IS A SERIOUS DESIGN FLAW THAT IS, POTENTIALLY, SAFETY RELATED AS DRIVING WITH DOOR NOT LATCHED IS UNSAFE. I'M WONDERING IF THIS COULD HAVE RESULTED IN INJURIES AND/OR DEATHS IN ACCIDENTS INVOLVING AFFECTED BMW X5.  *TR",
        "vin": "5UXFA53552L"
    },
    {
        "components": "STRUCTURE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/27/2012",
        "dateOfIncident": "11/26/2012",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486154,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AS MY WIFE AND I DRIVING TO HER MD APPOINTMENT ON 11/26/12. I'VE NOTICED GAS SMELL INSIDE THE CAR,AND CAR SUDDENLY LOSING POWER, WHEN I'VE STEP ON THE GAS PEDAL. IT'S LIKE GAINING POWER TO GO AND SUDDENLY LOSES POWER. I WAS KIND OF CONFUSED WHAT HAPPENED . WE WERE ON THE ROAD RIGHT BEHIND THE INTERSECTION. WE HAD TO STOP FOR THE RED LIGHT,WHEN I'VE TRIED TO GO, THE CAR WAS NOT MOVING LIKE IT SHOULD. WE MADE IT TO THE OTHER SIDE OF THE INTERSECTION, WHICH THERE IS DENNY'S RESTAURANT PARKING LOT. BY THE TIME I'VE PULLED OVER TO SEE WHAT IS GOING ON,WE WERE STILL IN THE CAR. ALL OF THE SUDDEN THERE WAS A LOUD SOUND, LIKE EXPLOSION UNDER THE HOOD OF THE CAR AND FIRE STARTED.THANKS GOD, WE GOT OUT OF THE CAR JUST IN TIME. THE FIRE WAS BURNING OUT OF CONTROL. COUPLE OF PASSERBY HAD FIRE EXTINGUISHERS IN THEIR CARS,TRIED TO PUT THE FIRE OUT, WHILE I WAS ON THE 911 CALL,BUT NO LUCK. IN JUST A LESS THAN A MINUTE THE WHOLE CAR WAS ENGULFED IN FLAMES. IT TOOK FIRE DEPT LIKE 20-30 MINUTES TO PUT THE FIRE OUT,AND MY CAR JUST MELTED FRONT OF MY EYES.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2012",
        "dateOfIncident": "11/14/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484917,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND I TRIED TO TURN LEFT AND IT WOULDN'T.  I TRIED TO TURN RIGHT AND IT UNLOCKED IT, SO I WAS ABLE TO TURN LEFT AFTERWARDS.  IT DID IT AGAIN, THIS TIME IT LOCKED UP BOTH LEFT AND RIGHT.  IT EVENTUALLY UNLOCKED AND I WAS ABLE TO BRING THE CAR HOME, TEST DROVE IT AND IT SEEMS FINE AGAIN.  IT COMES AND GOES.  I CALLED THE BMW DEALER IN VISTA, CA TO SEE IF THERE IS A SAFETY RECALL ON IT AND THEY SAID THAT MY VIN DO NOT HAVE A RECALL ON STEERING.  I CHECKED THE ONLINE POSTINGS AND APPARENTLY THERE ARE A LOT OF THIS CASES AND SOME OF THEM ARE DRILLING A PART OF STEERING COLUMN AND REMOVING A SPRING TO CORRECT THE PORBLEM.    I HAD THE SAME PROBLEM WITH MY OLD BMW 525 BEFORE SO I JUNKED IT.  *TR",
        "vin": "5UXFB33512L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/03/2012",
        "dateOfIncident": "07/23/2012",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469117,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN HEAVY TRAFFIC ALONG I 90 THE VEHICLE SUDDENLY TURNED OFF.   THE CAUSE WAS DETERMINED TO BE A FAULTY OIL SEPARATOR.  *TR",
        "vin": "5UXFA53512L"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/22/2012",
        "dateOfIncident": "10/14/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459293,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOW BUST OUT FOR NO REASON, COOLANT CONTAINER LIGHT ON, BRAKE LINING, WINDSHIELD WIPER MOTOR QUIT WITHOUT NOTICE..MOTOR HOT AND FROZE UP, LIGHTS ON DASH COMING ON AND OFF. SENSOR HAD TO BE REPLACED. THESE THINGS HAPPENED  WITHOUT NOTICE.  WHEELS THAT HAVE TO BE ALIGNED  AND STILL TIRES HAVE TO BE REPLACED OFTEN.  *TT",
        "vin": "5UXFA53502L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/06/2012",
        "dateOfIncident": "10/11/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450472,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. WHILE DRIVING APPROXIMATELY 75 MPH, THE REAR DRIVER'S SIDE WINDOW GLASS SUDDENLY OPENED AND DROPPED INTO THE DOOR PANEL. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE ALL FOUR WINDOW REGULATORS WERE REPLACED. THE FAILURE RECURRED AT VARIOUS SPORADIC TIMES AND THE WINDOW REGULATORS WERE REPLACED EACH TIME THE FAILURE RECURRED.  THE MANUFACTURER WAS NOTIFIED OF THE CONTINUAL PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 55,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/17/2012",
        "dateOfIncident": "02/11/2012",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448323,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE SUDDENLY STALLED AND SMOKE WAS EMITTING FROM UNDER THE HOOD. THE VEHICLE WAS TOWED TO THE DEALER FOR DIAGNOSTIC TESTING WHERE THE TECHNICIANS STATED THAT THE OIL SEPARATOR WAS FROZEN. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNAVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 105,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2012",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443874,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JANUARY OF 2010 DURING A COLD WEATHER SPELL, I STARTED MY CAR AND STARTED DRIVING SLOWLY. AFTER ABOUT 5 MINUTES I NOTICED  SMOKE COMING FROM ENGINE COMPARTMENT AND FROM EXHAUST PIPES. I STOPPED THE VEHICLE AND HAD IT TOWED TO A CERTIFIED MECHANIC.  HE DIAGNOSED THE ISSUE AS A FAILURE OF THE SEPARATION VALVE THAT CAUSED THE INCREASE PRESSURE UNDER THE VALVE COVER. FORTUNATELY, I WAS ABLE TO AVOID EXTENSIVE DAMAGE AND MY BILL WAS \"ONLY\" AROUND $350 (PLUS TOWING). I DID MY RESEARCH AND FOUND THAT BMW HAD KNOWN ABOUT THAT PROBLEM ALL ALONG AND DID NOTHING. THERE WAS A TSB ISSUED FOR CANADIAN MARKET BUT NO RECALL WAS ISSUED. LATER MODELS OF X5 WERE EQUIPPED WITH UPDATED VALVE, IT APPEARS THAT MANY OWNERS HAD THEIR ENGINES COMPLETELY DESTROYED AND THE COMPANY DID NOTHING TO HELP THEM. I'M ENJOYING DRIVING MY X5 BUT BELIEVE THAT THE COMPANY SHOULD HAVE RECTIFIED THE PROBLEM EARLIER AND SHOULD HAVE COMPENSATED THE OWNERS FOR OUT-OF-POCKET EXPENSES FOR THE PROBLEM THAT WAS WELL KNOWN ONE.",
        "vin": "5UXFA53552L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2011",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440015,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5. THE CONTACT WAS DRIVING 30 MPH WHEN THE PASSENGER SIDE AIR BAG DEPLOYED INADVERTENTLY. THE VEHICLE WAS NOT TAKEN TO THE DEALER AND THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 184,700.",
        "vin": "5UXFF0C54AL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/07/2011",
        "dateOfIncident": "08/12/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424043,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER VEHICLE IS PARKED FOR A FEW HOURS, WHEN YOU CRANK IT AND PUT THE TRANSMISSION IN REVERSE IT SLIPS AND DOES NOT WANT TO ENGAGE.  PROBLEM DOES NOT APPEAR WHEN VEHICLE IS IN DRIVE, ONLY REVERSE SO FAR.  AS THE VEHICLE WARMS UP THE PROBLEM GOES AWAY.  *TR",
        "vin": "5UXFB33582L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/07/2011",
        "dateOfIncident": "09/20/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424119,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LAMP FAILURE.  WARNING SYSTEM INDICATED LAMP FAILURE. THE  FAILURE TURNED OUT TO BE LAMP CIRCUIT ASSEMBLY, AND NOT BULB.  REPEATED FAILURES UNTIL I REPAIRED REAR LAMP ASSEMBLY ON MY OWN.  BMW WOULD ONLY SUGGEST REPLACING ENTIRE LAMP ASSEMBLY AT SUBSTANTIAL COST.  UPDATED 09/15/11  *TR",
        "vin": "5UXFB33512L"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/02/2011",
        "dateOfIncident": "08/26/2011",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423046,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 BMW X5.  THE CONTACT STATED THAT WHILE EXITING A RESIDENTIAL DRIVEWAY, THE STEERING WHEEL SEIZED.  THE CONTACT SHUT OFF AND RESTARTED THE VEHICLE BUT THE FAILURE WAS STILL PRESENT.  THE CONTACT HAD THE VEHICLE TOWED TO A DEALER WHERE THE DEALER PERFORMED A DIAGNOSTIC TEST THAT CONCLUDED THAT THERE WAS A JAM IN THE STEERING LOCK.  THE DEALER REPLACED THE POWER STEERING SYSTEM.   THE FAILURE MILEAGE WAS 132,000.",
        "vin": "5UXFA53572L"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/20/2011",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10405068,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO SAFETY CONCERNS:  (1) LED ON DASHBOARD FADED OUT. KEY DRIVING INFORMATION IS NOW NOT AVAILABLE IN ORDER TO SAFELY DRIVE THE CAR. (2) REAR TAILGATE WILL NOW UNEXPECTEDLY UN-LATCH AND POP OPEN IN WHICH I HAVE TO PULL OVER, GET OUT OF THE CAR AND CLOSE IT. IT IS CAUSED BY POOR SEALING WHICH DOESN'T KEEP OUT RAIN AND SNOW. ONCE I CLOSE THE TAILGATE, IT WILL EVENTUALLY OPEN AGAIN!  BMW KNOWS ABOUT THESE SAFETY PROBLEMS ON THE X5 AND WOULD NOT HELP WITH MATERIAL AND LABOR COST OF $ 1565.",
        "vin": "5UXFA53562L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2011",
        "dateOfIncident": "02/07/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376988,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT/AC KEPT BLOWING AFTER CAR WAS TURNED OFF CAUSING BATTERY TO DIE SO THE CAR WONT START IN THE MORNING. ORIGINAL PART WAS DEFECTIVE BMW KNEW ABOUT IT AND UPGRADED THE PART. WHICH I BOUGHT ON EBAY THEN THE PROBLEM WAS SOLVED. THE NAME OF THE PART THAT IS DEFECTIVE IS THE FINAL STAGE RESISTOR. BMW WILL NOT ISSUE A RECALL FOR THIS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "12/26/2010",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372464,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW X5 2002.  CAR SITTING IN DRIVEWAY OVERNIGHT ACTIVATED 5 OF 6 AIRBAGS.  WINDSHIELD BROKE AND DASHBOARD SHOW FIRE DAMAGE.",
        "vin": "5UXFA53582L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/02/2010",
        "dateOfIncident": "08/04/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353513,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BMW X5. THE CONTACT STATED THAT THE AIR BAG LIGHTS ILLUMINATED REPEATEDLY AND THE DEALER COULD NOT REPAIR IT. THE DEALER MADE SEVERAL ATTEMPTS TO REPAIR THE VEHICLE; HOWEVER, THEY WERE UNABLE TO DO SO. THE MANUFACTURER WAS CONTACTED AND THEY INFORMED HER TO TAKE THE VEHICLE BACK TO THE DEALER TO BE  REPAIRED. THE MANUFACTURER CONTACTED THE DEALER WHERE THEY REPAIRED THE VEHICLE UNDER WARRANTY FOR THE PARTS. SHE HAD TO PAY A $500 DEDUCTIBLE FOR THE LABOR. THE FAILURE MILEAGE WAS 63,000.",
        "vin": "5UXFA535X2L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/22/2010",
        "dateOfIncident": "08/21/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351183,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A 2002 BMW X5 WHILE MAKING A LEFT HAND TURN, THE VEHICLE STALLS.  IT HAPPENS NUMEROUS TIMES PER DAY.  MY RESEARCH INDICATES THIS PROBLEM EXISTS IN MANY BMW VEHICLES AND IT OBVIOUSLY PRESENTS A SERIOUS SAFETY ISSUE FOR DRIVERS OF THE 2002 BMW X5.  I HOPE A SAFETY RECALL IS ORDERED FOR THESE VEHICLES IMMEDIATELY.    IF YOU ARE TO GOOGLE THIS ISSUE WITH BMW VEHICLES (1999-PRESENT) THERE IS A LAUNDRY LIST OF COMPLAINTS.  RELATED TO THIS SUBMISSION, PLEASE SEE:    HTTP://WWW.BIMMERFEST.COM/FORUMS/ARCHIVE/INDEX.PHP/T-74517.HTML    [XXX]  INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/13/2010",
        "dateOfIncident": "08/10/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349296,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A HIGHWAY GOING ABOUT 65MPH, ALL THE SUDDEN I HAVE NO CONTROL OF MY STEERING, IT WAS VERY HARD TO STEER, I'VE ALMOST CRASHED IN TO THE OTHER VEHICLE WITH MY TWO INFANTS IN THE CAR. CONTACTED THE DEALER THEY SAYS NOTHING WRONG WITH THE POWER STEERING PROBLEMS, THEY RESET THE COMPUTER AND SAID IM GOOD TO GO...MY CAR IS 2002 BMW X5 3.0I. *TR",
        "vin": "5UXFA53512L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "06/17/2010",
        "fire": true,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341879,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING MY 2002 BMW X5 SUV FOR APPROXIMATELY 30 MINUTES (MOSTLY HIGHWAY) WHEN THE \"FAIL SAFE\" LIGHT CAME ON.  HE BEGAN TO PULL INTO THE BREAKDOWN LANE WHEN THE CAR STALLED AND \"SYSTEM FAILURE\" LIGHT CAME ON.  WHEN HE GOT OUT OF THE CAR, THERE WERE FLAMES SHOOTING OUT FROM BENEATH THE ENGINE ON THE PASSENGER SIDE.  HE AND HIS FIANCE QUICKLY RAN DOWN THE ROAD AND THE CAR WAS FULLY ENGULFED IN FLAMES WITH BLACK SMOKE FILLING THE SKY WITHIN MOMENTS.  THE CAR IS TOTALED WITH ALL WINDOWS MELTED AS WELL AS THE ENTIRE ENGINE COMPARTMENT.  BOTH FRONT TIRES EXPLODED.  I HAVE GONE ONLINE AND THERE ARE MANY X5'S THAT HAVE SPONTANEOUSLY CAUGHT ON FIRE FOR NO APPARENT REASON. *TR",
        "vin": "5UXFB93512L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/23/2010",
        "dateOfIncident": "06/22/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339618,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 BMW X5 WINDOW REGULATOR. CAR HAS 41K MILES AND ALREADY GOING ON 5TH WINDOW REGULATOR ISSUE. ALL FOUR WINDOW REGULATORS HAVE BEEN REPLACED AND THE ISSUE OCCURRED TWICE ON THE DRIVER'S SIDE WINDOW. I HAVE BEEN TOLD MULTIPLE EXPLANATIONS FROM THE DEALER INCLUDING LACK OR USE OR TOO MUCH USE BUT THIS ISSUE OCCURS ON ALL BMW MAKES AND MODELS. BMW STILL HAS NO SOLUTION THAT FIXES THIS ISSUE PERMANENTLY AND CHARGES $300 TO $600 FOR EACH WINDOW DEPENDING ON FRONT OR REAR. TOO MUCH TO PAY FOR A BAD DESIGN. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/07/2010",
        "dateOfIncident": "03/16/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324316,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BMW X5. WHILE DRIVING APPROXIMATELY 25 MPH APPROACHING A TRAFFIC SIGNAL, THE BRAKE WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE ENGINE STALLED WITHIN SEVEN TO TEN MINUTES AFTER THE BRAKE WARNING ILLUMINATED. THE FAILURE DIDN'T PREVENT THE CONTACT FROM OPENING THE DOOR REMOTELY. THE DEFECTIVE BATTERY WAS REPLACED WITH A NEW BATTERY. THE VEHICLE WAS DRIVEN FOR TWENTY MINUTES WITH THE NEW BATTERY WHICH FUNCTIONED NORMALLY. THE FOLLOWING MORNING THE BATTERY WAS INOPERABLE. THE ORIGINAL BATTERY WAS RECHARGED AND INSTALLED IN THE VEHICLE. THE VEHICLE WAS IN OPERATION FOR APPROXIMATELY 45 MINUTES AND THE ENGINE STALLED WITHOUT WARNING. THE DEALER WAS NOTIFIED FOR SERVICE REPAIRS. THE CURRENT MILEAGE WAS 87,525. THE FAILURE MILEAGE WAS 87,500.",
        "vin": "5UXFA535X2L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "01/31/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304372,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2002 BMW X5. THE CONTACT STATED THAT WHILE DRIVING AT 45 MPH WHEN SLOWING DOWN HE  NOTICED THAT THERE WAS SMOKE COMING FROM UNDERNEATH THE HOOD. HE THEN TURNED OFF THE ENGINE AND HE RAISED THE HOOD AND THERE WAS OIL ALL OVER THE ENGINE AND THE VALVE COVER GASKET WAS BLOWN. THE VEHICLE WAS TOWED TO THE  DEALER WHERE THEY DIAGNOSED IT. THEY STATED THAT IT WAS  THE OIL PUMP , CYCLONE SEPARATOR THAT HAD FAILED. THE VEHICLE WAS CURRENTLY BEING REPAIRED AT THE TIME OF THE COMPLAINT AT THE OWNERS EXPENSE. THE FAILURE AND CURRENT MILEAGE WAS 40000.",
        "vin": "5UXFA53502L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2010",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299880,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 BMW X5;4.6IS SAV. CHECK ENGINE LIGHT APPEARED. WENT TO AUTHORIZED DEALER, WHO SAID THAT THE CODE INSPIRED RA FAULT IN THE VANOS, SYSTEM, AND RESET OBDII COMPUTER. IN TWO DAYS, THE ENTIRE ENGINE BROKE DOWN. UPON INSPECTION, WE WERE TOLD THAT THE TIMING CHAIN AND CAM ADJUSTERS IMPLODED POSSIBLY DUE TO THE FORMATION OF ENGINE SLUDGE. ESTIMATED COST OF REPAIR IS $8000. THE X5 WAS PROPERLY MAINTAINED ACCORDING TO THE MAINTENANCE SCHEDULE WITH BMW APPROVED OIL. THE FORMATION OF SLUDGE MIGHT HAVE BEEN CAUSED BY A FAILURE OF THE CRANKCASE VENTILATION SYSTEM. REPAIR INCLUDES THE INSTALLATION OF NEW CAM SENSORS, ACTUATORS AND NEW CAMSHAFTS. ALSO THE REMOVAL OF METAL PARTICLES IN THE LUBRICATION SYSTEM. THIS EXPENSIVE REPAIR MAY HAVE BEEN AVOIDED IF BMW HAD RECALLED THE OIL SEPARATOR THEY DETERMINED WAS DEFECTIVE YEARS AGO. THERE IS NO MENTIONING OF A MAINTENANCE SCHEDULE FOR THE TIMING CHAIN, AND ASSOCIATED PARTS. WE HAVE ALREADY ENDURED THE EXPENSE OF TRANSMISSION REPLACEMENT.  CAN YOU INSPIRE A RE-IMBURSEMENT OF DAMAGES INCURRED?? *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/09/2009",
        "dateOfIncident": "08/21/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295030,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN THE 2002 BMW X2.  I HAVE RUN INTO THE PROBLEM OF THE REAR PASSENGER (RIGHT-SIDE) DOOR UNLOCK.  IT CANNOT BE UNLOCKED BOTH FROM THE OUTSIDE AND INSIDE OF THE DOOR.  I DID SOME RESEARCH ON THE WEB SITES.  THERE IS NOT A WAY TO OPEN THE DOOR.  DEALER HAS TO UNBOLT THE WHOLE DOOR IN ORDER TO GET IT OUT.  THE SAME PROBLEM CAN OCCUR TO ANY OF THE DOORS (OR ALL) AT THE SAME TIME.  MOST PEOPLE (INCLUDING MYSELF) ARE HAVING CONCERN ABOUT THE SAFETY OF THE PASSENGERS/DRIVERS IF THE DOOR CANNOT BE OPENED FROM THE INSIDE IN THE CASE OF EMERGENCY (SUCH AS THE LEXUS' ACCELERATION PROBLEM OR FIRE/SMOKE) ESPECIALLY THE KIDS CANNOT BREAK THE WINDOW'S GLASS.  CAN THE NHTSA ASK BMW BE RESPONSIBLE FOR MAKING CORRECTIVE ACTION ASAP?  OR BMW WILL WAIT TO TAKE ACTION AFTER ENOUGH PEOPLE DIE FROM THE BAD DESIGN.  I HAVE NOT FIXED MY DOOR (SINCE BMW WILL CHARGE THOUSANDS OF DOLLARS).  AND I HAVE A 3 1/2 YEARS OLD KID.  I THINK THAT BMW NEEDS TO RECALL THIS NEGLECTED PROBLEM. *TR",
        "vin": "5UXFA53582L"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/23/2009",
        "dateOfIncident": "10/19/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289636,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT INTO A AUTOMOBILE ACCIDENT ON MONDAY OCT 19, 2009.  I WAS DRIVING MY 2002 BMW X5.  SOMEONE DRIVING AROUND 50MPH HIT MY X5 REAR IMPACT TO DRIVERS SIDE.  THEN I BELIEVE IT DRAGGED ALONG THE DRIVERS SIDE.   THE AXLES BROKE, TIRE WENT TO THE HIGHWAY, THE CAR WAS BENT IN A WAY THAT THE ROOF WAS POINTING UPWARDS IN THE MIDDLE. THE IMPACT WAS SO GREAT THAT MY CAR (X5) IS CONSIDERED TOTALED.  THE ISSUE I HAVE IS THAT MY CAR SHOULD BE EQUIPPED WITH MANY AIRBAGS.  HOWEVER, NON OF THE AIRBAGS OPENED TO PROTECT ME. *TR",
        "vin": "5UXFB33542L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/19/2009",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281102,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BMW X5. THE COMPUTER IN THE VEHICLE HAS DISPLAYED VARIOUS CODES REGARDING THE ABS BRAKES AFTER BEING DIAGNOSED BY FIVE DEALERS. EACH OF THE DEALERS HAVE STATED THAT THE COMPUTER IS NO LONGER COMMUNICATING WITH THE ABS BRAKE SYSTEM WHICH IS WHY THE DRIVER IS UNABLE TO STOP THE VEHICLE BY ENGAGING THE BRAKE PEDAL FULLY. ONE OF THE DEALERS STATED THAT THE WIRING HARNESS HAD TO BE REPLACED AT HIS EXPENSE FOR $2200. THE FAILURE MILEAGE WAS 69380.",
        "vin": "5UXFA53562L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/18/2009",
        "dateOfIncident": "07/09/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269011,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SOLD A CERTIFIED PRE-OWNED VEHICLE WITH BAD CONTROL ARM BUSHINGS, AND MAKING  NOISE UNDER HOOD IN ENGINE COMPARTMENT.  I ALSO PURCHASED AN EXTENDED WARRANTY, THAT WAS NOT HONORED.  THE SERVICE ENGINE LIGHT CAME ON THROUGHOUT THE TIME OF OWNERSHIP.  I TOOK THE VEHICLE BACK TO DEALER FOR REPAIRS SEVERAL TIMES.  THE CAR VIBRATES WHEN BRAKING, AND SOMETIMES HAS NO POWER.  NOTHING WAS DONE TO CORRECT THE PROBLEM TO DATE. *TR",
        "vin": "5UXFA53522L"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/10/2009",
        "dateOfIncident": "04/07/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264958,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BMW X5.  ON APRIL 9, 2009, AFTER PARKING IN THE DRIVEWAY, THE CONTACT EXITED THE VEHICLE.  SHE WENT TO THE BACK OF THE VEHICLE TO GET HER CHILD OUT, BUT THE DOORS WERE LOCKED.  THE CONTACT ATTEMPTED TO UNLOCK THE DOORS MANUALLY AND WITH THE KEYLESS ENTRY, BUT WAS UNSUCCESSFUL.  SHE CALLED AAA TO UNLOCK THE DOORS.  THIS VEHICLE HAS ONLY ONE KEYLESS ENTRY LOCATED ON THE DRIVER'S SIDE.  THE CONTACT STATED THAT THIS WAS HER FIRST TIME EXPERIENCING THIS FAILURE WITH THE VEHICLE.  THE CURRENT AND FAILURE MILEAGES WERE 88,022.",
        "vin": "5UXFA53542L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2009",
        "dateOfIncident": "03/16/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262348,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FAILURE:  THE CAR WILL NOT AT TIMES REVERSE. WHEN IN REVERSE MODE THE CAR REMAINS AS IF IN NEUTRAL.    I'VE TAKEN THE CAR TO THE SHOP A FEW TIMES, AFTER AWHILE THE ISSUE MAGICALLY REPAIRS ITSELF. I'VE BEEN TOLD THE TRANSMISSION WILL NEED TO BE REPLACED OR WILL NEED TO BE REPAIRED. *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/04/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260657,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BMW X5.  THE CONTACT EXPERIENCED ISSUES WITH THE FRONT DOORS ON HER VEHICLE.  SHE WOULD BECOME LOCKED INSIDE THE VEHICLE BECAUSE THE DOORS WOULD NOT OPEN.  SHE ATTEMPTED TO UNLOCK THEM WITH THE POWER DOOR LOCK MECHANISM, WHICH WORKED PROPERLY, BUT THE DOOR HANDLES WOULD NOT ALLOW THE DOORS TO OPEN.  THE CONTACT HAD TO EXIT THROUGH THE BACK DOORS.  THE DEALER AND MANUFACTURER HAVE NOT BEEN NOTIFIED.  THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 93,140.",
        "vin": "5UXFA53572L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/05/2009",
        "dateOfIncident": "12/24/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253792,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 24, 2008, MY WIFE WAS ON HER WAY TO THE BMW OF DARIEN DEALERSHIP TO HAVE THE WINDSHIELD WIPERS REPLACED WHEN OUR BMW X5 STALLED IN THE MIDDLE OF AN INTERSECTION WITH HER PARENTS ALSO IN THE CAR.  SHE WAS NEARLY HIT BY ANOTHER VEHICLE, BUT MADE IT TO THE DEALERSHIP.  SHE SPOKE WITH SAUN, A SERVICE REP, AND TOLD HIM ABOUT THE STALLING INCIDENT.  SHE SCHEDULED A SERVICE APPOINTMENT FOR DECEMBER 30, 2008.  WE DROVE THE CAR OUT OF TOWN FOR THE HOLIDAYS AND THE SERVICE ENGINE LIGHT ILLUMINATED ON DECEMBER 26, 2008.  IT WENT OFF AND WE KEPT THE APPOINTMENT WITH BMW SERVICE DEPARTMENT IN DARIEN, CT ON DECEMBER 30.  THEY RAN A DIAGNOSTIC TEST AND SAID WE NEEDED TO UPDATE THE COMPUTER SOFTWARE AND REPLACE THE THERMOSTAT IN THE ENGINE.  WE PAID $657 FOR ALL SUGGESTED REPAIRS AND WERE ASSURED THIS WAS WHY THE ENGINE STALLED AND THE SERVICE LIGHT ILLUMINATED.  WE DROVE THE CAR LESS THAN 6 MILES BEFORE IT STALLED AND STOPPED ON THE HIGHWAY ENTRANCE RAMP AS THREE LANES MERGE ON JANUARY 1, 2009 WITH MY WIFE AND ME IN IT.  BMW OF DARIEN WAS CLOSED AND THE RECORDING DIRECTED US TO CALL BMW ROADSIDE ASSISTANCE.  AFTER 45 MINUTES OF UNSUCCESSFULLY WAITING FOR SOMEONE TO PICK UP THE PHONE, MY WIFE HUNG UP, BECAUSE I HAD ALREADY CONTACTED OUR INSURANCE COMPANY AND A TOW TRUCK.  WE SAT ON THE HIGHWAY FOR APPROXIMATELY TWO HOURS IN 18 DEGREE WEATHER UNTIL THE TOW TRUCK ARRIVED.  THE TOW TRUCK TOOK THE X5 TO THE BMW OF DARIEN DEALERSHIP.  ON JANUARY 2, 2009, A SERVICE REP, PAT, TOLD THAT THE CRANKCASE VENT VALVE WAS BROKEN DUE TO THE COLD WEATHER AND THAT THIS PROBLEM IS WIDESPREAD AND WE WERE QUOTED $1,000 TO REPAIR IT AND THE SPARK PLUGS.  AS WE RESEARCHED ONLINE, WE FOUND THAT THIS IS A COMMON PROBLEM ACROSS BMW MODELS.  ADDITIONALLY, BMW HAS REDESIGNED THIS PART AND ADDED INSULATION TO FIX THIS DESIGN FLAW.  THIS SEEMS TO BE A FAULTY DESIGN AND BMW REFUSES TO INFORM THE CONSUMER.  OUR CAR STOPPED TWICE AND PUT MY WIFE, HER PARENTS, AND ME IN HARM OF BODILY INJURY. *TR",
        "vin": "5UXFA53502L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/28/2008",
        "dateOfIncident": "08/13/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250085,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEMS ON A 2002 BMW X5 3.0 AUTOMATIC WITH 69000 MILES. THE VEHICLE SLIPS IN REVERSE, AT TIMES IT DOES NOT WORK AT ALL. I'VE CONDUCTED ALL SCHEDULED MAINTENANCE SINCE PURCHASED FROM ORIGINAL OWNER. I TOOK CAR TO A SHOP WHO SERVICES BMW'S AND THEY CHECKED THE TRANSMISSION FLUID, WHICH WAS OK. LATER AFTER DOING RESEARCH ON PROBLEMS WITH BMW TRANSMISSION I WAS AMAZED ON HOW MANY COMPLAINTS THERE ARE WITH THE BMW TRANSMISSION. IF I WOULD OF KNOWN OF THE PROBLEM I WOULD OF NOT BOUGHT THIS VEHICLE OR ANY BMW. I WAS TOLD FROM MECHANICS THAT WORK ON THIS VEHICLE IT WILL COST ME AROUND $5000.00 TO REPLACE THE TRANSMISSION AND SOONER OR LATER IT WILL FAIL BECAUSE THEIR TRANSMISSIONS ARE SEALED AND DO NOT REQUIRE FLUIDS OR MAJOR SERVICING. AFTER DOING ADDITIONAL RESEARCH ONLINE FOR ANY RECALL INFORMATION BMW HAS NOT SUBMITTED ONE WHATSOEVER. I AM PRETTY SURE BMW IS AWARE OF THE PROBLEM AND KNOWING A RECALL WILL COST THEM ALOT OF MONEY, THEY REFUSE TO ADMIT AN ONGOING PROBLEM WITH THEIR TRANSMISSIONS. I PURCHASED THIS VEHICLE AT A REASONABLE PRICE BUT WITH ME BEING THE ONLY INCOME IN MY HOUSEHOLD (MILITARY) I SIMPLY CANNOT AFFORD THE REPAIR. I DO NOT EXPECT ANY RESOLUTION FROM BMW, HOWEVER, I WANT TO FILE THIS COMPLAINT TO CREATE AWARENESS FOR FUTURE CONSUMERS OF BMW AUTOMOBILES. THIS WILL BE MY FIRST AND ONLY BMW. THANK YOU FOR YOUR ATTENTION. *TR",
        "vin": "5UXFA53502L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/28/2008",
        "dateOfIncident": "09/28/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246985,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BMW X5.  WHILE DRIVING 70 MPH, THE VEHICLE STALLED AND THEN SHUT OFF.  THE VEHICLE ALSO MISFIRED.  THE CONTACT MANAGED TO COAST THE VEHICLE OFF THE ROAD AND IT IMMEDIATELY RESTARTED.  THE DEALER COULD NOT FIND ANY FAILURES.  THE FAILURE AND CURRENT MILEAGES WERE 73,709.",
        "vin": "5UXFA53572L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/13/2008",
        "dateOfIncident": "01/03/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245267,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW 4.4I X5.  HAD SECOND OF TWO VALVE COVER LEAKS DUE TO OIL SEPARATOR BLOCKAGE.  BOTH HAPPENED UNDER COLD WEATHER CONDITIONS.  THE ORIGINAL OIL SEPARATOR DESIGN WAS PRONE TO BLOCKAGE AND BMW HAD REDESIGNED THE SEPARATOR TO A \"HEATED PART\" ACCORDING TO MY DEALER.  IN BOTH INSTANCES OF MY CAR'S FAILURE, THE VALVE COVER GASKET FAILED UNDER PRESSURE AND OIL LEAKED OUT ONTO THE EXHAUST MANIFOLD.  FORTUNATELY THERE WAS NO FIRE.    BMW DEALERSHIPS ACKNOWLEDGED THE COMMON FAILURE OF THE OIL SEPARATOR DESIGN.  ALTHOUGH BMW OF NORTH AMERICA WOULD NOT RESPOND TO MY INQUIRIES.  SINCE MY VEHICLE WAS NOT UNDER WARRANTY I PAID FOR ALL REPAIRS.  I HAVE UPDATED THE VEHICLE TO THE NEW \"HEATED PART\" BUT HAVE NOT HAD A FULL WINTER ON THE VEHICLE TO STATE WHETHER OR NOT THE RE-DESIGN WAS SUCCESSFUL. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/16/2008",
        "dateOfIncident": "09/16/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242469,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 BMW X5'S ENGINE SUDDENLY STALLED ON MY WIFE FEW HOURS AGO TODAY, 09/16/08, WHILE SHE WAS JUST PASSING THROUGH A STOP LIGHT AROUND WHERE SHE WORK AT. THE MILEAGE ON THE CAR IS ABOUT 47000 MILES. I'D TO THANK GOD SHE WAS NOT DRIVING ON A HIGHWAY WHEN IT STALLED. NOW THE CAR WITH MY MECHANIC FOR DIAGNOSIS.    ABOUT TWO MONTHS AGO, THE CAR'S FRONT FAN THAT COOLS THE ENGINE FAILED TO WORK ALL OF A SUDDEN WHILE I WAS DRIVING IT ON A HIGHWAY WITH THE AC ON. I HAD TO PULL OVER ON SIDE OF THE ROAD AS THE TEMP GAUGE WENT STRAIGHT INTO THE RED ZONE. I HAD TO GET IT REPLACED WITH A NEW ONE.    THEN, ABOUT A MONTH AGO, THE CAR'S FAN MOTOR THAT DISTRIBUTES THE AC/HEAT INTO THE CAR STOPPED WORKING. I'D TO HAD IT REPLACED ALSO WITH A NEW ONE.    THAT'S ALL & THANKS. *TR",
        "vin": "5UXFA53592L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/01/2008",
        "dateOfIncident": "08/26/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240515,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE BACKING UP THE CAR FROM THE RESTAURANT AND DRIVER SIDE AIR BAG AND CURTAIN AIR BAG POPPED OPEN BUT NOT DEPLOYED WITH AIR FOR NO REASON. TOOK THE CAR TO DEALER THEY SAID SENSOR UNDERNEATH THE CAR INITIATED, AND TO REPAIR COSTS WILL BE $4,000.00.  I DON'T HAVE MONEY TO FIX THE CAR AND THEY RELEASED THE CAR TO ME. THE BAGS ARE NOT DEPLOYED AND AFRAID OF DEPLOYING WHILE DRIVING. *TR",
        "vin": "5UXFA53592L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/30/2008",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236408,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5 SERIES",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RUBBER AROUND THE WINDSHIELD IS CRUMBLING.  OBVIOUS DEFECTIVE MATERIAL USED IN THE RUBBER COMPOUND.  BMW REFUSES TO ADDRES THE PROBLEM.  *TR",
        "vin": "WBADT43422G"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/30/2008",
        "dateOfIncident": "07/29/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236415,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5 SERIES",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD MY FRONT THRUST ROD BUSHINGS REPLACED AT BMW DEALER DUE TO VIBRATION IN STEERING AT ABOUT 40,000 MILES.  PROBLEM RETURNED AT 74000 MILES (2.5 YEARS LATER). DEFECTIVE MATERIAL RESULTS IN BUSHING CRACKS WHICH NEGATIVELY AFFECTS STEERING.   *TR",
        "vin": "WBADT43422G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/29/2008",
        "dateOfIncident": "07/29/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236300,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS BEEN WELL MAINTAINED WITH REGULAR SERVICE. 80,000 MILES. NO INDICATION OF ANY PROBLEM ON START UP. EXPERIENCED SUDDEN TOTAL LOSS OF TRANSMISSION FUNCTION. THE CAR ROLLS WHEN IN PARK. A GRINDING SOUND IS NOTED IN CABIN.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/12/2008",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227441,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED CAR TO WARM UP ON COLD WINTER MORNING.  WENT OUTSIDE FIVE MINUTES LATER AND THE CAR HAD STALLED.  COULD NOT START.  HAD TOWED TO MECHANIC AND TOTAL ENGINE FAILURE AT 100,000 MILES.  BMW DID NOT OFFER ANY ASSISTANCE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/25/2008",
        "dateOfIncident": "04/23/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225673,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 BMW X5 MISFIRES FROM FAULTY ENGINE COILS. SIMILAR RECALL TO THE 3 SERIES BUT DEALERSHIP SAID X5 NOT INCLUDED.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/19/2008",
        "dateOfIncident": "02/17/2008",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10218511,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/11/08 COLD DAY VEHICLE FAILED TO START SHOWING SAME SIGNS AS RECALLS ON 2004 AND 2007 MODELS THAT ARE RECALLS. VEHICLE SENT TO SHOP RETURNED 2 DAYS LATER WHILE TRAVELING ON MAJOR EXPRESSWAY VEHICLE STALLS OUT WITH OUT ANY ADVANCE WARNING AS IN 2004 AND 2007 MODELS SENT BACK TO SHOP VEHICLES OIL AND COOLANT MIXING CAUSING TOTAL ENGINE FAILURE. BMW'S RESPONSE NOT A RECALL FOR THIS YEAR BUT AWARE OF PROBLEM.  *TR",
        "vin": "5UXFB335X2L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/08/2008",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218296,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 BMW X5 WITH OIL SEPARATOR SAFETY ISSUES. CONSUMER STATES THAT THE OIL SEPARATOR FAILED. CONSUMER WAS SHOWN THAT WATER WAS MIXING WITH THE OIL CREATING A FOAMY SLUDGE. LUCKILY THE PROBLEM DID NOT AFFECT THE ENGINE.  *KB  THE CONSUMER ALSO STATED THE DOOR LOCKS DID NOT WORK ON ONE OF THE DOORS AND THE WINDOW FELL INSIDE THE DOOR. THE WINDOW MECHANISM NEEDED TO BE REPLACED. THE WINDSHIELD WIPER INSERTS WERE REPLACED. *JB",
        "vin": "5UXFA53552L"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2007",
        "dateOfIncident": "10/01/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210775,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 BMW X5 WITH LESS THAN 37,000 MILES.  IN THE LAST 6-8 MONTHS I HAVE HAD TO REPLACE THE CONTROL ARM. MORE RECENTLY, I HAD TO HAVE THE ENGINE HARNESS REWIRED AND THE THROTTLE BODY REPLACED. MY BRAKE LIGHT IS CONSTANTLY GOING OUT EVEN THOUGH I HAVE REPLACED BULBS AND SOCKETS NUMEROUS TIMES. I HAVE SPOKEN TO OTHER X5 DRIVERS WHO HAVE HAD SOME OF THE SAME PROBLEMS SO I'M BEGINNING TO WONDER IF IT'S A BIGGER PROBLEM THAN JUST MY VEHICLE.  *TR",
        "vin": "5UXFA53532L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/26/2007",
        "dateOfIncident": "07/15/2007",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204185,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BMW X5.  WHEN MAKING A TURN AT 10 MPH, THE ENGINE STALLED WITHOUT WARNING.  THE VEHICLE RESTARTED AFTER IT WAS SHIFTED INTO PARK.  THE DEALER REPROGRAMMED THE DME, HOWEVER, THE FAILURE RECURRED.  THE DEALER WAS UNABLE TO CORRECT THE FAILURE.  THE FAILURE MILEAGE WAS 63,000 AND CURRENT MILEAGE WAS 65,000.",
        "vin": "5UXFA53542L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/13/2005",
        "dateOfIncident": "09/10/2005",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145135,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2002 BMW X-5.  I AM EXTREMELY DISAPPOINTED AND FRUSTRATED BY THE FAILURE OF A BASIC  COMPONENT OF MY AUTO.   ON THREE SEPARATE OCCASIONS THERE HAVE BEEN ELECTRICAL  SHORTS IN BOTH FRONT TURN SIGNALS AND ONE OF THE BRAKE LIGHTS.   AT 58,315 MILES THE RIGHT TURN SIGNAL BULB AND SOCKET BURNED AT CONTACTS AND WAS REPLACED FOR $126.25.  AT 85,549 MILES THE LEFT TURN SIGNAL BULB AND SOCKET BURNED OUT AND WAS REPLACED FOR $133.89.  AT 88,685 MILES THE LEFT BRAKE LIGHT IS SHORTED OUT. THE DEALER DID NOT HAVE THE PART IN STOCK BUT THE REPAIR WAS QUOTED TO BE $239.00.  THE SECOND FAILURE ACTUALLY HAPPENED AS I WAS DRIVING IN A HEAVY RAIN STORM.  THE OTHER TWO FAILURES JUST SHOWED UP ON THE CAR'S DIAGNOSTIC SELF CHECK AT START UP.  IT SEEMS THE LIGHT FIXTURES AND WIRING ARE PRONE TO WATER EXPOSURE THAT RESULTS IN THE ELECTRICAL SHORT.  PERHAPS IT IS FAULTY DESIGN OR SUBSTANDARD MATERIALS.  *JB",
        "vin": "5UXFA53542L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/23/2005",
        "dateOfIncident": "02/28/2005",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114541,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "02 BMW X5 5 SPD  THE SHIFT LEVER WILL GO INTO REVERSE RATHER THAN FIRST BECAUSE THERE IS NO RESISTANCE TO PUSHING THE LEVER INTO REVERSE.  THE DEALER SAYS IT IS NORMAL. BMW NA SAYS \"DEALERS DON'T LIKE TO FIX CARS FOR INDEPENDENT.  *AK",
        "vin": "5UXFA53532L"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/14/2005",
        "dateOfIncident": "02/18/2005",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10114059,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE YEARS AFTER PURCHASING MY 2002 BMW X5, I HAVE REPORTED TO THE SERVICE DEPARTMENT OF WEATHERFORD BMW THAT THE TRANSMISSION WOULD NOT SHIFT GEARS PROPERLY AND THAT THE ENGINE WOULD ALL OF A SUDDEN START REVVING UP.  AS THIS IS HAPPENING, THE ENGINE WOULD SURGE AND BUCK AT THE SAME TIME.  EVEN THOUGH, I AND MY WIFE HAVE BEEN AWARE OF THESE ISSUES, THE SERVICE DEPARTMENT WAS NOT BEEN ABLE TO DUPLICATE THE SCENARIO OR EXPERIENCED THESE PROBLEMS WHILE SERVICING MY VEHICLE.  WHILE DRIVING THE X5, NOT ONLY ME, BUT ALSO MY WIFE, SHE WOULD INFORM ME THAT THE ENGINE WOULD BUCK AND SURGE WHILE SHE WAS DRIVING THE VEHICLE.  I BELIEVE THAT BECAUSE OF THESE ISSUES WITH THE TRANSMISSION AND THE ENGINE, THAT MY VEHICLE, A 2002 BMW X5 IS AN ACCIDENT WAITING TO HAPPEN.  WITH THIS ALL SAID AND DONE, I WAS INVOLVED IN A HORRIBLE ACCIDENT WHERE THE VEHICLE IS NOW TOTALED, BUT I WAS ABLE TO WALK AWAY WITH ACHES AND PAIN (PHYSICALLY AND MENTALLY).    I DO BELIEVE THAT BECAUSE OF THE PROBLEMS I HAD WITH THE TRANSMISSION AND ENGINE, IT WAS A DIRECT CAUSE OF THE ACCIDENT AND THAT BMW SHOULD REIMBURSE ME FOR THE 2005 BMW X5 THAT I JUST PURCHASED TO REPLACE MY PREVIOUS X5.    ALSO, IN QUIZZING THE SALES MANAGER AT THE DEALERSHIP WHERE I PURCHASED MY NEW X5, I ASKED IF THERE WERE ANY MAJOR CHANGES TO THE VEHICLE.  HIS REPLY WAS THAT DUE TO TRANSMISSION PROBLEMS WITH THE X5 - BMW CHANGED THE TRANSMISSION.  THEREFORE, SINCE BMW WAS AWARE OF THESE ISSUES, AGAIN, I BELIEVE THAT BMW SHOULD REIMBURSE ME THE TOTAL PURCHASE PRICE OF MY 2005 X5.    IF YOU HAVE ANY QUESTIONS, PLEASE CONTACT ME AT [XXX].*AK      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5UXFA53522L"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "07/28/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091343,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONBOARD COMPUTER READOUT IS MISSING LIGHTS.  MORE AND MORE LIGHTS ARE STARTING TO FAIL.  THE SERVICE GUY HAS A SIMPLE SOLUTION, BUY A NEW BOARD.... NICE A RELATIVELY NEW CAR NEEDS AN EXPENSIVE PART THAT JUST FAILED ON IT'S OWN.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/16/2004",
        "dateOfIncident": "01/23/2004",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086968,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING HER X5 ON A VERY COLD DAY IN JANUARY. SHE HEARD A LOUD BANG AS IF SHE HAD HIT SOMETHING. SHE STOPPED THE CAR BUT SAW NOTHING SO SHE DROVE ANOTHER 1/4 MILE HOME. AS SOON AS SHE STOPPED THE CAR FUMES STARTED BILLOWING FROM THE ENGINE. ON OPENING THE HOOD WE FOUND A SHATTERED VALVE COVER. SHE TOOK THE VEHICLE TO THE DEALER WHO WAS VERY GOOD ABOUT EXPLAINING WHAT HAD HAPPENED AND FIXING THE PROBLEM. APPARENTLY, BMW DECIDED NOT TO INSULATE PART OF THE OIL SEPARATOR VALVE FOR SOME OF THE X5 ENGINES. IN COLD WEATHER THE VALVE CAN STICK OPEN OR CLOSED CAUSING EITHER ENGINE FAILURE OR, AS IN MY WIFE'S CASE, A HIGH CRANKCASE PRESSURE WHICH EXPLODES THE VALVE COVER. THE VEHICLE WAS ABOUT 17 MONTHS OLD AND HAD ABOUT 5 THOUSAND MILES ON IT WHEN THIS HAPPENED, SO THE REPAIR WITH REPLACEMENT OF THE INADEQUATE PART WAS DONE UNDER WARRANTY. BMW KNEW THAT THIS PROBLEM COULD OCCUR, THEY HAD ALREADY SENT A BULLETIN TO EVERY DEALER LETTING THEM KNOW ABOUT IT BUT HAVE DECIDED AGAINST ISSUING A RECALL.*AK",
        "vin": "5UXFA53542L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2004",
        "dateOfIncident": "05/13/2004",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072902,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHIN 6 WEEKS OF DRIVING IN HOT WEATHER, THE VEHICLE (2002 BMW X5 3.0 LITER) STALLED WHEN TURNING LEFT.  MOST RECENT WAS IN TRAFFIC, NEARLY CAUSING AN ACCIDENT AS I WAS BLOCKING ONCOMING TRAFFIC.  VEHICLE ROLLED TO A NEARBY RESTAURANT WHERE ON BOARD INSTRUMENTATION WAS LIT UP WITH ALL WARNING LIGHTS.  RESTARTED ENGINE IN A FEW MINUTES OF COOLING.  REPORTED TO BMW DEALER ON 5/18/2004 - DEALER REPORTS NO TROUBLE CODES OR ANY ABILITY TO REPLICATE TROUBLE.  *AK",
        "vin": "5UXFA53582L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059307,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DURING INCLEMENT WEATHER THE WINDSHIELD WIPERS STOPPED OPERATING AND RESULTED IN POOR VISIBILITY TO THE DRIVER.  THE CAUSE OF THE PROBLEM HAS NOT BEEN DETERMINED.   *NM   *NM",
        "vin": "5UXFB33522L"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/09/2004",
        "dateOfIncident": "08/05/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061774,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STALLING PROBLEM DUE TO LOSS OF BRAKE PERFORMANCE, AND SUDDEN ACCELERATION WHICH DAMAGED OTHER PARTS.  (NAR)  *PH   *CB",
        "vin": "5UXFA53542L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/03/2004",
        "dateOfIncident": "02/08/2004",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057710,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING  IN COLD WEATHER VEHICLE LEAKED OIL INTO THE ENGINE. *AK  IN COLD WEATHER THE OIL SEPARATOR CRACKED AND CAUSED OIL TO LEAK.   THE CONSUMER HEARD THAT THE NEW PART IS THE SAME AS THE OLD PART EXCEPT THE NEW PART HAS A FOAM INSULATOR.  THE MANUFACTURER IS ONLY REPAIRING VEHICLE'S THAT ARE STILL UNDER WARRANTY.  *NM",
        "vin": "SUXFA53S22L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/06/2004",
        "dateOfIncident": "10/21/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057685,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY WHILE MAKING RIGHT TURNS  DASHBOARD LIGHTS CAME ON,  VEHICLE STALLED.  AFTER A FEW SECONDS, VEHICLE RESTARTED AS IF NOTHING EVER HAPPENED.  THIS  OCCURRED FOUR TIMES IN THE LAST THREE MONTHS.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069835,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "BMW",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BMW M3CI IS AGAIN IN THE SHOP. IN THE LAST 23K MILES, THE CAR HAS SEEN THE SHOP MORE THAN ANYONE'S IMAGINATION. NOW THE ENGINE REVS HIGH AT IDLE, TRANSMISSION LIGHT (SMG 2 OF M3) CAME ON, WHICH NO ONE SEEMS TO KNOW WHY, AND MYSTERIOUSLY DISAPPEARED. THE CAR NOW VIBRATE TRHOUGH OUT THE CABIN AND AT STEERING WHEEL IT VIBRATES ABNORMALLY. THE DEALER TRIES TO DOWN PLAY IT. IT'S BEEN IN TH SHOP FOR THE LAST 14 DAYS, AND STILL NO ENDING INSIGHT",
        "vin": "WBSBR93492E"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070344,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL COMPUTER RELATED MALFUNCTION OCCURRED.  THE ABS FAILURE WARNING, DSC WARNING, CHECK ENGINE WARNING, ENGINE FAIL SAFE MODE WARNING LIGHT COME ON FREQUENTLY. REMOTE KEY DOES NOT WORK.  SEAT MEMORY DOES NOT WORK.  I WENT TO SERVICE CENTER TO FIX THESE PROBLEM EVERY MONTH  SINCE I BOUGHT THIS CAR.  WHEN I WAS ON HIGHWAY DRIVING AT 60 MPH, THE DRIVER?S SIDE DOOR OPENED BY ITSELF IN FEB, 2003.",
        "vin": "5UXFA53542L"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "02/15/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070625,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHAT WOMEN SHOULD KNOW WHAT ALL BMW X5 OWNERS SHOULD FEAR, AND WHY BMW SHOULD RECALL THEIR SUV.  I AM A 36-YEAR-OLD WOMAN.  I DRIVE A 2002 BMW X5.  THEY CHOSE TO HIDE FROM CONSUMERS, THEIR PATHETIC CHOICE OF A SAFE LOCKING MECHANISM, AND A FAILURE OF AN ALARM SYSTEM.   THE ONLY THING KEEPING A THIEF FROM GETTING INTO YOUR SUV, IS A LOCK THAT WEIGHS LESS THAN TWO QUARTERS.  A THIEF NEEDS 5 SECONDS, A SCREWDRIVER, AND YOUR SUV IS THEIRS.  NOT ONLY DOES THE SPLIT SECOND REMOVAL OF THIS LOCK ALLOW THEM INTO YOUR X5, BUT IT IMMEDIATELY SHUTS OFF THE SO-CALLED ALARM SYSTEM, UNLOCKS ALL YOUR DOORS, AND OPENS ALL YOUR WINDOWS, INCLUDING THE SUNROOF.  ALL WITH JUST A FLICK OF THE WRIST.    TO MAKE THE SITUATION WORSE; BMW IS AWARE OF THIS PROBLEM, CHOOSING TO DO NOTHING ABOUT IT.  IN A LITTLE OVER A YEARS TIME, THEY HAVE BROKEN INTO MY X5 TWICE.   THE FIRST ATTEMPT NEARLY COST ME MY LIFE.  ONLY 2 DAYS AFTER RECEIVING MY VEHICLE, IT WAS BROKEN INTO.  FORTUNATELY, I WAS MY OWN WITNESS.  MY SUV, PARKED ONLY 20 FEET FROM THE STORE I WAS IN AT THE TIME, WAS BROKEN INTO IN LESS THAN 10 SECONDS. THEY POPPED THE LOCK OUT OF THE DRIVER SIDE DOOR, WHICH IN TURN DISABLED THE ALARM, THUS, NEVER GOING OFF, WAS IN MY DRIVER SIDE SEAT ATTEMPTING TO START MY VEHICLE.  SEEING THE WHOLE THING, REALIZING WHAT WAS TAKING PLACE, I IMMEDIATELY RAN TO PROTECT WHAT WAS MINE.  IT WAS 3PM, ON A HEAVILY POPULATED STREET.  GOING ON INSTINCT, I RAN INTO THE MIDDLE OF A 2 WAY STREET.  CARS SCREECHING TO A HALT; I SCREAMED FOR THE THIEF TO GET OUT OF MY VEHICLE.  SCARRING HIM AS A RESULT OF MY INSANITY, HE SLIPPED OUT OF MY X5, INTO A WAITING CAR, WHICH ATTEMPTED TO RUN ME OVER AS THEY SPED AWAY.  THE LUXURY STATUS OF THE X5, THE FACT THAT I AM A WOMEN, THE DOOR LOCK BEING A WELL-KNOWN DEFECT APPARENT TO THIEVES; ALL COMBINE TO MAKE ME FEEL AS IF A BIGGER TARGET HAS BEEN PUT ON MY BACK. THIS IS CERTAINLY NOT THE FEELING SOMEONE WHO PURCHASES A BMW X5 SHOULD EXPECT TO FEEL!",
        "vin": "5UXFB33502L"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "09/21/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040263,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SEAT BELT BUCKLE FAILED AND CAUSED THE CHILD SAFETY SEAT TO FLIP OVER.*AK           *TS    *NLM",
        "vin": "5UXFB33522L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/04/2003",
        "dateOfIncident": "07/10/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10027020,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING IN INCLEMENT WEATHER THE WINDSHIELD WIPERS STOPPED WORKING . *AK   THIS OCCURRED AS THE CONSUMER WAS DRIVING ON THE HIGHWAY IN THE RAIN AND SLEET.   *SCC   *JB",
        "vin": "WBAFA53501L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029831,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "BMW",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW, R1150R, 2002; THE CONSUMER STATED UPON COLD START, THE  MOTORCYCLE LEAKED 2 OUNCES OF FUEL ONTO THE EXHAUST. THE DEALER SAID THE PROBLEM WAS THE O RINGS ON QUICK DISCONNECT FUEL LINES.  *AK  *CB   *JB",
        "vin": "WB10439B12Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/29/2003",
        "dateOfIncident": "05/29/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021880,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY APPLIED BRAKES AND PEDAL WENT ALL THE WAY DOWN TO FLOOR.  PLEASE FILL IN ADDITIONAL INFORMATION.  *AK",
        "vin": "5UXFA53542L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/29/2003",
        "dateOfIncident": "05/29/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021881,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY AND WITHOUT PRIOR WARNING  VEHICLE WAS LEAKING OIL FROM UNDERNEATH THE VEHICLE. DEALER IS AWARE OF THE PROBLEM.PLEAS EFILL IN ADDITIONAL INFORMATION.  *AK",
        "vin": "5UXFA53542L"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "03/11/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017318,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW SHATTERED, WITHOUT CAUSE WHILE DRIVING.   *JB",
        "vin": "5UXFA53583L"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/07/2003",
        "dateOfIncident": "02/23/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014046,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE DRIVER SIDE DOOR OPENED BY ITSELF.  *JB",
        "vin": "5UXFA53542L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/19/2003",
        "dateOfIncident": "03/11/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010736,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5 SERIES",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS HESITATED WHILE BEING DRIVEN AT OR ABOVE 50 MPH.  CAR HAS STALLED COMPLETELY WHILE ACCELERATING OUT OF A PARKING LOT AND WHILE BEING DRIVEN AT 40 MPH.   *NLM",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "10/02/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10010084,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD A VERY DANGEROUS BLIND SPOT, AS A RESULT A 2 YEAR OLD CHILD WAS KILLED.  CONSUMER FELT THERE SHOULD HAVE BEEN SOME TYPE OF SENSOR OR CAMERA IN THE REAR OF THE VEHICLE.*JB",
        "vin": "NOT AVAILBL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009981,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5 SERIES",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE FAILED TO SHIFT, WHICH CAUSED THE VEHICLE TO STALL.*JB",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/27/2003",
        "dateOfIncident": "12/27/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004694,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL SYSTEM CONTINUOUSLY FAILS,CAUSING THE INTERIOR LIGHTS, SIDE REAR MIRROR,  TRUNK LATCH, AND AUTOMATIC LOCKS ETC TO MALFUNCTION. DEALERSHIP CANNOT FIX OR FIND THE CAUSE.*AK",
        "vin": "5UXFA53552L"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "01/08/2003",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003620,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE AIRBAG LIGHT ILLUMINATED, WHICH COULD CAUSE THE AIR BAGS TO BE INOPERATIVE IN THE EVENT OF AN ACCIDENT.*JB",
        "vin": "5UXFA53582L"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/31/2002",
        "dateOfIncident": "12/02/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000649,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "5 SERIES",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "XENON HEADLIGHTS ARE TOO BRIGHT, BLIND ONCOMING TRAFFIC.  THESE HEADLIGHTS SHOULD BE BANNED!  WHAT EVER HAPPENED TO HEADLIGHT STANDARDS.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/12/2002",
        "dateOfIncident": "11/12/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000033,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE 3,000 MILES PER MONTH AND I'M TIRED OF BEING BLINDED BY BMW'S HID LIGHTS. NO MATTER IF THEY ARE COMING TOWARDS ME OR BEHIND THEY ARE TOO BRIGHT! OTHER MANUFACTURERS DO NOT SEEM TO HAVE THIS PROBLEM. I HAVE NOTICED THAT THE X5 SUV IS THE ABSOLUTE WORST VEHICLE MADE TO DRIVE IN FRONT OF AT NIGHT. I HAVE HAD TO PULL OVER TO AVOID BEING BLINDED.THIS PROBLEM HAS OCCURED IN THE THREE DIFFERENT VEHCILES THAT I DRIVE, SO HEIGHT OF MY VEHICLE IS NOT A CONTRIBUTING FACOR. I FEEL THAT THESE LIGHTS ARE DANGEROUS AND SHOULD BE REDESIGNED",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019991,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT HAD ORDER VEHICLE WITH BACK AND SIDE AIR BAGS AND THE AIR BAGS CAME DISCONNECTED.  NLM",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567581,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING, CONSUMER TAPPED THE BUMPER OF ANOTHER VEHICLE.  THERE WAS NO DAMAGE TO THE OTHER VEHICLE.  CONSUMER TOOK VEHICLE TO A BMW MECHANIC FOR AN APPRAISAL.  THE MECHANIC INFORMED CONSUMER THAT THE BUMPER HAD BEEN KNOCKED OFF IT'S MOORING.  CONSUMER REQUESTS INFORMATION ON THE SAFTEY STANDARD OF THIS VEHICLE.  *JG",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/28/2002",
        "dateOfIncident": "01/21/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8017472,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER ELECTRONIC SIDE VIEW MIRROR RANDOMLY SITS INTO A DOWN POSITION.   *SLC",
        "vin": "5UXFA535X2L"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/14/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016351,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "BMW",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BMW, R1150R, 2002;GAS LEAK COMING FROM VEHICLE.  CONSUMER CAN SMELL GAS, AND GAS IS ALL OVER THE GARAGE FLOOR.  CONSUMER IS CONCERNED FOR HIS SAGETY.  PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/08/2002",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765372,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "BMW",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS FUEL LEAK FROM QUICKCONNECT DEVICES AND FUEL HOSE CLAMPS.  THE CRIMP TYPE CLAMP LOOSENS OVER TIME; LEAKED FUEL COULD SPILL ON CATALYTIC CONVERTER.",
        "vin": "WB10439B82Z"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "08/02/2002",
        "dateOfIncident": "03/01/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015388,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO FLOOR MAT HAVING MOVEMENT MAT SLID AGAINST  GAS PEDAL.  OWNER WAS IN REVERSE AND ACCELERATED BACKWARDS INTO A CONCRETE GARAGE.  GAS PEDAL ISHAS BEEN ATTACHED AT THE FLOOR.  PLEASE DESCRIBE DETAILS.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/26/2002",
        "dateOfIncident": "01/02/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8014864,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER SIDE MIRRORS AUTOMATICALLY GO DOWN AND FACE GROUND WHILE VEHICLE IS IN MOTION.  DEALER DOES NOT HAVE A SOLUTION FOR THIS PROBLEM. *AK  *YH",
        "vin": "5UXFA53502L"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/17/2002",
        "dateOfIncident": "06/15/2002",
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763149,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "BMW",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN TRAFFIC  ON THE HIGHWAY, THE ENGINE DIED WITHOUT ANY WARNING.  DEALER SERVICED THE VEHICLE ON 04/15/2002 BECAUSE OF DIFFICULTIES IN STARTING THE ENGINE.  FAILURE OF THE ENGINE WHILE IN TRAFFIC OF 60+ MPH PLACED MYSELF AND A PASSENGER IN GREAT PERIL BECAUSE I WAS UNABLE TO PUT THE CAR  ON THE SHOULDER WHEN THE ENGINE DIED WITH THE CAR IN A TRAFFIC LANE.  I WANT TO KNOW IF BMW HAS EXPERIENCED SIMILAR PROBLEMS WITH OTHER NEW MODELS AND WHAT IS GOING TO BE DONE TO PREVENT ANOTHER OCCURRENCE.  THE CAR IS ONLY A FEW MONTHS OLD.*AK",
        "vin": "WBAGL63482D"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/15/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761919,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "BMW",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL XENON HEADLIGHTS SHOULD BE BANNED.  THEY BLIND ONCOMING DRIVERS !!*AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/15/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761919,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "BMW",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL XENON HEADLIGHTS SHOULD BE BANNED.  THEY BLIND ONCOMING DRIVERS !!*AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/22/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "BMW of North America, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8002576,
        "products": [
            {
                "manufacturer": "BMW of North America, LLC",
                "productMake": "BMW",
                "productModel": "X5",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS EXTREMELY BRIGHT DAYTIME RUNNING LIGHTS WHICH  ARE VERY DISTRACTING FOR OTHER DRIVERS.*AK  *JG",
        "vin": ""
    }
]