[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/17/2007",
        "dateOfIncident": "10/02/2007",
        "fire": false,
        "manufacturer": "SAFARI MOTOR COACHES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206133,
        "products": [
            {
                "manufacturer": "SAFARI MOTOR COACHES, INC.",
                "productMake": "BEAVER",
                "productModel": "CONTESSA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 BEAVER CONTESSA.  WHILE DRIVING 55 MPH, THE TRANSMISSION COOLER RUPTURED IN THE RADIATOR.  THE CONTACT STATED THAT THERE WAS CROSS CONTAMINATION WITH THE TRANSMISSION AND THE ENGINE.  HE WAS ABLE TO DRIVE TO THE RV REPAIR FACILITY AND THEY REMOVED AND REBUILT THE TRANSMISSION.  THE NUMBER OF CYLINDERS WERE UNKNOWN.  THE CURRENT MILEAGE WAS 26,332 AND FAILURE MILEAGE WAS 24,085.   UPDATED 03-05-08 *BF  THE CONSUMER STATED THE RV SHOULD HAVE BEEN INCLUDED IN MONACO TSB-124. UPDATED 03/05/08  *TR",
        "vin": "1RFC3465923"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2006",
        "dateOfIncident": "10/20/2006",
        "fire": false,
        "manufacturer": "SAFARI MOTOR COACHES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176384,
        "products": [
            {
                "manufacturer": "SAFARI MOTOR COACHES, INC.",
                "productMake": "BEAVER",
                "productModel": "CONTESSA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*-  THE CONTACT STATED THAT OCTOBER 20, 2006, THE COOLANT WAS LEAKING FROM THE VEHICLE. THE CONTACT NOTICE FLUID AT REAR OF THE MOTOR HOME WAS LEAKING ON GROUND.  THE CONTACT STATED THEY CONTACTED MOORE TOWING COMPANY.  MOORE TOWING  INSPECTED THE PROBLEM AND WAS TOLD THAT THEY WERE HAVING A COOLANT LEAK.  MOORE TOWING STATED THAT TRANSMISSION OIL AND COOLANT WAS MIXING TOGETHER AND WAS TOLD NOT TO DRIVE MOTOR HOME. THE CONTACT STATED THAT WHILE THE VEHICLE WAS BEING REPAIRED, A MR. COURTNEY EVANS, SERVICE ADVISOR FOR HILL TRUCK, ORDER A TRANSMISSION COOLER FOR THE MOTOR HOME.  THE CONTACT STATED THAT HE CALLED TECHNICAL DEPARTMENT FOR THE MANUFACTURE, AND THEY KNEW OF NO COOLANT PROBLEMS.  THE CONTACT    WAS TOLD BY MR. EVANS THAT HE WAS INFORMED THAT THERE MAY HAVE BEEN A BULLETIN FOR MONACO VEHICLES. THE CONTACT STATED THAT THEY DID THEIR OWN RESEARCH AND FOUND THAT THEY WERE 21 MONACO MOTOR HOMES LISTED ON THE BULLETIN (#124), BUT NOT FOR THE BEAVER CONTESSA.  CONTACT RECEIVED A LETTER FROM MANUFACTURER ON 12/11/06 STATING THAT THERE WOULD BE NO REIMBURSEMENT FOR HIS REPAIRS.    UPDATED 2/15/2007 - *NM",
        "vin": "1RFC5465723"
    }
]