[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/15/2020",
        "dateOfIncident": "09/15/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354677,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 CHEVROLET CAMARO. CONSUMER WRITES IN REGARDS TO A DESIGN DEFECT. *LD    THE CONSUMER STATED THERE WAS A RECURRING PROBLEM WITH THE SAIL ROOF PANEL BUBBLING THROUGH THE BLACK PAINT OF THE VEHICLE. THE CONSUMER WAS ADVISED, BY THE DEALER, THAT THE ADHESIVE WAS CAUSING THE FAILURE. THE SAIL ROOF IS NO LONGER BEING MANUFACTURED. THE ONLY WAY TO REPAIR THE PART WOULD BE TO FIND A REPLACEMENT AT A JUNK YARD. THE CONSUMER STATED THAT WAS UNACCEPTABLE. *JS",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/19/2016",
        "dateOfIncident": "09/19/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10907564,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 CHEVROLET CAMARO. THE CONTACT STATED THAT THE DRIVER SIDE POWER WINDOW BECAME INOPERABLE. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE WINDOW REGULATOR FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED NUMEROUS TIMES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS UNKNOWN. ..UPDATED 12/20/16 *BF  *TR",
        "vin": "2G1FP32G922"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/20/2016",
        "dateOfIncident": "07/05/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10886079,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 CHEVROLET CAMARO. WHILE DRIVING APPROXIMATELY 35 MPH, THE STEERING BECAME DIFFICULT TO TURN WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE AND VIN WERE UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2014",
        "dateOfIncident": "07/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10627747,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TYPICALLY IN THE AFTERNOON ON WARM / HOT DAYS AND AFTER THE CAR HAS SAT ALL DAY OUTSIDE, I'LL GO TO START IT, PUT THE KEY INTO START POSITION AND THE STARTER WILL NOT ENGAGE.  ALL ELSE SEEMS TO BE FUNCTIONING CORRECTLY.  THE FUEL AND TEMP GAUGES GO BACK TO 0 POSITION, VOLTAGE DROPS BUT NOT BY MUCH.  I HAVE HAD TO SWITCH TO THE START POSITION AS MUCH AS 75 TIMES BEFORE THE STARTER ENGAGES.  WHEN IT DOES ENGAGE IT IS TURNS OVER STRONGLY.  THIS ISN'T A BATTERY PROBLEM.  I CAN'T FIND A PATTERN TO TIE TO WHEN THIS HAPPENS EXCEPT IT IS MOSTLY IN THE AFTERNOON ON WARM / HOT DAYS AND AFTER THE CAR HAS SAT ALL DAY OUTSIDE.  *TR",
        "vin": "2G1FP32G822"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2014",
        "dateOfIncident": "07/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615109,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 CHEVROLET CAMARO. THE CONTACT STATED THAT WHILE DRIVING AT 60 MPH, THE ENGINE STALLED. THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS TOWED TO THE DEALERS WHO WAS NOT ABLE TO DUPLICATE THE PROBLEM. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 85,000.  UPDATED 09/22/2014*LJ   UPDATED 2/23/2015  *JS    THE CONSUMER STATED THE FUEL PUMP WAS REPLACED. THE VEHICLE SHUT OFF TWICE ON THE FREEWAY.   UPDATED 2/23/2015 *JS",
        "vin": "2G1FP22K222"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/31/2012",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473196,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2002 CHEVROLET CAMARO. THE CONTACT STATED THAT THE PASSENGER SIDE TURNING SIGNAL FAILED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSE THAT THE RIGHT SIGNAL COMPARTMENT AREA RETAINED WATER AND CAUSED THE BULB TO FAIL. THE BULB COMPARTMENT WAS CUT FOR THE WATER TO LEAK AND THE BULB WAS REPLACED, HOWEVER THE FAILURE WAS NOT CORRECTED. THE RIGHT DIRECTIONAL BULB CONTINUED TO FAIL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 67,463 AND THE CURRENT MILEAGE WAS 73,000.",
        "vin": "2G1FP22K822"
    },
    {
        "components": "STEERING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/02/2012",
        "dateOfIncident": "06/25/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463918,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME FROM WORK AT 40 MPH AND SUDDENLY ALL THE RED WARNING LIGHTS APPEAR AS I LOSE POWER-STEERING, ALTERNATOR NOT CHARGING, AND MY ENGINE TEMPERATURE RISES TO 300 DEGREES F.  I PULLED OVER TO SIDE OF THE ROAD IMMEDIATELY TO CHECK UNDER THE HOOD.  THE PRESSED-ON POWER STEERING PULLEY HAD COME COMPLETELY OFF THE POWER STEERING PUMP AND CONSEQUENTLY CAUSING THE SERPENTINE BELT TO FLY OFF.  I RARELY DRIVE THIS CARE AND IT HAS ONLY 15,000 MILES.  SO MUCH GENERAL MOTORS QUALITY.    *JS",
        "vin": "2G1FP22G722"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2011",
        "dateOfIncident": "04/02/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394010,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 CHEVY CAMARO THAT IS EXPERIENCING A SECURITY LIGHT ISSUE AND HAVE BEEN READING UP ON IT ONLINE....THIS IS SUCH A HAZARD AND A DANGER TO OTHER DRIVERS I CANT BELEIVE IT ISNT UNDER INVESTIGATION, GIVEN THAT THE NUMBERS OF COMPLAINTS ARE OUTRAGEOUS! THE OTHER THING IS THE MONOPLY THAT GM HAS ON THIS PROBLEM, THEY ARE THE ONLY ONES WHO CAN FIX IT, NOT YOUR FAVORITE HOME TOWN MECHANIC, BUT GM ONLY. THE TESTING EQUIPMENT USED TO DIAGNOSE THIS IS ONLY SOLD TO THEM! AND LET ME TELL U SOMETHING, THEY CHARGE OUT THE YINGER FOR THIS, COST OF CYLINDER 30.00 THEY CHARGE YOU 600.00...BCM MODULE...COST 130 AND THEY CHARGE YOU 800. THIS IS A ENDANGERMENT IN THE FACT THAT YOUR CAR..UMMM SAY GOING THE SPEED LIMIT ON THE HIGHWAY OF SAY 65...AND ALL OF A SUDDEN MY CAR DECIDES SOMONE IS STEALING IT....AND CUTS OFF THE GAS SUPPLY....WELL U CAN BET THERE IS GOING TO BE A PILE UP OF CRASHED CARS AND DEAD PEOPLE. THIS IS RIDICILIOUS AND THIS IS AMERICA AND THEY SHOULDNT HAVE A MONOPLY ON  THIS...ALOT OF PEOPLE CANT AFFORD THIS DEFECT IN GM CARS SO THEY HAVE TO RISK MINE AND THEIR LIVES.....YOU NEED TO TAKE ACTION ON THIS AND HAVE GM RECALL THIS OR JUST GIVE CUSTOMERS THE OPTION OF THEM INSTALLING SOME KIND OF BYPASS OF THEY SYSTEM. ITS NOT ONLY OLDER CARS BUT NEW CARS TOO!!!  *TR",
        "vin": "2G1FP22K122"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/05/2010",
        "dateOfIncident": "09/04/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 02'CHEVY IMPALA WHEN I TURN IT ON ALL ELECTRIC COMES ON AND THE ENGINE RUNS FOR A SPLIT SECOND AND DIES THEN THE BATTERY LIGHT AND SERVICE TRACTION SYSTEM COMES ON I GOT THE FUEL PUMP AND SENSOR REPLACED STILL THE SAME PROBLEM OCCURS. I WAS ABLE TO DRIVE IT FOR A FEW MILES AFTER READING THE MANUAL AND PUSHING THE GAS TO THE FLOOR WHILE HOLDING THE KEYS ON FOR THREE SECONDS BUT EVENTUALLY IT DIED AGAIN.  PLEASE HELP!!!!!  *TR",
        "vin": "2G1WH55K629"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2010",
        "dateOfIncident": "05/19/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331354,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A GENERAL POINT OF INFORMATION MESSAGE: FOR THE LAST DECADE OR MORE, GM VEHICLES HAVE A PROPENSITY TO BURN OUT THEIR LAMPS DUE TO AN OVERCHARGE CONDITION (CAUSE UNKNOWN TO ME); THIS CONDITION CAN AFFECT ANY OF THE LAMPS OR BULBS, MOST NOTICABLY HEADLAMPS, TAIL LIGHTS, AND RUNNING (PARKING) LAMPS. COULD YOU PLEASE INVESTIGATE THIS ELECTRICAL DEFECT IN ALL GM VEHICLES.*TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2010",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319828,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 CHEVROLET CAMARO SS. CONSUMER STATES ENGINE FAILURE DUE TO WIRING HARNESS PLACEMENT.  *TGW  ACCORDING TO THE DEALERSHIP, THE NUMBER 7 CYLINDER MAY HAVE PASSED COMPRESSED LIQUID, MOST LIKELY FUEL THAT CAUSED THE PISTON AND ROD TO BE DAMAGED. IT CAUSED DAMAGE TO THE CYLINDER WALL WHICH REQUIRED REPLACEMENT OF THE ENGINE. THE TECHNICIAN ALSO INDICATED THAT THE NUMBER 8 CYLINDER WAS DAMAGED. THE DEALER STATED THE CAUSE FOR THE FUEL INJECTORS REMAINING IN THE OPEN POSITION WAS THE WIRING CONTROLLING THE FUEL INJECTORS WAS CHAFED AND MAKING CONTACT WITH THE BULKHEAD WHICH GROUNDED THE WIRING.  THE CONSUMER STATED ONE DAY HE STARTED THE VEHICLE AND WHITE SMOKE EMITTED FROM THE EXHAUST, HE SHUT THE VEHICLE OFF AND LET IT SIT IN THE DRIVEWAY. THE CONSUMER STATED THE DISTANCE OF THE WIRING FROM THE BULKHEAD IS LESS THAN 1/4 OF AN INCH, THE PCM CAN BE MADE TO  MOVE JUST UNDER 1/2 INCH WHICH WOULD BE ENOUGH DISTANCE FOR THE WIRES TO MAKE CONTACT WITH THE BULKHEAD. IT WOULD INDICATE THAT OVER TIME, VIBRATION FROM DRIVING CONDITIONS WOULD CAUSE THE PCM TO MOVE BACK AND FORTH WHICH STRONGLY SUGGEST A FLAW IN THE POSITIONING OF THE PCM. THERE WAS EVIDENCE TO SUGGEST THAT AN OUTSIDE SOURCE CAUSED THE WIRING TO CHAFE, SUCH AS RODENTS NESTING IN THE ENGINE COMPARTMENT. *JB",
        "vin": "2G1FP22G322"
    },
    {
        "components": "EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "03/10/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315805,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "MY COMPLAINT IS WITH A GM PRODUCT..A 2002 CHEVROLET CAMARO. NOT LONG AFTER PURCHASE (APPRX) LESS THAN A FEW MONTHS OF TAKING POSSESSION OF MY \"NEW\" VEHICLE THE DRIVERS SIDE WINDOW REGULATOR(POWER ASSISTED ) WAS HAVING PROBLEMS...THE REGULATOR WOULD STICK IN ANY POSITION UP/DOWN AND WOULD NOT OPERATE CORRECTLY . THE VEHICLE WAS UNDER WARRANTY  AND WAS REPAIRED..THE REGULATOR ON THE PASSENGER SIDE THEN WENT OUT THE SAME WAY NOT LONG AFTER...AGAIN IT WAS REPAIRED.THIS PROBLEM HAS RE-OCCURRED SEVERAL TIMES SINCE 2002 TO THE PRESENT DATE  AS OF  03/02/2010.I HAVE SPOKEN TO MANY CAMARO OWNERS AND THE RESPONSE IS EXACTLY THE SAME...WE ALL KNOW THAT OUR VEHICLE (CAMAROS) DO \"THAT\" . FIRST OF ALL THE CARS ARE NOW OUT OF WARRANTY AND THE FINANCIAL RESPONSIBILITY FALLS ON US ! THESE REPAIRS CAN EXCEED $500.00 DOLLARS. THERE IS NO DOUBT GM KNOWS OF THIS. I HAVE SPOKEN TO MANY OTHER CAMARO OWNERS AND ALL SAY THAT AN AFTERMARKET WINDOW REGULATOR SOLVED THEIR PROBLEM,ITS OBVIOUSLY DEFECTIVE WINDOW REGULATORS PERMIATED THERE STOCK AND GM REPLACED THEM WITH THE SAME DEFECTIVE PARTS. THESE PROBLEMS OCCURRED WITHOUT INCIDENT IE; ACCIDENTS,MISUSE ETC. FAILURE OF THESE COMPONENTS ARE VERY DANGEROUS, IF A DRIVER BECOMES TRAPPED INSIDE HIS/HER VEHICLE AND CANNOT EXIT THROUGH THE DOOR NORMALLY  AND HAS TO DEPEND ON THE WINDOW AS AN EXIT THEY WILL BECOME TRAPPED INSIDE THAT VEHICLE AND COULD BE SERIOUSLY INJURED OR KILLED. NOT BEING ABLE TO ROLL THE WINDOWS UP OR DOWN WHEN NEEDED CAN BE VERY DANGEROUS (IE. FLOODS,FIRE,,SUBMERGED VEHICLE OR ASSAILANT.) *TR",
        "vin": "2G1FP22G322"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "06/11/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315817,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 GM CHEVROLET CAMARO'S ABS BRAKE SYSTEM HAS FAILED.THERE WERE NO INCIDENTS THAT LED UP TO THE FAILURE OF THE COMPONENT. AS TO DATE 03/02/2010 MY ABS BRAKING SYSTEM IS INOPERABLE,I HAVE NO ABS. ONLY A WARNING LIGHT TELLING ME I HAVE NO ABS. THE FAILURE OCCURRED APPROX. 11/2 YEARS AGO,AND SINCE IT WAS NOT UNDER WARRANTY GM WILL NOT FIX THIS PROBLEM.AGAIN I BELIEVE THAT GM KNOWS OF THIS FAILURE IN THEIR SYSTEMS(ABS..ANTI-LOCK BRAKING SYSTEM)THE COST TO REPAIR OR REPLACE THIS ABS COMPONENTS IS APPRX.$2,500.00. MY INQUIRES WITH OTHER GM OWNERS  OF OTHER MODELS IE;CORVETTE STATE THE SAME PROBLEMS AS THE CAMAROS. FAILURE OF THIS COMPONENTS IS VERY CRITICAL FOR SAFETY IN PREVENTING WHEELS FROM LOCKING UP AND CAUSING A SKID LEADING TO A VERY DANGEROUS ACCIDENT.(THE MAIN REASON CONSUMERS WANT ANTI-LOCK BRAKES!) *TR",
        "vin": "2G1FP22G322"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2009",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254101,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 CHEVROLET CAMARO.  THE CONTACT STATED THAT THE CONTROL BOX IN THE ENGINE, LOCATED NEAR THE FIREWALL, CAUSED THE FUEL INJECTORS TO POUR FUEL INTO THE ENGINE.  AS A RESULT, THE ENGINE WAS RUINED.  WHEN THE VEHICLE WAS STARTED, WHITE SMOKE APPEARED FROM THE EXHAUST.  THE VEHICLE WAS TOWED TO THE DEALER, BUT THEY WENT OUT OF BUSINESS.  THE VEHICLE WAS TOWED TO ANOTHER DEALER AND THEY REPLACED THE ENTIRE ENGINE.  THE MANUFACTURER OFFERED HIM A 10% DISCOUNT AND THE CONTACT PAID $6,200 FOR THE REPAIR.  THE CONTACT HAS A PHOTO OF WHERE THE BOX WAS LOCATED IN THE ENGINE, WHICH HE FELT WAS TOO CLOSE TO THE FIREWALL AND THE INITIAL CAUSE OF THE FAILURE.  THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 44,000.   UPDATED 1/26/09 *CN  THE CONSUMER WAS THE NUMBER 7 CYLINDER MAY HAVE COMPRESSED LIQUID, MOST LIKELY FUEL THAT CAUSED THE PISTON AND ROD TO BE DAMAGED. IT CAUSED DAMAGED TO THE CYLINDER WALL WHICH REQUIRED THE REPLACEMENT OF THE ENGINE.  THE CONSUMER WAS THEN TOLD THE FUEL INJECTORS WERE IN THE OPEN POSITION BECAUSE THE WIRING CONTROLLING THE FUEL INJECTORS WAS CHAFED AND MAKING CONTACT WITH THE BULKHEAD WHICH GROUNDED THE WIRING. UPDATED 01/27/09. *JB",
        "vin": "2G1FP22G322"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/29/2008",
        "dateOfIncident": "06/10/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232620,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE GA",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "FAULTY VALVE STEMS (LIKELY FROM THE CHINA RECALL) ON 2 GOODYEAR TIRES SO FAR ON MY CAR THAT CRACKED PREMATURELY.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/27/2007",
        "dateOfIncident": "11/20/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210098,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2002 CHEVROLET IMPALA LS IN DECEMBER, 2004. GREAT LOOKING VEHICLE WITH NUMEROUS PROBLEMS. THE MOST RECENT AND SEVERE HAS COME OVER THE LAST FEW DAYS. WHILE ACCELERATING ON AN ENTRANCE RAMP, THE CAR WILL NOT SHIFT PROPERLY; VERY ROUGH AND THE RPM'S GO TO 4000 OR ABOVE BEFORE SHIFTING OR IF I LET OFF THE ACCELERATOR. I AM TERRIFIED THAT THE TRANSMISSION IS GOING TO COME OUT COMPLETELY WHILE DRIVING WITH MY FAMILY IN THE VEHICLE;  I AM TAKING THE CAR TO A MECHANIC TO HAVE IT LOOKED AT.   I HAVE ALSO BEEN RESEARCHING OTHER COMPLAINTS ABOUT THE CAR, AND TO MY HORROR, I AM EXPERIENCING MUCH OF THE SAME AS OTHER CONSUMERS. HOW CAN SO MANY COMPLAINTS BE ISSUED ABOUT THE SAME VEHICLE AND GENERAL MOTORS NOT FIXING THE PROBLEMS??   *TR",
        "vin": "2G1WH55K429"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/29/2007",
        "dateOfIncident": "10/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE NOTICED BUBBLING IN THE PAINT AROUND THE EDGES OF THE ROOF AND SAIL PANEL.  I WAS TOLD THIS IS CAUSED BY A DEFECTIVE GLUE USED BY GM WHICH CAUSES THE PAINT TO DELAMINATE AND CORRODE.  I TRIED TO CONTACT TWO DEALERSHIPS AND CHEVROLET CUSTOMER SERVICE BUT WAS DENIED EACH TIME.  I BELIEVE THIS PROBLEM SHOULD BE COVERED UNDER THE 6YR/100,000 MILE PAINT WARRANTY.  *TR",
        "vin": "2G1FP22G922"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/19/2007",
        "dateOfIncident": "10/19/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206326,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT LEFT TURN SIGNAL/PARKING LIGHT KEEPS BURNING OUT.  BOTH SIDES HAVE BEEN REPLACED WITH NEW SOCKETS COSTING AROUND $400.00, RIGHT AFTER THE WARRANTY EXPIRED.  SINCE THEN THE LEFT SIDE HAS GONE OUT 3 MORE TIMES IN THE LAST YEAR COSTING $45.00 EACH TIME.  IT IS IMPOSSBLE TO REACH THE BULB TO REPLACE IT YOURSELF.  DEALER INSISTS THAT THE PARKING LENS WAS CRACKED CAUSING MOISTURE TO ENTER THE SOCKET.  WHEN INSEPCTING THE VEHICLE, THERE IS NO CRACK.. NOW THEY SAY ITS THE SEAL AROUND THE PARKING LENS.  I JUST REPLACED ANOTHER BURNT OUT BULB 6 WEEKS AGO AND IT HAPPENED AGAIN. IT ALSO HAS NOT RAINED TO CAUSE ANY MOISTURE IN THE LAST 6 WEEKS.",
        "vin": "2G1FP22K622"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "06/24/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194065,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE 2002 CHEVROLET TAHOE HAS FAILED INSPECTION BECAUSE  OF THE  EMERGENCY BRAKE.. IT WAS  COMPLETELY USELESS.  IT DIDN'T  WORK. WHY I DON'T KNOW, BUT THE INSPECTION PLACE STATED THAT THEY HAD FAILED NUMEROUS TAHOES  WITH THE SAME PROBLEM.  I FELT  THAT IT WAS UNSAFE AND CHEVROLET SHOULD RECALL THE FEW THAT HAVE THIS PROBLEM.  WHY DID  IT HAVE TO BE AN INNOCENT PARTY  CONCERNING SEVERAL DEATHS OR THOUSANDS OF PEOPLE REPORTING IT BEFORE IT IS RECALLED.  I DIDN''T EVEN USE THE BRAKE HOW COULD  IT NOT WORK ANYMORE.",
        "vin": "1GNEC13V92R"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/01/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189357,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 CHEVROLET CAMARO.  THE  LEFT TURN SIGNAL LIGHT BURNED OUT AND MELTED THE WIRES.  BOTH OF THE BLINKERS BURNED OUT ONE YEAR AGO AND THE DEALER REPLACED BOTH SOCKETS.  THE CURRENT MILEAGE IS 76,000,  AND FAILURE MILEAGE WAS 70,000. *AK",
        "vin": "2G1FP22K422"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/13/2006",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176021,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 MALIBU.  TURN SIGNAL/HAZARD FLASHER FAILURE.  *NM",
        "vin": "1G1ND52J32M"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/02/2006",
        "dateOfIncident": "05/14/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158883,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "DOOR LATCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "051406 DRIVING 35 MPH WHEN CHECK ENGINE LIGHT CAME ON WHEN CAR LOST ALL ACCELERATION . CAR WAS GOING DOWNHILL AND I BARELY MANAGED TO BRAKE AND STEER IT CLEAR INTO A LOT.   TOWED TO DEALER.  49,000 MILES.  FUEL PUMP NEEDS REPLACEMENT WHICH I FOUND WAS WAY TOO SOON.  COST $1300.  COMPLAINT IS TOO SOON FOR A REPLACEMENT AND MORE IMPORTANT WAS THE HEAVY NON RESPONDING STEERING AND NON RESPONDING BRAKING.  VERY VERY LUCKY OTHER CARS WERE CLEAR.  *NM",
        "vin": "2G1FP22K822"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/13/2006",
        "dateOfIncident": "03/09/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152619,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS AND APPLYING THE BRAKES THE FRONT END VIBRATES.  WHEN THE PROBLEM FIRST OCCURRED AT 12,000 MILES THE DEALERSHIP RESURFACED THE BRAKE ROTORS.  THE PROBLEM REOCCURRED AT 19,000 MILES AND AGAIN THE DEALER RESURFACED THE ROTORS.  WHILE THE VEHICLE WAS AT THE DEALERSHIP FOR THE BRAKE PADS, IT WAS DETERMINED THE BRAKE ROTORS NEED TO BE REPLACED.  THE BRAKE ROTORS WERE NOT REPLACED.",
        "vin": "2G1FP22G422"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/04/2006",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151758,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE CALIFORNIA RAINS OF 2005, MY CAMARO'S T-TOP ROOF LEAKED SO MUCH THAT THERE WAS 1 1/2\" OF WATER IN THE BOTTOM OF THE CAR.  THE DEALER REMOVED THE INTERIOR AND ALLOWED IT TO DRY, BUT THE MANUFACTURER REFUSED TO COVER THE REPAIRS AS A WARRANTY EVEN THOUGH THE CAR WAS ONLY 2 YEARS OLD AND I OWNED AN EXTENDED WARRANTY.  I WAS GIVEN THE RUN AROUND FOR WEEKS BY THE CUSTOMER SERVICE DEPARTMENT BEFORE FINALLY BEING TOLD THAT THEY WOULD NOT COVER THE REPAIRS.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "03/04/2006",
        "dateOfIncident": "07/06/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10151761,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A 2002 CHEVROLET CAMARO I PURCHASED IN OCTOBER OF 2004. MYSELF AND A FRIEND WERE ON OUR WAY TO WORK @ 6:15 AM WHEN WE WERE STRUCK HEAD ON BY A LARGE SUV. WE WERE RUNNING 45 MPH (HEAD ON\" AND DRIVER NOR PASSENGER AIR BAGS DEPLOYED LEAVING MY PASSENGER\"BEST FRIEND\" WITH A LARGE BRUISE ON THE RIGHT SIDE OF HER BRAIN WHICH CAUSES TERRIBLE HEADACHES FOR HER, AND MYSELF WITH CONFLICTING BACK AND NECK PROBLEMS HAD THE AIRBAGS WENT OFF THEY WOULD HAVE AT LEAST KEPT US FROM JAMMING OUR BODIES AT FULL FORCE FORWARD INTO THE WINDSHIELD AND MYSELF THE STEERING WHEEL. THIS ACCIDENT DID $7000.00 WORTH OF DAMAGE TO THE FRONT OF THE CAMARO AND  MESSED UP OUR LIVES FOREVER. INSTEAD OF TOTALING THE CAR LIKE IT SHOULD HAVE BEEN IT WAS FIXED AND IT IS STILL DEFECTIVE THE INSURANCE COMPANY WHICH DID NOT DO THERE JOB RIGHT IN EXAMINING THE CAR THOROUGHLY FOR THE EXTENT OF DAMAGE IT HAD, ALL THEY DID WAS LOOK AT THE CAR TAKE ONE PICTURE ESTIMATED THE COST AT $3500.00  LESS THAN WHAT IT ENDED UP COSTING TO REPAIR, THEY NEVER LOOKED UNDER THE HOOD NOR THE FRONT END TO SEE THAT THE FRONT END ON THE DRIVER SIDE WAS  COMPLETELY DESTROYED THE TIRE WAS FALLING OFF AND NOT ATTACHED TO ANYTHING COMPLETELY DESTROYED AND STILL NO AIR BAGS. HE WOULD NOT EVEN AUTHORIZE THE BODY SHOP TO CHECK THE AIR BAGS NOR CENSORS. I HAVE A SON THAT HAS TO RIDE IN THIS DEFECTIVE CAR AND THAT SCARES ME TO DEATH.  WE WERE ALMOST KILLED!! WE STILL CANT WORK DUE TO THE EXTENT OF OUR INJURIES. I PAY $400.00 A MONTH FOR A CAR I ONCE LOVED MY FIRST NICE CAR WHICH IS NOW A CAR I HATE AND AM SCARED OF. I CANT GET A DIFFERENT ONE I HAVE NO INCOME. I FEEL GM SHOULD STEP UP HELP OUT AND TAKE RESPONSIBILITY FOR THIS MISTAKE. IF NOT WE MAY HAVE TO TAKE FURTHER ACTION.  *JB",
        "vin": "2G1FP22K722"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2006",
        "dateOfIncident": "01/30/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150955,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE VEHICLE LOST POWER MULTIPLE TIMES.  THE FIRST TIME THE ENGINE COIL BURNED OUT AND WAS REPLACED BY THE DEALERSHIP.  THE SECOND TIME THE CATALYTIC CONVERTER WAS PLUGGED AND ENGINE BOLTS HAD BROKEN.  THE DEALERSHIP REPLACED THE CATALYTIC CONVERTER AND THE BOLTS.  DURING THE THIRD OCCURRENCE THE FOOT THROTTLE BODY SENSOR FAILED AND THE DASH LIGHTS INTERMITTENTLY ILLUMINATED.  THE THROTTLE BODY SENSOR WAS REPLACED BY THE DEALERSHIP.  DURING ALL THE OCCURRENCES THE VEHICLE LOST POWER WITHOUT WARNING.",
        "vin": "2G1FP22K022"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/17/2006",
        "dateOfIncident": "08/31/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150496,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST 2002, I PRODUCED BRAKES IN 542 DEPT. AT DELPHI CHASSIS SYSTEMS, DAYTON, OHIO. THE DEPARTMENT WAS SCHEDULED TO CEASE WORK 2 MONTHS AFTER THE END OF GM F-CAR PRODUCTION   I WAS PLACED IN INSPECTION BEHIND BRAKE ASSEMBLY. I INSPECTED ALL BRAKES PRODUCED AS SERVICE PARTS.    BEFORE I ARRIVED, THERE WERE PROBLEMS WITH POROSITY IN THE BRAKE CASTINGS. INSTEAD OF REQUIRING THE CASTINGS PRODUCER TO BRING IN AN X-RAY MACHINE, GENERAL FOREMAN SAM HANAKERI, ON ORDERS FROM VP GUY HACHEY, INSTALLED AN AIR GUN DRIVER AND WATER TANK TO CHECK PARTS AS THEY RAN. THE AIR GUN WOULD SHOOT A SPECIAL SCREW CONNECTED TO A COMPRESSED AIR CONNECTION, AND THE PART WAS DUNKED WHILE THE COMPRESSED AIR WAS ATTACHED TO THE BRAKE CASTING.    THE PROBLEM: THE COMPRESSED AIR ATTACHMENT CROSS THREADED ABOUT 5% OF THE CONNECTION HOLES IN THE CASTING. SINCE THESE CONNECTIONS HAVE TO WITHSTAND HYDRAULIC PRESSURE WHEN THE BRAKES ARE IN USE, CROSS THREADING CAUSES LEAKS AND POTENTIAL BRAKE FAILURE.    A GM ASSEMBLY PLANT HAD ISSUED A PRR FOR THE CROSS THREADING, BUT ONLY FOR ONE SIDE OF THE BRAKES   DELPHI MANAGEMENT ONLY WANTED TO INSPECT THE THREADS ON THE BRAKES MENTIONED IN THE GM PRR, NOT MIRROR IMAGES. THEY KNEW THAT THE INSPECTION PROCESS DAMAGED BOTH SIDES, BUT WANTED TO IGNORE THE PROBLEMS ON THE NON PRR SIDE.    SAM HANAKERI, GF, ORDERED ME TO INSPECT ONLY THE PRR SIDES. HE STATED THAT THE INSPECTION PROCESS CAME FROM GUY HACHEY, AND COULD NOT BE CHANGED OR IMPROVED.   I INSPECTED THESE PARTS 60 DAYS. SAM HANAKERI OBJECTED TO THE SCRAP RESULTING FROM MY FINDING BAD THREADS, STATING THAT PREVIOUS INSPECTORS HAD FOUND LESS. I TOLD HIM THAT I SIGNED THE FORMS, AND AS LONG AS MY NAME WAS ON THE FORMS, THEY WOULD REFLECT WHAT I SAW.    THESE SERVICE PARTS ARE STILL ON SHELVES. THE ASSEMBLY PARTS HAVE BEEN IN USE SINCE 2002.    THE INSPECTION FORMS ARE STILL IN EXISTENCE, MAINTAINED BY BILL ENGLUND AT DELPHI NEED MORE BRAKE PLANT.*JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/17/2006",
        "dateOfIncident": "02/10/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150502,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT 30MPH, THE VEHICLE STALLED.  THE VEHICLE DID NOT RESTART AND WAS TOWED TO THE DEALERSHIP FOR INSPECTION AND REPAIRS.  THE DEALER DISCOVERED THE FUEL LINE HAD FRACTURED AND BROKE.  THE DEALER REPAIRED THE FUEL PUMP AND THE VEHICLE OPERATES NORMALLY.",
        "vin": "2G1FP22K022"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/01/2006",
        "dateOfIncident": "01/24/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149210,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED UPON TURNING ON THE VEHICLE, THE DOOR PANEL BEGAN TO SMOKE, AND THEN THE FLAMES WERE COMING FROM THE WINDOW SWITCH.  THE DEALERSHIP DETERMINED IT WAS A FIRE OF AN UNKNOWN IGNITION SOURCE.  THE WINDOW SWITCH AND DOOR PANEL NEED TO BE REPLACED.",
        "vin": "2G1FP32K622"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "01/19/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148418,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FAILED ON HIGHWAY TRIP. VEHICLE HAS ONLY 40000 MILES. SAFETY HAZARD IN THAT I HAD A HARD TIME GETTING THE VEHICLE SAFELY TO THE SHOULDER. *AK    CAR ALSO HAS A BRAKE VIBRATION AND HAS HAD IT A WHILE. HAVE NEVER TAKEN TO DEALER AS BRAKING DISTANCE HAS NOT BEEN COMPROMISED YET.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/23/2005",
        "dateOfIncident": "12/23/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145987,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "LOW COOLANT LIGHT ON MY 2002 CHEVY MALIBU HAS BEEN COMING ON.  THE CHEVY DEALER CHECKED THE LOW COOLANT LIGHT COMING ON, CHECKED FOR LOW COOLANT. FOUND INTAKE MANIFOLD GASKET LEAKING INTERNALLY. COOLANT MIXING WITH OIL.  *NM",
        "vin": "1G1ND52J72M"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "12/22/2005",
        "dateOfIncident": "10/02/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2002 CHEVY CAMARO TIRE BLEW OUT.  *TS  THE VEHICLE WENT OFF THE ROAD AND STRUCK A MEDIAN WALL DAMAGING THE ENTIRE FRONT END.  THE VEHICLE CAME TO REST PARTIALLY IN THE LEFT LANE AND MEDIAN (OHIO TRAFFIC CRASH REPORT).  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/19/2005",
        "dateOfIncident": "12/19/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145665,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAMARO BOUGHT NOVEMBER 2002,  BRAKES AND TIRES REPLACED SIX MONTHS LATER.  ENGINE HAD SOUNDED LIKE A DIESEL WITHIN THAT SAME SIX MONTHS TIME.  WITHIN THREE YEARS REAR END PRODUCING AN EVER INCREASING HOWL.  HAD CONTACTED DEALER TWO TIMES WITHIN FIRST YEAR ABOUT HIGH OIL CONSUMPTION.  WAS TOLD IT WAS NORMAL FOR A QUART TO BE LOST WITHIN 3000 MILES.  I HAVE TO DRIVE THIS CAR TO WORK AND I REALLY DON'T KNOW WHEN ONE OF MY REAR AXLES IS GOING TO FALL OFF.  I CANNOT AFFORD A NEW REAR END AND MY WARRANTY EXPIRED BY MILEAGE.  I DON'T KNOW IF THIS IS GOING TO DO MUCH GOOD BUT IT FEEL GOOD TO BE ABLE TO WRITE ABOUT WHAT A 33,000 BLACK CAMARO PIECE OF CRAP CAN DO TO A MAN WHO HAS ALWAYS BEEN LOYAL AS POSSIBLE TO CHEVY AND HAD A DREAM TO OWN SUCH A CAR ONLY TO FIND OUT HE WOULD HAVE BEEN BETTER OFF WITH A HYUNDAI.  I WILL TELL YOU ONE THING  AND MAYBE THIS WILL TELL YOU WHAT I REALLY THINK OF CHEVY AND THEIR CARS. I WOULDN'T WISH THIS PURCHASE ON MY WORST ENEMY.  BIGGEST MISTAKE OF MY LIFE WAS BELIEVING IN CHEVY.  *JB",
        "vin": "2G1FP32G222"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/17/2005",
        "dateOfIncident": "08/30/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142971,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 CAMARO 6 CYL.  DRIVERS SIDE AND PASSENGER SIDE POWER WINDOW MOTOR HAD TO BE REPLACED IN SEPARATE INCIDENTS BY AUGUST 2005. *JB",
        "vin": "2G1FP22K822"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/28/2005",
        "dateOfIncident": "09/19/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137977,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RE 2002 CHEVY TAHOE TRANSMISSION PROBLEMS: UP UNTIL THE 34,000 MILE RANGE THE VEHICLE DID JUST THAT, RUN FLAWLESSLY. HOWEVER, AT 34,000 MILES (NOVEMBER OF 2004) THE TRANSMISSION WENT OUT. MY WIFE WAS DRIVING TO WORK AND NEEDED TO ACCELERATE TO MERGE ONTO THE FREEWAY AND INSTANTLY THE TRANSMISSION BEGAN TO WHINE AND STOPPED OPERATING WHICH PLACED HER INTO THE PATH OF A LARGE TRUCK BEARING DOWN ON HER RATHER QUICKLY. THANKFULLY SHE WAS ABLE TO GLIDE OUT OF THE PATH OF THE TRUCK TO THE SIDE OF THE ROAD. WE HAD THE TAHOE TOWED BACK TO OUR DEALERSHIP AND WE DETERMINED THAT THE TRANSMISSION \"SUN SHELL\" HAD FAILED AND WOULD BE REPLACED. OUR DEALER ASSURED US THAT THIS WOULD SOLVE THE PROBLEM, BECAUSE THE NEW PARTS WERE DESIGNED TO PREVENT THIS FROM OCCURRING IN THE FUTURE. OUR DEALER FURTHER STATED THAT THEY HAVE BEEN REPAIRING A LARGE NUMBER OF VEHICLES WITH THESE FAILURES.   OUR TAHOE WENT OFF OF IT'S NEW CAR WARRANTY ON MILEAGE NOT NUMBER OF MONTHS SOMETIME IN APRIL OF 2005 (36 MONTHS WOULD HAVE ENDED THIS AUGUST). JUST THIS PAST MONDAY (SEPTEMBER 19, 2005) MY WIFE WAS AGAIN ON HER WAY TO WORK WHEN AGAIN THE TRANSMISSION FAILED IN OUR 2002 TAHOE. THE MILEAGE WAS APPROX: 41,000 ( TOTAL PERIOD OF MILES AND THE LENGTH OF TIME FROM THE PREVIOUS FAILURE WAS APPROX: 7 MONTHS). THE CIRCUMSTANCES WERE THE SAME, SHE WAS ACCELERATING TO MERGE ONTO THE FREEWAY AND AGAIN THE TRANSMISSION BEGAN TO WHINE AND SLIP. THIS TIME SHE WAS ABLE TO CONTINUE DRIVING TO THE SIDE OF THE ROAD AND RELATIVE SAFETY. WE HAD THE VEHICLE TOWED BACK TO OUR DEALERSHIP AND AGAIN THE DEALER ADVISED THAT THE \"SUN SHELL\" HAD FAILED. I WENT TO PICK UP THE CAR ON FRIDAY SEPTEMBER 23, 2005 AND WHILE I WAS AT THE DEALERSHIP THE MECHANIC SHOWED ME THE DAMAGED PART AND A BENCH THAT CONTAINED SEVERAL DAMAGED \"SUN SHELL\". IT OBVIOUSLY DOES NOT TAKE MUCH EFFORT TO REALIZE THAT THERE IS A DESIGN FLAW WITH THIS PARTICULAR TRANSMISSION AND SPECIFICALLY THIS PART. *JB",
        "vin": "1GNEC13T52J"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137668,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2002 CHEVROLET IMPALA LS.  THE CONSUMER  STATED  CAR   DEVELOPED A SPORADIC FAILURE OF TURN SIGNALS. THIS HAS BEEN HAPPENING FOR ABOUT 3 WEEKS. INVOLVED LEFT AND RIGHT TURN SIGNALS. THE CONSUMER  CONTACTED CHEVROLET, THEY TOLD  THE CONSUMER  TO CONTACT THE DEALER, IMPERIAL CHEVROLET. HOWEVER,  THE DEALER TOLD THE CONSUMER  SHE WOULD HAVE TO PAY $46.00 JUST TO LOOK AT CAR.  THE CONSUMER   STATED THAT AN ARTICLE IN LOCAL NEWSPAPER STATED THERE HAS BEEN A TREND OF FAULTY IGNITION SWITCHES IN THIS MODEL VEHICLE. WHEN  THE CONSUMER  CALLED IMPERIAL CHEVROLET THEY STATED THEY WERE WELL AWARE OF THE PROBLEM WITH THE FAULTY IGNITION SWITCHES. *AK",
        "vin": "2G1WH55K829"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/14/2005",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125829,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR CONCERNING DEFECTIVE SAFETY BELTS IN CONSUMER'S 2002 GMC CONVERTIBLE.*MR  THE DRIVER'S SIDE SEAT BELT DOES NOT RETRACT.  THE LOCAL DEALERSHIP REPLACED THE BELT TWICE, BUT EACH OF THOSE BELTS WAS WORSE THAN THE ORIGINAL.  THE MANUFACTURER REFUSED TO PROVIDE ANY MORE ASSISTANCE.  *NM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/06/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124344,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A VERY UNNERVING CONDITION IS PRESENT IN OUR 2002 TAHOE. THERE IS A LOOSE/ UNSTABLE FEELING IN THE STEERING WHEN TURNING. MY MECHANIC SAID WE HAVE A WARPED CENTER STEERING SHAFT AND HE CAN NOT REPAIR AS THE PART IS BACK ORDERED BY TENS OF THOUSANDS NATIONWIDE (INDICATING A UNIVERSAL PROBLEM WITH THIS VEHICLE)  I HAVE BEEN EXPECTING A RECALL BUT HAVE NOT SEEN ONE. GM HAS NOT REPLIED TO MY INQUIRY.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120124,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DC: HIS BRAKES DO NOT WORK CORRECTLY. WHEN YOU STOP THE ABS SYSTEM KICKS IN, THE PEDAL JERKS BACK AND FORTH. THE VEHICLE DOES NOT WANT TO STOP CORRECTLY. *AK",
        "vin": "1GNEK13Z52R"
    },
    {
        "components": "STEERING,SERVICE BRAKES, AIR,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/26/2005",
        "dateOfIncident": "10/26/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118455,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT OUR ASTRO VAN IN 2001, IT HAS BEEN IN THE SHOP ABOUT 22 OR 23 TIMES.  MOST OF THEM MAJOR THINGS NEEDING TO BE FIXED OR REPLACED.*AK",
        "vin": "1GNDM19X02B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/07/2005",
        "dateOfIncident": "04/09/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY THE BRAKE PEDAL SHUTTERED/SHIMMIED AND PULSATED WHEN DEPRESSED. THIS WAS DUE TO A FAILURE IN THE BRAKE ROTORS. THE FAILURE HAS OCCURRED AT 7000, 12419 ,18830,26754, AND 27310 MILES, THE ROTORS WERE  RESURFACED/REPLACED/TURNED. AND  BRAKE SHIMS HAD BEEN ADDED. IN ADDITION THE BRAKE PAD AND SHOES WERE REPLACED 4 TIMES.*AK   THE CONSUMER WAS ADVISED TO PURCHASE A HIGHER QUALITY  OFF THE MARKET ROTOR AT $500.00 PER ROTOR.  *TC",
        "vin": "2G1FP22K922"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/28/2005",
        "dateOfIncident": "02/23/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT RIGHT ROTOR  WARPED. WHEN DRIVING AT APPROXIMATELY 40 MPH AND THE BRAKES WERE APPLIED THERE WAS SHUTTER/VIBRATED, AND VEHICLE PULLED TO THE RIGHT. OWNER TOOK  VEHICLE TO THE DEALER ON TWO OCCASIONS, AND  DEALER REPLACED THE ROTORS.  ALSO, INFORMED OWNER THE FRONT RIGHT ROTOR IS WARPED.  AFTER ABOUT 10,000 MILES VIBRATION RETURNED.  VIBRATION WAS FELT WHEN VEHICLE WAS  DRIVEN AT 40 MPH OR GREATER. *AK",
        "vin": "2G1FP32G022"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/19/2005",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107561,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 CAMARO CONVERTIBLE WHICH IS STILL UNDER NEW VEHICLE WARRANTY THAT HAS A DRIVER?S SIDE SEAT BELT THAT WILL NOT RETRACT WHEN EXITING THE CAR.    YESTERDAY I MET WITH GM?S FACTORY REP WHO EXAMINED THE CAR AND INSISTS THAT THE BELTS OPERATE NORMAL.    EVEN THOUGH THIS BELT ?MAY? ENGAGE PROPERLY IN THE EVENT OF A COLLISION, THE FACT THAT IT DOES NOT RETRACT IS A DETERRENT TO USING IT.  THE DRIVER ALWAYS HAS TO REACH AROUND TO FIND THE BUCKLE IN A DIFFERENT LOCATION.  HOW MANY DRIVERS WITH CAMAROS ARE DETERRED FROM USING THEIR SEAT BELTS BECAUSE OF THIS CONDITION?  HOW MANY INJURIES AND DEATHS HAVE OCCURRED BECAUSE PEOPLE DON?T WEAR THEIR SEAT BELTS BECAUSE OF THIS DETERRENT CONDITION?  REGARDS, JOE ZOLTAK, 414 PINE DR N, SURFSIDE BEACH, SC 29575,   843-828-8490.     *NM",
        "vin": "2G1FP32G922"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/22/2004",
        "dateOfIncident": "10/22/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE BRAKES PEDAL WENT TO THE FLOOR.  ABS BRAKING LIGHT APPEARED ON THE DASHBOARD AND REMAINED ON.  CONSUMER DROVE THE VEHICLE TO THE DEALER FOR INSPECTION, AND  DEALER WAS NOT  ABLE TO DUPLICATE THE PROBLEM.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/21/2004",
        "dateOfIncident": "07/20/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097401,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEALERSHIP INFORMED THE CONSUMER THAT WHEN THE VEHICLE PULSATED, THE PROBLEM WAS DUE TO WARPED ROTORS. PLEASE PROVIDE MORE INFORMATION. *JB",
        "vin": "2G1FP22K022"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/15/2004",
        "dateOfIncident": "09/17/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AND APPLYING THE BRAKES THE STEERING WHEEL VIBRATED UNCONTROLLABLY.  A LOUD CLANKING NOISE WAS HEARD COMING FROM THE DRIVER'S SIDE AND PASSENGER SIDE WHEELS.  THE CONSUMER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE, AND DROVE IT TO THE DEALER.  THE MECHANIC DETERMINED THAT THE WHEEL RIMS WERE NOT THE CORRECT  RIMS.  THE MECHANIC REPLACED THE RIM SPACER FOR THE FRONT.  BUT THE REAR RIM SPACER WERE ON BACK ORDER.   *AK   THE WHEEL STUDS WERE BROKEN AND THE LUG NUTS WERE WORKING THEMSELVES LOOSE, THE WHEEL CENTERING SPACERS WERE NOT INSTALLED WHEN THE RIMS WERE REPLACED, THE STUDS WEREN'T LONG ENOUGH FOR THE RIMS.    *SC",
        "vin": "2G1FP22K222"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/27/2004",
        "dateOfIncident": "09/27/2004",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON RAINING DAYS THE FRONT WINDSHIELD LEAKED WATER  INSIDE OF  THE VEHICLE.  WATER LEAKED ONTO THE FUSE BOX/CONSUMER LEGS/BRAKES, AND GAS  PEDAL, RESULTING IN  AN ELECTRICAL SHORT.  THEN, VEHICLE CAUGHT  ON FIRE. DEALER WAS  NOTIFIED.*AK",
        "vin": "2G1FP32G222"
    },
    {
        "components": "SEAT BELTS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/23/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093126,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "TRW Automotive, Inc.",
                "productMake": "TRW",
                "productModel": "SEAT BELT RETRACTOR",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DRIVER'S SIDE SEAT BELT FAILS TO RETRACT WHEN EXITING CAR.  DEALER REFUSES TO REPLACE IT SAYING IT IS NORMAL.   *JB",
        "vin": "2G1FP32G922"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "04/10/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10088068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 5 MPH CONSUMER'S VEHICLE WAS  REAR ENDED.  BOTH PASSENGER AND DRIVER SEAT BELTS FAILED TO RETRACT.  THIS CAUSED DRIVER/PASSENGER TO SUSTAIN MINOR INJURIES, AND WERE TRANSPORTED TO THE HOSPITAL BY AMBULANCE.   CONSUMER DROVE THE VEHICLE TO THE DEALER FOR INSPECTION.  *AK *MR",
        "vin": "2G1FP22G122"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/11/2004",
        "dateOfIncident": "06/07/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086606,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 CAMARO HAS HAD EXCESSIVE VIBRATION IN THE STEERING WHEEL CASED BY WARPED FRONT ROTORS.  ROTORS WERE TURNED BUT 8K MILES LATER THEY WERE SO WARPED AGAIN THAT THEY HAD TO BE REPLACED. PUT NEW PADS AND AFTERMARKET SLOTTED ROTORS TO REDUE WARPING.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/15/2004",
        "dateOfIncident": "06/07/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075434,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "COLD AND HOT ENGINE KNOCK,  ISTONS REPLACED,YLINDER WALLS IN #1 AND 8 OUT OF SPECIFICATION.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/10/2004",
        "dateOfIncident": "05/07/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075168,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS WERE WARPED AND HAD TO BE TURNED TWICE WITHIN THE FIRST 15,000 MILES OF OWNERSHIP UNDER NORMAL DRIVING CONDITIONS.  DEALER WOULD NOT REPLACE UNDER WARRANTY HOWEVER, THEY MACHINED THE ROTORS AS A \"COURTESY\" AND ADVISED ME NOT TO STOP SO HARD IN THE FUTURE - RIDICULOUS! *AK",
        "vin": "2G1FP22G722"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/21/2004",
        "dateOfIncident": "04/21/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074066,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DISC BRAKE ROTORS WARPED PREMATURELY. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/22/2004",
        "dateOfIncident": "09/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY VEHICLE ON MAY 11 2002 AND  I HAVE ALREADY HAD TO REPLACE MY DIFFER. AND ROTORS, I HAVE OTHER PROBLEMS BUT THERE NOT EFFECTING THE OVERALL OPERATIONS.  IF GM EVER WANT ME TO BUY A CAR FROM THEM AGAIN, THEY BETTER GET THERE ?!@#$% TOGETHER, HOW MANY COMPLAINTS DOES IT TAKE? *AK",
        "vin": "2G1FP22K522"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044751,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING PRESSURE TO THE BRAKE PEDAL, THE VEHICLE SHOOK VIOLENTLY.  THE CONSUMER TOOK THE VEHICLE TO THE DEALER AND THE MECHANIC DETERMINED THAT THE FRONT ROTORS WERE WARPED AND MUST BE REPLACED.   *AK   CERAMIC BRAKES WERE PLACED ON THE VEHICLE WHICH CAUSED THE ROTORS TO WARP.   *SCC   *JB",
        "vin": "2G1FP22G522"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/15/2003",
        "dateOfIncident": "10/09/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042924,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END HAS SHAKED SINCE RECIEVING CAR. AIR LEAKS IN DRIVERS DOOR. NOISY DRIVETRAIN.  *LA",
        "vin": "2G1FP32G622"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/13/2003",
        "dateOfIncident": "08/26/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS THE OWNER OF A 2002 CAMARO WHICH WAS EQUIPPED WITH THE ASR (ACCELERATION SLIP REGULATION SYSTEM). THIS WAS SUPPOSED TO PROVIDE TRACTION CONTROL IN WET ROAD CONDITIONS.  MY VEHICLE HAD A TENDENCY TO FISHTAIL ON WET SURFACES AT NORMAL SPEEDS.  *JB",
        "vin": "2G1FP22K722"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/11/2003",
        "dateOfIncident": "12/20/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032593,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE AROUND 5000 I STARTED TO FEEL A RIBRATION IN THE STEERING WHEEL WHILE BRAKING. IT HAS SLOWLY GOT WORST TILL NOW AT 10,000 MILES. I AM TOLD IT IS THE ROTORS AND THEY A WARPED. SHOES HAVE PLENTY OF GOOD PAD LEFT AND NO GROOVES ARE WORN IT THE ROTOR FACE. THE STARTING DATE IS ESTIMATED DATE THAT THE PROBLEM STARTED.",
        "vin": "2G1FP22GX22"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/16/2003",
        "dateOfIncident": "04/28/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023185,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL FOUR ROTORS BECAME WARPED MYSTERIOUSLY JUST DAYS AFTER TAKING CAR TO DEALERSHIP TO HAVE OIL LEAK, REAR SPEAKER, AND LEFT POWER WINDOW FIXED. BAFFLED AT HOW THIS COULD OCCUR ON A VEHICLE WITH SUCH LOW MILES AND EASY DRIVING. HOWEVER, MECHANICS AT DEALERSHIP DROVE MY CAR FOR 30 MILES - SO WHO KNOWS WHAT OCCURRED DURING THAT TIME. HAD TO PAY BRAKE SHOP $85 TO GET 4 ROTORS RESURFACED, SINCE DEALER WOULD NOT WARRANTY. (STEREO SPEAKER STILL NOT FIXED, AND WINDOW STILL RATTLES).     *NLM",
        "vin": "2G1FP22G622"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/03/2003",
        "dateOfIncident": "09/09/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021544,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE DELIVERY THE LEFT REAR OF THE VEHICLE RATTLED.  THE DEALER ATTEMPTED TO FIX THE PROBLEM BUT THE ATTEMPTS WERE UNSUCCESSFUL.   THE VEHICLE ALSO EXPERIENCED SLOPPY SHIFTING, NOISY DRIVE TRAIN, NO TRACTION CONTROL, MANY SQUEAKS AND VIBRATIONS.  THE WINDSHIELD SCRATCHED EASILY FRONT HE WIPER BLADES WHICH CAUSED POOR VISIBILITY.  *MR   *SCC   *NLM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/02/2003",
        "dateOfIncident": "05/16/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020873,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 CAMERO HAS DEVELOPED EXCESSIVE ROTOR WEAR AND WARPING AT LOW MILEAGE AND NORMAL DRIVING CONDITIONS. DEALER CLIAMS IT IS NOT COVERED BY WARRANTY SINCE IT IS NOT A DEFECT IN LABOR OR MATERIAL.  DEALER SERVICE AGENT TOLD ME IN CONFIDENCE THEY HAVE SEEN NUMEROUS CASES AND BELIEVE IT TO BE A BAD BATCH OF ROTORS...STILL WON'T FIX UNDER WARRANTY!!!*AK",
        "vin": "2G1FP22G522"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/09/2003",
        "dateOfIncident": "09/09/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018449,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE DELIVERY, VEHICLE HAS LEFT REAR RATTLE. 4 ATTEMPTS TO REPAIR DID NOT CORRECT PROBLEM. ALSO, SLOPPY SHIFTING & NOISY DRIVE TRAIN, NO TRACTION CONTROL, MANY SQUEAKS AND VIBRATIONS. ALSO, WINDSHIELD SCRATCHES EASILY (FROM WIPERS?) AND VISION IS DISTORTED. GM PROMISED TO HAVE AREA SERVICE MANAGER CONTACT ME, BUT NO ONE HAS. SEEKING REPLACEMENT OR REPURCHASE OF AUTO DUE TO MANY DIFFERENT PROBLEMS, AND COMPLETE DISSATISFACTION. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/21/2003",
        "dateOfIncident": "04/02/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017283,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE PEDAL WENT TO THE FLOOR WHEN THE BRAKE WAS APPLIED WHICH CAUSED EXTENDED STOPPING DISTANCE.  THE DEALER WAS NOTIFIED.  *NLM",
        "vin": "FILL IN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "03/15/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010609,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VIBRATES DURING BRAKING. HAVE HAD ROTORS REPLACED AND TURNED. PROBLEM RETURNS EVERY TIME. ROTORS ARE WARPING DUE TO NORMAL BRAKING. DEALER SAYS IT IS DUE TO HARD DRIVING, WILL NOT SERVICE UNDER WARRANTY.  *NLM",
        "vin": "2G1FP22G222"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/26/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007183,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED A LOUD ENGINE RATTLE AND WATER LEAKAGE IN RIGHT SIDE WINDOW.*AK  *JB",
        "vin": "2G1FP22K922"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2003",
        "dateOfIncident": "02/03/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009229,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION FAILED TO SHIFT PROPERLY AND THE VEHICLE EXPERIENCED REAR END NOISES.*JB",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/21/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008983,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED A VIBRATION, WHEN THE BRAKE WAS APPLIED.*JB",
        "vin": "2G1FP32G322"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/12/2003",
        "dateOfIncident": "02/12/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007245,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE BURNED AN EXCESSIVE AMOUNT OF OIL.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2003",
        "dateOfIncident": "01/28/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005500,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 CAMARO HAS BEEN BACK TO THE DEALER SIX TIMES I TALKED TO CHEVROLET ABOUT BUYING BACK MY CAR  THEY REFUSED I FEEL THIS CAR IS UNSAFE EVEN THE SERVICE MANAGER AT THE DEALERSHIP SAID THIS CAR HAS MULTIPLY ELECTRICAL PROBLEMS AND HE TOLD CHEVROLET THIS",
        "vin": "2G1FP22G522"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/07/2003",
        "dateOfIncident": "01/03/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10006774,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN A FRONTAL COLLISION, BUT NONE OF THE AIR  DEPLOYED UPON IMPACT. DRIVER SUSTAIN SERIOUS BODILY INJURIES. PLEASE PROVIDE MORE DETAILS. PLEASE PUT THE CORRECT MODEL.            PH",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "01/26/2003",
        "dateOfIncident": "11/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003411,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 CAMARO, CAR STARTED TO SHAKE WHEN BRAKES WERE APPLIED AT ABT 8,000 MILES. TOOK INTO DEALER TO BE CHECKED OUT. WAS TOLD ROTORS NEEDED TO BE TURNED.  FOR THIS TO HAPPEN WITH SUCH LOW MILES MUST BE DEFECTIVE. SHOULD HAVE BEEN GIVEN NEW ROTORS. HAS THERE BEEN A RECALL?",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/07/2002",
        "dateOfIncident": "09/10/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770585,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY.  DT",
        "vin": "2G1FP22G222"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/29/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770245,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A WRECK LAST MONDAY NIGHT WHILE DRIVING A COMPANY VAN.  THE CRUISE CONTROL WHEN YOU SET IT AT A SPEED THEN GO DOWN A HILL IT WOULD GET 15-20 MILES FASTER.  ANY HOW THE RIGHT FRONT TIRE WENT DOWN AND I HIT A GUARD RAIL WITH THE FRONT OF THE VAN A FIRE STARTED IMMEDIATELY BY MY LEFT FOOT AND NONE OF THE FRONT AIR BAGS DEPLOYED UNTIL THE FIRE GOT TO THEM. THE VAN ROLLED OVER ONCE AND LANDED ON ITS WHEELS THE DOORS WOULDN'T OPEN I ROLLED DOWN THE PASSENGER SIDE WINDOW AND GOT OUT THAT WAY AND THE ABS BRAKES WOULD LOCK UP WHEN YOU HAVE TO GET ON THEM REAL HARD.  DT",
        "vin": "???????????"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/26/2002",
        "dateOfIncident": "01/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATES THAT THERE IS A DISTORTION ON THE WINDSHIELD .  CONTACTED DEALER AND THE DEALER IS NOT WILLING TO DO ANYTHING.  THE CONSUMER STATES THAT THE OBJECTS APPEAR LARGER AND SMALLER WHEN YOU LINE YOUR LINE OF SIGHT SHIFTS FROM THE CLEAR AREAS TO THE DISTORTED AREAS.  THE DEALER REPLACED THE GLASS ONCE WITH THE IDENTICAL WINDSHEILD AND NOW CLAIMS THAT THE DEGREE OF DISTORTION IS NORMAL FOR CAMAROS, AND SEES KNOW REASON TO IMPROVE.  *SCC",
        "vin": "2G1FP22G922"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/11/2002",
        "dateOfIncident": "07/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013777,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THERE IS EXCESSIVE DISTORTION THROUGH FRONT WINDSHIELD.  ITEMS APPEAR LARGER OR SMALLER THAN THEY REALLY ARE.  CONSUMER STATED THAT ROAD SIGNS ARE BLURRY, AND IT GIVES HIM A HEADACHE.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/18/2002",
        "dateOfIncident": "06/02/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8012042,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A FRONT END COLLISION NONE OFF THE AIR BAGS DEPLOYED ON IMPACT. DRIVER SUSTAINED INJURIES, AND VEHICLE WAS TOTALLED.*AK    THE COLLISION WAS A DIRECT FRONT END HIT TO THE CENTER OF THE VEHICLE.  THE SPEED OF THE VEHICLE WAS WELL OVER THE POSTED SPEED RECOMMENDED IN THE OWNERS MANUAL FOR THE AIR BAGS TO DEPLOY.  NEITHER FRONTAL AIR BAG DEPLOYED.  *JG",
        "vin": "2G1FP22G622"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/11/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011529,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER BOUGHT A 2002, CHEVROLET, CAMARO. SINCE PURCHASE WINDSHIELD IS FAULTY, AND IT IS VERY DIFFICULT TO SEE WHILE DRIVING.  HAS HAD IT REPLACED BY DEALER 4 TIMES.*AK",
        "vin": "2G1FP22K722"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/09/2002",
        "dateOfIncident": "03/12/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS RUST UNDERNEATH  VEHICLE.  ALSO TALKED WITH VICTOR  DIJELIO FROM THE DEALERSHIP.  HE TOLD HIM THAT  RUST UNDERNEATH  VEHICLE WAS A SAFETY ISSUE.",
        "vin": "2G1FP22G822"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/11/2002",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8007399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING BRAKES AT HIGH SPEED  VEHICLE SHUTTERS. STEERING WHEEL VIBRATES, AND BRAKING DISTANCE IS EXTENDED. ALSO,  ROTORS WERE RESURFACED AT 4000 MILES, THEN REPLACED. ROTORS NEED RESURFACING AGAIN AT THIS TIME.*AK",
        "vin": "ADD"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/01/2002",
        "dateOfIncident": "03/15/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 760052,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HTTP://EMER.HOMEDNS.ORG/LS1_KNOCK/INDEX.ASP. NO SAFETY DEFECT STATED IN SUMMARY. *AK",
        "vin": "2G1FP22G622"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000896,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CAMARO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, SKIP SHIFT FEATURE FORCES SHIFTS TO MOVE FROM FIRST TO FORTH BY PASSING SECOND AND THIRD GEARS, NO ACCELERATION.  *AK  ON SEVERAL OCCASIONS, OTHER VEHICLES HAVE HAD TO TAKE EVASIVE ACTION TO AVOID COLLISON.  *TT",
        "vin": "2G1FP22G522"
    }
]