[
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "01/26/2018",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065259,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 FORD F-450 SD. THE CONTACT STATED THAT THE DRIVER AND PASSENGER SIDE POWER WINDOWS FAILED TO GO UP AND DOWN. ALSO, THE DOME LIGHTING FAILED TO TURN ON AND THERE WAS AN ABNORMAL CLICKING NOISE. THE CONTACT CALLED A LOCAL DEALER (HARRISONBURG FORD, 3155 S MAIN ST, HARRISONBURG, VA 22801) AND WAS INFORMED THAT THERE WERE NO RECALLS ON THE VEHICLE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED AND REFERRED THE CONTACT TO NHTSA. THE FAILURE MILEAGE WAS 45,000.",
        "vin": "1FDXW47F42E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/07/2012",
        "dateOfIncident": "02/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 FORD F-450 SD. THE CONTACT STATED THAT THE FUEL TANK LINER ERODED AND CAUSED THE VEHICLE TO STALL. THE FAILURE WAS RECURRING.  THE CONTACT WAS NOT GIVEN A REASON FOR THE FAILURE, BUT THE CONTACT STATED THAT HE BELIEVED THAT STEEL WAS BEING USED TO MANUFACTURER THE FUEL TANK AND WAS CAUSING THE FUEL TANK TO RUST AND ERODE PREMATURELY.  THE VEHICLE WAS NOT RECENTLY REPAIRED.  THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 90,000 AND THE CURRENT MILEAGE WS 103,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/15/2011",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10383548,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M CURRENTLY IN KENYA VOLUNTEERING AND DON'T HAVE MY OLD BILL OF SALE WITH ME BUT WILL HAPPILY PROVIDE IT UPON MY RETURN TO THE STATES. I COULD GIVE AN OFFICIAL PERSONAL INFORMATION THAT THEY COULD THEN USE TO LOOK UP THE VIN IF THEY WISHED. I WAS DRIVING DOWN THE ROAD WHEN MY TRUCK STARTED RUNNING ROUGH AND LOST ALL POWER WHILE TOWING A HEAVY 24' TRAILER. THE TRUCK WAS ABLE TO BE DRIVEN TO A MECHANIC WHERE HE TOLD ME THAT THE TANK HAD DELAMINATED AND CLOGGED THE FUEL PUMP. LUCKILY I WAS ABLE TO GET THE TRUCK PULLED OVER AND OFF THE ROAD AND HAVE SINCE SOLD THE VEHICLE. I HAVE READ ONLINE OF COUNTLESS OTHER INDIVIDUALS WITH THE TANK DELAMINATION PROBLEM AND NEITHER FORD MO. CO. OR NHTSA HAS DONE ANYTHING ABOUT THIS ISSUE... IF YOU WERE TO CALL ROB BARBER- HEAD OF PURCHASING FOR THE BRICKMAN GROUP, I WOULD BET THAT HIS COMPANY HAS HAD 100 TRUCKS AFFECTED BY THIS ISSUE THAT FORD REFUSES TO MAKE THE RECALL ON AND THUS NOT WARRANT. IT'S A SAFETY ISSUE BECAUSE THE DEFECT COULD LEAVE YOU POWERLESS  WHEREVER YOU MAY BE (RAILROAD TRACKS OR GOING OVER THE BEN FRANKLIN BRIDGE). I FIGURED SOMETHING WOULD BE DONE AND DIDN'T REPORT IT AT THE TIME BECAUSE I SAW LAWYERS WERE BEGINNING TO GET INVOLVED BUT HERE WE STILL HAVE NO CONCRETE  SOLUTION OTHER THAN THE AMERICAN PEOPLE WHO BUY AMERICAN PAYING THOUSANDS TO FIX A COMPANY OF WHOM THEY BAILED OUT LESS THAN TWO YEARS AGO.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "11/09/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 FORD F450.  THE CONTACT STATED THAT THE MATERIAL IN THE FUEL TANK HAS DETACHED FROM THE INNER STRUCTURE OF THE TANK.  THE MATERIAL WAS IN THE FUEL INJECTOR AND CAUSED THE VEHICLE TO STALL AND SHUTS OFF INTERMITTENTLY WHILE DRIVING 65 MPH.  THE CONTACT HAS TAKEN THE VEHICLE TO THE DEALER TO REPLACE THE FUEL TANK, FUEL PUMP, FUEL SENDER, FUEL FILTERS, AND THE FUEL INJECTORS.  THE REPAIRS HAVE REMEDIED THE FAILURE.  THE CONTACT STATED THAT THE VEHICLE COULD HAVE CAUSED A CRASH TO OCCUR WHEN IT STALLED. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "1FDXF46F72E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/26/2009",
        "dateOfIncident": "08/18/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281890,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 FORD F450 THAT I RELY HEAVILY ON IN MY SMALL LAWN MAINTENANCE BUSINESS.  WHEN THAT TRUCK DOESN'T RUN, I DON'T EARN ANY MONEY AND IN FACT I AM IN THE RED.  I HAVE DISCOVERED THROUGH THE BRIEFEST OF ON-LINE SEARCHES THOUGH THAT I AM ONLY ONE OF THOUSANDS WHO HAVE RUN IN TO THE PROBLEM I'M HAVING NOW.    MY TRUCK RECENTLY FAILED DURING THE WORKDAY AND THE CAUSE WAS DIAGNOSED AS A RUSTY (SOME ARE SAYING DELAMINATED) FUEL TANK, WHICH ALONG WITH SEVERAL RELATED PARTS HAD TO BE REPLACED FOR A TOTAL COST OF OVER $4200.  IN THE MIDDLE OF A RECESSION THAT'S GIVING SMALL BUSINESS OWNERS THE FIGHT OF THEIR LIVES, I HAD TO LOSE 2 DAYS OF WORK ON TOP OF A HUGE CHUNK OF CASH.  AND AS IS ALSO TRUE WITH THE STORIES REPORTED BY OTHER FORD OWNERS, I DID NOT USE ANY BIO-DIESEL FUELS IN MY TRUCK.  BECAUSE MY LIVELIHOOD DEPENDS ON IT, I HAVE MADE EVERY EFFORT TO KEEP THIS TRUCK IN FIRST RATE WORKING CONDITION.  THIS GAS TANK DID NOT FAIL BECAUSE OF ANYTHING I DID OR DIDN'T DO.  I WANT FORD TO MAN UP AND TAKE RESPONSIBILITY FOR THIS FAULTY PART, ISSUE A RECALL, AND REIMBURSE ME FOR THE COST OF REPAIRS.  THE WORK ON MY TRUCK WAS DONE BY APPLE FORD ON STANFORD BLVD IN COLUMBIA MD ON 8/18/09. *TR  UPDATED 09/03/09.*JB",
        "vin": "1FDXW46F12E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/26/2008",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232376,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST OF 2007 5 OF THE 8 AMBULANCES IN OUR MUNICIPAL FLEET BEGAN TO STALL AND LOOSE POWER AND NOT BE ABLE TO GET OVER 35-40 MPH. WE FOUND THE FUEL FILTERS FULL OF SILVER FLAKES. AFTER REMOVING THE FUEL TANK WE FOUND THE LINING OF THE FUEL TANK FLAKING OFF. EVEN THOUGH THESE UNITS WERE OUT OF WARRANTY FORD PAID 50% TO REPLACE THE TANKS, FUEL PUMPS AND SENDING UNITS.  TODAY 2 OF THE SAME UNITS BEGAN TO EXPERIENCE THE SAME DRIVABLE PROBLEM. THIS TIME WE FOUND RUST PARTICLES IN THE FUEL FILTER HOUSING AND THE FILTER PLUGGED WITH THESE RUST PARTICLES. AFTER REMOVING THE FUEL TANK WE FOUND THE BOTTOM HALF OF THE FUEL TANK COMPLETELY COVERED WITH RUST. THESE UNITS NEVER GET BELOW A HALF TANK OF FUEL. WE HAVE TESTED OUR DIESEL FUEL AND THE SAMPLES HAVE COME BACK FROM THE LAB NORMAL. WE ALSO REPLACED THE FILTERS ON THE OTHER 3 UNITS THAT HAD TANKS REPLACED LAST AUGUST AND FOUND THE FILTERS PLUGGED WITH RUST ALSO. WE HAVE A TOTAL ABOUT  40 DIESEL VEHICLES IN OUR FLEET AND THESE 5 VEHICLES ARE THE ONLY ONES EXPERIENCING A PROBLEM. WE CUT OPEN FILTERS IN OTHER DIESEL VEHICLES IN OUR FLEET AND FOUND NO PROBLEMS. THIS PRESENTS A SAFETY ISSUE WITH VEHICLES THAT POTENTIALLY COULD FAIL WHILE TRANSPORTING PATIENTS.  THE AFFECTED VEHICLES ARE 2002-2003 FORD F40 WITH 7.3 DIESEL ENGINES.   *TR",
        "vin": "1FDXF46F42E"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "07/04/2007",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195318,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "7.3 DIESEL FUEL LINE, BETWEEN HOSE NEED STEERING BOX AND FUEL FILTER AT TOP FRONT OF ENGINE, RUSTED CAUSING A FUEL LEAK, MAY BE FUEL RETURN LINE",
        "vin": "1FDXF47F12E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/18/2004",
        "dateOfIncident": "11/11/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101271,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STOPPING  AT A LIGHT AND ATTEMPTING TO ACCELERATE  VEHICLE HESITATED FOR ABOUT 4 SECONDS. *AK",
        "vin": "1FDXW46P73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/03/2004",
        "dateOfIncident": "06/10/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089072,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASENGER COMPARTMENT FLOORBOARD HEATS UP TO 160+ DEGREES WHEN IN HILLY OR MOUNTANIOUS AREA OF DRIVING. PASENGER UNABLE TO KEEP FEET ON FLOOR BOARD DUE TO HEAT. F450 10 CYL GASOLINE ENGINE MOTORHOME. FORD DEALER STATES  \"COMMON COMPLAINT FOR THIS ENGINE & VEHICHLE\" NO REMEDY OFFERED.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/30/2004",
        "dateOfIncident": "06/17/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080012,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DEPRESSING THE BRAKES PEDAL WENT ALL THE WAY TO THE FLOOR BEFORE STOPPING.  THE CONSUMER TOOK THE VEHICLE TO THE DEALER FOR INSPECTION.   *AK   THE BOOSTER WAS REPLACED, BUT NOTHING CHANGED.  THE CONSUMER TRIED OTHER VEHICLES AT TWO DIFFERENT DEALERS AND THE VEHICLE DISPLAYED THE SAME PROBLEM.  AS SOON AS ONE APPLIED THE BRAKES, THEY WOULD LOCK UP AND THERE WOULD BE NO FRICTION TO TURN THE WHEELS ON AND THE COMPUTER WOULD THINK THAT THE VEHICLE WAS STOPPED.   *SC",
        "vin": "1FDXX47F12E"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "02/26/2004",
        "dateOfIncident": "01/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059030,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVING BEEN A DRIVER OF LIMOUSINE COACHES FOR A NUMBER OF YEARS, I QUESTION THE SAFETY OF THE PERIMITER SEATING ARRANGEMENT IN THIS TYPE OF VEHICLE.  I FEEL THAT IN THE EVENT OF AN EMERGENCY STOP OR A CRASH, NUMEROUS INJURIES COULD RESULT.  THIS TYPE OF VEHICLE IS USED EXTENSIVLY WHERE ALCOHOL IS A FACTOR AND PEOPLE ARE RELAXED AN NOT TOO CONCERNED ABOUT PERSONAL SAFETY.  IF FEEL THAT A FORWARD SEATING ARRANGEMENT IS MUCH SAFER AND THIS TYPE OF SEATING SHOULD BE MADE MANDATORY ON ALL LIMO COACHES.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/05/2004",
        "dateOfIncident": "12/18/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057577,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT AN UNDETERMINED SPEED THE VEHICLE STALLED.  THE CONSUMER TOOK THE VEHICLE TO A MECHANIC.   *NM",
        "vin": "FILLIN"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/04/2003",
        "dateOfIncident": "07/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030791,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF CLUTCH MASTER CYLINDER AND SLAVE CYLINDER. REPEATED PROBLEM. VEHICLE LOOSES ALL CLUTCH CONTROL, CAUSING UNCONTROLLED MOVEMENT WHILE ATTEMPTING TO GET THE ENGINE TO STALL. ALMOST CRASHED INTO INNOCENT VEHICLE.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020573,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-450 SD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT GAS TANK IS FRACTURED CAUSING FUEL TO LEAK LARGE AMOUNTS ONTO THE GROUND.  THE VEHICLE SHOWS NO WARNING.  DEALER IS AWARE. PLEASE PROVIDE MORE INFORMATION.    MR",
        "vin": "1FDX47F81EC"
    }
]