[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/23/2008",
        "dateOfIncident": "07/23/2008",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235434,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE FROM FOREST RIVER, WHO IS THE MANUFACTURER OF MY TRAVEL TRAILER THAT DOMETIC HAS FOUND A PROBLEM WITH THE REFRIGERATOR IN MY TRAILER AND THAT THERE IS A POTENTIAL LEAK THAT CAN DEVELOP AND CAUSE A FIRE.  AFTER CONTACTING DOMETIC AND FINDING OUT THAT MY UNIT IS ONE OF THE RECALL UNITS THEY INFORMED ME THAT I HAD TO TAKE IT TO THE DEALER TO GET IT FIXED.  IT IS A LONG WAY TO THE DEALER OR THE NEAREST DEALER AND I TOLD THEM I WOULD PREFER FOR THEM TO COME OUT AND FIX IT AT MY RESIDENCE.  I KNOW THEY HAVE DONE MOBILE REPAIRS AT OTHER LOCATIONS AND IT WOULD REQUIRE ME TO MAKE TWO TRIPS TO A DEALER TO GET IT FIXED AS I WOULD HAVE TO DROP IT AT NIGHT THEN COME BACK AFTER THE REPAIR IS DONE.  AT FIRST THEY SAID THEY WOULD COME AND FIX IT AND THEN THEY CHANGED THEIR MIND AND SAID NO, THAT I HAD TO TAKE IT TO THE DEALER.  AGAIN I WOULD HAVE TO SPEND A LOT OF MONEY TO TAKE IT TO A DEALER AND ALSO TAKE TIME OFF FROM WORK.  I DON'T FEEL I SHOULD HAVE TO SINCE I AM NOT THE ONE WHO BUILT DEFECTIVE EQUIPMENT.  *TR",
        "vin": "4X4TSAG262A"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/27/2005",
        "dateOfIncident": "07/07/2005",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130361,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "CARLISLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WE TOOK OUR VACATION THIS YEAR AND WENT TO CANADA.  WHEN I SET UP OUR CAMPER, I NOTICED WE HAD A TIRE WITH A BULGE IN THE SIDE WALL.  WE DID FIND A DEALER IN CANADA THAT HANDEDE THESE TIRES AND GOT IT REPLACED.  THE DEALER TOLD US THAT CARLSLILE HAD LOTS OF PROBLEMS WITH THE TIRES WE HAD ON OUR CAMPER. SO THEY REPLACED THE BAD ONE, FOR A CHARGE.   WHILE WE WERE ON THE WAY HOME WE HAD A DIFFERENT TIRE SEPERATE BLOW OUT CAUSING OVER $1500.00 IN DAMAGE TO OUR CAMPER, AND ALMOST PUT US IN THE DITCH ALL TOGATHER.  WHEN WE CALLED IN FOR OUR ROAD HAZARD POLICY, THEY SUGGESTED WE REMOVE ALL THE CARLISLE TIRES DUE TO MANY ISSUES SIMILAR AS OURS.  I CONTACTED CARLISLE TIRE TO SEE IF THEY WOULD DO SOMETHING FOR US, AND I WAS TOLD THEY ONLY OFFER A 2 YEAR WARRANTEE ON THEIR TIRES FROM THE DATE OF MANUFACTURE, AND COULD NOT HELP ME.  THE PROBLEM I HAVE WITH THIS IS THAT WHEN WE PURCHASED OUR BRAND NEW CAMPR IN JULY 2001 THE TIRES WERE ALREADY 20 MONTHS OLD.  THIS MEANS THAT THEY ARE KNOWINGLY PUTTING UNSAFE TIRES ON RV TRAILERS THAT THEY DONT HAVE TO DEAL WITH.  I FEEL THIS IS WRONG TO ALLOW THIS AND FEEL THERE SHOULD BE A RECALL ON ALL OF THE 225X75X15 TIRES, AND THEY SHOULD BE HELD RESPONSIBLE FOR ANY AND ALL DAMAGES, NOT OUR INSURANCE COMPANY AND MYSELF.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/21/2005",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126162,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "CARLISLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "RETURNING HOME FROM NEW HAMPSHIRE VACATION AND WAS TRAVELING APPROX. 60 MPH WHEN WE HEARD A LOUD THUD AND LOOKED IN THE SIDE MIRROR AND SAW THAT THE RIGHT FRONT TIRE CAP BLEW OFF THE TIRE AND RIPPED OFF  OUR FOREST RIVER 36CKSS 5TH WHEEL TRAVEL TRAILERS FENDER SKIRT AND DAMAGED THE UNDERCARRIAGE OF TRAILER.  ALL 4 TIRES PLUS THE SPARE WERE NEW ON OUR 2002 TRAVEL TRAILER, THEY HAD LESS THAN 5000 MILES ON THEM.  THIS TIRE THAT BLEW NEVER WENT FLAT. THIS IS ONLY THE 2ND TRIP THIS CAMPER MADE SINCE NEW. TIRE MODEL INFORMATION:  CARLISLE ALL COUNTRY RADIAL A/S, LT235/85R16 , DOT HN13001 AD4L  WE ARE IN THE PROCESS OF CONTACTING THE MANUFACTURER CARLISLE TIRE TO SEE WHAT THEY WILL DO FOR US.  IT SEEMS THAT AFTER RESEARCHING THIS TIRE COMPANY, THEY HAVE FAR TOO MANY ISSUES WITH THEIR TIRES BLOWING APART THAT SOMEONE NEEDS TO MAKE THEM ACCOUNTABLE.  THERE WERE NO INJURIES THIS TIME, THANK GOD, JUST A GOOD BIT OF DAMAGE TO THE TRAILER WHICH I AM SURE I WILL GET NO REIMBURSEMENT FOR.  I DON'T REALLY WANT TO REPLACE THIS TIRE WITH ANOTHER OF THEIRS.  I THINK THEY KNOW THEY HAVE A PROBLEM AND WE AS CONSUMERS SHOULD BE REIMBURSED FOR THE COST OF THOSE TIRES SO THAT WE MAY MAKE THE DECISION OF PURCHASING A MORE RELIABLE TIRE.",
        "vin": "4X4FASM282A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/31/2005",
        "dateOfIncident": "02/20/2005",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116178,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM A TRIP IN THE MOJAVE DESERT AND STOPPED FOR FUEL AT HWY 395 AND HWY 58 INTERSECTION.  I NOTICED THAT ONE OF MY TRAILER TIRES HAD NO TREAD LEFT ON IT AND THAT THE OTHER ONE WAS STARTING TO WEAR VERY BADLY ON THE OUTSIDE EDGE.  IT WAS THE RIGHT REAR TIRE THAT LOST ITS TREAD AND WAS LOOSING AIR AND IT WAS PUTTING EXCESSIVE STRESS ON THE ONE GOOD TIRE.  IT CAUSED EXCESSIVE WEAR ON THE GOOD TIRE.  I REPLACED THE BAD TIRE WITH THE SPARE AND MADE IT HOME WITHOUT INCIDENT.      AFTER SOME RESEARCH, I FOUND THAT THE TRAILER MANUFACTURE, FOREST RIVER, WAS AWARE THAT THE AXLES THEY PUT UNDER MY TRAILER WERE NOT SUFFICENT ENOUGH FOR A FULLY LOADED TRAILER.  I WAS TOLD BY THEIR CUSTOMER SERVICE DEPARTMENT THAT THEY DID NOT HAVE A RECALL ON IT BUT THAT THEY WOULD REPLACE THE AXLES WITH A HEAVIER PAYLOAD AXLE FOR $500.      THE SAME MODEL OF MY TRAILER NOW COMES STANDARD WITH THESE HEAVIER AXLES AS STANDARD EQUIPMENT.    THE MODEL OF MY TRAILER, WHICH IS A 37' SIERRA, WAS NOT LISTED SO I USED ONE THAT THE MANUFACTURE MAKES UNDER A DIFFERENT NAME.",
        "vin": "4X4FSEN222C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/27/2004",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Forest River, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082799,
        "products": [
            {
                "manufacturer": "Forest River, Inc.",
                "productMake": "FOREST RIVER",
                "productModel": "WILDWOOD",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "CARLISLE TIRE & RUBBER CO",
                "productMake": "CARLISLE",
                "productModel": "CARLISLE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BLEW CARLISLE 225X75X15 LOAD RANGE \"D\" TIRE AND DAMAGED MY TRAILER. I PAID FOR A REPLACEMENT TIRE, AND DID NOT SEEK A REPLACEMENT FROM CARLISLE BECAUSE THE TIRE WAS COMPLETELY DESTROYED. WHILE AT THE TRAILER DEALER GETTING A BID ON REPAIRS I FOUND ANOTHER TIRE WITH A SEPARATION. I SENT THIS BACK TO CARLISLE AND THEY SENT ME A NEW ONE. WHILE AT A TIRE DEALER HAVING A DIFFERENT BRAND PUT ON WE FOUND ANOTHER TIRE WITH A SEPERATION. I SENT THIS ONE BACK AND AM WAITING A NEW REPLACEMENT. THAT IS 3 OF 4 THAT WERE ON THE GROUND THAT SEPARATED. THERE ARE A LOT OF PEOPLE THAT ARE HAVING PROBLEMS WITH THIS BRAND AND NO OTHER. I THINK SOMEONE NEEDS TO LOOK ATTHE  PERCENTAGE OF FAILURES TO SEE IF THEY ARE IN LINE WITH INDUSTRY AVERAGES. THANKS. FRANK BLUM .  *AK",
        "vin": "4X4FWCC272V"
    }
]