[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/20/2013",
        "dateOfIncident": "09/17/2003",
        "fire": false,
        "manufacturer": "FOUR WINDS INTERNATIONAL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544571,
        "products": [
            {
                "manufacturer": "FOUR WINDS INTERNATIONAL",
                "productMake": "FOUR WINDS",
                "productModel": "HURRICANE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AT ABOUT 16,000 MILES THE BRAKE PEDAL BEGAN STICKING DOWN AND HAD TO BE PULLED BACK WITH MY FOOT RESULTING IN EXCESSIVE BRAKE PEDAL TRAVEL. AFTER HAVING TWO LEAKING PRESSURE SWITCHES REPLACED, THREE MASTER CYLINDERS INSTALLED AND THE BRAKES COMPLETELY REBUILT TWICE. THE PROBLEM NOW AT 134,000 MILES WAS FOUND TO BE  THE ABS MODULE AND VALVE KEEPING EXCESSIVE PRESSURE IN THE SYSTEM AND NOT ALLOWING THE PEDAL TO RETURN PROPERLY THUS CAUSING EXCESSIVE HEAT BUILDUP REQUIRING REPLACEMENT OF ROTORS, CALIPERS AND PADS ON ALL FOUR WHEELS TWICE.  *TR",
        "vin": "5B4LP57G623"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/07/2013",
        "dateOfIncident": "04/28/2013",
        "fire": true,
        "manufacturer": "FOUR WINDS INTERNATIONAL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511005,
        "products": [
            {
                "manufacturer": "FOUR WINDS INTERNATIONAL",
                "productMake": "FOUR WINDS",
                "productModel": "HURRICANE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "SAMSUNG ELECTRONICS CO., LTD",
                "productMake": "SAMSUNG MICROWAVE",
                "productModel": "MR5493G",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "MICROWAVE, SAMSUNG MR5493G, BEGAN OPERATION BY ITSELF AND STARTED A FIRE. THE MICROWAVE IS DAMAGED BEYOND REPAIR. THE COACH FILLED WITH SMOKE. I HAVE CONTACTED SAMSUNG ABOUT NHTSA CAMPAIGN NUMBER 03E044000. IT TOOK SEVERAL CALLS TO GET THEM TO AGREE TO REPLACE THE UNIT. THEY OFFERED $200. TRANS 4119069438. THE COACH WAS SMOKE DAMAGED. I AM GETTING AN ESTIMATE TO REMOVE THE SMOKE DAMAGE. SAMSUNG AGREED TO PAY FOR THE SMOKE DAMAGE, TRANS 5105693753. I WAS CALLED, A VOICE MAIL LEFT AND SENT AN -EMAIL WITH INSTRUCTIONS ON HOW TO OBTAIN THE $200. I WAS THEN CALLED THE NEXT DAY AS IF THEY NEEDED TO GET A HOLD OF ME URGENTLY. ANOTHER VOICE MAIL WAS LEFT. I WAS TOLD I HAD 3 DAYS TO SEND IN THE PAPERWORK SENT IN THE E-MAIL OR LOSE THE OPPORTUNITY TO HAVE THE MICROWAVE RECALLED. THE E-MAIL SAID I HAD 2 WEEKS. I NEED TO WAIT FOR THE SMOKE DAMAGE ESTIMATE, WHICH SHOULD BE AT THE 3 DAY MARK. I FEEL SAMSUNG IS TRYING TO AVOID PAYING FOR ANY DAMAGES OR RECALL THIS MICROWAVE. I FELT I NEEDED TO REPORT THE INCIDENT AND SAMSUNG'S POOR HANDLING OF THIS RECALL. I WOULD LIKE TO KNOW WHAT SAMSUNG'S RESPONSIBILITY IN THIS RECALL IS. I HAVE OWNED THIS VEHICLE FOR 3 YEARS AND I WAS NEVER NOTIFIED OF THE RECALL.  *TR",
        "vin": "5B4KP57G313"
    }
]