[
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/10/2018",
        "dateOfIncident": "04/09/2018",
        "fire": true,
        "manufacturer": "Glendale Recreational Vehicles",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084385,
        "products": [
            {
                "manufacturer": "Glendale Recreational Vehicles",
                "productMake": "GLENDALE",
                "productModel": "TITANIUM",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2002 GLENDALE TITANIUM FIFTH WHEEL CAMPER. WHILE THE CAMPER WAS PARKED AT AN RV CAMPSITE, ONE OF THE CAMPSITE SUPERVISORS ALERTED THE CONTACT THAT THE CAMPER WAS ON FIRE. THE CONTACT COULD NOT ENTER THE CAMPER BECAUSE IT WAS ALREADY ENGULFED IN FLAMES. THE FIRE AND POLICE DEPARTMENTS ARRIVED AT THE SCENE. A POLICE REPORT WAS FILED AND THERE WERE NO INJURIES. THE FIRE DEPARTMENT DETERMINED THAT IT WAS AN ELECTRICAL FIRE. THE CONTACT ALSO MENTIONED NHTSA CAMPAIGN NUMBER: 07V273000 (EQUIPMENT) ISSUED BY THE MANUFACTURER ON CERTAIN RECREATIONAL VEHICLES EQUIPPED WITH A TWO DOOR REFRIGERATOR MANUFACTURED BY DOMETIC CORPORATION. THE RECALL STATED THAT THERE MAY BE A DEFECT IN THE BOILER TUBE AND PRESSURIZED COOLANT SOLUTION COULD BE RELEASED INTO AN AREA WHERE AN IGNITION SOURCE (GAS FLAME) WAS PRESENT, WHICH COULD LEAD TO A FIRE. THE CONTACT STATED THAT SHE DID NOT RECEIVE A RECALL NOTIFICATION. THE CAMPER WAS DESTROYED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE VIN WAS NOT AVAILABLE. THERE WAS NO MILEAGE. *TT  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/10/2007",
        "dateOfIncident": "09/17/2007",
        "fire": false,
        "manufacturer": "Glendale Recreational Vehicles",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211346,
        "products": [
            {
                "manufacturer": "Glendale Recreational Vehicles",
                "productMake": "GLENDALE",
                "productModel": "TITANIUM",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2001 GLENDALE TITANIUM.  THE VEHICLE HAS A DOMETIC, MODEL NUMBER RM3862.  THE CONTACT RECEIVED A DOMETIC RECALL NOTICE AND HAD THE REFRIGERATOR REPAIRED IN A TIMELY MANNER.  HE NOTICED THAT THE GAS VALVE WAS COVERED BY A PLATE THAT DOES NOT ALLOW THE GAS TO BE TURNED OFF, WHICH THE NOTICE INDICATED AS DANGEROUS.  IN THE EVENT THAT THERE IS A LEAKAGE, A SERIOUS EXPLOSION COULD OCCUR.  THE DOMETIC HAS NOT CAUGHT FIRE AS OF YET, BUT THE CONTACT BELIEVES THAT IT SHOULD HAVE MORE VENTILATION.   UPDATED 01-10-08.  *KB  UPDATED 12/31/07. *JB",
        "vin": "2GRTV31T62S"
    }
]