[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/26/2002",
        "dateOfIncident": "10/15/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 768935,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GEO",
                "productModel": "TRACKER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS STRUCK FROM REAR AT 45-55 MPH WHILE STOPPED AT A LIGHT, KNOCKED CAR DIRECTLY INTO CAR AHEAD. MINI-COOPER COLLAPASED IN BOTH FRONT AND REAR. DRIVER THROW INTO STREERING WHEEL AND WINDSHIELD. NO DOUBT FRONT AIR BAGS SHOULD HAVE DEPLOYED. CAR HAD BEEN INTO DEALER TWICE IN LAST 3 MONTHS WITH A COMPLAINT THAT THE AIR BAG INDICATOR LIGHT WAS STAYING ON. VEHICLE IS TOTALLED, DRIVER (MY SON) INJURIED. WE HAVE CONTACTED BMW AND THEY SAY THEY WILL SEND OUT SOMEONE SOON TO REVIEW. WE HAVE SECURED THE VEHICLE BECAUSE WE BELIEVE THAT THERE WAS A DEFECT THAT IS DIRECTLY RELATED TO THE INJURIES SUSTAINED BY MY SON. HIS FACIAL/NECK INJURIES WOULD MOST LIKELY HAVE BEEN NOMINAL AT BEST HAD THE AIR BAGS PROPERLY DEPLOYED. WE BELIEVE THAT THIS VEHICLE BEING AS NEW AS IT IS MAY NOT HAVE ALL ITS BUGS IRONED OUT. WE HAVE HAD SEVERAL BODY SHOPS AND AUTO PEOPLE LOOK AT THEY VEHICLE AND EACH ONE HAD INDEPENDENTLY EXPRESSED THE OPINION THAT THE DAMAGE THIS VEHICLE SUSTAINED COULD CAUSE AN AIRBAG DEPLOYMENT. IN REVIEWING THE WEBSITE FOR MINI-COOPER IT GOES INTO GREAT DETAIL ABOUT ITS SAFETY WITH AIRBAGS AND SHOWS THE SENSOR AREAS THAT IT PROTECTS. THOSE AREAS ARE WHERE THIS VEHICLE SUSTAINED THE DAMAGE. WE PURCHASED THIS VEHICLE FOR OUR 18 YEAR OLD FOR SEVERAL REASONS AND PERHAPS THE MOST SWAYING WAS THE SAFETY REPRESENTED TO US BY BMW. WE RESEARCHED THIS VEHICLE BEFORE PURCHASING IT AND IT DID NOT DO WHAT IT WAS REPRESENT TO US. HOPEFULLY OURS IS AN ISOLATED INCIDENT BUT WE WOULD LIKE TO DOCUMENT OUR EXPERIENCE AND IF IT IS A PROBLEM OTHERS SHOULD BE MADE AWARE.",
        "vin": "WMWRE33402T"
    }
]