[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "04/25/2019",
        "dateOfIncident": "01/01/2017",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11203747,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE CALIPERS FAILED TO RETRACT CAUSING THE PADS TO DRAG ON THE ROTORS CAUSING EXTREME HEAT. THE ROTORS GOT SO HOT THE ANTI LOCK SENSOR MELTED CAUSING ANTI LOCK SYSTEM FAILURE INDICATOR LIGHT TO COME ON. THE ROTORS ARE NOTICEABLY OVERHEATED AND VERY SPLOTCHY THEY SHOULD BE POLISHED NOT SPLOTCHY.",
        "vin": "5B4MP67G623"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/10/2011",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381473,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 HOLIDAY RAMBLER VACATIONER.  THE CONTACT STATED THAT THE CALIPERS WERE CAUSING HIS ROTORS AND BRAKE PADS TO WEAR EXCESSIVELY.  THE CONTACT DID NOT INFORM THE MANUFACTURER;HOWEVER, THE VEHICLE HAD BEEN REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 02V278000 ( SERVICE BRAKES, HYDRAULIC FOUNDATION COMPONENTS).  THE CURRENT MILEAGE WAS 37,000 AND THE FAILURE MILEAGES WAS APPROXIMATELY 36,000.",
        "vin": "5B4MP67G823"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/07/2010",
        "dateOfIncident": "08/26/2010",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354194,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 HOLIDAY RAMBLER M/H WITH A VORTEC 8.1 LITER GM ENGINE  THIS VEHICLE GVRW IS 22,000 LBS.  THIS VEHICLE WILL STALL AT FREEWAY SPEEDS OF 55-70 MPH AND ACT AS IF IT IS GETTING NO FUEL, WHEN THAT HAPPENS THERE IS  NO POWER STEERING OR BRAKES.  MANY REPORTS ON THE INTERNET CONCERNING THE SAME PROBLEM STATE THE PROBLEM IS THE CRANK SHAFT SENSER THAT TELLS THE FUEL INJECTION SYSTEM WHEN TO SEND FUEL TO THE CILINDERS.  THIS PROBLEM HAPPENED ONE DAY WHILE EXITING AN INTERSTATE OFF RAMP IN A WINDING CURVE.  IMAGINE TRYING TO ROUND A CURVE AT 20 MPH IN A 22,000 LB VEHICLE WITH NOT POWER STEARING OR POWER BRAKES, AND A BIG DROP OFF, IS ON THE OUTSIDE OF THE CURVE.  IT TOOK ALL THE STRENGH I HAVE TO KEEP THE VEHICLE TRACKING IN THE RIGHT DIRECTION AND I' AM A 5'10 210 POUND MAN.  IF MY WIFE HAD BEEN DRIVING THERE WOULD HAVE BEEN AN ACCIDENT.  FROM THE NUMBER OF LIKE REPORTS ON THE INTERNET IT IS CLEAR THIS IS A COMMON DEFECT WITH THIS ENGINE IN THE PICK-UPS, IF THIS RESULTS IN AN ACCIDENT BEFORE I CAN CORRECT IT, I WILL BE LOOKING FOR SOMEONE TO SUE! *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/06/2010",
        "dateOfIncident": "08/31/2008",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347765,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 MONACO HOLIDAY VACATIONER RV, EQUIPPED WITH A WORKHORSE W22. THE CONTACT STATED HE RECEIVED THREE DIFFERENT UNKNOWN RECALL NOTICES INDICATING A DIFFERENT TIME FRAME FOR THE BRAKE CALIPER REMEDY FROM WORKHORSE. EACH TIME THE NOTICES WERE RECEIVED, THE MANUFACTURER WAS CONTACTED AND THE CONTACT WAS ADVISED THAT THE PARTS NEEDED TO MAKE REPAIRS WERE NOT YET AVAILABLE. HE WAS ALSO ADVISED THAT THE PARTS SHOULD BE AVAILABLE WITHIN THE COMING MONTHS. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 36,000.",
        "vin": "5B4MP67GX23"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/10/2010",
        "dateOfIncident": "06/11/2008",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329713,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 HOLIDAY RAMBLER VACATIONER RV. THE  CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID 03V068000 (SERVICE BRAKES, HYDRAULIC: SWITCHES: BRAKE WARNING). PRIOR TO RECEIVING THE RECALL LETTER, THE CONTACT EXPERIENCED BRAKE FAILURE. THE DEALER WAS CONTACTED AND ADVISED THE CONTACT THAT A REMEDY FOR THE RECALL WAS NOT YET AVAILABLE.  THE VIN, CURRENT AND FAILURE MILEAGES WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/24/2010",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321710,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 HOLIDAY RAMBLER VACATIONER RV. WHILE DRIVING AT SPEEDS OF 25 MPH, THE BRAKE WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT ALSO CONFIRMED THAT THE ROTORS WERE CRACKED AND THE CALIPERS WERE STICKING. THE VEHICLE WAS REPAIRED BY AN INDEPENDENT MECHANIC AT THE OWNERS EXPENSE. THE FAILURE OCCURRED A TWICE. THE CONTACT WAS ADVISED BY THE MANUFACTURER THAT THERE WAS A RELATED RECALL ON THE VEHICLE. THE CONTACT RECEIVED A PARTIAL REIMBURSEMENT FOR THE PREVIOUS REPAIRS MADE BY THE INDEPENDENT MECHANIC FROM THE MANUFACTURER. HE CONTINUED TO CONTACT THE MANUFACTURER TO HAVE THE RECALL REPAIRS MADE ON THE VEHICLE; HOWEVER, WAS ADVISED THAT THE DATABASE INDICATED THAT THE RECALLS WERE CLOSED ON HIS PARTICULAR VEHICLE (NHTSA CAMPAIGN ID NUMBER 02V278000: SERVICE BRAKES, HYDRAULIC: FOUNDATION COMPONENTS). THE APPROXIMATE FAILURE MILEAGE WAS 65,000 AND THE CURRENT MILEAGE WAS 109,000.",
        "vin": "5B4MP67G423"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/23/2009",
        "dateOfIncident": "08/02/2002",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256116,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 HOLIDAY RAMBLER VACATIONER ON A WORKHORSE CHASSIS.  WHILE DRIVING LESS THAN 55 MPH, THE BRAKES FAILED.  THE VEHICLE HAS BEEN REPAIRED THREE TIMES, BUT THE FAILURE STILL PERSISTS.  THE MANUFACTURER ASSUMED RESPONSIBILITY FOR THE FIRST TWO REPAIRS, BUT WILL NO LONGER BECAUSE THERE ARE NO RECALLS LISTED FOR THE FAILED COMPONENT.  THE FAILURE MILEAGE WAS 842 AND CURRENT MILEAGE WAS 29,796.",
        "vin": "5B4MP67G423"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/05/2008",
        "dateOfIncident": "08/31/2008",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241015,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 02 HOLIDAY RAMBLER VACATIONEER MOTORHOME WITH A WORKHORSE CHASSIS. I RECEIVED A RECALL NOTICE FOR BRAKE REPLACEMENT ISSUES AND BROUGHT THE RV IN FOR THE RECALL TO A DEALER IN LOUISIANA. THEY KEPT THE RV APPROXIMATELY 3 WEEKS, SAID IT WAS FIXED AND I WENT AND PICKED IT UP. ON THE WAY HOME THE ABS LIGHT CAME ON I CALLED THEM AND SINCE I WAS ABOUT 80 MILES FORM THE PLACE PROCEEDED HOME WHICH WAS ABOUT 30 MORE MILES, THEY SAID THEY DID NOT HAVE A MACHINE TO TURN THE LIGHT OFF. I THEN TRIED TO FIND SOMEONE WHO COULD TO THIS TO NO AVAIL AND IT IS STILL ON SOMEONE TOLD ME I HAD TO BUY A NEW WIRE FOR THE WHEEL. WE HAVE TRIED TO TAKE SEVERAL TRIPS AND EVERYTIME WE TRY THE FRONT CALIPERS GET SO HOT THEY LOCK UP AND WE HAVE TO STOP AND STAY SOMEPLACE FOR OVERNIGHT AND THEN THEY ARE OK FOR A WHILE. WE WENT TO BRANSON, MISSOURI AND ALMOST HAD A FIRE ON BOARD DUE TO BRAKE HEATUP. I HAVE HAD NUMEROUS PROBLEMS WITH THIS AND CANNOT FIND ANYONE WHO WILL WORK ON MY RV AND FIX THE PROBLEM. I WROTE A LETTER TO MONOCO HOLIDAY RAMBLER AND GOT LITTLE RESPONSE. I LEFT LAST WEEK TO FLEE THE COMING HURRICANE GUSTAV AND DIDN'T GET OUT OF TOWN WHEN THE BRAKES LOCKED UP AND WE HAD TO COME BACK HOME AND RIDE OUT THE STORM IN OUR HOUSE. I AM SO FRUSTRATED ABOUT THIS, I HAVE BOUGHT AN EXTENDED WARRANTY AND WOULD LIKE TO FIND A SHOP TO FIX THE PROBLEM BEFORE THE WARRANTY RUNS OUT. I FEEL IF SOMETHING IS NOT DONE THE MOTORHOME WILL CATCH FIRE EVENTUALLY. I LEAVE THE MOTORHOME ON THE JACKSTANDS AND ROTATE THE WHEELS EVERY WEEK WHICH I FEEL WOULD HELP BUT IT DOESN'T. THE DEALER I BROUGHT IT TO FOR THE RECALL HAS WENT OUT OF BUSINESS SINCE THE REPAIR AND I DON'T KNOW WHAT TO DO NOW. THE DEALER I BOUGHT THE RV FROM HAS A PLACE TO WORK ON THEIRS BUT ITS 250 MILES AWAY AND I JUST DON'T TRUST THE RV TO MAKE THE TRIP.  *TR",
        "vin": "5B4MP67G023"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/12/2007",
        "dateOfIncident": "11/18/2004",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203730,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 HOLIDAY RAMBLER FAILURE OF THE BRAKE SYSTEM. CUSTOMER STATES THAT HE HAS HAD 2 OTHER FAILURES WITH THE BRAKE SYSTEM. THE LATEST FAILURE WAS A COMPLETE FAILURE. CUSTOMER BELIEVES MANUFACTURER SHOULD PAY FOR REPAIRS.  *KB  THE CONSUMER STATED AFTER THE RECALL WORK WAS PERFORMED ON THE CALIPERS, THE RV HAS BEEN IN THE SHOP 3 TIMES FOR BRAKE FAILURES.  *JB",
        "vin": "5B4MP67G623"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2006",
        "dateOfIncident": "03/26/2005",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168101,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 HOLIDAY RAMBLER MOTORHOME - FRAME FAILURE WHERE TOW RECEIVER HITCH ATTACHES TO EXTENDED CHASSIS FRAME. THIS FAILURE OCCURRED WHILE TOWING AN ENCLOSED TRAILER WHICH MET ALL WEIGHT SPECIFICATIONS OF RV MANUFACTURER.    *JB",
        "vin": "5B4MP67G923"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/27/2006",
        "dateOfIncident": "01/28/2006",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154113,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FAX FM (CA) RE THEIR DEFECTIVE MONACO TOW VEHICLE WHICH TORE AWAY FM THE FRAME OF THEIR VEHICLE.  *TS   THE TOW RECEIVER WAS MOUNTED TO THE FRAME OF THE VEHICLE. *JB  THE TOW RECEIVER WAS MOUNTED BY MONACO AND IT TORE AWAY ON BOTH SIDES.  WHEN IT BROKE THE CONSUMER HEARD A NOISE AND STOPPED FINDING THE TOW ON THE GROUND.  THE CONSUMER CONTACTED THE MANUFACTURER AND WAS INFORMED THAT SINCE THE VEHICLE WAS OUT OF WARRANTY THAT THERE WAS NOTHING THEY COULD DO.  *NM",
        "vin": "5B4MP67G323"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "01/28/2006",
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149555,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING AT 5 MPH A CRACKING NOISE WAS HEARD COMING FROM THE REAR END.  THE VEHICLE WAS PULLED TO THE SIDE OF THE ROAD FOR INSPECTION.  THE CONTACT IDENTIFIED A RIP IN THE FRAME WHERE THE TOW BAR WAS ATTACHED TO THE FRAME.  THE VEHICLE THAT WAS BEING TOWED WAS IN THE PROCESS OF BECOMING DETACHED FROM THE MOTOR HOME.  THE VEHICLE WAS TOWED TO A LOCAL DEALERSHIP FOR INSPECTION.  THE MANUFACTURER WAS ALERTED.  UPDATED 3/28/2006 - THE TOW RECEIVER WAS MOUNTED TO THE FRAME  BY MONACO AND IT TORE AWAY ON BOTH SIDES.  *NM",
        "vin": "5B4MP67G323"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/27/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "MONACO COACH CORPORATION",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001605,
        "products": [
            {
                "manufacturer": "MONACO COACH CORPORATION",
                "productMake": "HOLIDAY RAMBLER",
                "productModel": "VACATIONER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN SIGNAL STOPPED WORKING PROPERLY. TURN SIGNAL WOULD REMAIN ON AND NOT RELEASE AFTER MAKING COMPLETE TURN. THIS WOULD ALSO HAPPEN WHEN MAKING A LEFT TURN. WOULD GIVE FALSE IMPRESSION TO VEHICLES IN THE REAR. TS",
        "vin": "5B4MP67G923"
    }
]