[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/28/2021",
        "dateOfIncident": "11/20/2020",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390502,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT THERE WERE HOLES FROM CORROSION DUE TO SUB-FRAME RUST. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH NEEDING THE SUB-FRAME TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED AS OF YET. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 09V183000 (SUSPENSION) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 160,000.",
        "vin": "KNAGD126125"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/23/2019",
        "dateOfIncident": "10/03/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11270423,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT ALL OF SUDDEN,AFTER JUST STARTING UP",
        "vin": "KNAGD126025"
    },
    {
        "components": "SUSPENSION,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/11/2019",
        "dateOfIncident": "10/07/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11267968,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER A WEEKS TIME,I NOTICED MY STEERING WHEEL WAS TURNED LIKE MAYBE I NEEDED AN ALIGNMENT AND IT STARTED PULLING TO THE LEFT SO BAD THAT I HAD TO FORCE THE STEERING WHEEL TO THE RIGHT SO I WOULDN'T WRECK INTO THE MEDIAN ON THE INTERSTATE. I COULD ONLY GO ABOUT 45 OR 50 MPH OR IT WOULD START SHAKING THE ENTIRE CAR AND WAS ABSOLUTELY IMPOSSIBLE TO CONTROL IT ON THE ROAD. HAD IT LOOKED AT AND AT THE BOTTOM CONTROL ARM THAT BOLTS TO THE SUBFRAME HAD RUSTED OUT AND THE RIGHT SIDE WAS ON THE VERGE OF DOING THE SAME! THE FL AND FR TIRES, THAT I HAD GOTTEN BRAND NEW 5 MONTHS AGO,  WERE WORE DOWN TO THE WIRE!!! I'M SURPRISED I HAD THE CHANCE TO GET IT HOME AND GET IT LOOKED AT BEFORE IT RUSTED ALL THE WAY THROUGH! I WAS SO BLESSED I DIDNT HAVE A HORRIBLE ACCIDENT.",
        "vin": "KNAGD126125"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/23/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11035830,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2002 KIA OPTIMA. WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE HYDROPLANED AND CRASHED INTO A TREE. THE AIR BAGS FAILED TO DEPLOY. THERE WERE NO INJURIES AND A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED. THE DEALER WAS NOT CONTACTED AND THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 219,000.",
        "vin": "KNAGD128X25"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899360,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. WHILE DRIVING APPROXIMATELY 10 MPH AND MAKING A LEFT TURN, THE FRONT DRIVER SIDE CONTROL ARM, TIE ROD, AND CV AXLE FRACTURED. THE VEHICLE WAS DIAGNOSED BY AN INDEPENDENT MECHANIC AND THE CONTACT WAS INFORMED THAT THE SUBFRAME NEEDED TO BE REPLACED ALONG WITH THE DRIVER SIDE CONTROL ARM, TIE ROD, AND CV AXLE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V183000 (SUSPENSION). THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS APPROXIMATELY 133,313.",
        "vin": "KNAGD128925"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/20/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897840,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 16 YEAR OLD JUST PURCHASED A 2002 KIA OPTIMA SEDAN ON SATURDAY 8/20/2016 FROM A USED CAR DEALERSHIP. VERY FIRST CAR, HIS OWN EARNED SAVINGS.   UPON FINALIZING THE PAPERWORK, WE LITERALLY WALKED OUT THE DOOR & IMMEDIATELY WERE UNABLE TO UNLOCK HIS DRIVER'S DOOR WITH THE KEY FOB. THE CAR WAS STATIONARY, NOT RUNNING,  PARKED IN ALL INSTANCES IN REGARDS TO THIS COMPLAINT.   COINCIDENTALLY, IT WORKED PERFECT FOR OUR TEST DRIVE. I DO ALSO HAVE SIGNED DOCUMENTATION STATING THE CAR LOT DOES NOTHING TO THE CAR ELECTRONICALLY, MECHANICALLY OR OTHERWISE AS WELL IF NEEDED.   I WAS HOPEFUL IT WAS THE KEY FOB BATTERY, BUT IT'S BEEN REPLACED & STILL NOT WORKING. WE'VE HAD THE SAME ISSUE WITH ALL THE LOCKS SINCE & NO SUCCESS TO UNLOCK WHEN NEEDED.    HE USES THE DRIVER'S SIDE THE VAST MAJORITY OF THE TIME, BUT ALL WITHOUT WARNING WILL NOT LOCK OR UNLOCK WITH NO RHYME OR REASON. HE'S HAD TO CRAWL OVER FROM THE PASSENGER SIDE TO GET IN EVERY TIME.   MY NIGHTMARE AS ANY PARENTS IS GOD FORBID A FIRE START OR HE ACCIDENTALLY GOES INTO A BODY OF WATER & IS TRAPPED. I REALIZE IT'S AN OLDER CAR BOUGHT USED, BUT I SEE THERE ARE DOZENS OF COMPLAINTS ABOUT THE LOCKS, NOT JUST ON YOUR SITE. EVEN A CLASS ACTION LAWSUIT THAT WAS MYSTERIOUSLY \"VOLUNTARILY DISMISSED\" BY THE PLAINTIFF IN 2015. CASE NO. [XXX] FROM WHAT I CAN SEE.   WHERE IS THE RECALL? WHAT DOES IT TAKE TO HAVE ONE ISSUED? WE DON'T HAVE THE FINANCIAL CAPABILITY TO PAY FOR A MANUFACTURER DEFECT THAT IS ALREADY BEEN UNCOVERED YET AMAZINGLY NO ONE IS REQUIRED TO REPAIR? NOR DO I FEEL WE SHOULD HAVE TO.   ANOTHER POINT TO NOTE IS EVERY SINGLE VIN # I'VE SEEN COMPLAINTS ON THIS SITE, ARE IN VERY CLOSE NUMERICAL SUCCESSION WITH OURS. I HAVE TO SAY IT SEEMS VERY UNLIKELY IT'S SHEER COINCIDENCE.   I UNDERSTAND COMPANIES NEED TO GUARD THEIR \"BOTTOM LINE\" BUT WHAT COST?   I SINCERELY APPRECIATE YOUR TIME & FEEDBACK.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNAGD128025"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2016",
        "dateOfIncident": "05/20/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10891838,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA OPTIMA DRIVER DOOR WILL NOT UNLOCK WITH KEYLESS ENTRY OR FROM IN SIDE OF CAR ONLY AFTER LOCKING AND WAITING SEVERAL MINUTES TO HITTING UNLOCK ABOUT 20 TIMES TO GET THE DOOR TO UNLOCK HAVE BEEN LOCKED IN CAR AND CRAWL THREW CAR OR OUT WINDOW. CAR HAS 142000.MILIES",
        "vin": ""
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/11/2016",
        "dateOfIncident": "07/15/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883976,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN A 2002 KIA OPTIMA- FOUND OUT THERE WAS A RECALL- THE RECALL WAS CORRISION TO THE SUBFRAME THAT COULD LEAD TO PROBLEMS WITH THE CONTROL ARM.  I WAS TOLD THAT THE CAR WAS INSPECTED IN 2010 AND THE RECALL WAS TAKEN CARE OF AT THAT TIME.  WE BOUGHT THE CAR FROM A PRIVATE OWNER IN 2014.  2015 WENT TO GET NEW TIRES ON THE CAR AND DISCOUNT TIRE TOLD US THAT THEY COULDN'T DO AN ALIGNMENT BECAUSE THERE IS AN ISSUE WITH THE CONTROL ARM.  WE FOUND OUT TO REPAIR THE CONTROL ARE IT WOULD BE OVER $500.  WHEN I CALLED THE KIA HOTLINE TO INQUIRE ABOUT THE RECALL, I WAS TOLD THAT WE WOULD NEED TO TAKE THE CAR TO A KIA DEALERSHIP TO HAVE THE CAR REVIEWED BY THEIR SERVICE MEN TO SEE IF THERE IS ANY ISSUES WITH THE SUBFRAME AND CONTROL ARM.  I'M CONCERNED MY CONCERN IS NOT GOING TO GET ADRESSED.  7/11/2016 JP",
        "vin": "KNAGD126525"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/12/2016",
        "dateOfIncident": "04/06/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10864683,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. WHILE DRIVING 50 MPH, THE FRONT DRIVER SIDE LOWER SUBFRAME DETACHED DUE TO CORROSION INSIDE THE SUBFRAME. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V183000 (SUSPENSION). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 180,000.",
        "vin": "KNAGD128725"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/11/2016",
        "dateOfIncident": "03/04/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10846221,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST GOT MY 2002 KIA OPTIMA AND IT JUST RECENTLY STARTED HAVING ISSUES. I WAS DRIVING DOWN THE ROAD AND MY CAR STARTED TO SLIGHTLY WANDER TO THE LEFT, I THOUGHT OK.. IT NEEDS AN ALIGNMENT. SO THEN IT STARTED JERKING TO THE RIGHT, SO BAD I GOT PULLED OFF TO THE SIDE OF THE ROAD AND COULDN'T CONTROL IT. I PARKED MY CAR IN A PARKING LOT TIL MY BF COULD COME LOOK AT IT, AND I HAD HIM DRIVE IT HOME AND THE SAME THING HAPPENED TO HIM. HE LOOKED AT EVERY POSSIBILITY AT WHAT IT COULD BE AS HE IS A MECHANIC AND SAID LOWER CONTROL ARM. IT HAS BEEN SITTING IN MY YARD FOR A WEEK. IT IS NOT SAFE TO DRIVE. I FOUND OUT IT HAD A RECALL BACK IN 2009, SO I CALLED MY LOCAL KIA DEALER AND THEY SAID IT WAS PART OF THE RECALL BUT IT HAS BEEN FIXED- I'M WONDERING HOW IT WAS FIXED IF IT IS DOING THE SAME EXACT THING EVERYONE'S COMPLAINTS I HAVE SEEN IS DOING/ I AM AT A HALT NOT KNOWING WHAT TO DO WITH MY CAR, I HAVE SMALL CHILDREN AND REFUSE TO DRIVE THIS CAR. PLEASE HELP",
        "vin": "KNAGD128X25"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/22/2016",
        "dateOfIncident": "01/22/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821768,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. WHILE THE VEHICLE WAS BEING SERVICED, THE MECHANIC NOTICED THAT THE SUBFRAME WAS RUSTED OUT AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "KNAGD128925"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/07/2015",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10780680,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS NOT DIAGNOSED OR  REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "KNAGD128425"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/11/2015",
        "dateOfIncident": "06/24/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10733372,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING UP THE ROAD ,PUT ON BRAKES ,AXLE AND SUBFRAME BROKE CAUSING MY CAR TO SLIDE AND STOP IN MIDDLE OF ROAD.THANK GOD NO ONE HIT US.",
        "vin": "KNAGD128X25"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "03/27/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10704103,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON FREEWAY ENGINE LIGHT CAME ON VEHICLE STOPPED ENGINE SHUT OFF I HAD TO COAST TO SIDE OF ROAD. IT QUIT SHIFTING AFTER IT STALLED. HAD TO BE TOWED HOME. KIA DEALER IN ONTARIO CALIFORNIA CAN'T FIND WHAT IS WRONG THEY WANT ME TO PAY 1600.00 TO CHANGE BATTERY CABLES, BATTERY AND FIX SHIFTER.   *TR",
        "vin": "KNAGD126525"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2015",
        "dateOfIncident": "03/25/2015",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703345,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. AFTER STARTING THE VEHICLE, FLAMES STARTED TO EMIT FROM UNDERNEATH THE HOOD DUE TO THE WIRING NEAR THE STARTER. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 220,000.",
        "vin": "KNAGD128325"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/06/2015",
        "dateOfIncident": "02/05/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681654,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD, STEPPED ON BRAKES AND FRONT FRAME BROKE INTO TWO PIECES, IN THE MIDDLE OF THE ROAD, NEARLY CAUSED A PILE UP ON THE ROAD.  *JS",
        "vin": "KNAGD128425"
    },
    {
        "components": "ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "10/06/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650292,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT THE ACTUATOR DOOR LOCKS FOR THE FRONT DRIVER AND PASSENGER DOORS FAILED. THE CONTACT STATED THAT THE WINDOW WAS USED IN ORDER TO ENTER THE VEHICLE. THE FAILURE OCCURRED ON NUMEROUS OCCASIONS. THE THE FRONT PASSENGER ACTUATOR WAS REPAIRED PREVIOUSLY. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "KNAGD128735"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "06/19/2014",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616047,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A FIRE STARTED INSIDE THE DRIVERS SIDE DOOR PANEL FILLING THE CAR WITH HEAVY BLACK SMOKE MY WIFE OPENED THE DRIVERS SIDE ELECTRIC WINDOW TO GE RID OF THE SMOKE OUT OF THE CAR.  SHE DROVE THE CAR INTO HER BACK YARD AND STARTED SCREAMING FOR HELP SINCE THE DRIVERS SIDE DOOR WOULD NOT OPEN.  HER HUSBAND RAN TO THE BACK YARD AND WAS ABLE TO OPEN THE PASSENGER SIDE DOOR AND SHE HAD TO CLIMB OVER THE GEAR SHIFT  AND THE EMERGENCY BRAKE TO GET OUT OF THE CAR.  SHE WAS ON OXYGEN AT THE TIME.  HER HUSBAND GOT A WATER HOSE AND PUT OUT THE FIRE.  THE INVESTIGATION LED TO THE FIRE STARTING IN A ELECTRICAL ACTUATOR KIA NUMBER ACT \" R ASSY KMC 9530-3C000.  THE DOOR HAD TO BE REPLACED.  I NOTIFIED KIA CORP HEADQUARTERS AT 1-877-220-3189 AND  SENT PICTURES MY CASE # [XXX].  AS OF THIS DATE 07/24/2014 KIA HAS NOT GOT BACK WITH ME.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNAGD128225"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/24/2014",
        "dateOfIncident": "05/01/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605793,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SUBFRAME IS RUSTING OUT AND MY TIRES ARE GETTING ABNORMAL WEAR AND MY FRONT TIRES ARE ANGLED IN.  *TR",
        "vin": "KNAGD126925"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/10/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587615,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TIRE HAD STARTED BENDING INWARD AT THE TOP, AND OUTWARD AT THE BOTTOM. MY CAR STARTED GOING OUT OF ALIGNMENT. I TOOK IT TO A SHOP, AND THEY FOUND OUT MY SUB FRAME WAS RUSTED AND WORN OUT. THEY ALSO FOUND OUT THAT THE SUB FRAME HAD BEEN RECALLED IN 2009, BUT APPARENTLY NOT ON MY EXACT VEHICLE.  *TR",
        "vin": "KNAGD126X25"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/04/2014",
        "dateOfIncident": "03/15/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577438,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT THE VEHICLE FAILED TO DRIVE IN A STRAIGHT LINE. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT REFUSED TO PROVIDE ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 09V183000 (SUSPENSION). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 95,000.",
        "vin": "KNAGD128725"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/14/2014",
        "dateOfIncident": "02/15/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10572509,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DOOR FAILS TO UNLOCK AFTER MULTIPLE ATTEMPTS. DOOR MUST BE UNLOCKED WITH A KEY, USING THE POWER LOCKS OR MANUALLY FLIPPING THE DOOR LOCK DOESN'T DO IT, AND THE KEY ONLY UNLOCKS IT APPROXIMATELY 1 OUT OF EVERY 20 TRIES. THERE ARE MULTIPLE COMPLAINTS ABOUT THIS ONLINE, SEE FOR INSTANCE: HTTP://WWW.KIA-FORUMS.COM/1G-2G-2001-2006-MAGENTIS-OPTIMA/47179-2004-OPTIMA-DOOR-LOCK-FAULT.HTML.  *TR",
        "vin": "KNAGD126025"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/15/2014",
        "dateOfIncident": "02/09/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564475,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A CALL FROM MY 16 YEAR OLD DAUGHTER THAT SHE HAD A FLAT TIRE  ON HER  FRONT DRIVER SIDE.   SHE IS ON THE SIDE OF THE ROAD IN THE DARK AND COLD I GOT DRESSED WENT THERE AND CHANGED IT, SO GO THE NEXT MORNING AND TAKE A LOOK AT IT IN LIGHT WHAT I FOUND IS VERY UPSETTING, THE WHOLE FRAME WHERE LOWER CONTROL (ARM BOLTS ON COMPLETELY RUSTED AWAY. I FOUND OUT THAT AFTER RESEARCH A FACTORY RECALL WAS ON IT, I CALLED AUFFENBURG KIA IN CAPE GIRARDEAU MISSOURI I WAS TOLD THAT THE CAR HAD BEEN RECALLED AND REPAIRED IN 12/28/0 9 AND I  COULD BRING IT THERE BUT THEY ARE NOT GOING TO BE ABLE TOO FIX IT BECAUSE OF ITS ALREADY BEEN DONE BEFORE, I SAID WHY DID IT HAPPEN AGAIN HE WOULDN'T GIVE ME A ANSWER EXCEPT THAT THE COMPUTER SAID IT WAS OK AND I COULDN'T SPEAK WITH HIS BOSS UNTIL NEXT WEEK. I SAID WHAT IF MY DAUGHTER DIED IN A WRECK BECAUSE OF IT ALL HE SAID WAS KIA WOULD SAY THAT THEY ALREADY FIXED IT AND WOULD NOT BE LIABLE. I WOULD LIKE  TO KNOW WHAT IF ANYTHING I CAN DO ABOUT THIS OR AM I JUST OVER A BARREL WITH KIA AND THERE JUNK.  *TR",
        "vin": "KNAGD126025"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/12/2014",
        "dateOfIncident": "01/29/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563976,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT WHILE DRIVING 50 MPH, THE CHECK ENGINE WARNING LAMP ILLUMINATED AS THE VEHICLE STALLED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHO DIAGNOSED THAT THE CRANK SHAFT SENSOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 65,500.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/27/2013",
        "dateOfIncident": "11/25/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10553976,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE HAD ONGOING PROBLEMS WITH A 2002 KIA OPTIMA, INCLUDING TIRE WEAR, BRAKE PROBLEMS, ELECTRICAL ISSUES, EXCESSIVE BATTERY WEAR.  THIS WEEK WE WERE NOTIFIED BY OUR AUTO SHOP THAT THERE IS EXCESSIVE RUST ON THE SUBFRAME AND THAT A RECALL EXISTS FOR THIS CONDITION.  WHEN I CONTACTED BOTH OUR LOCAL DEALER AND KIA CORPORATE, I WAS TOLD THAT THIS PARTICULAR VIN IS NOT INCLUDED IN THE RECALL, ALTHOUGH THE RECALL CLEARLY STATES THAT IT DOES MEET THE PARAMETERS.  UPON FURTHER RESEARCH, IT APPEARS THAT MANY OTHERS HAVE EXPERIENCED THE SAME PROBLEMS AND BEEN GIVEN THE SAME INFORMATION.  CURRENTLY, WE ARE LEFT WITH A CAR THAT IS A DANGER TO DRIVE AND ENORMOUS PERSONAL EXPENSE TO RESOLVE.  *TR",
        "vin": "KNAGD128625"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/28/2013",
        "dateOfIncident": "04/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545763,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALSO BEEN STATED AS \"NOT INCLUDED\". 2002 KIA OPTIMA V6 LX. THE VEHICLE SHAKES MY ENTIRE BODY UPON BRAKING. RADIO TURNS ON AND OFF. RADIO GOES FROM CD1 ERROR TO FM. LIGHTS FLICKER, AIR SHUTS OFF. IM ALMOST NOT ABLE TO PUMP GAS ANYMORE. PUMP HANDLE CONTINUOUSLY CLICKS OFF. ITS PATHETIC THAT I AM NOW AFRAID TO DRIVE TO WORK!! I HAVE ACTUALLY CALLED IN FOR FEAR OF IT JUST DECIDING TO COMPLETELY STALL.  *TR",
        "vin": "KNAGD128025"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/16/2013",
        "dateOfIncident": "09/14/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543790,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING I HAD NOTICED THAT THE CAR WAS PULLING TO THE RIGHT. I HAD NEW TIRES AND AN ALIGNMENT DONE 5-6 WEEKS PRIOR, SO I RETURNED TO THE SHOP AND THEY LOOKED AT EVERYTHING AND THE FRONT END WAS OUT OF ALIGNMENT. THE  SHOP LOOKED FURTHER TO SEE WHAT CAUSED THIS AND FOUND THAT THE RIGHT FRONT FRAME AREA WAS RUSTED AND CRACKED. THEY ADVISED ME THAT THE CAR WAS NOT SAVE AND THAT I SHOULD CONTACT KIA. I WAS DRIVING THE CAR HOME AND THE CAR PULLED DRASTICALLY TO RIGHT AND I HEARD A CRUSHING NOISE FROM THE RIGHT TIRE AREA. I PULLED OFF THE ROAD AND SAW THAT THE TIRE WAS NOT POSITIONED PROPERLY.  I HAD THE CAR TOWED TO MY RESIDENCE AND AM IN THE PROCESS OF CONTACTING KIA. I WAS LUCKING TO NOT HAVE CAUSED AN ACCIDENT, AFTER READING SOME OF THE OTHER SIMILAR COMPLAINTS IT SHOULD HAVE BEEN A NATIONAL RECALL ON THIS SITUATION. ACCORDING THE RECORDS THAT I HAD CHECKED I AM ONLY THE 2ND OWNER OF THIS VEHICLE.  I HOPE THAT KIA MAKES GOOD ON THIS SITUATION.  *TR",
        "vin": "KNAGD126825"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2013",
        "dateOfIncident": "08/06/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533885,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN YOU TURN MY CAR ON IT DOES NOT WANT TO TURN OFF. WHEN YOU ARE DRIVING THE CAR IT SUDDENLY SHUTS OFF AND STOPS. I HAVE READ SIMILAR REPORTS OF THE SAME THING HAPPENING AND UNDER THE RECALLS IT LISTS THIS AS A COMPLICATION. I HAVE CALLED KIA AND WAS TOLD THAT MY VIN NUMBER DOESN'T HAVE A RECALL ON IT AND WAS TOLD THAT ANY REPAIRS WOULD BE OUT OF POCKET. I HAVE ALREADY HAD TO REPLACE THE TOP HALF OF MY MOTOR COSTING ME 3500 OUT OF POCKET FOR WELL KNOW PROBLEMS AND RECALLS THAT WERE NOT INCLUDED IN THIS CARS VIN NUMBER I DO NOT THINK A CAR SHOULD  HAVE THIS MANY ISSUES AND OR REPAIRS IN THE LAST YEAR ALONE I HAVE PUT 2 GRAND INTO THIS CAR I AM VERY UNHAPPY ABOUT THIS SITUATION EVERYTHING THAT HAS BEEN RECALLED ALREADY I HAVE HAD TO FIX IT OUT OF MY POCKET BECAUSE THIS MODEL OF CAR IS NOT INCLUDED IN THE RECALLS I DON'T FEEL LIKE THIS CAR IS SAFE TO DRIVE AND I HAVE 2 SMALL CHILDREN WHO RIDE IN THE CAR I CAN NOT RISK MY CHILDREN'S LIVES AND HAVE THIS CAR SHUTTING OFF IN THE MIDDLE OF THE ROAD. I NEED SOMETHING DONE ABOUT ALL THE PROBLEMS GOING ON IN THIS CAR DUE TO MANUFACTURING DEFAULTS.  *TR",
        "vin": "KNAGD126325"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/28/2013",
        "dateOfIncident": "05/28/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513860,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT THE FRONT DRIVER'S SIDE DOOR WOULD NOT UNLOCK WITH THE KEY FOB OR MANUALLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS. THE MECHANIC STATED THE DOOR LOCK MOTOR WOULD HAVE TO BE REPLACED. AFTER THE REPAIR, THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.  *TR",
        "vin": "KNAGD128825"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2013",
        "dateOfIncident": "07/15/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502049,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT WHILE REFUELING, FUEL SPILLED OUT OF THE FUEL FILLER NECK. THE MANUFACTURER WAS CONTACTED AND STATED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 04V180000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 52,000.",
        "vin": "KNAGD128725"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "10/04/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501247,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS MAKING STRANGE NOISE.  TOOK TO MECHANIC TO HAVE CHECK.  IT WAS DISCOVERED THAT THE SUBFRAME IS COMPLETELY RUSTED THROUGH ON PASSENGER SIDE AT FRAME MOUNTS AND ALMOST RUSTED THROUGH ON DRIVERS SIDE.  MECHANIC DETERMINED THAT DUE TO THE SEVERITY OF PROBLEM VEHICLE IS UNSAFE TO DRIVE AND WILL NOT ALLOW BACK ON ROAD UNTIL NECESSARY REPAIRS ARE MADE.  I CONTACTED KIA AND WAS TOLD THAT THIS PARTICULAR YEAR VEHICLE WAS IN A RECALL DUE TO THIS PROBLEM.  HOWEVER, THIS PARTICULAR VIN WAS NOT INCLUDED IN THE RECALL.  THE VEHICLE WAS ORIGINALLY PURCHASED IN THE STATE OF WEST VA, AS STATED IN THE RECALL.  VEHICLE IS STILL PARKED AT MECHANICS GARAGE AND I WOULD GREATLY APPRECIATE COMMUNICATION REGARDING THIS MATTER.  I WAS TOLD BY KIA REPRESENTATIVE THAT I WOULD NEED TO CONTACT YOUR ORGANIZATION. *TR",
        "vin": "KNAGD128225"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/01/2013",
        "dateOfIncident": "10/31/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496036,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE VEERED TO THE RIGHT IN A JERKING MOTION. THE FAILURE OCCURRED WHENEVER THE BRAKES WERE DEPRESSED. THE CONTACT STATED THAT THE FAILURE RECURRED SEVERAL TIMES. THE VEHICLE WAS MANEUVERED TO THE SIDE OF THE ROAD. THE CONTACT NOTICED THAT THE PASSENGER'S SIDE TIRE WAS POSITIONED OUTWARDLY. ALSO, BOTH FRONT TIRES HAD PREMATURELY WORN DUE TO THE DEFECT. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER AND REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER 09V183000 (SUSPENSION). THE MANUFACTURER WAS NOT NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "KNAGD128125"
    },
    {
        "components": "STEERING,SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/31/2012",
        "dateOfIncident": "10/31/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482815,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS DRIVEN AND AT ONE POINT THERE WAS A NOTICEABLE DIFFERENCE IN STEERING AND THE CAR PULLED TO THE RIGHT. WITHIN A FEW DAYS OF THIS EVENT, THE BRAND NEW TIRES THAT WERE PURCHASED JUST A FEW MONTHS EARLIER, WORE FROM THE INNER EDGE TO ABOUT 1/3 OF THE WIDTH OF THE TIRE, EXPOSING THE BELTS. THIS CAUSED ONE TIRE TO POP, WHILE THE CAR WAS BEING DRIVEN. A SPARE WAS PLACED ON THE VEHICLE TO GET IT TO A TIRE REPAIR LOCATION AND AFTER APPROXIMATELY 30 MILES OF DRIVING, THE SPARE LOST ALL TREAD AND ALSO POPPED. THE VEHICLE WAS THEN TOWED TO THE TIRE REPAIR SHOP AND THE RUSTED AND BROKEN SUBFRAME WAS DETECTED. THE AREA WAS SO RUSTED THAT PORTIONS OF THE FRAME BROKE AND THE TIRES WERE NO LONGER RUNNING STRAIGHT. I CALLED KIA AND THEY TOLD ME ALTHOUGH THERE ARE RECALLS FOR THIS VERY PROBLEM ON KIA OPTIMAS FROM 2001 TO 2004, MY CAR WAS NOT IN THE RECALL BECAUSE I LIVE IN KANSAS. THE RECALL DOES APPLY TO KIAS IN MISSOURI, WHICH IS 15 MINUTES FROM WHERE I LIVE. THE KANSAS CITY AREA IS BOTH MISSOURI AND KANSAS AND THE AREA WHERE I LIVE. THE RUSTING IS ATTRIBUTED TO SALT USED DURING INCLEMENT WEATHER IN MISSOURI AND NOT ONLY IS THE SAME SALT USED IN KANSAS, BUT I ALSO DRIVE IN MISSOURI. THE KIA REPRESENTATIVE STILL REFUSED TO RECOGNIZE THAT MY VEHICLE SHOULD BE PART OF THE RECALL EVEN THOUGH THE EXACT SAME ISSUE THAT CAUSED OTHER KIA OPTIMAS TO BE RECALLED HAS HAPPENED TO MY VEHICLE. THE RECALL NEEDS TO BE EXTENDED TO KANSAS BECAUSE WE DEAL WITH THE SAME ELEMENTS AS MISSOURI AND IOWA WHICH ARE INCLUDED IN THE RECALL. MY SON WAS DRIVING THIS VEHICLE WHEN THE DAMAGE OCCURRED AND HE COULD HAVE SUFFERED SERIOUS INJURY IF HE HAD BEEN ON THE HIGHWAY INSTEAD OF A SIDE STREET.   *TR",
        "vin": "KNAGD128025"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/12/2012",
        "dateOfIncident": "10/03/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479926,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT WHILE DRIVING SHE HEARD AN UNFAMILIAR SOUND COMING FROM THE UNDER CARRIAGE. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE IT WAS CONFIRMED THAT THE SUB FRAME WAS SEVERELY RUSTED WHICH CAUSED IT TO FAIL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED ABOUT THE ISSUE. THE FAILURE AND CURRENT MILEAGE WAS NOT AVAILABLE.",
        "vin": "KNAGD128225"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/23/2012",
        "dateOfIncident": "03/06/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467009,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT WHILE DRIVING 5 MPH, THE CONTACT HEARD A LOUD NOISE NEAR THE FRONT DRIVER SIDE TIRE AS THE VEHICLE DROPPED TO THE GROUND. THE VEHICLE WAS TOWED TO A MECHANIC FOR INSPECTION WHERE THEY ADVISED THAT THAT THE BALL JOINTS NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE CONTACT STATED THAT HE STILL HEARD A NOISE AFTER THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED AND THEY STATED THAT THERE WAS NOTHING THAT COULD BE DONE.  THE FAILURE MILEAGE WAS 85,000.    UPDATED 08-03-12  *BF     UPDATED 09/07/2012  *JS",
        "vin": "KNAGD128425"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/16/2012",
        "dateOfIncident": "06/11/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461957,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON ROUTINE INSPECTION OF VEHICLE, MY REPAIR GARAGE NOTED THAT BRAKE LINES WERE QUITE RUSTED, AND STATED THAT THEY COULD FAIL SUDDENLY. IS THIS COMMON OR UNCOMMON IN A 10 YEAR OLD VEHICLE?  *JB",
        "vin": "KNAGD126725"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/19/2012",
        "dateOfIncident": "04/13/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455801,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC FOR ROUTINE SERVICE WHEN HE WAS ADVISED THAT THE SUB FRAME WAS CORRODED.  THE MANUFACTURER WAS CONTACTED BUT DENIED ANY ASSISTANCE WITH THE REPAIRS BECAUSE THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 09V183000 (SUSPENSION: FRONT). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 64,148.",
        "vin": "KNAGD126725"
    },
    {
        "components": "STEERING,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "03/03/2012",
        "dateOfIncident": "02/13/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450151,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 KIA OPTIMA, VEERED OF THE SIDE OF THE INTERSTATE DUE TO A FLAT TIRE. THE TIRES HAD BEEN REPLACED THAT MORNING AND WITHIN 130 MILES ON THE HIGHWAY THE RIGHT FRONT TIRE POPPED. AS I TOOK A CLOSER LOOK I NOTICED MY WHEEL WAS SLANTED IN. I THEN HAD IT TOWED TO THE NEAREST REPAIR SHOP WHO INFORMED ME THE ENGINE CRADLE WAS RUSTED AND CORRODED. WHEN I CONTACTED KIA ABOUT THE ISSUE THEY BASICALLY SAID SORRY ABOUT YOUR LUCK. THERE IS A RECALL FOR THIS PROBLEM BUT MY VIN IS NOT INCLUDED. NO ACTION HAS BEEN TAKEN BY KIA IN ANY OF MY ATTEMPTS TO HAVE THEM RESOLVE THIS PROBLEM. I AM, AND HAVE BEEN, STRANDED OUT OF TOWN FOR 3 WEEKS NOW WAITING ON THEM TO MAKE SOME KIND OF DECISION. THEY HAVE OVERLOOKED EVERY WORD I HAVE SAID TO THEM ABOUT THE SALT IN MY LOCATION AND THE CARS PREVIOUS LOCATIONS WHICH CAUSES SUCH CORROSION TO A POORLY MAKE VEHICLE. THE CAR ORIGINATES FROM SOUTHERN CALIFORNIA WHERE SALT IS PRESENTLY IN THE AIR. IT THEN WAS REGISTERED IN OKLAHOMA AND THE TEXAS PANHANDLE, BOTH HAVING HARSH SNOWY WINTERS. THE CAR CLEARLY HAS BEEN EXPOSED TO ENOUGH SALT TO HAVE BEEN INCLUDED IN THE RECALL. THIS IS KIA'S RESPONSIBILITY, YET THEY ARE DOING NOTHING ABOUT IT. WHEN I CRASHED MY CAR INTO THE DITCH ON THE SIDE OF THE HIGHWAY, MY LIFE WAS PUT AT RISK. THERE VERY EASILY COULD HAVE BEEN A CAR TO MY LEFT OR RIGHT OR A POLE IN THAT DITCH. KIA SHOULD HAVE FIXED THIS PROBLEM IN ALL OPTIMA'S PUT OUT DURING THE YEAR OF THE RECALL. IT IS A SERIOUS DANGER TO ANY UNAWARE DRIVER OF A 2001-2004 KIA OPTIMA. LEGAL ACTION NEEDS TO BE TAKEN AGAINST KIA.  *TR",
        "vin": "KNAGD128025"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/29/2011",
        "dateOfIncident": "07/26/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415609,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THE FRONT DRIVERS SIDE DOOR WOULD NOT OPEN AFTER IT WAS LOCKED. THE DRIVER WAS FORCED TO ENTER AND EXIT THE VEHICLE BY CLIMBING OUT OF THE WINDOW. THE DEALER WAS NOTIFIED; HOWEVER, THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNKNOWN. THE FAILURE AND CURRENT MILEAGE WAS 43,000. ONCE THE DRIVER SIDE DOOR IS LOCKED IT CANNOT BE UNLOCKED FOR THE INSIDE OR USING A KEY FOR THE OUTSIDE. AFTER WORKING THE LOCK FOR SOMETIME IT MAY UNLOCK OR STAY LOCKED. WHAT WE DO NOW IS TO LEAVE THE CAR UNLOCKED WHICH IS NOT THE BEST IDEA. THE PROBLEM IS NOT GETTING INTO THE CAR BUT GETTING OUT. NO RECALL FROM KIA. UPDATED 10/26/2011 *LN  *TR",
        "vin": "KNAGD126525"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/24/2011",
        "dateOfIncident": "05/23/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402512,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LOCKS WHEN USING THE DOOR HANDLE TO OPEN THE DOOR AFTER THE DOOR HAS BEEN UNLOCKED USING KEY OR KEYLESS ENTRY.  SO FAR ONLY BEEN LOCKED OUT OF THE CAR, BUT CONCERNED I WILL BE LOCKED IN THE CAR AT SOME POINT. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2011",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395237,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THE VEHICLE WAS INCLUDED IN NHTSA CAMPAIGN NUMBER 03V067000 (ELECTRICAL SYSTEM:STARTER ASSEMBLY). THE MANUFACTURER INFORMED THE CONTACT THAT THE REPAIRS WERE MADE PRIOR TO THE CONTACT OWNING THE VEHICLE. WHILE THE VEHICLE WAS PARKED THE CONTACT WAS UNABLE TO TURN THE VEHICLE OFF. THE CONTACT HAD TO DISCONNECT THE BATTERY IN ORDER TO TURN THE VEHICLE OFF. THE VEHICLE WOULD ALSO STALL WHILE DRIVING. THE VEHICLE ALSO FAILED TO START INTEMITTENTLY; HOWEVER,  THE FAILURES BECAME PROGRESSIVELY WORSE OVER TIME AND FAILED TO START. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING WHERE THE TECHNICIANS WERE UNABLE TO DIAGNOSE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KNAGD128925"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/11/2011",
        "dateOfIncident": "09/13/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376223,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT THE DRIVERS SIDE DOOR WOULD NOT UNLOCK BY USING THE KEY OR THE KEYLESS ENTRY.  THE CONTACT HAD TO ENTERED THROUGH THE PASSENGER SIDE OF THE VEHICLE IN ORDER TO UNLOCK THE DRIVERS SIDE DOOR. THE DEALER NOR THE MANUFACTURER WERE NOTIFIED OF THE FAILURE. THE CONTACT WAS CONCERNED ABOUT THE SAFETY ISSUE BEING ADDRESSED BY THE MANUFACTURER. THE FAILURE MILEAGE WAS 25,000.",
        "vin": "KNAGD128125"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/06/2011",
        "dateOfIncident": "01/05/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375002,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA. WHILE DRIVING APPROXIMATELY 45 MPH, THE SUB FRAME SEPARATED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE MECHANIC STATED THE SUB FRAME, TIE ROD, FRONT TIRE AND RIM NEEDED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED AND A COMPLAINT WAS FILED. THE MANUFACTURER ALSO STATED THERE WAS A RECALL (NHTSA CAMPAIGN ID NUMBER: 09V183000 COMPONENT: SUSPENSION: FRONT) BUT THE VIN WAS NOT INCLUDED. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "KNAGD128X25"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/01/2010",
        "dateOfIncident": "10/31/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363468,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA. WHILE THE VEHICLE WAS BEING SERVICED, THE CONTACT WAS INFORMED THAT THE FRONT SUBFRAME HAD CORRODED. THE CONTACT CALLED THE MANUFACTURER AND REFERENCED RECALL 09V183000 (SUSPENSION: FRONT) BUT WAS TOLD THAT THE VEHICLE WAS NOT INCLUDED. THE VEHICLE HAD NOT BEEN REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE 109,834.",
        "vin": "KNAGD128425"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/22/2010",
        "dateOfIncident": "09/22/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357031,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA.  WHILE DRIVING APPROXIMATELY 15 MPH, THE CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD AND THE VEHICLE STALLED.  THIS BECAME A RECURRING FAILURE SO THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE IT WAS REPAIRED.  THE FAILURE CONTINUED TO RECUR INTERMITTENTLY AND THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER ON TWO MORE OCCASIONS WHERE IT WAS REPAIRED.  THE FAILURE CONTINUES.  THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 95,900.",
        "vin": "KNAGD128425"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/19/2010",
        "dateOfIncident": "08/15/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10350651,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 KIA OPTIMA THAT THE VIN IS NOT ONE OF THE VEHICLES THAT IS COVERED BY YOUR RECALL NHTSA CAMPAIGN ID NUMBER: 09V183000 WHICH STATES \"INTERNAL CORROSION OF THE FRONT SUBFRAME. OVER TIME, SUCH SUBFRAME CORROSION NEAR THE CONNECTION TO THE LOWER CONTROL ARM CAN LEAD TO WHEEL MISALIGNMENT AND/OR OTHER NOTICEABLE STRESS IN STEERING...\". YOU HAVE IT LISTED AS STATES WITH DIFFICULT WINTERS AND THE USE OF ROAD SALT. I LIVE IN LOUISVILLE, KY. NOT ONE OF THE NAMED STATES. BUT. I GUARANTEE YOU THAT THIS SAME CORROSION CAN BE CAUSED BY THE WATER COMING FROM THE AIR CONDITIONER RUNNING DIRECTLY ONTO THESE PARTS. THE BACK SIDE OF SUBFRAME HAS RUST HOLES IN IT. THIS RECALL NEEDS TO BE EXPANDED TO ANY AND ALL KIA OPTIMAS THAT HAVE THE AC WATER RUNNING THERE DUE TO MANUFACTURE DESIGN. I HAVE PICTURES THAT I CAN SEND TO YOU SHOWING THIS CORROSION. I TRIED TO GET IT ALIGNED AT A KIA STORE AND THEY SAID \"LOWER CONTROL ARM BRACKET ON PASS SIDE IS RUSTED AND BROKEN. PASS SIDE WHEEL IS PUSHED BACK AND TIRES ON FRONT ARE ANGLED.\"  HOW WAS THE 36,538 VEHICLES DETERMINED ? WAS IT FROM THE STATE THAT THE CAR WAS SOLD IN ? *TR",
        "vin": "KNAGD128025"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/03/2010",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334480,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA OPTIMA. SHE STATED WHILE DRIVING AT SPEEDS OF 30 MPH, THE BRAKES WERE APPLIED AND WOULD NOT ENGAGE. THE CONTACT UTILIZED THE EMERGENCY BRAKES IN ORDER TO STOP THE VEHICLE. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR FACILITY WHERE IT WAS DISCOVERED THAT THE MASTER CYLINDER HAD FRACTURED. THE MECHANIC REPLACED THE MASTER CYLINDER AT THE OWNERS EXPENSE. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGES WERE 89,323.  UPDATED 08/03/10. *LJ  THE REAR WHEEL CYLINDERS, REAR BRAKES AND REAR DRUMS WERE REPLACED. UPDATED 10/12/10*JB",
        "vin": "KNAGD126825"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "11/27/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293939,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SON WAS DRIVING OUR 2002 KIA OPTIMA AND WHEEL ASSEMBLY FELL OFF. THE WHOLE FRAME RUSTED FROM INSIDE OUT CAUSING THE LOWER CONTROL ARM TO FALL OFF. *TR",
        "vin": "KNAGD128925"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2009",
        "dateOfIncident": "07/22/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285001,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS CONCERNING MY 2002 KIA OPTIMA, AND THE SUBFRAME RECALL THAT WAS ISSUED ON THIS CAR. . THE SUB FRAME WAS REPLACED DUE TO CORROSION BUT THE GARAGE HAS DONE SOMETHING WRONG BECAUSE THE GRINDING NOISE THAT IS COMING FROM UNDER THIS CAR IS JUST RIDICULOUS! I TOOK THE CAR BACK TO THE KIA DEALER WHO REMOVED THE RUSTED SUB FRAME AND REPLACED IT WITH THE NEW, TO FIND OUT WHY ITS MAKING THIS HORRID NOISE,OH YES THEY ALSO FORGOT TO PUT A BOLT IN. AND STILL DON'T KNOW WHY THE PART IS GRINDING SO.  SO THEN I CALLED THE KIA CORPORATION TO LET THEM KNOW THAT MY CAR IS NOT RIGHT AND SOMETHING IS WRONG. AND THEY DID NOTHING BUT PUT IT ON THE COMPUTER I WAS NOT SATISFIED. NOW I HAVE TO TAKE THIS CAR TO A BODY SHOP AND PAY FOR THIS TO BE REPAIRED OUT OF MY POCKET. I KNOW THERE WAS NO PROBLEM WITH THIS BEFORE AND NO NOISE GOING INTO THE SHOP, I DON'T EXPECT THIS TO BE GOING ON NOW. I HAVE TAKEN THIS TO 2 BODY SHOPS ONE BODY SHOP WONT TOUCH IT BECAUSE IT IS A RECALL, THE OTHER WILL TAKE A LOOK AND SEE, HE THINKS THEY BROKE SOMETHING REMOVING THE SUBFRAME. IN EITHER CASE THE CAR NEEDS FIXING OF A PART THAT WAS SUPPOSED TO BE COVERED UNDER A RECALL! WHAT EVER IS WRONG WAS CAUSE BY THIS SUBFRAME. *TR",
        "vin": "KNAGD128125"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/02/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282717,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA. THE CONTACT STATED THAT DURING A ROUTINE OIL INSPECTION A MECHANIC DISCOVERED CORROSION ON THE FRAME.  AS A CONSEQUENCE THE ENTIRE FRAME COULD COLLAPSE, WHICH INCREASED THE RISK OF SERIOUS INJURY.  HE NOTIFIED THE MANUFACTURER AND WAS ADVISED BY A REPRESENTATIVE THAT THE REPAIR WAS A NON-WARRANTY ITEM, THEREFORE THEY WOULD NOT ASSUME RESPONSIBILITY. THE VEHICLE HAS NOT BEEN REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 85,304.   *LJ  UPDATED 05/07/09.*JB",
        "vin": "KNAGD128325"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/24/2009",
        "dateOfIncident": "06/24/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278252,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A SAFETY RECALL ON MY 2002 KIA OPTIMA REGARDING THE SUBFRAME.  THE CORROSION UNDER MY CAR IS DEVASTATING.  NHTSA NEEDS TO KNOW THAT THIS CORROSION PROBLEM IS EXTENSIVE AND AFFECTS MORE THEN THE SUBFRAME.  KIA IS INSISTING THAT I PAY FOR THE DAMAGE THEY WILL CAUSE WHEN THEY HAVE TO REPLACE THE SUBFRAME.  THIS IS A SAFETY HAZARD THAT WILL AFFECT THOUSANDS. *TR",
        "vin": "KNAGD128525"
    },
    {
        "components": "STEERING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/13/2009",
        "dateOfIncident": "05/04/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268634,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA.  THE CONTACT STATED THAT THE SUBFRAME ON THE PASSENGER SIDE OF HIS VEHICLE WAS VERY RUSTY.  THE VEHICLE IS UNABLE TO BE DRIVEN AND THE CONTACT HAS NO CONTROL OF THE STEERING BECAUSE THE A-ARM WAS SEPARATED FROM THE SUBFRAME.  THE DEALER ACKNOWLEDGED THE FAILURES, BUT THERE ARE NO RECALLS AVAILABLE.  THE FAILURE MILEAGE WAS 91,400.   UPDATED 05/19/09 *BF  UPDATED 05/20/09. *JB",
        "vin": "KNAGD126125"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/01/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263861,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA.  WHILE PERFORMING A ROUTINE OIL CHANGE, THE MECHANIC DISCOVERED THAT THE CRADLE, OR SUBFRAME, UNDERNEATH THE VEHICLE WAS RUSTING OUT.  THE MECHANIC STATED THAT ANY MAJOR BUMP COULD CAUSE THE DRIVETRAIN TO COLLAPSE AND POTENTIALLY CAUSE DANGEROUS DRIVING CONDITIONS.  HE ALSO STATED THAT THE ENTIRE FRAME COULD COLLAPSE AND SEPARATE THE ENGINE COMPARTMENT FROM THE VEHICLE.  THE MANUFACTURER STATED THAT THE FRAME WOULD NOT BE COVERED UNDER WARRANTY AND THEY COULD NOT ASSIST WITH THE REPAIRS.  THE FAILURE AND CURRENT MILEAGES WERE 85,304.  UPDATED 05/06/09.  *LJ  UPDATED 05/07/09.*JB",
        "vin": "KNAGD128325"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/02/2009",
        "dateOfIncident": "01/23/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257219,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA OPTIMA  SUB FRAME IS ALL RUSTED OUT DEALER SAYS TOTAL SUSPENSION IS ABOUT TO FAIL NEED TO BE REPLACED   THIS IS THE ONLY THING ON THE CAR THAT IS RUSTED OUT. *TR",
        "vin": "KNAGD128X25"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/17/2009",
        "dateOfIncident": "01/09/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255394,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2002 KIA OPTIMA EXPERIENCED STEERING PROBLEMS WHICH I THOUGHT COULD BE CORRECTED WITH A BASIC FRONT END ALIGNMENT. REPAIR FACILITY INFORMED US THAT THE VEHICLE COULD NOT BE ALIGNED BECAUSE THE SUB-FRAME HAD RUST DAMAGE. THE SUB-FRAME ON THE PASSENGER SIDE HAD A \"GOLF SIZE\" HOLE IN IT AND THE WELDING JOINTS WERE COMPLETELY ROTTED THROUGH. THE VEHICLE ONLY HAD 70,000 MILES AND WAS ALWAYS WELL MAINTAINED. OIL CHANGES AND INSPECTIONS WERE PERFORMED AT KIA DEALERSHIPS AND THE DEFECT WAS EITHER NOT DETECTED OR NEVER REPORTED TO US PRIOR TO THE EXPIRATION OF THE WARRANTY. THE DEALER AND KIA MOTORS WERE CONTACTED ABOUT THE ISSUE; KIA DID REPLACE THE SUB-FRAME UNIT (EST COST $1,500) BUT WOULD NOT COVER THE COST FOR LABOR ($655). I BELIEVE A BIGGER PROBLEM EXIST WITH THIS DEFECT AND A RECALL SHOULD BE CONSIDERED TO PREVENT INJURY TO DRIVERS.      REVIEWING PREVIOUS COMPLAINTS, THIS SAME DEFECT HAS BEEN REPORTED ON THREE VIN #'S. *TR",
        "vin": "KNAGD128625"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/12/2009",
        "dateOfIncident": "01/10/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254710,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS LOCKED INSIDE VEHICLE. AFTER CLIMBING OUT WINDOW, WAS LOCKED OUT OF VEHICLE. THE DOOR WOULD UNLOCK WITH KEY THEN WHEN YOU TRY TO OPEN DOOR IT LOCKS ITSELF, EVEN WITH KEY STILL IN DOOR. WHEN THIS HAPPENS DOOR WILL NOT OPEN BY MANUAL USE OF LOCKS EITHER. *TR",
        "vin": "KNAGD126325"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,AIR BAGS,LATCHES/LOCKS/LINKAGES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/10/2008",
        "dateOfIncident": "07/05/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251412,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER BUYING THE VEHICLE  FROM A AUTO DEALER BETWEEN JULY 2 AND JULY 5 ...THIS VEHICLE BEGAN TO HAVE MANY PROBLEMS LIKE THE AUDIO RECEIVER SWITCH FROM RADIO TO CD ON ITS OWN,DOORS LOCKS ON ITS OWN,RPM RUNS TO 4000 GOING 45MPH AFTER A HARD JERK ASSUMING THAT I WAS HIT BY A OTHER CAR THE AIR BAG  LIGHT CAME ON AFTER THAT 2 HARD JERKS WHILE DRIVING,,(THEY DIDN'T EVEN DEPLOYED) CAN NOT PUMP GAS DUE TO FUEL KEEPS OVER FLOWING WHEN ITS BARELY EMPTY ....ITS BEEN A LIVING ?!@#$% AND I'M STILL PAYING FOR THE CAR....IS IT LEGAL FOR A DEALERSHIP TO SELL A VEHICLE LIKE THIS. *TR",
        "vin": "KNAGD128725"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/08/2008",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244891,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA OPTIMA, WE HAVE ONLY HAD THE CAR LESS THAN 2 YEARS AND IT HAS 2 FIST SIZE RUST HOLES IN FRAME ONE EACH SIDE BY  A-ARMS, DUE TO THESE DEFECTS TIRES WEARING QUICKLY AND NEEDS AIR CONTINUALLY TO BE PUT IN THEM.  HANDLING WORSENING AND MAKING THUMPING NOISE IN FRONT END, CAN NOT DRIVE OVER 35-40 MPH. CALLED KIA AND THEY SAID THEY WOULD NOT DO ANYTHING ABOUT THIS PROBLEM.  READ WHERE HYUNDAI AND KIA ARE MADE BY SAME COMPANY AND THIS HAS BEEN A PROBLEM WITH THE 1999 TO 2002 MODELS.  FEEL THIS IS THEIR RESPONSIBILITY TO MAKE RIGHT BEFORE SOMETHING HAPPENS AND THERE IS AN ACCIDENT.  NEED INFORMATION ON WHO TO CONTACT AND HOW TO GET THIS TAKEN CARE OF.  *TR",
        "vin": "KNAGD126125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/12/2008",
        "dateOfIncident": "06/30/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237913,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2002 KIA OPTIMA IN FOR A TUNE UP, THEY FOUND A BROKEN WATER PUMP, 5 CRACKS IN THE MANIFOLD. IT TOOK KIA 3 TIMES TO FIND THE PROBLEM. AFTER I PICKED UP THE CAR IT STILL HAD A PROBLEM TOOK IT BACK TWICE BEFORE THEY FOUND IT WAS A SENSOR PROBLEM THIS CAR IS NOT A SAFE VEHICLE.  *TR",
        "vin": "KNAGD126125"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/26/2008",
        "dateOfIncident": "04/27/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228888,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA OPTIMA -- WHEN YOU UNLOCK THE DOORS EITHER MANUALLY OR WITH KEY FOB AND ATTEMPT TO OPEN THE PASSENGER DOOR IT IMMEDIATELY LOCKS AND DOES NOT ALLOW YOU TO EXIT THE VEHICLE. IT LOCKS FROM BOTH INSIDE AND OUTSIDE OF VEHICLE. THIS INCIDENT HAS HAPPENED IN THE PAST APPROXIMATELY APRIL OF 2005 WITH THE EXCEPTION IT ALSO INCLUDED THE DRIVER DOOR. HAD TO CLIMB OUT OF WINDOW TO EXIT VEHICLE.  *TR",
        "vin": "KNAGD126425"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "05/24/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218744,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MODEL IS A 2002 KIA OPTIMA 4 DOOR SEDAN AND THE PROBLEM IS REGARDING THE DRIVERS LEFT DOOR.  THE POWER LOCK DOOR LOCKS ON ITS OWN IMMEDIATELY AFTER THE DOOR IS UNLOCKED USING THE KEY.  THE CAR WAS THEN TAKEN TO GET FIXED ON 05/24/02 AND OUNCE AGAIN THE SAME PROBLEM OCCURRED ON 01/31/08 THIS TIME COST TO FIX IS $233.16.  AFTER THE PROBLEM WAS FIXED, AGAIN FOR THE SECOND TIME, IT OCCURRED AGAIN. I AM CONVINCED THAT THE POWER LOCKS ARE DEFECT AND DANGEROUS RISKS OF BECOMING TRAPPED IN THE CAR.  THIS PROBLEM IS UNPREDICTABLE IT OCCURS FROM TIME TO TIME, AND I AM UNABLE TO GET IT FIXED BECAUSE MECHANICS MUST BE THERE TO SEE WHEN PROBLEM OCCURS IN ORDER TO TRY TO FIX IT.  IN ONE INCIDENT I WAS FORCED TO CRAWL OUT OF THE WINDOW IN ORDER TO GET OUT OF THE CAR.  I FEEL VERY INSECURE AND UNSAFE IN CASE OF AN ACCIDENT IF I WOULD BE ABLE TO GET OUT OF THE CAR WHICH IS WHY I AM RAISING AWARENESS OF THIS PROBLEM.  *TR",
        "vin": "KNAGD126425"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/05/2008",
        "dateOfIncident": "02/02/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217039,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ROTTED SUB FRAME ON 2002 KIA OPTIMA. KIA DOES NOT WANT TO CONSIDER THIS THEIR PROBLEM.  *TR",
        "vin": "KNAGD124415"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/15/2008",
        "dateOfIncident": "12/07/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214873,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA OPTIMA.  THE CONTACT RESEARCHED HER INSURANCE AGENCY'S WEBSITE AND NOTICED A RECALL FOR THE CRANK POSITION SENSOR.  THE KIA DEALER STATED THAT NHTSA CAMPAIGN ID NUMBER 03V067000 (ELECTRICAL SYSTEM:STARTER ASSEMBLY) DOES NOT APPLY TO HER VIN.  WHILE DRIVING AT AN UNKNOWN SPEED, THE VEHICLE AUTOMATICALLY STOPPED.  SHE TOOK THE VEHICLE TO ANOTHER DEALER AND THE VEHICLE WAS REPAIRED AT THE CONTACTS EXPENSE.  THE POWERTRAIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS 74,000 AND CURRENT MILEAGE WAS 77,000.    UPDATED 02-14-08 *BF   UPDATED 02/14/08  *TR",
        "vin": "KNAGD126725"
    },
    {
        "components": "POWER TRAIN,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/20/2007",
        "dateOfIncident": "07/27/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203843,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA OPTIMA SUB FRAME IS RUSTING OUT. CUSTOMER STATES THAT THE DEALER TOLD HER THERE WAS A SPOT ON THE SUB FRAME WHERE THE CONTROL ARM MOUNTS TO THE ENGINE CRADLE  HAD RUSTED OUT AND IT LOOKED AS IF IT HAD BEEN IN AN ACCIDENT, AND WOULD NOT HELP WITH THE REPAIRS.  *KB  THE MECHANIC CONCLUDED THAT DUE TO THE DESIGN OF THE VEHICLE, THE CONDENSATION FROM THE AIR CONDITION RUNNING DOWN THE FRAME IS WHAT CAUSED THE RUST TO OCCUR.  THE SPEED SENSOR FOR THE AUTOMATIC TRANSMISSION WAS REPLACED. *JB",
        "vin": "KNAGD126525"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/27/2007",
        "dateOfIncident": "06/27/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194808,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A LOW MILEAGE KIA OPTIMA TWO YEARS AGO. SHORTLY AFTER PURCHASING THIS CAR THE AIRBAG LIGHT DEPLOYED. I TOOK IT TO MY LOCAL DEALER SERVICE DEPT @ GWINNETT PLACE KIA IN DUUTH GA WHO AT NO CHARGE MADE THE LIGHT GO OFF. DRIVING OUT OF THE DEALERSHIP THE LIGHT CAME BACK ON AND THEY AGAIN CORRECTED WHATEVER IT WAS THAT WAS MAKING THE LIGHT APPEAR, ASSURING ME JUST BECAUSE THE AIRBAG LIGHT IS ON IT WILL DEPLOY AND IT IS FINE. TWO MORE TIME IN THE NEXT FEW MONTHS FOR NO REASON AGAIN THE LIGHT WOULD APPEAR AND AGAIN I RETURNED TO THE DEALERSHIP. THE LAST TIME 9 MONTHS AGTO WHEN THEY INSTALLED A NEW AIRBAG AS THEY ADVISE THEY DID NOT KNOW WHAT WAS CAUSING THE LIGHT TO COME ON AGAIM REASSURING ME JUST BECAUSE THE LIGHT WAS ON THE AIRBAG WOULD STILL DEPLOY. I WAS FRUSTRATED AT THAT POINT AND ALTHOUGH THE LIGHT WAS ON A FEW DAYS LATER AGAIN, I FELT ASSURED I WAS IN NO DANGER AND PLANNED TO TRADE IN THE CAR IN THE NEAR FUTURE. NOW IT IS THE SAME PROBLEM AND WHEN I TOOK MY CAR TO A MECHANIC WHOM I TRUST AND WHO IS A TEACHER OF AUTO MECHANICS AT A LOCAL COLLEGE, HE INFORMED ME TODAY THEY GAVE ME THE RUN AROUND, ASSURING ME THIS IS REGULATED BY THE FEDERAL GOVENMENT AND I AM NOT SAFE; AS LONG AS THE AIRBAG LIGHT IS ON MY AIRBAG WILL NOT DEPLOY AT THE TIME OF AN ACCIDENT. I AM NOW FEARFUL KIA HASL ARGUED WITH ME THAT DESPITE THE RECORDS OF THE MUMEROUS TIMES I HAVE SOUGHT HELP FROM THEM FOR THE SAME PROBLEM, THE CAR IS NOW OVER THE 50K WARRANTY AND IT IS NOT THEIR RESPONSIBILITY. THEY WANT TO CHARGE ME $50.00 TO JUST LOOK AT IT AND FROM THERE WILL CHARGE ME LIKE ANYONE ELSE. THIS IS OUTRAGEOUS. I'M A SINGLE MOM WITH KIDS AND NEED TO BE SAFE. I WILL NEVER PURCHASE ANOTHER KIA PRODUCTS AGAIN AND AM CONSIDERING HIRING AN ATTORNEY TO INTERVENE FOR ME TO RESOLVE THIS. THEY NEVER \"FIXED\" THE PROBLEM TO BEGIN WITH AND NOW WANT ME TO PAY?",
        "vin": "KNAGD126825"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2007",
        "dateOfIncident": "05/12/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191070,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON ROUTE  I10 IN HOUSTON, TX CAR STALLED/WOULD NOT START.  TOWED CAR TO GAS STATION AND  HAD IT JUMPED.  DID NOT HELP. TOWED TO  A MECHANIC SHOP,  WHERE I WAS TOLD THAT IT WAS THE CRANKSHAFT POSITION SENSOR THAT NEEDED TO BE REPAIRED.  THIS PART WAS FOUND TO BE DEFECTIVE IN KIA OPTIMAS IN 2001 AND 2002.  WHILE RESEARCHING THE PART ONLINE I FOUND THAT THE NHTSA  RECALLED THE 2001 AND 2002 OPTIMAS BECAUSE, AND I QUOTE FORM THE NHTSA WEBSITE\" 2001-02 W/V6: TWO SEAERATE RECALLS FOR IMPROPERLY MANUFACTURED CRANKSHAFT POSITION SENSORS COULD RESULT IN ENGINE STALLING WHILE DRIVING. DEALERS WILL REPLACE AFFECTED PARTS.  *AK    I CALLED THE KIA DEALERSHIP WHICH SAID THAT MY VIN NUMBER WAS NOT AFFECTED IN THE RECALL.  I FIND IT A BIT IRONIC, AND I AM NOW FILING THIS COMPLAINT THAT MY VEHICLE SHOULD BE INCLUDED.",
        "vin": "KNAGD126525"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2007",
        "dateOfIncident": "04/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178058,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING TO THE DRIVERS' SIDE BODY LIGHTS BLOWS THE FUSE. FUSES LAST ONLY A FEW DAYS. *JB",
        "vin": "KNAGD126825"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/15/2006",
        "dateOfIncident": "06/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176264,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY OPTIMA USED IN MAY 2004. ONE MONTH AFTER PURCHASE, I EXPERIENCED A HESITATION IN THE SHIFTING OF THE AUTOMATIC TRANSMISSION. I TOOK THE CAR BACK TO THE DEALER OF PURCHASE TO HAVE THE PROBLEM FIXED UNDER WARRANTY. THEY COULD NOT DUPLICATE THE PROBLEM, AND THEREFORE, APPARENTLY THEY CAN'T FIX IT EITHER. SINCE THEN, MY CAR HAS BEEN IN 2 DIFFERENT KIA DEALER SHOPS FOR THE EXACT SAME PROBLEM 4 OR 5 TIMES. WITH THE SAME RESULT: THEY CAN'T DUPLICATE THE PROBLEM, SO THEY CAN'T FIX IT. THE FOURTH TIME I TOOK IT IN, THEY COULDN'T DUPLICATE THE PROBLEM, BUT BECAUSE I CALLED CUSTOMER CARE, THEY DID CHECK ALL THE CONNECTORS FOR THE TRANSMISSION. I WAS ALSO INFORMED THAT NO CODES CAME UP FOR THE CAR AT ALL, BUT WHEN I TOOK IT TO AN INDEPENDENT MECHANIC, THERE WERE 4 CODES THAT CAME UP: THE SAME 2 TWICE. ONE SET WAS ON 'HOLD' AND THE OTHER SET HAD JUST OCCURRED THAT DAY. THE PROBLEM RECURRED THE DAY I PICKED UP THE CAR FROM THE DEALER, WHO'D HAD IT FOR A WEEK AND STILL COULDN'T DUPLICATE THE PROBLEM. THE FIFTH TIME I TOOK IT IN (IN DEC 2006), THE MECHANIC FINALLY WAS ABLE TO DUPLICATE THE PROBLEM, BUT MY WARRANTY RAN OUT 2,000 MILES BEFORE THIS. NOW THEY WON'T FIX IT UNDER WARRANTY. I HAVE CONTACTED CUSTOMER CARE AND WAS INFORMED THAT IT MIGHT GET FIXED UNDER WARRANTY IF I HAD A TRANSMISSION SERVICE AT 60,000 MILES. I'M NOT SURE WHY THAT EVEN MATTERS IF THE PROBLEM STARTED AT 48,000 MILES. PLUS, IN ALL THE CONTACT I HAVE HAD WITH ANY OF THESE PEOPLE, NOT A SINGLE ONE EVER RECOMMENDED OR REQUIRED A TRANSMISSION SERVICE.   I WOULD NEVER RECOMMEND THIS MODEL CAR TO ANOTHER PERSON; NOT ONLY BECAUSE OF THE PROBLEMS, BUT BECAUSE OF THE SERVICE TECH'S WHO ARE RUDE AND UN-INFORMATIVE TO CUSTOMERS. *JB",
        "vin": "KNAGD126625"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/25/2006",
        "dateOfIncident": "03/13/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174229,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA OPTIMA LX, VIN#: [XXX] W/ APPROXIMATELY 55,000 MILES.  MY FIRST WARRANTY CLAIM: THE REPLACEMENT OF MY TIMING BELTS. ON 9/1/2006, MY CAR STALLED WHILE DRIVING.  I HAD A TOW TRUCK MY CAR TO THE SERVICE CENTER WHERE I BOUGHT MY CAR, BRONX AUTOMOTIVE GROUP INC. D/B/A,  TOYOTA OF THE BRONX. THE MANAGER AGGI SARATIS ENDED UP IN AN DISPUTE WITH THE TOW TRUCK DRIVERS REGARDING ACKNOWLEDGMENT WARRANTY AND ADVISED THE TOW TRUCK DRIVER TO REMOVE THE VEHICLE FROM HIS PREMISE.  MY CAR WAS TOWED TO THE NEAREST AVAILABLE SERVICE SHOP. THE REPAIR WAS A REPLACEMENT OF THE TIMING BELT. MY VEHICLE HAD 51,720 MILES AT THE TIME OF REPAIR.  THE TIMING BELT IS UNDER WARRANTY UP TO 60,000 MILES. I PAID THE TOTAL INVOICE FROM BRONXDALE AUTO REPAIR CENTER IN THE AMOUNT OF $603.40. I FAXED A COPY OF THE INVOICE TO THE SERVICE MANAGER ON 9/7/2006. I HAVE TWO WITNESSES, TOW TRUCK DRIVERS, WHO WILL CONFIRM THAT THE SERVICE TEAM WAS UNPROFESSIONAL.A TECH MADE A COMMENT TO ME STATING \"I DO NOT SPEND ANY MONEY HERE\" SO WHY WOULD I EXPECT TO CLAIM ANY WARRANTY. I DISAGREE.I PAID FOR THIS CAR! MY SECOND WARRANTY CLAIM IS THE REPLACEMENT OF MY TRANSMISSION.ON 3/10/2006, I BROUGHT MY CAR TO SERVICE BECAUSE MY CAR COULD NOT MANEUVER IN REVERSE.MY VEHICLE AT THE TIME HAD 45,147 MILES. ON 3/13/2006, SERVICE ADVISED ME THAT THE ENTIRE TRANSMISSION NEEDED REPLACEMENT AND SINCE THEY HAVE NO SERVICE RECORDS, THIS WOULD NOT BE CLAIMED AS A WARRANTY.I DECIDED TO GO BACK TO MY MECHANIC AND AFTER FURTHER INSPECTION, ADDITIONAL WORK NEEDED TO BE DONE.THE INVOICE TOTAL WAS $1,920.40. MY MECHANIC FURTHER ADVISED ME THAT THIS VEHICLE HAS A PRODUCT QUALITY DEFECT ON THE TORQUE CONVERTER. IN FACT, THERE IS OVER A PAGE AND A HALF OF TECHNICAL SERVICE BULLETINS ITEMS!I NEVER RECEIVED ANY NOTICE OF A RECALL.  I HAVE NEVER HAD A WARRANTY ACKNOWLEDGED AND I FEEL THAT THE SERVICE TEAM IS HIGHLY UNPROFESSIONAL AND UNSKILLED.CONSIDERING THAT I HAVE HAD THESE PROBLEMS BEFORE 60,000 MILES IS SUSPICIOUS. *NM  *JS",
        "vin": "KNAGD126525"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/10/2006",
        "dateOfIncident": "07/06/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10162028,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THERE WERE TWO ACCIDENTS WITH THE VEHICLE WHERE THE AIR BAG DID NOT DEPLOY.  IN THE FIRST ACCIDENT, IN 2003, NONE OF THE AIRBAGS DEPLOYED.  IN THE SECOND OF THESE ACCIDENTS WHICH WAS MORE SEVERE, THE VEHICLE WAS TOTALED, AND NONE OF THE AIRBAGS DEPLOYED EITHER.  IN THE BOTH ACCIDENTS, THE OCCUPANT WERE WEARING THEIR SEATBELTS HOWEVER THE CONTACT EXPRESSED CONCERN THAT THERE MUST BE A PROBLEM AIR BAG SENSOR OF THE VEHICLE.",
        "vin": "KNAGD128X25"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/29/2006",
        "dateOfIncident": "06/27/2006",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161036,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THAT WHILE DRIVING AT 40 MPH, THE VEHICLE WAS FILLED WITH THE SMELL OF BURNING RUBBER.  THIS WAS CLOSELY FOLLOWED BY AN APPEARANCE OF WHITE SMOKE.  THE SMOKE WAS COMING FROM THE SEAT BELT HARNESS AREA ON THE PASSENGER SIDE OF THE VEHICLE.  THE VEHICLE WAS TAKEN TO A SERVICE DEALER, WHERE THE DEALER WAS UNABLE TO DETERMINE THE PROBLEM.",
        "vin": "KNAGD126625"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/14/2006",
        "dateOfIncident": "06/14/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159835,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE AIRBAG LIGHT ILLUMINATED AND THE VEHICLE WAS TAKEN TO THE DEALERSHIP.  THE DEALERSHIP DETERMINED THE DRIVER SIDE SEAT NEEDS TO BE REPLACED.",
        "vin": "KNAGD126725"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/08/2006",
        "dateOfIncident": "05/16/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10159356,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A PAVED SURFACE GOING APPROX. 40 MPH, MY DRIVER SIDE SEAT AIRBAG WENT OFF FOR NO REASON.  I SUSTAINED SEVERE BRUISING AND BURNING SCABS ON MY LEFT SHOULDER AND CURRENTLY HAVE A SCAR THERE.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/11/2006",
        "dateOfIncident": "05/11/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157253,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WITHOUT WARNING, AT VARIOUS SPEEDS, THE VEHICLE STALLS.  THE VEHICLE WILL NOT RESTART AND MUST BE TOWED TO THE DEALERSHIP.  THE DEALERSHIP HAS REPLACED MULTIPLE COMPONENTS, BUT THESE ATTEMPTS HAVE NOT RESOLVED THE PROBLEM.  THE COMPONENTS INCLUDE; CLUSTER PANEL, KNUCKLE ON STEERING WHEEL, KEY SUBSET, BOX ASSEMBLY PANEL JUNCTION, IGNITION SWITCH, AND ETACS ASSEMBLY.",
        "vin": "KNAGD128325"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/09/2006",
        "dateOfIncident": "12/26/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157073,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE DRIVER SIDE AIRBAG DEPLOYED WITHOUT WARNING WHILE DRIVING 35MPH.  THE DRIVER SEAT BELT WAS IN USE AT THE TIME OF THE INCIDENT AND THE BRAKES WERE NOT BEING APPLIED.  THE SUDDEN DEPLOYMENT OF THE AIRBAG STARTLED THE CONTACT AND THE STEERING WHEEL WAS JERKED IN REACTION TO THE AIRBAG.  THE VEHICLE LEFT THE ROADWAY AND STRUCK A CURB, THE VEHICLE SUSTAINED DAMAGE TO THE PASSENGER SIDE AND THE OIL PAN WAS RUPTURED.  THE VEHICLE WAS TOWED TO A SERVICE DEALER WHO DETERMINED THE AIR BAG SENSOR/ACTUATOR WAS SET TOO HIGH CAUSING THE AIR BAG TO DEPLOY PREMATURELY.",
        "vin": "KNAGD128425"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/26/2006",
        "dateOfIncident": "12/26/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10148761,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA  OPTIMA AIRBAG DRIVER'S  SIDE  DEPLOYED GOING 35 MILES PERHOUR WHILE IN A RIGHT HAND CURVE. WHEN THE AIR BAG DEPLOYED IT HIT THE LEFT SHOUDER CAUSING MY DAUGHTER TO TURN THE WHEEL MORE AND GO OFF THE ROAD. THERE WHERE NO IMPACTS ON ANY PART OF THE CAR .WE ARE LUCKY NO ONE WAS HURT OTHER THAN A STRAINED NECK AND A HOLE IN THE OIL PAN. KIA RECALLED SOME 2001 FOR THE SAME PROBLEM .*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/09/2006",
        "dateOfIncident": "12/31/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147285,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA MOTORS OF AMERICA INC. REF: VIN# KNAGD12693513835  COMPLAINT CASE NUMBER K1056698 FORMAL COMPLAINT AGAINST KIA MOTORS OF AMERICA INC. NOT HONORING  PARTS AND LABOR WARRANTY & UNSCRUPULOUS BUSINESS PRACTICES.  THE TIMING BELT FOR  2002 KIA OPTIMUM SERVICED  A YEAR TO THE DAY IT LEFT ME ON THE ROAD SIDE.  IT WAS NEW YEARS EVE THE CAR BROKE DOWN. NEW YEARS HOLIDAY WEEKEND SERVICE DEPARTMENT FOLGER KIA OF  CHARLOTTE NC CLOSED.  UNABLE TO REACH THEM UNTIL TUESDAY JANUARY 3RD, 2006,RETURNED HOLIDAY WEEKEND.  TOLD WARRANTY EXPIRED DECEMBER 31ST, 2005.  THAT MY WARRANTY FOR THE PARTS & LABOR WOULD NOT BE GUARANTEED.  PLEASE SEE THE ORIGINAL RECEIPT DATED DECEMBER 31ST, 2004 EXACTLY 365 DAYS FROM WHEN THE EXACT SAME PROBLEM OCCURRED.  BANK STATEMENT SHOWS MY CHECK CARD CLEARED  $601.87 ON JANUARY 3RD 2005.  I WAS INSTRUCTED ALL PARTS & LABOR WOULD BE HONORED FOR ONE YEAR.  I RETURNED THE CAR TO FOLGER KIA ON FEBRUARY 22ND 2005  CONCERNS THE CARS TIMING MAY HAVE BEEN IMPROPERLY SET.  ON THE INVOICE THAT I WAS CONCERNED THAT THE RPM'S WERE OVER THEIR ORIGINAL SETTINGS BY 1000 RPM.  NO MENTION OF TEST DRIVE TO DIAGNOSE PROBLEM LISTED ON INVOICE DECEMBER 31ST, 2004.  TECHNICIAN STATED ALL READINGS WERE NORMAL. THIS MAY HAVE CONTRIBUTED TO THE PREMATURE WEAR & BREAKING OF TIMING BELT.  I WAS INSTRUCTED JANUARY 3RD, 2006 BY JEFFREY STEPHENS TO CONTACT THE KIA CORPORATE HEADQUARTERS.  WHERE I WAS TOLD THAT GUS THE SERVICE MANAGER FOLGER KIA'S REQUESTED TO HONOR MY PARTS & LABOR WAS DECLINED BY A MR. BOB STRICKLAND.   KIA MOTORS OF AMERICA INC., THEIR CUSTOMER  NOTE FOLGER KIA ACCEPTED MY MONEY ON JANUARY 3RD 2005.  THE CAR WAS WAITING AT THE DEALERSHIP FOR THEM TO SERVICE ON MONDAY 01-02-2006 WITH THE SAME PROBLEM.  HAD MY LOCAL FOLGER KIA BEEN OPEN FOR BUSINESS ON THE EVENING OF DECEMBER 31ST ,2005 MY CAR WOULD HAVE BEEN TOWED THEIR.  I WOULD APPRECIATE IF YOU WOULD LOOK IN TO THE MATTER.  SUSANNE FARRAR 12016 ALABASTER COURT CHARLOTTE, NC 28269 704-488-8039.  *NM",
        "vin": "KNAAGD12693"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "06/22/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131554,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL ON FUEL CUT VALVE WAS INSTALLED AT 33,000 MILES ON VEHICLE - AT 77,000 VEHICLE FAILED - FOUND OUT FROM ANOTHER DEALER (GREYSTOKE) THAT RECALL FUEL CUT VALVE HAD BEEN INSTALLED INCORRECTLY.  *NM",
        "vin": "KNAGD126425"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,AIR BAGS,STEERING",
        "crash": true,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "09/13/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10130843,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2002 KIA OPTIMA LX.  THERE IS AN ELECTRICAL PROBLEM WITH THE VEHICLE.  THE LIGHTS WILL START TO FLICKER, AND THEN THE VEHICLE WILL LOSE  POWER AND SHUT EVERYTHING DOWN.  WHEN THE TEMPERATURE WAS AROUND 80-90 DEGREES AND AT LONG DISTANCES THIS PROBLEM WILL HAPPEN.  THE DEALERSHIP CHANGED THE BATTERY TWICE, THE ALTERNATOR TWICE, THE MAIN WIRING HARNESS, AND THE MAIN COMPUTER FOR THE VEHICLE.  THIS STILL DID NOT FIX THE PROBLEM.    CONSUMER TOOK VEHICLE  BACK TO THE DEALERSHIP WHEN THE POWER WENTOUT  ON 7-14-05.  THIS CAUSED  CONSUMER'S  VEHICLE   TO RUN A STOP SIGN , AND  HIT ANOTHER VEHICLE, CAUSING BOTH VEHICLES TO BE TOTALED.  THE BRAKES WENT OUT AS A RESULT OF THE POWER OUTAGE, AND  COULD NOT STOP THE VEHICLE.  ALSO, THERE WAS NO STEERING.  THE VEHICLE WAS NOT OVERHEATING.  THE AIRBAGS DID NOT DEPLOY.  EVERYTHING ELECTRICAL FAILED WITH THE VEHICLE.  THE FIRE DEPARTMENT DISCONNECTED BOTH BATTERIES TO PREVENT FIRE FROM HAPPENING.  WHEN THEY DID THIS IT DELETED ALL THE CODES THAT WOULD HAVE TOLD  DEALER WHAT THE PROBLEM WAS.  THE MECHANIC  SAID THAT THERE WAS BATTERY ACID ALL OVER THE COMPUTER, THEY STILL WERE UNABLE TO IDENTIFY THE PROBLEM.  THE ELECTRICAL PROBLEMS HAVE BEEN HAPPENING SINCE PURCHASE.   CONSUMER HAS CONTACTED THE KIA MANUFACTURER AT LEAST TEN TIMES, COMPLAINT NUMBERS FOR THE FIRST WAS 24306, ON 7-18-03, AND THE LAST WAS ON 9-13-04, COMPLAINT . 56482.  WHEN THE CONSUMER CONTACTED THE MANUFACTURE AFTER THE ACCIDENT THEY SAID THEY WANTED A COPY OF THE POLICE REPORT AND PICTURES OF THE VEHICLE AFTER THE ACCIDENT.  *AK",
        "vin": "KNAGD128625"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/06/2005",
        "dateOfIncident": "06/03/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124269,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATES WHEN HE LOCKS THE DOORS ON  VEHICLE IT WILL NOT UNLOCK.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "05/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ST: 8TH OF 2004 THE BATTERY STARTED TO DIE,\\.  DEALER TOLD CALLER TO SHUT THE ALARM SYSTEM OFF WHEN NOT DRIVING. VEHICLE BATTERY WAS CHECKED BY KIA, AND REPORTED NO PROBLEMS WITH BATTERY.  HOWEVER,   BATTERY  HAD TO BE CHARGED NUMEROUS TIMES IN DRIVEWAY.  ON MAY 2005 THE LOCKS BEGAN TO GO ON AND OFF, AND ALL LIGHTS CAME ON THE DASH. TOOK THE CAR TO DEALER, WHO CHECKED THE BATTERY, BUT DEALER REPORTED THE CAR NEEDED A NEW BATTERY. 05/05/05 AS CONTACT WAS DRIVING ON A MAIN ROAD AND ALL SENSOR LIGHTS CAME ON, AND LOCKS CAME ON AND OFF, AND CAR SHUT OFF. AFTER RESTARTING VEHICLE WAS TAKEN TO DEALER AGAIN FOR REPAIR.*AK",
        "vin": "KNAGD128225"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/28/2005",
        "dateOfIncident": "10/16/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113241,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AN ACCIDENT OCCURRED.  THE VEHICLE FLIPPED AFTER HITTING A POLE.  UPON IMPACT, THE FRONTAL/SIDE AIR BAGS DID NOT DEPLOY.   *AK   *SC  THE CONSUMER HAD A DIABETIC EMERGENCY AND COLLAPSED AT THE WEHEL. *JB",
        "vin": "KNAGD126625"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117343,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA OPTIMA EXPERIENCING PROBLEMS WITH TRANSMISSION AND TIMING BELT.*MR   THE CONSUMER STATED EVEN THOUGH THE TRANSMISSION AND TIMING BELT WAS REPLACED THE VEHICLE STILL MAKES A NOISE.  *JB",
        "vin": "KNAGD126725"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "03/29/2005",
        "dateOfIncident": "03/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115994,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENT CATROSTROPIC FAILURE OF THE EMERNGENCY BRAKE",
        "vin": "KNAGD126425"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/05/2005",
        "dateOfIncident": "03/03/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112561,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALWAYS HAD MY OIL CHANGED IN THIS CAR AND THIS PAST THURSDAY I WENT TO THE DOCTOR AND WAS IN THERE FOR ABOUT 20 MINUTES AND WENT TO LEAVE AND MY CAR WOULD NOT START. MY MOTOR IS LOCKED UP. I ALSO HAVE HAD A POPPING NOISE IN MY GAS PEDAL WHEN IT IS FIRST DROVE IN THE COLD. I ALSO HAVE PROBLEMS WITH MY BRAKES LIKE JUMPING WHEN TRYING TO SLOW DOWN WHEN GOING FAST SAY 50 MPH. *AK",
        "vin": "KNAGD126625"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/27/2005",
        "dateOfIncident": "10/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109091,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING VEHICLE VIBRATED SEVERELY. VEHICLE WAS TAKEN  TO THE DEALER, WHO INFORMED THE CONSUMER THAT THE FRONT BRAKE  ROTORS AND  PADS NEEDED TO BE REPLACED DUE TO EXCESSIVE WEAR.*AK",
        "vin": "KNAGD126525"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "01/07/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105909,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2002 KIA OPTIMA, MY STEREO,HEADLIGHTS,DASHLIGHTS WOULD CUT OUT WHILE DRIVING. I TOOK IT IN TO A KIA DEALERSHIP, THE INSTRUCTED ME TO GET A NEW BATTERY. I DID, AND THAT DID NOT FIX THE PROBLEM. ON SATURDAY, JANUARY 1RST,2005 I WAS DRIVING DOWN THE FREEWAY DOING ABOUT 60 MPH, MY CAR LOST ALL POWER AND STALLED IN THE MIDDLE OF THE FREEWAY. I COULD NOT WARN OTHER DRIVERS BEHIND ME BECAUSE MY HAZARD LIGHTS WOULD NOT TURN ON, I HAD NO ELECTRICAL POWER TO MY CAR. IT ALMOST CAUSED PEOPLE BEHIND ME TO SLAM INTO ME. SINCE THE DEALERSHIP WAS CLOSED ON SUNDAY, I TOOK THE RISK OF GOING TO THE STORE, AND ONCE AGAIN I LOST ALL POWER TO MY CAR HITTING A NEAR BY GARBAGE CAN AND DENTING THE FRONT LEFT SIDE OF MY CAR. I TOOK IT INTO KIA OF TACOMA, THEY TOLD ME TO GET A TUNE UP. NOT LIKING THAT ANSWER, I HAD IT TOWED TO KIA OF PUYALLUP..THEY ARE UNABLE TO FIND THE PROBLEM AND WANT ME TO COME PICK THE CAR UP AND DRIVE IT AROUND AGAIN. AFTER RESEARCHING THIS ON THE INTERNET, I FOUND THERE ARE MANY OTHER PEOPLE THAT THIS IS HAPPENING TOO, AND THERE HAS NOT YET BEEN A RECAL ON THIS CAR. THIS CAR IS A DANGER TO MY LIFE, AND OTHERS AROUND ME. SOMETHING NEEDS TO BE DONE ABOUT THIS RIGHT AWAY BEFORE IT COSTS SOMEBODY THEIR LIFE.*AK",
        "vin": "KNAGD126X25"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/16/2004",
        "dateOfIncident": "11/15/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103914,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED AIR BAG WARNING LIGHT  ILLUMINATED.  DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
        "vin": "KNAGD128625"
    },
    {
        "components": "PARKING BRAKE,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "10/19/2004",
        "dateOfIncident": "09/03/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091556,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE ALARM SYSTEM FAILED . AS A RESULT, A CHILD WAS TRAPPED INSIDE BECAUSE THE VEHICLE DOORS LOCKED.*AK  VEHICLE WAS IN PARK AND STARTING TO SLIP OUT OF PARK AN ROLL WHILE CHILD WAS TRAPPED INSIDE OF THE VEHICLE.   *TC",
        "vin": "KNAGD126X25"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/06/2004",
        "dateOfIncident": "08/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10090517,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY  2002 KIA OPTIMA WAS IN AN ACCIDENT ON AUGUST 30TH 2004.  MY DAUGHTER WAS DRIVING WEST BOUND, A SCHOOL BUS DRIVING EAST BOUND MADE A LEFT TURN IN FRONT OF MY DAUGHTER.  SHE HIT THE BUS AT ABOUT 50 MPH.  NO AIR BAG DEPLOYED.  I AM INTERESTED IN KNOWING IF THIS HAS HAPPENED BEFORE.  IT WAS A FULL FRONTAL IMPACT.  THANK GOD FOR SEAT BELTS.  *AK",
        "vin": "KNAGD126925"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "07/31/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089331,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING,  A BURNING SMELL WAS DETECTED, THEN THE AIR BAG LIGHT CAME ON.  AFTER PULLING INTO A SERVICE STATION THE VEHICLE WOULD NOT START. IT WAS DISCOVERED THE ALTERNATOR, COMPUTER AND AIR BAG MODULE WAS DEFECTIVE.   AFTER THE REPAIR THE AIR BAG LIGHT REMAINED ON.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/31/2004",
        "dateOfIncident": "07/19/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083065,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ROTORS WARPED, NOT WORN OUT, WARPED COMPLETELY AROUND 55,000 MILES.  CAR HAS A 60,000 MILEAGE/5 YEAR BUMPER TO BUMPER WARRANTY AND KIA WILL NOT HONOR IT.   CONTACTED LANGHORNE KIA SERVICE DEPT. AND WAS TOLD THAT I WAS LUCKY THAT THEY LASTED SO LONG.  I WAS INFORMED THAT KIA CHANGED THE WAY THEY MAKE THE ROTORS AND THAT THE NEW ROTORS HEAT QUICKLY CAUSING THEM TO WARP WHEN THE MILAGE IS USUALLY UNDER 30,000 MILES.*AK",
        "vin": "KNADG126825"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2004",
        "dateOfIncident": "11/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080067,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HESITATES WHEN PRESSING ON THE GAS.  IT TAKES APPROXIMATELY 5-10 SECONDS BEFORE THE VEHICLE RESPONDS TO DEPRESSION OF ACCELERATOR PEDAL  CONSUMER INDICATES THAT SHE HAS ALMOST BEEN REAR-ENDED DUE TO STALLING WITHOUT WARNING.  *AK",
        "vin": "KNAGD128025"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/22/2004",
        "dateOfIncident": "08/27/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079670,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG WARNING LIGHT CAME ON 7 TIMES WHILE DRIVING. DEALERSHIP REPLACED THE DRIVER'S SIDE SEAT THAT CONTAINED THE SIDE AIR BAG BECAUSE IT WAS FAULTY,  AND INSTALLED A NEW AIR BAG CONTROL MODULE. ALSO, THEY  REPROGRAMMED THE AIR BAG SENSOR SEVERAL TIMES, BUT THE LIGHT STILL CAME BACK ON.   VEHICLE WAS INVOLVED IN 2 FRONTAL COLLISIONS IN WHICH THE AIR BAGS  DID NOT DEPLOY.  *AK",
        "vin": "KNAGD126625"
    },
    {
        "components": "AIR BAGS,SEAT BELTS,SEATS",
        "crash": true,
        "dateComplaintFiled": "06/08/2004",
        "dateOfIncident": "06/02/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10075894,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE AT A COMPLETE STOP BECAUSE OF ROAD CONSTRUCTION, THE CONSUMER'S  VEHICLE WAS REAR ENDED BY ANOTHER VEHICLE AT 40 MPH. UPON IMPACT,  NONE OF THE FRONTAL AIR BAGS DEPLOYED, AND THE DRIVER'S SIDE SEAT BELT FAILED TO RETRACT. ALSO,  DRIVER'S SIDE SEAT BACK RECLINED BACKWARDS ONTO THE REAR SEAT. DRIVER SUSTAINED SEVERE BRUISES TO CHEST/BREAST BONE/LUNGS/HEART/LOWER ABDOMINAL,  AND LEFT LEG.  *AK   *LA",
        "vin": "KNAGD128325"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/07/2004",
        "dateOfIncident": "02/16/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074935,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A USED KIA OPTIMA 2002 IN JANUARY OF 2003. IT HAD ABOUT 23000 MILES ON IT. WE TOOK A TRIP TO LAKE TAHOE IN FEB.2003 AND ON THE RIDE HOME EVERY TIME I BRAKED COMMING DOWN THE MOUNTAIN THE CAR WOULD JERK AND SHAKE VIOLENTLY. WHEN WE GOT HOME I TOOK THE CAR INTO THE DEALER AND THEY REPAIRED IT FOR ME AFTER I PLEADED AND ARGUED WITH THEM. LESS THAN 8 MONTHS LATER THE SAME POBLEM STARTED HAPPENING AGAIN SO I TOOK MY IN AND THEY AUTOMATICALY PLACED THE BLAME ON ME.  THEY TOLD ME THAT I MUST BE DRIVING MY CAR WAY TO HARD AND DON'T KNOW HOW TO PROPERLY APPLY THE BRAKES. THAT CAME FROM THE SERVICE DEPARTMENT MANAGER. THEY THEN TOLD ME THAT THAY ARE NOT REASPONSIBLE FOR REPAIRES THAT ARE CAUSED BY BAD DRIVING.  WE'LL HERE IT IS LESS THAN FOUR MONTHS LATER AND I'M ABOUT TO PAY ANOTHER $700 FOR A PROBLEM THAT IS NOT MY FAULT AND MY BRAKES ARE THE WORST YET. OH AND BY THE WAY THE LAST TIME THAT I HAD MY CAR FIXED THEY REFUSED TO SHOW ME THE PARTS THAT THEY TOOK OFF MY CAR. SAID THAT IT IS UNUSUAL TO SHOW THE PARTS TO THE OWNER. I FIND THAT STRANGE. SOMEONE NEEDS TO REFRESH THEM ON THE LAWS.  WHEN I PURCHASED MY CAR I ALSO PURCHASED A 5 YR BUMPER TO BUMPER WARRENTY WHICH IS GOOD UNTIL 82000 MILES AND MY CAR KNOW HAS 47000 AND ABOUT TO GO THROUGH ITS THIRD COMPLETE BRAKE JOB.  *AK",
        "vin": "KNAGD126525"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/01/2004",
        "dateOfIncident": "05/31/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074605,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR LOCKS DON'T LOCK CONSISTENTLY.  THE MASTER SWITCH HAS BEEN REPLACED TWICE.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/12/2004",
        "dateOfIncident": "04/12/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066981,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WINDOWS DID NOT ROLL DOWN.  DEALERSHIP  REPLACED WINDOWS ON  SEVEN DIFFERENT OCCASIONS, BUT PROBLEM RECURRED.  *AK",
        "vin": "KNAGD126925"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/21/2004",
        "dateOfIncident": "03/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062726,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT WINDOWS WILL NOT GO UP OR DOWN. YOU CAN HERE THE MOTOR BUT NOTHING IS HAPPENING.  *JB",
        "vin": "KNAGD126X25"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/15/2004",
        "dateOfIncident": "03/08/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063181,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING FROM A STOP VEHICLE HESITATED BEFORE ACCELERATION. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
        "vin": "KNAGD126425"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10070650,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR BRAND NEW ON APRIL 30, 2003 -  INCIDENT #1: JULY 15, 2003, I WAS TRAVELING ABOUT 30-35 MILES PER HOUR EXITING THE MASS PIKE EXIT AT ROUTE 30.  ALL TRAFFIC WAS SLOWING TO EXIT - I APPLIED THE BRAKES - WENT ALL THE WAY DOWN - REALIZED THAT THE BREAKS WERE NOT WORKING - PANICKED - IMPACTED THE VEHICLE IN FRONT OF ME.  THE AIRBAGS DID NOT WORK. INCIDENT #2: AUGUST 8, 2003, WHEN VEHICLE WAS REPAIRED THE OWNER OF BUCCI'S AUTO BODY TOOK THE CAR IN THE PARKING LOT FOR A TEST DRIVE.  AT ABOUT 15 MILES PER HOUR - WHEN BRAKES WERE APPLIED THE FRONT FREEZED UP AND THE BACK PUSHED FORWARD TO CREATE A LUNGE FORWARD EFFECT.  I CONTACTED KIA MOTOR AMERICA IN IRVINE, CA AND HAVE A COMPLAINT FILE NUMBER.  AFTER ABOUT 1 MONTH OF DOING NOTHING I DEMANDED, ON AUGUST 8TH, THAT THEY TOW THE CAR FROM THE BODY SHOP TO BOCH KIA (WHERE THE CAR WAS PURCHASED)AND CHECK OUT THE MASTER CYLINDER/PROPORTIONATE VALUE SYSTEM.  THEY DID SO AND ON AUGUST 12TH I WAS TOLD THAT AN ENGINEER LOOKED AT THE CAR AND FOUND NOTHING WRONG.  KIA REFUSES TO STAND ACCOUNTABLE AND ALLEDGES THAT THE VEHICLE HAS NO PROBLEM.  I AM FORCED TO DRIVE A CAR THAT HAS BAD BRAKES UNTIL 2 MORE INCIDENTS HAPPEN IN ORDER TO PROCEED UNDER THE MASSACHUSETTS LEMON LAW.  EVERY MODEL OF KIA IN 2002 HAS HAD HYDRAULIC AS WELL AS ABS BREAK FAILURE.  SEEMS TO ME THAT KIA NEEDS TO REDESIGN THE BRAKING SYSTEM - OR - PERHAPS TRY THIS NEW TAG LINE IN ADVERTISING:   KIA - BUY OUR CAR - JUST DON'T EVER HAVE TO STOP FAST!",
        "vin": "KNAGD128825"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "09/17/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048165,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH AIR BAG EQUIPMENT ON 2002 KIA OPTIMA.   *MR   A LARGE PIECE OF RUBBER HAD COME OFF THE TIRE OF A SEMI-TRUCK AND WHEN THE CONSUMER TRIED TO AVOID HITTING IT, HE LOST CONTROL OF THE VEHICLE AND HIT A WALL DIVIDER.   *SCC  *JB",
        "vin": "KNAGD128025"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/01/2003",
        "dateOfIncident": "02/14/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10036966,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FEB. 14, 2003, DRIVING A 2002 OPTIMA KIA AND APPLIED BRAKES HARD ABOUT 70 MPH AND CAR WAS COMPLETLY UNCONTROLLABLE SENDING ME OFF THE ROAD INTO VARIOUS TREES EVENTUALLY HITTING A TREE HEAD ON. CAR CAUGHT FIRE AND COMPLETELY BURNT DOWN. I WAS SENT TO A TRAUMA UNIT AT FOREST GENERAL IN HATTIESBURG MS WITH A PUNCTURED LUNG , SPLEEN REMOVED AND EXTREME DAMAGE TO THE RIBS WHICH I AM PRESENTLY IN PAIN MANAGEMENT FOR AND ON LTD.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "07/18/2003",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10028547,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "WAGNER ELEC. BRAKE/CLUTCH",
                "productMake": "WAGNER",
                "productModel": "BRAKE/CLUTCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "WHILE SLOWING DOWN TO EXIT OFF MASS PIKE, I WAS DOING ABOUT 30-35 AND SO WERE THE OTHER CARS, I BRAKED TO CONTINUE TO SLOW - THE CAR DID NOT STOP AND APPLIED THE BRAKES ALL THE WAY DOWN AND THE CAR STILL DID NOT STOP AND I PANICKED KNOWING THE CAR WAS NOT STOPPING AND FINALLY MADE IMPACT INTO THE VEHICLE IN FRONT OF ME.  *JB",
        "vin": "KNAGD128825"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "02/14/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10016361,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "JAN. 10TH- BRAKED TO AVOID ACCIDENT ON I-59 AT 70 MPH AND CAR WAS COMPLETELY UNCONTROLLABLE-RAN OFF I-59 AND COLLIDED WITH TREE  FEB. 14- BRAKED AGAIN AT HIGH SPEED TO AVOID ACCIDENT AND CAR WAS UNCONTROLLABLE. HIT TREE AND ALMOST LOST LIFE. WOULD HAVE LOST LIFE HAD NOT SOMEONE PULLED ME FROM VEHICLE, VEHICLE CAUGHT FIRE AND BURNED DOWN COMPLETELY.   *NLM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "03/04/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10011204,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN A FRONTAL COLLISION, AND THE AIR BAGS DID NOT DEPLOY.*JB....*AK",
        "vin": "1HGCG16431A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/29/2002",
        "dateOfIncident": "11/28/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770242,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY.  DT",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/04/2002",
        "dateOfIncident": "10/06/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022081,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "OPTIMA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE STEEL PROD. CO.",
                "productMake": "FIRESTONE",
                "productModel": "FIRESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER STATED THAT WHILE DRIVING AT ANY SPEED AND NO WARNING THE FRONT RIGHT TIRE HAVE TREAD SEPARATION CAUSING A TIRE BLOW OUT. DEALER NOTIFIED SIZE#LT26575R16.  DOT# UNKNOWN.   MR  *TT",
        "vin": "1FTSW1F4YED"
    }
]