[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2019",
        "dateOfIncident": "01/12/2019",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166790,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 01/12/2019 I WAS TRAVELING STRAIGHT DOWN A LEVEL COUNTRY ROAD WITH 1 PASSENGER IN THE FRONT PASSENGER SEAT AT ABOUT 45 MPH WHEN FOR NO REASON THE PASSENGER SIDE AIR BAG DEPLOYED WITHOUT ANY WARNING.  AFTER REGAINING CONTROL OF THE VEHICLE WE PULLED TO THE SIDE OF THE ROAD AND TOOK A FEW MINUTES TO CALM DOWN AND FIGURE OUT WHAT JUST HAPPENED AND CLEAR ALL THE SMOKE FROM THE INTERIOR OF THE VEHICLE FROM THE AIR BAG.  MY FRIEND IN THE PASSENGER SEAT WAS SORE BUT NOT INJURED AND BOTH OUR EARS WERE RINGING.  IT SOUNDED LIKE A GUN FIRED IN THE CAR.  I CALL LINCOLN CUSTOMER SERVICE AND WAS TOLD THERE WAS NOT ANY RECALLS ON THE VEHICLE AND DUE TO ITS AGE THEY WOULD NOT PROVIDE ANY ASSISTANCE TO GET IT REPAIRED.  THE SIDE OF THE PASSENGER SEAT IS ALL TORE APART.",
        "vin": "1LNHM82W52Y"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/09/2018",
        "dateOfIncident": "05/09/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092770,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I'VE CHANGE THE BRAKE SWITCH ON MY CAR OVER FOUR TIMES AND IT WENT OUT AGAIN.  MT CAR WILL NOT CHAGE GIER WHEN THIS HAPPENS.  I WOULD LIKE TO KNOW IF THERE HAS BEEN A RECALL WITH THIS PROBLEM. THIS  HAPPENS AFTER THE VEHICLE IS PARK.",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "01/19/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063677,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANFIOLD",
        "vin": "I LNHM83W32"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/07/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873106,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL ?  MY WIFE AND FRIEND DRIVING 30 MPH IN NO TRAFFIC, AND THE DRIVERS SEAT AIR BAG DEPLOYED. THERE WAS NO IMPACT TO THE VEHICLE. SHE SAID IT SOUNDED LIKE A GUN SHOT AND THE YELLOW BAG CAME OUT OF THE DRIVERS SEAT. DRIVING STRAIGHT AHEAD ON A COUNTRY ROAD.",
        "vin": "1LNHM82W72Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/10/2014",
        "dateOfIncident": "11/04/2014",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653873,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 LINCOLN TOWN CAR. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 10 MPH, THE AIR BAG DEPLOYED INADVERTENTLY. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE AIR BAG SENSOR NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 159,000. UPDATED 12/30/14*LJ   UPDATED 05/27/2015  *JS",
        "vin": "1LNHM82W92Y"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/14/2012",
        "dateOfIncident": "08/02/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10484668,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 LINCOLN TOWN CAR. THE CONTACT STATED THAT WHILE DRIVING 70 MPH, THE STEERING WHEEL SUDDENLY BECAME LOOSE AS THE VEHICLE BECAME UNCONTROLLABLE WITHOUT WARNING. THE VEHICLE ALSO WENT AIRBORNE, ROLLED OVER AND SPUN THREE TIMES BEFORE COMING TO A STOP. THE FRONT WINDSHIELD WAS FRACTURED AND THE REAR WINDSHIELD BECAME DETACHED FROM THE VEHICLE.  NONE OF THE AIR BAGS DEPLOYED. THREE OCCUPANTS AND A PET DOG WERE SEVERELY INJURED AND WERE TRANSPORTED TO THE HOSPITAL FOR TREATMENT. A POLICE REPORT WAS FILED OF THE INCIDENT. THE VEHICLE WAS DESTROYED AND WAS INSPECTED FOR THE CAUSE OF THE STEERING OR AIR BAG FAILURES. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 129,000. UPDATED 08/06/13*LJ    THE CONSUMER STATED THE VEHICLE WAS INSPECTED BY HERNDON AND ASSOCIATES EGINEERING FIRM. THE REPORT WAS SENT TO FORD, WHICH FORD DISSMISSED IN FOUR (4) DAYS. UPDATED 08/5/2013 *JS",
        "vin": "1LNHM82WX2Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365775,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 LINCOLN TOWN CAR.  THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE VEHICLE BEGAN JERKING EXCESSIVELY AND EXHIBITING LOUD, ABNORMAL NOISES FROM UNDER THE VEHICLE.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DISCOVERED THAT ONE OF THE CYLINDERS MALFUNCTIONED AND CAUSED THE VEHICLE TO RUN ON SEVEN CYLINDERS INSTEAD OF EIGHT. HE ALSO DISCOVERED THAT COOLANT WAS LEAKING INTO THE ENGINE. THE VEHICLE WAS TAKEN TO THE DEALER WHO THEN REPLACED THE MANIFOLD AND THE PLUG WIRE FOR THE CYLINDER.  THE CONTACT CALLED THE MANUFACTURER REGARDING REIMBURSEMENT AND THE MANUFACTURER WOULD NOT PROVIDE ASSISTANCE TO THE CONTACT.  THE CONTACT STATED THAT IF THE VEHICLE WAS ON THE HIGHWAY WHEN THE FAILURE OCCURRED, IT COULD HAVE POTENTIALLY LED TO A CRASH.  THE FAILURE MILEAGE WAS 98,000.",
        "vin": "1LNHM81W62Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "01/31/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304710,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HEARING C. THE RECENT SUDDEN ACCELERATION WITH TOYOTA VEHICLES, I AM PROMPTED TO WRITE YOU AGAIN REGARDING THE SUDDEN ACCELERATION WITH MY 2002 LINCOLN TOWNCAR.  WHILE ATTEMPTING TO DRIVE UP MY DRIVEWAY, AND PARK IN MY GARAGE, TRAVELING C. 5 MPH, THE CAR SUDDENLY SOUNDED AS IF WERE REVVING AND LURCHED FORWARD.  THE AGENT SENT FROM MY INSURANCE COMPANY,  RECORDED 35 FEET OF SKID MARKS.  BRAKES DID NOT WORK AND MY VEHICLE AND I CRASHED INTO MY DEN.  I DID REPORT THIS INCIDENT TO FORD AND TO YOU AT THE TIME.  MY COUSIN, IN ILLINOIS, HAD THE SAME MAKE AND YEAR AUTOMOBILE, AND HAD THE INCIDENT OCCUR THREE TIMES.  IT IS A FRIGHTENING OCCURRENCE AND ONE FEELS TOTALLY HELPLESS.  WHAT CAN BE DONE TO ELIMINATE THIS FROM OUR DRIVING EXPERIENCE? *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/27/2010",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302489,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 LINCOLN TOWNCAR CAR HAS AUTO LOCK FEATURE LOCKING ALL DOORS WHEN MOVING FORWARD. AFTER STOPPING THOSE IN THE FRONT SEAT CAN EXIT BY USING DOOR HANDLE. THOSE IN REAR SEAT MUST FIRST USE THE UNLOCK PLUNGER. IN EVENT OF ACCIDENT IF REAR PASSENGERS DO NOT KNOW THIS THEY ARE TRAPPED IN CAR. *CW",
        "vin": "1LNHM82W22Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2010",
        "dateOfIncident": "01/21/2010",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10301846,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING IN A DRIVE THRU MY 2002 LINCOLN TOWNCAR CAUGHT A BLAZE UNDER THE HOOD. *TR",
        "vin": "1LNHM82W62Y"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/04/2009",
        "dateOfIncident": "07/20/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279343,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE SAFETY BELT ON MY 2002 LINCOLN TOWN CAR NO LONGER LATCHES AND APPEARS TO BE LOCKED PREVENTING THE SEAT BELT FROM BEING CONNECTED/LATCHED.  THE DASH BOARD SEAT BELT INDICATOR (NORMALLY LIT UP WHEN A SEAT BELT IS NOT ATTACHED) DOES NOT LIGHT UP.       THIS PROBLEM STARTED ONLY A COUPLE WEEKS AGO AND CONTINUES.    THIS CAR HAVE LESS THAN 48,000 MILES AND IS USED TO DRIVE TO WORK AND BACK.    BECAUSE I AM UNABLE TO LATCH MY DRIVER SEAT BELT THIS IS A MAJOR SAFETY CONCERN AND I WANTED TO REPORT IT TO YOUR AGENCY.  AS OF THIS WRITING I HAVE NOT HAD A FORD SERVICE REP LOOK AT THIS, BUT INTEND TO SHORTLY.    BECAUSE I HAVE NOT YET TAKEN MY CAR INTO A FORD SERVICE CENTER FOR EXAMINATION I AM UNABLE TO REPORT WHAT WAS DONE TO CORRECT THIS FAILURE OR PARTS NEEDED/REPLACED. *TR",
        "vin": "1LNHM83W12Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/04/2009",
        "dateOfIncident": "05/13/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272846,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RE 2002 LINCOLN TC CARTIER L. THE MOST USELESS AND DANGEROUS ACCESSORY ON THIS AUTO IS THE ADJUSTABLE BRAKE & ACCELERATOR PEDAL. THERE DOESN'T APPEAR THAT THERE IS ANY WAY ONE MAY ADJUST EITHER/OR AS THEY ADJUST SIMULTANEOUSLY.  RECENTLY THIS \"ACCESSORY\" COST ME $1000.00. MY WIFE WAS STOPPED, WAITING ON THE LIGHT TO CHANGE AND HAD HER FOOT PARTIALLY ON THE BRAKE PEDAL AND WHEN SHE PUSH ON THE BRAKE PEDAL, SHE ALSO PUSHED ON THE ACCELERATOR CAUSING HER TO REAR-END THE VEHICLE IN FRONT OF HER. ONCE THE BRAKE PADS WEAR, THE BRAKE PEDAL AND ACCELERATOR IS AT THE SAME LEVEL. THIS IS NO JOKE. THIS HAS HAPPEN TO ME TWICE, FORTUNATELY IN BOTH INSTANCES THERE WERE NO PEOPLE OR VEHICLE (S) IN FRONT OF ME.- ( NO EXCUSES, JUST FACTS). I WOULD LIKE TO KNOW HOW MANY OTHERS HAVE HAD THE SAME EXPERIENCE (REPORTED TO YOU)?  THANK YOU. PLEASE INVESTIGATE THIS ISSUE. EZRA RACHAL. *TR",
        "vin": "1LNHM85WX2Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/05/2009",
        "dateOfIncident": "03/28/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10267735,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 LINCOLN TOWN CAR.  WHILE DRIVING APPROXIMATELY 15 MPH, THE CONTACT DROVE OVER A POTHOLE AND THE FRONT PASSENGER SIDE AIR BAG DEPLOYED.  THE PASSENGER SUFFERED MINOR INJURIES.  THE VEHICLE WILL BE TAKEN TO THE DEALER.   THE FAILURE MILEAGE WAS 153,000 AND CURRENT MILEAGE WAS 154,000.    UPDATED 5/27/09 *CN",
        "vin": "1LNHM82W32Y"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2009",
        "dateOfIncident": "10/05/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257974,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKE PEDAL IS APPLIED FOR A LONG TRAFFIC LIGHT STOP, I COULD SMELL BURNING PLASTIC. AFTER SEVERAL WEEKS OF THIS MY CAR WOULD NOT COME OUT OF PARK. FOUND THE HARNESS PLUG TO THE BRAKE LIGHT SWITCH MELTED. I AM CURIOUS AS TO WHY THE FUSE DIDN'T BLOW ?. I REPLACED THE PLUG WITH NEW CONNECTORS AND A FEW WEEKS LATER THE SAME THING IS HAPPENING - WIRES ARE MELTED AND THE FUSE IS NOT TRIPPED.",
        "vin": "1LNHM82W32Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/23/2008",
        "dateOfIncident": "03/01/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246525,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 LINCOLN TOWN CAR.  WHENEVER THE CONTACT DEPRESSES THE BRAKE PEDAL, THE ACCELERATOR PEDAL IS DEPRESSED INSTEAD.  THIS CAUSES THE VEHICLE TO UNEXPECTEDLY SPEED UP.  THE FAILURE RECENTLY OCCURRED WHILE DRIVING 15 MPH.  HE HAS TAKEN THE VEHICLE TO THE DEALER NUMEROUS TIMES, BUT THEY STATED THAT NOTHING COULD BE DONE.  THE DEALER ADVISED HIM TO BE MORE CAREFUL WHEN DEPRESSING THE BRAKE PEDAL AND STATED THAT THE FAILURE MAY BE BECAUSE AN ADJUSTABLE BRAKE PEDAL WAS INSTALLED IN HIS VEHICLE.  HE BELIEVES THAT THERE SHOULD BE SOME SORT OF REPAIR OR SOLUTION TO THIS FAILURE.  THE CONTACT FEELS UNSAFE DRIVING THE VEHICLE BECAUSE HE COULD MISTAKENLY DEPRESS THE ACCELERATOR PEDAL AND CAUSE A CRASH.  THE FAILURE MILEAGE WAS 30,000.  UPDATED 11/07/08.  *LJ  UPDATED 11/07/08. *JB",
        "vin": "1LNHM82WX2Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/29/2007",
        "dateOfIncident": "10/09/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207330,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 LINCOLN TOWN CAR.  THE CONTACT STATED THAT THE VEHICLE LUNGED FORWARD AND CRASHED INTO THE REAR OF ANOTHER VEHICLE.  SHE WAS UNABLE TO STOP THE VEHICLE UNTIL ONE MINUTE LATER.  THE MECHANIC AND DEALER WERE UNABLE TO DIAGNOSE THE CAUSE OF THE FAILURE.  THE CURRENT AND FAILURE MILEAGES WERE 49,000.",
        "vin": "1LNHM82W92Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2007",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10184974,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING AT 65 OR 70 MPH ON A CALIFORNIA HIGHWAY LAST SUMMER, THE FRONT  PASSENGER SIDE AIR BAG DEPLOYED (CAUSING PAIN, BRUISING, ETC. BUT  NOTHING APPARENTLY PERMANENT - NO PERSONAL INJURY CLAIM HAS EVER BEEN CONTEMPLATED).  IT WAS SHOCKING IN THAT THERE WAS NO CRASH OF ANY  KIND.  THE PASSENGER THOUGHT THE BAG DEPLOYED FOR NO REASON.  THE DRIVER, NOT BEING CERTAIN, HAD THE IMPRESSION THAT SOME OBJECT (E.G., A SMALL PIECE OF TIRE RUBBER) WAS KICKED UP AGAINST THE CAR FROM THE  ROADWAY.  THERE ARE NO SIGNS OF ANY IMPACT WITH ANYTHING.  THE BAG TORE PART OF THE LEATHER SEAT (BEYOND THE SEAM).  THIS OCCURRED NEAR THE 5 YEAR POINT RE: WARRANTY.  THE MANUFACTURER, FORD MOTOR COMPANY, SEEMED RESPONSIVE AT FIRST AND ASKED THAT WE TAKE THE CAR TO THE DEALER.  I DID SO, AND WAS INFORMED BY THE SERVICE DEPARTMENT THAT FORD INFORMED THEM IT WAS REFERRED TO THEIR LEGAL DEPARTMENT AND, THUS, THEY COULD NOT EVEN LOOK AT, LET ALONE REPAIR IT.  THE LEGAL DEPARTMENT TOOK SEVERAL WEEKS TO ULTIMATELY SEND A LETTER STATING THEY HAD NO RESPONSIBILITY.  OUR INSURANCE CARRIER IS UNCERTAIN AS TO HOW TO HANDLE THE CLAIM.  THE AIR BAG SYSTEM IN THIS LINCOLN TOWN CAR IS OBVIOUSLY DEFECTIVE.  IS THIS A KNOWN DEFECT WITH THIS MODEL, ETC.?  WHAT RECOURSE DO WE HAVE AGAINST FORD MOTOR COMPANY FOR FAILURE TO FULFILL ITS MORAL AND LEGAL RESPONSIBILITY TO REPLACE THE AIR BAG AND REPAIR THE SEAT?  IS THERE NOT A FEDERAL AGENCY THAT CAN BE HELPFUL IN SUCH MATTERS?  NOTE: THE DAMAGE OCCURRED IN EARLY JUNE, 2006 (ENTERED 1ST BELOW TO ALLOW FOR TRANSMISSION OF CLAIM). *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/11/2007",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10184737,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THURSDAY, MARCH 1, 2007, MY DAUGHTER WAS DRIVING MY LINCOLN TOWN CAR APPROXIMATELY 55 MILES PER HOUR. FOR NO APPARENT REASON, THE PASSENGER RIGHT SIDE AIRBAG INFLATED. ALSO CAUSING INJURIES TO MY DAUGHTER, INJURIES INCLUDES A BRUISED EAR DRUM AND AN ASTHMA ATTACK.  *JB",
        "vin": "1LNHM81W62Y"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/06/2006",
        "dateOfIncident": "12/04/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175317,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 30 MPH ON A CITY STREET, SMOKE ERUPTED FROM ALL OF THE AIR VENTS ON THE DASH, AND FROM UNDERNEATH THE HOOD.  THERE WERE NO VISIBLE FLAMES PRESENT.  THE CONTACT TURNED THE ENGINE OFF, WHICH STOPPED THE SMOKE.  AFTERWARDS, AS SOON AS THE ENGINE WAS RESTARTED, SMOKE WAS AGAIN PRESENT.  THE VEHICLE WAS TOWED TO A DEALER, WHO DETERMINED THE WINDSHIELD WIPER MOTOR SHORTED OUT AND NEEDED TO BE REPLACED.  THERE WAS A NHTSA RECALL, # 01V258000, REGARDING THE WINDSHIELD WIPER/WASHER MOTOR.  THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.  THE MANUFACTURER WAS ALERTED.",
        "vin": "1LNHM82WX2Y"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/14/2006",
        "dateOfIncident": "09/08/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168269,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE TRAVELING THE I-40 IN AZ BEHIND A TRACTOR/TRAILER RIG. THE RIG THREW UP A ROCK. IT HIT OUR CAR. WE LOOKED AT OUR WINDSHIELD THINKING THE ROCK HIT THERE AND SAW NOTHING SO WE PROCEEDED. LATER, WE HEARD A STRANGE SOUND. I LOOKED IN THE REAR VIEW MIRROR AND SAW SOMETHING FLY OFF. WE STOPPED AND DISCOVERED PART OF OUR SUNROOF HAD BROKEN APART AND FLEW OFF. WE DUCT TAPPED THE REMAINING SUNROOF AND PROCEEDED AT A VERY SLOW SPEED. IT OCCURRED TO US IF A MOTORCYCLE OR CONVERTIBLE WOULD HAVE BEEN BEHIND US THEY COULD HAVE BEEN HIT BY THE GLASS. THANK GOD, THEY WEREN'T THERE. WE COULD HEAR PIECES OF THE GLASS FALLING ON THE SUNSHIELD. THANKFULLY, WE WEREN'T CUT. THE DEALER TOLD US THAT SUNROOF GLASS ISN'T LAMINATED OR OF THE QUALITY OF WINDSHIELD GLASS. IS IT POSSIBLE TO REQUIRE A DISCLAIMER OR A SAFER GLASS FOR SUNROOFS? *JB",
        "vin": "1LNHM82W92Y"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/29/2006",
        "dateOfIncident": "07/11/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10166859,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 30 MPH ON A DRY HIGHWAY, ANOTHER VEHICLE HIT THE CONTACT'S VEHICLE HEAD ON CAUSING EXTENSIVE DAMAGE TO THE FRONT END.  NEITHER THE PASSENGER NOR DRIVER'S SIDE FRONT AIR BAG DEPLOYED.  THERE WERE MINOR INJURIES SUSTAINED AND A POLICE REPORT WAS TAKEN.  SEAT BELTS WERE WORN DURING THE INCIDENT AND FUNCTIONED PROPERLY.",
        "vin": "1LNHM81W32Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/24/2006",
        "dateOfIncident": "08/06/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10166414,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE PASSENGER SIDE AIR BAG DEPLOYED FOR THE 2ND TIME.  ON EACH INCIDENT, THE CONTACT WAS DRIVING 40-45 MPH ON A DRY COUNTRY ROAD.  THE DEALERSHIP DETERMINED THAT GRAVEL CAUSED THE DEPLOYMENT.  THE DEALERSHIP ALSO SAID THERE WAS A DING ON THE BELLY PAN OF THE BODY OF THE VEHICLE.  THE CONTACT STATED THERE ARE NO MARKS ON THE VEHICLE.  THERE WERE NO LIGHTS ILLUMINATED IN THE VEHICLE PRIOR TO EITHER INCIDENT.    THE PASSENGER WAS INJURED WHEN THE AIR BAG DEPLOYED. UPDATED 09/05/06. *JB",
        "vin": "1LNHM82W62Y"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/25/2006",
        "dateOfIncident": "05/03/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158247,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE TURNING LEFT, THE VEHICLE WAS HIT IN THE PASSENGER SIDE BETWEEN THE TIRE AND THE DOOR HOWEVER THE AIR BAG DID NOT DEPLOY.  THERE WAS NO INDICATION BEFORE THE CRASH THAT THE AIR BAG WOULD NOT DEPLOY OTHER THAN THE CONTACT  STATED THE AIR BAG LIGHT HAD BEEN ILLUMINATING INTERMITTENTLY FOR SOME TIME.  A POLICE REPORT WAS FILED.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP WHO DETERMINED THE VEHICLE WAS TOTALED HOWEVER; NO DETERMINATION WAS MADE AS TO WHY THE AIR BAG DID NOT DEPLOY.",
        "vin": "1LNHM82W034"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/14/2006",
        "dateOfIncident": "04/14/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155343,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTO DOOR LOCKS AFTER LOCKING ALL DOORS DO NOT UNLOCK REAR DOORS AFTER STOPPING AND EXITING CAR. ONE MUST MANUALLY UNLOCK THEM. IN A EMERGENCY ONE NOT FAMILIAR WOULD BE TRAPPED IN CAR.  *NM",
        "vin": "1LNHM82W22Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/13/2006",
        "dateOfIncident": "01/27/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152642,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) 2002 LINCOLN TOWN CAR, VIN# [XXX]  WITH APPROXIMATELY 76,000 MILES AND OUT ORIGINAL WARRANTY.  NO PREVIOUS WARNINGS WERE GIVEN.   (2) PASSENGER SIDE AIR BAG INADVERTENTLY DEPLOYED WITHOUT BEING INVOLVED IN AN ACCIDENT OR IMPACT.  THIS INCIDENT OCCURRED WHILE DRIVING APPROXIMATELY 45 MPH ON A GRAVEL COUNTY ROAD IN COTTON COUNTY, OKLAHOMA.   WHEN THE AIR BAG DEPLOYED, IT FRIED THE SENSOR ASSEMBLY CONTROL AND THE SAB SENSOR.  IT ALSO RIPPED THE PASSENGER SIDE SEAT BACK AND SIDE OF SEAT.  ESTIMATE AT BODY SHOP CAME UP WITH $1,506.00 DAMAGES AND I HAD TO PAY THEM $ 73.98 TO RUN TEST ON AIR BAG SYSTEM.  AT PRESENT, NONE OF THE OTHER AIR BAGS ARE WORKING NOW BECAUSE OF THIS FAILURE.  THIS ACCORDING TO FORD DEALER SERVICE AND BODY SHOPS.  (3) EXTENDED WARRANTY WITH DIFFERENT COMPANY THAN FORD.  EXTENDED WARRANTY COMPANY SAID IT WOULD REPLACE IF FORD DEALER WOULD RUN TEST ON CAR AND FOUND FAULT WITH AIR BAG SYSTEM.   BILLINGSLEY FORD OF LAWTON, OKLAHOMA RAN TEST ON THIS CAR AND CAME UP WITH CONCLUSION THAT AIR BAG WAS WORKING PROPERLY.  EXTENDED WARRANTY ADVISED ME TO CALL MY CAR INSURANCE CARRIER.  I HAVE DONE THIS AND I AM WAITING ON THEIR DECISION.  CAR HAS NOT BEEN REPAIRED AT THIS TIME.   *JB UPDATED 07/16/2012  *JS    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "1LNHM83W42Y"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/01/2006",
        "dateOfIncident": "02/23/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10151562,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 55MPH, THE VEHICLE WAS HIT FROM THE REAR CAUSING IT TO HIT A METAL FENCE.  NEITHER AIR BAG DEPLOYED.   THE DEALERSHIP ADVISED THE CONTACT TO NOTIFY FORD MOTOR COMPANY, WHICH HAS NOT BEEN DONE.  THE VEHICLE HAD EXTENSIVE DAMAGE.  SEAT BELTS WERE IN USE, HOWEVER INJURIES WERE SUSTAINED AND THERE WAS A POLICE REPORT FILED.",
        "vin": "1LNHM81W82Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/29/2005",
        "dateOfIncident": "07/16/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144296,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 LINCOLN TOWN CAR. WHEN THE CONSUMER ACCELERATED MERGE AND PASS OVER INTO THE SECOND LANE, THE CAR SPED FASTER THAN SHE WAS CONTROLLING.  *TS  THE DEALERS ONLY LOGICAL EXPLANATION WAS THAT THE FLOOR MAT PROBABLY BECAME ENTANGLED UNDER THE ACCELERATOR.  *JB",
        "vin": "1LNHM83W42Y"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "08/11/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2002 LINCOLN TOWN CAR RIGHT REAR TIRE BLEW OUT.*MR  THERE WAS A NAIL FOUND IN THE TIRE, THE CONSUMER BELIEVED THE TIRE SHOULD HAVE JUST GONE FLAT AND BLOW OUT. *JB",
        "vin": "1LNHM82WX2Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/01/2005",
        "dateOfIncident": "06/26/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126799,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTACT STATES VEHICLE WAS TRAVELING DOWN A DIRT ROAD  AND THE PASSENGER SIDE AIR BAG DEPLOYED. HE  TOOK VEHICLE  TO A DEALER.*AK  THE DEALER CLAIMED THAT THE AIR BAG REPAIR WOULD NOT BE COVERED UNDER WARRANTY.  THE CONSUMER CONTACTED THE MANUFACTURER BUT THEY PROVIDED NO ASSISTANCE.  *NM",
        "vin": "1LNHM82W62Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/11/2004",
        "dateOfIncident": "05/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102710,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKE  PEDAL IS  DEPRESSED VERY HARD AND  THE FOOT IS OVERHANGING THE BRAKE PEDAL (NOT ENTIRELY ON THE PEDAL) THE FOOT ALSO HITS THE ACCELERATOR PEDAL. THE CAR IS THEN GIVEN GAS AND MOVES FORWARD AND THE HARDER YOU PRESS ON THE BRAKE, THE MORE THE ACCELERATOR IS DEPRESSED.  IN OTHER WORDS, THE BRAKE PEDAL WILL DEPRESS LOWER THAN THE ACCELERATOR PEDAL AND OFTEN YOUR FOOT HITS BOTH. THIS HAS CAUSED ME TO PULL INTO TRAFFIC THREE TIMES WHEN STOPPED AT A LIGHT. VERY DANGEROUS. MY LOCAL DEALER SAYS THAT IS JUST THE WAY THE CAR IS MADE.  *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "10/09/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE ACCELERATED WITHOUT WARNING.    THE MANUFACTURER ATTACHED  A RECORDER TO  THE COMPUTER AND IT SHOWED NO DEFECTS.  *JB   THE VEHICLE ACCELERATED AT FULL THROTTLE WHEN FIRST STARTING AND WOULD BE EXTREMELY HARD TO STOP.   *SC",
        "vin": "1LNHM83W72Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/25/2004",
        "dateOfIncident": "10/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096396,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AT APPROX. 8 PM ON SAT. OCT.9 MY WIFE AND I WERE RETURNING HOME, TRAVELING ON RT. 95 NORTHBOUND IN THE CENTER LANE OF 3, GOING AT THE SPEED LIMIT OF 70 MPH. WITHOUT WARNING THE SIDE AIR BAG ON THE DRIVER'S SIDE DEPLOYED.LUCKILY THERE WERE NO CARS ON EITHER SIDE OF US,AND WE MANAGED TO GET THE CAR UNDER CONTROL AND OFF THE HIGHWAY.WE INSPECTED THE CAR AND COULD NOT FIND ANY DAMAGE.ALTHOUGH WE WERE PRETTY SHOOK UP,WE WERE NOT INJURED(DUE TO THE LACK OF TRAFFIC).AFTER SEVERAL CALMING MINUTES WE CONTINUED TO OUR HOME.OUR CAR IS A 2002 LINCOLN TOWN CAR.WE TOOK THE CAR TO WHERE WE PURCHASED AND SERVICED THE CAR(WALLACE LINCOLN/MERCURY/VOLVO-3801 SE FEDERAL HIGHWAY,STUART FL 34997,772-283-6000)ON MONDAY(WE HAVE AN ORIGINAL AND EXTENDED WARRANTY CONTRACT).WALLACE GAVE US A RENTAL CAR AND SAID THEY WOULD CHECK IT OUT.THE NEXT DAY WALLACE SERVICE MGR.(RUSS ELLIS)REPORTED THAT NOTHING WAS WRONG WITH THE CAR EXCEPT FOR THE UNEXPLAINED DEPLOYMENT OF THE AIRBAG.SINCE THE WARRANTY WAS WITH FORD,A FORD ENGINEER HAD TO COME TO INSPECT THE CAR.FINALLY ON OCT. 20 HE CAME AND REPORTED A SMALL DENT ON THE CAR UNDERSIDE WAS THE RESULT OF RUNNING OVER SOMETHING WHICH CAUSED THE DEPLOYMENT OF THE SIDE IMPACT AIRBAG.WALLACE THEREFORE STATED THEY WOULD NOT COVER REPAIRS BECAUSE OF FORD REPORT.WE VISITED WALLACE TO INSPECT \"DENT\",AND COULD NOT UNDERSTAND HOW THIS COULD RESULT IN DEPLOYMENT.COMPLAINED TO GM AND SERVICE ADVISOR WHO EXPRESSED SYMPATHY AND AGREED TO CONTACT FORD UPPER-LEVEL.NO REPLY AS YET,BUT WE BELIEVE IT WILL BE NEGATIVE.THIS IS CERTAINLY A SAFETY PROBLEM-DEPLOYMENT OF SIDE AIRBAGS WITHOUT A SIDE IMPACT IS DANGEROUS.UNDER CAR IMPACTS COULD CAUSE ACCIDENTS-EVEN DEATHS.*AK",
        "vin": "1LNHM81W32Y"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "08/15/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091000,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 LINCOLN TOWNCAR AT 51200 MILE I DISCOVERED THAT THE DOOR HING ON THE DRIVERS DOOR CAUSED THE DOOR TO MAKE NOISE WHEN YOU OPENED AND CLOSED IT.I DISCOVERED THE THE DOOR HING WAS DEFECTIVE. I FEAR THAT THE DOOR MAY COME OPEN IF I HIT A BUMP. THE CAR HAS NEVER BEEN WRECKED OR MISTREATED. THIS IS CLEARLY A FACTORY  DEFECT AND LINCOLN SAID THEY WILL DO NOTHING ABOUT IT.",
        "vin": "1LNHM82W12Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/09/2004",
        "dateOfIncident": "07/09/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081652,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT HE HAD A VEHICLE THAT WAS A POTENTIAL DANGER.  VEHICLE SURGED FORWARD WHEN COMING TO A STOP OR SLOWING DOWN TO A STOP.  BECAUSE OF THIS BEHAVIOR OF VEHICLE CONSUMER  ALMOST  HIT A PEDESTRIAN THE OTHER DAY JUST AS VEHICLE CAME TO A STOP, A LADY STEPPED OFF THE CURB, AND THAT MOMENT,  VEHICLE SURGED FORWARD.  VEHICLE MIGHT GO FOR A WEEK OR MORE AND NOT DO IT. THEN, ALL OF A SUDDEN  START AGAIN. WHEN THIS HAPPENED VEHICLE RACED,  AND CONSUMER HAD TO CUT THE VEHICLE OFF SO THAT IT WILL NOT RUN AWAY.  *AK",
        "vin": "1LNHM82W42Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/05/2004",
        "dateOfIncident": "03/17/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072156,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FOOT PEDAL/FRONT SEAT VIBRATED.  DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
        "vin": "1LNHM82W81Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/08/2004",
        "dateOfIncident": "02/25/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066949,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HAD DIFFICULTY GETTING  THE VEHICLE REPAIRED AFTER HER BROTHER HAD AN ACCIDENT IN THE VEHICLE.   *PH   THE ACCELERATOR PEDAL WOULD STICK.  THIS PROBLEM CAUSED THE ACCIDENT IN WHICH THE CONSUMER'S   BROTHER TURNED THE STEERING WHEEL AND THE GAS PEDAL WENT TO THE FLOOR AND ACCELERATED AT A HIGH SPEED AND RAN INTO ANOTHER DRIVER.   *SC  *JB",
        "vin": "1LNHM82W52Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/26/2004",
        "dateOfIncident": "02/25/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065299,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL WENT TO THE FLOOR AND ACCELERATED AT A HIGH RATE.   *LA  VEHICLE WAS INVOLVED IN AN ACCIDENT DUE TO PROBLEMS WITH THE ACCELERATOR PEDAL AND HIGH RATE ACCELERATION.  *MR",
        "vin": "1LNHM82W52Y"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/14/2004",
        "dateOfIncident": "09/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10062157,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONTAL COLLISION 50MPH, NONE OF THE AIRBAGS DEPLOYED ON MY 2002 LINCOLN TOWNCAR. MY INSURANCE CO. SAID  CAR IS TOTAL LOSS ACCIDENT  & NOT REPAIRABLE, WHEN I CONTACTED TO MY LOCAL FORD/LINCOLN DEALER & THE COMPANY ITSELF, I ASK MY CAR IS TOTAL LOSS & NONE OF THE AIRBAGS DEPLOYED, THEY SAID SOMEONE WILL GET BACK TO YOU SOON, AFTER 6 MONTHS NO ONE GET BACK TO ME, BUT INSURANCE CO PAID THE CAR. *AK",
        "vin": "1LNHM82W82Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/26/2004",
        "dateOfIncident": "12/09/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053996,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPACING BETWEEN THE BRAKE PEDAL AND GAS PEDAL IS TOO CLOSE.  DRIVER'S FOOT GETS CAUGHT BETWEEN THE PEDALS  WHEN CHANGING FROM ONE PEDAL TO THE OTHER. THIS  RESULTED IN VEHICLE CRASHING INTO ANOTHER VEHICLE WHILE PULLING INTO A PARKING SPACE DUE TO FAIILURE TO USE BRAKE PEDAL.  *AK  *MR",
        "vin": "1LNHM82W12Y"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/26/2004",
        "dateOfIncident": "12/30/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057722,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING AND PUTTING VEHICLE INTO DRIVE, THE AUTOMATIC DOOR LOCKS ENGAGED AND LOCKED ALL 4 DOORS.  UPON STOPPING AND PUTTING VEHICLE INTO PARK AUTOMATIC DOORS LOCKED, ONLY UNLOCKED  FRONT DOORS.  REAR DOORS HAD TO BE UNLOCKED MANUALLY BY THE DRIVER. *AK  *JB",
        "vin": "1LNHM82W62Y"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054186,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CONSUMER WAS AT A STOP WITH THE ENGINE RUNNING,  THE ENGINE REVVED UP AND THE TIRES WOULD SPIN. THE DRIVER HAD TO TURN THE ENGINE OFF AND THEN RESTART THE VEHICLE.  THE DEALER HAS BEEN CONTACTED.   *JB   *SC",
        "vin": "1LNHM81W22Y"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/22/2003",
        "dateOfIncident": "10/22/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044482,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO START  THE VEHICLE IT FAILED TO START. VEHICLE WAS TOWED TO DEALER.   DEALER REPLACED  CLUSTER PANEL COMPUTER AND  CRANKCASE.  HOWEVER, THE  PROBLEM STILL OCCURRED. *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040707,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE AIRBAG  INADVERTENTLY DEPLOYED WHILE DRIVING AT AN UNDETERMINED SPEED WITHOUT VEHICLE BEING IN AN ACCIDENT.  *AK",
        "vin": "KLNHM83W127"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/02/2003",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020426,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HAD THE CRUISE CONTROL ENGAGED AT 70 MPH.  THE CRUISE CONTROL FAILED TO DISENGAGE WHEN THE CONSUMER ATTEMPTED TO RESUME REGULAR DRIVING.   *PH  *JB  *NLM",
        "vin": "1LNHM85W82Y"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/15/2003",
        "dateOfIncident": "03/14/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10024817,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 45 MPH THE VEHICLE WAS INVOLVED IN A FRONTAL COLLISION.  THE FRONT AIR BAGS FAILED TO DEPLOY AND AS A RESULT THE PASSENGER SUSTAINED A PAINFUL BRUISE OVER THE  LEFT ANTERIOR RIB CAGE.  THERE WAS SUFFICIENT FRONTAL IMPACT BUT THE DRIVER BELIEVES THE AIR BAG FAILURE MAY BE DUE TO THE POSITIONING OF THE AIR BAG SENSOR.   *AK   *SCC   *NLM",
        "vin": "1LNHM81W52Y"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/14/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011824,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A POPPING NOISE IN THE STEERING, AND CONTAINED A LOT OF PLAY, WHICH WAS CAUSED BY TWO MOUNTING BOLT WHICH BROKE. *JB",
        "vin": "1LNHM83WXYY"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/28/2002",
        "dateOfIncident": "12/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000406,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED NEW 2002 LINCOLN TOWNCAR APRIL 2002 FROM CENTRAL FLORIDA LINCOLN MERCURY IN ORLANDO FLORIDA. CAR IS GARAGED ALL THE TIME AND NOW HAS 3000 MILES ON IT. THE CHASSIS AND VARIOUS STEEL SUPPORT AND STEERING PARTS HAVE SEVERE AND I MEAN SEVERE RUST. THE DEALER SAYS IT IS MORE THAN THEY HAVE SEEN BUT THERE IS NO PROBLEM. I HAVE NEVER SEEN RUST AS BAD AS THIS AND I HAVE SEEN A LOT OF CARS IN MY LIFE TIME AS A MECHANIC. THE RUST LOOKS LIKE THE CAR WAS IN ROAD SALT FOR MANY YEARS EVEN THOUGH THE CAR HAS NOT AND ONLY 8 MONTHS OLD. TS",
        "vin": "1LNHM82WX2Y"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/18/2002",
        "dateOfIncident": "11/17/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001156,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE PASSENGER SIDE, SIDE AIRBAG DEPLOYED WITHOUT VEHICLE BEING IN AN ACCIDENT. PLEASE PROVIDE MORE DETAILS. TS *DT",
        "vin": "1LNHM82WX1Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/11/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770740,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK DELIVERY OF CAR 2/XX/2002.  WHEN DRIVEN THE FIRST TIME IN THE RAIN. THE CAR PULLED TO THE RIGHT WHEN BRAKING  SEEMS OK IN DRY WEATHER.  I LIVE I NJ WHERE THERE WAS A DROUGH THIS YEAR SO DRIVING IN THE RAIN WAS RARE.  HOWEVER, THE CAR HAS BEEN TO THE DEALER 3 TIMES AND THEY NOW CLAIM THE CAR IS OK.  IT STILL EXHIBITS THE RIGHT PULL WHEN BRAKING IN THE RAIN.  I HAVE STARTED THE DISPUTE PROCESS.  DT",
        "vin": "1LNHM83W52Y"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/30/2002",
        "dateOfIncident": "04/04/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021957,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN INCLEMENT WEATHER THE VEHICLE WOULD WANDER TO THE LEFT AND RIGHT.  THE CONSUMER BELIEVES THIS PROBLEM OCCURRED BECAUSE THE VEHICLE WAS MANUFACTURED WITHOUT A REAR STABILIZER.   *TS   *NLM",
        "vin": "1LNHM83W22Y"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/22/2002",
        "dateOfIncident": "08/21/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8016974,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A FRONTAL COLLISON, NONE OF THE AIR BAGS DEPLOYED ON IMPACT.  *AK  THE CONSUMER STATES THAT FORD DID SEND SOMEONE TO CHECK OUT THE SYSTEM, AND THEY SAID THAT ALL THE SENSORS WERE WORKING.  THERE'S OVER $10K WORTH OF DAMAGE IN THE FRONT OF THE VEHICLE.  THE FACTORY REPRESENTATIVE SAID IT WAS NOT HIT WITHIN 27 PERCENT RADIUS OF THE CENTER.  BUT WITH THE IMPACT, THEY SHOULD HAVE DEPLOYED.  *SCC",
        "vin": "1LNHM82W1YY"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2002",
        "dateOfIncident": "04/25/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016293,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING  VEHICLE AND PUTTING FOOT ON GAS PEDAL VEHICLE WILL TAKE OFF LIKE A ROCKET.  PLEASE PROVIDE ANY FURHTER INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/12/2002",
        "dateOfIncident": "04/12/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016068,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL AND ACCELERATOR PEDAL ARE TOO CLOSE TOGETHER.  *AK  CONSUMER STATES THAT WHEN PUSHING DOWN ON THE BRAKE PEDAL, THE SIDE OF HIS FOOT HITS THE ACCELERATOR AND THE CAR MAY MOVE FORWARD.  CONSUMER HAS HAD TWO CLOSE CALLS.  CONSUMER IS CONCERNED WITH THE DESIGN, TO PREVENT TOUCHING THE PEDAL.  *SCC",
        "vin": "1LNHM82W42Y"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/22/2002",
        "dateOfIncident": "07/15/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8014480,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30MPH INVOLVED IN A HEAD-ON COLLISION AND AIR BAGS DID NOT DEPLOY.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/20/2002",
        "dateOfIncident": "07/11/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 764492,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN A MOUNTAIN,  THE ENGINE WENT INTO AN UNCONTROLED SPEED.  IT WAS IF SOMEONE FLOORED THE GAS AND THE ENGINE SCREAMED.  THE BRAKES DID NOT WORK, NOR DID THE EMERGENCY BRAKE.  THE ONLY WAS TO SLOW IT DOWN SOME WAS TO PUT IT IN NEUTRAL.  WHEN PUT INTO DRIVE AGAIN, WE FISHTAILED THE CAR.  FINALLY,  MY HUSBAND, TURNED THE CAR OFF.  EACH TIME WE WENT UP A HILL WE SLOWED DOWN BUT NOT ENOUGH TO STOP, THEN WOULD PICK UP SPEED WHEN WE HIT ANOTHER HILL.  AFTER SEVERAL MILES MY HUSBAND, WHEN THERE WASN'T A GULLY, DROVE ON THE SIDE IN DIRT AND HIGH GRASS TO SLOW US DOWN.  FINALLY, JUST BEFORE WE CRESTED ANOTHER HILL, HE WAS ABLE TO PULL OVER MORE AND STOP.  THIS DOESN'T EVEN DESCRIBE HOW HORRIBLE IT WAS.  WE DIDN'T THINK WE WERE GOING TO DIE, WE KNEW WE WERE, BUT WEREN'T SURE IF WE'D GO OVER A CLIFF OR INTO TREES.  WE STILL DON'T KNOW HOW WE PULLED IT OFF.  NEEDLESS TO SAY, I'M ANGRY THAT WE HAD BROUGHT THE CAR IN 5 WEEKS BEFORE FOR THE SAME PROBLEM, BUT ON FLAT ROAD, AND THEY FOUND  NOTHING WRONG WITH THE CAR.  I HAVE BEEN INFORMED THAT THE NEMITH MOTORS FOUND OUT BY CALLING THE MANUFACURER, THAT THIS HAD BEEN A PROBLEM.  HAD THEY KNOWN 5 WEEKS BEFORE THIS, THEY WOULD NOT HAVE GIVEN BACK OUR CAR TO US.  I WOULD LIKE ANY REPORT THAT THIS HAS HAPPENED TO OTHERS, AND HOPE THEIR EXPERIENCE TURNED OUT AS WELL AS OURS.*AK",
        "vin": "ILNHM82W42Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "10/19/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566551,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE BRAKES, THE VEHICLE WOULD NOT STOP, CONSUMER REARENDED THE BACK OF ANOTHER VEHICLE, DEALER STATED THERE WERE NO PROBLEMS WITH THE BRAKE SYSTEM, CONSUMER STATES ANOTHER TIME WHILE APPLYING THE BRAKES, THE BRAKES DID NOT ENGAGE, HOWEVER THIS TIME HE TOOK HIS FOOT OFF THE BRAKE PEDAL AND REAPPLIED, THEN VEHICLE STOPPED IMMEDIATELY.   *SLC",
        "vin": "1LNHM82W52Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/09/2002",
        "dateOfIncident": "10/19/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566533,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS WIHILE ATTEMPTING TO STOP THE BRAKES FAILED TO STOP THE VEHICLE, THE FIRST OCCURANCE THE VEHICLE STRUCK ANOTHER VEHICLE, NO INJURIES REPORTED, ON THE SECOND OCCURANCE THE BRAKES DID NOT ENGAGE UNTIL THE CONSUMER TOOK HIS FOOT OFF THE BRAKE COMPLETELY AND REAPPLIED, NO ACCIDENT OCUED THIS TIME.  *MJ",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/26/2002",
        "dateOfIncident": "05/24/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566261,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MASTER CYLINDER FAILED AND WAS REPLACED TWICE IN LESS THAN A MONTH.  *YH",
        "vin": "1LNHM82WX2Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/26/2002",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183712,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2/20/2007.  CONTACT REPLACED  THE MASTER CYLINDER. *MC  THE MASTER CYLINDER HAD TO BE REPLACED TWICE, ONCE AT 1090 MILES AND AGAIN AT 1529 MILES.  *NM",
        "vin": "1LNHM85WX2Y"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "05/22/2002",
        "dateOfIncident": "05/14/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 762146,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER SIDE DOOR SWINGS OPEN AT INTERMITTENT AND UNPREDICATBLE TIMES AND FAILS TO CLOSE.  *AK",
        "vin": "1LNHM82W92Y"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/28/2002",
        "dateOfIncident": "01/25/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006622,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES WHEN LOOKING THROUGH THE WINDSHIELD AT EYE LEVEL, ALL YOU SEE IS THE DEFROST VENT GRILL, ITS REFLECTING ON WINDSHIELD AT EYE LEVEL.  DEALER STATED IT WAS NORMAL.  CONSUMER FEELS THIS IS VERY DANGEROUS.   NLM  *SLC",
        "vin": "1LNHM81W72Y"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/21/2002",
        "dateOfIncident": "03/01/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006116,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL AND  BRAKE PEDAL ARE TOO CLOSE TOGETHER. WHEN TRYING TO APPLY  BRAKES CONSUMER WILL SOMETIMES PRESS ON GAS PEDAL ALSO. CONTACTED DEALER, AND  DEALER WAS NOT WILLING TO DO ANYTHING.*AK",
        "vin": "N/A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/05/2002",
        "dateOfIncident": "01/28/2002",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING SUN ROOF ROOF BLEW OFF.  THIS COULD HAVE CAUSED SOMEONE TO BE INJURED.*AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/10/2001",
        "dateOfIncident": "11/19/2001",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 6900629,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "LINCOLN",
                "productModel": "TOWN CAR",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD RESTRAINT SET TOO LOW ON  DRIVER'S SIDE, NO PROTECTION FOR DRIVER'S HEAD IF VEHICLE GETS INVOLVED IN A CRASH. DEALER/MANUFACTURER WERE NOTIFIED, AND UNWILLING TO ASSIST IN THIS MATTER. FEEL FREE TO PROVIDE ANY FURTHER INFORMATION CONCERNING THIS PROBLEM. *AK",
        "vin": "PLEASE FILL"
    }
]