[
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/27/2017",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011179,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE RELIGIOUSLY CLEANED OUR 2002 SPORTAGE WITH UNDER WASHING TO KEEP UNDER CARRIAGE AS CLEAN AS POSSIBLE...YET WE ARE TOLD THE FRAME IS TOO RUSTED, WITH HOLES AND CANNOT BE INSPECTED OR DRIVEN SAFELY...WE HAVE LESS THAN 90,000 MILES ON IT.  WHY HASN'T THERE BEEN A SAFETY RECALL ON THIS FRAME ISSUE...THE DEALER JUST SAID \"NOW IS THE TIME TO BUY ANOTHER VEHICLE!\"  THEIR WARRANTY FOR 10 YEARS OR 100K MILES IS NOT HELPFUL FOR THOSE OF US THAT PUT ON FEW MILE PER YEAR!    NEVER BUY A KIA...EVER...",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "06/04/2017",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11006032,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 KIA SPORTAGE IN FEBRUARY OF 2017, AFTER DRIVING IT FOR A COUPLE MONTHS IT ALL THE SUDDEN STARTED ROCKING SIDE TO SIDE UNCONTROLLABLY WHILE DRIVING. WHEN LOOKING AT THE CAR WE NOTICED THE WHOLE FRAME IS RUSTED AND FALLING APART. THIS IS A HUGE SAFETY PROBLEM, ESPECIALLY WHEN IT WAS BEING USED TO TRANSPORT MY CHILDREN.",
        "vin": "KNDJA723125"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/23/2017",
        "dateOfIncident": "01/13/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979995,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST 3 YEARS WHEN GOING TO THE GAS STATION TO REFUEL THE GAS TANK, WITH THE CAR STOPPED AND THE ENGINE OFF, GAS SUDDENLY SPURTS OUT THE GAS TANK AND SPLASHES ONTO ME AND MY CLOTHING.  I HAVE CALLED MY KIA DEALER, BUT THEY SAY THERE IS NO RECALL FOR THIS.  THERE ARE NUMEROUS COMPLAINTS POSTED ON THIS VERY SAME ISSUE.  WHY WOULD YOU LET YOUR CONSUMERS GO THROUGH THIS??  WOULD THEY PURCHASE ANOTHER KIA?  OF COURSE NOT!  PLEASE DO THE RIGHT THING AND TAKE ACTION TO RECTIFY THIS FOR ALL KIA OWNERS WHO  ARE GETTING SPLASHED WITH GAS WHEN GOING TO THE GAS STATION TO REFUEL THEIR TANK.  THIS IS UNBELIEVABLE THAT THIS CAN BE LEFT TO GO ON FOR SO LONG.  IS A RECALL TO FIX THIS GOING TO COST TO MUCH FOR THE KIA CORP.? NOW, I CAN ONLY REFUEL BY USING A TRANSFER PUMP AND FILLING 5 GALLON GAS CANS TO TRANSFER GAS FROM WITH THE TRANSFER PUMP.  THIS IS NOT RIGHT!  FIX THE ISSUE ON BEHALF OF ALL KIA OWNERS.",
        "vin": "KNDJA723125"
    },
    {
        "components": "ELECTRICAL SYSTEM,SEAT BELTS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959476,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE AND FRONT PASSENGER SHOULDER BELTS ARE FRAYED WHICH MAKES THEM UNABLE TO STAY SECURE.  IT WON'T STOP UPPER BODY MOVEMENT WHEN BRAKES ARE APPLIED QUICKLY.  DRIVER SIDE REAR PASSENGER WINDOW WON'T  GO DOWN AND MOTOR IN DOOR STILL MAKES THE NOISE LIKE ITS WANTS TO WORK BUT DOES NOT.  UNABLE TO PUMP MORE THAN A COUPLE DOLLARS OF GAS BEFORE IT SPITS GAS BACK OUT. WHILE DRIVING  I SMELL ELECTRICAL BURNING AND WIRES UNDER HOOD ARE BURNT BY THE FAN.  MAKING THE CAR HOT DUE TO FAN NOT WORKING PROPERLY.",
        "vin": "KNDJB723825"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/08/2017",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10950217,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE WAS HIT WHILE PARKED THE BUMPER WAS DESTROYED THE AIRBAGS DID NOT DEPLOY.  THE TUNE SIGNALS DO NOT WORK, THE FUSES BLOW EVEYTIME THEY ARE REPLACED, THE HAZZARD SIGNAL BLOWS ALL THE FUSES, THERE IS A RECALL ON BEFORE THIS YEAR AND SOME AFTER, BUT NOT THIS ONE.  GAS FUMES INSIDE THE VEHICLE, NO DEALER IN OUR COMMUNITY CAN FIND THE PROBLEM.  SHIFTER IS STUCK IN PARK, THE BY PASS KEY WORKS BUT IT WILL NOT SHIFT WITHOUT IT.",
        "vin": "KNDJA723925"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": true,
        "dateComplaintFiled": "08/25/2016",
        "dateOfIncident": "08/04/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10898430,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT THE VEHICLE EMITTED CARBON MONOXIDE AND CAUSED THE CONTACT TO FALL SLEEP. AS A RESULT, THE CONTACT LOST CONTROL OF THE VEHICLE AND CRASHED INTO A CANAL. THE AIR BAGS DID NOT DEPLOY. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE CONTACT DROVE THE VEHICLE AGAIN AND THE FAILURE RECURRED. AS A RESULT, THE CONTACT WAS INVOLVED IN ANOTHER CRASH. A POLICE REPORT WAS FILED BOTH TIMES. THE CONTACT SUSTAINED FRACTURED RIBS AND PELVIC INJURIES THAT REQUIRED MEDICAL ATTENTION. THE FAILURE MILEAGE WAS APPROXIMATELY 148,000. THE VIN WAS NOT PROVIDED.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/06/2016",
        "dateOfIncident": "07/04/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10883079,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL  I PURCHASED THIS CAR FOR MY GRANDDAUGHTER ON 6-6-2016 IT HAS ALL THE SYMPTOMS OF KIA'S RECALL # CS-048   THE CAR IS A 2002 KIA SPORTAGE VIN [XXX] WITH 87K MILES  AND ON JULY 4TH SHE STOPPED FOR A LIGHT AND THE CAR STARTED TO RUN ROUGH AND THAN STOP RUNNING, SHE LOOKED OUT THE WINDOW AND THE ROAD WAS COVERED WITH ROUGH GAS FROM HER CAR THANKFULLY THERE WAS A PATROL CAR IN BACK OF HER AND COULD REDIRECT THE TRAFFIC AND CALL FOR BACK UP TO HAND PUSH THE KIA OFF THE ROAD  I CALLED THE LOCAL KIA DEALER AND WAS TOLD THAT THIS VEHICLE WAS NOT UNDER THE GAS ( FIRE SAFETY CONCERN ) SC-O48 I ASKED WHAT PARTS NEEDED AND COULD NOT AN ANSWER SO IF THEY ARE DOT GOING TO FIX I COULD GET THE PARTS AND HAVE MY MECHANIC MAKE THE REPAIRS I BELIEVE  THAT YOU SHOULD HAVE KIA EXPAND THIS RECALL SO THAT SOME ONE ELSE'S GRAND DAUGHTER WILL NOT BE PUT IN HARMS WAY UNDER THIS RECALL   I THANK YOU FOR ANY CONSIDERATION YOU CAN MAKE REGARDING THIS MATTER.    THANKS [XXX]     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "KNDJB723X25"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2016",
        "dateOfIncident": "05/01/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876710,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "\"TAKATA RECALL\"   NOTHING NEW, SAME AS THIS AND MANY OTHER COMPLAINTS ...  COMPONENT(S): FUEL SYSTEM, GASOLINE FUMES,AIR BAGS LIGHT STAYS ON, HOLD LIGHT STAYS ON, RUST UNDERNEATH THE CAR,WINDOWS DONT WORK, ONLY BACK LEFT DOOR OPENS, AC DONT WORK, WILL RUN HOT IF ON.   CONSUMER LOCATION: CALIFORNIA  ALL PRODUCTS ASSOCIATED WITH THIS COMPLAINT EXPAND  DETAILS CLOSE  HELP   MANUFACTURER: KIA MOTORS AMERICA    SUMMARY:  THERE IS A VERY STRONG RAW GAS SMELL THAT PERMEATES THE CABIN AND OUTSIDE THE VEHICLE. IT IS VERY NOTICEABLE UPON STARTING AND WHEN THE VEHICLE IS AT REST AND RUNNING. I HAVE TAKEN THIS VEHICLE TO NUMEROUS MECHANICS TO INCLUDE THE LOCAL KIA DEALER TO RESOLVE THE PROBLEM - NEW FUEL FILTER, EXHAUST, ETC. WITH NO POSITIVE RESULTS. A SEARCH OF THE INTERNET TURNED UP A VERY COMMON PROBLEM WITH THE 99-02 SPORTAGE GAS TANKS LEAKING DUE CORROSION CAUSED BY POOR DESIGN/MATERIAL. I AM FILING THIS COMPLAINT IN HOPES THAT THE NHTSA WILL CONDUCT AN INVESTIGATION AND RECALL OF THIS MAKE/MODEL/YR VEHICLE TO CORRECT THIS VERY SERIOUS PROBLEM. THIS CAR HAS NOT BEEN DRIVEN FOR OVER A YR.",
        "vin": "KNDJB723525"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/09/2016",
        "dateOfIncident": "05/06/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863926,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR SECTION OF VEHICLE FRAME IS ROTTED BEYOND A SAFE CONDITION TO CONTINUE USE. REAR SUSPENSION MOUNT POINTS ARE CRUMBLING AND FALLING OFF. VEHICLE HAS 38,000 MILES. VEHICLE ALWAYS PARKED ON PAVEMENT OR CONCRETE AND USED AS A PRIMARY VEHICLE FOR AN OLDER FEMALE. VEHICLE USED VERY LITTLE DURING WINTER SNOW CONDITIONS.",
        "vin": "KNDJA723225"
    },
    {
        "components": "SUSPENSION,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "01/29/2016",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824814,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A CAR LAST WEEK FROM A PRIVATE SELLER, AND IT HAS A GAS LEAK COMING FROM THE GAS TANK AREA.  I HAVE NOT TAKEN IT IN YET TO A MECHANIC TO HAVE IT CHECKED OUT.  THE SELLER HAD REPLACED THE FILLER HOSE, AND HAD SAID THE PREVIOUS OWNER HAD REPLACED THE GAS TANK, SO HE SAID THERE SHOULDN'T HAVE BEEN ANY ISSUES.  I HAVE TWO GRANDCHILDREN THAT NEED TO BE ABLE TO RIDE SAFELY IN THIS CAR, AND I REFUSE TO DRIVE IT WITH THIS LEAK ON THERE.  FROM THE OTHER REPORTS THAT I AM READING, THIS IS A MAJOR ISSUE, ALONG WITH THE RUSTED FRAME ON THE CAR.  KIA SHOULD NOT BE ALLOWED TO CONTINUE TO SELL CARS WITHOUT FIXING THESE OTHER MAJOR ISSUES.",
        "vin": "KNDJA723825"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2015",
        "dateOfIncident": "09/18/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10778879,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAS RUSTED SIGNIFICANTLY UNDERNEATH THE VEHICLE.. TO THE POINT WHERE IT APPEARS THAT IT RUSTED THE FRAME AND SHOCK ABSORBERS. MY CAR WAS MADE IN KOREA... WONDER IF THESE IMPORTS HAVE TO ADHERE TO THE SAME STANDARDS AS AMERICAN MADE CARS WITH UNDERBODY TREATMENT?     ALSO THE FUEL BACKS-UP OUT OF THE GAS TANK... WHEN IN TRY TO GET THE REPLACEMENT PART... I HAVE BEEN GIVE NUMEROUS PARTS WHICH DO NOT FIT FROM THE DEALER.  ALSO BRAKES HAVE BEEN REPLACED AND ROOTERS GROUND DOWN BUT THEY KEEP HAVING PROBLEMS.",
        "vin": "KNDJA723725"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/17/2015",
        "dateOfIncident": "07/16/2015",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734754,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORK AND STARTED BRAKING FOR A RED LIGHT,MY BRAKES WERE COMPLETELY GONE,LUCKILY I WAS FAR ENOUGH FROM LIGHT & NOBODY WAS IN FRONT OF ME LIGHT TURNED GREEN,I WENT SLOW 20 MPH TO THE NEAREST FIRESTONE & COASTED IN.I THOUGHT I JUST NEEDED NEW BRAKES,THE MECHANICS PUT IT ON LIFT & SHOWED ME THE FRAME! IT WAS SO SEVERELY RUSTED THAT THE BRAKELINE HAD SNAPPED AWAY FROM FRAME.THEY CALLED 3 DIFFERENT SHOPS & NOBODY WILL TOUCH IT DUE TO LIABILITY ISSUES.I'M BESIDES MYSELF,I COULD HAVE BEEN KILLED OR KILLED SOMEONE ELSE.I'M ORIGINAL OWNER & CAR HAS BEEN IN GARAGE EVERYDAY FOR 12 YRS,HOW CAN THE FRAME BE BEYOND REPAIR AT 120,000 MILES.ALSO I'VE READ THE OTHER COMPLAINT'S ABOUT THE STRONG GAS ODORS & I HAVE HAD SAME PROBLEM FOR YEARS,ALWAY'S IN THE WINTER.I LOVE MY CAR & NEED IT REPAIRED,KIA SHOULD FIX THE FRAME & RECALL THE MODEL,SOMEONE COULD BE KILLED IF IT HAPPENS TO THEM.NOW I HAVE TO RENT A CAR TO GO TO WORK & TRY TO GET IT FIXED,BUT FIRESTONE SAID WHOLE FRAME IS RUSTED,CHEAP METAL USED!SOMETHING NEEDS TO BE DONE!ASAP",
        "vin": "KNDJB723725"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/14/2015",
        "dateOfIncident": "03/15/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10725145,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AN OVERWHELMING SMELL OF GASOLINE INSIDE THE CABIN, OVER THE YEARS HAVE TRIED EVERYTHING INCLUDING KIA DEALERS THAT COULD NOT SOLVE THE ISSUE UNTIL NOW. A FEW WEEKS AGO (APRIL 2015) AS I TRIED TO FILL THE CAR IT WOULD NOT ACCEPT FUEL SO I DETERMINED THE VENTING SYSTEM WAS FAULTY, I DISMANTLED IT AND FOUND THE CARBON FILLED BOX AT THE END OF THE VENT TO BE PLUGGED. AS I COULD NOT REPLACE IT I FORCED COMPRESSED AIR INTO IT AND CLEARED THE OBSTRUCTION (REPLACED IT LATER). THE STRONG SMELL HAS CEASED AND I CAN FILL WITH FUEL AGAIN. THIS COMMENT IS FOR THOSE THAT HAVE FILLED COMPLAINTS BUT HAVE NOT BEEN SATISFIED BY YOUR ORGANIZATION.",
        "vin": ""
    },
    {
        "components": "WHEELS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "05/26/2015",
        "dateOfIncident": "05/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721567,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHEEL STARTED SCREECHING AND IT FELT LIKE IT WAS ABOUT TO FALL APART  I HAD TO REPLACE THE FUEL PUMP AS IT CUT OUT ON ME IN TRAFFIC ON A HIGHWAY ALMOST CAUSING AN ACCIDENT",
        "vin": "KNDJB723225"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/11/2015",
        "dateOfIncident": "11/03/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693450,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICING STRONG ODOR OF FUEL COMING THROUGH THE VENTS DURING TIMES OF COLD WEATHER. IT HAS BECOME MORE OF AN ISSUE SINCE I HAVE BEEN DRIVING THIS CAR MORE. I HAVE TAKEN IT TO 2 MECHANICS WHO TELL ME THAT THEY HAVE NOT SMELLED THE ODOR, EVEN AFTER GIVING ONE OF THEM THE CAR OVERNIGHT. HOWEVER, MY HUSBAND HAS NOTICED IT SO I AM NOT THE ONLY ONE. IT IS BEGINNING TO CAUSE ME TO HAVE NAUSEA  AS I DRIVE UP TO 100 MILES PER DAY 3 DAYS PER WEEK. AS THE CAR HEATS UP AND AS THE WEATHER WARMS THROUGHOUT THE DAY THE FUEL SMELL DOES GO AWAY. HOWEVER, I HAVE 2 CHILDREN RIDING IN THE BACK SEAT AND AM CONCERNED FOR THEIR HEALTH AND SAFETY AS WELL.  AS I RESEARCH, I HAVE REALIZED THAT THIS IS A COMMON PROBLEM WITH THIS MAKE AND MODEL OF VEHICLE AND THE ISSUE CAN BE EASILY FIXED.  MY HUSBAND AND I WILL BE TAKING STEPS TO REMEDY THIS PROBLEM OURSELVES, BUT I CANNOT SEE HOW WHEN THIS IS SUCH A POTENTIALLY HAZARDOUS SITUATION, AND MULTIPLE COMPLAINTS HAVE BEEN MADE, THAT THE MANUFACTURER COULD NOT HAVE RECALLED THIS VEHICLE. THIS IS IRRESPONSIBLE ON BEHALF OF THE MANUFACTURER AND REFLECTS POOR BUSINESS PRACTICES.  *TR",
        "vin": "KNDJA723725"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/13/2015",
        "dateOfIncident": "01/03/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10683279,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT THE AROMA OF FUEL WAS PRESENT WHEN THE VEHICLE WAS STARTED. THE FUEL SCENT VANISHED AFTER THE VEHICLE WAS WARMED UP. THE FAILURE OCCURRED NUMEROUS TIMES DURING THE WINTER. THE DEALER WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "KNDJA723225"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "10/24/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650744,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE.  THE CONTACT STATED THAT FUEL FUMES WERE PRESENT IN AND AROUND THE VEHICLE.  THE DEALER STATED THAT THERE WAS A FUEL LEAK COMING FROM THE FUEL TANK.  THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN ANY RECALLS. THE APPROXIMATE FAILURE MILEAGE WAS 162,180.",
        "vin": "KNDJB623325"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/20/2014",
        "dateOfIncident": "10/10/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648740,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST GETTING IN VEHICLE READY TO PUT ON MY SEAT BELT IT WOULD NOT TIGHTEN NOR RETRACT BACK IN SO I COULD TRY AGAIN NOW THE SEAT BELT WILL NOT TIGHTEN AT ALL IT IS VERY UNSAFE  I WILL GET TICKTED.  I BOUGHT THE VEHICLE AS IS.   *TR",
        "vin": "KNDJB623125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2014",
        "dateOfIncident": "09/02/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641790,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A VERY STRONG RAW GAS SMELL THAT FILLS THE CABIN AND OUTSIDE THE VEHICLE. IT IS VERY NOTICEABLE UPON STARTING AND WHEN THE VEHICLE IS AT REST AND RUNNING.    FUEL TANK LEAKING. SEAM AREAS AND FUEL PUMP/SENDING UNIT AREA DUE TO CORROSION AND VEHICLE.    THE VEHICLE WAS PARKED, AND I HAD A HARD TIME STARTING IT.  THEN WHEN I TRIED TO DRIVE IT, ALL I COULD DO IS SMELL RAW GAS.------------------------          I HAVE REPLACED THE FUEL TANK, FUEL PUMP ASSEMBLY, ANY AND ALL PARTS ATTACHED TO FUEL TANK.  (VERY EXPENSIVE).    ON RESEARCHING THE PROBLEM, I HAVE FOUND THAT THERE ARE MANY OTHER OWNERS COMPLAINING OF THIS PROBLEM.    I HAVE OWNED THIS VEHICLE SINCE FEBRUARY 2011, I HAVE NOT BEEN IN ANY ACCIDENTS SINCE BUYING THIS VEHICLE.  IN FACT, UPON LEARNING OF MECHANICAL ISSUES I TRY TO HAVE THEM FIXED AS SOON AS POSSIBLE.  (HOWEVER, I WAS GIVEN AN ORANGE TITLE.  WHICH AT THE TIME, I DID NOT FULLY UNDERSTAND WHAT IT MEANT.)  YET, THE VEHICLE DROVE WITH JUST MINOR PROBLEMS, SUCH AS:  BRAKES, TIMING BELT, FUEL FILTER, OIL CHANGES, ETC).  THIS HAS BEEN THE MOST EXPENSIVE AND MOST DAMAGING PROBLEM WITH THE VEHICLE.  *TR",
        "vin": "KNDJA723025"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/03/2014",
        "dateOfIncident": "09/23/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10641330,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME IS RUSTED THROUGH.  *TR",
        "vin": "KNDJA723325"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2014",
        "dateOfIncident": "09/15/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10633314,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK LEAKING. SEAM AREAS AND FUEL PUMP/SENDING UNIT AREA DO TO CORROSION AND VEHICLE WILL NOT MEET EMISSIONS STANDARDS DO TO LEAK. UNSAFE DO TO FUMES ENTERING CABIN  . KIS HAS A TECHNICAL SERVICE BULLETIN SC059  FOR SPORTAGE 1996 - 2002 FUEL TANK INSPECTION FOR CORROSION  BUT DEALER SAID IT WAS NOT COVERED ALSO CALLED KIA USA WAS TOLD NOT COVERED DO TO PRODUCTION DATE 10/15/2001 BUT KIA SC059 BULLETIN HAS MODEL YEAR 10/01/2000 THROUGH 9/30/2002 AS BEING COVERED.  *TR",
        "vin": "KNDJB723925"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2014",
        "dateOfIncident": "08/11/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10621761,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE.  WHILE HAVING THE VEHICLE INSPECTED, THE CONTACT WAS INFORMED THAT THE UNDERBODY FRAME WAS RUSTED.  THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED.  THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE.  THE APPROXIMATE FAILURE MILEAGE WAS 117,000.",
        "vin": "KNDJA623225"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "07/21/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616008,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT AFTER LEANING FORWARD, THE FRONT PASSENGER SEAT BELT FAILED TO RETRACT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 130,000 AND THE CURRENT MILEAGE WAS 134,000.",
        "vin": "KNDJB623725"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/10/2014",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609640,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS AT DEALER FOR SERVICE. WE WERE TOLD THE FRAME WAS RUSTED AND THE CAR WAS NOT SAFE TO DRIVE. WE PURCHASED THE CAR NEW IN DEC 2002. WE HAVE HAD IT SERVICED THROUGH THE YEARS AT THE LOCAL DEALER. THEY TELL US THERE IS NOTHING THEY CAN DO ABOUT FIXING THE CAR. WE HAVE HAD MANY NEW CARS FROM 1962 TO 2011 AND NEVER HAD A CAR OR TRUCK RUST OUT IN 11 YEARS OF USE. I NOTICE THEIR ARE MANY COMPLAINTS ON THE INTERNET ABOUT THIS PROBLEM, AND IT APPEARS NOTHING IS BEING DONE. CAN YOU EXPLAIN TO US WHY THIS MAJOR SAFETY ISSUE IS NOT BEING LOOKED INTO AND A RECALL OF THESE KIA HAS NOT BEEN ISSUED. DOES SOMEONE HAVE TO GET KILLED FIRST.",
        "vin": "KNDJA723625"
    },
    {
        "components": "STEERING,SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/29/2014",
        "dateOfIncident": "06/16/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606743,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELING POSTED SPEED LIMIT , CAR BEGAN TO SKID. MADE A SLIGHT TURN OF STEERING WHEEL CAR BEGAN TO ROLLOVER TWO OR THREE TIMES.  *TR",
        "vin": "KNDJA723425"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "06/22/2014",
        "dateOfIncident": "07/05/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605068,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS CAR KNOWING I HAD TO REPLACE A FENDER AND THE DRIVERS SIDE DOOR. AFTER COMPLETING THE BODY WORK THE SHOP NOTICED THE REAR FRAME RAILS WERE RUSTED OUT TO A POINT IT WOULD NOT PASS PA STATE INSPECTION, WHICH HAD NOTHING TO DO WITH THE COSMETIC DAMAGE.  *TR",
        "vin": "KNDJA723725"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "02/04/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577129,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT THE VEHICLE WAS \"MISSING\" WHILE IDLE AND \"BACK FIRING\". THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE MULTIPLE ISSUES WERE DIAGNOSED (POWER TRAIN, BASE ENGINE PROBLEM, EXHAUST MANIFOLD). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURES. THE FAILURE MILEAGE WAS 187,000 AND THE CURRENT MILEAGE WAS 187,000.",
        "vin": "KNDJB723X25"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2014",
        "dateOfIncident": "03/12/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561882,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A VERY STRONG RAW GAS SMELL THAT PERMEATES THE CABIN AND OUTSIDE THE VEHICLE.  IT IS VERY NOTICEABLE UPON STARTING AND WHEN THE VEHICLE IS AT REST AND RUNNING.  I HAVE TAKEN THIS VEHICLE TO NUMEROUS MECHANICS TO INCLUDE THE LOCAL KIA DEALER TO RESOLVE THE PROBLEM - NEW FUEL FILTER, EXHAUST, ETC. WITH NO POSITIVE RESULTS. A SEARCH OF THE INTERNET TURNED UP A VERY COMMON PROBLEM WITH THE 99-02 SPORTAGE GAS TANKS LEAKING DUE CORROSION CAUSED BY POOR DESIGN/MATERIAL.  I AM FILING THIS COMPLAINT IN HOPES THAT THE NHTSA WILL CONDUCT AN  INVESTIGATION AND RECALL OF THIS MAKE/MODEL/YR VEHICLE TO CORRECT THIS VERY SERIOUS PROBLEM.   THIS VEHICLE WAS PURCHASED AS A GIFT FOR TEENAGE DRIVER.  I WILL NOT ALLOW MY CHILDREN TO DRIVE IT DUE MY CONCERNS FOR THEIR SAFETY.   *TR",
        "vin": "KNDJA723525"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/27/2014",
        "dateOfIncident": "01/05/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561686,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRAME AT THE POINT OF CONNECTION WITH THE REAR DIFFERENTIAL IS COMPLETELY RUSTED THROUGH AND I AM UNABLE TO GET IT REPAIRED. I HAVE CONTACTED KIA AND THEY SAID THAT THE VEHICLE IS BEYOND IT'S WARRANTY. I WAS DRIVING AND HEARD A THUMPING SOUND. THE SOUND GOT LOUDER AND THE CAR BEGAN TO SHAKE TERRIBLY. A MECHANIC LOOKED AT IT AND TOLD ME THAT THE FRAME WAS BROKEN.   *TR",
        "vin": "KNDJA723725"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2013",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556186,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE 2002 KIA SPORTAGE USED ON OCTOBER 1, 2013, WITH 120,000 MILES ON IT.  WHEN THE TEMPERATURES BECAME COOL, I STARTED NOTICING GAS FUMES IN THE PASSENGER COMPARTMENT, AND STRONG SMELL OF GAS IN THE ENGINE COMPARTMENT IN THE VICINITY OF THE INTAKE MANIFOLD.  I STARTED NOTICING GAS DRIPPING FROM THE ENGINE WHEN THE CAR WAS STOPPED AND IDLING.  AFTER THREE TRIPS TO MY LOCAL MECHANIC, AND ONE TO THE KIA DEALER, DURING WHICH THE FUEL INJECTORS, FUEL INJECTOR O RINGS, RUBBER FUEL LINES, AND FUEL FILTER WERE REPLACED, THE LEAK CONTINUES. BECAUSE OF THE STRENGTH OF THE FUMES, THE CAR IS UNDRIVEABLE UNLESS THE WINDOWS ARE OPEN, AND I FEAR AN EXPLOSION AND FIRE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/16/2013",
        "dateOfIncident": "09/15/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543915,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 50 MPH THE VEHICLE STALLED. THE VEHICLE ALSO INDEPENDENTLY DOWNSHIFTED WHILE THE CONTACT WAS DRIVING 25 MPH. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 50,000.   *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/16/2013",
        "dateOfIncident": "08/15/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10535726,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 KIA SPORTAGE 4WD 2D CV GAS - 119,000 MILES ON IT. WHEN PUMPING GAS- THE GASOLINE POURS AND SHOOTS RIGHT BACK OUT. NOT A VERY GOOD EXPERIENCE AT ALL. I HAD TWO OF MY CHILDREN IN THE CAR AND IT SEEMED LIKE GASOLINE WAS ALL OVER ME. THIS NEEDS TO BE RECALLED RIGHT AWAY. THIS IS NOT SAFE AT ALL!  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/21/2013",
        "dateOfIncident": "03/18/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521124,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH OF MY HEADLIGHTS STOPPED WORKING DURING A HEAVY RAIN AND AT NIGHT BUT THE PARKING LIGHTS WERE STILL WORKING.  WE ASSUMED IT WAS BECAUSE THE LIGHT BULBS NEEDED CHANGED.  WHEN WE CHANGED THE BULBS, THE HEADLIGHT PLUG ON THE DRIVER SIDE WAS MELTED FROM A POSSIBLE SHORT IN THE WIRING AND CORRODED, THE PASSENGER SIDE IS DRY ROTTED. WE CHANGED THE BULBS THINKING THAT WAS THE ONLY PROBLEM, BUT NOTHING WAS WRONG WITH THE BULBS WE TOOK OUT.  THE PASSENGER LIGHT NEVER FULLY WORKS, IT ALWAYS HAS A DIM READY TO GO OUT LOOK.  THEN ON JUNE 10 THE HEADLIGHTS STOPPED WORKING AGAIN DURING A RAINSTORM.  TODAY IS JUNE 24 AND THE HEADLIGHTS ARE STILL NOT WORKING AND THE HEADLIGHT BULB IS STILL GOOD.  IT MUST BE THE WIRING. WE TOOK THE BULB OUT AGAIN TODAY THE BULB IS STILL GOOD, WE PLUGGED THEM BACK INTO THE SOCKET.  THEY ARE TEMPORARILY WORKING.  HOWEVER THIS IS WHAT HAPPENED BEFORE.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/13/2013",
        "dateOfIncident": "05/25/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10519650,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT THE VEHICLE WAS PARKED ON A SLIGHT INCLINE WITHOUT THE EMERGENCY BRAKE ENGAGED AND THE KEY STILL IN THE IGNITION WHEN THE VEHICLE ROLLED 20 FEET AWAY AND CRASHED INTO A NEARBY HOUSE. THE VEHICLE WAS DESTROYED AND TOWED TO THE CONTACT'S RESIDENCE. A POLICE REPORT WAS FILED. THERE WERE NO INJURIES. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 159,000.",
        "vin": "KNDJA723225"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/05/2013",
        "dateOfIncident": "04/05/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507260,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS FIRST MADE AWARE OF THIS PROBLEM IN JANUARY 2013 WHEN I WENT TO MUNROE MUFFLER IN JOHNSTON, RI FOR A NEW EXHAUST SYSTEM. I WAS TOLD OF SIGNIFICANT ROT ON THE FRAME OF THE CAR. THEN AGAIN A COUPLE OF WEEKS LATER BY ANOTHER MECHANIC WHO GAVE ME A BETTER PRICE ON THE MUFFLER SYSTEM AND INSTALLED THE MUFFLER SYSTEM. HE ADVISED ME TO TAKE IT UP WITH KIA, WHICH I DID. I WAS TOLD BY CONSUMER AFFAIRS  TO GO TO THE NEAREST KIA DEALER AND HAVE THEM TAKE A LOOK AT THE ISSUE, THEY DID. I WAS THEN CONTACTED BY SOMEONE IN CONSUMER AFFAIRS LETTING ME KNOW THAT MY WARRANTY WAS UP AND THIS SEVERE ROT ON THE CHASSIS WAS MY PROBLEM AND THERE IS NOTHING THEY WOULD DO.  THEY KIA DEALER HAD GIVEN ME AN ESTIMATE OF APPROXIMATELY $10,000 TO REPLACE THE CHASSIS BECAUSE IT IS ALMOST COMPLETELY ROTTED OUT AND VERY DANGEROUS TO DRIVE.  I WENT TO HAVE MY CAR INSPECTED TODAY, AS IT IS DUE FOR RENEWAL AT THE END OF APRIL AND GUESS WHAT? IT WOULD NOT PASS INSPECTION BECAUSE OF THE SEVERELY ROTTED CHASSIS. MY VEHICLE IS ONLY 11 YEARS OLD!  I HAVE ASKED KIA TO DO A RECALL AND REPLACE MY CHASSIS AT THEIR EXPENSE BECAUSE SURELY OTHERS HAVE HAD THE SAME ISSUES. THEY REFUSED. I JUST LOOKED ONLINE AND SAW MANY COMPLAINTS OF THE SAME ISSUE I AM HAVING. PLEASE LOOK INTO THIS MATTER AND MAKE KIA TAKE RESPONSIBILITY FOR THIS.  THE CHASSIS SHOULD NOT BE ROTTING OUT AT ONLY 11 YEARS OLD!!!  I WAS TOLD BY THE MECHANIC THAT IF I HIT A BUMP THE FRONT OF THE FRAME COULD SNAP AND I CAN ONLY IMAGINE HOW DANGEROUS THAT WOULD BE FOR ME OR ANYONE ELSE IN THE CAR WITH ME. PLEASE HELP!!    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6),  *TR",
        "vin": "KNDJA723X25"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/18/2013",
        "dateOfIncident": "03/18/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503495,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A 2002 KIA SPORTAGE. BRAKE LINE WAS LEAKING, WENT TO MECHANIC AND WAS INFORMED THAT THE WHOLE FRAME WAS ROTTED AWAY AND WAS NOT REPAIRABLE AND WAS UNSAFE TO DRIVE AS THE BRAKE LINES WERE ALSO ROTTED AND WHOLE CAR COULD BUCKLE IF IN AN ACCIDENT OR HIT ANYTHING. CALLED KIA AND WAS TOLD NOTHING THEY CAN DO. HAVE A 2000 CHRYSLER WITH MORE MILES AND NOT A SPOT RUST. NOW I NEED TO FIND A NEW VEHICLE ASAP, AN EXPENSE I CAN'T AFFORD BUT NEED TO GET TO WORK. KIA WILL NOT HELP AT ALL, GUESS THEY HAVE OUR MONEY SO WE'RE ON OUR OWN.  THIS IS UNACCEPTABLE, KIA KNOWS ABOUT THE PROBLEM AND WILL DO NOTHING. HAVE DONE RESEARCH ONLINE AND THERE ARE THOUSANDS OF PEOPLE WHO HAVE THE SAME PROBLEM. THESE CARS ARE DEATH TRAPS, IF YOUR UNAWARE YOUR BRAKES CAN GO OR IF IN AN ACCIDENT SERIOUSLY INJURED OR EVEN DEATH. THE NHTSA SHOULD FORCE KIA TO RECALL THESE VEHICLES BEFORE SOMEONE GETS KILLED OR KILLS SOMEONE ELSE. I HAVE SEEN NUMEROUS COMPLAINTS FILED WITH THE NHTSA AND DOMT KNOW WHY THEY ALLOW KIA TO IGNORE THIS SERIOUS ISSUE. THEIR ARE RECALLS ISSUED FOR LESS SERIOUS PROBLEMS, THIS ONE PEOPLES LIVES ARE AT STAKE. PLEASE DO SOMETHING ABOUT THIS BEFORE ITS TOO LATE.  *TR",
        "vin": "KNDJA723X25"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2013",
        "dateOfIncident": "11/22/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496031,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS COLD  (WINTER SEASON) WHEN FUELING MY TANK IT SPILLS OUT, MAKING IT HARD TO FILL TANK. THIS HAS BEEN  HAPPENING EVER SINCE I HAVE HAD THE VEHICLE, WHICH WAS OCT OF 2010. YESTERDAY (THURS) WHEN FUELING IT  WOULD NOT LET ME PUT HARDLY ANY GAS IN WITH OUT SPILLING OUT. I DON'T KNOW EXACT DATE THIS WAS NOTICED BY ME  BUT IT WAS IN WINTER, THIS HAPPENS EVERY COLD SEASON.  *TR",
        "vin": "KNDJA723725"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2013",
        "dateOfIncident": "05/09/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491586,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SPIT OUT GAS AS IT IS BEING FILLED.  HAS HAPPENED MANY MANY TIMES SINCE I PURCHASED THE CAR.  *TR",
        "vin": "KNDJA723X25"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/31/2012",
        "dateOfIncident": "01/03/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490553,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE 4X4. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE THE ODOR OF GASOLINE WAS EMITTED FROM THE VENTS. THE VEHICLE WAS TAKEN TO A DEALER FOR DIAGNOSIS WHERE THEY ADVISED HER THAT THE O-RINGS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED FOR THE O-RINGS. THE MANUFACTURER WAS CONTACTED AND OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 21,000. THE CURRENT MILEAGE WAS APPROXIMATELY 39,000.  UPDATED 03/20/13*LJ UPDATED 03/29/2013 *JS",
        "vin": "KNDJA723025"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/31/2012",
        "dateOfIncident": "01/03/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490579,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS FUMES ENTER VEHICLE CAB THREW AIR VENTS.  *TR",
        "vin": "KNDJA723025"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2012",
        "dateOfIncident": "11/17/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483638,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 25 MPH, FUEL FUMES WERE EMITTED INTO THE VEHICLE. THE FAILURE OCCURRED WHEN DRIVING AT ANY SPEED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DETECTED NO SIGNS OF A FUEL LEAK. THE TECHNICIAN ALSO INFORMED THE FUEL TANK MUST BE REMOVED IN ORDER TO LOCATE THE PROBLEM. THE VEHICLE WAS NOT REPAIRED. THERE WAS A TECHNICAL SERVICE BULLETIN UNDER NHTSA ITEM NUMBER 10015753 (FUEL SYSTEM, OTHER:DELIVERY:FUEL PUMP). THE MANUFACTURER WAS NOTIFIED OF THE PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 73,000.",
        "vin": "KNDJB723225"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2012",
        "dateOfIncident": "08/02/1999",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469377,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE RUNS HOT AND WILL NOT PASS THE SMOG TEST.  I REPLACED THE THERMOSTAT THREE TIMES AND THE RADIATOR ONE TIME JUST RECENTLY.  THE DIAGNOSTIC TEST SHOWS THAT THE ENGINE COOLING COIL OR SYSTEM HAS A PROBLEM.  I CAN NO LONGER DRIVE IT BECAUSE IT WILL NOT PASS THE SMOG AND I CANNOT GET IT REGISTERED!!!!  *TR",
        "vin": "KNDJB723425"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/21/2012",
        "dateOfIncident": "03/16/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452535,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 KIA SPORTAGE HAS 112,000 MILES ON IT.  AFTER HEARING A CLANKING NOISE FROM THE REAR OF THE VEHICLE I BROUGHT IT TO MY LOCAL KIA DEALERSHIP.  THE REAR FRAME HAS RUSTED OUT AND NEEDS TO BE REPLACED.  UPON CALLING KIA HEADQUARTERS @800-333-4542 AND SPEAKING WITH RICHARD I WAS TOLD THAT \"THERE IS NOTHING KIA CAN DO TO HELP.  THE VEHICLE'S WARRANTY ON THE FRAME IS 5 YEARS OR 60,000 MILES.\"  I WAS TOLD BY THE SERVICE MANAGER AT THE DEALERSHIP THAT I COULD HAVE IT REPAIRED AT A BODY SHOP BUT THE COST WOULD BE VERY HIGH AND WOULD NOT BE WORTH IT.  THEY WOULD NOT CONSIDER BUYING IT BACK FROM ME EITHER.  THEY COULD CALL A SALVAGE YARD AND GET \"A COUPLE OF HUNDRED DOLLARS\" FOR ME.  I PAID $17,000.00 FOR THIS VEHICLE NEW IN JANUARY 2003.  WHO EXPECTS THE FRAME TO BE SHOT AFTER 9 YEARS?? I HAVE LOOKED ON-LINE AND SEE THAT THIS IS A COMMON PROBLEM WITH KIA SPORTAGES.  WHY WAS THERE NEVER A RECALL?  HAD THERE NOT BEEN A NOISE COMING FROM THE REAR OF THE CAR I CAN ONLY IMAGINE WHAT COULD HAVE HAPPENED TO ME OR SOMEONE ELSE ON THE ROAD HAD THE FRAME COMPLETELY LET GO WHILE I WAS DRIVING.        *JS",
        "vin": "KNDJB723625"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/23/2012",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10449134,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT GASOLINE FUMES WERE EMITTED INTO THE VEHICLE THROUGH THE VENTS. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO DIAGNOSED THAT THE FUEL TANK MODULE WAS CORRODED AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT RECALLED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 62,000 AND CURRENT MILEAGE WAS 63,473.",
        "vin": "KNDJA723625"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2012",
        "dateOfIncident": "07/04/2011",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443808,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SPILL AT WAWA GAS STATION. RECENTLY MY SON FUELED MY 2002 KIA SPORTAGE AS I WENT IN WAWA; HE DIDN'T KNOW FUEL PROBLEM TRIED TO FILL THE TANK WITH THAT AUTO FILL CLIP (WHERE DON'T HAVE HOLD) GAS PUMP.  GALLONS OF FUEL SPIT, SPILLED IN WIDE AREA PUMP OTHER PATRONS AVOIDED THE AREA.  NEIGHBORING GAS PUMPS HAD PEOPLE ON CELL AND SMOKERS CAR WERE START UP MOVING OUT WITH EXHAUST PIPE IN THE DIRECTION OF THE SPILL. MY SON AND HIS CLOTHING WAS SATURATED WITH GAS. THIS PROBLEM WITH THE GAS SPILLING AND SPITTING SEVERAL FEET OUT OF THE GAS TANK IS GETTING WORST.  THE CONSTANT FUEL VAPORS ARE CAUSING ME HEALTH PROBLEMS.  ANYWHERE I PUMP GAS GASOLINE SPILLS, EVERYONE LOOKS AT ME; I TRY TO CAREFULLY TO PUT THE MINIMAL TAKING 10-15MINUTES BUT CANNOT AVOID SPILLS. I'M RETIRED CAN'T AFFORD ANOTHER CAR AND PAID OVER $3800.00 IN ENGINE LIGHT, FUEL REPAIRS RECENTLY FILED A COMPLAINT WITH THE BBB.  THIS PROBLEM IS DOCUMENTED I HAVE BROUGHT IT TO MIENEKE AND LOCAL KIA DEALER WHO KEEP WRONG PARTS REPLACING PARTS AT MY EXPENSE.  THE LOCAL KIA DEALER TOLD ME IT RECALL IS ONLY THE 2005 KIA I CHECKED INTERNET AND IN FACT IT IS THE KIA 2005 SPORTAGE:05V212000, HTTP://AUTO RECALLS.JUSTIA.COM/KIA/SPORTAGE/2005/05V212000/INDEX.HTML MY 2002 KIA HAS THE SAME PROBLEM AND KIA MUST DO THE RIGHT THING AND FIX THIS HAZARD FREE UNDER RECALL IMMEDIATELY.  *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "01/13/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443696,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER JUST PURCHASED 2002 KIA SPORTAGE WITH 105164 MILES ON IT. IT WAS PURCHASED DURING THE DAY AND TEST DROVE DURING THE DAY WHEN WEATHER WAS WARMER APPROX 50 DEGREES OR HIGHER. IT HAS TURNED COLD THE DAY AFTER PURCHASING AND NOW HIGH TEMP IS 24 DEGREES. HAVE NOTICED A STRONG GAS SMELL COMING FROM INSIDE OF CAR. SHE STARTED IT TO WARM IT UP THIS MORNING BEFORE LEAVING AND NOTICED THE STRONG GAS SMELL WHEN SHE STARTED TO LEAVE. DOES ANYONE KNOW WHAT MIGHT BE CAUSING THIS. HAD MECHANIC CHECK CAR BEFORE WE BOUGHT AND EVERYTHING CHECKED OUT FINE. NOW SHE IS ALMOST AFRAID TO DRIVE DUE TO GAS SMELL.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2011",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441546,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE OTHER COMPLAINTS THAT I AM SEEING, I HAVE A 2002 KIA SPORTAGE WITH 68000 MILES AND IT IS HAVING SEVERE PROBLEMS WITH FUEL VAPORS IN THE PASSENGER COMPARTMENT.  I HAVE TAKEN THE VEHICLE TO THE  MECHANIC AND THEY ARE UNABLE TO FIND A SOURCE FOR THE FUEL SMELL. THE VAPORS ARE EXTREMELY STRONG AND I GET VERY NAUSEOUS; I HAVE TO OPEN A BACK WINDOW SO I DO NOT GET A MIGRAINE HEADACHE. I LIVE IN WISCONSIN SO IT IS VERY COLD IN THE WINTER TIME TO DO THIS WITH THE OPEN WINDOWS BUT I CANNOT DRIVE THE CAR ANY OTHER WAY.   I WOULD APPRECIATE IF THE NHTSA WOULD LOOK FURTHER INTO INVESTIGATING THIS PROBLEM AND MAKE KIA ISSUE A SAFETY RECALL AND REPAIR... I AM THE ORIGINAL OWNER OF THE VEHICLE AND BESIDES THE 4 WHEEL DRIVE BREAKING ONCE, AND THIS HORRIBLE GAS SMELL I HAVE NOT HAD MANY PROBLEMS WITH THIS CAR.  *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/09/2011",
        "dateOfIncident": "11/24/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439108,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 KIA SPORTAGE ESPECIALLY IN COLD WEATHER LEAKS GAS VAPORS THRU THE VENTS, ENOUGH TO GIVE MY WIFE MIGRAINES AND NAUSEA, IT MIGHT EVEN BE A HAZARDS IF YOU SMOKE IN THE CAR.  THEY SHOULD DEFINITELY DO A RECALL TO FIX THIS PROBLEM BEFORE SOMEONE SHOWS UP WITH A CANCER OR A CAR EXPLODES.    WE ARE ABOUT TO BUY ANOTHER CAR CAUSE WE ARE CONCERN ABOUT OUR NEWBORN AND FUEL VAPORS NOT A GOOD MIX. *TR",
        "vin": "KNDJA723425"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/01/2011",
        "dateOfIncident": "10/31/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10437921,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "LIKE OTHER COMPLAINTS THAT I AM SEEING, WE HAVE A 2002 KIA SPORTAGE WITH 69000 MILES AND ARE HAVING SEVERE PROBLEMS WITH RAW FUEL VAPORS IN THE PASSENGER COMPARTMENT UPON START UP AND SITTING STILL.  I AM A MECHANIC AND HAVE SEARCHED FOR AN ACTIVE FUEL LEAK, BUT CAN NOT FIND ONE..  THE VAPORS ARE EXTREMELY STRONG AND I AM SURE PRESENT A FIRE OR EXPLOSION HAZARD (ESPECIALLY IF SOMEONE IS SMOKING)..   I HIGHLY ENCOURAGE THE NHTSA TO INVESTIGATE THIS PROBLEM AND MAKE KIA ISSUE A SAFETY RECALL AND REPAIR... *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2011",
        "dateOfIncident": "11/12/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436281,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS SMELL COMING FROM THE ENGINE. LEAKING FROM A RUBBER HOSE THE IS OVER THE METAL GAS LINE THAT IS HELD RIGHT WITH A HOSE CLAMP.  *TR",
        "vin": "KNDJA723325"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/11/2011",
        "dateOfIncident": "06/15/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435312,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTICED A SMALL HIGH PITCHED WHINE TOWARD THE REAR OF THE VEHICLE.  MY MECHANIC CHECKED AND SAID  THAT IT WAS PROBABLY A PINION BEARING IN THE DIFFERENTIAL GOING BAD AND SHOULD BE COVERED BY THE WARRANTY.    TOOK THE CAR TO THE DEALER FOR A DETERMINATION AND WAS TOLD THAT THE DIFFERENTIAL NEEDED REPLACED AND WAS  NOT COVERED UNDER THE WARRANTY SINCE THE FLUID HAD NOT BEEN CHANGED EVERY 20000 MILES ALONG WITH A BILL  FOR $126.00.  WAS NOT ABOUT TO PAY THEM THE $1000 THEY WANTED TO REPLACE A DIFFERENTIAL THAT SHOULD  HAVE BEEN COVERED UNDER WARRANTY.  STILL DRIVING THE CAR WHICH NOW MAKES A LOUD GRINDING SOUND AND  DRAWS ALOT OF ATTENTION WHICH ALLOWS ME TO DISCOURAGE ANY KIA PURCHASES FROM PROSPECTIVE BUYERS. THE  4 WHEEL DRIVE HAS QUIT WORKING ALSO LEAVING ONLY SINGLE WHEEL DRIVE MAKING THE VEHICLE VERY UNSTABLE ON  WET ROAD CONDITIONS.  *TR",
        "vin": "KNDJA723X25"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2011",
        "dateOfIncident": "10/20/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432580,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT WHEN DRIVING AT VARIOUS SPEEDS AND DEPRESSING THE BRAKES, THE LINING FRACTURED ON THE REAR PASSENGER SIDE. THE VEHICLE WAS TOWED HOME WHERE THE OWNER REPLACED THE BRAKE SHOES AND CYLINDERS ON THE REAR DRIVER AND PASSENGER SIDES. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 4,290.",
        "vin": "KNDJA723425"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/27/2011",
        "dateOfIncident": "09/04/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427605,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM I HAVE WITH MY 2002 KIA SPORTAGE IS ENGINE HEATING, ENGINE OVER HEATING, ENGINE COOLING FAN ( FAN BLADES BRAKE OFF CUT INTO MY RADIATOR, CUT MY FUEL LINES, WATER HOSES, AIR INTAKE LINES. SINCE THERE HAS ALWAYS BEEN A PROBLEM WITH ENGINE LIGHT ON I.E. MISFIRE ON CYLINDER NUMBER 3 THE CAR BASICALLY RUNS ON THREE CYLINDERS, WHICH COULD HAVE SOMETHING TO DO WITH ENGINE HEATING BECAUSE THE FAN IS BELT DRIVEN, THUS LEADING TO OVER HEATING. THIS USUALLY LEAD TO COSTLY ENGINE REPAIRS, VEHICLE BECOMES DISABLED ANYWHERE AND ANYTIME. THIS IS VERY DANGEROUS. SINCE OWNING, MY 2002 KIA( PURCHASED IN JUNE 2005, 32728 MILES) I HAVE REPLACED 5 RADIATORS, 5 ENGINE COOLING FANS, TOWED 8 TIMES. THE ENGINE COOLING FAN HAS BROKEN OFF AND CUT INTO MY RADIATOR IN 2005, 2009, 2010, AND 2011. THERE WAS A RECALL IN 2007 AND I TOOK IT IN TO THE DEALER IN 2007 FOR THE RECALL. IT HAS BROKE OFF THREE TIMES SINCE THE RECALL. THIS IS DANGEROUS!!!     *TT",
        "vin": "KNDJB723X25"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/17/2011",
        "dateOfIncident": "08/05/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419778,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF A WELL TAKEN CARE OF, 59,000 MILES, 2002 KIA SPORTAGE. I TOOK THE CAR FOR INSPECTION AND WAS INFORMED THE RIGHT FRAME RAIL AT THE MOUNT IS COMPLETELY RUSTED SO BAD THAT YOU CAN PUT YOUR FIST THROUGH THE HOLE. THIS IS MY ONLY CAR AND HAVE TO DRIVE IT TO WORK. I HAVE TAKEN TO AVOIDING ANY BUMPS OR POT-HOLES IN THE ROAD AND HAVE BEEN KEEPING MY SPEED UNDER 40 MPH. I AM A LITTLE SCARED TO DRIVE THE VEHICLE BUT HAVE NO CHOICE. I AM DEALING WITH KIA MOTORS AMERICA CONSUMER ASSISTANCE CENTER CURRENTLY, HOPING THEY WILL RESOLVE THE PROBLEM.   *KB",
        "vin": "KNDJA723925"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/05/2011",
        "dateOfIncident": "08/03/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10417150,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE  *TT",
        "vin": "KNDJA723925"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/15/2011",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407003,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST REPAIRED MY EXHAUST ON MY 2002 KIA SPORTAGE 4X4 TODAY AS IT KEEPS RUSTING OUT ON ME.  TODAY I NOTICED THE ENTIRE FRAME ON THE BACK END IS EXTREMELY RUSTED TO THE POINT IT'S LITERALLY FALLING APART BRACKETS HAVE DETACHED FOR THE EXHAUST AS WELL AS HOLES IN IT.  I WAS SHOCKED!  THE METAL IS LITERALLY SPLITTING AND FALLING APART!  THIS IS A SERIOUS PROBLEM AND GOING TO BE DANGEROUS TO EVEN DRIVE THE CAR.  I AM SURE THE CAR WON'T EVEN PASS INSPECTION IF THEY SEE THIS!   IF YOU EVEN TOUCH IT YOUR FINGERS GO THROUGH THE FRAME!  SOMETHING NEEDS TO BE DONE ABOUT THIS I FEEL KIA SHOULD BE RESPONSIBLE TO PAY FOR THE DAMAGES!  THERE IS ONLY 40K MILES ON THE CAR.  I HAVE NEVER EXPERIENCED THIS WITH ANY OF MY OTHER VEHICLES EITHER THAT ARE OLDER AS WELL AS HAVE MANY MORE MILES ON THEM!  SOMETHING MUST BE DONE!!!!!  *TR",
        "vin": "KNDJA723625"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/01/2011",
        "dateOfIncident": "05/27/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404098,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRAME IS ROTTED AWAY ABOVE THE REAR SPRING ON THE PASSENGER SIDE (BROKEN IN TWO).  *TR",
        "vin": "KNDJA723925"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/07/2011",
        "dateOfIncident": "05/04/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399421,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRAME ON MY 2002 KIA SPORTAGE HAS RUSTED THROUGH. I CAN STICK MY FINGER THROUGH IT LITERALLY. THIS VEHICLE HAS BEEN TAKEN CARE OF AND NOT ABUSED. NOW THE FRAME IS CRACKED ON BOTH SIDES!!!!!!!!! *TR",
        "vin": "KNDJA723925"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398835,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRAME ROTTED OUT.  *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/25/2011",
        "dateOfIncident": "04/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397852,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WELL MAINTAINED, DAILY DRIVEN, VEHICLE WITH 145,000 MILES HAS COMPLETELY RUSTED OUT PASSENGER SIDE RAIL OF FRAME.  SUB STANDARD QUALITY OF STEEL MAKING VEHICLE UNSAFE TO DRIVE ( WITH ALL THE COMPLAINTS FOR THIS SAME ISSUE, HAS ANYONE PERFORMED A CHEMICAL ANALYSIS TO VERIFY THE MATERIAL PROPERTIES IN THESE SIDE RAILS MATCH THE MATERIAL SPECIFICATION REQUIREMENTS PER THE BLUE PRINT)?   NUMEROUS OTHER COMPLAINTS FOR SAME ISSUE WITH LACK OF ATTENTION FROM THE GOVERNMENT FOR SUCH A CRITICAL SAFETY ISSUE.  THIS ISSUE NEEDS TO BE INVESTIGATED WITH THERE BEING SO MANY REPEAT COMPLAINTS OUT THERE BEFORE SOMEONE IS KILLED AS A RESULT OF DEGRADATION TO THE FRAME STRUCTURE.  AMERICAN AUTO-MAKERS ARE HELD TO A MUCH HIGHER STANDARD AND ARE FORCED INTO RESOLVING THESE ISSUES WITH THE CONSUMER.  HOWEVER, THE FOREIGN CARMAKERS APPEAR TO BE GETTING AWAY WITH \"MURDER\" BY PLACING THE AMERICAN WORKERS AT HIGH RISK FOR THEIR SAFETY AS WELL AS THE SAFETY OF EVERY OTHER DRIVER ON THE ROAD.  I CAN PICTURES OF SUPPORT OR BETTER YET, LACK OF AS THERE IS VERY LITTLE STEEL LEFT AND BY NO MEANS, ANY STRUCTURAL SUPPORT TO THE FRAME ON THIS SIDE.",
        "vin": "KNDJA723625"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "02/17/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390408,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2002 KIA SPORTAGE BRAND NEW. THE PAST FEW YEARS I HAD NOTICED A GAS SMELL AND TRIED TO IGNORE IT. AND EVER SO OFTEN WHEN I PUMP GAS IT SHOOTS BACK OUT EVERYWHERE. IT HAPPENS MOSTLY IN COLD WEATHER.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2011",
        "dateOfIncident": "03/05/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386579,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 245K,ONLY RIGHT SIDE FRAME ROT INSIDE OUT. THEREFORE SHOWING NO NOTICE OF DETERIORATING WITH ORIGINAL ENGINE AND ORIGINAL TRANSMISSION.  *TR",
        "vin": "KNDJA723925"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/10/2011",
        "dateOfIncident": "01/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381453,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT WHILE ATTEMPTING TO ADD FUEL TO HER VEHICLE, THE GASOLINE WOULD SPILL OUT.  THE HEADLIGHTS WERE ALSO DIM, MAKING IT IMPOSSIBLE TO SEE AT NIGHT. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED AND THE VEHICLE WAS NOT REPAIRED. THE CURRENT MILEAGE WAS APPROXIMATELY 123,000 AND THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "KNDJA723525"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2011",
        "dateOfIncident": "10/02/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379695,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 KIA SPORTAGE BEGAN LEAKING GASOLINE FROM ABOVE THE GAS TANK BY THE FUEL PUMP THE MILEAGE ON THE CAR IS ABOUT 106,000. I HAD A MECHANIC LOOK AT IT AND HE TOLD ME THAT THE GAS WASN'T EVEN GETTING UP INTO THE FUEL PUMP IT WAS SPRAYING OUT AT THE TOP OF ONE OF T HE PARTS HE NAMED, THIS WAS KEEPING MY VEHICLE FROM EVEN STARTING, AND I NOW KNOW THAT THIS WAS A COMMON OCCURRENCE IN KIA SPORTAGES STARTING WITH THE 2001 MODEL.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2010",
        "dateOfIncident": "12/25/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372732,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS 2002 KIA SPORTAGE IN THE WINTER TIME HAS A VERY STRONG SMELL OF RAW FUEL. TO THE POINT YOU HAVE TO ROLL DOWN THE WINDOWS . LOOKING ONLINE CAN SEE THIS IS A COMMON PROBLEM. SMELLING RAW GAS CAN NOT BE GOOD FOR YOU. SEEMS THAT IS  COMMON TO THE CLAMPS USED ON THE FUEL LINES. ALL KIA MECHANICS KNOW OF THE PROBLEM AND WILL BE HAPPY TO FIX IT FOR THERE REGULAR FEES. THIS IS UNACCEPTABLE AND SHOULD BE RECALLED AND FIXED AT MANUFACTURERS EXPENSE BECAUSE OF SUB STANDARD PARTS.  *TR",
        "vin": "KNDJA723X25"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/31/2010",
        "dateOfIncident": "11/02/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363388,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING GAS TANK 1 WEEK BEFORE, STARTED NOTICING STRONG ODOR OF GASOLINE INSIDE THE VEHICLE AS WELL AS OUTSIDE OF IT.  HAD FRIEND LOOK AT IT, THERE WAS NO DISCERNIBLE LEAKS, JUST EXTREMELY STRONG GAS SMELL.  SMELL IS SO STRONG IT MAKES PEOPLE NAUSEOUS, LIGHT HEADED, HAS GIVEN ME MIGRAINE HEADACHE.  CANNOT RIDE IN CAR WITHOUT WINDOWS DOWN.  THIS IS PREDOMINATELY NOTICED WITH THE COLD WEATHER SETS IN, BELOW 40 DEGREES.  THIS IS DEFINITELY A SAFETY/HEALTH HAZARD.  FOUND MANY COMPLAINTS ONLINE OF SAME PROBLEM.  THIS NEEDS TO BE RECALLED AND FIXED BY KIA AS IT IS MOST DEFINITELY A MANUFACTURING PROBLEM.  CANNOT SEEM TO FIND WHAT IS CAUSING THIS, IT IS PROBABLY THE SAME PROBLEM THAT THE 2005 SPORTAGE RECALL STATES.  I AM TERRIFIED THAT IT IS GOING TO CAUSE A FIRE AND I AM GOING TO GET SERIOUSLY HURT.  PLEASE DO SOMETHING.  I AM DISABLED ON A FIXED INCOME AND CANNOT AFFORD TO KEEP JUST CHANGING THING UNTIL WE FINALLY, IF EVER, LOCATE THE PROBLEM.    THIS IS A EXTREMELY SERIOUS AND POTENTIALLY DANGEROUS PROBLEM.  IT MUST BE ADDRESSED BEFORE SOMEONE IS INJURED OR KILLED. I DID NOTICE THAT IT APPEARED TO HAVE BEEN HALF-HEARTEDLY LOOKED INTO PREVIOUSLY, PLEASE TAKE THIS SERIOUSLY.  THERE ARE MANY OF THESE ON THE ROAD AND IT NEEDS TO BE RECALLED.",
        "vin": "KNDJA723925"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2010",
        "dateOfIncident": "09/24/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360428,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER OWNS A 2002 KIA SPORTAGE THAT RECENTLY BROKE DOWN DUE TO A FUEL LEAK ON TOP OF THE GASTANK. CAR WAS TOWED TO THE NEAREST REPAIR FACILITY. TURNS OUT A PLASTIC NOZZLE HAD CRACKED OFF THE HIGH PRESSURE FUEL SUPPLY LINE COMING OUT OF THE GASTANK ITSELF RESULTING IN PUMPING FUEL EVERYWHERE! LUCKILY,VEHICLE DIDN'T CATCH ON FIRE! PART WAS FINALLY REPLACED 4TH TIME BACK TO REPAIR FACILITY, BUT WAS REPLACED WITH THE SAME PLASTIC NOZZLE INSTEAD OF A METAL NOZZLE?THIS IS MY SAFETY CONCERN WITH THIS VEHICLE, AFRAID THE SAMETHING WILL EVENTUALLY HAPPEN AGAIN. HAD THE VEHICLE CAUGHT ON FIRE, MY 17YR OLD DAUGHTER WOULD PROBABLY NOT HAD ENOUGH TIME TO EXIT THE VEHICLE, DUE TO THE AMOUNT OF FUEL UNDERNEATH IT? NOT SURE IF THIS IS A COMMON PROBLEM WITH THIS VEHICLE, BUT I FEEL THIS SITUATION SHOULD BE ADDRESSED AS A SAFETY CONCERN. *TR",
        "vin": "KNDJB723725"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/14/2010",
        "dateOfIncident": "09/24/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360527,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY FILED A COMPLAINT ON A 2002 KIA SPORTAGE, FOR A FUEL LEAK CONDITION FROM GASTANK AREA,(PLASTIC FITTING), MY DAUGHTER HAS RECENTLY ADVISED ME SHE HAS BEEN HAVING TROUBLE FILLING THE GASTANK AND SMELLING AN ODOR OF FUEL ON OCCASIONS AND BAD FUEL MILEAGE. APPARENTLY, WHEN PUMPING FUEL, THE FUEL WILL BLOW BACK OUT ON HER, IF NOT PUMPED SLOWLY! SEEMS TO BE ANOTHER ISSUE WITH THIS CERTAIN VEHICLE?????? VEHICLE ALSO HAS AN INTERMITTENT CHK ENGINE LIGHT COMING ON?? CODE # PO13A?? ANOTHER SAFETY CONCERN! ???????? *TR",
        "vin": "KNDJB723725"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/28/2010",
        "dateOfIncident": "06/08/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358020,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT WHENEVER HE DROVE, THE CHECK ENGINE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR SHOP WHERE THE THERMOSTAT WAS REPLACED. THE FAILURE CONTINUED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE RADIATOR WAS REPLACED. HOWEVER, THE FAILURE CONTINUED. ALSO, WHILE TRAVELING APPROXIMATELY 35 MPH, THE CONTACT NOTICED THAT THE POWER STEERING MALFUNCTIONED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE FAN BELT WAS REPLACED. THE FAILURE MILEAGE WAS APPROXIMATELY 68,000 AND THE CURRENT MILEAGE WAS APPROXIMATELY 78,000.",
        "vin": "KNDJB723725"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/20/2010",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356651,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA SPORTAGE. THE CONTACT STATED THAT WHENEVER HE WOULD ATTEMPT TO FILL THE FUEL TANK, GASOLINE WOULD BEGIN TO SPEW OUT OF THE FUEL TANK.  THE CONTACT ALSO NOTICED THAT WHEN USING THE AIR CONDITIONER THE ENGINE WOULD EXHIBIT A LOUD ROARING NOISE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CURRENT AND FAILURE MILEAGE WAS 150,000.",
        "vin": "KNDJB723X25"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/19/2010",
        "dateOfIncident": "02/13/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356328,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "COOLANT GAUGE NOT READING OR REGISTERING THERMOSTAT TEMPERATURE THEREFORE RENDERING IT UNFIT FOR CLEARING AN INSPECTION. IT CAUSES THE CHECK ENGINE LIGHT TO STAY ON EVEN IF COOLANT AND/OR THERMOSTAT, SENSORS,HARNESS WIRING WIRES AND OTHER THINGS/PARTS CONNECT TO IT HAS BEEN REPLACED OR CHECKED FOR PROBLEMS IT STILL GIVES A FALSE READING THAT THE SAME PROBLEM IS WRONG WITH VEHICLE. COOLANT THERMOSTAT NOT REACHING TEMPERATURE. *TR",
        "vin": "KNDJB723125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2010",
        "dateOfIncident": "08/24/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351588,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2002 KIA SPORTAGE YESTERDAY, I HEARD A LOUD BANG AND PULLED OFF THE ROAD TO INVESTIGATE. I NOTICED ANTIFREEZE COMING FROM UNDER MY CAR. I OPENED THE HOOD AND FOUND THAT THE RADIATOR FAN HAD EXPLODED AND WAS MISSING ALL IT'S BLADES AND THE SHROUD WAS IN PIECES ALSO. ONE OF THE PIECES PUNCHED A HOLE IN THE RADIATOR. PRIOR TO THIS HAPPENING, THE VEHICLE WAS NOT OVERHEATING OR HAVING ANY NOTICEABLE PROBLEMS.  I DISCOVERED LAST NIGHT THAT THIS VEHICLE WAS RECALLED FOR THIS EXACT SAME PROBLEM BUT KIA MOTORS CLAIMS THAT MY VEHICLE WAS NOT INCLUDED IN THE RECALL EVEN THOUGH I HAD THE EXACT SAME PROBLEM AS NOTED IN THE RECALL. MY CAR IS IN THE SHOP AND I AM PAYING TO HAVE THE VEHICLE REPAIRED. I THINK MAYBE THE PROBLEM MAY BE PRESENT IN OTHER VEHICLES NOT \"LISTED\" IN THE RECALL. I FEEL LUCKY THAT I DID NOT HAVE MY HEAD UNDER THE HOOD WHEN THIS HAPPENED. *TR",
        "vin": "KNDJB623025"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/20/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10344370,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE. CONSUMER EXPRESSES DISCONTENT REGARDING NOT BEING ABLE TO GET RECALL REPAIRS *TGW  THE CONSUMER STATED THE VEHICLE WAS IN THE REPAIR SHOP HAVING MAJOR ENGINE WORK DONE AT THE TIME OF THE RECALL APPOINTMENT. THE CONSUMER ALSO SUGGESTED THAT MAYBE THE WORK SHE WAS HAVING DONE WAS RELATED TO THE RECALL. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "07/10/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343006,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "OUR 2002 KIA SPORTAGE WAS DUE FOR A NEW TIMING BELT SO WE HAD IT REPLACED, SUBSEQUENTLY  A COUPLE OF MONTHS LATER WE RECEIVED NOTIFICATION THAT THERE WAS A RECALL ON THE FAN BLADE AND HAD IT REPLACED.  APPROXIMATELY 5 WEEKS LATER THE FAN BLADE CAME OFF AND WENT THROUGH THE RADIATOR AND THE ENGINE SEIZED UP, SO WE HAD IT TOWED TO THE DEALERSHIP.  THEIR ASSESSMENT WAS THAT IT WASN'T THEIR FAULT BUT THAT THE FAN CLUTCH LET GO, WHICH IS ATTACHED TO THE FAN BLADE, AND THEY CLAIMED THAT THEY HADN'T TOUCHED THE FAN CLUTCH WHEN THEY REPLACED THE BLADE.  AFTER TALKING TO THE SERVICE PERSONNEL AND ASKING ABOUT THE PROCEDURE TO REPLACE THE BLADE I WAS FINALLY TOLD, \"IT WAS DONE BY MAGIC\".  CONTACTED THE KIA REPRESENTATIVE WHO SAID HE'D LOOK INTO IT, BUT TO DATE HAVE NEVER HEARD FROM HIM, ONLY THE DEALERSHIP WHO WANTED ME TO GET THE CAR OFF THEIR LOT.  THEY WERE WILLING TO REPLACE THE ENGINE FOR $3000, BUT FORTUNATELY I HAD ACCESS TO RESOURCES AND GOT IT DONE FOR HALF THE PRICE.  WOULDN'T DO BUSINESS WITH THIS DEALER AGAIN AFTER BEING TREATED THIS WAY, AND TO THINK WE'D PURCHASED 4 VEHICLES FROM THEM. *TR",
        "vin": "KNDJA723325"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/19/2010",
        "dateOfIncident": "06/16/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339125,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE. DEALER AND KIA ADMITTED THE CAR HAD THE PART RECALLED. THE PLASTIC FAN BROKE AND PIECES WENT INTO THE RADIATOR AND HOSES. THE DEALER GAVE ME A PRICE OF 660 DOLLARS TO FIX THE REPAIRS. HOWEVER,  THEY SAID I WAS RESPONSIBLE FOR THE CHARGES SINCE  THEY SENT OUT A REPAIR NOTICE APPROX 3 YEARS AGO WHICH I NEVER RECEIVED. I HAD TOWED THE CAR TO THE DEALER AND THEY REFUSED TO REPAIR IT AND PAY FOR THE REPAIRS. I CALLED KIA AND THEY SAID THAT IF THE PART WAS RECALLED AND CAUSED THE DAMAGE THEY WOULD PAY FOR IT. THEY WERE GONNA CONTACT THE DEALER SO WHEN I CALLED AGAIN THEY SAID THEY WOULDN'T PAY. *TR",
        "vin": "KNDJA723225"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "10/11/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321980,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE. CONSUMER STATES VEHICLE HAS A DEFECTIVE ENGINE COOLING FAN. *TGW  THE CONSUMER STATED SHE INCURRED AN EXPENSE TO REMEDY THE DEFECTIVE ENGINE COOLING FAN PRIOR TO RECEIVING THE RECALL NOTICE.  THE CONSUMER STATED SHE MAILED THE REPAIR RECEIPT ALONG WITH A COVER LETTER EXPLAINING WHAT HAPPENED. THE CONSUMER STATED SHE WAS DRIVING WHEN THE FAN BROKE AND HAD TO STOP AT THE FIRST REPAIR SHOP TO HAVE THE REPAIR DONE.  *JB",
        "vin": "KNDJB723525"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/11/2010",
        "dateOfIncident": "01/11/2009",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318857,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE. WHILE DRIVING AT APPROXIMATELY 50 MPH, THE FAN BLADE BLEW INTO PIECES. HE REPLACED THE POWER STEERING RESERVOIR, ANTIFREEZE RESERVE TANK, ALL THREE SERPENTINE BELTS, AIR INTAKE, AND THE INTAKE HOSE HIMSELF, TO CORRECT THE FAILURE. HE THEN RECEIVED A RECALL NOTICE (NHTSA CAMPAIGN ID NUMBER: 07V161000, ENGINE AND ENGINE COOLING: COOLING SYSTEM: FAN) AND PETITIONED FOR REIMBURSEMENT WITH THE MANUFACTURER. THE DEALER ADVISED HE WOULD NOT BE CONSIDERED FOR REIMBURSEMENT UNTIL HE TOOK HIS VEHICLE TO AN AUTHORIZED DEALER TO HAVE THE RECALL REPAIR PERFORMED. HE SOON NOTICED THE SMELL OF BURNING ANTIFREEZE CIRCULATING THROUGHOUT THE CABIN OF THE VEHICLE AND THE ENGINE BECAME UNUSUALLY WARM. THE DEALER REPLACED THE FAN BELT UNDER THE RECALL CAMPAIGN AND WAS DENIED REIMBURSEMENT. AFTER REPAIRS, HE CONTINUED TO SMELL BURNING ANTIFREEZE. THE MANUFACTURER WAS CONTACTED AND HE WAS ADVISED TO TAKE THE VEHICLE BACK TO THE DEALER. THE CURRENT MILEAGE WAS 68,835 AND THE FAILURE MILEAGE WAS APPROXIMATELY 65,838.",
        "vin": "KNDJB723325"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "03/10/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318391,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2002 KIA SPORTAGE FROM A USED CAR DEALER ON MARCH3,2010 AFTER A WEEK OR SO NOTICED A VERY STRONG GAS ODOR  NO DRIPS OR PUDDLING UNDER CAR CALLED TO WAGNER KIA A LOCAL DEALER AND WAS TOLD THIS IS KNOWN PROBLEM WITH THIS VEHICLE AND WOULD COST ABOUT $500.00 TO TAKE CARE OF THE O RING AND FUEL LINE.  IF THIS IS A KNOWN PROBLEM WHY IS IT NOT BEING TAKEN CARE OF BY KIA. *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/20/2010",
        "dateOfIncident": "04/08/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312419,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 KIA SPORTAGE IT HAS 80,000 MILES ON IT AND I WAS DRIVING IT CAME UP ON A RED LIGHT AND THE CLUTCH WOULDN'T DISENGAGE THE PEDAL WOULD GO DOWN BUT THE CLUTCH WOULDN'T RELEASE SO I DROVE THROUGH A RED LIGHT WITH NO ABILITY TO STOP THERE WAS ALOT OF CARS COMING AND THEY BARELY MISSED T-BONING ME THERE WHERE KIDS ALSO PLAYING ON THE SIDE WALK I HAD TO SHUT THE ENGINE OF AND COAST TO A STOP THE GEAR SHIFT WOULDN'T COME OUT OF GEAR AS LONG AS THE ENGINE WAS TURNING OVER. IT WILL START AND RUN ALL DAY AS LONG AS ITS IN NEUTRAL. I HAD TO HAVE THE VEHICLE TOWED AND IT HAS SAT FOR TWO YEARS NOW ( I DEPLOYED FOR 15 MONTHS THAT'S WHY ITS SAT SO LONG) I REPLACED THE SLAVE AND MASTER CYLINDER AND IT HASN'T CHANGED ANYTHING I WAS IN A PARTS STORE AND HEARD ANOTHER GUY TALKING ABOUT HIS 2002 SPORTAGE IT DONE THE SAME THING AND HE REAR ENDED SOMEONE TOTALING IT. ITS IN A JUNKYARD NOW AND I HAVE TALKED TO COUNTLESS OTHERS WHO HAVE HAD THIS PROBLEM ONE GUY PAID THE DEALERSHIP 1700$ TO FIX HIS THEN THE PROBLEM CAME BAD A WEEK LATER. I JUST WANT MY CAR TO BE FIXED. THE LAST PROBLEM I HAD WITH IT WAS THE FAN EXPLODED WHEN I WAS DRIVING DOWN THE ROAD AND CUT MY RADIATOR THE DEALER REPLACED THE FAN BUT JUST CRIMPED MY RADIATOR I AM VERY DISSATISFIED WITH KIA I CALLED AND THE GUY HUNG UP ON ME WHEN I EXPLAINED MY PROBLEM SO IM NOT THE ONLY ONE IM SURE. *TR",
        "vin": "KNDJA723925"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "02/10/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308274,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PRIOR,AT 97K THE REAR WAS MAKING NOISE. BROUGHT TO DEALER,THEY SAID REAR NEEDS TO BE REPLACED. BECAUSE I HAD NO RECEIPTS FROM A GARAGE STATING THE OIL WAS REPLACED,IT WAS NOT COVERED UNDER WARRANTY. DEALER WANTED TO CHARGE $900. TO REPLACE REAR AND AXLE. PART CHANGERS.HAD REAR REBUILT $400. RADIATOR WAS REPLACED AT 100K. AFTER OVER YEARS,COOLING FAN WAS REPLACED UNDER RECALL. VACUUM HUB WAS REPLACED TO MANUAL. FUEL SMELL, WAS RUBBER RETURN LINE FROM FUEL PSI REGULATOR TO METAL RETURN LINE LEAKING. KEPT UP ON ALL MAINTENANCE SINCE NEW,A RELIABLE CAR WITH ORIGINAL ENGINE AND TRANSMISSION, AT 222K. *TR",
        "vin": "KNDJA723925"
    },
    {
        "components": "POWER TRAIN,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2010",
        "dateOfIncident": "09/10/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10299812,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE 4WD HAS A VACUUM-HUB SYSTEM, I HAVE BEEN RESEARCHING ON THE INTERNET AND HAVE FOUND THAT THIS HAS A HISTORY OF FAILURE, HOWEVER THERE IS NO WAY OF KNOWING THAT THE 4WD IS NOT ENGAGED,BECAUSE THE INDICATOR ON THE DASHBOARD LIGHTS WHETHER OR NOT THE 4WD IS WORKING.  THIS IS A COMMON ONGOING PROBLEM IN THESE VEHICLES, THE SOLUTION WOULD BE TO INSTALL MANUAL HUBS,HOWEVER KIA DOES NOT OFFER TO PAY FOR THIS OPTION TO ITS CONSUMERS. I LIVE IN WISCONSIN AND AM A SINGLE MOTHER AND DEPEND UPON THE 4 WHEEL DRIVE TO GET ME THROUGH THE WISCONSIN WINTERS, NOW THAT THE 4 WHEEL DRIVE IS NOT WORKING I GET STUCK IN THE SMALLEST AMOUNT OF SNOW, AND FEEL LIKE A IDIOT CALLING AAA TO TOW ME OUT ALL THE TIME.  I THINK THAT THIS PROBLEM SHOULD BE MADE INTO A RECALL ESPECIALLY SINCE I ONLY HAVE 56,000 MILES ON THE VEHICLE AND AM THE ORIGINAL OWNER. *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2009",
        "dateOfIncident": "12/28/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297320,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2002 KIA SPORTAGE IN 2003 & IT WAS ALMOST 2 YEARS BEFORE I STARTED HAVING A PROBLEM PUTTING GAS IN MY GAS TANK, I HAVE TO PUMP THE GAS VERY SLOW & EVEN THEN THE GAS SPURTS BACK OUT & GETS ON MY CAR, CLOTHS, ETC., IT TAKES A VERY LONG TIME TO FILL MY GAS TANK, IT SEEMS THAT THIS PROBLEM OCCURS MORE OFTEN IN THE WINTER, BUT IT HAS HAPPENED IN THE SUMMER AS WELL, I HAVE JUST NOW IN THE LAST WEEK BEEN HAVING A PROBLEM WITH SMELLING A STRONG GAS SMELL IN MY KIA JUST AFTER I START GOING, I AM GOING TO GO TO THE KIA DEALERSHIP TO SEE IF THEY HAVE ANY INTENTIONS OF FIXING THIS PROBLEM SINCE IT APPEARS THERE ARE ALOT OF 2002 KIA OWNERS WITH THE SAME PROBLEM, IT DOESN'T TAKE MUCH TO FIGURE OUT THAT THIS IS A MANUFACTURER'S DEFECT. *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2009",
        "dateOfIncident": "10/12/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292314,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE ALSO EXPERIENCED THE GAS PROBLEM.  FIRST WE HAD A PROBLEM WITH THE TANK LEAKING (WAS TOLD BY KIA THAT 2002 SPORTAGE MODEL WAS NOT PART OF THE RECALL/CHECK, WHICH IT WAS AND THEY SHOULD HAVE PAID FOR THE $500 PROBLEM). SECOND, THE GAS SHOOTS OUT WHEN YOU TRY TO FILL, AND CHECK ENGINE LIGHT COMES ON, THIS (WE WERE TOLD) IS A BAD OXYGEN SENSOR, ANOTHER $350 AND STILL NOT COVERED. *TR",
        "vin": "KNDJB723125"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/31/2009",
        "dateOfIncident": "10/30/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290434,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE SHOOTS GAS BACK OUT OF TANK WHILE FUELING. AFTER FUELING (TANK IS EMPTY)FOR A FEW SECONDS PUMP SHUTS OFF AND FUEL SHOOTS BACK OUT OF TANK.  GAS SHOOTS OUT AT A RATE THAT CAUSES IT TO SPILL OVER TO THE GROUND. CAN NOT FILL ORE THAN $5.00 DOLLARS WORTH OF GAS WITHOUT AN OVERFLOW. *TR",
        "vin": "KNDJA723525"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2009",
        "dateOfIncident": "09/10/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289785,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE BEEN HAVING A PROBLEM WITH THE FUEL MARKER.  WHEN I PUMP GAS IT WILL GUSH OUT EVEN WITH JUST $2.00 IN THE TANK I WOULD HAVE TO PUMP IT VERY SLOW IN ORDER TO FILL MY TANK UP.  I HAVE A 2002 KIA SPORTAGE AND FROM WHAT I HEAR THIS IS GOING ON WITH OTHER KIA'S.  I WOULD LIKE TO KNOW IF THIS IS A MANUFACTURE ERROR OR IS IT TIME.  IT IS VERY SCARY WHEN THE GAS COMES OUT AND GETS ALL OVER MY CLOTHES I THINK IT'S HAZARDOUS. *TR",
        "vin": "KNDJB723125"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/21/2009",
        "dateOfIncident": "10/20/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289280,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2002 KIA SPORTAGE. DRIVER NOTICED SLIGHT ODD NOISE COMING FROM CAR WHEN CHANGING DIRECTIONAL GEARS, OR TAKING OFF FROM STOPS. 2ND FROM REAR CROSSMEMBER RUSTED OUT, BUT WAS CAUGHT EARLY ENOUGH TO PREVENT SERIOUS ACCIDENT.  IF PROBLEM HAD NOT BEEN CAUGHT EARLY AXLE COULD HAVE SHIFTED CAUSING SERIOUS ACCIDENT. CROSSMEMBER SUPPORTS GAS TANK AND KEEPS REAR DRIVE AXLE IN PLACE.   OLD CROSSMEMBER WILL BE CUT OUT AND NEW WELDED BACK IN. *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/06/2009",
        "dateOfIncident": "10/06/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286568,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 KIA SPORTAGE SURGES FORWARD WHILE STOPPED AT A TRAFFIC SIGNAL. THIS HAS BEEN AN ON-GOING PROBLEM SINCE I PURCHASED THE VEHICLE IN 2002. ALSO, THE VEHICLE STALLS ON A REGULAR BASIS, WHILE AT SPEEDS IN EXCESS OF 40 MPH. *TR",
        "vin": "KNDJB723X25"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2009",
        "dateOfIncident": "01/15/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283490,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FOUR WHEEL DRIVE ON 2002 KIA SPORTAGE. IT LOCKS UP AND THE ONLY WAY TO FIX THIS IS TO UNHOOK HOSES WHEN NOT IN USE AND TO HOOK THE HOSES UP WHEN NEEDED. *TR",
        "vin": "KNDJA723X25"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/01/2009",
        "dateOfIncident": "07/28/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282526,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FAN BLADES ON 2002 KIA SPORTAGE. *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/31/2009",
        "dateOfIncident": "08/31/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283171,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2005 KIA SPORTAGE HAS A FAULTY HARMONIC BALANCER.   *NJ",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/16/2009",
        "dateOfIncident": "03/18/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276972,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  WHENEVER THE VEHICLE WAS DRIVEN, IT WOULD CHANGE TO 4-WHEEL DRIVE WITHOUT THE DRIVER MOVING THE LEVER.  PRIOR TO THE FAILURE, THE CONTACT NOTICED THAT THE 4-WHEEL DRIVE INDICATOR WOULD ILLUMINATE ON THE DASHBOARD, EVEN WHEN IT WAS NOT ENGAGED.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE CURRENT MILEAGE WAS 74,445 AND FAILURE MILEAGE WAS 69,000.",
        "vin": "KNDJA723X25"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/22/2009",
        "dateOfIncident": "08/17/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269681,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE: 2002 KIA SPORTAGE 4 DR. 4X4; PURCHASED BRAND NEW & PD. IN FULL. IN 2008, WE LEFT AN AMUSEMENT PARK, HOT DAY.  4 PASSENGERS INCLUDING 1 BABY. UPON GOING HOME NEEDED TO RUN A/C. I <DRIVER> NOTICED THE TEMP. GAUGE GOING FROM APPROX. MIDRANGE TEMP. TO HOT.  A/C WAS SHUT OFF & WE ROLLED DOWN WINDOWS & MADE IT HOME. TOOK VEHICLE TO BE CHECKED OUT & WAS TOLD THAT THE COOLING FAN WAS INOPERATIVE. THE TECH. SAID THERE IS A RECALL FOR THIS PROBLEM.  I TOOK VEHICLE TO KIA DEALERSHIP WHO CLAIMED AFTER APPROX. 30 - 40 MINS, IN HIS CARE, THAT THE RECALLED COOLING FAN PROBLEM WAS NOW REPLACED @ NO CHARGE TO ME. I AM NOW FINDING OUT THAT  REPLACEMENT WAS NOT DONE DUE TO ANOTHER, SEPARATE TECHNICIAN. 2 TECH'S INVOLVED. 1ST TECH TOLD ME OF RECALL; 2ND TECH SAID RECALLED ITEM WAS NOT REPLACED. WHAT SHOULD I DO? PLEASE TELL ME. I NEED YOUR ADVICE. I AWAIT YOUR REPLY AS TIME IS OF THE ESSENCE. *TR",
        "vin": "KNDJA723X25"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2009",
        "dateOfIncident": "04/13/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10265202,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SISTER-IN-LAW HAS A 2002 KIA SPORTAGE THAT HAS BEGUN LEAKING FUEL OUT OF A CRACKED FUEL TANK.  APPARENTLY THIS IS SO COMMON THAT A KIA RECALL (RECALL SC059) WAS ISSUED.  HOWEVER, A DEALERSHIP IN SCOTTSDALE ARIZONA TOLD US THAT HER VIN WAS NOT A PART OF THE RECALL.  YET, THE VERY REASON FOR BRINGING IT IN WAS FOR THE EXACT FOCUS OF THE RECALL.  THE RECALL SPECIFICATIONS DO NOT EXCLUDE/INCLUDE SPECIFIC VINS.  HOW CAN WE GET KIA TO HONOR THEIR RECALL? *TR",
        "vin": "KNDJB723525"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/27/2009",
        "dateOfIncident": "03/27/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10263260,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I READ A FORUM ABOUT DEFECTIVE 2002 KIA SPORTAGE FUEL TANKS,,, AND I WANTED TO ADD MY NAME TO THE LIST OF DEFECTIVE TANKS..... *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/29/2009",
        "dateOfIncident": "04/10/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256706,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  THE CONTACT SMELLED A STRONG ODOR OF GASOLINE EMANATING FROM HER VEHICLE.  SHE TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT GASOLINE WAS LEAKING FROM THE FUEL TANK.  SECONDLY, A TECHNICIAN STATED THAT THERE WAS NO RECALL AVAILABLE FOR THAT COMPONENT; THEREFORE, THE CONTACT WOULD HAVE TO ASSUME FINANCIAL RESPONSIBILITY FOR THE REPAIR.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE MILEAGE WAS 72,000       UPDATED 03-30-09 *BF  UPDATED 03/31/09.*JB",
        "vin": "KNDJA623X25"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2009",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255974,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  THE CONTACT STATED THAT WHENEVER THE TEMPERATURE DROPS BELOW 40 DEGREES OUTSIDE, HE SMELLS A VERY STRONG ODOR OF GASOLINE INSIDE AND AROUND THE VEHICLE.  THE ODOR IS NOTICEABLE WHEN WALKING UP TO THE VEHICLE AND ALSO WHEN IT IS BEING DRIVEN.  THE SCENT IS SO STRONG THAT PASSENGERS BEGIN TO COUGH INSIDE THE PASSENGER COMPARTMENT OF THE VEHICLE.  THE VEHICLE HAS BEEN TAKEN TO THE REPAIR SHOP, MECHANIC, OR DEALER.  THE MANUFACTURER STATED THAT THEY WERE NOT AWARE OF ANY OTHER VEHICLES EXPERIENCING THIS FAILURE.  THE ISSUE ONLY OCCURS IN THE WINTER DUE TO VERY COLD TEMPERATURES.  THE FAILURE MILEAGE WAS 50,000 AND CURRENT MILEAGE WAS 130,000.    UPDATED 07/28/09   *BF  THE CONSUMER STATED THE VEHICLE ALSO STALLED WHEN IT RAINED. THE CONSUMER STATED  HE HAS TAKEN THE VEHICLE TO THE DEALER MULTIPLE TIMES, BUT TO NO AVAIL. UPDATED 07/30/09.*JB",
        "vin": "KNDJB723825"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2009",
        "dateOfIncident": "01/15/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255552,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE HAS SEVERE AND DANGEROUS GASOLINE SMELL INSIDE VEHICLE AFTER COLD WEATHER. *TR",
        "vin": "KNDJA723925"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2009",
        "dateOfIncident": "03/10/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253814,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  IMMEDIATELY AFTER PURCHASING THE VEHICLE IN MARCH OF 2008, THE CONTACT NOTICED A FAINT SMELL OF GASOLINE INSIDE THE VEHICLE.  HE ONLY NOTICED THE SMELL WHEN THE GAS TANK WAS FULL.  THE FAILURE LASTED OVER THE PAST SEVERAL MONTHS AND THE SMELL GREW STRONGER.  THE DEALER HAS NOT BEEN NOTIFIED.  THE MANUFACTURER STATED THAT THERE WERE NO RECALLS RELATING TO HIS VEHICLE; THEREFORE, THEY WERE NOT LIABLE FOR THE REPAIRS.  THE CURRENT MILEAGE WAS 43,000 AND FAILURE MILEAGE WAS 33,000.",
        "vin": "KNDJA723025"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/15/2008",
        "dateOfIncident": "10/12/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251809,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  WHILE DRIVING APPROXIMATELY 10 MPH ON NORMAL ROAD CONDITIONS, THE CONTACT SMELLED A STRONG ODOR OF FUEL COMING THROUGH THE AIR VENTS OF THE VEHICLE.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING; HOWEVER, THE CAUSE OF THE FAILURE COULD NOT BE DETERMINED.  ON A SEPARATE OCCASION, THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR THE SAME FAILURE WITH NO RESOLUTION.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CONTACT WAS IN THE PROCESS OF NOTIFYING THE AUTHORIZED DEALER.   THE FAILURE MILEAGE WAS 55,000 AND CURRENT MILEAGE WAS 55,900.    UPDATED 1/8/09 *CN  UPDATED 01/14/09. *JB",
        "vin": "KNDJA723425"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/20/2008",
        "dateOfIncident": "02/03/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249460,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED THIS CAR USED IN FEBRUARY 2008.  WHEN FILLING WITH GAS, THE GAS HAS TO BE PUMPED EXTREMELY SLOW OR IT SPURTS OUT.  THE CAR HAS AN ODOR OF GAS ALSO.  THIS PROBLEM IS WORSE IN THE WINTER, ALTHOUGH IT HAS HAPPENED OCCASIONALLY IN WARMER WEATHER, BUT THE MINUTE THE TEMPERATURE GOES BELOW 40 F,  I CAN COUNT ON THIS HAPPENING EVERY TIME I PUT GAS IN THE CAR.  I'VE RUINED CLOTHES, SHOES, AND HAVE ENDED UP WITH GAS ALL OVER MY HANDS AND LEGS (AND I'VE COME CLOSE TO GETTING IT IN MY FACE!!).  THE GAS PUMP WILL SHUT OFF AS IF THE TANK IS FULL AND THE GAS JUST SPURTS RIGHT OUT OF THE TANK.  IF I PUMP THE GAS EXTREMELY SLOW, (TONIGHT IT TOOK ME ALMOST 10  MINUTES TO PUMP ABOUT 6 GALLONS OF GAS), I CAN USUALLY MANAGE TO GET MOST OF THE GAS IN THE TANK, BUT AGAIN, I HAVE TO GO EXTREMELY SLOW AND THE PUMP STILL KEEPS SHUTTING OFF. IT  WOULD  KEEP STOPPING AS STATED ABOVE, BUT ONLY A LITTLE GAS WILL SPURT OUT WHEN IT STOPS.  IF I TRY TO PUMP AT A NORMAL SPEED, IT ONLY TAKES A FEW SECONDS AND THE GAS STARTS SPURTING AND I END UP COVERED WITH GAS BY THE TIME I'M DONE.  I THOUGHT THIS WAS JUST A FLUKE, BUT ONE OF MY FELLOW EMPLOYEES ALSO HAD A 2002 KIA SPORTAGE AND HAD THE SAME PROBLEM.  THEN JUST A FEW MINUTES AGO ON THIS SITE, I READ SOMEONE ELSE WITH THE SAME PROBLEM.  I THINK THIS IS DANGEROUS SINCE YOU END UP WITH GAS ALL OVER YOUR CAR, THE GROUND, AND YOURSELF! *TR",
        "vin": "KNDJA723525"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2008",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246352,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FILLING THE KIA WITH GAS TAKES FOREVER.  IT IS LIKE THE VENTING SYSTEM WON'T LET THE GAS IN, IN A MATTER OF SECONDS THE GAS SPEWS OUT OF TANK.  WE HAVE TO KEEP CLICKING THE HANDLE OFF AND ON TO FILL THE TANK.  THIS FIRST STARTED OUT JUST IN THE WINTER MONTHS, NOW IT IS ALL THE TIME.  WE TRIED TO SEE IF SOMETHING WAS BLOCKING IT, BUT COULDN'T GET INTO IT.  WITH THE THINGS GOING ON IN OUR LIFE RIGHT NOW, WE HAVEN'T TAKEN THE TIME TO HAVE IT CHECKED OUT.  PLUS WE DON'T HAVE THE EXTRA MONEY TO SPEND ON IT.  WE JUST KNOW THAT WHEN WE GO TO FILL THE KIA IT WILL TAKE A LONG TIME.  WAS JUST WONDERING IF THIS  IS HAPPENING TO OTHERS? *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/04/2008",
        "dateOfIncident": "08/29/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240882,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL - THE CONTACT OWNS A 2002 KIA SPORTAGE.  WHILE DRIVING BETWEEN 45-50 MPH SHE HEARD A LOUD SOUND AND THE VEHICLE WAS SHAKING, RUNNING HOT AND STEAM AND SMOKE WAS COMING OUT FROM UNDER THE HOOD.  THE VEHICLE WAS TOWED.  THE DIAGNOSIS WAS THAT THE CLUTCH FAN FRAGMENTED AND BROKE AND WENT INTO THE RADIATOR.  THE RADIATOR HAD TO BE REPAIRED, THE TIMING BELT HAD TO BE REPLACED, THE HEAD GASKET HAD TO BE REPLACED, AND THE HEAD RESURFACED.    THE CONTACT REFERENCED A SAFETY RECALL 07V161000 - ENGINE AND ENGINE COOLING:COOLING SYSTEM:FAN.   THE CURRENT MILEAGE WAS 98,000.     KG   UPDATED 10/14/08  *BF  UPDATED 10/23/08. *JB",
        "vin": "KNDJA723425"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2008",
        "dateOfIncident": "08/18/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239769,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NY KIA SPORTAGE 2002 4D4X4 COOLING FAN BLEW APART TAKING OUT THE RADIATOR AND OTHER PARTS. IT IS A DEFECTIVE PART FOUND RECALL ON THE INTERNET. CALLED KIA 18003334542 ARGUED WITH THEM FOR A WEEK THEY FINALLY AGREED TO FIX THE DAMAGE. IT WAS TO BE DONE MONDAY THAT'S WHEN THEY ORDERED THE PARTS.  THEY WILL NOT PROVIDE A LOANER CAR AS MINE IS OUT OF WARRANTY.  *TR",
        "vin": "KNDJA723825"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2008",
        "dateOfIncident": "05/22/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239433,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 KIA SPORTAGE THAT HAS A STRONG ODOR OF GASOLINE.  I SEE THAT 2005 KIA'S HAD A RECALL ON FUEL LEAKS FROM THE O-RING INTO THE INTERNAL VAPOR CHAMBER IN THE FUEL TANK, I BELIEVE THE 2002 KIA'S ALSO HAVE THIS PROBLEM. *TR",
        "vin": "KNDJA723425"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/06/2008",
        "dateOfIncident": "08/06/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237303,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO START BY SAYING THAT I HAVE HAD MY VEHICLE AT THE MECHANIC'S SHOP TWICE WITHIN THE PAST YEAR DUE TO MY CHECK ENGINE LIGHT COMING ON AND GOING OFF SPORADICALLY.  MY MECHANIC HAS, BOTH TIMES, HOOKED IT UP TO ALL HIS MACHINERY TO CHECK FOR THE PROBLEM, BUT BOTH TIMES, FOUND NOTHING.  NOW, LET ME TELL YOU WHAT JUST HAPPENED...  I HAD AN INCIDENT HAPPEN WITH MY 2002 KIA SPORTAGE THIS EVENING 8/6/08.  THE COOLING FAN BROKE APART AN SEVERED MY POWER STEERING HOSE SPRAYING OIL ALL OVER MY CAR CAUSING IT TO SMOKE AND MY POWER STEERING TO GO OUT.  THIS IS WHAT MY HUSBAND SAYS HAPPENED ANYWAY.  I WAS STRANDED 30 MILES FROM HOME AND HAD TO HAVE MY CAR TOWED TO MY USUAL MECHANIC. UPON RETURNING HOME I RESEARCHED THE NET FOR MY VEHICLE AND FOUND THAT THERE WAS A RECALL FOR THIS VERY SAME PROBLEM IN 2007.  I WAS NOT NOTIFIED OF THIS RECALL AND WOULD HAVE HAD MY VEHICLE FIXED HAD I KNOWN.  I'M NOT SURE OF THE EXTENT OF THE DAMAGE, AS THIS JUST HAPPENED TONIGHT, BUT I WANT TO KNOW WHAT CAN BE DONE ABOUT IT?  *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/07/2008",
        "dateOfIncident": "06/05/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230212,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2002 KIA SPORTAGE IN JUNE 2008 FROM THE KIA DEALER IN REDDING.  SINCE THAT TIME THE AUTOMATIC DOOR LOCKS HAVE STARTED LOCKING ON THEIR OWN AT VARIOUS TIMES.  THEY LOCK AT RANDOM TIMES WHILE I AM DRIVING AND AFTER I HAVE TURNED THE CAR OFF.  IT HAS GOTTEN SO BAD NOW THAT I HAVE TO KEEP THE KEYS WITH ME OR LEAVE THE DOOR OPEN WHEN I GET OUT OF THE CAR AND AM GOING TO GET RIGHT BACK IN.  THIS HAPPENS EVERY TIME I DRIVE THE CAR NOW.    THERE HAVE ALSO BEEN A COUPLE OF TIME THE LOCKS HAVE STUCK AND I COULD NOT GET THEM UNLOCKED WHILE I WAS IN THE CAR.  I HAD TO PRESS THE UNLOCK BUTTON ON THE AUTOMATIC KEY LOCK TO GET THE DOOR UNLOCKED.  I LIVE IN AN AREA WHERE IT CAN GET OVER 120 DEGREES IN THE CAR IN THE SUMMER AND IF THIS HAPPENS AND I CAN'T GET OUT OF THE CAR OR IF THE DOORS LOCK WHEN ONE OF MY GRANDCHILDREN IS IN THE CAR OR ONE OF MY PETS IT COULD BE DISASTROUS.  I AM HAVING IT LOOKED AT NEXT WEEK AT THE DEALERSHIP.  MY MOTHER ALSO OWNS A KIA BUT HERS IS A 1995 KIA SEPHIA WHICH SHE BOUGHT NEW.  SHE HAS HAD THE SAME TYPE OF PROBLEMS WITH HER DOOR LOCKS AND EVENTUALLY TOOK THE DOOR PANEL OFF SO SHE COULD GET OUT OF THE CAR AS SHE WAS LOCKED IN.  SHE HAS MADE THE DOOR SO THAT IT WILL NOT LOCK AT ALL BECAUSE SHE WAS AFRAID SHE WOULD GET STUCK IN OR OUT OF THE CAR.  THIS HAPPENED SEVERAL YEARS AGO AND THERE WAS NO DEALERSHIP NEAR WHERE SHE LIVED TO TAKE IT TOO.  SHE STILL HAS THE CAR.  SHE HAS ALSO MET ANOTHER LADY IN REDDING WHO OWNS A KIA SEPHIA (I BELIEVE A 1990'S MODEL) WHO HAS THE SAME PROBLEM.  SHE HAD TO CLIMB OUT OF HER WINDOW TO GET OUT OF THE CAR AT ONE TIME.  I BELIEVE THIS PROBLEM WITH THE LOCK SYSTEM NEEDS TO BE CHECKED AS IT POSES A SAFETY FACTOR IF A CHILD GETS LOCKED IN OR EVEN AN ADULT WHO CAN'T GET OUT THE WINDOW.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2008",
        "dateOfIncident": "12/14/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229696,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS LEAK.  NEEDED TO REPLACE SENDING UNIT, GAS TANK, ETC.  COST OVER $900.  COULD HAVE RESULTED IN FIRE,INJURY, ETC.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/28/2008",
        "dateOfIncident": "01/11/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229162,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN RUSH HOUR TRAFFIC  LAST WEEK AND CAR STARTED TO LOSE POWER AND THE SMELL OF ANTIFREEZE THROUGH THE VENTS. THE CAR WAS NOT SMOKING, THERMOSTAT WAS NOT SHOWING OVERHEATING. I TRIED TO MAKE IT TO THE OFF RAMP LESS THAN 1.5 MILES. DEALER SAYS THAT THE RADIATOR HAS A HOLE IN IT  AND THE  HEAD HAS TO BE REBUILT AND THEY SAY THAT I MUST REPLACE THE TIMING BELT AND PULLEY'S . I WAS TOLD THAT THE CAUSE OF THIS INCIDENT WAS A BAD THERMOSTAT. THE HEAD ASSEMBLY, CYLINDER HEAD, SPARK PLUGS, HOSES WERE DAMAGED BEYOND REPAIR REPLACED. I ALSO HAVE REPLACED THE TIMING BELT, RADIATOR, THERMOSTAT AND AS OF MAY 15 2008 A NEW FAN CLUTCH. THE VEHICLE DOES NOT SHOWS ANY SIGNS OF OVERHEATING  ON ANY GAUGES,  AND DOES NOT SMOKE. YOU CAN ONLY HERE THE SOUND OF BOILING WATER IN THE RADIATOR.  HOW DO YOU DIAGNOSE OVERHEATING PROBLEMS THAT CAN DO OVER $4000 DAMAGE TO A MOTOR WITH 55K MILES AND 5 YEARS OLD . CASE NUMBER --K14040462.  *TR",
        "vin": "KNDJB723425"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "01/18/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215664,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 SPORTAGE AND JUST RECENTLY HAVE BEEN HAVING A VERY BAD SMELL OF GAS WHEN STARTING IT. IT ENTERS THE INSIDE OF CAR WHEN HEATER GETS TURNED AND STAYS STRONG UNTIL CAR HAS WARMED UP. I TOOK IT TO A MECHANIC AND HE FOUND SOME STAINS ON THE METAL PLATE UNDER THE CLAMP BY THE FUEL RETURN HOSE BUT SAID UNLESS I CAN ACTUALLY SEE GAS DRIPPING HE CAN NOT SAY WHAT THE PROBLEM IS AND OF COURSE IT IS A WARMER DAY, NOT AS COLD AS IT WAS THE FIRST DAY IT STARTED. I HAVE RESEARCHED THIS PROBLEM ON LINE AND FOUND THERE IS A RECALL ON THE FUEL RETURN HOSE IN CANADA BUT NOT HERE IN THE US AND THAT THERE ARE QUITE ALOT OF PEOPLE WITH THIS SAME PROBLEM IN THE US. I AM VERY CONCERNED WITH THIS PROBLEM AND FEAR THAT IT MAY CAUSE A FIRE AND NEEDLESS TO SAY THAT WHEN THE SMELL IS INSIDE OF CAR IT STARTS TO MAKE ME  FEEL SICK.  *TR",
        "vin": "KNDJA723625"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/05/2008",
        "dateOfIncident": "01/03/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213790,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE.  VERY STRONG SMELL OF GASOLINE INSIDE CAB OF VEHICLE DURING COLD WEATHER (<32 DEGREES).  EVENTUALLY DISSAPATES WHEN ENGINE WARMS UP.    TOOK TO LOCAL MECHANIC LAST WINTER (2006), COULDN'T LOCATE PROBLEM.  SO WE LIVED WITH IT.  SMELL EVEN STRONGER THIS WINTER.  FOUND THE FOLLOWING SUGGESTED FIX ONLINE (NOT AVAILABLE LAST WINTER).    \"RUBBER RETURN LINE FROM FUEL PSI REGULATOR TO METAL RETURN LINE IS LEAKING WHEN COLD.    \"THE SPRING CLAMPS DO NOT STAY TIGHT WHEN COLD, AND WHEN THE RUBBER (RETURN LINE)  EXPANDS WHEN HOT IT SEALS.    \"REMOVE THE UPPUER PART OF THE INTAKE AND REPLACE THE SPRING CLAMPS WITH SCREW TYPE CLAMPS...\"    SOME ONLINE FORUMS HAVE SUGGESTED THAT DEALERSHIP MAY SAY IT IS A FUEL INJECTOR PROBLEM, $800 FIX.  MY LOCAL MECHANIC SAID THE SAME.  MANY HAVE SAID THAT THE SUGGESTION ABOVE ACTUALLY FIXES THE ISSUE.  I AM CURRENTLY IN BETWEEN THE TWO.  I DON'T HAVE THE INCLINATION TO TRY THIS MYSELF, SO I'M AT THE MERCY OF MECHANICS.    WHAT'S THE DEAL? *CN",
        "vin": "KNDJA723325"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/29/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10210564,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE AIRBAGS FAILED TO DEPLOY IN AN ACCIDENT. CONSUMER STATES THAT THE AIRBAGS DID NOT DEPLOY AND HER SEAT BELT DID NO LOCK CAUSING INJURY TO HER CHEST. MANUFACTURER STATED AIRBAGS DID NOT DEPLOY BECAUSE FORCE WAS NOT SUFFICIENT.  *KB",
        "vin": "KNDJB723125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/16/2007",
        "dateOfIncident": "05/11/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209103,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR OVERHEATED ON HIGHWAY AND STALLED. CALLED 911 FOR HELP. GOT TOWED TO REPAIR SHOP. OUTCOME ENGINE REPLACED.  *TR",
        "vin": "KNDJA723325"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/10/2007",
        "dateOfIncident": "06/22/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205305,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED TAKING MY 2002 KIA SPORTAGE TO THE DEALER AND IT HAD A CLUNKING SOUND IN THE BACK. I TOOK IT IN AND THE TECHNICIAN SAID HE THOUGHT IT WAS THE MUFFLER AND IT WAS LOOSE SO HE KICKED IT WITH HIS FOOT AND SENT ME ON MY WAY.  I GOT A NEW MUFFLER AND IT STILL MADE THE NOISE SO I TOOK IT TO A LOCAL SHOP AND IT WAS THE DIFFERENTIAL FAILURE.  IT ENDED UP COSTING ME OVER 2500.  I HAD TO HAVE A NEW DIFFERENTIAL PUT IN AND IT EVERY ONCE IN AWHILE MAKES A CLUNKING NOISE WHEN YOU PUT THE TRANSMISSION IN GEAR.  IF THE TECH WOULD HAVE MADE THE RIGHT DECISION IT WOULD HAVE BEEN COVERED BY WARRANTY.I HAVE OWNED SEVERAL CARS IN MY LIFE AND NEVER HAD THIS HAPPEN TO ANY OF THEM. I FEEL LIKE THE KIA PEOPLE SHOULD REIMBURSE ME FOR MY TIME AND MONEY!!!  *TR",
        "vin": "KNDJA723025"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/03/2007",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204772,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  WHILE DRIVING 55 MPH, THE ENGINE ROARED.  THE DEALER STATED THAT THE MANIFOLD CRACKED AND REPAIRS WERE MADE.  THE CURRENT MILEAGE WAS 83,846 AND FAILURE MILEAGE WAS 18,000.",
        "vin": "KNDJA723025"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/19/2007",
        "dateOfIncident": "09/10/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203401,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ACTION # EA06-007-FUEL TANK LEAKAGE IN 2002 KIA SPORTAGE.  I TOOK THE CAR TO THE DEALERSHIP FOR SERVICE ON 7/03/07  COMPLAINING OF GAS ODOR.  I WAS CHARGED TO FIX THE ROLL OVER VALVE BECAUSE IT WAS SAID TO BE LEAKING EXTERNALLY.  I TOOK THE CAR BACK TO THE DEALERSHIP WITH THE SAME ODOR COMPLAINT ON 8/8/07.  THEY CLAIMED GAS WAS FOUND ON THE SEAM OF THE TANK.  THEY CLEANED THE TANK SEAM WHERE FUEL WAS GATHERED AND SHAMPOOED MY CARPET TO REMOVE ANY OTHER ODOR FREE OF CHARGE.  MY CAR STILL HAD THE GAS ODOR.  I WITNESSED GAS LEAKING FROM MY CAR ON 9/10/07 AND TOOK IT TO ANOTHER DEALERSHIP.  THEY FOUND THAT THE FUEL TANK WAS LEAKING AND I WAS CHARGED TO HAVE THE FUEL TANK REPLACED.  *TR",
        "vin": "KNDJB723225"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/07/2007",
        "dateOfIncident": "08/06/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198712,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  WHILE DRIVING 65 MPH, THE CONTACT HEARD A LOUD BANG AND THEN THE VEHICLE DECELERATED AND SHUT OFF.  HE NOTICED WHITE SMOKE COMING FROM THE REAR.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE COOLING FAN DISINTEGRATED.  NHTSA RECALL NUMBER 07V161000 (ENGINE AND ENGINE COOLING:COOLING SYSTEM:FAN) WAS FOUND.  THE DEALER STATED THAT THEY WOULD REPLACE THE FAN.  THE CONTACT FELT THAT THE DAMAGED RADIATOR CAUSED BY THE DEFECTIVE FAN SHOULD BE REPAIRED.  THE FAILURE AND CURRENT MILEAGES WERE 31,000.",
        "vin": "KNDJB723X25"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/15/2007",
        "dateOfIncident": "06/09/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196385,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TRAVELED APPROXIMATELY  50 MILES FROM HOME, 96 DEGREES OUTSIDE, AND HEARD LOUD NOISE.  PULLED TO SIDE OF ROAD  AND TURNED VEHICLE OF. -PICKED UP PIECES OF WHAT TURNED OUT TO BE FAN BLADE FROM MIDDLE OF HIGHWAY. AFTER LOOKING INSIDE  THE HOOD DISCOVERED LARGE HOLES IN RADIATOR-SUBSEQUENTLY TOWED VEHICLES FOR REPAIR OF FAN, BLADES,CLUTCH ASSEMBLY AND RADIATOR-VEHICLE STILL NOT OPERABLE. RECEIVED RECALL NOTICE FROM KIA 2 WEEKS LATER. VEHICLE THEN TOWED TO DEALER, WHERE IT HAS BEEN DETERMINED THAT THE HEAD ASSEMBLY BECAME WARPED DUE TO THE RADIATOR BEING DAMAGED BY THE FAULTY FAN. KIA MOTORS CLAIMED CASE  WA S CLOSED, NO RESOLUTION RECEIVED. VEHICLE REMAINED INOPERABLE AT THIS TIME.*AK",
        "vin": "KNDJB723025"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/11/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196928,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL LETTER CONCERNING THE ENGINE COOLING FAN  HOWEVER, THE DEALERSHIP THAT THE VEHICLE WAS PURCHASED FROM IS NO LONGER IN BUSINESS. CONSUMER IS SEEKING ASSISTANCE FOR THIS MATTER . *MC   THE CONSUMER PROVIDED A COPY OF RECALL LETTER PERTAINING TO HIS VEHICLE. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/02/2007",
        "dateOfIncident": "06/23/2007",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195192,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  THE VEHICLE WAS UNDER RECALL REGARDING THE ENGINE FAN.  WHILE DRIVING APPROXIMATELY 45 MPH, THE VEHICLE BURST INTO FLAMES.  THE FIRE BEGAN WHEN THE ENGINE OVERHEATED, WHICH CAUSED THE FAN TO CRACK AND STRIKE THE RADIATOR.  THE HEAT ALSO CAUSED THE HEAD OF THE VALVES TO WARP.  THE FAN WAS PREVIOUSLY REPLACED.  THIS FAILURE HAS OCCURRED TWICE.  THE RECALL NUMBER THAT WAS REFERENCED WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 66,000.",
        "vin": "KNDJB723025"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/28/2007",
        "dateOfIncident": "06/18/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194849,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  THE CONTACT RECEIVED RECALL NOTICE # 07V161000 (ENGINE AND ENGINE COOLING:COOLING SYSTEM:FAN).  THE KIA DEALER IS NOT ACCEPTING ANY NEW APPOINTMENTS UNTIL OCTOBER OF 2007 FOR THE RECALL REPAIR.  THE CONTACT HAS NOT EXPERIENCED ANY FAILURES AT THIS TIME.  THE CURRENT MILEAGE IS 50,000 AND THE FAILURE MILEAGE WAS INAPPLICABLE.",
        "vin": "KNDJA723X25"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/15/2007",
        "dateOfIncident": "05/09/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193424,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CRACKED COOLING FAN MADE THE VEHICLE STOP RUNNING.  *AK",
        "vin": "KNDJB723625"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/14/2007",
        "dateOfIncident": "06/14/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193340,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  THE CONTACT RECEIVED RECALL NOTICE # 07V161000 (ENGINE AND ENGINE COOLING: FANS).  THE LETTER STATED THAT IF THE BELT NEEDS TO BE REPLACED AS PART OF REGULAR MAINTENANCE, THEN THE CONTACT WOULD BE RESPONSIBLE FOR THE REPLACEMENT AND LABOR FEE OF $100 PER HOUR.  PRESENTLY, NO FAILURES HAVE OCCURRED.  THE POWERTRAIN AND FAILURE MILEAGE WERE UNKNOWN.  THE CURRENT MILEAGE IS 71,000.",
        "vin": "KNDJB723125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/13/2007",
        "dateOfIncident": "06/13/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193130,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA SPORTAGE.  THE BLADES ON HIS COOLING FAN BEGAN TO COME OFF, CAUSING THE VEHICLE TO OVERHEAT.  THIS WAS A COUPLE OF YEARS AGO; RECENTLY A SAFETY RECALL (ENGINE AND ENGINE COOLING: COOLING SYSTEM FAN - 07V161000) WAS RECIEVED.  THE MANUFACTURER HAS NOT PROVIDED REIMBURSEMENT. THE CURRENT MILEAGE ON THE VEHICLE IS 93,314.  THE FAILURE MILEAGE WAS UNKNOWN.  THE PURCHASE DATE WAS UNKNOWN.",
        "vin": "KNDJB723625"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/04/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193168,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE CUSTOMER STATES THAT THE FAN WAS BROKEN BEFORE THE RECALL NOTICE WAS SENT. ONE OF THE BLADES WENT THROUGH THE RADIATOR AND SHOULD KIA PAY FOR IT**CC  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/01/2007",
        "dateOfIncident": "05/24/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192258,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE ENGINE COOLING FAN BUSTED INTO PIECES AND ONE OF THE BLADES SHOT THROUGH MY RADIATOR.  I CONTACTED KIA AND THEY RAN MY VIN NUMBER THROUGH THEIR SYSTEMS AND IT IS NOT PART OF THE NHTSA CAMPAIGN 07V161000, EVEN THOUGH IT APPEARS TO BE EXACTLY THE SAME ISSUE.   *TR",
        "vin": "KNDJA723025"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/31/2007",
        "dateOfIncident": "05/28/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192116,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2002 KIA SPORTAGE.  I HEARD A LOUD BOOM AS IT SHIFTED INTO SECOND GEAR.  I PULLED OVER AND LOOKED UNDER THE HOOD.  THE FAN BLADE WAS IN 5 PIECES.  THE PIECES HAD GONE INTO THE RADIATOR AND BROKE THE FAN SHROUD.  STEAM WAS COMING OUT OF THE HOLES IN THE RADIATOR. *TR",
        "vin": "KNDJB723925"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/10/2007",
        "dateOfIncident": "02/20/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187510,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE, IN FEBRUARY  '07 WHILE DRIVING THE RADIO WENT OUT, & WITH THE DASH BOARD LIGHTS FAILING. PULLED  OVER, TURNED CAR OFF. ATTEMPTED V TO RESTART, THE CAR DID NOT START. HAD  CAR TOWED & MANUALLY CHECKED  BATTERY THINKING THAT WAS THE PROBLEM. NEXT DAY  CAR STARTED UP IMMEDIATELY, AND  TAKEN TO DEALERSHIP FOR FURTHER CHECK-UP. THE DEALERSHIP CHARGED ME $248 FOR THE DIAGNOSTIC TEST & THEN  PLACEMENT OF A NEW BATTERY, WHICH WAS SAID TO BE THE CAUSE. WEEKS LATER ON MARCH 31 CAR DID THE SAME WITH THE RADIO AND THE DASHBOARD LIGHTS. THE CAR JERKED ABOUT 30 MILES.  WHEN I WOULD PULL OVER TO THE SIDE OF THE ROAD IT SEEMED TO REGAIN ITS STRENGTH, BUT ONCE I CONTINUED TO DRIVE ,IT STARTED TO JERK AGAIN, WITH THE OIL ODOMETER WENT UP/DOWN! TOOK CAR TO DEALERSHIP, IT JERKED IN THERE. WHEN THE SERVICE WORKERS WENT TO THE CAR, I WAS TOLD, NO PROBLEMS DRIVING THE CAR, & THE DIAGNOSTIC TEST SHOWED NOTHING  WAS WRONG. THE CAR STAYED AT THE DEALERSHIP SATURDAY-THURSDAY, WITH NO PROBLEMS. THE SERVICE MANAGER ASKED IF SHE COULD DRIVE IT HOME.  SHE SAID THE CAR DROVE FINE AND PUT 40 MILES ON CAR. IT WAS FINE ON THURSDAY WHEN I PICKED IT UP. DROVE SATURDAY AND  CAR HAD SAME PROBLEMS. HEADLIGHTS & DASHBOARD LIGHTS WENT OUT. AT 5 AM THIS WAS SCARY & UNSAFE, SOME CARS DIDN'T SEE ME, EVEN WITH THE HAZARDS ON. WITH RADIO OUT &  CAR JERKING ALL THE WAY HOME. ON MONDAY, WENT TO LEAVE AND CAR DID NOT START. TOWED TO KIA FOR THE 3RD TIME IN A MONTH. CAR STARTED, BUT SOME 2001 & 2002 SPORTAGE MODELS  HAD A MAIN ENGINE WIRING TEAR AND \"THE WHOLE HARNESSED HAD TO BE ORDERED .  IT WILL TAKE ABOUT 6 HOURS TO INSTALL .  IT WOULD BE IN ON  WEDNESDAY APRIL  11, 2007.  THIS WAS THE 3RD TIME IN A MONTH THE CAR HAD BEEN IN THE SHOP, I PAID FOR A BATTERY & THE PROBLEM PERSISTED. I IT WAS A COP-OUT FOR THE ACTUAL PROBLEM.  WAS INCONVENIENCED WITHOUT  A CAR & A HARD TIME GETTING  A LOANER. DID NOT  HAVE  A CAR FOR OVER 7 DAYS. I WANT FAIR TREATMENT ON A CAR THAT I' WAS PAYING AMPLE AMOUNT OF MONEY. *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2007",
        "dateOfIncident": "01/09/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178226,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT DETECTED A GASOLINE ODOR ON HER 2002 KIA SPORTAGE, CONTACT STATED THAT LATELY THE ODOR HAS BEEN STRONGER POSSIBLY DUE TO THE COLD WEATHER.  WHEN THE HEATER  WASTURNED ON ODOR GETS STRONGER IN THE PASSENGER COMPARTMENT.  THE CONTACT HAS NOT TAKEN THE VEHICLE TO A REPAIR FACILITY TO HAVE  THE ODOR DIAGNOSED.  *AK",
        "vin": "KNDJA723X25"
    },
    {
        "components": "ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/09/2007",
        "dateOfIncident": "09/25/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178244,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY KIA SPORTAGE IN 09/19/2006 BY 9/25/2006 I STARTED TO HEAR SQUEALING NOISES IN FRONT OF THE ENGINE AND WHEN I FIRST STARTED IT I WOULD PRESS THE GAS BUT THE CAR WOULD DIE.   I BROUGHT IT TO THE DEALERSHIP ABOUT 5 TIMES WHEN THEY FINALLY FIXED IT.  THEN I  FOUND OUT 3 WEEKS LATER IN THE RAIN THAT WATER WAS COMING IN THE TOP LEFT CORNER OF THE WINDSHIELD. IN 1/04/07 I WAD HEADED TO WORK AND THE CAR JUST SUDDENLY DIE AGAIN SO THE DEALERSHIP TOWED IT BACK.  *JB",
        "vin": "KNDJA723525"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/02/2007",
        "dateOfIncident": "12/30/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177570,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH DRIVER & PASSENGER-SIDE REAR SEAT BELT ASSEMBLIES ARE DEFECTIVE.  PASSENGER-SIDE SEAT BELT HAS BEEN INOPERABLE SINCE SHORTLY AFTER I BOUGHT IT IN 2005.  DRIVER-SIDE SEAT BELT HAS HAD SPORADIC PROBLEMS IN THE LAST SIX MONTHS & WITHIN THE LAST WEEK HAS BEEN INOPERABLE.   *JB",
        "vin": "KNDJA723925"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/17/2006",
        "dateOfIncident": "02/14/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173755,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE TRAVELING 35 MPH UPHILL ON ICY ROAD CONDITIONS WITH THE 4WD ENGAGED, THE VEHICLE BEGAN TO SLIDE.  THE VEHICLE WAS TAKEN TO THE DEALER, WHO DETERMINED THAT THE BRAKE BOOSTER CABLE, VACUUM HOSE, WHEEL BEARINGS HAD FAILED.  EACH COMPONENT WAS REPLACED ON SEPARATE OCCASIONS.  THE 4WD WAS REPLACED 3 TIMES, BUT THE PROBLEM PERSISTED.  THE SERVICE DEALER EXPRESSED TO THE CONTACT THAT THERE WERE MANY VEHICLES OF THE SAME MAKE AND MODEL WITH 4WD PROBLEMS.*AK",
        "vin": "KNDJA723425"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2006",
        "dateOfIncident": "11/02/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172544,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS, AN ODOR OF FUEL WAS NOTICED.  THE VEHICLE WAS DRIVEN TO AN INDEPENDENT REPAIR SHOP WHO REPLACED THE HOSE ATTACHED TO THE INTAKE MANIFOLD.  THE DEALER WAS ALERTED.",
        "vin": "KNDJB723525"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2006",
        "dateOfIncident": "10/26/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171911,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHEN THE TEMPERATURE WAS BELOW 40 DEGREES; THERE WAS AN ODOR OF GASOLINE.  PRIOR TO THE CONTACT'S PURCHASE, THE FUEL INJECTOR PORTS AND RINGS WERE REPLACED.  THE VEHICLE HAD NOT BEEN INSPECTED BY A MECHANIC.    UPDATED 12/28/2006 - THE VEHICLE HAS BEEN INSPECTED BY A MECHANIC ON SEVERAL OCCASIONS BUT THE FUEL ODOR IS STILL PRESENT.  THE PREVIOUS OWNER INFORMED THE CONSUMER THAT THIS HAD BEEN ON ONGOING PROBLEM WHEN HE OWNED THE VEHICLE.  *NM",
        "vin": "KNDJA723625"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/08/2006",
        "dateOfIncident": "10/08/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170222,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE 35K MI. NOTICED DIFFERENT ENGINE SOUND, FOUND THAT LARGE CRACKS HAD FORMED BETWEEN EACH FAN BLADE, MAIN BLADE DRIVEN BY ENGINE. CHECKED INTERNET FOUND THAT OTHERS HAD SIMILAR PROBLEMS INCLUDING BREAKING AND RADIATOR DESTRUCTION. PLAN TO GET FAN FROM DEAL AND INSTALL ALSO ASK ABOUT KIA PARTS BULLETIN 1500-0002 WHICH CONCERNS THIS FAN BLADE.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/28/2006",
        "dateOfIncident": "08/13/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166685,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN CHECKING OIL LEVEL ON AUGUST 13,2006, I NOTICED CRACKS BETWEEN EACH BLADE ON THE ENGINE COOLING FAN.  UPON FURTHER INSPECTION THE CRACKS WERE FOUND TO GO FROM FRONT TO BACK ON 6 BLADES. I REMOVED THE FAN, TOOK IT TO THE DEALERSHIP, AND ASKED IF THERE WAS A BULLETIN. I WAS TOLD NO.  BOUGHT NEW FAN AND INSTALLED MYSELF.  *JB",
        "vin": "KNDJB723225"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/12/2006",
        "dateOfIncident": "08/12/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165314,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FAN BLADE CRACKED IN SEVERAL PLACES.   *JB",
        "vin": "KNDJA723325"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2006",
        "dateOfIncident": "08/04/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164928,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE ACCELERATING THROUGH THE INTERSECTION FROM A STOP SIGN AT 5 MPH, A LOUD THUD WAS HEARD AND THE VEHICLE JERKED FORWARD. THE VEHICLE WAS DRIVEN HOME THE REMAINING TWO MILES WITH THE HAZARD LIGHTS ILLUMINATED. UPON INSPECTION OF THE ENGINE, THE FAN BLADES WERE SCATTERED ACROSS THE ENGINE COMPARTMENT, AND SOME WERE CAUGHT IN THE WIRING. THE VEHICLE WAS TOWED TO A SERVICE DEALER WHERE THE FAN WAS REPLACED AND THE DAMAGED WIRING TO THE AIR CONDITIONING WAS REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED.",
        "vin": "KNDJB723125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/07/2006",
        "dateOfIncident": "08/03/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164692,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE RADIATOR FAN FRACTURED TO PIECES WHILE TRAVELING 20 MPH.  A NOISE WAS HEARD PRIOR TO THE INCIDENT.  THE VEHICLE WAS PULLED OVER AND INSPECTED.  4 FAN BLADES WERE FRACTURED AND ONE OF THE BLADES HAD FLOWN INTO THE RADIATOR.  THE MANUFACTURER WAS ALERTED OF THE INCIDENT ON 08/07/06.",
        "vin": "KNDJB723925"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/22/2006",
        "dateOfIncident": "09/07/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160474,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:   THE CONTACT STATED WHILE DRIVING FROM 5 TO 65 MPH ON A NORMAL ROAD CONDITIONS, ALL DASH LIGHTS DIMED COMPLETELY.  THE HORN WAS ALSO AFFECTED BY THE ELECTRICAL FAILURE.  THE ENGINE STARTED TO SHAKE UP AND THE STEERING BECAME DIFFICULT UNTIL THE VEHICLE COMPLETELY STALLED.  THERE WAS ALSO A PROBLEM WITH THE AUTOMATIC TRANSMISSION.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP WHO WAS APPREHENSIVE TO ACCEPT THE VEHICLE FOR REPAIRS. BASED ON THE POWER TRAIN WARRANTY, THE VEHICLE WAS ACCEPTED FOR INSPECTION.",
        "vin": "KNDJA723225"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/17/2006",
        "dateOfIncident": "06/16/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160088,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN SEPTEMBER 04, MY 2002 KIA SPORTAGE CHECK ENGINE LIGHT ILLUMINATED.  REPLACEMENT PARTS FOR COIL ASSEMBLY WAS INSTALLED.  TWO WEEKS LATER SAME PROBLEMS.   THE CAR WOULD SHAKE VIOLENTLY AND STALL SHORTLY AFTER ACCELERATION.  STILL CONTINUE TO GET CHECK ENGINE LIGHT,  (MISFIRES) I AM NOW HAVING TROUBLE WITH POWER OF ENGINE, TRANSMISSION NOT ENGAGING AFTER SHIFTING. AFTER ACCELERATION CAR SHAKES AND STALLS,  WON'T RESTART FOR QUITE SOME TIME.    *JB",
        "vin": "KNDJA723225"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/15/2006",
        "dateOfIncident": "06/15/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159921,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 60MPH A SCRAPPING NOISE CAME FROM UNDER THE HOOD.  THE CONTACT DISCOVERED THE RADIATOR FAN WAS SCRAPPING AGAINST THE FAN CASING.  THERE WAS A STRESS FRACTURE IN THE CENTER OF THE FAN BLADES.  THE VEHICLE WAS NOT INSPECTED BY THE DEALERSHIP.",
        "vin": "KNDJB723225"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/24/2006",
        "dateOfIncident": "08/25/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151091,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES NEED REPLACING TWICE IN UNDER 18000 MILES. WIVES CAR NEED WHOLE BRAKE SYSTEM FROM MASTER CYLINDER ON DOWN UNDER40,00 MILES.  *NM",
        "vin": "KNDJA723X25"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/30/2006",
        "dateOfIncident": "12/15/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149080,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "IMPORTED AUTO PARTS CO.",
                "productMake": "IMPORT PRODUCTS CO.,INC.",
                "productModel": "IMPORT PRODUCTS CO.,INC.",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "ON DEC. 15, 2005, I CONTACTED THE DEALER WHERE I PURCHASED MY 2002 KIA SPORTAGE A MONTH AGO FOR WARRANTEE SERVICE (EMPIRE TOYOTA, ONEONTA NY). I WAS TOLD THAT THEY NO LONGER SELL OR SERVICE UNDER THE KIA WARRANTEE. AT THAT TIME IT HAD 58,000 MILES. NEW DEALER: COUNTRY CLUB  KIA, ONEONTA, NY. ON JANUARY 12,  2006 I CALLED THEM TO HAVE THE WARRANTEE SERVICE DONE ON MY CAR. THEY ARE STILL SETTING UP THE SERVICE DEPT. AND ARE WAITING FOR \"EMPIRE TOYOTA\" TO TRANSFER THE RECORDS OF CUSTOMERS FOR WARRANTEE REPAIRS. NOW THE MILEAGE IS AT 61,000 MILES, AND IT STILL HAS NOT BEEN SERVICED UNDER THE WARRANTEE. THE PROBLEMS I AM HAVING: MY LOCKS KEEP GOING UP AND DOWN ALL DAY AND NIGHT WITHOUT ANY KEYS IN THE IGNITION. TODAY MY CHILDREN AND I GOT LOCKED INSIDE THE CAR AND COULD NOT GET OUT AS THE LOCKS WOULD NOT STOP LOCKING, AND THE HORN BEGAN GOING OFF.  THIS HAS CONTINUED EVERYDAY...ALL DAY AND ALL NIGHT. WE HAVE BEEN LOCKED OUT OF MY CAR EARLY IN THE MORNING WHILE MY CAR IS WARMING UP TO LEAVE FOR WORK.  I REALLY NEED TO GET MY CAR REPAIRED, AND FEEL AS IF I KEEP GETTING THE RUN AROUND. I CALLED THE KIA OFFICE ON MONDAY JANUARY 16, 2006 AND WAS TOLD THAT MY WARRANTEE HAS EXPIRED BY 800 MILES. THIS ISSUE COULD HAVE BEEN TAKE CARE OF BEFORE THE WARRANTEE EXPIRED. WHEN KIA CHANGED DEALERSHIPS CUSTOMERS SHOULD HAVE BEEN NOTIFIED, SO THAT THEY CAN FAMILIARIZE THEMSELVES WITH THE NEW DEALER IF ANY PROBLEMS SHOULD ARISE. I HAD LOCKS REPARED IN MY 2002 KIA SPORTAGE A YEAR AND A HALF AGO, AND THUS THIS SHOULD STILL BE COVERED UNDER THE WARRANTEE. I CONTACTED KIA CONSUMER ASSISTANCE CENTER VIA E-MAIL ON 1/19/06, AND WAS GIVEN CASE ID IS: K1063733. NO RETURN E-MAIL OR CALL FROM KIA. I CONTACTED KIA CONSUMER ASSISTANCE CENTER VIA E-MAIL ON 1/30/06, AND WAS GIVEN CASE ID IS: K1067545. NO FOLLOW UP CALLS FROM KIA YET. NO RETURN E-MAIL OR CALL FROM KIA.I FEEL THIS PROBLEM CAN BE A POTENTIAL DANGEROUS SITUATION AS IN CASE OF AN EMERGENCY MY FAMILY AND I NEED TO BE ABLE TO EXIT THE VEHICLE.",
        "vin": "KNDJA723125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2006",
        "dateOfIncident": "01/09/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148402,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE CHECK ENGINE LIGHT INTERMITTENTLY ILLUMINATES.  THE VEHICLE WAS TAKEN TO THE LOCAL DEALERSHIP SEVERAL TIMES TO HAVE THE CHECK ENGINE MODULE RESET.  THIS REMEDY WORKED FOR SEVERAL MONTHS BUT THE LIGHT EVENTUALLY ILLUMINATES AGAIN.  THE LOCAL DEALER HAS NOT DETERMINED THE PROBLEM WITH THE LIGHT.  ALSO, THE GAS TANK HAD A LEAK IN THE GAS LINE.  THE VEHICLE WAS TOWED TO THE LOCAL DEALERSHIP WHERE THEY REPLACED THE GAS LINE, HOWEVER A GAS ODOR STILL EXIST INSIDE THE VEHICLE.    UPDATED 2/28/2006 - *NM",
        "vin": "KNDJA723025"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/19/2006",
        "dateOfIncident": "12/14/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148709,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE PISTON SEIZED DAMAGING BRAKE PADS AND ROTORS.  *TS  *JB",
        "vin": "KNDJB623925"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/31/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141275,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED THE REAR END OF HER VEHICLE WAS UNCONTROLLABLE AT TIMES.  THIS HAPPENED FOR ONLY A FEW SECONDS.  IT FELT  AS THOUGH THE VEHICLE  HIT A PATCH OF ICE.  THE VEHICLE HAS BEEN TO THE DEALERSHIP, BUT THEY HAVE BEEN UNABLE TO DIAGNOSE  THE CAUSE OF THE  PROBLEM.  THIS HAPPENED AT DIFFERENT SPEEDS.  *AK",
        "vin": "KNDJB723X25"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/07/2005",
        "dateOfIncident": "09/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138989,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED THAT WHILE DRIVING AT 40  VEHICLE WA SINVOLVED IN A COLLISION AND  AIR BAGS DID NOT DEPLOY. SOMEONE PULLED OUT IN FRONT OF THE CONTACT'S VEHICLE AND SIT  HIT THE OTHER VEHICLE. THERE WERE NOT LIGHTS ON THE DASHBOARD TO INDICATE THE AIR BAGS WOULD NOT DEPLOY. DEALER DID NOT SAY ANYTHING ABOUT THE AIR BAGS TO HER. MANUFACTURER HAS NOT BEEN CONTACTED YET. POLICE CAME AND  A REPORT WAS TAKEN.  *AK",
        "vin": "KNDJB723925"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/18/2005",
        "dateOfIncident": "07/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136857,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 KIA SPORTAGE 2 DOOR.  WE BOUGHT IT BRAND NEW FOR OUR SON THINKING IT WOULD BE A FUN LITTLE CAR FOR HIM.  36,000 MILES LATER IT HAS BEEN IN THE SHOP 15 TIMES FOR VARIOUS THINGS SUCH AS AIR BAG NEEDING REPAIRED TO ENGINE COOLING SYSTEM EXPLODING ON ME IN THE MIDDLE OF THE DESSERT AND ME ALONE FOR 6 HOURS BEFORE I COULD GET HELP.  THIS SUV IF YOU CAN CALL IT THAT IS NOTHING BUT A HEADACHE AND I AM VERY CONCERNED ABOUT MY SONS OR IN FACT ANYONE THAT IS IN IT WHEN IT IS ON THE ROADS SAFETY.    *NM",
        "vin": "KNDJB623925"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2005",
        "dateOfIncident": "12/29/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136167,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CALLER SAID H TRANSMISSION SHIFTS GEARS WITHOUT WARNING. IT JERKED AND SHOOK WHEN SHIFTING GEARS. IT HAPPENED WHEN  DECELERATING.  BROUGHT VEHICLE  DEALER  5 TIMES, BUT THEY COULD NOT  FIND WHATS WRONG WITH IT. THE CHECK ENGINE LIGHT WAS ON ALL THE TIME EXCEPT WHEN HE TOOK  IT TO THE DEALER. THE LAST TIME HE HAD IT TO DEALER THE LIGHT WENT OFF FOR ABOUT 3 WEEKS, AND YESTERDAY THE LIGHT WAS BACK ON. DEALER SAID THEY WILL TRY TO GET SOMEONE FROM THE MANUFACTURER TO LOOK AT THE VEHICLE, BUT NO ONE HAS COME YET. DEALER DID A DIAGNOSTIC,  AND FIXED WHAT IT SHOWED, BUT THE LIGHT ON THE DASHBOARD  CAME BACK ON AFTER 30 MILES OF DRIVING. *AK",
        "vin": "KNDJB723X25"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/20/2005",
        "dateOfIncident": "03/30/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10129505,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MARCH 30TH I WAS INVOLVED IN AN ACCIDENT, A LADY PULLED ACCROSS TRAFFIC AND I HAD NO TIME TO STOP, NEEDLESS TO SAY I SLAMMED INTO HER DRIVERS SIDE DOOR AT ABOUT 30MPH. THE ENTIRE FRONT END OF MY KIA SPRORTAGE WAS DAMAGED WITH ABOUT $6700 IN DAMAGES AND THE AIR BAGS DIDN'T DEPLOY AND MYSELF AND MY PASSENGERS WERE IN OUR SEAT BELTS BUT BADLY BRUISED AND THROWN ABOUT. I WAS INFORMED BY KIA THAT I DIDN'T HIT THE SENSORS ... OK THE WHOLE FRONT END WAS GONE WHERE EXACTLY ARE THE SENSORS? I DON'T FEEL SAFE IN THE CAR AND MY CHILDREN ARE IN IT , PLEASE CAN SOME ONE TELL ME WHAT TO DO? I FEEL THAT I'M STUCK WITH A VEHICHLE THAT ISN'T SAFE AND I DON'T SEEM TO HAVE ANY RECOURSE. THANK YOU FOR YOUR TIME.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "04/03/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126936,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT SHIELD BROKE AWAY, MUFFLER AFFECTED AND NEEDS REPLACEMENT DUE TO HEAT SHIELD.  MY MOM CONTACTED THE KIA DEALERSHIP IN RENO, NV REGARDING THE ISSUE.  THE PERSON SHE SPOKE WITH STATED MY CAR WAS UNDER WARRANTY, BUT SINCE (WHILE I WAS TRAVELING AND IN CA AND THE RATTLE GOT SO BAD I HAD A LICENSED MECHANIC WIRE IT TOGETHER) HE SAYS IT IS NOW NOT COVERED UNDER WARRANTY.  MY MOM ASKED THE GUY AT THE DEALERSHIP WHO SHE SHOULD CONTACT, SUCH AS, KIA MOTOR AMERICA, AS A POSSIBLE ASSEMBLY LINE ISSUE.  HE STATED TO HER (AND SHE HAS A COMPLAINT FOR FILED OUT AS WELL THROUGH NHTSA TODAY) \"THE DEALERSHIP.\"  MY CONCERN IS A SAFETY ISSUE AND CONCERNS OVER A \"DEALERSHIP\" TURNING IN SAFETY ISSUES TO THE PROPER AUTHORITY, LET ALONE MY CAR SHOULD HAVE BEEN FIXED REGARDLESS OF WHO TOUCHED IT AS I WAS TRAVELING OUT OF STATE.  THE MUFFLER HAD TO BE WIRED OR IT WOULD HAVE FALLEN OFF DUE TO THE HEAT SHIELD BREAKING AWAY AND DAMAGING THE MUFFLER SYSTEM.  I HAVE A YOUNG CHILD AND HER SAFETY COMES FIRST!",
        "vin": "KNDJA723325"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2005",
        "dateOfIncident": "05/13/2005",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10124892,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: PROBLEM OCCURED WHEN SMOKE COMING FROM UNDER THE DASH. FLAMES SHOT OUT FROM UNDER DASH. NO WARNING PRIOR. A BURNING SMELL WAS COMING FROM VEHICLE PRIOR TO FLAMES. IT WAS AN ELECTRICAL FIRE. THE DEALER REPORTS IT MAY BE A PROBLEM WITH THE IGNITION SWITCH. THE CAR WAS PULLED, A PERSON HELPED BY TRYING TO PUT OUT FIRE WITH A SMALL FIRE EXTINGUISHER, THEN OWNER WENT INSIDE A BUILDING AND GOT ANTOHER FIRE EXTINGUISHER. THE FIRE WAS OUT BY THE TIME THE FIRE DEPT. ARRIVED. THE BATTERY WAS DISCONNECTED. FIRE DEPARTMENT REPORTED THAT IT WAS AN ELECTRICAL FIRE FROM AN UNKOWN SOURCE. DRIVER EXPERIENCED SMOKE INHALATION BUT WOULDNT GO TO HOSPITAL. AND WAS BURNED ON FINGERS TRYING TO PUT IT OUT.",
        "vin": "KNADC123626"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/09/2005",
        "dateOfIncident": "05/06/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120256,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I OWN A 2002 KIA SPORTAGE. THIS VEHICLE WAS PURCHASED NEW. I HAVE HAD NUMEROUS PROBLEMS WITH THIS VEHICLE, TOO NUMEROUS TO LIST. YOU ARE WELCOMED AND ENCOURAGED TO CONTACT WILLIAMSBURG CRYSLER JEEP KIA FOR ALL OF THE VEHICLES INFORMATION. THE PROBLEMS WITH THIS VEHICLE STARTED WITHIN A WEEK OF PURCHASE AND CONTINUE TO TODAY. AT THIS WRITING THIS VEHICLE IS CURRENTLY IN THE SHOP HAVING TO HAVE BEEN TOWED IN ON FRIDAY 05/06/ 05. I JUST GOT THE VEHICLE BACK ON TUEDAY 05/02/05. I HAVE APPROXIMATELY 10 PAGES ON THE DATES AND THE WORK THAT HAS BEEN DONE SINCE THE VEHICLE WAS PURCHASED. I HAVE BEEN IN TOUCH WITH THE COMPLAINT DEPARTMENT WITH KIA AND I WAS TOLD NOTHING COULD BE DONE TO HELP ME BUT TO CONTINUE TO SEND IT TO THE DEALERSHIP TO HAVE IT FIXED. MY WARRANTY EXPIRES ON THIS VEHICLE IN APPROXIMATELY 6000 MORE MILES. WITH THE AMOUNT OF PROBLEMS THAT I AM CURRENTLY HAVING AND THE PROBLEMS IN THE PAST I AM WORRIED WHAT WILL HAPPEN WHEN THE WARRANTY EXPIRES. THANK YOU FOR YOUR TIME IN THIS MATTER. PLEASE FEEL FREE TO CONTACT THE DEALERSHIP AND/OR ME.",
        "vin": "KNDJB723525"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "05/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ST: 8TH OF 2004 THE BATTERY STARTED TO DIE,\\.  DEALER TOLD CALLER TO SHUT THE ALARM SYSTEM OFF WHEN NOT DRIVING. VEHICLE BATTERY WAS CHECKED BY KIA, AND REPORTED NO PROBLEMS WITH BATTERY.  HOWEVER,   BATTERY  HAD TO BE CHARGED NUMEROUS TIMES IN DRIVEWAY.  ON MAY 2005 THE LOCKS BEGAN TO GO ON AND OFF, AND ALL LIGHTS CAME ON THE DASH. TOOK THE CAR TO DEALER, WHO CHECKED THE BATTERY, BUT DEALER REPORTED THE CAR NEEDED A NEW BATTERY. 05/05/05 AS CONTACT WAS DRIVING ON A MAIN ROAD AND ALL SENSOR LIGHTS CAME ON, AND LOCKS CAME ON AND OFF, AND CAR SHUT OFF. AFTER RESTARTING VEHICLE WAS TAKEN TO DEALER AGAIN FOR REPAIR.*AK",
        "vin": "KNAGD128225"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "03/18/2005",
        "dateOfIncident": "03/17/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115389,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "30 SECONDS AFTER  CONSUMER PARKED AND EXITED THE VEHICLE IT ROLLED APPROXIMATELY 10 FEET AND COLLIDED WITH ANOTHER VEHICLE WHILE IT WAS REVERSING. THE CAUSE OF THE FAILURE HAS YET TO BE DETERMINED.  *AK",
        "vin": "KNDJB623325"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/12/2005",
        "dateOfIncident": "03/11/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113974,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE 4WD HAS A VACUUM-HUB SYSTEM,THIS HAS A HISTORY OF FAILURE,AS I HAVE BEEN RESEARCHING ON THE INTERNET.  HOWEVER THERE IS NO WAY OF KNOWING THAT THE 4WD IS NOT ENGAGED,THE INDICATOR ON THE DASHBOARD LIGHTS WHETHER ON NOT THE 4WD IS WORKING.  THIS COULD CAUSE A VERY SERIOUS PROBLEM FOR SOMEONE,THINKING THEY ARE IN 4WD 7 DRIVING ALONG AT 55MPH,ONLY TO HAVE THE CAR START SPINNING ALLOVER THE ROAD.  WE LIVE IN RURAL UPSTATE NY AND WHILE RETURNING HOME LAST NIGHT,THIS HAPPENED,WE WOULD UP FACING THE WRONG WAY ON A STEEP DARK HILL,MY HUSBAND IS UNABLE TO WALK LONG DISTANCES DUE TO BACK & KNEE PROBLEMS & WE HAD TO WAIT OVER 2 HOURS FOR A TOWTRUCK.  THIS OCCURED 2 YEARS AGO & THEY REPAIRED IT  HOWEVR I JUST LEARNED THAT THIS IS A COMMON ONGOING PROBLEM IN THESE VEHICLES,  THE SOLUTION WOULD BE TO INSTALL MANUAL HUBS,HOWEVER KIA DOES NOT OFFER THIS TO ITS CONSUMERS.  *AK",
        "vin": "KNDJA723925"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2005",
        "dateOfIncident": "12/02/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105069,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS ENGINE SEIZED,  AND THEN VEHICLE STALLED. CONSUMER MANAGED TO PULL OVER. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK  WHEN THIS CONDITION OCCURRED, CONSUMER WAS ABLE TO RESTART VEHICLE.  DEALERSHIP COULD NOT FIND PROBLEM WITH VEHICLE.    *TT",
        "vin": "KNDJB723325"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2005",
        "dateOfIncident": "12/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106489,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE, GASOLINE ODOR/LEAK, BEEN SEEN  BY DEALERS,  WENT TO PRIVATE GARAGE AND HAD DIFFERENT DEALER  LOOK AT IT TOO.  TODAY, 1/17/2004  GAS ODOR VERY BAD.  CANNOT SEEM TO GET IT CORRECTED, SCARED I AM GOING TO DIE IN A FIRE...   *JB",
        "vin": "KNDJA723325"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/14/2005",
        "dateOfIncident": "11/03/2004",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103235,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAUGHT ON FIRE WITHIN THE ENGINE COMPARTMENT ON THREE SEPARATE OCCASIONS WHILE DRIVING 45  MPH OR MORE. CONSUMER EXTINGUISHED THE FIRES. AFTER THE LAST INCIDENT  VEHICLE WAS TAKEN TO THE DEALER, WHO INFORMED  CONSUMER THAT THE CAUSE WAS DUE TO OIL DRIPPING ONTO THE MANIFOLD. MANUFACTURER WAS ALSO NOTIFIED.*AK",
        "vin": "KNDJA723225"
    },
    {
        "components": "FUEL SYSTEM, OTHER,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/26/2004",
        "dateOfIncident": "12/22/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104518,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 KIA SPORTAGE. #1) THE AUTO STARTED TO HAVE A GAS ORDER FOR SEVERAL WEEKS, THEN GAS STARTED TO LEAK FROM THE CAR ONTO THE GROUND. THE CAR IS JUST 3 YEARS OLD WITH A REASONABLE 72,000 MILES. I DO NOT BELIEVE THIS IS NORMAL WEAR AND TEAR ON THE CAR. I WAS TOLD IF THIS CONTINUED, THE CAR WOULD CATCH FIRE. I WAS TOLD THE INTERNAL SEALS WERE LEAKING AND THEY NEEDED TO BE REPLACED AND THIS WAS A SERIOUS PROBLEM AND THE CAR SHOULD NOT BE DRIVEN. #2) THE HUBS ON THIS CAR ALSO NEED TO BE REPLACED. THE WAY THE CAR WAS DESIGEND - I WAS TOLD. WATER OVER THE PAST 3 YEARS HAVE GOTTEN IN THE CAR WHEELS AND HAVE DAMAGED THE HUBS AND THE 4WD WILL NOT WORK PROPERLY. THIS WOULD BE A DESIGN FLAW AND NOT WEAR AND TEAR ON THE CAR.*AK",
        "vin": "KNDJA723325"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/30/2004",
        "dateOfIncident": "10/27/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097870,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LEFT FRONT ROTORS  WERE DEFECTIVE. THIS WAS DISCOVERED DURING VEHICLE INSPECTION.  THE VEHICLE WAS SERVICED AT LEAST TWENTY TIMES FOR OTHER DEFECTS.  NO SERVICE FOR THE BRAKES.   *AK   THERE WAS A SHORT IN THE WIRING IN THE SHOCK ARMS, A PROBLEM WITH THE CATALYTIC CONVERTER, RATTLING IN THE EXHAUST SYSTEM, LICENSE PLATE LIGHTS WERE INOPERATIVE DUE TO ROTTED SOCKETS, WHEEL BEARINGS WERE EXTREMELY LOOSE, PULLING TO THE RIGHT, THE RIGHT REAR POWER WINDOW WAS INOPERATIVE, CHECK ENGINE LIGHT HAD COME ON POSSIBLY DUE TO A SMALL LEAK OR A LOOSE GAS CAP, TRANSMISSION HANG UP WHEN COLD, BAD FRONT BRAKES, CRACK IN DASH, CUP HOLDER WAS BROKEN, TAILPIPE RUSTED AND FELL OFF, WHEN THE HEATER AND DEFROST WAS ON THE A/C WOULD COME ON, THE CONSUMER WOULD GET SHOCK WHEN EXITING THE VEHICLE, INTERMITTENTLY BOTH REAR WINDOW WOULD NOT GO UP OR DOWN, AND THE LEFT REAR WINDOW WAS TOTALLY INOPERATIVE.  (THERE WAS NO POWER WHEN GOING UP HILL)   *SC   *JB",
        "vin": "KNDJA723125"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/08/2004",
        "dateOfIncident": "10/21/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099567,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER STARTING THE VEHICLE OR WHILE DRIVING THE VEHICLE, AT VARIOUS SPEED OF 40 MPH CONSUMER SMELLED FUEL ODOR. VEHICLE TAKEN TO THE DEALER, AND THEY INFORMED THE CONSUMER THAT IT WAS A FUEL LINE. CONSUMER DID NOT KNOW WHERE THE FUEL LINE WENT OR WHAT KIND OF FUEL LINE IT MAYBE.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/12/2004",
        "dateOfIncident": "09/04/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091447,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ROLLING UP THE FRONT DRIVER SIDE POWER WINDOW, THE WINDOW FELL BACK DOWN WITH GREAT FORCE WITHOUT WARNING. AS A RESULT THE  WINDOW WAS INOPERATIVE.   *JB   *SC",
        "vin": "KNDJB723325"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/30/2004",
        "dateOfIncident": "08/17/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094744,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS WERE REPLACED FOUR TIMES DUE TO WARPING.   CONSUMER HAS TO HAVE THEM REPLACED EVERY THREE MONTHS.  *AK",
        "vin": "KNDJA723825"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2004",
        "dateOfIncident": "08/03/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087572,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THREE BLADES OF THE FAN BROKE OFF AND FLEW INTO THE RADIATOR.   VEHICLE WAS TOWED TO THE DEALER, AND THERE WAS NO REASON WHY THIS HAPPENED.*AK  THE DEALER HAD TO REPLACE THE FAN, RADIATOR AND FAN SHROUDS.  *NM",
        "vin": "KNDJB723425"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2004",
        "dateOfIncident": "09/06/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090666,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 KIA SPORTAGE 4X4. PURCHASED IN APRIL 2004 WITH 3 YEARS & 50K MILES REMAINING ON WARRANTY.  I TRAILERED MY BOAT TO THE LAKE AND AFTER LEAVING THE LAKE THE CAR DIED.  TOWED TO AN AUTHORIZED KIA DEALER,DICK HANNAH KIA, VANCOUVER,WA.98665  $161 TOW BILL!  DIAGNOSIS WAS WATER IN THE GAS TANK!! TURNS OUT THERE IS A EVAPORATOR CHARCOAL CANISTER MOUNTED UNDER THE VEHICLE NEAR THE REAR BUMPER WHICH ALLOWED WATER INTO THE GAS SYSTEM. I AM NOW FACED WITH OVER $600 REPAIR FOR DRAINING THE TANK.   MY CONTENTION IS THAT THIS IS A BAD DESIGN. NOWHERE IN THE OPERATORS MANUAL DOES IT STATE TO AVOID TRAILERING A BOAT BECAUSE IT MAY SUCK UP THE LAKE WATER! THIS SUV CAME WITH A TRAILER HITCH WHEN PURCHASED AND KIA NEEDS TO STEP UP AND COVER THIS DESIGN DEFECT UNDER WARRANTY.*AK",
        "vin": "KNDJA723925"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/31/2004",
        "dateOfIncident": "08/23/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090141,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE FAILED AT 20, 000 MILES FOLLOWING A NAIL IN THE TREAD.  RADIAL 798  TREAD SEPARATION, TIRE HAD A HUGE BULGE IN MIDDLE.*AK",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/22/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10088370,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A STRAIGHT STRETCH OF HIGHWAY MY DAUGHTER FELT HER CAR JERK TO THE RIGHT.  SHE ATTEMPTED TO TURN INTO THE JERK AND WAS NOT ABLE TO CONTROL ANYTHING ON THE CAR.  IT BEGAN TO ROCK DESPITE HER EFFORTS AND THEN IMMEDIATELY ROLLED OVER MULTIPLE TIMES.  THE FRONT END OF HER KIA SPORTAGE SUSTAINED CONSIDERABLE DAMAGE, THE AIRBAGS DID NOT DEPLOY AND SHE SUFFERED ALMOST COMPLETE LOSS OF USE OF HER LEFT ARM.  SHE IS STILL UNDERGOING TREATMENT AND THERAPY FOR THE INJURY AND ALSO WILL PROBABLY HAVE TO HAVE FURTHER SURGERY.  THERE WERE WITNESSES BEHIND HER THAT REPORTED THAT THE CAR WAS GOING STRAIGHT, DID NOT RUN OFF THE ROAD JUST BEGAN TO FLIP.  SHE DID NOT LOSE CONSCIENCE, DID NOT LOOK AWAY FROM THE ROAD.  ALSO THE DRIVING CONDITIONS WERE NORMAL AND SHE WAS GOING 5 MILES UNDER THE SPEED LIMIT.  WE REQUESTED THAT THE INSURANCE COMPANY INVESTIGATE BUT THEY STATED THEY DO NOT DO INVESTIGATIONS.  WE REALLY BELIEVE THAT THERE WAS A STEERING MALFUNCTION AS WELL AS FAILURE ON THE AIRBAGS.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/10/2004",
        "dateOfIncident": "08/07/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087624,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE  DEVELOPED A SQUEAK IN  FRONT BRAKES.   VEHICLE WAS TAKEN TO THE DEALER, AND THEY PUSHED BACK THE CALIPER PISTON. HOWEVER, PROBLEM  RECURRED.  LATER, DEALER STATED  THAT THERE WAS NOTHING ELSE FOUND.*AK ROTORS HAVE HOT SPOTS AND LIGHT GROOVES CAUSING HEAVY BRAKING *TS",
        "vin": "KNDJB623025"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2004",
        "dateOfIncident": "07/31/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083140,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER JUST PULLING OUT FROM A DRIVE THROUGH MY COOLING SYSTEM FAN(S) BROKE APART PUTTING A HOLE IN MY RADIATOR AND CAUSING THE LOSS OF ALL MY ANTIFREEZE.AT SPEEDWAY KIA THERE WAS A 2002 SPORTAGE FOR SALE AND UPON INSPECTION 2 CRACKS WERE FOUND IN THE FAN. KIA IS REPAIRING MINE UNDER THE WARRANTY.*AK",
        "vin": "KNDJB723225"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2004",
        "dateOfIncident": "07/18/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082465,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC FAN BLADES BROKE OFF COOLING FAN AND STRUCK RADIATOR. THIS WAS CAUSED BY FATIGUE AS THE PLASTIC BLADES ARE CONNECTED TO METAL. WE HAVE TWO VEHICLES BOUGHT AT SAME TIME AND OTHER VEHICLE HAD SAME PROBLEM. BOTH FAN BLADES REPLACED. THIS FAILURE COULD HURT SOMEONE WORKING ON VEHICLE.  *JB",
        "vin": "KNDJB723625"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/25/2004",
        "dateOfIncident": "02/12/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079970,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ATTEMPTING TO UNLOCK THE SEAT BELT ON THE FRONT PASSENGER SIDE AND REAR RIGHT PASSENGER SIDE THE SEAT BELTS WOULD NOT UNLOCK. CONSUMER TOOK THE VEHICLE BACK TO THE DEALERSHIP FOR INSPECTION, AND  THE MECHANIC WAS ABLE TO RELEASE THE SEAT BELTS. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/20/2004",
        "dateOfIncident": "12/21/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072912,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Brake Parts Inc.",
                "productMake": "BRAKE PARTS",
                "productModel": "DISC BRAKE ROTOR",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "SEVERAL MONTHS AFTER THE PURCHASE OF MY 2002 KIA SPORTAGE MY BRAKES STARTED TO PULSATE, I TOOK IT TO THE DEALER THEY SAID MY BRAKES WERE WARPED AND NEEDED REPLACING.  ROTORS AND PADS IN FRONT HAVE BEEN REPLACED NOW 4 TIMES IN 16 MONTHS!*AK",
        "vin": "KNDJB723825"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2004",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068410,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE MARCH 27, 2003 MY NEW KIA SPORTAGE HAS BEEN IN THE DEALERSHIP 6 TIMES FOR THE SHAKING AND ENGINE LIGHT STAYING ON. I WILL LEAVE THE PARKING LOT OF THE DEALERSHIP AND IT WILL COME ON AFTER THEY SAY THEY HAVE FIXED IT.",
        "vin": "KNDJB723525"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/24/2004",
        "dateOfIncident": "03/23/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064835,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S ROTORS AND BRAKES FAILED PREMATURELY. THE CAUSE HAS NOT BEEN DETERMINED. THE PART HAS BEEN REPLACED THREE TIMES, HOWEVER PROBLEM STILL EXIST.  *NM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/28/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055999,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 35-40 MPH  VEHICLE WAS INVOLVED IN  A FRONTAL COLLISION. UPON IMPACT,  AIR BAGS DID NOT DEPLOY.  *AK",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/28/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056006,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMERS STATED WHILE TRAVELING 35-40 MPH VEHICLE WAS INVOLVED IN A FRONTAL COLLISION.  DRIVER'S SIDE SEAT BELT DISENGAGED FROM BUCKLE ASSEMBLY RELEASING THE CONSUMER. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069165,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RATTLE/VIBRATIN COMING FROM UNDER CAR.  CONVERTOR REPLACED WITH NO RESULTS.  TOLD CONVERTORS ARE DEFECTIVE.  THE RATTLE /VIBRATION HAPPENS EVERY TIME I SHIFT FROM LOW GEAR TO HIGH GEAR OR VISA-VERSA.  THEY WILL NOT DO TRANSMISSION DIAGNOSTICS.  I WAS TOLD THAT IT WAS THE RESONANCE(SP?) IN THE EXHAUST SYSTEM, THIS NOISE IS NORMAL.",
        "vin": "KNDJA723X25"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "12/15/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070922,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BEEN HAVING AIR CONDITION ISSUES SINCE 12/02  THE PROBLEM IS STILL NOT CORRECTED. THE AC PROBLEM HAS BEEN LONG AND ON GOING. THERE IS LIKE A FOG COMING OUT OF IT ONCE IT HAS BEEN ON AND THEN YOU HIT THE AC BUTTON OFF AND SOME WHITE FLAKES COME OUT OF IT. THE BLOWER MOTOR HAS BEEN REPLACED IN IT. IT WAS MAKING MOISTURE UNDER MY DASHBROAD ON THE PASSENGER SIDE. STILL WAITING FOR THAT TO BE DONE. APPARENTLY THEY PUT THE CAR UP ON RACKS UPED THE RPMS AND SAY THAT WHERE THE PRESSURE SHOULD BE AT IS NOT. IT EXCEEDS WHERE IT SHOULD BE. WAITING FOR THOSE PARTS TO COME IN. HAD ISSUES WITH EXHAUST HAD ENTIRE NEW EXHAUST PUT ON THE CAR THROUGH OUT THE MONTH OF AUGUST 03. WAS DONE IN PIECES BECAUSE INSTEAD OF CHECKING THE ENTIRE SYSTEM THEY SAW ONE PROBLEM FIXED THAT AND TOLD ME IT WAS COMPLETE. WELL THE NOISE CONTINUED TOOK IT BACK AND UNDER THE HEAT MANAFOLD THERE WAS ANOTHER PROBELM. NEEDLESS TO SAY ONCE A WEEK FOR THE MONTH OF AUGUST EXPECT FOR THE WEEK I WAS ON VACATION. HAVE HAD POWER WINDOW ISSUES WITH TWO WINDOWS NOT ROLLING DOWN, WAS UNABLE TO DUPLICATE THE FIRST TIME SO SENT ME ON MY WAY AND HAD TO BRING IT BACK WHEN THEY COULD WITNESS THE PROBLEM. CUP HOLDER HAS BROKEN, DOME LIGHT, LATCH ON BACK SEAT REPLACED. FAN CRACKED IN 3 SPOTS. BELTS HAVE HAD TO BE REPLACED AFTER A 30000 MILE CHECKUP AND POWER FLUSH TURN ON THE CAR AND LOUD NOISE COMING FROM ENGINE. WAS TOLD THAT BELTS WERE LOOSE. THEY SHOULD HAVE BEEN CHECKED TWICE ONE WIHT EACH SERVICE THAT WAS DONE. $600 SERVICE. THEY TOOK IT BACK AND TIGHTENED THEM SO THEY SAID. NEXT DAY NOISE AGAIN FROM THEM. TOOK IT BACK INTO THE DEALER THEY HAD TO BE COMPLETELY REPLACED.",
        "vin": "KNDJB723925"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "12/31/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054145,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA SPORTAGE.*MR  (NAR)  FIRST OIL CHANGE, FILTER REPLACEMENT, LUBE, RATTLING NOISE UNDER STEERING WHEEL, SLUGGISH TRANSMISSION SHIFTING AND EXCESSIVE BRAKE RESIDUE ON RIGHT FRONT WHEEL.   *CB",
        "vin": "KNDJB723125"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2004",
        "dateOfIncident": "12/22/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052597,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT/FAN RELAY AR SHOOK UPON BEING TURNED ON TWO SEPARATE OCCASSIONS PRIOR TO ENGING LIGHT COMING ON.  CAR TAKEN IN FOR REPAIRS SCAN SHOWED RANDOM CYLINDER MISFIRE #301 & #1. FOUND WATER AND CORROSION ON PLUGS AND WIRE ARCING. INGINITION WIRES AND SPARK PLUGS REPLACED.  CAR RETURNED A DAY AND HALF AFTER TAKEN IN FOR SERVICE ALTHOUGH I HAD BEEN TOLD THAT IT WOULD NOT BE AVAILABLE TO ME FOR ANOTHER 2 DAYS WHEREAS I COMPLAINED AND AFTER A MOMENT OF BEING PUT ON HOLD WAS TOLD CAR WAS REPAIRED AND I COULD COME PICK IT UP.  AFTER I PICKED UP CAR NOTICED HEAT IN CAR WAS NOT OPERATING ALTHOUGH OPERATIONAL WHEN CAR TAKEN IN FOR SERVICE.  RETURNED CAR TO DEALER TO REPAIR HEATING SYSTEM. DEALER FOUND FAN RELAY BURNT.  LEFT CAR AT DEALER ENTIRE DAY, PROBLEM NOT REPAIRED.  PICKED UP VEHICLE W/O REPAIR BEING DONE.  THEN NOTED ALL POWER WINDOWS NOT OPERATIONAL.  CALLED DEALER AND CORPORATE HEADQUATERS TO COMPLAIN OF ISSUES AND NEED FOR PROPER WORKING VEHICLE.  SINCE THEN REPEATED CALLS TO DEALER HAVE NOT PROVIDED POSITIVE RESULTS.  DEALER HAS REPEATEDLY STATED THAT PART WAS SCHEDULED TO ARRIVE WHEN IN FACT WRONG PART WAS REPEATEDLY BEING ORDERED INCORRECTLY AS STATED BY CORPORATE HOUSE.  CORPORATE HOUSE IMPLORED UPON DEALER TO LOCATE LOANER VEHICLE UNTIL ISSUE RESOLVED.  NO LOANER VEHICLE HAS BEEN RECEIVED BY ME AS OF YET.  CAR STILL HAS NO HEAT OR OPERATIONAL WINDOWS.  PURCHASING A PORTABLE CAR HEATER DUE TO THE FACT THAT IT IS WINTER AND THE TEMPERTURE HAS FALLEN DRAMATICALLYAND IS GOING TO DROP EVEN FURTHER.  NOT HAVING OPERATIONAL WINDOW INCONVENIECE SINCE I MUST PAY A TOLL EVERYDAY AND MUST OPEN MY DOOR IN ORDER TO PAY TOLL OPERATOR.*AK",
        "vin": "KNDJA723725"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/06/2004",
        "dateOfIncident": "01/06/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10053458,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON IMPACT AIR BAGS DEPLOYED  WITH SUCH FORCE THAT THE UNDER FRAME OF THE DASHBOARD DETACHED FROM THE BODY OF THE VEHICLE. WHEN THIS OCCURRED, IT BROKE AN OCCUPANT'S ANKLE AND FOOT.  DEALER INDICATED  IT WAS NOT HIS PROBLEM, AND URGED CONSUMER TO  CALL THE MANUFACTURER.  *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042244,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DOOR STRUCTURE ALLOWED WATER TO GET INTO THE EDGES.  THIS RESULTED IN THE DOORS BEING FROZEN SHUT WHEN THIS OCCURRED IN COLD WEATHER.  THE DEALERSHIP/MANUFACTURER ARE AWARE OF THE PROBLEM BUT HAVE NOT PROVIDED A FIX FOR IT.   *NLM   THE KIA DEALER INFORMED THE CONSUMER THAT THE WEREN'T GOING TO DO ANYTHING ABOUT THE PROBLEM DUE TO SNOW AND SLUSH WERE NORMAL WEATHER CONDITIONS THAT WOULD GET INTO THE DOORS.   *SCC   *JB",
        "vin": "KNDJA723025"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2003",
        "dateOfIncident": "11/10/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046687,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED INTERMITTENTLY WHILE DRIVING. VEHICLE WAS TAKEN TO THE DEALER, AND THEY FOUND THAT THE HARNESS WHICH HELD THE ALTERNATOR WAS MELTED. *AK",
        "vin": "KNDJA723525"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/24/2003",
        "dateOfIncident": "11/07/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044489,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH BRAKES STICKING, WINDOWS LOCKED UP, CALIPERS CRACKED.*MR    TWO MONTHS AFTER PURCHASE, MECHANIC WAS INFORMED THAT THE BRAKES FELT LIKE THEY WERE STICKING OR PULLING WHEN AT A STOP OR LIGHT. THE CD PLAYER WAS INOPERABLE. CONSUMER WAS TOLD A NEW AGENT THAT WAS BEING USED ON HER VEHICLE MADE THE NOISE AND IT WOULD GO AWAY IN A COUPLE OF MONTHS. JUNE 3, 2003, WINDOWS LOCKED UP, COULDN'T ROLL UP, MOTOR BURNED OUT. JUNE 7,2003, VEHICLE SUDDENLY JERKED. THERE WAS A NOISE FOLLOWED BY SPARKS ND CLANKING METAL SOUNDS. CONSUMER REALIZED SHE HAD NO BRAKES AND HAD TO PULL THE EMERGENCY BRAKE TO STOP. VEHICLE WAS TOWED TO THE DEALERSHIP. THE CALIPER HAD CRACKED AND BROKEN CAUSING THE PADS TO SHATTER ALONG WITH THE ROTORS TO FALL OUT OF THE BOTTOM OF THE VEHICLE. THEY CLAIMED THIS FAILURE WAS DUE TO HER NEGLIGENCE. CONSUMER QUESTIONED THAT IF ON A REPAIR BILL IT STATED \"30% BRAKES REMAINING,\" WHY WOULD THEY NOT REPLACE THEM. CONSUMER WAS BILLED $175. FOR THE RENTAL CAR, $700. FOR SERVICE AND TOW, $875. TOTAL. CONSUMER WAS INFORMED IF THE MATTER WAS TAKEN TO COURT THE DISCOUNT OF 30% WOULD BE DROPPED AND THE TOTAL TO BE PAID WOULD BE $1200. CONSUMER ASKED FOR COMPENSATION FOR TIME AND TROUBLE, LOAN CAUGHT UP, VEHICLE REPAIRED AT NO COST TO HER AND RENTAL CHARGES DROPPED.   *PH",
        "vin": "KNDJB723025"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/14/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042854,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT END OF VEHICLE SHAKES WHEN BRAKES ARE APPLIED.   *MR   THE FRONT ROTORS CONTINUED TO WARP.  THERE HAVE BEEN THREE REPAIR ATTEMPTS.   *SCC  *JB",
        "vin": "KNDJB723325"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/30/2003",
        "dateOfIncident": "09/27/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040952,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY RADIATOR FAN MOTOR LITERALLY BLEW UP.  ALL THE FAN BLADES FELL OFF AND CAUSED MY TEMPERATURE TO RISE, AFTER IT THE TEMP. ROSE THEN THE ENGINE LIGHT CAME ON AND THE VEHICLE SHUT DOWN.  THIS HAS CRACKED MY RADIATOR AND POSSIBLY THE ENGINE AS WELL.  I HAVE HAD NOTHING BUT PROBLEMS SINCE I PURCHASED MY KIA SPORTAGE NEW.  MY REAR WINDOWS DID NOT WORK, MY A/C HAS MADE NOISES SINCE DAY 1, THE CAPS KEEP FALLING OFF MY WHEELS, THE ALIGNMENT WAS OUT SO THE DEALERSHIP SAID THAT IT WAS A FACTORY DEFECT ON THE TIE ROD'S, THE KNOB ON THE REAR SEAT WAS BROKEN, I HAVE BEEN RAN OFF THE ROAD BECAUSE OF THE HEADLIGHTS BEING OUT OF ADJUSTMENT (REPAIRED NUMEROUS TIMES), VEHICLE DOES NOT LIKE TO GO INTO REVERSE IN THE MORNINGS (5 SPEED), I'VE HAD WIRES HANGING FROM UNDER MY DASH WHEN PURCHASED, WHEN IT RAINS MY FEET GET WET INSIDE THE VEHICLE .  I HAVE PROBLEMS WITH THE HOOD NOT LINING UP CORRECTLY AS WELL.",
        "vin": "KNDJB723X25"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/23/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040340,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES WARPED SINCE CONSUMER OWNED VEHICLE.  AFTER REPAIR THE BRAKES WOULD WARP AGAIN.   THIS PATTERN CONTINUED UNTIL THE DEALERSHIP DECIDED TO KEEP THE TRUCK FOR FURTHER REPAIRS.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039840,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKE PEDAL IS DEPRESSED, THEY FAIL TO STOP THE VEHICLE DUE TO THE ROTORS WARPING. THIS RESULTS IN EXTENDED STOPPING DISTANCE. ALSO, THE 5 SPEED STANDARD TRANSMISSION WOULD NOT GO INTO SECOND GEAR AND NEEDED REPLACEMENT. THE REAR END ALSO MAKES A POPPING/CLUCKING NOISE AND THE VEHICLE WILL JERK FORWARD HARD WHEN THE NOISE OCCURS. THE CAUSE OF THE FAILURES IS UNDETERMINED.   *PH",
        "vin": "KNDJB723625"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/02/2003",
        "dateOfIncident": "04/17/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032179,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT SINCE BUYING THE VEHICLE IN JANUARY OF 2003  ROTORS HAVE BEEN REPLACED TWICE IN THAT TIME.  THE FAULTY ROTORS CAUSED VIBRATION WHILE BRAKING.  THE ROTORS WERE REPLACED ONCE AT 5699 MILES AND AGAIN AT 8694 MILES. WHEN THE ENGINE WAS STARTED ALL THE DOORS LOCKED, BUT WHEN IT WAS DAMP OUTSIDE THE LOCKS WORKED INTERMITTENTLY.  THE DRIVER'S SIDE WIPER WASHER WAS NOT WORKING AS WELL AS THE PASSENGER SIDE.  THE DEALER READJUSTED IT.  THERE WAS A RATTLING IN THE DASH ON THE DRIVERS SIDE BELOW THE AIR VENT.  *AK   *PH   *NLM",
        "vin": "KNDJA723825"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/27/2003",
        "dateOfIncident": "08/27/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037732,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AT NORMAL SPEED VEHICLE EXPERIENCE  A SUDDEN ACCELERATION. DEALER HAD INSPECTED VEHICLE FOUR TIMES, AND PROBLEM STILL OCCURRING.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/27/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037825,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHAKES AND THERE IS A SUDDEN DECREASE IN SPEED.   *MR   THE VEHICLE HAD BEEN TO THE DEALER FOR REPAIRS AND THE PROBLEMS REMAINED THE SAME.  WHILE DRIVING, THE VEHICLE VIBRATED, THEN THE CHECK ENGINE LIGHT CAME ON, AND THE VEHICLE SUDDENLY DECREASED SPEED FROM 45 MPH DOWN TO 5 MPH.   *SCC   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/25/2003",
        "dateOfIncident": "08/28/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033457,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I MIRROR ODI ID NUMBER 10010713 - FAILURE DATE MARCH 17, 2003 ALMOST TO A \"T\"!HE DIFFERENCES ARE...I HAVE BEEN BACK TO SERVICE DEPARTMENT AT LEAST 10 TIMES FOR THE SAME REPAIR.  NOW 31,000 MILES.  I HAVE BEEN OFFERED A RENTAL ONCE.    SERVICE MANAGER AND SHOP FOREMAN HAVE DRIVEN CAR THEMSELVES TO MAKE SURE REPAIR IS OK.  FINE FOR A DAY OR SO, THEN HAPPENS AGAIN!  SO...NEVER REALLY OK!  THIS VEHICLE IS UNSAFE WITH THIS UNRESOLVABLE (TO DATE) PROBLEM.  MY WIFE AND 4 YEAR CHILD HAVE BEEN PASSENGERS ALONE (AND WITH ME IN THE VEHICLE) WHEN THIS HAPPENS.  THE LAST TIME AN 18 WHEELER WAS RUNNING UP HER BACK WHEN THIS HAPPENED.  VERY LIFE THREATENING.  KIA MANUFACTURER'S RESPONSE HAS INITIALLY BEEN \"I'M SORRY.\"  WE CAN ONLY OFFER TO REPAIR THE PROBLEM.  10 TIMES IS MORE THAN SUFFICIENT TO FIX A PROBLEM.  I WANT A NEW VEHICLE OR TO TAKE THE CAR BACK AND 'WASH' THE ENTIRE LOAN TO $0.00.  I BOUGHT A NEW CAR SO I WOULD NOT HAVE ISSUES LIKE THIS OCCUR.  LIKE OID ID NUMBER 10010713 STATES, \"I JUST WANT A CAR THAT WORKS.\"*AK",
        "vin": "KNDJA723025"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, OTHER,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/14/2003",
        "dateOfIncident": "04/25/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032799,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD BRAKES WORKED ON 5 TIMES IN PAST YEAR, AIR CONDITIONER SMELLS MUSTY EVERY TIME YOU TURN IT ON, GAS WARNING LIGHT DOESN'T WORK, RIGHT REAR WINDOW DIDN'T WORK FOR OVER A YEAR.  *AK",
        "vin": "KNDJB723225"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/28/2003",
        "dateOfIncident": "07/28/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031302,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY AND WITHOUT PRIOR WARNING.  A BAD ODOR WAS COMING INSIDE OF THE VEHICLE.  DRIVER'S SIDE WHEEL COVER WAS ON FIRE.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/11/2003",
        "dateOfIncident": "04/10/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025903,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RATTLE/VIBRATION FROM UNDER VEHICLE WHEN SHIFTING FROM HIGH GEAR TO LOW AND VISA VERSA.  CAR HAS BEEN IN SHOP 4 TIMES. A NEW CONVERTER WAS PUT ON WITH NO RESULTS. ANOTHER CONVERTER WAS ORDERED (SO I WAS TOLD) NEVER HAPPENED. THE STRAW THAT BROKE THE CAMELS BACK WAS WHEN I WAS TOLD THAT THERE WAS NOTHING WRONG WITH MY CAR. THE NOISE THAT I HEAR IS THE EXHAUST GASES FLOWING THROUGH THE EXHAUST SYSTEM!! I WAS TOLD THAT EVERY CAR MAKES A DISTINCTIVE AND UNIQUE SOUND DEPENDING UPON THE MAKER IE: ASIAN, EUROPEAN AND AMERICAN!?!?!?  A COMPLAINT HAS BEEN FILED WITH BBB. THIS IS A 2002 SPORTAGE BOUGHT IN NOVEMBER 2001.  THE CAR HAS ONLY 10,000 MILES ON IT.8AK",
        "vin": "KNDJA723X25"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/30/2003",
        "dateOfIncident": "06/27/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026141,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT WHEN APPLYING THE BRAKES THE BRAKES WOULD MAKE A LOUD NOISE. DEALER NOTIFIED. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019763,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE BELTS MADE A SQUEAKING NOISE.  KIA WAS NOT AWARE OF THE PROBLEM.  *NLM   PH  *JB",
        "vin": "KNDJA723425"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025053,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH AIR BAG LIGHT, AND WINDOWS ON KIA SPORTAGE.  *MR  ALSO PROBLEM WITH A CRACKED MOTOR HEAD.  *TT  *JB",
        "vin": "KNDJA723225"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "06/13/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024226,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S VEHICLE WAS INVOLVED IN A FRONTAL COLLISION WHILE TRAVELING APPROXIMATELY 65MPH, AND NEITHER  FRONT DRIVER'S/ PASSENGER'S OR \"KNEE\" AIR BAGS DEPLOYED.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2003",
        "dateOfIncident": "02/04/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016486,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUOUS PROBLEMS WITH KIA SPORTAGE.  SO FAR THERE HAVE BEEN NO ACCIDENTS, BUT I FEAR THAT SOMEDAY THIS CAR WILL CAUSE A SERIOUS ACCIDENT.          *JB",
        "vin": "KNDJB723925"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "02/14/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10016361,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "JAN. 10TH- BRAKED TO AVOID ACCIDENT ON I-59 AT 70 MPH AND CAR WAS COMPLETELY UNCONTROLLABLE-RAN OFF I-59 AND COLLIDED WITH TREE  FEB. 14- BRAKED AGAIN AT HIGH SPEED TO AVOID ACCIDENT AND CAR WAS UNCONTROLLABLE. HIT TREE AND ALMOST LOST LIFE. WOULD HAVE LOST LIFE HAD NOT SOMEONE PULLED ME FROM VEHICLE, VEHICLE CAUGHT FIRE AND BURNED DOWN COMPLETELY.   *NLM",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/28/2003",
        "dateOfIncident": "03/09/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014706,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEARS SHIFTED IMPROPERLY AND THERE WAS A RATTLING NOISE COMING FROM UNDER THE VEHICLE. CONSUMER WAS INFORMED THE TRANSMISSION NEEDED TO BE REPLACED, ALSO THE DEALER NOTICED THE STEERING GEAR BOX WAS LEAKING.   *JB",
        "vin": "KNDJB723425"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/26/2003",
        "dateOfIncident": "01/25/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011438,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CONSUMER APPLIED THE BRAKES BUT THEY DID NOT RESPOND. *AK  *NLM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2003",
        "dateOfIncident": "03/17/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010713,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A KIA SPORTAGE IN APRIL 2002.  SINCE THEN, THE CAR HAS BEEN BROUGHT BACK TO THE KIA SERVICE CENTER ON FOUR SEPARATE OCCASIONS FOR THE SAME PROBLEM.  THE ENGINE WILL SPUTTER, THE CAR SHAKES, THE RPMS GO TO 0 AND THE HEADER PIPE GLOWS RED HOT (LITERALLY), AND ALL OF A SUDDEN THE CAR WILL LOSE 75% OF ITS POWER.  THIS IS DANGEROUS.  THIS CAR HAS MAYBE 10,000 MILES ON IT AND IT WAS BOUGHT BRAND NEW.  THIS IS RIDICULOUS AND NOT ACCEPTABLE.  THE SERVICE CENTER HAS REPLACED THE ROTORS (KEEP IN MIND THIS IS ON 10,000 MILES), THE CATALYTIC CONVERTER, HEAD PIPE, MUFFLER AND THE REST OF THE ENTIRE EXHAUST SYSTEM, AND SPARK PLUGS.  UP TO THIS DATE, THEY HAVE NOT FOUND THE PROBLEM AND EVEN AS I TYPE THIS, THE CAR IS SITTING IN THE SERVICE CENTER THE FOURTH TIME.  I WAS GIVEN A RENTAL VEHICLE THE THIRD TIME.  BUT THIS TIME, THEY HAVE NOT GIVEN ME A RENTAL OR REPLACEMENT VEHICLE BECAUSE TWO ARE OUT OF COMMISSION DUE TO ACCIDENTS AND ONE IS CURRENTLY BEING USED.  THEY SAY THAT THEY HAVE TO HOOK THE CAR UP TO A COMPUTER AND DRIVE IT NUMEROUS MILE TO RECORD DATA.  I JUST WANT A CAR THAT WORKS.  *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/06/2003",
        "dateOfIncident": "03/04/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010033,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIPERS BOLTS CAME LOOSE WHEN ICE AND SNOW WERE PACKED AROUND THEM. *JB",
        "vin": "KNDJA723225"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/07/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002236,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHILE DRIVING THE VEHICLE SPENT OUT OF CONTROL, SHE ALSO STATED THAT THE STEERING WHEEL WAS SHAKING REALLY BAD. TS",
        "vin": "KNDJB723225"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/28/2002",
        "dateOfIncident": "12/22/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000627,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING BOX IN MY 2002 KIA SPORTAGE SUDDENLY BECOME INOPERABLE AND WOULD NOT PERMIT THE CAR TO BE STEERED TO THE RIGHT.  IT HAPPENED WHILE I WAS DRIVING AND I NEARLY HAD AN ACCIDENT BEFORE I COULD GET IT STOPPED.",
        "vin": "--"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/17/2002",
        "dateOfIncident": "12/02/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001102,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ABOUT 55MPH ON THE HIGHWAY.  WITHOUT PRIOR WARNING A DEER RAN IN FRONT OF THE VEHICLE.  THE CONSUMER HIT THE DEER.  THE DUAL AIRBAGS DIDN'T DEPLOY PLEASE PROVIDE ADDITIONAL INFORMATION. TS",
        "vin": "KNDJA723125"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/29/2002",
        "dateOfIncident": "11/28/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770242,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY.  DT",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/07/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022364,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CALLED COMPLAINING ABOUT HAVING PROBLEMS WITH THE GAS TANK ALSO STATES THAT EVERYTIME HE IS FILLING THE TANK ON THE VEHICLE GAS SPILLS RIGHT OVER IT WITH OUT THE GAS TANK BEING FULL. DEALER WAS CONTACTED AND STATED THAT A NEW GAS TANK WAS SUPPOSE TO BE PUT IN BUT CONSUMER STATES THAT THE PROBLEM IS STILL THERE.        TS",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/05/2002",
        "dateOfIncident": "10/26/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022224,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THEY'RE UNABLE TO ADJUST THE SIDE MIRROR CAUSING A DISTRACTION TO THE CONSUMER VIEW. DEALER NOTIFIED         TS",
        "vin": "PLEASE PROV"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/24/2002",
        "dateOfIncident": "08/02/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768861,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WONDERING IF YOU WOULD KNOW WHERE I CAN GET MY VEHICLE TESTED FOR HEALTH ISSUES.  I PURCHASED A 2002 KIA SPORTAGE AT THE END OF JANUARY 2002.  I HAVE A COMPLAINT ABOUT MY VEHICLE THAT THE DEALERSHIP DOES NOT SEEM TO BE ABLE TO FIX.  IT HAS A VERY STRONG ODOR THAT IS COMING INTO THE VEHICLE THROUGH THE AIR VENTS.  THE DEALERSHIP HAS REPLACED THE CATALYTIC CONVERTER BUT IT HAS NOT HELPED AT ALL.  THE DEALERSHIP DOES NOT KNOW WHAT THE PROBLEM IS.  I FINALLY GOT THEM TO GO FOR A TEST DRIVE WITH ME AND HAD THEM SMELL THE ODOR JUST LAST WEEK.  I HAD BEEN TRYING TO GET THEM TO GO FOR A TEST DRIVE WITH ME SINCE MAY 2002.  MY VEHICLE HAS 15000 MILES ON IT SO IT IS TO LATE FOR ME TO GET THE MANUFACTURER TO PURCHASE THE VEHICLE BACK UNDER THE OREGON LEMON LAW.  I TRIED TO GO THROUGH THE ARBITRATION PROCESS BEFORE I HIT 12,000 MILES BUT THE PERSON I SPOKE TO SAID I DID NOT HAVE A CASE BECAUSE I ONLY HAD SERVICE ORDERS FOR  2 OF THE 4 TIMES I TOOK THE VEHICLE IN FOR THE ODOR.  THE DEALERSHIP DID NOT WRITE UP A SERVICE ORDER FOR THE SMELL UNTIL THE 3RD TIME I TOOK THE CAR TO THEM. I AM HOPING THAT YOU OR SOMEONE YOU KNOW MIGHT BE ABLE TO HELP ME WITH THIS PROBLEM.  I DO NOT THINK THAT THE SMELL IS VERY SAFE FOR MY CHILDREN AND MYSELF TO BE SMELLING.  IT HAPPENS EVERY TIME I DRIVE MY VEHICLE.  THE BRAKES BUILD UP A BLACK DUST THAT IS VERY EXCESSIVE AROUND THE RIM OF MY FRONT TIRES WITHIN 6 MONTHS THEY WERE 30 PERCENT WARN.  DT",
        "vin": "KNDJA623225"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/16/2002",
        "dateOfIncident": "09/22/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020945,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT 30 MPH, CONSUMER HAS AN FRONTAL ACCIDENT AND THE AIR BAGS DIDN'T DEPLOY. DEALER HAS BEEN NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION.     MR",
        "vin": "KNDJA723625"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/10/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007493,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPT. 18, 2002, WE PURCHASED A 2002 KIA SPORTAGE. UPON COMPLETION OF PAPER WORK, I QUESTIONED DEALER ABOUT A SEAT BELT EXTENDER AS ORIGINAL INSTALLED SEAT BELT WOULD NOT FIT COMFORTABLY AROUND MY LARGE FRAME. UNLIKE FORD & CHEVROLET, WE WERE TOLD THAT KIA DID NOT MAKE SEAT BELT EXTENDERS! THE NEXT DAY I IMMEDIATELY PHONED KIA MANUFACTURERS MAIN OFFICE, AND AGAIN WAS TOLD THEY DID NOT MAKE SEAT BELT EXTENDERS, THEY COULDN'T HELP ME. I CALLED THE DEALER AND TOLD HIM WE HAD JUST MADE A PURCHASE ON A BRAND NEW VEHICLE THAT NOW I COULD NOT DRIVE SAFELY. HAD WE KNOWN THAT A SEAT BELT EXTENDER COULD NOT BE PROVIDED, WE WOULD NOT HAVE PURCHASED THE VEHICLE. WE DO TAKE FINANCIAL RESPONSIBILITY, BUT IT IS STATE LAW IN MISSOURI THAT A SEAT BELT BE WORN WHILE DRIVING OR RIDING IN A MOTOR VEHICLE. THE RAMIFICATION WITHOUT A SEAT BELT IN A CRASH IN FRONT OF AN AIRBAG IS NOT SOMETHING I THINK ANY CAR MANUFACTURER WANTS TO BE RESPONSIBLE FOR IN A COURT OF LAW SHOULD A CRASH OCCUR AND AN AIRBAG INFLATE. THE BOTTOM LINE: I NEED A SEAT BELT EXTENDER FOR MY KIA SPORTAGE, LIKE CHEVROLET AND FORD OFFER FOR SAFETY WHILE RIDING IN A VEHICLE. (DOCUMENTATION - 10/10/2002).    **DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT OVER TO ARTEMIS**768337",
        "vin": "KNDJA723225"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2002",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019144,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG SENSOR MODULE FAILED.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/20/2002",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019145,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S REAR POWER WINDOW MOTOR FAILED.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/20/2002",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019147,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS WERE WARPED EXCESSIVELY AND HAD TO BE REPLACED AT 5000 MILES.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2002",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019151,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRANSMISSION SHIFTS BETWEEN 1ST-2ND AND 2ND-3RD GEARS IT MAKES A LOUD SQUEALING NOISE.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2002",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019157,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DIFFERENTIAL FAILED, RESULTING IN VEHICLE STALLING WHILE DRIVING.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/18/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018938,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AND WITHOUT ANY INDICATION ENGINE INDICATOR LIGHT FLASHED.DEALER HAS BEEN CONTACTED. TECHNICIAN STATED THAT WHEN LIGHT FLASHED ON IT INDICATED EMISSION PROBLEM. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/18/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018939,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW DOES NOT GO DOWN. DEALER HAS REPAIRED REAR WINDOW TWICE. DEALER NOTICED RUBBER NEEDED TO BE REPLACED DUE TO FADING. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/18/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018941,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER HAVING VEHICLE FOR THREE MONTHS COURTESY LIGHT STOPPED WORKING. DEALER HAS BEEN CONTACTED. PLEASE PROVIDE FURTHR INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/18/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018942,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CIGARETTE LIGHTER DOES NOT WORK AT ANY TIME. DEALER HAS BEEN CONTACTED. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/18/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018943,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING 55 MPH OR LESS VEHICLE SWAYED LEFT TO RIGHT EVEN WITH DIFFERENT WIND CURRENT. PLEASE PROVIDE FURTHER INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/20/2002",
        "dateOfIncident": "07/20/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765938,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING HAS EXCESSIVE PLAY. KIA REPRESENTATIVES STATE \" ALL SPORTAGES ARE LIKE THAT AND THEY WILL NOT FIX.\"*AK",
        "vin": "KNDJB723725"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/13/2002",
        "dateOfIncident": "04/12/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016077,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG INDICATOR LIGHT IS ILLUMINATED. VEHICLE WAS TAKEN TO DEALER 3 TIMES BEFORE ISSUE WAS RESOLVED.",
        "vin": "KNDJB723925"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2002",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016079,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INSTRUMENT PANEL LIGHTS GO OUT INTERMITTENTLY WHILE DRIVING. VEHICLE HAS BEEN TAKEN TO DEALER FOR REPAIRS 3 TIMES.*AK",
        "vin": "KNDJB723925"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/13/2002",
        "dateOfIncident": "04/20/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8016083,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR PASSENGER'S SIDE POWER WINDOW HAS STOPPED WORKING. WINDOW HAS BEEN REPAIRED 3 TIMES.*AK",
        "vin": "KNDJB723925"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/29/2002",
        "dateOfIncident": "01/06/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015035,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING REAR SEATS MOVE BACKWARDS AND FORWARDS WHEN BRAKING OR ACCELERATING.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/30/2002",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010752,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED VEHICLE PULLS TO THE RIGHT AND THE CHECK ENGINE LIGHT FLASHES ON AND OFF. DEALER HAS BEEN CONTACTED.*JB  *TT",
        "vin": "KNDJB723625"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/30/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8010754,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE VEHICLE WOULD REVED UP WHEN TAKING OFF FROM A STOP. DEALER CONTACTED.*JB",
        "vin": "KNDJB723625"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/08/2002",
        "dateOfIncident": "03/03/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009457,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK POWER WIDOWS WILL NOT GO DOWN WHEN BOTTON IS PUSHED.*AK",
        "vin": "KNDJB723325"
    },
    {
        "components": "VISIBILITY,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/23/2002",
        "dateOfIncident": "04/23/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 761102,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDOWS LOCK AND SHAKE, DRIVER'S SIDE DOOR SWINGS OPEN, PASSENGER DOOR DOES NOT SHUT PROPERLY, BACK SEAT BELTS-ONLY 1 WORKS, DRIVER'S DOESN'T LOCK PROPERLY. *AK",
        "vin": "KNDJA723815"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/13/2002",
        "dateOfIncident": "02/27/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005630,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SIDE DOOR STAYS AJAR. TOOK  VEHICLE TO  DEALER, AND WAS TOLD THAT  DOOR WAS NOT OFF LINE, YET  DOOR WILL NOT CLOSE PROPERLY.*AK",
        "vin": "KNDJB723X25"
    },
    {
        "components": "STEERING,VISIBILITY,STRUCTURE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/13/2002",
        "dateOfIncident": "02/27/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8005631,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR STAYS AJAR.  MECHANIC TOLD CONSUMER THAT DOOR IS NOT OFF LINE, YET DOOR DOES NOT CLOSE PROPERLY.*AK  NOW HORN HAS FAILED, SECURITY ALARM SYSTEM ACTS ERRATICLY, THE RIGHT SIDE HOOD IF OFFLINE AND IS BENT CAUSING THE HOOD TO INTRUDE OUTWARD TOWARDS THE FRONT FENDER, AND THE DRIVER SIDE BACK WINDOW WILL NOT MOVE UP OR DOWN. *TT",
        "vin": "KNDJB723X25"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/15/2002",
        "dateOfIncident": "01/14/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8002257,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS TRAVELING ABOUT 15MPH AND COMING OFF THE OFF RAMP ON THE HIGHWAY, ANOTHER VEHICLE WAS COMING TOWARDS THE CONSUMER AND COLLIDED WITH CONSUMER'S VEHICLE. UPON IMPACT, AIRBAGS DID NOT GO OFF.  DEALERSHIP WAS AWARE OF PROBLEM. *AK  ONE PERSON WAS INJURED IN THE ACCIDENT.   *JB",
        "vin": "KNDJA723825"
    }
]