[
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/19/2019",
        "dateOfIncident": "04/05/2019",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11233447,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THE BERINGS REPLACED 2 TIMES IN THE PASSENGER SIDE TWO TIMES NOW AND ITS DOING IT AGAIN THE OTHER SIDE WAS DONE FIRST . THE CAR JUST STOPPED DEAD IN THE ROAD AND I COULD NOT GET IT TO MOVE BEFORE I GOT IT FIXED THE TIME BEFORE THIS . I DONT HAVE THE MONEY TO KEEP FIXING THIS SAME PROBLEM THE CAR HAS BEEN SITTING FOR MONTHS NOW . I GOT THE CAR TO FINALLY MOVE BACKWARDS SO I DROVE IT BACKWARDS TO THE SPOT ITS IN GOT IT FIXED . AND FOR THE THIRD TIME ITS HAPPENING AGAIN.",
        "vin": "KNADC123426"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/07/2016",
        "dateOfIncident": "04/07/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10883214,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2002 KIA RIO. WHILE DRIVING 30 MPH, THE VEHICLE WAS INVOLVED IN A FRONT END CRASH. THE FRONT DRIVER SIDE AIR BAG DEPLOYED AGGRESSIVELY AND METAL FRAGMENTS STRUCK THE CONTACT'S FACE. A POLICE REPORT WAS FILED. THE CONTACT SUSTAINED A HEAD LACERATION THAT REQUIRED STITCHES, A BROKEN NOSE, AND A HAND INJURY. MEDICAL ATTENTION WAS REQUIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS TOWED TO THE SALVAGE YARD AND DEEMED DESTROYED. THE FAILURE MILEAGE WAS UNKNOWN.  ...UPDATED 7/19/16*BF  *JS",
        "vin": "KNADC123426"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/27/2014",
        "dateOfIncident": "08/25/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628921,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST GOT MY CAR FIXED ON MON. 8/25/14. I TOOK IT IN BECAUSE IT WAS IDLING ROUGH. THE SHOP PUT IN NEW SPARK PLUGS AND WIRES. IT COST ME $180. I DROVE IT HOME. IT WAS SMOOTH. THEN I DROVE TO DOWNTOWN AKRON, ABOUT 15 MILES, TO A HIKE. WHEN I WAS ALMOST THERE, MY CAR JUST WENT DEAD WHILE I WAS DRIVING. I PULLED OVER AND PARKED OFF THE BUSY ROAD ONTO A PARKING LOT (PART OF/BY AKRON UNIVERSITY). THE CAR WAS DEAD. IT MADE A CLICKING NOISE WHEN I TRIED TO START IT. I CALLED AAA AND THEY DIDN'T KNOW WHAT WAS WRONG (IT HAD A BRAND NEW 6 YEAR BATTERY IN IT). THEY TOWED ME BACK TO THE SHOP THAT HAD WORKED ON IT EARLIER THAT DAY - 15 MILES.  THE NEXT DAY, 8/26/14, THE SHOP TOLD ME THE TIMING BELT BROKE AND IT RUINED THE ENGINE. THEY SAID KIA'S HAVE AN INTERFERENCE MOTOR. WHEN THE BELT BREAKS, IT BREAKS OFF ALL THE PISTONS (SOMETHING LIKE THAT) AND RUINS THE MOTOR. IT CAN'T BE FIXED. I HAVE TO BUY A NEW MOTOR $2000 APPRX, OR A NEW CAR.  I LIVE ALONE AND DON'T HAVE THE MONEY FOR EITHER. I WAS COUNTING ON THIS CAR TO LAST ME 2-3 MORE YEARS. A COUPLE OF DIFFERENT GARAGES TOLD ME IT LOOKED GOOD AND SHOULD LAST THAT LONG AT LEAST. I WAS GOING TO START SAVING FOR A NEW CAR.  THIS IS VERY UNETHICAL OF KIA. THEY SHOULD NOT BE ALLOWED TO MAKE/SELL A CAR THAT HAS A MOTOR THAT SELF-DESTRUCTS. I'VE HAD OTHER CARS AND THE TIMING BELT BROKE, BUT IT DID NOT RUIN THE MOTOR. THEY JUST REPLACED THE TIMING BELT. THIS IS HORRIBLE! I HAD NO IDEA, NO WARNING! ALL THE SHOP I TOOK IT TO NEVER SAID A THING! KIA SHOULD NOT BE ALLOWED TO DO THIS. THEY SHOULD AT LEAST HAVE TO WARN YOU ABOUT IT!  I HAVE A MANUAL AND I NEVER SAW ANYTHING ABOUT IT IN THERE. MY CHEVY MANUAL HAD THE MILES AND WHAT YOU NEED TO DO AT THOSE MILES. THE KIA BOOK DOES NOT. I HAD NO IDEA!! THIS SHOULD BE ILLEGAL! TOTAL RIP OFF!  *TR",
        "vin": "KNADC123X26"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/09/2014",
        "dateOfIncident": "06/05/2014",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10597220,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SLOWING TO TURN INTO GAS STATION, REAR AXLE BROKE DO TO EXCESSIVE RUST ROT. THE BODY ON THIS CAR HAD STATED TO RUST AT 8000 MILES, REAR FRAME HAS EXCESSIVE RUST ROT ALSO. NUMEROUS OTHER KIA RIO OWNERS ARE REPORTING THIS ISSUE THIS IS ALARMING I COULD HAVE SLAMMED INTO THE GAS PUMPS AS THE BRAKES LOCKED DO TO SEVERING A BRAKE LINE.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/18/2013",
        "dateOfIncident": "09/11/2013",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544190,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA RIO. THE CONTACT STATED THAT THE REAR DRIVER AND PASSENGER'S SIDE SEAT BELTS WOULD NOT RETRACT. THE CONTACT INSPECTED THE SEAT BELTS AND DISCOVERED THAT PART OF THE SEAT BELT WAS DISINTEGRATED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 104,000.",
        "vin": "KNADC123126"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/19/2012",
        "dateOfIncident": "02/20/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452278,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA RIO CINCO.  WHILE DRIVING APPROXIMATELY 60 MPH, THE STEERING WHEEL BEGAN TO VIBRATE EXCESSIVELY AND PULSATION OCCURRED WHEN THE ACCELERATOR PEDAL WAS ENGAGED.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC ON THREE SEPARATE OCCASIONS WHERE THE FRONT PASSENGER AND DRIVER SIDE WHEEL HUB BEARINGS WERE REPLACED EACH TIME.  IN ADDITION, THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER TWICE FOR THE REPLACEMENT OF THE FRONT PASSENGER AND DRIVER SIDE WHEEL HUB BEARINGS. THE MANUFACTURER WAS NOTIFIED OF THE CONSTANT PROBLEM. THE APPROXIMATE FAILURE MILEAGE WAS 70,000.",
        "vin": "KNADC163426"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2012",
        "dateOfIncident": "01/27/2012",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445892,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2002 KIA RIO. THE CONTACT STATED THAT WHEN REFUELING THE VEHICLE, FUEL WOULD SPEW BACK OUT FROM THE FILLER NECK. IN ADDITION, THE CONTACT STATED THAT A STRONG GASOLINE FUEL ODOR WAS CONSTANTLY PRESENT WITHIN THE VEHICLE AFTER REFUELING. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 04V179000 (FUEL SYSTEM, GASOLINE: DELIVERY) BUT WAS ADVISED BY THE DEALER THAT THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER THE RECALL PRIOR TO THE PURCHASE OF THE VEHICLE. THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 107,000.   UPDATED 03/16/12 *BF  UPDATED 03/30/12",
        "vin": "KNADC123X26"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/06/2011",
        "dateOfIncident": "12/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438436,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA RIO. CONSUMER STATES TIMING BELT FAILED *TGW  THE CONSUMER STATED THE TIMING BELT FAILED FOR A SECOND TIME AT 59,059 AND DESTROYED THE SECOND ENGINE.  THE CONSUMER WAS INFORMED THE VEHICLE WOULD NOT BE COVERED UNDER WARRANTY, BECAUSE THE ORIGINAL TIMING BELT WAS NOT REPLACED AT THE PROPER MILEAGE. THE CONSUMER STATED THE ORIGINAL TIMING BELT WAS REPLACED AT 53,668 AND THE REPLACEMENT BELT FAILED AT 59,059 BEFORE THE RECOMMENDED 60,000. A KIA REPRESENTATIVE INFORMED THE CONSUMER THE WARRANTY ONLY EXTENDED TO THE ORIGINAL ENGINE, NOT THE REPLACEMENT ENGINE. *JB",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/18/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413387,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA RIO. THE CONTACT NOTICED THAT THE REAR SEAT BELT WAS FRACTURED. THE DEALER INFORMED THE CONTACT THAT IT WAS HER RESPONSIBILITY REPAIR THE VEHICLE. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE VEHICLE HAD NOT BEEN INSPECTED OR REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 93,458 AND THE CURRENT MILEAGE WAS UNKNOWN. THE VIN WAS UNAVAILABLE. UPDATED 09/01/2011 *LN",
        "vin": "KNADC123326"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/06/2011",
        "dateOfIncident": "07/04/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410720,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 KIA RIO. THE CONTACT STATED THAT THE REAR SEAT BELTS WERE FAILING. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THAT THEY COULD REPAIR THE SEAT BELTS AT THE CONTACT'S EXPENSE. THERE WERE NO RECALLS FOR THE VEHICLE AND THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 93,458.",
        "vin": "KNADC123326"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/18/2010",
        "dateOfIncident": "11/27/2010",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10371653,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE JUST 10 MINUTES DRIVING FROM HOME, WHEN WE SAW THE SMOKE COMING FROM FRONT OF THE CAR. WE WERE APPROACHING THE LIGHT SO  THE SPEED WAS ABOUT 10 MILES . WITHIN 5/6 METERS WE STOPPED IN TURN LINE AND TURNED OFF THE ENGINE. THE SMOKE GOT MORE AND MORE. SO WE GET OUT OF THE CAR AND WE WERE JUST SHOCKED. SOMEBODY TOLD US CALL 911 AND WE DID AND WE CALLED FIRE FIGHTERS AS WELL. DURING THAT PERIOD FIRE WAS COMING OUT OF THE BONNET AND OTHER CARS WERE AROUND US. I WAS JUST AFRAID OF EXPLOSION . IN COUPLE OF MINUTES POLICE CAME AND BLOCK THE ROAD. THEN FIRE FIGHTERS CAME AND PUT THE FIRE OUT. BUT OUR CAR WAS TOTALLY DAMAGED AND OUT OF ORDER. WE TOWED IT TO THE AUTO BODY AND SOME DAYS LATER THEY TOLD CAN'T DO ANYTHING WITH IT.",
        "vin": "KNADC123526"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/01/2010",
        "dateOfIncident": "11/27/2010",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368522,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT THE SECOND HAND 2002 KIA RIO 4 MONTHS AGO . ME AND MY WIFE WERE DRIVING FOR 1 MILE WHEN THE SMELL OF SMOKE CAME AND IN THE COUPLE OF SECONDS THERE WAS SMOKE CAME FROM THE BONNET. I SWITCHED OFF AND  TRIED TO OPEN THE BONNET BUT THE SMOKE GOT MORE AND MORE ,SO WE LEFT THE CAR IMMEDIATELY AND WE SAW FLAMES CAME FROM RIGHT PART OF THE BONNET. WE WERE JUST SHOCKED AND SCARED OF FIRE. WE CALLED 911 AND FIREFIGHTERS AND IN LESS THAN TEN MINUTES FRONT PART OF THE CAR WAS TOTALLY RUINED. LOOKING OPTIMISTICALLY THERE WAS NO INJURY AT ALL . BUT HOW ABOUT THE NEXT ONE! CAN EVERYBODY BE LUCKY AS WE WERE?! WE WERE JUST IN THE MIDDLE OF THE TURN LINE IN MIDDLE OF THE STREET , SO OTHER CARS WERE AROUND US I CAN NOT IMAGINE WHAT COULD HAPPENED  IF I WAS IN FREEWAY OR IF MY WIFE WAS ALONE!? *TR",
        "vin": "KNADC123526"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/27/2010",
        "dateOfIncident": "09/23/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357878,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVE SIDE DOOR WILL NOT UNLOCK, AND THEREFORE, WILL NOT OPEN. *TR",
        "vin": "KNADC123826"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/01/2010",
        "dateOfIncident": "08/03/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353386,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA RIO. WHILE THE CONTACT WAS DRIVING APPROXIMATELY 2-5 MPH IN THE RESIDENCE DRIVEWAY, THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER WHERE THEY INFORMED THAT THE FAILURE WAS RELATED TO THE TIMING BELT. THE TECHNICIAN ADVISED THAT THE ENGINE WOULD NEED TO BE REPLACED. ALSO, PREVIOUSLY THE SPARK PLUGS, AND CRANK SHAFT POSITION SENSOR WERE REPLACED BY THE DEALER. THE VEHICLE HAD NOT BEEN REPAIRED AT THE TIME OF THE COMPLIANT. THE FAILURE MILEAGE WAS 103,000.       UPDATED 01/14/11 *BF   UPDATED 03/01/11  UPDATED 04/1511",
        "vin": "KNADC123026"
    },
    {
        "components": "SEAT BELTS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/10/2010",
        "dateOfIncident": "02/16/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348559,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA RIO. THE CONTACT STATED THAT THE DRIVER SIDE FRONT SEAT BELT WOULD NOT BUCKLE AND THE PASSENGER SIDE  FRONT SEAT BELT ANCHOR FELL APART. THE DRIVER SIDE FRONT DOOR LOCK WOULD NOT UNLOCK WITH THE KEY OR FROM THE INSIDE OF THE DOOR.  KIA WAS CONTACTED AND STATED THAT THERE WAS NOTHING THEY COULD DO.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 175,000. THE CURRENT MILEAGE WAS APPROXIMATELY 182,000. THE VIN WAS UNKNOWN.  UPDATED 11/05/10. *LJ",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/22/2009",
        "dateOfIncident": "10/20/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289413,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "T PROPORTIONING VALVE IS LEAKING ON MY 2002 KIA, LOOSING ALL BRAKE FLUID.  KIA DEALER SAID THIS IS A COMMON PROBLEM THEY CAN REPAIR FOR $230.00.  THE PROPORTIONING VALVE SHOULD NOT FAIL ON ANY CAR.  HAS THIS BEEN REPORTED BEFORE?  I FEEL THIS SHOULD BE A WARRANTY ITEM AND  POSSIBLY A DEALER RECALL,  WHAT CAN YOU TELL ME? *TR",
        "vin": "KNADC123826"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2009",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277906,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MY DAUGHTER WAS DRIVING HER 2002 KIA RIO, ALL OF A SUDDEN THE CAR JUST STOPPED RUNNING AND WOULD NOT START UP. THERE WAS NO PRIOR INDICATION THAT ANYTHING WAS WRONG - NO LIGHT OR INDICATORS ON. HAD IT TOWED TO OUR MECHANIC - ENGINE WAS LOCKED UP. HE DIDN'T KNOW FOR SURE WHY - OIL AND COOLANT WERE FINE. WE DIDN'T WANT TO PAY TO HAVE THE REASON DIAGNOSED, AS IT DOESN'T REALLY MATTER WHAT CAUSED IT - THE MOTOR IS SHOT. THIS CAR HAS BEEN REGULARLY MAINTAINED - OIL CHANGE EVERY 3000 MILES, REGULAR SERVICE AS RECOMMENDED IN THE BOOK. WE HAD TO HAVE THE TRANSMISSION REPLACED TWO YEARS AGO, AS IT JUST DECIDED TO DIE ALSO. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/12/2009",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268470,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA RIO 2002 THE CHECK ENGINE LIGHT WILL NOT GO OUT I TOOK IT TO GET CHECK OUT.EVERYTHING IS FINE.THERE IS NOTHING WRONG.THEY RESET THE CHECK ENGINE LIGHT AND IT CAME BACK ON.I WAS TOLD BUY A KIA DEALER SHIP IT IS A MANUFACTURER DEFECT. AND NOTHING CAN BE DONE.THIS IS BEEN GOING ON FOR FOUR YEARS NOW. I HAVE TO GET THE CHECK EVERY TIME THE INSPECTION IS DO AND HAVE THE LIGHT RESET. SO I CAN PASS THE INSPECTION. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/14/2008",
        "dateOfIncident": "08/12/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238342,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR BEGAN TO RUN HOT WHEN I WOULD BE BRIEFLY STOPPED FOR INSTANCE IN A DRIVE THROUGH RESTAURANT OR A LONGER TRAFFIC LIGHT. ONCE THE CAR BEGAN TO MOVE THE CAR COOLED DOWN. I HAD A MECHANIC FRIEND DO A TUNE UP ON MY CAR. HE SAID THE FAN HAS NO BLADES THEY HAVE DISINTEGRATED. THIS WAS OF CONCERN DUE TO THE FACT THERE HAS BEEN NO INJURY TO MY CAR SUCH AS AN ANIMAL IN THE ENGINE. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/08/2008",
        "dateOfIncident": "08/08/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237428,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING AT 80KM AN HOUR IN PEAK FRIDAY AFTERNOON TRAFFIC ON THE HIGHWAY I REAR ENDED ANOTHER CAR AND MY AIRBAG DID NOT DEPLOY.  *TR",
        "vin": "KNADC243226"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/22/2008",
        "dateOfIncident": "12/10/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228660,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ORIGINAL OWNER OF 2002 KIA RIO - TIMING BELT FAILED AT 93,000 MILES CAUSING TOTAL ENGINE FAILURE (INTERFERENCE ENGINE).  TIMING BELT IS COVERED UNDER WARRANTY FOR 100,000 MILES FOR ORIGINAL OWNER ACCORDING TO THE MANUAL.  KIA WOULD NOT HONOR WARRANTY.  SEVERAL THOUSAND DOLLARS LATER, I HAD A REPLACEMENT ENGINE INSTALLED.  IT FAILED 2,300 MILES LATER DUE TO THE CAMSHAFT SHEARING AND THE INTERFERENCE PROBLEMS.  AGAIN, NOT COVERED UNDER WARRANTY.   *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/19/2008",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228237,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR PULLS HARD TO THE RIGHT WHEN I PRESS THE GAS PEDAL AND I HAVE TO TURN THE STEERING WHEEL TO THE LEFT TO COMPENSATE FOR THAT. AS SOON AS I PULL MY FOOT FROM THE GAS PEDAL, THE CAR IMMEDIATELY GOES TO THE LEFT AND I HAVE TO BRING THE STEERING WHEEL TO THE NORMAL POSITION. THIS HAPPENS 100% OF THE TIME. I FEEL THIS IS A POTENTIALLY DANGEROUS SITUATION SINCE I HAVE TO PAY CLOSE ATTENTION TO THE TIMING IN ORDER TO KEEP THE CAR STRAIGHT AT HIGHER SPEEDS.     I AM THE FIRST OWNER OF THE CAR AND THE CAR WAS PROPERLY MAINTAINED BY MY LOCAL MECHANIC (I HAVE RECORDS OF EVEN OIL CHANGES) AND EVEN AFTER ALIGNMENT AND TIRE CHANGE FOR THE PROBLEM BY A KIA DEALER, THE PROBLEM IS STILL THERE.     I'VE BEEN TO 2 DIFFERENT  KIA DEALERS AND I WAS TOLD THIS IS A \"NORMAL\" SITUATION IN THESE KINDS OF CARS AND IT HAPPENS TO \"ALL OF THEM AT HIGH MILEAGE\". I ALSO TRIED TO REACH THE REGIONAL OFFICE AND AFTER NUMEROUS PHONE CALLS I DIDN'T GET A RESPONSE FROM THERE YET.     THE CAR IS AT 98,000 MILES AND I'VE HAD THE PROBLEM FOR ABOUT MORE THAN 3 MONTHS. I BELIEVE KIA EITHER SHOULD HONOR THEIR 100K MILE WARRANTY OR IF IT IS HAPPENING TO \"ALL OF THEM\" AND IT IS \"NORMAL\" THEY SHOULD MOVE THEIR OFFICIAL WARRANTY LOWER (FOR EXAMPLE 80K MILES ETC.) OR THEY SHOULD WARN THE CONSUMER ABOUT THIS \"NORMAL\" SITUATION WITH BIG LETTERS IN THEIR ADVERTISEMENTS AND MANUALS.  *TR",
        "vin": "KNADC123626"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/26/2007",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210004,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TAKEN MY 2002 KIA RIO TO A CERTIFIED REPUTABLE MECHANIC.  HIS DETERMINATION OF THE FAULTY ENGINE WAS DUE TO THE FACT OF A INFERIOR TIMING BELT.  HIS STATEMENT WAS THAT THE TIMING BELT GAVE OUT AND THE ENGINE IS DESIGNED SO THAT BASICALLY WHEN THIS HAPPENS THE CRANKSHAFT AND VALVES RUIN ITSELF DUE TO THE BROKEN TIMING BELT.  THIS HAPPENING LEAVES ME WITH BASICALLY A $2,000 DOLLAR LOSS ALL BECAUSE OF MAYBE A $100 PART.  *TR",
        "vin": "KNADC123826"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/12/2007",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10208669,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR KIA RIO WAS INVOLVED IN A FRONT END COLLISION WHERE THE AIR BAGS FAILED TO DEPLOY AT OVER 40 MILES AN HOUR. IT'S BY THE GRACE OF GOD WE DIDN'T FIND THIS OUT IN A FASTER COLLISION COSTING SOMEONE THEIR LIFE.  *TR",
        "vin": "KNADC123326"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/31/2007",
        "dateOfIncident": "08/10/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201309,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL LINE FROM REAR OF BRAKE SWITCH IS SHORT IN LENGTH AND UNSECURED RESULTING IN WIRE DAMAGE THAT SHORTS  ELECTRICAL FUSE TO SWITCH. RESULTS IN BRAKE LIGHT FAILURE AND POSSIBLE REAR END COLLISION DUE TO NO BRAKE LIGHTS. NEW SWITCH FROM FACTORY WAS INSTALLED BY KIA DEALERSHIP- BUT PROBLEM PERSISTS. THE VEHICLE IS A 2002 KIA RIO CINCO. I'M WORRIED FOR MY FAMILY'S AND OTHERS SAFETY. THIS IS A DESIGN DEFECT, THAT I FEEL THE CONSUMER SHOULD NOT HAVE TO BEAR THE EXPENSE.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/21/2007",
        "dateOfIncident": "07/21/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197119,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REFER TO NHTSA CAMPAIGN NUMBER: 04V179000  IN JANUARY 2007, I TOOK MY VEHICLE (2002 KIA RIO)  TO RAY CARTER KIA DEALERSHIP AT 6373 BLANDING BLVD, JACKSONVILLE, FL 32244, BECAUSE THE ENGINE WOULD NOT IDLE AND WOULD SOMETIMES CUT OFF DURING ACCELERATION.  THE SERVICE TECH TOLD ME I NEEDED THE 60,000 MILE MAINTENANCE SERVICE WHICH INCLUDED REPLACING THE TIMING BELT, OIL CHANGE, TIRE BALANCE, THROTTLE CLEANING, FUEL ADDITIVE, FRONT AND REAR AXLE OIL, TRANSFER CASE OIL, ETC ETC AND A WHOLE HOST OF OTHER NON-ENGINE RELATED INSPECTIONS.  THIS WAS AT A COST OF $759.65.  I LEFT THE DEALERSHIP BELIEVING IT WAS FIXED, HOWEVER, THE SAME PROBLEM KEPT RETURNING.  TODAY, 21 JULY 2007, I WENT BACK TO RAY CARTER KIA FOR THE SAME PROBLEM AND THEY PERFORMED AN OIL AND FILTER CHANGE, TIRE PRESSURE ADJUSTMENT AND TOPPED OFF FLUIDS AT A COST OF $77.75.  THEN THEY TOLD ME I NEEDED A NEW IDLE CONTROL SOLENOID AT A COST OF $573.74.  I ASKED THEM ABOUT THE $759 I PAID BACK IN JANUARY TO FIX THE SAME PROBLEM AND ALL THEY SAID WAS IT WAS FOR THE 60,000 MILE CHECKUP.  OF NOTE, DURING THIS VISIT, THE SERVICE MANAGER  MENTIONED SOMETHING ABOUT A RECALL FOR THE KIA RIO'S FUEL SYSTEM/GASOLINE DELIVERY.  WHEN I GOT HOME I LOOKED UP THE RECALL ON THE INTERNET AND FOUND IT ALONG WITH THIS SITE OF COURSE.  WHAT DO I NEED TO DO IN ORDER TO GET THE FUEL SYSTEM/GASOLINE DELIVERY SYSTEM REPLACED IAW THE RECALL?  I ALSO BELIEVE I AM ENTITLED TO THE MONIES I PAID FOR SERVICES NOT RENDERED.  *TR",
        "vin": "KNADC163726"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/18/2007",
        "dateOfIncident": "07/14/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10196679,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA RIO CINCO.  ON JULY 14, 2004, WHILE DRIVING 35 MPH, ANOTHER VEHICLE RAN A STOP SIGN AND CRASHED HEAD ON INTO THE CONTACT'S VEHICLE.  THE AIR BAGS FAILED TO DEPLOY.  SHE SUSTAINED PERMANENT INJURIES TO HER OCCIPITAL NEURALGIA FROM SNAPPING HER HEAD FORWARD.  A SPEC SCAN SHOWED THAT SHE RECEIVED SOME BRAIN DAMAGE, LOWER BACK HERNIATION, A TEAR IN THE ROTATOR CUP, PAIN IN HER RIGHT LEG, AND NEUTRAL HERNIA IN HER CHEST WHERE THE SEAT BELT RETRACTED.  THE VEHICLE SUSTAINED FRONT END DAMAGE TO THE RADIATOR, THE COMPRESSOR, THE HOOD, AND THE FRONT AXLE.  A POLICE REPORT WAS FILED.  THE PURCHASE DATE AND THE CURRENT MILEAGE WERE UNKNOWN.  UPDATED 09/24/07.8JB",
        "vin": "KNADC163426"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2007",
        "dateOfIncident": "05/23/2007",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10191739,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA RIO, PURCHASED NEW AND MAINTAINED IN EXCELLENT CONDITION WITH REGULAR MAINTENANCE. HAD 61,000 MILES AND WHILE DRIVING, MY DAUGHTER SMELLED SOMETHING BURNING, ENGINE LIGHT CAME ON AND AT THE SAME TIME, SMOKE WAS COMING IN THROUGH THE AIR VENTS.  SHE IMMEDIATELY PULLED OVER, STOPPED THE CAR AND REMOVED HER KEYS.  THE IGNITION STARTED ON ITS OWN AND THE CAR ENGINE ERUPTED INTO FLAMES. THE CAR IS TOTALLY DESTROYED.  FIRE AND HIGHWAY PATROL REPORTS WERE TAKEN AT THE SCENE AND CAR WAS TOWED TO KIA DEALERSHIP IN CLOVIS CA.  SERVICE MANAGER STATED HE HAD TAKEN PICTURES AND BECAME INVESTIGATION. WHEN I WENT IN TO SEE THE CAR AND TAKE PICTURES, THE SERVICE TEAM WAS COMPLETELY APATHETIC AND RUDE.  I MADE A CALL TO KIA CONSUMER AFFAIRS, AND FOUND THAT THE REPORT HAD NOT BEEN SUBMITTED.  THE INDIVIDUAL AT KIA CONSUMER AFFAIRS WAS EXTREMELY HELPFUL AND ATTEMPTED TO CALL THE DEALERSHIP AS WELL.  HER CALLS WERE NOT RETURNED.  MY DAUGHTER WAS EXTREMELY LUCKY AND ONLY SUFFERED FIRST DEGREE BURNS TO THE FACE, AND SMOKE INHALATION THAT EXACERBATED HER ASTHMA.    ACCORDING TO THE FIRE INVESTIGATOR, THE FIRE WAS CAUSED BY AN OVER-FILLING OF TRANSMISSION FLUID BY 1 QUART. THE CONSUMER STATED WHEN SHE SAW THE VEHICLE THE DAY AFTER, THERE WAS NO FLUID ANYWHERE.  THE CONSUMER BELIEVED THERE WAS A DEFECT WITH THE VEHICLE POSSIBLY RELATED TO A RECALL, WHICH WAS SUPPOSEDLY HAD BEEN TAKEN CARE OF AT THE DEALERSHIP.  *JB  UPDATED 06/21/07. *JB",
        "vin": "KNADC123826"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2007",
        "dateOfIncident": "05/17/2007",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191423,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KIA RIO.  THE CONTACT SMELLED SOMETHING BURNING AND NOTICED THE VEHICLE WAS ON FIRE WHILE PARKED.  THE FIRE WAS CONTAINED TO UNDERNEATH THE HOOD AND WAS EXTINGUISHED BY THE CONTACT.  THE VEHICLE WAS DESTROYED.  NO POLICE REPORT WAS FILED.  THE VEHICLE WAS NOT DIAGNOSED BY THE DEALER/MANUFACTURER.  THE PURCHASE DATE AND ENGINE SIZE WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 60,000.",
        "vin": "KNADC123928"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/26/2007",
        "dateOfIncident": "08/15/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186189,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SEAT BELTS HAVE SHREADED AT THE BASE OF THE SEAT BELT.  I HAD THE BELTS REPLACED BY AN INDEPENDENT MECHANIC, I WAS ADVISED THAT IT WASNOT A WARRANTY ITEM, AND HE DETERMINED THAT THE BELTS WILL CONTINUE TO SHRED DUE TO A DESIGN FLAW THAT HAS THE RETRACTOR AT AN ANGLE AND THE TEETH OF THE RETRACTOR ARE CATCHING THE BELT.  THE ONLY WAY TO KNOW THAT THE BELT SHREADED  WAS TO PULL IT OUT ALL OF THE WAY.  WE HAVE A BELT OUT OF ANOTHER KIA RIO THAT HAS ALSO STARTED SHREDDING.  KIA ADVISED THAT IT WAS NOT A WARRANTY ISSUE AND THAT AT SOME POINT AND TIME THE OWNER MUST TAKE CARE OF ITEMS SUCH AS THIS.  THEY FELT THAT IT  WAS FROM USAGE.  WE HAVE CHECKED THE DRIVERS SEAT BELT, AND IT SHOWED NO SIGNS OF SHREADING AND IT  GOTB MORE USE THAN THE BACK SEAT BELTS.  PARENTS NEED TO KNOW TO CHECK THESE BELTS BEFORE THEY GIVE AWAY DURING AN ACCIDENT.*AK",
        "vin": "KNADC123726"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "03/20/2007",
        "dateOfIncident": "03/16/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185609,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT OWNS A 2002 KIA RIO.  WHILE DRIVING AT 35 MPH THE VEHICLE STALLED AND THE ENGINE LOST POWER.  THE STEERING, THE BRAKES AND THE EMERGENCY BRAKE WERE LOCKED, THE CONTACT WAS UNABLE TO STEER THE VEHICLE OR STOP IT WHICH CAUSED A CRASH WITH A VAN.  THE FAILURE MILEAGE WAS 77,000.  THERE WERE NO INJURIES.  THE VEHICLE WAS REPAIRED THREE TIMES DUE TO THE FAILURE.  THE MECHANIC STATED THAT THE FAILURE WAS DUE TO THE FUEL INJECTION  SYSTEM, AND LATER  CLAIMED  IT WAS THE TIMING BELT.  THE CONTACT EXPERIENCED THE FAILURE AFTER THE VEHICLE WAS REPAIRED.  ALL OF THE REPAIRS WERE AT COST TO THE CONTACT.  THE DEALER STATED THERE WERE NO RECALLS FOR THIS YEAR, MAKE AND MODEL.  ADVISED THE CONTACT OF NHTSA RECALL#04V179000: FUEL SYSTEM, GASOLINE:DELIVERY.  THE CURRENT MILEAGE WAS 78,000.  *AK  CUSTOMER DID RECEIVE A RECALL LETTER IN THE MAIL.  UPDATED 4/9 *TR",
        "vin": "KNADC123926"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/07/2006",
        "dateOfIncident": "12/05/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175465,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA RIO - TIMING BELT FAILURE CAUSES ENTIRE AND INSTANTANEOUS ENGINE LOSS - CAR COMES TO HALT IN ROADWAY UNEXPECTEDLY.  TIMING BELTS ARE COVERED UNDER KIA'S 100,000 MILE POWERTRAIN WARRANTY, BUT THEY DO NOT HONOR THEIR WARRANTY FOR THIS PROBLEM.  *NM",
        "vin": "KNADC123026"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/02/2006",
        "dateOfIncident": "11/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164234,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE VEHICLE STALLED ON A SEMIFREQUENT BASIS, EVERY SIX MONTHS.  THE VEHICLE WAS TAKEN TWO DEALERSHIPS WHO HAVE BEEN UNABLE TO REPAIR THE VEHICLE.  THE CONTACT REFERENCE A RECALL ON  ENGINE STALLING HOWEVER A RECALL NUMBER WAS NOT IDENTIFIED.  THE CONTACT IDENTIFIED THE VEHICLE AS UNRELIABLE, AND UNSAFE TO DRIVE.",
        "vin": "KNADC123426"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/10/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162014,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING HOME AND CAR SHUTTERED THEN DIED. COULD NOT RESTART. TOOK TO MECHANIC AND WE WERE TOLD THAT IT WAS A ROD THROWN. IT HAS LESS THEN 73,000 MILES.  *NM",
        "vin": "KNADC123426"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/03/2006",
        "dateOfIncident": "06/03/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158922,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE BUYING THIS CAR IN 2002 IT HAS STALLED SEVERAL TIMES AND BEEN TAKEN TO THE DEALERSHIP AS OFTEN WITHOUT THE ISSUE BEING RESOLVED.  DEALER STATED THAT THEY COULD NOT FIND THE PROBLEM (THEY CLEANED THE THROTTLE BODY) AND HAD ANOTHER CLIENT'S CAR THAT DID THE SAME THING AND COULDN'T FIX IT EITHER.  WE HAVE USED FUEL INJECTOR CLEANER, WHICH WORKED FOR 6 MONTHS UNTIL NOW.  THIS CAR IS A LEMON AND IS DANGEROUS AT INTERSECTIONS AND ON THE HIGHWAY WHEN IT STALLS!!  LEMON LAW PAPERS WILL BE FILED IF NOT RESOLVED VERY SOON!!*JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/12/2006",
        "dateOfIncident": "05/09/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157410,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE APPROXIMATELY ONE YEAR AFTER PURCHASING MY 2002 KIA RIO, I HAVE HAD ON-GOING TRANSMISSION PROBLEMS.  AT VARIOUS TIMES WHILE DRIVING THE TRANSMISSION 'SLAMS' INTO GEAR, OR SHUTTERS.  ALTHOUGH I HAVE BROUGHT THIS ISSUE TO THE ATTENTION OF THREE DIFFERENT DEALERSHIPS, AND KIA CORPORATE, THEY CLAIM THAT THERE IS NO ISSUE OR THAT THEY CAN NOT IDENTIFY THE PROBLEM.  THEY CLAIMED AT ONE POINT THAT THE TRANSMISSION FLUID WAS DIRTY (ALTHOUGH IT WAS WELL BELOW THE RECOMMENDED SERVICE MILEAGE), SO I HAD A THIRD PARTY SERVICE STATION PERFORM A COMPLETE TRANSMISSION FLUID/FILTER CHANGE.  HOWEVER, THE PROBLEM HAS CONTINUED, AND NOW A YEAR LATER THE DEALERSHIP IS AGAIN TELLING ME THAT IT IS THE FLUID - WHICH I HAVE NEVER HEARD AN ISSUE LIKE THIS BEING CAUSED BY FLUID, BUT IF THIS IS TRUE, THERE IS ANOTHER ISSUE IN THAT THE TRANSMISSION FLUID SHOULD NOT HAVE TO BE CHANGED EVERY 6-12 MONTHS.    I RECENTLY BROUGHT MY CAR TO A CERTIFIED MECHANIC, AND HE WAS ABLE TO IDENTIFY THE PROBLEM AS A TORQUE CONVERTER AND A TCC PREMATURELY ENGAGING, AS WELL AS A TRANSMISSION 'SHUTTER'.  HE PROVIDED ME WITH WRITTEN DOCUMENTATION OF THE ISSUE, AND I RETURNED TO THE DEALERSHIP.  AGAIN, THE DEALERSHIP SAID THERE WAS NO ISSUE AND THE SYMPTOMS ARE 'NORMAL'.    THIS VEHICLE IS A LEMON, AND I AM UNABLE TO OBTAIN PROPER SERVICE FROM KIA, AND I AM VERY CONCERNED THAT THE VEHICLE COULD BECOME A SAFETY HAZARD SHOULD THE SYMPTOMS CONTINUE TO GET WORSE, OR THE TRANSMISSION COMPLETELY FAIL WHILE DRIVING.  *JB",
        "vin": "KNADC123526"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2006",
        "dateOfIncident": "04/29/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156901,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON A RESIDENTIAL ROAD THE CAR BACK FIRED THEN THE ENGINE SEIZED UP, THE TIMING BELT WAS THE LIKELY CAUSE ACCORDING TO THE DEALER, BUT BECAUSE IT HAD 60,274 MILES THEY WOULD NOT COVER IT UNDER WARRANTY. THE SERVICE PERSON SAID THEY HAVE HAD AT LEAST SIX SIMILAR FAILURES IN THE LAST YEAR, A COUPLE WERE LESS THAN 59,000 MILES AND WERE COVERED. IN TALKING TO KIA DIRECT, THEY SAID BECAUSE WE BOUGHT THE CAR USED AND HAD NO SERVICE RECORD FROM BEFORE, NOTHING COULD BE DONE. IT'S CLEAR FROM THE NUMBER OF FAILURES THIS IS A DESIGN DEFECT. THE TIMING BELT FAILURE AND SUBSEQUENT ENGINE LOCKUP COULD CAUSE A FATALITY IF IT HAPPENED AT FREEWAY SPEEDS!  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/10/2006",
        "dateOfIncident": "03/25/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154924,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 KIA RIO CINCO'S TIMING-BELT BROKE AND CAUSED SERIOUS DAMAGE TO THE ENGINE RESULTING IN A $2500 FEE TO FIX THE VEHICLE.  BECAUSE MY TIMING-BELT WAS NOT CHANGED AT 60000 (WE HAVE 61000 MILES ON THE VEHICLE) THEY WOULD NOT HONOR THEIR WARRANTY.  I HAVE DONE RESEARCH ON THESE VEHICLES AND A LOT OF PEOPLE HAVE HAD PROBLEMS WITH THESE VEHICLES.   *JB",
        "vin": "KNADC163426"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/02/2006",
        "dateOfIncident": "01/10/2006",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149267,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AN ENGINE COMPARTMENT FIRE WAS DISCOVERED BY OTHER EMPLOYEES APPROXIMATELY 10-15 MINUTES AFTER I HAD PARKED THE VEHICLE AT WORK AND HAD ENTERED MY OFFICE.  THE WORKERS EXTINGUISHED THE FIRE WITH 8 PORTABLE FIRE EXTINGUISHERS.  THE DAMAGE WAS MOST SEVERE NEAR THE FIREWALL ON THE PASSENGER SIDE OF THE VEHICLE.  ALL HOSES HAD BURNED AWAY AND PLASTICS WERE MELTED OR BURNED.  A RECALL HAD BEEN ISSUED FOR A DEFECTIVE GASOLINE DISTRIBUTOR PART THAT COULD RESULT IN ENGINE COMPARTMENT FIRE. THE RECALL WORK WAS PERFORMED IN JULY, 2005 ACCORDING TO KIA OF CLARKSVILLE SERVICE DEPARTMENT. KIA OF CLARKSVILLE IS LOCATED IN CLARKSVILLE, IN.  *NM",
        "vin": "KNADC163526"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/27/2006",
        "dateOfIncident": "05/29/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148817,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ADV BRK SYS",
                "productMake": "ADV BRK SYS",
                "productModel": "ADV BRK SYS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AFTER HAVING THE BRAKES SERVICED I HEARD A PING NOISE WHEN I WOULD MAKE A RIGHT TURN.  AS I KEPT DRIVING THE VEHICLE AND THE NOISE WENT AWAY FOR ABOUT A WEEK.  WHEN THE NOISE RETURNED IT WAS MUCH WORSE AND WHEN I WOULD COME TO A STOP I COULD FEEL SOMETHING HITTING TOGETHER COULD FEEL IT TOO.  WHEN I TOOK THE TIRE OFF TO CHECK, THE PIN THAT HOLDS THE BRAKE SHOE ON WAS OUT ABOUT HALF WAY AND BENT.  I REPLACED THE PIN AND THE SAME THING HAPPENED A WEEK LATER.  THE MANUFACTURER CANNOT TELL ME ANY OTHER WAY TO FIX THE PROBLEM UNLESS I PAY TO GET IT FIXED.  AND THEIR ADVICE WAS TO JUST REPLACE THE ENTIRE BRAKE  SHOE.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/06/2006",
        "dateOfIncident": "01/05/2006",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147089,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING  THERE IS A LOUD NOISE. WHILE STOPPING, THE NOISE GETS LOUDER. THE VEHICLE WAS TAKEN TO A DEALERSHIP FOR INSPECTION. AND THEY DETERMINED THE BOLTS THAT CONNECT THE PIPES TO THE HEAT SHIELD AND THE EXHAUST SYSTEM BURNED OFF. ALSO, THE LUGS: NUTS  HAVE BEEN CHANGED FIVE TIMES BECAUSE THEY WERE CORRODED.  *AK",
        "vin": "KNADC163526"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "12/05/2005",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146405,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER 2002 RIO CINCO WITH LESS THAN 60,000 MILES , CAUGHT ON FIRE WHILE DRIVING .  *TS   *JB",
        "vin": "KNADC163726"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/06/2005",
        "dateOfIncident": "06/23/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10144595,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2002 KIA RIO ON MY LUNCH BREAK GOING TO MY HOME. A YOUNG LADY PULLED OUT IN FRONT OF ME I WAS GOING AROUND 45 WHEN SHE PULLED OUT. MY CAR HIT HERS IN THE SIDE NEITHER MY AIR BAGS OR SEAT BELT FUNCTIONED LIKE THEY SHOULD HAVE. MY AIR BAGS DIDN'T EVEN DEPLOY MY SEAT BELT ALLOWED ME TO GO INTO THE WINDSHIELD. AS MY BODY WAS THROWN FORWARD THE UNDERSIDE OF THE STEERING WHEEL BROKE MY FEMUR IN 3 PLACES. I FILLED A COMPLAINT AGAINST KIA ABOUT THE AIR BAGS AND SEAT BELT THEY CLAIMED THE CAR UNDER ROLLED THE OTHER CAR TO ME THE FRONT OF THE CAR WAS PUSHED BACK AND IT WAS FLAT. KIA NEEDS TO HOLD UP THEIR END 2 ITEMS IN THE CAR FOR SAFETY FAILED. SOME PEOPLE ASK DID YOU HAVE YOUR SEAT BELT ON THE ANSWER IS YES I HAD 2 PEOPLE SHOW UP AT THE WRECK AND SAW IT ON ME AND IT BURNED THROUGH 2 SHIRTS I HAD ON AT THE TIME OF THE WRECK.  *NM",
        "vin": "KNADC123926"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/06/2005",
        "dateOfIncident": "12/05/2005",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144610,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED WHILE  HUSBAND WAS DRIVING  THE CHECK ENGINE LIGHT ILLUMINATED. LESS THAN ONE MINUTE LATER THERE WAS BLACK SMOKE COMING FROM UNDER THE HOOD. HE GOT OUT OF THE VEHICLE AND SAW THAT  THE VEHICLE WAS ON FIRE. THE FIRE DEPARTMENT WAS CALLED TO  EXTINGUISH  THE FIRE.  THE VEHICLE WAS TOWED AND HAS NOT BEEN INSPECTED AT THIS TIME. THIS VEHICLE WAS REPAIRED UNDER NHTSA  RECALL  CAMPAIGN  04V179000 IN OCTOBER OF 2004 FOR THE FUEL  DISTRIBUTOR  AND FUEL TUBE ASSEMMBLIES. *AK",
        "vin": "KNADC163726"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/28/2005",
        "dateOfIncident": "11/23/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10143771,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HIT DEER AT 55 MPH AIRBAGS DID NOT DEPLOY AND SEAT BELT DID NOT LOCK CAUSING HEAD TO HIT STEERING WHEEL AND BOUNCE BACK AND HIT SEAT WHOLE FRONT OF CAR WAS TORE UP.  *JB",
        "vin": "KNADC123326"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/01/2005",
        "dateOfIncident": "02/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10141462,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:THE CONTACT'S VEHICLE WAS INVOLVED  IN TWO ACCIDENTS. UPON IMPACT,  THE AIRBAGS DID NOT DEPLOY. THE FIRST ACCIDENT OCCURRED ON FEBRUARY OF 2003 WHILE TRAVELING ABOUT 45 MPH. SHE WAS WEARING A SEAT BELT DURING THE ACCIDENT. THIS WAS A FRONTAL IMPACT. THE SECOND ACCIDENT OCCURRED ON SEPTEMBER 19, 2005 WHILE TRAVELING ABOUT 50 MPH. SHE WAS WEARING A SEAT BELT, BUT SUSTAINED  INJURIES. *AK UPDATED 01/19/06.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/20/2005",
        "dateOfIncident": "09/17/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140348,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS AT RANDOM TIMES.  WARM OR COLD DOES NOT MATTER.  HAPPENS ABOUT ONCE EVERY 8 MONTHS.  HAVE READ HUNDREDS OF SUCH COMPLAINS ON THE INTERNET, MOST SIMPLY DO NOT TAKE THE TIME TO POST WHERE IT MATTERS.   *NM",
        "vin": "KNADC123526"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137815,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  IN THE HIGH HUMIDITY OR RAIN THE REAR BRAKES LOCK. IT MAKES A SCRAPING AND SCRATCHING NOISE, WHEN THE BRAKES DRY OUT. THERE IS NO FOREWARNING; NOTICED THIS PROBLEM SINCE PURCHASING THE VEHICLE  ON SEPTEMBER 1, 2002.  HAVE CONTACTED  THREE DEALERS, AND A MANUFACTURER'S REPRESENTATIVE SAID THAT THIS WAS NORMAL. ONE DEALER DID REPLACED THE BRAKE LINES. *AK",
        "vin": "KNADC123526"
    },
    {
        "components": "PARKING BRAKE,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "06/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131673,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER PURCHASED TWO 2002 KIA RIOS, THE FIRST VEHICLE WAS FINE.  THE OTHER VEHICLE WITHIN 30 DAYS OF PURCHASE AT APPROXIMATELY 100 MILES,  DIED.  THIS DID NOT HAPPEN AT ANY CERTAIN SPEED.  THE VEHICLE HAS BEEN TAKEN INTO THE DEALERSHIP OVER 14 TIMES AND THEY HAVE NOT REPLACED ANYTHING .  THEY HAVE REPROGRAMMED THE COMPUTER NUMEROUS TIMES.  THE VEHICLE WILL WORK FOR AWHILE, NO SPECIFIC TIME, AND THEN DIE AGAIN.  CONSUMER'S DAUGHTER ACTUALLY DROVE VEHICLE WHICH WAS LOCATED IN SOUTH CAROLINA.*AK  THE VISOR WAS REPLACED. THE INTERIOR LIGHT WOULD NOT GO OFF, THE DEALER STATED IT WAS A PINCHED WIRE. THE LIFTGATE LATCH WAS REPLACED AND THE PARKING BRAKE WAS ADJUSTED. *JB",
        "vin": "KNADC163326"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/17/2005",
        "dateOfIncident": "05/23/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133166,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "NATIONAL TIRE",
                "productMake": "NATIONAL",
                "productModel": "311150R15LT",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT:  THE CONSUMER STATESDTHE TIRES WERE PURCHASED ON APRIL 23, 2005.  THEY SPLIT IN HALF AND CHUNKS WERECOMING OUT OF THE TIRES.  ALL FOUR OF  THE TIRES WERE HAVING THIS PROBLEM.  WIRE WAS COMING OUT OF THE TIRES.  THE AIR PRESSURE IWAS CHECKED.  THE SHOCKS AND STRUTS HAVE BEEN CHECKED TO MAKE SURE THIS WAS NOT THE PROBLEM.  THESE TIRES STARTED FALLING APART AT APPROXIMATELY 1,000 MILES.*AK",
        "vin": "KNADC123326"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "07/26/2005",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10130095,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING SOUTH ON HWY 360 IN GRAND PRAIRIE TEXAS GOING ABOUT 50 MPH AND AN OTHER VEHICLE WAS CROSSING THE LANES TOWARD HER AND HIT HER VEHICLE AT THE FRONT RIGHT SIDE (PASSENGER SIDE). SHE WAS WEARING A SEAT BELT AND SO WAS THE PASSENGER.THE SEATBELT ON THE PASSENGER SIDE DID NOT WORK AND AIRBAGS ON NEITHER SIDE DEPLOYED.  THE PASSENGER WENT FORWARD STRIKING THE FRONT WINDSHIELD SUFFERING HEAD AND BODY INJURIES.",
        "vin": "KNADC123826"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "06/28/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126905,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NO ACCIDENT YET ON THIS DEFECT.      WE HAVE NOTICED OVER THE PAST 2 YEARS OF DRIVING THIS VEHICLE A SERIOUS DEFECT IN THE WAY THE DASH IS CONSTRUCTED THAT SERIOUSLY OBSTUCTS BOTH VIEWING OF THE ROAD THROUGH THE WINDSHIELD BY THE DRIVER AND VIEWING THE DASH INSTRUMENTATION (SPEEDOMETER, ETC) VIRTUALLY IMPOSSIBLE UNDER NORMAL DRIVING CONDITIONS.    ON A SUNY DAY, THE BLACK PLASTIC MATERIAL USED IN THE DASH CONSTRUCTION AROUND THE INSTRUMENT PANEL IS SO REFLECTIVE, THAT OFTEN WITH THE SUN COMING IN THROUGH THE REAR OR A SIDE WINDOW, IT BECOMES IMPOSSIBLE TO SEE THE INSTRUMENTATION IN THE DASH DUE TO REFLECTIVE GLARE OFF THE BLACK PLASTIC IN FRONT OF THE CLEAR PLASTIC THAT COVERS THE SPEEDOMETER, ETC.  IT IS SO BAD THAT OCCASIONALLY WE HAVE TO PUT A PIECE OF PAPER OR ANOTHER NON-REFLECTIVE OBJECT BEHIND THE STEERING WHEEL AND IN FRONT OF THE SPEEDOMETER IN ORDER TO READ THE INSTRUMENTATION.    EVEN MORE DISTURBING IS THE SAME PHENOMENON WHEN THE SUN IS STREAMING INTO THE CAR, PARTICULARLY FROM THE FRONT OR A SIDE WINDOW, THAT THE REFLECTION OFF OF THE BLACK PLASTIC ONTO THE INSIDE OF THE WINDSHIELD IS SO BAD THAT WE OFTEN CANNOT SEE OUT OF THE WINDSHIELD WITHOUT PUTTING A PIECE OF PAPER OR SOME OTHER SUBSTANCE DOWN TO CUT THE GLARE DOWN.    THIS IS AN EXTREMELY DANGEROUS SITUATION, AND IT'S ONLY A MATTER OF TIME BEFORE SOMETHING SERIOUS HAPPENS AS A RESULT OF BEING UNABLE TO SEE CLEARLY.",
        "vin": "KNADC123X26"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/26/2005",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126598,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 1.5 YEARS AGO I WAS HAVING A PROBLEM WITH THE CAR HESITATING ON THE HIGHWAY AND THE CHECK ENGINE LIGHT COMING ON. I BROUGHT MY CAR TO THE KIA DEALERSHIP (HAMILTON, ON) FOR DIAGNOSIS AND THEY DIAGNOSED THE PROBLEM AS BEING THE MASS AIRFLOW SENSOR. I HAD THEM REPLACE THE SENSOR (250$CAD) AND DO A 300$ TUNE UP ON THE CAR. TWO DAYS LATER THE CHECK ENGINE LIGHT CAME BACK ON AND I BROUGHT IN BACK TO THE DEALER. BY THE TIME I HAD THE CAR AT THE DEALER THE LIGHT HAD GONE OFF AND THEY SAID TO BRING IT BACK WHEN IT WAS ON. FINALLY AFTER A NUMBER OF VISITS THEY DETERMINED THAT THE ECM NEEDED A FLASH. THEY FLASHED THE ECM AND THE CAR SEEMED FINE. APPROX 3 WEEKS AGO THE CAR STARTED HESITATING AGAIN AND I BROUGHT IT BACK TO THE DEALER. THEY FOUND A BULLETIN FROM KIA THAT STATED A PROBLEM WITH CERTAIN KIA'S (WHICH MINE FELL UNDER) WHERE THE ECM WOULD INCORRECTLY INTERPRET RESULTS FROM THE MASS AIRFLOW SENSOR AND TURN ON THE CHECK ENGINE LIGHT. THEY DIAGNOSED THE PROBLEM AS BEING THE ECM AND REPLACED IT, BUT THE PROBLEM REMAINED. THEY FINALLY FOUND THAT THE PROBLEM WAS THE REAR CATALYTIC CONVERTER. THE PROBLEM IS THAT THE INCORRECT READING FROM THE ECM WOULD HAVE MADE THE CAR SEND UNSPENT FUEL THROUGH THE SYSTEM AND INTO THE CATALYTIC CONVERTER THEREBY CAUSING THE CATALYTIC CONVERTER TO FAIL.",
        "vin": "KNADC163X26"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/06/2005",
        "dateOfIncident": "06/06/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124375,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA RIO STALLING DURING DRIVING, CHECK ENGINE LIGHT ON, CONCERNED FOR MY SAFETY.  THREE TIME COMPLIANT TO EL CAJON MAZDA KIA, FIRST TIME THEY SAID(NOTHING WRONG) 2ND (THE COMPUTER NEED REPROGRAM) TODAY AGAIN BACK TO DEALER, I AM AFRAID FOR MY SAFETY",
        "vin": "KNADC123126"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "05/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ST: 8TH OF 2004 THE BATTERY STARTED TO DIE,\\.  DEALER TOLD CALLER TO SHUT THE ALARM SYSTEM OFF WHEN NOT DRIVING. VEHICLE BATTERY WAS CHECKED BY KIA, AND REPORTED NO PROBLEMS WITH BATTERY.  HOWEVER,   BATTERY  HAD TO BE CHARGED NUMEROUS TIMES IN DRIVEWAY.  ON MAY 2005 THE LOCKS BEGAN TO GO ON AND OFF, AND ALL LIGHTS CAME ON THE DASH. TOOK THE CAR TO DEALER, WHO CHECKED THE BATTERY, BUT DEALER REPORTED THE CAR NEEDED A NEW BATTERY. 05/05/05 AS CONTACT WAS DRIVING ON A MAIN ROAD AND ALL SENSOR LIGHTS CAME ON, AND LOCKS CAME ON AND OFF, AND CAR SHUT OFF. AFTER RESTARTING VEHICLE WAS TAKEN TO DEALER AGAIN FOR REPAIR.*AK",
        "vin": "KNAGD128225"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/18/2005",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10118901,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FAXED FOIA REQUEST A COPY OF THE ENTIRE FILE FROM THE NHTSA INVESTIGATION INTO THE ALLEGED DEFECT RE THE AIR BAG SYSTEM OF THE 2002 KIA RIO, ATTY REPRESENT DRIVER OF A 2002 KIA RIO INJURIED WHEN HER AIR BAGS DID NOT DEPLOY.***NO ANSWER REQUIRED***. *MR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/03/2005",
        "dateOfIncident": "12/16/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116284,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE KIA RIO WAS STOPPED BEHIND A MINIVAN WHEN IT WAS HIT FROM BEHIND BY ANOTHER MINIVAN TRAVELLING APPROXIMATELY 30 MPH BEFORE BRAKING.  THE KIA RIO WAS PUSHED INTO THE MINIVAN IN FRONT.  THE RIO WAS NOT SEVERELY DAMAGED, HOWEVER, BOTH AIRBAGS DEPLOYED.  DAMAGE WAS TO THE REAR TRUNK LID AND THE FRONT RIGHT RAIL WAS SLIGHTLY . COMPROMISED.  NO LIGHTS WERE BROKEN, NOR WAS THE BUMPER EVEN CRACKED.  BOTH THE INSURANCE ADJUSTER AND THE BODY SHOP WERE SURPRISED THE AIRBAGS WENT OFF BASED ON THE DAMAGE (OR OVERALL LACK THEREOF) TO THE VEHICLE.  THE AIRBAG DEPLOYMENT BROKE OTHER PIECES OF AND INSIDE OF THE DASH AS WELL, CAUSING OVER 2/3 OF THE COST OF REPAIR (TOTAL COST WAS AROUND $7000).      PICTURES OF THE DAMAGE TO THE VEHICLE ARE AVAILABLE.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/28/2005",
        "dateOfIncident": "02/21/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115931,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 KIA RIO WITH APPROX. 51,000 MILES.  THE CAR SUDDENLY BROKE DOWN AND WOULD NOT START.  I HAD THE CAR TOWED TO THE DEALERSHIP WHO TOLD ME THE ENGINE HAD SEIZED DUE TO SLUDGE IN THE OIL SYSTEM.  I PROVIDED KIA WITH ALL THE OIL MAINTENANCE RECEIPTS EVERY 3000 MILES.  KIA'S RESPONSE WAS THAT THE OIL WAS NOT MAINTAINED PROPERLY AND THE MAINTENANCE RECORDS WERE FAKE.  BASICALLY, THEY SAY THAT I AND A CERTIFIED MECHANIC (OWNER OF A AUTO AND TOWING SHOP) ARE LIARS.  KIA WILL NOT PAY FOR THE ENGINE REPAIR AND I CANNOT AFFORD TO FIX A PROBLEM THAT WAS CAUSED BY AN ENGINE MALFUNCTION (OIL AND RECEIPTS WERE MAINTAINED PROPERLY).  IT HAS BEEN 1 MONTH AGO, I HAVE NO CAR AND SERIOUSLY AT RISK OF LOSING MY JOB DUE TO THIS PROBLEM AND KIA WILL NOT RECONSIDER ANY INFORMATION I PROVIDE.  *JB",
        "vin": "KNADC123526"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/26/2005",
        "dateOfIncident": "03/15/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114768,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASING THIS CAR IN NOV. 2001, IT HAS GIVEN ME NUMEROUS PROBLEMS.  I HAVE HAD THE STRUTS REPLACED UNDER WARRANTY FOR LEAKING OIL, IT HAS STALLED MORE TIMES THAN I CAN COUNT, CAUSING CONCERNS ABOUT MY AND MY FAMILY'S SAFETY,AND RECENTLY THE ENGINE CUT OFF WITHOUT WARNING WHILE EXITING THE FREEWAY.  THE ENGINE IS NOW FROZEN AND SINCE I'VE REACHED MY 60,000 MILE MARK, THE DEALERSHIP IS HESITANT TO FIX IT UNDER WARRANTY.  THIS IS TRULY AN EXPENSIVE LEMON.*AK",
        "vin": "KNADC123626"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/04/2005",
        "dateOfIncident": "03/04/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113501,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHOOK  UNCONTROLLABLY AND SWAYED  FROM  LEFT TO RIGHT WHILE DRIVING. DRIVER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE,  PULLED OVER, AND TURNED THE VEHICLE OFF.  THEN,  DRIVER RESTARTED THE VEHICLE, AND TRANSMISSION FAILED TO SHIFT OR MOVE ON ITS OWN.   VEHICLE WAS TOWED TO THE DEALER, AND  MECHANIC DETERMINED THAT THE FRAME WAS BEND, AND  TRANSMISSION HAD BLOWN  OUT,  AND NEEDED TO BE REPLACED.  *AK",
        "vin": "KNADC123326"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "11/19/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107272,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS EXPERIENCING PROBLEMS WITH THE FRONT BEARINGS, CAUSING THE WHEELS TO SEPARATE FROM THE AXLE. OWNER TOOK THE VEHICLE TO THE DEALER ON 4 OCCASIONS, BUT THE PROBLEM  STILL  REMAINED UNDETERMINED. OWNER STATED THAT THE DEALER TOLD HER THAT THE FRONT BEARINGS WERE FAULTY, AND THEY WERE REPLACED. CURRENTLY, THEY REPLACED THE FRONT RIGHT BEARINGS WHICH WERE REPAIRED PREVIOUSLY.  *AK  THE CONSUMER HEARD A LOUD BUZZING SOUND FROM THE LEFT SIDE OF THE VEHICLE.  THE SOUND WAS MORE PREVALENT WHEN THE CONSUMER ACCELERATED TO SPEEDS HIGHER THAN 50 MPH.  THE FRONT WHEEL BEARING WAS REPLACED.  THE CONSUMER WAS ON HER WAY HOME FROM THE REPAIR SHOP AND THE VEHICLE STOPPED.  AFTER THE CONSUMER INSPECTED THE VEHICLE SHE FOUND THE RIGHT TIRE DISCONNECTED FROM THE AXLE.  THE VEHICLE RESTED ON THE TIRE WHICH WAS 90 DEGREE ANGLE.  THE CONSUMER CONTACTED THE POLICE AND FIRE DEPARTMENT BECAUSE OIL AND TRANSMISSION FLUID WAS SEEPING OUT FROM UNDER THE VEHICLE.  AFTER THE VEHICLE WAS REPAIRED THE CONSUMER WAS ON HER WAY HOME AND HEARD A LOUD POP AS THE VEHICLE LOST POWER.  AFTER THE VEHICLE WAS REPAIRED THE CONSUMER TOOK IT BACK TO THE SERVICE DEPARTMENT BECAUSE IT WAS PULLING TO THE RIGHT AT SPEEDS OF 25 OR GREATER.  *TC  THE LOWER BALL JOINT WAS REPLACED.",
        "vin": "KNADC123126"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/07/2005",
        "dateOfIncident": "02/05/2005",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110985,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 40 MPH VEHICLE BEGAN TO SHAKE VIOLENTLY, AND THEN THE ENGINE FAILED.  DEALER STATED THEY COULD NOT FIX IT. *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/13/2005",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111066,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S CLUTCH HAS BEEN REPLACED THREE TIMES IN TWO YEARS.   *NM   THE TRANSMISSION DID NOT RESPOND TO THE ACCELERATION.  THE AXLE SEALS WERE LEAKING.   *SC    *JB",
        "vin": "KNADC163226"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/11/2005",
        "dateOfIncident": "12/15/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106100,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A 2002 KIA RIO CINCO ON NOVEMBER 30, 2004.  AFTER THREE WEEKS IT BEGAN TO EXPERIENCE A LOSS OF ACCELERATION WHILE DRIVING THE VEHICLE.  MAROONE KIA PELPACED A NUMBER OF THE BRAKE COMPONENTS ADFTER DECIDING THAT THE BRAKES WERE LOCKING UP.  THE DAY AFTER GETTING IT BACK THE SAME THING HAPPENED AGAIN.  THIS TIME THEY SAY THAT IT MUST BE THE TRANSMISSION, BUT SINCE IT IDS INTERMITTEN THEY CANNOT FIX IT.  THEIR ADVICE WAS TO DRIVE IT UNTIL IT \"TEARS UP\" AND THEN THEY CAN FIX IT.  MY DAUGHTER-IN-LAW USES THE VEHICLE TO TRANSPORT HER 3 MONTH OLD CHILD AND TO GET TO WORK.  THE VEHICLE ABRUPTLY SLOWING FROM HIGHWAY SPEEDS TO 25 MILES AN HOUR, AND NOT BEING ABLE TO MOVE FORWARD AFTER STOPPING  IS A SAFETY HAZARD.  *AK",
        "vin": "KNADC163826"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/11/2004",
        "dateOfIncident": "12/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102661,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE LAST MONTH MY CAR HAS STALLED OUT OVER TEN TIMES, USUALLY DURING HEAVY TRAFFIC.  I HAVE TAKEN IT TO THE DEALER THREE TIMES BUT THEY HAVE NOT BEEN ABLE TO DUPLICATE OR FIX THE PROBLEM.  ACCORDING TO THEM THE ENGINE LIGHT NEEDS TO BE ON; ONCE IT STALLED AND THE LIGHT CAME ON, I IMMEDIATELY DROVE IT TO THE DEALER BUT THE TECHNICIANS SAID IT WAS NOT ON WHEN THEY RESTARTED THE CAR.  THE CAR ALSO RUNS ROUGH AND FEELS LIKE IT LOSES POWER INTERMITTENTLY.  I HAVE LOST ALL CONFIDENCE IN THE CAR AND WORRY ABOUT WHERE AND WHEN IT MAY STALL OUT.  THE SERVICE PEOPLE HAVE BEEN VERY HELPFUL AND RESPECTFUL BUT THE PROBLEM HAS BECOME SO BAD I MAY NEED TO FILE LEMON LAW PAPERS. *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/01/2004",
        "dateOfIncident": "11/30/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100898,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE REPEATED STALLS IN THE MIDDLE OF TRAFFIC WHILE DRIVING, TOOK IT TO DEALER THE REPLACED HARNESS.  DURING A SUDDEN STOP VEHICLES CHECK ENGINE LIGHT CAME ON, TOOK IT TO DEALER CANNOT FIND ANYTHING WRONG WITH IT.  ONCE AGAIN CAR SHUTS OFF IN THE MIDDLE OF THE ROAD HAD THE CAR TOWED SPENT 24 HRS WITH DEALER, DEALER CANNOT FIND OUT THE PROBLEM DIAGNOSTIC TEST RUN AND CANNOT FIND ANYTHING WRONG WITH CAR.  TOOK THE CAR HOME TODAY, DEC 1, CAR SHUTS OFF AGAIN AND WILL NOT START.  CAR RUNS LIKE IT WANTS TO SHUT OFF",
        "vin": "KNADC163326"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/10/2004",
        "dateOfIncident": "10/26/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099759,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE DEALERSHIP PERFORMED  FUEL DISTRIBUTOR ASSEMBLY RECALL 04V179000  REPAIRS  VEHICLE IS CONSUMING EXCESSIVE GAS.*AK",
        "vin": "KNADC123926"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,WHEELS,SEATS",
        "crash": false,
        "dateComplaintFiled": "10/27/2004",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10099320,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER SMELLED A ROTTEN EGG ODOR COMING THROUGH THE VENTS.  THE CONSUMER INDICATED THAT THE SMELL WAS HYDROGEN SULFIDE (KIA RECALL SC034).  *BF     THE VEHICLE ALSO EXHIBITED DRIVER'S SEAT PROBLEMS , ENGINE PROBLEMS, THE ALLOY WHEELS RUSTED AND THE FRONT AND REAR BRAKES PROBLEMS.  *NM",
        "vin": "KNADC163526"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "10/12/2004",
        "dateOfIncident": "08/15/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096581,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER TOOK THE VEHICLE TO THE DEALER FOR THE SEAT BELTS WHICH WERE VERY LONG AND WILL NOT ADJUST. THE DEALER TOLD THE OWNER THAT THE MIDDLE SEAT BELTS WERE DESIGNED THAT WAY AND THAT THERE WAS NOTHING THEY CAN DO. PROVIDE FURTHER DETAILS.   *JB.......*AK",
        "vin": "KNADC123426"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "10/07/2004",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095445,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 10 MP AND TURNING THE VEHICLE STALLED. VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION , AND THE MECHANIC COULD  NOT DUPLICATE THE PROBLEM.   THE PASSENGER FRONT SEAT BELT WAS INOPERATIVE.   VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AGAIN,  AND THE MECHANIC REPLACED THE SEAT BELT.  HOWEVER, THE PROBLEM RECURRED.   THEN,  VEHICLE WAS INVOLVED IN A FRONTAL COLLISION AND BOTH FRONTAL  AIR BAGS FAILED TO DEPLOY.  THIS INFORMATION WAS PROVIDED BY MRS. SIKAKOY'S DAUGHTER LESLIE SANCHEZ.*AK",
        "vin": "KNADC123726"
    },
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/06/2004",
        "dateOfIncident": "03/15/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095272,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IF VEHICLE IS ON THE SLIGHTEST INCLINE THE TRUNK LID WILL COLLAPSE WHEN OPENED FULLY. ONCE WHEN THIS OCCURRED IT RENDERED  THE CONSUMER UNCONSCIOUS. DEALERSHIP  REPLACED THE TRUNK LID SPRING, BUT IT DIDN'T CORRECT THE PROBLEM. ALSO, AT 4000 MILES THE TRUCK IS HAVING PROBLEM WITH EXCESSIVE FRONT TIRE TREAD WEAR ON THE INSIDE ONLY.  AT 6000 MILES THE FRONT TIRES WERE REPLACED, AND A FRONT ALIGNMENT WAS PERFORMED. FRONT TIRE TREAD WORE OUT AGAIN AT 12000 MILES.  THE FACTORY REPRESENTATIVE  WAS CONTACTED, BUT DIDN'T PROVIDE ANY ASSISTANCE. THE FRONT TIRES WERE REPLACED AGAIN AT 20000 MILES WITH BRAND NEW 60000 MILES WEAR TIRES BUT THEY  HAVE WORN EXCESSIVELY AT 10,000 MILES. *AK",
        "vin": "KNADC123526"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/15/2004",
        "dateOfIncident": "09/09/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10092243,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CONSUMER LOST CONTROL OF THE VEHICLE. WHEN THE DRIVER TRIED CORRECT THE VEHICLE AND COME BACK ONTO THE HIGHWAY , THE VEHICLE ALMOST CRASHED INTO THE CONCRETE BARRIER. TO AVOID CRASHING INTO THE BARRIER THE DRIVER MADE A HARD TURN AND OVER CORRECTED. THIS RESULTED IN THE VEHICLE GOING OFF THE EDGE OF THE BLACK TOP  INTO THE  BOTTOM OF A DITCH AND ROLLED OVER 3 TIMES. UPON IMPACT NONE OF THE FRONTAL AIR BAGS DEPLOYED. THE ROOF CAVED IN ABOUT A FOOT ON THE PASSENGER SIDE.  THE DRIVER SUSTAINED  BRUISES TO HIS LEFT LEG, NECK PAIN  AND SLIGHT BLURRED VISION.  THE INSURANCE COMPANY  HAS TOTALED THE VEHICLE.  *JB",
        "vin": "KNADC163226"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/09/2004",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091720,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL 04V179000 CONCERNING FUEL DISTRIBUTOR ASSEMBLY. DEALER REFUSED TO HONOR THIS RECALL NOTICE BECAUSE  CONSUMER DID NOT PURCHASE  VEHICLE FROM THEM. *AK",
        "vin": "KNADC123X26"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/07/2004",
        "dateOfIncident": "10/22/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090536,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A HAZARDOUS STALLING PROBLEM THAT SURFACED WHEN THE MILEAGE WAS BETWEEN 49,986 AND 52,281.  THE PROBLEM PROGRESSED FROM INTERMITTENT TO CHRONIC.  THE VEHICLE STALLS AFTER STOPPING AT STOPLIGHTS OR STOP SIGNS OR UPON RESUMING DRIVING FROM A STOPPED POSITION (STALLING HAS OCCURRED WHILE MAKING A LEFT TURN AT A BUSY INTERSECTION).  THE PROBLEM BECAME CHRONIC WHEN THE MILEAGE WAS BETWEEN 73,241 AND 74,727.  THIS IS WHEN THE VEHICLE COULD NOT BE DRIVEN MORE THAN 20 MILES WITHOUT STALLING.  THE PROBLEM WAS MORE PRONOUNCED IF ANY PART OF THOSE 20 MILES WAS HIGHWAY DRIVING AT SPEEDS GREATER THAN 45 MPH.  THE CAR WILL USUALLY RESTART IMMEDIATELY AFTER STALLING. OCCASIONALLY UPON RESTARTING, IT WILL STALL AGAIN.  USUALLY AFTER SEVERAL ATTEMPTS IT WILL CONTINUE RUNNING.  UNFORTUNATELY, THE STALLING PROBLEM COULD ONLY BE ADDRESSED BY THE KIA DEALER\u0019S SERVICE DEPARTMENT IF IT COULD BE REPEATED BY THE TECHNICIAN OR IF IT OCCURRED IN CONJUNCTION WITH THE CHECK ENGINE LIGHT OR IF ERROR CODES WERE STORED.  THE FIRST TIME THE VEHICLE (MILEAGE 52,281) WAS BROUGHT IN FOR THE STALLING PROBLEM THE TECHNICIAN WAS ABLE TO REPRODUCE THE PROBLEM. AT THIS TIME, THE ECM WAS REPLACED.  THE SECOND TIME THE VEHICLE (MILEAGE 55,966) WAS BROUGHT IN FOR THIS PROBLEM ERROR CODES INDICATED A PROBLEM WITH THE MASS AIR FLOW SENSOR WHICH WAS THEN REPLACED.  THE VEHICLE (MILEAGE 64,287) WAS BROUGHT IN FOR THE RECALL THAT SUPPOSEDLY ADDRESSED THIS PROBLEM.  THE VEHICLE CONTINUED TO STALL INTERMITTENTLY.  SINCE THAT TIME, THE MASS AIR FLOW SENSOR HAS BEEN REPLACED AGAIN (MILEAGE 72,416), THE ECM HAS BEEN REPLACED AGAIN (MILEAGE 73,241), AND THE CATALYTIC CONVERTER HAS BEEN REPLACED (MILEAGE 74,727).  THE VEHICLE (MILEAGE 75,135) CONTINUES TO STALL REGULARLY. THE NEXT REPAIR RECOMMENDED BY THE KIA DEALER\u0019S SERVICE DEPARTMENT IS TO REPLACE THE WIRING HARNESS.*AK",
        "vin": "KNADC163926"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/27/2004",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095201,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PROBLEMS, COMMENTS FROM ODI WEB USER.  *BF   THE CONSUMER TOOK VEHICLE IN FOR RECALL SERVICE TWICE.  BESIDES THE RECALLS  ( # 04V179000). THE CONSUMER HAS TAKEN THE VEHICLE IN FOR REPAIR THREE TIMESFOR MECHANICAL PROBLEMS, LEAKING GASKETS, CHECK ENGINE LIGHT BEING ON, AND AIR FLOW METER SENSOR DAMAGED.  *TC",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/20/2004",
        "dateOfIncident": "06/09/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083813,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SHAKES WHEN DRIVEN,  THE TIRES WERE BALD, AND THE RIM WAS BENT.   *AK   THE FRONT END SHIMMIED AT 55 MPH.   *SC   *JB",
        "vin": "KNADC123726"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "08/19/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089257,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY,  THE CONSUMER NOTICED THAT THE FUEL TANK OVERFLOWED EVERY TIME IT WAS FILL UP . PLEASE PROVIDE ADDITIONAL INFORMATION. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/17/2004",
        "dateOfIncident": "07/15/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088060,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE VIBRATED AFTER DRIVING 45 MPH OR MORE. THE FASTER VEHICLE WAS GOING THE MORE IT VIBRATED. CONSUMER TOOK VEHICLE TO THE DEALER, WHO HAD THE FRONT BRAKE ROTORS AND CALIPERS REPLACED. VEHICLE DID NOT HAVE ABS BRAKES, YET THE VEHICLE CONTINUED TO SHAKE.  *AK",
        "vin": "KNADC123326"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080285,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED A RECALL LETTER, MADE AN APPOINTMENT WITH THE DEALER, TOOK VEHICLE INTO THE DEALER FOR  THE FUEL DISTRIBUTION AND FUEL ASSEMBLY.  THE CONSUMER LEFT THE VEHICLE AND  AFTER SEVERAL HOURS THE CONSUMER CALLED THE DEALER AND  WAS TOLD THAT NO PARTS WERE AVAILABLE.  THE MANUFACTURER WAS INFORMED AND THE CONSUMER WAS TOLD THAT THEIR HANDS WERE TIED.  CONSUMER IS AWAITING CONTACT FROM THE DEALER TO HAVE THE RECALL DEFECTS CORRECTED.  *JB  AS OF 7/14/04 THE CONSUMER STILL HASN'T RECEIVED ANY CORRESPONDENCE FROM THE DEALER ABOUT PARTS AVAILABILITY.  *NM",
        "vin": "KNADC123026"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2004",
        "dateOfIncident": "06/29/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080118,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP WAS UNABLE TO GIVE  CONSUMER AN APPOINTMENT TO HAVE THE FUEL DISTRIBUTOR ASSEMBLY RECALL 04V179000  REPAIRS PERFORMED WITHIN A REASONABLE TIME FRAME.   DEALERSHIP INDICATED THAT CONSUMER WILL HAVE TO  LEAVE  VEHICLE AT REPAIR  SHOP FOR A MINIMUM OF 3 DAYS.*AK  *LA",
        "vin": "KNADC123X26"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/04/2004",
        "dateOfIncident": "07/03/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079270,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES STALLS AFTER MOVING FROM A STOPPED POSITION. VEHICLE HAS BEEN RECALLED FOR THE PROBLEM AND THE PROBLEM IS STILL OCCURRING. CAR HAS BEEN OWNED FOR A YEAR AND HAS BEEN SERVICED TOO MANY TIMES FOR THE SAME PROBLEM. PROBLEM HAS OCCURRED SINCE THE RECALL AS IF IT WERE NEVER FIXED. DEALER WANTS TO EXCHANGE THE CAR AT MY EXPENSE FOR THE PROBLEM. HOW IS THIS FAIR???? THEN THE CAR WILL BE PUT BACK ON THE MARKET FOR SOME OTHER SUCKER TO PURCHASE. SOME THING NEEDS TO BE DONE AND FOR THE BEST INTEREST IT SHOULD NOT BE DRIVEN, WHAT IF THIS HAPPENS WHILE ON THE HIGHWAY OR SOMEONE DOESN'T STOP IN TIME AND REAR-ENDS THE VEHICLE.......WHOSE FAULT WOULD IT BE?????*AK *TR",
        "vin": "KNADC163426"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080286,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER TOOK THE VEHICLE INTO THE DEALER FOR A RECALL AND WAS TOLD THAT NO PARTS WERE IN.  THE DEALER INFORMED HIM THAT THE PART WAS NOT IN AFTER THEY SET UP THE INITIAL APPOINTMENT.  THE MANUFACTUER WAS INFORMED AND THE CONSUMER WAS TOLD THAT THEIR HANDS WERE TIED. *JB",
        "vin": "KNADC123026"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/22/2004",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079618,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKES LOCKED UP WHEN THEY WERE DEPRESSED ON A WET SURFACE.  DEALERSHIP  DEGLAZED AND LINED  THE BRAKES SEVERAL TIMES. CONSUMER WAS UNSURE IF THIS CORRECTED THE PROBLEM SINCE IT DIDN'T RAIN WHEN THE BRAKES WERE LINED. THIS VEHICLE WAS A PROGRAMMED VEHICLE AT TIME OF PURCHASE.  *AK",
        "vin": "KNADC123626"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/10/2004",
        "dateOfIncident": "06/10/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10076090,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS HAVING PROBLEMS WITH  SEAT BELTS.    REPLACED  THENTWICE, BUT EACH TIME THEY CONTINUED TO DO THE SAME.   SHE JUST HAD ONE OF THEM REPLACED ON 6/5/04, AND WHEN HER HUSBAND ATTEMPTED TO BUCKLE HER CHILD IN THE SEAT BELT LOCKED UP.  SHE STATES THAT THE MECHANIC SAID THEY HAVE ONLY SEEN ONE OTHER PROBLEM LIKE THIS.  THE MECHANIC DID NOT   KNOW WHAT THE PROBLEM WAS.  *AK",
        "vin": "KNADC123526"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "08/20/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067230,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BRAKING FOR A STOP LIGHT CONSUMER'S VEHICLE WAS REAR ENDED BY A TRUCK.  DURING HIGH HUMIDITY THE BRAKES GRABBED, CAUSING THE VEHICLE TO STOP TOO SHORT.  THE PROBLEM HAPPENED MORE  THAN FIFTY TIMES WITH THIS VEHICLE.  THE DEALER EXAMINED THE VEHICLE FOUR TIMES.  AN INDEPENDENT MECHANIC FOUND THE BRAKE LINING WAS THE PROBLEM.  *AK  *NM",
        "vin": "KNADC123526"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2004",
        "dateOfIncident": "05/16/2004",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073804,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL NO.#04V179000, FUEL SYSTEM/GASOLINE DELIVERY:  WHILE SITTING AT A STOP SIGN, ANOTHER MOTORIST INFORMED THE CONSUMER THAT THE BACK OF HER VEHICLE WAS ON FIRE.  AFTER CROSSING THE INTERSECTION THE CONSUMER LEFT THE VEHICLE AND SAW THAT THE FUEL TANK AREA WAS ACTUALLY ON FIRE.  THE FIRE DEPARTMENT ARRIVED AND EXTINGUISHED THE FLAMES OF THE VEHICLE.  THE MANUFACTURER ISN'T GOING TO ISSUE THE RECALL NOTICE UNTIL JUNE OF 2004.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/15/2004",
        "dateOfIncident": "05/14/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072654,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO CINCO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY MANUAL TRANSMISSION KIA RIO CINCO BACK TO THE DEALER 6 TIMES SINCE ITS PURCHASE (07/02) FOR THE SAME REASON. THE CLUTCH IN THIS CAR DOES NOT SEEM STRONG ENOUGH TO WORK. I DRIVE APROX 60 MILES EACH WAY TO WORK, AND RARELY USE THE CLUTCH. I HAVE BEEN DRIVING MANUAL TRANSMISSIONS ALL MY LIFE, AND MY OCCUPATION IS A TRUCK DRIVER. THE CLUTCH HAS BEEN COMPLETLY REPLACED 2 TIMES (APROX. EVERY 30,000 MILES) AND THE DEALER HAS ACTUALLY TOLD ME ITS NORMAL FOR THE CLUTCH TO SLIP. THE CAR NOW HAS 75,000 MILES ON IT (PAST THE 60,000 MILE BUMPER TO BUMPER WARRANTY) AND THE CLUTCH HAS STARTED SLIPPING AGAIN. THE CLUTCH SLIPS WHEN YOU ACCELERATE WHEN IN GEAR WITH THE CLUTCH FULLY INGAGED, AT FIRST IT IS NOTICEABLE IN 5TH GEAR, THEN THE CLUTCH GETS PROGRESSIVELY WORSE.*AK",
        "vin": "KNADC163426"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/29/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029648,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES VEHICLE'S STICK SHIFT TRANSMISSION SHUTS OFF WHEN VEHICLE IS IN FIRST AND THIRD GEAR. *AK    VEHICLES ALSO DIES WHEN IN NEUTRAL.  ALSO, WHEN VEHICLES DIES OR LOSES POWER, CONSUMER LOSES POWER STEERING AND BRAKES.  *LA",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/29/2004",
        "dateOfIncident": "02/18/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059297,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT A SPEED OF 40-45MPH VEHICLE LOST POWER. SOMETIMES THIS HAPPENED  IN HEAVY TRAFFIC.   CONSUMER TOOK VEHICLE TO  DEALER TO HAVE IT CHECKED OUT.  *AK  VEHICLE KEPT ON OVER HEATING.  IT WAS FOUND THAT COOLING FAN ON ENGUAGING CAUSED VEHICLE TO OVER HEAT.  TRANSMISSION JERKED AT  TIMES.  CHECK ENGINE LIGHT CAME ON AND DEALERSHIP FAILED TO DUPLICATE CONCERN.   *LA",
        "vin": "KNADC123326"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/01/2004",
        "dateOfIncident": "01/23/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061287,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED AT HIGHWAY SPEED.  DEALER WAS CONTACTED, AND  DEALER REPLACED A MODULE.  THREE MONTHS LATER, THE SAME PROBLEM OCCURRED. *AK   VEHICLE STALLS AT ANY SPEED.  AIR CONDITIONER EXHIBIT BAD SMELL.  *LA",
        "vin": "KNADC123926"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/10/2004",
        "dateOfIncident": "07/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10060889,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ASPERGILLUS FUNGI PRESENT IN AIR CONDITIONING SYSTEM.*AK",
        "vin": "KNADC123826"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/28/2004",
        "dateOfIncident": "02/28/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059984,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LOSES POWER. BELT CONTINUOUSLY BURNS AND SNAPS. DEALERSHIP REPLACED ENGINE, ALTERNATOR, TWO TRANSMITTIONS, 10 BELTS AND NOTHING FIXED THE PROBLEMS. I JUST GOT MY CAR BACK ON FRIDAY, TUESDAY OT BROKE AND IS NOW SITTING WORTHLESS IN MY YARD. I STILL HAVE THREE MORE YEARS OF PAYMENT ON IT. AM NOW GOING THROUGH LEMON LAW PROCESS.*AK",
        "vin": "KNADC123326"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/26/2004",
        "dateOfIncident": "01/08/2004",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10055330,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AT 15 MPH AND WITHOUT WARNING CONSUMER LOST CONTROL OF THE VEHICLE, RESULTING IN A REAR ENF COLLISION.  UPON IMPACT,  BOTH FRONTAL AIR BAGS DID NOT DEPLOY.  DRIVER SUSTAINED INJURIES.  *AK  *MR",
        "vin": "KNADC163126"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/23/2004",
        "dateOfIncident": "05/12/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059562,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  CONSUMER SMELLED A ROTTEN EGG ODOR COMING THROUGH THE VENTS. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/02/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057303,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED OR ACCELERATING FROM A COMPLETE STOP THE VEHICLE WILL STALLED WITHOUT WARNING. THE DEALERSHIP HAS SERVICE THE VEHICLE SEVERAL TIMES BUT HAS BEEN UNABLE TO FIX THE PROBLEM.    *NM",
        "vin": "KNADC123026"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/23/2004",
        "dateOfIncident": "12/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057165,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE MADE GRINDING NOISES FROM THE LEFT FRONT WHEEL.   *PH    THE CONSUMER ALSO NOTICED THAT THE LEFT FRONT HUB CAP AND THE SURROUNDING AREA OF THE BODY WERE NOTICEABLY DISCOLORED.  THE VEHICLE WAS ALSO PULLING TO THE LEFT AND IT SEEMED THAT A WHEEL BEARING WAS WEARING OUT.  THE CONSUMER CONTACTED THE DEALER SINCE THE VEHICLE WAS STILL UNDER WARRANTY.  THE DEALER WASN'T DOING WARRANTY WORK AND SUGGESTED THAT THE CONSUMER GO TO ANOTHER DEALER.  THE VEHICLE WAS SERVICE BY A DEALER WHO DETERMINED THAT THE LEFT FRONT BRAKE WAS WORN DOWN TO THE BARE METAL WHILE THE PASSENGER SIDE FRONT BRAKE PAD WAS STILL AT 25% THICKNESS.  AT THE CONSUMER'S REQUEST THE DEALER INVESTIGATED WHAT CAUSED THE LEFT SIDE TO WEAR SIGNIFICANTLY FASTER THAN THE RIGHT BUT WAS UNABLE TO DETERMINE THE CAUSE.  THE CONSUMER FEELS THAT SINCE THIS WAS NOT NORMAL WEAR THAT HE SHOULD BE REIMBURSED FOR REPLACING THE BRAKE PADS AND ROTORS.  *NM",
        "vin": "KNADC123626"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/12/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042442,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SEAT BELTS DO NOT RETRACT PROPERLY.  THE DEALER HAD TO REPLACE BOTH SEAT BELT SYSTEMS.  *AK    WHEN THE CONSUMER WENT TO THE DEALER THEY DECLINED TO REPAIR THE SAFETY FEATURES, THE CONSUMER WAS TOLD THE BUCKLE ASSEMBLY WAS WORN DUE TO DIRT BEING INSIDE THE ASSEMBLY AND WAS NOT A WARRANTY ISSUE.. * CB   THE DEALER RECOMMENDED THAT THE BRAKES, TRANSMISSION AND ENGINE MOUNTS BE REPLACED.  ALSO THE RADIATOR WAS STOPPED UP WITH MUD. *JB",
        "vin": "KNADC123526"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/09/2004",
        "dateOfIncident": "12/30/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052739,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "AUTOMATIC EQUIPMENT",
                "productModel": "AUTOMATIC EQUIPMENT",
                "productYear": "1985",
                "type": "Equipment"
            }
        ],
        "summary": "I PURCHASED MY KIA 02 IN 8/02, I HAD IT LESS THAN 5 MONTHS AND THE TRANSMISSION WENT OUT AT LESS THAN 20,000 MILES.  A NEW TRANSMISSION WAS INSTALLED IN 1/03.  IN 11/03 THE FIRST GEAR IN THE TRANSMISSION WAS GONE.  MY KIA NEEDED TO BE TOWED TO AND WAS AGAIN REPAIRED WITH A NEW TRANSMISSION, SO I WAS TOLD.  IT TOOK TWO AND A HALF WEEKS FOR MY CAR TO BE REPAIRED.  I WAS NOT GIVEN THE PAPER WORK FROM THE REPAIR SHOP THEN AND WAS TOLD THAT IT WOULD BE MAILED TO ME.  FEW WEEKS PASSED AND THE TRANSMISSION BEGAN TO GIVE PROBLEMS AGAIN, THIS TIME THE SHIFTING OF GEARS WERE COMPLETELY OFF AND MY OVER DRIVE DID NOT WORK AT ALL.  I WAS TOLD TO TAKE THE CAR BACK TO THE SAME REPAIR SHOP OF WHICH I DID ON 1/07/04.  I LEFT TWO MESSAGES ASKING FOR THE STATUS OF MY CAR AND HAVE NOT RECEIVED A CALL BACK.  AS OF TODAY I DO NOT HAVE MY CAR.*AK",
        "vin": "KNADC123526"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/04/2004",
        "dateOfIncident": "12/22/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052326,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A KIA RIO WITH 15,000 MILES ON IT, AND THE PASSENGER SIDE FRONT BRAKES ARE SHOT. THE OTHER BRAKES ARE NOT SHOT.  THEY ARE LIKE BRAND NEW. IF THIS WOULD BE WEAR AND TEAR IT WOULD BE ALL AROUND. THIS IS POOR MAKE OF THIS VEHICLE AND KIA DOES NOT CARE. THE FRONT BRAKE BROKE AND DUG INTO THE ROTOR CAUSING MUCH DAMAGE. AND THE CALIBER IS ALSO SHOT. NOT A WEAR AND TEAR PROBLEM AND KIA DOES NOT WANT TO FIX THIS. I BOUGHT A NEW CAR SO I WOULD NOT HAVE ANY PROBLEMS. BOY WAS I WRONG.   *LA",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/22/2003",
        "dateOfIncident": "12/19/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051925,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FILLING THE FUEL TANK THE WARNING LIGHT ILLUMINATED.  THEN, VEHICLE STALLED. CONSUMER MANAGED TO PULL OVER.  DEALERSHIP  WAS NOTIFIED, BUT WAS UNABLE TO RESOLVE THE PROBLEM. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "12/18/2003",
        "dateOfIncident": "12/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050693,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLS RANDOMLY SINCE FIRST BOUGHT AND HAS DONE SO TOO MANY TIMES TO COUNT.  CAR HAS STALLED ON MY DAUGHTER IN THE MIDDLE OF AN INTERSECTION WITH AN 18 WHEELER ON HER TAIL, SHE HAD TO SWERVE INTO A CONVENIENCE STORE PARKING LOT WITH A 5 1/2 POT HOLE CAUSING DAMAGE TO THE CAR.  THIS CAR HAS BEEN IN THE GARAGE  6 - 8 TIMES IN THE PAST YEAR.  THE DEALER SAYS THEY CANNOT FIX IT UNLESS THE CHECK ENGINE LIGHT IS ON.  THE CAR HAS BEEN IN 3 TIMES IN 8 MONTHS WITH THE CHECK ENGINE LIGHT ON AND THEY ONLY REPLACE THE GAS CAP ASSEMBLY EVERY TIME AND THE CAR STILL CONTINUES TO STALL AT RANDOM.  DEALER SAYS THEY CANNOT DUPLICATE PROBLEM AND DAUGHTER IS DUMB BLONDE!  THE CAR ALSO HESITATES WHEN DRIVING AND RUNS ROUGH LIKE IT WANTS TO STALL, YOU NEVER KNOW WHEN IT WILL JUST STOP ON YOU.  THIS IS NOT A SAFE VEHICLE TO HAVE ON THE ROADS.  I AM FILING LEMON LAW PAPERS ON IT TODAY.*AK",
        "vin": "KNADC123626"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/17/2003",
        "dateOfIncident": "12/17/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051669,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 50 MPH VEHICLE  CAUGHT ON  FIRE. THERE  WAS  A LOT SMOKE AND FLAMES UNDER THE HOOD. *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2003",
        "dateOfIncident": "04/21/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048800,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR TURNS OFF WHILE I AM DRIVING IT.*AK",
        "vin": "KNADC163X26"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": "11/21/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047508,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "KIA RIO CINCO RANDOMLY STALLS WHILE DRIVING.   *LA",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/27/2003",
        "dateOfIncident": "03/01/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039622,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "DEALERS TRUCK EQUIP. CO.",
                "productMake": "DEALERS",
                "productModel": "DEALERS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE VEHICLE SHUTS OFF WHILE IN MOTION, HAPPEND MORE THAN 10 TIMES ALREADY BUT THE CAR STARTED UP I TOOK THE CAR TO THE DEALER 3 TIMES ALREADY FOR THIS PROBLEM PROBLEM STARTED AROUND MARCH 2003, THIS LAST TIME I TOOK THE VEHICLE TO THE DEALER THEY TELL ME \"OH THE OTHER MECHANIC DIDN'T KNOW HOW TO FIX IT\", \"AND THE PROBLEM IS FIXED AND \"SHOULDN\"T\" HAPPEN AGAIN. THATS NOT VERY REASSURING, I AM SCARED TO DRIVE THE CAR.",
        "vin": "KNADC123926"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10040288,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN A HEAD ON COLLISION AT 46 MPH. UPON IMPACT, PASSENGER SIDE AIR BAG DEPLOYED, BUT  DRIVER SIDE AIR BAG DIDN'T DEPLOY.  STEERING WHEEL CAME COMPLETELY OFF, AND THE DRIVER DIED AS A RESULT. *AK    CONSUMER'S WIFE WAS HIT HEAD ON WHILE DRIVING AT 50 MPH BY A TOOTA TACOMA.  THE DRIVIER OF THE TACOMA WAS ON DRUGS WHEN CROSSED OVER INTO PATH OF THE RIO.  THE DRIVER OF THE RIO EXPERIENCED A SEVERED BRAIN STEM, PUNCTURED LUNG FROM THE STEERING COLUMN AND A SEVERED ARM.  THE DRIVER OF THE RIO WAS WEARING THE SEAT BELT.  DURING THE  CRASH THE RIO'S DRIVER'S SEAT BROKE FROM THE MOUNTINGS AND THE STEERING WHEEL BROKE OFF.  AFTER THE CRASH THE RIO'S DRIVER WAS FOUND UNDER THE INSTRUMENT PANEL.  THE TACOMA WAS BENT IN HALF AND THE TRUCKS BED BROKE OFF FROM THE FRAME.  RIO HAS BEEN NOTIFED OF THE CRASH. IT WAS ASSUMED THE DRIVER OF THE TACOMA WAS TRAVALING ATLEAST 45-50 MPH AT THE TIME OF THE CRASH.  CW",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": "08/04/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10032016,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE BRAKES PEDAL WENT ALL THE WAY TO THE FLOOR.  *AK  *TS",
        "vin": "KNADC123726"
    },
    {
        "components": "SUSPENSION,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/11/2003",
        "dateOfIncident": "09/09/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038677,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER WENT OUT OF CAR SO HAD IT LOOKED AT.  WAS TOLD THAT IT WAS THE COMPUTER CHIP OR SOMETHING.  THIS CAUSED THE DEFROSTER IN THE CAR TO NOT WORK.  BEFORE I COULD GET IT IN TO BE REPLACED, STARTED HEARING A STRANGE NOISE FROM THE BACK OF THE CAR.  CALLED TO GET AN APPOINTMENT FOR THE NEXT DAY ABOUT THE AIR AND THE NOISE.  THAT DAY, WHILE DRIVING ON A VERY BUSY INTERSTATE, THE NOISE BEGAN TO GET WORSE.  I THEN HEARD A LOUD NOISE FROM THE BACK OF THE CAR, AND LOST CONTROL OF THE CAR.  THE STEERING WOULD NOT RESPOND, AND THE CAR FELT LIKE IT WAS \"FLOATING\" ALONG THE INTERSTATE.  HAD THE CAR TOWED AND WAS TOLD THAT IT WAS THE REAR WHEEL BEARING AND THAT IT DAMAGED SOME THINGS UNDER THE CAR.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/04/2003",
        "dateOfIncident": "06/02/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10026798,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN A FRONTAL COLLISION AND THE AIR BAGS FAILED TO DEPLOY.  *AK   *SCC   *JB",
        "vin": "KNADC163626"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/03/2003",
        "dateOfIncident": "09/02/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038144,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON COMING TO A STOP SIGN AND ENGAGING THE BRAKES THE PEDAL WENT TO THE FLOOR.  DEALER CLAIMED THAT  MASTER CYLINDER WORE OUT.  THIS VEHICLE HAD BEEN SERVICED FOR THIS SAME PROBLEM FOUR TIMES EARLIER. *AK",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/18/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034109,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER GOT INTO THE VEHICLE, CLOSED THE DOOR ,AND COULD NOT GET OUT.  THE SCREWS TO HOLD THE DOOR LATCH WERE GONE WHICH CAUSED THE LATCH TO GET STUCK BETWEEN THE DOORS. *AK",
        "vin": "KNADC123726"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/29/2003",
        "dateOfIncident": "07/29/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031445,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY AND WITHOUT PRIOR WARNING WATER WAS  LEAKING INSIDE OF VEHICLE. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/14/2003",
        "dateOfIncident": "07/14/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10027236,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ABOUT 35MPH ON THE HIGHWAY  AND WITHOUT PRIOR WARNING  BRAKES GAVE OUT, THE PEDAL WENT ALL THE WAY TO THE FLOOR.  *AK",
        "vin": "KNADC123326"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/11/2003",
        "dateOfIncident": "05/30/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10022072,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS INVOLVED IN AN ACCIDENT WHILE DRIVING 50-55 MPH YET THE AIR BAGS DID NOT DEPLOY.  *AK  *CB  *NLM",
        "vin": "KNADC123726"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/01/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026366,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT THE REAR BENCH IS NOT STABLE. TOOK VEHICLE TO DEALER, AND DEALER STATED THAT BRACKET BROKE. *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026286,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING  ENGINE STALLS WITHOUT WARNING. *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2003",
        "dateOfIncident": "06/21/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10023644,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DEPLOYED WITHOUT COLLISION WHILE DRIVING.  *JB",
        "vin": "KNADC123126"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/23/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020470,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLES TRANSMISSION FELL OUT OF THE CAR.   *NLM",
        "vin": "KNADC123226"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/23/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020505,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE SHUT OFF INTERMITTENTLY.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER FOR THIS PROBLEM THREE TIMES.  *NLM",
        "vin": "KNADC123026"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "05/08/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10020205,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65/70 MPH ON THE FREEWAY, THE VEHICLE WAS INVOLVED IN AN ACCIDENT, THE AIR BAGS FAILED TO DEPLOY, AND THE SEAT BELTS DID NOT RESTRAIN THE OCCUPANTS IN THE VEHICLE.  *JB",
        "vin": "KNADC163126"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/19/2003",
        "dateOfIncident": "04/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019491,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED INTERMITTENT STALLING, THE DEALER REPLACED THE VAPOR AND SERVICE THE FUEL INJECTION, BUT THE VEHICLE CONTINUED TO STALL. *AK  THE BRAKES WERE REPAIRED AND THE VEHICLE PULLED TO THE RIGHT WHEN DRIVING.  *JB",
        "vin": "KNADC123126"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015863,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE TURNED OFF AUTOMATICALLY WHILE DRIVING.  MR   *TS  *JB",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "04/22/2003",
        "dateOfIncident": "02/14/2003",
        "fire": true,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10016361,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "JAN. 10TH- BRAKED TO AVOID ACCIDENT ON I-59 AT 70 MPH AND CAR WAS COMPLETELY UNCONTROLLABLE-RAN OFF I-59 AND COLLIDED WITH TREE  FEB. 14- BRAKED AGAIN AT HIGH SPEED TO AVOID ACCIDENT AND CAR WAS UNCONTROLLABLE. HIT TREE AND ALMOST LOST LIFE. WOULD HAVE LOST LIFE HAD NOT SOMEONE PULLED ME FROM VEHICLE, VEHICLE CAUGHT FIRE AND BURNED DOWN COMPLETELY.   *NLM",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/16/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016007,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR SEAT BELTS WERE INSTALLED BACKWARDS, AND THEREFORE THEY DID NOT LOCK.      *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014573,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED WITHOUT WARNING.  *JB",
        "vin": "KNADC163026"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2003",
        "dateOfIncident": "02/18/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010816,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DUE TO AN ELECTRICAL PROBLEM THE DEALER HAD MY VEHICLE FOR APPROXIMATELY 25 DAYS.  THE CAR JUST SHUTS DOWN. DEALER PLACED FOUR FUSIBLE LINKS ON LINE THAT LEADS TO FUSE #13. THE DEALER HAD SPLICED INTO WIRING HARNESS, AND THEY A DID SLOPPY JOB.  THE DEALER AND MANUFACTURER REFUSED TO CORRECT THIS DEFECT.  MY WIFE AND FAMILY ARE NOW FEARFUL OF DRIVING THIS VEHICLE DUE TO UNPREDICTABLE NATURE OF DEFECT AND POTENTIAL FOR SERIOUS PHYSICAL HARM TO US.      *JB",
        "vin": "KNADC123026"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "02/06/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006681,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKE PEDAL IS PRESSED THERE WAS A MUSHY FEELING. DEALER REPLACED THE BACK PLATE ASSEMBLY, AND BRAKE SHOES.  PLEASE PROVIDE ANY FURTHER INFORMATION.       PH",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": "12/06/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10006322,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN A HEAD ON COLLISION WITH ANOTHER VEHICLE. UPON IMPACT, FRONT AIRBAGS DID NOT DEPLOY, ALSO, MOTOR MOUNTS FAILED, RESULTING IN DASHBOARD PUSHING INTO DRIVER AND PASSENGER. BOTH DRIVER AND PASSENGER SUSTAINED INJURIES. *AK",
        "vin": "KNADC123226"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "01/31/2003",
        "dateOfIncident": "01/06/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006148,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SEAT BELT JAMMED SO TIGHT THAT THE PLASTIC AROUND IT SHATTERED AND PIECES HIT THE DRIVER.  AFTER THAT OCCURRED THE AIR BAGS DEPLOYED RESULTING IN AN ACCIDENT.   THE DEALER IS AWARE OF THE PROBLEM.  *AK  *NLM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/27/2003",
        "dateOfIncident": "01/24/2003",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004734,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT THE SPEED OF 35MPH WAS INVOLVED IN A FRONTAL COLLISION, NEITHER AIR BAG DEPLOYED. DEALER AND MANUFACTURER HAVE BEEN NOTIFIED. IF YOU HAVE ANY ADDITIONAL INFORMATION  FEEL FREE TO ADD.*AK",
        "vin": "PROVIDE #"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/03/2003",
        "dateOfIncident": "09/03/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002037,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON THE HIGHWAY THERE IS A RATTLING NOISE COME FROM THE REAR OF THE VEHICLE.  PLEASE PROVIDE ADDITIONAL INFORMATION DEALER IS AWARE OF THE PROBLEM. TS",
        "vin": "KNADC123226"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/30/2002",
        "dateOfIncident": "08/22/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001667,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE STOPS ABRUPTLY AND WILL NOT ACCELERATE GOING UP HILLS. DEALER CONTACTED.  TS  CONSUMER PROVIDED MORE INFORMATION WHICH IS IN SPANISH.   *TT",
        "vin": "KNADC123126"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "12/19/2002",
        "dateOfIncident": "08/28/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001206,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT LOW SPEEDS, THERE'S A CLICKING NOISE AND VEHICLE WILL STALL, BUT WILL START BACK UP IMMEDIATELY. THE DEALERSHIP CAN NOT  DUPLICATE THE PROBLEM.  PLEASE PROVIDE MORE DETAILS. TS  *DT",
        "vin": "KNADC123XL6"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/29/2002",
        "dateOfIncident": "11/28/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770242,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "KIA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NO SUMMARY.  DT",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/13/2002",
        "dateOfIncident": "11/09/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022700,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65 MPH HAD AN ACCIDENT HITTING A DEER. AND NEITHER AIR BAG DEPLOYED, NOR SEAT BELTS HOLD THE PASSENGER IN THE SEAT. DEALER AND MANUFACTURER HAS BEEN NOTIFIED.PLEASE PROVIDE FURTHER INFORMATION::   MR",
        "vin": "KNADC163526"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022572,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CALLED COMPLAINING ABOUT HAVING PROBLEMS WITH THE ENGINE LIGHT, THE RUBBERS ON THE BACK DOORS WERE DAMAGED,CLANK,ALSO THE LAST THINGS WERE THE CARTEPILLAR WERE WEARD OUT AND NEEDED TO BE REPLACED. DEALER WAS CONTACTED AND HAVE FIX ALL THE PROBLEMS.    MR",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "11/12/2002",
        "dateOfIncident": "10/19/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 567843,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION CONSUMER WAS HIT BY ANOTHER DRIVER ON THE REAR DRIVER'S SIDE.   VEHICLE SPUN AROUND THREE TIMES.  DURING THIS INCIDENT,  SAFETY DEVICES FAILED TO OPERATE AS DESIGNED.  DRIVER'S SIDE SEAT BELT DID NOT LOCK; THEREFORE, CONSUMER WAS THROWN FORWARD.  SEAT BELT IN THE BACK SEAT WHICH SECURED THE CHILD SEAT DID NOT LOCK, THROWING THE SEAT FORWARD AND OUT OF ITS ORIGINAL POSITION.  *JG ...*AK",
        "vin": "KNADC163426"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/04/2002",
        "dateOfIncident": "10/27/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8022126,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING AT ANY SPEED AND NO WARNING THE VEHICLE WILL SHUT OFF CAUSING CONSUMER TO PULL OVER. DEALER NOTIFIED.   MR",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/25/2002",
        "dateOfIncident": "06/15/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021575,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED NUMEROUS TIMES AT ANY SPEED. DEALER HAS INSPECTED THE VEHICLE SEVERAL TIMES. AND THE PROBLEM HAS REOCCURED. PLEASE PROVIDE FURTHER INFORMATION.       TS",
        "vin": "PLEASE FILL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/24/2002",
        "dateOfIncident": "09/10/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021525,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK WINDOW ON DRIVER SIDE OF VEHICLE IS LEAKING, INTERIOR SMELLS LIKE MILDEW.  VEHICLE WAS REPAIRED BY DEALER, ON OCTOBER 18TH CONSUMER NOTICED IT LEAKING AGAIN.       TS",
        "vin": "KNADC123026"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/10/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 568100,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATES THAT THE BRAKES WENT OUT AND THE CAR WOULDN'T STOP.  THE CLOSED VALVE CAUSED A THUMPING IN THE VEHICLE AND AIR HAD COME IN CAUSING A LOUD WHISTLING NOISE AND THE VEHICLE BECOMES HARD TO STEER.  *SCC",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2002",
        "dateOfIncident": "10/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768044,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MR",
        "vin": "KNADC123326"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007456,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KIA RIO. *PH  *JB    **DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT OVER TO ARTEMIS**768044",
        "vin": "KNADC123326"
    },
    {
        "components": "AIR BAGS,TIRES",
        "crash": true,
        "dateComplaintFiled": "09/27/2002",
        "dateOfIncident": "06/10/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 8019725,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS STATIONARY WHEN IT WAS REAR ENDED AT A SPEED OF 30-35 MPH AND NEITHER AIR BAGS DEPLOYED.  DEALER NOTIFIED.  *MR  THE CONSUMER STATED THAT BEFORE THE VEHICLE WAS REPAIRED FROM THE FIRST COLLISION, TNE 2ND CRASH OCCURED WHEN THE LEFT TIRE BLEW OUT (NO TIRE INFO WAS GIVEN). *SCC",
        "vin": "KNADC123426"
    },
    {
        "components": "AIR BAGS,TIRES",
        "crash": false,
        "dateComplaintFiled": "09/27/2002",
        "dateOfIncident": "06/10/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 8019723,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATES THAT THE LEFT FRONT TIRE HAD A BLOW OUT AT 70 MPH.  AFTERMARKET EQUIPMENT WAS INSTALLED AT 7,000 MILES, TIRE SIZE 165/70R14 AND THE DOT# UNAVAILABLE.  *MR  THE CONSUMER STATES THAT THE TIRES WERE OEM SWITCHED BY THE DEALER AT 4132 MILES.  THE FIRST SET DEVELOPED LARGE BLISTERS ON THE INSIDE TIRE WALLS.  THE CONSUMER WAS DRIVING ON A BRIDGE WHEN HE LOST CONTROL OF THE VEHICLE, AS A RESULT THE VEHICLE SWERVED TO THE LEFT, HIT THE GUARDRAIL WHICH CAUSED THE VEHICLE TO PING ACROSS THE HIGHWAY AND HIT AN EMBANKMENT, THEN THE VEHICLE ROLLED END OVER END SPINNING THE FRONT END THEN ROLLING DOWN THE EMBANKMENT 3 AND HALF TIMES LANDING ON THE PASSENGER SIDE.  THE LEFT FRONT TIRE HAD BLOWN AND THE AIR BAGS DID NOT DEPLOY.  *SCC",
        "vin": "KNADC123426"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2002",
        "dateOfIncident": "09/02/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767204,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS BEEN TOWED ON 9/2 AND 9/6 DUE TO THE CAR SHUTTING DOWN THEY SAID FIRST IT WAS THE ALTERNATOR AND FUEL PUMP NOW THEY SAY IT IS THE BATTERY CABLE TODAY IS THE 15TH OF SEPT. AND I STILL DO NOT HAVE THE NEW CAR I BOUGHT PLEASE HELP BEFORE IT SHUTS DOWN IN HIGHWAY TRAFFIC AND I GET KILLED.  NLM",
        "vin": "KNADC123526"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/10/2002",
        "dateOfIncident": "08/25/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766937,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WONDERING IF OTHER KIA OWNER'S HAVE HAD SIMILAR PROBLEMS?  I HAD THE FRONT BRAKES REPLACED DUE TO A CLIP THAT FELL OFF AND GOT BETWEEN THE BRAKE PAD AND DRUM, AND THE REAR BRAKES REPLACED DUE TO BRAKE DUST AND GLAZING OF DRUMS.  NOW LESS THAN TWO WEEKS LATER, I'M STARTING TO HAVE THE SAME GRINDING NOISE IN THE REAR BRAKES AGAIN AND I HAVE AN APPT. WITH MY KIA DEALER ON WED. 9/11/02 TO HAVE THE REAR BRAKES EXAMINED AGAIN.  THE GRINDING NOISE GETS LOUDER AS TIME GOES BY, AND OCCASIONALLY THE BRAKES GRAB.",
        "vin": "KNADC163326"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/10/2002",
        "dateOfIncident": "08/25/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766937,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WONDERING IF OTHER KIA OWNER'S HAVE HAD SIMILAR PROBLEMS?  I HAD THE FRONT BRAKES REPLACED DUE TO A CLIP THAT FELL OFF AND GOT BETWEEN THE BRAKE PAD AND DRUM, AND THE REAR BRAKES REPLACED DUE TO BRAKE DUST AND GLAZING OF DRUMS.  NOW LESS THAN TWO WEEKS LATER, I'M STARTING TO HAVE THE SAME GRINDING NOISE IN THE REAR BRAKES AGAIN AND I HAVE AN APPT. WITH MY KIA DEALER ON WED. 9/11/02 TO HAVE THE REAR BRAKES EXAMINED AGAIN.  THE GRINDING NOISE GETS LOUDER AS TIME GOES BY, AND OCCASIONALLY THE BRAKES GRAB.",
        "vin": "KNADC163326"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/21/2002",
        "dateOfIncident": "07/17/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567166,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHEN SHE ATTEMPTED TO APPLY THE BRAKES, THE VEHICLE WOULD NOT STOP, AND LOST CONTROL OF THE VEHICLE, WHICH RESULTED IN A SCRATH ON THE VEHICLE.*JB",
        "vin": "KNADC123126"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/21/2002",
        "dateOfIncident": "07/30/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567166,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THERE WAS A WHISTLING NOISE IN THE FRONT END OF VEHICLE AND THE STEERING WOULD BECOME LOOSE AT 55 MPH.*JB",
        "vin": "KNADC123126"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/21/2002",
        "dateOfIncident": "07/17/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567166,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE VEHICLE WOULD SHAKE WHILE DRIVING, THE DEALER INFORMED CONSUMER THAT THE RIMS WERE BENT AND NEEDED TO BE REPLACED.*JB",
        "vin": "KNADC123126"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567166,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHILE DRIVING, THERE WAS A LOUD THUMP COMING FROM THE REAR OF THE VEHICLE, DEALER STATED THEY COULD NOT DUPLICATE THE PROBLEM, THEN LATER CONSUMER WAS INFORMED A VALVE IN THE FUEL SYSTEM NEEDED TO BE REPLACED.*JB",
        "vin": "KNADC123126"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/12/2002",
        "dateOfIncident": "01/17/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567090,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT THE VEHICLE STALLS AND THE PROBLEM HAS NOT BEEN FIXED.   *SLC",
        "vin": "KNADC163926"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/12/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567090,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT THE BRAKES SCREACH, THE BRAKES HAVE BEEN READJUSTED AND CLEANED 3 TIMES.   *SLC",
        "vin": "KNADC163926"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/12/2002",
        "dateOfIncident": "01/17/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567090,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT THE FUEL LIGHT IS ILLUMINATED 80 PERCENT OF THE TIME.   *SLC",
        "vin": "KNADC163926"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/06/2002",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8009260,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT  55 TO 60 MPH THERE'S A HESITATION; THEN, ENGINE SHUTS DOWN IF THIS HAPPENS ON THE FREEWAY SOMEONE COULD BE KILLED.  PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/23/2002",
        "dateOfIncident": "02/22/2002",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8008340,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING 65 MPH VEHICLE SWERVES FROM LEFT TO RIGHT. VEHICLE IS HARD TO CONTROL. TOOK TO DEALER AND DEALER INDICATED VEHICLE NEEDED NEW BUSHINGS, FRONT END ALIGNMENT AND TIRES. *AK  CONSUMER STATED THAT THE DEALER HAS NOT AGREED THAT ANY THING IS WRONG WITH THE VEHICLE. BUT 9 ALIGNMENTS, 4 NEW TIRES AND BALL BEARINGS WERE REPLACED AT LESS THAN 2000 MILES. *YH",
        "vin": "KNADC163626"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/29/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756153,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "RIO",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MODELS WITH 2ND ROW BUCKET SEATS, A STANDARD CHILD SEAT (FOR 20-40 POUNDS) CAN NOT BE SAFELY SECURED.  THE PLASTIC STOP BUTTON ON THE BELT THAT KEEPS THE BUCKLE FROM FALLING TO THE FLOOR WHEN NOT IN USE, ALSO PREVENTS YOUR FROM DRAWING THE SEAT BELT TIGHT ENOUGH TO TIGHTEN THE CAR SEAT DOWN PROPERLY.  WHEN THE BELT IS DRAWN AS TIGHT AS IT CAN BE, YOU CAN STILL EASILY MOVE THE CAR SEAT AROUND.  THE SEAT AND BELT WILL ALLOW YOU TO TIGHTEN THE LARGER BOOSTER SEATS IN PLACE, BUT THEY ARE NOT FOR CHILDREN IN THE 20-40 POUND RANGE.  I TRIED THIS WITH ALL 3 SEATS THAT I OWN, AND I WENT TO A RETAILER AND MEASURED A NUMBER OF OTHER SEATS.  IT SEEMS THAT MOST OF THEM MEASURE APPROXIMATELY 7.5 INCHES FROM THE BASE TO THE BELT HOLE, BUT YOU NEED AT LEAST 9.5 INCHES (APPROXIMATELY) IN HEIGHT TO RAISE THE CAR SEAT HIGH ENOUGH FOR THE SEAT BELT TO SECURELY TIGHTEN IT IN.",
        "vin": "KNDUP131326"
    }
]