[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/08/2016",
        "dateOfIncident": "02/02/2016",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10824895,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINTER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DOMETIC REFRIGERATOR RM2852, SERIAL NO.13505075 UNDER RECALL 06E-076. CRACK IN BURNER.THIS RECALL STATES THAT THE COOLING UNIT IS DEFECTIVE AS A CRACK WILL OCCUR IN THE BURNER AREA CAUSING THE LOSS OF REFRIGERANT AND LOSS OF COOLING AND THE POSSIBILITY OF FIRE EXISTS IF LEFT IN OPERATION. YET THEY ADVISE NOT TO OPERATE THE UNIT IF AMMONIA ODOR OR YELLOW RESIDUE FROM LEAKAGE EXISTS. THIS HAS OCCURRED WITH MY UNIT. AFTER TALKING TO DOMETIC DIRECTLY, TODAY, THEY ADVISED ME THAT THEY WILL INSTALL A KIT TO DETER A FIRE FROM SPREADING SHOULD ONE OCCUR AFTER THE KIT HAS BEEN INSTALLED. THEY SAY THEY WILL NOT REPAIR OR REPLACE MY FAILED COOLING UNIT, AFTER WHICH THEIR IMPLIED RECALL REMEDY IS OF NO VALUE AT ALL BECAUSE THE REFRIGERATOR WILL NO LONGER OPERATE. THE WOMAN I SPOKE WITH AT DOMETIC TOLD ME, WHEN I ASKED WHY THEY WERE NOT REPLACING THE COOLING UNIT ITSELF, IT WAS BECAUSE MY UNIT WAS OUT OF WARRANTY. THIS ANSWER WAS SIMPLY A DIVERSION BECAUSE THIS PARTICULAR UNIT WAS OUT OF WARRANTY LONG BEFORE THE RECALL CAMPAIGN WAS EVER DEVELOPED.  WARRANTY DOES NOT APPLY. SHE THEN SAID THAT ONCE \"I COVER THE COST\" TO HAVE THE COOLING UNIT REPLACED THEN THEY WILL INSTALL THE RECALL KIT AT NO COST TO ME. OF COURSE, ONCE AGAIN, AT THAT POINT THE RECALL KIT WILL NO LONGER BE NECESSARY UNLESS THEY ARE ADMITTING THAT THEY ARE STILL SHIPPING DEFECTIVE COOLING UNITS. EVERY EFFORT SEEMS TO HAVE BEEN MADE BY DOMETIC TO PASS ON THE COSTS OF THEIR RESPONSIBILITY TO THEIR CUSTOMERS, BE IT CAUSED BY DAMAGE FROM FIRES, OR ASSUREDLY THE EVENTUAL REPLACEMENT OF THE DEFECTIVE COOLING UNIT. RESEARCH TELLS ME THAT MANY TIMES CUSTOMERS HAVE BEEN TOLD TO JUST REPLACE THE REFRIGERATOR EVEN WHEN REPAIRABLE. THESE EXPENSES, IF THE CUSTOMER PAYS, CAN REACH MULTI-THOUSANDS OF DOLLARS EACH IN SOME CASES. DOMESTIC'S COSTS FOR THEIR KIT, AS OFFERED, IS LESS THAN 100 DOLLARS PER UNIT PARTS AND LABOR.",
        "vin": "4YDF2922X21"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/01/2008",
        "dateOfIncident": "06/24/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232901,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINTER",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2652",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KEYSTONE SPRINTER RV.  THE VEHICLE HAS A DOMETIC REFRIGERATOR, MODEL RM2652.  THE REFRIGERATOR WAS REPAIRED UNDER RECALL.  RECENTLY, THE CONTACT OBSERVED A YELLOW RESIDUE LEAKING FROM THE REFRIGERATOR AND NOTICED THAT IT WAS NOT COOLING PROPERLY.  DOMETIC STATED THAT THE RECALL REPAIR WAS SERVICED AND THEY WOULD NOT BE RESPONSIBLE FOR THE REPLACEMENT OF THE COOLING UNIT, WHICH HAS NOT YET BEEN REPLACED.  THE PART AND RECALL NUMBERS WERE UNKNOWN.   UPDATED 07/29/08  *BF  THE CONSUMER PURCHASED A NEW REFRIGERATOR. UPDATED 08/07/08",
        "vin": "4YDF2762129"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/29/2008",
        "dateOfIncident": "04/07/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226020,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINTER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 KEYSTONE SPRINTER.  THE VEHICLE HAS A DOMETIC REFRIGERATOR.  THE CONTACT RECEIVED A RECALL NOTICE THE SECOND WEEK IN APRIL OF 2008, WHICH STATED THAT THE REFRIGERATOR NEEDED TO BE REPAIRED UNDER A RECALL.  THE DEALER STATED THAT THEY WERE NO LONGER PERFORMING THE REPAIRS AFTER APRIL 1, 2008.  THE CONTACT FEELS THAT THE REFRIGERATOR SHOULD STILL BE REPLACED BECAUSE THE RECALL NOTICE WAS NOT RECEIVED IN TIME.  THERE HAD BEEN NO FAILURE TO DATE.  THE RECALL NUMBER WAS UNKNOWN.",
        "vin": "4YDT2592121"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/06/2007",
        "dateOfIncident": "04/16/2007",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195512,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINTER",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 KEYSTONE/SPRINTER 5TH WHEEL TRAVEL TRAILER. THE CONNECTION METHOD FOR THE SIDES TO THE FRONT OF THE UNIT IS FAULTY. THE FRONT OF MY UNIT DELAMINATED AND IF I DID NOT NOTICE AND SECURE WITH 3.5 SHEET ROCK SCREWS THE SIDE COULD HAVE BEEN TORN AWAY FROM THE VEHICLE WHILE TRAVELING SENDING PIECES OF FIBERGLASS AND PLYWOOD INTO TRAFFIC. I EMAILED KEYSTONE WITH THE PROBLEM WITH PICTURES. KEYSTONE SAID IT WAS FROM \"PUCKERING AND SHRINKAGE. (WHY DIDN'T KEYSTONE ENGINEER FOR PUCKERING AND SHRINKAGE?) KEYSTONE HAS REFUSED TO HELP OR TO RECOGNIZE THIS AS A HIGHWAY SAFETY ISSUE.  *TR",
        "vin": "4YDF2762521"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/28/2007",
        "dateOfIncident": "03/10/2007",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186395,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "SPRINTER",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2852",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*- THE CONTACT STATED THAT THE  2002 KEYSTONE SPRINTER'S DOMETIC REFRIGERATOR  MODEL # RM2852, SERIAL # 14200164 WAS INVOLVED IN RECALL 06E076000.  THE CONTACT WANTED TO COMPLAIN THAT THE SERVICE CENTER, PISMO COAST RV SERVICE CENTER, WILL NOT THE HONOR THE RECALL BECAUSE DOMETIC WAS NOT PAYING ENOUGH MONEY TO DO THE JOB ,AND THEY WILL NOT RETURN THE SERVICE CENTER PHONE CALLS.  THERE HAD BEEN NO FAILURES TO DATE.*AK",
        "vin": "4YDF2822821"
    }
]