[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/22/2017",
        "dateOfIncident": "06/22/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000683,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I COULD NOT GET MY VAN INSPECTED LAST OCT AS THE CODE CAME UP PO 446, WE WERE TOLD TO DRIVE 50 MILES, THEN 100 MILES, DIDN`T CORRECT THIS WE TRIED FOR 2 WEEKS . WE WERE GOING TO FLORIDA FOR THE WINTER,AND STOPPED IN WAVERLY NY TO SEE IF THE 150 MILES TO THERE WOULD CORRECT THIS NO, WHILE WE WERE IN FL. IN FEB. I HAD A MECHANIC CHECK OUT THE CAR , HE CHANGED THE OIL AND ALL FILTERS ,NEW PLUGS AND WIREING AND A .A.I.R. CHECK VALVE. PART # 911004...  THE PO446 STILL CAME UP .IN APRIL HE PUT IN A CANISTER VENT SOLEOID PART # CVP124 AND PURGE VALVE PART # 9110117    WE HAVE HAD THIS IN FOR INSPECTION TWICE AND  TODAY THE FAILED REPORT SAID I HAVE A 10 DAY EXTENTION TO GET IT FIXED AND NO OTHER EXTENTION.    I AM STYMIED,I PAID OVER 1500 I WAS TOLD IN FL BY THE MECHANIC HE WAS SURE THIS WAS ALL CORRECT AND I WOULD BE ABLE TO PASS INSPECTION. IF I THOUGHT ALL THIS MONEY I SPENT ON ALL THIS WORK I WOULD HAVE DONE A DIFFERENT ROUTE  THE VAN RUNS GREAT.WE ARE SNO-BIRDS AND IN OUR 80`S AND CAN`T AFFORD TO JUST BUY ANOTHER VAN. I PAID OVER $ 1500. AND  AT $3.00 A GALLON FOR GAS AFTER PUTTING MILES ON TO CORRECT THIS CODE, AND $`S FOR FAILED INSPECTION .I AM OUT A LOT OF MONEY AND CAN`T DRIVE MY VAN AFTER 7/2/17.   PLEASE HELP.",
        "vin": "IGHDX03EX2D"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/18/2017",
        "dateOfIncident": "10/28/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10979041,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 OLDSMOBILE SILHOUETTE COMPLETELY SHUTS DOWN WHILE DRIVING. IT DOESN'T MATTER IF I'M GOING 30MPH OR 65MPH.  EVERYTHING STOPS. THIS IS A SCARY DANGEROUS SITUATION WHILE HIGHWAY DRIVING! THE CAR IS OTHERWISE PERFECT AND HAS 47K MILES.  I BROUGHT IT TO THE DEALER LAST NOVEMBER, AND WAS TOLD THEY DON'T KNOW WHAT IT IS. I CONTACTED GM THREE WEEKS AGO, AND NOW IT'S BACK AT THE DEALER. HELP, PLEASE",
        "vin": "1GHDX03E52D"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/17/2016",
        "dateOfIncident": "08/10/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10896597,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE PLUS MANY OTHER MULTIPLE YEAR AND MAKE EXPENDED BASE   GM MINI VANS ARE DEVELOPING GASOLINE LEAKS AT THE TOP OF THE FUEL TANK DUE TO WORN PLASTIC SEAL.  THE ONLY REPAIR IS REPLACEMENT OF THE FUEL TANK, THAT RETAILS AROUND $800.  THERE IS NOT A REPLACEMENT TANK IN THE UNITED STATES AND NO PARTS BEING MANUFACTURED... MY CAR IS A LOW MILEAGE VEHICLE IN EXCELLENT SHAPE BUT DANGEROUS TO DRIVE DUE TO LEAKING FUEL..  MUST I HAVE TO DISPOSE OF CAR BECAUSE NO PARTS AVAILABLE?  CAN GM START REPRODUCING THE NEEDED PART.?",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/05/2015",
        "dateOfIncident": "11/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10788527,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRICAL SYSTEM SHUTS DOWN AND IT HAS SECURITY LIGHT COME ON. IT SHUTS THE ENGINE AND ALL POWER OFF. THE VAN WAS ON THE HIGHWAY WHEN THIS HAPPENED. A REAL SAFETY HAZARD.",
        "vin": "1GHDX03E62D"
    },
    {
        "components": "AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2014",
        "dateOfIncident": "06/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10650374,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE NEWS HAD THE AIR BAG RECALL AND THE GM PEOPLE SAY WE HAVE TO WAIT A MIN. OF 60 DAYS FOR THE  NOTICE. THE GM DEALER HAD NO KNOWLEDGE OF  AIRBAG RECALL !! ALSO,THE FUEL GAUGE HAS GONE BAD ON SEVERAL OLDSMOBILE VANS AND YOU DO NOT KNOW HOW MUCH GAS CAR HAS THAT CAN BE DANGEROUS ON A HIGHWAY  AND A RECALL WAS NEVER DONE ON FUEL GAUGES.  *TR",
        "vin": "1GHDX13E52D"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "09/02/2014",
        "dateOfIncident": "08/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630163,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 OLDSMOBILE SILHOUETTE. THE CONTACT STATED THAT THE SLIDING DOORS ON BOTH THE DRIVER AND PASSENGER SIDE FAILED TO UNLOCK. THE DOORS ALSO FAILED TO UNLOCK VIA THE MANUAL OVERRIDE FUNCTION. THE FAILURE PREVENTED THE PASSENGERS FROM EXITING THE VEHICLE. THE FAILURE OCCURRED ON SEVERAL OCCASIONS. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "1GHDX03EX2D"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/14/2011",
        "dateOfIncident": "11/18/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401854,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS GAUGE NOT WORKING, REGISTERS FULL EVEN WHEN NOT FULL.  LOW FUEL LIGHT WILL COME ON IF YOU IDLE FOR  A FEW MINUTES. AT THE SAME TIME THIS STARTED THE ABS LIGHT  SERVICE TRACTION SYSTEM CAME ON.  THIS HAS ALSO OCCURRED WITH OUR 2002 BUCK CENTURY  AT APPROXIMATELY THE SAME # OF MILES AND AGAIN BOTH THE GAS GAUGE READS INACCURATELY AND THE ABS LIGHT CAME ON.***",
        "vin": "1GHDX03E12D"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,SEATS,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "03/17/2011",
        "dateOfIncident": "02/22/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390467,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IT JUST ALL OF A SUDDEN STOP WORKING  THIS IS A CONSTANT PROBLEM NON STOP I BOUGHT FUSE AND THAT DIDN'T WORK I GOT NEW LIGHTS PARK AID STOP WORKING, BOTH HEATED SEATS STOP WORKING, ELECTRICAL GONE BAD IN THE WHOLE.  *TR",
        "vin": "1GHDX03E52D"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/06/2010",
        "dateOfIncident": "03/10/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369410,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SLOWLY BUT SURELY, SOME OF MY ELECTRICAL SYSTEMS HAVE BEEN FAILING.  IT FIRST STARTED WITH LIGHTS BURNING OUT REPEATEDLY, THEN WENT TO TURN SIGNALS NOT WORKING PROPERLY, THEN WENT TO POWER WINDOWS FUNCTIONING IMPROPERLY, THEN THE TEMPERATURE/MPG/OIL DISPLAY STOPPED FUNCTIONING, THEN I HAD TO REPLACE THE ALTERNATOR AND THE PROBLEMS GOT EVEN WORSE.  I HAVE ALSO HAD ISSUES WITH THE VEHICLE DRIFTING UP TO 3 FEET BACKWARDS IF ON A SLIGHT INCLINE AND IN DRIVE.  PLEASE CHECK INTO THESE ISSUES AND RESOLVE.  I AM SCARED FOR MY FAMILY'S SAFETY DUE TO THE INCREASING ELECTRICAL ISSUES.  I AM BEGINNING TO THINK THIS MAY BE A FIRE HAZARD.  WE HAVE TRIED REPLACING THE SWITCHES FOR THE WINDOWS, THE BULBS AND TAIL LIGHT ASSEMBLY.  THE ISSUES WITH THE WINDOWS GET BETTER WHEN THE SWITCH IS REPLACED AND THEN GET EVEN WORSE THAN BEFORE IN NO TIME FLAT.  IN ADDITION TO THESE ISSUES WE HAVE HAD TO REPLACE THE BEARINGS REPEATEDLY.  *TR",
        "vin": "1GHDX03E42D"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/23/2010",
        "dateOfIncident": "11/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367270,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE HEAT ELEMENT FAIL ON MY 2002 OLDS SILHOUETTE.  THEY REPLACED BOTH SEAT ONCE AND THE LAST TIME A YEAR LATER THE WARRANTY WAS OUT BY 500 MILES SO THEY WOULDN'T HONOR IT EVEN THOUGH I HAVE HAD PROBLEMS WITH IT. *TR",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/23/2010",
        "dateOfIncident": "07/25/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321979,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 OLDSMOBILE SILHOUETTE, RIGHT FRONT WHEEL FELL OFF.    *BF  THE RIGHT FRONT FENDER WAS DAMAGED AND TWO WHEEL STUDS BROKE OFF. OHIO TRAFFIC CRASH REPORT# 10-0539-90. *JB  LETTER UPDATED 04/13/10  *BF                 UPDATED 6/1/10 *CN   UPDATED VOQ 06/07/10*JB",
        "vin": "1GHDX03E72D"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,STRUCTURE,VEHICLE SPEED CONTROL,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "03/31/2008",
        "dateOfIncident": "03/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222931,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONTACT OWNS A 2002 OLDSMOBILE SILHOUETTE.  THE DAY SHE PULLED OUT OF THE PARKING LOT WITH THE VEHICLE, THE ABS LIGHT, AND TRACTION OFF LIGHT CAME ON.  WHEN SHE DROVE OFF THE BRAKE PEDAL AND THE ACCELERATOR PEDAL BOTH BEGAN TO WOBBLE AND VIBRATE.  THE DEALER TOLD HER THAT THE ACCELERATOR PEDAL VIBRATING WILL STOP IF SHE TURNS THE TRACTION SYSTEM OFF.  THAT SAME DAY. WHEN COMING OUT OF THE DRIVEWAY BOTH THE ACCELERATOR PEDAL AND THE BRAKE PEDAL WOULD VIBRATE AND WOULD NOT LET HER PRESS THE BRAKES OR ACCELERATE UNTIL IT STOPS VIBRATING.  THE KEYLESS REMOTE WORKED THE FIRST TIMES SHE EXAMINED THE VEHICLE.  ONCE OFF THE PARKING LOT IT WOULD NOT WORK, IT WOULD ONLY LOCK THE VEHICLE AND IT MADE THE ALARM SYSTEM ACTIVATE.  SHE WAS TOLD BY THE DEALER TO BUY A BATTERY FOR THE KEYLESS REMOTE.  WHEN SHE DID, IT STILL DID NOT WORK.  THE ALARM SYSTEM WOULD ONLY DEACTIVATE WHEN SHE OPENED THE DRIVERS DOOR WITH THE KEY AND TURNED THE VEHICLE ON.  ALL OF THE TIRES ON THE VEHICLE HAD TO BE REPLACED.  THE CURRENT MILEAGE WAS 76,000, AND THE FAILURE MILEAGE WAS 75,900.  THE PURCHASE DATE WAS 03/14/2008.  KG",
        "vin": "1GHDX13E02D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/02/2007",
        "dateOfIncident": "10/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207794,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD GASKET LEAKING COOLANT EXTERNALY.AND ENGINE OIL LEAKING INTO COOLANT INTERNALY. INTAKE GASKET FAILURE. INTAKE GASKET WAS REPLACED.  *TR",
        "vin": "1GHDX03E12D"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, AIR,ENGINE AND ENGINE COOLING,POWER TRAIN,VISIBILITY,STRUCTURE,TIRES,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/26/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10191801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            },
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMSPO",
                "productModel": "BATTERY",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2002 SILHOUETTE, 39000 MILES.  FRONT WHEEL BEARINGS FAILED.  HAD REPAIRED, WITHIN 50 MILES AFTER PICKING UP FROM DEALERSHIP, THERE WAS A GRINDING WHEN TURNING RIGHT.  BOTH HEATED SEATS DIDN'T HEAT.  DRIVER'S  SIDE WINDOW OPERATED EXTREMELY SLOW. INTAKE MANIFOLD GASKET NEEDED  REPLACEMENT!, $1000!,  39000 MILES FOLKS!  AIR SUSPENSION DID NOT OPERATE CRACKLED.  POWER DOORS DID  NOT OPEN WHEN SOMETHING GOT  IN THE WAY. BRUISED SHOULDER BECAUSE OF THIS. PREMATURE TIRE WEAR, REPLACED  TIRES AT 30,000 MILES.  ALL SCHEDULED MAINTENANCE DONE. STORED IN A GARAGE MORE HIGHWAY MILES THAN CITY.  HOW DID GM WANT TO HELP ME?  DEALER DID PAPERWORK WHEN PURCHASING, TRIED TO PUSH OFF A CHEAPER MODEL ON AN ELDERLY WOMEN,  AND CHANGED THE PROMISED 5 YEAR WARRANTY TO A 3 YEAR WARRANTY.  MOTHER WAS JUST SO HAPPY SHE GOT THE RIGHT VEHICLE TO TAKE HOME, SHE NEVER NOTICED THE CHANGE IN THE WARRANTY.  TRIED TO WORK WITH THE DEALER ON REPAIRS SINCE THERE  WERE ONLY 39000 MILES, AND WE GOT A 'GEE, REALLY SORRY MA'AM, I UNDERSTOOD, BUT THERE WASN'T ANYTHING WE COULD  DO ABOUT IT.  WENT TO THE GM SERVICE LINE, AND DID NOT GET ANY HELP THERE EITHER, BUT SHE HAD A REAL PURDY FIRST NAME!  SEEMED TO ME THESE  WERE ALL RECURRING PREMATURE KNOWN FAILURES , YET GM DID NOT CARE TO STAND BEHIND THEIR PRODUCT!   IT WAS  A SHAME THEY PUSHED THE 5 YEAR WARRANTY SO EXTENSIVELY WHEN THEY HAD ALL THESE VEHICLES ON THEIR LOTS.  PEOPLE, WE'VE BEEN HAD.  I GREW UP IN OLDSMOBILE, BUT THE MORE I READ ABOUT GM - THE MORE LIKELY I AM TO BUY TOYOTA!   THE GOOD NEWS IS THAT I FOUND A DEALER (NOT CLOSE TO HOME THOUGH) THAT WAS WILLING TO AT LEAST REPAIR THE FIRST SET OF WHEEL BEARINGS FOR $100.  GOT THAT ON MY OWN, NOT THROUGH GM SERVICE HELP.  I JUST HOPE THEY WILL BE AS NICE FOR THE NEXT SET OF WHEEL BEARINGS THAT NEED REPLACEMENT AND FOR THE GASKET THAT WAS JUST DISCOVERED. STILL WAITING TO HEAR FROM GM ON THE OTHER ISSUES. (NOT AS AN IMMEDIATE NEED AS THE WHEEL BEARINGS)  I'M NOT HOLDING MY BREATH.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER,VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/17/2007",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188086,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NO EVENT, JUST FAILED. WINDOWS, FUEL SENSOR AND A/C.  2 . FRONT WINDOW  ON 1995 OLDS SILHOUETTE VAN, FAILED AND WAS REPLACED. BOTH FRONT  WINDOWS  HAVE NOW FAILED.  CONSEQUENCES ARE WE ARE UNABLE TO ROLL WINDOWS UP IN INCLEMENT WEATHER.  WINDOW ON FRONT PASSENGER SIDE,2002 SILHOUETTE VAN HAS FAILED, WILL ROLL DOWN BUT NOT UP., FOR FROM 1 HOUR TO SEVERAL HOURS.. MOTOR WILL HAVE TO BE REPLACED IN ALL, DEALER SAYS.    CONSEQUENCES ARE WE CAN'T ROLL WINDOW UP IN INCLEMENT WEATHER.  2. FUEL SENSOR HAS FAILED, GAS GAUGE DOES NOT WORK, STUCK IN CONSTRUCTION ZONE WHEN ON TRIP AND WE SHOWED FULL TANK OF GAS BUT THEN ALARM WENT OFF AND SHOWED EMPTY. 10 MILES FROM STATION. VERY NERVE WRACKING AS WE WOULD HAVE BEEN STUCK.  MECHANIC PUT A TESTER ON IT, ALTHOUGH THE ALARM WENT OFF AS HE WAS DOING THIS, THE TANK HAD 3/4 FULL..IT ALSO SHOWED IT HAD TWO TIMES CAPACITY OF FUEL IN IT. MECHANIC WAS PUZZLED BY IT ALSO.. SAID IT WAS SENSOR AND HAS TO BE REPLACED.  THE GAUGE SHOWS FULL UNTIL IT IS EMPTY THEN DROPS TO EMPTY AND ALARM SOUNDS. GAUGE GOES TO EMPTY WHEN IT IS SHUT OFF BUT THEN SHOWS FULL WHEN YOU START VAN.  3. MOTOR WAS REPLACED ON  1995 VAN BY A DEALER, THEN BOTH WINDOWS FAILED.  ON 2002 VAN, WE WILL HAVE TO REPLACE WINDOW MOTOR ON DRIVERS SIDE.  BAD PART IS GETTING SNOWED AND RAINED ON WHEN WINDOW STICKS AND WON'T GO UP. AND BEFORE WE HAD A/C FIXED WE COULDN'T USE WINDOWS FOR AIR. HAVE TO REPLACE FUEL SENSOR ON 2002.  AD DEALER REPLACE FRONT AC COMPRESSOR/CONDENSER ON 2002 VAN FOR FRONT, BACK IS STILL NOT WORKING. DEALER  SAYS SOMETHING IS IN REAR OF VAN THAT HAS TO BE FIXED AS IT DON'T SWITCH FROM HOT TO COLD, STAYS ON HOT. AND IT IS EXPENSIVE.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/07/2006",
        "dateOfIncident": "10/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172872,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 OLDS SILHOUETTE MINIVAN WHICH HAD TO HAVE THE INTAKE MANIFOLD GASKET REPLACED.  IN TALKING TO THE MECHANIC WHO FIXED IT, THIS IS SO COMMON WITH THESE GM VEHICLES THAT IT IS LAUGHABLE.   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EXTERIOR LIGHTING,VISIBILITY,LATCHES/LOCKS/LINKAGES,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/14/2006",
        "dateOfIncident": "01/02/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168292,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SLIDING DOOR PROBLEMS SINCE PURCHASE.  DRIVER ELECTRIC SEAT \"REPAIRED\" SEVERAL TIMES AND STILL DOES NOT WORK.  DEALER REPAIRED REAR COMPRESSOR AND BROKE COVER LATCH.  THEY PUT A HOLE IN THE FRONT BUMPER AT THIS TIME.  PASSENGER FRONT WINDOW CHOOSES NOT TO WORK AT RANDOM AND BACK LEFT SIDE WINDOW SOMETIMES DOES NOT CLOSE. TAPE PLAYER HAS ATE TAPES SINCE PURCHASE.  NO AIR CONDITIONING!  *JB",
        "vin": "1GHDX13E32D"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/20/2006",
        "dateOfIncident": "11/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148189,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2002 OLDSMOBILE SILHOUETTE.  IN NOVEMBER, 2005 WE STARTED HAVING TROUBLE WITH STEERING VIBRATION AND SEVERE PULLING TO THE RIGHT.  IT TURNS OUT A LEFT TIE ROD END WAS FAILING.  THE MECHANIC TOLD US THAT IT WAS CLOSE TO FAILURE AND IF IT DID WE WOULD GET IN AN ACCIDENT.  WE GOT THAT FIXED BUT NOW WE HAVE THE SAME PROBLEM AND IT TURNS OUT THAT THE SAME TIE ROD ON THE RIGHT SIDE HAS AN END THAT IS FAILING.   *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/2005",
        "dateOfIncident": "11/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143275,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE GETTING NEW TIRES INSTALLED THE MECHANIC NOTIFIED ME OF A WORN LEFT FRONT WHEEL HUB/BEARING.  THE VAN HAS 67,000 MILES ON IT.  THIS IS UNACCEPTABLE!  I HAVE NOT HAD REPAIRS MADE YET, BECAUSE ESTIMATES ARE ALMOST $500.00.  *NM",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "11/19/2005",
        "dateOfIncident": "11/02/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE SEAT HEATER FAILED.  VERY COSTLY FOR THE DEALER TO REPAIR IT AND YOU CAN'T BUY THE HEATING PAD FROM A JUNK YARD.  *NM",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/26/2005",
        "dateOfIncident": "01/06/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131610,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER WAS CONCERNED THAT HIS SEAT HEATER BURNED OUT EVERY YEAR. HEATERS BURNED OUT 3 TIMES IN THE LAST 3 WINTERS. THE LAST TIME DEALER DID NOT WANT TO FIX IT, BUT EVENTUALLY DID. CONSUMER FELT THAT MANUFACTURER SHOULD DO SOMETHING ABOUT THIS PROBLEM. THE HEATERS GO OUT EVERY WINTER. ALSO, THE  HEATERS GET EXTREMELY HOT,  AND  THIS MAY  BE A FIRE HAZARD.*AK",
        "vin": "1GHDX03EX2D"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,SEAT BELTS,SEATS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/24/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114146,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AWD DISABLE AND ABS LIGHTS ILLUMINATED.  LEFT REAR WHEEL BEARING AND HUB ASSEMBLY FAILED AND WERE REPLACED (FOUR TIMES).*AK  THE EVAP SOLENOID, FUEL SENDER AND PUMP ASSEMBLY WERE REPLACED.  THE HEATING ELEMENT FOR THE FRONT DRIVER'S SEAT FAILED TWICE.  THE RIGHT REAR SEAT BELT FAILED.  THE RIGHT POWER SLIDING DOOR ACTUATOR MODULE FAILED.  REAR WIPER FAILED INTERMITTENTLY.  A/C CONDENSER FAILED.  ENGINE FAILED.   *NM",
        "vin": "1GHDV13E82D"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/22/2005",
        "dateOfIncident": "01/15/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133768,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER STATED THAT THERE WAS A RECALL 04V597000 ON THE LATCHES ON A 2002 OLDSMOBILE SILHOUETTE. HOWEVER, THIS VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO VIN.  THE CONSUMER CONTACTED GM ,AND THEY COULD NOT TELL HIM WHY THIS VEHICLE WAS NOT INCLUDED IN THE RECALL. HE HAD THE SAME DOOR HANDLES AND LATCHES THAT WERE  BEING REPLACED. THE CONSUMER WAS CONCERNED FOR THE SAFETY OF  PASSENGERS .  THEY WERE AT RISK FOR THE SAME INCIDENTS THAT WERE OCCURRING TO OTHERS. THE CONSUMER HAS BEEN IN CONTACT WITH GM TWICE,  AND THEY STILL COULD NOT ANSWER THE QUESTION. *AK",
        "vin": "1GHDV03E32D"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/12/2005",
        "dateOfIncident": "08/12/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132652,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT LIGHT AND TURN SIGNAL ASSEMBLY OF THIS VAN AND SISTER VEHICLES PONTIAC MONTANAS AND CHEVROLET VENTURES FILL WITH MOISTURE AND KEEP THE FULL LIGHT FROM SHINING ON THE ROADWAY AND BEING FULLY VISIBLE TO OTHER VEHICLES - THIS HAS OCCURED IN MY VAN TWICE AND I HAVE NOTICED AT LEAST 10 OTHER VANS OF THESE MAKES WITH THE SAME PROBLEM",
        "vin": "1GHDX03E62D"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/15/2005",
        "dateOfIncident": "07/07/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128899,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES, AIR CONDITIONING, WHEEL HUB & ABS, FUEL PUMP. WHEEL BEARINGS DISABLE AWD. BEEN REPLACED 8 TIMES. FUEL PUMP WENT OUT AT 52000 PART ALONE $400. AIR CONDITIONING OUT WHEN BOUGHT IT. THEY SCAMMED ME AND PUT A SEALANT IN THE CONDESER AND SOLD IT IN THE WINTER. THESE ITEM SHOULD BE REPLACED BY GM BECAUSE ITS AN ON GIONG PROBLEM WITH THE BEARING HUBS AND A BAD DESIGN ON THE CONDENSER.  MY FATHER INLAW WORKS FOR GM ALONG WITH OTHER FAMILY MEMBERS. I WILL NOT BUY ANOTHER GM PRODUCT AGAIN!!!  P.S. WHO EVER WAS THE BRIGHT ONE TO DESIGN TAIL LIGHT THAT PLUG IN FROM THE TOP AND LET WATER FILL YOU TAIL LIGHT SHOULD BE FIRED!!!DK",
        "vin": "11111111111"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/22/2005",
        "dateOfIncident": "06/20/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126270,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STOP LAMP BULBS ARE SHORTING OUT AT CONNECTOR TO SOCKETS. THIS HAS HAPPENED FOUR TIMES SO FAR. THREE TIMES ON THE RIGHT SIDE AND ONCE ON THE LEFT SIDE. THE RESULT IS A MELTED BASE ON OEM BULBS WITH PLASTIC BASES AND AN INOPERABLE BRAKE LIGHT. FREQUENT FAILURES OF STOP LAMPS CREATES A SAFETY HAZARD. 2 OF THE BULBS ARE AVAILABLE",
        "vin": "1GHDV13E02D"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/16/2005",
        "dateOfIncident": "04/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114143,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AWD DISABLE AND ABS LIGHTS ILLUMINATED.  LEFT FRONT WHEEL BEARING AND HUB ASSEMBLY FAILED AND WAS REPLACED.*AK",
        "vin": "1GHDV13E82D"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/16/2005",
        "dateOfIncident": "12/16/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114145,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AWD DISABLE AND ABS LIGHTS ILLUMINATED.  RIGHT FRONT WHEEL BEARING AND HUB ASSEMBLY FAILED AND WERE REPLACED.*AK",
        "vin": "1GHDV13E82D"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/16/2005",
        "dateOfIncident": "02/05/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114144,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AWD DISABLE AND ABS LIGHTS ILLUMINATED.  RIGHT FRONT WHEEL BEARING AND HUB ASSEMBLY FAILED AND WERE REPLACED.*AK",
        "vin": "1GHDV13E82D"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/10/2005",
        "dateOfIncident": "02/16/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113893,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED MY CAR FOR A TOTAL OF 3 WEEKS.  WHEN TAKING THE CAR FOR A TEST DRIVE BEFORE BUYING IT, I NOTICED A \"CLICKING\" IN THE STEERING.  I WAS TOLD IT WOULD BE FIXED.  I HAVE ALREADY HAD THE CAR IN 3 TIMES, AND THE PART IS STILL NOT FIXED.  AFTER BRINGING IT TO AN INDEPENDANT DEALER, TURNS OUT THE SR COIL NEEDS REPLACED.  ALSO, THE ENGINE LIGHT CAME ON AND THE CAR REVS LOUDLY UNTIL 30MPH.  THAT HAS BEEN DIAGNOSED AS THE ENGINE FAN BEING BLOWN.  I ALSO COMPLAINED THAT THE ALL WHEEL DRIVE LIGHT WAS COMING ON AND I WASN'T GETTING ANY TRACTION.  APPARENTLY THE TRANSFER CASE CLUTCH PLATES ARE SLIPPING!  NOT ONLY WAS THIS VEHICLE ALLOWED TO BE SOLD WITH THESE MAJOR MALFUNCTIONS, BUT THE DEALERSHIP IS ALSO FIGHTING COVERING THE COSTS.  I RESEARCHED THE HISTORY OF THIS VEHICLE (AFTER BUYING IT), AND FOUND THAT IT HAS BEEN SEEN ON SEVERAL OCCASIONS FOR A MULTITUDE OF THINGS.  I AM EXTREMELY DISAPPOINTED!*AK",
        "vin": "1GHDT13S522"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "01/25/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111122,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES ARE WORN ON INSIDE, THERE ARE DEEP ALMOST TO THE CORD INDENTATIONS OR SEPARATIONS.  TIRE WEAR DUE TO BAD FRONT-END ALIGNMENT.    *BF    THE TIRES WERE WORN IN THE INSIDE ALMOST TO THE CORD INTENTIONS OR SEPARATIONS AND THE EDGES OF THE STEEL BELTS WERE EXPOSED.  THE ORIGINAL BACK TIRES WERE ON THE FRONT OF THE VEHICLE FOR LESS THAN 8K MILES AND IN A SHORT PERIOD THEY BEGUN THE SAME IRREGULAR WEAR PATTERN AS THE FRONT TIRES.   *SC",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/26/2004",
        "dateOfIncident": "12/02/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104503,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR TAIL LIGHTS MALFUNCTION INTERMITTENTLY. USUALLY AFTER HEAVY RAIN. BULBS BECOME COVERED WITH CORROSION,AND RUST. REPAIR EFFECTED BY OLDS DEALER ONLY TEMPORARILY CORRECTS PROBLEM.DASH INDICATOR SHOWS OPERATIONAL STATUS,LITES DO NOT BLINK. HI-WAY TRAVEL BECOMES SAFETY ISSUE OF UNSAFE LANE CHANGE,NOT DRIVER ERROR.  *AK",
        "vin": "1GHDX03E42D"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/22/2004",
        "dateOfIncident": "04/18/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109067,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THERE WAS UNEVEN TIRE WEAR.  THE TREAD SURFACE LIFTED OFF OF THE CAP.  THERE WERE CHUNKS OF TREAD THAT HAD BROKEN OFF.   *SC    *JB",
        "vin": "1GHDX03E02D"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/17/2004",
        "dateOfIncident": "11/17/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101218,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE THE VEHICLE WAS GETTING THE TIRES ROTATED MECHANIC INFORMED THE CONSUMER THAT BOTH REAR WHEEL BEARINGS NEEDED TO BE REPLACED. *AK",
        "vin": "1GHDX23E62D"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/23/2004",
        "dateOfIncident": "09/23/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 OLDSMOBILE SILHOUETTE VAN   THE FRONT DOORS ARE NOT PROPERLY SEALED AND ALLOW WATER TO INTRUDE. THIS HAS CAUSED WATER DAMAGE TO THE ELECTRICAL COMPONENTS IN THE DOOR. THE WINDOW SWITCHES ARE FAILING AND HAVE HAD TO BE REPLACED, WHICH OLDS SERVICE TECH'S STATED WAS DUE TO WATER DAMAGE. THE REPAIR PERSON AT THE LOCAL DEALERSHIP IN SARASOTA SAID THAT IT IS A COMMON PROBLEM FOR THE MODEL. I AM WORRIED ABOUT FUTURE BODY DAMAGE AND CORROSION. ALSO WORRIED ABOUT DOOR LOCKS FAILING AND RELATED SAFETY ISSUES.    *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/28/2004",
        "dateOfIncident": "08/28/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS CHECKING THE TIRES FOR WEAR I NOTICED THAT THE INSIDE OF THE TIRE, WHERE THE TREAD MEETS THE SIDEWALL, WAS DAMAGED.  IT APPEARS THAT THERE IS A FLANGE OR DISC AT THE BOTTOM OF THE SPRING/SHOCK ASSEMBLY THAT'S COMING IN CONTACT WITH THE TIRE.  LESS THAN 1 INCH CLEARANCE.  PROBABLY HAPPENS WHEN THERE'S DOWN FORCE FROM HITTING A POT HOLE, SPEED BUMP OR SUDDEN STOP.  TREAD IS GOOD BUT SEPARATING FROM THE SIDEWALL, STEEL BELTS VISIBLE.  30,000 MILES, GOODYEAR, P225/60R/16, I ASSUME ORIGINAL EQUIPMENT.  BOUGHT USED AT 9K, NO RECORD OF ROTATING THE TIRES.  REAR TIRE HAS SLIGHT DAMAGE SUGGESTING IT MAY HAVE BEEN ON FRONT AND ROTATED OUT.  IF OWNERS ARE ONLY LOOKING AT THE TREAD AND NOT THE INSIDE SIDEWALL I THINK THERE'S A POTENTIAL FOR BLOWOUT AND TIRE SEPARATION.  I NOTE 2 FAILURES ALTHOUGH THE TIRES HAVE NOT BLOWN, THEY WILL NEED TO BE REPLACED. WILL HAVE VEHICLE SERVICED THIS WEEK.   *JB",
        "vin": "1GHDX13E52D"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/12/2004",
        "dateOfIncident": "07/11/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080873,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PROBLEM WITH WIND NOISE COMING FROM BOTH, BUT PRIMARILY THE LEFT A-PILLAR/S.  I GET THE NOISE AT HIGHWAY SPEEDS AND HEADING INTO A HEAD WIND.  IT CAUSES AN EXTREMELY LOUD  LOW PITCH WHISTLING NOISE THAT IS CONSTANT WITH THE WIND BLOWING.   IT HAS BEEN IN THE SHOP(USING AT LEAST 3 DIFFERENT ONES)  6 TIMES FOR THE SAME ISSUE WITH NO SOLUTION.   *LA",
        "vin": "1GHDV03E22D"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2004",
        "dateOfIncident": "12/21/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079132,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST PRIOR TO 40,000 MILES, MY SERVICE ENGINE SOON LIGHT CAME ON AND MY ABS DISABLED LIGHT ILLUMINATED.  AFTER I STOPPED THE CAR AND RESTARTED IT, THE LIGHTS WENT AWAY.  THEN A FEW DAYS LATER IT HAPPENED AGAIN AND I BEGAN TO NOTICE A RUMBLING SOUND COMING FROM THE FRONT OF THE VEHICLE.  THE NOISE CHANGED PITCH DEPENDING ON THE SPEED OF THE CAR.  IT ALMOST SOUNDED LIKE THE TRANSMISSION WAS ROARING PRIOR TO CHANGING GEARS, BUT IT WASN'T THE TRANSMISSION ITSELF BECAUSE THE NOISE DID NOT CORRELATE TO ACTUAL GEAR CHANGES. I TOOK THE CAR TO A CHEVY DEALER SERVICE DEPARTMENT AND THEY DETERMINED THAT THE WHEEL BEARINGS (WHICH IS A WHOLE HUB ASSEMBLY THAT INCLUDES ABS AND AWD COMPONENTS) IN THE FRONT DRIVERS SIDE NEEDED TO BE REPLACED.  A COUPLE OF WEEKS LATER, THE REAR PASSENGER SIDE WHEEL BEARINGS (AND THE WHOLE HUB ASSEMBLY)HAD TO BE REPLACED.  AS SOON AS I GOT THE CAR BACK, THE NOISE WAS STILL AUDIBLE IN THE FRONT AND THEY REPLACED THE FRONT PASSENGER SIDE HUB ASSEMBLY.  WHEN THE CAR REACHED 54,000 MILES, THE RUMBLING NOISE WAS AGAIN AUDIBLE FROM THE REAR AND THE DEALER REPLACED THE FINAL HUB ASSEMBLY IN THE DRIVERS SIDE REAR.  THE DEALER TOOK THE CAR FOR A TEST DRIVE AND THE NOISE WAS STILL PRESENT AND THEY DETERMINED THEY HAD TO REPLACE THE RIGHT REAR HUB ASSEMBLY FOR THE 2ND TIME.  THIS IS 5 HUB ASSEMBLIES BETWEEN 40,000 AND 54,000 MILES ON THE CAR.  THERE IS NO WAY THAT ANYONE WILL CONVINCE ME THAT THIS IS NOT A MANUFACTURING DEFECT.  THIS CAR HAS ALL WHEEL DRIVE.  AT THIS POINT, IT SEEMS THAT THE REPLACING OF THESE HUB ASSEMBLIES WILL BE AN ONGOING MAINTENANCE ISSUE THAT COULD AFFECT THE WHEEL BEARINGS, ABS OR THE AWD SYSTEM, OR ALL OF THE ABOVE.  *JB",
        "vin": "1GHDV03E82D"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/25/2004",
        "dateOfIncident": "05/29/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10078780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY ONE YEAR OLD DAUGHTER GOT HER HAND CAUGHT IN THE PASSENGER SIDE SLIDING DOOR.  THE WHOLE SYSTEM MALFUNCTIONED.  AND WE COULD NOT GET THE DOOR TO OPEN WITH THE ELECTRICAL BUTTONS.  WE TRIED WITH THE CAR ON AND OFF.  AND WE ALSO COULD NOT OPEN THE DOOR MANUALLY FROM THE INSIDE OR OUTSIDE.    WE IMMEDIATLY CALLED 911.  AND ENDED UP HAVING TO PRY THE DOOR OPEN WITH CROW BARS.  ONE ON THE INSIDE AND ONE ON THE OUTSIDE.  *AK    THIS IS THE EMAIL I SENT TO OLDSMOBILE.  AFTER THEY RECEIVED MY EMAIL.  THEY DETERMINED ON THEIR OWN TO FILE A PRODUCT ALLEGATION.      THE FILE # IS 1-222720667    I WAS ASSIGNED TO A REPRESENTATIVE WHO TOLD ME THEY MAY NOT PAY TO HAVE MY CAR FIXED, EVEN THOUGH IT IS UNDER WARRENTY.  I WAS ALSO TOLD ON THE DAY I DROPPED MY CAR OFF (JUNE 8TH,2004)  IT WOULD BE TEN DAYS AT THE MOST TO COME TO A CONCLUSION AFTER THE PRIVATE INVESTIGATOR EXAMINDED THE VEHICLE.    I DID SPEAK WITH MY GM REPRESENTATIVE LARRY MEEKS YESTERDAY.  HE SEEMED VERY SHORT AND ANNOYED AT ME.  WERE IN THE BEGINNING HE WAS APPOLIGETIC ABOUT MY DAUGHTERS HAND AND WANTED TO BE HELPFUL.  HE SAID HE DIDN'T FILE THE REPORT TO HAVE THE CAR LOOKED AT UNTIL JUNE10TH AT 2PM.  BUT ON THE PHONE ON JUNE 8TH AT 12NOON HE DECLARED TO ME THAT IT WOULD BE TEN DAYS FROM THEN.  JUNE 8TH WAS THE DAY I DROPPED THE CAR OFF AT THE DEALERSHIP.    I WAS UNDER THE IMPRESSION THAT GM FILED THE CLAIM ON THEIR OWN BECAUSE THEY WERE INTERESTED IN MAKING SURE THIS DOESN'T HAPPEN TO ANYONE ELSE.  I WAS ALSO TOLD THAT THERE HAVE NEVER BEEN ANY REPORTS FILED OF INJURIES TO OTHER PEOPLE FROM THE SLIDING DOORS.  THIS IS APPARENTLY FALSE.      AFTER REVIEWING YOUR WEB SITE AND READING THROUGH SOME COMPLAINTS.  I FELT LIKE I HAD BEEN LIED TO BY GM.  AND IT IS POSSIBLE THAT THEY ONLY HAVE THEIR OWN INTEREST AT HEART.   COMPLAINT #10025827  SURE STUCK OUT IN MY MIND.    AND THAT IS WHY I AM FILING MY COMPLIANT.  BECAUSE ONE SAD AND DISHEARTENED MOTHER HAS NO POWER AGAINST A BIG CO. LIKE GM.",
        "vin": "1GHDV03E42D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/14/2004",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10076213,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE WAS TURNED OFF AND WHEN THE CONSUMER CAME BACK INTO  VEHICLE IT WOULD NOT START.  AFTER ABOUT AN HOUR TO TWO HOURS VEHICLE WOULD START.   THIS PROBLEM OCCURRED FIVE TIMES SINCE APRIL 2003.  DEALER EXAMINED THE VEHICLE SEVERAL TIMES AND COULD  NOT DUPLICATE OR RESOLVE THE PROBLEM.  *AK",
        "vin": "1GHDX13EX2D"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/16/2004",
        "dateOfIncident": "02/20/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10062368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING WITH MY FAMILY, TRAFFIC CAME TO A SUDDEN STOP AND MY SON (5YRS, IN A CAR SEAT), WHO WAS SITTING IN THE FIRST ROW BEHIND THE PASSENGER, SLAMMED HIS HEAD AGAINST THE BACK OF THE SEAT. MY WIFE BLAMED ME FOR NOT FASTENING HIM IN CORRECTLY. SO I LET HER DO IT, AND WE BOTH YANKED ON THE SEAT BELT TO MAKE SURE IT WAS OK. THEN IT HAPPENED AGAIN. MY WIFE TOOK THE VAN TO THE DEALER TO GET A NEW LATCH. WHILE WE WERE WAITING FOR THE PART TO ARRIVE, I WAS DRIVING AGAIN WITH MY FAMILY WHEN THE LIGHT TURNED YELLOW AND I SLAMMED ON THE BRAKES. MY SON NOW SITTING IN THE BACK ROW IN HIS CAR SEAT, AGAIN HIT THE BACK OF THE FRONT PASSENGER SEAT. NOW THE DEALER SAYS THAT THEY NEVER TOLD US THEY WOULD GET US ANOTHER PART, AND THAT WE HAD TO CALL GM. THEY SAID THEY WOULD SEND A REP OUT AND NEVER HAVE. FURTHERMORE WE RECEIVED A NOTICE THAT SAID OUR PARTS WERE IN AFTER THEY TOLD US THAT THEY COULDN'T GET THE PARTS. ALL WE WANT IS TO HAVE THE VEHICLE TESTED UNDER HARD BRAKING AND THE TWO LATCHES REPLACED. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/22/2004",
        "dateOfIncident": "06/16/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10055652,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER'S VEHICLE WAS HIT ON THE DRIVER'S SIDE DOOR BY ANOTHER VEHICLE. UPON  IMPACT AIR BAGS DID NOT DEPLOY.  THE DRIVER   SUSTAINED TWO BROKEN RIBS, AND WAS TAKEN TO THE EMERGENCY ROOM TO RECEIVE TREATMENT.   *AK   THE VEHICLE WAS TOTALED.  THE MANUFACTURER FELT THAT THE IMPACT WASN'T SUFFICIENT ENOUGH TO DEPLOY THE DRIVER'S AIRBAG.  (SIDE PUSHED IN 11 1/2 INCHES)   *SC",
        "vin": "1GHDX03E62D"
    },
    {
        "components": "SEAT BELTS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "08/15/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071259,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SEATBELT-2ND ROW PASSENGER SIDE BELT KEEPS PULLING TIGHTER AND TIGHTER AND LOCKING. CHILDREN WOULD REFUSE TO WEAR IT BECAUSE OF THE DISCOMFORT. REPLACED AND SEEMS FINE NOW.  COMPUTER CONTROL- STILL ONGOING, BATTERY LIGHT KEEPS COMING ON AND OFF, ALTERNATER HAS BEEN REPLACED, STILL HAPPENING. SERVICE TRACTION CONTROL,TRACTION CONTROL OFF INDICATOR LIGHT, ABS INDICATOR LIGHT, AIR BAG INDICATOR LIGHT, ALL COME ON AT THE SAME TIME. VAN HESITATES AND THE HEADLIGHTS GO DIM THEN BRIGHT. DEALER HASN'T BEEN ABLE TO PINPOINT TROUBLE BUT AFTER THEY WORK ON IT, IT GOES AWAY FOR ABOUT 3 WEEKS AND STARTS AGAIN.",
        "vin": "1GHDX03E62D"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051946,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT THE  ACTUATOR  WHICH OPERATED THE AUTOMATIC SLIDING DOORS ON THE PASSENGER'S SIDE. THE AUTOMATIC SLIDING DOORS HARDLY OPERATED.*AK",
        "vin": "1GHDX13E8YD"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "09/24/2003",
        "dateOfIncident": "09/16/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039466,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIMES THE SLIDING DOOR WILL NOT OPEN AND NOW HAS OPENED WHILE DRIVING DOWN THE ROAD. I HAVE TAKEN THE VAN IN THIS MAKES THE 10TH TIME TO HAVE THE DOORS FIXED. THE DEALER SERVICE DEPT. SAYS THEY FIXED IT AND THEY DIDN'T.  THE BACKUP SENSORS WILL NOT WORK.  HAVE TAKEN IT IN 2 TIMES TO GET IT FIXED. THE CAN IS IN THE SHOP NOW FOR OVER 1 WEEK AND THEY TOLD ME IT WAS FIXED AND I TOLD THEM I WAS TAKING IT TO MY LAWYERS OFFICE AND THEY CHANGED THEIR MIND AND SAID THAT IS WASNT FIXED AND THEY HAVE HAD IT THERE FOR 1 WEEK NOW.  I HAVE HAD THE PROBLEM WITH THE DOOR SINCE RIGHT AFTER I TOOK DELIVERY OF THE VAN WHEN PURCHASING IT.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/22/2003",
        "dateOfIncident": "06/14/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031739,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "MICHELIN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING ON HIGHWAY, THE LEFT FRONT TIRE EXPERIENCED A BLOWOUT AT THE SIDEWALL WHICH RESULTED IN THE TREAD SEPARATION.  HOWEVER, THE SIDEWALL REMAINED ON THE RIM.  TIRE INFO:  MICHELIN 225/60R16  DOT-HD3VCTHX1802 10-11K MILES ON TIRE NOT ORIGINAL LEFT FRONT TIRE.   *PH     *SCC   *NLM",
        "vin": "1GHDX13E22D"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/10/2003",
        "dateOfIncident": "07/10/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10025827,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER'S FINGERS WERE CRUSHED IN MY PARENTS AUTOMATIC SLIDING DOOR ON THEIR 2002 OLDSMOBILE SILOUTTE MINIVAN.  THE FINGERS BECAME LODGED ON THE INSIDE BACK OF THE DOOR AFTER SHE PUSHED THE BUTTON TO CLOSE THE DOOR AND REACHED BACK FOR HER SEATBELT.  THE DOOR WOULD NOT OPEN, EITHER BY THE BUTTON OR THE INSIDE OR OUTSIDE DOOR HANDLE.  HER FINGERS REMAINED CAUGHT FOR 20 MINUTES WHILE WE WAITED FOR RESCUE.  (911 WAS CALLED AND THEY SENT A FIRETRUCK OUT).  LUCKILY, THERE WERE NO BROKEN BONES, AND THE EXTENT OF THE INJURY WAS SWELLING AND PAIN.  BUT THE SUPPOSED \"SAFETY\" FEATURE THAT STOPS THE DOOR FROM CLOSING WHEN SOMETHING IS IN THE WAY DID NOT WORK.  AFTER THE INCIDENT, UPON TESTING IT OUT, MY DAD HAD TO PUT A LOT OF BODY WEIGHT AGAINST THE DOOR TO STOP IT FROM OPENING.  HIS ARM BEING IN THE WAY WAS NOT ENOUGH.  CERTAINLY, A CHILD COULD BE SERIOUSLY INJURED OR DIE DUE TO BEING CRUSHED IN A DOOR THAT DIDN'T STOP CLOSING.*AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/12/2003",
        "dateOfIncident": "05/17/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10021464,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 OLDSMOBILE SILHOUETTE MINIVAN, AUTOMATIC SLIDING DOOR CLOSED ON ITS OWN AND CRUSHED ME.  THE DOOR WOULD NOT RELEASE.  I WAS ABLE TO PUSH THE SIDE BUTTON AFTER ABOUT 20 SEC.  I WAS INJURED.  I WAS BLOWN OFF BY THE DEALERSHIP.  IT HAS HAPPENED SEVERAL TIMES OVER THE PAST YEAR.  I AM NOW ANGRY BECAUSE IT HAS BEEN HAPPENING THIS WEEK.  IRONIC THAT AS I LEAVE FOR PHYSICAL THERAPY, THE THING THAT DAMAGED ME IS STILL MALFUNCTIONING.   *NLM",
        "vin": "1GHDX13E92D"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/20/2003",
        "dateOfIncident": "05/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "OLDSMOBILE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THERE WAS A NOISE COMING FROM THE ENGINE.  *JB",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/29/2003",
        "dateOfIncident": "12/20/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004885,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN THE HIGHWAY AT ABOUT 45 MPH, THE VEHICLE LOST ALL POWER AND STALLED.  HAD TO MANUVER THE VEHICLE TO THE SHOULDER WITH OUT POWER STEERING AND POWER BRAKES.  ONCE VEHICLE WAS RESTARTED THE IDLE WAS VERY SPARATIC.  WHEN REVED TO ENSURE ENOUGH RPM'S TO ALTERNATOR TO CHARGE BATTERY (IN CASE THAT WAS THE PROBLEM), FUEL SHUT OFF OCCURED AT 3500 RPM AND WOULD RESUME WHEN RPM'S FELL BELOW 3000.",
        "vin": "1GHDX03E62D"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10002617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR VAN HAS ONE AUTOMATIC DOOR AND ONE MANUAL DOOR TO ENTER INTO THE BACK SEAT.  I PULLED INTO THE GARAGE, TURNED THE VAN OFF, AND MY EIGHT YEAR OLD GRANDSON PUSHED THE BUTTON TO OPEN THE AUTOMATIC DOOR AS HE SAT IN THE FRONT SEAT.  NOT KNOWING THAT MY TWO YEAR OLD GRANDAUGHTER HAD GOTTEN OUT OF HER CHILD SEAT AND WAS BETWEEN THE SEAT AND THE DOOR, THE DOOR OPENED AND SHE FELL INTO THE TRACK.  I CAUGHT THE DOOR AS IT PINNED HER BY THE WAIST IN THE TRACK, BUT IT WAS VERY DIFFICULT TO MOVE.  IT TOOK ALL MY STRENGTH TO KEEP IT FROM CRUSHING HER.  PLEASE, FOR THE SAFETY OF OTHER CHILDREN, MAKE THIS DOOR STOP MOVING IF SOMETHING OR SOMEONE HITS THIS TRACK!  SHE IS OK, BUT BRUISED AND SORE.  I AM AWARE THAT THERE IS AN OVERRIDE SWITCH TO STOP THE DOOR, BUT IN A PANICK IT DIDN'T COME TO MIND.*JB",
        "vin": "1GHDX03E32D"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/30/2002",
        "dateOfIncident": "12/12/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING UP CONSUMER CAN NOT SEE BECAUSE HEAD RESTRAINT IS TO HIGH. TS",
        "vin": "1GHDX03E92D"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/09/2002",
        "dateOfIncident": "11/24/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8024020,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THE SLIDING DOOR REMOTE WOULD NOT WORK CAUSING IT TO BE HARD FOR THE CONSUMER TO ENTER OR EXIT THE VEHICLE. DEALER NOTIFIED.   PH",
        "vin": "1GHDX13E22D"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY STRONG RAW GAS FUMES ARE ENTERING THE COMPARTMENT AFTER INITIAL START FIRST THING IN THE MORNING.  THE DEALERSHIP HAS LOOKED AT THE VAN (3) TIMES WITH SOME MODIFICATIONS PERFORMED BUT THE PROBLEM STILL PERSIST.  PLEASE DESCRIBE DETAILS.     TS",
        "vin": "1GHDX03E22B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/22/2002",
        "dateOfIncident": "03/24/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021345,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING TRANSMISSION WILL SHIFT GEARS ERRATICALLY W/O WARNING.  DLR HAS REPLACED VEHICLE'S VALVE BODY AND KICK DOWN CABLE, BUT PROBLEM IS STILL OCCURING.    MR",
        "vin": "PLEASE PROV"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/11/2002",
        "dateOfIncident": "10/10/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8020743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED WITHOUT PRIOR WARNING THE PASSENGER SIDE DOOR ELECTRICAL  DOOR SLIDE OPEN AND CLOSE INTERMITTENLEY.  AND HER ARM GOT CAUGHT INSIDE OF THE DOOR.   MR",
        "vin": "PLEASE PROV"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758754,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC  TRANSMISSION; VEHICLE DRIFTS BACKWARDS DOWN A HILL IN WHEN IN DRIVE.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/28/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758756,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUTOMATIC TRANSMISSION;  SILHOUETTE DRIFTS BACKWARDS DOWN A HILL IN WHEN IN DRIVE. 1. TAKE THE CAR TO A MEDIUM TO STEEP HILL (PREFERABLY STEEP SO YOU SEE THE FULL EFFECT).  2. COMPLETELY STOP THE CAR. 3. TAKE YOUR FOOT OFF THE BRAKE BUT DO NOT TOUCH THE ACCELERATOR.  NOTICE THAT THE CAR DRIFTS BACKWARDS AND IF YOU ARE ON A SLIGHT HILL IT WILL STOP AFTER ABOUT A FOOT.  IF YOU ARE ON A STEEP HILL IT WILL DRIFT ALL THE WAY DOWN THE HILL PICKING UP SPEED AS IT GOES.  THIS IS VERY MUCH A SAFETY PROBLEM AND IF IT IS ACCEPTABLE BEHAVIOR THEN I BELIEVE OLDSMOBILE WILL BE IN FOR LAW SUITES.  I BOUGHT THIS VAN BECAUSE I HAVE KIDS. THE SCHOOL I PICK MY CHILDREN UP HAS A STEEP HILL AND I CAN'T BE WORRIED EVERY DAY THAT I MAY DRIFT BACKWARDS INTO SOME PARENT AND CHILD WALKING BEHIND MY CAR BECAUSE OF THIS FLAW. THEY PARK OUR CARS CLOSE TO EACH OTHER DURING PICK UP TIME TO GET AS MANY CARS INTO THE LOT.  I'M FINDING MYSELF TWO FOOTING OR KEEPING MY FOOT ON THE ACCELERATOR TO KEEP FROM DRIFTING BACKWARD INTO THE CAR BEHIND ME AND THIS IS RIDICULOUS!!!   I REFUSE TO CONTINUE DOING THAT.  THIS WAS REPORTED TO THE DEALER AND MANUFACTURER, WHO SAID THAT IT IS WORKING AS DESIGNED, AND WE WILL NEED TO PUT UP WITH IT, EVEN IF IT MEANS USING ONE FOOT ON THE BRAKE AND ONE ON THE GAS!!!  GM CUSTOMER SUPPORT SAID THIS WAS A \"SAFETY FEATURE\" OF THE VAN!!!! SO THAT IT WOULD NOT GO FORWARD WHEN YOUR FOOT WAS REMOVED FROM THE BRAKE!!! I WOULD LIKE TO HAVE ONE OF THEM STAND BEHIND MY VAN WHEN I'M SITTING ON A HILL, AND THEN LET THEM TELL ME HOW MUCH OF  \"SAFETY FEATURE\" IT IS!!!*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/25/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 757320,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "OLDSMOBILE",
                "productModel": "SILHOUETTE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION DOES NOT HOLD THE VAN WHILE IN DRIVE, EVEN ON A SLIGHT INCLINE.  CAR WILL DRIFT BACKWARDS CAUSING A SAFTY ISSUE.  IT'S LIKE DRIVING A MANUAL TRANSMISSION.  IF YOU ARE SITTING AT A TRAFFIC LIGHT, FOOT ON THE BRAKE, AS SOON AS YOU REMOVE YOUR FOOT FROM THE BRAKE, THE VAN DRIFTS BACKWARDS.  IF A CAR HAPPENS TO BE BEHIND YOU, OR EVEN WORST IF SOMEONE IS WALKING BEHIND YOU, THEY COULD BE POTENTIALLY HIT OR RUN OVER.  DEALERS RECOMMENDATION OF USING ONE FOOT ON THE BRAKE AND THE OTHER ON THE GAS IS UNACCEPTABLE.  THEY SAY THAT THIS VAN DOES NOT HAVE A HILL HOLDING FEATURE IN THE TRANSMISSION, AND IT IS SOMETHING THAT WE ARE GOING TO HAVE TO LIVE WITH.  *AK",
        "vin": "1GHDV13EX2D"
    }
]