[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2021",
        "dateOfIncident": "07/26/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11397618,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR POWER SHUTS DOWN WHILE DRIVING, UNABLE TO START AGAIN IN ANY TRAFFIC OR ROAD CONDITIONS TO MOVE CAR TO A SAFE AREA.  FULL LOSS OF POWER UNEXPECTED,  VEHICLE SIMPLY STOPS RUNNING.  THIS VEHICLE WAS PURCHASED 'USED' FROM A PRIVATE SELLER I SUSPECT WAS WELL AWARE OF THE SITUATION BUT DIDN'T EXPOSE IT.  $2300 SPENT SO FAR WITH NO FINDINGS AS TO WHY THE PROBLEM OCCURS.  ONLY AN ADDED 30 MILES TO THE ODOMETER SINCE PURCHASE.  PRESENT READING IS 107,251.",
        "vin": "5GZCZ63B82S"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/05/2020",
        "dateOfIncident": "06/01/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11327414,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR INTAKE THROTTLE IS FAULTY. MAKING THE ENGINE RUN ROUGH AND CAUSING OTHER PROBLEMS SUCH AS EXCESSIVE FUEL CONSUMPTION.  *TR",
        "vin": "5GZCZ63B62S"
    },
    {
        "components": "ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/02/2020",
        "dateOfIncident": "02/14/2020",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11326985,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION IS FAULT. THE KEY CAN BE REMOVED WHEN VEHICLE IS IN ON POSITION.  *TR",
        "vin": "5GZCZ63B62S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2020",
        "dateOfIncident": "12/23/2019",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11297354,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. WHILE DRIVING 30 MPH, SEVERAL DASHBOARD WARNING INDICATORS ILLUMINATED, INCLUDING THE BATTERY WARNING INDICATOR. SIMULTANEOUSLY, THE POWER STEERING SEIZED OPERATION TEMPORARILY AND CAUSED THE VEHICLE TO SWERVE. ALSO, WHILE TRAVELING UP AN INCLINE, THE BATTERY WARNING INDICATOR FLASHED AND THEN TURNED OFF WHEN DRIVING ON LEVELED GROUND. A FAX WAS SENT TO THE VICE PRESIDENT OF SAFETY AT GENERAL MOTORS IN REGARDS TO THE FAILURE; HOWEVER, THERE WAS NO RESPONSE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS APPROXIMATELY 120,000.   *JS",
        "vin": "5GZCZ63BX2S"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/13/2018",
        "dateOfIncident": "07/31/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11128990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE. CONSUMER IS SEEKING REIMBURSEMENT FOR VEHICLE AMOUNT. CONSUMER STATES THAT THE FRAME WAS BROKEN AND RUSTED MAKING VEHICLE UNSAFE TO DRIVE. *LD    THE CONSUMER STATED THE VEHICLE WAS LOCATED AT AN IMPOUND YARD. THE CONSUMER WAS INFORMED THE VEHICLE WAS NOT ABLE TO BE REPAIRED. *JS",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2017",
        "dateOfIncident": "03/31/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10970331,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. WHILE DRIVING APPROXIMATELY 40 MPH, THE CONTACT HEARD AN ABNORMAL NOISE UNDERNEATH THE HOOD OF THE VEHICLE. THE TEMPERATURE WARNING INDICATOR ILLUMINATED AND THE VEHICLE STARTED TO OVERHEAT. THE CONTACT STOPPED TO CHECK THE ENGINE AND NOTICED THAT THE ANTI-FREEZE CONTAINED OIL. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE ENGINE NEEDED TO BE REPAIRED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 151,000.",
        "vin": "5GZCZ63B22S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/03/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10939543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT HIGHWAY SPEEDS,  VEHICLE STALLED,AND WOULD NOT RESTART. VEHICLE COASTED TO LANE OFF TRAFFIC. VEHICLE WOULD NOT MOVE. FAMILY OF FOUR IN VEHICLE. HAD A POLICE OFFICER SHUT DOWN LANE OF TRAFFIC. VERY VERY DANGEROUS. DIAGNOSIS: TIMING CHAIN.  *TR",
        "vin": "5GZCZ23D32S"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2016",
        "dateOfIncident": "09/30/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10910890,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED THE CAR, TURNED AROUND IN MY DRIVEWAY AND STARTED PULLING OUT ONTO THE ROAD, VEHICLE JUST STALLED AND REFUSED TO START AGAIN, ENGINE CRACKS AND TURNS OVER BUT WONT START. THANK GOD THERE WASNT ANY TRAFFIC OR I WOULD HAVE BEEN T BONED. I WAS ABLE TO PUSH THE VEHICLE BACK OFFF THE ROAD. VEHICLE STILL WONT START",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2016",
        "dateOfIncident": "06/18/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10881941,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR SEIZED UP WHILE GOING DOWN THE ROAD I COULD BARELY TURN OR PUSH ON THE BRAKES! THANKFULLY I HAD JUST LEFT WORK SO I WAS ONLY DOING 10 MPH.   I TOOK IT TO A MECHANIC WHOM SAID THE TIMING CHAIN WENT OUT, AND THAT WITH THAT TYPE OF MOTOR A V6 THAT IT MOST LIKELY BENT THE VALVES AND ID HAVE TO GET A NEW ENGINE!!! IM CURIOUS IF THIS HAPPENS OFTEN?????",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "12/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821179,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD SEVERAL PROBLEMS WITH MY IGNITION SWITCH SINCE BUYING THIS VEHICLE AS NEW, SO THE SWITCH WAS REPLACED ON DEC 2008 AT THE DEALERSHIP, WHICH I PAID FOR.  I BROUGHT THIS VEHICLE TO A GM DEALER PER THE RECALL IN 2015 AND WAS TOLD ALL IS GOOD, SO I COULD CLAIM REIMBURSEMENT FOR THE 2008 REPAIR.  TO DATE, AFTER FILLING IN THE REQUIRED FORMS AND SUBMITTING THEM TO A LOCAL GM DEALER, AND CORRESPONDING WITH GM CORPORATE, THEY REFUSE TO REIMBURSE ME FOR THE REPAIR BECAUSE THEY DID NOT KEEP ANY SATURN MAINTENANCE RECORDS WHEN THE DIVISION WAS SHUTTERED, EVEN THOUGH CORPORATE WAS THE OFFICE THAT NOTIFIED ME OF THE EXACT DATE OF THE IGNITION SWITCH REPAIR SO I COULD SUBMIT MY CREDIT CARD STATEMENT AS PROOF.  THE LAST CONTACT FROM CORPORATE WAS 15 DEC 2015 WITH NO RESPONSE FROM SEVERAL MESSAGES LEFT WITH THEIR CASE MANAGER, PAULA (866-790-5700, EXT. 5913223).",
        "vin": "5GZCZ63B12S"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2015",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10816439,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS LIGHT REMAINS ON; MY ELECTRICAL SYSTEM IS FAULTY; MY BLINKERS WORK AT WILL. MY FUEL LINE SENSOR CAUSES MY VEHICLE TO SHUT OFF AFTER DRIVING A DISTANCE. THERE IS A NOISE WHEN I REVERSE. MY SERVICE ENGINE LIGHT IS NOW APPEARING AND THE WHEEL LOCKS AND HARD TO TURN.  READ THE MANUAL; VEHICLE DOES NOT REQUIRE POWER STEERING FLUID. MUST CONTACT A DEALER PER THE MANUAL.  WILL CALL TODAY.  FUEL LINE ISSUES SEPTEMBER 2015 OTHER ISSUES TO DATE 12/28/2015.",
        "vin": "5GZCZ63B72S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "10/04/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779626,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT THIS CAR FROM A USED CAR DEALER. NEVER IN MY 40 YEARS OF DRIVING HAVE I EVER \"TESTED\" HORN OPERATION... SEEMS I SHOULD HAVE AS THE HORN DOESNT WORK. I FOUND AND REPLACED THE FUSE FOR THE HORN AND AFTER RESEARCHING I FOUND THAT THIS IS A KNOWN PROBLEM ON ALL 2002 SATURN VUE VEHICLES.... WHY THIS ISNT A RECALL ISSUE I HAVE NO IDEA BECAUSE THE HORN AND AIR BAG WORK OFF THE SAME POWER LINE AND THE CONTACT FOR THE HORN IS THE PROBLEM HORN WISE. I TOOK MY CAR TO A CHEVY DEALER TO GET AN ESTIMATE ON THE \"FIX\" AND IT WOULD COST ME 1100 BUX TO REPLACE THE FAULTILY DESIGNED UNIT GUARANTEED TO FAIL WITH ANOTHER FAULTILY DESIGNED UNIT GUARANTEED TO FAIL.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/23/2015",
        "dateOfIncident": "12/02/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10736046,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. AFTER THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V490000 (ELECTRICAL SYSTEM), THE KEY FAILED TO RELEASE FROM THE IGNITION SWITCH AND HEARD A CLICKING NOISE WHEN REMOVING THE KEY. A COUPLE OF DAYS LATER, THE TURN SIGNALS FAILED INTERMITTENTLY. IN ADDITION, THE CONTACT MENTIONED THAT SMOKE EMITTED FROM THE TOP OF THE STEERING WHEEL ON SEVERAL OCCASIONS. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE DEALER STATED THAT THE TURN SIGNAL ARM WOULD NEED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 160,000. MA 10/5  UPDATED 10/8/15*JB",
        "vin": "5GZCZ63B32S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2015",
        "dateOfIncident": "06/30/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10731534,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. WHILE DRIVING 45 MPH, THE TIMING CHAIN FAILED AND THE ENGINE STALLED WITHOUT WARNING. THE VEHICLE DID NOT RESTART. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE WHERE AN INDEPENDENT MECHANIC DIAGNOSED THAT THE TIMING CHAIN FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 84,000.",
        "vin": "5GZCZ23D02S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/15/2015",
        "dateOfIncident": "06/12/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694534,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE.  CONSUMER WRITES IN REGARDS TO IGNITION CYLINDER AND KEYS REPLACEMENT RECALL ISSUES.  *SMD  THE CONSUMER STATED HE RECEIVED A RECALL NOTICE IN THE MAIL IN OCTOBER 2014 REGARDING AN ISSUE WITH THE IGNITION SWITCH. THE WORK HAD ALREADY BEEN DONE AND THEREFORE, THE CONSUMER SENT IN THE NECESSARY PAPERWORK FOR REIMBURSEMENT. EVEN THOUGH THE GM HAD THE PROOF THE WORK WAS DONE, THEY INFORMED THE CONSUMER TO HAVE THE VEHICLE INSPECTED, TO MAKE SURE THE IGNITION SWITCH WAS INSTALLED PROPERLY. ONCE IT WAS VERIFIED, THE CONSUMER NEVER HEARD BACK FROM THE GM REPRESENTATIVE. *JB",
        "vin": "5GZCZ63B92S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/12/2015",
        "dateOfIncident": "05/08/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10715965,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER AND EVENTUALLY JUST STOPPED RUNNING.  TOWED IT HOME. SUSPECTED TIMING CHAIN. TOOK OFF VALVE COVER AND TC COVER. NOTICED THAT BLACK PLASTIC GUIDE WAS BROKEN IN MAIN PIECES AND MUST HAVE BEEN FOR SOME TIME, FOR CHAIN WORE INTO SOME BOLTS AND COVER.  CHAIN LOOKS BRAND NEW AND NO ISSUES WITH IT.  REPLACED ALL TIMING COMPONENTS (TWO SPROCKETS, CHAIN, GUIDE, TENSION ARM, TENSIONER, CAM SPROCKET, ETC)., BUT IT WOULD NOT START.  CHECKED COMPRESSION (0 PSI AT ALL CYLINDERS), DOUBLE CHECKED TIMING AND WAS CORRECT.  ROLLER ROCKERS WERE LOOSE WHEN CAM IS NOT PRESSING ON THEM, SO SUSPECT ALL VALVES ARE BENT.  FIX IS TO REBUILD THE \"HEAD\".  I PRESUME THAT IF THE BLACK PLASTIC CHAIN GUIDE DID NOT BREAK, IT WOULD NOT HAVE GOTTEN OUT OF TIME AND BENT VALVES. THE RECALL SHOULD NOT BE ON THE TIMING CHAIN BUT THE PLASTIC GUIDE THAT IS USED FOR THE TIMING CHAIN.  HAD THIS PART BEEN METAL, THIS WOULD NOT HAVE HAPPENED.  HAVE PICTURE TO SEND IF NEEDED.",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/05/2015",
        "dateOfIncident": "02/25/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING CHAIN RUINED THE ENTIRE ENGINE AS A RESULT OF THE CHAIN TENSIONER FAILING FROM LACK OF OIL BEING APPLIED.  APPARENTLY AS SOON AS I HEARD THE CLANGING SOUNDS IT WAS TOO LATE.   I AM BUYING A WHOLE NEW ENGINE WHICH HAS REPLACED THE OILING MECHANISM THAT WAS FAULTY IN THE 2002-2003 MODELS OF THE SATURN VUE.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2015",
        "dateOfIncident": "01/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED THAT THE KEY FAILED TO TURN IN THE IGNITION SWITCH AND NUMEROUS ATTEMPTS HAD TO BE MADE BEFORE THE VEHICLE WOULD START. THE FAILURE RECURRED CONTINUOUSLY. THERE WAS A RECALL UNDER NHTSA CAMPAIGN NUMBER: 14V490000 (ELECTRICAL SYSTEM). HOWEVER, THE DEALER REFUSED TO REPAIR THE VEHICLE BECAUSE THEY WERE UNABLE TO LOCATE A FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE ISSUE. THE APPROXIMATE FAILURE MILEAGE WAS 154,000.",
        "vin": "5GZCZ23D02S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2014",
        "dateOfIncident": "07/03/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10661939,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON A ROAD WITH A 50 MPH LIMIT WHEN THE ENGINE SHUT OFF.  I LOST ALL POWER TO THE CAR AND THANKFULLY WAS ABLE TO STEER IT INTO  THE DRIVE WAY OF A BUSINESS ON THAT ROAD. THERE WERE NO RECALLS ON MY CAR AT THAT TIME AND THERE STILL ARE NO ENGINE RECALLS ON THIS CAR DESPITE THE OTHER RECALLS WHERE THE EXACT SAME THING HAPPENED. THE LOCAL DEALER SAID I HAD A BAD SENSOR IN THE ENGINE AND CHARGED ME OVER $400 TO FIX. I AM LUCKY TO HAVE SURVIVED THE INCIDENT AND CHARGING ME WAS WRONG.  *JS",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "11/10/2014",
        "dateOfIncident": "06/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653979,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 10 MPH, THE IGNITION KEY RELEASED FROM THE IGNITION SWITCH AND THE STEERING WHEEL SEIZED WITHOUT WARNING. AS A RESULT, THE CONTACT CRASHED INTO A TREE. NO INJURIES WERE REPORTED. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT NOTIFIED IF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/28/2014",
        "dateOfIncident": "10/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10650880,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VUE STOPPED IN PARKING LOT OTHER VEHICLE HIT ME HEAD ON  VUE AIR BAGS DIDNT DEPLOY MY SATURN VUE KEY WAS ON FLOOR FELL OUT OF IGNITION I WAS SENT TO HOSPITAL  ERIE TOTALED MY VUE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2014",
        "dateOfIncident": "07/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611112,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING WITH ALMOST A FULL TANK OF GAS, I LOST POWER ON THE FREEWAY. SCARIER THAN THAT,  IT WAS RIGHT IN A CONSTRUCTION ZONE ON THE FREEWAY.  I FREAKED. I HAD NO IDEA WHAT TO DO. I LET IT COAST TO A STOP. I ALMOST GOT SLAMMED BY A 18 WHEELER. I THOUGHT I WAS DEAD. I WENT TO RESTART THE CAR AND THE KEYS FELL OUT OF THE CARS IGNITION SWITCH. IT TOOK ME TRYING TO GET IT RESTARTED SEVERAL TIMES. I HAD WAITED ABOUT 10 MINUTES BEFORE TRYING IT WHEN IT FINALLY RESTARTED. I'M GLAD TO BE ALIVE DON'T GET ME WRONG. BUT, BEING STUCK ON A FREEWAY IN 106DEGREES AND ALMOST DYING SUCKED.   I HAVE ACCESS TO ALL MAINTENANCE RECORDS FOR THIS AUTO. IT HAS BEEN VERY WELL TAKEN CARE OF AND ONLY HAS 41K MILES ON IT.  PLEASE TELL ME WHAT TO DO AT THIS POINT.   *TR",
        "vin": "5GZCZ23D82S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/09/2014",
        "dateOfIncident": "03/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10609255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED THAT WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE STALLED. THE VEHICLE WAS ABLE TO BE RESTARTED. THE CONTACT MENTIONED THAT THE FAILURE OCCURRED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE REPAIRS WERE UNKNOWN. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000 AND THE CURRENT MILEAGE WAS 141,000. D",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/27/2014",
        "dateOfIncident": "09/29/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606391,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2002 SATURN VUE. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE ENGINE STALLED WITHOUT WARNING. THE CONTACT STATED THAT IN THE PROCESS OF RESTARTING THE VEHICLE, THE KEY SLIPPED OUT OF THE IGNITION. THE VEHICLE WAS TAKEN TO THE DEALER FOR A DIAGNOSTIC TESTING BUT THEY COULD NOT DETERMINE THE CAUSE OF FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 60,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10599192,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND CAME OUT OF WORK AND COULDN'T GET HIS CAR TO START.  THE IGNITION SWITCH IS COMPLETELY LOCKED UP.  AT THIS POINT WE'LL HAVE TO GET IT TOWED TO A MECHANIC TO GET THE IGNITION LOCK CYLINDER REPLACED.  GM HAS RECALLED 2003 - 2007 SATURN IONS FOR THIS VERY SAME PROBLEM BUT THEY LEFT OUT 2002 SATURN VUES.  IT'S THE VERY SAME PROBLEM!     *TR",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/18/2014",
        "dateOfIncident": "06/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10604389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "KEYS FALL OUT OF THE IGNITION AS YOU'RE DRIVING DOWN THE ROAD.   THIS HAS HAPPENED MORE THAN ONCE.   IS THIS ONE OF THE DEFECTIVE GM VEHICLES?  *TR",
        "vin": "5GZCZ23D23S"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2014",
        "dateOfIncident": "05/04/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593360,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION SWITCH HAS TO BE INSERTED IN THE DOOR IN ONE POSITION TO UNLOCK, THEN TURNED OVER TO TURN ON THE IGNITION, THEN IT IS VERY HARD TO TURN THE IGNITION TO THE RUN POSITION, THE ACC. POSITION WILL NOT WORK. SOMETIMES IT WILL NOT ACTIVATE THE POWER STEERING, HAS TO BE TURNED OFF AND RESTARTED TO GET IT TO WORK, IF GM HAS KNOWN OF THIS PROBLEM SINCE 2001, WHY DID THEY NOT RECALL MY SPECIFIC CAR WHICH IS 2002 SATURN VUE. I WAS TOLD BY GM THAT THIS VIN. WAS NOT RECALLED. THE SUGGESTED THAT I TAKE IT TO GM DEALER FOR DIAGNOSTIC CHECK, WHICH I HAVE TO PAY FOR, BUT I KNOW THE IGNITION IS DEFECTIVE. IF THIS IS HOW THEY INTEND TO FIX THE PROBLEM, WHY ISSUE A RECALL. I CAN HAVE IT REPAIRED BUT IT IS GOING TO COST ME IN EXCESS OF 200.00 I HAVE HAD 4 DIFFERENT KEYS CUT FOR IT, WITH NONE OF THEM WILL WORK. YOU CANNOT TURN THE STEERING WHEEL WHEN THIS PROBLEM POPS UP. MAYBE THIS WILL KEEP SOMEONE ELSE FROM GETTING INVOLVED IN ACCIDENT. I HAVE GIVEN UP ON GM FIXING THE PROBLEM. I WILL TAKE IT TO MY LOCAL REPAIR SHOP.  *TR",
        "vin": "5GCCZ63B02S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/20/2014",
        "dateOfIncident": "05/19/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592629,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE MORNING DRIVE OF 4 MILES, SMOKE START COMING FROM THE STEERING WHEEL IN THE AREA OF THE TURN SIGNAL INDICATOR.  *TR",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/20/2014",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592720,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED THAT THE CHECK ENGINE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AS THE VEHICLE STALLED FOR A BRIEF MOMENT. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE TECHNICIAN DIAGNOSED THAT THE REVERSE WAVE PLATE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE CURRENT AND FAILURE MILEAGE WAS 67,000.",
        "vin": "3GSCL53798S"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2014",
        "dateOfIncident": "05/19/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE.  THE CONTACT STATED WHILE DRIVING APPROXIMATELY 5 MPH SMOKE WAS EMITTED FROM THE STEERING WHEEL WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO WAS UNABLE TO DETERMINE THE CAUSE OF FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/18/2014",
        "dateOfIncident": "03/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10592297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WILL STALL AT VARIOUS SPEEDS, SOMETIMES WILL COMPLETELY DIE OR WILL GO OFF FOR 10-30 SECONDS, TURNING SIGNALS WILL OCCASIONALLY WORK BUT WILL GO OUT. NO CODES WILL SHOW UP WHEN TESTED, SO THE CAUSE IS UNKNOWN.    *JS",
        "vin": "562C263B425"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/12/2014",
        "dateOfIncident": "05/09/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587875,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY IN VEHICLE LOCKS UP AT TIMES WHEN TRYING TO TURN IT ON. KEY ALSO COMES OUT OF IGNITION WHILE CAR IS STILL RUNNING. NOW WHEN START THE CAR SMOKE IS COMING OUT OF IGNITION AND STEERING WHEEL AREA.  *TR",
        "vin": "5GZCZ63BX2S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2014",
        "dateOfIncident": "11/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583083,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED THAT THE KEY CAN BE REMOVED WHEN THE IGNITION IS NOT OFF. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE IGNITION CYLINDER NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "5GZCZ23DX2S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "10/31/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579576,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED THAT THE KEY BECAME DAMAGED AND FELL OUT OF THE IGNITION SWITCH SPORADICALLY WHILE THE VEHICLE WAS IN MOTION. ADDITIONALLY, THE VEHICLE WOULD SPORADICALLY FAIL TO START. THE VEHICLE ALSO STALLED WITHOUT WARNING AND THE SERVICE ENGINE LIGHT WOULD RANDOMLY ILLUMINATE.  THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 14V171000  (ELECTRICAL SYSTEM) BUT THE CONTACT STATED THAT THE VEHICLE EXHIBITED THE SAME FAILURE THAT WAS LISTED IN THE RECALL.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHO REPLACED THE KEYS BUT THE FAILURE RECURRED. THE CONTACT HAD TO UNPLUG AND REATTACH THE BATTERY MULTIPLE TIMES TO START THE VEHICLE. THE VEHICLE WAS TO BE TOWED TO A REPAIR SHOP WHERE IT WAS DIAGNOSED THAT THE LOCK CYLINDER AND IGNITION SWITCH NEEDED TO BE REPAIRED. THE VEHICLE WAS TO BE INSPECTED AND REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 179000.",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2014",
        "dateOfIncident": "06/28/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579380,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS AWD 2002 SATURN JUNE 28 2013 FROM TOYOTA NATION IN BUENA PARK AND EVEN  WITHIN 3 HRS OF OWNING THE CAR IT QUIT WORKING SO I HAD IT TOWED BACK I HAD TRADED IN MY 2010 CHEVY COBALT THAT ONLY HAD 25K MILES ON IT  ANYHOW I VE HAD IGNITION REPLACED I HAD SOME OTHER THINGS SPENT ALMOST $1000 ALREADY I CANT GET DEALERSHIP TO FIX IT LAST I REPLACED BCM  AND STILL NOT WORKING RIGHT I LL BE DRIVING 45 MPH AND POOF SECURITY LIGHT FLASHES I LOOSE GAS AND IT DIES I LIVE IM MOUNTAINS SCARY AS HECK WITH MY KIDS IM SINGLE PARENT PLS HELP.   *JS",
        "vin": "GZCZ63B42S8"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/11/2014",
        "dateOfIncident": "12/28/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE IGNITION KEY MAY BE REMOVED WITHOUT TURNING OFF THE IGNITION REGARDLESS OF SHIFT LEVER POSITION; IT CAN BE REMOVED WHILE DRIVING OR PARKED.  I PURCHASED THE VEHICLE USED AND ASSUMED THAT THE PROBLEM WAS A WORN KEY OR IGNITION BARREL SO I HADN'T REPORTED IT.  THE NEWS ITEM THAT DETAILED THIS PARTICULAR PROBLEM FAILED TO MENTION THIS PARTICULAR MODEL OF THE SATURN BRAND.  I AM NOW FILING THIS FORMAL REPORT TO INCLUDE THE SATURN VUE AS PART OF THE IGNITION SWITCH PROBLEM CAUSED BY GENERAL MOTORS.  PLEASE RESPOND TO LET ME KNOW YOUR ACTION REGARDING THIS FILING.  *JS",
        "vin": "5GZCZ63B12S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "04/06/2014",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578215,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT WAS DRIVING 25-35 MPH WHEN SMOKE WAS EMITTED FROM THE STEERING COLUMN. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE 104,365 AND THE CURRENT MILEAGE WAS 104,400.",
        "vin": "5GZCZ63B92S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/03/2014",
        "dateOfIncident": "10/28/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10577083,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED WHILE AT A TRAFFIC LIGHT MAKING A RIGHT TURN AT APPROXIMATELY 2 MPH, HE HEARD A SNAPPING SOUND ON THE REAR DRIVERS SIDE OF THE VEHICLE. THE LEFT REAR TIRE SNAPPED OFF OF THE REAR LATERAL LINK. THE VEHICLE WAS UNABLE TO BE DRIVEN. THE VEHICLE WAS TOWED TO A REPAIR SHOP WHO DIAGNOSED THAT THE REAR LATERAL LINK NEEDED TO BE REPAIRED WHICH HAD BEEN TORN FROM THE SUBFRAME. THE VEHICLE WAS REPAIRED AND THE FAILURE RECURRED ON THE OPPOSITE SIDE OF THE VEHICLE. THE CONTACT HAD HEARD A NOISE IN THE REAR PASSENGER SIDE TIRE. THE VEHICLE WAS TO BE DIAGNOSED FOR REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 132000.",
        "vin": "5GZCZ23D82S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/02/2014",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10576837,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE.THE CONTACT STATED THAT WHILE DRIVING 55 MPH, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN DIAGNOSED THERE WAS AN IGNITION FAILURE. THE VEHICLE WAS REPAIRED HOWEVER, THE EXACT REPAIRS WERE UNKNOWN. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 79,300 AND THE CURRENT MILEAGE WAS 79,440.",
        "vin": "5GZCZ63B62S"
    },
    {
        "components": "ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/03/2014",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562730,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL SYSTEM STARTING TO ACT UP (EVERY DASHBOARD LIGHT COMES ON) CAUSING THE VEHICLE TO LOSE POWER AND STALL WHILE DRIVING. STEERING POWER WAS LOST AND BRAKES BECAME VERY SOFT. HAPPENS AT RANDOM SPEEDS FROM 20MPH AND UP TO 65MPH. VERY SCARY! I HAVE A CHILD AND I COULDN'T GET MY HAZARD LIGHTS TO COME ON UNTIL THE ELECTRICAL CALMED DOWN. WAS NEARLY REAR-ENDED MULTIPLE TIMES WITH A CHILD IN THE VEHICLE. FINALLY HAD TO REPLACE THE THROTTLE BODY ON THE VEHICLE WHICH IS VERY EXPENSIVE.   *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/04/2013",
        "dateOfIncident": "11/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10550743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED WHEN THE DRIVER ACTIVATED THE ALARM IT CAUSED THE HORN TO REMAIN  ENGAGED. THE DRIVER DISCONNECTED THE HORN RELAY IN ORDER TO SHUT THE HORN OFF. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT EITHER THE AIR BAG SWITCH ASSEMBLY OR BODY CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 112,000.",
        "vin": "5GZCZ23D82S"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/23/2013",
        "dateOfIncident": "09/20/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521260,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD PROBLEMS SINCE I BOUGHT THE VEHICLE. SHOCKS, STRUTS, REAR SUSPENSION, BRAKES, ELECTRICAL, OIL HAS BEEN EITHER LEAKING OR BURNING TO THE EXISTENT I PUT SOME IN EVERYOTHER DAY BECAUSE IT IS LOW, THE SWAY BAR AND THE STEERING COLUMN, THE TRANSMISSION AND DRIVE TRAIN, AND THE TIMING CHAIN. THERE ARE MANY OTHER UNSAFE ISSUES I HAVE HAD AND I HAVE BROUGHT IT TO THEIR ATTENTION FROM DAY ONE BECAUSE I HAVE A BEAUTIFUL DAUGHTER, BUT HE REFUSED TO DO ANYTHING TO HELP ME. IT FINALLY BROKE DOWN ON ME AND NOW I AM WITHOUT A VEHICLE .  *TR",
        "vin": "5GZCZ23D92S"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/17/2013",
        "dateOfIncident": "01/14/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493365,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING DOWN STREET ENGINE STOPPED.  REPAIR SHOP SAID THAT TIMING CHAIN BROKE AND IT SHOULD HAVE NOT HAPPENED ON CAR.  I CHECKED ON RECALLS AND THERE WERE RECALLS ON THIS PROBLEM FOR 2001 ENGINES!  THIS IS UNACCEPTABLE THAT THIS PROBLEM WAS NOT RESOLVED!  GM SHOULD BE RESPONSIBLE FOR THIS FAILURE!  ALMOST $3000 LATER MY CAR WILL BE FIXED!  PLEASE HELP?  *TR",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2012",
        "dateOfIncident": "09/09/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474562,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN OPERATING AT ANY SPEED THE VEHICLE WILL SHUT DOWN AND STEERING BRAKING AND ALL CONTROL IS LOST' THIS CONSTANTLY HAPPENS.  *TR",
        "vin": "5GZCZ63B72S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2012",
        "dateOfIncident": "01/27/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460914,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REFERRED TO COTTMAN TRANSMISSIONS,WHEN I LEARNED ABOUT MY PARTICULAR MAKE,MODEL,&YEAR VEHICLE WAS INCLUDED IN A RECALL ON 2002 TO 2005 VUE AND 2003 TO 2004 IONS VTI TRANSMISSIONS WERE DEFECTED,I NEVER RECEIVED ANY NOTICES TO INFORM ME OF THIS PROBLEM. I AM A STAY AT HOME MOTHER,TWO KIDS WITH AFTER SCHOOL ACTIVITIES AND NOW NO CAR,CAUSE MY TRANSMISSION IS RUINED AND EXTREMELY EXPENSIVE TO WORK ON.THOUGH GM FILED A CLASS ACTION LAWSUIT/SETTLEMENT FOR THE SATURN OWNERS,ALL I WANT /NEED IS MY VEHICLE BACK,MY HUSBAND HAS HIS AND HOURS AT WORK IS LATE IN THE EVENING WHEN IMPORTANT PLACES LIKE DMV,POST OFFICES,AND MY KIDS DOCTORS OFFFICES.I HAD MY SATURN FOR 6 YEARS AND NEVER ONCE DID I HAVE A PROBLEM THIS SERIOUS,TO WHERE I HAVE TO SELL IT OR JUNK IT,CAUSE OF THE EXPENSE OF GETTING IT REBUILT,OR IF I WOULD BE LUCKY ENOUGH TO FIND A MECHANIC TO DO THE JOB.I AM SO FURIOUS WITH GM AND SATURN,THEY DIDN'T CONTACT ME,I DON'T WANT MUCH,JUST TO HAVE MY VEHICLE AND MY FREEDOM TO DRIVE.I DON'T WANT THEM TO REPLACE IT JUST GIVE ME WHAT IT'S WORTH,SO I CAN PURCHASE ANOTHER ONE.       *JS",
        "vin": "5GZCZ63B92S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/29/2011",
        "dateOfIncident": "09/26/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427929,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TURN SIGNAL IS ENGAGED, IT ACTIVATES THE HEADLAMP (BRIGHTS) AND THE ONLY WAY TO GET THE LIGHTS OFF IS TO FLIP THE BRIGHT SWITCH  UP ( TOWARDS DRIVER). THE HEADLAMPS DO NOT NEED TO BE TURNED ON. THE BRIGHT BEAM INDICATOR ON DASH ILLUMINATES WHEN THIS HAPPENS. IT DOES NOT MATTER WHAT SPEED YOU ARE TRAVELING.  *TT",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/11/2011",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411859,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TURN SIGNALS WORK ONLY INTERMITTENTLY.  THEY WILL WORK AND THEN STOP WORKING, REQUIRING A RESTART OF THE VEHICLE TO GET THEM WORKING AGAIN.  *TT",
        "vin": "5GZCZ23D02S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/04/2011",
        "dateOfIncident": "02/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386459,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE REPEATEDLY LOOSES POWER STEERING.  IT APPEARS TO HAPPEN SOON AFTER STARTING AND TURNING.  SOMETIMES IT MAY BE RESET BY TURNING OFF AND ON THE VUE AND/OR LETTING IT IDLE FOR A FEW MINUTES.  THIS ISSUE WAS REPEATEDLY REPORTED TO THE DEALERSHIP SINCE 2006 WITHOUT RESOLUTION.  LOOSING POWER STEERING PERIODICALLY HAS CAUSED SERIOUS SAFETY ISSUES AND MAY LEAD TO AN ACCIDENT OR DEATH.   PLEASE RESPOND TO ME WITH ANY SUGGESTIONS OR ADVISE.  MY EMAIL ADDRESS IS [XXX].    ELECTRIC POWER STEERING HAS BEEN RECALLED ON MANY GM CARS.   GM IS CURRENTLY HAS A LAW SUIT AGAINST THE MAKER OF THESE ELECTRIC POWER STEERING UNITS.  THIS IS A SERIOUS PROBLEM AND I WOULD LIKE TO KNOW THE RESOLUTION.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/05/2010",
        "dateOfIncident": "11/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM NIGHT CLASSES ONE NIGHT AND MY CAR WOULD START TO SHAKE AT THE STOP LIGHT (WHILE IDLING) WHEN I PROCEEDED TO GO THE CAR WOULD NOT GO INTO GEAR AND WOULD PUTT THROUGH THE INTERSECTIONS. AS I WAS DRIVING HOME I GOT STUCK IN THE MIDDLE OF AN INTERSECTION WITH ONCOMING TRAFFIC. THIS GOT WORSE AS I DROVE AND I PRAYED ALL THE WAY HOME THAT I WOULD NOT ENCOUNTER ANOTHER RED LIGHT. WHEN I GOT HOME I REMEMBERED THAT SATURN HAD SENT ME A LETTER STATING THAT \" THIS LETTER IS INTENDED TO MAKE YOU AWARE THAT SOME 2002 MODEL YEAR SATURN VUE VEHICLES, EQUIPPED WITH A VTI, MAY EXHIBIT EXCESSIVE NOISE OR REDUCED PERFORMANCE.\" SO THEY ARE AWARE THAT THEIR TRANSMISSIONS ARE FAULTY. IF YOU GOOGLE \"2002 SATURN VUE TRANSMISSIONS\" YOU WILL FIND A MULTITUDE OF OTHER CUSTOMER COMPLAINTS ABOUT THE SAME ISSUE. IF THIS HAD OF HAPPENED A DAY EARLIER MY CHILDREN AND I COULD HAVE BEEN IMPACTED AND DIED DUE TO THE FAULTY TRANSMISSION. I STILL OWE 7000.00 ON THIS CAR AND IT WILL COST ALMOST THAT MUCH TO REPLACE. IF SATURN OR GM KNOWS ABOUT THIS PROBLEM THEY SHOULD BE WILLING TO FIX IT, UNFORTUNATELY THEY ARE NOT. *TR",
        "vin": "5GZCZ43D32S"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2010",
        "dateOfIncident": "08/15/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359068,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED A BRAND NEW 2002 SATURN VUE 6 CYLINDERS 3.0 ENGINE.  HAD TO REPLACED EVERY ELECTRONIC COMPONENT IN THIS VEHICLE. COMPUTER, ACCELERATOR SENSOR, TRANSMISSION AND TRANSMISSION CONTROL MODULE. THE \"SERVICE ENGINE\" LIGHTS IS CONSTANTLY ON. THEREFORE,  I TOOK THE TRUCK TO THE DEALER. THEY TELL ME I NEED A NEW THROTTLE BODY AND A BRAND NEW HARNESS SINCE THE NEW THROTTLE BODY WILL NOT WORK WITH THE EXISTING WIRES. THEY WANT $3,000.00 FOR THIS.  WITHIN THE WARRANTY PERIOD I MADE THE DEALERSHIP AWARE OF TRANSMISSION PROBLEMS. THEY REPLY THAT THIS SUV WAS OPERATING NORMAL. I REPLACED THE TRANSMISSION AFTER THE WARRANTY HAD EXPIRED.  NOW THE TRANSMISSION CONTROL MODULE IS DEFECTIVE.  THE DEALER WANTS $860 FOR THE PART PLUS PROGRAMMING CHARGES. *TR",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/17/2010",
        "dateOfIncident": "08/31/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356103,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT WAS ATTEMPTING TO SHIFT INTO PARK WHEN THE VEHICLE ABNORMALLY ACCELERATED, CAUSING THE CONTACT TO CRASH INTO A NEARBY VEHICLE. NO ONE WAS INJURED AND A POLICE REPORT WAS NOT FILED.  THE CURRENT AND FAILURE MILEAGE WAS 103,000.  UPDATED 12/15/10. *LJ  THE CAUSE FOR THE SUDDEN ACCELERATION COULD NOT BE DETERMINED. THE VEHICLE WAS REPAIRED. UPDATED 12/27/10",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "09/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354589,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SUSPENSION \"STABILIZER BAR\" BROKE, RIGHT SIDE, AT THE RUBBER MOUNTING WHERE THE BAR IS BOLTED TO THE SUB-FRAME.  BROKEN END OF THE STABILIZER BAR THEN RIPPED THRU THE RIGHT CV AXEL BOOT, DESTROYING THE CV JOINT.  THE BREAK WAS UNDER THE RUBBER MOUNTING AND THE BAR WAS RUSTED THRU, CAUSING THE BREAK.  UNDER 30 MPH, NO ACCIDENT, NO PERSONAL INJURY AND NO OTHER DAMAGE  NEW PARTS UNAVAILABLE, SO PURCHASED A REBUILT AXEL AND A USED STABILIZER BAR. *TR",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/13/2010",
        "dateOfIncident": "07/12/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10343022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR FACILITY FOR A ROUTINE REPAIR WHEN THE CONTACT WAS INFORMED THAT THE FRONT SUB FRAME EXHIBITED SEVERE CORROSION AND COULD NOT BE REPAIRED. THE MECHANIC ADVISED THE VEHICLE WAS UNSAFE TO DRIVE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE.  THE FAILURE AND THE CURRENT MILEAGES WERE 100,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/21/2010",
        "dateOfIncident": "04/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10339342,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. WHILE DRIVING AT APPROXIMATELY 35 MPH, THE GAUGES ON THE DASHBOARD FAILED AND AN UNKNOWN WARNING BELL SOUNDED IN THE VEHICLE. THE STEERING WHEEL THEN BECAME EXTREMELY STIFF AND DIFFICULT TO MANEUVER. THE DEALER ADVISED THAT THE ELECTRIC POWER ASSIST FAILED AND THE BODY CONTROL MODULE WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE FAILURE CONTINUED TO RECUR INTERMITTENTLY. THE VIN WAS UNAVAILABLE.  THE FAILURE MILEAGE WAS 95,000 AND THE CURRENT MILEAGE IS 98,000.    UPDATED 08/03/10. *LJ  UDDATED 08/04/10*JB",
        "vin": "5GZC263B125"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/19/2010",
        "dateOfIncident": "05/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331115,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ROLLED DOWN DRIVE WAY WITH KIDS IN IT.  MY FINDINGS WERE THAT IN MY 2002 SATURN VUE  WAS IN THE ACC POSITION ON THE KEY THE TRANSMISSION SAFETY THAT REQUIRES YOU TO PUSH THE BRAKE IN ORDER TO SHIFT IS UNLOCKED.  I FEEL THIS COULD POTENTIALLY BE VERY DANGEROUS LUCKY NO INJURIES TO MY KIDS JUST THE CAR.  AS FAR AS I KNOW THERE IS NO FIX FOR THIS THE DEALER SAID THERE WAS NO RECALL AND NO REPAIR I COULD DO. *TR",
        "vin": "5GZCZ43D32S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/10/2010",
        "dateOfIncident": "02/19/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329708,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE. THE CONTACT STATED WHILE  DRIVING AT SPEEDS OF 25 MPH, THE INSTRUMENT PANEL INDICATED THAT THE VEHICLE WAS RUNNING HOT. THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP. THE MECHANIC ADVISED THE CONTACT THAT THE VEHICLE HAD NOT RUN HOT AND INSTEAD, THE INSTRUMENT PANEL HAD MALFUNCTIONED AND WOULD NEED TO BE REPLACED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE DEALER CONFIRMED THE FAILURE. THERE WERE NO RECALLS AND ANY REPAIRS WOULD BE AT THE OWNER'S EXPENSE. THE FAILURE MILEAGE WAS 68,163.",
        "vin": "5GZCZ63B82S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/08/2010",
        "dateOfIncident": "05/06/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329399,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GM PRODUCTS DIV. GM CORP.",
                "productMake": "GM PRODUCTS",
                "productModel": "GM PRODUCTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I'M THE ORIGINAL OWNER OF A 2002 SATURN VUE AWD WITH THE GM VTI TRANSMISSION AND ENGINE. TWO DAYS AGO I EXPERIENCED MY TRANSMISSION/ENGINE FAILING FOR THE FIFTH OR SIXTH TIME SINCE 2006. THE VERY FIRST TIME I TOOK MY VUE TO THE DEALERSHIP IN AUSTIN, TX WHERE I HAD TO ARGUE WITH FIRST MY SERVICE REP. FOLLOWED BY HIS MANAGER THAT THE PROBLEM WAS WITH THE TRANSMISSION. SINCE THE FAULTY GM DESIGN WAS STILL RELATIVELY NEW, THEY ORIGINALLY BLAMED ME FOR POOR DRIVING, RESULTING A BAD BCM WHICH THEY MADE ME PAY IN SPITE OF MY ARGUMENT THE FAULTY GM DESIGN WAS THE ORIGIN OF THE PROBLEM. FIRST TIME IT COST ME $1500 TO REPAIR MY CAR THAT HAD LESS THAN 60,000 MILES ON IT. THIS HOWEVER WAS QUITE AN ORDEAL SINCE MY VEHICLE ACTUALLY LOST POWER ON THREE OR FOUR DIFFERENT OCCASIONS. I WOULD IMMEDIATELY GO TO THE DEALERSHIP FOR ASSISTANCE WITH WHAT I KNEW WAS THE TRANSMISSION. AFTER BUGGING THEM ALMOST EVERYDAY WITH THE SAME PROBLEM THEY FINALLY ADMITTED GMS TRANSMISSION PROBLEMS AND REPLACED MY TRANSMISSION ON THE THIRD VISIT. THE SECOND TRANSMISSION LASTED APPROXIMATELY A YEAR. IN 2007 I HAD RELOCATED WITHIN THE STATE AND WAS EXPERIENCING SIMILAR PROBLEMS AND RELUCTANTLY CALLED MY LOCAL SATURN DEALERSHIP. HERE WE GO AGAIN ANOTHER $500 FOR ODDS AND ENDS AND THIS TIME IT WAS SUPPOSEDLY THE ECM AND OF COURSE IT DID NOT FIX THE PROBLEM! THE TRANSMISSION WAS FINALLY REPLACED ON MY THIRD TRIP! HOWEVER THEY DID NOT PAY FOR MY LOANER CAR THOUGH I REQUESTED ONE. BRINGS US TO 2009, WHEN THE ABOVE MENTIONED DEALER HAD GONE OUT OF BUSINESS AND I OF COURSE HAD TRANSMISSION PROBLEMS! LUCKILY I FOUND A DEALERSHIP NEAR AND HAD MY CAR TOWED TO THEM. THEY CONFIRMED BY THAT AFTERNOON THAT THE TRANSMISSION WAS BAD! THEY REPLACED THE TRANSMISSION, AND CLOSED FOR BUSINESS WITHIN THREE DAYS. NO LOANER CAR AGAIN. HERE I SIT AGAIN WITH THE TRANSMISSION DANGEROUSLY GOING OUT, AND DREADING THE THOUGHT OF THE SATURN DEALERSHIP FIASCOES.    AT WHAT POINT WILL GM TAKE THESE DANGEROUS 2002-2005 CARS OFF THE ROAD? *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/12/2010",
        "dateOfIncident": "01/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319273,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG CONTROL MODULE NOT WORKING AND DAYTIME RUNNING LIGHTS IN OPERABLE. *TR",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2010",
        "dateOfIncident": "01/17/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10301703,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE AWD AND THE TRANSMISSION DIED.  WE WERE ON TOP OF A HILL AND LUCKILY WERE ABLE TO FORCE IT UP BEFORE IT COMPLETELY FAILED.  THERE WERE NO SPECIAL CIRCUMSTANCES AS WE WERE AT A STOP LIGHT WHEN IT APPEAR TO FAIL.  WHEN CONTACTING SATURN WE WERE NOTIFIED THAT IT IS NOT A \"RECALL\" ALTHOUGH IT WAS ADMITTED TO BE A MANUFACTURE ISSUE.  DUE TO AN ADDITIONAL MANUFACTURE DEFECT WITH READING THE MILEAGE THEY WILL NOT COVER THE COST TO REPLACE THE TRANSMISSION.  *TR",
        "vin": "5GZCZ43DX2S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2009",
        "dateOfIncident": "10/05/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 SATURN VUE 4WHEEL DRIVE IN FEBRUARY 28,2009.  THIS VUE WENT FROM 55 MILES AN HOUR TO 1MILE ON THE HIGHWAY.  I THOUGHT FOR SURE I WAS DEAD.  THE \"LOW POWER LIGHT COMES ON\"  AFTER TAKING IT TO THE DEALER, $255.00 DOLLARS LATER THEY THOUGHT IT WOULD NOT DO THIS AGAIN.  THEN MONDAY, IT HAPPENED AGAIN IN DOWNTOWN TRAFFIC.  I PULLED OUT AND \"NOTHING\" IT WONT GO I COASTED TO THE SIDE OF THE ROAD AND WASN'T KILLED.  THIS IS SO DANGEROUS.  HOLY COW! FOR THE SECOND TIME I WAS ALMOST DEAD.  THE MOTOR SOUNDS LIKE IT CAN'T FIGURE WHICH \"GEAR\" TO GO INTO?  I CAN FEEL THE TRANSMISSION TRYING TO GO AND THE MOTOR INCREASES IN SOUND BUT DOESN'T SEEM TO GO INTO GEAR. WHAT THE HECK!   CALLED THE DEALERSHIP THEY SAID IT NEEDS A :\"THROTTLE BODY\" REPLACES IT WILL BE AT LEAST $1000.00.  HE SAID 800.00 FOR PART 200 TO PUT IT ON.  WHAT THE HECK? I ALMOST DIED.  THIS IS A HUGE ISSUE.  I HAVE LISTENED TO \"CAR TALK\" AND IT IS KNOW TO THESE FOLKS.  WHAT CAN BE DONE? IS IT REALLY 800.00 FOR A REPLACEMENT \" THROTTLE BODY? COULD THERE BE AN SIGHT WHERE WE COULD SEE THIS IS CORRECT PRICE?  COULD I REPLACE THE PART? OR WILL IT NEED TO BE ON A RACK BECAUSE I CAN NOT GET TO IT.  MY FATHER JOHN B PHARR RETIRED FRO GENERAL MOTORS IN GEORGIA AND TAUGHT ME ABOUT CARS.  BUT HE PASSED AWAY.  I NEED HIS HELP, BUT AS A OVER 30 YEAR EMPLOYEE I HOPE THAT SOMEONE WILL CONSIDER THIS AND HONOR HIS DEDICATION TO GENERAL MOTORS .  I AM GRATEFUL BECAUSE THEY PROVIDED US HEALTH INSURANCE GROWING UP.  I WILL BE GRATEFUL FOR ANY HELP POSSIBLE OR DISCOUNT.  I WILL HAVE PARK IT AND RIDE THE BUS FOR NOW BECAUSE I HAVE BEEN RECOVERING FROM A MEDICAL LEAVE OF 60 DAY FROM MY EMPLOYER HENNEPIN COUNTY IN MINNESOTA.  I AM NOW EARNING MY INCOME AGAIN. MY INCOME IS LIMITED DUE TO THE TIME OFF FOR SHORT TERM DISABILITY.  I HAVE RETURNED TO WORK BUT AM REPAYING LATE PAYMENTS BECAUSE OF THE MEDICAL LEAVE. I HOPE YOU WILL BE ABLE TO HELP IN ANY WAY. *TR",
        "vin": "5GZCZ63B62S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2009",
        "dateOfIncident": "07/17/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277221,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE TRANSMISSION PROBLEMS ON HIGHWAY. THE CAR MADE A LOUD SOUND AND THE SPEED DROPPED DOWN QUICKLY TO 5 MILES/HR. OVER THE PAST 4 WEEKS I HAD TO REPLACE THE ALTERNATOR AND PULLEY BELTS BECAUSE THEY STOPPED WORKING AS WELL. *TR",
        "vin": "5GZCZ63B02S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/05/2009",
        "dateOfIncident": "03/03/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN BROKE ON MY 2002 SATURN VUE LEAVING MY DAUGHTER & ME STRANDED.  IT ONLY HAD 68K MILES.  SATURN DEALERSHIPS ONLY SUGGESTION:  NEW ENGINE @ $3400 INSTALLATION @ $1600.  I CHOSE AN INDEPENDENT MECHANIC, WHO WAS UNAWARE OF THE ZERO TOLERANCE ENGINE.  WHAT IS THAT?!  I AM HEARING ABOUT CLASS ACTION LAWSUITS, THOUSANDS OF DOLLARS IN REPAIRS NATIONWIDE DUE TO THIS SAME MALFUNCTION.   THEY HAVE KNOWN OF THIS DANGEROUS MALFUNCTION FOR YEARS & FAIL TO DO A RECALL.   ISN'T IT TIME THEY BE MADE ACCOUNTABLE.  THERE ARE MANY MANY SIMILAR STORIES TO MINE.  PLEASE RESEARCH!! *TR",
        "vin": "5GZCZ23D32S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/19/2009",
        "dateOfIncident": "03/12/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262487,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST LEFT A STOP LIGHT ON A BUSY STREET IN CHICAGO DRIVING ABOUT 15 MILES AN HOUR AND THE ENGINE JUST DIED.  I TRIED TO RESTART THE CAR AND IT WOULD NOT START.  I CALLED A TOW TRUCK TO HAVE IT TAKEN BACK TO MY REPAIR SHOP.  THE NEXT DAY I WAS TOLD THAT THE TIMING CHAIN HAD BROKEN AND CRUSHED THE CASING AND VALVES AND THAT I WOULD NEED A NEW ENGINE AT A COST OF $3,200.00.  I SPOKE WITH THE SATURN DEALERSHIP IN TINLEY PARK, IL AND THEY AGREED TO PUT A NEW ENGINE IN FOR $2,200.00.  I SPOKE WITH THE SATURN MAIN OFFICE OF CONSUMER COMPLAINTS AND THEY STATED THAT NO RECALLS WERE MADE ON THE 2002 SATURN VUE'S AND WOULD NOT HELP WITH THE COST OF THE REPLACEMENT ENGINE. *TR",
        "vin": "5GZCZ23D92S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/09/2009",
        "dateOfIncident": "08/02/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258122,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE LOST POWER AND WOULD NOT EXCEED 10 MILES AN HOUR. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257417,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROXIMATELY 6-9 MONTHS AGO MY 2002 SATURN VUE, 4 CYL, WITH APPROX 55,000 MILES STOPPED WORKING.  SATURN OF BOWIE, NOW CLOSED, TOLD ME THAT THE TIMING CHAIN BROKE AND ENGINE WAS NOW NO GOOD.  THEY SAID THE ONLY WAY TO FIX VEHICLE WAS TO REPLACE ENGINE AT MY EXPENSE.  APPROXIMATELY $6,500.  I COMPLAINED AND AFTER MY DISCUSSIONS WITH A SATURN HQ PERSON, THEY REPLACED THE ENGINE AND CHARGED ME APPROXIMATELY $5,500.  I HAVE EXACT FIGURES IN MY FILES.  I ASKED IF THERE WAS ANY HISTORY OF THIS PROBLEM AND SATURN RESPONDED THAT IT WASN'T KNOWN PROBLEM.  THIS MORNING AFTER DOING SOME RESEARCH, ON THE INTERNET, RELATING TO ANOTHER PROBLEM WITH MY SATURN VUE REGARDING THE FUEL GAUGE, I LEARNED THAT SATURN WAS AWARE OF THE TIMING CHAIN PROBLEM AND SHOULD HAVE SENT ME A RECALL NOTICE.  THEY CHARGED ME ALOT OF MONEY TO FIX SOMETHING THAT WAS THEIR RESPONSIBILITY BECAUSE OF POOR ENGINEERING.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/05/2008",
        "dateOfIncident": "10/30/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250847,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE  -  CHECK ENGINE LIGHT KEEPS COMING ON DUE TO A FAILED THROTTLE BODY AND THE PARTS.  IT WOULD ALSO CAUSE THE CAR TO GO INTO RESERVE POWER AND THE CAR WOULD ONLY GO 10 MILES AN HOUR.  I WAS JUST INFORMED THAT THIS MUST BE A MAJOR PROBLEM BECAUSE MY MECHANIC JUST INFORMED ME THAT THE PART NEEDED TO REPAIR THIS PROBLEM IS ON BACK ORDER TO APRIL OF 2009.  SO IF THAT IS NOT ENOUGH OF A REASON THAT THIS IS A DEFECT I DO NOT KNOW WHAT IS.  BECAUSE OF THIS I WILL BE WITHOUT A WORKING CAR FOR 4 MONTHS BECAUSE GM/SATURN MAKES CARS THAT DO NOT FUNCTION.  ALSO I HAVE READ THAT THIS PROBLEM HAS BEEN AROUND FOR SEVERAL YEARS AND YOU HAVE NOT  FORCED THEM INTO A RECALL ON SOMETHING THAT COULD CAUSE A PROBLEM ON THE ROAD TO THE DRIVER AND OR OTHER DRIVERS ON THE ROAD. *TR",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2008",
        "dateOfIncident": "11/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248886,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY 100,000 SERVICE PERFORMED ON MY CAR(2002 SATURN VUE) AND SIX MONTHS LATER (LESS THEN 5,000 MILES) MY TIMING BELT BROKE WHILE TRAVELING ON THE INTERSTATE AT 65MPH.  I WAS TOLD THAT IT WAS DUE TO A \"POSSIBLE OIL LEAK\" OR BECAUSE I HADN'T HAD MY OIL CHANGED SINCE MY LAST SERVICE AND SLUDGE HAD POSSIBLE BUILT UP IN THE ENGINE.  WHILE RESEARCHING THE PROBLEM, I NOTED THAT MANY OTHERS HAD THE SAME PROBLEM WITH THE SATURN L SERIES AND A FEW VUES.  I WAS TOLD TO REPAIR THE TIMING CHAIN, CYLINDER HEAD, AND GASKETS WOULD COST $2600 OR I COULD REPLACE THE ENGINE (NOT SURE OF THE COST OF A USED ENGINE AT THIS POINT).  *TR",
        "vin": "5GZCZ23D22S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/20/2008",
        "dateOfIncident": "09/20/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242990,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN, MASSIVE TRANSMISSION FLUID LEAK CAME INTO CONTACT WITH HOT EXHAUST MANIFOLD.  WHILE TRYING TO GET IT OFF OF THE ROAD AFTER A STOP, CLUTCH FAILED.  MANAGED TO DRIVE TO A SAFER LOCATION ABOUT 1/4 MILE AWAY.  SO MUCH SMOKE WAS POURING OUT FROM UNDER THE HOOD THAT I WAS AFRAID TO OPEN IT.  RETREATED TO A SAFE DISTANCE AND CALLED A TOW TRUCK.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/20/2008",
        "dateOfIncident": "07/18/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242996,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TIMING CHAIN FAILURE CAUSING ENGINE DAMAGE.  *TR",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/30/2008",
        "dateOfIncident": "08/29/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240338,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2002 SATURN VUE (4 CYL, 2.2 L ENGINE, MANUAL TRANSMISSION) ON THE FREEWAY.  THE ENGINE STALLED AND THEN LOST POWER.  I FORTUNATELY WAS ABLE TO COAST DOWN THE FREEWAY EXIT, AND I (WITH THE ASSISTANCE OF A FEW KIND HEARTED MOTORISTS) HAD TO PUSH MY CAR OUT OF THE EXIT LANE AND ON COMING TRAFFIC.      MY CAR WAS TOWED THROUGH AAA TO A SERVICE GARAGE.  THE MECHANIC INFORMED ME THAT THE TIMING CHAIN BROKE, AND IN TURN DAMAGED THE PISTONS, THUS REQUIRING ME TO REPLACE THE ENGINE IN MY VEHICLE.  REPLACING THE ENGINE IS ESTIMATED TO COST BETWEEN $1,800 AND $2,800 DEPENDING UPON THE AVAILABILITY OF THE ENGINE IN MY AREA.    IT IS MY UNDERSTANDING THROUGH READING TODAY THAT THERE MAY HAVE BEEN A RECALL ON THIS VERY ISSUE WITH THE SATURN 2.2 L ENGINES, BUT I WAS NEVER CONTACTED BY GENERAL MOTORS CONCERNING THIS ISSUE WITH THE 2.2 L ENGINE.    I AM FORTUNATE THAT I WAS ABLE TO EXIT THE FREEWAY SAFELY, THAT OTHER MOTORISTS WERE ABLE TO HOLD OFF TRAFFIC AND ASSIST ME PUSHING THE CAR TO SAFETY,  AND THAT MY CHILD, OTHER FAMILY MEMBERS, AND I WERE NOT IN AN ACCIDENT OR INJURED DUE TO THIS FAILURE AT HIGH SPEED. *TR",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/14/2008",
        "dateOfIncident": "07/17/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A SATURN VUE 2002.  I TOOK INTO A SATURN DEALERSHIP FOR REPAIRS IN JULY 17, 08.  SATURN REPEATEDLY TOLD ME THE PART WAS COMING.  ON AUG 3, 2008, THEY ASKED ME TO PICK UP MY VEHICLE, I WAS INFORMED THAT THE PART WAS NOT AVAILABLE AND WOULD NOT BE IN UNTIL THE 18TH OF AUGUST.    NOW SATURN IS STATING THE PART MAY NOT COME IN UNTIL THE END OF SEPTEMBER.   MY THROTTLE BODY SYSTEM NEEDS TO BE REPLACED.    MY CAR WILL SIMPLE SHUT OFF WHILE I TRAVELING, I MAY BE GOING 65 MILES PER HOUR AND THE VEHICLE WILL COMPLETELY SHUT OFF WITH NO WARNING.  AT TIMES THE VEHICLE WILL SIMPLY NOT START.  *TR",
        "vin": "5GZCZ63B82S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/09/2008",
        "dateOfIncident": "08/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE;   L61 2.2 LITER 4 CYL ENGINE;  MILEAGE 59,323.      AUGUST 3, 2008.  PREPARING TO ENTER INTERSTATE VEHICLE STOPPED RUNNING.  HAD IT TOWED TO OMAHA SATURN FOR REPAIR.  SERVICE DEPARTMENT STATED THAT TIMING CHAIN HAD BROKEN, AND FALLEN DOWN INTO OIL PAN.  ALONG WITH THIS VALVES WERE DAMAGED (BENT) DUE TO MINIMUM CLEARANCES IN CYLINDER HEAD DESIGN.  REPAIR INVOLVED NEW CYLINDER HEAD AND TIMING CHAIN  ($2650.94) PLUS THE $100.00 TOWING CHARGE.  CAR HAS BEEN WELL MAINTAINED AND HAS NOT BEEN DRIVEN HARD. *TR",
        "vin": "5GZCZ23D82S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/03/2008",
        "dateOfIncident": "08/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236801,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: TO WHOM IT MAY CONCERN;    I AM WRITING THIS LETTER TO STATE HOW BAD A 2002 SATURN VUE IS ON SAFETY.    I JUST CAME IN FROM TRYING TO TOW MY SCOOTER MOBILITY TRAILER UP THE HILL IN FRONT OF MY HOUSE. THE 'SERVICE ENGINE SOON' LIGHT IS ON LIKE IT ALWAYS IS. I HAVE TRIED TO GET SOMETHING DONE ABOUT IT ON SEVERAL OCCASIONS TO NO AVAIL. ONE THING IT SAYS IS THAT THE ENGINE TEMPERATURE THERMOSTAT IS STICKING. I WAS TOLD THAT IT WOULD COST ME $400 TO REPLACE THE THERMOSTAT. THE VEHICLE DOES NOT HAVE A THERMOSTAT PROBLEM. THE TEMPERATURE GAUGE ALWAYS STAYS ABOUT 1/3 OF THE WAY BETWEEN THE SECOND AND THIRD MARKS, WINTER OR SUMMER. THE ONLY DIFFERENCE BETWEEN WINTER AND SUMMER IS THE LENGTH OF TIME IT TAKES TO GET FULLY WARMED UP. THERE IS A HILL BETWEEN MY COMMUNITY AND THE HIGHWAY. IT IS ABOUT  MILE LONG. IN THE SUMMER, THE VEHICLE IS FULLY WARMED UP BY THE BOTTOM OF THAT HILL. IN THE WINTER, IT TAKES TO THE TOP OF THAT HILL BEFORE IT IS FULLY WARMED UP. I SPENT ABOUT #100 FOR A NEW THERMOSTAT AND ALL THE NECESSARY GASKETS TO REPLACE THAT THERMOSTAT AND I STILL HAVE THE LIGHT AND THE TEMPERATURE IS STILL 1.3 THE WAY BETWEEN THE SECOND AND THIRD MARKS.    THE MAIN REASON FOR MY COMPLAINT OF SAFETY IS THAT THE VEHICLE WILL GO INTO 'LIMP MODE' AT ANY TIME, EVEN WHILE DRIVING DOWN THE FREEWAY, AT FREEWAY SPEEDS, AND SUDDENLY I HAVE NO POWER TO AVOID AN ACCIDENT. ANY VEHICLE WITH A 'CHECK ENGINE SOON' LIGHT SHOULD GO INTO LIMP MODE ON STARTUP, NOT RANDOMLY WHILE DRIVING.  *TR",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "AIR BAGS,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/19/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234934,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NO KNOWN CRASHES OR INJURIES. HORN ON VEHICLE STUCK IN ON POSITION AND CAN ONLY BE SILENCED BY REMOVING FUSE. DEFECT IS A POORLY DESIGNED CONTACT STRIP THAT IS PART OF AIR BAG ASSEMBLY. COST OF REPAIRS BY SATURN IS BETWEEN $800 AND $1,200 THUS CAUSING MANY OWNERS TO DRIVE WITHOUT A HORN OR PROPERLY FUNCTIONING AIR BAG.  *TR",
        "vin": "5GZCZ63BX2S"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/11/2008",
        "dateOfIncident": "02/29/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234022,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SATURN VUE.  WHILE DRIVING 25-30 MPH, THE  SERVICE WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL.  THE VEHICLE WAS TAKEN TO SEVERAL DIFFERENT INDEPENDENT MECHANICS AND EACH OF THEM STATED THAT A THROTTLE BODY CONNECTOR WAS NEEDED; HOWEVER, THE DEALER STATED THAT A DIAGNOSTIC COULD BE PERFORMED FOR THE THIRD TIME AT THEIR FACILITY IN ORDER TO ASSIST WITH THE REPAIRS.  THE FAILURE MILEAGE WAS 123,000 AND CURRENT MILEAGE WAS 125,000.     UPDATED 07/29/08  *BF  UPDATED 08/07/08",
        "vin": "5GZCZ63B32S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/16/2008",
        "dateOfIncident": "04/25/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231210,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE PAST YEAR, I HAVE HAD SEVERAL INSTANCES WHERE THE \"CHECK ENGINE\" LIGHT COMES ON AND THE CAR JUST SHUTS DOWN AND WON'T START UP.  I HAVE ALSO HAD THE LOW COOLANT LIGHT COME ON AND WAS LEAKING ANTI-FREEZE, WHICH I KEPT ON FILLING UP. ONCE IT WAS TOWED TO THE DEALER AND WHEN THEY WENT TO LOOK AT IT THE NEXT MORNING, IT STARTED RIGHT UP AND THEY COULD NOT FIGURE OUT WHAT WAS WRONG.  ANOTHER TIME I LEFT IT AND WHEN I CAME BACK, IT STARTED RIGHT UP.  IN BOTH OF THOSE INSTANCES, I WAS DRIVING LESS THAN 40 MPH AND WAS ABLE TO GET TO THE SIDE OF THE ROAD SAFELY.  THE 3RD TIME THAT THE CAR DIED, I WAS TRAVELING 65 MPH ON AN INTERSTATE WHEN THE CAR SUDDENLY DIED, WITHOUT ANY WARNING.  I HAD JUST ENOUGH TIME TO PULL OVER TO THE SIDE OF THE ROAD AND AVERT AN ACCIDENT.  I BOUGHT A NEW CAR, BECAUSE I WAS AFRAID TO DRIVE THIS ONE AND IT HAS BEEN SITTING IN MY DRIVEWAY FOR 8 WEEKS.  I RECENTLY HAD THE VUE TOWED TO A DIFFERENT DEALERSHIP.  THEY SAID THAT I NEED A NEW TIMING BELT AND WATER PUMP.  THEY ALSO SAY THAT I NEED TO HAVE AN I-BOLT PULLEY, BELT TENSIONER, ALTERNATOR, AND SERPENTINE BELT REPLACED.  OTHER REPAIRS THAT ARE NEEDED ARE A FRONT SWAY BAR LINKS AND THE BEARING ON THE DRIVE SHAFT.  THIS CAR HAS ONLY 92,000 MILES.  *TR",
        "vin": "JT5RN75U4G0"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/13/2008",
        "dateOfIncident": "02/23/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230992,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 SATURN VUE, 4CYLINDER, FWD WITH APPROXIMATELY 86,000 MILES.  EARLY THIS YEAR THE BODY CONTROL MODULE (BCM) ON THIS VEHICLE BEGAN PREVENTING THE DOORS FROM UNLOCKING PROPERLY.  I FIRST NOTICED THE ISSUE WHEN MY KEY FOB FOR MY SECURITY SYSTEM BEGAN TO FAIL TO UNLOCK DOORS, CAUSING THE HORN TO CHIRP IRREGULARLY.  I LATER NOTICED THAT IN CERTAIN SITUATIONS, UNLOCKING THE DOORS USING THE POWER LOCK BUTTON ON EACH OF THE FRONT DOORS WOULD NOT UNLOCK THE DOORS.  WHEN I WENT TO MANUALLY PUSH THE LOCK, IT STICKS OR DOES NOT DISENGAGE THE LOCK, ESSENTIALLY LOCKING ALL PASSENGERS IN.  AFTER CRAWLING TO THE BACK SEAT I AM ABLE TO PUSH THE LOCK BUTTON MANUALLY AND ESCAPE.  MY FEAR IS THAT IN AN EMERGENCY, THE BODY CONTROL MODULE WILL SOMEHOW PREVENT ME FROM GETTING OUT OF MY CAR.  *TR",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/20/2008",
        "dateOfIncident": "04/19/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225152,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 SATURN VUE AWD.  AT A LITTLE OVER 100,000 MILES, NOISE STARTED FROM THE FRONT DRIVE TRAIN.  THE NOISE WAS LIKE CONSTANT HOWL.  THE NOISE WOULD START AT ABOUT 30 MPH AND INCREASE AT HIGHER SPEEDS.  IT TOOK A LONG TIME TO NOTICE THAT THE NOISE WOULD DISAPPEAR WHEN TAKING A FREEWAY RAMP TO THE LEFT. THE NOISE SLOWLY GREW LOUDER UNTIL AT 136,000 MILES THE NOISE HAD BECOME VERY LOUD. AFTER SOME INTERNET SEARCHING, THE NOISE WAS BELIEVED TO BE THE FRONT WHEEL BEARING.  NORMALLY, FRONT WHEEL DRIVE WHEEL BEARINGS LAST LONGER SO IT WAS HARD TO BELIEVE IT HAD GONE OUT.  THERE WAS NO NOTICEABLE PLAY IN THE BEARING EITHER ON OR OFF THE VEHICLE.  REPLACING THE BEARINGS ELIMINATED THE NOISE.  I HAVE THE FULL SET OF SATURN SHOP MANUALS AND THE DIAGNOSTICS DID NOT INDICATE THAT THE BEARINGS NEEDED REPLACEMENT.  AT LEAST ON INTERNET POSTING SAID AFTER TAKING APART AN OLD BEARING THAT SATURN HAD ELIMINATED A BEARING RACE.  IF THIS IS TRUE, IT PROBABLY SAVED A FEW CENTS FOR SATURN BUT COST ME HUNDREDS.  AFTER REMOVAL, THE LEFT FRONT WHEEL BEARING HAD NOTICEABLE NOISE JUST TURNING IT BY HAND.  THE RIGHT BEARING WAS IN BETTER CONDITION BUT STILL PRODUCED NOISE ON THE VEHICLE.  THE REAR WHEEL BEARINGS WILL PROBABLY NEED REPLACEMENT ALSO, SINCE NOW IT APPEARS THAT NOISE IS COMING FROM THE RIGHT REAR.  *TR",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/16/2008",
        "dateOfIncident": "02/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10224764,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON FILLING MY GAS TANK THE CHECK ENGINE LIGHTS COME ON AND STAYS ON--SOMETIMES TILL THE TANK IS HALF EMPTY--SOMETIMES COMING ON WHEN THE TANK REACHES HALF.  *TR",
        "vin": "5GZCZ63B12S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/07/2008",
        "dateOfIncident": "04/06/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223553,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BEGAN TO HEAR A LITTLE BIT MORE ENGINE NOISE THAN NORMAL, LIKE A TAPPING NOISE.  I HAD THE OIL CHANGED AS I DID REGULARLY AND WITHIN MANUFACTURERS RECOMMENDATION.  LOCAL MECHANIC SAID IT WAS THE TIMING CHAIN AND TO CONTINUE WITH FREQUENT OIL CHANGES.  CAR DIED WHILE TRAVELING AT 40 MPH LOCALLY ON THE WEEKEND, BUT COULD HAVE HAPPENED WHILE TRAVELING 65MPH ON MY WAY TO WORK IF IT WAS A WEEKDAY.  LUCKILY, I WAS ABLE TO PULL IMMEDIATELY INTO A SIDE STREET AND HAVE THE CAR TOWED TO LOCAL GOODYEAR SERVICE CENTER.  I'VE SEEN INTERNET POSTINGS CITING THE SAME PROBLEMS ON SATURN MODELS WITH THE SAME ENGINE.  THERE MAY EVEN BE A RECALL FOR THE L-CLASS SATURN CARS WITH THE SAME ENGINE AND NOT THE VUE?  *TR",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/07/2008",
        "dateOfIncident": "04/06/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223559,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SATURN VUE.  WHILE DRIVING APPROXIMATELY 40 MPH, THE CHECK ENGINE LIGHT AND THE LOW POWER LIGHT ILLUMINATED ON THE INSTRUMENT PANEL.  THE VEHICLE SHUT OFF COMPLETELY AND WOULD NOT RESTART AFTER SEVERAL ATTEMPTS.  THE VEHICLE WAS DIAGNOSED AS HAVING TIMING CHAIN FAILURE.  THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 07V519000 (ENGINE AND ENGINE COOLING).  THE CURRENT AND FAILURE MILEAGES WERE 125,000.     UPDATED 6/9/08 *CN  UPDATED 06/09/08",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/04/2008",
        "dateOfIncident": "04/03/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223353,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR SHUT OFF WHILE DRIVING.  THERE WAS NO WARNING PRIOR TO CAR TURNING OFF:  NO INTERIOR WARNING LIGHTS CAME ON PRIOR TO CAR STOPPING AND NO NOISES WERE HEARD PRIOR TO THE INCIDENT.  I WAS UNABLE TO START THE CAR BACK UP AND MOVE OFF OF THE ROAD.    THIS CAR HAS ALL OF IT'S ROUTINE MAINTENANCE UP TO DATE.     DEALERSHIP SYSTEM DIAGNOSTICS SHOWS THAT IT IS A PROBLEM WITH THE \"CRANK SHAFT POSITION SENSOR.\"  *TR",
        "vin": "5GZCZ63B62S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "01/20/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218743,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS BRAKE FAILURE.  *TR",
        "vin": "5GZCZ63B82S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/25/2008",
        "dateOfIncident": "01/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SATURN VUE.  WHILE DRIVING APPROXIMATELY 60 MPH, THE CONTACT NOTICED THAT THE ENGINE AND REDUCED POWER LIGHTS ILLUMINATED ON THE INSTRUMENT CONTROL PANEL.   THE VEHICLE COMPLETELY LOST POWER.  THE CONTACT HAD TO SHIFT INTO NEUTRAL IN ORDER TO PULL OFF THE ROAD.  THE VEHICLE WAS TOWED TO A LOCAL DEALER AND THEY STATED THAT THE TIMING CHAIN FAILED.  SHE HAS PICTURES OF THE FAILED COMPONENT.  THE CONTACT FILED A FORMAL COMPLAINT WITH THE MANUFACTURER.  THE FAILURE AND CURRENT MILEAGES WERE 117,000.  UPDATED 02/15/08.  *LJ",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2008",
        "dateOfIncident": "01/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2002 SATURN VUE 2.2L 4CYL LAST NIGHT AT APPROX. 55-60MPH, MY REDUCED POWER LIGHT CAME ON, ALONG WITH THE SERVICE ENGINE SOON.  I HAD NO FOREWARNING NOISES OR INDICATION MY CAR WAS GOING INTO FAILURE.  I IMMEDIATELY PUT MY CAR INTO NEUTRAL, SHUT THE IGNITION DOWN, AND PULLED OFF THE ROAD AS SAFELY AS I COULD, STILL AT APPROX. 50 MPH SPEED AS I HAD MY 3 CHILDREN IN THE CAR WITH ME.  AFTER THE CAR WAS SHUT DOWN FOR 5 MINS AND SPEAKING TO MY GM DEALERSHIP, THEY ADVISED ME TO TRY TO TURN THE CAR OVER IN CASE IT WAS JUST A \"GLITCH\" IN THE COMPUTER SYSTEM, TO NO AVAIL.  IT WOULDN'T TURN OVER.  AFTER BEING TOWED TO MY GM DEALERSHIP, I WAS TOLD MY VEHICLE HAD A \"ZERO TOLERANCE\" ENGINE, AND THAT MY TIMING CHAIN HAD BROKE.  I WAS TOLD MY ENGINE WAS MOST LIKELY BLOWN, AND THAT I NEEDED TO HAVE MY ENGINE REPLACED.  THE MINIMAL COST OF THIS TIMING CHAIN ERROR IS $3,000 EVEN WITH A USED ENGINE GOING INTO MY CAR.   I SEE MANY COMPLAINTS ABOUT SATURN'S 2.2L ENGINE IN THE APPROX. 2001-2002 RANGE, AND I BELIEVE MY VEHICLE IS PART OF THIS.  I AM CONTACTING SATURN ON MONDAY THE 21ST TO SEE IF I CAN GET SOME SORT OF HELP IN REPLACING MY ENGINE, AS THIS IS APPARENTLY AN OBVIOUS PROBLEM WITH THEIR ENGINES.  *TR",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2008",
        "dateOfIncident": "01/12/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214582,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "LEAKING RIGHT AXLE SEAL.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/24/2007",
        "dateOfIncident": "11/06/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212646,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ONLY \"EVENT\" WHICH LED TO THE FAILURE WAS ACCELERATING TO THEN MERGE INTO ONCOMING TRAFFIC. THE TIMING CHAIN FAILED/BROKE DURING ACCELERATION WHILE MERGING WITH ONCOMING TRAFFIC. POWER WAS THEN LOST,THE VEHICLE DIED WHILE GOING DOWNHILL. THIS CAUSED LOSS OF FULL BRAKES AND STEERING WHILE THE VEHICLE ROLLED TO A STOP. THE CHAIN THEN DAMAGED MULTIPLE VALVES LEADING TO A POTENTIAL MINIMUM $2000 REPAIR.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/23/2007",
        "dateOfIncident": "07/16/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE PULLED UP TO A HOUSE THAT MY DAUGHTER WAS VISITING AND HONKED THE HORN FOR HER TO COME OUT.  THE HORN CONTINUED TO SOUND UNTIL THE FUSE WAS PULLED.  I HAVE DONE RESEARCH AND IT LOOKS LIKE THIS IS A CONTINUOUS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/05/2007",
        "dateOfIncident": "09/25/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10205072,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 16 YEAR OLD SON WAS DRIVING.  MY 13 YEAR OLD DAUGHTER WAS HIS PASSENGER.  HE WAS DRIVING A 2002 SATURN VUE.  HE HIT A TREE, DEAD-ON, GOING 40 MPH.  THE AIRBAGS DID NOT DEPLOY.  FIREFIGHTERS, POLICE, AMBULANCE FOLKS, BODY SHOP REP:  THEY ALL SAID THE SAME THING AND LOOK AT ME WITH AMAZEMENT THAT THIS HAPPENED (OR DIDN'T HAPPEN).  I BOUGHT THE CAR WITH THE IMPRESSION IT WAS EQUIPPED WITH WORKING AIRBAGS.  IF A VEHICLE HITS SOMEONE, DEAD-ON, GOING 40MPH, I EXPECT AIRBAGS TO WORK, ESPECIALLY WHEN THE VEHICLE WAS SOLD TO ME USING THIS AS A FEATURE.  LAST NIGHT, A WEEK AFTER OUR ACCIDENT, WE PASSED YET ANOTHER VUE ACCIDENT SO I STOPPED OUT OF CURIOSITY.  THIS LADY WAS TRAVELING 40-45 MPH AND REAR ENDED ANOTHER CAR.  GUESS WHAT, HER AIRBAGS DID NOT DEPLOY EITHER.  I SUPPOSE I'LL HAVE TO START MY OWN LITTLE \"SATURN\" INVESTIGATION SERVICE AS I INTEND TO FIND OUT JUST HOW OFTEN THIS HAPPENS.  THIS LADY HAD A 2007 VUE, SO I DO NOT ACCEPT MY CAR BEING OLDER OR ANYTHING ELSE AS AN EXCUSE OF SOMETHING THAT LOOKS TO ME LIKE WAS DEFECTIVE TO START WITH.  *TR",
        "vin": "5GZCZ23D42S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/25/2007",
        "dateOfIncident": "08/08/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204097,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE USED (APP 47K MILES ON IT) IN MARCH 2006.  DURING SUMMER OF 2006 THERE STARTED TO BE A PROBLEM WHEREIN THE CAR, WHEN TRAVELING DOWN THE ROAD, WOULD SUDDENLY SWITCH, WITHOUT WARNING, INTO A \"REDUCED POWER MODE\".  A SMALL LIGHT WOULD COME ON INDICATING THIS, BUT THE BIGGEST PROBLEM WAS THAT ABOUT 5 SECONDS AFTER THIS LIGHT COMES ON, THE VEHICLE DOWN SHIFTED INTO 2ND GEAR AND CAUSED THE ENGINE TO BREAK DOWN TO 30 MPH.  THE ONLY WAY TO RESTORE POWER WAS TO PULL OVER AND SHUT THE VEHICLE OFF FOR 30-60 SECONDS.    ***I WAS TOLD BY THE REPAIR CENTER THAT THERE ARE SEVERAL TECHNICAL SERVICE BULLETINS WITHIN SATURN FOR THIS DEFECT, SO THEY KNOW IT EXISTS.  ***    HOWEVER, BECAUSE THE COST OF THE REPAIR (TO CONSUMERS) IS OVER $1300, THEY HAVE NOT MADE A RECALL OF WHAT IS OBVIOUSLY A SAFETY DEFECT.  THE DEALER HAS ATTEMPTED SEVERAL SHORTCUTS IN THE PAST YEAR TO FIX THE PROBLEM, EACH TIME WITH ONLY TEMPORARY SUCCESS.  I HAVE COMPLAINED TO BOTH THE SATURN REPAIR CENTER AND SATURN CORPORATE CUSTOMER SERVICE, NEITHER WILL OFFER ANY CONCESSIONS OTHER THAN COVERING A $100 DIAGNOSTIC FEE AFTER I HAD ALREADY PAID SUCH FEE TWICE.    A DEFECT WHICH CAUSES THE CAR TO FORCEFULLY SLOW DOWN TO 30 MPH IS RISKING THE LIFE OF MY FAMILY, SINCE WE OFTEN TRAVEL ON HIGHWAYS TO GET TO WHERE WE ARE GOING.  CURRENTLY, WE DO NOT USE THE VEHICLE FOR HIGHWAY TRAVEL AND ARE FORCED TO USE OUR OTHER CAR.  *JB",
        "vin": "5GZCZ63B02S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/27/2007",
        "dateOfIncident": "08/27/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10200953,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 8/06 WE PURCHASED A 2002 SATURN VUE FROM A SATURN DEALER FOR OUR 16-YEAR OLD DAUGHTER.  TODAY, SHE WAS INVOLVED IN A 55 MPH ROLLOVER AND FLIPPED HER CAR END-OVER-END 5 TIMES.  MY CONCERN IS THAT THERE WAS NO AIRBAG DEPLOYMENT.  WE WERE SHOWN A CARFAX AND TIME OF PURCHASE.  HOWEVER, TODAY'S ACCIDENT LEADS ME TO BELIEVE THAT (A) AIRBAGS WERE FAULTY (B) AIRBAGS HAD DEPLOYED IN A PRIOR ACCIDENT AND WERE NOT RE-BUILT (C) AIRBAGS HAD BEEN DISCONNECTED OR TAMPERED WITH SOMETIME PRIOR.    PLEASE ADVISE AS TO WHAT ACTION, IF ANY, SHOULD BE TAKEN.  *JB",
        "vin": "5GZCZ63B62S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/01/2007",
        "dateOfIncident": "07/27/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198171,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2002 SATURN VUE. WHILE DRIVING 70 MPH, HE HEARD A NOISE IN THE ENGINE. THE CHECK ENGINE AND REDUCE POWER LIGHT WERE ALSO ILLUMINATED. THE VEHICLE DRIFTED INTO THE SLOW LANE ALLOWING HIM TO STOP. THE VEHICLE WOULD NOT RESTART. THE VEHICLE WAS TOWED AND THE MECHANIC STATED THAT FAULTY WIRING CAUSED THE FAILURE. THE MECHANIC REPAIRED THE WIRING; HOWEVER, THE TIMING CHAIN FELL OFF. VEHICLE MAINTENANCE HAS BEEN UP TO DATE SINCE HE PURCHASED THE VEHICLE. THE TIMING CHAIN SHOULD NOT HAVE FAILED DUE TO THE MILEAGE. THE CURRENT AND FAILURE MILEAGES WERE 88,165.",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/11/2007",
        "dateOfIncident": "06/04/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192916,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TIMING CHAIN ON MY 2002 SATURN VUE, THAT HAS ONLY 55,000 MILES ON IT, BROKE, CAUSING THE ENGINE TO BE DESTROYED. (ENGINE DESTROYED WAS VERIFIED BY THE DEALERSHIP I TOOK IT TO, THEY SAID IT WAS SOMETHING THEY HAD NEVER SEEN HAPPEN, YET I SEE MANY COMPLAINTS ABOUT THEIR L SERIES HERE. MY CAR HAS THE SAME ENGINE AS IT WAS THE FIRST YEAR THE VUE WAS MADE AND THE ENGINE WAS THE SAME AS THE L SERIES THAT YEAR). *TR",
        "vin": "5GZCZ23D92S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2007",
        "dateOfIncident": "05/14/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE 4 CYLINDER ENGINE.  CATASTROPHIC ENGINE FAILURE AT 74,000 MILES.  TIMING CHAIN BROKE WITHOUT WARNING, SHUTTING DOWN VEHICLE WHILE DRIVING.  CAUSED DAMAGE TO EIGHT OF THE SIXTEEN VALVES.  HAVE TO REPLACE CHAIN, HAVE CYLINDER HEADS MACHINED AND OTHER WORK DONE (STILL IN PROGRESS).  PARTS ARE ONLY AVAILABLE FROM SATURN.*AK",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/24/2007",
        "dateOfIncident": "02/15/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188726,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SATURN VUE.  WHILE DRIVING 25 MPH THE VEHICLE HESITATED THEN SHUT OFF WITHOUT WARNING.  THE CHECK ENGINE WARNING ILLUMINATED AFTER THE VEHICLE SHUT OFF.  THE CONTACT WAS ABLE TO RESTART THE VEHICLE IMMEDIATELY AFTER IT SHUT OFF.  THE MECHANIC STATED IT  WAS AN ELECTRICAL PROBLEM.  HE REPLACED THE THERMOSTAT. HOWEVER, THAT DID NOT REMEDY THE PROBLEM.  THE VEHICLE HAD THE SAME FAILURE ON FOUR OCCASIONS.  THE FAILURE MILEAGE WAS 47,000 MILES , AND THE CURRENT MILEAGE WAS 50,000 MILES AS OF 04-24-07.  *AK  UPDATED 09/05/07. *JB",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/15/2007",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185161,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE (42000 MILES): NOTICED RUMBLING SOUND AND VIBRATION COMING FROM AREA OF RUBBER BOOT WHERE STEERING COLUMN ENTERS FLOOR BOARD. APPLIED LUBRICANT AND THIS TEMPORARILY CORRECTED THE PROBLEM BUT IT SOON RETURNED. DEALER CLAIMS STEERING COLUMN IS BAD AND NEED REPLACEMENT - $1000+ FOR PARTS AND LABOR.  *JB",
        "vin": "5GZCZ63B12S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2007",
        "dateOfIncident": "02/08/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184222,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN CONSTANTLY ON IN THE VERY EARLY HOURS OF THE MORNING. WAS TOLD BY SATURN DEALER THAT THIS WOULD COST OVER $700 BECAUSE THE ENTIRE AIR BAG WOULD NEED REPLACING! I NEEDED TO REMOVE THE FUSE FOR THE HORN CAUSING A SAFETY ISSUE FOR MYSELF AND FAMILY. THIS IS A VERY LARGE PROBLEM SATURN HAS WITH ALL OF THEIR VEHICLES AND THEY REFUSE TO RECOGNIZE IT. *JB",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/23/2007",
        "dateOfIncident": "02/18/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183344,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING AT @ 35 MILES PER HOUR IN OUR 2002 SATURN VUE WHEN IT STOPPED.  JUST STOPPED.  WAITED 2 HOURS IN FRIGID CONDITIONS FOR A TOW.  FOUND OUT THE FOLLOWING DAY THAT THE TIMING CHAIN HAD SNAPPED.  THIS IN TURN DAMAGED TWO OF THE ENGINE VALVES CAUSING 1400 DOLLARS IN DAMAGE.  VEHICLE HAS ONLY 65,000 MILES.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/02/2007",
        "dateOfIncident": "02/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181429,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL GAUGES ON THE DASH FAILED AS I WAS DRIVING ON THE HIGHWAY. THE SPEEDOMETER READ 0 MILES/HR, GAS GAGE READ 0, ETC.  DEALER CLAIMS THAT THE BCM WAS NOT GROUNDED AND THE ELECTRICITY ARCHED AND SHORTED THE BCM.  THE CAR ONLY HAS ABOUT 50,000 MILES AND DEALER QUOTED ME $409 TO FIX THE PROBLEM. *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "12/10/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177124,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND INSTANCE IN 54,438 MILES OF: TIMING CHAIN 'SLIPPED' DUE TO LACK OF LUBRICATION.  IN BOTH INSTANCES, THE ENGINE STALLED WHILE DRIVING (AT LOW SPEED), THEN RESTARTED WITH REDUCED POWER/PERFORMANCE ALONG WITH THE SERVICE ENGINE WARNING LIGHT.  THIS TIME, THE ENGINE WAS BADLY DAMAGED AND MUST BE REPLACED.  SATURN BLAMES ME FOR NOT KEEPING UP WITH THE EVERY 3000 MILE OIL CHANGE REQUIREMENT. (AND IS SATISFIED TO LOOK NO FURTHER FOR ANY OTHER CAUSES.)   I HAVE SEEN THE INVESTIGATIVE REPORT (PE06-006), ON THIS SITE, OF AN INVESTIGATION INTO FREQUENT TIMING CHAIN FAILURES IN L-SERIES MODELS (HAVING THE SAME ENGINE AS THIS VEHICLE). THE REPORT REFERENCES LACK OF OIL FLOW TO THE TIMING CHAIN WHEN OPERATING AT LOW RPM. (THIS IS THE TYPE OF DRIVING I DO.) THE REPORT ALSO REFERENCES GM TSB 03-06-01-017 STATING \"ALL TIMING CHAIN SERVICE KITS NOW AVAILABLE WILL INCLUDE AN OILER NOZZLE, A NEW DESIGN THAT WILL INCREASE OIL FLOW TO THE TIMING CHAIN UNDER LOW RPM OPERATING CONDITIONS\".  THE DEALER DOES NOT ACKNOWLEDGE EXISTENCE OF THE IMPROVED DESIGN FOR THE VUE ENGINE.  THE FIRST FAILURE INSTANCE WAS COVERED UNDER WARRANTY AT 24,663 MILES. THE CURRENT INSTANCE OCCURRED AT 54,438 MI. , AND IS NOW OUT OF WARRANTY.   SATURN IS OFFERING TO TAKE 50% COST OF AN ENGINE REPLACEMENT.  *JB",
        "vin": "5GZCZ23D62S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/26/2006",
        "dateOfIncident": "12/18/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177030,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INCIDENT = SECOND INSTANCE IN 54,438 MILES OF:  TIMING CHAIN 'SLIPPED' DUE TO LACK OF LUBRICATION. THIS IS ON MY 2002 SATURN VUE, 4 CYL. ENGINE - FRONT WHEEL DRIVE. SATURN BLAMES ME FOR NOT KEEPING UP WITH THE EVERY 3000 MILE OIL CHANGE REQUIREMENT. (AND IS SATISFIED TO LOOK NO FURTHER FOR OTHER CAUSES.)  I HAVE SEEN A REPORT, ON THIS SITE, OF AN INVESTIGATION INTO FREQUENT TIMING CHAIN FAILURES IN L-SERIES MODELS (HAVING THE SAME ENGINE).  THE REPORT REFERENCES LACK OF OIL FLOW TO THE TIMING CHAIN WHEN OPERATING AT LOW RPM.  (THIS IS THE TYPE OF DRIVING I DO.)  THE REPORT ALSO REFERENCES \"ALL TIMING CHAIN SERVICE KITS NOW AVAILABLE WILL INCLUDE AN OILER NOZZEL, A NEW DESIGN THAT WILL INCREASE OIL FLOW TO THE TIMING CHAIN UNDER LOW RPM OPERATING CONDITIONS\".  THE FIRST INSTANCE WAS COVERED UNDER WARRANTEE AT 24,663 MILES.  THE CURRENT INSTANCE OCCURRED AT 54,438 MI. , AND IS NOW OUT OF WARRANTEE.  DAMAGE RESULTING = ENGINE DAMAGE FOR THE SECOND INSTANCE IS \"BEYOND REPAIR\", AND I AM TOLD THE ENGINE MUST BE REPLACED.  EVEN THOUGH THE VEHICLE IS OUT OF WARANTEE, SATURN OFFERS TO PAY 50% OF THE COST OF A REBUILT ENGINE REPLACEMENT. BUT, I CANNOT AFFORD EVEN 50% AT THIS TIME.  I HAVE OPENNED A CASE WITH SATURN TO GET MORE SUPPORT.  THE CASE IS CURRENTLY AWAITING ACTION BY THE DISTRICT MANAGER WHO IS ON VACATION UNTIL THE FIRTST OF THE YEAR.  *NM",
        "vin": "5GZCZ23D62S"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/24/2006",
        "dateOfIncident": "11/21/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174164,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE PARKED IN THE DRIVEWAY THE ALARM SOUNDED WITHOUT WARNING. ALSO, THE LIGHT SWITCH AND INSTRUMENT PANEL BECAME HOT WHEN THE LIGHTS WERE ILLUMINATED.  THE DEALER HAS NOT BEEN CONTACTED.",
        "vin": "5GZCZ23D52S"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/25/2006",
        "dateOfIncident": "09/04/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171780,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR DRIVER'S SIDE DOOR OPENING MECHANISM FAILED. OBVIOUS SAFETY ISSUE FOR BACK SEAT WHERE CHILDREN SIT IN CAR. DEALER NOTED THAT MANUF HAD SINCE REDESIGNED THE MECHANISM HOWEVER MANUF WOULD NOT REIMBURSE FOR REPAIR COST OF $275 WHEN CONTACTED REPEATEDLY.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/28/2006",
        "dateOfIncident": "09/26/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169554,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SATURN VUE (65,000 MILES) MAKING NOISE.  WOULD NOT START, TOWED TO MECHANIC.  TIMING CHAIN FAILURE CAUSING ENGINE DAMAGE.  ESTIMATED COST IS $3000; LOSS OF VEHICLE FOR AT LEAST A WEEK WHILE BEING REPAIRED.  CURRENTLY AT THE MECHANICS AWAITING REPAIR.   *JB",
        "vin": "JT4RN81A1N0"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "09/15/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168644,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) WAS TURNING RIGHT  FROM DRIVEWAY  ONTO STREET FROM WORK  (2) WAS A LOUD METAL SNAPPING SOUND, THEN A GRINDING TYPE SOUND WHILE DRIVING HOME. THUMPS WHEN MAKING TURNS WHEN CHECKED AT HOME, DISCOVERED THAT FRONT STABILIZER BAR'S RIGHT LINK HAD SNAPPED LOOSE AT JUNCTION OF ROD AND BALL JOINT ON THE SUSPENSION STRUT. GRINDING WAS DUE TO LOOSE END OF THE LINK RUBBING INSIDE THE WHEEL.  (3) LINK HAD TO BE REPLACED, WAS DIFFERENT DESIGN FROM ORIGINAL. ORIGINAL WAS 3 PIECES SCREWED TOGETHER, REPLACEMENT WAS CASST SINGLE PIECE. ORIGINAL IS AVAILABLE. FAILURE COULD HAVE LED TO THE BROKEN PIECE DISABLING BRAKES IF IT RUPTURED THE BRAKE HOUSE, OR DISABLING ABS HAD IT BROKEN WIRE LEADS WHICH ARE IN CLOSE PROXIMITY. PARTS REDESIGN POINTS TO PRIOR KNOWLEDGE THAT OLD DESIGN IS DEFECTIVE.  *JB",
        "vin": "5GZCZ63B12S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/14/2006",
        "dateOfIncident": "08/25/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168290,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, OUR 2002 VUE MADE A GRINDING NOISE AND THEN BEGAN TO LOSE POWER.  AS WE WERE PULLING OFF TO THE SIDE, THE VEHICLE STALLED AND THEN WOULD NOT RE-START.  THE SATURN DEALERSHIP TOWED THE VUE TO THEIR LOT AND INFORMED US , THAT THE TIMING CHAIN HAD SKIPPED AND BLEW THE MOTOR. THE TIMING CHAIN WAS SUPPOSED TO BE NO MAINTENANCE AND DIDN'T EVEN NEED TO BE CHECKED UNTIL 100,000 MILES.  MY VUE HAD 65,000 MILES.  AFTER 3 WEEKS WE WERE TOLD THAT THEY WOULD REBUILD THE ENGINE AT A COST OF $3500- $3800 AND SATURN WOULD PAY HALF OF THAT COST.  SEVERAL WEEKS PRIOR, THE VEHICLE WAS STALLING WHILE DRIVING AND WOULD NOT RESTART UNTIL IT COOLED OFF.  WE TOOK IT TO THE DEALERSHIP AND THEY REPLACED A SENSOR FOR THE CAM SHAFT.  THE SWITCH FOR THE BACK WIPER HAS BEEN REPLACED AND WE WERE TOLD BY SATURN TECH'S THAT THE MOTOR FOR THE BACK WIPER ALSO NEEDS TO BE REPLACED, AGAIN AT OUR COST.  *JB",
        "vin": "5GZCZ63B92S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/04/2006",
        "dateOfIncident": "08/29/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167297,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2002 SATURN VUE TO WORK, THE REDUCED POWER AND SERVICE ENGINE LIGHTS CAME ON SIMULTANEOUSLY, AND I HAD NO POWER.  I PULLED OVER TO THE SIDE OF THE ROAD WHERE A STATE TROOPER SAT BEHIND ME WITH HIS LIGHTS ON SO THAT I WOULD NOT BE REAR-ENDED.  MY CAR WAS TOWED TO A LOCAL REPAIR STATION WHERE IT COULD NOT BE FIXED, SO IT WAS TOWED TO THE SATURN DEALER.  IT WAS REPORTED TO ME THAT THE TIMING CHAIN BROKE AND SINCE THE ENGINE WAS A \"ZERO TOLERANCE\" ENGINE, THE ENTIRE ENGINE HAS TO BE REPLACED AT A COST OF OVER $2000.  I HAVE AN EXTENDED WARRANTY, BUT DO NOT HAVE COPIES OF THE RECEIPTS FOR OIL CHANGES SO THEY WILL NOT HONOR THE WARRANTY (FOR WHICH I PAID $1700).  HERITAGE (THE COMPANY WHICH I BOUGHT THE WARRANTY FROM WHEN I BOUGHT THE CAR AT SATURN) SAYS THAT IF I PAY $435 TO HAVE THE ENGINE TORN DOWN, THEY WILL SEND AN AUDITOR TO DETERMINE IF THEY WILL PAY FOR THE REPAIRS OR NOT.  MY CONCERN IS THAT THE ENGINE THAT THEY WILL PUT IN HAS 28,000 MILES ON IT AND THE TIMING CHAIN MAY BREAK ON THIS ENGINE AS WELL.  *NM",
        "vin": "1G8ZF559XRZ"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/29/2006",
        "dateOfIncident": "07/24/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163857,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS DOOR WOULD NOT OPEN.. THIS HAPPENED 3 OR 4 TIMES OVER THE PAST COUPLE MONTHS BUT USUALLY AFTER ATTEMPTING SEVERAL TIMES THE DOOR WOULD FINALLY OPEN, HOWEVER THIS TIME IT WOULD NOT OPEN.. I RETURNED TO MY HOME AND REFUSED TO DRIVE THE CAR UNTIL THE DEALER COULD LOOK AT IT AND SOLVE THE PROBLEM. IT TOOK 4 DAYS BEFORE I COULD GET AN APPOINTMENT. AFTER DRIVING 75 MILES TO THE NEAREST DEALERSHIP I WAS TOLD THAT THE DOOR PANEL HAD 2 BROKEN CLIPS THAT HELD THE SIDE PANEL ON AND THAT IT WOULD COST $450 TO REPLACE THE DOOR PANEL.. I FIND THIS TO BE AN EXTREME SAFETY HAZARD IN THE EVENT OF AN ACCIDENT OR FIRE AND THE NEED TO EVACUATE THE AUTOMOBILE.. MY ISSUE HAS NOT BEEN ADDRESSED AS OF YET BUT AFTER OWNING A TOTAL OF 3 SATURN CARS AND ALL THREE HAVING DEFECTIVE ISSUES THAT SATURN WILL PROBABLY DO NOTHING. I FIND IT ODD THAT SATURN OFFERED 2 YEARS AGO TO BUY BACK OUR SATURN VUE BECAUSE THEY WANTED TO USE IT FOR RESEARCH... WE DECLINED ALTHOUGH WE NOW REGRET NOT FOLLOWING THROUGH WITH IT. SATURN DOES NOT STAND BEHIND THEIR PRODUCT AND NEVER CLAIM LIABILITY FOR THEIR FAULTY PRODUCT. I WOULD NEVER BUY ANOTHER SATURN PRODUCT NOR WOULD I EVER RECOMMEND SATURN TO A FRIEND.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/17/2006",
        "dateOfIncident": "12/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162604,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE HAS TIMING CHAIN FAILURE WHICH CAUSES VEHICLE TO STALL.  THE CHECK ENGINE LIGHT ILLUMINATED AND THE DEALER CANNOT FIND THE CAUSE OF THE ILLUMINATION.  THE TRANSMISSION ALSO HAS PROBLEMS AS WELL AS THE BRAKES.",
        "vin": "5GZCZ33D82S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2006",
        "dateOfIncident": "07/08/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162037,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A FAILED TRANSMISSION, ON A 2002 SATURN VUE WITH 56K MILES ON IT.  I BROUGHT IT IN THREE MONTHS AFTER I BOUGHT BECAUSE THE TRANSMISSION WAS SLIPPING THEY CLAIMED THEY CHANGED THE FLUID, DID A TUNE UP ETC., BUT THE RIDE REALLY DIDN'T CHANGE.  WELL THE TRANSMISSION FINALLY WENT OUT, AND THEY'RE ORDERING PARTS TO \"FIX\" THE TRANSMISSION INSTEAD OF REPLACING IT.  IN FACT THEY DON'T MAKE THE TRANSMISSION ANYMORE (WHICH IS UNDERSTANDABLE, WHO WOULD CONTINUE TO MAKE SOMETHING THAT DOESN'T WORK) BUT NOW IF MINE GOES OUT I HAVE TO EITHER HAVE PARTS REPLACED, OR GET ONE OUT OF A WRECKED ONE.  *NM",
        "vin": "5GZCZ33D72S"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/18/2006",
        "dateOfIncident": "05/08/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157804,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SATURN VUE HAS ISSUES WITH SWAY BAR, HAD TO REPLACE O RINGS AND DO ALIGNMENT--DEALERSHIP/SERVICE DEPT CLAIMED IT WAS BECAUSE OF MICHIGAN ROADS, FUNNY THING IS THAT THIS VEHICLE HAS BEEN IN VA MOST OF THE PAST 9 MONTHS.  MR. FARMER AT SATURN OF FLINT WAS VERY RUDE TO ME ON THE PHONE.  MANUFACTURER DOES NOT APPEAR TO BE CONCERNED THAT THIS IS A SAFETY ISSUE.  MY UNDERSTANDING IS THAT ONCE THE O RINGS GO THEN GOES THE ALIGNMENT, TIRES AND THEN BRAKES.  I HAVE ALSO BEEN TOLD THAT THIS VEHICLE HAS HAD 'TROUBLE' WITH THE O RINGS.  WHAT DOES IT TAKE FOR THE VEHICLE TO BE RECALLED? *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/04/2006",
        "dateOfIncident": "04/04/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154547,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMEONE WAS PREPARING TO CUT ME OFF, SO I SOUNDED THE HORN AS A WARNING.  THE HORN WOULD NOT SHUT OFF.  I PULLED THE FUSE TO QUIET THE HORN.  TOOK IT TO THE DEALERSHIP SAME DAY AND WAS INFORMED THAT THE HORN/DRIVER AIR BAG RELAY NEEDED TO BE REPLACED AT OVER $700 JUST FOR THE PART!  COMMON PROBLEM/POOR DESIGN FEATURE - SEE WWW.SATURNFANS.COM/FORUMS/ARCHIVE/INDEX.PHP/T-52432.HTML.  *NM",
        "vin": "5GZCZ23D22S"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/20/2006",
        "dateOfIncident": "03/15/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153160,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN SIGNALS DO NOT WORK ALL THE TIME, FEAR OF REAR END COLLISION. THE TURN SIGNALS HAVE TO BE RESET BY TURNING ON HAZARD WARNING FLASHERS MOMENTARILY THEN TRY TURN SIGNALS! *JB",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/26/2006",
        "dateOfIncident": "09/10/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER THE STEERING WHEEL IS TURNED IT MAKES A  NOISE AND SEEMS TO VIBRATE THE VEHICLE. IT HAS NOT YET FAILED,  BUT IS VERY WORRISOME.*AK",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2005",
        "dateOfIncident": "10/22/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140621,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER STATED THAT THE HORN  WENT OFF ON ITS OWN.  THE CONSUMER HAD TO DISCONNECT THE BATTERY TO STOP THE VEHICLE.  THE VEHICLE HAD NOT BEEN TAKEN TO ANY MECHANIC FOR THIS PROBLEM.  *AK  (11/23/05)  *SC",
        "vin": "5GZCZ23DX2S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/22/2005",
        "dateOfIncident": "09/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "9/15/04 VEHICLE LOST POWER WHEN ACCELERATING TO MAKE A LEFT TURN.  I ALMOST HAD A COLLISION FROM AN ONCOMING VEHICLE.  VUE HESITATED AGAIN AND LOST POWER WHILE ATTEMPTING TO ACCELERATE TO GET UP TO POSTED SPEED.  I HAD THE ACCELERATOR FLOORED, RPMS SHOT UP TO 6000 AND I WAS ONLY ABLE TO GO 20 - 25 MILES PER HOUR DOWN THE ROAD.  ATTEMPTED TO DRIVE HOME AT THE END OF THE DAY, BUT VUE WOULDN'T EXCEED 20 - 25 MILES PER HOUR.  WITH 21,937 MILE, I DROVE TO SATURN OF ROCHESTER (MN) AND DROPPED OFF ADVISED DEALER THAT TRANSMISSION SLIPPED AND ENGINE RACED.    9/16/04 SATURN OF ROCHESTER (MN) TECHNICIAN DROVE CAR AND FELT TRANSMISSION SLIP.    TECHNICIAN DRAINED FLUID AND FOUND METAL IN FLUID AND BELT SLIPPING.  DEALERSHIP CALLED TO ADVISE THAT TRANSMISSION NEEDED TO BE REPLACED!  RETURNED TO OWNER ON 9/23/04.    9/27/04, WITH 22,060 MILES, BROUGHT VUE BACK TO SATURN OF ROCHESTER (MN) BECAUSE SERVICE ENGINE SOON LIGHT WAS ON.   SATURN VIE WAS ONLY ABLE TO GO 20 - 25 MILES PER HOUR DOWN THE ROAD '' ONCE AGAIN, HAD TO TAKE BACK ROADS TO SAFELY GET TO DEALERSHIP.  TECHNICIAN INDICATED THAT THEY HAD TO REBUILD THE TRANSMISSION THAT THEY HAD REPLACED!    WHEN I ASKED IF THEY HAD ANY PROBLEMS WITH THE SATURN VIE THE SALES PERSON SAID HE HADN'T HEARD OF ANYTHING.  THE GENERAL MANAGER MADE THE SAME STATEMENT.  USING THE INTERNET I DISCOVERED NUMEROUS LISTINGS ON THE NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION WEB SITE.  I PRINTED OUT THE INFORMATION AND PROVIDED IT TO THE GENERAL MANAGER - - HE PLEAD IGNORANCE.  WHILE MY VEHICLE WAS BEING REPAIRED I ASKED THE SHOP MANAGER IF THEY HAD EXPERIENCED ANY PROBLEMS AND HE TOLD ME THAT THEY HAD REPLACED SEVERAL TRANSMISSION AND THAT IT WAS WIDELY KNOW THAT THERE WAS A PROBLEM.  *NM",
        "vin": "5GZCZ43D63S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/13/2005",
        "dateOfIncident": "08/03/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136381,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THIS HAPPEN TWICE IN LESS THAN 15 MONTHS.  THE 2001 SATURN VUE'S HORN BECOMES JAM DUE TO PROBLEMS WITH THE AIRBAG.  ACCORDING TO THE MECHANICS AT THE SATURN DEALERSHIP THE AIRBAG PRESSES DOWN ON THE HORN AND JAMS IT CAUSING IT TO GO OFF NON STOP, THE ONLY WAY TO TURN IT OFF IS TO DISCONNECT THE FUSE.  THE SECOND TIME THIS HAPPENED TO ME ACCORDING TO THE DEALERSHIP IT FRIED THE HORN CONNECTION IN THE STEERING WHEEL, MY CONCERN ABOUT THIS SINCE ITS HAPPEN TO ME SO OFTEN IS COULD IT ACCIDENTALLY SET OFF THE AIRBAG?  ALSO CAN THIS BE A FIRE HAZARD DUE TO THE CABLES BEING BURNT WITHIN THE STEERING WHEEL?  I WOULD BE WILLING TO LET YOU GUYS INSPECT MY AUTOMOBILE.  IN ORDER TO REPAIR THIS THE WHOLE AIRBAG SYSTEM, AND HORN NEEDS TO BE REPAIR.*JB",
        "vin": "5GZCZ23D62S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "09/07/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135970,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE MORNING MY WIFE ATTEMPTED TO START THE CAR AND IT DID NOT START.  WHEN I GOT HOME FROM WORK I STARTED THE CAR, BUT THE IDLE WAS VERY ROUGH.  I DROVE THE CAR AROUND THE BLOCK (STANDARD TRANSMISSION) AND IT WAS VERY DIFFICULT GETTING THE CAR TO ACCELERATE IN FIRST GEAR.  AS I DROVE THE CAR TO THE DEALERSHIP, THE \"SERVICE ENGINE SOON\" LIGHT WAS FLASHING.  THE IDLE WAS ROUGH, THE ENGINE WAS UNDERPOWERED, AND WHEN I CAME TO A COMPLETE STOP, THE ENGINE WOULD STALL. THE PARTS REPLACED WERE #12587426: COIL ASM, #12580215: MODULE AS, #12569190: SPARK PLUG.  I DO NOT KNOW IF THE PARTS ARE AVAILABLE.  THE REPAIRS WERE DONE AT SATURN OF NATIONAL CITY IN SAN DIEGO COUNTY.  THIS VEHICLE IS A 2002 SATURN VUE.  IT HAS THE 2.2L (L4) ENGINE.  THE PARTS AND THE ENGINE ARE THE SAME ONES FOUND IN THE SATURN L-SERIES SEDAN, WHICH HAD A RECALL FOR THE IGNITION CONTROL MODULE.  I BELIEVE THAT RECALL IS 03-C-06.  I CALLED SATURN'S NATIONAL CUSTOMER SERVICE LINE AND THEY SAID THAT THE RECALL DOES NOT AFFECT MY VEHICLE, EVEN THOUGH IT HAS THE SAME ENGINE AND SAME PART NUMBERS THAT WERE SUBJECT TO RECALL FOR THE L-SERIES SEDAN.  *NM",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/08/2005",
        "dateOfIncident": "09/07/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135797,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT OWNS A 2002 SATURN VUE.  THE CONTACT STATES WHILE DRIVING  THE RPM GAUGE JUMPED FROM TWO TO SEVEN OR EIGHT.  THEN DROPPED BACK TO TWO.  THIS CAUSED THE VEHICLE TO GO INTO NEUTRAL. THE CONTACT  STATED  IT HAPPENED  SO FAST THAT THERE WAS NO TIME TO REACT.  THE VEHICLE HAS BEEN TO THE DEALERSHIP AT LEAST SIX TIMES.  THE CONSUMER DID NOT KNOW WHAT THE SERVICE DEALER HAS DONE, BUT THEY  STATED THAT  THEY COULD NOT DUPLICATE THE PROBLEM.  THE CONSUMER  CONTACTED THE MANUFACTURER, AND THEY DID EXTENDED THE WARRANTY ON THE VEHICLE FOR ANOTHER YEAR. *AK",
        "vin": "5GZCZ63B32S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2005",
        "dateOfIncident": "08/13/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SATURN HAS TROUBLE STARTING. WHEN IT DOES START AND RUN THE HEADLIGHTS FLASH ON AND OFF CONSTANTLY, MY WINDSHIELD WIPERS WON'T SHUT OFF, AND THE ODOMETER WENT FROM READING 36,000 MILES TO READING 76,000 MILES.    *NM",
        "vin": "5GZCZ63B22S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2005",
        "dateOfIncident": "07/04/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATES THE CLUTCH  BECAME DISABLED WHILE DRIVING APPROXIMATELY 75 MPH ON THE INTERSTATE.  VEHICLE WAS TOWED TO A SERVICE DEALER, AND  MECHANIC  DETERMINED THAT CLUTCH CABLE SNAPPED OR THERE WAS PROBLEM WITHIN THE HYDRAULICS.  THE VIN WAS NOT AVAILABLE BECAUSE THE VEHICLE WAS IN ANOTHER STATE.     *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/27/2005",
        "dateOfIncident": "05/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10122314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: STEERING SYSTEM IS FAILING.  STEERING LOCKS UP ON LEFT HAND TURNS, THEN STARTS  STRAIGHTENING BACK OUT IN THE MIDDLE OF A TURN AND WHILE GOING ON/OFF EXIT RAMPS.  AT LOW SPEEDS THE WHEEL COMPLETELY STOPS TURNING AND LOCKS UP.    *TT",
        "vin": "5GZCZ63B52S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "12/15/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110967,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED THE ELECTRIC POWER ASSIST  SYSTEM  FAILED, AND VEHICLE  WANDERED.  DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK  *TC",
        "vin": "5GZCZ23D32S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/21/2005",
        "dateOfIncident": "02/20/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111873,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GEAR LEVER CAME UNATTACHED FROM FLOOR ASSEMBLY WHILE DRIVING AT A SPEED OF 3-4MPH.   AT A HIGHER SPEED, I COULD HAVE LOST CONTROL OF THE VEHICLE.",
        "vin": "5GZCZ23D62S"
    },
    {
        "components": "AIR BAGS,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/19/2005",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107518,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIANCE AND I BOTH PURCHASED A 2002 SATURN VUE. DURING THE COURSE OF NORMAL DRIVING SHE USED HER HORN IN ALERTING OTHER DRIVERS AND THE HORN FAILED TO STOP SOUNDING. THE ONLY REMEDY WAS TO PULL OVER AND REMOVE THE FUSE TO STOP THE HORN FROM SOUNDING. THIS OCCURRED THREE TIMES DURING HER OWNERSHIP OF THE VEHICLE AND EACH TIME THE DEFECTIVE PART WAS REPLACED THE PROBLEM WOULD RETURN SHORTLY AFTER. AFTER MUCH INQUIRY WE FINALLY HAD A MANAGER ADMIT TO US THERE WAS A PRODUCT REDESIGN TO FIX THE PROBLEM WITH IT SHORTING OUT WHICH ALSO AFFECTED THE AIR BAG FUNCTIONALITY AS WELL. BOTH SAFETY ISSUES.    NOW DURING THE COURSE OF NORMAL DRIVING MY VEHICLE, ALSO A SATURN VUE OF THE SAME YEAR, HAS SUFFERED THE SAME FAILURE. ALTHOUGH THIS IS MY FIRST SUCH INCIDENT WITH THE PROBLEM, I SUSPECT THIS IS NOT AN ISOLATED CASE. I WAS TOLD THAT THE PART WOULD COST ROUGHLY $1000 TO REPLACE WHEN WE HAD TO REPLACE HERS THREE TIMES! I AM NOW FINDING MYSELF IN THE SAME SITUATION WHERE I HONKED THE HORN AND IT REFUSED TO TURN OFF UNTIL I PULLED THE FUSE. I ASSUME THEY WILL ALSO TRY TO CHARGE ME $1000 FOR IT'S REPAIR.   *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "01/05/2005",
        "dateOfIncident": "12/27/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105792,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS INVOLVED IN 2 ACCIDENTS WITH MY 2002 SATURN VUE. THE FIRST TIME I WAS DRIVING IN RAINY CONDITIONS WHEN ALL OF A SUDDEN I LOST CONTROL OF MY CAR. I FIRST VEERED TO THE LEFT AND TRIED TO GET CONTROL OF THE CAR, BUT WOUND UP DOING SEVERAL 360 DEGREE TURNS AND SPUN TO THE RIGHT AND OFF THE ROAD INTO A DITCH. THE SECOND AND MOST RECENT TIME, I WAS FOLLOWING TRAFFIC AND TAPPED ON MY BRAKES WHEN AGAIN I LOST CONTROL, WENT TO THE LEFT AND DID A 520 AND PRETTY MUCH MY CAR IS TOTALLED. *AK",
        "vin": "5GZCZ23D02S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/20/2004",
        "dateOfIncident": "11/11/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING COLD WEATHER AIR BAG WARNING LIGHT WILL ILLUMINATE.  DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2004",
        "dateOfIncident": "10/08/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN FAILED. DEALERSHIP SAID THAT  CONSUMER HIT THE HORN PAD TOO HARD AND DAMAGED THE WIRING. THE PROBLEM WAS NOT RESOLVED. *AK",
        "vin": "5GZCZ63B22S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/15/2004",
        "dateOfIncident": "09/17/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095074,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30 MPH VEHICLE LOST POWER AND STALLED. CONSUMER PULLED OVER, AND HAD THE VEHICLE TOWED. THE DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK  *TC",
        "vin": "5GZCZ63BX2S"
    },
    {
        "components": "ELECTRICAL SYSTEM,BACK OVER PREVENTION",
        "crash": false,
        "dateComplaintFiled": "10/28/2004",
        "dateOfIncident": "10/21/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097921,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BATTERY DIES CONSTANTLY SINCE EARLY AUGUST OF 2002 (PURCHASED CAR ON JUNE 2002).  UNABLE TO OPERATE CAR WHEN THE BATTERY DIES.  MUST BE JUMPED TO BE ABLE TO OPERATE.  IT HAS BEEN REPLACED TWICE AND THE RADIO ALSO HAS BEEN REPLACED ONCE.  THE BATTERY DIES IF THE CAR IS NOT USED FOR MORE THAN 3 DAYS. CONTACTED THE DEALERSHIP AND WAS TOLD IT WAS BECAUSE THE CAR WAS IDDLE FOR TOO LONG.  VISITED THE DEALERSHIPS 8 TIMES IN 6 MONTHS FOR THIS PROBLEM - DEALERSHIP ACTIONS DO NOT FIX PROBLEM.   I EXPERIENCED PROBLEMS WITH THE DASH AND THE LIGHTS COMING ON AND OFF.  I EXPERIENCED PROBLEMS WITH THE ALARM - NOT ENGAGING AND MALFUNCTIONING.  I ALSO EXPERIENCED PROBLEMS WITH THE WHEEL STEERING - NEEDING REPLACEMENT.*AK",
        "vin": "5GZCZ33D92S"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/22/2004",
        "dateOfIncident": "09/04/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093020,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY VEHICLE AND ALL OF A SUDDEN THE HORN BLEW CONSTANTLY. I PRESSED THE AREA WHERE THE HORN IS TO TRY TO SHUT IT OFF, TO NO AVAIL. I HAD TO PULL OVER TO THE SIDE OF THE HIGHWAY, OPEN THE HOOD, PULL OFF THE FUSE COVER, FIND THE FUSE AND PULL IT OUT, WHICH FINALLY STOPPED THE HORN FROM BLAIRING.  I BROUGHT IT TO THE DEALERSHIP, THEY SAID THE WHOLE AIR BAG MODULE HAD TO BE REPLACED AT A COST OF APPROX. $860.00. I CALLED SATURN HEADQUARTERS, AND TOLD THEM ABOUT THE SITUATION. AND THE COST. THEY CALLED THE DEALERSHIP AND SAID THEY WOULD SPLIT THE COST. I AM STILL NOT SATISFIED, I THINK IT SHOULD BE REPLACED AT NO COST TO ME. THIS IS A 2 YEAR OLD VEHICLE AND FOR THE HORN TO MALFUNCTION BECAUSE THE AIR BAG IS PRESSING ON IT, IS RIDICULOUS.  SAFETY WISE, THE HORN JUST STARTED BLOWING AND NOT TURNING OFF,  SCARED THE HELL OUT OF ME, TRYING TO FIND OUT WHAT WAS HAPPENING AND FINDING A SAFE PLACE TO PULL OVER, I COULD OF INJURED MYSELF AND OTHERS WHEN THIS HAPPENED.  WHEN I DO GET IT REPLACED, BECAUSE I STILL DO NOT HAVE A HORN, WHOSE TO SAY IT WON'T HAPPEN AGAIN WITH THE NEXT AIR BAG,(POOR DESIGN) !*AK",
        "vin": "5GZCZ63B32S"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/27/2004",
        "dateOfIncident": "08/27/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088716,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MY 2002 SATURN VUE (WITH A 4-CYLINDER ENGINE, 2 WHEEL DRIVE, AND MANUAL TRANSMISSION), THE AIR-CONDITIONER COMPRESSOR CLUTCH UNIT BROKE OFF FROM THE COMPRESSOR. AS I UNDERSTAND IT, THERE WAS A FAILURE IN THE ASSEMBLY ATTACHING THE COMPRESSOR CLUTCH TO THE COMPRESSOR. THE PHYSICAL BREAKAGE OF THE AIR-CONDITIONER COMPRESSOR CLUTCH RESULTED IN PIECES OF THE ASSEMBLY COMING INTO CONTACT WITH OTHER ENGINE PARTS THAT COULD HAVE RESULTED IN A FAILURE OF THE ENGINE.  HE FAILURE WOULD APPEAR TO INDICATE A DEFECT IN THE COMPRESSOR ASSEMBLY. AS A RESULT OF THE FAILURE, THE ENTIRE COMPRESSOR ASSEMBLY REQUIRED REPLACEMENT. THE SERVICE ADVISOR STATED THAT THE TECHNICIAN WHO PERFORMED THE REPAIR ON MY SATURN VUE DID NOT SEE ANY EVIDENCE OF THE FAILURE BEING CAUSED BY ROAD DEBRIS OR VEHICLE ABUSE. MY SATURN VUE HAD APPROXIMATELY 52,000 MILES ON THE ODOMETER AT THE TIME OF THE REPAIR ON AUGUST 27, 2004. THE VEHICLE HAS BEEN DRIVEN GENTLY DURING MY TWO YEARS OF OWNERSHIP AND HAS NEVER BEEN ABUSED (NO FAST STARTS, FULL-THROTTLE ACCELERATIONS, ETC.). FORTUNATELY, THE FAILURE DID NOT LEAD TO FURTHER DAMAGE TO THE VEHICLE, OR, WORSE, TO AN ACCIDENT SINCE THE BROKEN PARTS COULD HAVE HIT OTHER PARTS OF THE ENGINE CAUSING IT TO STOP.*AK",
        "vin": "5GZCZ23D72S"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "08/16/2004",
        "dateOfIncident": "05/02/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10087013,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WRECKED A SATURN VUE GOING 55 MILES AN HOUR WHEN THE CAR BEGAN TO SWAY THEN SLDING TO THE LEFT HITTING A DITCH GOING AIRBORN ROLLING OVER SEVERL TIMES HITTING THE MOUNTAIN WITH THE DRIVERS SIDE AND ENDED ON THE DRIVER SIDE. THE REAR TIRE BROKE OFF THE BENT UNDER THE CAR.*AK",
        "vin": "5GZCZ63B72S"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "08/16/2004",
        "dateOfIncident": "02/01/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10089154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH THE 2002 SATURN VUE SUSPENSION.*MR  WHILE DRIVING THE CONSUMER WAS HIT BY A VEHICLE WHICH WAS GOING ABOUT 30 MPH THROUGH A RED LIGHT.  INITIALLY THE CONSUMER HAD CONTROL OF THE VEHICLE THEN IT SUDDENLY PULLED THEN THE CONSUMER LOST CONTROL.  AS A RESULT THE VEHICLE FLIPPED TWICE.  ALTHOUGH THE VEHICLE WAS TOTALED, THE CONSUMER WAS NOT BADLY INJURED.  THE CONSUMER WONDERS IF THE REAR SUSPENSION WAS THE CAUSE OF THE PROBLEM.  *NM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "08/09/2004",
        "dateOfIncident": "08/05/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087543,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25 MPH CONSUMER HEARD A LOUD NOISE FROM THE FRONT OF THE VEHICLE.  WHILE TURNING RIGHT VEHICLE SWERVED TO THE LEFT.  CONSUMER  LOST CONTROL OF THE VEHICLE AND CRASHED INTO A TELEPHONE POLE.  VEHICLE WAS TOWED TO A DEALER FOR INSPECTION.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/08/2004",
        "dateOfIncident": "08/08/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086387,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DIRT SUPPOSEDLY GOT IN MY STEERING WHEEL CASE AND HAS DAMAGED A COIL, NOW MY HORN BARELY WORKS AND MY AIR BAG IS AT RISK. SATURN WILL NOT REPAIR WITHOUT A COST OF $378.00 AND THE CAR IS 2YRS OLD ONLY THIS MONTH. I DRIVE THE CAR BACK AND FORTH TO WORK WITH THE AIR ON..AND DUST IN THE CASE PUTS MY LIFE IN DANGER WITHOUT THE POSSIBIITY OF AN AIRBAG. *AK",
        "vin": "5GZCZ63B92S"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/04/2004",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "E-MAIL REGARDING ROLL OVER TIRE PRESSURE.   *MR   *SC  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2004",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087127,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER HAD THE AIR BAG MODULE REPLACED FOUR TIMES.  DEALER SIMPLY CONTINUED TO REPLACE THE DEFECTIVE  AIR BAG MODULE,  BUT  DID NOT  SOLVE THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/14/2004",
        "dateOfIncident": "04/14/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066136,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY 2002 SATURN VUE FOR A LITTLE OVER A YEAR AND A HALF.  THE PROBLEMS ACTUALLY STARTED AFTER ABOUT THREE MONTHS OF MY PURCHASE DATE.  I HAVE CONTINUOUSLY HAD PROBLEMS WITH THE ENGINE LIGHT COMING, NEVER FOR THE SAME PROBLEM TWICE.  THE ENTIRE COMPUTER HAD TO BE REPLACED ABOUT SIX MONTHS AGO, BUT IS CAUSING ME PROBLEMS AGAIN.  I JUST PICKED IT UP LAST NIGHT AFTER THE PROBLEM WAS SUPPOSEDLY FIXED; THE LIGHT CAME BACK ON AGAIN THIS MORNING.  THIS IS THE SEVENTH TIME I HAVE HAD PROBLEMS DEALING WITH THE ENGINE LIGHT.  I ALSO HAVE HAD NUMEROUS PROBLEMS WITH THE FRONT-END SUSPENSION SYSTEM.  THE TORSION BAR LINKS HAVE BEEN REPLACED TWICE, THE TORSION BAR BUSHINGS TWICE.  THE LATEST INCIDENT HAPPENED A WEEK AGO AFTER THE SUSPENSION WAS SUPPOSEDLY FIXED.  THE DEALERSHIP HAD PUT THE WRONG SIZE OF BUSHING ON THE TORSION BAR; IT CAME FLYING OFF WHILE TURNING INTO A PARKING LOT.  THIS COULD HAVE POSED A PROBLEM IF THE PART WERE TO HIT ANYONE.  MY WARRANTY IS ALMOST UP AND I AM AFRAID THAT I WILL BE STUCK PAYING FOR ALL OF THESE MANUFACTURING DEFECTS.  I HAVE DONE RESEARCH AND KNOW FOR A FACT THAT MANY OTHER PEOPLE HAVE HAD THESE SAME PROBLEMS.  I HAVE NOTIFIED SATURN CORP., BUT REALLY DID NOT GET ANYWHERE.  THEY SENT ME A CHECK FOR ONE MONTHLY PAYMENT, HARDLY COMPENSATION FOR HAVING TO DRIVE TO THE DEALERSHIP TWELVE TIMES WITHIN ONE YEAR.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2004",
        "dateOfIncident": "01/13/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054674,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A NEW SATURN VUE IN 3/02.  IT RAN GREAT UNTIL 1/7/03 AT WHICH TIME THE CAR LOST POWER AND WOULDN'T START.  I CALLED SATURN, AND THEY HAD SOMEONE PICKUP THE CAR AND TOW IT TO A DEALERSHIP IN SAGINAW.  WHEN I PICKED IT UP, I WAS TOLD THE CAR HAD TOO MUCH GAS GOT IN THE CYLINDER.  I'VE BEEN DRIVING CARS FOR 20 YRS &NEVER HAD A PROBLEM LIKE THAT, SO I THOUGHT IT MIGHT HAVE JUST BEEN A QUIRKY THING...UNTIL IT HAPPENED AGAIN 2  WKS LATER (1/23/03).  I CALLED THE SATURN, AND THEY PICKED IT UP.  I WAS NOW CONCERNED ABOUT THE CAR BREAKING DOWN WHEN MY WIFE WAS DRIVING IT WITH MY 3 SONS.  I PICKED UP THE CAR FROM THE DEALERSHIP, AND THEY TOLD ME THE SAME THING HAPPENED AS THE 1ST TIME.  I VOICED MY FRUSTRATION TO THE SVC MGR WHO GAVE ME HIS BUS CARD AND TOLD ME TO HAVE MY WIFE CALL HIM IF SHE EVER BROKE DOWN...I DON'T THINK HE WORKS 24X7.  THE SAME THING JUST HAPPENED AGAIN ON 1/13/04.  I ASKED DEALERSHIP HAPPENED THIS TIME - THEY SAID IT WAS THE SAME THING.  I PRESSED THIS PERSON FOR MORE INFO AND HE ASKED ME HOW FAR I HAD DRIVEN THE CAR BEFORE IT BROKE DOWN.  I TOLD HIM JUST A SHORT DISTANCE.  HE SAID THERE'S A QUIRKY THING WITH SATURNS - IN COLD WEATHER YOU HAVE TO LET THEM RUN FOR 2 OR 3 MINUTES EVEN IF YOU'RE TAKING THE CAR FOR A SHORT DRIVE OR THE CAR WILL GET TOO MUCH GAS IN THE ENGINE AND BREAK DOWN.  THE SVC PERSON I WORKED WITH, GOT THE SVC MGR (TERRY MCKEE) WHO ECHOED THE SAME THING. KEEP IN MIND, I HAVE A WIFE AND 3 LITTLE BOYS.  IF MY WIFE USES OUR CAR, I CAN'T EXPECT HER TO HAVE TO FOLLOW THIS PROCEDURE FOR FEAR OF BEING STRANDED!  I GOT THE CUSTOMER CARE # AT SATURN FILED A COMPLAINT (REFERENCE #110098470).  BRIAN FROM SATURN SAID THEY WON'T DO ANYTHING TO HELP ME OUT.  HIS ONLY SOLUTION WAS FOR ME TO LET THE CAR RUN FOR 2-3 MINUTES BEFORE I DRIVE IT.  I WOULDN'T HAVE BOUGHT THE CAR IF I WOULD HAVE KNOWN ABOUT THIS!  I DON'T WANT THE CAR ANYMORE, BUT I CAN'T SELL IT TO SOMEONE IN GOOD CONSCIENCE.  CAN YOU PLEASE HELP????",
        "vin": "5GZCZ23D42S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2004",
        "dateOfIncident": "08/10/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054341,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRICAL/IGNITION .  *CB",
        "vin": "5GZCZ63B22S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070255,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS HAD THIS TROUBLE SINCE ITS PUCHASE. AFTER THE FIRST BREAK DOWN, SATURN RETURNED IT TO US STATING THAT IT WAS A LOOSE BATTERY TERMINAL. THE SECOND TIME SATURN STATED THAT THEY REPLACED TWO OF THE THREE ON BOARD COMPUTERS, THEY ALSO STATED THAT A FULL DIAGNOSTIC AND REPAIR RECORD WOULD BE FOWARDED TO US. THAT NEVER CAME. YESTEDAY 7/6/03 THE ENGINE SHUT OFF IN TRAFFIC. I COULD NOT GET IT STARTED AND HAD TO HAVE IT TOWED. I WILL NOT PUT MY FAMILY BACK IN THIS CAR AGAIN,  I DON'T TRUST SATURN, THE COMPANY OR THE VEHICLE WITH MY FAMILIES LIVES.",
        "vin": "5GZCZ23DX2S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/14/2004",
        "dateOfIncident": "01/02/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053148,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 SATURN VUE AND BEFORE I HAD IT 1 MONTH A SQEAL WAS HEARD. THE DEALER REPLACED BOTH FUEL PUMPS. A FEW MONTHS AGO THE SERVICE ENGINE LIGHT CAME ON AND IT WAS A FULE EVAP ISSUE. IT CAME ON AGAIN 2 WEEKS AGO AND THIS TIME THE FUEL EVAP CANISTER WAS REPLACED. I AM CONCERNED WITH SAFETY OF THIS VEHICLE BECAUSE OF THE FUEL ISSUES. ALSO IN MID DECEMBER THE CLUTCH RETURN SPRING SNAPPED IN HALF. THE AIR CONDITIONING LINES LEAKED INTO THE VEHICLE. I BELIEVE THIS CAR IS A LEMON!*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": "08/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED, THE VEHICLE STALLED WITHOUT WARNING. THIS PROBLEM OCCURRED THREE TIMES.  DEALER NOTIFIED.    *AK  THE CONSUMER NOTICED THE RADIO/DASH LIGHTS WERE DIM PRIOR TO THE STALLING.  THE BLOCK ASSEMBLY  AND WIRING HARNESS JUNCTION WAS REPLACED.  THE GROUND CONNECTOR IN THE LEFT FRONT BUMPER AREA WAS LOOSE AND WAS TIGHTENED/RE-ASSEMBLE.   *SC   *JB",
        "vin": "5GZCZ23042S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038073,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAME EQUIPPED WITH AN ELECTRONIC STEERING MECHANISM. THE STEERING MECHANISM FAILED WHICH RESULTED IN POOR STEERING AND LOSS CONTROL.  *AK",
        "vin": "5GZCZ63B22S"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/13/2003",
        "dateOfIncident": "01/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025979,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SATURN VUE 2002.SUNVISOR DOES NOT SWING ALL THE WAY TO THE WINDSHIELD BECAUSE OF DEFECTIVE ORIGINAL PART. (THE DESIGN IS DEFECTIVE. THE PART WAS MANUFACTURED AS REQUESTED)  HAVE CONTACTED SATURN IN THIS REGARD AND THEY INSIST I MUST PURCHASE A NEW, NOW REDESIGNED PART. INCE THERE IS A DANGER OF NOT SEEING THE ROAD AS I DRIVE, I INSIST THAT SATURN MUST REPLACE THESE PARTS ON ALL 2002 SATURN VUE.*AK",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/13/2003",
        "dateOfIncident": "01/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISION DOWN SHIFT VERY HARD IN STOP AND GO DRIVING CONDITION. I HAVE TAKEN THE CAR MANY TIMES TO SATURN. HOWEVER, THEY INSIST THAT THIS AUTOMATIC TRANSMISION IS DESIGNED PROPERLY.  MY CAR DOWNSHIFT SO HARD I DO NOT LET MY WIFE DRIVE.*AK  HAS ANYBODY ELSE COMPLAINT ABOUT IT?",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/24/2003",
        "dateOfIncident": "07/05/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023669,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RUBBING SOUND IN STEERING COLUMN.  DEALER SAYS SATURN KNOWS OF THE PROBLEM AND IS LOOKING FOR A FIX.  HAVE BROUGHT IT IN 3 TIMES AND NOTHING HAS WORKED.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/24/2003",
        "dateOfIncident": "05/22/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019217,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING TO A STOP THE VEHICLE CHUGGS (SURGES) AND ACTS LIKE IT IS GOING TO STALL.  THIS PROBLEM HAS BEEN LOOKED AT BY THE DEALER AND THEY BASICALLY SAY \"ALL SYSTEMS OPERATING AS INTENDED\".    THIS SITUATION IS VERY SIMILAR TO COMPLAINT NUMBER 567762.  *NLM",
        "vin": "5GZCZ63B02S"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/17/2003",
        "dateOfIncident": "05/17/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018861,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN ON THE STEERING WHEEL IS SO DIFFICULT TO OPERATE THAT IT IS COMPLETELY USELESS.  WHILE DRIVING, A PERSON CANNOT FEEL WITH HIS/HER FINGERS THE DIFFERENCE IN TEXTURE ON THE WHEEL FROM WHERE THE HORN IS LOCATED AND WHERE IT IS NOT.  ONCE IT IS FOUND, THE PLASTIC IS SO DIFFICULT TO DEPRESS THAT AN INDIVIDUAL MUST APPLY AN EXTREME AMOUNT OF PRESSURE WITH THEIR ENTIRE FIST FOR THE HORN TO GO OFF, AND FINALLY, THE AREA TO ACTIVATE THE HORN IS SO SMALL IT IS ALMOST IMPOSSIBLE TO FIND, I ESTIMATE IT IS SLIGHTLY SMALLER THAN THE NAIL ON MY THUMB...AND I HAVE VERY AVERAGE SIZE HANDS FOR A MAN.  THIS IS AN EXTREMELY DANGEROUS HORN ASSEMBLY, AS A RESULT, IT IS USELESS IN REAL LIFE DRIVING SITUATIONS.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "05/12/2003",
        "dateOfIncident": "04/28/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10018584,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRYING TO STOP BY APPLYING THE BRAKES WHEN APPROACHING AN INTERSECTION, THE ACCELERATOR WOULD NOT DISENGAGE AND CAUSED THE VEHICLE TO BE UNSTOPPABLE IN THAT SHORT DISTANCE. THE TRANSMISSION ON THIS VEHICLE HAS HAD SEVERAL PROBLEMS OF THIS TYPE AND HAS BEEN REPORTED ON THE INTERNET AND BY OTHER OWNERS. THE RESULT WAS A COLLISION THAT TOTALED THE SATURN AND ANOTHER DRIVER'S VOLVO.  *NLM",
        "vin": "5GZCZ63B42S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2003",
        "dateOfIncident": "12/27/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017858,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER INSISTED THE 2002 SATURN VUE WAS A POTENTIAL DEATH TRAP FOR ANYONE WITH SIGNIFICANT DRIVING REQUIREMENTS. ACCORDING TO VUE OWNER'S MANUAL ALL-WHEEL DRIVE (AWD) SYSTEM HAS THE FOLLOWING FATAL FLAW. IF VEHICLE IS EXPOSED TO EXTENDED HEAVY USAGE, THE AWD SYSTEM WILL SHUT OFF TO PROTECT THE SYSTEM FROM OVER HEATING. WHEN THE SYSTEM COOLS, THE AWD SYSTEM WILL ACTIVATE ITSELF AGAIN AUTOMATICALLY. COOL DOWN PERIOD CAN TAKE UP TO 20 MINUTES DEPENDING ON OUTSIDE TEMPERATURE AND VEHICLE USE. CONSUMER PRESENTED THE FOLLOWING ARGUMENTS TO SATURN, AND THEY REFUSED TO DO ANYTHING ABOUT THEM.  *AK    *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "12/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017932,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE STEEL PROD. CO.",
                "productMake": "FIRESTONE",
                "productModel": "FIRESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING IN THE SNOW THE VEHICLES TIRES STARTED TO SPIN AND SLIP.  *NLM",
        "vin": "FILL IN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/09/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE PEDAL WAS DIFFICULT TO REACH. *TS  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/17/2003",
        "dateOfIncident": "03/14/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MARCH 14, 2003, MY FAMILY AND I WERE TRAVELING W ON HWY 138 IN STOCKBRIDGE, GA.  WE HAD A GREEN LIGHT AND WERE PROCEEDING THROUGH WHEN A FORD EXPLORER PULLED IN FRONT OF US.  WE HIT HIM IN THE PASSENGER SIDE, SQUARELY ACROSS THE FRONT OF OUR VEHICLE.  WE WERE TRAVELING APPROXIMATELY 45 MPH WHEN WE HIT AND THE TWO FRONT AIRBAGS DID NOT DEPLOY.  THE DAMAGE TO OUR VEHICLE IS EQUAL ACROSS THE FRONT AND THE FRONT END OF THE VEHICLE IS CRUSHED ALL THE WAY TO THE FRONT TIRES.  OUR VEHICLE WAS A 2002 SATURN VUE.  NO ONE WAS INJURED SERIOUSLY, BUT WE WERE TOLD WHEN WE BOUGHT THE CAR THAT THE AIRBAGS DEPLOY IN FRONT END COLLISIONS.    *NLM",
        "vin": "5GZCZ23D62S"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/27/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009501,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE VIBRATED SEVERELY.*JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DESIGN FLAW IN ALL WHEEL FORWARD DRIVE.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005951,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION DESIGN PROBLEMS.  *AK",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/31/2003",
        "dateOfIncident": "01/30/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006085,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S SEAT BELT HAVE BROKEN THEY WONT LOCK OR RETRACT. DEALER NOTIFIED. PLEASE PROVIDE ADDITIONAL INFORMATION.     TS",
        "vin": "PLEASE FILL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/30/2003",
        "dateOfIncident": "01/30/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004977,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN EXTREME COLD WEATHER, THE AIR BAG TROUBLE LIGHT STAYS ILLUMINATED AFTER VEHICLE IS STARTED.",
        "vin": "5GZCZ63B72S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2003",
        "dateOfIncident": "01/18/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004452,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COULD CHANGE GEARS WITHOUT FOOT ON BRAKES. DEALER NOTIFIED. TS.   *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/20/2003",
        "dateOfIncident": "01/20/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003044,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY 2002 SATURN VUE IS VERY COLD 20 DEGREES OR COLDER INSIDE CAR THE HORN IS VERY HARD TO PUSH THE PLASTIC WILL NOT FLEX MANY WOMEN WUOLD NOT BE ABLE TO USE THE HORM.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2003",
        "dateOfIncident": "01/14/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SHIFTED FROM REVERSE TO FIRST GEAR, THE SHIFTER HAD BROKEN.  TS  THERE HAD BEEN A CHATTER IN THE SHIFTER WHEN THE CLUTCH WAS RELEASED, ALSO WHEN THE GAS WAS APPLIED, SOMETIMES CAUSING A SURGE IN THE FIRST GEAR.  THE DEALER STATED THE SHIFT CABLE AND ADJUSTER HAD BROKEN.  SCC",
        "vin": "5GZCZ23D62S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/13/2003",
        "dateOfIncident": "12/17/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003679,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE  EXPERIENCED SEVERE VIBRATION, ESPECIALLY WHEN BRAKING.*JB.  *AK",
        "vin": "5GZCZ23D02S"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2003",
        "dateOfIncident": "12/25/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000798,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JULY I BOUGHT A 2002 SATURN VUE.  OVER CHRISTMAS HOLIDAYS I NOTICED IT WAS LEAKING TRANSIMISSION FLUID FROM A CONNECTION IN FRONT OF THE VEHICLE.  I WAS AMAZED TO FIND THESE LINES TOTALLY UNPROTECTED AND VULNERABLE TO ROAD HAZARD DAMAGE.  DUE TO THEIR PROXIMITY TO THE EXHAUST I'M CONCERNED WITH A RUPTURE AND FIRE.  I HAVE PICTURES AVAILABLE TO SHOW THE LOCATION OF THESE LINES BUT AM UNABLE TO ATTACH THEM TO THIS TYPE OF FILE.  THIS IS AN ACCIDENT WAITING TO HAPPEN!",
        "vin": "5GZCZ63B02S"
    },
    {
        "components": "STEERING,POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/06/2003",
        "dateOfIncident": "05/12/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000748,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALSO FOUND A METAL CLANKING SOUND COMING FROM THE FRONT DRIVER''S SIDE OF THE VEHICLE WHEN SHIFTING THE CAR OUT OF PARK, OR REVERSE. IT STILL CONTINUES TO HAVE PROBLEMS BETWEEN THE SPEEDS OF 12 TO 30 MPH, AGAIN THE PROBLEM PRESENTS ITSELF MOSTLY WHEN THE VEHICLE IS COASTING AND LOSING MOMENTUM. THE VEHICLE WOULD BE SLOWING DOWN WITHOUT ANY AID OF BRAKING OF ANY KIND AND AS THE VEHICLE WOULD ATTEMPT TO DOWN SHIFT, IT WOULD SOMETIMES MAKE A CLANKING NOISE, OR BUCK, OR IN THE MOST EXTREME CASES COMPLETELY STALL OUT.  ALSO THE WIPER SPRAYERS HAVE BROKEN TWICE, AND THE DEALER EXPECTS THEM TO BREAK AGAIN.",
        "vin": "5GZCZ63B02S"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "12/09/2002",
        "dateOfIncident": "11/22/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD MY 2002 SATURN VUE PARKED IN A NEIGHBOR'S DRIVEWAY.  TWENTY TO THIRTY MINUTES LATER,  MY CAR POPPED OUT OF GEAR, BACKED UP, TURNED, AND ROLLED OFF AN EMBANKMENT, LANDING IN BETWEEN TREES AND ONTO SHOULDERS. WHEN I CALLED THE WEEK BEFORE THE ACCCIDENT, I EXPLAINED TO THE SERVICE DEPARTMENT I HAD BEEN EXPERIENCING PROBLEMS GETTING MY CAR INTO GEAR. I ASKED THEM TO CHECK THAT OUT AND I ALSO SCHEDULED AN OIL CHANGE AT THAT  TIME.  WHILE SERVICING THE VEHICHLE, THEY TOLD ME THAT  THE GEAR PROBLEMS HAD BEEN A FLUKE OF THE VUE.  PRIOR TO THAT, I HAD NO GEAR PROBLEMS OTHER THAN A NOISE WHEN I SHIFTED  THAT I REPORTED TO THE DEALER IN SEPTEMBER. THE DEALER  TOLD ME THAT THE FRONT AXLE NUTS WERE NOT TORQUED PROPERLY. THEY WERE RETORQUED  PER BULLETIN 02T52. THE HOUSE THAT MY CAR HAD BEEN PARKED AT HAS A SENSOR IN THE DRIVEWAY, SO I KNOW THE CAR TOOK AT LEAST 20-30 MINUTES BEFORE IT POPPED OUT OF GEAR. I REPORTED THE PORBLEM ON THE MORNING AFTER MY ACCIDENT AND WAS TOLD BY THE DEALER TO CALL THE CUSTOMER SERVICE CENTER TO REPORT THE PROBLEM, I HAVE RECOMMENDED THAT SOMEONE FROM THE SATURN CORPORATION COME TO LOOK AT MY VEHICLE, AND THE SCENE OF THE ACCIDENT. I BELIEVE THAT THERE IS A PROBLEM WITH  MY TRANSMISSION/ AND PERHAPS THE TRANSMISSIONS OF OTHER SATURN VUE'S.  DT",
        "vin": "5GZCZ23DX2S"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/30/2002",
        "dateOfIncident": "08/30/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021950,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT THE SUN ROOF DEFLECTOR FLEW OFF FROM THE TOP OF THE VEHICLE. CONSUMER STATES THAT THIS COULD OF CAUSED AN ACCIDENT, IF THE SUN ROOF DEFLECTOR HAD FALLEN, WHILE VEHICLE WAS BEING DRIVEN IN HIGHWAY TRAFFIC.  PLEASE PROVIDE MORE DETAILS.        TS",
        "vin": "5GZCZ23D42S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/10/2002",
        "dateOfIncident": "09/12/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020594,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING AND NO WARNING THE VEHICLE LOST POWER AND THE CONSUMER WAS ONLY ABLE TO DRIVE 25 MPH.   DEALER NOTIFIED.     MR",
        "vin": "1G8JW54R82Y"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567762,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN COMING TO STOPS, THE VEHICLE WOULD SURGE AS IF BEING HIT FROM BEHIND.  AFTER THE INITIAL SURGE THE VEHICLE ACTS LIKE IT IS GOING TO STALL, STOP OR CUT OFF.  THE PROBLEM HAS BEEN LOOKED AT ON SEVERAL OCCASIONS.  CONSUMER DOESN'T FEEL THIS VEHICLE IS SAFE TO OPERATE, CONSUMER BELIVES THIS IS TRANSMISSION RELEATED ,HOWEVER THE DEALER IS STATING IT IS A COMPUTER CHIP THAT IS CAUSING THE PROBLEM.*JG",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ROOF RACK IS ATTACHED VIA A CUSTOMER/DEALER INSTALLED STUD THAT REPLACES THE FACTORY INSTALLED MOUNTING SCREW. THE STUD IS RUSTING AND DOES NOT REMAIN TIGHT AFTER RACK AND CARGO BOX USAGE. EITHER THE RUST OR THE LACK OF TIGHTNESS WILL EVENTUALLY LEAD TO CARGO BOX AND RACK BEING TORN FROM ROOF DURING TRAVEL. THERE IS THE POSSIBLILITY FOR A SERIOUS ACCIDENT.*AK",
        "vin": "5GZCZ63B82S"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767538,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ROOF RACK IS ATTACHED VIA A CUSTOMER/DEALER INSTALLED STUD THAT REPLACES THE FACTORY INSTALLED MOUNTING SCREW. THE STUD IS RUSTING AND DOES NOT REMAIN TIGHT AFTER RACK AND CARGO BOX USAGE. EITHER THE RUST OR THE LACK OF TIGHTNESS WILL EVENTUALLY LEAD TO CARGO BOX AND RACK BEING TORN FROM ROOF DURING TRAVEL. THERE IS THE POSSIBLILITY FOR A SERIOUS ACCIDENT.*AK",
        "vin": "5GZCZ63B82S"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/16/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767232,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS ACCESSORY IS POORLY ENGINEERED. THE LONG TERM USE OF THIS ROOF RACK COULD RESULT IN A SAFETY HAZARD. DESPITE THE USE OF THREADLOCK THE ROOF PINS LOOSEN DUE TO VIBARATION AND OTHER FACTORS. WATER COLLECTS IN THE ROOF PIN WELLS ADDING TO THE POSSIBILITY THAT OVER TIME THE ROOF PINS WILL RUST AND FAIL. A PROACTIVE RECALL AND IMPROVEMENTS TO THE DESIGN ARE NECESSARY TO PREVENT FUTURE ACCIDENTS.*AK",
        "vin": "5GZCZ63B92S"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/28/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766368,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ON AN INCLINE AND IN PARK, THE ENGINE SURGES AND SOUNDS AS IF IT IS GOING TO FALL OUT.*AK",
        "vin": "5GZCZ33D72S"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/25/2002",
        "dateOfIncident": "05/10/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763427,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING DRIVING A THUMP IS COMING FROM STEERING COLUMN WHEN ROAD BUMP OCCURS AND IS SOMETIMES STARTLING. TOOK VEHICLE IN FOR SERVICE, SERVICE REP. REPLACED A SPRING PART AS PER SERVICE BULLETIN, HOWEVER, THIS ACTION DID NOT REPAIR STEERING COLUMN PROBLEM. THE THUMPING IS FELT IN STEERING WHEEL AND FEELS LIKE SOMETHING IS LOOSE IN STEERING COLUMN. SERVICE REP. INFORMED ME IT IS NOT A SAFETY PROBLEM.*AK",
        "vin": "5GZCZ63B12S"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/18/2002",
        "dateOfIncident": "02/12/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009392,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRE PLIES WERE SEPARATED ON BOTH FRONT TIRES AS MANUFACTURED CAUSING OUT OF ROUND CONDITION AND VEHICLE VIBRATION WHILE DRIVING AT MODERATE SPEED (45-50).         *TS   *NLM  **DIMSII IVOQ ENTRY POSTED AFTER 12-12-02 CUT OVER TO ARTEMIS*763208",
        "vin": "1G8ZH52832Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2002",
        "dateOfIncident": "05/02/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS WHILE DRIVING, THE REDUCED POWER LIGHT CAME ON AND VEHICLE WOULD AUTOMATICALLY SHUT DOWN, AFTER SEVERAL ATTEMPTS VEHICLE MAY RESTART, DEALER STATED THAT A SENSOR WAS NOT LETTING THE PEDAL KNOW THAT THERE WAS GASOLINE, DEALER REPLACED THIS PART, HOWEVER THIS DID NOT REMEDY PROBLEM.   *TT",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2002",
        "dateOfIncident": "05/02/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS WHILE DRIVING, THE REDUCED POWER LIGHT CAME ON AND VEHICLE WOULD AUTOMATICALLY SHUT DOWN, AFTER SEVERAL ATTEMPTS VEHICLE MAY RESTART, DEALER STATED THAT A SENSOR WAS NOT LETTING THE PEDAL KNOW THAT THERE WAS GASOLINE, DEALER REPLACED THIS PART, HOWEVER THIS DID NOT REMEDY PROBLEM.   *TT*YD",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/14/2002",
        "dateOfIncident": "05/02/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "VUE",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEVERAL OCCASIONS WHILE DRIVING, THE REDUCED POWER LIGHT COMES ON AND VEHICLE AUTOMATICALLY SHUTS DOWN, AFTER SEVERAL ATTEMPTS VEHICLE MAY RESTART, DEALER STATED THAT A SENSOR WAS NOT LETTING THE PEDAL KNOW THAT THERE WAS GASOLINE, DEALER REPLACED THIS PART, HOWEVER THIS DID NOT REMEDY PROBLEM.   *TT*YH",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/19/2001",
        "dateOfIncident": "11/12/2001",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754671,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "SATURN",
                "productModel": "SATURN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HEADING UP A HILL WITH 3 CARS AHEAD OF ME, 3 BEHIND... WHEN I GOT TO THE TOP OF THE HILL, THE 3 CARS AHEAD CAME TO A FULL STOP, WHEN I PRESSED ON THE BRAKE, NOTHING HAPPENED. I SLAMMED ON THE BRAKE, AND IT FELL TO THE FLOOR. THE CAR DIDNT SLOW DOWN, AND I HEARD THE SOUND OF SANDPAPER SCRATCHING WOOD. I'VE HAD CARS WITH ABS BEFORE, SO I'M FAMILIAR ENOUGH WITH THEM TO KNOW THAT THIS WAS NOT NORMAL. THE CAR HIT THE BACK OF AN SUV AND THATS THE ONLY THING THAT STOPPED THE CAR. THE ROAD WAS DRY, WARM, NO SAND OR ROCKS, IT WAS A PAVED ROADWAY. I HAD 3 TO 4 CAR LENGTHS IN FRONT OF ME WHEN I BEGAN BRAKING. THE CAR SHOULD HAVE STOPPED! THERE WERE NO SKID MARKS. IT DIDNT EVEN ATTEMPT TO STOP. I CONTACTED SATURN AND THEY BLEW ME OFF WITH THIS \"IT WILL BE 7 TO 10 BUSINESS DAYS BEFORE WE DECIDE WHETHER OR NOT WE'LL INVESTIGATE; AND WE MAY OR MAY NOT CALL YOU\". I HAD THE CAR TOWED, EVEN THOUGH IT APPEARED DRIVABLE. I DIDNT WANT THE RISK OF ANOTHER ACCIDENT. THE CAR IS CURRENTLY AT SATURN OF WEST COUNTY IN ST LOUIS, 63021, AND WILL BE INSPECTED BY ONE OF ALLSTATE'S INDEPENDENT ENGINEERS TODAY OR TOMORROW.  *AK",
        "vin": "1G8JW54R52Y"
    }
]