[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/03/2018",
        "dateOfIncident": "06/12/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11133192,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR CONDITIONER BEGINS TO BLOW HOT MOIST AIR AFTER SEVERAL MINUTES OF WORKING PROPERLY. MULTIPLE MECHANICS INCLUDING A SPECIALTY SHOP CAN'T DIAGNOSE, AND THE ONLY OPTION IS TO REPLACE THE ENTIRE A/C COMPRESSOR BECAUSE THE CLUTCH ISN'T SOLD SEPARATELY. I'VE READ MANY ACCOUNTS OF THE SAME \"INTERMITTENT\" A/C THAT ONLY WORKS ONCE THE ENGINE IS TURNED OFF AND BACK ON, THEN STOPS WORKING SECONDS OR MINUTES LATER FOR NO APPARENT REASON. THE VEHICLE CAN BE STATIONARY OR IN MOTION AND THE A/C JUST QUITS.",
        "vin": "4S3BH806727"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/09/2018",
        "dateOfIncident": "04/02/2018",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11084008,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE ORIGINAL OWNER OF THIS VEHICLE AND I HAVE HAD FOUR SEPARATE INCIDENTS THAT MY HEAD GASKET HAS HAD TO BE REPLACED.  THIS IS A COSTLY REPAIR AND GIVEN MY CAR HAS 190,000 MILES ON IT I BELIEVE FOUR ISSUES DEALING WITH THIS SAME SITUATION NEEDS TO BE PROPERLY ADDRESSED.  NOT ONLY DOES THIS ISSUE RESULT IN A HUGE OUTLAY OF MONEY BUT IT GETS OIL ALL OVER THE ENGINE, PARTS, AND DRIVEWAY THAT NEEDS TO BE CLEANED.  I WOULD APPRECIATE ANY ASSISTANCE IN THIS MATTER.",
        "vin": "4S3BH686327"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/04/2017",
        "dateOfIncident": "12/04/2017",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11052416,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TEMPERATURE OUTSIDE GETS BELOW 35 DEGREES, MY CAR SMELLS VERY STRONGLY OF GAS INSIDE. I HAVE TO ROLL THE WINDOWS DOWN FOR VENTILATION. WHEN THE TEMPERATURE WARMS UP, THE SMELL GOES AWAY. IT IS WORSE WHEN I FIRST STARTED MY CAR IN THE MORNING. MECHANICS HAVEN'T BEEN ABLE TO FIGURE OUT THE PROBLEM BUT I JUST READ MANY COMPLAINTS ONLINE ABOUT THIS ISSUE. I WILL TAKE THEIR SUGGESTED FIXES TO MY MECHANIC.",
        "vin": "4S3BH665927"
    },
    {
        "components": "SUSPENSION,POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/26/2016",
        "dateOfIncident": "07/07/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10888639,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK. WHILE THE VEHICLE WAS BEING SERVICED, THE INDEPENDENT MECHANIC OBSERVED THAT THE ENTIRE FRAME WAS SEVERELY CORRODED AND HOLES WERE FORMING. THE VEHICLE NEEDED A NEW CROSS MEMBER. THE VEHICLE WAS NOT REPAIRED. ALSO, WHEN THE VEHICLE WAS SHIFTED INTO THE PARK POSITION WHILE ON AN INCLINE, IT BEGAN TO ROLL AWAY WITHOUT WARNING. THE FAILURE RECURRED TWO TIMES. THE VEHICLE WAS NOT TAKEN TO A DEALER OR DIAGNOSED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBERS: 03V153000 (SUSPENSION) AND 02V282000 (POWER TRAIN). THE FAILURE MILEAGE WAS APPROXIMATELY 170,000.",
        "vin": "4S3BH806727"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2016",
        "dateOfIncident": "01/06/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10819273,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TERRIBLE GAS SMELL. FUEL IS LEAKING BECAUSE IT IS COLD OUTSIDE.",
        "vin": "4S3BH675227"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2016",
        "dateOfIncident": "01/01/2016",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10817338,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TEMP. OUTSIDE GO BELOW 32 DEGREES, THE INSIDE OF MY CAR FILLS WITH RAW GAS SMELL, THIS HAPPENS EVERY WINTER. I LIVE IN WI. WHEN IT IS ABOVE FREEZING IT IS FINE AND ALL SUMMER IT IS FINE. I AM SO AFFRAID TO HAVE MY GRAND KIDS IN THE CAR. NOT SURE IF THE FUMES WILL EXPLODE.WHEN I AM DRIVING I DO NOT SMELL GAS. BUT IF I STOP AT A STOP SIGN OR LIGHT IT FILLS UP THE CAR. I HAVE TO ROLL DOWN MY WINDOWS TO GET FRESH AIR",
        "vin": "4S3BH665927"
    },
    {
        "components": "UNKNOWN OR OTHER,SERVICE BRAKES,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/21/2015",
        "dateOfIncident": "10/06/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10783939,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT CAR OCT 6; FIRST INSPECTION APPOINTMENT AT MY USUAL GARAGE MON OCT 12- FAILED DUE TO RUSTY SUSPECT BRAKE CONNECTION.  SELLER HAD ME TAKE TO HIS DEALER- MASTRIA SUBARU IN RAYNHAM. THEY PUT A PAINT/COATING OVER RUSTY AREA. I WAS PRETTY SKEPTICAL BUT BROUGHT CAR TO MY GARAGE IN VT MONDAY OCT 19 AND THE LEAKY BRAKE FLUID MUCH MORE CLEARLY VISIBLE- DUE TO SMOOTHER  (THOUGH BUMPY FROM OXIDATION BELOW) PAINT SURFACE. I ALSO SAW LEAKING COOLANT, LEAKS IN OIL PAN, AND A CRACK IN MUFFLER PIPE JUST ENGINE SIDE OF MUFFLER (IT HAD BEEN GETTING NOISIER AND NOISIER) MY MECHANIC POINTED OUT THE TIMING BELT GASKET WAS MISSING AND ONE BOLT 'MISSING' ; IT WAS STICKING OUT OF  ANOTHER 'HOLE' THAT WAS FOR A FULLY THREADED BOLT. THE SELLER HAS SENT LONG-WINDED INSULTING E-MAILS AND STATES I MUST RETURN CAR TO HIM TO HAVE THE SAME DEALER SERVICE IT. I AM TAKING IT TO A&M, 400 MYSTIC AVE, SOMERVILLE THIS MORNING  NEAR ME!  FOR ESTIMATE TODAY. THERE'S A REJECT STICKER FROM READING PETROLEUM ON IT- I DIDN'T KNOW MA & VT HAD RECIPROCAL STATUS- BUT I THINK THE VT INSPECTION IS MORE STRINGENT, SAFER AND COMPREHENSIVE",
        "vin": "4S3BH686626"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/05/2015",
        "dateOfIncident": "10/02/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10779649,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK. WHILE THE VEHICLE WAS BEING SERVICED FOR ROUTINE MAINTENANCE, THE INDEPENDENT MECHANIC DISCOVERED THAT THE REAR SUSPENSION SUBFRAME HAD FRACTURED DUE TO SEVERE RUSTING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 200,000.  UPDATE 01/13/16 MA; UPDATED 4/17/18*JB   THE CONSUMER STATED TRADED VEHICLE DUE TO THE FACT NOT KNOWING WHAT TO DO ABOUT FIXING IT. *TR",
        "vin": "4S3BH806027"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/15/2015",
        "dateOfIncident": "04/15/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10705906,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN GETTING THE CAR INSPECTED WE FOUND OUT THE FRAME OF THE CAR WAS RUSTED SO BADLY IT WAS CRACKED. IT WAS IN SUCH A KEY SPOT THAT IT WASN'T FIXABLE AND THE CAR COULD HAVE EASILY LOST A WHEEL ON THE ROAD WITH LITTLE TO NO WARNING (A SMALL BUMP COULD HAVE BEEN ENOUGH TO TRIGGER AN ACCIDENT). THE CAR HAS BEEN TAKEN CARE OF WELL AND WHEN INSPECTED JUST A YEAR AGO AT THE SUBARU DEALERSHIP THERE WAS NO MENTION OR SIGN THAT THIS COULD POTENTIALLY BE A PROBLEM. THE FAST DETERIORATION OF THE FRAME UNDERNEATH THE CAR IS THE COMPLAINT AND WE HAD NO CHOICE BUT TO PART OUT THE OTHERWISE WONDERFUL CAR DUE TO SAFETY AND UNABLE TO GET IT FIXED.   *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2015",
        "dateOfIncident": "08/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680125,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SIDE HEAD GASKET LEAKED. ONLY THAT SIDE WAS REPLACED. ON 1/14 BOTH HEAD GASKETS STARTED LEAKING AT 59000 MILES. WITH SUBARUS HELP THE DEALER CHARGED  $ 855.00. THE PROBLEM IS SUBARU HAS A DESIGN DEFECT IN THIS ENGINE SO THOSE OF US WHO OWN THESE CARS ARE GOING TO HAVE TO PAY FOR GASKET REPLACEMENTS FOR AS LONG  AS WE OWN THEM. BY THE WAY THE COOLANT SYSTEM CONDITIONER IS HOLTS RADWELD STOPLEAK SOMETHING SUBARU WILL NOT TELL YOU.  *TR",
        "vin": "4S3BH665427"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2015",
        "dateOfIncident": "01/13/2015",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10672333,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 10 DEGREE WEATHER, MY 2002 SUBARU OUTBACK WAGON DEVELOPED A FUEL LEAK WHILE BEING DRIVEN BY MY 17-YEAR-OLD CHILD. THIS IS MY SECOND SUBARU WAGON AND THE  SECOND TO HAVE COLD WEATHER FUEL LEAKS. I TIGHTENED THE CLAMP ON THE OFFENDING FUEL LINE AND I HOPE THAT IS AN ADEQUATE FIX. BUT IT IS SIMPLY UNACCEPTABLE THAT SUCH A DANGEROUS PROBLEM HAS NOT HAD A RECALL, AND THAT IT HAS BEEN HAPPENING FOR 20 YEARS. (MY FIRST SUBARU WITH THIS PROBLEM WAS A 1991 LEGACY WAGON.) HOW MANY CAR FIRES HAVE RESULTED FROM THIS PROBLEM? HOW MANY INJURIES OR EVEN FATALITIES? PLEASE MAKE SUBARU TAKE RESPONSIBILITY FOR A POORLY DESIGNED FUEL LINE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2014",
        "dateOfIncident": "12/19/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10659052,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RUBBER FUEL LINKAGES CONTRACT IN LOW (BELOW 30F) TEMPERATURES, ALLOWING FUEL TO LEAK INTO THE ENGINE COMPARTMENT. THE LEAKING FUEL CREATES A VERY STRONG, AT TIMES INTOLERABLE, FUEL VAPOR SMELL IN THE CABIN. SOME LEAKS DRIP ONTO THE EXHAUST MANIFOLD AND ENGINE BLOCK SO ENGINE FIRE IS A POSSIBILITY.  *TR",
        "vin": "4S3BH665627"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/22/2014",
        "dateOfIncident": "10/22/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10649305,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ALTHOUGH MY CAR IS NOT LISTED ON THE AIRBAG RECALL, I AM CONCERNED MY CAR MIGHT HAVE THE AIRBAGS FROM TAKATA.  THE YEAR THE TAKATA AIRBAG RECALL STARTED IS 2000.  MY CAR IS A 2002 SUBARU OUTBACK.  THE 2003 SUBARU OUTBACK IS ON THE TAKATA AIRBAG RECALL LIST.  HOW CAN I MAKE SURE MY CAR'S AIRBAGS WERE NOT MANUFACTURED BY TAKATA?   *TR",
        "vin": "4S3BH686527"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/18/2014",
        "dateOfIncident": "02/17/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564798,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK. THE CONTACT STATED THAT THE BRAKES WOULD NOT RELEASE AFTER BEING APPLIED, EVEN WHEN THE CONTACT'S FOOT WAS NO LONGER ON THE BRAKE PEDAL. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000. THE CURRENT MILEAGE WAS 135,000.",
        "vin": "483DH675827"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/17/2014",
        "dateOfIncident": "02/01/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10564698,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DATES ARE APPROXIMATE, PROBLEM IS ONGOING.  UPON INITIAL START-UP, IN COOL/COLD WEATHER THE BRAKE PEDAL WILL BE VERY HARD AND BRAKES ARE VERY WEAK REQUIRING TREMENDOUS FOOT PRESSURE WITH STILL REDUCED BRAKING EFFECTIVENESS.  AFTER A PERIOD OF TIME AND MULTIPLE STOPS BRAKE ASSIST SEEMS TO INCREASE AND THE BRAKES GET STRONGER OR NORMAL.  I HAVE RESEARCHED THAT THIS IS NOT AN UNCOMMON PROBLEM WITH SUBARU CARS AT HIGHER MILEAGE.  IT IS SAID TO BE WATER IN THE BRAKE BOOSTER HOSE ONE WAY VALVE.  CHANGING THE HOSE, I AM TOLD, WILL NOT SOLVE THIS PROBLEM AS MORE WATER WILL ENTER THE SYSTEM AND FREEZE OR GUM PU THE WORKS.  VERY DANGEROUS ESPECIALLY FOR DRIVERS WHO DO NOT HAVE THE STRENGTH TO PRESS SO HARD ON THE PEDAL.  *TR",
        "vin": "4S3BE896027"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/12/2014",
        "dateOfIncident": "02/11/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10563982,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "UPPER FRONT FUEL LINE AND CONNECTION TO THROTTLE BODY? IS LEAKING RAW GAS AND FUEL IS POOLING ON TOP OF ENGINE JUST OUTWARD OF UPPER EXHAUST MANIFOLD AREA.  *TR",
        "vin": "4S3BH665427"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2014",
        "dateOfIncident": "01/08/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561539,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER LAST FEW WINTERS, WHEN TEMPERATURES DROP TO FREEZING THERE HAS BEEN A BAD FUEL SMELL IN CABIN.  ESPECIALLY WITH HEATER BLOWING, THOUGH IT STILL SMELLS INSIDE AND OUTSIDE THE CAR EVEN WITH THE HEAT OFF.  ONCE THE WEATHER WARMS UP THERE IS NO NOTICEABLE SMELL.  I HAVE TRIED TIGHTENING 5 CLAMPS AS SUGGESTED IN AN ONLINE HELP PAGE. NOT SURE IF THIS HELPED OR PROBLEM JUST WENT AWAY WITH THE COLD WEATHER. LOCAL SHOP COULDN'T SEE LEAK ON CURSORY CHECK WHILE THE ODOR AS AT IT'S WORSE.  MAYBE ONLY VISIBLE IF IT'S FREEZING AND UP ON A LIFT. SUBARU DEALER SUGGESTED FUEL LINES NEED TO REPLACED AS NORMAL PROCESS AS CAR AGES. SUBARU SHOULD FIND SOLUTION TO THIS DANGEROUS PROBLEM THAT'S OBVIOUSLY COMMON TO THESE VEHICLES AND PUT OUT CLEAR INSTRUCTION ON DIAGNOSING AND FIXING THIS ISSUE.  *TR",
        "vin": "4S3BH675327"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2014",
        "dateOfIncident": "01/17/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561377,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE RECENT TEMPERATURE DROP WHERE WE LIVE (MARYLAND, DC METRO REGION), WE'VE NOTICED A STRONG GASOLINE SMELL INSIDE THE CAR'S CABIN. THE SMELL IS STRONG ENOUGH THAT WE ARE UNCOMFORTABLE DRIVING LONG DISTANCES, FOR OUR OWN HEALTH AND THAT OF OUR CHILDREN.    THE SMELL ONLY APPEARS WHEN THE CAR IS RUNNING (THOUGH IT DOESN'T SEEM TO DEPEND ON SPEED). WE'VE OWNED THE CAR SINCE MARCH 2010, AND THIS IS THE FIRST TIME WE'VE NOTICED THE ISSUE; IT'S ALSO THE COLDEST WEATHER WE'VE ENCOUNTERED SINCE PURCHASE.    APPARENTLY THERE'S A FUEL-LINE-RELATED RECALL FOR IMPREZAS OF THIS VINTAGE, BUT NOT YET FOR OUTBACKS.  *TR",
        "vin": "4S3BH665126"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "01/03/2014",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561270,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SMELL OF RAW GAS PERMEATES THE PASSENGER CABIN WHEN THE CAR IS STARTED IN TEMPERATURES UNDER 10 DEGREES FAHRENHEIT.  *TR",
        "vin": "4S3BH665927"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2013",
        "dateOfIncident": "12/06/2013",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555399,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE DROVE HER CAR, A 2002 SUBARU OUTBACK, ABOUT 5 MILES HOME FROM WORK, AND TOLD ME IN THE EVENING HER CAR REEKED OF GASOLINE WHEN SHE ARRIVED AT HOME.  WHEN I CHECKED HER CAR THE GAS ODOR HAD DISSIPATED, BUT WHEN I STARTED IT AND BACKED IT OUT OF THE GARAGE THE GAS ODOR WAS VERY STRONG.  I MOVED IT BACK INTO THE GARAGE AND SHUT IT OFF. I DISCOVERED ONLINE THAT THE ODOR WAS LIKELY DUE TO A FUEL HOSE LEAK ASSOCIATED WITH A COLD WEATHER START. THE TEMPERATURES HERE ARE COLD FOR MISSOURI, WITH HIGHS IN THE LOW 20'S.  IT STILL IS COLD, ALBEIT AS A MINNESOTA BOY IT STILL SEEMS LIKE SPRING.  AT ANY RATE, I FOUND A WEBSITE WITH USEFUL DIAGRAMS AND I LOCATED THE HOSE UNDER A BRACKET (OF COURSE), AND MANAGED TO UNCOVER THE HOSE AND TIGHTEN THE CLAMPS, WHICH WERE VERY LOOSE.  AFTER RE-ASSEMBLY I DROVE THE CAR TO BURN OFF THE GAS REMAINING ON THE ENGINE AND I TESTED THE REPAIR WITH ANOTHER COLD WEATHER START LATER.  I HAVE ORDERED A REPLACEMENT HOSE FROM THE SUBARU DEALERSHIP FOR 12 BUCKS.  I UNDERSTAND THAT RECALLS AND SERVICE ADVISORIES HAVE OCCURRED AND ARE IN PLACE FOR OTHER SUBARU MODELS INCLUDING THE CLOSELY RELATED 2001 LEGACY.  I WOULD LIKE TO ADD THE 2002 OUTBACK AND EVERY OTHER SUBARU THAT USES THE HOSE PART # 807707130.  THE DISCUSSIONS ONLINE ABOUT THIS ISSUE REVEAL SOME PEOPLE ARE DRIVING WITH THEIR WINDOWS OPEN OR WITH CABIN AIR SET TO RECIRCULATE, OR WAITING UNTIL THE ENGINE WARMS UP ENOUGH FOR THERMAL EXPANSION TO SEAL THE LEAK.  AS AN INDUSTRY CHEMIST I FIND THIS IGNORANCE ABOUT THE HAZARDS OF GASOLINE FIRES APPALLING.  HOWEVER I THINK SUBARU'S PIECE-MEAL APPROACH TO ADDRESSING THEIR DEFECTIVE ENGINEERING IS FRIGHTENING.  DON'T THEY CARE ABOUT THE SAFETY OF THEIR CUSTOMERS?  MY WIFE TEACHES CHEMISTRY, A TYPICAL CUSTOMER, ACCORDING TO SUBARU ADS.  SHE LOVES HER SUBARU.  SUBARU DOES NOT LOVE HER.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2013",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10494612,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR ALWAYS HAS A STRONG GAS SMELL INSIDE DURING WINTER.   THE SMELL IS SO BAD THAT I GET HEADACHES.  *TR",
        "vin": "4S3BE686X27"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": true,
        "dateComplaintFiled": "08/02/2012",
        "dateOfIncident": "08/02/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468975,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON HIGHWAY I-95 GOING BETWEEN 55 AND 60 MILES AN HOUR AND THE HOOD LATCH FAILED.  THE HOOD CAME UP BLOCKING OUR VISION AND BROKE THE WINDSHIELD.  EXTENSIVE DAMAGE TO CAR.  WE WERE TRAVELING IN THE FAR RIGHT LANE AND WERE LUCKY THAT WE COULD PULL THE CAR OFF THE HIGHWAY INTO THE BREAKDOWN LANE.  WE WERE VERY LUCKY NO ONE WAS BEHIND US.  *TR",
        "vin": "4F3BE686227"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/18/2012",
        "dateOfIncident": "04/17/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455703,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK SPORT. WHILE HAVING THE VEHICLE EXAMINED, THE CONTACT WAS INFORMED THAT THE SUB FRAME HAD BEGUN TO RUST AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT SERVICED. THE CURRENT AND FAILURE MILEAGES WERE 152,000.   UPDATED 05/09/12 *BF",
        "vin": "JF1GG68592G"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/06/2012",
        "dateOfIncident": "12/17/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450552,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK. THE CONTACT STATED THAT WHENEVER THE HEAT WAS ACTIVATED, THE CONTACT WOULD NOTICE A GASOLINE ODOR COMING THROUGH THE VENTS. THE VEHICLE WAS TAKEN TO THE DEALER ON FOUR OCCASIONS WHERE THE HEAD GASKETS WERE REPLACED EACH TIME. HOWEVER, ONE YEAR AFTER THE REPAIR THE CONTACT NOTICED THAT THE FAILURE RECURRED. THE VEHICLE HAD NOT BEEN RECENTLY DIAGNOSED. THE CURRENT AND FAILURE MILEAGES WERE 84,000.",
        "vin": "4S3BH675027"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/16/2012",
        "dateOfIncident": "01/30/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448222,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE IT WAS CONFIRMED THAT CORROSION WAS ON THE REAR SUB FRAME. THE MECHANIC ADVISED THE CONTACT OF A RECALL RELATED TO THE FAILURE UNDER NHTSA CAMPAIGN ID NUMBER:03V153000(SUSPENSION:REAR). THE FAILURE WAS ALSO CONFIRMED BY AN AUTHORIZED DEALER. THE MANUFACTURER WAS CONTACTED BUT IT WAS NOT CONFIRMED IF THE VEHICLE WAS INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 148,731.",
        "vin": "4S3BH665727"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2012",
        "dateOfIncident": "01/13/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443860,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN WEATHER TURNS COLD, THE SMELL OF RAW GAS COMES INTO THE CAR, AS WELL AS IN THE GARAGE   AFTER PARKING.  SO FAR THE DEALER HAS JUST TIGHTENED A CLAMP, BUT WHAT HAPPENS IF I'M ON A HI-WAY AND THAT HAPPENS? I CAN'T DRIVE THE CAR WITH A GAS LEAK IN THE ENGINE AND TO FAR AWAY FROM A FIRE STATION  SO DO I CALL A TOWE  TRUCK OR MY LAWYER. BECAUSE THE CAR BURNT UP?  CAN'T BELIEVE THE SUBARU   DEALERSHIP IS BEING SO UNRESPONSIVE ABOUT THIS.   GET THIS RECALL TO ALL THE SUBARU HAVING A ISSUE  I THOUGHT YOU HAD GREAT CARS NOT SO MUCH NOW.",
        "vin": "4S3 BH6757 "
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/12/2012",
        "dateOfIncident": "01/10/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443610,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK WAGON. THE CONTACT STATED DURING ROUTINE MAINTENANCE WITH A PRIVATE MECHANIC, THE MECHANIC ADVISED THAT RADIATOR FLUID WAS LEAKING INTO THE EXHAUST. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND THE CURRENT MILEAGES WERE 120,000.",
        "vin": "4S3BH665326"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/07/2012",
        "dateOfIncident": "01/02/2012",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442771,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER, MY 2002 SUBARU OUTBACK CABIN GETS FILLED WITH VERY STRONG RAW FUEL SMELL AS THE CAR WARMS UP WITH THE HEATER ON. IT HAS GOTTEN SO BAD, THAT MY DAUGHTER NEARLY THROWS UP EVERY MORNING ON OUR WAY TO SCHOOL IN COLD WEATHER. THIS IS AN ISSUE THAT MY LOCAL DEALER EXPLAINED AWAY HAS A TYPICAL SUBARU THING  IN COLD WEATHER. THIS IS UNACCEPTABLE. THIS IS A HEALTH HAZARD AND SUBARU IS GETTING AWAY WITH IT. I HAVE BEEN USING THIS PARTICULAR CAR FOR THE LAST 10 YEARS, AND EVERY WINTER THE SMELL GETS WORSE AND WORSE. SUBARU NEEDS TO STEP UP, ACKNOWLEDGE THE PROBLEM AND FIX IT, OR FACE THE VERY REAL PROBLEM OF A MASSIVE LAWSUIT SOON.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/30/2011",
        "dateOfIncident": "12/29/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441912,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY TOOK MY OUTBACK IN TO A LOCAL SHOP FOR AN OIL CHANGE, AND THEY NOTIFIED ME THAT THE HEAD GASKET HAS STARTED TO LEAK.  TOOK IT TO THE DEALERSHIP FOR A SECOND OPINION, AND THEY SAID THE SAME THING.  CALLED FOUR DIFFERENT PLACES, AND GOT ESTIMATES FOR ANYWHERE FROM $1500-$2100 (AFTER SPENDING $2K ON OTHER WEAR AND TEAR REPAIRS THIS SUMMER).  EVERY MECHANIC I SPOKE WITH WAS KEENLY AWARE OF THIS PROBLEM, WHICH OBVIOUSLY MEANS THIS IS A VERY COMMON - AND EXPENSIVE - DEFECT!  *KB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/22/2011",
        "dateOfIncident": "11/13/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436793,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PROMINENT GAS SMELL INSIDE CABIN WHEN TEMPERATURE IS BELOW 32 DEGREES F.  IT IS A KNOWN SAFETY ISSUE ON SUBARU'S BUT NOTHING IS BEING DONE BY SUBARU TO RECTIFY THIS POOR ENGINEERING SAFETY ISSUE ON THEIR BEHALF.  I HAVE TALKED TO SUBARU OF AMERICA VIA EMAIL AND ON PHONE AND THEY SAY THAT THERE IS NO ISSUE WITH THIS CAR EVEN THOUGH THERE IS THOUSANDS OF PEOPLE THAT ARE EXPERIENCING THIS ISSUE.  *TR",
        "vin": "4S3BH675626"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/31/2011",
        "dateOfIncident": "01/05/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10403814,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK. THE CONTACT WAS DRIVING 55 MPH WHEN THE LUG NUTS DETACHED FROM THE VEHICLE. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 02V235000 (WHEELS) BUT WAS NOT INCLUDED IN THE RECALL.  THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP WHERE THE FAILURE WAS REPAIRED. NEITHER THE DEALER NOR MANUFACTURER WAS CONTACTED IN REGARDS TO THE FAILURE. THE FAILURE MILEAGE WAS 150,000 AND THE CURRENT MILEAGE WAS 155,000. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/25/2011",
        "dateOfIncident": "04/25/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397415,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING MY RECENTLY BOUGHT 2002 SUBARU OUTBACK, WHEN MY CHILD WHO WAS SITTING IN THE MIDDLE SEAT IN THE BACK STARTED SCREAMING THAT THE SEATBELT WAS HURTING HER AND SHE COULDN'T BREATHE. I MADE AN EMERGENCY STOP AT A FULL SERVICE GAS STATION, JUMPED OUT AND TRIED GETTING THE SEATBELT UNDONE BUT IT WAS STUCK. RAN IN AND GRABBED A MECHANIC AND HE WAS LUCKILY ABLE TO RELEASE IT AND HE SAID THAT THE TENSIONER WAS BAD. THIS COULD HAVE BEEN A MUCH WORSE CASE IF IT DIDN'T HAPPEN A BLOCK FROM HELP.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/28/2011",
        "dateOfIncident": "01/28/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379400,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A DOCUMENTED PROBLEM WITH OLDER MODEL SUBARU OUTBACKS (EARLY 2000S) LEAKING GAS INTO THE ENGINE COMPARTMENT IN COLD WEATHER. DEALERS AND REPAIR SERVICES CANNOT FULLY RESOLVE THE ISSUE BECAUSE IT APPEARS TO BE A DESIGN FLAW WITH THE FUEL LINES AND CLAMPS. INTERNET FORUMS PROVIDE COUNTLESS CASES (HERE IS JUST ONE HTTP://ACTION.PUBLICBROADCASTING.NET/CARTALK/POSTS/LIST/1794410.PAGE).  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/10/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10375520,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUSE FOR TAIL LIGHTS BLEW DUE TO TAIL LIGHT SOCKET PARTIALLY MELTING (AREA WHERE THE TWO CONTACTS FOR BRAKE/TAIL LIGHT ARE LOCATED-LOCATION WAS THE DRIVER'S SIDE INSIDE BRAKE/TAIL LIGHT). WAS UNAWARE THAT THE TAIL LIGHTS WERE NOT WORKING FOR ABOUT 1 WEEK.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2010",
        "dateOfIncident": "11/04/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363643,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK SMELLS OF GAS EVERY TIME IT GETS COLD.  A SHOP THAT WORKS ON JUST SUBARUS KNOWS THE PROBLEM WELL AND TRIED A FEW THINGS TO FIX IT.  AFTER $175, IT DID NOT WORK.  LAST YEAR, I HAD TO DRIVE WITH MY WINDOWS DOWN ON COLD NIGHTS THE SMELL WAS SO STRONG.  ONE NIGHT IT WAS -20 DEGREES!  THIS YEAR THE SMELL HAS COME BACK AT JUST 39 DEGREES AND STRONGER.  MY GARAGE SMELLS AND I AM AFRAID THE CALL WILL BLOW UP OR I WILL GET SICK DRIVING IT.  ON-LINE AND ON THE NHTSA I SEE MANY OTHER SUBARU OWNERS HAVING TO PUT IT WITH THE SAME THING.  CAN YOU FOLKS HELP? *TR",
        "vin": "4S3BH665227"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2010",
        "dateOfIncident": "01/30/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362512,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SUBARU OUTBACK. WHILE THE VEHICLE WAS IDLE SHE STATED THAT THERE WAS A STRONG FUEL SMELL IN THE VEHICLE. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO CLEANED THE EXHAUST SYSTEM. THE CONTACT STATED THAT THE FAILURE CONTINUED TO OCCUR. THE VEHICLE WAS TAKEN TO ANOTHER LOCAL MECHANIC WHO STATED THAT  THE FAILURE WAS CAUSED BY A LOOSE LATCH IN THE HATCH BACK. THE MECHANIC REPAIRED THE LOOSE LATCH. THE FAILURE CONTINUED AFTER THE LATCH WAS REPAIRED. THE VEHICLE WAS TAKEN BACK TO THE MECHANIC AND HE WAS UNABLE TO DETERMINE WHAT CAUSED THE FAILURE TO OCCUR. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS PURCHASED USED IN 2007 WHO STATED THAT THE FAILURE HAD OCCURRED FOR TWO TO THREE YEARS. THE CONTACT STATED THAT THE FAILURE ONLY HAPPENED DURING COLD WEATHER CONDITIONS. THE  FAILURE MILEAGE WAS 92,000. THE CURRENT MILEAGE WAS 108,000.",
        "vin": "4S3BH675627"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "05/09/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330190,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 SUBARU OUTBACK. WHILE ATTEMPTING TO  SHIFT INTO PARK, THE VEHICLE ABNORMALLY ACCELERATED WITHOUT WARNING, CAUSING THE CONTACT TO CRASH INTO A NEARBY FENCE. THE CONTACT WAS NOT INJURED. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR FURTHER TESTING TO DETERMINE THE CAUSE OF THE FAILURE. THE FAILURE AND CURRENT MILEAGES WERE 71,000.   UPDATED 07/19/2010. *LJ  UPDATED 07/26/10*JB",
        "vin": "4S3BH806727"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "11/25/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327072,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES BRIEFLY FAIL IN FREEZING COLD WEATHER CONDITIONS. 5 OR 10 HARD PUMPS HAVE USUALLY BROUGHT THEM BACK. VERY DANGEROUS IF YOU ARE NOT EXPECTING IT. I NEVER LEAVE MY DRIVEWAY OR PARKING SPACE WITHOUT REPEATED PUMPING TO GET THEM WORKING AGAIN. WE ARE SKI INSTRUCTORS (AND THIS CAR IS MARKETED FOR THAT) BUT ITS QUITE DANGEROUS IN FREEZING WEATHER. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/06/2010",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323992,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IDLING AT STOP WITH FOOT FIRMLY ON BRAKE PEDAL. SUDDEN SURGE WITH AUDIBLE AND TACHOMETER INCREASE IN RPM. CAR JUMPED FORWARD SLIGHTLY. A FEW PRIOR MINOR RPM SURGES WITH FOOT ON BRAKE. THANKS TO THE RECENT NEWS RE TOYOTA. I  KNEW TO SHOVE  THE TRANSMISSION INTO PARK AND TURNED OFF THE IGNITION. *TR",
        "vin": "4S3BH665927"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "02/08/2010",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312712,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SMELL INSIDE AND OUTSIDE OF CABIN WHEN WEATHER IS COLD (20' OR BELOW). SHOP HAS EXAMINED THE VEHICLE AND CANNOT DETERMINE CAUSE. SEEN REFERENCES TO SIMILAR ISSUE WITH THE WRX MODEL AND FUEL LINES/CLAMP. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/19/2009",
        "dateOfIncident": "01/11/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296415,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SMELL INSIDE CAR WHEN COLD OUTSIDE (APPROX. 25 DEG F)  OCCURS EVERY WINTER AT THESE TEMPERATURES FOR LAST 3 YRS (AT LEAST)  DEALERS NEVER FOUND ANYTHING. *TR",
        "vin": "4S3BH665627"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/24/2009",
        "dateOfIncident": "03/17/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269832,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REPETITIVE FAILURE OF BOTH FRONT BRAKE ROTORS. ROTORS HAVE THICKNESS VARIATION WHICH CAUSES HEAVY BRAKE PULSATION AND STEERING WHEEL JUDDER FROM SIDE TO SIDE WHEN BRAKING FROM GREATER THAN 45 MPH. FIRST COMPLAINT 6/18/03 9971 MILES FRONT ROTORS WERE RESURFACED. SECOND COMPLAINT 5/3/04 16180 MILES RESURFACE FRONT ROTORS. THIRD COMPLAINT 4/7/05  23013 MILES RESURFACE FRONT ROTORS REPLACE FRONT BRAKE PADS. FOURTH COMPLAINT 5/20/08 42147 MILES REPLACE FRONT ROTORS AND FRONT BRAKE PADS. FIFTH COMPLAINT 3/17/09 49719 MILES RESURFACE FRONT ROTORS. SUBRAU DOES HAVE A CUSTOMER PAY UPGRADE IN THEIR TSB #: 06-33-04  DATE: 01/15/04 FOR 2001-2003 SUBARU VEHICLES TO MODIFY THE DISC BRAKE PAD. *TR",
        "vin": "4S3BH806427"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2009",
        "dateOfIncident": "01/20/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256179,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH MY 2001 AND 2002 SUBARU OUTBACKS HAD A STRONG SMELL OF GASOLINE IN THE CABIN WHEN STARTING THE CARS. A CHECK UNDER THE HOOD SHOWED GASOLINE DRIPPING FROM SEVERAL OF THE RUBBER FUEL LINES WHERE THEY JOINED METAL FUEL LINES. THE FUEL WAS DRIPPING ONTO THE ENGINE AND RUNNING DOWN TO THE GROUND. UPON TIGHTENING THE FUEL LINE CLAMPS THE PROBLEM STOPPED. WHEN I USED GOOGLE TO CHECK ON THE PROBLEM THERE WAS SEVERAL 100,000 HITS WITH THE SAME PROBLEM. IT SEEMS TO BE RELATED TO LOW TEMPERATURE <+10F. *TR",
        "vin": "4S3BH665627"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/20/2009",
        "dateOfIncident": "01/17/2009",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255759,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 SUBARU LEGACY OUTBACK WAGON, 2.5 LITER ENGINE, LEAKED FUEL FROM THE FUEL LINE.  THIS WAS MOST PRONOUNCED ON A COLD DAY.  THERE ARE MANY REPORTS OF THE SAME PROBLEMS.  MY SUBARU DEALER TOLD ME THAT THIS PROBLEM IS COMMON.  THOUGH WE SMELLED THE STRONG FUEL ODOR, FORTUNATELY, THERE WASN'T A FIRE.  THE CAR IS NOW BEING REPAIRED AND WILL BE READY 01/21/09.  THE ESTIMATED COST OF THE REPAIR IS $485.  SUBARU KNOWS ABOUT THE PROBLEM AND REDESIGNED THE PART.  THEY REFUSE TO COVER IT BECAUSE THEY SAY THE SERVICE BULLETIN NUMBER 09-36-03, ISSUED 04/01/03 ONLY APPLIES TO THE WRX, EVEN THOUGH THE OUTBACK HAS A SIMILAR SETUP. *TR",
        "vin": "4S3BH675227"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/14/2009",
        "dateOfIncident": "06/28/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254934,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 SUBARU OUTBACK HAD FRONT ROTOR FAILURE IN 2007-----THE FINS THAT HOLD THE ROTORS TOGETHER RUSTED AND BROKE.  WHEN YOU CHECKED THE ROTOR THICKNESS WITH A MICROMETER IT WAS FINE BUT WHEN YOU APPLIED BRAKES THE PRESSURE SQUEEZED THE SURFACES TOGETHER AND MADE IT FEEL LIKE THE ROTORS WERE WARPED---ALSO UNDETECTABLE BY RUNOUT GAGE. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/26/2008",
        "dateOfIncident": "08/13/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252836,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH DEFECTS NOT ACKNOWLEDGED AND NOT REPAIRED BY THE DEALER ON A SUBARU OUTBACK 20002.  DEALERSHIP: LIBERTY, 1000 E PARK AVENUE, LIBERTYVILLE, IL 60048  PROBLEM STARTED IN 2003 AND LASTED TO THIS DATE. IN AUG 2008, DEALER ACKNOWLEDGED PRESENT DEFAULT BUT REFUSED TO CONCEDE THAT THERE WAS A PROBLEM FROM THE START.  WHEN THE CAR WAS SERVICED ON MANY OCCASIONS STARTED IN 2003 (OIL CHANGES) WE MENTIONED A PROBLEM WITH THE CLUTCH. THE DEALER BLAMED THE \"NEW HYDRAULIC CLUTCH\" AND GAVE US THE RUN-AROUND. NOW IN 2008, 3 YEARS LATER, THEY \"DISCOVERED\" THE CLUTCH PROBLEM AND WANTS TO CHARGE $1,300.00 TO FIX IT.  WE REFUSED TO HAVE TO PAY FOR SOMETHING THAT SHOULD HAVE BEEN DONE UNDER WARRANTY.  ANOTHER GARAGE TOLD US THAT SUBARU HAD ISSUED AN ADVISORY ABOUT THE EXACT SAME PROBLEM BUT THE DEALER NEVER TOLD US. THE CLUTCH IS STILL NOT REPAIRED.  BOTH MY WIFE AND I HAVE DRIVEN MANY MANUAL GEAR SHIFT CARS WITH NO PROBLEMS, HAVING DRIVEN OUR PREVIOUS 1992 SUBARU OUTBACK TO 140,000 BEFORE IT NEEDED A CLUTCH REPAIR.  THE CLUTCH ON THE 2002 HAS BEEN A PROBLEM ALMOST RIGHT FROM THE START.  WE HAVE SERVICE REPORT DATED 06/17/05 INVOICE # SUCS426989 SAYING:   \" REF#2 03SUZ : DRIVE LINE - TECK :553 - CUSTOMER STATES AT TIMES VEHICLE SHAKES WHEN LETTING OUT THE CLUTCH AND TAKING OFF, MORE AMPLIFIED AFTER VEHICLE HAS BEEN SITTING. ---INSPECTED VEHICLE, COULD NOT DUPLICATE CONDITION AT THIS TIME-   THIS WAS NOT THE FIRST TIME WE REPORTED THE PROBLEM, BUT IT IS THE FIRST WRITTEN ACKNOWLEDGEMENT FROM THE DEALER.  THERE IS A SECOND WRITTEN ACKNOWLEDGEMENT: DATED 11/28/06, INVOICE SUCS476828, REF J#2 08SUZ   CLUTCH   ---TECH 42898: CUSTOMER STATES THE CAR IS CHUGGING IN FIRST GEAR - SEE LINE 1  LINE 1 STATES J# 1 40SUZDGRT    DIAGNOSIS ROAD TEST -  CUSTOMER STATES THE ENGINE LIGHT IS ON AND CAR FEELS LIKE IT WANT TO STALL.   PER SCANNER CODE, REPLACE FRONT O2 SENSOR AND REFLASH ECM\"  AS YOU SEE, THEY BLAMED THE O2 SENSOR AND REFUSE TO ACKNOWLEDGE THE CLUTCH PROBLEM. *TR",
        "vin": "4S3BH665926"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/23/2008",
        "dateOfIncident": "12/21/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252692,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK- DEC. 08'- EXPERIENCING VERY STRONG FUEL SMELL IN CABIN OF VEHICLE DURING COLD WEATHER.  SAME SCENARIO UNFOLDED LAST YR. 07' WHEN IT GOT COLD. LAST YEAR DEALER CHARGED FOR INSPECT AND TIGHTENING OF CLAMPS ALONG FUEL LINES.  THIS IS A KNOWN PROBLEM WITH THE SUBARU OUTBACKS..WHY NO RECALL?..WITH FUEL LINE LEAKS AS COMMON AS THEY ARE WITH THIS MODEL I AM SURPRISED THERE IS NO RECALL.  IS THERE ANYTHING SUBARU IS OFFERING TO HELP OWNERS RECOVER MONIES BEING SPENT ON THIS FIX? *TR",
        "vin": "4S3BH675527"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "12/18/2008",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252221,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE TEMPERATURE IS BELOW 30 DEGREES, THERE IS A STRONG FUEL SMELL IN THE CAB WHEN THE HEATER IS RUNNING.  THIS HAS BEEN A PROBLEM FOR THE LAST 3 YEARS IN MY 2002 SUBARU OUTBACK.  I TRIED CORRECTING THE PROBLEM BY TIGHTENING THE BRACKETS IN THE FUEL LINE AND THIS HAS NOT HELPED.  MY INTERNET RESEARCH INDICATES THIS IS A COMMON PROBLEM FOR SUBARUS (DIFFERENT MODELS AND YEARS).  I AM SURPRISED THIS HAS NOT BEEN RECALLED.  IN SOME CASES, IT IS DUE TO LOOSE BRACKETS AND IN OTHERS LEAKY GASKETS IN THE FUEL INJECTOR.  THIS IS CLEARLY A HEALTH ISSUE.  I CANNOT DRIVE MY CAR WITH MY TWO SMALL CHILDREN WITH THE HEATER RUNNING (EVEN WITHOUT THE HEATER THERE IS A RESIDUAL FUEL SMELL). *TR",
        "vin": "4S3BH665327"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "11/25/2008",
        "dateOfIncident": "02/19/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10249828,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SUBARU OUTBACK.  WHILE DRIVING VARIOUS SPEEDS, THE STEERING WHEEL LOCKED ON SEVERAL OCCASIONS WHEN THE CONTACT ATTEMPTED TO TURN THE WHEEL.  THE DEALER COULD NOT DUPLICATE THE FAILURE OR MAKE ANY REPAIRS.  ON A SEPARATE OCCASION, THE DRIVER ATTEMPTED TO MAKE A RIGHT TURN, BUT THE STEERING LOCKED UP AGAIN AND COULD NOT BE TURNED.  THE VEHICLE CRASHED INTO THE GUARD RAIL, BUT THE CONTACT SUSTAINED MINOR INJURIES.  THE VEHICLE SUSTAINED MAJOR DAMAGE AND WAS WAITING FOR THE INSURANCE AGENCY TO DETERMINE IF IT WAS DESTROYED.  THE VIN WAS UNKNOWN.  THE FAILURE MILEAGE WAS LESS THAN 90,000 AND CURRENT MILEAGE WAS 100,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/04/2008",
        "dateOfIncident": "01/15/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244369,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REPEAT FUEL LINE LEAKS IN 2002 SUBARU OUTBACK WGN. THERE ARE A TOTAL OF SEVEN FLEXIBLE RUBBER HOSES THAT CONNECT THE FUEL LINE AS IT PASSES THROUGH THE CHASSIS. WHEN WEATHER IS COLD, HOSE CLAMPS/RUBBER HOSES LEAK. MY LOCAL DEALER SEEMED TO BE WELL AWARE OF THE PROBLEM, WHICH HAS NOT BE ADDRESSED, AND SAID THAT SUBARU HAS NO PLANES TO FIX THE PROBLEM. OUTSIDE OF CAR, PASSAGE CABIN REEK OF RAW FUEL. *TR",
        "vin": "4S3BH665527"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/17/2008",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234626,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I REPLACED THE LEFT HEAD GASKET (AT A LOCAL SERVICE CENTER) AT 122,000 MILES DUE TO OIL LEAKAGE.  AT 123,000 MILES THE RIGHT HEAD GASKET FAILED.  I CONTACTED SUBARU BECAUSE I DON'T THINK IT'S COINCIDENTAL FOR BOTH HEAD GASKETS TO FAIL THAT CLOSE TOGETHER.  THEY WILL NOT HELP ME BECAUSE OF THE MILES AND BECAUSE I DIDN'T HAVE THE FIRST WORK DONE AT A DEALER.  *TR",
        "vin": "4S3BH665227"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/15/2008",
        "dateOfIncident": "09/25/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234372,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SUBARU OUTBACK.  WHILE DRIVING 65 MPH, THE CONTACT HEARD A GRINDING SOUND COMING FROM OUTSIDE THE VEHICLE.  A LOCAL MECHANIC STATED THAT THE BEARINGS IN THE TRANSFER CASE FAILED.  THE VEHICLE WAS DIAGNOSED BY THE MECHANIC; HOWEVER, THE FAILURE RECURRED THREE MONTHS LATER.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 60,000 AND FAILURE MILEAGE WAS 55,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/27/2008",
        "dateOfIncident": "02/01/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219284,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAD GASKET FAILURE CAUSING COOLANT LEAK FROM ENGINE, POTENTIAL OVERHEATING AND ENGINE FAILURE.  *TR",
        "vin": "4S3BH665426"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/18/2008",
        "dateOfIncident": "01/29/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218459,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OVERWHELMING ODOR OF GASOLINE IN PASSENGER COMPARTMENT. *TR",
        "vin": "4S3BH665227"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2008",
        "dateOfIncident": "01/25/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216053,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE PAST 2 WINTERS, I HAVE EXPERIENCED A STRONG FUEL SMELL IN THE PASSENGER CABIN FOR THE FIRST 20 MINUTES OR SO OF RUNNING THE CAR IN TEMPERATURES BELOW 25 DEGREES, INCLUDING IDLING AT A TRAFFIC LIGHT. IT SEEMS TO BE GETTING PROGRESSIVELY WORSE. I BROUGHT IT TO MY PRIVATE MECHANIC LAST WEEK, AND HE WAS UNABLE TO PINPOINT THE SOURCE OF THE PROBLEM. IF YOU DO A GOOGLE SEARCH ON \"SUBARU GAS SMELL\" YOU WILL FIND 25,800 HITS OF PEOPLE REPORTING THE SAME PROBLEM WITH THEIR SUBARU'S, FOR A VARIETY OF MODELS/YEARS. BASED ON THOSE VOLUME OF COMPLAINTS, I'M VERY SURPRISED THAT THEIR HASN'T BEEN A RECALL?  *TR",
        "vin": "4S3BH675727"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2008",
        "dateOfIncident": "01/02/2008",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214337,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2002 SUBARU LEGACY OUTBACK WAGON. LAST WINTER (2006-07) I STARTED TO DETECT AN INTENSE SMELL OF GASOLINE IN THE CABIN OF THE CAR WHEN THE TEMPERATURE DROPPED BELOW 30 DEGREES F. TOOK IT TO MY LOCAL REPAIR SHOP (NOT A DEALER) BUT THEY COULD NOT FIND A PROBLEM. THE SAME THING IS HAPPENING THIS WINTER (2007-08). I SCHEDULED TO BRING IT IN TO A LOCAL SUBARU DEALER BUT THEN THE TEMP ROSE ABOVE 30 DEGREES, SO THERE WAS NO POINT IN BRINGING IT IN SINCE THEY WOULD NOT EXPERIENCE THE PROBLEM. I AM NOW WAITING FOR THE WEATHER TO GET COLD AGAIN SO I CAN BRING IT IN FOR THEM TO CHECK. IN THE MEANTIME, I GOT ONLINE AND FOUND A NUMBER OF OTHER SUBARU OWNERS WHO ARE COMPLAINING ABOUT THE SAME PROBLEM. SOME OF THEM HAVE HAD THE PROBLEM CORRECTED, AND IT APPEARS TO BE A FUEL LINE LEAKAGE (O RINGS OR CLAMPS OR SOMETHING). THEY SEEM TO HAVE DETERMINED THAT GAS IS LEAKING INTO THE AREA UNDER THE HOOD. ONE OWNER DESCRIBED SEEING SPARKS. I AM CONCERNED ABOUT THE SAFETY OF DRIVING THE VEHICLE AND WONDERING 1) UNDER WHAT CIRCUMSTANCES A RECALL IS ISSUED, AND 2) UNDER WHAT CIRCUMSTANCES SUBARU WOULD BE HELD ACCOUNTABLE FOR COVERING THE COST FOR REPAIRS. ALSO WONDERING WHAT I SHOULD DO ABOUT TRANSPORTATION UNTIL THE PROBLEM IS CORRECTED, AS I USE THE CAR TO TRANSPORT MY CHILDREN AS WELL AS MYSELF AND DON'T WANT TO PUT US AT RISK OF INJURY.  *TR",
        "vin": "4S3BH675227"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2007",
        "dateOfIncident": "12/21/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10213022,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A SUBARU 2002 OUTBACK. THE FOLLOWING IS WHAT I PROVIDED TO THE DEALER IN THE  LAST VISIT. EARLIER THIS YEAR, BEFORE MY WARRANTY PERIOD HAD EXPIRED, I HAD ISSUES WITH LEAKING FUEL FROM THE FUEL LINES AT THE TOP OF THE ENGINE UNDER THE INTAKE MANIFOLD. I TIGHTENED THE CLAMPS ON THE FUEL LINE AND THE LEAK SEEMED TO STOP. THERE WERE ADDITIONAL SMELLS OF FUEL IN COLD WEATHER SO I BROUGHT MY CARE IN TO THE DEALERSHIP. THE TIGHTENED THE CLAMPS AND COULD NOT FIND ANY OTHER LEAKS AND SPAYED A WHITE LEAK DETECTOR ON THE FUEL LINES. I BROUGHT THE CAR IN A FEW WEEKS LATER AND NO ADDITIONAL LEAKS WERE PRESENT. AT THAT TIME, SINCE THE ISSUE ONLY SEEMED TO HAPPEN COLD WEATHER, IF THE ISSUE RETURNED I WAS TOLD TO RETURN TO THE DEALER. THE GAS SMELL RETURNED AND I WAS NOT ABLE TO ID THE SOURCE. HOWEVER, DURING HE COLD WEATHER LAST WEEK, I DISCOVERED IN COLD WEATHER SHORTLY AFTER STARTING THE CAR THAT THE SAME FUEL LINE CONNECTIONS UNDER THE INTAKE MANIFOLD WERE LEAKING FUEL AGAIN. AFTER I TIGHTENED THE CLAMPS, THE FUEL LEAK STOPPED.  SEVERAL CLAMPS WERE LOOSE ON OTHER PARTS OF THE FUEL LINES.  THIS IS THE SAME SCENARIO THAT TOOK PLACE IN FEBRUARY '07.    TO ELIMINATE ANY FUTURE LEAKS CAN I HAVE THE TSB 09-36-03 WORK COMPLETED ON THE FUEL LINES. THE ISSUE IN MY OUTBACK IS THE SAME AS THE ISSUE NOTED IN THE TSB.    HOW CAN I GET  THE SAFETY ISSUE ADDRESSED AND REPAIRED BY THE DEALER?  *TR",
        "vin": "4S3BH686X27"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/28/2007",
        "dateOfIncident": "09/23/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213105,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SUBARU OUTBACK.  THE CONTACT SMELLED A STRONG ODOR OF GASOLINE IN THE PASSENGER COMPARTMENT.  THE DEALER STATED THAT THE HEAD GASKET NEEDED TO BE REPLACED.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CONTACT FILED A FORMAL COMPLAINT WITH THE MANUFACTURER.  THE FAILURE MILEAGE WAS 96,000 AND CURRENT MILEAGE WAS 103,000.",
        "vin": "4S3BH806327"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/22/2007",
        "dateOfIncident": "10/07/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212552,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK REAR SEAT LATCH CLIPS NOT ACCESSIBLE TO USE CHILD SAFETY SEATS (6 POINT HARNESS SYSTEM)  CLIPS ARE TUCKED TOO FAR DOWN INTO SEATS.  NEED EXTENSION CLIP TO ACCESS. *TR",
        "vin": "4S3BH806727"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/13/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205586,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MAY OF 2007, MY 2002 SUBARU OUTBACK WITH 71,000 MILES FIRST BEGAN HAVING OVERHEATING ISSUES.  I TOOK IT STRAIGHT TO A SUBARU DEALER WHERE THEY UNPLUGGED A RADIATOR CAP AND ADDED SPECIAL COOLANT CONDITIONER.  3 MONTHS LATER, THE RANDOM OVERHEATING STARTED AGAIN.  I TOOK THE CAR BACK IMMEDIATELY TO THE DEALER.  THE RADIATOR CAP WAS REPLACED, BUT THIS DID NOT SOLVE THE OVERHEATING.  THEY REPLACED THE THERMOSTAT AND THIS DID NOT SOLVE THE PROBLEM.  FINALLY, THEY DISCOVERED IT WAS HEAD GASKET FAILURE WITH A WARPED HEAD.  THE CAR WAS AT THE DEALER FOR OVER A WEEK FOR THE HEAD GASKET REPAIR.  I CONTACTED SUBARU OF AMERICA WHO SAID HEAD GASKET FAILURE WAS COVERED BY AN EXTENDED WARRANTY FOR 98-2002 MODELS, HOWEVER, MY 2002 MODEL FELL OUTSIDE OF THE COVERED VIN #S SINCE IT WAS MANUFACTURED AFTER THE PROBLEM WAS CORRECTED (NOT ALL OF THE 2002 MODELS WERE COVERED IN THE EXTENDED WARRANTY).  THEREFORE, MY HEAD GASKET REPAIR WAS NOT COVERED BY SUBARU'S EXTENDED WARRANTY FOR THIS FREQUENT PROBLEM.  I GOT MY CAR BACK FROM THE DEALER AND ON THE WAY HOME IT OVERHEATED.  I TOOK IT BACK IMMEDIATELY TO THE DEALER WHERE THEY REASSEMBLED IT TO MAKE SURE IT WAS ASSEMBLED PROPERLY AND REPLACED THE RADIATOR AS WELL JUST TO BE SURE THAT WASN'T THE CAUSE OF THE CONTINUED OVERHEATING ISSUES.  THIS SEEMS TO BE A VERY COMMON REPAIR AMONG SUBARU OWNERS.  SUBARU DECIDED TO GRANT US A \"GOOD WILL WARRANTY\" TO COVER THE HEAD GASKETS WITH US PAYING A $300 DEDUCTIBLE AND THEY COVERED THE REST OF THE HEAD GASKET REPAIR (THEY DID NOT COVER THE RADIATOR, ETC - WE STILL PAYED AROUND $1,000 OUT OF POCKET FOR THE DEDUCTIBLE, RADIATOR, ETC).  I AM HAPPY THEY DID THIS FOR US, BUT IF OUR VIN FELL WITHIN THE EXTENDED WARRANTY, WE WOULD NOT HAVE HAD TO INCUR THESE OUT OF POCKET EXPENSES.  IT IS CLEAR SUBARU HAS A DEFECT IN THEIR HEAD GASKETS DURING CERTAIN YEARS, BUT IT SEEMS THEY NEED TO STAND BEHIND ALL THE CARS AFFECTED, NOT JUST SOME OF THEM.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2007",
        "dateOfIncident": "06/26/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194716,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PRESSED THE GAS PEDAL TO ACCELERATE AROUND A CORNER AND WHEN I EASED OFF THE GAS PEDAL IT REMAINED STUCK DOWN.  I PUT THE CAR IN NEUTRAL AND BRAKED SO I COULD PULL OVER.  I SHUT OFF THE CAR, AND WHEN I RESTARTED IT, THE ENGINE REVVED .  I HAD TO PUT MY FOOT UNDER THE GAS PEDAL AND LIFT IT UP TO RESOLVE THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/18/2007",
        "dateOfIncident": "04/15/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193599,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK STOPPED BLOWING COLD AIR FROM THE A/C. PEP BOYS CHARGED OVER $1,000 TO REPAIR. THERE WERE NO SUBARU DEALERS IN OUR CITY. WE ARE ELDERLY AND RETIRED. I WAS NEVER NOTIFIED BY SUBARU THAT THEY HAD A PROBLEM WITH LEAKAGE ON THE 2.5L ENGINE MODELS.  *AK",
        "vin": "4S3BH675X27"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/02/2007",
        "dateOfIncident": "04/14/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189581,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 SUBARU OUTBACK.  THE CURRENT AND FAILURE MILEAGE WERE 37,000.  WHILE THE VEHICLE WAS PARKED THE CONTACT TURNED THE IGNITION TO THE BATTERY POSITION TO USE THE WINDSHIELD WIPER, AND THE PASSENGER'S SIDE AIRBAG SUDDENLY DEPLOYED.  THE CONTACT TOOK THE VEHICLE TO THE DEALER, AND WAS TOLD THAT THEY DIDN'T KNOW WHAT THE FAILURE WAS. *AK  UPDATED 06/19/07 *TR",
        "vin": "4S3BH686726"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/03/2007",
        "dateOfIncident": "02/25/2007",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184128,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD WEATHER THE BRAKES  DO NOT FUNCTION WHEN THE CAR IS FIRST TURNED ON.  THIS IS TERRIFYING.  THIS HAS HAPPENED SEVERAL TIMES AND BEEN CONFIRMED BY A SECOND DRIVER.  AFTER ABOUT A MINUTE THE BRAKES SEEM TO BE NORMAL.  WE ARE NOW AFRAID TO USE THE CAR.   *JB",
        "vin": "4S3BH806327"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/07/2006",
        "dateOfIncident": "11/07/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172846,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2002 SUBARU OUTBACK EDDIE BAUER EDITION HAS EXPERIENCED A CONSISTENT BRAKE FAILURE THE FIRST THING IN THE MORNING ON DAYS WHERE THE OUTSIDE TEMPERATURE IS AT OR BELOW 45 DEG F. THE FAILURE IS REPEATABLE AS FOLLOWS:    AFTER STARTING THE VEHICLE WITH FOOT ON THE BRAKE, THE CAR INITIALLY SEEMS OKAY WITH NORMAL BRAKE PEDAL FEEL (SOFT BUT NOT STIFF)  - IN ABOUT THE TIME IT TAKES TO PUT THE CAR INTO REVERSE THE BRAKE PETAL STOPS RESPONDING AND BECOMES VERY STIFF. ALSO, BRAKE ASSIST DISAPPEARS AND IT BECOMES VERY DIFFICULT (ALMOST IMPOSSIBLE) TO STOP THE VEHICLE, EVEN ON THE SLIGHT DOWNGRADE OF OUR DRIVEWAY.   - UNDER THE FORCE OF GRAVITY, IT IS POSSIBLE FOR THE CAR TO DRIFT BACKWARD INTO ONCOMING TRAFFIC, OR ANYTHING ELSE THAT HAPPENS TO BE LOCATED BEHIND THE CAR SUCH AS PEDESTRIANS AND TRASHCANS, FOR EXAMPLE. NO ACCIDENTS OR NEAR-MISSES HAVE OCCURRED AS OF THE TIME OF THIS WRITING, BUT THIS IS NOT TO SAY THAT THEY COULD NOT HAVE OCCURRED UNDER NORMAL VEHICLE USE AND TRAFFIC CONDITIONS IN OUR AREA.  THE CAR USUALLY COMES TO REST WITHIN 2 TO 3 SECONDS AFTER WHICH THE BRAKES SEEMS TO RECOVER TO NORMAL FUNCTION.   - GOOD FUNCTIONALITY SEEMS TO CONTINUE AS LONG AS THE CAR HAS NOT BEEN SITTING IN THE COLD AND/OR AS LONG AS THE ENGINE COMPARTMENT IS WARM.  THIS PROBLEM HAS BEEN BROUGHT UP TO TWO LOCAL SUBARU DEALERS WHO BOTH INDICATED THEY HAVE NEVER SEE THIS PROBLEM BEFORE. ALSO, ONE WAS ABLE TO REPLICATE THE PROBLEM. GIVEN THEIR EXPERT COMMENTARY AND PHYSICAL EVIDENCE IT IS SUSPECTED THAT THE CAR'S BEHAVIOR MIGHT CONSTITUTE AN EMERGING SAFETY FLAW TO THE VEHICLE'S BRAKING SYSTEM. SYSTEM WILL BE REPAIRED BY CONSUMER.  CONSUMER HAS CONTACTED SUBARU CUSTOMER SUPPORT REGARDING THIS MATTER. THEY INDICATED THAT THIS WAS NOT AN OFFICIALLY KNOWN ISSUE PER THE LIST OF NHTSA RECALL ACTIONS; HENCE, THEY TOOK NO ACTION TO REMEDY/INVESTIGATE THE PROBLEM. SEE SUBARU CASE #: 936244 FOR DETAILS.  SEE ALSO NHTSB COMPLAINT #: 10106583. *NM",
        "vin": "4S3BH806427"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/14/2006",
        "dateOfIncident": "10/14/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170819,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR MECHANIC FOUND OUR PROBLEM IS A CRACKED HEAD GASKET. MODEL-2002 OUTBACK SUBARU WAGON. WAS TOLD THESE MODELS WERE MADE WITH A THIN HEAD GASKET THAT CRACKS. TOLD TO CONTACT OUR SUBARU DEALERSHIP TO SEE ABOUT A RECALL. THE DEALERSHIP SAID, YES A RECALL ON HEAD GASKETS BUT VIN # HAS TO END WITH  PROPER 7 LAST DIGITS. OURS, OF COURSE, DID NOT HAVE THE NUMBER THEY WOULD COVER. WAS TOLD THE SERVICE DEPT. HAS BEEN REPLACING THE HEAD GASKETS IN THESE MODELS-AND SUBARU HAS BEEN PAYING 1/2. THIS IS ACKNOWLEDGING THERE IS A PROBLEM WITH THE HEAD GASKETS WITH THAT STATEMENT. QUOTED COST OF $1350.00 AND SUBTRACT HALF. BRING CAR IN AND SUBARU WOULD BE CALLED BUT NONE HAS BEEN REFUSED FOR 1/2 THE COST COVERED. CALLED OUR MECHANIC. HE LAUGHED AND SAID- TAKING US FOR A RIDE AS THE PRICE IS JACKED UP SO IT APPEARS SUBARU IS PAYING 1/2 BUT THE CONSUMER IS REALLY PAYING THE FULL COST. OUR TWO YEAR OLD SON, WITH MEDICAL PROBLEMS, HAS BEEN SICK IN THE CAR FROM THE FUMES. AS ANTIFREEZE IS LEAKING FROM THE HEAD GASKET AND  SEEPING INTO THE CAR THRU THE HEATING VENTS. IT IS NOT FAIR THAT WE HAVE A 2002 SUBARU OUTBACK WITH A CRACKED HEAD GASKET AND OTHER CARS OF THIS SAME YEAR/MAKE/MODEL ARE HAVING THE HEAD GASKET REPLACED AS THEIR VIN # MEETS THE LAST 7 DIGITS. WE HAVE THE SAME ENGINE/MAKE/MODEL AND PROBLEM AS THESE OTHER CONSUMERS BUT WE ARE HAVING TO ABSORB THE COST. WE HAVE TO GET THE CAR FIXED AS OUR YOUNG SON DOES NOT NEED TO INHALE THIS STRONG ODOR WITH HIS PRESENT HEALTH. OUR MECHANIC SAID THE HEAD GASKETS IN THESE  SUBARU OUTBACKS ARE TOO THIN AND CRACK. THIS IS A DEFECTIVE PART AND IS NOT OUR FAULT. IT IS NOT FAIR THAT OTHER OWNERS OF THE OUTBACK HAVE  A CERTAIN VIN # ARE HAVING THEIRS REPLACED WHEN THEY HAVE THE SAME ENGINE AND PROBLEM AS WE DO. THIS IS AN ADDITION TO CONFIRMATION # 10170783-MY HUSBAND SENT.",
        "vin": "4S3BH665327"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/13/2006",
        "dateOfIncident": "10/13/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170783,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAD GASKET, TOO THIN, ON OUR 2002 OUTBACK SUBARU AND CRACKED. FULL RECALLS HAVE BEEN GIVEN TO OWNERS OF OUTBACK MODELS FROM 2000-2002 FOR CRACKED HEAD GASKETS. VERY STRONG ANTI-FREEZE FUMES ARE SEEPING INTO THE INTERIOR OF THE CAR. WE HAVE 2 TODDLERS BREATHING IN THESE FUMES-1 HAVING HEALTH PROBLEMS! CALLED DEALERSHIP. YES, IS A RECALL BUT OUR VIN NUMBERS NOT ON THE LIST. WAS INFORMED MANY OF THESE MODELS ARE COMING IN FOR HEAD GASKETS TO BE REPLACED. SERVICE DEPT. SAID SUBARU IS PAYING 1/2 THE COST FOR THE VIN NUMBERS NOT ON THE LIST. SUBARU, THEREFORE, IS ACKNOWLEDGING THERE IS A PROBLEM OR THEY WOULD NOT BE PAYING 1/2 THE COST OF REPAIR. IT IS NOT FAIR THAT CERTAIN VIN NUMBERS TO THE SUBARU OUTBACKS ARE HAVING A TOTAL RECALL FOR A DEFECTIVE HEAD GASKET AND THE REST ARE RECEIVING 1/2 OF THE COST TO HAVE IT REPAIRED. OUR HEAD GASKET SHOULD BE RECALLED AND CORRECTED THE SAME AS OTHER OWNERS OF THE 2000-2002 SUBARU OUTBACKS. TOLD IT WILL COST $1350.00 TO FIX THE CAR AND 1/2 FROM SUBARU WILL MAKE THE COST $675.00. CLEARLY THERE IS A PROBLEM WITH THE HEAD GASKETS ON THESE MODELS. THIS CAR IS AFFECTING OUR ONE CHILD'S HEALTH WORSE SO WE HAVE TO GET IT FIXED. THIS SHOULD BE REPLACED TOTALLY BY SUBARU AS THEY RECALLED OUTBACK WAGONS NO MATTER WHAT THE VIN NUMBERS. THIS IS A HAZARD TO OUR SON'S HEALTH AND WE ARE NOT BEING TREATED EQUALLY WITH OTHER OWNERS OF OUTBACKS THAT HAVE HAD THEIRS REPLACED AT NO COST TO THEM. WE SHOULD NOT HAVE TO ABSORB THE COST OF A PART THAT IS RECALLED ON SOME WHEN CLEARLY MANY OTHERS ARE HAVING THE SAME PROBLEM.     *NM",
        "vin": "4S3BH665327"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/10/2006",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170417,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERYTIME IT RAINS OR GO THROUGH A CAR WASH THE SEAT BELT GETS WET AND IS WORSE WHEN THE SEAT BELT HAS BEEN RETRACTED AS THE WET AREA NOW IS ALL ACROSS YOU. IT APPARENTLY IS MAKING ITS WAY THROUGH THE SUNROOF. WHAT IS THE REPAIR FOR THIS, NEW SEALS IN THE SUNROOF OR THE ROOF RACK MOUNTING HOLES?  *JB",
        "vin": "4S3BH806727"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/14/2006",
        "dateOfIncident": "09/09/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168282,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RETURNING FROM A OUT OF TOWN TRIP, WE GOT TO OUR CAR AND STARTED TO DRIVE AWAY AND THE ENGINE REVVED UP BUT DID NOT PROPORTIONATELY INCREASE IN SPEED.  AFTER GAINING SOME SPEED THE SYMPTOMS DISAPPEARED.  THREE DAYS LATER AFTER SHIFTING FROM FIFTH GEAR TO FOURTH GEAR WHILE DRIVING UP A HILL ON I-70 THE CLUTCH COMPLETELY SLIPPED OUT. THE CAR WAS UN-DRIVABLE BUT WE WERE IN THE LEFT LANE AND THERE WAS NO EMERGENCY PULL OFF ON THAT SIDE SO WE HAD TO MAKE OUR WAY ACROSS THREE LANES OF TRAFFIC TO GET TO THE RIGHT EMERGENCY LANE.  WITH NO POWER WE COASTED THROUGH CARS FLYING BY HONKING AT 65 MPH. LUCKILY WE MADE IT TO THE SIDE OF THE ROAD UNHARMED BUT QUITE A FEW CLOSE CALLS.  WE SMELT THE SMELL OF A BURNT CLUTCH AND COULD NO LONGER ENGAGE THE TRANSMISSION OR MOVE THE VEHICLE, IT WOULD ONLY COAST BACKWARDS.  WHILE WE WERE LUCKY SOME OTHER MAY NOT. SUBARU OF AMERICA HAS REFUSED TO ADMIT ANYTHING IS WRONG WITH THE CAR OTHER THAN A WEARABLE ITEM WEARING OUT.  THIS CAR HAS 77,200 MILES ON IT AND HAS HAD THE CLUTCH REPLACED ONCE BEFORE AT 34,500 MILES UNDER TSB 03-51-02R.  WE HAVE OWNED FIVE CARS WITH MANUAL TRANSMISSIONS ALL OF WHICH WE DROVE FOR OVER 130,000 MILES AND NOT ONE HAS NEEDED OR HAD A CLUTCH REPLACED. AN EMPLOYEE AT THE DEALERSHIP IN THE PARTS DEPARTMENT STATED TO ANOTHER EMPLOYEE WHILE I WAS ON THE PHONE LINE THAT THE \"FLYWHEEL IS MAKING THOSE GO OUT SO THEY WILL NEED TO REPLACE THAT TOO.\"   *JB",
        "vin": "4S3BH675626"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/27/2006",
        "dateOfIncident": "05/14/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158438,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST STARTED CAR AND PULLED UP TO STOP LIGHT AND HIT BREAK PEDAL.  ALL OF A SUDDEN THERE WAS A SUDDEN ACCELERATION AND THE CAR STARTED FORWARD AND I HAD TO LEAN ON THE BREAK VERY HARD TO STOP.  THIS OCCURRED 2 TIMES BOTH AFTER STARTING THE CAR AFTER AT LEAST A 1 HOUR OFF TIME. I THOUGHT AT FIRST IT WAS MY FOOT ON BOTH PEDALS BUT THE SECOND TIME I STOPPED THE CAR WITH MY LEFT FOOT AND WAS NOWHERE NEAR THE ACCELERATOR.  I CONTACTED SUBARU BUT THEY DENIED ANY PROBLEM.  I PUT IF OFF UNTIL I SAW AN ARTICLE IN ST LOUIS POST DISPATCH  TO LETTERS TO TOM AND RAY MAGLIOZZI THE CAR GUYS AND THE LETTER WAS FROM ANOTHER SUBARU OUTBACK OWNER WITH THE SAME PROBLEM.  *NM",
        "vin": "4S3BH686126"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/19/2006",
        "dateOfIncident": "04/05/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157900,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT HEADLIGHTS ARE NOT WORKING.  I REPLACED THE HEADLIGHT BUT THAT DID NOT FIX THE PROBLEM.  THERE IS NO WARNING LIGHT TO SHOW THE LIGHTS ARE OUT.  THIS CREATES A DANGEROUS DRIVING SITUATION THAT BOTH FRONT LIGHTS ARE OUT BUT IT SEEMS TO BE DUE TO ELECTRICAL OR ANOTHER PROBLEM.  I HAVE NOTICED MANY OUTBACKS WITH ONE LIGHT OUT FOR THE SAME MODEL YEARS.  IT SEEMS TO BE A SYSTEMIC PROBLEM UNRELATED TO THE BULBS.  *JB",
        "vin": "4S3BH675527"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/19/2006",
        "dateOfIncident": "11/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155706,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK (NOT SURE WHICH ENGINE) - NOTICED COOLANT SMELL AROUND NOVEMBER 2005; WAS TOLD BY THE DEALER THAT THE HEAD GASKET WAS LEAKING - THEY COULD EITHER ADD A GASKET \"CONDITIONER\"'' TREATMENT\" - OR I COULD GO WITH THE REPLACEMENT GASKET FOR ~$3000 OR SO. THIS WAS NOT LONG AFTER MY 60K SERVICE, WHEREIN NOTHING HAD BEEN FOUND WRONG.     I ALSO NOTED FUEL SMELLS, WHICH THEY NOTED MIGHT REQUIRE NEW FUEL LINE AND FUEL RAIL(?) TO THE TUNE OF ANOTHER ~$650 OR SO.     I ASKED ABOUT RECALLS, AND THEY HEMMED AND HAWED - THEY FINALLY TOLD ME THAT THERE WAS A RECALL ON EARLIER SERIES ENGINES, BUT THAT MINE WAS OUTSIDE THE RECALL GROUP.     I'VE SINCE FOUND HUNDREDS, MAYBE THOUSANDS OF SIMILAR COMPLAINTS BY OWNERS OF LATE-MODEL SUBARUS.  SOME GET THE REPLACEMENT, BUT THE CAR NEVER RUNS THE SAME AFTERWARDS.  MANY ONLY GET A REPLACEMENT OUT OF SUBARU AFTER GOING TO THE DISTRICT OR EVEN NATIONAL LEVEL AT SUBARU OF AMERICA.  *JB",
        "vin": "4S3BH675827"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/11/2006",
        "dateOfIncident": "02/11/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150038,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 69,013 MILES, THE DRIVER SIDE HEAD GASKET IS LEAKING COOLANT. WE FIRST NOTICED THE PROBLEM DUE TO THE ODOR.  *NM",
        "vin": "4S3BH675727"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/29/2006",
        "dateOfIncident": "01/23/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148918,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "5 DAYS AFTER  HEAD GASKET WAS REPLACED I WAS DRIVING AND CAME TO A STOP LIGHT.  AS THE LIGHT TURNED GREEN AND I PRESSED ON THE ACCELERATOR THE CAR DID NOT MOVE.  THEN ALL OF A SUDDEN THE CAR STARTED TO MOVE BUT VERY SLUGGISHLY.  AS I DROVE HOME I ALMOST HAD A COUPLE OF ACCIDENTS DUE TO THE NON RESPONSIVE CAR.  CURRENTLY IT IS AT A SHOP, AND I AM BEING TOLD THAT THE TRANSMISSION HAS FAILED.*AK",
        "vin": "4S3BH675327"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/29/2006",
        "dateOfIncident": "01/15/2006",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148917,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE ROAD IN 2002 SUBARU OUTBACK SMELT BURNING COOLANT.  THEN , STARTED SEEING A LOT OF SMOKE FROM THE DRIVER SIDE ENGINE HOOD AREA.  PULLED OVER AND FOUND THAT THE COOLANT WAS EMPTY IN THE TANK.  REFILLED WITH FRESH COOLANT AND CONTINUED DOWN THE ROAD BACK HOME.  CAR  WAS SMOKING ALL THE WAY BACK.  TOOK IT TO A SHOP, AND FOUND THAT THE ENGINE HEAD GASKET HAD BLOWN.  MECHANIC REPLACED THE HEAD GASKETS AND MACHINED HEADS.  COST $1700.*AK",
        "vin": "4S3BH675327"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/07/2005",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145347,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK VISIBILITY IS POOR WHEN IT RAINS.  *TS  THE CONSUMER STATED HE CAN'T SEE OUT OF THE WINDSHIELD ON THE DRIVERS SIDE. THERE ARE LINES IN THE WINDSHIELD AND THE WINDSHIELD WIPERS WOULD FREEZE WHEN THE WEATHER WAS COLD. *JB",
        "vin": "4S3BH675727"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "09/06/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135429,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKE ROTORS ON MY 2002 OUTBACK 3.0 WAGON  HAVE WARPED CAUSING SEVERE SHIMMY WHEN BRAKING AT HIGH SPEED. THEY WERE REPLACED AT ABOUT 30,000, AND THIS HAS HAPPENED AGAIN. MY OPINION AS A SCIENTIST IS THAT THE ROTORS ARE UNDER-ENGINEERED FOR THE SIZE/WEIGHT OF THE VEHICLE, AND THAT THIS IS A SAFETY ISSUE IN THAT CONTROL OF THE VEHICLE IS COMPRISED AT HIGH SPEED.  MORE SPECIFICALLY, THE ROTORS DISTORT WITH A NORMAL AMOUNT OF BRAKING HEAT, AND THEN RETURN FLAT WHEN COMPLETELY COOLED, INDICATING DEFECTIVE METALLURGY IN THEIR COMPOSITION. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/06/2005",
        "dateOfIncident": "10/08/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135487,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PISTON SLAP IN 2.5 ENGINE.  *NM",
        "vin": "4S3BH665X27"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/14/2005",
        "dateOfIncident": "03/17/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128768,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 SUBARU OUTBACK WAGON, MANUAL TRANSMISSION. I'M HAVING TERRIBLE CLUTCH CHATTER GOING INTO 1ST AND 2ND GEAR. THIS HAPPENS DAILY, USUALLY FOR THE FIRST 10 MINUTES OF DRIVING IT. THE PROBLEM IS ENHANCED WHEN IT IS WET OR COLD.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/15/2005",
        "dateOfIncident": "06/02/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125447,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK WAGON HAS 48,000 MILES. CAR STALLS AT RED LIGHTS, SPUTTERS AND HESITATES WHEN TRYING TO ACCELERATE FROM A STOP. DANGEROUS TRYING TO GET ON HIGHWAY. DEALER TESTED ALL SYSTEMS AND SAID NOTHING WAS WRONG WITH THE CAR. INDEPENDENT MECHANIC TESTED IT AND SAID MAIN COMPUTER NOT WORKING PROPERLY. CHECK ENGINE LIGHT NEVER CAME ON. MECHANIC RESET COMPUTER BUT SUGGESTED I GET RID OF THE CAR ASAP",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/02/2005",
        "dateOfIncident": "04/05/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119382,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUDDERS AND STALLS CONTINUALLY WHEN STARTING IN 1ST GEAR, MORE FREQUENTLY WHEN COLD.  HAVE STALLED IN MIDDLE OF INTERECTION MULTIPLE TIMES.  THIS IS A MANUAL TRANSMISSION.  I HAVE DRIVEN MANUALS FOR 20 YEARS HAVE HAD NEVER HAD THIS PROBLEM WITH OTHER VEHILCLES.  THIS HAS BEEN HAPPENING SINCE I PURCHASED CAR 6 MONTHS AGO.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/11/2005",
        "dateOfIncident": "03/11/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117722,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED SUDDEN ACCELERATION. OWNER WAS PULLING INTO A SCHOOL PARKING LOT WHEN SUDDENLY THE VEHICLE BEGAN TO ACCELERATE. THE ENGINE REVVED,  AND THE DRIVER HAD BOTH FEET ON THE BRAKE WHILE THE VEHICLE CONTINUED TO ACCELERATE. DRIVER PUT THE VEHICLE IN NEUTRAL, AND ALLOWED THE VEHICLE TO COAST BEFORE IT SHUT DOWN.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/20/2005",
        "dateOfIncident": "12/03/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107604,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGEROUS HESITATION IN FIRST AND SECOND GEARS ESPECIALLY.  AT STOP LIGHT, UPON ATTEMPTING TO ACCELERATE, CAR BOGGED DOWN, RPMS DIPPED AND NEARLY STALLED BEFORE CAR FINALLY ACCELERATED WITH A VIOLENT JERK FORWARD AND BACK. HAS HAPPENED ON NUMEROUS OCCASIONS. VERY DANGEROUS-NEARLY BEEN IN THREE ACCIDENTS ALREADY. SO FAR THE DEALER HAS BLED THE CLUTCH, ADJUSTED THE CLUTCH, REPLACED THE CLUTCH, REPLACED KNOCK SENSOR, REPLACED COOLANT TEMP SENSOR AND REPLACED FRONT OXYGEN SENSOR AND PROBLEM STILL AS BAD AS EVER IF NOT WORSE.  *JB",
        "vin": "4S3BH665326"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/19/2005",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111018,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS TAKEN TO THE DEALER FOR A CLUTCH ADJUSTMENT.  THE TECHNICIAN INFORMED THAT CONSUMER THAT THE CLUTCH NEEDED TO BE REPLACED.  *NM  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/18/2005",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106583,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK, LL BEAN EDITION.  BRAKES HAVE FAILED TO WORK ON SEVERAL DIFFERENT OCCASIONS WHEN OUTSIDE TEMPERATURE IS LESS THAN APPROX. 28 DEG F.  THIS IS USUALLY FIRST THING IN THE MORNING WHEN LEAVING FOR WORK.  CAR IS PARKED ON DRIVEWAY WITH A SLIGHT DOWNGRADE TO THE STREET, AND CAR HAS DRIFTED INTO DRIVEWAY ACROSS THE STREET BEFORE COMING TO A STOP.  BRAKES ARE USUALLY FINE AFTER SEVERAL MINUTES OF DRIVING.   *NM",
        "vin": "4S3BH806927"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/27/2004",
        "dateOfIncident": "12/20/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104558,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL SMELL INSIDE AND OUTSIDE OF CABIN.  DEALER HAS EXAMINED THE VEHICLE AND CANNOT DETERMINE CAUSE, INSISTS NOTHING IS WRONG WITH THE CAR.*AK",
        "vin": "4S3BH675427"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/29/2004",
        "dateOfIncident": "02/12/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101726,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WINDSHIELD HAD TO BE REPLACED FOR THE FORTH TIME DUE TO PECK IN THE WINDOW THAT DEVELOPED INTO A CRACK.  DEALER WAS NOTIFIED.*AK",
        "vin": "4S3BH675027"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/08/2004",
        "dateOfIncident": "10/31/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099563,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TWO FRONT TIRES NEED REPLACEMENT BECAUSE THEIR INSIDES WERE WORN. 20,000 MILES LATER THE TWO FRONT AND ONE RIGHT REAR TIRES HAD TO BE REPLACED BECAUSE OF THE SAME REASON. *AK",
        "vin": "4S3BH686727"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/27/2004",
        "dateOfIncident": "09/25/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093177,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE  BEGAN TO IDLE ROUGHLY QUITE A FEW MONTHS PRIOR (DEALER UNABLE TO DETECT ANY PROBLEM), SUBSEQUENTLY EXPERIENCED HESITATION FROM STOP; PROGRESSED TO FLUCTUATING IDLE SPEED FROM 750 TO 500 RPM WITH SELF CORRECTION TO 750 AFTER CAR HAD BEEN DRIVEN AND FULLY WARMED UP WHICH PROGRESSED TO EPISODE OF HESITATION WHILE DRIVING UP HILL WITH NEAR ENGINE STALL. THEREAFTER HAD A FEW EPISODES OF ENGINE SURGING WHILE STOPPING IN DRIVE, WHICH DID NOT STOP WHEN PUT INTO EITHER NEUTRAL OR PARK (DEALER UNABLE TO DIAGNOSE ANY PROBLEM, DID SOFTWARE REPLACED BUT PROBLEM CONTINUED TO DEGENERATE). ENGINE STALLED WHEN IT CAME TO STOP THEN WHEN RESTARTED CONTINUED TO HAVE SURGING AS ABOVE DESCRIBED. ENGINE WOULD HAVE HESITATION AND NEAR STALL ALSO DURING REGULAR OPERATION ON HIGHWAY EVEN AT CRUISING SPEEDS FROM 20 MPH TO 65 MPH. DEALER CURRENTLY ATTEMPTING TO DIAGNOSE PROBLEM AGAIN.*AK",
        "vin": "4S3BH665627"
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10076081,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION FLUID LEAKS FROM THE ENGINE.  AS A RESULT, THE VEHICLE STALLS WITHOUT WARNING.  THE TRANSMISSION WAS REPLACED TWICE, HOWEVER THE PROBLEM RECURRED.  *AK   THE LEFT DOOR PANEL BY THE WINDOW REGULATOR DRIVER WINDOW WAS NOT WORKING, THERE WAS NOISE WHEN THE DRIVER PRESSED THE GAS PEDAL IN THE GEAR, AND A GAS SMELL WAS PRESENT WHEN THE VEHICLE WAS ACCELERATED.   *SC",
        "vin": "4S3BH675227"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/22/2004",
        "dateOfIncident": "01/31/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10088344,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 SUBARU OUTBACK SPORT (BASED ON THE IMPREZZA) DISPLAYS THE SAME PROBLEM WITH THE ABS SYSTEM BEING INEFFECTIVE WHEN BRAKING OVER BUMPS AS THE 2002, 2003 WRXS CURRENTLY BEING INVESTIGATED BY ODI (PE03-029).  THIS PROBLEM IS NOT JUST LIMITED TO THE WRX VEHICLE.  THE PROBLEM IS CLEARLY DEMONSTRATED UNDER LIGHT TO MODERATE BRAKING EFFORT, IF THE VEHICLE ENCOUNTERS A SHARP BUMP (E.G. A RAISED PAVEMENT SECTION AT AN EXPANSION JOINT) WHILE THE BRAKES ARE APPLIED.  NORMAL ABS FUNCTION WOULD MOMENTARILY EASE UP THE BRAKING PRESSURE ON THE FRONT WHEELS AS THEY BECOME UN-WEIGHTED ON THE BACK SIDE OF THE BUMP, SO THAT THEY DO NOT LOCK-UP.  AFTER THE FRONT WHEELS ARE FULLY WEIGHTED AGAIN THE ABS SYSTEM WOULD ALLOW THE PREVIOUS BRAKING EFFORT TO BE RE-ESTABLISHED ALLOWING THE CAR TO STOP ALMOST NORMALLY.  THUS THE BRAKING DISTANCE OF THE VEHICLE MIGHT BE EXTENDED BY THE LENGTH OF THE BUMP (PERHAPS 6 INCHES).  THIS CORRECT BEHAVIOR IS EXHIBITED BY MY 1994 PROBE GT.  IF I DRIVE MY SUBARU OVER THE SAME ROAD CONDITIONS, WHEN THE VEHICLE HITS A SHARP BUMP, THE ABS SYSTEM START FUNCTIONING AND CONTINUES FOR A SIGNIFICANT PERIOD OF TIME, EVEN AFTER PASSING OVER THE BUMP.  THIS, IN ITSELF, SHOULD NOT BE A PROBLEM, BUT DURING THIS TIME THE BRAKING EFFICIENCY IS DRASTICALLY REDUCED.  THIS TYPICALLY EXTENDS THE STOPPING DISTANCE OF THE SUBARU BY 10-30 FEET (WHEN STOPPING FROM 30MPH) OVER WHAT WOULD HAVE BEEN ACHIEVED IF THE BUMP HAD NOT OCCURRED.  IF I IMMEDIATELY RELEASE THE BRAKE PEDDLE, AND THEN FULLY APPLY THE BRAKES THE CAR DOES STOP.  SO THIS PROBLEM IS NOT ASSOCIATED WITH THE TIRE\u0019S ABILITY TO GRIP THE ROAD, OR THE BRAKE\u0019S ABILITY TO STOP THE ROTOR/DRUM.  I BELIEVE IT TO BE A PROGRAMMING ERROR IN THE ECU.    THIS PROBLEM IS REPEATABLE AND FULLY DEMONSTRABLE.  I WOULD BE HAPPY TO SUPPLY FURTHER DETAILS TO HELP GET THIS ISSUE RESOLVED.   *JB",
        "vin": "JF1GG68582G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/19/2004",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082203,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU WAGON MANUAL TRANSMISSION CLUTCH SHUDDERS ON COLD START. SOMETIMES IT IS DIFFICULT TO GET THROUGH AN INTERSECTION. THE DEALER COULD NOT DUPLICATE THE PROBLEM SO IT WAS NOT REPAIRED. THE PROBLEM PERSISTS.    *JB",
        "vin": "4S3BH665926"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/15/2004",
        "dateOfIncident": "07/15/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082039,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEALERSHIP  REPLACED AT THE FRONT ROTORS AND PADS AT 9000 MILES. AT 17,000 MILES THE  FRONT ROTORS AND PADS WERE REPLACED AGAIN, DUE TO  CORROSION. *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/14/2004",
        "dateOfIncident": "06/21/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081025,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON THE EVENING OF 21 JUN 04 I WAS DRIVING HOME FROM WORK.  AS I MADE A RIGHT HAND TURN IN TO MY DRIVEWAY.  I FELT AND THEN HEARD WHAT SEEMED TO TO A FLAT TIRE ON THE RIGHT (PASSENAGER) SIDE OF THE CAR.  I HAD FILLED UP WITH GAS ON EITHER THE PREVIOUS FRIDAY OR SATURDAY.  WHEN I FILL UP WITH GAS I CHECK MY OIL AND TIRE PRESSURE.  ALL WAS OK.      WHEN I GOT INTO MY GARAGE, I WENT AROUND TO THE RIGHT SIDE OF THE CAR AND CLEARLY SAW A FLAT RIGHT REAR TIRE.  I CALLED AAA TO PUT ON A SPARE.  THE AAA REPAIR MAN THOUGHT THE TIRE LOOKED DEFECTIVE.    THE NEXT MORNING I WENT TO NTW AND REPLACED THE FLAT TIRE AND A SECOND TIRE WITH NEW MICHELIN TIRES.  THE MANAGER AT THE NTW IN ROCKVILLE INDICATED THAT THIS WAS THE SECOND TIRE HE HAD SEEN THAT WEEK WITH THE SAME DEFECT.  BECAUSE I ONLY HAD 19,600 MILES ON THE TIRES, HE GAVE ME A DISCOUNT ON EACH TIRE.  HE ALSO AGREED THAT THE FLAT TIRE LOOKED DEFECTIVE.    THEY CHECKED MY REMAINING TWO TIRES FOR ANY WEAKNESS.  *AK",
        "vin": "4S3BH686627"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/06/2004",
        "dateOfIncident": "03/17/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075862,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TRYING TO OPEN THE REAR RIGHT DOOR THE REAR DOOR WOULD NOT OPEN FROM THE OUTSIDE. CONSUMER TOOK THE VEHICLE TO THE DEALER ON THREE SEPARATE OCCASIONS.  HOWEVER, THE PROBLEM  RECURRED. *AK   WIND NOISE WAS EVIDENT DRIVER'S SIDE MIRROR WHILE DRIVING VEHICLE.  *LA",
        "vin": "4S3BH675727"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/09/2004",
        "dateOfIncident": "05/05/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068526,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SEAT BELT IS EASILY UNSNAPPED. THE THUMB RELEASE BUTTON IS VERY SENSITIVE, THEREFORE IF MY ARM/ELBOW TOUCHES IT, THE LATCH WILL RELEASE. THE ACTUAL RELEASE IS DESIGNED SO THAT THE RELEASE BUTTON IS SLIGHTLY ELEVATED MAKING THIS POSSIBLE. ON MY 1994 LEGACY, THE BUTTON IS LEVEL OR SLIGHTLY RECESSED. THE SEATBELT HAS RELEASED SEVERAL TIMES UNDER NORMAL DRIVING CONDITIONS. IT SEEMS IN A ROLL-OVER, SOMETHING IS GOING TO HIT THIS BUTTON, WITH THE POSSIBILITY OF RELEASE.  THANK YOU,  BOB.  *AK",
        "vin": "4S3BH675327"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/01/2004",
        "dateOfIncident": "03/31/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064357,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HESITATES ON ACCELERATION, MAINLY IN 1ST AND 2ND GEAR.  CAN BE SEVERE ENOUGH THAT CAR PRACTICALLY STALLS IN INTERSECTIONS.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": true,
        "dateComplaintFiled": "03/23/2004",
        "dateOfIncident": "03/22/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10063724,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK WAGON REPEATEDLY AND UNEXPECTEDLY STALLS WHILE DRIVING.  HAS BEEN ONGOING FOR NEARLY 2 YEARS.  HAS BEEN EXAMINED ON MULTIPLE OCCASSIONS (AT LEAST 4) AT RYE FORD SUBARU IN RYE NEW YORK WITH THE ONGOING RESULT THAT THE DEALERSHIP CLAIMS TO HAVE NO KNOWLEDGE OF THE PROBLEM AND UNABLE TO REPLICATE.  CAR WAS DELIVERED BACK TO DEALERSHIP ON A FLATBED AFTER STALLING 5 OR 6 TIMES IN MAIN THOROUGHFARE THAT RESULTED IN BEING REAR ENDED BY A TRUCK BEHIND ME.  I HAVE REPEATEDLY INFORMED THE DEALER AND CONTACTED SUBARU OF AMERICA THAT I BELIEVE THIS IS A DEATH TRAP WAITING TO HAPPEN. I WAS NEARLY KILLED BY A NARROW MISS WHEN THE CAR STALLED ABRUBTLY IN A SNOW STORM.  THIS IS A VERY VERY DANGEROUS CONDITION AND THE CARS SHOULD BE RECALLED BEFORE PEOPLE ARE KILLED.    *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/21/2004",
        "dateOfIncident": "11/28/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062737,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES,  COMPLETE BRAKE JOBS (ROTORS AND PADS REPLACEMENT) AT LOW MILEAGE.   *JB",
        "vin": "4S3BH665726"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2004",
        "dateOfIncident": "03/15/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062203,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE OWNED A 2002 SUBARU OUTBACK STATION WAGON SINCE AUGUST 2002, AND HAVE EXPERIENCED A VERY FREQUENT (DAILY TO WEEKLY) BUT INCONSISTENT HESITATION AND SHUDDER WHILE ACCELERATING FROM A STOP.  IT OCCURS IN 1ST AND 2ND GEAR, AND IS PRONOUNCED IN COLD STARTS ONLY.  THE HESITATION AND CLUTCH SHUDDER ALSO IS PRONOUNCED IN STOP AND GO TRAFFIC, IN FIRST OR SECOND GEAR - IN THIS SITUATION, THE CAR LUNGES OR LURCHES FORWARD UNTIL THE SPEED INCREASES TO OVER 10 OR 15 MPH.  THIS CAUSES A SAFETY CONCERN AT LOW SPEEDS, AND THE START OF ACCELERATION FROM A STOP.  HAVE TAKEN IT TO THE SUBARU DEALER ON SEVERAL OCCASIONS, BUT THEY HAVE NOT BEEN ABLE TO FIX THE PROBLEM.  THE PROBLEM APPEARS TO BE QUITE PROMINENT IN OTHER SUBARU OUBACKS AND OTHER MODELS (BASED ON OTHER NHTSA COMPLAINTS, AND POSTINGS ON THE WWW.UTLIMATESUBARU.NET (SEARCH FOR SHUDDER OR HESITATION AND YOU CAN FIND HUNDREDS OF SIMILAR COMPLAINTS).  A TROUBLE FILE HAS BEEN SET UP WITH SUBARU AMERICA.   HOWEVER, THE PROBLEM CONTINUES TO PERSIST.*AK",
        "vin": "4S3BH675926"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": "01/03/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053390,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT LOWER SPEEDS  THE CLUTCH  INTERMITTENTLY SHUDDERED  WHEN PULLING  OUT FROM A STOP.   THE VEHICLE HAS BEEN TO TWO DEALERS BUT NEITHER DEALER COULD RESOLVE THE PROBLEM.  *AK   *NM",
        "vin": "4S3BH675026"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/20/2004",
        "dateOfIncident": "01/09/2004",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054533,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE NEW, THE CLUTCH ON THIS VEHICLE HAS SLIPPED WHEN STARTING FROM A STOP.  IT ALSO OCCASIONALLY SLIPS WHEN SHIFTING BETWEEN 1ST AND 2ND GEAR.  THIS PROBLEM CAUSES THE VEHICLE TO BE DIFFICULT TO START SLOWLY IN TRAFFIC AND WILL EVENTUALLY WEAR DOWN PARTS UNTIL THE CLUTCH AND TRANSMISSION NEED TO BE REPLACED.  THIS IS A KNOWN PROBLEM WITH THIS VEHICLE BUT SUBARU OF AMERICA HAS NOT MADE ANY STEPS TO RECTIFY THE PROBLEM.  MY LOCAL DEALER CLAIMS THEY CANNOT REPRODUCE THE CLUTCH SLIP AND REFUSE TO FIX THE PROBLEM.*AK",
        "vin": "4S3BH665526"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/18/2003",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048173,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN COLD SEVERE WEATHER  BRAKES SHUTTER.  RECALL 02V079000 WAS ISSUED; HOWEVER, THIS VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO VIN.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/07/2003",
        "dateOfIncident": "10/07/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042485,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "KEY STUCK IN THE IGNITION  SWITCH COMPARTMENT. ALSO, HAD A PROBLEM WITH THE SHIFT GEAR POSITION INDICATOR.  DEALER URGED CONSUMER TO PUT A TOWEL AT THE WHEEL TO HIDE THE KEYS HOLDER. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/05/2003",
        "dateOfIncident": "08/29/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041270,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 LLBEAN OUTBACK ROTOR & BRAKE PROBLEMS.    8/29/02 7,681 MILES--VIBRATION WHEN APPLIED BRAKES--DEALER RESURFACED FRONT ROTORS.  12/30/02 12,464 MILES---VIBRATION WHEN APPLIED BRAKES & SCRATCHY NOISE WHEN APPLIED BRAKES.---DEALER RESURFACED FRONT ROTORS AND REPLACED FRONT BRAKES (NO PAD LEFT).  6/4/03 20,309--VIBRATION WHEN APPLIED BRAKES.  DEALER REPLACED FRONT ROTORS & FRONT BRAKES.  10/4/03 25,460--BROUGHT CAR IN FOR OIL CHANGE & DEALER INSPECTED BRAKES.  FRONT ROTORS AND BRAKES NEEDED TO BE RESURFACED.  DEALER RESURFACED.  *JB",
        "vin": "4S3BH806327"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/18/2003",
        "dateOfIncident": "09/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039099,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 SUBARU OUTBACK H6 AWD AUTOMATIC TRANSMISSION -- WARPED AND GLAZED FRONT ROTORS AT RELATIVELY LOW MILES (25,600), REQUIRING REPLACEMENT OF PADS AND TURNING OF ROTORS. -- DEALER INITIALLY CLAIMED WEAR AND TEAR ITEM, BUT AFTER REVIEWING SERVICE RECORD WITH SUBARU, OFFERED WARRANTY REPAIR.  I HAD FREQUENTLY COMPLAINED OF A SHIMMY WHILE DRIVING AND RECENTLY BEGAN EXPERIENCING A STEERING WHEEL SHIMMY WHILE BRAKING (SINCE LAST TIRE ROTATION).  THIS IS THE FIRST INDICATION FROM DEALER THAT THERE WAS ANY PROBLEM WITH THE BRAKES.  CAR MOSTLY DRIVEN ON HIGHWAY WITH INFREQUENT BRAKING.   *JB",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029417,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING PRESSURE TO THE BRAKE PEDAL, THE WHEEL WOULD GRIND AND MAKE A NOISE.  THE VEHICLE HAD BEEN TO THE DEALER SEVEN TIMES SINCE DECEMBER 2002, AND THE CAUSE OF THE PROBLEM HAD NOT BEEN DETERMINED.   *AK   THE NOISE APPEARED TO COME FROM THE RIGHT REAR WHEEL AND OCCURRED AFTER THE VEHICLE WAS WASHED.   *SCC    *JB",
        "vin": "4S3BH665127"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/15/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034053,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN APPLYING PRESSURE TO THE ACCELERATOR PEDAL VEHICLE WOULD JERK AND EXPERIENCE SUDDEN DECELERATION.  WHEN REMOVING PRESSURE FROM THE ACCELERATOR PEDAL THE VEHICLE STALLS.   DEALER INDICATES THIS IS NORMAL FOR THIS TYPE OF VEHICLE, AND THERE IS NO A REMEDY FOR THIS PROBLEM. *AK",
        "vin": "4S3BH675827"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/13/2003",
        "dateOfIncident": "08/12/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032732,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "EXPERIENCED VIBRATION WHEN APPLYING BRAKES.  DEALER RECUT ROTORS FRONT & REAR AT APPROXIMATELY 13,000 MI.  PROBLEM RECURRED AT APPROX 17,000 MILES.  DEALER RECUT FRONT ROTORS.*AK",
        "vin": "4S3BH806827"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/09/2003",
        "dateOfIncident": "07/09/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026849,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA# ON CERTAIN PASSENGER VEHICLES, THE BRAKE MASTER CYLINDERS MAY NOT FUNCTION PROPERLY IN AMBIENT TEMPERATURES BELOW FREEZING 32 DEGREES FAHRENHEIT AND LOWER. CONSUMER HAS THE SAME PROBLEM. HOWEVER THIS VEHICLE WAS NOT RECALLED DUE TO THE VIN.  *AK",
        "vin": "4S3BH665726"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020350,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKES WERE APPLIED, THERE WAS A VIBRATION. THE DEALER REPLACED THE DISC BRAKE.    *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/19/2003",
        "dateOfIncident": "05/13/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020050,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING THE PASSENGER SIDE REAR TIRE EXPERIENCED SIDEWALL SEPARATION (SIZE#P22560R16 PLEASE PROVIDE THE DOT#).  *NLM",
        "vin": "PLEASE PROV"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/01/2003",
        "dateOfIncident": "04/05/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016870,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LEAKS INTO CABIN THROUGH MOON ROOFS (I SUPPOSE). WATER POURS THROUGH SEAT BELT RECOIL IN ROOF OVER CARGO AREA.",
        "vin": "4S3BH896527"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/11/2003",
        "dateOfIncident": "03/23/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014275,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 SUBARU OUTBACK FROM OLDHAM'S SUBARU OF NICHOLASVILLE, KY IN FEBURARY 2003.  ON SAT. MARCH 22, 2003, I NOTICED THE CAR HESITATING DURING INITIAL ACCELERATION AFTER A STOP AND THEN WITH ACCELERATION AFTER SHIFTING INTO SECOND GEAR (MANUAL TRANSMISSION).  ON SUN., MARCH 23, 2003 THE PROBLEM BECAME MUCH MORE SEVERE.  THE CAR WOULD LURCH INTO INTERSECTIONS AFTER A STOP, AND THEN HESITATE.  THE CAR WOULD NOT MOVE AT ALL, THEN WOULD LURCH OUT OF THE INTERSECTION. THIS NEARLY CAUSED A VERY SERIOUS ACCIDENT, AND I HAD MY 2 YEAR OLD SON IN THE CAR.  I FINALLY DECIDED TO PULL TO THE SIDE OF THE ROAD AND CALL ROADSIDE ASSISTANCE.  THE CAR WAS TOWED TO THE DEALERSHIP, WHO DROVE THE CAR THE NEXT TWO DAYS FOR 7 MILES, THEN 6 MILES, AND SAID THAT THEY FOUND NO PROBLEMS.  I PICKED UP THE CAR AND DID NOT HAVE THE PROBLEM FOR A WEEK, BUT I AM NOW HAVING THE SAME HESITATION PROBLEMS WITH THE CAR.  IT IS CLEARLY UNSAFE TO DRIVE, AND I AM AFRAID TO DRIVE IT.  MY OWN INVESTIGATION INTO THE PROBLEM (WEB RESEARCH) REVEALS THAT MANY OTHER OWNERS OF SUBARU'S MADE IN THE LATE 90'S TO THE PRESENT HAVE HAD SIMILAR PROBLEMS, WITH NO HELP FROM THEIR LOCAL DEALERSHIPS.  I HOPE THAT THIS PROBLEM CAN BE INVESTIGATED AND ADDRESSED BEFORE PEOPLE ARE INJURED OR KILLED.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/26/2003",
        "dateOfIncident": "01/21/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10012503,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25 MPH ON A DIRT ROAD THE CONSUMERS VEHICLE BEGAN TO FISHTAIL.  WHEN THE CONSUMER APPLIED THE BRAKES THEY DID NOT STOP THE VEHICLE AND THE STEERING FAILED.  THE CONSUMER LOST CONTROL OF THE VEHICLE AND COLLIDED HEAD ON WITH A TREE.  NEITHER THE FRONT DRIVER NOR PASSENGER AIR BAGS DEPLOYED.  *NLM",
        "vin": "4S3DH665827"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/26/2003",
        "dateOfIncident": "01/21/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10012506,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25 MPH ON A DIRT ROAD THE CONSUMERS VEHICLE BEGAN TO FISHTAIL.  WHEN THE CONSUMER APPLIED THE BRAKES THEY DID NOT STOP THE VEHICLE AND THE STEERING FAILED.  THE CONSUMER LOST CONTROL OF THE VEHICLE AND COLLIDED HEAD ON WITH A TREE.  NEITHER THE FRONT DRIVER NOR PASSENGER AIR BAGS DEPLOYED.  *NLM",
        "vin": "4S3DH665827"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/26/2003",
        "dateOfIncident": "01/21/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10012508,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25 MPH ON A DIRT ROAD THE CONSUMERS VEHICLE BEGAN TO FISHTAIL.  WHEN THE CONSUMER APPLIED THE BRAKES THEY DID NOT STOP THE VEHICLE AND THE STEERING FAILED.  THE CONSUMER LOST CONTROL OF THE VEHICLE AND COLLIDED HEAD ON WITH A TREE.  NEITHER THE FRONT DRIVER NOR PASSENGER AIR BAGS DEPLOYED.  *NLM",
        "vin": "4S3DH665827"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/20/2003",
        "dateOfIncident": "01/26/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011453,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CONSUMER REMOVED THE CAR SEAT FROM THE VEHICLE, SHE NOTICE THE SEAT BELT WHICH WAS MOUNTED IN THE ROOF OF THE VEHICLE HAD CUT ACROSS HALF OF THE WIDTH OF THE BELT BY THE SEAT BELT HOUSING, WHICH CAUSED A TEAR, THE DEALER REPLACED THE SEAT BELT UNDER WARRANTY.    *TS   *JB",
        "vin": "4S3BH675427"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/19/2003",
        "dateOfIncident": "01/21/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10012066,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED TO FISH-TAIL, THE CONSUMER DEPRESSED THE BRAKES WITH FORCE AND DISCOVERED THE VEHICLE HAD NO BRAKES.   *JB *TS",
        "vin": "4S3BH665827"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/25/2003",
        "dateOfIncident": "02/25/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009276,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED SUDDEN ACCELERATION.*JB",
        "vin": "4S3BH675127"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/24/2003",
        "dateOfIncident": "02/18/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009124,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DEALER TOOK TOO LONG TO PEFORM RECALL #02V079000 REGARDING THE MASTER CYLINDER.*JB",
        "vin": "4S3BH686127"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/21/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10008998,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKE WAS APPLIED, THE VEHICLE EXPERIENCED EXTENDED STOPPING DISTANCE.*JB *TS",
        "vin": "JF1GG68572H"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2003",
        "dateOfIncident": "02/06/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006708,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA#02-V-282-000.  PLEASE PROVIDE FURTHER INFORMATION.        PH",
        "vin": "4S3BH675627"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/25/2003",
        "dateOfIncident": "01/14/2003",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003384,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS COMPLETELY STALLED TWICE WHILE DRIVING.  ENGINE STOPPED RUNNING WHILE DRIVING IN DOWNTOWN SEATTLE.",
        "vin": "4S3BH806127"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/16/2003",
        "dateOfIncident": "12/08/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004041,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MASTER CYLINDER HAS A BAD LEAKAGE, CAUSING  ENGINE TO LOCK.           PH...*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/01/2002",
        "dateOfIncident": "09/21/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 8019949,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATES THAT WHILE PULLING INTO A PARKING SPACE, THE VEHICLE WENT INTO FULL THROTTLE RESULTING IN A CRASH.  THE CAUSE IS UNKNOWN.  *NLM  *SCC",
        "vin": "4S3BH675827"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/30/2002",
        "dateOfIncident": "08/26/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019775,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING AT 35MPH AND NO WARNING THE VEHICLE WILL STALL AND IT WILL BE HARD FOR THE CONSUMER TO CONTROL THE VEHICLE. DEALER NOTIFIED.  NLM  THE CONSUMER IS EXPERIENCING THE FOLLOWING;  HESITATED(SEVERE) ON ACCELERATION (ESPECIALLY WHEN THE ENGINE IS COLD/EVEN AFTER WARMED UP), THERE'S A WIND NOISE COMING FROM THE ROOF/ROOF RACK-AND HAPPENS AT SPEEDS OVER 20 MPH/VERY NOISY, A CREAKING NOISE COMING FROM THE LEFT FRONT OF THE VEHICLE-MOSTLY WHEN MAKING TURNS, BACKING OUT OF THE DRIVEWAY(MAYBE THE STRUT), STALLING, AND WOULD SIT FOR1-2 HOURS, THEN WOULD START WITH DIFFICULTY, RUNS ROUGH FOR A FEW SECONDS, THEN IS FINE.  THE DEALER SUGGESTS THAT THE VEHICLE WAS RUNNING WITHIN THE SPECIFICATIONS.  (THERE HAVE BEEN NUMEROUS OCCURRENCES)  SCC",
        "vin": "JF1GG68542H"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/30/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567695,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A ELECTRICAL SHORT IN THE REAR HARNESS CAUSED THE TAIL LIGHTS NOT TO WORK ON MULTIPLE OCCASIONS WITHOUT WARNING.  NLM",
        "vin": "4S3BH806X27"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "09/25/2002",
        "dateOfIncident": "09/21/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767732,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH EMERGENCY BRAKE SET, CAR ROLLED INTO BRICK GATE POST AND INTO STREET, JUMPED CURB, DOOR PANEL BROKE OFF, DOOR DAMAGED.   NLM",
        "vin": "4S3BH665X26"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/24/2002",
        "dateOfIncident": "09/03/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8019289,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES  THE LOCATION OF THE SEAT BELT BUCKLE RECEPTACLE  IS SO LOW, THAT IT IS VERY DIFFCULT TO BUCKLE SEAT BELT INTO THE  RECEPTACLE .CONSUMER AFRAID THAT IN THE WINTER, THEY  WILL NOT BE ABLE TO BUCKLE UP, DUE TO MORE CLOTHING.CONTACTED DEALER.*JB",
        "vin": "JF1GG68532H"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/24/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767656,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WINDSHIELD WIPERS QUIT TOTALLY. WHEN I LOOKED IN THE VEHICLE MANUEL I FOUND THAT FAILURE OF THE WIPERS WAS NOT AN UNEXPECTED EVENT. MANUEL SAYS IT CAN HAPPEN IF WIPERS ARE RUN ON A DRY WINDSHIELD. THAT WAS NOT THE CASE WITH MY WIPERS; THEY HAD BEEN RUN FOR AN EXTENDED PERIOD OF TIME IN A DOWNPOUR. THE DEALER REPLACED THE WIPER MOTOR BUT AFTER RUNNING MY WIPERS AGAIN IN A DOWNPOUR I DETECTED A BURNT SMELL AND FIGURE IT'S ONLY A MATTER OF TIME UNTIL THE WIPER MOTOR GOES AGAIN. THIS IS A DANGEROUS SITUATION AT 70 MPH.",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2002",
        "dateOfIncident": "08/30/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018567,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BUG DEFLECTOR \"FLEW OFF\" WHILE DRIVING ON HIGHWAY AT APPROXIMATELY 75MPH.  CONSUMER CONCERNED THAT DEFLECTOR COULD HAVE CAUSED INJURY TO OTHER MOTORISTS.*AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/06/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766781,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE STALLS ON ACCELERATION FROM A STOP. AT TIMES THE ENGINE WILL DIE WHEN ACCELERATOR IS PRESSED. DEALER WAS CONTACTED AND VEHICLE TAKEN TO DEALER. DEALER STATES THAT THERE ARE NUMEROUS VEHICLES WHICH HAVE THE SAME PROBLEM. ALL OF THEM ARE 2002 MODELS. DEALER STATES THA TVEHICLE CANNON BE FIXED AT THIS TIME DUE TO A LACK OF KNOWLEDGE OF WHAT TO DO. THIS OCCURED THE FIRST WEEK OF AUGUST 2002. DEALER WAS CONTACTED ON SEPTEMBER 5, 2002 AND STATED THAT VEHICLE STILL COULD NOT BE REPAIRED DUE TO LACK OF KNOWLEDGE. DEALER STATED THAT THE ENGINEERS IN JAPAN WERE WORKING ON THE PROBLEM BUT IT WILL BE AT LEAST TWO MORE MONTHS BEFORE IT WOULD BE KNOWN WHAT IF ANYTHING COULD BE DONE.*AK",
        "vin": "4S3BH665927"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "08/30/2002",
        "dateOfIncident": "08/11/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8017700,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE VEHICLE WAS STILL IN PARK IT WILL SLOWLY START TO ROLL BACK IN REVERSE, CAUSING AN ACCIDENT. DEALER NOTIFIED.*AK",
        "vin": "PLEASE PROV"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567032,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONCE WARMED UP, THE VECHICLE IDLES VERY LOW AT 300-400 RPM'S AND STALLS OUT.  *MJ",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/08/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567032,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE IS PLACED IN EITHER DRIVE OR REVERSE IT SUDDENLY ACCELERATES. THE BRAKES HAVE TO BE PRESSED TO REGAIN SOME CONTROL OF THE VEHICLE.  *MJ",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/05/2002",
        "dateOfIncident": "05/19/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8011097,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRIDGESTONE, ORIGINAL EQUIPMENT, MOUNTED ON A 2002, SUBARU, OUTBACK, 2628 MILES. TIRES HAVE BLOWNOUT TWICE WITHIN FIRST WEEK ON RIGHT REAR, AND OTHER TIRES ON  LEFT FRONT. CONTACTED DEALER, AND THE DEALER WAS NOT WILLING TO DO ANYTHING.*AK  DOT# UNKNOWN.  *TT",
        "vin": "4S3BH665127"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/22/2002",
        "dateOfIncident": "03/22/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8006262,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON  HIGHWAY  CONSUMER  HIT A POTHOLE  AND LEFT FRONT FIRESTONE TIRE  AND WHEEL CAME OFF.*AK",
        "vin": "4S3BH806327"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/25/2002",
        "dateOfIncident": "10/30/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758617,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MANUAL TRANSMISSION ON THIS VEHICLE SKIPS OR SHUDDERS IN 1ST GEAR MAKING IT DIFFICULT TO PULL FORWARD OR INTO TRAFFIC AT SLOW SPEEDS WITHOUT STALLING THE CAR.   THE ONLY OPTION IS TO REV THE ENGINE HIGHER THAN NORMALLY TO INSURE CLUTCH ENGAGEMENT WHICH THEN CAUSE THE CLUTCH TO  BURN.  SOMETIMES EVEN THIS DOESN'T WORK. IT HAPPENS MORE OFTEN WHEN THE CAR IS COLD.  DEALER SAID IT COULD NOT BE DUPLICATED SO IT MUST BE OUR DRIVING, HOWEVER I HAVE BEEN DRIVING MANUALS FOR 20 YEARS AND THIS HAS NEVER BEEN A PROBLEM.  THIS IS A SCARY CAR TO PULL OUT INTO HEAVY OR FAST MOVING TRAFFIC.*AK",
        "vin": "4S3BH686826"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/15/2002",
        "dateOfIncident": "02/15/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004152,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR LIGHTS WILL NOT COME ON AT ALL.*AK",
        "vin": "4S3BH686X26"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/14/2002",
        "dateOfIncident": "12/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758215,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE REPORTED THE PROBLEM TO DEALER, BEEN TO SUBARU DEALER 3 TIMES WHO CAN'T DUPLICATE THE PROBLEM, HOWEVER THE PROBLEM KEEPS RECURRING TO ME. FEEL IT IS EITHER MASTER CYLINDER OR ABS, GIVEN LOW MILEAGEA AND AGE OF CAR. POOR BRAKE DESIGN IF COMPUTER CANNOT PICK UP THIS FAULT. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/11/2002",
        "dateOfIncident": "12/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8003911,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  WAS TRAVELING ON  HIGHWAY, AND WHILE APPROACHING A STOP SIGN SHE APPLIED BRAKES, BUT PEDAL WENT ALL THE WAY DOWN TO THE FLOOR, AND  VEHICLE SLID.*AK",
        "vin": "4S3BH665276"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/10/2002",
        "dateOfIncident": "12/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758050,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER HAS NOT WORKED PROPERLY SINCE BOUGHT THE CAR. HAVE COMPLAINED SEVERAL TIMES TO 3 DIFFERENT DEALERS AND THEY ALL STATE IT IS PERFORMING \"NORMALLY\". THE A/C ONLY BLOWS COLD AIR CONSISTENTLY IN THE COLDEST AIR SETTING, IF YOU MOVE THE DIAL UP PAST THE LOWEST SETTING, WHILE STILL IN BLUE \"ZONE\" YOU WILL START GETTING WARM AIR. I THINK THERE IS A TBS ON IT, BUT THAT HAS NEVER BEEN COMMUNICATED TO ME BY EITHER DEALER NOR SUBARU.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/10/2002",
        "dateOfIncident": "02/07/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758052,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS THE SECOND TIME IN 2 MONTHS THAT THE BRAKES HAVE FAILED WHILE DRIVING AT LOW SPEED ON A WET, BUT TOTALLY ICE-FREE PAVED ROAD. HAVE TAKEN CAR TO BE REPAIRED AT SUBARU DEALER (2 DIFFERENT ONES) BUT BOTH TIMES WAS STATED HUNTER'S INVOICE THAT THEY COULD NOT DUPLICATE THE CUSTOMER'S (ME) CONCERN, SO NO ACTION WAS TAKEN TO FIX THE BRAKES. BRAKES DEFINITELY FEEL SPONGY WHEN BRAKING WHILE DRIVING FORWARD, BUT BRAKES FEEL GOOD AND SOLID WHEN GOING IN REVERSE. LAST FRIDAY, I TOOK MY CAR TO PRESTIGE, ON FEB 8TH TO ADDRESS THE SECOND TIME THE BRAKES HAVE FAILED. SERVICE MANAGER, DAVE LINDSEY SAID HE COULDN'T DUPLICATE THE BRAKES FAILING AGAIN AND SO WAS NOT GOING TO DO ANYTHING TO FIX MY BRAKES. I VOICED MY CONCERNED THAT I WAS VERY AFRAID FOR MY SAFETY WITH THESE WEIRD BRAKES AND HE EMPHATICALLY TOLD ME HE WOULDN'T FIX THE BRAKES UNTIL THE BRAKES FAILED AGAIN!!! WHEN I WENT INTO PRESTIGE'S SALESROOM TO GET A 800 NUMBER TO CONTACT SUBARU TO LET THEM KNOW MY BRAKES HAD INDEED FAILED AGAIN, DAVE LINDSEY MARCHED INTO SALES ROOM OF PRESTIGE SUBARU AND DEMANDED I LEAVE THE SUBARU PRESTIGE PREMISES AT ONCE. HE NEVER EVEN GAVE ME THE WORK ORDER/INVOICE SHOWING THAT HE HAD EVEN LOOKED AT MY CAR FOR THE FAILED BRAKES!!! I THINK THAT PRESTIGE SUBARU NEEDS TO BE INVESTIGATE. THERE IS A VERY STEEP HILL YOU HAVE TO GO DOWN IN ORDER TO EXIT THE PRESTIGE SUBARU PREMISES AND I WAS VERY CONCERNED ABOUT TRAVELING DOWN IT, AFTER HAVING NO WORK DONE ON MY BRAKES FOLLOWING MY BRAKE FAILURE ON FEBRUARY 7TH, 2002. *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/09/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785871,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  VEHICLES WINDSHIELD WASHER SQUIRTS WATER OVER THE HOOD INSTEAD OF ON THE WINDSHIELD.  *JG",
        "vin": "4S3BH665527"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "02/09/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785871,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLES AIR CONDITIONING HAS NEVER WORKED PROPERLY.  *JG",
        "vin": "4S3BH665527"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/09/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785871,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE VEHICLES REAR POWER WINDOWS NEED FIXING.  *JG",
        "vin": "4S3BH665527"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/09/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785871,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THE  HEADLIGHTS WERE AIMED TOO LOW AT TIME OF PURCHASE AND IS HAVING PROBLEMS SEEING THE ROAD.   *JG",
        "vin": "4S3BH665527"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/09/2002",
        "dateOfIncident": "12/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785871,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE BRAKES FAILED TWICE, HAD VEHICLE TAKEN TO THE DEALER, BUT COULD NOT DUPLICATE THE PROBLEM, BOTH TIMES WHEN BRAKES FAILED, THE PAVEMENT WAS DAMP BUT ABOVE FREEZING,  CONSUMER TREID TO STOP FOR A STOP SIGN AND COULD NOT.  *JG",
        "vin": "4S3BH665527"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/09/2002",
        "dateOfIncident": "12/05/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 785871,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE BRAKES FAILED TWICE, HAD VEHICLE TAKEN TO THE DEALER, BUT COULD NOT DUPLICATE THE PROBLEM, BOTH TIMES WHEN BRAKES FAILED, THE PAVEMENT WAS DAMP BUT ABOVE FREEZING,  CONSUMER TREID TO STOP FOR A STOP SIGN AND COULD NOT.  *JG",
        "vin": "4S3BH665527"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/06/2002",
        "dateOfIncident": "01/06/2002",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 756479,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MY VEHICLES BRAKES ARE DEPRESSED WITH UNEVEN SURFACE TRACTION ON THE LEFT OR RIGHT SIDE OF THE WHEELS, THE ABS SYSTEM DELAYS AND DOES NOT ENGAGE THE BRAKES FOR 1 TO 3 SECONDS.  THIS HAPPENED TODAY ON A SMOOTH SUBURBAN STREET WITH WATER CONTACTING ONLY THE RIGHT SIDE WHEELS.  WHEN I WENT TO BRAKE FOR AN UPCOMING STOP SIGN, THE BRAKES DID NOT ENGAGE AT ALL FOR APPROXIMATELY 2 SECONDS.  IT WAS EXTREMELY FRIGHTENING.  I AM REPORTING THIS BECAUSE IT SEEMS IT IS AN UNACKNOWLEDGED PROBLEM WITH A LOT OF THE MODEL YEAR 2002 SUBARU IMPREZZA WRX CARS.  THERE IS A DISCUSSION ON THIS ISSUE ON AN OWNERS CLUB BULLITEN BOARD CALLED THE I-CLUB (WWW.I-CLUB.COM).  I DID NOT BELIEVE IN THIS PROBLEM UNTIL IT HAPPENED TO ME TODAY FIRST HAND.*AK",
        "vin": "JF16G296X26"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/02/2001",
        "dateOfIncident": "08/12/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 751555,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "SUBARU",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS WHILES DRIVING AND DOES NOT IMMEDIATELY RESTART.  DEALER CAN NOT IDENTIFY PROBLEM WITH CAR.  THE CAR HAS STALLED REPEATEDLY, AT LEAST 3 TIMES IN OUR POSSESSION, AND SEVERAL TIMES WHILE IN THE DEALER'S POSSESSION.",
        "vin": "JF1GG29642G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/30/2001",
        "dateOfIncident": "08/20/2001",
        "fire": false,
        "manufacturer": "Subaru of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 895555,
        "products": [
            {
                "manufacturer": "Subaru of America, Inc.",
                "productMake": "SUBARU",
                "productModel": "OUTBACK",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN PARK WITH ENGINE RUNNING, EMERGENCY BRAKE NOT ENGAGED. AND IT SUDDENLY WENT FORWARD, ACROSS A FIELD, INTO TREES/ FLIPPED OVER ON ITS SIDE. DAMAGE TO VEHICLE  WAS $8500.00  NO INJURIES.*AK",
        "vin": "4S3BH665627"
    }
]