[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/05/2008",
        "dateOfIncident": "06/04/2008",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230012,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO BUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "MICHELIN",
                "productModel": "XRV",
                "productYear": "9999",
                "size": "235/80R22",
                "type": "Tire"
            }
        ],
        "summary": "ON MAY 19, 2008 WE PURCHASED 4 NEW  TIRES FROM GANIN TIRE IN MIDDLETOWN, NY FOR OUR MOTORHOME.  ON MAY 30 WE DROVE TO MASSACHUSETTS.  WHILE THE VEHICLE WAS PARKED, MY HUSBAND NOTICED CRACKS IN ONE OF THE TIRES.  UPON CHECKING WITH OUR TIRE INFORMATION BROCHURE THAT CAME WITH THE VEHICLE, MY HUSBAND DISCOVERED THAT THE TIRES MAY, IN FACT, BE 10 YEARS OLD, ALTHOUGH WE PURCHASED THEM 2 WEEKS AGO AND THE INVOICE ALSO NOTED THAT THEY WERE NEW.  WHILE WE WERE IN MASSACHUSETTS. MY HUSBAND CALLED MICHELIN AND THEY ALSO CONFIRMED THAT THE DOT NUMBERS INDICATED THAT THE TIRES WERE BUILT IN 1998.  AS WE WERE DRIVING TO GET BACK HOME TO GO BACK TO THE ORIGINATING DEALER FOR THE TIRES, THE BACK RIGHT TIRE BLEW OUT THE INNER SIDEWALL.  WE GOT OFF THE ROAD AND CALLED FOR ROADSIDE ASSISTANCE.  WE HAD TO PURCHASE ANOTHER TIRE WHICH WAS INSTALLED AT THE SIDE OF THE ROAD AND THEN WE DROVE TO THE NEAREST MICHELIN DEALER.  WE WERE TOLD THAT ALL TIRES WE DRY-ROTTEN, THE BELT IN THE TIRE THAT FAILED WAS RUSTED AND THE DEALER IN MASSACHUSETTS INDICATED THAT ALL TIRES WERE USED AS THE TREAD DEPTH INDICATED THAT THE TIRES WERE WORN WAY BEYOND 300 MILES (APPROX 11/32 TREAD-DEPTH AND MICHELIN INDICATED THAT NEW TREAD DEPTH IS 16.4/32).   WE REPLACED ALL TIRES AND WE KEPT ALL TIRES THAT WERE TAKEN OFF.  WE ARE ALSO CONTACTING MICHELIN MANAGEMENT.  PLEASE NOTE THAT THIS WAS NOT A FAILURE OF A MICHELIN TIRE, BUT A FAILURE OF THE DEALER BY SELLING OLD, USED TIRES AS NEW.  *TR",
        "vin": "4UZAAHAK42C"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2008",
        "dateOfIncident": "01/16/2008",
        "fire": false,
        "manufacturer": "Tiffin Motorhomes, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215429,
        "products": [
            {
                "manufacturer": "Tiffin Motorhomes, Inc.",
                "productMake": "TIFFIN",
                "productModel": "ALLEGRO BUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CUMMINS LSC SERIAL#46171810, DIESEL FUEL LIFT PUMP  2002 ALEGRO BUS RV  WEATHER COLD. FUEL LIFT PUMP LOST GASKET BETWEEN MOUNTING BRACKET AND PUMP, CAUSING FUEL TO DRAIN ONTO STARTER AND THEN GROUND. HAVE SEEN PROBLEM MANY TIMES IN PAST AS I'M A DIESEL MECHANIC. MOST ALWAYS IN COLD WEATHER. SAME PROBLEM EACH TIME,LOSS OF GASKET, PUMP STILL FUNCTIONING. FUEL LEAK ONTO STARTER IS ENOUGH TO CAUSE FEAR OF STARTER IGNITING FUEL. FIRE DANGER IS IN MY OPINION VERY HIGH! MY RV WAS PARKED IN DRIVE WITH NO APPARENT LEAK. \"KEY\" MUST BE IN \"ON\" POSITION TO RAISE LANDING GEAR,MOTOR NOT RUNNING. THE 5-10 MINUTES I TOOK TO RAISE THE LANDING GEAR, MOTOR WAS NOT STARTED, LEFT A PUDDLE ON MY DRIVEWAY OF ABOUT AN 18-24\" CIRCLE. I DO NOT KNOW THE QUANTITY OF DIESEL FUEL THAT WAS IN THIS CIRCLE, BUT I DO KNOW IF IT HAD CAUGHT FIRE MY RV WOULD HAVE BEEN A TOTAL LOSS BEFORE HELP COULD ARRIVE.  AGAIN, I'VE BEEN A MECHANIC FOR MANY YEARS AND HAVE SEEN THIS FAILURE NUMEROUS TIMES. THE REPLACEMENT PUMP IS SUPPLIED WITH THE MOUNTING BRACKET INSTALLED. NEW PUMP MUST NOT BE REMOVED FROM BRACKET AS THE GASKET WILL NOT \"SET IN\" TWICE. I PURCHASED THE FIRST ONE I REPLACED TWICE. PAID FOR IT TWICE AS WELL. CUMMINS DOES NOT GIVE ANY INSTRUCTIONS WITH THE NEW PUMP, NOR WILL THEY TAKE ONE BACK THAT HAS BEEN SEPARATED FROM IT'S BASE. CUMMINS IS VERY AWARE OF THIS PROBLEM, AS THEY HAVE SERVICE BULLETINS OUT FOR IT. THE WEB ALSO COMES UP WITH RESULTS FROM A SCHOOL BUS SITE DISCUSSING A RECALL. THIS RECALL LISTS RVS IN IT AS WELL. RECALL#05E-007  I DON'T EXPECT AN ANSWER TO THIS COMPLAINT, BUT WOULD LIKE SOME SORT OF ACKNOWLEDGEMENT IT WAS RECIEVED. I WILL BE \"GOING TO BAT\" WITH CUMMINS IN AMARILLO TEXAS ON MONDAY MORNING THE 21ST OF JANUARY 2008. I'M EXPECTING A HEATED DISCUSSION, AS I KNOW FIRST HAND THE COST AND DIFFICULTLY OF THIS REPAIR. ONE MORE TIME I'LL MAKE THIS REPAIR IN THE COLD AND WHERE THE TRUCK STOPPED.  LES DRUMMOND   *TR",
        "vin": "4UZAAHBS02C"
    }
]