[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "02/17/2022",
        "dateOfIncident": "07/21/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11452342,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "Anti-lock brake failure. Failing to pressurize.",
        "vin": "JT2BK18U420"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/03/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360482,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING SPEED LESS THAN 25MPH ON FAMILIAR SURFACE STREET WITH NEED TO STOP FOR A CAR ABOUT 75 FEET (ESTIMATE) IN FRONT; SHOULD HAVE BEEN AN EASY STOP; APPLIED BRAKES BUT CAR ACCELERATED (I THINK ONLY ELECTRIC MOTOR); FURTHER BRAKE PRESSURE DID NOT STOP THE CAR, CONTINUED TO ACCELERATE (ESTIMATE 30 MPH); FENDER BENDER CRASH OF DRIVER SIDE FRONT FENDER INTO PASSENGER REAR FENDER AND SIDE BUMPER. VERY FAMILIAR WITH CAR (19 YEARS DRIVING IT) AND VERY FAMILIAR STREET NEAR MY HOME; CONFUSION WAS NOT A FACTOR; NO AIRBAGS ON EITHER CAR ACTIVATED; I WAS ABLE TO STOP WHEN I WAS BEYOND THE STRUCK VEHICLE. I PLAN ON NOT DRIVING CAR FURTHER AND HAVE ASKED TOYOTA DEALER TO TAKE IT BACK FOR JUNK WITHOUT A DEFINITE REPLY SO FAR",
        "vin": "JT2BK18U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/22/2020",
        "dateOfIncident": "09/22/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11360535,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING UP AND DOWN A SLIGHT INCLINE, POWER STEERING SUDDENLY GOES OUT. ONLY HAPPENED TWICE SO FAR BUT I DON'T KNOW WHAT WOULD PREVENT IT FROM HAPPENING AGAIN. PROBABLY GOING ABOUT 15-20MPH UPHILL AND MAYBE 20-25MPH DOWNHILL. HAPPENED ON A CITY STREET.",
        "vin": "JT2BK18U320"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/02/2020",
        "dateOfIncident": "02/02/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11306536,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE HIGHWAY AND FELT A JERKING AT MY STEERING WHEEL A FEW MONTHS BACK, I THOUGHT OK MAYBE THE STEERING WHEEL LOOSE OR SOMETHING, I WAS GOING AROUND 65 MPH. FAST FORWARD TO TWO WEEKS AGO AND THE STEERING WHEEL COMPLETELY LOCKS UP ON ME DRIVING TO A DR APPOINTMENT I HAD TO GO TO. I WAS GOING AROUND 30 MPH IN TRAFFIC THE STEERING LOCKED UP AND THE TRIANGLE ILLUMINATED ON MY NAVIGATION SCREEN AND THE DREADED TROUBLE SIGN APPEARED. ONCE THIS APPEARED ON MY SCREEN THE STEERING WHEEL FELT LIKE IT HAD NO POWER STEERING. AT FIRST I THOUGHT, I NEED TO CHECK THE POWER STEERING FLUID, I RESEARCHED AND REALIZED THIS PRIUS IS COMPLETELY ELECTRIC POWER STEERING. SO I ARRIVED AT MY DOCTORS AND TURNED THE CAR OFF, WHEN I CAME BACK AND TURNED IT BACK ON TO MY AMAZEMENT THE LIGHT TURNED OFF AND THE POWER STEERING WAS BACK. THEN THE WEEK AFTER SAME PROBLEM HAPPENED, BUT I DIDN'T HAVE MY OBD 2 READER WITH ME, SO AGAIN I SHUT OFF THE CAR AND THE PROBLEM WENT AWAY. I STARTED TO DO RESEARCH AND REALIZED THIS IS A SERIOUS COMMON PROBLEM WITH THE ELECTRIC POWER STEERING, THE COMPUTER CHIP THAT CONTROLS THE STEERING MALFUNCTIONS AND NEEDS TO BE REPLACED, SO I CAME HERE TO CHECK IF ANY RECALLS ON MY VEHICLE AND THERE IS NOT. THE SAME PROBLEM HAPPENED AGAIN TODAY, THIS TIME MY GIRLFRIEND WAS DRIVING AND WAS GOING AROUND 45, SHE SAID SHE ALMOST CRASHED. THIS IS A SERIOUS SAFETY HAZARD AND TOYOTA APPEARS TO BE BEHIND THE EIGHT BALL IN THIS AS I HAVE READ NUMBEROUS FORUMS OF THIS MALFUNCTION, IT'S A WIDE SPREAD PROBLEM AND EXTREMELY COSTLY TO FIX. THIS PROBLEM SHOULDN'T FALL ONTO THE OWNERS AS IT IS THE MANUFACTURER'S FAULT FOR NOT DOING THEIR DUE DILIGENCE AND ADDRESSING THIS PROBLEM AT THE FACTORY BEFORE MASS PRODUCING AND SELLING TO CONSUMERS LIKE I.",
        "vin": "JT2BK12U920"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/25/2020",
        "dateOfIncident": "01/23/2020",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11301782,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHT LENSES COVERS REPEATEDLY CLOUDS OVER TO THE POINT I CAN HARDLY SEE THE ROADWAY AT NIGHT.  DEALER HAVE CLEANSE THE LENSES HOW HAS LAST FOR ABOUT A MONTH.  THE DEALER NOW SAYS THESE NEED TO BE REPLACE AT A COST TO ME FOR $750.  I BELIEVE THIS IS MANUFACTURE'S DEFECT AND IT IS A SERIOUS SAFETY ISSUE FOR A RECALL.  THE DEALER SHOULD DEVELOP A FIX AND REPLACE THESE LENSES WITHOUT CHARGING THE VEHICLE OWNER.",
        "vin": "JT2BK12U320"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/22/2019",
        "dateOfIncident": "11/15/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11281901,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY STEERING WHEEL STARTS SHAKING VIOLENTLY WHEN DRIVING UNDER 32 DEGREES OUTSIDE AND LOCKS UP THE ABILITY TO STEER WHICH CAN BE DEADLY ON THE HIGHWAY WHICH I DON'T DRIVE MUCH LUCKILY AND TOYOTA HAS NO OPEN RECALLS EVEN THOUGH I'M NOT THE ONLY ONE WITH THIS. I'VE HAS TO HURT MY HANDS WRESTLING WITH IT TO PULL OVER WHICH IS DANGEROUS ON SOME ROADS!!!! VERY DANGEROUS FAULT IN A CAR THIS IS THE 1 PART I RELY ON TO SAVE ME! CAN'T BELIEVE TOYOTA WON'T FIX IT!!! ALSO THIS HAPPENS A FEW TIMES EVERY WEEK THOUGH OUT THE ENTIRE WINTER! IT HAPPENS WHEN DRIVING ON WINDING ROAD AT 10-35 MPH AND SOMETIMES HAPPENS WHEN TURNING RIGHT OR LEFT! I NEED ADVICE!",
        "vin": "JT2BK18U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/20/2019",
        "dateOfIncident": "05/10/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208587,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT THE ELECTRIC POWER STEERING FAILED WITHOUT WARNING. ALSO, THE STEERING WHEEL VEERED TO THE RIGHT, WHICH CAUSED THE CONTACT TO DRIVE OVER A CURB. THE CONTACT TURNED OFF AND RESTARTED THE VEHICLE. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V304000 (STEERING); HOWEVER, THE VEHICLE EXHIBITED THE SAME FAILURE AS LISTED IN THE RECALL CAMPAIGN. THE DEALER (LARRY H. MILLER LIBERTY TOYOTA COLORADO SPRINGS, 5115 NEW CAR DR, COLORADO SPRINGS, CO 80923, (719) 419-5832) INDICATED THAT THE VEHICLE WAS EXCLUDED FROM A WARRANTY CAMPAIGN AND THE STEERING GEAR AND COMPUTER MAY NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND DID NOT ASSIST. THE FAILURE MILEAGE WAS NOT AVAILABLE. *AS",
        "vin": "JT2BK12U020"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/13/2019",
        "dateOfIncident": "05/12/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11207300,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE FREEWAY IN STOP AND GO TRAFFIC THE STEERING WHEEL STARTED TO OSCILLATE BACK AND FORTH IT SUBSIDED HOWEVER A FEW MIN LATER AS FREEWAY SPEEDS WERE APPROACHED THE WHEEL TRIED TURNING HARD LEFT THEN VIBRATED CENTER TO LEFT.  IF I HAD BEEN UNAWARE THIS WOULD HAVE RESULTED IN HITTING THE CENTER DIVIDER AT FREEWAY SPEEDS.  A BRIEF RESEARCH ONLINE SHOWS THIS IS NOT THE FIRST KNOWN ISSUE..  THIS WAS VERY SIMILAR TO:  HTTPS://WWW.YOUTUBE.COM/WATCH?V=RV-UL1PXJ1U   VERY DISTURBING SITUATION TO BE IN - AT FIRST THE PS WARNING INDICATOR CAME ON THEN SAID PROBLEM SOLVED ONLY TO HAPPEN AGAIN (LESS PULL THE 2ND TIME BUT STILL NOTICEABLE.)",
        "vin": "JT2BK18U730"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/14/2019",
        "dateOfIncident": "04/13/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11196121,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MAKING A TURN AT SLOW SPEEDS THERE IS VIOLENT BACK AND FORTH UNCONTROLLABLE MOVEMENT IN THE STEERING WHEEL. YOU HAVE TO BRING THE VEHICLE TO A STOP. THE PROBLEM IS YOUR IN THE MIDDLE OF A TURN OR INTERSECTION.VERY DANGEROUS,THERE ARE NO WARNINGS WHEN THIS OCCURS.",
        "vin": "JT2BK12U520"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/28/2018",
        "dateOfIncident": "09/28/2018",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132139,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING LOST OF STEERING MOMENTARILY FOR SEVERAL MONTHS BUT THOUGHT IT WAS BELT SLIPPAGE. TODAY (9/28/ 2018)  TOTAL LOST OF STEERING. WAS ABLE TO GET VEHICLE TO SIDE OF ROAD AND SHUTOFF IGNITION SWITCH. STARTED VEHICLE AGAIN AND HAD  NORMAL STEERING CONTROL AGAIN. AFTER REVIEWING RECALLS NOTICED THAT TOYOTA HAD TWO VOLUNTARY RECALLS ON SAME PROBLEM BUT HAVE NOW REMOVED THEM.  WHAT CAN BE DONE FOR THIS PROBLEM. (XXXX)    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).",
        "vin": "JT2BK18UX20"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/29/2017",
        "dateOfIncident": "12/25/2017",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11057469,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE'S STEERING WHEEL BEGINS TO VIBRATE OUT OF CONTROL WHEN ATTEMPTING TURNS. THIS VIOLENT SHAKING POSES SERIOUS DANGERS TO DRIVER WHILE MAKING TURNS, AND CAUSES DRIVER TO PULL OFF OF ROAD AND COMPLETELY TURN CAR OFF. PROBLEM NOTICEABLE FOR APPROXIMATELY 1 MONTH INTERMITTENTLY BEFORE PROBLEM BEGAN OCCURRING WITHOUT FAIL EVERY SINGLE TIME VEHICLE WAS DRIVEN. WHEN TAKEN TO TOYOTA DEALERSHIP IN BLOOMINGTON, IN, MECHANICS SAID ENTIRE RACK NEEDED REPLACING, ESTIMATING A TOTAL MUCH HIGHER THAN VALUE OF CAR ITSELF. NO RECALL FOUND FOR THIS PROBLEM, NO PAPERWORK PROVIDED TO CUSTOMER. ONCE CUSTOMER PAID FOR DIAGNOSTIC CHARGES AND TOOK VEHICLE BACK, POWER STEERING WARNING LIGHTS ARE PERMANENTLY ENABLED AND STEERING ASSIST IS COMPLETELY OFF, CAUSING TURNING TO CONTINUE TO POSE THREAT, ALTHOUGH STEERING WHEEL DOES NOT VIBRATE, YET.",
        "vin": "JT2BK12U520"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/18/2016",
        "dateOfIncident": "10/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917169,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HYBRID CIRCULATION PUMP FAILED. THREE WARNING LIGHTS CAME ON.",
        "vin": "JT2BK18U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "09/26/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909742,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE TOYOTA PRIUS 2002 I WAS DRIVING YESTERDAY THE STEERING HAD BEEN MAKING LIKE A RUBBER-SQUEAK NOISE WHEN TURNED TO THE RIGHT AT LOW SPEEDS.I WAS DRIVING, AND THE WHEEL STARTED TO SORT OF PULSE IN MY HANDS LIKE IT WAS GAINING/LOSING POWER ASSIST.ABOUT 10 MINUTES LATER, FAILED. BIG PS BUTTON ON DISPLAY, WITH THE RED TRIANGLE BY THE ODOMETER.  THIS MORNING I WAS DRIVING THE CAR WHEN ALMOST HATE  SOMEONE BECAUSE A LOST THE CONTROL OF THE CAR AND THE STEERING WAS  SHAKING.",
        "vin": "JT2BK18U120"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "04/22/2016",
        "dateOfIncident": "12/18/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860969,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DEC 18, 2015, DRIVING AT ABOUT 20 MPH ON A NEIGHBORHOOD STREET WHICH CURVED LEFT, THE STEERING WHEEL ON MY 2002 PRIUS BEGAN SHAKING VIOLENTLY. I LOST CONTROL OF THE CAR AND STRUCK A LARGE LANDSCAPING ROCK. THE CAR HAD $2233 IN DAMAGES TO THE RIGHT FRONT BUMPER, FENDER, WHEEL AND TIE ROD. THERE WERE NO INJURIES. AFTER REPAIR, THE MECHANIC COULD NOT REPLICATE THE SHAKING. PRIOR TO THE ACCIDENT, THE PRIUS ON RARE OCCASION HAD BRIEF EPISODES OF STEERING WHEEL SHAKING, ONLY WHILE BACKING OUT OF THE DRIVEWAY ON COLD MORNINGS. IN EARLY JAN 2016 THE STEERING VIBRATION OCCURRED AGAIN WHILE DRIVING ON NEIGHBORHOOD STREETS AND COULD BE STOPPED ONLY BY TURNING THE CAR OFF. WE CEASED DRIVING THE CAR.    I TALKED TO OUR TOYOTA DEALER AND WERE ADVISED THE PROBABLE CAUSE WAS A DEFECT IN THE ELECTRONIC POWER STEERING SYSTEM AND TO CONTACT TOYOTA. I COMMUNICATED BY PHONE, EMAIL AND LETTER WITH TOYOTA, PROVIDED A VIDEO OF THE SHAKING, AND REQUESTED REPLACEMENT OF THE POWER STEERING SYSTEM. I GOT A CASE NUMBER AND WAS SCHEDULED FOR AN INSPECTION BY TOYOTA AT THE DEALER. TOYOTA BY LETTER ON 3/22/16 STATED 'WE DID NOT FIND ANY EVIDENCE THAT THIS INCIDENT WAS THE RESULT OF ANY TYPE OF MANUFACTURING OR DESIGN DEFECT.' WHEN I PICKED UP THE VEHICLE, THE VIOLENT STEERING SHAKING OCCURRED IN THE DEALER'S PARKING LOT AND WAS WITNESSED BY THE TECHNICIANS.     THIS PROBLEM IS WELL KNOWN TO TOYOTA. IN 2011 WE RECEIVED BOTH A SAFETY RECALL NOTICE TO REPLACE THE EPS PINION NUTS AND A NOTICE OF WARRANTY EXTENSION UNTIL DEC 2013 FOR PROBLEMS RELATED TO UNUSUAL STEERING VIBRATION. WE HAD THE EPS PINION NUTS REPLACED ON 12/30/2011 UNDER THE SAFETY RECALL.    MANY 2002 PRIUS ARE STILL ON THE ROAD. AS EVIDENCED BY THE WARRANTY EXTENSION TOYOTA KNOWS ABOUT THE POWER SYSTEM FLAWS. MY EXPERIENCE SHOWS IS DANGEROUS TO DRIVE THE CAR WITH THESE FLAWS. I REQUEST THAT TOYOTA BE REQUIRED TO FIX THIS PROBLEM.",
        "vin": "JTBK18U6200"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/15/2016",
        "dateOfIncident": "02/17/2016",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10859763,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. WHILE DRIVING 55 MPH, THE STEERING WHEEL VIBRATED UNCONTROLLABLY AND THE POWER STEERING WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC TO BE DIAGNOSED. THE CONTACT WAS INFORMED THAT THE STEERING RACK NEEDED TO BE REPLACED. THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 00V285000 (STEERING). THE VEHICLE WAS NOT REPAIRED. THE FAILURE WAS INTERMITTENT. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 170,000.",
        "vin": "JT2BK12U820"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/16/2015",
        "dateOfIncident": "11/16/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10790663,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT THE STEERING WHEEL SHOOK IN VERY COLD WEATHER, BUT OPERATED NORMALLY ONCE THE VEHICLE WARMED UP. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 140,000.",
        "vin": "JT2BK18U420"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2015",
        "dateOfIncident": "03/30/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703517,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT WHEN MAKING TURNS OR REVERSING AT A SLOW SPEED, THE STEERING WHEEL WOULD SHAKE VIOLENTLY. THE VEHICLE WAS TAKEN TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 147,000.",
        "vin": "JT2BK18U220"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2015",
        "dateOfIncident": "03/09/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10694049,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. WHILE DRIVING APPROXIMATELY 40 MPH AND MAKING A LEFT TURN, THE STEERING WHEEL BECAME DIFFICULT TO TURN WITHOUT WARNING. THE FAILURE RECURRED ON SEVERAL OCCASIONS WHILE TURNING LEFT. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE RACK AND PINION FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 11V304000 (STEERING). THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 197,000.",
        "vin": "JT2BK18U720"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/06/2015",
        "dateOfIncident": "03/05/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10692550,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ONTO THE FREEWAY, TURNING RIGHT ONTO THE RAMP THAT CIRCLED INTO THE SOUTHBOUND INTERSTATE WHEN THE A RED HAZARD TRIANGLE POPPED UP AND THE SCREEN ON MY CAR STATED PS ERROR. THE STEERING WHEEL LOCKED FOR A BIT BUT FORTUNATELY I WAS STILL ABLE TO STEER. I GOT OFF ON THE NEXT EXIT AND WAS BARELY ABLE TO TURN. I TURNED OFF THE CAR AND LOOKED UP THE ERROR CODE TO FIND OUT IT WAS POWER STEERING, I CHECKED THE FLUIDS AND EVERYTHING WAS OK. TURNED ON THE CAR AND THE PS ERROR HAD DISAPPEARED, IT DROVE NORMALLY THE REST OF THE WAY HOME.   *TR",
        "vin": "JT2BK12U520"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/02/2015",
        "dateOfIncident": "01/02/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10669531,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IN COLD TEMPERATURE THE STEERING WHEEL WILL VIOLENTLY SHAKE WHEN MAKING A TURN AT SLOW SPEEDS.  *TR",
        "vin": "JT2BK12U720"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/11/2014",
        "dateOfIncident": "01/08/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654276,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN A MODEL 2002 TOYOTA PRIUS WITH LESS THAN 60000 MILES,  WHILE STARTING OUT FROM PARK GOING INTO REVERSE THE ELECTRIC POWER STEERING VIOLENTLY STARTED SHAKING AND PULLED THE STEERING WHEEL FROM THE DRIVERS HANDS. THIS CAUSED A TEMPORARY WARNING/CAUTION LIGHT THAT QUICKLY WENT OUT. AFTER THE INCIDENT THE PROBLEM BECAME MORE FREQUENT, HAPPENING WHILE DRIVING AT ANY SPEED AND WHILE STOPPED.  EVENTUALLY THE PROBLEM CAUSED THE STEERING ASSIST TO FAIL COMPLETELY. WHEN TOYOTA WAS CONTACTED, THEY KNEW ABOUT THE PROBLEM AND SAID THEY HAD RECALLS ON OTHER YEAR PRIUS MODELS FOR THE SAME ISSUE. THEY REPORTED THE GEAR RACK ELECTRONIC SENSOR FAILS AND THE RACK MUST BE REPLACED BUT UNFORTUNATELY THE 2002 WASN'T UNDER THE RECALL. WHEN ASKED WHY, NOBODY SEEMED TO KNOW.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/18/2014",
        "dateOfIncident": "09/18/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10637285,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MADE A LEFT TURN OUT OF MY DRIVEWAY AFTER STARTING VEHICLE. STEERING BEGAN TO VIOLENTLY SHUDDER AND SHAKE, CAUSING TEMPORARY LOSS OF CONTROL (MY GRIP WAS LOST ON THE WHEEL). I WAS ABLE TO GRAB THE WHEEL MORE FORCEFULLY AND REGAIN CONTROL AND  COMPLETE THE TURN.    HAD THIS HAPPENED ON AN INTERSTATE RAMP, I MAY NOT BE HERE TO FILE THIS COMPLAINT.    ACCORDING TO THE TOYOTA NATIONAL SERVICE REGISTRY, MY VEHICLE HAS ALREADY RECEIVED THE SERVICE COVERED UNDER NHTSA CAMPAIGN 11V304000    WHICH MAKES ME VERY, VERY VERY NERVOUS. PLEASE CONTACT ME FOR FURTHER DETAILS.  *TR",
        "vin": "JT2BK12U520"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/21/2014",
        "dateOfIncident": "01/14/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10573965,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT WITHOUT WARNING, THE STEERING SHOOK VIOLENTLY WHEN MAKING A TURN. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE STEERING RACK AND THE NUTS IN THE STEERING LINKAGE NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE VEHICLE WAS PREVIOUSLY SERVICED UNDER NHTSA CAMPAIGN NUMBER 11V304000 (STEERING). THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE AND CURRENT MILEAGE WAS 109,000.",
        "vin": "JT2BK12U120"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/23/2014",
        "dateOfIncident": "01/22/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10561265,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED ON CAR IN COLD WEATHER (UNDER 10DEGF).  STARTED UP AND TRIED TO TURN RIGHT.  STEERING WHEEL SHOOK VERY HARD, FAST, AND LOUDLY.  TURNED OFF CAR AND RESTARTED, DID OK FOR ONE SHALLOWER TURN.  50 FEET LATER AGAIN TRIED TO TURN RIGHT AND SAME THING HAPPENED.  LET IT SHAKE FOR A FEW SECONDS THEN TURNED OFF CAR AND RESTARTED.  LESS THAN A MINUTE AFTER RESTART IT HAPPENED AGAIN.  AFTER THAT LEFT CAR OFF FOR A FEW HOURS.  RESTARTED.  LET CAR WARM UP FOR 2-3 MINUTES BEFORE MOVING.  DROVE STRAIGHT OUT OF DRIVEWAY.  RIGHT TURN 100FT LATER WAS OK.  PROBLEM DID NOT RECUR ON 30MIN DRIVE.  THIS IS THE SECOND DAY I'VE HAD THIS PROBLEM.  THE FIRST WAS A FEW WEEKS AGO, ALSO IN VERY COLD WEATHER AND ALSO ON A RIGHT TURN WHEN CAR WAS FIRST STARTED.  SO FAR I HAVEN'T HAD IT HAPPEN ON A LEFT TURN, BUT MAYBE THAT'S JUST BECAUSE I DON'T DO ONE OF THOSE IMMEDIATELY ON STARTUP.  I'VE NEVER SEEN THE PROBLEM IF TEMPS ARE ABOVE ABOUT 10 DEGREES F.  *TR",
        "vin": "JT2BK18U320"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/13/2014",
        "dateOfIncident": "01/06/2014",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10559537,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG THE INTERSTATE I-75  RETURNING FROM EAST RIDGE, TN, AND THE POWER STEERING LIGHT AND WARNING LIT-UP ON THE SCREEN PANEL. THE STEERING WHEEL BECAME VERY RIGID WHILE I WAS DRIVING, AND I HAD TO CLASP THE STEERING WHEEL FIRMLY TO CONTROL THE STEERING OF THE VEHICLE.  *TR",
        "vin": "JT2BK18U720"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/01/2013",
        "dateOfIncident": "11/25/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10554286,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT SHAKING IN STEERING WHEEL UPON IGNITION; SPORADIC JERKY STEERING; REPEATED LOSS OF POWER STEERING AT VARIOUS SPEEDS INCLUDING HIGHWAY SPEEDS. THIS SEEMS TO THE SAME PHENOMENON THAT WAS THE SUBJECT OF A SAFETY RECALL OF 2001 PRIUSES. THE RECALL SHOULD BE BROADENED.  *TR",
        "vin": "JT2BK18U920"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/28/2013",
        "dateOfIncident": "10/23/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549793,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE ALWAYS HAD PROBLEMS WITH THE BRAKES ON THE PRIUS, BUT THE DEALER KEEPS TELLING ME THERE IS NOTHING WRONG WITH IT.  YET YOU FIRST HIT THE BRAKES ON THEY ARE OK, BUT IF YOU HAVE TO HIT THEM HARD - NO BRAKES...YET THE DEALER CAN'T FIND ANYTHING WRONG WITH IT.  \"THE COMPUTER DOESN'T SHOW ANYTHING WRONG\"  I GUESS I WILL HAVE TO KILL SOMEONE BEFORE I CAN GET THEM TO LISTEN AND FIX THE PROBLEM.  THE LAST 12 YEARS HAVE BEEN A NIGHTMARE......WHY CAN'T WE GET THEM TO RECALL THIS? I SEEN SO MANY PEOPLE YOU COMPLAIN ABOUT THE SAME THING YET NOTHING IS DONE?  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/24/2013",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10549318,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT THE VEHICLE WOULD SHAKE ABNORMALLY WHEN FIRST STARTED. THE VEHICLE WAS TAKEN TO THE DEALER AND SERVICED UNDER NHTSA CAMPAIGN NUMBER 11V304000 (STEERING), HOWEVER THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 100,000 AND THE CURRENT MILEAGE WAS 170,000.",
        "vin": "JT2BK18U120"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/05/2013",
        "dateOfIncident": "08/28/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10542178,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS EXITING OFF (TURNING) THE HIGHWAY IN EXIT 10 .270 MD, WHEN THE STEERING WHEEL BECAME  REALLY HARD AND A WARNING PS SIGNAL APPEARED, I HAD TO PULL OVER AND AFTER SWITCHING OFF THE ENGINE AND BACK ON. I CONTINUED DRIVING.*JB",
        "vin": "JT2BK18U320"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/06/2013",
        "dateOfIncident": "08/04/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10533835,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT WHILE PARKING, THE VEHICLE INDECENTLY ACCELERATED TO 115 MPH. THE CONTACT APPLIED THE BRAKES AND SHIFTED INTO NEUTRAL IN ORDER TO STOP THE VEHICLE. THE VEHICLE WAS TOWED TO THE DEALER HOWEVER, THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 106,000.",
        "vin": "JT2BK18U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/16/2013",
        "dateOfIncident": "07/12/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525124,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT WHILE ATTEMPTING A RIGHT TURN, THE POWER STEERING ASSIST FAILED AND THE STEERING WHEEL SEIZED. THE POWER STEERING WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AS THE FAILURE OCCURRED. THE CONTACT SPOKE WITH THE MANUFACTURER AND WAS TOLD THAT ENTIRE POWER STEERING AND MOTOR SYSTEM NEEDED TO BE REPLACED. THE VIN WAS NOT AVAILABLE. THE FAILURE AND THE CURRENT MILEAGES WERE 147,800.   *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/03/2013",
        "dateOfIncident": "04/02/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10505563,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT WHILE DRIVING VARIOUS SPEEDS, THE POWER STEERING ASSIST FAILED. THE VEHICLE WAS TAKEN TO THE DEALER, WHO INFORMED THE CONTACT THAT THE POWER STEERING RACK NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY SERVICED UNDER NHTSA CAMPAIGN ID NUMBER: 11V304000 (STEERING). THE MANUFACTURER WAS CONTACTED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "JT2BK12U320"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/20/2013",
        "dateOfIncident": "01/05/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10503828,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT IMMEDIATELY AFTER STARTING THE VEHICLE, THE STEERING WHEEL WOULD SHAKE VIOLENTLY. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN DIAGNOSED THAT THE RACK AND PINION WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE BUT DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NO LONGER UNDER WARRANTY. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 58,000 AND THE CURRENT MILEAGE WAS 68,000.  *TR  UPDATED 04/30/13*LJ  THE CONSUMER STATED WHEN SHE ATTEMPTED TO MAKE A TURN, THE STEERING WHEEL WOULD SHAKE VIOLENTLY.  THE DEALER STATED THE THE RACK AND PINION WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE CONSUMER WAS QUOTED A PRICE OF $ 3,000.",
        "vin": "JT2BK12U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "03/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501172,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VIOLENT SHAKING OF THE STEERING WHEEL WHILE STOPPED OR AT SLOW SPEEDS.  PARTICULARLY IN THE WINTER TIME, FIRST THING IN THE MORNING.  STOPPING THE VEHICLE AND SOMETIMES SHUTTING OFF AND BACK ON WILL ADDRESS THE ISSUE.  *TR",
        "vin": "JT2BK12U820"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/04/2013",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10501175,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DECELERATING AND DRIVING OVER SPEED BUMP/RAISED CROSS WALK, BRAKES FEEL LIKE THEY RELEASE AND THE CAR SURGES FORWARD.  HAS HAPPENED ON A REGULAR BASIS WHEN SIMILAR CONDITIONS EXIST (POT HOLES, OR ANYTHING THAT MIGHT CAUSE LOSS OF TRACTION ON 1 WHEEL).  DEALER INSISTS THAT THIS IS \"NORMAL\" FOR ANIT-LOCK BRAKES.  REALLY JUST A MATTER OF TIME BEFORE IT RESULTS IN REAR-ENDING SOMEONE DUE TO UNEXPECTED SURGE.  *TR",
        "vin": "JT2BK12U820"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/04/2013",
        "dateOfIncident": "08/05/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10491440,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA ISSUED A RECALL IN AUGUST 2011 ON GEN. 1 PRIUS FOR A STEERING ISSUE.  WE TOOK THE PRIUS INTO LOCAL DEALER AND THEY REPLACED STEERING NUTS PER RECALL.   WITHIN A WEEK AFTER RECALL FIX, WE NOTICED A VIOLENT SHAKE TO THE STEERING WHEEL DURING A COLD MORNING START.   IT HAD NEVER DONE THAT BEFORE THE RECALL.  WE TOOK THE CAR IN AFTER IT OCCURRED AGAIN AND WERE TOLD THAT OUR RACK AND PINION WAS WORE AND NEEDED TO BE REPLACED.   DURING THE RECALL WORK, THE DEALERSHIP DID A COMPLETE INSPECTION OF THE CAR AND NOTHING UNUSUAL WAS NOTED.   HOW DID THEY DO WORK ON A RACK AND PINION AND NOT NOTICE WEAR ON IT THEN?   WE BELIEVE WHEN THEY TORQUED THE NEW NUTS TO THE STEERING PINION, THIS CREATED UNDO STRESS ON THE TORQUE SENSOR AND IS WHY THE AFTERWORK SHAKING IS OCCURRING.   TOYOTA NEEDS TO COME CLEAN AND REPLACE THESE RACKS FREE OF CHARGE FOR POSSIBLE DAMAGE TO ALOT OF GEN. 1 PRIUS'S WHEN THEY DID THE NUT RECALL.    THERE IS MORE OF A SAFETY ISSUE NOW WITH THE VIOLENT STEERING WHEEL SHAKING OUT OF UNSUSPECTING DRIVERS THAN A NUT THAT'S GOING TO BREAK OFF.  NHTSA, FORCE THEM TO DO A RECALL NOW!!!!  *TR",
        "vin": "JT2BK18U920"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "12/04/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490854,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE VIBRATE THE STEERING WHEEL AT LOW SPEED. *TR",
        "vin": "JT2BK18U020"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/03/2013",
        "dateOfIncident": "12/04/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490855,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE HAS A PROBLEM WITH THE HYBRID BATTERY CAUSES A LOT OF PROBLEM IN MANY OF THE SYSTEMS, ENGINE, COMPUTER ETC  AND DON'T EVEN HAS A 100,000 MILES IT SUPPOSE TO HAVE A LONG LIFE , THE DEALER IS CHARGING BIG BUCKS IN ORDER TO FIX IT AND I DON'T SEE WHY IT GOES DAMAGE WITH SUCH A LOW MILES.  *TR",
        "vin": "JT2BK18U020"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/15/2012",
        "dateOfIncident": "10/27/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484748,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT THE STEERING SHAKE VIOLENTLY WHILE TURNING, REVERSING, OR IN DRIVE. THE STEERING HAD TO BE HELD WITH BOTH HANDS TO BE ABLE TO KEEP THE VEHICLE IN LANE.  THE STEERING WOULD STOP SHAKING WHENEVER THE ACCELERATOR PEDAL WAS RELEASED. THE MANUFACTURER ADVISED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 12V537000 (STEERING). THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 37,000.",
        "vin": "JT2BK12U620"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/06/2012",
        "dateOfIncident": "08/15/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478896,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING THE VEHICLE UNDER SPEED LIMIT WHEN MY STEERING WHEEL BECAME STIFF. I WAS DRIVING WHEN MY STEERING WHEEL BECAME STIFF AND AFTER FEW SECONDS I WAS AT A CURVE AND WAS NOT ABLE TO TURN LEFT AND WENT OFF THE  ROAD INTO A DITCH AND COLLIDING WITH AN OBJECT. THE CAR GOT HUGE DAMAGE AND WAS NOT DRIVABLE AND STILL IN MY YARD.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2012",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10451025,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ON THE FREEWAY, AFTER A 300 MILE DRIVE, A POTHOLE WAS STRUCK. THE STEERING WHEEL VIBRATED FORCEFULLY FROM SIDE TO SIDE FOR ABOUT A MINUTE, THEN POWER STEERING FAILED. STEERING WAS POSSIBLE, BUT ONLY WITH GREAT PHYSICAL EFFORT. AFTER THE VEHICLE RESTED OVERNIGHT, SYMPTOMS WERE NOT PRESENT. *TR",
        "vin": "JT2BK12U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "12/29/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443150,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TURNING LEFT INTO A PARKING SPOT WHEN THE STEERING SOUNDED AND ACTED ODD. THE PS LIGHT CAME ON.     I BROUGHT IT TO A TOYOTA DEALER AND HAD TO REPLACE THE POWER STEERING GEAR MECHANISM AT A COST OF OVER $2600.00. I WAS TOLD THE RECALL ON THIS WAS V.I.N. SPECIFIC AND DID NOT APPLY TO MINE. MY CONCERN IS IF THIS IS THE SAME ISSUE THAT IS ADDRESSED IN THE RECALL, AND MY CAR HAD THE ISSUE, WHY IS IT NOT TAKEN CARE OF BY THE COMPANY.  *TR",
        "vin": "JT2BK12U920"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/02/2011",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10438105,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON COLD DAYS, WHEN DRIVING FOR THE FIRST TIME, THE STEERING WHEEL WILL START SHUDDERING BACK AND FORTH VIOLENTLY AND RAPIDLY IF I TRY TO TURN THE VEHICLE. THIS OCCURS REGARDLESS OF THE ROAD CONDITION AT SPEEDS OF LESS THAN 10 MPH.      THE SHUDDERING STOPS ONLY WHEN I STRAIGHTEN OUT THE WHEEL.  *TR",
        "vin": "JT2BK12U220"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/15/2011",
        "dateOfIncident": "11/11/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10435707,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS.  THE CONTACT STATED THAT THERE WAS A MALFUNCTION IN THE POWER STEERING SYSTEM WHICH CAUSED THE STEERING WHEEL TO SEIZE WHILE DRIVING.  THE VEHICLE WAS TOWED TO THE DEALER WHO REPLACED THE ANGLE SENSOR.  THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 11V304000 (STEERING:ELECTRIC POWER ASSIST SYSTEM) PRIOR TO THE FAILURE. THE MANUFACTURER WAS NOTIFIED AND THE CONTACT FILED A COMPLAINT. THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED.  THE FAILURE AND THE CURRENT MILEAGE WAS 65,000. UPDATED 01/04/12*LJ  THE VEHICLE WAS TOWED TO THE DEALER WHO REINITIALIZED THE TORQUED ANGLE SENSOR.",
        "vin": "JT2BK18UX20"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL,STEERING",
        "crash": false,
        "dateComplaintFiled": "07/26/2011",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415148,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT STATED THAT UPON STARTING, THE VEHICLE JERKED FORWARD. IN ADDITION, WHILE ATTEMPTING TO STOP AT A STOP SIGN, THE CONTACT DEPRESSED THE BRAKE PEDAL BUT THE VEHICLE HESITATED TO STOP. THE FAILURE OCCURRED ON AN INTERMITTENT BASIS. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC AND AN AUTHORIZED DEALER FOR DIAGNOSTICS. THE TECHNICIANS WERE UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 33,000. .. UPDATED 09/15/11  *BF  THE CONSUMER STATED HE/SHE TOOK THE VEHICLE TO THE DEALER AUTO SHOP ON AUGUST 2, 2011 FOR THE REPLACEMENT OF THE ELECTRIC POWER STEERING PINION SHAFT NUTS. THEY ADJUSTED THE GEAR, ACCELERATOR AND STEERING. HOWEVER, THE PROBLEM STILL EXISTS. THE VEHICLE ACCELERATES AND MOVES FORWARD AS SOON AS THE CONSUMER STARTS IT. UPDATED 10/03/11",
        "vin": "JT2BK18U920"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/02/2011",
        "dateOfIncident": "02/04/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404245,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DAY LEADING UP TO INCIDENT, STEERING WHEEL WOULD PULL TO RIGHT VERY EASILY OR WHILE ROLLING, BUT COULD BE PULLED BACK TO CENTER WITHOUT ISSUE. ON DAY OF INCIDENT, BACKED CAR OUT OF PARKING SPACE AND A CLUNKING SOUND WAS MADE UNDER CAR. STEERING WHEEL WOULD THEN ONLY TURN ABOUT A QUARTER TURN AND WOULD NOT TURN THE WHEELS AT ALL. WE HAD THE CAR TOWED TO THE DEALER WHO DETERMINED THAT THE STEERING RACK WAS BAD AND THE SPIRAL CABLE WHICH PROVIDED POWER TO THE AIRBAG WAS BAD AS WELL.  THIS WAS A VERY DISTURBING FINDING FOR US AS WE COULD'VE BEEN DRIVING THE CAR ON THE INTERSTATE AT INTERSTATE SPEEDS WHEN THE STEERING BROKE.  ADDITIONALLY, THE AIRBAG WOULD NOT HAVE GONE OFF IF WE HAD GOTTEN INTO A CRASH.  DEALERSHIP AND TOYOTA WERE CONTACTED REGARDING WARRANTY REPLACEMENT OF BOTH ITEMS. DEALERSHIP AND TOYOTA REFUSED TO PROVIDE ANY WARRANTY OR DISCOUNT TO CORRECT THE ISSUES. HAD THE CAR TOWED HOME. ORDERED USED STEERING RACK AND SPIRAL CABLE AND INSTALLED THEM MYSELF.  CAR IS FUNCTIONING NOW, BUT I HAVE CONCERN THAT THE SAME THING WILL HAPPEN AGAIN. I STILL HAVE THE BAD STEERING RACK AND BAD SPIRAL CABLE.  *TR",
        "vin": "JT2BK18U420"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/30/2011",
        "dateOfIncident": "01/19/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379577,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA PRIUS WITH 140K MILES ON IT. THE STEERING WHEEL STARTED TO SHAKE VIOLENTLY LAST FALL WHEN I PUT THE CAR IN REVERSE. IT NOW DOES THIS AT LOW SPEEDS, PARTICULARLY AROUND CORNERS AND IS BECOMING AN INCREASING PROBLEM AT HIGHER SPEEDS. THE POWER STEERING CUT OUT ON THE FREEWAY AT 70 MILES PER HOUR LAST WEEK. THAT CONVINCED ME I NEED TO GET A NEW CAR. I TRIED TO TRADE IT IN AT A LOCAL TOYOTA DEALER LAST SUMMER AND COULDN'T UNDERSTAND WHY THEY WOULDN'T GIVE ME MORE THAN $2.5K FOR IT AS I HAD PAID $15K FOR IT 2.5 YEARS EARLIER. ADMITTEDLY, I HAD BEEN T-BONED AND A LOT OF WORK HAD BEEN DONE ON THE CAR, BUT MY DEALER HAD IT FIXED IT TO WHERE YOU WOULDN'T KNOW IT WAS IN AN ACCIDENT UNLESS IT WAS POINTED OUT.   I RESEARCHED THE PROBLEMS ONLINE AND FOUND THIS IS A WELL -KNOWN DESIGN PROBLEM WITH THE CARS STEERING RACK. I CAN'T SELL IT TO ANYONE AS IS. I'M STUCK WITH HAVING TO DO A $3K REPAIR TO A CAR THAT'S WORTH LESS THAN THAT TO ITS DEALERSHIP. IT SCARES ME TO DRIVE IT. THEY ONLY MADE 26K OF THESE CARS. DOES EVERY ONE HAVE THIS PROBLEM? I SPOKE WITH TOYOTA AND THEY SAID THEY DID OFFER AN EXTENDED WARRANTY REPAIR ON THIS, BUT SINCE MY CAR HAD >100K, THE BURDEN WOULD BE MINE.  THEY SHOULD BE WILLING TO RESOLVE THIS DESIGN FLAW. WHAT IS MY RECOURSE?  AGAIN, I AM AFRAID TO DRIVE IT AS I DON'T KNOW WHAT WILL HAPPEN.  *TR",
        "vin": "JT2BK184120"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "01/29/2011",
        "dateOfIncident": "12/23/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379516,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "APPLIED BRAKES WHILE CAR WAS MOVING SLOWLY, LESS THAN 10 MPH, AND HEARD LOUD GRINDING SOUND COMING FROM LEFT FRONT AS CAR STOPPED.  SHIFTED TO REVERSE AND CAR BARELY MOVED, ABOUT 1 FOOT, WHICH WAS ACCOMPANIED BY THE LOUD GRINDING SOUND, THEN STOPPED.  TURNED CAR OFF AND COULD FIND NOTHING INTERFERING WITH THE WHEELS BUT DID FIND PIECES OF BRAKE PAD ON THE GROUND ALONG THE PATH THE LEFT FRONT WHEEL HAD FOLLOWED.  THE LEFT FRONT WHEEL APPEARED AS IF THE CALIPERS WERE HOLDING WHATEVER REMAINED OF THE BRAKE PAD AND/OR BACKING TIGHT AGAINST THE ROTOR.  BRAKE FUNCTION HAD BEEN NORMAL FOR PRIOR 7 11/12 YEARS, IE, SINCE I PURCHASED IT AS A NEW CAR.  THERE WAS A BOTHERSOME GRINDING, SOMETIMES RATTLING OR SQUEALING NOISE FROM THE LEFT FRONT WHEEL SINCE THE FIRST YEAR OF OWNERSHIP AND I WAS REPEATEDLY TOLD BY THE DEALER THAT NOTHING WAS WRONG.  BRAKE RUST HAD GRADUALLY ACCUMULATED ON THE LEFT FRONT ALUMINUM WHEEL BUT NOT ON ANY OTHERS AND THE DEALER BLAMED THAT ON WINTER SALT.  IT WAS TOWED TO A DIFFERENT DEALER AND THE FRONT BRAKE PADS WERE REPLACED ALONG WITH THE FRONT ROTORS BEING RESURFACED.  DESPITE MY REQUEST, THE BRAKE PAD FROM THE OTHER SIDE WAS NOT KEPT NOR WAS ITS THICKNESS RECORDED.  NOTHING I TOLD THE SERVICE MANAGER WAS RELAYED TO WHOEVER WORKED ON THE CAR AND THAT PERSON ONLY RECORDED THAT THE TOW TRUCK DRIVER SAID THE LEFT FRONT WHEEL WAS FROZEN FAST.  THE CAR, 2002 TOYOTA PRIUS, HAD 43561 MILES ON IT WHEN THIS OCCURRED AND SHOULD NOT HAVE HAD SIGNIFICANT BRAKE PAD WEAR GIVEN THE HYBRID BRAKING SYSTEM AND BRAKING GEAR AS WELL AS MY DRIVING STYLE.  AFTER THE ABOVE REPAIR WAS DONE, I LEARNED THAT THERE WAS A RECOMMENDATION THAT THE LEFT FRONT ROTOR BE REPLACED.  I WILL HAVE THIS DONE BY A PRIVATE MECHANIC SO THAT THE PART WILL NOT BE DISCARDED.  *LN",
        "vin": "JT2BK18U120"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/29/2011",
        "dateOfIncident": "12/20/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10379557,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL, UNCONTROLLABLE SHUDDER, WILL LITERALLY RIP ITSELF OUT OF YOUR HAND OR GRIP.   USUALLY HAPPENS DURING THE FIRST OF THE DAY WHEN IT'S RELATIVELY COLD.  WHILE SLOWLY MOVING THE VEHICLE, THE STEERING WHEEL WILL START TO VIBRATE VIOLENTLY, IN AN UN CONTROLLABLE MANNER. SOMETIMES THE POWER STEERING WILL JUST ERROR OUT WHILE DRIVING DOWN THE STREET DURING THE DAY, LOOSING ALL POWER STEERING AS WELL. *TR",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/15/2010",
        "dateOfIncident": "12/05/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370737,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "REPEATED PROBLEMS WITH STEERING, INCLUDING UNCONTROLLABLE VIBRATION OF STEERING WHEEL AND LOSS OF POWER STEERING.  CAR HAS 39K MILES.  PROBLEM HAS RECENTLY GROWN WORSE, WITH COMPLETE LOSS OF POWER STEERING AND APPEARANCE OF PS WARNING ON COMPUTER SCREEN DURING HIGHWAY DRIVING.  PROBLEM IS ESPECIALLY PREVALENT IN COLD WEATHER.  VERY DANGEROUS. *TR",
        "vin": "JT2BK18U820"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "12/06/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370601,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT WAS DRIVING APPROXIMATELY 45 MPH WHEN THE POWER STEERING WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE POWER STEERING RACK WOULD NEED TO BE REPLACED. THE DEALER DEEMED AS UNSAFE TO DRIVE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/20/2010",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366942,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA SIENNA MINIVAN.  WHEN I TRY TO OPEN THE DRIVER SIDE SLIDING DOOR, I CAN HEAR IT UNLATCH BUT REMAINS SHUT.  YOU HAVE TO PUSH THE REAR PART OF THE DOOR BACK IN UNTIL YOU HEAR A CLICK, THEN YOU HAVE TO VIOLENTLY PULL THE HANDLE AND THE DOOR WILL OPEN. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "03/20/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365853,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKES WHEN STARTING TO BACK UP OR GO FORWARD .  HAPPENS IN COLDER WEATHER MORE OFTEN <DEALER  SAID IT WAS NOT A WARRATY ISSUE WHEN I FIRST APPROACED THEM IN 2004..  HAD 60K MILES ON IT.  THEY SAID IT WAS AN ELECTRONIC STEERING ISSUE  WITH MOTOR ON RACK AND PINION GEAR.   TOYOTA  PRIUS  2002 YEAR MODEL,    THEY WOULDGO T REPLACE IT OF OVER   $1000.,,,  SAID TO DRIVE IS AND NOT WORRY  BUT IF IT GOT WORSE  TO BRING IT IN,.   WELL RECENTLY I HAVE TALKED TO MANY OTHER PRIUS OWNERS  WITH   2001 AND 2002 MODELS AND SOME HAVE HAD THE SAME PROBLEMS AND SOME HAD IT FIXED    SO I DEICDED TO GO TO PRIUSCHAT AND FOUND  THIS WAS A PROBLEM ,.  AND WAS DANGEROUS.,   BUT THERE IS NO RECALL NOTICE ON THIS ISSUE.,    SO I THOUGHT IT BEST TO LOOK INTO AGAIN AND SEE YOU HAVE   A COMPLAINT REGISTERED THIS YEAR.,.,   IF THERE IS  MORE INFORMATION  YOU CAN PROVIDE I WOULD LIKE TO KNOW   MT IMPRESSION IF THE SERVICE MANAGERS AT TOYOTA LIKE TO   SKIRT THE ISSUE OF DANGER OR  POSSIBLE ACCIDENTS AND TRY TO GET YOU TO REPAIR IT AT YOUR COST,,,,I HOPE YOU FOLKS LOOK INTO THIS MATTER MORE DEEPLY. *TR",
        "vin": "JT2BK18U720"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/10/2010",
        "dateOfIncident": "08/05/2010",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365308,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN TRAFFIC HYBRID BATTERY COMPLETELY DISCHARGES CAUSING CAR TO LURCH WHEN TRYING TO ACCELERATE.  ONCE THE CAR IS OUT OF TRAFFIC THE BATTERY OVER CHARGES CAUSING THE BATTERY TO OVER HEAT AND CAUSE THE CABIN TO FILL WITH A SCARY SMELL OF BURNING.  THE HYBRID BATTERY FAN IS ON.   TOOK TO TOYOTA DEALERSHIP PAID NEARLY $300 FOR DIAGNOSTIC AND THEY COULD FIND NO ERROR CODES RELATED TO THE PROBLEM.  CALL CHP TO ASSIST IN TOW TO DEALERSHIP. *TR",
        "vin": "JT2BK18U220"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "10/15/2010",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 5,
        "numberOfInjuries": 4,
        "odiNumber": 10360899,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS. CONSUMER WRITES REGARDING A FATAL COLLISION INVOLVING A TOYOTA VEHICLE *TGW  THE CONSUMER STATED THE TOYOTA PRIUS CROSSED OVER A GRASS MEDIAN BETWEEN A DIVIDED EXPRESSWAY AND STRUCK A CHEVROLET BLAZER.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/05/2010",
        "dateOfIncident": "10/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359279,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKES VIOLENTLY FOR A FEW SECONDS THEN STOPS.  UP UNTIL YESTERDAY IT DID THIS SPORADICALLY WHILE BACKING AND TURNING.  YESTERDAY, IT DID IT DURING WET WEATHER, 50 DEGREES FAHRENHEIT, BACKING AND TURNING.  THEN IT DID IT AGAIN WHILE DRIVING AND TURNING IN A PARKING GARAGE.  THIS WAS THE FIRST TIME IT HAS EVER DONE IT GOING FORWARD.  THIS PROBLEM HAS BEEN OCCURRING FOR APPROX 8 YEARS ON AND OFF.  TOYOTA DEALERSHIP SAYS THEY CANNOT REPRODUCE PROBLEM. *TR",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/23/2010",
        "dateOfIncident": "11/21/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357256,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ELECTRONICALLY-ASSISTED POWER STEERING RACK ASSEMBLY DEFECTIVE ON 2002 TOYOTA PRIUS, PARTICULARLY VEHICLE ID NUMBER [XXX].    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": "JT22BK12X82"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2010",
        "dateOfIncident": "07/25/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347471,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS STEERING RACK FAILURE.    APPROXIMATELY 2 WEEKS AGO THE STEERING IN MY PRIUS BECAME DIFFICULT TO TURN AND PULSATED WHEN TURNING. THE TOYOTA DEALER, WHERE I HAD PURCHASED THE VEHICLE, INSPECTED THE CAR AND INFORMED ME THAT THE STEERING RACK WAS FAILING AND NEEDED TO BE REPLACED AT A COST OF $3,000.   AFTER RESEARCHING THIS ON THE INTERNET I FOUND THAT THIS IS A PROBLEM INHERENT TO THESE 1ST GENERATION PRIUS MODELS.   I CONTACTED TOYOTA CUSTOMER SERVICE AND OPENED A CASE TO SEE IF TOYOTA WOULD OFFER ANY ASSISTANCE IN THE REPAIR OF MY CAR. ONLINE AT OWNER FORUMS REGARDING THIS PROBLEM THERE WERE MANY INSTANCES WHERE TOYOTA WOULD REPAIR THE VEHICLE AT NO COST TO THE OWNER OR AT LEAST OFFER SOME ASSISTANCE WITH THE COST. I WAS REFUSED BY TOYOTA WITH ANY HELP OF ANY KIND.   I BELIEVE THAT SINCE TOYOTA WAS AWARE OF THIS DEFECT DURING THE 2001- 2003 MODEL RUN AND CHANGED THE STEERING RACK FOR THE 2004 REDESIGN TO ELIMINATE THIS PROBLEM THAT THERE SHOULD BE A RECALL TO ADDRESS THIS MATTER. I BASE THIS ON THE VOLUME OF CARS EXPERIENCING THIS ALONG WITH THE FACT THAT TOYOTA HAD A SPECIAL SERVICE CAMPAIGN IN PLACE AT ONE POINT THAT REPAIRED THESE AFFECTED VEHICLES WHEN CUSTOMERS EXPERIENCED THIS PROBLEM. TOYOTA IS NO LONGER RUNNING THIS REPAIR CAMPAIGN. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/29/2010",
        "dateOfIncident": "07/20/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346103,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1. RECENTLY, THE STEERING STARTED SHAKING VIOLENTLY PERIODICALLY UPON TURNING  2. THE STEERING PERIODICALLY SHAKES VIOLENTLY AND IT BECOMES DIFFICULT OR IMPOSSIBLE TO STEER THE CAR  3. I CONTACTED THE DEALER AND THE TOYOTA EXECUTIVE OFFICES AND THEY \"DECLINED PARTICIPATION\"  UPDATED IVOQ 11/02/10  *TR",
        "vin": "JT2BK18U020"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/27/2010",
        "dateOfIncident": "07/02/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345615,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE SHAKING IN STEERING OF 2002 PRIUS. ALSO ENCOUNTER LOSS OF POWER STEERING FOR  A SHORT TIME 4 DIFFERENT TIMES. TAKEN TO DEALER 3 TIMES !ST TWO TIMES I WAS TOLD IT JUST NEEDED GREASE ON THE STEERING COLUMN. 3RD TIME WAS TOLD IT NEEDED $3400 OF WORKING AND THAT THE CAR WAS DANGEROUS TO DRIVE.  CAR HAD  APPROXIMATELY 107,000 MILES THE THIRD TIME I TOOK IT IN. AFTER I CONTACTED TOYOTA  CORP. THE DEALER CALLED TO SAY HE WOULD WORK WITH ME ON THE PRICE, BUT I CAN NOT TRUST HIM TO DO THE WORK. IT HAS NOT BEEN FIXED YET  I  HAD  ASK THE SERVICE MANAGER IF THE CAR WAS SAFE TO TAKE ON A LONG TRIP THE 2ND TIME I TOOK IT IN AND HE SAID YES. IT WAS ON THE WAY BACK FROM THE TRIP THAT I LOSS POWER STEERING DRIVING ON I95. THANKFULLY I WAS ABLE TO CONTROL THE VEHICLE UNTIL POWER STEERING RESUMED. *TR",
        "vin": "JT2BK18U520"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "06/04/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336682,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRIUS.  SHE STATED WHILE PULLING OUT FROM A DRIVEWAY AND APPLYING THE BRAKES, THE BRAKES DID NOT ENGAGE AND CAUSED HER TO CRASH INTO ANOTHER VEHICLE. THE VEHICLE SUSTAINED EXTENSIVE DAMAGES TO THE ENTIRE FRONT STRUCTURE AND WAS TOWED FROM THE SCENE. A POLICE REPORT WAS FILED. THE DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS CONTACTED AND A COMPLAINT FILED. THE FAILURE AND CURRENT MILEAGES WERE 24,000.",
        "vin": "JT2BK18U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/11/2010",
        "dateOfIncident": "05/31/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335829,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ELECTRONIC POWER STEERING ASSEMBLY MALFUNCTIONS AND STOPS PROVIDING ASSISTANCE TO THE DRIVER ON A 2002 TOYOTA PRIUS, ON ONE INSTANCE THE GASOLINE MOTOR STOPPED WORKING AND I WAS LEFT DRIVING AT LOW SPEED WITH THE ASSISTANCE OF THE ELECTRIC MOTOR ONLY.  THE LATEST INCIDENT OCCURRED ON MAY 31ST, 2010 WHILE DRIVING AT ABOUT 65 MPH ON A FREEWAY, THE CAR LOST THE POWER STEERING OPERATION, MULTIPLE WARNING LIGHTS CAME ON  THE SCREEN, THE GAS MOTOR SHUT DOWN AND THE SPEED OF THE CAR DROPPED TO AROUND 23 MPH. THE ACCELERATOR PEDAL WAS RESPONSIVE ONLY IN THE RANGE OF 0~23 MPH.  I TOOK THE CAR TO A SERVICE CENTER AND THE SERVICE ADVISOR TOLD ME THE ELECTRIC POWER STEERING MODULE WAS DEFECTIVE AND NEEDED REPLACEMENT.  REVIEWING THE SERVICE RECORDS FOR THE CARS I FOUND THAT IT PRESENTED THE SAME SYMPTOMS ONCE IN 2006 AND THREE TIMES IN 2008. THE SERVICE CENTER EITHER CLEANED A SENSOR OR COULDN'T REPLICATE THE PROBLEM. THE PART WAS NEVER REPLACED.  WHILE RESEARCHING NHTSA SITE I FOUND THAT TOYOTA HAS FILE TSBS BACK IN 2004 RECOGNIZING A PROBLEM WITH THIS PARTICULAR COMPONENT AND IN SOME CASES EXTENDED THE WARRANTY ON THE PART. I CONTACTED TOYOTA AND THEY REFUSE TO ASSIST IN THE COST OF THE CAR REPAIR. *TR",
        "vin": "JT2BK18U320"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/11/2010",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335842,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 TOYOTA PRIUS'S ELECTRONIC MOTOR STEERING ASSEMBLY STOPS WORKING AFTER APPROXIMATELY 1HR OF DRIVING AT HIGHWAY SPEEDS. AT 75 MILES PER HOUR, WARNING LIGHTS TURN ON AND STEERING ASSIST FAILS. STEERING THE CAR FROM THE ROAD IS INCREDIBLY DIFFICULT. AFTER TURNING THE CAR OFF AND BACK ON, THE STEERING WORKS ONCE AGAIN. THE CAR IS NOT SAFE TO DRIVE AS THE STEERING FAILS UNEXPECTEDLY AT HIGH SPEEDS. THE DEALER STATES THAT THE FIX WILL COST $3200, WHICH IS OVER HALF OF THE VEHICLE'S KELLEY BLUE BOOK TRADE-IN VALUE. *TR",
        "vin": "JT2BK12U920"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/06/2010",
        "dateOfIncident": "01/06/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324246,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS ACCIDENT *GR  THE CONSUMER STATED SHE WAS LEAVING A MEETING WHEN SHE ATTEMPTED TO RELEASE HER EMERGENCY BRAKE. SHE WAS PARKED ON AN INCLINE AND HAS PARKED THERE ONCE A MONTH FOR OVER A YEAR. BEFORE SHE KNEW WHAT WAS HAPPENING, THE VEHICLE STARTED TO ROLL BACKWARDS AT SUCH HIGH SPEED THAT SHE WAS UNABLE TO CONTROL IT BY BRAKING. THEREFORE, SHE SIDE SWIPED ANOTHER VEHICLE AND CAUSED OVER $10,500 WORTH OF DAMAGE TO BOTH CARS. *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "03/29/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322916,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I COMPLAINED TO THE DEALER MULTIPLE TIMES ABOUT SHAKING IN THE STEERING COLUMN.  AFTER SEVERAL INSPECTIONS WHERE THEY FOUND NOTHING, I TOLD THEM TO CHECK THE RACK & PINION.  THEY FOUND THAT TO BE THE CAUSE.  TOYOTA PAID FOR THE NEW PARTS AND I PAID FOR THE LABOR TO GET IT REPLACED.  LESS THEN 13 MONTHS LATER, I HAVE HAD MULTIPLE INCIDENTS OF MY POWER STEERING GOING OUT MAKING IT VERY DIFFICULT TO DRIVE THE CAR.  THE DEALER ACKNOWLEDGED THERE IS A PROBLEM, AGAIN, WITH THE RACK  AND SAYS I NEED TO REPLACE IT.",
        "vin": "JT2BK18U420"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/19/2010",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320924,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL POSITION SENSOR.  INTERMITTENT FAILURE.  CANNOT START CAR EVEN THOUGH FOOT IS ON BRAKE.  SOMETIMES REQUIRED AS MANY AS 20 TRIES.  CONDITION PERSISTED FROM 2006 UNTIL REPAIRED JAN 2010.  AT FIRST ONCE EVERY FEW WEEK AND PROGRESSED TO SEVERAL TIMES A DAY. *TR",
        "vin": "JTDKB20U640"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/17/2010",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320493,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED MY TOYOTA PRIUS IN LATE 2001, IT HAS INTERMITTENTLY SURGED WHEN THE BRAKE IS PRESSED.  WHILE I DO NOT HAVE THE HIGH SPEED SURGES THAT OTHER DRIVERS HAVE REPORTED, PERIODICALLY WHEN I AM AT LOW SPEEDS AND PRESS THE BRAKE TO STOP, THE CAR WILL SLOW TO A STOP, THEN LURCH FORWARD, REQUIRING ME TO PRESS THE BRAKE HARDER TO MAINTAIN CONTROL.  I REPORTED THIS TO TOYOTA IN 2001 AND 2002, BUT I WAS TOLD THAT THIS WAS NORMAL FOR A HYBRID, WHICH WAS FAIRLY NEW TECHNOLOGY AT THE TIME.  I AM CONCERNED THAT IN THE FUTURE I MAY HAVE A HIGHER SPEED SURGE.  SO FAR MY SURGES HAVE BEEN LOW SPEED, AND I HAVE BEEN ABLE TO CONTROL THEM BY PRESSING THE BRAKE HARDER. *TR",
        "vin": "JT2BK18U020"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/10/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318625,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS BRAKING PROBLEM*CW  THE CONSUMER STATED HE DIDN'T SEE THE ISSUE AS A BRAKING PROBLEM; RATHER A CONTROL CONFLICT. WHENEVER THE PROBLEM OCCURRED, THE VEHICLE WAS MOVING DOWN A SLIGHT GRADE ON A ROAD SURFACE HAVING ITS SHARE OF PAVING PATCHES, FROST HEAVES, ETC. THE SLIGHT DOWNGRADE CAUSES THE VEHICLES SPEED TO INCREASE, OR PERHAPS AN INTERSECTION APPEARED AHEAD AND FOR WHATEVER REASON THE BRAKES WERE GENTLY APPLIED IN ORDER TO SLOW THE VEHICLE DOWN. WHEN THE PROBLEM OCCURRED, THE SYMPTOM WAS A BRIEF INTERVAL AND THE VEHICLE SEEMED TO ACCELERATE AND THEN NORMAL BRAKING RESUMED AND THE VEHICLE SLOWED DOWN. JUST PRIOR TO THE BRAKE ACTIVATION, THE VEHICLE IS IN REGENERATION MODE, IN WHICH THE ELECTRIC PROPULSION MOTORS ARE ACTING AS GENERATORS, WHERE ENERGY MOTION IS BEING EXTRACTED AND CONVERTED TO ELECTRICAL ENERGY TO BE STORED IN THE VEHICLES BATTERY. WHENEVER THE BRAKE PEDAL IS ACTIVATED, THE FIRST THING THAT HAPPENS IS THAT THE MOTOR NOW BECOME GENERATORS ARE FORCED BY THE CONTROL SYSTEM TO CONVERT SIGNIFICANT ENERGY OF MOTION INTO ELECTRICAL ENERGY.  THE CONSUMER BELIEVED THAT THE NORMAL BRAKING SYSTEM SHUTS DOWN. THE CONSUMER BELIEVED THE PROBLEM WAS WITH THE ABS.",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/08/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317566,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMERS 2002 TOYOTA PRIUS LOSS OF POWER AT HIGHWAY SPEEDS AND VIOLENT SHAKING IN THE STEERING SYSTEM. *TS  THE CONSUMER STATED THE DEALER MADE ATTEMPTS TO CORRECT THE PROBLEM BY REPLACING THE ELECTRONIC MODULE EXCHANGE AND THE GAS TANK. HOWEVER, THE ATTEMPTS WERE UNSUCCESSFUL. ALSO, THE VEHICLE HAS AN ONGOING, UNRESOLVED PROBLEM WITH VIOLENT SHAKING IN THE STEERING SYSTEM, ESPECIALLY THE FIRST THING IN THE MORNING AND AT OTHER TIMES DURING COLD WEATHER. THE POWER STEERING WILL COMPLETELY CUT OUT AFTER HOURS OF OPERATION, ESPECIALLY DURING HOT WEATHER.   *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316104,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKES VIOLENTLY WHEN BACKING UP AND TURNING WHEEL.  HAPPENS RANDOMLY.  SOMETIMES NOT FOR MONTHS.  IN JANUARY 2010 IT HAPPENED THREE TIMES IN ONE WEEK.  TOYOTA DEALERSHIP IS UNRESPONSIVE SAYING THEY CANNOT DUPLICATE THE PROBLEM. *TR",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "08/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316137,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).    TO WHOM IT MAY CONCERN,   I WAS ATTEMPTING TO MAKE A LEFT TURN IN MY 2002 TOYOTA PRIUS TRAVELING APPROXIMATELY 30MPH WHEN THE STEERING WHEEL SUDDENLY LOCKED. I DID MANAGE TO SLOW THE CAR DOWN AND FORCED THE WHEEL INTO COMPLETING THE TURN AFTER HEARING A CRACKING SOUND. I WAS TOLD THAT THE VEHICLE HAD A FAULTY SENSOR AND THE ENTIRE STEERING RACK HAD TO BE REPLACED. I HAD JUST EXITED THE HIGHWAY AND WAS LUCKY THERE WERE NO OTHER VEHICLES OR PEDESTRIANS AROUND. THIS SITUATION OCCURRED 08/15/08. THIS IS AFTER I HAD BROUGHT IN BOTH MY 2002 PRIUS AND MY 2002 TOYOTA HIGHLANDER IN FOR NUMEROUS SENSOR DEFECTS THAT WERE EITHER FIXED OR REPLACED.    I CONTINUED TO HAVE PROBLEMS WITH MY TOYOTA HIGHLANDER AS WELL. THE LAST ISSUE WITH THIS VEHICLE WAS OIL THE CONSTANT LOSS OF ENGINE OIL. TO BE MORE DETAILED, I LOST 8 QUARTS OF OIL IN APPROXIMATELY 2000 MILES. THERE WAS NO EXPLANATION GIVEN CONSIDERING THERE WERE NO VISIBLE SIGNS OF LEAK OR BURNING. THIS WAS THE REASON I NO LONGER OWN THIS VEHICLE BUT UNFORTUNATELY STILL OWN THE PRIUS.  [XXX]  *TR",
        "vin": "JT2BK12U720"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/25/2010",
        "dateOfIncident": "12/08/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10314276,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS. CONSUMER STATES HE EXPERIENCED TEMPORARY BRAKE FAILURE IN COLD WEATHER.  *TGW  THE PEDAL FELT AS IF IT WERE FROZEN OR BLOCKED AND WOULD NOT GO DOWN NO MATTER HOW HARD THE CONSUMER APPLIED IT.  NORMAL BRAKE FUNCTION RETURNED AFTER A FEW MINUTES. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "08/12/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313092,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS. WHILE DRIVING 10 MPH THE RPM'S INCREASED EXCESSIVELY CAUSING THE VEHICLE TO ACCELERATE AND CRASH INTO A BUILDING. THE VEHICLE WAS DESTROYED AND NO ONE WAS INJURED. THE CONTACT STATED THAT THE BRAKES FAILED TO STOP THE VEHICLE. THE MANUFACTURER WAS NOT INFORMED OF THE FAILURE. THE CONTACT IS CONCERNED THAT THE LATE MODEL TOYOTAS HAVE NOT BEEN INVESTIGATED REGARDING THE ACCELERATION. THE FAILURE MILEAGE WAS UNKNOWN. JO",
        "vin": "JT2BK18U620"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "08/15/2009",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310513,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS. THE CONTACT WAS DRIVING APPROXIMATELY BETWEEN 65-75 MPH ON NORMAL ROAD CONDITIONS WHEN ALL OF THE WARNING LIGHT INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL.  SUDDENLY, A STRONG BURNING ODOR CIRCULATED INSIDE OF THE VEHICLE AND THE ENGINE BEGAN TO OVERHEAT. THE WARNING INDICATOR REMAINED ILLUMINATED UNTIL THE ENGINE WAS TURNED OFF.  THE CRUISE CONTROL, POWER WINDOWS SYSTEM AND CELLULAR PHONE POWER OUTLET BECAME INOPERATIVE. THE DRIVER PULLED OVER TO THE SIDE OF THE ROAD AND TURNED THE ENGINE OFF.  THE VEHICLE RESTARTED AND RESUMED OPERATION WITH CAUTION.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING.  THE FAILURE WAS CONTRIBUTED TO THE TRANSAXLE. THE VEHICLE HAS NOT BEEN REPAIRED FOR THE MALFUNCTIONS.  THE CONTACT PREVIOUSLY OWNED A 2002 TOYOTA PRIUS AND EXPERIENCED THE IDENTICAL FAILURE. THE FAILURE MILEAGE WAS 68,500. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307761,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA PRIUS THAT EXHIBITS THE SAME ACCELERATION AS IN THE 2010 RECALL.  DURING BRAKING IF I AM TO HIT A MAN HOLE COVER OR POT HOLE THE CAR SEEMS TO LOSE THE ABILITY TO BRAKE AND SKIPS FORWARD.  THIS HAPPENS EVERY TIME I HIT A BUMP IN THE ROAD WHILE BRAKING.  I HAVE OWNED THE CAR FOR OVER 2 YEARS AND HAVE HAD THE BRAKES REPLACED WITHOUT RESOLVE. *TR",
        "vin": "JT2BK18U320"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "06/06/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307794,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BELIEVE TOYOTA HAS KNOWN OF THE BRAKING PROBLEM ALL ALONG. I PURCHASED NEW, A 2002 PRIUS. IN 2008 MY ANTI-LOCKING BRAKE SYSTEM WENT OUT. THE SERVICE MGR. TOLD ME IT NEEDED A NEW RELAY, AND HE COULD FIX IT FOR $1700. I HAVE NEVER IN MY LIFE SEEN A RELAY COSTING $1700. MY BRAKES STILL WORKED, JUST NOT PROPERLY SO I DIDN'T SPEND THE $1700. AS LONG AS TOYOTA CAN GET THEIR CUSTOMERS TO SPEND $1700. THERE IS NO NEED TO HAVE A RECALL. I HAVE AROUND 47000 MILES ON THE VEHICLE AND AM ON MY THIRD SET OF ROTORS AND BRAKE PADS. MY TIRES ACTUALLY LAST LONGER. I BELIEVE THIS BRAKING PROBLEM HAS BEEN AROUND FROM DAY ONE. I THINK RAY LAHOOD SHOULD CHECK FREQUENCY OF THIS REPAIR AGAINST CUSTOMERS RECORDS, IT MIGHT REVEAL A CONSISTENT FAULT. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "06/10/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307865,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 PRIUS HAS BRAKING PROBLEMS WHEN IT HITS A ROUGH PATCH OF PAVEMENT OR ENCOUNTERS SMALL BUMPS. THIS HAS HAPPENED SINCE IT WAS PURCHASED (NEW). IF YOU ARE SLOWING DOWN AND HIT A BUMP OR A SERIES OF BUMPS, THE BRAKING POWER LITERALLY DISAPPEARS FOR A MOMENT OR TWO. THE BRAKING POWER DOES RETURN, BUT IT ADDS CONSIDERABLY TO YOUR STOPPING DISTANCE. I NEVER REALIZED HOW SERIOUS IT COULD BE UNTIL I HEARD ABOUT THE OTHER TOYOTA RECALLS INVOLVING BRAKES. *TR",
        "vin": "JT2BK18U320"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10307994,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA PRIUS THAT I'VE HAD FOR SOME 7 YEARS.  THE STEERING IS VERY SENSITIVE MAKING IT NECESSARY TO ALWAYS ATTEND TO ACCURACY IN STEERING.  I THOUGHT THAT THIS WAS A CHACTERISTIC OF THE DESIGN, BUT NOW I WONDER IF THIS IS ACTUALLY A MANUFACTURING DEFECT BECAUSE OF REPORTS I SEE ON OTHER MODELS\" \"\"IF YOU TAKE YOUR EYES OFF THE ROAD FOR A SECOND, THE CAR WILL DRIFT INTO ANOTHER LANE,\" SAID ONE DRIVER AN OCT. 18 COMPLAINT. ANOTHER DESCRIBES IT AS THE MOST TERRIFYING THING THAT EVER HAPPENED TO THEM.\"  THIS DESCRIBES MY EXPERIENCE. *TR",
        "vin": "JT2BK18U320"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/09/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308008,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2002 PRIUS. IN THE SIX YEARS THAT I'VE OWNED MY CAR, I'VE NOTICED THAT THERE'S A LOSS OF BRAKING, AND EVEN SLIGHT ACCELERATION, WHEN I TRY TO BRAKE OVER A BUMP OR POTHOLE. I'VE EXPERIENCED THIS ABOUT HALF A DOZEN TIMES TOTAL. FORTUNATELY, I HAVE NEVER BEEN IN AN ACCIDENT BECAUSE OF THIS DEFECT. I NEVER ASKED A MECHANIC TO FIX THE PROBLEM, AND I NEVER GAVE IT MUCH THOUGHT (I JUST LEARNED TO DRIVE MUCH MORE SLOWLY ON BUMPY ROAD SURFACES). I SAW THAT THE NHTSA ISSUED A STATEMENT ON FEB. 9 ABOUT THE BRAKES ON THE 2010 TOYOTA PRIUS AND MADE THE CONNECTION THAT PERHAPS MY OLDER-MODEL PRIUS WAS ALSO SUSCEPTIBLE TO THE SAME BRAKING PROBLEM. *TR",
        "vin": "JT2BK12U920"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/06/2010",
        "dateOfIncident": "11/15/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10307057,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A USED 2002 TOYOTA PRIUS, WHICH NOW HAS ABOUT 86,000 MILES ON IT.  IN NOVEMBER 2009 I WAS PARKING WHEN THE CAR SPONTANEOUSLY ACCELERATED.  MY SPEED WAS LESS THAN 2MPH, MY FOOT WAS CONTINUOUSLY ON THE BRAKE WHILE EASING INTO THE PARKING SPACE, PRIOR TO THE UNCONTROLLABLE ACCELERATION.  SUDDENLY WITHOUT WARNING I HEARD THE ENGINE RACE AND THE CAR BOLTED FORWARD, UNRESPONSIVE TO MY BRAKING.  I ONLY STOPPED WHEN MY CAR COLLIDED HEAD ON WITH A PARKED CAR, WHICH WAS MOVED ABOUT TWO FEET BY OUR COLLISION.  IT HAPPENED TOO FAST TO EVEN THINK OF CHANGING GEAR INTO NEUTRAL, BECAUSE I WAS ONLY 5 FEET FROM THE OTHER CAR WHEN THE SPONTANEOUS ACCELERATION OCCURRED.    AFTER THE ACCIDENT I LOOKED FOR CAUSE AND I DETERMINED THAT NO OBJECT IN THE CAB HAD ACCIDENTALLY PUSHED THE ACCELERATOR PEDAL, INCLUDING THE FLOOR MAT.    I BELIEVE THAT BECAUSE OF THE SMALL NUMBER OF DRIVERS EXPERIENCING UNCONTROLLABLE ACCELERATION OUT OF THE MILLIONS OF TOYOTAS SOLD, THAT THE PHENOMENON IS CAUSED BY TWO OR MORE INDEPENDENT ERRORS IN THE VEHICLE ELECTRONICS, OCCURRING UNFORTUNATELY AT THE SAME TIME.  THE CONFLUENCE OF TWO UNLIKELY EVENTS HAS EVEN SMALLER PROBABILITY, THEREFORE FEW OCCURRENCES.  FOR EXAMPLE IF THE CRUISE CONTROL FAILED TO DISENGAGE AND ALSO THERE WAS A SIGNIFICANT DELAY IN THE SIGNAL FROM BRAKE PEDAL TO BRAKE DRUMS, THE COMBINATION COULD BE TRAGIC.    THE TOYOTA PRIUS 2002 MODEL WHICH I DRIVE HAS NOT BEEN RECALLED; HOWEVER SINCE THE ACCIDENT I HAVE BEEN EVER ON THE ALERT, PREPARED TO GEAR INTO NEUTRAL.    EVEN THIS VIGILANCE WILL NOT PROVIDE SAFETY IF THE DISTANCE BETWEEN MY CAR AND AN OBSTACLE OR CREVASSE IS SHORT WHEN THE FLAW SURFACES AGAIN; GIVEN THE FINITE SPEED OF HUMAN NERVOUS TRANSMISSION, THE CAR'S SUDDEN, UNCONTROLLABLE ACCELERATION NEEDS TO BE INVESTIGATED.  *CN",
        "vin": "JT2BK12U120"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "02/02/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10305938,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 TOYOTA PRIUS BRAKES SOMETIMES DON'T WORK WHEN STOPPING AT A SLOW SPEED.  IT HAPPENS WHEN GOING OVER BUMPS AND POTHOLES.  THE BRAKE TAKES A SECOND BEFORE MAKING CONTACT WITH THE BRAKE PAD.  IT CAN HAPPEN ALSO WHEN GOING OVER MULTIPLE BUMPS AND POTHOLES LEAVING THE CAR UNABLE TO BRAKE FOR A FEW SECONDS.  THANK YOU FOR ANY HELP ON THIS ISSUE.  *TR",
        "vin": "JT2BK12U120"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/04/2010",
        "dateOfIncident": "10/29/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10306160,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 PRIUS SUDDENLY SPEEDED UP JUST BEFORE I GOT TO WAIST HIGH BACK DECK OF OUR HOUSE.  I HIT THE CLIP ON SUNVISOR.  HAD 25 STITCHES IN SCALP. HAVE NOT SEEN THIS MODEL IN RECALL.  CAR WAS TOTALED. DID NOT HAVE ON SEATBELT AS I WAS ONLY GETTING THE PAPER AT THE END OF LONG DRIVEWAY EARLY IN THE AM.*JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2010",
        "dateOfIncident": "10/09/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300253,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TLA*THE CONTACT OWNS A 2002 TOYOTA PRIUS. WHILE DRIVING APPROXIMATELY 35 MPH ON NORMAL ROAD CONDITIONS, SUDDENLY, THE STEERING WHEEL BEGAN TO SHAKE VIOLENTLY WITH EXCESSIVE VIBRATION.  THE VEHICLE WAS TAKEN TO  AN AUTHORIZED DEALER. THE FAILURE WAS CONTRIBUTED TO THE STEERING MECHANISM CHIP. THE VEHICLE WAS NOT REPAIRED FOR THE MALFUNCTION. ON A SEPARATE OCCASION THE STEERING WHEEL LOCKED WITHOUT WARNING. THE DRIVER FORCED THE STEERING WHEEL TO THE RIGHT AS A RESULT OF THE WHEEL UNLOCKED. THE VEHICLE WAS ABLE TO RESUME TO NORMAL OPERATION.  AT THIS TIME THE VEHICLE IS NOT BEING DRIVEN DUE TO THE POTENTIAL SAFETY HAZARD. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS UNAVAILABLE.      UPDATED 03/01/10  *BF  THE CONSUMER STATED WHEN THE WEATHER WAS COLD, THE STEERING WHEEL WOULD SHAKE VIOLENTLY. THE SHAKING WOULD STOP WHEN THE WHEEL WAS STRAIGHTENED.  THE DEALER INFORMED THE CONSUMER THERE WAS A PROBLEM WITH THE COMPUTER CHIP. UPDATED 07/19/10*JB",
        "vin": "JT2BK18U420"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/09/2009",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291481,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA PRUIS.  WHILE DRIVING APPROXIMATELY 55 MPH, THE PASSENGER HEADLIGHT FAILED WITHOUT WARNING.  AFTER MANIPULATION OF THE  HEADLIGHT SELECTOR SWITCH THE PASSENGER HEADLIGHT ACTIVATED. THE FAILURE OCCURRED INTERMITTENTLY.  THE FAILURE MILEAGE WAS  62,000.  THE CURRENT MILEAGE WAS 63,000.  THE VEHICLE IDENTIFICATION NUMBER WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/29/2009",
        "dateOfIncident": "10/23/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290212,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT DISC BRAKE  PADS WERE INSPECTED ON 9-3-2009 BUT ON 10-23-2009 GRINDING NOISE BEGAN.  PADS AND ROTORS ON FRONT BRAKES WERE REPLACED.  TOLD METAL TO METAL CONTACT HAD DEVELOPED AND VEHICLE WAS UNSAFE TO DRIVE. *TR",
        "vin": "JT2BK18U920"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/31/2009",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10282424,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS WHICH WAS PURCHASED IN JANUARY 2002. HE STATED THAT THERE WAS EXCESSIVE SHAKING IN THE STEERING WHEEL. WHILE DRIVING APPROXIMATELY 25 MPH, A WARNING LIGHT ILLUMINATED INDICATING THAT THERE WAS A LOSS OF POWER STEERING. INTERMITTENTLY THE STEERING WHEEL BECOMES DIFFICULT TO CONTROL WHILE MAKING RIGHT AND LEFT TURNS. A DIAGNOSTIC TEST WAS PERFORMED AND ERROR CODES INDICATED THAT THE TORQUE SENSOR FAILED. A DEALER STATED THAT THE REPAIR COST WAS APPROXIMATELY $2,000; ALTHOUGH,  THERE WAS A RECALL FOR THE FAILURE, NHTSA CAMPAIGN ID NUMBER: 00V285000, HIS VIN WAS NOT INCLUDED. THE CURRENT AND FAILURE MILEAGES WERE UNDER 89,000.    UPDATED 04/05/10 *BF  UPDATED 05/05/10.*JB",
        "vin": "JT2BK18U520"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/23/2009",
        "dateOfIncident": "07/16/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278141,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AT THE END OF AN 8 HOUR TRIP FROM VA TO TN, ALL THE LIGHTS CAME ON IN THE CAR AND IT LOST POWER.  WE LIMPED TO A TOYOTA DEALERSHIP AND LEARNED THAT THE TRANSAXLE (TRANSMISSION) AND INVERTER HAD FAILED.  METAL FRAGMENTS WERE FOUND IN THE TRANSAXLE FLUID.  THE COST TO REPLACE BOTH IS ESTIMATED AT $7,500.  THE CAR HAS 113K MILES ON IT AND WAS DEALER-MAINTAINED ACCORDING TO TOYOTA PLAN.  *TR",
        "vin": "JT2BK18U620"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/15/2009",
        "dateOfIncident": "05/14/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268839,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "INSIGNIA SE200",
                "productYear": "9999",
                "size": "P225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "TIRE THREAD SEPARATION OCCURRED WHILE DRIVING AT ABOUT 60-70 MPH ON THE HIGHWAY CAUSING VEHICLE TO WEAVE NEARLY OUT OF CONTROL. A COLLISION WAS AVOIDED BY THE DRIVER. DAMAGE TO THE FENDER, BUMPER AND SIDE MARKER LIGHTS ON THE FRONT PASSENGER SIDE. TIRE BRAND WAS BRIDGESTONE INSIGNIA 175/65R14 DOT IC8I E20 1604 EQ8R. *TR",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2009",
        "dateOfIncident": "02/18/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259448,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  THE CONTACT STATED THAT THE CHECK ENGINE WARNING INDICATOR CONTINUES TO ILLUMINATE ON THE INSTRUMENT PANEL.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE LARGE BATTERY NEEDED TO BE REPLACED.  THE VEHICLE WAS ALSO OUT OF WARRANTY.  THE MANUFACTURER REFERRED THE CONTACT TO THE OUT-OF-WARRANTY DIVISION, BUT THEY COULD NOT ASSIST.  THE FAILURE AND CURRENT MILEAGES WERE 108,000.",
        "vin": "JT2BK18U320"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/18/2009",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259245,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  THE CONTACT STATED THAT THE BRAKE INDICATOR ON THE INSTRUMENT PANEL REMAINS ILLUMINATED, REGARDLESS IF THE BRAKES ARE ENGAGED OR NOT.  THE VEHICLE HAS BEEN TO THE DEALER THREE TIMES AND THEY DISCOVERED A LEAK IN THE BRAKES.  BRAKE FLUID WAS ADDED TO REMEDY THE FAILURE, BUT THE INDICATOR ILLUMINATED AGAIN A FEW DAYS LATER.  THE VEHICLE WAS TAKEN BACK TO THE DEALER AND THEY INFORMED HIM NOT TO WORRY ABOUT THE FAILURE.  THERE WAS NO ATTEMPT TO REPAIR THE FAILURE.  WEEKS LATER, THE CONTACT TOOK THE VEHICLE BACK TO THE DEALER AND THEY DISCOVERED THAT THE BRAKE ACTIVATOR FAILED.  THE VEHICLE WAS OUT OF WARRANTY; THEREFORE, THE CONTACT WOULD BE RESPONSIBLE FOR THE REPAIRS.  HE REFUSED TO PAY FOR THE REPAIRS AND THE MANUFACTURER WILL NOT ASSUME RESPONSIBILITY.  IN ADDITION, THE CHECK ENGINE LAMP IN THE VEHICLE HAS ALSO ILLUMINATED.  THE DEALER STATED THAT THEY WOULD HAVE TO REPLACE THE FUEL TANK, BUT WAS UNSURE IF THAT WOULD PERMANENTLY REMEDY THE ISSUE.  BOTH OF THE DEFECTS HAVE NOT YET BEEN REPAIRED.  THE FAILURE MILEAGE WAS 100,000 AND CURRENT MILEAGE WAS 120,000.   UPDATED 3/11/09 *CN  UPDATED 03/16/09. *JB",
        "vin": "JT2BK18U920"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "10/26/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257478,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  WHILE DRIVING LESS THAN 65 MPH, THE EMERGENCY AND POWER STEERING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL.  THE POWER STEERING WOULD LOCK AND THE CONTACT WAS ABLE TO MANEUVER THE VEHICLE OFF THE HIGHWAY.  ONCE THE VEHICLE WAS SHUT OFF AND RESTARTED, THE WARNING INDICATORS WOULD NO LONGER ILLUMINATE; HOWEVER, THERE WAS A LOT OF PLAY IN THE STEERING.  THE MANUFACTURER STATED THAT THE VIN WAS NOT INCLUDED IN ANY RECALLS; THEREFORE, THEY WOULD NOT ASSIST WITH THE LIABILITY OF THE REPAIRS.  THE FAILURE AND CURRENT MILEAGES WERE LESS THAN 96,000.   UPDATED 3/16/09 *CN  THE CONSUMER STATED THERE WAS AN OCCASSIONAL SHIMMY IN THE STEERING WHEEL. UPDATED 03/19/09.*JB",
        "vin": "JT2BK18U620"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2009",
        "dateOfIncident": "12/29/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255422,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ON A TRIP AND AFTER START UP ON A COLD MORNING, I LEFT THE HOTEL PARKING LOT AND WAS PROCEEDING TO THE ON RAMP FOR THE INTERSTATE. WHILE I WAS TURNING LEFT, THE STEERING WHEEL BEGAN TO SHAKE VIOLENTLY FOR 3-4 SECONDS BEFORE IT SUBSIDED. I NOTICED THIS SHUTTERING OR STIFFNESS A FEW MORE TIMES BEFORE WE RETURNED FROM OUR TRIP. AFTER RETURNING HOME, WE TOOK IT TO A TOYOTA DEALER. THEY CHECKED IT OUT AND STATED,  \"CHECKED TO FIND POWER STEERING RACK & PINION GEAR IS CAUSING PROBLEM EST $2160.85. WOULD NEED TO ORDER PART # 44200-49055.\"   *TR",
        "vin": "JT2BK18U220"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/08/2009",
        "dateOfIncident": "01/02/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254313,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE AND ABS LIGHT CAME ON.  BRAKES LOST COMPLETE BRAKING ABILITY.  LUCKILY WE WERE ON A HILL OFF THE INTERSTATE EXIT WHEN THIS HAPPENED SO THE CAR COULD NOT GO FURTHER, THOUGH IT ALMOST CRASHED INTO THE PERSON IN FRONT OF US (THAT PERSON TURNED OFF ROAD).  THIS IS 100% DANGEROUS!  THE CAR CURRENTLY SITS AT MY HOUSE.  TOO DANGEROUS TO DRIVE.  WHEN BRAKE PADS WERE CHECKED LAST I WAS TOLD BRAKES WERE 80% NEW, SO IT IS CLEARLY NOT THE PADS.  *TR",
        "vin": "JT2BK18U220"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/02/2009",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253545,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON COLD DAYS WHEN THE CAR IS FIRST STARTED THE STEERING WHEEL SHAKES UNCONTROLLABLY WHEN PUT INTO REVERSE OR DRIVE. THE CAR HAS TO BE TURNED OFF AND RESTARTED TO GET IT TO STOP. THIS CONTINUES WHEN RESTARTED. THE CAR CANNOT BE DRIVEN DUE TO THIS SHAKING OF THE STEERING WHEEL.  *TR",
        "vin": "JT2BK12U220"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/15/2008",
        "dateOfIncident": "10/10/2008",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245605,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING I SMELLED SOMETHING BURNING IN THE CAR, I SHUT OFF THE AIR CONDITIONER.  I THEN TURN ON THE AIR AND NOTHING HAPPENED.  FINDING LATER THAT THE BLOWER MOTOR WIRING CONNECTOR UNDER THE DASH HAD BURNED UP, ALMOST CAUSING A FIRE.  (I HAVE PICTURES WHAT HAPPENED).  *TR",
        "vin": "JT2BK12U020"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/15/2008",
        "dateOfIncident": "08/04/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238360,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS, THIS CAR SUFFERS FROM AN INTERMITTENT STEERING SHAKE.  WHAT HAPPENS: OFTEN AT PARKING LOT SPEEDS AND SOME TIMES AT HIGHWAY SPEEDS, THE STEERING PULSES VIOLENTLY AND STEERING CONTROL IS TEMPORARILY LOST. *TR",
        "vin": "JT2BK12U020"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/27/2008",
        "dateOfIncident": "06/29/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235943,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT SEVERE STEERING WHEEL MOVEMENT AT LOW SPEED AND STEERING FAILURE WHICH ILLUMINATED THE PS FAILURE LIGHT. STEERING WAS DIFFICULT AFTER FAILURE. SYSTEM RESET AFTER IGNITION TURNED OFF. STILL HAVE SEVERE WHEEL VIBRATION. TOYOTA DEALERS STATE AN INTERNAL FAILURE IN THE RACK AND PINION.",
        "vin": "JT2BK18U720"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/12/2008",
        "dateOfIncident": "05/04/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227397,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 4TH, 2008, AT OR AROUND 12:30 PM, I WAS DRIVING MY 2002 TOYOTA PRIUS NORMALLY. THE HYBRID SYSTEM GAVE ME A TROUBLE LIGHT PRIOR TO LEAVING AN AUTO PARTS STORE PARKING LOT; HOWEVER, I ATTRIBUTED THE WARNING LIGHT TO A RECENTLY REPLACED CHARCOAL CANISTER AND DISMISSED THE WARNING LIGHT, BELIEVING IT TO BE RELATED TO THE RECENTLY REPLACED PART. I LEFT THE PARKING LOT AND PROCEEDED ON TO MY DESTINATION, WHICH WAS MY HOUSE, ABOUT 2 MILES AWAY FROM THE STORE. WITHOUT WARNING, AND SAFELY ON A STREET WITH LITTLE TRAFFIC, AS I WAS DRIVING UP A SLIGHT INCLINE, THE ENGINE FAILED TO START. THE HYBRID SYSTEM IS DESIGNED TO RUN PRIMARILY ON THE ELECTRIC MOTOR DRIVING THE WHEELS AND USE THE INTERNAL COMBUSTION ENGINE (ICE) FOR ADDED POWER WHEN THE ELECTRIC MOTORS DO NOT PROVIDE ENOUGH POWER. HOWEVER, IN MY SITUATION, THE CAR NEEDED MORE POWER, AND THE ENGINE FAILED TO START. I TRIED MULTIPLE TIMES TO GET THE ENGINE TO START BY CYCLING THE GAS PEDAL, BUT TO NO AVAIL - THE ICE STILL WOULD NOT START. I HAD TO PULL THE CAR OVER, SHUT IT OFF, AND RESTART THE CAR TO GET THE ICE RUNNING AGAIN. NORMALLY I WOULD NOT BE THIS CONCERNED ABOUT THIS PROBLEM, BUT HAD THIS ISSUE OCCURRED IN HEAVY TRAFFIC, THE CAR WOULD HAVE BEEN A HAZARD TO THE OCCUPANTS AS WELL AS OTHER DRIVERS ON THE ROAD - THE LOSS OF THE ICE IN A CRITICAL SITUATION COULD LEAD TO AN AUTOMOBILE ACCIDENT, ESPECIALLY IF ICE POWER IS LOST AT A CRITICAL TIME, SUCH AS ACCELERATING ONTO A BUSY FREEWAY. BECAUSE OF THIS POTENTIAL SAFETY ISSUE IT IS MY BELIEF THAT ANY YEAR OR MODEL OF THE TOYOTA PRIUS IS UNSAFE TO DRIVE ON THE ROAD AS THE ICE CAN BE UNRELIABLE, WHICH COULD POTENTIALLY LEAD TO AUTOMOBILE ACCIDENTS. I DID NOT TAKE THE CAR TO BE REPAIRED NOR DID I ATTEMPT TO RESOLVE THE ISSUE; ON MAY 5TH, I TRADED THE PRIUS IN FOR A DIFFERENT VEHICLE.  *TR",
        "vin": "JT2BK18U320"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/12/2008",
        "dateOfIncident": "01/27/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217791,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I GOT THIS VEHICLE IN 2005 FROM MY FATHER.  I HAVE SINCE THEN HAD TO REPLACE THE TIRES OF THIS CAR MANY TIMES AND I HAVE ALWAYS REPLACED THEM WITH THE TIRES RECOMMENDED FOR THE CAR.  SINCE THIS CAR IS A HYBRID, THE CAR REQUIRES TIRES MADE TO WITHSTAND THE WEIGHT OF THE CAR BATTERY AND THEREFORE THEY COST 100 DOLLARS OR MORE PER TIRE DEPENDING ON WHERE YOU PURCHASE THEM FROM.  THE INCIDENT DATE LISTED IS MY MOST RECENT TIRE FAILURE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "10/15/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215661,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS HYBRID.  WHILE DRIVING 55 MPH, THE POWER STEERING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL AND BEGAN FLASHING A WARNING.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY INFORMED THE CONTACT THAT IT WAS SAFE TO CONTINUE DRIVING.  THE FOLLOWING DAY THE VEHICLE WAS TAKEN TO ANOTHER DEALER AND THEY STATED THAT THE STEERING GEAR BOX AND ELECTRIC SYSTEM FAILED.  THE COST OF THE PART IS $1,800.  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT MILEAGE WAS 85,000 AND FAILURE MILEAGE WAS 83,000.",
        "vin": "JT2BK12U720"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2007",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209150,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA SEQUOIA WITH 62,000 MI. I HAVE BEEN TO TWO TOYOTA DEALERS TO FIGURE OUT MY PROBLEM. THE VSC TRAC, VSC OFF, ABS AND BRAKE LIGHTS ARE COMING ON.  FINALLY AFTER @$700 OF MY MONEY, THEY FIGURED OUT THE PROBLEM TO BE THE ECU.  THIS WILL NOW COST ME @1800 FOR PARTS, AND WHO KNOWS YET FOR LABOR.  I HAVE READ ONLINE THAT MANY OTHER TOYOTA OWNERS HAVE THE SAME PROBLEM.  THIS IS AN EXPENSIVE SITUATION, UNLESS YOU HAVE THE EXT. WARRANTY. I FEEL THAT TOYOTA NEEDS TO DO SOMETHING ABOUT THIS, MAYBE RECALL THIS AND FIX THESE CARS BEFORE THERE IS AN ACCIDENT. I LIVE IN NEW YORK WHERE THERE IS ALOT OF SNOW.  MY VSC WILL NOT WORK UNTIL I GET THIS FIXED. I HAVE TWO SMALL CHILDREN AND HAVE TO RELAY ON STANDARD BRAKES IN THE SNOW UNTIL THIS IS FIXED. TOYOTA SHOULD STAND BEHIND THEIR REPUTABLE NAME AND FIX THESE PROBLEMS ASAP..... *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/15/2007",
        "dateOfIncident": "10/09/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205751,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  WHILE DRIVING 55 MPH, THE POWER STEERING WARNING LIGHT ILLUMINATED.  THE CONTACT STATED THAT HE SLOWED DOWN TO EXIT THE HIGHWAY AND HIS POWER STEERING FAILED.  THE DEALER STATED THAT THE TORQUE SENSOR IN THE STEERING GEAR BOX FAILED.  A NHTSA RECALL WAS ESTABLISHED (NHTSA CAMPAIGN ID NUMBER: 00V285000).  REPAIRS WERE NOT MADE. THE DEALER INFORMATION IS NOT AVAILABLE. THE CURRENT AND FAILURE MILEAGES WERE 128,000.",
        "vin": "JT2BK18U320"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/09/2007",
        "dateOfIncident": "09/16/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205275,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  WHILE DRIVING BETWEEN 55-65 MPH, THE STEERING WARNING INDICATOR LIGHT ILLUMINATED AND THE POWER STEERING FAILED.  THE DEALER STATED THAT THERE WAS A FAULTY SENSOR AND THE RACK AND PINION NEEDED TO BE REPLACED.  THE VEHICLE HAS NOT BEEN REPAIRED.  NHTSA CAMPAIGN ID NUMBER 00V285000 (STEERING:GEAR BOX (OTHER THAN RACK AND PINION)) FOR A 2001 TOYOTA PRIUS WAS REFERENCED.  THE CURRENT AND FAILURE MILEAGES WERE 72,000.  UPDATED 10/23/07  *TR",
        "vin": "JT2BK18U420"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/03/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  EACH TIME THE VEHICLE IS DRIVING FORWARD OR IN REVERSE AT APPROXIMATELY 4 TO 10 MPH, IT SHAKES VIOLENTLY.  THE FAILURE OCCURS INTERMITTENTLY AND USUALLY IN COLD WEATHER.  THE VEHICLE SHAKES ROUGHLY AFTER IT HAS BEEN DRIVEN FOR A WHILE.  THE VEHICLE WAS TAKEN TO A DEALER ON TWO OCCASIONS.  SERVICE BULLETIN NUMBER 20040604 WAS REFERENCED.  THE DEALER DISCOVERED THAT THE STEERING RACK AND STEERING COMPUTER FAILED AND NEEDED TO BE REPLACED AT THE COST OF $2,200.  THE CURRENT MILEAGE WAS 50,000 AND FAILURE MILEAGE WAS 40,000.",
        "vin": "JT2BK18U820"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/26/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204905,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS WITH TRANS AXLE MALFUNCTIONS. SHE STATES HER VEHICLE ACTED AS IF IT WERE OUT OF GAS WHEN SHE HAD A FULL TANK, AND THE RED WATER TEMPERATURE LIGHT ILLUMINATED.  *KB  THE DRIVE BELT AND TENSIONER WERE REPLACED. *JB",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/06/2007",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202673,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 PRIUS SEAT BELT PROBLEMS MAKING IT UNSAFE TO DRIVE.  CUSTOMER STATES THE SEAT BELT HAD TORN OR BEEN CUT ALMOST ALL THE WAY THROUGH. CONSUMER STATES IT HAPPENED AGAIN TO THE REPLACEMENT SEAT BELT.  *KB  THE DEALER INFORMED THE CONSUMER THAT THE SECOND INCIDENT WAS PROBABLY DUE TO USER ERROR OR BECAUSE THEIR DOG CHEWED ON THE SEAT BELT. TOYOTA REFUSED TO REIMBURSE THE CONSUMER A SECOND TIME. *JB",
        "vin": "JT2BK184020"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/24/2007",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198038,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA PRIUS REAR ALIGNMENT CUSTOMER STATES THAT THE REAR TIRES CANNOT BE ALIGNED DUE TO THE CONSTRUCTION OF THE VEHICLE**CC  UPON TAKING THE VEHICLE ON THE DATE OF DELIVER THE CONSUMER  NOTICED THE SWAYING OF THE REAR END OF THE CAR AND THE REAR TIRES WERE BE SEVERELY WORN. THE DEALER TRIED NUMEROUS TIMES TO FIX THE DEFECT BUT TO NO AVAIL, THE TIRES WOULD DETERIORATING EVERY 3,000 MILES. THE CONSUMER STATED THE DEALER INFORMED HIM THERE WAS NOTHING THAT THEY COULD DO. THE CONSUMER WAS TOLD TO RETURN TO THE DEALER EVERY 3,000 MILES TO INSPECT THE TIRES.  THAT TASK WAS DONE UP UNTIL NOVEMBER 2006 UNTIL THE CONSUMER WAS INFORMED YET AGAIN TO PURCHASE 4 NEW TIRES. THE CONSUMER TOOK THE VEHICLE TO ANOTHER DEALER IN FEBRUARY WHO INFORMED HIM THE REAR AXLE WAS BENT CAUSING THE DEFECT. THE CONSUMER HAS SINCE TRIED TO CONTACT THE ORIGINAL DEALER AND MANUFACTURER WHO INFORMED HIM TO PURSUE THE DEALER OR TAKE IT TO A GOVERNMENT AGENCY.  *TR",
        "vin": "JT2BK12U810"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/22/2007",
        "dateOfIncident": "05/22/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 TOYOTA SEQUOIA IN NOVEMBER 2002.  WHEN THE VEHICLE WAS PURCHASED THE SALES PERSON TOLD ME THAT THE HEATING/AIR CONDITIONER SYSTEM APPEARED TO BE A POORLY DESIGNED,  BUT I DID NOT THINK THAT A BIG OBSTACLE TO MY PURCHASE.  I  HAD CONTINUAL PROBLEMS TRYING TO REGULATE THE TEMPERATURE IN THE VEHICLE.  IT  WAS EITHER 65 DEGREES AND THE NEXT LEVEL DOWN  WAS  COLD.   I WAS  ALWAYS FLIPPING THE KNOB BACK AND FORTH  TRYING  TO REGULATE THE TEMPERATURE.  THIS WAS  NOT A BIG SAFETY ISSUE UNLESS TAKING MY EYES OFF THE ROAD FOR THESE ADJUSTMENTS CAN BE CONSIDERED HAZARDOUS.  BUT I LIVE IN A SOMEWHAT COLD CLIMATE AND I HAVE HAD TROUBLE KEEPING THE WINDOWS DEFROSTED ON SOME DAYS PARTICULARLY IF THE HUMIDITY WAS  HIGH.  THIS COULD BE  CONSIDERED  A SAFETY ISSUE. I JUST TOOK THE  VEHICLE TO THE TOYOTA SERVICE DEPARTMENT BECAUSE  AIR CONDITIONER LIGHT WAS BLINKING.  LOOKING AT A REPAIR BILL OF AROUND $1,600.00 FOR A NEW COMPRESSOR AND CLUTCH.  OF COURSE, I DO NOT HAVE AN EXTENDED WARRANTY AS THIS  WAS MY  SIXTH TOYOTA ,AND I HAVE NEVER HAD ANY PROBLEMS SUCH AS THIS IS THE PAST.  SINCE I HAVE READ THAT OTHERS HAVE EXPERIENCED THE SAME PROBLEMS I WOULD URGE SOMEONE TO LOOK INTO THE ISSUE BEFORE SOMEONE GOT  KILLED BECAUSE OF INABILITY TO SEE OUT THE FRONT WINDOW.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/19/2007",
        "dateOfIncident": "05/11/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191237,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE WEEK AGO I WAS RUNNING ERRANDS WITH  THE TOYOTA SEQUOIA, BUT THE CAR REFUSED TO START ONCE I COMPLETED MY ERRANDS.  EVENTUALLY, THE CAR HAD TO BE TOWED AND THE REPAIR SHOP REPORTED THAT THE GEAR SHIFT BRACKET AND LEVER WERE BROKEN AND THEREFORE PREVENTED THE GEAR FROM PROPERLY GOING INTO PARK.  THE REPAIR SHOP REPORTED SEEING SEVERAL SUCH CASES RECENTLY BUT STATED THAT TOYOTA HAS INFORMED HIM THAT THE PROBLEM RESULTED  FROM IMPROPER HANDLING OF THE GEAR SHIFT.  I HAD  THECAR FOR MORE THAN 5 YEARS AND HAVE ALWAYS FOLLOWED THE PROPER PROCEDURE.  PERHAPS THIS NEEDED  FURTHER INVESTIGATION.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/05/2007",
        "dateOfIncident": "09/22/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187099,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  THE CONTACT STATED THAT THE STEERING WHEEL JERKED VIOLENTLY WHEN MAKING SHARP RIGHT AND LEFT TURNS.  DURING THIS FAILURE THE POWER STEERING INDICATOR DIMMED.  THE DEALER STATED THAT THE TORQUE CONVERTER SENSOR PROVIDED ABNORMAL READINGS.  THE CURRENT MILEAGE  WAS 103,000,  AND FAILURE MILEAGE WAS 98,000.*AK",
        "vin": "JT2BK12U020"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/14/2007",
        "dateOfIncident": "01/02/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182540,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CHECK ENGINE LIGHT ON MY CAR CAME ON AND THE ENGINE STALLED.  THE CAR HAD TO BE TOWED TO THE DEALER.  THE CAR WAS REPAIRED AT A COST TO ME OF $1100.  THE THROTTLE BODY HAD TO BE REPLACE, AND ALSO THE ECM.  THE CAR ONLY HAS 75000 MILES.  *NM",
        "vin": "JT2BK18U820"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/02/2007",
        "dateOfIncident": "01/20/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181435,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1:40 PM, JAN 20, 2007, I WAS DRIVING MY SEQUOIA N/B ON SIERRA HWY IN THE CITY OF SANTA CLARITA. I WAS TRAVELING APPROX 40-45 MPH. I NOTICED A SLIGHT STIFFNESS IN THE STEERING. A SHORT TIME LATER THE LEFT FRONT OF MY VEHICLE VIOLENTLY FELL TO THE GROUND. THERE WERE VEHICLES BEHIND ME AND WITH DIFFICULTY I STEERED TO THE CURB. WHEN THE VEHICLE FELL TO THE GROUND, I HEARD A LOUD 'BANG', AND I FELT THAT I LOST SOME OF MY BRAKES. ONE OF THE DRIVERS BEHIND ME TOLD ME SHE SAW SPARKS COMING FROM UNDER MY VEHICLE. I LOOKED AT THE FRONT OF MY VEHICLE. I SAW THE LEFT FRONT TIRE, WHEEL & HUB (ALL STILL ATTACHED) FOLDED UNDER THE LEFT RUNNING BOARD PREVENTING THE FRONT FENDER AND BUMPER FROM FALLING DIRECTLY TO THE ROADWAY. I SAW THAT THE BRAKE LINES APPEARED TO BE BROKEN. I HAD THE VEHICLE TOWED TO TOYOTA ON MON, JAN 22, 2007. I WAS TOLD THAT IT APPEARED THE LEFT UPPER BALL JOINT HAD BROKEN CAUSING THE WHEEL TO BREAK AWAY FROM THE VEHICLE. THE DEALERSHIP CONTACTED THEIR SERVICE DIRECTOR TO DETERMINE WHAT REPAIRS SHOULD BE MADE. I WAS SUBSEQUENTLY TOLD THAT MY VEHICLE WAS OUT OF WARRANTY AND THAT TOYOTA HAD 'NO LIABILITY' TO REPAIR MY VEHICLE AT THEIR EXPENSE. REPAIR ESTIMATE IS APPROX $5,000. + THE RENTAL VEHICLE THEY ARRANGED. I WAS TOLD A REGIONAL SERVICE INSPECTOR WOULD LOOK AT MY VEHICLE. I TOLD THEM THAT I WANTED THE OLD PARTS IF  REPAIRS WERE TO BE MADE. I AM NOW AFRAID TO DRIVE MY VEHICLE. I WENT TO THE TOYOTA WEB SITE AND NOTICED NUMEROUS RECALL NOTICES FROM TOYOTA FOR FRONT BALL JOINT FAILURES ON MY TYPE OF VEHICLE. I RECEIVED NO RECALL NOTICES FROM TOYOTA. TOYOTA STATED MY VIN WAS NOT ON THE LIST FOR ANY RECALL NOTICES. THE TOYOTA SERVICE DEPT STATED THAT THIS WOULD NOT BE CONSIDERED 'NORMAL WEAR AND TEAR' THAT WOULD REQUIRE ME TO HAVE THIS ITEM CHECKED DURING ALL OF MY REGULAR MAINTENANCE SERVICES.  THIS FAILURE COULD HAVE BEEN MUCH WORSE, CAUSING SERIOUS INJURY TO MYSELF AND OTHERS ON THE ROAD. AS OF THIS DATE I HAVE NOT BEEN NOTIFIED THAT THE REGIONAL INSPECTOR HAS INSPECTED MY VEHICLE. *JB",
        "vin": "5TDZT34A92S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/10/2007",
        "dateOfIncident": "01/10/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178383,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "\"CHECK ENGINE LIGHT\" CAME ON.  DEALERSHIP ADVISED NEW CATALYTIC CONVERTER NEEDED TO BE REPLACED ON MY 2002 TOYOTA PRIUS (85,000 MILES) AND WOULD COST $ 2,000.00  USD.  THIS IS OUTRAGEOUS AND SHOULD BE INVESTIGATED!  *JB",
        "vin": "JT2BK12U920"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/02/2007",
        "dateOfIncident": "12/04/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177550,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INCIDENT: CAR ENGINE ON 2002 PRIUS HAVING TROUBLE STARTING AND DYING AFTER HAVING BEEN STARTED. WE WERE TOLD THAT THE \"ENGINE CONTROL UNIT\" WAS SHOWING AN ERROR AND DUE TO A MANUFACTURING OR SOFTWARE PROBLEM, COULD NOT BE REPROGRAMMED AND HAD TO BE REPLACED. *JB",
        "vin": "JT2BK18U620"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/29/2006",
        "dateOfIncident": "10/28/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174640,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NHTSA RELEASED A REPORT ON TOYOTA PRIUS 2002 RECALL LAST JULY 06 AND TOYOTA WILL RECALL THIS BY AUG 06, BUT THERE NOT DOING IT.  VEHICLE SAFETY DEFECT/NONCOMPLIANCE NOTICES RECEIVED DURING JULY ...  ... 34,771 MY 2001-2002 ECHO AND PRIUS PASSENGER VEHICLES. ... WHICH COULD CAUSE THE ENGINE TO STALL WHILE DRIVING ... THE RECALL IS EXPECTED TO BEGIN EARLY AUGUST 2006. ...   TOYOTA AND DEALERSHIP ARE TRIED TO GET AWAY FROM THIS ISSUE TO MY CAR PRIUS 2002. AT THE DEALER THEY TRIED TO CHARGE ME FOR $10,000 TO FIX THIS AND NOT GUARANTEEING THAT WILL SOLVE THE STALLING PROBLEM THAT WAS LAST OCT 06. DEALERSHIP ARE NOT TRAIN TO DIAGNOSE PRIUS CAR BUT THEY SELLING FOR IT. PROOF THEY WANT ME TO PAY $600 JUST TO DIAGNOSE FOR SPECIALIST TECHNICIAN. NOW THEY (TOYOTA) TRYING TO GET AWAY TO FIX STALLING PROBLEM TO MY PRIUS 2002. PLEASE HELP, AS I'M OLD NOW GOING BROKE.   *NM",
        "vin": "JT2BK18U120"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/04/2006",
        "dateOfIncident": "06/19/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171185,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 PRIUS HAS HAD NUMEROUS PROBLEMS WITH TIRES HAVING TO BE REPLACED OR REPAIRED.  *TS  THE CONSUMER HAS HAD TO REPLACED 6 TIRES AND HAS HAD 3 TIRES REPAIRED.  THE TIRE ON THE VEHICLE ARE SPECIAL TIRE AND CAN ONLY BE PURCHASED AT A TOYOTA DEALER.  *NM",
        "vin": "JT2BK18U920"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/28/2006",
        "dateOfIncident": "09/26/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169560,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING FAILURE. WHEN FIRST STARTING CAR STEERING CAN SOMETIMES VIBRATE VIGOROUSLY, THEN  WARNING LIGHT CAN COME ON SOMETIMES  POWER STEERING WORKS FOR A WILE THEN FAIL OTHER TIMES IT FAILS IMMEDIATELY MAKING STEERING VERY DIFFICULT.  *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/12/2006",
        "dateOfIncident": "07/09/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167957,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED 2002 PRIUS IN JUNE, 2005.  IN SEPTEMBER 2005 POWER STEERING WARNING LIGHT CAME ON 3 TIMES WHILE DRIVING ON FREEWAY BETWEEN TUCSON AND PHOENIX.  DEALER SAID THE POWER STEERING TORQUE SENSOR WAS MALFUNCTIONING AND WOULD COST $1450.00 TO REPLACE.  TOOK TO MY OWN MECHANIC (AUTHORIZED PRIUS MECHANIC) WHO CONFIRMED THE DEALERS ASSESSMENT AND ALSO TOLD ME THAT TOYOTA DOES NOT PROVIDE PARTS TO REPAIR THE POWER STEERING SO ENTIRE UNIT MUST BE REPLACED.  PROBLEM DISAPPEARED FOR ABOUT 1 YR.  THEN IN JULY OF THIS YEAR, POWER STEERING WARNING LIGHT STARTED TO COME ON WHILE DRIVING FROM TUCSON TO LAS CRUCES.  ALSO, STEERING WHEEL STARTED TO SHAKE UNCONTROLLABLY WHEN BACKING UP OR TURNING WHILE CAR WAS IN MOTION.  BATTERY ALSO FAILED WHEN ATTEMPTING TO LEAVE NM AND HAD TO REPLACE BATTERY AT A COST OF $140 WITH ONLY A ONE YEAR WARRANTY AND NO ONE EXCEPT TOYOTA SELLS THE BATTERY.  AFTER DISCUSSING PROBLEMS WITH MY MECHANIC I CALLED TOYOTA TO SEE IF THEY WOULD REPLACE POWER STEERING COLUMN - THEY TOLD ME MY CAR WAS TOO OLD AND HAD TOO MANY MILES ON IT (ONLY 59K).  I OWN A 1975 CELICA THAT HAS 265K MILES AND IT HAS NEVER NEEDED ANY STEERING COLUMN WORK - HOW COME A CAR 30 YEARS LATER NEEDS ONE AFTER ONLY 59K?  I USED TO THINK TOYOTA MADE A GOOD PRODUCT AND STOOD BY THEIR CARS, BUT I GUESS I WAS WRONG.  THE 2002 PRIUS IN NOT A ROAD-WORTHY CAR AND THE SAVINGS IN GASOLINE CONSUMPTION DOES NOT COME ANYWHERE CLOSE TO PAYING FOR A $1450 REPAIR ON AN OBVIOUSLY DEFECTIVE STEERING COLUMN.   I DO NOT FEEL SAFE TAKING THE PRIUS OUT ON THE FREEWAY AND STEERING WHEEL CONTINUES TO SHAKE UNCONTROLLABLY.  I WILL REPLACE THE POWER STEERING UNIT ONLY WHEN REPAIR PARTS BECOME AVAILABLE OR THE PART BREAKS DOWN COMPLETELY.  I DOUBT I WILL KEEP THIS CAR VERY LONG AND I KNOW I WILL NOT BUY ANOTHER TOYOTA IN THE FUTURE.  NOW WHEN I AM ASKED HOW I LIKE MY PRIUS I TELL PEOPLE TO BUY A HONDA CIVIC INSTEAD.  *NM",
        "vin": "JT2BK18U320"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/04/2006",
        "dateOfIncident": "08/28/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167311,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT CAME ON FREQUENTLY. DEALERSHIP REPORTS BRAKE ACCUMULATOR BOOSTER ASSEMBLY LEAKING. DEALERSHIP TOLD ME IT WAS  A SAFETY ISSUE THAT COULD CAUSE BRAKE FAILURE. DEALERSHIP REPLACED THE BRAKE BOOSTER, ACCUMULATOR ASSEMBLY.   *JB",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/24/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166452,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING IN CAR LOCKS UP AT HIGHER SPEEDS. THE ISSUE SEEMS CONSISTENT WITH THE 2001 RECALL ITEMS. TOYOTA CUSTOMER SERVICE REFUSES TO OFFER ASSISTANCE WITHOUT CHARGING AND CLAIMS STEERING TO NOT BE COVERED UNDER POWER TRAIN WARRANTY.  *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2006",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162367,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A YEAR AGO, I HAD MY 2002 TOYOTA PRIUS SHIPPED TO ITALY WHILE I WAS ON SABBATICAL.  STARTING IN OCTOBER (2005), I STARTED REPORTING TO THE LOCAL TOYOTA DEALER THAT THE STEERING WAS STIFF WHEN RETURNING THE WHEEL STRAIGHT AHEAD ON SHARP TURNS OR WHEN MOVING OUT OF TIGHT PLACES WHERE I HAD PARKED.  I RETURNED TO THE US FOR THE SPRING SEMESTER, BUT RETURNED IN JUNE, AND FOUND THE SAME INTERMITTENT PROBLEM.  MY FIRST THOUGHT WAS THAT THERE HAD BEEN SOME DAMAGE TO THE CAR DURING SHIPPING.  THIS PAST SUNDAY (JULY 9, 2006), HOWEVER, I HAD A CATASTROPHIC INCIDENT THAT MIGHT HAVE SENT MY WIFE AND ME OFF THE SMALL COUNTRY ROAD WE WERE TRAVELING ON ABOUT A HALF MILE FROM OUR HOME HERE SOUTH OF FLORENCE IN THE CHIANTI REGION.  I HAD BEEN ON A STEADY DOWNHILL STRETCH WHICH THEN REVERSED TO IN AN S-CURVE ON AN INCLINE.  I TURNED NORMALLY THROUGH THE FIRST HALF OF THE S-CURVE WHEN SUDDENLY THE STEERING WHEEL FROZE SOLID IN A STRAIGHT FORWARD POSITION AND I HAD TO JAM ON THE BRAKES TO STOP FORWARD MOTION OF THE CAR OR GO OFF THE SIDE OF THE ROAD INTO A RAVINE.  I WAS PROBABLY TRAVELING UNDER 15-20 MPH, BECAUSE THE CURVES WERE SO SHARP AND I WAS TRAVELING UPHILL.  TO GET OFF THE ROAD, I STOPPED AND STARTED THE PRIUS A COUPLE OF TIMES TO SEE IF THIS WERE AN ELECTRICAL-COMPUTER FAULT AS THE STEERING SYSTEM IN THIS CAR HAD BEEN REPLACED AT 26,000 MILES (MORE ABOUT THIS LATER).  ON ABOUT THE THIRD TRY, I WAS ABLE WITH TREMENDOUS FORCE TO MOVE THE WHEEL OFF CENTER AND NORMAL STEERING WAS RESTORED.  BECAUSE THERE WAS NO ADEQUATE SHOULDER ON THE ROAD, I RETURNED THE CAR HOME, EXPERIENCING THE SAME STEERING WHEEL LOCK-UP MORE THAN ONCE, JAMMING ON THE BRAKES TO BRING THE CAR TO A HALT, AND THEN WRESTLING WITH THE STEERING WHEEL TO THE RIGHT AND THE LEFT WITH THE SAME IMMENSE FORCE UNTIL IT BROKE FREE.  THIS WAS NOTHING LIKE THE PREVIOUS STIFFNESS I HAD EXPERIENCED BRINGING THE WHEEL BACK TO CENTER FROM A FAR LEFT OR FAR RIGHT POSITION.   (TO BE CONTINUED). *JB",
        "vin": "JT2BK18U120"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2006",
        "dateOfIncident": "07/09/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162368,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUATION OF COMPLAINT (ODI NUMBER) 10162367  THE STEERING WAS EACH TIME FROZEN IN THE CENTER POSITION WITH NO POSSIBILITY OF TURNING TO THE RIGHT OR LEFT.  THE EARLIER PROBLEM WAS NOT DEMONSTRABLE TO THE TOYOTA SERVICE MANAGER WHEN THE CAR HAD BEEN BROUGHT IN FOR SERVICING IN OCTOBER 26, 2005 AND MARCH 2, 2006 (DURING A ONE WEEK VISIT), BUT BECAUSE I HAD MORE TIME IN JULY, I HAD SCHEDULED A TOTAL INSPECTION FOR THE STEERING MECHANISM ON TUESDAY, JULY 11TH.  AFTER THIS CATASTROPHIC FAILURE, HOWEVER, I HAD THE CAR IMMEDIATELY TOWED TO BI AUTO TOYOTA IN FLORENCE FOR REPAIR.  DESPITE THE FACT THAT THE TOWING CHARGE WAS MORE THAN $200, I HAD NO CONFIDENCE THAT THIS CAR COULD BE DRIVEN SAFELY TO THE DEALERSHIP.    AT THE DEALERSHIP, THE SERVICE TECHNICIANS IDENTIFIED THE PROBLEM AS REQUIRING THE REPLACEMENT OF THE SCATOLA GUIDA, A PART WITH A PRICE-TAG OF 2840 EUROS (APPROXIMATELY $3500).  WHEN I CALLED BACK TO MY TOYOTA DEALER IN PITTSBURGH, I WAS TOLD THAT THE MOST EXPENSIVE STEERING PART THAT COULD BE PURCHASED WAS THE STEERING RACK WHICH WAS ABOUT $1100.  HOWEVER, THE BELLS AND WHISTLES WENT OFF WHEN BI AUTO PROVIDED THE PART NUMBER 44200-47060.  THIS SAME PART WAS REPLACED BY ROHRICH TOYOTA IN PITTSBURGH ON MAY 14, 2004, AT 26,539 MILES.  REPLACEMENT WAS SOON FOLLOWED WITH A WARRANTY EXTENSION.  SIMILAR EXPERIENCES TO MINE ARE DOCUMENTED AT HTTP://WWW.PRIUSONLINE.COM/VIEWTOPIC.PHP?T=539&HIGHLIGHT=, BUT AS FAR AS I KNOW, NO ONE HAS REPORTED THIS SECOND INCIDENT TWO YEARS AND 20,000 MILES LATER (THE PRIUS ODOMETER NOW READS APPROXIMATELY 47,000 MILES).   MOREOVER THE SYMPTOM FOR THE FIRST REPLACEMENT WAS A VIBRATION WHEN STARTING THE ENGINE AND SHIFTING INTO REVERSE.  OTHER INDIVIDUALS HAVE REPORTED THE TURNING STIFFNESS EARLIER AND EXCESSIVE AND UNEVEN TIRE WEAR (MY REAR TIRES WERE BADLY WORN AT 24,000 MILES), BUT THIS IS THE FIRST TIME FOR ME THAT THIS TOTAL FREEZING OF THE STEERING WHEEL IN A STRAIGHT FORWARD POSITION HAS OCCURRED.  *JB",
        "vin": "JT2BK18U120"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2006",
        "dateOfIncident": "07/09/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162369,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONTINUATION OF COMPLAINT (ODI NUMBERS) 10162367-68   EARLIER THAT DAY WE HAD DRIVEN MY DAUGHTER-IN-LAW AND GRANDDAUGHTER TO FUMICINO AIRPORT IN ROME AND THEN RETURNED HOME.  WE COULD ONLY IMAGINE WHAT A CATASTROPHE WOULD HAVE OCCURRED IF THAT FREEZING OF THE STEERING WHEEL HAD OCCURRED AT AUTOSTRADA SPEEDS.  IN THE MEANTIME, BI AUTO IN FLORENCE HAS INFORMED ME THAT THE PART (NO 44200-47060) MUST BE DELIVERED FROM JAPAN AND WILL TAKE A MINIMUM OF 10 DAYS.  IN AN ATTEMPT TO EXPEDITE SERVICE, I CONTACTED THE TOYOTA CUSTOMER SERVICE IN TORRANCE, CALIFORNIA (REF # 200607110691) TO SEE IF THE PART MAY BE MORE READILY AVAILABLE AND SHIPPED SOONER FROM THE US.  THEIR ANSWER WAS NO.  FURTHER, THEY INDICATED THAT SINCE THE PRIUS WAS OUTSIDE THE US, THEY WERE NOT WILLING TO HONOR THE WARRANTY EXTENSION AND THUS THE $3500 REPAIR WOULD BE AT MY EXPENSE.  I WILL NOW CONTACT MY US DEALER (I BOUGHT A SECOND PRIUS IN 2004, WHICH IS STILL IN THE US) TO SEE IF THEY WILL INTERCEDE ON MY BEHALF.  BUT WHAT'S ESPECIALLY TROUBLING IS EVEN IF THIS REPLACEMENT PERFORMED IS WHETHER (1) TOYOTA HAS MADE ANY IMPROVEMENT IN THE REPLACEMENT PART TO ELIMINATE THE FAILURE (APPARENTLY THE 2004 REPLACEMENT WAS INEFFECTIVE), (2) FOR HOW MANY MILES MIGHT THIS NEW REPLACEMENT PART LAST, AND (3) WILL THERE BE ANY WARNING, SUCH AS THE STIFFNESS IN TURNING, THAT WILL PRECEDE A CATASTROPHIC FAILURE SUCH AS THIS FREEZING OF THE STEERING WHEEL.  FOR THE ONLINE FORM, I HAVE PROVIDED MY US CONTACT NUMBERS.  HOWEVER, UNTIL AUGUST 6TH, I WILL CONTINUE TO BE IN ITALY.  *JB",
        "vin": "JT2BK18U120"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/17/2006",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150556,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE LOCATION OF THE GEAR SHIFTER ALLOWED THE GEARS TO BE SHIFTED BY ACCIDENT.  THE GEARS WERE CHANGED ACCIDENTALLY FROM DRIVE TO NEUTRAL WHILE PULLING OUT FROM A STOP LIGHT.  THE LACK OF A LOCKING MECHANISM ALLOWED THE VEHICLE TO BE SLIPPED FROM REVERSE TO DRIVE BY ACCIDENT AS WELL.  THE MANUFACTURER HAD NOT BEEN ALERTED.  UPDATED 03/28/06. *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2006",
        "dateOfIncident": "01/20/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ILLUMINATED.  TOOK  VEHICLE TO DEALER , WHO DETERMINED  FUEL TANK  RUPTURED.  EXPENSIVE REPAIR  WERE MADE.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/28/2005",
        "dateOfIncident": "09/06/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143809,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED WHEN THE WARNING LIGHTS CAME ON THE CAR STALLED AND EVENTUALLY CAME  TO A COMPLETE STOP. ON SEPTEMBER 6, 2005 THE CAR SLOWED DOWN TO 37 MPH. THE WARNING LIGHTS CAME ON AND THE CAR STOPPED. THE DEALER SAID IT WAS THE ACCELERATOR ASSEMBLY,  WHICH WAS REPLACED AT THE CONSUMERS EXPENSE.  ON NOVEMBER 14, 2005 THE COOLANT LIGHT CAME ON AND THE VEHICLE WOULD NOT ACCELERATE,  AND THEN  CAME TO A COMPLETE STOP. THE DEALER SAID IT WAS THE COOLANT SENSOR IN THE TRANSAXLE. THE TRANSAXLE WAS REPLACED AT THE  CONTACT'S EXPENSE.   AFTER  PICKING UP THE CAR ON NOVEMBER 23, 2005 THE PROBLEM STOPPED.  PRIOR TO SEPTEMBER 6, 2005 THE ONBOARD COMPUTER WAS REPLACED DUE TO THE AFOREMENTIONED PROBLEM.  THE COMPUTER WAS REPLACED UNDER WARRANTY. *AK  UPDATED 12/2705. *JB",
        "vin": "JT2BK18UX20"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/15/2005",
        "dateOfIncident": "10/15/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139794,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CHECK ENGINE LIGHT KEPT COMING ON THEN GOING OFF. TOOK TO DEALER BUT THEY COULDN'T GET IT TO DUPLICATE PROBLEM. WHILE THERE THEY NOTICED TIRES WERE SEVERELY WORN. TOLD ME I NEEDED 4 NEW TIRES AND A 4 WHEEL ALIGNMENT AT 27,008 MILES. PURCHASED 4 175/65R14 RE 92 EXTRA LOAD TIRES. LEFT AFTER PAYING FOR REPAIRS INCLUDING AN OIL CHANGE OF $557.61 N  AUGUST 3, 2004.   OCTOBER 8, 2005 HAD TWO NEARLY FLAT FRONT TIRES. HAVE HAD TO PUT AIR INTO TIRES SEVERAL TIMES OVER THE PAST 4 MONTHS - EVEN TOOK CAR TO AUTO GARAGE THAT CHANGED TIRES FROM WINTER TO SUMMER THINKING THEY PUT THEM ON WRONG. OCT. 12, 2005 STARTED HEARING A HUMMING NOISE IN FRONT LEFT TIRE. TOOK TO AUTO GARAGE ON OCT 15, 2005 TO BE TOLD THAT ONCE AGAIN TIRES NEEDED TO BE REPLACED AGAIN BECAUSE THEY WERE WORN DUE TO NEEDING A FRONT END ALIGNMENT AND FRONT LEFT TIRE NEEDED A BALL BEARING.  INSIDE WALL OF TIRES IS WORN OFF AND DANGER OF TIRE BLOW-OUT. REAR TIRES ALSO SHOW SIGNS OF PREMATURE WEAR ON INSIDE WALL AND SHOULD BE REPLACED SOON. CURRENT MILEAGE IS 44,804. I ALSO PUT ON WINTER TIRES EVERY AUTUMN ONTO THE FRONT. GARAGE TECHNICIAN SAID THERE WAS SOMETHING WRONG WITH BURNING THROUGH 2 SETS OF 4 TIRES WITHIN 45,000 MILES AND I SHOULD CONTACT DEALER. *JB",
        "vin": "JT2BK18U520"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "04/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139899,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER VEHICLE HAS IN BEEN IN THE SHOP FOR REPAIRS SINCE APRIL 05. CONSUMER FEEL THE VEHICLE IS UNABLE TO BE REPAIRED. *TS  THE CONSUMER DID NOT STATE WHAT THE PROBLEMS WERE. *JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/30/2005",
        "dateOfIncident": "09/24/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138243,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST LEFT ONE AREA OF A PARKING LOT AND WAS TRAVELING TO ANOTHER AT A LOW RATE OF SPEED (5 TO 15 MPH) SO MY 2002 TOYOTA PRIUS WAS RUNNING UNDER ELECTRICAL POWER.  I TURNED RIGHT TO PULL INTO A PARKING SPACE BETWEEN TWO SUVS, COASTING IN WITH MY FOOT OVER THE BREAK PEDAL. WHEN I WAS MORE THAN HALFWAY INTO THE PARKING SPACE, THE CAR SUDDENLY SHOT FORWARD JUMPING THE CURB AND STOPPING ONLY WHEN IT HIT A STONE PILLAR.  WHEN I LOOKED DOWN (AFTER CHECKING TO SEE IF MY 13 YEAR OLD SON WAS ALRIGHT, I SAW THAT MY FOOT WAS ON THE BRAKE PEDAL.  FORTUNATELY NO PEDESTRIAN WAS IN THE WALKWAY, AND I DID NOT HIT THE SUV TO MY RIGHT OR LEFT. HOWEVER, THE UNEXPECTED ACCELERATION WAS NOT A RESULT OF PRESSING ON THE GAS PEDAL.  *JB",
        "vin": "JT2BK18UX20"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "11/25/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137876,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2002 TOYOTA RUNNER. THE CONSUMER  RECEIVED A RECALL LETTER FOR LOWER BALL JOINT.    THE CONSUMER  STATED  THE WHEELS WERE  CUTTING THE TIRES ON FRONT WHERE LOWER BALL JOINT WAS LOCATED.  THE CONSUMER  CONTACTED TOYOTA, WHO SAID IT IS NOT RELATED TO LOWER BALL JOINT, AND THEY COULD  NOT DO ANYTHING ELSE FOR  THE CONSUMER. THIS HAS BEING HAPPENING SINCE THE CONSUMER  BOUGHT VEHICLE.  IT  HAS 30,000 MILES , AND NEEDED  NEW TIRES.*AK",
        "vin": "JT3GN87R020"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/26/2005",
        "dateOfIncident": "07/10/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130146,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURACHASE MY TOYOTA SEQUOIA IN AUGUST 2003 FOR THE FIRST SEVERAL MONTH THE VEHICLE WAS NOT DRIVE THAT MUCH, BECAUSE OF MY WIFE'S ILLNESS.  WITHIN EIGHT MONTHS THE FRONT DOOR HANDLE BROKE, IT WAS UNDERWARRANTY AND I DID NOT THINK MUCH OF IT, IN APRIL OF THIS YEAR 2005, THE REAR PASSENGER SIDE DOOR HANDLE BROKE AND AGAIN I DID NOT THINK  MUCH OF IT.  THREE WEEKS AGO ON SUNDAY ONE OF THE MEMBER FROM THE CHURCH WAS ATTEMPTING TO RETREIVE HIS BAG AND THE HANDLE BROKE.  WHEN I WENT TO THE DEALER SHIP TO ASK ABOUT REPAIR THEY INFORMED ME THAT IT WOULD BE $300.00, AND 200.00 TO FIX THE PASSANGER SIDE. MY COMMENT TO THEM WAS CONCERNING THE REAR DOOR, WHICH I HAD NOT USED THAT MUCH AND OVER THE LAST 6 MONTH MAYBE 3 TIME AT THE MOST PER WEEK, CERTAINLY NOT ALOT.  WHAT WAS AMAZING TO ME WAS THAT THE DOOR HANDLE MECHANISM IS MADE OF PLASTIC AND SO IS THE PASSENGER DOOR HANDLE. MY CONCERN AS A CONSUMER THAT TOYOTA DID NOT DO DUE DILIGENCE TO USE A PLASTIC DOOR HANDLE AND MECHANISM AND GIVEN THAT THINGS BREAK SHOULD NOT HAVE A PRICE TAG OF 300.00 TO REPLACE.  I CONTEND THAT METAL PARTS SHOULD HAVE BEEN USED WITH THE UNDERSTANDING AND CONSIDERATION OF THE USE OF THE HANDLES.  CONSUMERS SHOULD NOT BE AT THE MERCY OF CAR MANUFACTURES TO PUT ANYTHING INTO A CAR THAT WOULD UTIMATELY WOULD PROVE NOT IN THE CONSUMERS BEST INTEREST.  I AM SUGGESTING THAT THERE SHOULD BE A RECALL ON ALL TOYOTA' DOOR HANDLES.  PARTICULARLY THE TRUCK WHICH BY DESIGN ARE SUPPOSE TO ENDURE TOUGH USESAGE.",
        "vin": "5TDZT34AX2S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/19/2005",
        "dateOfIncident": "06/05/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A TOYOTA SAQUOIA LIMITED 4X4 USED IN 2003.  WHEN I TOOKIT TO A FRIENDS HOUSE HER HUSBAND SIAD I SHOULD GET THAT TICKING NOISE CHECKED OUT.  I TOLD HIM THAT ALL OF THE SUV'S AT THE DEALERSHIP MADE THE TICKING NOISE.  WELL, HE WAS RIGHT.  WHEN I TOOK IT IN TO BE INSPECTED I WAS TOLD THAT I HAD A CRACKED MANIFOLD.  THE MECHANIC SAID THAT ALL OF THE TOYOTA SUV'S AND TRUCKS HAVE PROBLEMS WITH THEIR MANIFOLDS.  IF THIS IS TRUE, WHY HAVE THEY NOT DONE A RECALL TO CORRECT THE PROBLEM?  I MANIFOLD IS NOT A CHEAP PART TO REPLACE.",
        "vin": "5TDBT48A01S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/01/2005",
        "dateOfIncident": "06/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123765,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 TOYOTA PRIUS IN APRIL 2002 AND WITHIN THE FIRST TWO MONTHS THE VEHICLE STOPPED WHILE ON THE FREEWAY AT 65+ MPH AND THE GAS ENGINE WOULD NOT WORK, I HAD TO DRIVE ON THE ELECTRICAL MOTOR.  IT WAS REPAIRED AT THE TOYOTA DEALER IN CARLSBAD, CA. THIS IS THE SAME ISSUE THAT WAS REPORTED IN THE PRESS TODAY.",
        "vin": "JT2BK18U020"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/01/2005",
        "dateOfIncident": "09/06/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123865,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA PRIUS HAS HAD MULTIPLE AUTOMATIC FAILURES SINCE IT'S PURCHACE.  YOU WILL BE DRIVING DOWN THE ROAD AT ANY SPEED AND IT SHUTS STALLS.  THIS HAS HAPPENED ON THE HIGHWAY IN MA., ON THE ROAD IN NM, ON THE HIGHWAY IN NM AND ON THE HIGHWAY IN TX.  I HAVE BEEN LUCKY SO FAR THAT I HAVE NOT BEEN KILLED.  I HAVE COMPLAINED TO DEALERS IN MA, NM, AND TX AND THEY CLAIM THAT THERE IS NOTHING WRONG WITH MY CAR.  MY CAR SLOWS DOWN TO 40 MPH GOING UP HILL WHICH IS ALSO A DANGER WHEN YOU ARE IN A 60 MPH ZONE ON THE HIGHWAY.  THE MILEAGE HAS BEEN POOR AROUND 30 MILES PER GALLON.  MANY PARTS HAVE BEEN REPLACEDUT THEY ALWAYS SAY IT IS IN MY HEAD THAT THERE IS SOMETHING WRONG WITH MY CAR.  I PICKED IT UP FROM A DEALER IN NM AND DROVE IT LESS THAN 2 MILES AND IT STALLED WHILE DRIVING ON A BUSY ROAD AND I AGAIN WAS ALMOST KILLED.  THEY MECHANIC TOLD ME THERE WAS NOTHING WRONG WITH MY CAR AND THAT HE WAS GOING TO PUSH IT OUT INTO THE ROAD AFTER HE PULLED OUT SOME PARTS I REFUSED TO PAY FOR AS I WANTED TO WAIT A DAY UNTIL I COULD TALK TO THE TOYOTA 1 800 COMPLAINT LINE.  THIS IS A REAL PROBLEM THAT TOYOTA IS NOT ADDRESSING AND HAS TAUGHT THEIR MECHANICS TO BE CONDECENDING AND RUDE TO FEMALE CONSUMERS.",
        "vin": "JT2BK18U820"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "05/18/2005",
        "dateOfIncident": "05/16/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM DEALING WITH UNDERSIZED BRAKE CALIPER AND ASSOCIATED ROTOR AND BRAKE PAD QUALITY PROBLEMS.  THE CARS SHAKES VIOLENTLY QWHEN APPLYING THE BRAKES.  THEY ARE CAUSING THE ROTORS TO OVERHEAT CAUSING THE ROTORS TO WARP AND EXCESS WEAR.  WHILE TOYOTA RECOGNIZED THAT THE CALIPERS ARE TOO SMALL FOR THE 2002 SEQUOIA, THEY WOULD ONLY REPLACE THEM UNDER WARRANTY.  NOT SURE WHY  THEY ARE ONLY TOO SMALL UNDER WARRANTY.  DO THEY GROW AFTER THE  WARRANTY EXPIRES?  THIS IS BAD POLICY.  THE DEALER RECOMMENDED I SPEND THE $2000 TO FIX THE PROBLEM, WHICH TOYOTA SAYS IS NOT A PROBLEM AFTER THE WARRANTY EXPIRES.    WHEN I SPOKE TO THE LOCAL DEALER,BOULDER TOYOTA, HE STATED IT IS NOT A SAFETY ISSUE, ONLY A QUALITY QUESTION.  I SEEM TO GET TWO DIFFERENT STORIES FROM THE  DEALER AND TOYOTA \"CUSTOMER EXPERIENCE\".    I HAVE RESEARCHED A NUMBER OF SITES INCLUDING NHTS AND AUTOBYTEL.  APPARTENTLY I AM NOT UNIQUE AND MANY OTHERS ARE CLAIMING PROBLEMS WITH TOYOTA SEQUOIA BRAKES.  THIS IS NOT THE QUALITY I EXPECTED FROM A TOYOTA.",
        "vin": "5TDBT48A82S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG VIBRATIONS FROM FRONT BRAKES",
        "vin": "5TDBT48A82S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/11/2005",
        "dateOfIncident": "04/25/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10120728,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD AN SIDE IMPACT ACCIDENT WHILE DRIVING MY 2002 TOYOTA SEQUOIA.  WAS HIT BY A TRUCK TRAVELING BETWEEN 45-50 MPH.  STRUCK RIGHT IN FRONT OF DRIVERS DOOR.  DRIVERS HEAD WENT THROUGH DRIVERS WINDOW.  VEHICLE WAS EQUIPED WITH SIDE CURTAIN AIRBAGS.  NONE OF THE AIRBAGS DEPLOYED.  VEHICLE WAS DAMAGED ENOUGH TO BE CONSIDERED TOTALED. (ESTIMATE WAS OVER $23,000) TO FIX.  WANT TO KNOW WHAT WENT WRONG?  PAID EXTRA FOR AIRBAGS THAT DIDN'T WORK.  WHO'S RESPONSIBLE?",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/21/2005",
        "dateOfIncident": "04/15/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118218,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA 2002 MR2 SPYDER: SEQUENTIAL MANUAL TRANSMISSION (SMT) CREEPING WHILE IN FORWARD OR REVERSE GEAR. THIS HAPPEN TO THE CAR IN DEC OF 2004 BUT WENT AWAY BY ITSELF AFTER A WEEK. I REPORTED TO FREMONT TOYOTA DEALERSHIP IN CA BUT THEY SAID IT WAS NORMAL. AGAIN ON APRIL 15TH 2005, THE SMT CREEPING RECURRED. I BROUGHT THE CAR BACK TO THE SAME DEALERSHIP, THEY REPLACED THE ECU BUT CREEP IS STILL EXIST. AGAIN, THE DEALER PERSISTS THAT THIS IS NORMAL. ACCORDING THE MANUAL BOOK, IT STATES THAT UNLIKE AUTOMATIC TRANSMISSION, SMT DOES NOT CREEP. PLEASE HELP.   *NM",
        "vin": "JTDFR320320"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/11/2005",
        "dateOfIncident": "04/10/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116707,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "EXCESSIVE TIRE WEAR ON BRIDGESTONE POTENZA RE92 TIRES.  TIRES REPLACED ON MY 2002 TOYOTA PRIUS MAY 2004 AT 23,555 MILES.  SERVICE MANAGER ADVISED THAT ORIGINAL TIRES WERE UNSAFE AND CONTINUED USE COULD RESULT IN A BLOW OUT.  CURRENTLY, THE SECOND SET OF TIRES ARE AGAIN WORN (44,000 MILES) AND UNSAFE. *AK",
        "vin": "JT2BK12U720"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2005",
        "dateOfIncident": "03/04/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117706,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 PRIUS HAS PROBLEMS WITH GAS TANK LINING  DECAYING.*MR  THE CONSUMER THE PROBLEM COULD HAVE RESTRICTED OR BLOCKED FUEL FROM GOING TO THE ENGINE.  *JB",
        "vin": "JT2BK18U320"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2005",
        "dateOfIncident": "01/20/2005",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111792,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 20 MPH THE VEHICLE CAUGHT ON FIRE IN THE TRUNK WHERE THE BATTERY WAS LOCATED. CONSUMER WAS ABLE TO PULL THE VEHICLE OFF THE ROAD. THE LOCAL FIRE DEPARTMENT ARRIVED AND EXTINGUISH THE FIRE. THE CAUSE OF THE FIRE WAS DETERMINED TO BE AN ELECTRICAL SHORT. THE DEALER WAS NOTIFIED.*AK  THE HYBRID BATTERY PACK CAUGHT ON FIRE.  *NM",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/26/2005",
        "dateOfIncident": "01/26/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107970,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA SEQUOIA LIMITED. THE BRAKES NEEDED REPLACING AT 21000 MILES.THIS IS CONCIDERED  NORMAL , FOR THIS HEAVY CAR. THE DEALER REQUESTED $330.00 TO REPLACE PADS I SHOPPED AROUND GOT THE JOB DONE FOR $250.00. BUT THE BRAKES STARTED VIBRATING WHENEVER I APPLIED THEM. TOOK IT BACK TO REPAIR CENTER THEY RE-DID THE ENTIRE BRAKE JOB WITH DIFFERENT FACTORY PADS (26000 MI) , SAME RESULT. I THEN TOOK IT TO THE DEALER I BOUGHT THE CAR FROM (33000 MI) , THEY CHECKED IT OUT, PROBLEM NOT OCCURING AT THIS TIME. NO REPAIR DONE. I TOOK IT TO THE TIRE CENTER I ALWAYS USE FOR TIRES, THEY REPLACED REAR ROTORS, PROBLEM NOT FIXED. I THEN REPLACED THE FRONT ROTORS & PADS MYSELF. VIBRATION STILL OCCURING. I HAVE SPENT $800.00 TO FIX THE VIBRATION. TALKED TO TOYOTA ABOUT IT THERE IS A SERVICE BULITTEN ABOUT THIS COMPLANT, IT SHOULD BE FIXED FREE OF CHARGE. BUT THE CAR IS AT 41000 MI NOW. THE WARRANTY IS 36000 MILES.TOYOTA REFUSED TO MAKE NECESSARY REPAIRS UNDER WARRANTY, EVEN THOUGH COMPLAINT WAS ORIGINALLY PLACED DURING WARRANTY PERIOD. REPAIR COST APPROX $2000.00 PER SERVICE WRITER. I WILL NEVER DEAL WITH TOYOTA AGAIN! *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/07/2005",
        "dateOfIncident": "07/26/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103549,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE FAILED TO ACCELERATE. *AK  THE CONSUMER STATED THE VEHICLE STALLED AND VARIOUS LIGHTS ILLUMINATED, THE VEHICLE WAS TOWED TO THE DEALER, THE COMPUTER SHOWED MULTIPLE CODES, HOWEVER THEY WERE UNABLE TO FIND ANYTHING WRONG WITH THE VEHICLE.  *JB",
        "vin": "JACDH58W0P7"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/05/2005",
        "dateOfIncident": "11/20/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101638,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER HAS A 2002 TOYOTA PRIUS. THE VEHICLE WAS BOUGHT BRAND NEW BUT NOW HAS 16000 MILES ON IT. IT IS EQUIPPED WITH BRIDGESTONE TIRES. ALREADY THE FRONT TIRES THREADS ARE LITERALLY COMING APART. THERE WAS NO RESULTING INJURY.    *NM  *JB",
        "vin": "JT2BK18U520"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/04/2005",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105724,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONCE YOU COME TO A STOP DURING NORMAL BREAKING, AND TAKE YOUR FOOT OFF THE BREAK PEDAL TO START MOVING FORWARD, THERE IS A ?THUMP? AS IF YOU ARE BEING HIT FROM THE REAR. THIS IS SIMILAR AS BEING REPORTED IN ODI?S 10089480 AND 10092834. DEALER STATES THIS IS NORMAL IN TRUCKS, THAT IT IS THE NATURAL SPACING IN THE DRIVE SHAFT WITH REAR WHEEL DRIVE.THE ONLY WAY FOR THE PROBLEM NOT TO OCCUR, IT TO GLIDE TO A SMOOTH STOP.*AK",
        "vin": "5TDBT44A02S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/21/2004",
        "dateOfIncident": "01/02/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA SEQUOIA BRAKES VIBRATE SEVERELY. VSC SYSTEM WARNING LIGHT FREQUENTLY COMES ON. PROBLEM HAS EXISTED SINCE CAR HAD 10,000 MILES, NOW HAS 36,000 AND DEALER AND TOYOTA CLAIM IT IS OUT OF WARRANTY. TOYOTA CLAIMS THAT CAR HAS NO BRAKE PROBLEMS, NO SAFETY PROBLEMS AT ALL, AND THAT ORIGINAL BRAKES ARE NOT DEFECTIVE IN DESIGN. I AM INFORMED THAT TOYOTA ISSUED A TECHNICAL SERVICE BULLETIN, ALTHOUGH TOYOTA DENIED THIS THE DEALER ADMITTED THAT IT EXISTED, BUT I HAD TO SPECIFICALLY COMPLAIN ABOUT THE SPECIFIC BRAKE PROBLEM, OR THEY WOULD NOT AND DID NOT ADVISE ME OF THE REMEDY. THESE BRAKE ISSUES ARE A SERIOUS SAFETY PROBLEM.*AK",
        "vin": "5TDZT34A52S"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "01/11/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102950,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC DOOR HANDLES ON TOYOTA SEQUOIAS EASILY BREAK OFF, VERY FLIMSY.  THIS COULD LEAD TO SOMEONE GETTING TRAPPED IN THEIR CAR, ESPECIALLY IF YOU ARE INVOLVED IN AN ACCIDENT AND NEED TO OPEN THE DOOR QUICKLY OR AGGRESSIVELY.  MY NEIGHBOR HAPPENS TO HAVE THE SAME VEHICLE EVEN THE SAME COLOR AND I ASKED HIM HOW HE LIKES IT AND HE SAID FANTASTIC, EXCEPT WE HAVE BROKEN OFF 2 DOOR HANDLES. WHEN I TOOK IT TO THE DEALER THE SERVICE WRITER CASUALLY MENTIONED, \"OH, WE GET THESE IN ALL THE TIME\". I CONTACTED THE DEALER AND THE TOYOTA ZONE OFFICE AND THEY WILL NOT PAY FOR THE $175 REPAIR.  THIS IS A SERIOUS SAFTEY HAZARD AND A DEFECTIVE PRODUCT.*AK",
        "vin": "5TDZT34A12S"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/07/2004",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102268,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 TOYOTA SAQUOIA IN THE YEAR OF 2002,IN THE YEAR 2003 MY AIR CONDITIONING SYSTEM WENT OUT IN MY NEW VEHICAL UPON TAKING IT TO THE LOCAL TOYOTA DEALER I WAS TOLD THAT MY COMPLETE AIR CONDITIONING SYSTEM NEEDED TO BE REPLACED,I HAVE WENT A COMPLETE YEAR WITH OUT AN AIR CONDITION SYSTEM MIND YOU I LIVE IN AUGUSTA GEORGIA,THIS CAUSES SEVERAL THINGS TO NOT FUNCTION PROPERLY SUCH AS GAS GAGE NOT PROPERLT WORKING,WHEN YOU DRIVE THE CAR 60 MPH OR OVER THE TRUCK BEGAN TO BURN,THE AIR COMES ON AUTOMATICLLY AND THE TRUCK BEGAN TO JUMP VERY BADLY LIKE THE CAR IS GOING TO BLOW UP,THE HEAT ONLY WORKS WHEN YOU SET IT AT 80 DEGREES OR HIGHER SO YOU CAN ONLY LEAVE IT ON FOR SO LONG THEN YOU MUST TURN IT OFF AND WHEN IT GETS COLD AGAIN YOU HALF TO TURN IT ON AGAIN THIS GOES ON ALL DAY LONG.I CAN'T SEM TO GET ANY ONE FROM TOYOTA TO HELP ME WITH THERE DEFAULT, MY WIFE WON'T EVEN DRIVE THE CAR.SO WHEN I TOOK IT TO A NOTHER DEALER TO SEE IF THIS WAS REALLY THE PROBLEM HE TOLD ME THAT THE SYSTEM WAS REALLY BLOWEN.SIRS I WORK VERY HARD FOR MY MONEY AND I DON'T HAVE A LOT OF IT TO GIVE AWAY,IREALLY DON'T APPRICIATE A PRESTEGIOUS COMPANY SUCH AS TOYOTA TO PRAY ON ON IT'S CONSUMER. WHEN THE VEHICAL WAS CHECKED TO SEE IF THERE WAS A RECALL AT MY REQUEST THERE WAS WHAT YOU CALL A BULLITEN ON THIS PROBLEM,I THEN ASKED IF YOU KNOW THAT THIS PROBLEM ENOUGH WHY ISN'T THERE A RECALL I REALLY DON THINK THAT I THE CONSUMER SHOULD HALF TO FOOT A $2000 BILLL ON SOMETHING THAT WAS NOT MY FAULT I AM VERY SORRY THAT I PICKED A TOYOTA SEQUOIA THIS IS NOT A CHEAP VEHICAL IF YOU CAN HELP ME AND MY FAMILY PLEASE DO SO.THANK YOU IN ADVANCE. *AK",
        "vin": "5TDZT38A02S"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/22/2004",
        "dateOfIncident": "10/22/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100315,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MODEL: TOYOTA PRIUS 2002  PURCHASE FROM : PUTNAM TOYOTA, CERTIFIED UNIT, JUNE 2004  FAILURE TYPE : TIRE BURST ON SIDE WALL OF THE TIRE, TWICE IN 5 MONTHS.  FAILURE ROOT CAUSE : DRIVE OVER PARKING CURB, AT LESS THAN 2 MPH.  FAILURE LOGIC : WHY THE TIRE BURST IN SUCH A MANNER, ESPECIALLY TOYOTA CLAIM, THIS IS A SPECIAL DESIGN OVERLOAD PRESSURE TIRE.  PART REPLACE/SERVICE:  BOTH TIRES WERE REPLACE AT CAPITOL TOYOTA DEALERSHIP.  COST PER INCIDENT:  TIRE =$79.00, LABOR = $60.81, TIRE ONLY AVAILABLE AT TOYOTA DEALERSHIP.  CONCERN:  WHAT WOULD HAPPEN IF I DRIVE 60 MPH ON FREEWAY, AND HIT A BUMPER UNEVEN PATH ON THE HIGHWAY, WOULD IT BURST AS WELL ! *JB",
        "vin": "JT2BK18U420"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/28/2004",
        "dateOfIncident": "09/07/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094486,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE TIRES WERE DEFECTIVE.  AFTER TAKING THE VEHICLE TO DEALER  FOR SERVICE  IT WAS DISCOVERED  THAT CHUNKS  ERE MISSING FROM THE INSIDE OF THE TIRES.   MANUFACTURER OFFERED REIMBURSEMENT.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/30/2004",
        "dateOfIncident": "06/02/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090265,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT AND REQUEST FOR REPAIR WITHOUT CHARGE FOR LEAKAGE OF REAR SHOCKS ON 2002 PRIUS.   *MR   THE CONSUMER REQUESTED REIMBURSEMENT.   *SC   *JB",
        "vin": "JT2BK12U520"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/12/2004",
        "dateOfIncident": "08/09/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10086711,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HUSBAND NEEDED TO TAKE HIS CAR TO THE REPAIR SHOP AND I WAS FOLLOWING HIM.  WE ARRIVED AT OUR DESTINATION AND HE PARKED HIS CAR IN A PARKING SPACE.  I HAD OUR DOG IN MY CAR AND DECIDED TO PARK THE CAR IN A SHADED PARKING SPACE.  AS I WAS ENTERING THE PARKING SPACE, MY CAR FELTLIKE IT WAS ACCERLERATING EVEN THOUGH MY FOOT WAS ON THE BRAKE. THE AIRBAGS THEN EXPLODED AND THE CAR CAME TO A COMPLETE STOP.  THE AIRBAGS BURNED MY ARM AND THE NOISE FROM THE BAGS FRIGHTENED MY DOG AND HE JUMPED FROM THE CAR.  I WAS ENTERING THE PARKING SPACE AT ABOUT ONE OR TWO MILES PER HOUR. I DID NOT HIT ANYTHING. THE AIRBAGS MALFUNCTIONED.  TOYOTA INSISTS I HIT A WALL.  I HAVE A WITNESS TO SUPPORT MY SIDE.  TOYOTA REFUSES TO ACCEPT RESPONSIBILITY FOR THIS INCIDENT STATING I WAS DRIVING AT THE SPEED OF 1400RPM.  THAT WOULD MEAN I WAS GOING 55MPH WHILE ENTERING THE PARKING SPACE.THEE SEEMS TO SOME DAMAGE TO THE FRONT OF THE CAR, BUT IT OCCURED SOME MONTHS BEFORE THIS INCIDENT. THE PARAMEDICS WERE CALLED AND THEY ATTENDED TO A BURN ON MY RIGHT ARM, IT WAS NOT SEVERE ENOUGH FOR ME  TO GO TO THE HOSPITAL .",
        "vin": "JT2BK18U020"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/30/2004",
        "dateOfIncident": "07/16/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082996,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST WANTED TO ALERT YOU THAT THERE MAY BE A POTENTIAL DEFECT WITH THE TORQUE SENSOR, WHICH AFFECTS THE POWER STEERING. I RECENTLY ENCOUNTERED THIS IN MY 2002 TOYOTA PRIUS WITH 43,000+ MILES ON THE VEHICLE.*AK  \\  BASICALLY, THERE ARE NO PRECEDING SYMPTOMS BEFORE THE POWER STEERING FAILS. UPON FAILURE, THE PRIUS CENTRAL COLOR TOUCHSCREEN LCD DISPLAY SHOWS THREE ICONS, WITH THE \"PS\" ICON IN RED. YOU WILL ALSO SEE AN EXCLAMATION POINT ICON LIT ON THE GREEN LCD DISPLAY NEXT TO THE SPEEDOMETER. AT WHICH POINT, YOU HAVE NO POWER STEERING AND THE CAR WILL BE HARD TO STEER.  \\  WHEN THIS OCCURS, THERE MAY BE A TEMPORARY FIX, WHICH WORKED FOR ME. PULL OVER TO A SAFE AREA AND TURN OFF THE CAR. WAIT 30 SECONDS, AND THEN TURN ON THE CAR. YOU HAVE EFFECTIVELY REBOOTED THE PRIUS COMPUTER SYSTEM WITH THE TORQUE SENSOR, AND THE POWER STEERING SHOULD RETURN FOR THE TIME BEING.  \\  THE VEHICLE SHOULD BE TAKEN TO THE NEAREST OFFICIAL TOYOTA SERVICE SHOP (AKA DEALERSHIP) AND HAVE THEM RUN A DIAGNOSTIC CHECK. THEY SHOULD SEE CODE \"C1513 TORQUE SENSOR ABNORMAL\" IN THE PRIUS' MEMORY BANKS. THEN SIT DOWN FOR THE PRICE TAG: $3159 - $4,160 TO REPLACE THE ENTIRE POWER STEERING RACK, SINCE THE SENSOR IS INTEGRATED IN THE RACK ITSELF. THIS INCLUDES THE LABOR OF ABOUT $261.  \\  IT IS RECOMMENDED NOT TO ACCEPT ANY \"COST COVERAGE OFFER\" FROM THE SERVICE SHOP UNTIL YOU CALL THE TOYOTA CONSUMER SUPPORT LINE AT 1-800-331-4331. MAKE SURE YOU HAVE A SERVICE QUOTE FROM THE SHOP, THEN CALL THE SUPPORT LINE AND COMPLAIN. THE SUPPORT LINE WILL ASSIGN YOU A \u001cCASE WORKER\u001d AND PROVIDE A CASE NUMBER. THEY WILL CONTACT THE SHOP AND MAKE ARRANGEMENTS TO REPAIR THE VEHICLE. TOYOTA COVERED THE COST OF THE PART 100% FOR ME, AND ALL I HAD TO DO WAS PAY FOR THE LABOR SINCE MY CAR WAS OUT OF WARRANTY PER THE 36,000 BUMPER-TO-BUMPER COVERAGE.  \\  IN CONCLUSION, I AM VERY HAPPY ON HOW TOYOTA HANDLED THE POWER STEERING ISSUE. THIS IS TO INFORM OTHER 2000-2003 PRIUS OWNERS IF THEY ENCOUNTER A SIMILAR PROBLEM.",
        "vin": "JT2BK12UX20"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/07/2004",
        "dateOfIncident": "07/03/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080557,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED ROAD NOISE AND DETERMINED THAT IT WAS A TIRE NOISE.  SINCE I WAS TRAVELING OUT OF MY HOME STATE - I TOOK THE CAR TO BE CHECKED BY A LOCAL TIRE CENTER.HE GUY LOOKED AT THE TIRE AND IMMEDIATELY POINTED OUT THE UNEVEN WEAR OF THE FRONT TIRES - COULD FEEL THAT THE STEEL BELT WAS ALMOST EXPOSED.  I HAD JUST MADE A 1000 MILE TRIP AND FEEL LUCKY THAT THE TIRES DIDN'T BLOW.    AT THE TIRE DEALERSHIP, THEY WONDERED WHETHER THIS WAS AN ONGOING PROBLEM WITH THE TOYOTA PRIUS - THEY HAD ANOTHER PRIUS IN WITH THE SAME PROBLEM.   HE INDICATED THAT IT LOOKED LIKE AN ALIGNMENT PROBLEM.   WHEN HE TRIED TO ADJUST THE REAR ALIGNMENT, HE WAS UNABLE TO RESET IT TO THE RECOMMENDED SPECIFICATIONS.  THE SAME WAS TRUE OF THE OTHER PRIUS THAT HE HAD IN THE SHOP.   SO OF COURSE I SHOULD EXPECT THE NEW TIRES TO HAVE UNEVEN WEAR.  NOW I AM VERY CONCERNED ABOUT THE SAFETY OF THIS CAR.  AT LEAST I'M AWARE OF THE PROBLEM, BUT WHAT ABOUT ALL THE OTHER PRIUS OWNERS THAT ARE IN DANGER??  THIS CERTAINLY APPEARS TO BE A DESIGN FLAW  - THERE SHOULD BE A RECALL!!     I HAVE HAD REGULAR MAINTENANCE AT THE RECOMMENDED TIME BY THE TOYOTA DEALERSHIP.  NO ONE EVER INDICATED THAT THERE WAS A PROBLEM WITH THE ALIGNMENT OR ANY OTHER KIND OF TIRE PROBLEM.  BUT AFTER READING ALL THE OTHER COMPLAINTS ON THIS WEB SITE REGARDING THE TIRES, I FEEL THE CAR IS UNSAFE.  I WILL BE GOING TO MY TOYOTA DEALERSHIP & I KNOW THEY WILL COVER THE COST OF THE NEW TIRES BUT THAT DOESN'T FIX THE PROBLEM.  I BELIEVE TOYOTA NEEDS TO MAKE PRIUS OWNERS AWARE OF THE DEFECT BEFORE SOMEONE IS INVOLVED IN A SERIOUS ACCIDENT.   *AK",
        "vin": "JT2BK12U220"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/09/2004",
        "dateOfIncident": "06/05/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR HANDLE ON INSIDE OF DRIVER'S SIDE BROKE.  IMPOSSIBLE TO OPEN DOOR.  UNFORTUNATELY IT HAPPENED WHEN MILEAGE IS AT 38,000 AND PAST WARRANTY BY 2000 MILES.  COST TO REPAIR WAS $117.  TECHNICIAN STATED PROBLEMS WITH CAMRY AND COROLA WITH THAT RESPECT.  THE HANDLE WAS NEVER TREATED ROUGHLY, JUST BROKE ONE DAY.*AK",
        "vin": "4T1BE32K62U"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/24/2004",
        "dateOfIncident": "04/05/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073043,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN NOVEMBER OF 2003 I HAD A TIRE BLOWOUT WHILE ON THE FREEWAY.  THE CAR HANDLED WELL AND I WAS ABLE TO GET OFF THE FREEWAY AND PUT ON THE SPARE.  WHEN REPLACING THE TIRE I FOUND THAT I HAD TO PURCHASE A \"SUPER HEAVY DUTY\" TIRE BECAUSE OF THE WEIGHT OF MY CAR.  THE TIRE WAS INFLATED TO THE SPECIFICATIONS IN MY OWNER'S  MANUAL (35LBS).  IN APRIL I HAD A SECOND BLOW-OUT AND REPLACED THE TIRE AT MY TOYOTA DEALERSHIP.  AT THAT TIME I WAS INFORMED THAT TOYOTA FOUND THAT INFLATING THE TIRES TO 45LBS SEEMED TO BE WORKING BETTER.  I HAVE NOW REPLACED ALL FOUR TIRES AND INFLATED THEM TO THE RECOMMENDED 45LBS.  IF TOYOTA HAD NOTIFIED ME AS AN OWNER THAT THE MANUAL WAS NOT CORRECT AND THAT THE TIRES SHOULD HAVE BEEN INFLATED TO 45LBS I WOULD HAVE GOTTEN TWICE AS MUCH USAGE OUT OF MY TIRES AND I WOULD NOT HAVE EXPERIENCED TWO BLOWOUTS AND A WHELL REALIGNMENT COST.  THERE SHOULD BE A RECALL, NOTICE TO OWNERS AND A RPLACEMENT OF TIRES AT TOYOTA'S COST.*AK",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VEHICLE SPEED CONTROL,TIRES",
        "crash": false,
        "dateComplaintFiled": "05/15/2004",
        "dateOfIncident": "05/11/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072650,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA H14",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2002 NEW TOYOTA PRIUS DELIVERED WITH BRIDGESTONE POTENZA TIRES.  THESE TIRES HAVE FAILED AFTER 12,000 MILES.  THEN CHANGED TIRES (ALL 4) WHICH FAILED AT 10,000 MILES.  TOYOTA CORPORATE SAYS ITS NOT THEIR CONCERN.  DEALER TOLD ME THEY ARE NOT SAFE TIRES.  I HAVE REPLACED TIRES EVERY 10,000 MILES.  TOYOTA CORPORATE RECOMMENDS THESE TIRES AND TAKES NO RESPONSIBILITY FOR THEM.*AK",
        "vin": "JT2BK18U220"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/28/2004",
        "dateOfIncident": "04/14/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067957,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL MONTHS AGO I HAD A BLOW OUT ON MY LEFT REAR TIRE.  THOSE THINGS HAPPEN- SO I REPLACED THE TIRE, GLAD THAT THERE WERE NO INJURIES OR DAMAGE.  TWO WEEKS AGO THE SAME THING HAPPENED ON THE LEFT FRONT.  WHN I WENT TO THE DEALER I WAS ADVISED TO KEEP THE TIRES INFLATED TO 45LBS THOUGH THE OWNER'S MANUAL (ON MY 2002 PRIUS) ADVISED INFLATING TO ONLY 35LBS.  THE DEALER SAID THAT THEY FOUND THAT 45LBS ALLOWED BETTER WEAR AND AVOIDED THE BLOW-OUTS.  OWNERS SHOULD BE ADVISED OF THIS AND GIVEN REPLACEMENT TIRES WITH AN ADJUSTMENT FOR WEAR.  I WAS OUTRAGED THAT TOYOTA HAD THIS INFORMATION AND ESSENTIALLY SAT ON IT.  ON THE 2004 PRIUS (WHICH WE ALSO OWN) THE TIRE IS LARGER AND THUS THE \"PROBLEM\" HAS BEEN CORRECTED BY TOYOTA...EXCEPT THAT OWNERS OF 2002 PRIUS'S ARE DRIVING AROUND ON TIRE THAT LITERALLY BLOW UP.",
        "vin": ""
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2004",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10065050,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PARKING VEHICLE AND RETURNING BACK TO IT LATER VEHICLE  STARTED UP, BUT THEN  STALLED.  AFTER STALLING VEHICLE  DID NOT RESTART UNTIL  THE NEXT DAY.  DEALER HAS EXAMINED THE VEHICLE FIVE TIMES  AND WAS NOT ABLE TO RESOLVE THE PROBLEM.   ALSO,  GAS TANK AND STEERING LINKS HAD BEEN REPLACED. *AK    *LA",
        "vin": "JT2BK18U620"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/18/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063465,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FRONT DRIVER'S SIDE TIRE HAD TO BE REPLACED 3 TIMES BECAUSE OF CRACKS IN THE SIDEWALL.   CONSUMER FELT THAT THE TIRE DEALERSHIP DIDN'T WANT TO CLAIM LIABILITY, SO THEY WERE BLAMING THE CRACKS ON ROAD HAZARDS.  *AK",
        "vin": "JT2BK12U720"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": "07/30/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051649,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING AT 25 MPH  PASSENGER'S SIDE REAR TIRE BLEW OUT.  PRIOR TO THE BLOWOUT DEALERSHIP INDICATED THAT ALL TIRES HAD ABNORMAL WEAR.  AT THE TIME OF  BLOWOUT CONSUMER WAS ABLE TO SEE THE METAL BELT THROUGH THE SIDEWALL.   *AK   *SC",
        "vin": "JT2BK18U920"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/26/2003",
        "dateOfIncident": "12/23/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051118,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "YOKOHAMA RUBBER CO. LTD.",
                "productMake": "YOKOHAMA",
                "productModel": "ALL SEASON RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED TOYOTA MR2 SPYDER IN AUGUST OF 2002.  CAR NOW HAS 18,300 MILES AND BOTH FRONT TIRES (YOKOHAMA ADVAN A043 185/50R15) ARE WORN BEYOND RECOMMENDED TREAD DEPTH AND BLISTERED ON INSIDE(BECAUSE OF FRONT-END MISALIGNMENT ACCORDING TO DEALERSHIP).  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/17/2003",
        "dateOfIncident": "07/25/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051648,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERE VIBRATION IN THE STEERING WHEEL. THIS OCCURRED WHEN VEHICLE WAS IN REVERSE AT LOW SPEEDS. DEALERSHIP WAS UNABLE TO RESOLVE THE PROBLEM. *AK",
        "vin": "JT2BK18U920"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/09/2003",
        "dateOfIncident": "11/05/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049471,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GEAR ASSEMBLY (RACK AND PINION) IS FAILING. CAR SHAKES WHEN TURNING. IT FAILED ON 2 PRIUS OUT OF 5 I HAVE HAD. I THINK THERE SHOULD BE A RECALL FROM TOYOTA FOR THIS ISSUE.*AK",
        "vin": "JT2BK12U620"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/03/2003",
        "dateOfIncident": "12/21/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049942,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA RE92",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PROBLEMS WITH TIRE EQUIPMENT ON 2002 TOYOTA PRIUS.*MR              CONSUMER REPLACED THE TIRES SEVEN TIMES TO DATE. PROBLEMS WITH THE TREAD AND SIDEWALL. MANUFACTURER WAS MADE AWARE OF THE DEFECT.   *PH",
        "vin": "JT2BK18U220"
    },
    {
        "components": "POWER TRAIN,TIRES",
        "crash": false,
        "dateComplaintFiled": "12/02/2003",
        "dateOfIncident": "07/02/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041850,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING, THE CONSUMER NOTICED A NOISE WAS COMING FROM THE FRONT END.  THE FIRST FAILURE OF THE FRONT TIRES WAS JULY 2,2003 AT 20624 MILES.  NEW REPLACEMENT TIRES WERE PUT ON THE REAR. THE OLD TIRES WERE MOVED TO THE FRONT. THE FRONT TIRES FAILED  SEP 27 2003.  TOOK VEHICLE TO DEALERSHIP AND THE CONSUMER WAS INFORMED BY THE MECHANIC THAT  THE TIRES WORE OUT BADLY ON THE INSIDE AND WOULD NEED TO BE REPLACED. TIRE SIZE P175/65R14XL.  THE VEHICLE JERKED WHEN STARTED.  NO PROBLEM FOUND.  *AK  *TT  *JB",
        "vin": "JT2BK18U020"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/31/2003",
        "dateOfIncident": "04/17/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036941,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2002 TOYOTA PRIUS     HAVE HAD FIVE TIRES REPLACED ON THIS CAR AND ONLY HAVE 28,000 MILES ON IT. THE TIRES WEAR UNEVEN, AND THE SIDEWALLS BREAK DOWN TO CAUSE FLAT. THE TREAD COMES OFF IN CHUNKS. STEEL WIRES SHOWING. EVERY TIRE HAS HAD A DIFFERENT THING HAPPEN TO IT. I HAVE 3 TIRES REPLACED BY THE DEALERSHIP IN ONE DAY. THE 1ST TIRE WENT FLAT FROM THE SIDEWALL BRAKING DOWN AND BEING WEAK. THE ONE I HAD REPLACED ON 8-28-03 WAS WEARING UNEVENLY AND JUST HAD THE CAR IN FOR MAINT. THESE TIRES ARE UNSAFE TO DRIVE ON AND I WOULD HOPE FOR A RECALL. *AK",
        "vin": "JT2BK18U220"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/30/2003",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10036913,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING RACK FAILURE, RELATED TO TORQUE SENSOR FAILURE. REPLACED ONCE UNDER WARRANTY, BUT IS BEGINNING TO FAIL A SECOND TIME WITH SAME SYMPTOMS. *AK",
        "vin": "JT2BK18U420"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/25/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034551,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TWO FRONT TIRES WORE OUT PREMATURELY.   DEALER SAYS THE REMEDY FOR THIS PROBLEM IS TO ROTATE THE TIRES AND KEEP THE APPROPRIATE TIRE PRESSURE.  *AK",
        "vin": "JT2BK12U020"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/05/2003",
        "dateOfIncident": "08/04/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030871,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE STEERING WHEEL SHAKES AND SHUTTERS DURING LOW SPEED DRIVING, ESPECIALLY IN REVERSE, ON MY 2002 TOYOTA PRIUS.*AK",
        "vin": "JT2BK18U120"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/16/2003",
        "dateOfIncident": "07/16/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029432,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AND TURNING EITHER WAY LEFT O RIGHT STEERING SHAKING VIOLENTLY. DEALER HAS INSPECTED AND COULD NOT DUPLICATE OR CORRECT THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "04/28/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10019719,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE STALLED.  IT WAS DIFFICULT TO GET THE VEHICLE RESTARTED.  *NLM  ON SEVERAL OCCASIONS,  THE VEHICLE STALLED OUT.  VEHICLE STALLED OUT FOUR TIMES, AND THE LAST TIME IT CAUSED AN ACCIDENT AND THE AIR BAGS DID NOT DEPLOY.    *TT  *JB",
        "vin": "JT2BK12U620"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "06/24/2003",
        "dateOfIncident": "05/30/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023675,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PREMATURE TIRE WEAR.  *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/10/2003",
        "dateOfIncident": "05/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021367,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING GEAR ASSEMBLY (RACK AND PENION) IS FAILING. CAR SHAKES WHEN TURNING AND BACKING UP.EXTENDED WARRANTY COMPANY REFUSES TO COVER UNTIL SYSTEM COMPLETELY FAILS OR IT BECAMES A \"SAFETY ISSUE\".*AK",
        "vin": "JT2BK18U620"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "05/15/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019448,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED FOR APPROXIMATELY FORTY FIVE MINUTES AND WITHOUT WARNING THE EMERGENCY BRAKE RELEASED AND THE VEHICLE ROLLED BACKWARDS INTO ANOTHER VEHICLE.  (MODEL/MR2 SPYDER) SCC    *JB",
        "vin": "JTDFR320920"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/12/2003",
        "dateOfIncident": "04/12/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TWO BRIDGESTONE POTENZA RE92 [P175/65 R14 84S, DOT EL(PJDH4801] TIRES FAILED ON MY 2002 PRIUS WITHIN ONE WEEK. THESE ARE THE TIRES INSTALLED ON THE VEHICLE WHEN WE BOUGHT IT. OUR VEHICLE CURRENTLY HAS SLIGHTLY LESS THAN 25,000 MILES ON THE ODOMETER AND IS DRIVEN PRIMARILY FOR COMMUTING ON FREEWAYS. WE DISCOVERED THE RIGHT FRONT TIRE EXTREMELY LOW ON AIR WHEN RETURNING TO A PARKING GARAGE ON 4/12/03. AS WE WERE UNABLE TO LOCATE A GAS STATION MY HUSBAND CHANGED THE FAILED TIRE WITH THE TEMPORARY TIRE AND HAD THE THE FAILED TIRE REPAIRED THE NEXT DAY. WHEN SERVICED WE WERE TOLD THE TIRE HAD A PIN HOLE AND IRREGULAR WEAR PATTERN. WE TOOK THE VEHICLE INTO THE DEALERSHIP FOR ITS SCHEDULED 22,500 MILE SERVICE AND TO HAD THE TIRES INSPECTED AND THE FRONT END ALIGNED. WHEN QUESTIONED ABOUT THE TIRES WEAR PATTERN WE WERE TOLD THE \"TIRES WERE MARGINAL\" AND THAT WE SHOULD EXPECT TO REPLACE THE TIRES IN THE NEXT SIX MONTHS.    THE SECOND TIRE FAILED TODAY WHEN MY HUSBAND WAS CUT OFF IN A PARKING LOT (TRAVELING LESS THAN 5 MILES AN HOUR AND SWERVED TO AVOID BEING HIT AND HIT THE PARKING CURB), THE TIRE FAILED AND REQUIRED IMMEDIATE REPLACEMENT WITH THE TEMPORARY TIRE. WE ARE HAVING ALL FOUR TIRES REPLACED, AT THIS TIME, DUE TO THE FAILURE OF THE TWO BRIDGESTONE POTENZA RE92 [P175/65 R14 84S, DOT EL9PJDH4801] WITHIN A SEVEN DAY PERIOD.   *NLM",
        "vin": "JT2BK18U920"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006223,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSTRUMENT PANEL WAS INOPERATIVE, THE CONSUMER WAS UNABLE TO READ THE VARIOUS FEATURES THAT WERE DISPLAYED ON THE UNIT.  THE BATTERY HAD GONE DEAD, AND THE POWER WINDOWS FAILED.  THE FUEL CONSUMPTION WAS ABNORMAL AND THE AIR HANDLING SYSTEM DID NOT PERMIT OUTSIDE AIR. *SCC  *JB",
        "vin": "JT2BX12U220"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2003",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567810,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DID NOT MOVE OUT OF GEAR, AND IF IT DID MOVE OUT OF GEAR, IT ABRUPTLY DOWN SHIFTED TO SECOND GEAR WHILE DRIVING.*AK 2002 TOYOTA SPYDER) *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/08/2003",
        "dateOfIncident": "10/16/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10000827,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUNE OF 2202 I BOUGHT TOYOTA PRIUS.  I WAS GETTING 44MPG ON THE HIGHWAY AND 49 IN THE CITY.  THEN THE COLD WEATHER COMES AND NOW I GET ONLY 35MPG IN THE CITY THAT IS A DROP OF OVER 28%.       I HAVE TAKEN IT BACK TWICE TO THE DEALER AND THEY SUPPOSELY SCOPE IT AND SAID THAT THERE WAS NOTHING WRONG AND THAT THE COLD WEATHER WAS THE PROBLEM.  I TOLD THEM THAT THEIR EXCUSE WAS LAME AND THAT WAS NOT EXCEPTABLE.  IF A CARS GAS MILEAGE DROPS THAT DRAMACTICLY THERE HAS TO BE A PROBLEM OR THEIR IS A MANUFACTURING DEFECT.  THERE SHOULD NOT BE A 28% DROP OFF IN A CAR PERFORMANCE IN COLD WEATHER.    THERE ADVERTISEMENT PITCH WAS THAT THE CAR WILL GET BETTER MILEAGE IN THE CITY THAN THE HIGHWAY BECAUSE OF THEIR HYBRID SYSTEM, IT DID NOT SAY THAT THE SYSTEM ONLY WORK IN WARM WEATHER",
        "vin": "JT2BK18U920"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/04/2002",
        "dateOfIncident": "08/06/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8023657,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS HIT AT 25 MPH IN THE FRONT CENTER YET THE AIR BAG DID NOT DEPLOY CAUSING MINOR INJURIES TO THE CONSUMER.  THE DEALER HAS BEEN NOTIFIED.   *TS   *NLM",
        "vin": "JT2BK18U320"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/29/2002",
        "dateOfIncident": "09/02/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 568314,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE IN MOTION CONSUMER NOTICED THE FUEL GAUGE HAD DROPPED TWO MARKERS.  ALMOST IMMEDIATELY AFTERWARD, THE DASHBOARD INDICATOR DEMONSTRATED THREE SYMBOLS, A. TAKE VEHICLE TO A TOYOTA DEALER, B. MASTER WARNING LIGHT, C. TAKE VEHICLE TO THE DEALER IMMEDIATELY.  CONSUMER SPOKE WITH A TOYOTA REP TO NO AVAIL.  AFTER CALLING A TOW COMPANY, CONSUMER WAS INFORMED THAT THE PROBLEM WAS THE VEHICLE WAS IN NEED OF GASOLINE, THE TOW TRUCK BOUGHT THE CONSUMER SOME FUEL FOR THE VEHICLE AND THE PROBLEM WAS IMMEDIATELY REMEDIED, THE CONSUMER IS DISAPPOINTED WITH TOYOTA'S SERVICE AND BELIEVES THEY SHOULD HAVE KNOW WHAT THE PROBLEM WAS, THE FAULTY FUEL GAUGE WAS LATER REPLACED.  *JG     *NLM *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/03/2002",
        "dateOfIncident": "09/19/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020146,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT FRONT TIRE BLEW FOR NO APPARENT REASON.  THE SIDEWALL WAS TORN.  THE DEALER HAS REFUSED TO REPLACE IT BECAUSE THE MANUFACTURER WOULDN'T REFUND THEM.  THE TEAR IS FROM THE INSIDE OUT.   THE SIZE OF THE TIRE IS 205/65R15 92T.  THE TIRES ARE BRIDGESTONE POTENZA RE92.  NLM",
        "vin": "4T1BE32K2U0"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "10/02/2002",
        "dateOfIncident": "09/28/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED IN AN INCLINED SPOT. PARKING BRAKE ENGAGED. PARKING BRAKE FAILED AND CAR ROLLED OVER A CURB INTO A METAL POLE ABOUT 10-15 MINUTES AFTER THE CAR WAS PARKED. *PH (2002 TOYOTA MR2) *JB    **DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT OVER TO ARTEMIS**768022",
        "vin": "JTDFR320120"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/18/2002",
        "dateOfIncident": "08/05/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8018983,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEEL WAS SHAKING UNCONTROLLABLY AT LOW SPEED. TOOK TO DEALER, AND THEY STATED THAT POWER STEERING RACK WAS DEFECTIVE. THE PARTS WERE NOT AVAILABLE FOR ABOUT 6 MONTHS.*AK",
        "vin": "NOT AVAILAB"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/28/2002",
        "dateOfIncident": "08/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766351,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING COLUMN AND CAR VIBRATE WHEN TURNING OR BACKING.  LESSER VIBRATION IN STEERING ALSO SENSED WHEN DRIVING STRAIGHT.  BROUGHT CAR INTO DEALER ON AUGUST 14, 2002.  AM TOLD THAT REPLACEMENT STEERING RACK IS UNAVAILABLE AND DATE OF RECEIPT OF ONE IS NOT KNOWN.  REPORTED THIS PROBLEM TO TOYOTA CONSUMER SERVICES AND FILE # 200208260148 WAS ASSIGNED TO MY REPORT.  THERE IS ALSO EXTENSIVE DISCUSSION OF PROBLEMS WITH PRIOUS STEERING ON SEVERAL WEB SITES AT WHICH I DETERMINED THAT THERE WAS A RECALL OF THE 2001  MODEL.  MANUFACTURER HAS NOT CORRECTED DEFECT ON 2002 MODEL.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/28/2002",
        "dateOfIncident": "05/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 766371,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD THREE TIRE BLOWOUTS, ONE WITHIN 24 HOURS AFTER PURCHASE OF THE TIRE.*AK",
        "vin": "JT2BK12U420"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/03/2002",
        "dateOfIncident": "01/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 786031,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THE VEHICLE STOPPED WHILE PULLING OUT OF A PARKING LOT DUE TO FAULTY BATTERY.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2002",
        "dateOfIncident": "05/27/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8012973,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE REFUSES TO START. TOWED VEHICLE . REPLACED BATTERY , PROBLEM RE0CCURRED. A",
        "vin": "PLEASE FILL"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/12/2002",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763012,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR PULLS TO THE RIGHT, TOOK IN CAR TODAY AND TOLD THEM TO ADJUST ALIGNMENT AND HAVE OIL CHANGED, THE SERVICE DEPARTMENT CALLED BACK AND SAID THEIR WAS A MANUFACTURE RECALL AND THE CAR HAD TO STAY OVERNIGHT. IF IT HAD A RECALL NO NOTICE WAS SENT OUT THIS IS WHAT I'M UPSET ABOUT. CONSUMERS ARE SOPOSED TO BE NOTIFIED IF THERE IS A RECALL NOT FIND OUT AFTER THEY DAMAGE OTHER COMPONENTS AND FIND OUT WHEN THEY TAKE THEIR CAR IN FOR OIL CHANGES.*AK",
        "vin": "2T1CE22P52C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/01/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 565550,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE CAME EQUIPPED WITH DAY TIME RUNNING LIGHTS, HOWEVER CONSUMER CONSIDERS THEM TO BE ALL TIME RUNNING LIGHTS, CONSUMER STATES IT IS VERY EASY TO START THE VEHICLE UP AT NIGHT WITH THE DAY TIME DRIVING LIGHTS ON AND DRIVE AWAY WITHOUT ANY TAIL LIGHTS, CONSUMER HAS BACKED OUT OF THE GARAGE AND DRIVEN WITHOUT ANY TAIL LIGHTS, THE DISPLAY AND PANEL ARE ALWAYS LIT, AND CONSUMER DOES NOT NOTICE THERE ARE NO DASH LIGHTS, THE DEALER INFORMED CONUMER THAT SOME TOYOTAS AUTOMATICALLY TURN ON THE REGULAR LIGHTS AFTER DARK SO THERE ARE TAIL LIGHTS, HOWEVER CONSUMERS VEHICLE HAS NO TAIL LIGHTS.*JB",
        "vin": "JT2BK18U920"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/27/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004689,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN HEAVY TRAFFIC VEHICLE COMPLETELY SHUTSDOWN. WHEN THIS OCCURS CHECK ENGINE O/  BATTERY LIGHTS ILLUMINATE. PLEASE GIVE FURHTER DETAILS.*AK",
        "vin": "JT2BK12U420"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/26/2002",
        "dateOfIncident": "01/19/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758691,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "PRIUS",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DEALERSHIP ORDERED NEW POWER TRAIN, WHICH TOOK MORE THAN A MONTH TO ARRIVE (2/25/02).*AK",
        "vin": "JT2BK18U720"
    }
]