[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/23/2021",
        "dateOfIncident": "04/05/2021",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11413552,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IVE OWNED THIS CAR FOR 3 WEEKS AND HAVE HAD TO PUT 2 QUARTS OF OIL IN EVERY WEEK BECAUSE EVERY MORNING I START MY CAR LOT OF BLUE SMOKE IS COMING OUT MY EXHAUST. THIS IS BECAUSE THE DESIGN TEMPERATURE FOR THE PISTONS IN THIS ENGINE WAS 120 DEGREES CELSIUS AND THE ACTUAL TEMPERATURES REACHED ARE 160 DEGREES CELSIUS, WHICH CAUSES THE PETROLEUM OIL TO SLUDGE UP AND CARBON TO ACCUMULATE IN THE PISTON OIL HOLES THAT ALLOW OIL TO FLOW TO THE PISTON RINGS. THIS BLOCKS THOSE OIL HOLES, PREVENTING OIL FROM GETTING TO THE PISTON RINGS AND SUBSEQUENTLY THE PISTON RINGS WEAR VERY, VERY QUICKLY, THEN ALLOWING OIL TO BE ABLE TO SLIP PAST THE PISTON RINGS, INTO THE COMBUSTION CHAMBER AND OUT THE EXHAUST. THIS WILL LEAD TO REPLACING THE PISTONS WHICH IS AN EXTREMELY EXPENSIVE AND LABOR INTENSIVE JOB JUST BECAUSE TOYOTA MADE A MISTAKE WITH THE WAY THEY BUILT THE ENGINE. IT'S A SHAME THAT TOYOTA HASN'T RECALLED THIS VEHICLE BECAUSE THERE ARE COUNTLESS AMOUNTS OF RECORDS ON THESE CARS HAVING THAT PROBLEM. THE CAR CAN BREAK DOWN AFTER SO MUCH OIL HAS BEEN BURNED AND THAT COULD HAPPEN UN EXPECTEDLY. IT'S DRIVABLE BUT NOT SAFE.",
        "vin": "2T1BR12E02C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/03/2019",
        "dateOfIncident": "12/01/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286750,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE IS USING EXCESSIVE OIL. NEED TO ADD 1 QUART EVERY 300 MILES TO KEEP FILLED. THE CAR HAS 120,000 MILES. NOTICE BLUE SMOKE UPON ACCELERATION. CAR HAS BEEN REGULARLY SERVICED ACCORDING TO TOYOTA OWNER'S MANUAL.",
        "vin": "2T1BR12E42C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/18/2019",
        "dateOfIncident": "10/18/2019",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11269404,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA COROLLA 2002 CE HAS A DESIGN FLAW WITH THE PISTONS. THERE ARE NOT ENOUGH HOLES IN THE PISTONS TO ALLOW ENOUGH OIL TO GO THROUGH AND AS A RESULT, THE VEHICLE IS BURNING A LOT OF OIL, UP TO 1 QUART OF OIL EVERY 250 MILES. PLEASE! CAN YOU HELP ME WITH THIS SITUATION? THANK YOU.",
        "vin": "1NXBR12EX2Z"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/30/2015",
        "dateOfIncident": "06/15/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10807455,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE DRIVING 65 MPH, THERE WAS A LOW RUMBLING SOUND COMING FROM THE ENGINE. THERE WAS ALSO A STRONG EXHAUST ODOR INSIDE THE VEHICLE AND IT BURNED MORE OIL THAN NORMAL. THE CONTACT HAD TO PLACE APPROXIMATELY FIVE QUARTS OF OIL INTO THE VEHICLE AFTER DRIVING 150 TO 200 MILES. THE SERVICE ENGINE LIGHT REMAINED ILLUMINATED AND THE VEHICLE FAILED TO ACCELERATE NORMALLY. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC AND DIAGNOSED THAT THE HEAD GASKET NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED AND THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "2T1BR12E32C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "09/23/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781515,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DASH LIGHT INDICATING A PROBLEM WITH MY AIR BAG IS ON. TOYOTA STATES THAT A SAFETY RECALL IS PENDING THAT MIGHT AFFECT MY CAR. UNTIL THEN, THEY ARE UNABLE OR UNWILLING TO REPAIR MY CAR. THEY STATE THAT THE AIRBAG MAY GO OFF ON IT'S OWN. THEY CANNOT TELL ME HOW LONG IT MAY BE BEFORE THE RECALL IS ANNOUNCED. THIS SEEMS HIGHLY DANGEROUS TO ME.",
        "vin": "2T1BR38E73C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/05/2015",
        "dateOfIncident": "01/27/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714687,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V043000 (AIR BAGS); HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "2T1BR32E54C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "01/26/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10704075,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOY DURING THE CRASH. THE CRASH WAS SERIOUS; IT TOTOLED THE CAR.  *TR",
        "vin": "1NXBR12E22Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/10/2015",
        "dateOfIncident": "02/19/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10693173,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING HOME FROM WORKING 12 HOUR GRAVEYARD SHIFT. I FELL ASLEEP AT THE WHEEL AND RAN OFF THE RIGHT HAND SIDE OF OUR BLACKTOP ROAD 1 MILE FROM HOME. MY 2002 COROLLA WAS TRAVELING AROUND 50MPH I AWOKE AND ATTEMPTED TO CORRECT THE CAR'S PATH AND HIT A TREE HEAD ON DESTROYING THE RIGHT GRILL BUMPER HOOD, WINDSHIELD, RIGHT FENDER, INNER UPPER FRAME WORK AND HEADLAMP ASSEMBLY AND WIRING. MY DASH LIGHT CAME ON THAT SAID MY AIRBAG DEPLOYED. MY STEERING WHEEL AIRBAG WAS STILL INTACT IT FAILED TO DEPLOY OR INFLATE. I WAS SAVED BY GOD AND MY SEAT BELT.   *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/31/2015",
        "dateOfIncident": "01/15/2015",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10680241,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA TOLD US NOT TO PUT ANYONE IN PASSENGER SIDE BECAUSE AIRBAG IS DANGEROUS. WE HAVE FOUR ADULTS IN OUR FAMILY AND NEED TO USE THE PASSENGER FRONT SEAT.  TOYOTA (JOHNSON CITY TN) SAY THEY HAVE NO IDEA WHEN THEY CAN FIX THE AIR BAG BECAUSE THEY HAVE NO IDEA WHEN PARTS WILL BE AVAILABLE. \"IT COULD BE MONTHS\".  WE NEED TO HAVE IT FIXED SOON.  *TR",
        "vin": "JTDBR32E432"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": true,
        "dateComplaintFiled": "09/20/2014",
        "dateOfIncident": "04/10/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10637696,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN THE \"SLOW \" LANE ON THE INTERSTATE HEADED TO SCHOOL. I RECEIVED A SPEEDING TICKET THE DAY BEFORE SO I MADE SURE TO ON BE IN SLOW LANE GOING SPEED LIMIT. THE CAR IN FRONT OF ME A RED CADILIAC BRAKE AND KIND OF HARD SO I BRAKE TRAVELING AT 60 TO 65 MPH. I BRAKE QUICK NOT REAL HARD AND WITH IN SECONDS I REALIZED THE CAR WAS LOOSING CONTROL. I QUICKLY JUMPED INTO THE PASSENGER SEAT AS SOON AS I REALIZED IT WAS IN GODS HANDS. I THEN DID A 360 AND A 180 ACROSS ALL THREE LANES NEVER HITTING ANOTHER CAR OR TRUCK HIT THE CENTER OF THE INTERSTATE AND ROLLED THREE TIMES. I KNOW THAT THIS IS WHAT HAPPENED BECAUSE THE WOMEN TRAVELING BEHIND ME SAID SHE HAD TO STOP BC SHE DIDN'T KNOW HOW I WAS ALIVE. I TOLD THEM THAT I THOUGHT A TIRE HAD BLOWN BUT REALLY I HAD NO CLUE I KNEW I WAS PISSED BC MY 6 MONTH OLD CAR GONE. IT WAS THE FIRST THING I WAS ACTUALLY BUYING ON MY OWN AND BAM. I HAD A SPRAINED ANKLE AND CUT ON SHOULDER ROAD RASH AND WHIP LASH BAD. RECENTLY I HAVE RESEARCHED AND SAW MY CAR IS IN FACT ON THE LIST. THE YEAR AND MODEL BUT HOW WOULD YOU KNOW IF MY EXACT CAR WAS DEFECTIVE? ITS BEEN IN THE IMPOUND SINCE APRIL 2002. I FEEL THIS NEEDS TO BE ADDRESSED AND I SHOULD BE COMPENSATED ACCORDINGLY.  *TR",
        "vin": "1NXB12E22Z6"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/24/2014",
        "dateOfIncident": "12/25/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10616066,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON BUMPY ROADS I WOULD HEAR A LOUD CLUNKING NOISE FROM UNDER THE CAR. I ASKED A MECHANIC WHAT IT WAS AND HE SAID IT WAS THE STRUTS.  THERE IS A RECALL ON THIS VEHICLE, 2002 TOYOTA COROLLA FOR THAT VERY THING. ONE DEALER SAID HE WOULDN'T FIX IT.  *TR",
        "vin": "1NXBR12E022"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2013",
        "dateOfIncident": "05/10/2013",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512754,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA CENTRAL DOWNTOWN LOS ANGELES HAS FAILED TO REMEDY THE RECALL OF  THE ELECTRONIC CONTROL MODULE(ECM),I'VE BEEN TO CENTRAL TOYOTA SERVICE DEPARTMENT TWO TIMES AND THEY TURNED ME AWAY BY GIVING ME EXCUSE OF PARTS UNAVAILABILITY. THEREFORE PLEASE ADVICE ME WHAT TO DO NEXT?.  THANK YOU.  *TR",
        "vin": "1NXBR32E63Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/17/2013",
        "dateOfIncident": "12/24/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508592,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE CONTACT STATED THAT ANOTHER VEHICLE CRASHED INTO THE PASSENGER SIDE OF HIS VEHICLE AND THE AIR BAGS FAILED TO DEPLOY. THE CONTACT MENTIONED THAT THE AIR BAG WARNING LAMP ILLUMINATED. A POLICE REPORT WAS FILED AND NO INJURIES WERE REPORTED. THE VEHICLE WAS TAKEN TO THE DEALER. THE TECHNICIAN WAS UNABLE TO DIAGNOSE THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 140,000 AND THE CURRENT MILEAGE WAS 165,000.  *TR",
        "vin": "1NXBR18E32Z"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/16/2012",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10480661,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE CONTACT STATED WHILE ACCELERATING, THE VEHICLE LOST POWER AND WITHIN A FEW MINUTES IT SUDDENLY ACCELERATED. THE BRAKE PEDAL HAD TO BE DEPRESSED IN ORDER TO CONTROL THE SPEED. THE VEHICLE WAS TAKEN TO THE DEALER SEVERAL TIMES FOR THE FAILURE. A DIAGNOSTIC TEST WAS PERFORMED THAT WAS UNABLE TO DISPLAY A FAILURE CODE. THE 02 SENSOR AND THE CATALYTIC CONVERTER WERE REPLACED; HOWEVER, THE FAILURE WAS NOT CORRECTED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 78,000 AND THE CURRENT MILEAGE WAS 147,000.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/31/2012",
        "dateOfIncident": "05/06/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10446024,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS AND HAS BEEN EXCESS OIL USUAGE. IT USES A QUART ABOUT EVERY 400 HUNDRED MILES. I BOUGHT THE CAR USED AT A LOCAL HONDA DEALER MAY, 2010. IT HAD 102,000 MILES ON IT. IT NOW HAS 117,000. IT'S BEEN USING OIL EVERY SINCE I'VE HAD IT. I TOOK IT BACK TO THE DEALER AND THEY COULDN'T FIND ANY THING WRONG. THEY SAID THE ENGINE WAS CLEAN AND THERE WERE NO OIL LEAKS ANYWHERE.    I'VE SEARCHED THE INTERNET AND THERE ARE ALOT OF COMPLAINTS POSTED ABOUT THIS CAR. THE PROBLEM IS THE ENGINE PUT IN THE CAR IN 2002. A 1.6L WAS REPLACED WITH A NEW 1.8L ENGINE AND EVIDENTLY THE 1.8L DIDN'T SEAT PROPERLY CAUSING OIL USUAGE.    MY SON DROVE THIS CAR WHILE HE WAS AT COLLEGE. THE PROBLEM IS, WITH THIS KIND OF OIL USAGE, YOU CAN RUN THE CAR OUT OF OIL. WE TRIED TO KEEP UP WITH IT, BUT IF YOU RUN IT HIGH SPEEDS IT WILL USE MORE OIL. IF  THE CAR RUNS OUT OF OIL ON AN INTERSTATE AND THE ENGINE LOCKS UP, WELL YOU COULD HAVE A SERIOUS SAFETY PROBLEM.      I KEEP THE CAR AT HOME NOW BECAUSE OF THE SAFETY CONCERNS. WE DRIVE IT LOCALLY ONLY.  *TT",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2012",
        "dateOfIncident": "12/14/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444506,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING SUDDENLY BECAME VERY STIFF AND DIFFICULT.  TOOK TO LOCAL TOYOTA DEALER WHO DIAGNOSED A FAILED RACK, AT 75,000 MILES.  REPAIRED AT COST OF $1060.  THREE WEEKS LATER EXPERIENCED SAME PROBLEM.  RETURNED TO DEALER AND WAS TOLD THE INTERMEDIATE SHAFT JOINT WAS CORRODED AND STUCK.  CLAIMS THEY HAVE FIXED IT.  THIS ISSUE NEEDS TO BE LOOKED INTO AND A RECALL ORDERED.  THIS IS A DANGEROUS AND SUDDEN FAILURE!  *TT",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "01/01/2012",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10442872,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A WEEK AGO, DRIVER SEAT COULD NOT RETURN TO UPRIGHT POSITION AFTER ADJUSTING ANGLE. THEN WE NOTICED LARGE PIECE OF SEAT BACK FRAME WAS PROTRUDING ON THE LEFT-HAND SIDE. UPON REMOVAL OF COVERING AND CUSHION TO UNCOVER THE BACK FRAME, WE DISCOVERED THAT, OF THE TWO SOLID-STEEL ARMS ATTACHING THE BACK FRAME TO THE BOTTOM PART OF THE BUCKET SEAT (THE ADJUSTER MECHANISM), THE ARM ON THE LEFT-HAND SIDE HAS BEEN SPLIT INTO TWO SEPARATE PIECES, ALONG A HORIZONTAL BREAK IN THE STEEL ITSELF. IN SHORT, THE LEFT HALF OF THE SEAT BACK FRAME IS NOT ATTACHED ANYMORE. INITIALLY WE SUSPECTED VANDALISM, BUT THE BREAK IS DEFINITELY NOT A SAW CUT (EVEN IF WERE POSSIBLE); AND WE ALSO DISCOVERED THAT THE STEEL ARM ON THE RIGHT-HAND SIDE HAS A HALF-INCH LONG CRACK IN ALMOST EXACTLY THE SAME SPOT, AND ALSO HORIZONTAL. THIS LED US TO CONCLUDE THAT THE BREAK ON THE LEFT ARM WAS DUE TO A DEVELOPING CRACK IN THE STEEL, AND THE RIGHT ARM IS CLEARLY HEADED TOWARDS AN IDENTICAL FRACTURE -- WHICH WOULD COMPLETELY SEPARATE THE SEAT BACK FRAME FROM THE BUCKET SEAT ALTOGETHER! THE TWO STEEL ARMS ARE CLEARLY MADE OF SUB-STANDARD MATERIAL. WITHOUT CONSIDERING THE SIGNIFICANT COST OF REPLACING THE BUCKET SEAT, THIS IS CLEARLY A SERIOUS SAFETY HAZARD, SINCE AT ANY MOMENT THE SEAT BACK COULD COLLAPSE COMPLETELY DUE TO SUB-STANDARD STEEL PARTS TEARING APART. IT IS FORTUNATE THIS WAS DISCOVERED WHILE THE VEHICLE WAS NOT IN MOTION. THIS IS DEFINITELY A SAFETY RECALL ISSUE. WE HAVE SEVERAL PHOTOS OF THESE DEFECTS, INCLUDING CLOSE-UPS, READY TO SEND YOU UPON REQUEST.  *TR",
        "vin": "2T1BR12E72C"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/19/2011",
        "dateOfIncident": "07/01/2011",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10414331,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS VEHICLE USED FROM A DEALER ON OCTOBER 17, 2007.  AFTER PURCHASING THE CAR I NOTICED THAT SOMETIMES WHEN I PULL OUT THE SEAL BELT, IT LOCKS AND CAN NOT BE PULLED OUT ANY FURTHER.  THE BELT CAN ONLY BE PULLED OUT FURTHER ONLY AFTER A DRIVE AND START TO APPLY THE BRAKES.  AFTER AN ARGUMENT WITH THE SALESMAN THE MANAGER AGREED TO REPLACE THE FRONT SEAT BELTS.  A DAY LATER, I WATCHED THE MECHANIC INSTALL THE PAIR OF SEAT BELTS THAT CAME FROM THE DEALER IN SEALED BOXES.  AFTER INSTALLATION THE PROBLEM IS STILL THERE.  MANAGEMENT TOLD ME I WAS LUCKY THEY REPLACED THE SEAT BELTS BECAUSE USED CARS ARE ALL SOLD \"AS IN\".  THEY REFUSED TO DO ANY FURTHER REPAIRS.  TOYOTA DEALERSHIP SAYS THAT I WOULD HAVE TO PAY A DIAGNOSTIC TO FIND OUT WHAT THE PROBLEM IS  AND THEN PAY FOR REPAIRS.  A GENTLEMAN FROM TOYOTA'S PARTS DEPARTMENT TRIED TO BUCKLE HIMSELF IN AND HAD THE BELT LOCKED AS HE WAS PULLING THE BELT OUT.  HE TRIED AGAIN SLOWLY BUT SAME RESULTS.  HE CLAIMS HE NEVER EXPERIENCED ANYTHING LIKE THIS AND DON'T KNOW WHAT COULD BE WRONG.  CAN ANYONE HELP ME?",
        "vin": "1NXBR12E72Z"
    },
    {
        "components": "STEERING,SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "12/29/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374130,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, WHEN THE BRAKE PEDAL WAS DEPRESSED WHILE DRIVING AROUND A CURVE, THE VEHICLE SUDDENLY ACCELERATED AND LOST POWER STEERING. THE VEHICLE SPUN AROUND AND CRASHED. THERE WERE NO INJURIES. THE VEHICLE WAS NOT REPAIRED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 75,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/23/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372263,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE CONTACT NOTICED THAT WHEN APPLYING PRESSURE TO THE ACCELERATOR PEDAL, IT REMAINED STUCK IN THE FULL THROTTLE POSITION. THE CONTACT TURNED THE VEHICLE OFF AND APPLIED EXTREME PRESSURE TO THE PEDAL IN ORDER TO RELEASE IT.  THE DEALER INSPECTED THE VEHICLE AND VERIFIED THAT THE THROTTLE WAS STICKING BUT DID NOT PROVIDE A DIAGNOSIS NOR DID THEY REPAIR THE VEHICLE.  THE MANUFACTURER WAS NOTIFIED AND A COMPLAINT WAS FILED.   THE CURRENT MILEAGE WAS 95,217. THE FAILURE MILEAGE WAS APPROXIMATELY 93,000.   UPDATED 2/23/11 *CN    UPDATED 05/09/11",
        "vin": "2T1BR12E82C"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/20/2010",
        "dateOfIncident": "10/20/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366942,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA SIENNA MINIVAN.  WHEN I TRY TO OPEN THE DRIVER SIDE SLIDING DOOR, I CAN HEAR IT UNLATCH BUT REMAINS SHUT.  YOU HAVE TO PUSH THE REAR PART OF THE DOOR BACK IN UNTIL YOU HEAR A CLICK, THEN YOU HAVE TO VIOLENTLY PULL THE HANDLE AND THE DOOR WILL OPEN. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2010",
        "dateOfIncident": "08/01/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351495,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TOYOTA COROLLA 2002 KEEPS WANTING TO STALL. I'VE TAKEN IT IN SEVERAL TIMES AND MECHANICS SAYS THERE IS NO PROBLEM. NOT SURE WHAT TO DO. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/04/2010",
        "dateOfIncident": "07/29/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10347344,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE TRAVELING AT 25  MPH, THE CONTACT WAS STRUCK FROM THE FRONT END BY ANOTHER VEHICLE. THE CONTACT'S VEHICLE WAS DESTROYED. THE AIR BAGS DID NOT DEPLOY. THE CONTACT SUFFERED INJURIES TO HER HEAD AND CHEST. A POLICE REPORT WAS AVAILABLE. THE VEHICLE WAS NOT FURTHER INVESTIGATED FOR THE FAILURE OF THE AIR BAGS. THE CURRENT AND FAILURE MILEAGES WERE 106,000.",
        "vin": "1NXBR12E72Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/23/2010",
        "dateOfIncident": "05/10/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10344841,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA.  THE CONTACT STATED THAT AFTER STARTING HIS VEHICLE, HE FORGOT TO PUT ON HIS SAFETY BELT, AND WHEN HE DROVE AWAY HE CRASHED INTO A CONCRETE FOUNDATION WHILE DRIVING APPROXIMATELY 15 MPH.  HIS HEAD HIT THE WINDSHIELD CAUSING IT TO CRACK.  THE CONTACT STATED THAT HE SUFFERED A CONCUSSION AND BRIEFLY LOST CONSCIOUSNESS. THE AIR BAGS DID NOT DEPLOY.  HE DROVE THE VEHICLE TO HIS RESIDENCE AND CALLED THE INSURANCE COMPANY. THE VEHICLE WAS TAKEN TO AN AUTO BODY SHOP WHERE THE MECHANIC STATED THAT THE VEHICLE WAS DESTROYED.  TOYOTA WAS CONTACTED AND A CASE MANAGER INFORMED HIM THAT UNDER THE CIRCUMSTANCES OF THE CRASH THE AIR BAGS WERE NOT DESIGNED TO DEPLOY.  THE FAILURE MILEAGE WAS APPROXIMATELY 40,000.",
        "vin": "1NXBR18E6X2"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/22/2010",
        "dateOfIncident": "05/26/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340061,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2002 TOYOTA COROLLA, SUSTAINED A BLOWOUT ON THE STEER TIRE.*BF  THE TIRE SEPARATED AND DAMAGED THE LEFT FRONT QUARTER PANEL ON THE VEHICLE. (OHIO TRAFFC CRASH REPORT # 10-0190-89)*JB    UPDATED 08/05/10  *BF",
        "vin": ""
    },
    {
        "components": "VISIBILITY,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/01/2010",
        "dateOfIncident": "03/12/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10334116,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SOMETIME WITHIN THE FIRST 2 YEARS OF OWNING MY 2002 COROLLA, THE DRIVERS SIDE WINDOW STARTED TO STOP WORKING.  IT WAS INTERMITTENT.  SOMETIMES I WOULD ROLL MY WINDOW DOWN TO ORDER TAKEOUT AND COULDN'T ROLL IT BACK UP AND HAVE TO DRIVE IN COLD THEN AFTER SEVERAL TRIES, IT WOULD ROLL UP AND BE FINE UNTIL THE NEXT TIME.....MAYBE 2 MONTHS WOULD GO BY,,,,SO I DECIDED TO HAVE THE DRIVER SIDE MOTOR  REPLACED UNDER MY 6 YEAR, 100,000 MILES  WARRANTY.  IT  HAS BEEN FINE UNTIL THIS YEAR, NOW MY DOOR HANDLE  ON THE INSIDE HAS  BROKEN, AND SOME HOW THE WINDOW HAS COME OFF THE TRACT AND WHEN I ROLL THE WINDOW UP YOU CAN SEE BY THE TINTING, THAT IT HAS SHIFTED AND NOW THE GAP ON MY WINDOW, NOT AT THE TOP BUT AT THE SIDE TOWARDS THE REAR, THERE IS A 1/4 INCH GAP WHEN WINDOW ROLLS UP.  THIS HAPPENED AFTER MY OUTSIDE DOOR HANDLE BECAME STUCK WHEN I OPENED MY DOOR, IT STAYED LIFTED UP AND I COULDN'T CLOSE MY DRIVERS SIDE DOOR.  I HAD TO PHYSICALLY PUSH DOWN ON THE OUTSIDE DOOR HANDLE IN ORDER TO GET MY DOOR TO SHUT AND LATCH.....NOW MY WINDOW WON'T ROLL UP ALL THE WAY AND .....ITS A PAIN NOT TO BE ABLE TO GO THRU THE CAR WASH....I HAVE TO HOLD TOWELS IN IT IN ORDER TO NOT GET INTERIOR WET.   MY CAR ONLY HAS 80,000 MILES ON IT.....ANYONE ELSE HAVING THAT KIND OF PROBLEMS....PEOPLE HAVE TRIED TO GET DOOR PANEL OFF AND YOU NEED A SPECIAL TOOL....OF COURSE YOU DO!  I DON'T HAVE ANY CASH TO FIX IT SO I JUST LIVE WITH IT.....WHAT A PAIN! THE DEALERSHIP HAS BEEN SOLD SO, I AM SOL!  SORRY THEY SAID.....THAT WAS UNDER THE OLD DEALERSHIP AND WE DON'T HONOR THEIR REPAIRS!  WHATEVER........AT LEAST I SHOULD BE THANKFUL MY GAS PEDAL DOESN'T STICK! *TR",
        "vin": "1NXBR12E22Z"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/20/2010",
        "dateOfIncident": "09/06/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10326592,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE CONTACT STATED THE DRIVER'S SIDE SEAT FRAME WAS FRACTURED. WHEN ACCELERATING, THE SEAT WOULD SLIDE BACKWARDS AND FORWARD. THE DEALER REPLACED THE SEAT BUT THE FRAME WAS BENT WHICH PREVENTED THE SEAT FROM STAYING IN PLACE. THE FAILURE MILEAGE WAS 40,000 AND THE CURRENT MILEAGE WAS 80,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/24/2010",
        "dateOfIncident": "05/04/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321712,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE DRIVING AT  APPROXIMATE SPEEDS OF 45 MPH, THE DRIVER'S SEAT FRAME FRACTURED. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE SEAT WAS REPLACED. THE FAILURE MILEAGE WAS 49,000 AND THE CURRENT MILEAGE WAS 83,000. UPDATED 05/13/10. *LJ",
        "vin": "1NXDR12E82V"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/18/2010",
        "dateOfIncident": "09/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320617,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPTEMBER 22, 2009 MY 2002 TOYOTA COROLLA CE SUDDENLY ACCELERATED INTO MY GARAGE WALL CAUSING THE CAR TO BE TOTALED (LOSS OF OVER 7,000) PER FARMERS INSURANCE. [XXX] AT THAT TIME WAS UNAWARE OF ANY ISSUES WITH TOYOTA'S - THE FLOOR MAT SITUATION WAS JUST COMING OUT. I REPORTED THIS TO TOYOTA ON 10/2/09 INCIDENT [XXX]AND THEY HAD SAID THERE WERE NO PROBLEMS REPORTED ON THE 2002 COROLLA'S. I DID REPURCHASED A NEW 2010 AND NOW WITH ALL THE ISSUES I FEEL UNSAFE WHEN DRIVING THIS CAR BUT AM LEFT LIKE MANY OTHERS STUCK WITH IT. TOYOTA HAD A GOOD REPUTATION AND I WISH THIS PROBLEM WOULD BE RESOLVED. JUST WANTED TO LET YOU KNOW SO THIS WILL SOMEHOW HELP IN THE ONGOING SEARCH FOR AN ANSWER.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)*TR",
        "vin": "1NXBR12E12Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/05/2010",
        "dateOfIncident": "08/09/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10317201,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "IN AUGUST 2009 MY CATALYTIC CONVERTER ATTACHED TO THE MUFFLER WENT OUT. THEY PUT IN THE CODE THAT WAS GIVEN FOR THAT JOB. I HAVE HAD NOTHING BUT PROBLEMS , I WAS BACK IN THE SHOP EVERY OTHER WEEK BECAUSE MY EMERGENCY LIGHT WOULD KEEP COMING ON. I AM 68 YEARS OLD AND FOR ME THIS IS A SAFETY  ISSUE BECAUSE I DIDN'T RECOGNIZE  MY CAR WAS HAVING OTHER PROBLEMS. THIS ELECTRICAL PROBLEM HAS NOT BEEN ADDRESSED/CORRECTED TO THIS DAY. L WOULD APPRECIATE  IF YOU WOULD CONTACT TOYOTA  AND HAVE THEM TAKE CARE OF THIS. *TR",
        "vin": "1NXBR32E33Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE DRIVING APPROXIMATELY 50 MPH AND APPROACHING A RED LIGHT WHEN HE STEPPED ON THE BRAKE PEDAL IT DID NOT RESPOND AND CAUSED THE CONTACT TO CRASH INTO THE VEHICLE IN-FRONT OF HIM. THE DRIVERS FRONT AIR BAG DID NOT DEPLOY. HE HAD EXPERIENCE BRAKE FAILURE TWICE. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO BE DIAGNOSED. THERE WERE NO INJURIES. THE FAILURE MILEAGE WAS 140,000 AND THE CURRENT MILEAGE WAS 150,000.",
        "vin": "1NXBR12E72Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "03/05/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315720,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA COROLLA LE ACCELERATION PEDAL:    --OCCASIONALLY, BUT RARELY, APPEARS TO STICK MOMENTARILY (A SENSATION LIKE A SPRING THAT HAS TEMPORARILY STUCK AND THEN SPRUNG LOOSE).  I TOOK IT INTO MY TOYOTA DEALER BUT THEY SAID THERE WAS NOTHING WRONG THAT THEY COULD DETECT.  THEREFORE NOTHING HAS BEEN DONE TO CORRECT THE MYSTERY.  THE STICKING/SPRINGING SENSATION STILL OCCASIONALLY OCCURS BUT IT IS VERY HARD TO PREDICT WHEN IT WILL.  --IT SEEMS TO HAPPEN SHORTLY AFTER STARTING UP.  I AM CONCERNED BECAUSE I DO NOT WANT THE ACCELERATION PROBLEMS THAT HAVE OCCURRED WITH OTHER TOYOTAS.  THE DATE OF THE FIRST INCIDENT, LISTED BELOW (MAR 5, 2002), IS APPROXIMATE.  THE VEHICLE WAS PURCHASED OCT. 2001. *TR",
        "vin": "2T1BR18E42C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "01/15/2010",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313574,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE DRIVING INTO A PARKING SPACE UNDER 5 MPH WITH HER FOOT ON THE BRAKE PEDAL, THE VEHICLE STARTED TO ACCELERATE. THE CONTACT STATED THAT THE RPMS HAD INCREASED EXCESSIVELY. THE CONTACT ALSO CRASHED INTO A SNOW BANK. THE FAILURE MILEAGE WAS 98,000. THE CURRENT MILEAGE WAS 99,000.   UPDATED 3/24/10 *CN  UPDATED 07/27/10",
        "vin": "2T1BR12E12C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/23/2010",
        "dateOfIncident": "01/10/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313374,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONCE UPON A TIME, IT 'S ABOUT 2 YEARS AGO, I DROVE MY CAR IN HIGHWAY, MY CAR HOOD FLIP OVER AND BEND MY WINDSHIELD. I WAS SHOCK AND SCARED TO DEATH.  MY EYE VISION WAS COMPLETELY BLOCKED BY FLIP OVER HOOD WHICH COVER ALL MY WIND SHIELD. I CAN'T SEE ANYTHING IN THE FRONT.  IT'S LUCKY THAT NO OTHERS NEAR BY, I WAS ABLE TO MANAGE DROVE SLOWLY OVER ON THE SIDE AND STOP MY CAR.    THERE WAS NO SIGNAL NOR ALARMS IN MY DASHBOARD TO INDICATED THAT MY HOOD WAS NOT TIGHTLY CLOSED SO IT WAS FLIPPED OVER TO BEND MY WINDSHIELD AND   MY WINDSHIELD WAS STROKE BY HOOD AND BROKEN.    BUT I WAS IN DANGER TO DEATH BECAUSE THERE WAS NO INDICATION AND THE ACCIDENT  HAPPENED AND I WAS MANAGE SURVIVED LIVED. *TR",
        "vin": "1NXBR12E62Z"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/22/2010",
        "dateOfIncident": "09/18/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312911,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2002 MODEL TOYOTA COROLLA LE. IN THREE INSTANCES THE CAR SPED UP. THE CAR ALSO LEAPS FORWARD ONCE IN A WHILE. *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "02/18/2010",
        "dateOfIncident": "11/03/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311779,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE DRIVING 40 MPH, THE VEHICLE ACCLERATED, CRASHED INTO ANOTHER VEHICLE AND WAS IMPACTED ON THE PASSENGER SIDE. THE AIR BAGS DEPLOYED AND THE VEHICLE WAS DESTROYED. THE CONTACT WAS TAKEN TO THE HOSPITAL BUT DID NOT HAVE SUSTAIN MAJOR INJURIES. THE CONTACT STATED THAT THE VEHICLE MADE A LEFT TURN OWN IT'S OWN AND CAUSED THE CRASH TO OCCUR AND THAT THE POWER STEERING WAS FAULTY. THE FAILURE MILEAGE WAS 36,000.",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/17/2010",
        "dateOfIncident": "02/10/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10311353,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE CONTACT STATED THAT ALL FOUR OF THE INTERIOR AND EXTERIOR PLASTIC DOOR HANDLES WERE BROKEN. THE HANDLES WERE REPLACED. THE FAILURE OCCURRED WITHIN A ONE YEAR PERIOD. THE MANUFACTURER WAS NOTIFIED REGARDING RECALLS ON THE VEHICLE.  THERE WERE NO SAFETY RECALLS ON THE VEHICLE AT THAT TIME.  THE CONTACT HAS NOT EXPERIENCED ANY ADDITIONAL FAILURES WITH THE VEHICLE.  THE VIN WAS UNAVAILABLE. THE FAILURE AND CURRENT MILES WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/16/2010",
        "dateOfIncident": "10/12/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310753,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE THE CONTACT WAS DRIVING THE VEHICLE 50MPH USING THE CRUISE CONTROL SHE ATTEMPTED TO STOP THE VEHICLE AND NOTICED THAT THE BRAKES WERE LATE TO ENGAGE CAUSING THE VEHICLE TO FISH TAIL AND CRASH INTO A MAIL BOX POST. THE CONTACT WAS NOT INJURED AND A POLICE REPORT WAS NOT FILED. THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALERSHIP AND THERE WERE NO PRIOR WARNINGS. THE CURRENT AND FAILURE MILEAGES WERE 60000.",
        "vin": "2T1BR12E62C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "01/16/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310459,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 TOYOTA COROLLA AUTOMATIC TRANSMISSION GEAR SHIFT HANDLE CAN BE SHIFTED BY ACCIDENTALLY TOUCH.  THERE IS NO NEED TO PUSH DOWN THE LOCK BUTTON FOR CHANGING THE GEAR FROM \"D\" TO \"N\" OR OTHERS. *TR",
        "vin": "2T1BR12E22C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/03/2010",
        "dateOfIncident": "03/10/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10304529,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING A TOYOTA COROLLA NORMALLY WHEN SHE SUDDENLY FOUND THAT SHE COULD NOT REDUCE SPEED AND TO CONTROL THE  CAR. THE CAR WENT FAR OFF THE ROAD AND HIT A POST. THERE WERE NO OTHER VEHICLES AROUND OR INVOLVED; IT WAS DAY TIME; THERE WERE NO EXTERNAL FACTORS THAT AFFECTED THE ROAD CONDITION, SUCH AS SNOW OR RAIN. MY WIFE WAS (AND IS) IN GOOD HEALTH, SHE WAS NOT UNDER THE INFLUENCE OF ALCOHOL OR DRUGS (NOR DOES SHE DRINK ALCOHOL OR USE DRUGS); SHE HAS A FLAWLESS DRIVING RECORD, AND SHE HAS NEVER RECEIVED TICKETS OR GOTTEN INTO ANY OTHER ACCIDENTS SINCE SHE HAS GOTTEN HER DRIVERS LICENSE ABOUT 15 YEARS AGO. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/25/2009",
        "dateOfIncident": "09/28/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293487,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 TOYOTA COROLLA.  IT WAS DIFFICULT TO STOP DURING BRAKE APPLICATION AT 25 MPH.  HE TOOK HIS VEHICLE TO THE DEALER FOR INSPECTION. THE TECHNICIAN STATED THAT THE BRAKE LINE WAS CORRODED, AND THUS NEEDED TO BE REPLACED AT AN EXPENSE OF $1400.00.   THE FAILURE MILEAGE WAS 64,995.",
        "vin": "2T1BR12E52C"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/23/2009",
        "dateOfIncident": "11/20/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293208,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2002 TOYOTA COROLLA. WHILE DRIVING APPROXIMATELY 35 MPH THE ENGINE WARNING LIGHT ILLUMINATED ON THE INSTRUMENT CONTROL PANEL. SHE ADDED OIL TO THE ENGINE, AND THEN TOWED THE VEHICLE TO A LOCAL REPAIR FACILITY.  A MECHANIC STATED THAT THE TIE ROD FAILED, AND THAT THE ENGINE NEEDED TO BE REPLACED. NO REPAIRS WERE MADE. SHE FILED REPORT NUMBER 091113338 WITH THE MANUFACTURER.  THE CURRENT AND FAILURE MILEAGES WERE 116,000.",
        "vin": "1NXBR12E82Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2009",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10292403,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 TOYOTA COROLLA ACCELERATED OUT OF CONTROL WHILE I WAS DRIVING IT A FEW YEARS AGO.  THE PEDAL WAS NOT STUCK, THE CRUISE CONTROL WAS NOT ON.  I CALLED TOYOTA TO COMPLAIN AND THEY SAID IT WAS AN ISOLATED INCIDENT, AND WAS NOT COVERED UNDER ANY WARRANTY.  MY MECHANIC NEVER FOUND THE CAUSE OF THE PROBLEM BUT I HAVE LIVED IN FEAR THAT IT WOULD HAPPEN AGAIN.  I HAVE HEARD THAT MANY OTHER TOYOTA AND LEXUS OWNERS HAD THE SAME PROBLEM AND TOYOTA IS BLAMING IT ON FAULTY FLOOR MATS.  THIS IS PATENTLY FALSE AND THEY ARE TRYING TO COVER UP A MANUFACTURING DEFECT.  I WAS ALMOST KILLED AND OTHER DRIVERS APPARENTLY WEREN'T AS LUCKY AS I WAS TO GET OFF THE ROAD SAFELY.  I EMAILED TOYOTA RECENTLY AND RECEIVED NO RESPONSE OTHER THAN AN AUTOMATED NOTICE OF RECEIVING MY EMAIL.      PLEASE LET ME KNOW OF ANY RECOURSE I HAVE IN THIS MATTER. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/08/2009",
        "dateOfIncident": "01/01/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286802,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA COROLLA THAT USES AN EXCESSIVE AMOUNT OF OIL IT IS NOT LEAKING IT OUT IT IS BURNING IT. AFTER READING NUMEROUS COMPLAINTS OF VIRTUALLY THE SAME PROBLEMS FROM OTHER TOYOTA COROLLA CONSUMERS I BELIEVE THIS SEEMS TO BE A COMMON PROBLEM IN THIS YEAR MAKE AND MODEL. I EVEN HAD TO REPLACE MY CATALYTIC CONVERTER DUE TO THE PROBLEM. MY LOCAL TOYOTA DEALERSHIP TOLD ME TO CALL THE NATIONAL TOYOTA CUSTOMER EXPERIENCE LINE AND THEY TOLD ME THAT THIS WAS NOT A RECOGNIZED PROBLEM. FROM EVERYTHING THAT I HAVE BEEN TOLD FROM CAR REPAIR PLACES AND THE INTERNET I MUST \"YOUR LOOKING AT A COMPLETE OVERHAUL... YOU WANT TO REPLACE THE PISTON RINGS AND VALVE STEMS... BUT EVERY GASKET YOU TOUCH OR GO NEAR SHOULD BE REPLACED ALONG THE WAY. ALSO ADD IN INCIDENTALS FOR ITEMS THAT BREAK OR THINGS THAT ARE DISCOVERED ALONG THE WAY...\" TOYOTA WILL NOT ADMIT THAT THIS IS A MANUFACTURING PROBLEM; HOWEVER, LOTS OF PEOPLE ARE HAVING ISSUES WITH IT INCLUDING MYSELF. I HAVE NOT DONE AN OVERHAUL OF THE ENGINE BECAUSE I AM LOOKING FOR TOYOTA TO TAKE RESPONSIBILITY FOR THEIR POOR WORK. I DID REPLACE THE CATALYTIC CONVERTER IN JULY OF 2009. RIGHT NOW I AM GOING THROUGH ALL MY IN LESS THAN 3,000 MILES. I HAVE TO PUT OIL IN BEFORE MY REGULAR OIL CHANGES. NOW I AM JUST WAITING FOR THE NEXT MAJOR REPLACEMENT DUE TO THIS PROBLEM. MANY OTHERS ARE PUTTING QUARTS OF OIL IN EVERY 1,000 MILES OR LESS. I CAN'T WAIT UNTIL I GET TO THIS POINT TO HAVE THIS RESOLVED. *TR",
        "vin": "1NXBR12E82Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2009",
        "dateOfIncident": "07/22/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281862,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WOULD LIKE TO DOCUMENT MY CONCERN REGARDING THE FAILURE OF THE CHARCOAL CANISTER IN MY 2002 TOYOTA COROLLA.  THIS SEEMS TO BE A COMMON PROBLEM AND I HAVE SEEN QUITE A FEW PEOPLE COMPLAIN ABOUT THE SAME ON THE INTERNET.  REGARDLESS, I FEEL THAT A PART SO NON DESCRIPTIVE SHOULDN'T COST OVER $500 TO REPLACE.  SECONDLY TOYOTA MOTOR COMPANY INSIST THAT THE PART WOULD BE COVERED FOR A RECURRING FAILURE ONLY IF IT IS REPLACED AT THE DEALER, WHERE THE COSTS ARE 2/3RDS MORE THAN A NORMAL SERVICE SHOP SUCH AS MIDAS.  TOYOTA SHOULD NOT ADVERTISE ON RELIABILITY IF PARTS FAIL AT 50000 MARK AND THAT TO BECOMES SO EXPENSIVE TO REPLACE (INCLUDING LABOR).  I SEE THIS IS A WIDE SPREAD PROBLEM AND I WOULD APPRECIATE IF THERE A RECALL IS INITIATED ON THIS PART AND REPLACEMENTS DONE BY THE MANUFACTURER. *TR",
        "vin": "2T1BR12E02C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/11/2009",
        "dateOfIncident": "07/23/2009",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10280059,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE 5 AT 60 MILE PER HOUR HITTING PICKUP TRUCK FROM THE BACK THE DECLARE A TOTAL LOST AIRBAG DIDN'T OPEN. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/13/2009",
        "dateOfIncident": "07/20/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258632,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA COROLLA -  CAR JUST STOPS RUNNING, SYMPTOMS LIKE TIMING CHAIN FAILURE.  CAR STALLS AND WILL NOT DIE WHILE DRIVING.  DANGEROUS DRIVING CONDITION. *TR",
        "vin": "1NXBR12E41Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/29/2008",
        "dateOfIncident": "08/22/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243927,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "TOURING T/A",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "EARLY A.M. WENT TO CAR NOTICED TIRE COMPLETELY FLAT DUE TO 'CRACKED/DEFECTIVE' VALVE STEM.  HAD PURCHASED 4 NEW TIRES 2/8/07 FROM SAM'S CLUB.   THEY REPLACED VALVE STEM BUT DID NOT MENTION ANYTHING ABOUT A RECALL AND DID NOT CHECK OTHER VALVE STEMS FOR DEFECTS.  I WAS NOT AWARE OF RECALL UNTIL HEARING IT ON THE NEWS THIS WEEK.  NOW CONCERNED ABOUT OTHER TIRES AND IF THE 'NEW REPLACEMENT VALVE IS SAFE. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/30/2008",
        "dateOfIncident": "04/24/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232715,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "P18575R14",
                "productYear": "1995",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA.  THE VEHICLE HAS FOUR MICHELIN TIRES, SIZE P185/65S14 (NA).  IN MAY OF 2008, WHILE DRIVING 55 MPH IN A PARKING LOT, THE CONTACT DISCOVERED A FLAT TIRE ON HER VEHICLE.  THE TIRE STORE STATED THAT THE VALVE STEM WAS THE CAUSE OF THE FAILURE AND MADE THE REPLACEMENT .  THE FAILURE RECURRED AND THE VALVE STEM, ALONG WITH TWO OTHER TIRE STEMS WERE DEFECTIVE AND HAD TO BE REPLACED AS WELL.   THE FAILURE MILEAGE WAS 64,500.  UPDATED 07/29/08. *LJ  UPDATED 07/29/08",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/18/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231530,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE ALONE YET MY PASSENGER SIDE WINDOW FAILED AT ALMOST 3 YEARS AND VERY MINIMAL USAGE. NOW, AT ALMOST 6 YEARS, MY DRIVER'S SIDE WINDOW HAS ALSO FAILED. COST TO REPLACE MOTOR (PER TOYOTA DEALERSHIP) IS $495.00. I THINK TOYOTA SHOULD INVESTIGATE THEIR SOURCE AND TRY TO UPGRADE, THIS IS NOT STANDARD FOR ELECTRIC WINDOWS.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/19/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228239,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE AUTOMATIC WINDOW STOPPED WORKING WITHOUT ANY PRIOR PROBLEM.  *TR",
        "vin": "2T1BR12E52C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/08/2008",
        "dateOfIncident": "11/10/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220453,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "CROWN",
                "productYear": "1968",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM THE FIRST OWNER OF MY TOYOTA COROLLA, WHICH HAS 74,000 MILE ON IT NOW.  THE CAR HAS BEEN WELL MAINTAINED.  HOWEVER, THERE ARE SOME UNEXPECTED PROBLEMS WITH THE CAR.  AFTER I BOUGHT THE CAR THREE AND HALF YEARS (MARCH 2005), THE CHECK ENGINE LIGHT WENT ON AND IT WAS DIAGNOSED THAT THE EVAPORATION SYSTEM HAD MALFUNCTION AND THE CHARCOAL CANISTER AND VACUUM SWITCH NEEDED TO BE REPLACED.  I HAD SPENT MORE THAN $600.00 TO HAVE THIS DONE.  AT THAT TIME I DID NOT COMPLAIN TOO MUCH.  HOWEVER, THE SAME THING HAPPENED AGAIN IN NOVEMBER 2007, I HAD TO SPEND ANOTHER $600.00 TO REPLACE CANISTER AND VALVE AGAIN (AFTER TWO AND HALF YEARS LATER). I BELIEVE THAT THE TWO CHARCOAL CANISTERS HAD VERY BAD QUALITY!  *TR",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/24/2008",
        "dateOfIncident": "02/19/2008",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218998,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE MALFUNCTION DASH INDICATOR CAME ON.  FIRST TOYOTA DEALER REPLACED SPARK PLUGS AFTER DISCUSSION AND SAID DRIVE CAR FOR FEW DAYS.  WARNING LIGHT CAME ON NEXT DAY.  SECOND TOYOTA DEALER RAN FULL DIAGNOSTICS AND GOT CODE P1346. ADVISED VVTI CAM NEEDED TO BE REPLACED AND POSSIBLE TIMING CHAIN.  MINIMUM COST JUST OVER $1000.    I ASKED IF THERE WAS A SERVICE BULLETINS ON THIS.  THEY SAID NO.   THERE IS.  NOW WHAT STEP SHOULD I TAKE?  *TR",
        "vin": "2T1BR12E12C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2007",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209150,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA SEQUOIA WITH 62,000 MI. I HAVE BEEN TO TWO TOYOTA DEALERS TO FIGURE OUT MY PROBLEM. THE VSC TRAC, VSC OFF, ABS AND BRAKE LIGHTS ARE COMING ON.  FINALLY AFTER @$700 OF MY MONEY, THEY FIGURED OUT THE PROBLEM TO BE THE ECU.  THIS WILL NOW COST ME @1800 FOR PARTS, AND WHO KNOWS YET FOR LABOR.  I HAVE READ ONLINE THAT MANY OTHER TOYOTA OWNERS HAVE THE SAME PROBLEM.  THIS IS AN EXPENSIVE SITUATION, UNLESS YOU HAVE THE EXT. WARRANTY. I FEEL THAT TOYOTA NEEDS TO DO SOMETHING ABOUT THIS, MAYBE RECALL THIS AND FIX THESE CARS BEFORE THERE IS AN ACCIDENT. I LIVE IN NEW YORK WHERE THERE IS ALOT OF SNOW.  MY VSC WILL NOT WORK UNTIL I GET THIS FIXED. I HAVE TWO SMALL CHILDREN AND HAVE TO RELAY ON STANDARD BRAKES IN THE SNOW UNTIL THIS IS FIXED. TOYOTA SHOULD STAND BEHIND THEIR REPUTABLE NAME AND FIX THESE PROBLEMS ASAP..... *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/22/2007",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206573,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE NOTICED THIS IS LOT OF TOYOTAS IN LOS ANGELES.  THERE IS A BUMP IN THE BACK FENDERS, BUT NOT DUE TO ANY ACCIDENTS- THE PAINT IS PERFECT; IT JUST LOOKS LIKE THE FENDER SUCKED ITSELF IN.  ALSO, THE INTERIOR DOOR HANDLES ARE ABOUT TO BREAK.  OTHER PLASTIC PIECES OF THE INTERIOR- TRIANGULAR DOOR GUARD, STORAGE UNIT TOP, DRINK HOLDERS.. HAVE BROKEN.  *TR",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "08/01/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205049,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA COROLLA. THE ENGINE IS BURNING OIL AND THERE IS NO EVIDENCE OF A LEAK.  THE MECHANIC STATED THAT THE FAILURE IS THE ENGINE.  THE MECHANIC PUT AN OIL STABILIZER IN THE CAR TO MAINTAIN THE FAILURE. THE CURRENT AND FAILURES WERE MILEAGE 73784.",
        "vin": "2T1BR12E22C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/03/2007",
        "dateOfIncident": "09/01/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204790,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 TOYOTA PRIUS.  EACH TIME THE VEHICLE IS DRIVING FORWARD OR IN REVERSE AT APPROXIMATELY 4 TO 10 MPH, IT SHAKES VIOLENTLY.  THE FAILURE OCCURS INTERMITTENTLY AND USUALLY IN COLD WEATHER.  THE VEHICLE SHAKES ROUGHLY AFTER IT HAS BEEN DRIVEN FOR A WHILE.  THE VEHICLE WAS TAKEN TO A DEALER ON TWO OCCASIONS.  SERVICE BULLETIN NUMBER 20040604 WAS REFERENCED.  THE DEALER DISCOVERED THAT THE STEERING RACK AND STEERING COMPUTER FAILED AND NEEDED TO BE REPLACED AT THE COST OF $2,200.  THE CURRENT MILEAGE WAS 50,000 AND FAILURE MILEAGE WAS 40,000.",
        "vin": "JT2BK18U820"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/01/2007",
        "dateOfIncident": "07/10/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10204517,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENT FUNCTION OF PASSENGER SIDE WINDOW BEGAN IN 2004. TOTAL FAILURE OF PASSENGER SIDE WINDOW FUNCTION FOLLOWED. WINDOW IS COMPLETELY INOPERATIVE, NEITHER MASTER CONTROL OR PASSENGER WINDOW CONTROL WILL WORK. DIFFICULT TO COMPREHEND WHEN YOU CONSIDER THAT I RARELY HAVE PASSENGERS AND NEVER USE THE WINDOW IN QUESTION. I EXPECT MUCH BETTER OF TOYOTA WHICH IS WHY I CHOSE TO PURCHASE ANOTHER TOYOTA.  *TR",
        "vin": "2T1BR12E52C"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "07/05/2007",
        "dateOfIncident": "07/05/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195402,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CHARCOAL CANISTER VACUUM SWITCHING VALVE WAS GONE BAD AND STUCK IN POSITION 1. THIS HAPPENED TO MOST OF THE COROLLA. I HAVE READ ON INTERNET ABOUT TOYOTA FIXING THIS PROBLEM TO FEW OF THE CUSTOMERS AS GOODWILL. I HAD TO PAY AROUND $500 TO GET IT FIXED. IF THIS WAS  A KNOWN DESIGN FLAW IT HAS TO BE FIXED BY TOYOTA. MY CAR HARDLY HAS 58,000 MILES ON IT AND I HAD DONE EVERY BIT OF MAINTENANCE DEFINED IN THE COROLLA MANUAL.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/22/2007",
        "dateOfIncident": "05/22/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191443,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 TOYOTA SEQUOIA IN NOVEMBER 2002.  WHEN THE VEHICLE WAS PURCHASED THE SALES PERSON TOLD ME THAT THE HEATING/AIR CONDITIONER SYSTEM APPEARED TO BE A POORLY DESIGNED,  BUT I DID NOT THINK THAT A BIG OBSTACLE TO MY PURCHASE.  I  HAD CONTINUAL PROBLEMS TRYING TO REGULATE THE TEMPERATURE IN THE VEHICLE.  IT  WAS EITHER 65 DEGREES AND THE NEXT LEVEL DOWN  WAS  COLD.   I WAS  ALWAYS FLIPPING THE KNOB BACK AND FORTH  TRYING  TO REGULATE THE TEMPERATURE.  THIS WAS  NOT A BIG SAFETY ISSUE UNLESS TAKING MY EYES OFF THE ROAD FOR THESE ADJUSTMENTS CAN BE CONSIDERED HAZARDOUS.  BUT I LIVE IN A SOMEWHAT COLD CLIMATE AND I HAVE HAD TROUBLE KEEPING THE WINDOWS DEFROSTED ON SOME DAYS PARTICULARLY IF THE HUMIDITY WAS  HIGH.  THIS COULD BE  CONSIDERED  A SAFETY ISSUE. I JUST TOOK THE  VEHICLE TO THE TOYOTA SERVICE DEPARTMENT BECAUSE  AIR CONDITIONER LIGHT WAS BLINKING.  LOOKING AT A REPAIR BILL OF AROUND $1,600.00 FOR A NEW COMPRESSOR AND CLUTCH.  OF COURSE, I DO NOT HAVE AN EXTENDED WARRANTY AS THIS  WAS MY  SIXTH TOYOTA ,AND I HAVE NEVER HAD ANY PROBLEMS SUCH AS THIS IS THE PAST.  SINCE I HAVE READ THAT OTHERS HAVE EXPERIENCED THE SAME PROBLEMS I WOULD URGE SOMEONE TO LOOK INTO THE ISSUE BEFORE SOMEONE GOT  KILLED BECAUSE OF INABILITY TO SEE OUT THE FRONT WINDOW.  *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/19/2007",
        "dateOfIncident": "05/11/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191237,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE WEEK AGO I WAS RUNNING ERRANDS WITH  THE TOYOTA SEQUOIA, BUT THE CAR REFUSED TO START ONCE I COMPLETED MY ERRANDS.  EVENTUALLY, THE CAR HAD TO BE TOWED AND THE REPAIR SHOP REPORTED THAT THE GEAR SHIFT BRACKET AND LEVER WERE BROKEN AND THEREFORE PREVENTED THE GEAR FROM PROPERLY GOING INTO PARK.  THE REPAIR SHOP REPORTED SEEING SEVERAL SUCH CASES RECENTLY BUT STATED THAT TOYOTA HAS INFORMED HIM THAT THE PROBLEM RESULTED  FROM IMPROPER HANDLING OF THE GEAR SHIFT.  I HAD  THECAR FOR MORE THAN 5 YEARS AND HAVE ALWAYS FOLLOWED THE PROPER PROCEDURE.  PERHAPS THIS NEEDED  FURTHER INVESTIGATION.  *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/16/2007",
        "dateOfIncident": "05/13/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190936,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT PASSENGER WINDOW MOTOR  FAILED.*AK",
        "vin": "2T1BR12E82C"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "03/09/2007",
        "dateOfIncident": "03/07/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184589,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FREQUENT USE OF THE DRIVER SIDE SEAT BELT MAY CAUSE THE SEAT BELT TO BECOME TANGLED AND NOT FEED THROUGH THE FEEDER PROPERLY RESULTING IN SERIOUS BODILY HARM AND/OR INABILITY TO USE SEATBELT PROPERLY.  *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/02/2007",
        "dateOfIncident": "01/20/2007",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181435,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1:40 PM, JAN 20, 2007, I WAS DRIVING MY SEQUOIA N/B ON SIERRA HWY IN THE CITY OF SANTA CLARITA. I WAS TRAVELING APPROX 40-45 MPH. I NOTICED A SLIGHT STIFFNESS IN THE STEERING. A SHORT TIME LATER THE LEFT FRONT OF MY VEHICLE VIOLENTLY FELL TO THE GROUND. THERE WERE VEHICLES BEHIND ME AND WITH DIFFICULTY I STEERED TO THE CURB. WHEN THE VEHICLE FELL TO THE GROUND, I HEARD A LOUD 'BANG', AND I FELT THAT I LOST SOME OF MY BRAKES. ONE OF THE DRIVERS BEHIND ME TOLD ME SHE SAW SPARKS COMING FROM UNDER MY VEHICLE. I LOOKED AT THE FRONT OF MY VEHICLE. I SAW THE LEFT FRONT TIRE, WHEEL & HUB (ALL STILL ATTACHED) FOLDED UNDER THE LEFT RUNNING BOARD PREVENTING THE FRONT FENDER AND BUMPER FROM FALLING DIRECTLY TO THE ROADWAY. I SAW THAT THE BRAKE LINES APPEARED TO BE BROKEN. I HAD THE VEHICLE TOWED TO TOYOTA ON MON, JAN 22, 2007. I WAS TOLD THAT IT APPEARED THE LEFT UPPER BALL JOINT HAD BROKEN CAUSING THE WHEEL TO BREAK AWAY FROM THE VEHICLE. THE DEALERSHIP CONTACTED THEIR SERVICE DIRECTOR TO DETERMINE WHAT REPAIRS SHOULD BE MADE. I WAS SUBSEQUENTLY TOLD THAT MY VEHICLE WAS OUT OF WARRANTY AND THAT TOYOTA HAD 'NO LIABILITY' TO REPAIR MY VEHICLE AT THEIR EXPENSE. REPAIR ESTIMATE IS APPROX $5,000. + THE RENTAL VEHICLE THEY ARRANGED. I WAS TOLD A REGIONAL SERVICE INSPECTOR WOULD LOOK AT MY VEHICLE. I TOLD THEM THAT I WANTED THE OLD PARTS IF  REPAIRS WERE TO BE MADE. I AM NOW AFRAID TO DRIVE MY VEHICLE. I WENT TO THE TOYOTA WEB SITE AND NOTICED NUMEROUS RECALL NOTICES FROM TOYOTA FOR FRONT BALL JOINT FAILURES ON MY TYPE OF VEHICLE. I RECEIVED NO RECALL NOTICES FROM TOYOTA. TOYOTA STATED MY VIN WAS NOT ON THE LIST FOR ANY RECALL NOTICES. THE TOYOTA SERVICE DEPT STATED THAT THIS WOULD NOT BE CONSIDERED 'NORMAL WEAR AND TEAR' THAT WOULD REQUIRE ME TO HAVE THIS ITEM CHECKED DURING ALL OF MY REGULAR MAINTENANCE SERVICES.  THIS FAILURE COULD HAVE BEEN MUCH WORSE, CAUSING SERIOUS INJURY TO MYSELF AND OTHERS ON THE ROAD. AS OF THIS DATE I HAVE NOT BEEN NOTIFIED THAT THE REGIONAL INSPECTOR HAS INSPECTED MY VEHICLE. *JB",
        "vin": "5TDZT34A92S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/12/2007",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178569,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * -  IN OCTOBER 2006, THE CONTACT TOOK HER 2002 TOYOTA COROLLA TO A REPAIR SHOP BECAUSE SHE WAS HEARING A NOISE COMING FROM THE ENGINE AREA.  THE VEHICLE HAD AN ODOMETER READING OF 61, 313 MILES.  THE DEALER TOLD THE CONTACT THAT THERE WAS NO OIL ON THE DIP STICK.  THE CONTACT STATED THAT SHE DID NOT SEE AN OIL LEAK AROUND HER VEHICLE.   THE CONTACT WAS ALSO TOLD SHE WOULD NEED A NEW MOTOR FOR THE VEHICLE DUE TO OIL STARVATION, AND THAT THERE WAS A SLUDGE BUILDUP IN THE MOTOR.   THE CONTACT STATED SHE HAD TAKEN THE VEHICLE IN FOR AN OIL CHANGE IN JUNE 2006, AT WHICH POINT THE VEHICLE HAD AN ODOMETER READING OF 56, 860 MILES.   THE CONTACT STATED SHE ALSO TOLD THE DEALER ABOUT A GRINDING NOISE SHE WAS HEARING.  THE DEALER TOLD HER THEY COULD NOT DUPLICATE THE GRINDING NOISE.  THE CONTACT WOULD HEAR THE NOISE WHEN THE VEHICLE REACHED SPEEDS OF 20-50 MPH.  THE CONTACT STATED THERE WERE NO WARNING SIGNS WHEN THE NOISE OCCURRED.  THE WARRANTY DEPT HAS TOLD THE CONTACT THEY WILL NOT COVER THE FAILURE DUE TO VEHICLE NEGLECT.  THE VEHICLE IS AT THE TOYOTA DEALERSHIP.  THE CONTACT HAS ALL OF HER REPAIR ORDERS FOR THE VEHICLE.  *NM",
        "vin": "1NXBR12E6YZ"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/05/2006",
        "dateOfIncident": "01/10/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161436,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT DOES NOT LOCK INTO PLACE. WHEN DRIVING ALONG DRIVER'S SEAT WILL SUDDENLY AND WITHOUT WARNING SLIDE BACKWARDS TO THE FARTHEST POSITION MAKING IT DIFFICULT FOR DRIVER TO REACH THE BREAK AND CLUTCH. A NUMBER OF NEAR ACCIDENTS HAVE OCCURRED WHEN THIS HAPPENS MAKING THE CAR DIFFICULT TO STOP. THE DEALER WAS NOTIFIED, CHECKED THE PROBLEM, AND RECOMMENDED THAT THE SEAT BE REPLACED AT THE OWNERS EXPENSE.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/30/2006",
        "dateOfIncident": "06/19/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161158,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A CAR RECENTLY THAT HAD BEEN IN AN ACCIDENT AND REPAIR (RESTORED / SALVAGE TITLE). FOUND OUT LATER THAT THERE IS NO AIR BAG ON PASSENGER SIDE AND NO AIR BAG SQUIB ON DRIVER'S SIDE AIR BAG IN STEERING WHEEL. ALSO AIR BAG LIGHT BULB IN DASH HAS BEEN TAKEN OUT. SELLER NEVER TOLD ME ABOUT ANY OF THIS. HE WORKS WITH (SELLS VEHICLES FOR) THE BODY SHOP THAT FIXED THE CAR AFTER ACCIDENT.  *NM",
        "vin": "1NXBR12E82Z"
    },
    {
        "components": "SEAT BELTS,STRUCTURE,SEATS",
        "crash": true,
        "dateComplaintFiled": "06/02/2006",
        "dateOfIncident": "08/26/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10158859,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE INVOLVED IN ROLLOVER.  FAILURE OF ROOF STRUCTURE, PASSENGER COMPARTMENT, OCCUPANT RESTRAINT, WINDOWS AND SEAT.",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/22/2006",
        "dateOfIncident": "05/22/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157991,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE THE BRAKE PEDAL WAS DEPRESSED THE FRONT END MADE A GRINDING NOISE.  THIS OCCURRED AT VARIOUS SPEEDS.  THE DEALERSHIP  REPLACED THE BRAKE PADS FIVE TIMES, BUT THE PROBLEM  RECURRED.   THE DEALERSHIP WAS UNABLE TO DETERMINE ATHE CAUSE OF THE PROBLEM.  UPDATED 06/05/2006.  *AK",
        "vin": "2T1BR12E42C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/21/2006",
        "dateOfIncident": "05/18/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157948,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY 2002 TOYOTA COROLLA LE IN FOR AN EMISSIONS TEST AND FAILED.  I WAS TOLD THAT THE REPAIR WOULD COST ABOVE $500 BECAUSE THE CHARCOAL CANISTER ON MY EMISSIONS CONTROL SYSTEM HAD FAILED AND I NEED TO REPLACE IT.  AFTER RESEARCHING THIS PROBLEM ON THE INTERNET AND SPEAKING WITH MY MECHANIC I FOUND THAT THIS WAS A VERY COMMON PROBLEM WITH COROLLAS.  I WAS ALSO TOLD THAT THE REASON FOR THE FAILURE IS THAT THE CANISTER IS SET AT AN ANGLE AND IT ALLOWS ENGINE GASES TO LIQUEFY AND CAUSE FAILURE.  I AM UPSET BECAUSE THIS CAR HAS FEWER THAT 65000 MILE ON IT AND THIS IS A MAJOR PART FAILURE.  PLEASE LOOK INTO THIS FOR ME AND ALL THE OTHER PEOPLE WHO HAVE HAD THIS OBVIOUS VEHICLE DEFECT. THANK YOU.  *NM",
        "vin": "1NXBR12EX2Z"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/03/2006",
        "dateOfIncident": "02/22/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151724,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 30 MPH THE HOOD CAME UNLOCKED AND HIT THE ROOF OF THE VEHICLE.  THE VEHICLE WAS TOWED TO A LOCAL REPAIR SHOP FOR INSPECTION.  THE MECHANIC REPLACED THE HOOD, FRONT AND REAR WINDSHIELD, ROOF AND TRIM, FENDER PANEL AND HINGES.  THE MANUFACTURER WAS ALERTED. IT WAS DETERMINED THE HOOD LATCH WAS WORN AND WAS NOT PROPERLY CATCHING THE STRIKER.  UPDATED 03/29/06. *JB",
        "vin": "2T1BR12EX2C"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/24/2006",
        "dateOfIncident": "01/24/2006",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151134,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE FRONT PASSENGER SEAT BELT RETRACTOR FRACTURED AND BROKE INTERNALLY.  THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR INSPECTION OR REPAIR.",
        "vin": "JT2AE0984R0"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/26/2005",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142096,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WANTS PERMISSION TO DEACTIVATE DRIVER'S AIR BAG ON 2002 TOYOTA COROLLA. ***NO ANSWER REQUIRED*** *TS   *NM",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/27/2005",
        "dateOfIncident": "11/25/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137876,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2002 TOYOTA RUNNER. THE CONSUMER  RECEIVED A RECALL LETTER FOR LOWER BALL JOINT.    THE CONSUMER  STATED  THE WHEELS WERE  CUTTING THE TIRES ON FRONT WHERE LOWER BALL JOINT WAS LOCATED.  THE CONSUMER  CONTACTED TOYOTA, WHO SAID IT IS NOT RELATED TO LOWER BALL JOINT, AND THEY COULD  NOT DO ANYTHING ELSE FOR  THE CONSUMER. THIS HAS BEING HAPPENING SINCE THE CONSUMER  BOUGHT VEHICLE.  IT  HAS 30,000 MILES , AND NEEDED  NEW TIRES.*AK",
        "vin": "JT3GN87R020"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134768,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT WENT OFF DUE TO CHARCOAL CANISTER IN MY 2002 TOYOTA COROLLA.  I HAVE BEEN USING 93 OCTANE CONTENT GAS SINCE THE DAY I PURCHASED THIS CAR.   *NM",
        "vin": "2T1BR12E52C"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/26/2005",
        "dateOfIncident": "07/10/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130146,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURACHASE MY TOYOTA SEQUOIA IN AUGUST 2003 FOR THE FIRST SEVERAL MONTH THE VEHICLE WAS NOT DRIVE THAT MUCH, BECAUSE OF MY WIFE'S ILLNESS.  WITHIN EIGHT MONTHS THE FRONT DOOR HANDLE BROKE, IT WAS UNDERWARRANTY AND I DID NOT THINK MUCH OF IT, IN APRIL OF THIS YEAR 2005, THE REAR PASSENGER SIDE DOOR HANDLE BROKE AND AGAIN I DID NOT THINK  MUCH OF IT.  THREE WEEKS AGO ON SUNDAY ONE OF THE MEMBER FROM THE CHURCH WAS ATTEMPTING TO RETREIVE HIS BAG AND THE HANDLE BROKE.  WHEN I WENT TO THE DEALER SHIP TO ASK ABOUT REPAIR THEY INFORMED ME THAT IT WOULD BE $300.00, AND 200.00 TO FIX THE PASSANGER SIDE. MY COMMENT TO THEM WAS CONCERNING THE REAR DOOR, WHICH I HAD NOT USED THAT MUCH AND OVER THE LAST 6 MONTH MAYBE 3 TIME AT THE MOST PER WEEK, CERTAINLY NOT ALOT.  WHAT WAS AMAZING TO ME WAS THAT THE DOOR HANDLE MECHANISM IS MADE OF PLASTIC AND SO IS THE PASSENGER DOOR HANDLE. MY CONCERN AS A CONSUMER THAT TOYOTA DID NOT DO DUE DILIGENCE TO USE A PLASTIC DOOR HANDLE AND MECHANISM AND GIVEN THAT THINGS BREAK SHOULD NOT HAVE A PRICE TAG OF 300.00 TO REPLACE.  I CONTEND THAT METAL PARTS SHOULD HAVE BEEN USED WITH THE UNDERSTANDING AND CONSIDERATION OF THE USE OF THE HANDLES.  CONSUMERS SHOULD NOT BE AT THE MERCY OF CAR MANUFACTURES TO PUT ANYTHING INTO A CAR THAT WOULD UTIMATELY WOULD PROVE NOT IN THE CONSUMERS BEST INTEREST.  I AM SUGGESTING THAT THERE SHOULD BE A RECALL ON ALL TOYOTA' DOOR HANDLES.  PARTICULARLY THE TRUCK WHICH BY DESIGN ARE SUPPOSE TO ENDURE TOUGH USESAGE.",
        "vin": "5TDZT34AX2S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/19/2005",
        "dateOfIncident": "06/05/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129319,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A TOYOTA SAQUOIA LIMITED 4X4 USED IN 2003.  WHEN I TOOKIT TO A FRIENDS HOUSE HER HUSBAND SIAD I SHOULD GET THAT TICKING NOISE CHECKED OUT.  I TOLD HIM THAT ALL OF THE SUV'S AT THE DEALERSHIP MADE THE TICKING NOISE.  WELL, HE WAS RIGHT.  WHEN I TOOK IT IN TO BE INSPECTED I WAS TOLD THAT I HAD A CRACKED MANIFOLD.  THE MECHANIC SAID THAT ALL OF THE TOYOTA SUV'S AND TRUCKS HAVE PROBLEMS WITH THEIR MANIFOLDS.  IF THIS IS TRUE, WHY HAVE THEY NOT DONE A RECALL TO CORRECT THE PROBLEM?  I MANIFOLD IS NOT A CHEAP PART TO REPLACE.",
        "vin": "5TDBT48A01S"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/26/2005",
        "dateOfIncident": "06/02/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126614,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW WEEKS BACK MY CAR'S CHECK ENGINE LIGHT CAME ONE (THIS WAS WHEN THE MILEAGE WAS AROUND 40,500). SINCE IT WAS OUT OF WARRANTY SO I TOOK IT TO A AAA CERTIFIED REPAIR  SHOP FOR INVESTIGATION. I LATER CAME TO KNOW THAT THE ENGINE LIGHT WAS DUE TO CHARCOAL CANISTER FAILURE. SINCE THE CHARCOAL CANISTER CAN ONLY BE OBTAINED FROM THE DEALER SO I LATER INQUIRED ABOUT THE REPAIR COST. THE TOTAL REPAIR ESTIMATE WAS TOLD TO ME AROUND $480 WHICH PROMPTED ME TO SEARCH THE WEB ABOUT SIMILAR REPAIR ISSUES. I CAME ACROSS SEVERAL SIMILAR COMPLAINTS RELATED TO CHARCOAL CANISTER FOR MANY TOYOTA VEHICLES.    I HAVE ALWAYS TAKEN THE CAR TO THE LOCAL TOYOTA DEALER FOR REGULAR OIL-CHANGES,ETC. I WAS ALARMED THAT SUCH AN IMPORTANT PART OF THE CAR WOULD FAIL JUST A COUPLE THOUSAND MILES AFTER THE WARRANTY EXPIRATION. SO I CALLED THE TOYOTA ASSISTANCE AT 800-331-4331 ON 6/3/2005 (REFERENCE # [XXX]). I WAS TOLD THAT THE DEALER WOULD CONTACT ME SOME TIME WITHIN THE NEXT 3-4 DAYS BUT THAT NEVER HAPPENED. UPON CALLING THE TOYOTA ASSISTANCE CENTER TODAY AGAIN (6/16/05) I CAME TO KNOW THAT THE DEALER HAD NEVER BOTHERED CALLING ME AND HAD INSTEAD JUST LEFT A NOTIFICATION IN THE ELECTRONIC SYSTEM THAT THE REGIONAL CENTER HAD REFUSED TO PROVIDE ANY INFORMATION IN THIS REGARD.     MY OTHER CAR IN THE HOUSEHOLD IS AROUND 70,000 MI AND IT HAD NEVER HAD ANY SUCH PROBLEM. I WOULD APPRECIATE IF THE TOYOTA LOOKS INTO THE CHARCOAL CANISTER FAILURE ISSUES MORE SERIOUSLY AND PROVIDES RELIEF IN THAT REGARD. A PART OF SUCH IMPORTANCE AND COST SHOULD NOT FAIL WITHIN SUCH LOW MILES.     I HAVE CONTACTED THE WISCONSIN DEPARTMENT OF AGRICULTURAL,TRADE AND CONSUMER PROTECTION IN THIS REGARD AS WELL.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1NXBR12E72Z"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "05/18/2005",
        "dateOfIncident": "05/16/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM DEALING WITH UNDERSIZED BRAKE CALIPER AND ASSOCIATED ROTOR AND BRAKE PAD QUALITY PROBLEMS.  THE CARS SHAKES VIOLENTLY QWHEN APPLYING THE BRAKES.  THEY ARE CAUSING THE ROTORS TO OVERHEAT CAUSING THE ROTORS TO WARP AND EXCESS WEAR.  WHILE TOYOTA RECOGNIZED THAT THE CALIPERS ARE TOO SMALL FOR THE 2002 SEQUOIA, THEY WOULD ONLY REPLACE THEM UNDER WARRANTY.  NOT SURE WHY  THEY ARE ONLY TOO SMALL UNDER WARRANTY.  DO THEY GROW AFTER THE  WARRANTY EXPIRES?  THIS IS BAD POLICY.  THE DEALER RECOMMENDED I SPEND THE $2000 TO FIX THE PROBLEM, WHICH TOYOTA SAYS IS NOT A PROBLEM AFTER THE WARRANTY EXPIRES.    WHEN I SPOKE TO THE LOCAL DEALER,BOULDER TOYOTA, HE STATED IT IS NOT A SAFETY ISSUE, ONLY A QUALITY QUESTION.  I SEEM TO GET TWO DIFFERENT STORIES FROM THE  DEALER AND TOYOTA \"CUSTOMER EXPERIENCE\".    I HAVE RESEARCHED A NUMBER OF SITES INCLUDING NHTS AND AUTOBYTEL.  APPARTENTLY I AM NOT UNIQUE AND MANY OTHERS ARE CLAIMING PROBLEMS WITH TOYOTA SEQUOIA BRAKES.  THIS IS NOT THE QUALITY I EXPECTED FROM A TOYOTA.",
        "vin": "5TDBT48A82S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120968,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "STRONG VIBRATIONS FROM FRONT BRAKES",
        "vin": "5TDBT48A82S"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/11/2005",
        "dateOfIncident": "04/25/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10120728,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HAD AN SIDE IMPACT ACCIDENT WHILE DRIVING MY 2002 TOYOTA SEQUOIA.  WAS HIT BY A TRUCK TRAVELING BETWEEN 45-50 MPH.  STRUCK RIGHT IN FRONT OF DRIVERS DOOR.  DRIVERS HEAD WENT THROUGH DRIVERS WINDOW.  VEHICLE WAS EQUIPED WITH SIDE CURTAIN AIRBAGS.  NONE OF THE AIRBAGS DEPLOYED.  VEHICLE WAS DAMAGED ENOUGH TO BE CONSIDERED TOTALED. (ESTIMATE WAS OVER $23,000) TO FIX.  WANT TO KNOW WHAT WENT WRONG?  PAID EXTRA FOR AIRBAGS THAT DIDN'T WORK.  WHO'S RESPONSIBLE?",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/21/2005",
        "dateOfIncident": "04/15/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118218,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TOYOTA 2002 MR2 SPYDER: SEQUENTIAL MANUAL TRANSMISSION (SMT) CREEPING WHILE IN FORWARD OR REVERSE GEAR. THIS HAPPEN TO THE CAR IN DEC OF 2004 BUT WENT AWAY BY ITSELF AFTER A WEEK. I REPORTED TO FREMONT TOYOTA DEALERSHIP IN CA BUT THEY SAID IT WAS NORMAL. AGAIN ON APRIL 15TH 2005, THE SMT CREEPING RECURRED. I BROUGHT THE CAR BACK TO THE SAME DEALERSHIP, THEY REPLACED THE ECU BUT CREEP IS STILL EXIST. AGAIN, THE DEALER PERSISTS THAT THIS IS NORMAL. ACCORDING THE MANUAL BOOK, IT STATES THAT UNLIKE AUTOMATIC TRANSMISSION, SMT DOES NOT CREEP. PLEASE HELP.   *NM",
        "vin": "JTDFR320320"
    },
    {
        "components": "AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/20/2005",
        "dateOfIncident": "04/20/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118179,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS PARKING CAR IN GARAGE AND CAR SURGED OVER PARKING BARRIER BEFORE I COULD APPLY BRAKES.WHEN FOOT FINALLY PRESSED ON BRAKE ENGINE RACED,  AND I REGAINED CONTROL BY SHLIFTING INTO NEUTRAL. AIR BAGS DID NOT DEPLOY. DISTANCE TRAVELED  APPROXIMATELY 5 FEET.*AK",
        "vin": "1NXBR12E32Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/25/2005",
        "dateOfIncident": "03/16/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114728,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CHANGED DESIGN FROM TIMING CHAIN TO BELT 2 MONTHS AFTER RELEASE.  BOLT ATTACHING TIMING CHAIN SPROCKET TO CAM SHAFT OVERTIGHTENED AT FACTORY CAUSING THOUSANDS OF DOLLARS OF DAMAGE TO CAM TIMING CHAIN AND SPROCKET AND SEVERAL OTHER PARTS, AND LEAVING ME STRANDED IN A NATIONAL FOREST 45 MILES FROM NEAREST SERVICES WITH NO CELL PHONE RECEPTION.*AK",
        "vin": "1NXBR12E42Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/24/2005",
        "dateOfIncident": "03/03/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115776,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS GOING ABOUT 45 MPH WHEN ALL OF A SUDDEN THE ENGINE STALLED UNEXPECTEDLY. VEHICLE WAS THEN TOWED TO A REPAIR SHOP, AND RESULTS SHOWED THAT THE TIMING CHAIN BOLT WAS TOO TIGHT, WHICH BENT THE VALVE, AND TOTALLY RUINED OTHER ENGINE PARTS. VEHICLE WAS THEN TOWED TO A DEALER FOR REPAIRS.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/12/2005",
        "dateOfIncident": "06/14/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110393,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SQUEALING NOISE STARTED. THEY COULD NOT FIND THE NOISE.  AS IT GOT LOUDER THEY  \"DRESSED THE BELTS\" AT 35,426 MILES.  THE PROBLEM PERSISTED, AND NOW THE STABILIZER NEEDS TO BE REPLACED.  THE PROBLEM HAS NOT BEEN CORRECTED.  WHEN I ASKED ABOUT THE PART BEING DEFECTIVE, I WAS TOLD THE PARTS ORIGINAL NUMBER HAS CHANGED AND A NEW ONE IS NOW USED.  DOES THIS MEAN THAT THE FIRST ONE WAS DEFECTED AND THEY HAD TO MAKE A NEW ONE TO CORRECT THE PROBLEM?  IT IS NORMAL FOR THE PART TO GIVE BE BAD SO SOON. SINCE THE PROBLEM STARTED EARLIER?  *JB",
        "vin": "1NXBR12E52Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/26/2005",
        "dateOfIncident": "01/26/2005",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107970,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 TOYOTA SEQUOIA LIMITED. THE BRAKES NEEDED REPLACING AT 21000 MILES.THIS IS CONCIDERED  NORMAL , FOR THIS HEAVY CAR. THE DEALER REQUESTED $330.00 TO REPLACE PADS I SHOPPED AROUND GOT THE JOB DONE FOR $250.00. BUT THE BRAKES STARTED VIBRATING WHENEVER I APPLIED THEM. TOOK IT BACK TO REPAIR CENTER THEY RE-DID THE ENTIRE BRAKE JOB WITH DIFFERENT FACTORY PADS (26000 MI) , SAME RESULT. I THEN TOOK IT TO THE DEALER I BOUGHT THE CAR FROM (33000 MI) , THEY CHECKED IT OUT, PROBLEM NOT OCCURING AT THIS TIME. NO REPAIR DONE. I TOOK IT TO THE TIRE CENTER I ALWAYS USE FOR TIRES, THEY REPLACED REAR ROTORS, PROBLEM NOT FIXED. I THEN REPLACED THE FRONT ROTORS & PADS MYSELF. VIBRATION STILL OCCURING. I HAVE SPENT $800.00 TO FIX THE VIBRATION. TALKED TO TOYOTA ABOUT IT THERE IS A SERVICE BULITTEN ABOUT THIS COMPLANT, IT SHOULD BE FIXED FREE OF CHARGE. BUT THE CAR IS AT 41000 MI NOW. THE WARRANTY IS 36000 MILES.TOYOTA REFUSED TO MAKE NECESSARY REPAIRS UNDER WARRANTY, EVEN THOUGH COMPLAINT WAS ORIGINALLY PLACED DURING WARRANTY PERIOD. REPAIR COST APPROX $2000.00 PER SERVICE WRITER. I WILL NEVER DEAL WITH TOYOTA AGAIN! *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/04/2005",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105724,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ONCE YOU COME TO A STOP DURING NORMAL BREAKING, AND TAKE YOUR FOOT OFF THE BREAK PEDAL TO START MOVING FORWARD, THERE IS A ?THUMP? AS IF YOU ARE BEING HIT FROM THE REAR. THIS IS SIMILAR AS BEING REPORTED IN ODI?S 10089480 AND 10092834. DEALER STATES THIS IS NORMAL IN TRUCKS, THAT IT IS THE NATURAL SPACING IN THE DRIVE SHAFT WITH REAR WHEEL DRIVE.THE ONLY WAY FOR THE PROBLEM NOT TO OCCUR, IT TO GLIDE TO A SMOOTH STOP.*AK",
        "vin": "5TDBT44A02S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/21/2004",
        "dateOfIncident": "01/02/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104251,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 TOYOTA SEQUOIA BRAKES VIBRATE SEVERELY. VSC SYSTEM WARNING LIGHT FREQUENTLY COMES ON. PROBLEM HAS EXISTED SINCE CAR HAD 10,000 MILES, NOW HAS 36,000 AND DEALER AND TOYOTA CLAIM IT IS OUT OF WARRANTY. TOYOTA CLAIMS THAT CAR HAS NO BRAKE PROBLEMS, NO SAFETY PROBLEMS AT ALL, AND THAT ORIGINAL BRAKES ARE NOT DEFECTIVE IN DESIGN. I AM INFORMED THAT TOYOTA ISSUED A TECHNICAL SERVICE BULLETIN, ALTHOUGH TOYOTA DENIED THIS THE DEALER ADMITTED THAT IT EXISTED, BUT I HAD TO SPECIFICALLY COMPLAIN ABOUT THE SPECIFIC BRAKE PROBLEM, OR THEY WOULD NOT AND DID NOT ADVISE ME OF THE REMEDY. THESE BRAKE ISSUES ARE A SERIOUS SAFETY PROBLEM.*AK",
        "vin": "5TDZT34A52S"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "01/11/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102950,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PLASTIC DOOR HANDLES ON TOYOTA SEQUOIAS EASILY BREAK OFF, VERY FLIMSY.  THIS COULD LEAD TO SOMEONE GETTING TRAPPED IN THEIR CAR, ESPECIALLY IF YOU ARE INVOLVED IN AN ACCIDENT AND NEED TO OPEN THE DOOR QUICKLY OR AGGRESSIVELY.  MY NEIGHBOR HAPPENS TO HAVE THE SAME VEHICLE EVEN THE SAME COLOR AND I ASKED HIM HOW HE LIKES IT AND HE SAID FANTASTIC, EXCEPT WE HAVE BROKEN OFF 2 DOOR HANDLES. WHEN I TOOK IT TO THE DEALER THE SERVICE WRITER CASUALLY MENTIONED, \"OH, WE GET THESE IN ALL THE TIME\". I CONTACTED THE DEALER AND THE TOYOTA ZONE OFFICE AND THEY WILL NOT PAY FOR THE $175 REPAIR.  THIS IS A SERIOUS SAFTEY HAZARD AND A DEFECTIVE PRODUCT.*AK",
        "vin": "5TDZT34A12S"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/07/2004",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102268,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 TOYOTA SAQUOIA IN THE YEAR OF 2002,IN THE YEAR 2003 MY AIR CONDITIONING SYSTEM WENT OUT IN MY NEW VEHICAL UPON TAKING IT TO THE LOCAL TOYOTA DEALER I WAS TOLD THAT MY COMPLETE AIR CONDITIONING SYSTEM NEEDED TO BE REPLACED,I HAVE WENT A COMPLETE YEAR WITH OUT AN AIR CONDITION SYSTEM MIND YOU I LIVE IN AUGUSTA GEORGIA,THIS CAUSES SEVERAL THINGS TO NOT FUNCTION PROPERLY SUCH AS GAS GAGE NOT PROPERLT WORKING,WHEN YOU DRIVE THE CAR 60 MPH OR OVER THE TRUCK BEGAN TO BURN,THE AIR COMES ON AUTOMATICLLY AND THE TRUCK BEGAN TO JUMP VERY BADLY LIKE THE CAR IS GOING TO BLOW UP,THE HEAT ONLY WORKS WHEN YOU SET IT AT 80 DEGREES OR HIGHER SO YOU CAN ONLY LEAVE IT ON FOR SO LONG THEN YOU MUST TURN IT OFF AND WHEN IT GETS COLD AGAIN YOU HALF TO TURN IT ON AGAIN THIS GOES ON ALL DAY LONG.I CAN'T SEM TO GET ANY ONE FROM TOYOTA TO HELP ME WITH THERE DEFAULT, MY WIFE WON'T EVEN DRIVE THE CAR.SO WHEN I TOOK IT TO A NOTHER DEALER TO SEE IF THIS WAS REALLY THE PROBLEM HE TOLD ME THAT THE SYSTEM WAS REALLY BLOWEN.SIRS I WORK VERY HARD FOR MY MONEY AND I DON'T HAVE A LOT OF IT TO GIVE AWAY,IREALLY DON'T APPRICIATE A PRESTEGIOUS COMPANY SUCH AS TOYOTA TO PRAY ON ON IT'S CONSUMER. WHEN THE VEHICAL WAS CHECKED TO SEE IF THERE WAS A RECALL AT MY REQUEST THERE WAS WHAT YOU CALL A BULLITEN ON THIS PROBLEM,I THEN ASKED IF YOU KNOW THAT THIS PROBLEM ENOUGH WHY ISN'T THERE A RECALL I REALLY DON THINK THAT I THE CONSUMER SHOULD HALF TO FOOT A $2000 BILLL ON SOMETHING THAT WAS NOT MY FAULT I AM VERY SORRY THAT I PICKED A TOYOTA SEQUOIA THIS IS NOT A CHEAP VEHICAL IF YOU CAN HELP ME AND MY FAMILY PLEASE DO SO.THANK YOU IN ADVANCE. *AK",
        "vin": "5TDZT38A02S"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/05/2004",
        "dateOfIncident": "10/05/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10095165,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER APPLIED THE BRAKES AND PEDAL WENT TO THE FLOOR.  CONSUMER WAS UNABLE TO MAINTAIN CONTROL OF THE VEHICLE, AND IT HIT THE GUARD RAIL AND FLIPPED  OVER THREE TIMES.  UPON IMPACT, BOTH FRONTAL AIR BAGS DID NOT DEPLOY.   DRIVER SUSTAINED INJURIES, AND  WAS TRANSPORTED BY AMBULANCE TO A HOSPITAL.  VEHICLE WAS TOWED TO THE DEALER. *AK",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "12/25/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092030,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "A BEAM OF LIGHT COMES FROM THE HEADLIGHTS AND SHOOT UPWARDS, LIKE A SPOT LIGHT . THIS CAUSES A VISIBILITY DISTRACTION TO THE DRIVER, ESPECIALLY WHEN DRIVING  IN FOG OR UNDER OVER HEAD TREES. ALSO, REDUCES THE HEADLIGHTS ILLUMINATION ON THE ROAD.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "08/12/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10088192,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AIRBAG SYSTEMS, INC.",
                "productMake": "AIRBAG",
                "productModel": "SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DEAR SIR/MADAM,  THIS IS TO NOTIFY YOU THAT THURSDAY, 12 AUGUST, MY MOTHER, A FRIEND AND I WERE INVOLVED IN A FATAL ACCIDENT WHILE MY MOTHER WAS DRIVING A TOYOTA COROLLA S 2002. THE ACCIDENT LEFT MY MOTHER IN A DEEP FRIGHT AND WITH  INJURIES ON HER FACE, AS SHE HIT THE STEERING WHEEL. SHE IS PRESCRIBED TO GO TO THERAPY FOR OVER A MONTH TO OVERCOME THE CATASTROPHE. I, NOW, SUFFER FROM MINOR BACK PROBLEMS CAUSED DUE TO THE ACCIDENT.   THE ACCIDENT OCCURRED ON ONE OF THE MOST EVENTFUL HIGHWAYS OF GEORGIA, HIGHWAY US 78. OUR CAR, TRAVELING ON THE MIDDLE LANE, WAS HIT BY AN ISUZU SUV \u0013 RODEO, AND AFTER ROTATING ABOUT 180 DEGREES STOPPED ON THE MIDDLE OF THE HIGHWAY. THE ENTIRE FRONT BUMPER FELL APART, AND THE CAR WAS BEYOND RECOGNITION FROM THE FRONT.   YESTERDAY, WE HEARD FROM THE REPAIR SHOP AND THEIR ASSESSMENT WAS THAT CAR IS TOTALED. MOST SHOCKING PART OF THE EVENT IS THAT THE AIR BAGS DIDN\u0019T ACTIVATE EVEN AFTER SUCH A STRONG IMPACT OF SUV COMING AT AROUND 65 MILES AN HOUR SPEED AND HIT OUR TOYOTA COROLLA (2002) FROM FRONT. WHEREAS, THE AIR-BAGS OF THE RODEO DID NOT FAIL TO INFLATE.         I REPORTED THIS INCIDENT DIRECTLY TO TOYOTA IMMEDIATELY AFTER THE ACCIDENT.  IT HAS BEEN OVER A WEEK NOW AND I HAVE NOT RECIEVED ANY CALLS OR E-MAILS FROM THEIR PART.          I SINCERELY HOPE YOU WILL PLEASE LOOK INTO THE MATTER AND KEEP ME INFORMED.  YOUR COOPERATION IS HIGHLY ANTICIPATED AND APPRECIATED IN ADVANCE.    I LOOK FORWARD TO TO HEAR FROM YOU A.S.A.P.    SINCERELY,   [XXX]  PHONE NUMBER: [XXX]  [XXX].  *AK    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/12/2004",
        "dateOfIncident": "08/12/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087803,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CONSUMER NOTICED THE DRIVER AND PASSENGER'S SIDE REAR VIEW MIRRORS FAILED TO ADJUST PROPERLY DUE TO THE LEVER FOR ADJUSTING WAS NOT MOUNTED ON THE MIRROR.  THIS CAUSED POOR VISIBILITY WHILE DRIVING.  THE CONSUMER WAS ABLE TO DRIVE THE VEHICLE TO THE DEALER FOR INSPECTION.    *JB",
        "vin": "2T1BR12E62C"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/09/2004",
        "dateOfIncident": "06/05/2004",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075039,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DOOR HANDLE ON INSIDE OF DRIVER'S SIDE BROKE.  IMPOSSIBLE TO OPEN DOOR.  UNFORTUNATELY IT HAPPENED WHEN MILEAGE IS AT 38,000 AND PAST WARRANTY BY 2000 MILES.  COST TO REPAIR WAS $117.  TECHNICIAN STATED PROBLEMS WITH CAMRY AND COROLA WITH THAT RESPECT.  THE HANDLE WAS NEVER TREATED ROUGHLY, JUST BROKE ONE DAY.*AK",
        "vin": "4T1BE32K62U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/08/2004",
        "dateOfIncident": "09/07/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10057358,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING BETWEEN 30 TO 35 -MPH THE CONSUMER WAS INVOLVED IN A FRONT END COLLISION.  NEITHER OF THE AIR BAG DEPLOYED NOR DID THE AIR BAG WARNING LIGHT ILLUMINATE PRIOR TO THE CRASH.  THE DRIVER WAS WEARING A SEAT BELT.  CONSUMER WAS IN THE HOSPITAL FOR EIGHTS DAYS. THERE IS A POLICE REPORT. (POR FAVOR ENVIE LAS COPIAS QUE LE ENVIO EL FABRICANTE TOYOTA).  *NM  *MR    *JB",
        "vin": "2T1BR12E42C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/24/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053846,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "INTEGRITY",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "GOODYEAR INTEGRITY, ORIGINAL EQUIPMENT,  P185/65R14. TIRE WAS LUMPY, AND  WEARING UNEVENLY. IT WAS POSSIBLE THAT THE BELTS BROKE FROM WITHIN. *AK  *MR",
        "vin": "1NXBR12E52Z"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070193,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2002 TOYOTA COROLLA AND FOUND THAT MY NASAL PASSAGES BURNED, MY MOUTH HAD A BITTER CHEMICAL TASTE AND I FELT SPACY WHEN I DROVE THE CAR FOR MORE THAN 15 MINUTES.  I DEVELOPED A HEADACHE AND MY LUNGS BURNED IF I WAS IN THE CAR FOR 45 MINUTES OR MORE.  THE LONGER I WAS IN THE CAR THE LONGER IT TOOK TO GET RID OF THIS TOXIC CHEMICAL FEEL IN MY RESPITORY SYSTEM.  THE DEALER WAS WILLING TO TRADE ME OUT OF THIS &#34;TOXIC&#34; CAR INTO A NEW ONE BUT EVEN THOUGH I EAGERLY TRIED A NEW COROLLA, ECHO, AND MATRIX, THE NEW CARS WERE EVEN WORSE.  I HAVE OWNED BRAND NEW TOYOTAS TWICE BEFORE AND HAVE DRIVEN THIS MAKE FOR 20 YEARS.  THE ONE I TRADED WAS PURCHASED IN 1992. MUCH TO MY SHOCK AND DISBELIEF, THE CHEMICAL OFFGASSING INSIDE MODELS AS OLD AS 2000'S HAS MADE IT IMPOSSIBLE FOR ME TO BUY A NEW OR EVEN RELATIVELY NEW TOYOTA.  I HAVE RECENTLY RIDDEN IN A NEW DODGE CARAVAN AND A NEW VOLKSWAGAN, GOLF WITHOUT A PROBLEM.",
        "vin": "1NXBR12E12Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070963,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING REGARDING AN ISSUE WITH MY 2002 TOYOTA COROLLA.  I RECENTLY HAD TO REPLACE AN EMISSIONS CONTROL DEVICE IN MY CAR, A CHARCOAL CANISTER DUE TO IT BEING CLOGGED.  I AM CONCERNED THAT THIS MAY BE A WIDE-SPREAD PROBLEM BECAUSE ON THE DAY THAT I HAD MY CAR REPAIRED, I MET ANOTHER PERSON AT THE TOYOTA SERVICE STATION WITH THE SAME ISSUE AND WHO ALSO HAD A 2002 TOYOTA COROLLA.  HOWEVER, FORTUNATELY FOR HER SHE WAS STILL UNDER WARRANTY SO SHE DID NOT HAVE TO PAY FOR THE REPAIR.  THE WARRANTY FOR THIS PART IS 3 YEARS OR 36,000 MILES. UNFORTUNATELY FOR ME, I WAS AT THE 38,000 MARK ON MILEAGE AND SO I WAS OUT OF WARRANTY.  BEFORE I HAD THE CAR FIXED, I CONTACTED TOYOTA CUSTOMER ASSISTANCE CENTER AT 800-331-4331 (REFERENCE #: 200309021930) AND AFTER A BIT OF BACK AND FORTH, THEY INFORMED ME THAT THEY WOULD GOOD WILL THE PART TO ME SINCE I WAS RIGHT OUT OF WARRANTY, BUT I WOULD HAVE TO PAY FOR THE LABOR.  AS A SIDE TO THIS STORY, TOYOTA NORTH IN MT. KISCO (WHERE I PURCHASED MY CAR) LABOR FEE TO REPLACE THIS PART IS A $90 DIAGNOSTIC FEE PLUS 1.5 HOURS LABOR ADDING TO A TOTAL OF ABOUT $225.  AFTER SHOPPING AROUND, I FOUND THAT TOYOTA CITY IN MAMARONECK (LOCATED WITHIN THE SAME COUNTY AS TOYOTA NORTH) LABOR FEE FOR THE SAME JOB IS $90 TOTAL.  OBVIOUSLY, I OPTED TO GO TO TOYOTA CITY TO HAVE THE PART REPLACED.  MY CONCERN IS HOW MANY CLOGGED CHARCOAL CANISTERS HAD TO BE REPLACED IN THE 2002 MODEL OF A TOYOTA COROLLA.  I DID CONTACT THE U. S. DEPARTMENT OF TRANSPORTATION, NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION AND FILED A REPORT REGARDING THE FAILURE ON THIS PART AND HOPE THAT OTHERS WOULD DO THE SAME.  OVERALL, I DON'T THINK PEOPLE ARE AWARE THAT THEY CAN FILE A REPORT ON THIS TYPE OF VEHICLE PART, AS THEY DO NOT THINK IT IS RELATED TO A SAFETY CONCERN.  I WOULD LIKE TO GET THE MESSAGE OUT TO ALL TOYOTA OWNERS THAT IT IS VERY IMPORTANT TO FILE A REPORT ON ANY AUTO PART THAT FAILS REGARDLESS OF THE FACT THAT IT IS COVERED UNDER THE MANUFACTURER'S WARRANTY.",
        "vin": "2T1BR12E02C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/26/2003",
        "dateOfIncident": "12/23/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051118,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "YOKOHAMA RUBBER CO. LTD.",
                "productMake": "YOKOHAMA",
                "productModel": "ALL SEASON RADIAL",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED TOYOTA MR2 SPYDER IN AUGUST OF 2002.  CAR NOW HAS 18,300 MILES AND BOTH FRONT TIRES (YOKOHAMA ADVAN A043 185/50R15) ARE WORN BEYOND RECOMMENDED TREAD DEPTH AND BLISTERED ON INSIDE(BECAUSE OF FRONT-END MISALIGNMENT ACCORDING TO DEALERSHIP).  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "11/10/2003",
        "dateOfIncident": "11/10/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046704,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE SITTING AT A TRAFFIC LIGHT WITH FOOT ON THE BRAKES VEHICLE SUDDENLY ACCELERATED AND REARENDED ANOTHER VEHICLE.  UPON IMPACT,  AIR BAGS FAILED TO DEPLOY.  CONSUMER HAD  VEHICLE TOWED TO THE DEALER FOR ANALYSIS.   MECHANIC REPLACED BRAKE ROTORS AND OTHER BRAKE PARTS.*AK",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/03/2003",
        "dateOfIncident": "11/02/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045340,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "FR680",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FIRESTONE TIRE SIDEWALL BLOWOUT. TIRE MODEL FR680, SIZE P185/65-R14.  *LA",
        "vin": "1NXBR12EX2Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2003",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043539,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 TOYOTA COROLLA HAD WARPED DISCS AFTER 20,000 MILES OF FREEWAY DRIVING, NO HILLS.  TOYOTA RESURFACED DISCS AND SAID THERE WOULD BE NO FURTHER PROBLEMS.  AR 38,000 MILES THEY WARPED AGAIN NOW TOYOTA SAYS ITS MY PROBLEM.  THIS CAR IS DRIVEN ONLY ON THE HIGHWAY.  I TOOK THE CAR TO AN INDEPENDENT MECHANIC WHO SAID THE BRAKES WERE IN PERFECT CONDITION EXCEPT THE WARPED DISCS AND THOUGHT THAT TOYOTA SHOULD HAVE REPLACED THE DISCS AT 20,000 INSTEAD OF RESURFACING THEM.  *LA",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/21/2003",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038613,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE ENGINE LIGHT ILLUMINATED ON THE DASHBOARD.   *JB    DEALERSHIP WOULDN'T SERVICE VEHICLE WITHOUT ANY APPOINTMENT. WHEN THE CONSUMER TOOK THE VEHICLE FOR SERVICE, SHE WAS INFORMED VEHICLE WAS OUT OF WARRANTY BECAUSE OF THE MILEAGE.  THE DEFECTIVE PART.  THE DEALER \"GOOD WILLED\" THE PART SINCE THE VEHICLE WAS JUST OUTSIDE OF WARRANTY AND THE CONSUMER JUST HAD TO PAY FOR THE LABOR.   *PH  *NLM",
        "vin": "2T1BR12E02C"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032385,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT DID NOT STAY IN PLACE AND THIS HAPPENED ON THE PASSENGER AND DRIVER SIDE.  THE MANUFACTURER WAS CONTACTED AND FIXED THE DRIVERS SEAT BUT THEY DID NOT FIX THE PASSENGER'S SEAT.   *PH   THERE WERE SEAT RELEASE PROBLEMS.  WHEN THE PROBLEM WAS FIRST EXPERIENCED, THE DRIVER'S SEAT MADE NOISE AFTER THE SEAT RELEASED.  (UPON ACCELERATION, STOPPING GOING UP AN INCLINE)  THE NOISE OCCURRED PRIOR TO RELEASE.  THIS CAUSED THE DRIVER TO BE THROWN AWAY FROM THE BRAKE AND GAS PEDAL.   *SCC   *JB",
        "vin": "2T1BR12E72C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/25/2003",
        "dateOfIncident": "08/24/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033414,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A TOYOTA COROLLA 2002. I NOTICED SEVERAL SERVICE BULLETIN ISSUES. WHAT IS THE PROCEDURE IN RESOLVING ON THIS MATTER?*AK",
        "vin": "1NXBR12EX2Z"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/11/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10033533,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHILE TRAVELING AT 25 MPH  DRIVER WAS INVOLVED IN A REAR END COLLISION.  PASSENGER'S SIDE SEAT BELT DID NOT HOLD, BELT CAME OUT FROM OUT OF THE RETRACTOR.   ALSO,  NONE OF THE AIRBAGS DEPLOYED.  AS A RESULT PASSENGER SUFFERED A CHEST CONCUSION/ NECK SPRING AND BACK SPRING BREAKS.   *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029807,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "\"THERE IS AN OFF GASSING  OF CHEMICAL IN VEHICLE THAT IS CAUSING AN IRRITATION TO CONSUMER RESPIRATORY SYSTEM\". *AK",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "05/15/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019448,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED FOR APPROXIMATELY FORTY FIVE MINUTES AND WITHOUT WARNING THE EMERGENCY BRAKE RELEASED AND THE VEHICLE ROLLED BACKWARDS INTO ANOTHER VEHICLE.  (MODEL/MR2 SPYDER) SCC    *JB",
        "vin": "JTDFR320920"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2003",
        "dateOfIncident": "04/08/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017853,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GEAR SHIFT LOCKED UP THREE TIMES.  *AK *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/02/2003",
        "dateOfIncident": "06/17/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016942,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE APPEAR TO BE A DISTRACTING STRAY OF LIGHT WHEN I HAVE MY HEADLIGHTS ON AT NIGHT.  IT IS EVEN WORSE WHEN YOU HAVE THE HIGH BEAMS ON.  IS THERE ANYWAY TOYOTA DEALERSHIP CAN TAKE CARE OF THIS PROBLEM?      *TT",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/25/2003",
        "dateOfIncident": "04/22/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017600,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY, THE VEHICLE WAS ON CRUISE CONTROL.  AFTER EXITING THE HIGHWAY, PRESSURE WAS APPLIED TO THE BRAKE PEDAL AND THE VEHICLE FAILED TO STOP.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP FOR REPAIRS.           *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/13/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006223,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE INSTRUMENT PANEL WAS INOPERATIVE, THE CONSUMER WAS UNABLE TO READ THE VARIOUS FEATURES THAT WERE DISPLAYED ON THE UNIT.  THE BATTERY HAD GONE DEAD, AND THE POWER WINDOWS FAILED.  THE FUEL CONSUMPTION WAS ABNORMAL AND THE AIR HANDLING SYSTEM DID NOT PERMIT OUTSIDE AIR. *SCC  *JB",
        "vin": "JT2BX12U220"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/12/2003",
        "dateOfIncident": "12/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 567810,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DID NOT MOVE OUT OF GEAR, AND IF IT DID MOVE OUT OF GEAR, IT ABRUPTLY DOWN SHIFTED TO SECOND GEAR WHILE DRIVING.*AK 2002 TOYOTA SPYDER) *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/15/2003",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003954,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "GULF TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT NIGHT TIME THE HEAD LIGHT IS NOT WORKING PROPERLY. DEALER HAS INSPECTED THE VEHICLE AND SAID NOTHING IS WRONG WITH THE HEAD LIGHTS. PLEASE PROVIDE FURTHER INFORMATION. TS  *TR",
        "vin": "PROVIDE"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/18/2002",
        "dateOfIncident": "12/16/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001152,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE AT 25MPH THE AUTOMATIC TRANSMISSION BROKE. DEALER REPLACED WITH ONE TRANSMISSION REMANUFACTURE WENT AGAIN AFTER A WEEK. PLEASE PROVIDE FURTHER INFORMATION. TS",
        "vin": "1NSCR12EX2Z"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/09/2002",
        "dateOfIncident": "12/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023927,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER  STATES THAT SUSPENSION IS DEFECTIVE.  VEHICLE PULLS TO THE RIGHT WHILE DRIVING SERIOUSLY AFFECTING ABILITY TO MAINTAIN CONTROL.  CONSUMER HAD SAME PROBLEM WITH A 99 COROLLA WHICH MANUFACTURER HAD TO BUY BACK. TS",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/14/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 769718,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN MERCED TOYOTA APPLIED A CLEAR COAT THEY DAMAGED THE PAINT JOB. THEY REFUSE TO TAKE ANY RESPONSIBILITY. WHEN I FIRST WENT TO LOOK FOR A CAR I ASKED THEM FOR A DEMO AND HAVE SINCE FOUND OUT THAT THE VEHICLE THEY SOLD ME WAS PRE-OWNED BY AT LEAST TWO OTHERS. THE PAINT HAS BEEN DAMAGED ON THE HOOD, TOP, SIDES & TRUNK. THEY HAVE STATED THEY HAVE ALL THEIR IS DOTTED SO THERE IS NOTHING THEY WILL DO. THEY HAVE TRIED TO BLAME ME STATING I FOLLOWED A TRUCK LEAKING ACID OR GRAVEL, OR ACID RAIN, IT HASN'T RAINED PRIOR TO THE DAMAGE.  DROVE OVER ROAD WORK, I WAXED THE CAR, PARKED UNDER A TREE & SAP DID THE DAMAGE. THE CONVERTER EXPLODED, ALL THESE THINGS WERE SAID ON THE SAME DAY TO ME. IF THE DAMAGE WAS THERE WHY DID THEY APPLY THE CLEAR COAT? DURING MY VISIT A MAN CAME IN STATING HE DID THE CLEAR COAT & HE TRIED TO BUFF OUT THE DAMAGE!!IF YOU ARE UNABLE TO HANDLE THIS TYPE OF SITUATION PLEASE FORWARD THIS AND REFER ME TO THE CORRECT PLACES. THANK YOU.  DT",
        "vin": "1NXBR12E12Z"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/03/2002",
        "dateOfIncident": "09/19/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8020146,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RIGHT FRONT TIRE BLEW FOR NO APPARENT REASON.  THE SIDEWALL WAS TORN.  THE DEALER HAS REFUSED TO REPLACE IT BECAUSE THE MANUFACTURER WOULDN'T REFUND THEM.  THE TEAR IS FROM THE INSIDE OUT.   THE SIZE OF THE TIRE IS 205/65R15 92T.  THE TIRES ARE BRIDGESTONE POTENZA RE92.  NLM",
        "vin": "4T1BE32K2U0"
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "10/02/2002",
        "dateOfIncident": "09/28/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007439,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED IN AN INCLINED SPOT. PARKING BRAKE ENGAGED. PARKING BRAKE FAILED AND CAR ROLLED OVER A CURB INTO A METAL POLE ABOUT 10-15 MINUTES AFTER THE CAR WAS PARKED. *PH (2002 TOYOTA MR2) *JB    **DIMSII IVOQ ENTRY POSTED AFTER 12/12/02 CUT OVER TO ARTEMIS**768022",
        "vin": "JTDFR320120"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/01/2002",
        "dateOfIncident": "09/01/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8019971,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES HEAD RESTS ARE NOT ADJUSTABLE AND ARE CAUSING AILMENTS WHICH AFFECT CONSUMER'S ABILITY TO PROPERLY DRIVE VEHICLE.  CONSUMER IS EXPERIENCING MUSCLE SPASMS, TENDENITIS, CARPAL TUNNEL'S SYNDROME AND SLIGHT SPINE CURVATURE.  NLMCONSUMER IS ASKING FOR A REDESIGNED HEAD REST TO HELP AID IN THE NATURAL RESTING OF THE NECK AND SPINE CURVATURE.  *JG",
        "vin": "1NXBR12E52Z"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/26/2002",
        "dateOfIncident": "08/22/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 766205,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "NOT SURE OF SPEED ON IMPACT. DRIVER WAS BRAKING FROM 50MPH.",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/12/2002",
        "dateOfIncident": "01/07/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 765551,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "GAP BETWEEN FRONT DRIVERSIDE DOOR AND REAR DRIVERSIDE DOOR UNEVEN. *AK",
        "vin": "1NXBR12E62Z"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/07/2002",
        "dateOfIncident": "07/29/2002",
        "fire": true,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8015780,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 04/29/02 CONSUMER DISCOVERED THAT VEHICLE WAS LEAKING FUEL.  VEHICLE WAS REPAIRED BY DEALER WHO ADVISED CONSUMER THAT THE FUEL LINES HAD COME LOOSE.  ON 29-JUL-2002 WHILE DRIVING,  ENGINE COMPARTMENT CAUGHT ON FIRE AS A RESULT OF FUEL LEAKING.*AK",
        "vin": "1NXBR12E12Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/11/2002",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8013722,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS CANNOT BE ADJUSTED, ONE BEAM GOES UP IN THE AIR AT 70-80 DEGREES, THE OTHER GOES STRAIGHT AHEAD.*AK",
        "vin": "ADD"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/10/2002",
        "dateOfIncident": "05/18/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 764028,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THIRTEEN YEAR OLD DAUGHTER SUSTAINED SEVERE TRAUMATIC BRAIN INJURYAFTER HEADON COLLISION. HER AIRBAG DEPLOYED, TOP OF PASSENGER SIDE AIRBAG WAS COMPLETLY BLOWN APART FROM ONE SIDE TO THE OTHER. ALLOWING HER HEAD TO STRIKE DASH. WE BOTH HAD SEATBELTS ON. I SUSTAINED BRUISING OF HIPS & RT. RIB. SHE WAS IN COMA AND JUST NOW BEGINNING TO MOVE LEFT SIDE. SHE STILL CANNOT SIT UP,STAND, WALK, TALK COHERANTLY, EAT OR DO ANYTHING FOR HER SELF. SHE IS STILL IN HOSPITAL AS OF THIS DAY 7-10-02.*AK",
        "vin": "2T1BR12E12C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD A STRONG SULFUR SMELL, CONSUMER STATES THAT THE VEHICLES GAS MILEAGE IS DETERIORATING.   *YH",
        "vin": "2T1BR18EX2C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAD A WEAK CLIMATE CONTROL, PARTICULARLY LUKEWARM HEAT. *YH",
        "vin": "2T1BR18EX2C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WIPER BLADE WAS OF POOR QUALITY. *YH",
        "vin": "2T1BR18EX2C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATED THAT ON ONE OCCASION THE VEHICLE WAS UNABLE TO SHIFT OUT OF PARK. *YH",
        "vin": "2T1BR18EX2C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 566176,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THE GAS TANK LID WORKS ERRATICALLY.   *YH",
        "vin": "2T1BR18EX2C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/12/2002",
        "dateOfIncident": "11/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 763012,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "TOYOTA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR PULLS TO THE RIGHT, TOOK IN CAR TODAY AND TOLD THEM TO ADJUST ALIGNMENT AND HAVE OIL CHANGED, THE SERVICE DEPARTMENT CALLED BACK AND SAID THEIR WAS A MANUFACTURE RECALL AND THE CAR HAD TO STAY OVERNIGHT. IF IT HAD A RECALL NO NOTICE WAS SENT OUT THIS IS WHAT I'M UPSET ABOUT. CONSUMERS ARE SOPOSED TO BE NOTIFIED IF THERE IS A RECALL NOT FIND OUT AFTER THEY DAMAGE OTHER COMPONENTS AND FIND OUT WHEN THEY TAKE THEIR CAR IN FOR OIL CHANGES.*AK",
        "vin": "2T1CE22P52C"
    },
    {
        "components": "WHEELS",
        "crash": true,
        "dateComplaintFiled": "05/13/2002",
        "dateOfIncident": "05/08/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8009693,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 65MPH THE LEFT REAR TIRE FELL OFF,  VEHICLE LOST CONTROL, RESULTING IN A COLLISION.  *AK  CONSUMER WAS INJURED IN ACCIDENT.   *SLC",
        "vin": "2PIBR12E32C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/02/2002",
        "dateOfIncident": "11/10/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 564858,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG FAILED TO DEPLOY DURING AN ACCIDENT AND THE CONSUMER SUFFERED AN INJURY. THE VEHICLE WAS A TOTAL LOSS. *YH",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/28/2002",
        "dateOfIncident": "02/11/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 759955,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 2/11/2002; 2002 TOYOTA COROLLA SPORT WAS INVOLVED IN A HEAD-ON COLLISION.  DRIVER HAD MINOR INJURIES; DRIVER AND PASSENGER AIRBAGS WERE NOT DEPLOYED.  TOTAL SPEED OF BOTH VEHICLES WERE APPOXIMATELY 40-50 MPH.  DALY CITY POLICE DEPARTMENT WAS DISPATCHED TO ACCIDENT SCENE.  POLICE REPORT #02-1479..  NLM",
        "vin": "1NXBR12E22Z"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/21/2002",
        "dateOfIncident": "01/09/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 759646,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED CAR ON 9-4-2001, NO SMELL AT ALL. FUEL PUMP GOES BAD AND IS REPLACED AFTER 20 DAYS OWNING CAR AT 300 MILES. AFTER PUMP REPLACEMENT I NOTICED VERY BAD ROTTEN EGG SMELL. TOOK IT TO DEALER FOR DIAGNOSTICS AND SAID NOTHING WRONG WITH CAR, BUT IT COULD BE THE FUEL. IT WAS ADVISED TO USE 5 DIFFERENT FUELS. FILL TANK 3 TIMES USING EACH FUEL UNTIL THE CAR BURNS THE GAS THAT DOES NOT SMELL. THEY ALL SMELL AND PEOPLE AS MYSELF ARE GETTING SICK RIDING IN THE CAR. THE SMALL HAPPENS AT LEAST TWICE A DAY WITH NO SET TIME. SOME ORDERS ARE LIGHT IN SMELL THEN A STRONG SMELL THAT WILL FORCE YOU OUT OF THE CAR. I HAVE ASKED MANY OWNERS OF THE SAME TYPE OF CAR WHO GET GAS AT THE SAME STATION I DO IF THERE CAR SMELLS AND EVERYONE SAID NO. I HAVE CONTACTED THE DEALER AND A DISTRICT TECH FROM NEW YORK, AND THEY HAVE TOLD ME THAT THEY WILL NOT LOOK AT THE CAR ANYMORE AND WE HAVE TO GO TO ARBITRATION. THERE PHONE NO. IS 310- 618 4000. SOMETHING DOES NOT ADD UP. ONLY ONE VISIT, THE CAR STILL STINKS, I FEEL SICK DRIVING IT , NO SECOND VISIT TO DEALER, FIELD TECH BRUSHING ME OFF , AND GO TO ARBITRATION AFTER ONE DEALER VISIT. I WANT THIS INVESTIGATED BY YOUR DEPARTMENT , AND I THINK IT ALSO MY BE TIME FOR LAW ENFORCEMENT  ALSO .*AK",
        "vin": "2T1BR12E42C"
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "03/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564783,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE INSTALLING THE EVENFLO COZY CARRY CHILD SEAT(MODEL # 272126P1) EQUIPPED WITH THE SWITCHABLE RETRACTOR, THE PLASTIC BENT UPWARD BREAKING AT THE SEAT BELT TAB CLOSEST TO THE DOOR, THE SEAT WAS BEING INSTALLED WITH THE LAP AND SHOULDER BELTS UNDER BOTH TABS OF THE SEAT BELT PATH.   *TT",
        "vin": ""
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "03/21/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 564783,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE INSTALLING THE EVENFLO COZY CARRY CHILD SEAT(MODEL # 272126P1) EQUIPPED WITH THE SWITCHABLE RETRACTOR, THE PLASTIC BENT UPWARD BREAKING AT THE SEAT BELT TAB CLOSEST TO THE DOOR, THE SEAT WAS BEING INSTALLED WITH THE LAP AND SHOULDER BELTS UNDER BOTH TABS OF THE SEAT BELT PATH.   *TT",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/22/2002",
        "dateOfIncident": "02/22/2002",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8004431,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AIR BAG LIGHT WILL COME ON.   CONTACTED DEALER.  PLEASE PROVIDE MORE INFORMATION.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/14/2002",
        "dateOfIncident": "11/10/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 8002159,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 55 MPH VEHICLE HIT A DITCH THEN A TREE, AND AIRBAGS DID NOT DEPLOY. CONTACTED DEALER.*AK",
        "vin": "1NXBR12E02Z"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/20/2001",
        "dateOfIncident": "09/15/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 755860,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH HEADLIGHTS HAVE STRAY BEAMS ON HIGH BEAM THAT PROJECT UPWARD AT A 45 DEGREE ANGLE.  VERY DISTRACTING WHEN DRIVING IN LIGHT MIST CONDITIONS.  DEALER HAS ATTEMPTED TO ADJUST HEADLIGHTS WITH NO EFFECT ON CONDITION.*AK",
        "vin": "2T1BR12EX2C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/12/2001",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8000614,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 75 MPH ON CRUISE CONTROL AND WITHOUT ANY INDICATION GAS PEDAL TRAVELED TO FLOORBOARD, CAUSING VEHICLE TO ACCELERATE TO 100 MPH. CONSUMER PUSHED CLUTCH TO STOP VEHICLE, VEHICLE WAS STILL IDLING HIGH AFTER VEHICLE WAS STOPPED. *AK  THE CONSUMER STATED THAT THE PROBLEM WAS THE ACCELERATOR JAMMED OPEN AND TURNING OFF. ALSO, THE CRUISE CONTROL WOULD NOT RETURN ENGINE TO NORMAL IDLING.  *YH",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/02/2001",
        "dateOfIncident": "09/05/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 754012,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT HEADLIGHT DEMONSTRATES A DISTINCT RAY OF LIGHT EMANATING UP AND OUT APPROX. 70-80 DEGREES PERPENDICULAR TO THE FRONT OF THE VEHICLE ON BOTH HIGH AND LOW BEAM OPERATION.  DEALER ATTEMPTS TO ADJUST HEADLIGHTS HAVE NOT RECTIFIED PROBLEM.  THE PROBLEM IS DISTRACTING FOR THE DRIVER AND MAY AFFECT ONCOMING TRAFFIC.*AK",
        "vin": "2T1BR12E22C"
    },
    {
        "components": "SUSPENSION,TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/12/2001",
        "dateOfIncident": "07/27/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 894718,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WANDERS AND SWAYS BACK AND FORTH.  VEHICLE WAS TAKEN TO DEALERSHIP, AND MECHANIC STATED THAT ALL FOUR WHEELS WERE BENT.  VEHICLE CAME FROM FACTORY THAT WAY.  GOODYEAR, INTEGRITY,  P185/65R14 . RIGHT FRONT TIRE HAD A BULGE ON  OUTSIDE. *AK  NEW VEHICLE WAS OUT OF ALIGNMENT, ALL 4 WHEELS WERE BENT AND WARPED FROM THE FACTORY, THE TIRES WERE OUT OF BALANCE.  GOODYEAR INTEGRITY TIRES ON VEHICLE WERE DEFECTIVE AND WERE REPLACED DUE TO DEFECTIVE BELTS.  VEHICLE HAS A HANDLING PROBLEM.  NLM",
        "vin": "2T1BR12E02C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/17/2001",
        "dateOfIncident": "05/01/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 752271,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS ON THE 2002 COROLLA HAVE BEEN REDESIGNED.  THEY REFLECT A DIRECT BEAM STRAIGHT UP.  THIS IS VERY DISTRACTING  BECAUSE THE BEAMS CROSS OVER THE WIND SHIELD AS THEY POINT UP.  THIS HAPPENS WHEN THE LIGHTS ARE ON HIGH BEAM.  HAVE NO IDEA HOW THIS APPEARS TO DISTANT DRIVERS.  THE ENGINEERS NEED TO REDO THIS DESIGN. *AK",
        "vin": "2T1BR12E12C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/14/2001",
        "dateOfIncident": "07/27/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 894347,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN VEHICLE IS DRIVEN OVER 50 MPH OR MORE IT CAUSES  VEHICLE TO WANDER ACROSS THE ROAD; VEHICLE BEEN INTO DEALER SHOP ON FOUR OCCASIONS, AND PROBLEM STILL REOCCURRING. FEEL FREE TO PROVIDE ANY FURTHER DETAILS ON THIS MATTER.*AK",
        "vin": "2T1BRR12E02"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "07/10/2001",
        "dateOfIncident": "07/09/2001",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 892290,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCORDING TO  OWNERS MANUAL OUTSIDE REAR VIEW MIRRORS HAVE TWO WAYS TO ADJUST THEM BY POWER SWITCH OR MANUALLY.  THIS VEHICLE DOES NOT HAVE EITHER OPTION. CONSUMER STATES IN ORDER TO ADJUST  MIRRORS  CONSUMER MUST USE  HANDS. CONSUMER HAS CONTACTED DEALER. PLEASE PROVIDE ANY FURTHER INFORMATION.*AK",
        "vin": "1NXBR12EX2Z"
    }
]