[
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/23/2017",
        "dateOfIncident": "03/24/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11000923,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ABOUT 45 MILES PER HOUR, THE SIDE CURTAIN AND SEAT BOLSTER AIRBAGS DEPLOYED ON THEIR OWN. THERE WAS NO IMPACT TO THE VEHICLE THAT PRECEDED THIS INCIDENT. THE AIRBAGS SIMPLY DEPLOYED BY THEMSELVES.     THIS SEEMS TO BE A RECURRING PROBLEM WITH THIS GENERATION OF VOLKSWAGENS:   HTTP://WWW.CARCOMPLAINTS.COM/VOLKSWAGEN/GOLF/2002/SEAT_BELTS_AIR_BAGS/AIR_BAGS-SIDE_WINDOW.SHTML",
        "vin": "9BWGP61J324"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/23/2013",
        "dateOfIncident": "07/21/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10526396,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2002 VOLKSWAGEN GOLF WITH A TDI ENGINE. THE CONTACT STATED THAT THE VEHICLE SUDDENLY ACCELERATED. THE CONTACT HAD TO POP THE CLUTCH AND KILL THE IGNITION, BUT THE ENGINE CONTINUE TO OPERATE UNTIL THE VEHICLE RAN OUT OF FUEL. THE CONTACTS MECHANIC INSPECTED THE VEHICLE AND STATED THAT THE TURBO CHARGER SEALS WERE NOT LEAKING.  THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGES WERE 53,000. *TR",
        "vin": "9BWGP61J524"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/14/2011",
        "dateOfIncident": "03/08/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390105,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2002 VOLKSWAGEN GOLF. THE CONTACT STATED THAT THE VEHICLE WOULD NOT START IN RAINY WEATHER. THE VEHICLE WAS TAKEN TO THE DEALER WHO ADVISED THAT THE IGNITION COIL WOULD NEED TO BE REPLACED. THE CONTACT LOCATED A VOLUNTARY MANUFACTURERS RECALL FOR THE FAILURE BUT WAS ADVISED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED IN THE VOLUNTARY RECALL. THE FAILURE MILEAGE AND CURRENT MILEAGES WERE 150,000.",
        "vin": "9BWGK61JX24"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2010",
        "dateOfIncident": "08/07/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348119,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SATURDAY AUG 7TH I WAS DRIVING MY 2002 VW GOLF ON THE HIGHWAY WHEN THE PASSENGER SIDE AIRBAG DEPLOYED.  THE ROAD WAS SMOOTH WITH NO BUMPS OR POTHOLES, NOTHING HIT THE CAR, IT WAS TOTALLY SPONTANEOUS.  LUCKILY THERE WERE NO PASSENGERS IN THE CAR.  I HAVE CONTACTED MY LOCAL VW SERVICE SHOP AND WILL TAKE THE CAR IN SO THEY CAN IDENTIFY THE CAUSE OF THE DEPLOYMENT. *TR",
        "vin": "9BWGK61J924"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/16/2009",
        "dateOfIncident": "06/14/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276939,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE CURTAIN AIRBAG DEPLOYED WHILE TRAVELING DOWN THE HIGHWAY. NO COLLISION, CONSEQUENCES RINGING IN EARS. VOLKSWAGEN MADE REPAIR AT NO COST TO ME $3212.00. *TR",
        "vin": "9BWGP61J724"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "05/18/2009",
        "dateOfIncident": "10/02/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269010,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT CAME ON. WHEN TAKEN IN FOR FIX IT WAS FOUND TO BE A FAULTY SWITCH IN THE DRIVER SIDE SEAT BELT BUCKLE.  IT WAS JUST RECENTLY REPLACED AND SO FAR NO FURTHER PROBLEMS. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/04/2009",
        "dateOfIncident": "04/26/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267719,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY WIFE WAS DRIVING OUR 2002 VW GOLF  THE DRIVER SIDE WINDOW DROPPED.  TURNS OUT ALL OVER THE INTERNET THERE ARE COMPLAINTS OF THE TABS HOLDING THE WINDOWS BREAKING.  IN FACT WHEN I WAS AT THE DEALER I FELLOW OVERHEARD ME AND  SAID HE HAD THE EXACT SAME PROBLEM ON HIS 2001 VW GTI.  VW HAD A TSB AND EXTENDED THE WARRANTY BY A FEW YEARS ON THIS BUT IS SHOULD HAVE BEEN A RECALL.  A WINDOW DROPPING IS A HUGE SAFETY FACTOR FOR A NUMBER OF REASONS. THE WINDOW IS A PROTECTION DEVICE TO SHIELD YOU IN AN ACCIDENT OR FROM DEBRIS AT 65MPH AND FOR YOUR OWN PERSONAL SAFETY IF ON THE WRONG SIDE OF TOWN.    I CALLED THE VW DEALER TO SEE IF THEY WOULD FIX THIS PROBLEM THEY SAID YES THEY WOULD FIX IT FOR FREE YET UPON ARRIVING I WAS TOLD I WAS ONE MONTH OUT OF THE EXTENDED WARRANTY.    THE DROPPING OF THIS WINDOW CAUSED MY WIFE TO HAVE TO PULL OVER ON A BUSY EXPRESSWAY BECAUSE SHE COULD NOT SEE IN THE RAIN WITH IT BLOWING IN HER WINDOW.  ONCE A GAIN A FAULTY WINDOW HOLDING MECHANISM IS A SAFETY ISSUE AND SHOULD BE A RECALL ITEM.  *TR",
        "vin": "9BWGK61J324"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/28/2009",
        "dateOfIncident": "01/23/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10256593,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2002 VOLKSWAGEN GOLF.  WHILE DRIVING 70 MPH ON THE FREEWAY, THE PASSENGER SIDE AIR BAG SPONTANEOUSLY DEPLOYED.  THERE WERE NO INJURIES, BUT THE CONTACT WAS CONCERNED ABOUT THE SUDDEN EXPLOSION.  HE STATED THAT THE DEPLOYMENT OCCURRED WHILE HE WAS USING HIS CELLULAR PHONE.  THE VEHICLE HAS NOT BEEN TAKEN TO THE DEALER AND THE MANUFACTURER WAS NOT NOTIFIED.  THE VIN WAS UNAVAILABLE.  THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 70,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/11/2009",
        "dateOfIncident": "12/18/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254650,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A BRAKE SWITCH SHORT THAT CAUSED THE CAR TO BE STUCK IN PARK. SO IT HAD TO BE DRAGGED OUT AND WAS SENT TO VOLKSWAGEN SERVICE. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "10/12/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245390,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER'S SIDE WINDOW REGULATOR RECENTLY FAILED ON MY 2002 VW GOLF.  THIS PART SECURES THE WINDOW TO THE POWER WINDOW MECHANISM, AND KEEPS THE WINDOW UP.  THE FAILURE OCCURRED WHILE I WAS LEAVING A TOLL BOOTH.  I PRESSED THE BUTTON TO RAISE THE WINDOW, HEARD A CRACK, AND THEN THE ENTIRE WINDOW VIOLENTLY CRASHED DOWN INTO THE INTERIOR OF THE DOOR, AND ATTEMPTS TO RAISE THE WINDOW FAILED.  I WAS LUCKY THAT I WAS ONLY DRIVING ABOUT 20 MPH AT THE TIME, BUT UNFORTUNATELY I HAD TO DRIVE HOME FIVE HOURS WITH THE WINDOWS DOWN.  IT WAS A VERY UNPLEASANT EXPERIENCE.    WHEN I RETURNED HOME, UPON BRINGING THE CAR IN TO THE DEALERSHIP, I LEARNED THAT IT WAS THE WINDOW REGULATOR THAT HAD FAILED.  I ALSO LEARNED THAT THIS PART HAS FAILED NUMEROUS TIMES ON GOLFS OF THIS MODEL YEAR (AND OTHER YEARS), AND THAT AN EXTENDED WARRANTY OF 7 YEARS WAS PLACED ON THE PART.      I STRONGLY BELIEVE THAT A RECALL SHOULD HAVE BEEN PLACED ON THIS PART INSTEAD OF SIMPLY A WARRANTY EXTENSION.  I HAVE HEARD NUMEROUS ANECDOTES OF PEOPLE HAVING THIS SAME PROBLEM.  THE WINDOW CRASHES VIOLENTLY, AND HAD I BEEN DRIVING FAST OR IN TRAFFIC, THIS COULD HAVE CAUSED AN ACCIDENT VERY EASILY.  WHAT'S MORE, ONE CANNOT PROTECT THE CAR FROM THEFT OR WATER DAMAGE WHEN THE WINDOW WON'T CLOSE.      ACCORDING TO VW, A STURDIER REPLACEMENT PART WAS DESIGNED AROUND 2002, AND MY CAR IS NOW BEING FIXED WITH THIS PART.  *TR",
        "vin": "9BWGK61J124"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/11/2008",
        "dateOfIncident": "10/08/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245127,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HIGHWAY ON RAMP  ENGINE REVVED UNCONTROLLABLY UNTIL FAILURE  NEW ENGINE NEEDED. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "09/18/2008",
        "dateOfIncident": "09/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242788,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG LIGHT IS ON IN VEHICLE BECAUSE OF A POOR ELECTRICAL CONNECTION IN THE DRIVER'S SIDE SEAT BELT CLASP, WHICH WAS ALREADY REPLACED ONCE WHILE VEHICLE WAS STILL UNDER FACTORY WARRANTY, ABOUT 2YRS AND 30K MILES AGO. THE LOCKING MECHANISM OF THE SEAT BELT CLASP ITSELF STILL WORKS, HOWEVER, WHILE THE AIR BAG LIGHT IS ON BECAUSE OF THE FAILED ELECTRICAL CONNECTION IN THE CLASP, AIR BAGS WILL NOT DEPLOY, WHICH RISKS MY AND MY PASSENGERS' LIFE AND SAFETY.     TO REPLACE THE PART, I INCURRED A $75 DIAGNOSTIC FEE FROM A LOCAL MECHANIC AND PURCHASED A NEW PART FOR $161, WHICH I WILL INSTALL MYSELF TO SAVE ANOTHER $75 INSTALLATION FEE. TOTAL ECONOMIC LOSS TO ME WAS $236, BUT COULD HAVE BEEN $311 IF I DIDN'T HAVE THE TOOLS AND TIME TO DO IT MYSELF. THE OLD SEAT BELT CLASP WILL BE AVAILABLE FOR INSPECTION. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2008",
        "dateOfIncident": "05/09/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229406,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2002 VW GOLF HAS A DEFECT IN THE IMMOBILIZER THAT DEALERS CAN NOT DIAGNOSE OR REPAIR.  ONCE THE KEY IS TURNED OFF, THE CAR SOMETIMES WILL NOT RESTART.  IT HAS BEEN TOWED TO THE DEALER ON MULTIPLE OCCASIONS - BUT  AFTER A VARIABLE TIME INTERVAL THE CAR STARTS AGAIN.  SINCE IT STARTS - THREE DEALERS HAVE BEEN UNABLE TO DIAGNOSE WHY IT FAILS TO RECOGNIZE THE KEY.  I AM FURIOUS THAT THE IMMOBILIZER CIRCUIT CAN NOT BE REPAIRED OR INACTIVATED.  I LIVE IN THE COUNTRY AND AM AFRAID TO TURN THE CAR OFF IN A REMOTE LOCATION FOR FEAR IT WILL NOT RESTART - AND LEAVE ME STRANDED 20 MILES FROM NOWHERE.  IT COULD STRAND MY WIFE AND INVALID DAUGHTER.  THE CAR COULD NOT BE MOVED IN AN EMERGENCY, LIKE CLEARING THE WAY FOR EMERGENCY VEHICLES, OR GETTING OFF THE SIDE OF THE ROAD IF I PULL OVER AND STOP.  VOLKSWAGEN IS UNRESPONSIVE TO THE PROBLEM - I HAVE SPOKEN TO USA HEADQUARTERS WHO HAS NOT RESPONDED.  THE CAR IS NOT SAFE TO TAKE ON THE ROAD BECAUSE IT CAN UNPREDICTABLY FAIL TO DRIVE.  THIS HAS HAPPENED 8 TIMES IN THE PAST 12 MONTHS, AND HAS BEEN TO SERVICE DEPARTMENT 3 TIMES WITH NO CURE.  *TR",
        "vin": "9BWGP61J524"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/06/2007",
        "dateOfIncident": "10/02/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205139,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 GOLF TDI WITH MANUAL WINDOWS. THE WINDOW REGULATOR CLIPS BROKE AND THE WINDOW DROPPED INTO THE DOOR. THIS IS A KNOWN ISSUE WITH VW'S THAT A SERVICE BULLETIN, (0603), IS OUT ON, BUT ONLY FOR POWER WINDOWS. THE PART THAT OS DEFECTIVE IS COMMON TO BOTH TYPES BUT SINCE MY WINDOWS ARE MANUAL I HAVE TO PAY $191.00 FOR THE PART. IF VW IS REPLACING ONE TYPE FREE OF CHARGE THEY SHOULD BE REPLACING BOTH. THE PART IS DEFECTIVE - MANUAL OR POWER WINDOWS...  *TR",
        "vin": "9BWBP61J524"
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/29/2007",
        "dateOfIncident": "08/11/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201525,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 VOLKSWAGEN GOLF HAS HAD NUMEROUS PROBLEMS.  THE MOST RECENT PROBLEM IS THAT THE COIL SPRING BROKE WHILE THE CONSUMER WAS DRIVING CAUSING DAMAGE TO THE STRUT. NOW THE CONSUMER HAS TO PAY TO GET THE VEHICLE FIXED.  *KB  THE CONSUMER STATED THE PROBLEMS STARTED AFTER THE WARRANTY ENDED. THE BATTERY DIED. 5 DAYS LATER, THE MIL APPEARED AND THE VEHICLE WAS MISFIRING. IN MARCH OF 2007 THE ENGINE LIGHT ILLUMINATED DUE TO A FAULTY COIL.  IN APRIL OF 2007 THE BATTERY LIGHT ILLUMINATED DUE TO A FAILED ALTERNATOR. *JB  THE RIGHT HEADLIGHT WAS INOPERATIVE, THE CATALYTIC CONVERTER WAS REPLACED. UPDATED 12/12/07",
        "vin": "9BWGB61J624"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/16/2007",
        "dateOfIncident": "07/21/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200297,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "2002 VW GOLF WITH CRUISE CONTROL PROBLEM CUSTOMER STATES THAT THE CAR ACCELERATED INTO FIFTH GEAR WHEN SHE TOOK HER FOOT OFF THE BRAKE**CC  THE CONSUMER DETERMINED THAT STEPPING ON THE BRAKE DID NOT DISENGAGE THE CRUISE CONTROL. THE CONSUMER STATED THE FOLLOWING DAY, WHEN HE BACKED HIS VEHICLE UP TO THE GARAGE DOOR, HE NOTICED THE BRAKE LIGHT/ STOP LIGHT DID NOT ILLUMINATED WHEN HE STEPPED ON THE BRAKE. THE CONSUMER BELIEVED THE FAILURE WAS THE ROOT CAUSE FOR THE CRUISE CONTROL'S FAILURE TO DISENGAGE.  THE CONSUMER TOOK THE VEHICLE TO THE DEALER AND UPON INSPECTION IT WAS DETERMINED THAT THE REPLACEMENT BRAKE LIGHT SWITCH THAT HAD BEEN INSTALLED PREVIOUSLY UNDER RECALL WAS DEFECTIVE.  *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/02/2007",
        "dateOfIncident": "02/10/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195108,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "VOLKSWAGEN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2002 IN 2005 WITH 30,000 FROM A CERTIFIED USED VOLKSWAGEN DEALERSHIP. AFTER ONLY DRIVING THE CAR SOME 29,000 MILES THE TRANSMISSION WENT OUT. FORTUNATELY I HAD 11 MILES LEFT UNDER WARRANTY SO THE NEARBY DEALERSHIP HONORED THE WARRANTY AND FIXED MY CAR. HAD IT NOT I WOULD HAVE BEEN OUT $7-9,000.  *TR",
        "vin": "WVWPD63B02P"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/17/2007",
        "dateOfIncident": "05/16/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190977,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE SLOWED DRAMATICALLY AT HIGHWAY SPEED DOWN TO 35 MPH,  I HAD TO USE  THE EMERGENCY BLINKERS TO GET TO THE SLOW LANE, A VERY DANGEROUS SITUATION ON A CONGESTED HIGHWAY.  CLUTCH AND FLYWHEEL REPLACED,  AND THE SAME FAILURE HAPPENED AGAIN WITH OEM PARTS ONLY 3 WEEKS LATER.  *AK",
        "vin": "9BWGP61J124"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/16/2007",
        "dateOfIncident": "05/05/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190900,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "VOLKSWAGEN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC  TRANSMISSION  FAILED TO GO INTO DRIVE AND REVERSE GEARS.  SLOW TO GO INTO GEAR.  CONTACED REPAIR SHOP,  TRANSMISSION WAS  SLIPPING NEEDED NEW ONE.  COVERED UNDER EXTENDED WARRANTY.*AK",
        "vin": "3VWCB21C02M"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/24/2007",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10180639,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT STATED THAT THERE WAS DAMAGE TO THE CEILING ON THE FRONT DRIVERS SIDE AND THE REAR LEFT PASSENGER SIDE. ALSO, THE DRIVER'S SIDE SEAT BELT DID  WORK ANYMORE. *AK",
        "vin": "9BWGK61J324"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "12/24/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177056,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A FAULTY BRAKE SWITCH WHICH CAUSES THE CAR TO BE LOCKED IN PARK.  IT HAD TO BE TOWED TO A DEALER FOR REPAIRS.  OTHER MODELS OF THE 2002 GOLF HAVE A RECALL FOR THE SAME PROBLEM.",
        "vin": "9BWGB61J724"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "12/24/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177065,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  THE CONTACT'S VEHICLE  WOULD NOT GO INTO GEAR. THE CONTACT HAD THE CAR TOWED TO THE DEALER, AND THEY TOLD HIM THAT HE HAD A FAULTY BRAKE SWITCH WHICH KEPT THE CAR IN PARK. THE DEALER TOLD HIM THAT THEIR WAS  A RECALL O FOR THIS  PROBLEM, BUT THIS VEHICLE WAS  NOT INCLUDED DUE TO VIN.  *AK  UPDATED 02/16/07.*JB",
        "vin": "9BWGB61J724"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "12/19/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177163,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS ON MY 2002 VOLKSWAGEN GOLF ALL FAILED TO OPERATE.  VW DEALER (CLASSIC VOLKSWAGEN IN ESCONDIDO, CA) DETERMINED THE PROBLEM WAS A DEFECTIVE BRAKE LIGHT SWITCH.  VW DEALER REPLACED THE BRAKE LIGHT SWITCH.  *JB",
        "vin": "9BWGP61J024"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/14/2006",
        "dateOfIncident": "12/03/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176197,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ROLL PIN THAT RETAINS DIFFERENTIAL SPIDER GEAR PIN BACKED OUT CAUSING LARGER PIN TO CONTACT INSIDE OF CASE. THE FAILURE INCLUDED A LARGE HOLE IN TRANSMISSION/ DIFFERENTIAL CASE, GEAR AND BEARING DAMAGE.  *NM",
        "vin": "9BWGP61J224"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/07/2006",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10175459,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AIR BAGS IN MY '02 VW GOLF DEPLOYED FOR NO REASON WHEN I WENT FROM A STOP TO A START, BARELY GOING OVER 5 MPH.  *NM",
        "vin": "9BWGK61J924"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/30/2006",
        "dateOfIncident": "11/30/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10174758,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL BRAKE LIGHTS INOPERABLE.  BULBS ARE FINE.  THIS WILL LEAD TO AN ACCIDENT WHERE THE CAR IS REAR ENDED.  THERE IS AN EXISTING RECALL, NHTSA CAMPAIGN ID NUMBER : 04V096000   HOWEVER, IT APPLIES TO THE 1999 TO 2002 VW JETTA ONLY.  I DRIVE A GOLF, WHICH IS NOT COVERED BY THE RECALL CAMPAIGN, HOWEVER USES THE SAME PARTS. *JB",
        "vin": "9BWGP61J224"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/27/2006",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174449,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VW GOLF 2002 60K TURN SINGALS KEEP ON CLICKING. POSSIBLE LINK TO USING ARMORALL POLISH?  *JB",
        "vin": "9BWBP61J024"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/16/2006",
        "dateOfIncident": "09/16/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168439,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2002 VW GOLF, THE BRAKE LIGHT SWITCH ON MY CAR HAS BROKEN 4 TIMES IN THE 4 YEARS I HAVE OWNED THIS CAR. THE LAST TIME IT HS HAPPENED MY CAR WOULDN'T SHIFT OUT OF PARK AND I HAD TO GET MY CAR TOWED. EACH TIME THE BRAKE LIGHT SWITCH WAS FOUND TO BE FAULTY AND IT WAS REPLACED. THIS IS A VERY FRUSTRATING PROBLEM AND ITS VERY TIME CONSUMING. I BELIEVE THAT VOLKSWAGEN NEEDS TO DO SOMETHING TO CORRECT THIS PROBLEM.  *JB",
        "vin": "9BWGK61J624"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/30/2006",
        "dateOfIncident": "08/02/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167116,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT PASSENGER SIDE WINDOW COMES OFF TRACK. WINDOW FALLS INTO DOOR AND WINDOW CAN NOT BE CLOSED.  THIS HAPPENED TO ME AS I WAS DRIVING WITH MY 8 WEEK OLD DAUGHTER AND 3 YEAR OLD SON.  IT IS VERY DANGEROUS BECAUSE IT HAPPENED ON HIGHWAY AND THERE WAS ALOT OF WIND COMING INTO CAR ON YOUNG CHILDREN.  THIS HAS HAPPENED TO MANY VW OWNERS, VW HAS EXTENDED WARRANTY TO 7 YEARS DUE TO THIS.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/24/2006",
        "dateOfIncident": "06/09/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166460,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TO WHOM IT MAY CONCERN,  MY WIFE AND I OWN A WHITE, 2002, VOLKSWAGEN GOLF.  MY WIFE HAS HAD THE OIL CHANGED ON THE VEHICLE AT A JIFFY LUBE IN NAPA, CA. SINCE OWNING THE VEHICLE.  RECENTLY SHE NOTICED AN OIL LEAK.  MY WIFE TOOK HER VEHICLE TO A MECHANIC IN CLEARLAKE, CA.  THE MECHANIC FOUND THE OIL FILTER WAS LOOSE AND SUBSEQUENTLY FIXED THE PROBLEM.  THE VEHICLE CONTINUED TO LEAK OIL.  I TOOK THE VEHICLE BACK TO THE MECHANIC IN CLEARLAKE.  UPON RAISING THE VEHICLE, THE MECHANIC LOCATED THE OIL DRAIN PLUG.  THE DRAIN PLUG WAS LOOSE.  THE DRAIN PLUG WAS REMOVED AND DETERMINED TO BE A CHEVY TRUCK DRAIN PLUG.  UPON FURTHER INSPECTION OF THE OIL PAIN, IT WAS DISCOVERED THAT IT HAD BEEN STRIPPED AND COULD NOT BE REPAIRED.  I HAD THE OIL PAN REPLACED AT A COST OF $401.71.  I REPORTED THE INCIDENT TO THE JIFFY LUBE IN NAPA.  BASED ON MY CONVERSATIONS WITH THE OWNER, SENIOR MANAGER AND THE MANAGER, IT IS THEIR CONTENTION THAT THEY ARE NOT AT FAULT FOR THE DAMAGE ON MY VEHICLE.  THEY EXPLAINED TO ME THAT VOLKSWAGEN HAS THE HIGHEST INCIDENT OF PAN STRIPPING COMPARED TO OTHER MANUFACTURES.  IT IS THEIR OPINION THAT THE NEW OIL PAN WILL ALSO STRIP.  JIFFY LUBE HAS AGREED TO PAY ME THE ABOVE MENTIONED COST OF REPAIRING MY VEHICLE.  AS PART OF THE REPAYMENT, THEY HAVE REQUIRED ME TO WRITE TO NTSA AND THE FEDERAL TRADE COMMISSION TO RECEIVED MY FUNDS.  PLEASE USE THIS LETTER AS PART OF ANY ON GOING INVESTIGATIONS AS TO THE FAILURE OF VOLKSWAGEN OIL PANS.    THANK YOU FOR YOUR ASSISTANCE. *JB",
        "vin": "9BWGK61J524"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/10/2006",
        "dateOfIncident": "07/09/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161948,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE LIGHT SWITCH ON THE GOLF IS THE SAME BRAKE LIGHT SWITCH ON THE JETTA. THEY HAVE THE SAME PART NUMBER AND EVERYTHING. THEY ALSO FAIL AT THE SAME RATE, BUT ONLY THE JETTA BRAKE LIGHT SWITCH WAS RECALLED.  WHEN IT FAILS, YOU CANNOT GET THE CAR OUT OF PARK AND YOUR BRAKE LIGHTS WORK INTERMITTENTLY, WHICH IS A SAFETY HAZARD.  *JB",
        "vin": "9BWGB61J324"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2006",
        "dateOfIncident": "01/31/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161157,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD AN OIL CHANGE DONE ON MY CAR AND THE DRAIN PLUG STRIPED OUT THE THREADS. THE OIL PAN IS MADE OF ALUMINUM AND THE PLUG IS MADE OF STEEL.  *NM",
        "vin": "9BWGP61J624"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/24/2006",
        "dateOfIncident": "06/16/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10160645,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING DOWN THE PARKS HIGHWAY NEAR TALKEETNA, ALASKA IN MY 2002 VW GOLF AND HAD THE SIDE-CURTAIN AND PASSENGER SEAT AIRBAGS DEPLOY SUDDENLY FOR NO APPARENT REASON. 5 PERSONS WERE IN THE CAR, ALL EXPERIENCED A LOUD BANG AND A CAR FULL OF ACRID SMOKE, TWO WERE STRUCK AS THE BAG DEPLOYED. I STOPPED AT THE SIDE OF THE ROAD TO CHECK OUT THE PASSENGERS AND FIND OUT WHAT HAPPENED. NO DAMAGE WAS DONE TO THE VEHICLE TO CAUSE AIRBAG DEPLOYMENT, AND IT WAS IN NO WAY IMPACTED OR SUBJECTED TO EXTREME DRIVING FORCES. I BELIEVE MY CAR TO BE DEFECTIVE AND AM SEEKING PAYMENT FROM VOLKSWAGEN. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/30/2006",
        "dateOfIncident": "05/25/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10158622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "SPONTANEOUS AIR BAG DEPLOYMENT ON RIGHT SIDE OF MY 2 DOOR 2002 VW GOLF TDI WHILE DRIVING ON A SMOOTH BLACKTOP ROAD. WHILE DRIVING AT APPROXIMATELY 30 MPH, THE LEFT SIDE CURTAIN AND SEAT AIR BAGS DEPLOYED BY THEM SELVES. THE VEHICLE DID NOT HIT A BUMP OR POTHOLE OR ANYTHING ELSE IN THE ROAD. THE VEHICLE WAS NOT HIT BY ANYTHING. THE VEHICLE WAS NOT INVOLVED IN AN ACCIDENT PRIOR TO OR DURING THE AIR BAG DEPLOYMENT. MY WIFE WAS IN THE PASSENGER SEAT AND WAS HIT BY THE DEPLOYED AIR BAG. SHE HAD A RED SORE ON HER RIGHT ARM AND HAD HEARING PROBLEMS IN HER RIGHT EAR FOR ONE DAY. HER HEARING RETURNED TOO NORMAL THE NEXT DAY AND ALL SORENESS IN HER RIGHT ARM WAS GONE WITHIN TWO DAYS.  *NM",
        "vin": "9BWBP61J224"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2006",
        "dateOfIncident": "05/22/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158000,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO,  MY WIFE HAS A VOLKSWAGEN GOLF.  HER VOLKSWAGEN IS HAVING CERTAIN PROBLEMS WITH THE ELECTRICAL SYSTEM.  THE SUNROOF IS OPERATING WHEN THE CAR IS ON OR OFF BY ITSELF.  RAIN IS SOME HOW GETTING INTO THE CAR AND INTO THE OVERHEAD LIGHT.  HER TAIL LIGHTS HAVE A MIND OF THERE OWN.  SO DAYS THE TAILS WILL WORK AND OTHERS THEY WON'T.  I HAVE PHYSICALLY CHECKED THE BULBS AND HAVE PUT NEW ONES IN AND STILL THEY DO NOT WORK.  HER RADIO WILL NOT WORK.  AND HER TRANSMISSION HAS BEEN LOOKED AT SEVERAL OF TIMES AND STILL CONTINUES TO HAVE THE SAME PROBLEM.  IS THERE ANYWAY YOU CAN CHECK THESE PROBLEMS? *JB",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/20/2006",
        "dateOfIncident": "02/18/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150674,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAS A TILT/TELESCOPE STEERING COLUMN, AFTER ADJUSTING THE COLUMN THE TURN SIGNALS QUIT WORKING.  COULD NOT RESTART THE CAR AFTER TURNING IT OFF BECAUSE IMMOBILIZER WOULD NOT RECOGNIZE THE KEY.  MULTIPLE FUSES WERE BLOWN OUT, INCLUDING THE ONE FOR THE HAZARD FLASHER.  UPON INVESTIGATION THE FAILURE WAS FROM THE WIRING HARNESS FOR THE STEERING COLUMN, THE INSULATION ON MOST OF THE WIRES WAS CRACKED AND THE TURN SIGNAL WIRES SHORTED OUT.  THE  INSULATION FOR THE MAIN POWER WIRES RUNNING INTO THE IGNITION SWITCH ALSO WERE CRACKED, IF THESE SHORTED OUT IT COULD HAVE CAUSED A FIRE.  MOST OF THE INSULATION IN THIS AREA HAS HARDENED AND IS NOT VERY FLEXIBLE, MAKING IT PRONE TO CRACKING.  TEMPORARY REPAIR HAS BEEN TAPING UP ALL THE EXPOSED WIRES WITH ELECTRICAL TAPE.  HAVE NOT YET CHECKED INTO THE AVAILABILITY OF A REPLACEMENT WIRING HARNESS. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/12/2006",
        "dateOfIncident": "10/15/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147645,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "VOLKSWAGEN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL LIGHT CAME ON REPEATEDLY DUE TO OIL SLUDGE PROBLEM, WHICH IS A KNOWN DEFECT.  VW DID NOT COVER, DUE TO EXPIRED WARRANTY.  *JB",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "12/14/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10145249,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BURNING SMELL OCCURRED ON OFF-HIGHWAY ROAD, TRAVELING AT SPEEDS UNDER 5 MPH. HOT SENSATION ON THIGH PROMPTED QUICK ACTION TO TURN OFF VEHICLE / SEAT HEATER WHILE GETTING OUT OF THE VEHICLE A 1/4\" HOLE WAS FOUND ON THE LEFT SIDE OF THE DRIVERS SEAT. HARNESS WAS DISCONNECTED AND SERVICE WAS SCHEDULED.  *NM",
        "vin": "9BWGB61J424"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/10/2005",
        "dateOfIncident": "10/07/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139215,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "VOLKSWAGEN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE SLUDGE DIAGNOSED ON PASSAT.  *NM",
        "vin": "WVWPD63B42P"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN,VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/30/2005",
        "dateOfIncident": "01/10/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138225,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "SEAT BELTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "1.  TRANSMISSION CONTROL MODULE FAILURE.  CAR WAS NOT ABLE TO START.  WAS TOWED FOR REPAIR.  THIS CHIP HAS BEEN REPLACED TWICE.  2.  CAR BEGAN MAKING SEVERE JERKING MOVEMENTS, RANDOMLY.  USUALLY THESE JUMPS OCCUR WITHIN THE FIRST 10 MINUTES OF DRIVING THE VEHICLE BUT CAN OCCUR LATER.  THE SEVERITY OF THE JERKS IS ALSO VARIABLE.  3.  THE CAR WAS IN THE SHOP FOR OVER A MONTH.  THE PROBLEM WAS NOT CORRECTED.  4.  THE CAR CONSUMES AN UNUSUAL HIGH AMOUNT OF MOTOR OIL (MORE THAN A QUART APPROXIMATELY EVERY 1,000 MILES).  5.  VW WAS RUNNING A OIL CONSUMPTION TEST BUT THEY INSISTED THE CONSUMPTION LEVEL WAS NORMAL FOR THIS TYPE OF ENGINE.  THE PROBLEM STILL EXISTS.  I HAVE BEEN EXPERIENCING NUMEROUS MECHANICAL PROBLEMS WITH THE VEHICLE SOON AFTER PURCHASE IN 2002.  I HAVE ALWAYS TRIED TO NEGOTIATE WITH VW.  I HAVE WRITTEN LETTERS AND THEY HAVE BEEN RELUCTANT TO SOLVE THE PROBLEM IN A SATISFACTORY WAY.  I HAVE READ ABOUT THE LEMON LAW BUT MY TIME ALLOWANCE HAS EXPIRED.  THE CAR IS STILL UNDER WARRANTY UNTIL JANUARY 2006.  IN ADDITION TO THE ENGINE/ TRANSMISSION PROBLEMS, I HAVE HAD PROBLEMS WITH ALL MY WINDOWS ROLLING DOWN AUTOMATICALLY AS I TRY TO CLOSE THEM.  THERE WAS A RECALL ON THIS.  THIS HAS BEEN EXAMINED OVER 5 TIMES.  THE PANELS WERE REPLACED.  THE PROBLEM STILL PERSISTS.      I AM NOT ABLE TO GIVE AN EXACT DATE OF AN INCIDENT BECAUSE THERE ARE MANY.  ALL OF THESE DATES HAVE BEEN DOCUMENTED.    I AM GIVING A DATE OF JANUARY 2002 AS THE INCIDENT DATE (WHEN THE CAR WAS PURCHASED).  I FEEL VW HAS EVADED RESPONSIBILITY IN CORRECTING THE PROBLEMS AND HAS CREATED AN UNSAFE VEHICLE.  THE NUMBER OF FAILURES AND THE INABILITY TO CORRECT THEM IS UNACCEPTABLE.   I FEEL MY PROBLEMS WERE NOT ADDRESSED SERIOUSLY AND WERE DISMISSED WITHOUT CONCERN FOR MY SAFETY AND PUBLIC SAFETY IN GENERAL. *JB",
        "vin": "9BWGK61J624"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/26/2005",
        "dateOfIncident": "08/20/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10134334,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE ROD THAT CONNECTS THE BRAKE PEDAL TO THE BRAKE BOOSTER  BROKE AT THE WELLED.  THIS PROBLEM OCCURRED UNDER NORMAL DRIVING CONDITIONS.  THERE WAS AN ACCIDENT BECAUSE OF THIS ON 8-20/21-205. THE PASSENGER SUSTAINED  FACIAL INJURIES,  AND THE DRIVER SUSTAINED  BRUISES.   THE VEHICLE WAS TOTALED.  *AK  UPDATED 11/4/2005 - WHEN THE BRAKE PEDAL AND BRAKE BOOSTER WERE REMOVED THE  CONSUMER NOTICED THAT THE ROD BETWEEN THE PEDAL AND BOOSTER WAS HOLLOW.  *NM",
        "vin": "9BWDE61J324"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/18/2005",
        "dateOfIncident": "05/15/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121355,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE AIR BAG INADVERTENTLY DEPLOYED WITH NO PROVOCATION.",
        "vin": "9BWGK61J624"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/27/2005",
        "dateOfIncident": "01/02/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118541,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "TURN SIGNAL/HAZARD RELAY ACTIVATES RANDOMLY.  WHILE DRIVING DOWN THE ROAD I CAN HEAR THE TURN SIGNAL RELAY CLICKING  AT A FASTER SPEED, LIKE WHEN YOU HAVE A BURNED OUT TURN SIGNAL BULB. BUT, WHEN YOU GO TO USE THE TURN SIGNAL/HAZARD SIGNAL, THEY STILL FUNCTION AS NORMALY.  I BELIEVE THIS ISSUE IS RELATED TO RECAL 04V584000, YET VOLKSWAGEN OF AMERICA DOES NOT RECOGNIZE MY VEHICLE AS BEING PART OF THIS RECAL. *AK",
        "vin": "9BWGP61J724"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/27/2005",
        "dateOfIncident": "04/27/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120363,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER EXPERIENCED PROBLEMS OBTAINING A VALET KEY FROM THE DEALERSHIP FOR 2002 VOLKSWAGEN GOLF.   *MR   THE CONSUMER WAS COMPLAINING OF THE SERVICE RECEIVED AT WILLIAMSON VOLKSWAGEN OF LINCOLN.   *SC *JB",
        "vin": "9BWGB61J724"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/24/2005",
        "dateOfIncident": "03/13/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114612,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT-MOUNTED SIDE AIRBAGS AND SIDE-CURTAIN AIRBAGS FOR THE PASSENGER SIDE OF MY CAR DEPLOYED WITH NO SIDE-IMPACT CRASH.  I WAS IN A PARKING LOT MAKING A RIGHT TURN WHEN THE ABOVE MENTIONED AIRBAGS DEPLOYED.  LUCKILY, THERE WAS NO ONE IN THE PASSENGER SEAT, SO THERE WERE NO INJURIES AS A RESULT.  I TOOK MY CAR INTO A VW DEALERSHIP AND THEY RAN SOME DIAGNOSTICS ON IT.  THEY CLAIM THAT MY CAR'S COMPUTER REGISTERED A COLLISION AND THAT'S WHY MY AIRBAGS WENT OFF, THOUGH THEY NEVER PROVIDED ME WITH A COPY OF THE RESULTS OF THE DIAGNOSTIC.  I TOLD THEM THERE WAS NO WAY MY CAR WAS INVOLVED IN A COLLISION AT THE TIME THE AIRBAGS DEPLOYED, OR WITHIN THE PAST YEAR BEFORE THEY HAD DEPLOYED, AND THEY SAID THAT I MUST HAVE HIT A POTHOLE OR SOMETHING AND THAT I SHOULD CONTACT MY INSURANCE COMPANY.  MY INSURANCE POLICY DOES NOT COVER THE REPLACEMENT OF AIRBAGS WHEN NO COLLISION WAS INVOLVED, AND THE ADJUSTER FEELS THAT THEY MUST HAVE DEPLOYED AS A RESULT OF FAULTY WIRING.  THIS INCIDENT OCCURRED FAIRLY RECENTLY, AND I REFUSE TO PAY THE $3500 FOR THESE REPAIRS OUT OF POCKET, SO THEY HAVE NOT BEEN REPLACED YET, AND WILL NOT BE REPLACED UNTIL I SPEAK FURTHER WITH VOLKSWAGEN.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/01/2005",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109503,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS LIGHT CAME ON AND A SOUND WAS HEARD.  THE BRAKES SUDDENLY WENT, AND THE CONSUMER HAD TO APPLY THE EMERGENCY  BRAKE TO CONTINUE TO THE DEALER.  THE ABS MODULE WAS REPLACED.*AK",
        "vin": "9BWGB61J224"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/30/2004",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10105561,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "RE THE WRONGFUL DEPLOYMENT OF THE DEFECTIVE PASSENGER SIDE AIRBAG AND  SIDE CURTAIN IN 2002 VW GOLF GTI.  *BF    WHILE DRIVING, THE PASSENGER SIDE CURTAIN AND SEAT AIR BAG INADVERTENTLY DEPLOYED, THE PASSENGER SUFFERED MINOR INJURIES.  *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "09/21/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094309,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  VEHICLE AT A MODERATE SPEED THE AIR BAG ON PASSENGER'S SIDE  DEPLOYED INADVERTENTLY.  THE CONSUMER TOOK VEHICLE BACK TO THE DEALER, AND WAS TOLD BY THE SERVICE TECHNICIAN THAT THE VEHICLE WAS IN AN ACCIDENT.  THE CONSUMER CLAIMED THIS WAS  ABSURD SINCE THIS VEHICLE MADE NO CONTACT WITH ANY OTHER VEHICLE OR OBJECT.   *AK   THE AIR BAG DEPLOYED 1 MINUTE LATER.   *SC",
        "vin": "9BWGP61J424"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/17/2004",
        "dateOfIncident": "10/04/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095911,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A RATHER BUMPY STREET (NO MAJOR POT HOLES), SIDE-AIRBAG AND CURTAINS ON THE DRIVER SIDE POPPED OUT. IT WAS NOT A COLLISION, AND THE BUMPER DID NOT HIT ANYTHING.   SERVICE SHOP AT DEALER FOUND A COUPLE OF DAMAGES ON OIL PAN AND CONTROL-ARM, AND THEREFORE INSISTED THE AIRBAG DEPLOYMENT WAS NOT DUE TO A MAL-FUNCTION. THE CAR IS BEING REPAIRED (INCLUDING THE RE-UPHOLSTERY AND DAMAGED SEAT BELT DUE TO THE AIRBAG ERUPTION). IT IS TREATED AS AN ACCIDENT BY MY AUTO INSURANCE.",
        "vin": "9BWBK61J124"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "09/08/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091365,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY AND HIT SMALL BUMP IN ROAD, SUCH THAT YOU WOULD HIT MANY TIMES A DAY WHILE DRIVING, AND PASSENGER SIDE AIRBAGS AND WINDOW CURTAINS DEPLOYED. VW SERVICE FOUND CRASH DATA IN COMPUTER EVENTHOUGH THERE WAS ABSOLUTELY NO VISUAL DAMAGE TO CAR. VW CUSTOMER SERVICE REFUSED TO PAY FOR REPAIR AND SUGGESTED I CONTACT MY INSURANCE COMPANY.*AK",
        "vin": "9BWGP61J724"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2004",
        "dateOfIncident": "06/14/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082456,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OWNER WAS DRIVING IN TRAFFIC - MERGING ONTO THE LONG ISLAND EXPRESSWAY - WHEN A DULL \"POP\" SOUND WAS HEARD.  THE ENGINE QUICKLY LOST POWER.  OWNER WAS ABLE TO STEER VEHICLE FROM RIGHT LANE TO SHOULDER AND ENGAGE HAZARD LIGHTS.  CAR WAS TOWED TO DEALER.  DEALER EXAMINED VEHICLE AND ADVISED OWNER THAT THE TIMING BELT WAS MISSING.  DEALER ADVISED THAT ENGINE HAD SEIZED AND MUST BE REPLACED.  OWNER LOST USE OF CAR FOR 5 WEEKS.  ENGINE AND TIMING BELT WERE REPLACED.   *JB",
        "vin": "9BWGP61JX24"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/22/2004",
        "dateOfIncident": "10/12/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10082453,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS DRIVEN TO AND PARKED OUTSIDE A STORE 1 MILE FROM HOME. WHEN OWNER RETURNED TO CAR (LESS THAN 10 MINUTES AFTER PARKING), THE CAR WOULD NOT START.  CAR WAS TOWED TO DEALER AND OWNER WAS INFORMED THAT OIL PAN WAS CRACKED & ENGINE HAS SEIZED.  DEALER SAID THAT DAMAGE WAS NOT COVERED BY WARRANTY AND OWNER MUST CONTACT INSURANCE COMPANY TO FILE COLLISION CLAIM.  HOWEVER, NO COLLISION EVER OCCURRED.  OWNER LOST USE OF VEHICLE FOR FIVE WEEKS.  OIL PAN, SHORT BLOCK & TURBO WERE REPLACED.   *JB",
        "vin": "9BWGP61JX24"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/28/2004",
        "dateOfIncident": "04/16/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067978,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING OVER A ROUGH STRETCH OF ROAD THE PASSENGER SIDE SEAT AND WINDOW AIRBAGS DEPLOYED.IT SHOULD BE NOTED THERE WAS NO SIDE COLLISION,IMPACT OR BODY DAMAGE.THE DEALER INSISTS THAT A SIDE IMPACT MUST HAVE OCCURED,AND THAT I WIL BE RESPONSIBLE FOR THE ESTIMATED $3500 IN REPAIRS.I STIL AWAIT WORD AS TO WHETHER MY INSURANCE POLICY COVERS THIS TYPE OF CLAIM.SO FAR I'VE BEN TOLD THEY MAY NOT COVER IT.",
        "vin": "9BWGK61J624"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/29/2004",
        "dateOfIncident": "03/24/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10064075,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS REAR-ENDED AT A STOP LIGHT.  CAR CASCADED INTO THE CARS IN FRONT.  AIRBAGS DID NOT DEPLOY ON DRIVERS SIDE.  AIRBAGS (4) DEPLOYED ON PASSENGER SIDE ONLY.  THERE WAS NO PASSENGER.  SEEMS I COULD HAVE USED THE AIRBAG PROTECTION ON MY SIDE. (DRIVER).  *AK",
        "vin": "9BWGP61J824"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/18/2004",
        "dateOfIncident": "12/08/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058443,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ABOUT 10-15 MILES  A HOUR AND MY RIGHT RIM MIGHT HAVE SLIGHTLY HIT THE CURB AND MY PASSENGER SIDE AIRBAG AND CURTAINS DEPLOYED.I TOOK IT RIGHT AWAY TO THE DEALER, AND THEY SAID THERE IS A CRASH CODE AND WILL NOT PAY FOR IT. I CONTACTED VW OF AMERICA MANY TIMES AND THEY SAY TO CLAIM IT THROUGH INSURANCE. THERE IS NO VISIBLE DAMAGE TO MY CAR AT ALL SO I THINK IT A  FAULTY CRASH CODE! *AK",
        "vin": "9BWGK61J324"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2004",
        "dateOfIncident": "01/02/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057793,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 10 MPH LEFT RIM  HIT THE CURB.  AS A RESULT, THE SIDE CURTAINS AND SEAT AIRBAGS DEPLOYED.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/20/2003",
        "dateOfIncident": "11/19/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047223,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "DIESEL FUEL LEAK- WHEN FILLING TANK TO FULL, FUEL POURS OUT SOMEWHERE AT THE TOP OF THE TANK.  *LA",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/21/2003",
        "dateOfIncident": "06/06/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043313,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITOURING",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SIDEWALLS OF MY DAUGHTER'S VOLKSWAGEN SEPARATED. THE TIRES WERE CONTINENTAL CONTITOURING CONTRACT, 19565R15-91H CH95.  *LA",
        "vin": "9BWGB61J024"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/20/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044511,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTAKE MANIFOLD IS CLOGGED ON VEHICLE DUE TO CARBON BUILD UP FROM THE EXHAUST VALVE.*MR    CONSUMER WAS ADVISED BY LOCAL DEALER THAT THE VEHICLE WOULDN'T PASS FEDERAL EMISSION REQUIREMENTS. THE DEALERSHIP REFUSED TO REPAIR UNDER WARRANTY AND WAS WILLING TO CHARGE  $380.00 FOR THE TASK. CONSUMER DECLINED DUE TO THE HIGH PRICE BUT WAS CONCERNED ABOUT THE ENVIRONMENT. CONSUMER RESEARCHED THE PROBLEM ONLINE AND FOUND OTHER CONSUMERS WITH THE SAME DEFECT.   *PH",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "07/20/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031011,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT AND AUTOMATIC TRANSMISSION SAFETY INTERLOCK SWITCH FAILED AND LEFT THE CAR STRANDED.    *PH",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/18/2003",
        "dateOfIncident": "03/25/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026474,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "MULTIPLE PROBLEMS INCLUDED:  MALFUNCTION INDICATOR LAMP ON, VEHICLE CUT OFF, TRUNK SWITCH FELL OUT,  DRIVER DOOR LOCK INOPERATIVE, FUEL GAUGE INOPERATIVE, ENGINE RATTLE.  MULTIPLE REPLACEMENTS - CAMSHAFT SENSOR, TRUNK SWITCH, POWER DOOR LOCKS, FUEL LINES INSTALLED, FUEL SENDER UNIT, TIMING BELT AND TENSIONER.    *TT   *JB",
        "vin": "9BWGB61J224"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "03/14/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020835,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "SEAT BELTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "THE VEHICLE HAD A DAMAGED MOTOR.  *TT  *SCC   *JB",
        "vin": "9BWGB61J224"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "08/25/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018393,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTANT KNOCKING SOUND COMING FROM THE PASSENGER SIDE FRONT END OF VEHICLE.         *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "03/04/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018392,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSTANT NOISE FROM THE STEERING COLUMN. AIR BAG SPRING CHANGED TWICE. STEERING COLUMN STILL MAKING NOISE.      *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/18/2003",
        "dateOfIncident": "05/23/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016150,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE WARNING SYSTEM WILL ACTIVATE FOR NO KNOW REASON AT RANDOM TIMES WHILE DRIVING THE CAR.  *NLM",
        "vin": "9BWGP61J124"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/09/2003",
        "dateOfIncident": "03/05/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10014188,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE AIR BAGS DEPLOYED DESPITE VEHICLE BEING IN COLLISION OR IMPACT.  VEHICLE WAS ON FREEWAY WHEN ALL OF A SUDDEN AIR BAGS DEPLOYED.  DEALER CLAIMS SENSOR INDICATES IMPACT, BUT THERE WAS NO IMPACT. *JB",
        "vin": "9BWBK61J054"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/01/2003",
        "dateOfIncident": "11/07/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10012216,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COIL PACK WAS DAMAGED.  *MR  THE COIL PACK WAS REPLACED.  THEN THE COIL PACK IN THE CYLINDER FAILED.  THE CONSUMER REQUESTED FOR VW TO COMPENSATE HER FOR LOST TIME.  THE ENGINE LIGHT HAD COME ON DUE TO THE EVAPORATIVE EMISSION SYSTEM EXPERIENCED AN INCORRECT PURGE FLOW.  THE WINDSHIELD WASHER RESERVOIR LEAKED COOLANT.  THE EXPANSION TANK WAS REPLACED.  SCC   *JB",
        "vin": "9BWDE61J924"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/24/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009868,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "VOLKSWAGEN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A WIDESPREAD SAFETY ISSUE OF THE PASSAT AND AUDI.  THE VOLKSWAGEN  DEALER MANUFACTURER ADMITTED THAT ALL 4 IGNITION COILS IN THESE VEHICLE'S WERE SUSCEPTIBLE TO FAILURE AND ARE LIKELY TO FAIL UNLESS THE PART IS REPLACED WITH NON DEFECTIVE COILS.  DESPITE THIS ADMISSION, NEITHER VOLKSWAGEN OR THE CONSUMER'S DEALER WILL TAKE THE STEPS TO REMEDY, UNLESS FAILURE OCCURS.  AT WHICH TIME, ONLY THE FAILED COIL WILL BE REPLACED, LEAVING THE VEHICLE SUSCEPTIBLE TO FAILURE THREE OR MORE TIMES.   SCC   *JB",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/24/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009215,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "VOLKSWAGEN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VOLKSWAGEN WEEKENDER VAN 2002. THE REAR LAP BELTS FAILED TO LATCH.*JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/10/2003",
        "dateOfIncident": "02/10/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005632,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PAN CRACKING/ENGINE SEIZING- BECAUSE THE OIL PAN IS MADE OF ALUMINUM WITHOUT ANY SORT OF SKID PLATE PROTECTING IT, THE COLD TEMPERATURES OF WINTER MAKE IT BRITTLE AND IF ANY SORT OF NATURAL OCCURING HAZARD, SUCH AS ICE OR ROCKS, OR MAN MADE HAZARD, SUCH AS ROAD DEBRIS HITS THIS OIL PAN THE CHANCE OF ENGINE FAILURE/SEIZING IS GREATLY INCREASED.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/29/2003",
        "dateOfIncident": "11/15/2202",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005917,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE JERKS HEAVILY AND THE ENGINE LIGHT WOULD COME ON AND REMAIN ON. DEALER HAS BEEN NOTIFIED.   PH",
        "vin": "FULL FILL"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/25/2003",
        "dateOfIncident": "01/21/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10003372,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE AND SIDE CURTAIN  AIRBAGS DEPLOYED WHILE DRIVING DOWN THE HIGHWAY FOR NO REASON",
        "vin": "9BWGP61J224"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/21/2003",
        "dateOfIncident": "06/02/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10004216,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY VEHICLE WILL LOSE ALL POWER WITHOUT WARNING WHEN DRIVING.  DEALERSHIP INDICATED  THAT IT IS A RESULT OF A PROBLEM WITH IGNITION COIL.TS.*AK",
        "vin": "WVWSB61J62W"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/10/2003",
        "dateOfIncident": "01/02/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10002487,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED WHEN THE VEHICLE HIT A BUMP IN THE ROAD, THE SIDE AIR BAG INADVERTENLY DEPLOYED.*JB",
        "vin": "PLEASE PROV"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/02/2003",
        "dateOfIncident": "12/28/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10001870,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THAT THE FUEL TANK IS PUMPING THREW THE CATALYTIC CONVERTER CAUSING AND DISTRACTION TO THE CONSUMER. DEALER NOTIFIED. TS",
        "vin": "9BWDE61J524"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/11/2002",
        "dateOfIncident": "09/24/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 770721,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SIDE SEAT AND CURTAIN AIR BAGS DEPLOYED DESPITE VEHICLE BEING IN NO INCIDENT OR COLLISION. VEHICLE TOWED TO DEALER AND PROBLEM ADVISED. NEITHER DEALER OR VW PREPARED TO CONSIDER OR DISCUSS POSSIBILITY OF SUCH POSSIBILITY OCCURANING. BOTH DEALER AND VW THE MANUFACTURERS INSIST THAT VEHICLE WAS INVOLVED IN MAJOR IMPACT OF 2G OR ABOVE AND THAT THIS SHOULD BE HANDLED BY INSURANCE COMPANY DESPITE THERE BEING NO EVIDENCE OF IMPACT OR COLLISION.  DESPITE PLEAS TO VW , THEY WOULD NOT INVESTIGATE POSSIBILITY OF AIR BAG DEPLOYMENT WITHOUT IMPACT.  VEHICLE STILL IMMOBILE AND UNREPAIRED AFTER ALMOST 3 MONTHS. VEHICLE SINCE MOVED TO ANOTHER VW DEALER .  DT",
        "vin": "9BWBB61J324"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/17/2002",
        "dateOfIncident": "09/16/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 767296,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I FOUND THAT IS IS A VERY COMMON PROBLEM IN THIS MODEL AFTER TALKING TO MANY PEOPLE WITH SAME PROBLEM.NO SAFETY DEFECT LISTED.  *AK",
        "vin": "9BWPH61J624"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/02/2002",
        "dateOfIncident": "03/02/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758865,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "GOLF",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "1) WHILE DRIVING, DOOR AJAR LIGHT SUDDENLY CAME ON FOR NO REASON.  NO DOORS WERE AJAR.  AFTER PARKING, THE FACTORY INSTALLED ALARM SYSTEM CAME ON SEVERAL TIMES FOR NO APPARENT REASON.  2) THE INSTRUMENT PANEL DEFECT RELATES TO A PERSISTENT BUZZING NOISE FROM THE INSTRUMENT CLUSTER.",
        "vin": "9BWGP61J124"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "02/27/2002",
        "dateOfIncident": "02/16/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 758707,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "VOLKSWAGEN",
                "productYear": "2002",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD JUST GOT MY CAR BACK FROM THE SHOP AROUND 4P.M.  I HAD PARKED MY CAR IN THE DRIVEWAY , WELL ABOUT FIFTEEN MINUTES LATER MY FRIEND WAS LEAVEING AND SHE NOTICED THAT MY CAR WAS DOWN THE STREET IN MY NEIGHBORS YARD AND THAT THE POLICE AND FIRE DEPARTMENT WERE LOOKING FOR WHO OWNED THE CAR. I GO RUNNING OUT AS THE FIRE DEPARTMENT AND POLICE WERE COMMING UP THE STREET AND I TOLD THE THAT IT WAS MY CAR. ANYWAY THE CAR WAS IN GEAR AND THE EMERGENCY BRAKE WAS ON THE POLICE OFFICER TOOK PICTURES OF THE CAR AND TOOK PICTURES OF THE CAR BEING IN GEAR AND THAT THE EMERGENCY BRAKE BEING ON HE ASKED ME TO FILL OUT A REPORT SO I DID. I DO NOT KNOW WHAT I CAN DO ABOUT THIS I FEEL THAT THEY SHOULD REPLACE THE CAR, AND SEND IT BACK TO THE MANUFACTURER. PLEASE CONTACT ME TO LET ME KNOW WHAT I MIGHT BE ABLE TO DO ABOUT THIS SITUATION. THANK YOU STEVE NYE. *AK",
        "vin": "3VWSK69M32M"
    }
]