[
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/09/2006",
        "dateOfIncident": "07/29/2006",
        "fire": false,
        "manufacturer": "WELLCO MANUFACTURING, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165092,
        "products": [
            {
                "manufacturer": "WELLCO MANUFACTURING, INC.",
                "productMake": "WELLCO",
                "productModel": "TRAILER",
                "productYear": "2002",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE PROBLEM OCCURRED ON AN 8X18 ENCLOSED WELLS CARGO MOTORCYCLE TRAILER. I LEFT FREDERICK, MD ON THE MORNING OF 7/29/06 HEADING TO MYRTLE BEACH, SC . WHEN I GOT INTO VA. [APPROX 45 MILES FROM FREDERICK] THE RF TRAILER TIRE BLEW. I PULLED INTO A SHOPPING CENTER PARKING LOT TO CHANGE IT AND NOTICED THAT THE RR TIRE WAS DEVELOPING A BULGE IN THE FIRST TREAD FROM THE OUTSIDE. I CHECKED THE OTHER TIRES AND THEY WERE OK. I REPLACED THESE 2 AND ARRIVED AT MYRTLE BEACH WITH NO FURTHER TIRE PROBLEMS. BECAUSE OF WHAT HAD HAPPENED GOING DOWN ,ON THE WAY BACK HOME ON 8/5/2006 ANY TIME I STOPPED I WOULD INSPECT THE TIRES. WHEN I STOPPED IN WILSON, NC I NOTICED THAT THE LR WAS DEVELOPING THE SAME BULGE IN THE TREAD AS THE OTHER TIRE WHICH DID NOT BLOW. I KEPT AN I ON THE TIRE AND SO DID MY DAUGHTER WHO WAS FOLLOWING BEHIND ME AND MADE IT BACK HOME TO FREDERICK WITHOUT IT BLOWING. THE TIRES ARE ST20575R15 GOODYEAR TRAILER TIRES. THE TIRES HAVE BEEN KEPT PROPERLY INFLATED TO 50 PSI BEFORE ANY USE. THERE IS A VERY SLOW LEAK IN THE LF TIRE BUT THIS IS NOT THE ONE THAT HAS DEVELOPED A PROBLEM YET. THE MOST WEIGHT THIS TRAILER HAS HAD IN IT IS 4 HARLEY'S WEIGHING APPROX 700 - 800 LBS EACH. THIS IS NOT THE FIRST TIME I HAVE HAD PROBLEMS WITH THIS SAME SIZE AND MAKE TIRE. I HAVE ANOTHER TRAILER WHERE THE TIRE BLEW BECAUSE THE BELT SEPERATED AND IT WAS PARKED. *JB",
        "vin": ""
    }
]