[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070361,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "1985",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 23, 2003, I STOPPED AT VILLAGE SEVEN AMOCO, MY USUAL PLACE FOR CHECK UPS FOR MY VEHICLE. THE TEMPERATURE WAS RISING SLOWLY. I WAS TOLD THAT I WAS VERY LUCKY I STOPPED BECAUSE HAD I PROCEEDED FOR ANOTHER FEW MILES THE HEAD GASKET WOULD HAVE BLOWN. THEY INSTALLED A NEW THERMOSTADT, THE FIRST ONE I HAD EVER RECEIVED. THE FOLLOWING WEDNESDAY, MAY 28 WHEN I BACKED OUT OF MY DRIVEPLACE THERE WAS A PUFF OF WHITE SMOKE; FRIGHTENED I ONCE AGAIN WENT TO VILLAGE SEVEN AMOCO TO REPORT WHAT I HAD SEEN. JERRY CASH, SERVICE MANAGER, SAID THEY WILL HAVE TO LET THE CAR COOL OFF BEFORE CHECKING IT OUT. THE CAR SAT FOR ALMOST THREE HOURS BEFORE I WAS TOLD MY HEAD GASKET HAD BLOWN, COST ESTIMATED AT $1600.00; I WAS OFFERED $50.00 FOR MY CAR. REFUSING TO HAVE ANYTHING DONE TO MY VEHICLE I LEFT. THERE WERE NOT ANY SIGNS OF ANY PROBLEMS AS I DROVE HOME. AFTER CAREFUL CONSIDERATION AND OPINIONS I MADE AN APPOINTMENT WITH ANOTHER SERVICE STATION FOR A 'SECOND OPINION.' ON MAY 30TH I WAS TOLD BY CRAIG AT CRAIG'S AUTOMOTIVE REPAIR SERVICE THAT THERE WERE ABSOLUTELY NO PROBLEMS WITH MY CAR, NO PROBLEMS WITH THE HEAD GASKET. I HAVE BEEN IN TOUCH WITH THE BBB OF COLORADO SPRINGS, HAD MY COMPLAINT CONSIDERED AND WAS TOLD IN A FORM LETTER, DATED JUNE 6, 2003, &#34;... YOUR COMPLAINT WAS CONSIDERED A LETTER OF EXPERIENCE RATHER THAN A COMPLAINT DUE TO THE FACT THAT THIS IS A CIVIL ISSUE AND THE BBB IS NOT A LEGAL OR ENFORCEMENT AGENCY. ...&#34;.",
        "vin": "JT2AE82EXF3"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/22/1998",
        "dateOfIncident": "02/02/1998",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 537175,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "1985",
                "type": "Vehicle"
            }
        ],
        "summary": "HARD TO STEERING IN TRAFFIC, ALMOST CAUSING ACCIDENT, DUE TO DEFECT IN THE POWER STEERING GEAR RACK AND PINION",
        "vin": "JT2AE82EXF3"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/16/1996",
        "dateOfIncident": "04/01/1996",
        "fire": false,
        "manufacturer": "Toyota Motor Corporation",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 509949,
        "products": [
            {
                "manufacturer": "Toyota Motor Corporation",
                "productMake": "TOYOTA",
                "productModel": "COROLLA",
                "productYear": "1985",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE VC JOINTS, ALSO ELECTRICAL WIRES BURNED AND CARBURETOR PROBLEMS..   *AK",
        "vin": ""
    }
]