[
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/05/2022",
        "dateOfIncident": "03/05/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11455360,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "Left turn signal works fine.  Right turn signal alternates between flashing left and right.",
        "vin": "Waulc68e23a"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/06/2022",
        "dateOfIncident": "01/01/2022",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11446475,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2003 Audi A4. The contact stated that while driving at an undisclosed speed, a fuel odor was detected. The contact parked the vehicle and noticed there was fuel leaking on the rear driver's side. The vehicle was taken to the dealer and diagnosed that the fuel pump flange and hoses needed to be replaced. The vehicle was not repaired and remained at the dealer. The manufacturer was made aware of the failure and informed the contact that they would cover the part replacement. The failure mileage was 143,839.",
        "vin": "waulc68e43a"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2021",
        "dateOfIncident": "10/04/2021",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11435651,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The coolant light came on after I replaced coil packs and I stopped to look wasn't leaking anywhere. Drove to work and it caught on fire due to overheating I guess not really sure. I was driving a car on fire down a highway and didn't even know it. I stopped to take a left turn into work and smoke stared billowing out and around the entire car. Other drivers couldn't see me or nothing I could have been in an accident. The fire department checked the car out sort of and it's in a mechanics shop now. Trying to figure it out. Oil light was on and that's it. AN then the coolant light would kick on and off. Nothing else after I changed the coil packs. And it was well after I did that.",
        "vin": "WAUAC48H83K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/12/2020",
        "dateOfIncident": "08/03/2020",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11348847,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 3.0 CABRIOLET CONVERTIBLE  STARTED SHIFTING ROUGH AND HESITANT AND SHUT OFF, CRANKED BACK UP WENT INTO LIMP MODE AND ALL THE SHIFTING GEAR LIGHTS CAME ON  R N D 2 , BARELY MADE IT BACK HOME, PUT CODE READER ON CAR HAD A LOT OF CODES ON IT I RESET CODES BUT RND2 LIGHTS STILL ON , POSSIBLE BAD TCM?",
        "vin": "WAUAT48H43K"
    },
    {
        "components": "ELECTRICAL SYSTEM,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/26/2020",
        "dateOfIncident": "06/25/2020",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11331067,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INITIALLY DROVE CAR HOME FROM GROCERY STORE HIT A BUMP AND NOTICED A SPARK COMING FROM FRONT DRIVER'S SIDE OF CAR. PULLED OVER AND CHECKED FOR SPARK EVIDENT ONCE STOPPED THERE WAS NO SIGN OF SPARK OR ANYTHING. GOT CAR HOME AND PARKED ABOUT AN HOUR LATER MY CAR WAS ON FIRE, AFTER PUTTING THE FIRE OUT MY HUSBAND LIFTED THE HOOD AND TRIED TO INVESTIGATE THE ISSUE WHEN HE DISCOVERED THE BATTERY WAS MELTED TO THE HOOD AND IS WHERE THE FIRE INITIALLY CAUGHT. THE LOCATION OF THE BATTERY WE BELIEVE TO BE THE ISSUE AND WANTED TO MAKE SURE TO REPORT IT IMMEDIATELY.  *TR",
        "vin": "WAULC68E03A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/28/2019",
        "dateOfIncident": "05/23/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11210443,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION CONTROL MODULE   TRANSMISSION SLIPS OUT OF DRIVE WHILE DRIVING INTO LIKE NEUTRAL AND WHEN I ACCELERATE THE CAR DOES NOT MOVE AND COMES TO A FULL STOP AND I HAVE TO STOP AND TURN THE CAR ON AND OFF TILL IT WORKS AGAIN",
        "vin": "WAUJC68E63A"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/02/2019",
        "dateOfIncident": "01/28/2019",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11173668,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JANUARY 28, 2019 I WAS DRIVING TO MY MEDICAL APPOINTMENT AT 35 MILES PER HOUR WHEN MY CAR FROZE UP THEN BUCKED AND NOW NO LONGER THE TRANSMISSION WILL NO LONGER ENGAGE. UPON RESEARCH AUDI HAS KNOWN OF THIS TRANSMISSION HAVING SERIOUS FAULTS AND THAT IT WILL BREAK DOWN WITHOUT WARNING. AUDI HAS REFUSED TO DO ANY RECALL ON THESE TRANSMISSIONS, EVEN AFTER A CLASS ACTION THAT WAS SETTLED, AUDI WILL NOT DO ANY RECALL.",
        "vin": "WAUAC48H73K"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2018",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11152653,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE SEEMS TO BE A FUEL PUMP OR OTHER ISSUE ALONG THE FUEL LINE. RECENTLY, THE GAS CAP INDICATOR HAS GONE OFF, AND WON'T TURN OFF. I EVEN TRIED REPLACING THE GAS CAP WITH A NEW ONE. I CHECKED FOR LOOSE PARTS ON TOP OF THE GAS TANK (THROUGH THE TRUNK). NO VISIBLE ISSUES, BUT I DO SMELL GASOLINE ON HUMID DAYS, THERE IS CLEARLY AN ISSUE ALONG THE FUEL LINE. I NOTICED THERE WERE RECALLS BY AUDI FOR DIFFERENT VINS (NOT MINE), THAT HIGHLIGHT ISSUES WITH THE FUEL SYSTEM AND FUEL PUMP - RECALL NUMBER 06V017000 (01/23/2006), AND 07V375000 (08/28/2007) (OTHERS?). I'VE TRIED CALLING AUDI TO SEE IF THEY'D BE WILLING TO INVESTIGATE WHETHER A BROADER NUMBER OF VINS NEED TO BE INCLUDED IN THE RECALL (INCLUDING MINE), AND THEY REFUSED TO COVER COSTS TO LOOK INTO IT.",
        "vin": "WAUJC68E33A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/02/2018",
        "dateOfIncident": "08/30/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11123996,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  CONSTANTLY VARIABLE TRANSMISSION (CVT) OF MY 2003 AUDI A4 CABRIOLET 1.8T WITH JUST  86,000 MILES ON IT IS FAULTY, AND HAS CAUSED MY VEHICLE TO STALL OUT ON FOUR OCCASIONS, TWICE WHILE ATTEMPTING TO COME TO A STOP AT A STOP SIGN AND WHILE PARKING, AND TWICE WHILE OPERATING THE VEHICLE WHILE ACCELERATING AT A SPEED OF 35 AND 60 MPH, ON A  CITY ROAD AND ONCE WHILE ATTEMPTING TO MERGE ONTO THE INTERSTATE. THE VEHICLE MUST BE RESTARTED TO DRIVE, AND HAS JUST BARELY SPUTTERED BACK TO LIFE IN MY FOUR EXPERIENCES SO FAR.     AUDI IS AWARE OF THE PROBLEM, AND HAS SETTLED A CLASS ACTION LAWSUIT IN THE PAST, ALTHOUGH THE SETTLEMENT EXPIRED MORE THAN TWO YEARS AGO LEAVING OWNERS LIKE MYSELF ON THE HOOK FOR COSTLY REPAIRS, AND LEFT WITH AN UNSAFE VEHICLE IN THE MEAN TIME.     AUDI SHOULD RECALL ALL AUDI A4 1.8T CVT TRANSMISSIONS FROM 2003 TO 2006 AND PERMENTANTLY SOLVE THE PROBLEM BEFORE SOMEONE IS SERIOUSLY INJURED.",
        "vin": "WAUAC48HX3K"
    },
    {
        "components": "ELECTRONIC STABILITY CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/19/2018",
        "dateOfIncident": "10/17/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11120920,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAMARA RECALL MY CAR WOULDNT START KEEP GETTING STEER WHEEL HARD TO DRIVE SHIFTS TO GEAR GET STUCK",
        "vin": "WAUJC68E03A"
    },
    {
        "components": "SUSPENSION,ELECTRONIC STABILITY CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/12/2018",
        "dateOfIncident": "01/23/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11111062,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER OR LATE RESPONSE TO THROTTLE. TCS AND ABS  LIGHT LIMININTED AFTER REPLACING SENSOR. VIBERTION IN PASSENGER SIDE AROUND 50 MPH OR BRAKING. REPLACED IGNITION COIL TWICE.",
        "vin": "WAUJC68E73A"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/11/2018",
        "dateOfIncident": "01/10/2018",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062227,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER RETURNING HOME FROM A DRIVE THROUGH FAST FOOD PLACE LAST NIGHT MY DAUGHTER WAS PARKING IN OUR DRIVEWAY, SHE WAS IN REVERSE.  THE CAR (A 2003 AUDI A4 CV  CONVERTIBLE)  BOUNCED AND MADE A SOUND THEN SHE STOPPED.  I SAID TAKE THE KEYS OUT OF THE IGNITION TO HER BLACK SMOKE STARTED TO RISE OUT OF THE TOP OF THE HOOD CRACK IN FRONT OF THE FRONT WINDSHIELD.  I TOLD HER TO GET THE DOG IN OUR BACK SEAT AND HERSELF OUT I ASSUMED IT WAS ON FIRE BECAUSE THE DARK SMOKE.  I GRABBED MY PURSE PIPED THE HOOD AND MY DAUGHTER CALLED 911 AS THE NEIGHBORS  RAN INSIDE THERE HOME FOR A FIRE EXTINGUISHER.  TWO MEN FROM ACROSS THE STREET ATTEMPTED TO PUT IT OUT AS I SPOKE TO THE 911 OPERATOR.  THE FIRE DEPARTMENT ARRIVED AND GOT THE FIRE OUT.  MY CAR IS NOW JUNK.  MY DAUGHTER WAS EMOTIONALLY STRAINED, HYSTERICAL THROUGHOUT THE INCIDENT. IT WAS TRAUMATIC FOR US BOTH.  THE FIREFIGHTERS SAID IT WAS POSSIBLY CAUSED BY ELECTRICAL MALFUNCTIONS.",
        "vin": "WAUAT48H53K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/05/2017",
        "dateOfIncident": "09/02/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11021537,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT AN USED 2003 AUDI A4. I PUT IT IN REVERSE AND IT WOULD NOT ENGAGE. THEN THE DASH WHERE THE GEARS SHOW WHAT GEAR YOU'RE IN STARTED FLASHING. IT SHOWED A P0706 CODE.  THIS HAPPENS SO OFTEN THAT ONE OF THESE TIMES I AM GOING TO CAUSE AN ACCIDENT. THE CAR HAS OVER 100,000 MILES ON IT, BUT HOW CAN IT BE MY FAULT THAT THE OTHER OWNERS DID NOT TAKE IT IN TO GET THIS WELL KNOWN MODULE REPAIR FIXED. WHEN I AM PARKED FLAT I CAN USUALLY GET IT IN REVERSE AFTER 4-5 TIMES OF TRYING. BUT...WHEN I AM ON ANY SLANT IT TAKES AT LEAST 10 TIMES OF TRYING ALMOST TO THE POINT OF GETTING OUT AND PUSHING IT IN REVERSE MYSELF!! ONE OF THESE DAYS I AM GOING TO HIT A CAR BEHIND ME TRYING TO GET OUT OF MY PARKING SPOT!! I KNOW THERE WAS A RECALL AND I'M JUST WONDERING WHY A CURRENT OWNER OF THE CAR THAT OBVIOUSLY IS DOING THIS CAN'T GET IT FIXED AS THERE WAS A RECALL.",
        "vin": "WAUAC48H93K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2017",
        "dateOfIncident": "07/29/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11011499,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI A4 CABRIOLET HAS THE INFAMOUS P0706 CODE, WHICH IS A ERROR CODE INDICATING THE FAILURE OF THE TRANSMISSION CONTROL MODULE. IN MY CASE, MY AUDI SLIPS WHILE REVERSING AND CAUSES A HAZARD WHEN I AM REVERSING, ESPECIALLY WHILE IN A TIGHT OR CLUTTERED SPOT. IT ALSO HAS THE PRND BLINKING DUE TO THE DEFECTIVE TRANSMISSION CONTROL MODULE. MANY OTHER AUDI A4S WITH CVT TRANSMISSIONS HAVE HAD THIS FAILURE, WHICH HAS LED TO A LAWSUIT. I RECEIVED A RECALL LETTER THAT STATED I WOULD BE ABLE TO GET A FREE REPAIR, BUT I WAS REFUSED BECAUSE MY CAR HAD OVER 100000 MILES ON IT, BUT THE PROBLEM OCCURRED LONG BEFORE THAT. I NEED TO GET THIS PROBLEM FIXED. THANK YOU FOR YOUR TIME.",
        "vin": "WAUAT48H13K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2017",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11002646,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STUCK IN LIMP MODE AND CAR WILL JUMP AT CERTAIN SPEEDS",
        "vin": "WAUAT48H03K"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/22/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876025,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE VEHICLE LAST YEAR WHEN IT HAD 78,000 MILES ON IT.  ONLY 4 MONTHS AFTER HAVING PURCHASED THE CAR, I GOT A MESSAGE ON THE TROUBLE LIGHT WARNING SYSTEM THAT I HAD A \"DIPPED LIGHT\".  I HAD TO GOOGLE OTHER AUDI OWNERS TO FIND OUT WHAT A DIPPED LIGHT WAS, AS I NEVER HEARD OF A BURNED OUT HEADLIGHT TERMED AS A \"DIPPED LIGHT\" BEFORE.  I CAN ONLY DRIVE IT DURING THE DAY NOW, AS I HAVE HEARD IN CAR FORUMS THAT FIXING IT CAN BE QUITE A LONG AND EXPENSIVE PROCESS.  I AM AFRAID THAT IT MAY AFFECT MY DRIVING SAFETY EVEN WHEN DRIVING DURING THE DAY, BECAUSE IN FLORIDA WE HAVE A LOT OF STORMY WEATHER DURING THE RAINY SEASON AND THE SKY GETS VERY DARK RIGHT BEFORE THE STORMS COME IN.  I AM ALSO CONCERNED THAT OTHER MOTORISTS CANNOT SEE ME COMING IN BAD WEATHER AND I HAD A NEAR ACCIDENT TODAY, WHEN ANOTHER MOTORIST CAME FLYING OUT OF A PARKING LOT IN FRONT OF ME  AS I WAS DRIVING DOWN THE ROAD, AND I HAD TO SLAM ON MY BRAKES TO AVOID A COLLISION WITH THEIR VEHICLE.",
        "vin": "WAUAC48H43K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/10/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10864155,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A4. THE CONTACT STATED THAT WHILE DRIVING AT LOW SPEEDS AND SWITCHING LANES, ANOTHER VEHICLE DRIVING AT HIGH SPEEDS CRASHED INTO THE REAR OF THE VEHICLE. THE OTHER VEHICLE THEN SPUN AROUND AND CRASHED INTO THE FRONT OF THE VEHICLE IMPACTING THE DRIVERS SIDE AND THE FRONT PASSENGERS SIDE. THE AIR BAGS DID NOT DEPLOY. THE REAR PASSENGERS SEAT BELT RESTRAINED A CHILD PASSENGER TIGHTLY WHO THEN RECEIVED ASH MARKS AND LIGHT ABRASIONS FROM THE IMPACT. THE DRIVERS HEAD HIT THE STEERING WHEEL THAT CAUSE EXTENSIVE HEAD ACHES THAT REQUIRED MEDICAL ATTENTION. THE CHILD PASSENGER AND THE DRIVER WERE TAKEN FOR MEDICAL TESTING. THE VEHICLE WAS TOWED BY THE INSURANCE COMPANY AND THEN TOWED TO THE CONTACTS RESIDENCE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 120,000.",
        "vin": "WAUJC68E13A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/06/2016",
        "dateOfIncident": "03/28/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10863528,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL I HAVE A 2003 AUDI A4 I WAS SIDESWIPED RECENTLY CAUSING SIGNIFICANT AMOUNT OF DRIVER SIDE DAMAGE WHICH ONE OF THE AIRBAGS DEPLOYED I'M SUFFERING FROM THE INJURY",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2015",
        "dateOfIncident": "09/07/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763413,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GASKET LEAKAGE, IN TWO SEPARATE AREAS IN UPPER GASKET, PER MECHANIC.  CAR IS NOW IN REPAIRS.  BASED UPON READING THE ONLINE RECALLS ON THE OFFICIAL NHTSA PAGE, THIS IS PART OF THE RECALL FOR AUDI A4 2000-2006.    UNITED STATES",
        "vin": "WAUAT4H833K"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/19/2015",
        "dateOfIncident": "04/04/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10749707,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A4. WHILE DRIVING AT 40 MPH, THE ACCELERATOR PEDAL BECAME STUCK TO THE FLOORBOARD OF THE VEHICLE. THE CONTACT STATED THAT THE ACCELERATOR PEDAL HAD TO BE LIFTED WITH HER FOOT FOR IT TO GO BACK TO NORMAL POSITION. THE FAILURE RECURRED ON THREE OCCASIONS. WHILE AT A COMPLETE STOP AND ATTEMPTING TO ACCELERATE, THE VEHICLE WOULD JERK. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "WAUJC68E03A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2015",
        "dateOfIncident": "08/05/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10747057,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A4. THE CONTACT STATED THAT WHILE DRIVING AT 35 MPH, VARIOUS ELECTRICAL FUNCTIONS OF THE VEHICLE SHUT OFF AND THE STEERING WHEEL SEIZED. THE ENGINE WARNING LIGHT ILLUMINATED. THE FAILURE OCCURRED ONCE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE TRANSMISSION CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 200,003.",
        "vin": "WAUJC68E03A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746436,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "03 AUDI A4 6 SPEED AUTO CVT TRANSMISSION, THIS VEHICLE HAS KNOWN ISSUES WITH SHIFTING FROM 1ST TO 2ND GEAR TOO SOON. WHILE DRIVING THIS VEHICLE FROM A COMPLETE STOP ON AN ON RAMP ON RT 80 I HIT THE GAS AND IT WOULD SHIFT FROM FIRST TO SECOND AND BACK TO FIRST THEN LURCH FORWARD WHILE ROLLING. WHILE THIS IS GOING ON I AM TRYING TO MERGE ON THE HIGHWAY  WHICH PUT MY CAR INTO THE RIGHT LANE DOING ABOUT 2 MPH WITH TRAFFIC (WHICH WOULD BE A SAFE DISTANCE IF THIS ISSUE DIDN'T HAPPEN) HAVING TO COME TO AN ABRUPT STOP NOT TO HIT MY CAR. THIS IS AN KNOWN ISSUE WITH THESE TRANSMISSIONS AND THERE IS NO RECALL ON THEM SINCE NEW. I HAVE EXPERIENCED THIS ISSUE NUMEROUS TIME AS MANY OTHERS WITH THIS VEHICLE DOES. THERE ARE NUMEROUS FORUMS WITH CONSUMERS COMPLAINING OF THE SAME ISSUE. THIS NEEDS TO BE ADDRESSED BEFORE SOMEONE GETS HURT.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/05/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10746428,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 WITH 6 SPEED CVT TRANSMISSION. THERE IS A KNOWN ISSUE WITH THE TRANSMISSION IN THIS VEHICLE.   WHILE DRIVING THE CAR IT SHIFTS FROM FIRST TO SECOND VERY FAST EVEN IF YOU EASE DOWN ON THE ACCELERATOR, THE CAR LUNGES FORWARD AND JERKS. I HAVE CAME CLOSE ON SEVERAL OCCASIONS TO HITTING THE CAR IN FRONT OF ME . I HAVE READ SEVERAL SITES INCLUDING THE AUDI AND VOLKS WAGON FORUMS AND THERE ARE ALSO MANY COMPLAINTS WITH EXACT SAME ISSUE. THIS IS A SAFETY ISSUE AUDI SHOULD CORRECT.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/24/2014",
        "dateOfIncident": "12/21/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668127,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TOSTORE VEHICLE ACCELERATOR STUCK AND WOULD NOT RETURN BACK TO POSITION. I APPLIED BRAKE VERY HARD TO MAINTAIN CONTROL AND WAS ABLE TO PULL OVER INTO PARKING LOT AND STOP ALTHOUGH ENGINE CONTINUED TO REV LIKE PEDAL WAS PUSHED TO THE FLOOR . I PUTCAR IN PARK AND IT REDLINE THE TACH   WITHOUT MY FOOT ON THE PEDAL ALMOST CAUSING THE ENGINE TO BLOW.VERY DANGEROUS .GLAD I WAS DRIVING INSTEAD OF MY WIFE.L BOUGHT THE CAR 2 MOS. AGO FROM CHECKERED FLAG  VOLKSWAGEN  USED CAR LOT AND THEY DON'T  THINK THIS FALLS UNDER WARRANTY, EVEN SOMETHING THIS DANGEROUS , AND SEEING OTHER COMPLAINTS I'M GUESSING AUDI DOESN'T EITHER . AT LEAST UNTIL THE COST ANALYSIS OF DEATHS VS. REPAIR GETS A LITTLE CLOSER.  *TR",
        "vin": "WAULC68E13A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/11/2014",
        "dateOfIncident": "06/10/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10632848,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STOPPED AT STOP LIGHT IN RUSH HOUR TRAFFIC. LIGHT TURNED GREEN. ATTEMPTED TO ACCELERATE- BUT CAR JUST JERKED AND ROCKED BACK AND FORTH AND THEN ROLLED BACKWARD- ALMOST ROLLING INTO CAR BEHIND ME. HAD TO CALL 911 TO REDIRECT TRAFFIC AND GET A TOW TRUCK. 2ND INCIDENT OCCURRED ON 7/12/14: PICKED CAR UP FROM SERVICE SHOP. DRIVING HOME IN RUSH HOUR TRAFFIC. STALLED AT TRAFFIC LIGHT. RESTARTED CAR AND IT WAS ABLE TO MOVE, BUT WOULDN'T SHIFT. HAD TO MAKE AN ILLEGAL U-TURN TO GET OUT OF TRAFFIC AND WAS ABLE TO PULL OFF THE SIDE OF THE ROAD. 3RD INCIDENT OCCURRED ON 8/12/14: PULLING OUT OF DRIVEWAY AND CAR STOPPED SHIFTING. STALLED IN DRIVEWAY. HAD TO GET TOWED AND WAS FOUND TO HAVE \"NO PROBLEM\" AS CAR WAS OPERATING WHEN ARRIVED AT THE SERVICE SHOP. 9/9/14- DRIVING TO WORK IN RUSH HOUR TRAFFIC. GOING 35MPH UP A HILL AND CAR STOPPED SHIFTING. CAR WAS STILL MOVING (SLOWLY) AND I WAS ABLE TO PULL INTO A RESIDENTIAL DRIVEWAY TO GET OUT OF TRAFFIC. CAR WOULD NOT MOVE AFTER RESTARTING. TOW TRUCK CAME AND TOWED TO SERVICE CENTER. ALL ISSUES RELATED TO FAULTY CVT TRANSMISSION THAT AUDI IS AWARE OF, BUT WILL NOT TAKE RESPONSIBILITY FOR DUE TO THE CAR BEING OVER 10 YEARS OLD (IT WAS 10 YEARS 6 MONTHS AT THE FIRST INCIDENT). I HAVE CONTACTED AUDI USA TO DISCUSS THESE SAFETY CONCERNS WITH THE CAR STALLING IN TRAFFIC AND POSSIBLE RECALLS THAT SHOULD BE ISSUED, BUT THEY HAVE OFFERED NO ASSISTANCE.",
        "vin": "WAUAC48H13K"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/31/2014",
        "dateOfIncident": "05/14/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618038,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2003 AUDI A4. THE CONTACT STATED THAT THE BRAKE LIGHT CONSTANTLY ILLUMINATED AFTER HAVING THE BRAKES REPAIRED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE TECHNICIAN RESET THE COMPUTER BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 95,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "05/05/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605973,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A NEW TRANSMISSION PUT IN THE AUDI AND AFTER A YEAR THE TRANSMISSION REVERSE MODE FAILED.  I TOOK IT TO THE SHOP WHICH REPAIRED THE CAR AND FOUND THAT THERE HAD BEEN A RECALL ON THE PART WHICH WAS NEEDED FOR THE CAR.  WHEN I TOOK IT TO THE AUDI DEALERSHIP THEY REFUSED TO HONOR THE RECALL AND I HAD TO PAY FOR THE NEW PART AN ADDITIONAL $2700.  I WAS TOLD THAT I WAS NOT THE OWNER OF THE CAR AND THEY HAD NO INFORMATION ON FILE ABOUT ME HOWEVER I HAD REPEATEDLY BEEN IN PERSONALLY TO ASK ABOUT THE CAR AND ANY RECALLS AFTER REPLACING THE TRANSMISSION.  ALSO THEY HAD MY EMAIL ADDRESS.  I WAS THEN TOLD I WAS SIX MONTHS TOO LATE AND I HAD TO PAY FOR THE REPAIR.  I TRIED TO CALL AUDI CUSTOMER SERVICE AND THE HEADQUARTERS AND ONLY GOT THE RUN AROUND.  IF THERE WAS A RECALL FOR THIS PART THE AUDI DEALERSHIP AND AUDI HEADQUARTERS SHOULD HAVE HONORED THIS AND REPLACED THE PART.  *TR",
        "vin": "WAUAT48H93K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/07/2014",
        "dateOfIncident": "06/02/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10596832,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING ON THE HIGHWAY AND MY CAR STALLED. HAD TO GET IT TOWED HOME AND IT WILL NO LONGER START BUT IT REVS.  *TR",
        "vin": "WAULC68E03A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/10/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10587581,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG WARNING LIGHT CAME ON. TOOK CAR INTO AUTO REPAIR SHOP AND WAS TOLD IT IS A WIRING PROBLEM AND THE FRONT SEAT NEEDS TO BE REMOVED TO MAKE THE REPAIRS.  I SEARCHED THE INTERNET AND WAS SHOCKED TO SEE MANY REPORTS OF THE SAME PROBLEM. EVEN MORE SHOCKING IS THAT AUDI SELLS A REPAIR KIT FOR $60-$70 TO FIX THE PROBLEM. SO AUDI MAKES A DEFECTIVE PRODUCT THAT AFFECTS AN IMPORTANT SAFETY FEATURE AND INSTEAD OF RECALLING THE CARS AND FIXING THE PROBLEM FOR FREE THEY SELL A REPAIR KIT AND PROFIT FROM THEIR NEGLIGENCE. HOPE THE GOVERNMENT WILL REMEDY THIS SITUATION.  IF YOU SEARCH THIS MODEL AND YEAR CAR YOU WILL SEE IT HAS A KNOWN TIMING BELT DEFECT, A KNOWN OIL PROBLEM, PLUS THE CAR IS DEFECTIVE IN OH SO MANY PARTS. HELLO NATIONAL SAFETY TRANSPORTATION BOARD- WAKE UP!  *TR",
        "vin": "WAULC68E53A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/26/2013",
        "dateOfIncident": "08/18/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10545592,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI WOULD NOT START. HAD CAR TOWED TO CAR REPAIR SHOP NEAR. THE REPAIR SHOP CHARGED MY BATTERY AND IT STARTED PROMPTLY. MECHANIC LEFT ENGINE RUNNING FOR A FEW MINUTES AND THEN SUDDENLY THERE WAS A LOUD BOOOOM, IT SOUNDED LIKE A GUN SHOT. SMOKE IMMEDIATELY STARTED COMING FROM THE CABIN OF THE CAR. THE AIRBAGS (DRIVER AND PASSENGER SIDE) HAD DEPLOYED WHILE THE CAR WAS PARKED AND ENGINE RUNNING... NO IMPACT. I FILMED THE IMMEDIATE AFTERMATH OF THE EXPLOSION...THE VIDEO IS HERE HTTP://YOUTU.BE/WBCNXZAYGP0    I CALLED AUDI AND THEY TOLD ME TO TAKE THE CAR TO JIM ELLIS AUDI (ATLANTA). THEY \"RESEARCHED THE ISSUE\" AND SENT THEIR FINDINGS TO AUDI NORTH AMERICA WHO ARE SAYING THAT THEY WILL NOT FIX CAR DUE TO CORROSION IN THE AIRBAG MODULE. THE CAR HAS NEVER BEEN FLOOD DAMAGED AND I HAVE NOT MADE A HABIT OF LEAVING SUN ROOF OPEN SO THAT THE INTERIOR IS DRENCHED IN WATER CAUSING ELECTRICAL ISSUES.     THIS AS A MATTER OF POOR DESIGN AND AUDI IS SHIRKING THEIR RESPONSIBILITY OF DESIGNING CERTAIN COMPONENTS SAFELY (I.E. NO RISK OF CORROSION) SO THAT AIRBAGS DO NOT DEPLOY BY THEMSELVES. I COULD HAVE BEEN ON THE HIGHWAY DOING 80 AND CRASHED INTO A WALL OR A SEMI-TRUCK HAD THIS HAPPENED WHILE DRIVING. MANY OTHER PEOPLES LIVES COULD BE AT RISK DUE TO THIS VERY ISSUE. I WAS FORTUNATE.    THIS IS A MATTER OF PRINCIPAL AND AUDI SHOULD DESIGN THEIR CARS BETTER ESPECIALLY FOR COMPONENTS THAT HAVE LIFE AND DEATH IMPLICATIONS.  *JS",
        "vin": "WAUJC68E43A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2013",
        "dateOfIncident": "06/14/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10524680,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RE: AUDI A4 - AUDI-USA CASE NUMBER: [XXX]- 7/13/2013 - 3:20 PM    SPOKE WITH [XXX] ABOUT THIS ISSUE, HE TRANSFERRED ME OVER TO ANOTHER EXPERT - CURRENTLY MUSIC IS ON AND I AM ON HOLD TILL 3:29PM - A LADY NAME, [XXX], WHO BASICALLY TOLD ME THAT THIS IS SOMETHING THEY CANNOT HELP ME WITH.    THE CALL ENDED AT 3:48 PM. THEIR ARGUMENT FOR NOT REIMBURSING ME FOR MY EXPENSE WAS LAME AND ONE OF NOT ACCEPTING RESPONSIBILITY, HOWEVER, LEGALLY, THEY WERE ON THE CORRECT SIDE IN SAYING NO, AS WHEN THIS ISSUE WAS IDENTIFIED FOR THE SAME MAKE AND MODEL AND YEAR OF AUDI A4, MY CAR'S VIN WAS NOT INCLUDED AS ONE THAT WAS AFFECTED. THEY WERE HOWEVER, NOT HELPFUL IN CONSIDERING THE FACT THAT, THE ISSUE THAT WAS IDENTIFIED FOR SOME VEHICLES FOR THE SAME MAKE MODEL AND YEAR, WAS THE EXACT SAME ISSUE FOR MY MAKE MODEL AND YEAR.  AUDI, HOWEVER, LET ME KNOW THAT THEY WILL NOT HELP ME WITH THE REIMBURSEMENT OF MY EXPENSES.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUVT68E73A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/22/2013",
        "dateOfIncident": "05/19/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10513149,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A4. THE CONTACT STATED THAT WHILE DRIVING 25 MPH, THE VEHICLE ACCELERATED INDEPENDENTLY. THE CONTACT ENGAGED THE VEHICLE INTO NEUTRAL TO STOP THE VEHICLE HOWEVER, THE ENGINE RPMS CONTINUED TO RACE AS THE ENGINE ROARED LOUDLY. THE CONTACT EXITED THE VEHICLE AND LATER RETURNED TO RESTART THE ENGINE BUT THE FAILURE RECURRED. THE VEHICLE WAS TOWED TO A DEALER FOR DIAGNOSIS AND THE CONTACT WAS INFORMED THAT THE FLOOR MAT HAD BECOME LODGED UNDER THE ACCELERATOR PEDAL, CAUSING THE FAILURE. AFTER LEAVING THE DEALER THE FAILURE RECURRED. THE VEHICLE WAS RETURNED TO THE DEALER AND THE CONTACT WAS AWAITING DIAGNOSIS OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 60,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/20/2013",
        "dateOfIncident": "05/10/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512885,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP IS NO LONGER WORKING.  *TR",
        "vin": "WAUJC68E03A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2013",
        "dateOfIncident": "01/31/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496622,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A LOUD NOISE COMING FROM THE REAR AREA OF MY VEHICLE.  WHEN I GOT IN MY VEHICLE I NOTICED THAT THERE WAS A HIGH PITCHED NOISE COMING FROM THE BACK SEAT AREA.  WHEN I TOOK IT TO MY MECHANIC HE SAID THAT THE FUEL PUMP WAS GOING AND IT WOULD NEED TO BE REPLACED.  THE CAR RAN OK AND THE NOISE WENT AWAY WHEN THE WEATHER WAS WARMER BUT HAS RECENTLY RETURNED WITH THE COOLER WEATHER.  I LOOKED ONLINE AND SAW A TECHNICAL BULLETIN/RECALL FOR MY MAKE AND MODEL.  WHEN I DUG DEEPER INTO THE ASSOCIATED DOCUMENTS I FOUND MY VIN NUMBER MATCHED THE NUMBERS IN THE DOCUMENTS.  AUDI SAID THEY HAD NO RECORDS OF THIS (ALTHOUGH THEY WERE ON AUDI LETTERHEAD) AND SAID I COULD TAKE IT TO THE DEALER BUT WOULD HAVE TO PAY FOR THE DIAGNOSTIC.  THIS DOES NOT MATCH WHAT IS WRITTEN IN THE RECALL NOTICE.  *TR",
        "vin": "WAULC68E43A"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2013",
        "dateOfIncident": "02/06/2013",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496616,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT STATED OWNS A 2003 AUDI A4. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THERE WAS A HIGH-PITCHED NOISE COMING FROM THE REAR OF THE VEHICLE. THE CONTACT ALSO STATED THAT THE FUEL PUMP MAY HAVE BEEN INOPERABLE. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC TO INSPECT THE FAILURE WHERE IT WAS FOUND THAT THE FUEL PUMP NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THERE WERE NO RECALLS FOR THE FUEL PUMP ON HIS VEHICLE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 117,000.",
        "vin": "WAULC68E43A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2012",
        "dateOfIncident": "09/08/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474405,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAD STARTED TO HAVE THE PRND FLASH, BUT IT KEPT RUNNING GOOD. ON SATURDAY I DROVE AROUND 20 MILES AND PARKED ON A SMALL ANGLED ROAD I TURNED THE CAR OFF. WHEN I TURNED IT ON AGAIN I PUT IT ON REVERSE WHICH DIDN'T ENGAGE AND STARTED TO GO DOWN ALMOST CRASHING INTO A WALL. I HAD TO GET OUT AND PUSH THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/01/2012",
        "dateOfIncident": "11/17/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473284,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR JACK BROKE DOWN WHILE REPLACING A FLAT TIRE, AND THE CAR FELL ON THE GROUND AFTER BEING SUSPENDED IN AIR. FORTUNATELY WHILE ALL THE BOLTS HAVE BEEN REMOVED, THE WHEEL WAS STUCK TO THE HUB OR OTHERWISE I WOULD HAVE BEEN SERIOUSLY INJURED.     I THINK THE JACK HAS A VERY FLAWED DESIGN. WHERE THE TWO PARALLEL FRAMES CAN BE EASILY BENT OUTWARD BECAUSE THEY DON'T HAVE ENOUGH SUPPORT AND THEN THE SUPPORT CAN SLIDE OUT OF ITS DESIGNATED CHANNEL    I HAVE PICTURES OF THE FAILED JACK. I AM REALLY CONCERNED OF WHAT WOULD HAVE HAPPENED TO MY HANDS IF NOT THE MIRACLE OF THE STUCK WHEEL WAS THERE TO PREVENT INJURY OF MY HANDS..    I HAVE CONTACTED THE MANUFACTURER TO INVESTIGATE THIS FAULTY DESIGN BUT THEY RESPONDED THAT THEY RECORDED THE INFORMATION FOR THE FUTURE AND THERE HAVEN'T BEEN ENOUGH INCIDENTS YET TO JUSTIFY DESIGN REVIEW.  *TR",
        "vin": "WAULT68E23A"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/30/2012",
        "dateOfIncident": "07/28/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10468189,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT KEEPS GOING OUT AND BLOWING THE BALLAST CAUSING HEADLIGHT NOT TO WORK AT ALL. REPLACED THIS EXPENSIVE PART MULTIPLE TIMES AND STILL BREAKS. NOT A CHEAP PART AND A SAFETY HAZARD. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EXTERIOR LIGHTING,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/09/2012",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10464755,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1. EXTERIOR LIGHTS AND TURN SIGNAL LIGHTS BURNING OUT AT A RATE OF EVERY 500 MILES. AUDI WILL NOT REPLACE.  2. WIPER TRANSMISSION HAS CORRODED, SEIZED, FAILED, AND CONSEQUENTLY BURNED OUT THE WIPER MOTOR 2X NOW - ONCE AT 40,000 MILES AND AGAIN AT 80,000. AUDI WOULD NOT COVER THIS UNDER THE INITIAL NEW CAR WARRANTY, AND THEY DEMAND $750+ TO FIX THIS FAULTY ASSEMBLY. 3. COOLANT AND WIPER FLUID TANKS ARE MADE OUT OF CHEAP PLASTIC. I'VE HAD 2-3 LEAKS IN EACH TANK DUE TO HOLES IN THESE TANKS ACROSS THE LIFE OF THE CAR. THE MOST RECENT COOLANT TANK LEAK WAS PUSHING COOLANT THROUGH SO FAST THAT IT BURNED UP MY ENGINE AND MY TIMING BELT SNAPPED. I HAD TO PAY FOR THIS REPAIR - $2,000+. THESE ARE JUST 3 PROBLEMS AMONG COUNTLESS COSTLY PROBLEMS I'VE INCURRED SINCE THE 3-YEAR WARRANTY RAN OUT ON MY AUDI. I'VE EASILY MATCHED THE $35K+ COST OF THE CAR WITH PARTS AND REPAIRS, AND THE CAR ONLY HAS 88,000 MILES ON IT. THE COIL PACK RECALL HAS BEEN AN ISSUE AT LEAST EVERY 2,000 MILES. I CANNOT MAKE A TRIP OF MORE THAN 100 MILES WITHOUT A COIL SNAPPING, A TRIP TO THE DEALERSHIP, AND AN ARGUMENT WITH SERVICE REPS ABOUT WHETHER OR NOT I HAVE TO PAY FOR THESE COIL REPAIRS. 88,000 MILES LATER, THE A4 I PURCHASED BRAND NEW IS BASICALLY NOT SAFELY DRIVABLE EXCEPT TO RUN SHORT ERRANDS AROUND THE CITY. ALL OF THIS IS NOT EVEN TO MENTION THE CHEAP MATERIALS THAT WENT INTO THE CAR INTERIOR. LEATHER IS WEARING IN PLACES NO ONE EVEN SITS, AND ALL THE RUBBERIZED BUTTONS HAVE PEELED AWAY. PLEASE HELP. AUDI WILL DO NOTHING. I'VE SPOKEN TO OTHERS WHO HAVE THIS SAME MAKE AND MODEL SITTING IN A GARAGE BECAUSE IT IS NO LONGER DRIVABLE. THERE ARE 2 KNOWN RECALLS ON THIS CAR, BUT THERE IS SOMETHING MORE SERIOUS GOING ON WITH THE BUILD THAN JUST THE COIL PACK AND FUEL INJECTOR. MY CAR HAS STALLED AND SEIZED ON RELATIVELY SHORT HIGHWAY TRIPS DESPITE ROUTINE MAINTENANCE AND ATTENTION TO RECALLED PARTS. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/30/2012",
        "dateOfIncident": "09/29/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10456869,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT DRIVER  SIDE FOGGED UP THERE IS A RECALL SAME CAR AND YEAR BUT DIFFERENT HEAD LIGHTS BAD VISION CAN CAUSE A ACCIDENT.    *JS",
        "vin": "WAUAC48H33K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/20/2012",
        "dateOfIncident": "03/15/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455848,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A4. WHILE PARKED, THE CONTACT NOTICED THAT THE AIR BAG WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT INSPECTED THE VEHICLE AND NOTICED THAT THE OUTSIDE METAL OF THE AIR BAG SENSOR AND CIRCUIT BOARD WERE SEVERELY CORRODED. THE CONTACT REPLACED THE AIR BAG SENSOR. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 105,000.",
        "vin": "WAUVC68E23A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/02/2012",
        "dateOfIncident": "04/02/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453844,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST EXPERIENCED A SERIOUS ISSUE OF THE GAS PEDAL GETTING STUCK AS I WAS DRIVING OUT OF A PARKING LOT. I TAPPED ON THE PEDAL A COUPLE OF TIMES THINKING IT MIGHT GET IT TO UNSTICK BUT HAD TO PRESS ON THE BRAKE TO BRING IT TO A STOP. I PUT IT IN NEUTRAL AND COULD HEAR THE ENGINE ROAR UP AND THE TACHOMETER GO PAST 5000 RPMS. I REACHED DOWN TO THE PEDAL WITH MY HAND AND FORCED IT BACK UP TO THE RESTING POSITION. THIS HAPPENED TWICE DURING THE SHORT TRIP AND MY COLLEAGUE WAS IN THE PASSENGER SEAT WHO WITNESSED WHAT HAPPENED. THERE WAS NO PHYSICAL OBJECTS IN THE WAY OF THE PEDAL LIKE THE FLOOR MAT ETC. I'M TALKING WITH AUDI USA TO SEE WHAT STEPS I SHOULD TAKE TO INVESTIGATE THE PROBLEM AND FIX IT.  *TR",
        "vin": "WAUJC68E93A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/21/2012",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452563,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI INTRODUCED THE CONTINUOUSLY VARIABLE TRANSMISSION (CVT) TO NEW AUTOMOBILES ABOUT 2003.  THE CVT WAS TOUTED AS A HIGHLY RELIABLE TRANSMISSION IN AUDI SALES BROCHURES WITH LESS MOVING PARTS.  THE TRANSMISSION CONTAINS A TRANSMISSION CONTROL MODULE (TCM) WHICH FAILS EARLY.  I TOOK MY CAR IN WHILE UNDER WARRANTY WITH CLAIMS OF THE TRANSMISSION \"HOPPING\" AND AUDI TOOK NO ACTION TO CORRECT.  MY CAR NOW HAS 150,000 MILES ON IT AND THE TCM HAS FAILED COMPLETELY. UPON REVIEWING SEVERAL AUDI FORUMS, I HAVE LEARNED THAT THIS PROBLEM IS EXTREMELY COMMON AND AUDI HAS NOT ACKNOWLEDGED THE PROBLEM.  MANY PEOPLE WITH SIMILAR AUDI'S IN YEAR AND WITH THE SAME TRANSMISSION HAVE EXPERIENCE THE FAILURE.  THE FIX IS TO HAVE NEW TCM'S INSTALLED AT A COST OF APPROXIMATELY $2,500, WHICH REQUIRES THE REMOVAL OF THE TRANSMISSION TO REPLACE THE TCM.  WHILE I HAVE READ MANY NARRATIVES OF AUDI OWNERS EXPERIENCING THIS PROBLEM, I DO NOT KNOW IF ANYONE HAS FILED A COMPLAINT REGARDING THIS ISSUE.  IT WOULD APPEAR THAT APPROPRIATE TESTING OF THE MODULE WAS NOT CONDUCTED TO A SATISFACTORY LEVEL AND COMPONENTS WERE INSTALLED WITH FLAWS.  MY UNDERSTANDING FROM RESEARCH ON THIS TOPIC IS THAT THE SAME CVT WAS LICENSED TO NISSAN FOR INSTALLATION WITHIN THEIR VEHICLES AND THE SAME PROBLEMS ARE OCCURRING.  I BELIEVE THIS TO BE A CONDITION OF MANUFACTURER RECALL AND CORRECTION AT NO COST TO THE OWNER.  I HAVE ALSO HEARD OF THE PROBLEM FROM LOCAL MECHANICS.         *JS",
        "vin": "WAUAT48H63K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2012",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450896,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD PROBLEM WITH MY CAR'S COILS AND FUEL PUMP AND LEARNED RECENTLY THAT THESE COMPONENTS WERE UNDER RECALL YET I WAS NEVER NOTIFIED OF THIS. DOES THE MANUFACTURER OR DEALER HAVE AN OBLIGATION TO NOTIFY OWNERS OF RECALLS? I HAVE PAID A MECHANIC TO REPLACE THESE PARTS AND WOULD HAVE TAKEN TO DEALER IF TOLD OF RECALL. THANK YOU",
        "vin": "WAULT68E33A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2012",
        "dateOfIncident": "02/09/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10448156,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A4.  THE CONTACT STATED THAT WHILE DRIVING 25 MPH, A LOUD NOISE WAS HEARD FROM THE FUEL TANK.  THE CONTACT TOOK THE VEHICLE TO A LOCAL MECHANIC FOR DIAGNOSTIC TESTING WHERE THE MECHANIC STATED TO THE CONTACT THAT THE FUEL PUMP WAS FAILING AND NEEDED TO BE REPLACED. THE CONTACT REFERENCED NHTSA CAMPAIGN I.D. 06V017000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP) AND CALLED THE MANUFACTURER WHO THEN ADVISED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE CONTACT DID NOT HAVE THE VEHICLE REPAIRED.  THE FAILURE MILEAGE WAS 68,000.",
        "vin": "WAUAC48H93K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/22/2012",
        "dateOfIncident": "01/17/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10444781,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDENLY, WHILE DRIVING ON FREEWAY, WENT TO LOW GEAR SPEED AND NOT ABLE TO MOVE CAR.  I ALREADY CHANGE THE TRANSMISSION @ 42,000 MILES AT AUDI DEALERSHIP.  THIS IS AUDI CVT TRANSMISSION. IT HAS VERY BAD RELIABILITY RECORDS.  YOU CAN SEE A LOT OF COMPLAINTS, A ESPECIALLY ABOUT TCM MODULE. TRANSMISSION REPAIR SHOPS JUST REFUSE TO REPAIR THIS TYPE OF TRANSMISSION.  THE ONLY CHOICE IS AUDI DEALERSHIP.  THE DEALERSHIP PRICE IS ABOUT $8,500 FOR MANUFACTURING REBUILD TRANSMISSION.  HOWEVER, THE MOST IMPORTANT IS THE SAFETY. I WOULD NOT LIKE THAT ANYONE WAS INJURED ON THE ROAD BECAUSE OF MALFUNCTION OF THIS TRANSMISSION.  IT JUST MATTER OF TIME AND TRANSMISSION WILL BE BROKEN AND SOMEBODY GOT HURT.  *TR",
        "vin": "WAUAC48H53K"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443221,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FLICKER AND GO OUT MOMENTARILY WHILE DRIVING, ESPECIALLY AFTER HITTING A DIP IN THE ROAD OR A BUMP. DASH READS \"RIGHT/LEFT DIPPED HEADLIGHT\". EXTREMELY DANGEROUS TO HAVE HEADLIGHTS GO OUT AT NIGHT. *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/19/2011",
        "dateOfIncident": "11/18/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436458,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN REPLACING A FLAT TIRE AFTER JACKING THE CAR UP, THE ORIGINAL CAR JACK BROKE DOWN AND THE CAR FELL BACK DOWN. LUCKILY I HAVEN'T BEEN INJURED, BUT WAS REALLY A CLOSE CALL.  *TR",
        "vin": "WAULT68E23A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/19/2011",
        "dateOfIncident": "06/15/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10436463,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A WARNING READING \"LEFT DIPPED HEADLIGHT\" APPEARED ON MY INSTRUMENT GAUGE. THE ISSUE WENT AWAY BY ITSELF BUT HAS NOW RETURNED. I GET THE SAME MESSAGE NOW AND MY FRONT LEFT HEADLIGHT TURNS OFF BY ITSELF. SOMETIMES IT COMES BACK ON OR I HAVE TO MANUALLY SHUT OFF MY HEADLIGHTS AND TURNED THEM BACK ON. THE SAME MESSAGE COMES BACK ON AFTER MINUTES OF DRIVING.  *TR",
        "vin": "WAUJT68E93A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/21/2011",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10432412,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE I PURCHASED THIS VEHICLE, THE HID LIGHTS HAVE SPORADICALLY FLICKERED. WITHIN THE PAST YEAR, THEY RANDOMLY FLICKER AND SOMETIMES TURN OFF BRIEFLY MAKING FOR A HAZARDOUS DRIVING SITUATION. I REALLY WISH AUDI WOULD FIX THIS PROBLEM BECAUSE THERE ARE HUNDREDS OF OWNERS HAVING THE EXACT SAME PROBLEMS. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/31/2011",
        "dateOfIncident": "08/30/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422705,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "POTENZA POLE POSITION",
                "productYear": "9999",
                "size": "195/60R15",
                "type": "Tire"
            }
        ],
        "summary": "ON AUGUST 30, 2011 EXPERIENCED HAD A RIGHT PASSENGER TREAD SEPARATION OF BRIDGESTONE POTENZA RE960AS. I WAS DRIVING AN AUDI A4 AT 65 MPH ON I24 EAST NEAR MANCHESTER TENNESSEE. LUCKILY I WAS ABLE TO PULL OFF AT THE NEXT EXIT WITHOUT CAUSING AN ACCIDENT. THE TIRES HAD 19,000 MILES OF WEAR.  *TR",
        "vin": "WAUJC68E43A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/07/2011",
        "dateOfIncident": "07/06/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410957,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FAILURE.  WHILE DRIVING. SUDDENLY WITHOUT POWER.  FORTUNATELY WAS ABLE TO PULL OVER TO THE SIDE OF THE ROAD.  2003 AUDI A4, WHICH HAS HAD RECALL NOTICES ON IT FOR EXACTLY THIS ISSUE.  YET WHEN I TALK TO THE DEALER ABOUT IT, THEY SAY MY \"VIN ISN'T ONE OF THE ONES IMPACTED SO IT'S NOT COVERED.\"  IT'S EXACTLY THE MODEL YEAR AND MODEL AND THE EXACT PROBLEM THEY'VE ADMITTED.  BUT NOW IN A DOCUMENTED CASE, THEY ARE REFUSING TO COVER THE REPAIR.  *TR",
        "vin": "WAUVC68E03A"
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/24/2011",
        "dateOfIncident": "04/28/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402500,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PURCHASED MY PRE-OWNED 03 AUDI A4 CABRIO IN MAY 2010 FAILED TO NOTICE THAT THE BOTTOM LEFT AND RIGHT CORNERS OF THE REAR WINDOW WAS SEPARATING FROM THE FABRIC AT THE TOP. FAST FORWARD TO MAY 2011 ITS NOW SPREAD ENOUGH THAT YOU COULD REACH A WHOLE HAND INTO THE HEADLINER.  WHEN IT RAINS PART OF THE BACK SEAT,REAR DECK AND AREAS OF THE TRUNK GET VERY WET  WAS SEPARATING FROM THE FABRIC AT THE BOTTOM LEFT AND RIGHT CORNERS OF THE REAR WINDOW, ENOUGH THAT YOU COULD REACH A WHOLE HAND INTO THE HEADLINER.  WHEN IT RAINS THE HEADLINER AROUND THE REAR GLASS, PART OF THE BACK SEAT,REAR DECK AND AREAS OF THE TRUNK GET VERY WET. WITH THE SMELL AFTER IT DRIES, IM SURE I HAVE MOLD AND MILDEW ISSUES AS WELL. *TR",
        "vin": "WAUAC48H53K"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/17/2011",
        "dateOfIncident": "04/06/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10401975,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR PROBABLY HAS FAULTY TCU, BECAUSE TRANSMISSION WOULD SOMETIMES JERK IF GOING FROM COMPLETE STOP AND PRESSING GAS PEDAL (EVEN LIGHTLY). THE CAR AT FIRST WOULDN'T GO, THEN ALL OF THE SUDDEN AND UNEXPECTEDLY WOULD ACCELERATE. I BELIEVE THIS IS COMMON IN AUDI, AND THEY SHOULD FIX THAT.",
        "vin": "WAUAT48H33K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/06/2011",
        "dateOfIncident": "02/06/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380916,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 TCM FAILURE ALMOST LED TO A SERIOUS ACCIDENT. WAS BACKING OUT OF A DRIVEWAY ON A SEMI-BUSY ROAD IN WINTER PARK, FL WHEN THE TRANSMISSION CONTROL MODULE GAVE OUT ON MY 2003 AUDI A4 CVT TRANSMISSION. THE CAR LOST ALL POWER AND JUST WOULD REV. BUT NOT MOVE IN REVERSE. I HAD TO QUICKLY THROW IT IN DRIVE AND HEAD INTO ONCOMING TRAFFIC UNTIL BEING ABLE TO GET INOT THE PROPER LANE. AFTER DRIVING HOME, I NOTICED THAT THIS IS RANDOM AND THERE IS NO LOGIC TO WHEN IT OCCURS. THE PROBLEM IS AN INTERMITTENT ELECTRICAL TCM PROBLEM IN WHICH SIGNAL 'DROPS' FOR A SHORT PERIOD OF TIME.    I DID A SEARCH ONLINE ABOUT THEIS ISSUE WITH THE 2003 CVT TRANSMISSION FROM AUID AND THE TCM SHORTING OUT WHILE DRIVING IS A VERY COMMON ISSUE. I SEE THIS AS A SAFETY ISSUE AND DEFINALTELY HOLD THE AUTO MANUFACTURUER AT FAULT. AUDI HAS RECALLED THESE TCM'S FOR THEIR A6  AND A8 LINE THAT YEAR WHICH USES MANY OF THE SAME COMPONENTS. WHY HAS THE 2003 A4 CVT NOT BEEN RECALLED THEN. IT HAS THE SAME ISSUES. TCM FAILURE AND FAULTS DUE TO IMPROPER ELECTRICAL CONNECTIONS AND CLUTCH PACK FAILURE BECUASE THE TRANSMISSION CANNOT HANDLE THE POWER OR WEIGHT OF THE CAR. THAT IS WHY FROM 2005 AND ON THE CVT COMES WITH 7 CLUTCH PLATES.    BOTTOM LINE IS THAT IF THIS ISSUE IS NOT ADDRESSED IN THE 2003 AUDI A4 CVT AND YOU DO NOT RECALL THIS YEAR AND VERSION TCM (AND MAYBE EVEN THE TRANNY ITSELF) PEOPLE WILL DIE IN ACCIDENTS THAT WERE NO FAULT OF THEIR OWN. I AM HEADED TO THE AUDI WEBSITE AND ANY OTHERS WHO WILL TAKE MY COMPLAINT ABOUT THIS ISSUE. I SEE IT UP THERE WITH A STUCK ACCELERATOR. IF YOU CANT CONTROL SPEEDING UP OR SLOWING DOWN AND THE PROBLEM IS FAULTY ELECTRICAL THUS HAPPENING INTERMITENTLY HOW CAN YOU STAY IN CONTROL OF YOUR VEHICLE?  *TR",
        "vin": "WAUJC68E93A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/04/2011",
        "dateOfIncident": "12/07/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380776,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF IGNITION COILS ON AUDI A4 1.8 TURBO ENGINE.  *TR",
        "vin": "WAUVC68E53A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "01/27/2011",
        "dateOfIncident": "09/13/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10379289,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING MY VEHICLE, THE APPROACHING LIGHT TURNED YELLOW, THEN RED, AND THE VEHICLES IN FRONT OF ME STOPPED, I APPLIED THE BREAK ON MY VEHICLE, I HAD PLENTY OF DISTANCE BETWEEN ME AND THE OTHER VEHICLES, HOWEVER AS I AM APPLYING THE BREAK, MY VEHICLE BEGAN TO SLOW AND ALL OF A SUDDEN THE CAR  BEGAN TO ACCELERATE UNCONTROLLABLY, RPM WAS OVER 5000, THE BRAKES DID NOTHING TO STOP THE VEHICLE, AND THE VEHICLE ACCELERATED EVEN MORE, I HAD NO CHOICE AND NOWHERE TO TURN OFF TO AVOID AN ACCIDENT, MY VEHICLE PLOWED INTO THE VEHICLE LOCATED IN FRONT OF ME ON THE RIGHT HAND SIDE OF THE ROAD. I WAS LUCKY THAT AT LEAST THERE WAS A CAR IN FRONT OF ME, IF MY CAR WAS THE FIRST ONE IN THE LINE, I WOULD NOT BE ABLE TO STOP IT AND COULD HAVE HIT THE PEDESTRIANS CROSSING THE ROAD. THIS IS THE WORST DEFECT IN A VEHICLE, AND A VERY DANGEROUS DEFECT THAT COULD CAUSE SEVERE CONSEQUENCES.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/13/2011",
        "dateOfIncident": "08/20/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376521,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "CAR LOSES POWER AS IT TRAVELS . HAS BEEN TO DEALER FOR ANALYSIS AND FUEL PUMP REPLACEMENT RECOMMENDED. CHECKED AND FOUND RECALL CAMPAIGN 07V375000 IS ACTIVE. DEALER REFUSES SAYING OUR CAR IS NOT ELIGIBLE EVEN THOUGH SYMPTOMS ARE IDENTICAL AND MAKE, MODEL AND YEAR ARE SAME. THEY CLAIM VIN IS NOT IN RECALL BASE. WHO DETERMINES THE ACCURACY OF THE VIN NUMBERS ELIGIBLE? WE HAVE SPENT SEVERAL HUNDREDS OF DOLLARS TO TRY AND FIX THE PROBLEM OVER THE PAST YEAR AND AFTER SEVERAL DIAGNOSIS WE ARE TOLD IT IS THE FUEL PUMP. WE JUST RECENTLY FOUND OUT ABOUT THE RECALL.  *TR",
        "vin": "WAUAC48H33K"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/06/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374990,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT HEADLIGHT STOPPED WORKING - CHANGED THE BULB BUT STILL WILL NOT WORK.  ERROR MESSAGE SAYS \"RIGHT DIPPED HEADLIGHT\". *TR",
        "vin": "WAULC68E93A"
    },
    {
        "components": "POWER TRAIN,VISIBILITY,STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/06/2010",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369313,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I OWN A 03 AUDIA4 1.8T CABRIOLET. FOR THE PASS TWO YEARS I HAVE TO REPAIR THE TRANSMISSION TWICE- THE CAR COULD NOT MOVE, THE GEARS WEREN'T SWITCHING. AUDI USA ARE AWARE OF THIS ISSUE AND STILL THERE IS NOT A RECALL FOR THAT.  SECOND AND BIGGER ISSUE IS THE REAR WINDOW WHICH IS SEPARATING FROM THE CONVERTIBLE TOP. IT IS DANGEROUS AS THE WINDOW CAN FLY AWAY WHILE I DRIVE THE CAR WITH A HIGHER SPEED ON THE HIGHWAY AND HIT THE CARS BEHIND ME. ALSO VERY COMMON PROBLEM FOR THIS MODEL CARS.  *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/26/2010",
        "dateOfIncident": "11/25/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10367907,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING FROM GA TO NC THE CAR ACCELERATED SUDDENLY FROM A TRAFFIC LIGHT.  I COULD FEEL THE ACCELERATOR MOVE AWAY FROM MY FOOT AND I HAD PRESSED THE CLUTCH AND BREAK TO AVOID AN ACCIDENT.  I NOTICED THE TACHOMETER WAS ABOVE 5000 RPM AND I TURN OFF THE CAR AND COASTED INTO A GAS STATION.  I CHECKED THE FLOORMATS AND THE ACCELERATOR AND EVERYTHING SEEMED FINE.  I RESTARTED THE CAR AND CAUTIOUSLY CONTINUED MY TRIP.  EVERYTHING SEEMED OKAY UNTIL I WAS CLOSE TO MY DESTINATION.  THEN I EXPERIENCED THE SAME UNCONTROLLED ACCELERATION.  AGAIN, THE ONLY WAY TO STOP THE CAR WAS TO TURN OFF THE ENGINE.  I TOOK THE CAR TO AN AUDI DEALER IN NC AND THEY TOLD ME THERE WERE NO FAULTS AND THEREFORE NO PROBLEM.  THEY SUSPECTED THE FLOORMATS. *TR",
        "vin": "WAULC68E43A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/16/2010",
        "dateOfIncident": "11/16/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10366380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A FAILURE WITH MY HIGH INTENSITY DISCHARGE(HID) LIGHTS THAT CAUSES THEM TO FLICKER AND SOMETIMES TO TURN OFF COMPLETELY WHILE IN USE/ THE FAILURE OCCURS EVERY TIME THE HID LIGHTS ARE TURNED ON. BULBS HAVE BEEN CHANGED, BUT THE CONDITION IS NOT RESOLVED.  AN ALARM COMES ON SCREEN WHICH READS \"LEFT LIGHT DIPPED\" OR \"RIGHT LIGHT DIPPED\" AND RESULTS IN THE LIGHT TURNING OFF COMPLETELY ON THE DIPPED SIDE. *TR",
        "vin": "WAULC68E53A"
    },
    {
        "components": "STEERING,SUSPENSION,POWER TRAIN,VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/25/2010",
        "dateOfIncident": "10/10/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362262,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 CABRIOLET HAS HAD NUMEROUS ISSUES, FAILURE OF DOOR GASKET SEAL WHICH DESTROYED PLC, RESULTING IN HORRIBLE SOUND SAFETY ISSUE, COST OVER $2K TO FIX, FAILURE OF CV JOINT WHICH COULD CAUSE WHEEL TO FLY OFF, FAILURE OF REAR GLASS WINDOW THAT COULD COME LOOSE HURTING OTHER VEHICLES OR PASSENGERS OF CAR; CAR HAS LESS THAN 70K MILES, WAS BOUGHT NEW AND IS GARAGED. AUDI AMERICA SHOULD REIMBURSE OWNERS FOR THESE NUMEROUS, (AND APPARENTLY INEVITABLE, JUDGING BY WHAT I'VE READ AND HEARD FROM OTHER OWNERS) PROBLEMS. *TR",
        "vin": "WAUAC48H23K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/01/2010",
        "dateOfIncident": "09/27/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10358740,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  WHILE DRIVING APPROXIMATELY 65 MPH THE VEHICLE STALLED.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP WHERE SHE WAS INFORMED THE FAILURE WAS DUE TO THE FUEL PUMP.  THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED.  THE MANUFACTURER WAS NOTIFIED AND SHE WAS INFORMED HER VEHICLE WAS NOT INCLUDED IN THE RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 07V375000, FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP.  THE FAILURE AND CURRENT MILEAGES WERE 72,000.",
        "vin": "WAULC68E03A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/19/2010",
        "dateOfIncident": "09/17/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356345,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 AUDI A4 1.8T QUATTRO. A MESSAGE CAME ON MY DASHBOARD STATING THAT THERE IS A LEFT DIPPED HEADLIGHT PROBLEM. WHEN RESEARCHING, IT SEEMS A LARGE AMOUNT OF OTHER AUDI A4S HAVE HAD THIS ISSUE. THIS SEEMINGLY WIDESPREAD PROBLEM SHOULD BE INVESTIGATED AS IT IS VERY UNSAFE NOT ONLY FOR THE OPERATOR, BUT FOR ONCOMING TRAFFIC AND PEDESTRIANS. THE BULB IS NOT \"BURNED OUT\" AS IT HAS WORKED SPORADICALLY SINCE THE FIRST WARNING CAME ON. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/18/2010",
        "dateOfIncident": "09/16/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356253,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "200 AUDI A4 CONVERTIBLE.  REAR WINDOW HAS SEPARATED FROM ROOF  APPEARS AS IF THE GLUE IS DRY ROTTED?  MILES 49K  GARAGE KEPT, HAND WASHED....  FOUND INFO ON-LINE REGARDING SEVERAL OTHER OWNERS EXPERIENCING THIS PROBLEM  AUDI OF AMERICA REFUSES RESPONSIBILITY WHILE AUDI GERMANY ACCEPTS FULL RESPONSIBILITY.  THIS IS A SAFETY HAZARD.  I'M AFRAID THE WINDOW WILL FALL OUT WHILE ON THE HIGHWAY. *TR",
        "vin": "WAUAC48H03K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/11/2010",
        "dateOfIncident": "09/10/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355007,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON HIGHWAY AT 60MPH, REMOVED FOOT FROM GAS PEDAL, BUT GAS PEDAL DID NOT COME UP AND CAR DID NOT SLOW DOWN.  PRESSED ON BRAKES, BUT WAS NOT ABLE TO STOP CAR WITH JUST BRAKES.  HAD TO USE HANDBRAKE AS WELL TO STOP CAR.  TOOK TO DEALER AND WAITING ON DIAGNOSIS. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/24/2010",
        "dateOfIncident": "04/10/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10351558,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS FAIL VERY FREQUENTLY. *TR",
        "vin": "WAUVC68E53A"
    },
    {
        "components": "POWER TRAIN,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/03/2010",
        "dateOfIncident": "08/03/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10347007,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IT WOULD SEEM THAT I HAVE TWO OF THE ISSUES I'VE SEEN HERE WITH MY 2003 AUDI A4 CONVERTIBLE. I HAVE OWNED IT SINCE 2008 AND HAVE ALREADY REPLACED THE TRANSMISSION MODULE TWICE. AS DESCRIBED BY OTHERS, IT WOULDN'T ENGAGE REVERSE, OR GO INTO STANDARD MODE... BLINKING DASH LIGHTS, ETC...    THE OTHER COMMON ISSUE IS MY REAR WINDOW. IT IS HOLDING ON BY LESS THAT TWO INCHES OF GLUE. THE REST JUST HANGS ON BY THE HEADLINER. THIS HAS RESULTED IN GALLONS OF WATER ENTERING MY CAR DURING RAIN STORMS. NOT TO MENTION THE VIBRATIONS WHILE DRIVING WITH THE TOP UP. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/01/2010",
        "dateOfIncident": "07/25/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10346632,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AT LEAST QUARTERLY I HAVE TO REPLACE ONE OR MORE BULBS. WITHIN THIS PAST WEEK MY RR BRAKE BULB & LR PARKING LIGHT BLEW. *TR",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/28/2010",
        "dateOfIncident": "07/04/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10345931,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2003 AUDI A4 ON THE MASS PIKE FREEWAY INTO BOSON, AS I APPROACHED A TOLL BOOTH, I TAPPED THE BREAK TO DISENGAGE THE CRUISE CONTROL.  THE CAR SLOWED DOWN SO THAT I PASSED THROUGH THE TOLL BOTH AT APPROXIMATELY 18 MPH.  AFTER PASSING THROUGH THE TOLL BOOTH, I AGAIN STARTED TO ACCELERATE, BUT ONCE TOUCHING THE GAS PEDAL, IT SEEMED TO GO DOWN ON ITS OWN, AND THE CAR ACCELERATED, NOT UNDER MY CONTROL.   I IMMEDIATELY STEPPED ON THE BRAKES TO SLOW THE ACCELERATION, BUT AS SOON AS I TOOK MY FOOT OFF THE BRAKES, THE CAR CONTINUED TO ACCELERATE TO ABOUT 60 MPH, AT WHICH POINT I APPLIED THE BREAKS AGAIN.  LUCKILY, TRAFFIC WAS MINIMAL, AND I WAS ABLE TO KEEP CONSTANT PRESSURE ON THE BRAKE PEDAL TO KEEP THE CAR SPEED DOWN, AND AVOID OTHER VEHICLES WHILE THE BRAKES AND ACCELERATOR WORKED AGAINST EACH OTHER.  INITIALLY, THERE WAS NOWHERE TO PULL THE CAR OFF THE ROAD, BUT THEN AS I APPROACHED A SMALL PULLOUT, I MOVED THE CAR INTO THE OUTSIDE LANE AND TURNED OFF THE ENGINE.  I THOUGHT MAYBE THE CRUISE CONTROL HAD MALFUNCTIONED, AND BY TURNING OFF THE CAR, IT WOULD BE RESET.  SO AFTER SETTING SEVERAL MINUTES, WITH THE CAR IN PARK, I TRIED STARTING THE CAR.  THE ENGINE IMMEDIATELY REVVED UP TO FULL SPEED, SO I AGAIN TURNED THE CAR OFF.    AFTER SETTING ANOTHER 10 MINUTES, I TRIED STARTING THE CAR AGAIN, AND IT STARTED NORMALLY.  I WAS ABLE TO DRIVE THE CAR HOME WITHOUT EXPERIENCING ANY ADDITIONAL ACCELERATION ISSUES.  AUDI LOOKED AT THE CAR AND DETERMINED IT WAS A FAULTY BRAKE SWITCH THAT PREVENTED THE CRUISE CONTROL FROM DISENGAGING.  HOWEVER, THE CRUISE CONTROL WAS NOT ACTIVE WHEN THE UNCONTROLLED ACCELERATION OCCURRED, AND THEIR OWN MECHANIC SAID THE FAULTY SWITCH WOULD NOT EXPLAIN THE FULL THROTTLE ENGINE START AFTER SHUTTING OFF THE ENGINE.  THEY SAID THEY REPLACED THE BRAKE SWITCH BUT WILL TAKE NO FURTHER ACTION.  BASED ON THE AUDI MECHANICS COMMENTS, I DO NOT FEEL THE ISSUE HAS BEEN RESOLVED. *TR",
        "vin": "WAULT68E43A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/25/2010",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340015,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON 2002 THROUGH 2007 (AND POSSIBLY TO CURRENT) AUDI A4'S HAVE BEEN KNOWN TO GO OUT RANDOMLY.  OFTEN TIMES IT IS JUST THE SINGLE LEFT HEADLIGHT, OR RIGHT HEADLIGHT, WHICH GOES OUT.  THIS IS ACCOMPANIED BY THE ERROR MESSAGE \"LEFT/RIGHT HEADLIGHT DIPPED\" ON THE DRIVER INFORMATION SCREEN LOCATED ON THE DASHBOARD.  THIS CAN OCCUR FROM THE FOLLOWING CIRCUMSTANCES:  -HEAVY OR SUDDEN CHASSIS VIBRATION (SUCH AS HITTING A POTHOLE OR EVEN SOMEONE PHYSICALLY STRIKING THE HEADLIGHT)  -COLD WEATHER (EXAMPLES HAVE OCCURRED IN AS LITTLE AS 35 DEGREES FAHRENHEIT)  -WATER OR MOISTURE IN THE ELECTRICAL WIRING    THIS FAILURE CAUSES A SUDDEN LOSS OF HEADLIGHT OUTPUT, ENDANGERING BOTH THE DRIVER AND OCCUPANTS OR OTHER DRIVERS AND PEDESTRIANS IF THIS OCCURS AT NIGHT OR IN POOR WEATHER.  SINCE A COMMON CAUSE IS POOR WEATHER/COLD WEATHER, OFTEN AT ITS WORST AT NIGHT, THIS IS A SIGNIFICANT RISK.    AUDI OF AMERICA HAS NOT ACKNOWLEDGED THIS AS AN ISSUE DESPITE SPANNING SEVERAL YEARS OF VEHICLES.  THE LOCAL DEALERSHIP HERE HAS REPLACED THE BULBS THREE TIMES (WHICH WERE FINE TO BEGIN WITH), THE HEADLIGHT ONCE, AND RUN SEVERAL ELECTRICAL DIAGNOSTICS - ALL AT OWNERS EXPENSE.  THE PROBLEM GOES AWAY BRIEFLY AND THEN COMES BACK.  CURRENTLY THE LEFT HEADLIGHT OF MY 2003 AUDI A4 HAS BEEN OUT FOR 4 MONTHS WITHOUT RECOVERING.    THERE ARE MULTIPLE EXAMPLES OF THIS SAME ISSUE ALL OVER THE INTERNET, A SIMPLE GOOGLE SEARCH WILL PROVIDE MORE EXAMPLES.    THERE WAS NO CRASH ASSOCIATED WITH THIS FAILURE. *TR",
        "vin": "WAULC68E13A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/22/2010",
        "dateOfIncident": "04/16/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331707,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN ACCELERATION. I WAS COMING BACK FROM THE STORE, AND TWICE I STEPPED ON THE GAS AND THE PEDAL WENT TO THE FLOOR ON ITS OWN! I HIT THE BRAKE AND KEPT THE CAR FROM RUNNING AWAY WHILE I PULLED THE PEDAL UP WITH MY OTHER FOOT. WHEN I GOT BACK HOME, I PUT IT IN NEUTRAL, GAVE IT A LITTLE GAS, AND IT WENT INTO FULL ACCELERATION. I COULD FEEL THE GAS PEDAL PULL AWAY FROM MY FOOT AND GO TO THE FLOOR. I HAD TO TURN THE KEY OFF TO STOP IT.  IT WAS NOT \"FLOOR MATS\" OR DRIVER ERROR. THE NEXT DAY, THE PROBLEM WAS GONE. I DROVE TO THE AUDI DEALER. THEY REPLACED THE GAS PEDAL ASSEMBLY AND THE PROBLEM APPEARS TO BE FIXED. *TR",
        "vin": "WAUJT68E43A"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/22/2010",
        "dateOfIncident": "05/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331766,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI A4 3.0 V6 DRIVER SIDE AUTOMATIC WINDOW BEGAN TO FAIL FOR THE FIRST TIME ABOUT TWO YEARS AGO IN 2008. ONE DAY IT JUST STOPPED WORKING COMPLETELY: STILL COULD ROLL DOWN, BUT ONCE DOWN, IT COULDN'T ROLL UP ANY MORE. I HAD TO USE MY HANDS TO HOLD IT FROM BOTH SIDES TO PULL IT UP. IT CAUSED SO MANY PROBLEMS, SOMETIMES REAL DANGERS, DURING THE OPERATION, UNTIL I PAID A FEW HUNDRED DOLLARS TO FIX IT A FEW WEEKS LATER. ESPECIALLY IT'S SO DIFFICULT TO GO THROUGH TOLL BOOTHS OR SOME NARROW LANES WHEN I CAN'T OPEN THE DOOR EASILY WHILE NOT ABLE TO ROLL DOWN THE WINDOW, OR IN CASES I HAD THE WINDOWS DOWN FOR WHATEVER REASON, IT BECAME DANGEROUSLY DIFFICULT TO GET IT BACK UP WHEN NEEDED DUE TO RAIN OR SNOW CONDITIONS. I CAN HARDLY DESCRIBE ALL THE DIFFICULT SITUATIONS THAT MADE ME FEEL HELPLESS.    BUT TWO YEARS LATER (2010), THE SAME WINDOW FAILED AGAIN WITH EXACTLY THE SAME ISSUE, NOT ABLE TO ROLL UP. I DELAYED REPAIR UNTIL NOW. WHAT'S WORSE NOW IS AT THE SAME TIME, ANOTHER WINDOW -- THE REAR PASSENGER SIDE WINDOW BEGAN TO FAIL TOO! THAT'S A WINDOW I BARELY USE DURING THE LAST SEVERAL YEARS OF OWING THE CAR. ONE DAY WHILE DRIVING, THERE WAS THIS BIG LOUD SOUND LIKE AN EXPLOSION COMING FROM THAT WINDOW, AND I HAD TO STOP DANGEROUSLY ON THE HIGHWAY TO INSPECT WHAT HAPPENED UNTIL CONFIRMING IT'S THE WINDOW FAILURE. IT'S BEYOND ANY REASON TO EXPLAIN WHY IT WOULD FAIL WITH NO USAGE. THIS REAR WINDOW PRESENTED MORE SECURITY ISSUES TO ME TOO, BECAUSE EVEN IF I PUSH IT ALL THE WAY UP WITH MY HANDS, IT ALWAYS SLOWLY SLIDE DOWN TO LEAVE A BIG OPENING ABOUT 5 TO 10 INCHES WIDE. SINCE I PARK THE CAR ON THE STREET ALMOST DAILY, IT'S A REAL ISSUE TO WORRY ABOUT BURGLARS OR BREAK-INS. FOR THIS SERIOUS CONCERN, I HAD TO SEND IT TO THE DEALER FOR REPAIR, WHO QUOTED ME $460 TO FIX IT INCLUDING PARTS AND LABOR.    CONSIDERING THIS HAS HAPPENED TO ME TOTAL THREE TIMES, INCLUDING ONE THAT'S HAPPENED TO A WINDOW I RARELY USE, THIS SEEMS TO ME STRONGLY AN OBVIOUS MANUFACTURER'S DEFECT. *TR",
        "vin": "WAUJT68E33A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/12/2010",
        "dateOfIncident": "03/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10330140,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR GLASS WINDOW OF THE CONVERTIBLE TOP OF MY 2003 AUDI A 4 HAS COME LOOSE. WE PAID A CAR UPHOLSTERER TO GLUE IT BACK IT IN BUT IT IS LOOSE AGAIN. IT WOULD BE VERY DANGEROUS IF IT FELL OUT WHILE TRAVELING.  *TR",
        "vin": "WAUAT48H83K"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/09/2010",
        "dateOfIncident": "05/03/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329505,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR LEFT HEADLIGHT FAILURE (HID/XENON). FAULT NOT WITH BULB OR FUSE. *TR",
        "vin": "WAULC68E33A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327040,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT FAILURE.  THE CAR GIVES A WARNING THAT THE \"FRONT DIPPED HEADLIGHT\" IS TURNING OFF. THIS FAILURE OCCURS EVERY TIME I START THE CAR.  I HAVE REPLACED THE HEADLIGHT 3 TIMES BUT IT IS A FAULTY BALLAST, WHICH IS DEFECTIVE. *TR",
        "vin": "WAULC68E63A"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/10/2010",
        "dateOfIncident": "03/23/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324896,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MARCH 2009, I HEARD SOME LOUD NOISES FROM THE AREA OVER THE FUEL TANK.  I TOOK IT TO MY MECHANIC AND THEY COULD NOT IDENTIFY AS IT WAS INTERMITTENT.  THEY FINALLY DETERMINED THAT IT WAS THE FUEL FILTER AND IT WOULD NEED REPLACED BUT NOT URGENTLY.  A COUPLE OF DAYS LATER, THE CAR STALLED AND WOULD NOT RESTART.  LUCKILY IT STALLED AS I TURNED INTO THE GROCERY STORE PARKING LOT.      I HAD IT TOWED AND IT WAS DETERMINED THAT THE FUEL PUMP HAD FAILED.  MY MECHANIC WAS SURPRISED AS IT WAS UNUSUAL THAT IT WOULD FAIL AS THE CAR HAD ON 47K MILES.  THE PUMP AND FILTER WERE REPLACED.      I WAS NOT MADE AWARE THAT THERE WAS A RECALL AND IT APPEARS THAT MY PARTICULAR VEHICLE WAS NOT PART OF THE RECALL, BUT I AM SUSPICIOUS AS I RECENTLY READ ABOUT THE RECALL THROUGH THE NHTSA THROUGH MY PROGRESSIVE INSURANCE.  I ALSO DID NOT TAKE THE VEHICLE TO THE DEALER TO REPLACE AS THERE WAS NO RECALL FOR MY VEHICLE REGARDING THE FUEL PUMP. *TR",
        "vin": "WAULC68E13A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "04/03/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323721,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUDDEN, UNINTENDED ACCELERATION OF 2003 AUDI A4 WHILE IN 4TH GEAR.  RPMS SPIKED AND REMAINED AT 7 AFTER FOOT WAS REMOVED FROM ACCELERATOR.  EXPERIENCED LOSS OF CONTROL OF STEERING.  WAS EVENTUALLY ABLE TO SLOW AND STOP CAR VIA BRAKES.  AFTER COMPLETELY SHUTTING CAR OFF AND REMOVING KEY, CAR WAS RESTARTED AND ENGINE REVVED UP TO 7 RPMS WITH ZERO ACCELERATION.  OCCURRED ON QUEENSBOROUGH BRIDGE - POLICE WERE CALLED TO ASSIST.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "09/18/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323916,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 CABRIOLET, THE CAR IS PRACTICALLY NEW, ONLY DRIVEN IN SUMMER MONTHS.  THE REAR WINDOW HAS SEPARATED FROM THE ROOF, APPARENTLY THE WINDOW IS ONLY SEALED TO THE ROOF WITH A LAYER OF GLUE.  THE WINDOW CAN FALL OUT AT ANYTIME AS A RESULT OF THE GLUE LOOSENING.  THE ONLY ALTERNATIVE IS A COMPLETELY NEW ROOF.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "04/04/2010",
        "dateOfIncident": "04/04/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323710,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FALKEN TIRE CORPORATION",
                "productMake": "FALKEN",
                "productModel": "FALKEN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I WAS DRIVING MY AUDI A-4 ON THE FREEWAY AT SPEEDS OF APPROXIMATELY 65 MPH WHEN THERE WAS A LOUD THUMPING ON THE LEFT FRONT OF MY VEHICLE. MOMENTS LATER, IT STOPPED BUT I NOTICED THERE WERE VIBRATIONS AND SHIMMIES ON MY STEERING WHEEL. I SLOWED DOWN AND PULLED TO SIDE OF FWY TO INSPECT THE TIRE. IT APPEARED FINE, HOWEVER, VIBRATION WAS STILL THERE. I PULLED ONTO SURFACE STREETS AT LOWER SPEEDS AND IT STOPPED. SHORTLY THEREAFTER, I PULLED INTO A GAS STATION TO TAKE THE TIRE OFF TO REPLACE WITH SPARE AND NOTICED SEPARATION OF THE TREAD, MEASURING APPROXIMATELY 31 INCHES LONG AND 1.5 INCHES IN WIDTH. I WAS SHOCKED THAT I DIDN'T LOSE CONTROL OR HAVE A BLOWOUT FROM THIS CATASTROPHIC FAILURE. *TR",
        "vin": "WAUJT68E53A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "03/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319640,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I OWN A AUDI A4 CABRIOLET THAT RECENTLY HAD TO HAVE THE FUEL PUMP REPLACED. THE FUEL PUMP WAS CAUSING A VERY NOTICEABLE VIBRATION IN THE FUEL TANK. AUDI WAS CALLED AND TOLD ME THAT OUR VEHICLE WAS NOT IN THE GROUP THAT QUALIFIED FOR FUEL PUMP REPLACEMENT. THE CAR ONLY BEEN DRIVEN HAS 85,000 MILES AND IN MY OPINION A FUEL PUMP PROBLEM IS PREMATURE AND UNSAFE. UPON AUDI'S REFUSAL TO REPLACE THE PUMP I CALLED MY WARRANTY COMPANY TO PAY FOR THE REPLACEMENT OF THE FUEL PUMP. CONTINENTAL WARRANTY REFUSED TO PAY FOR THE REPLACEMENT PUMP. THE REASONING BEHIND THEIR DECISION IS THAT THE PUMP MUST HAVE COMPLETE FAILURE BE FORE THEY WOULD HONOR MY WARRANTY. AM I SUPPOSED TO STALL AT A RAILROAD CROSSING OR HIGH SPEED INTERSECTION BEFORE THE CAR IS CONSIDERED NON-DRIVABLE? *TR",
        "vin": "WAUAC48H03K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/27/2010",
        "dateOfIncident": "06/12/2008",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302560,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FORGOT TO INSTALL C CLIP ON TEMP SENSOR ON RADIATOR HOSE WHICH POPPED OUT CAUSING MAJOR ENGINE DAMAGE AND BLOWN HEAD GASKET WHICH WAS DENIED FOR MANY MONTHS.  IN OCT. 08 THEY FORGOT TO TIGHTEN BRACKET WHICH CAUSED WIRES TO SMOKE AND FIRE.AUG 08-TRIMMED SERPENTINE BELT RATHER THAN REPLACED AND CAR STOPPED RUNNING IN MIDDLE OF INTERSTATE.  SEPT 09 REPLACED OIL PAN BUT FORGOT TO PUT PLUG BACK OCT 08 OIL RESIDUE ON DAMPER THEY THREW OUT AND DID NOT REPLACE.  THEY FORGOT TO PUT BOLTS BACK ON SUB FRAME AND MIRACLE I WAS NOT KILLED. THIS CAUSED AXLE PROBLEMS. WHEN THEY REPLACED BOLTS THEY DID NOT HAVE BUSHINGS IN STOCK AND THEY RELEASED CAR WITHOUT THESE BUSHINGS WHICH IS A SAFETY VIOLATION. WHEN BUSHINGS CAME IN THEY REFUSED TO WORK ON OUR VEHICLE AND WE HAD TO GO TO DIFFERENT MECHANIC.  THEY TOLD US WE NEEDED TIMING BELT WHEN THE HEADGASKET WAS BLOWN. NOW THERE IS NEW RECALL FOR COIL PACKS AND THEY REFUSE TO WORK ON OUR CAR. THE NEW GM IS LISTENING TO THE SERVICE MGR. WHO IS NOT TELLING THE COMPLETE STORY NOR IS THE NEW GM REVIEWING THE FACTS. OUR LIVES ARE IN DANGER WITH THIS VEHICLE AND SINCE WE STILL OWE $15K WE CANNOT TRADE IT IN. STARTED JUNE 2008 AND CONTINUES UNTIL TODAY.  COIL PACKS WHICH WERE JUST RECALLED ARE CAUSING CAR NOT TO RUN AND WE ARE STUCK *CW",
        "vin": "WAULC68E03A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/17/2010",
        "dateOfIncident": "01/17/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10300047,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI-A4-SEDAN-CVT TRANSMISSION. SLIPPING GEAR WHILE VEHICLE IS MOVING AND BEGINNING DRIVE FROM STOPLIGHT. SAFETY CONCERN FOR FAMILY. HISTORY OF A PROBLEM AND NO RECALL BY AUDI. HOW CAN THERE BE NO RECALL.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/04/2010",
        "dateOfIncident": "01/04/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10298174,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FALKEN TIRE CORPORATION",
                "productMake": "FALKEN",
                "productModel": "FALKEN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY COMPLAINT IS AGAINST FALKEN TIRE AND DISCOUNT TIRE DIRECT REGARDING A TIRE SOLD AS THE FALKEN ZIEX ZE-912.  THIS TIRE IS BEING SOLD AS AN ALL-SEASON TIRE.  IT IS IN FACT A SUMMER TIRE.  THE TIRE HAS ABSOLUTELY NO TRACTION IN THE SNOW AND SINCE I PURCHASED THE TIRES I HAVE BEEN IN AT LEAST THREE CIRCUMSTANCES WHERE I COULD NOT SAFELY STOP MY VEHICLE.  I UNDERSTAND THE DIFFERENCE BETWEEN ALL-SEASON AND WINTER TIRES, BUT I HAVE PURCHASED ALL-SEASON TIRES BEFORE THAT OFFER SAFE BRAKING PERFORMANCE IN SNOW AND SLUSH CONDITIONS.  I AM COMPLAINING AGAINST DTD AS A MAJOR RESELLER OF TIRE PRODUCTS BECAUSE THEY MARKET THIS TIRE AS AN ALL SEASON PRODUCT NEGLECTING THEIR RESPONSIBILITY TO THE BUYING PUBLIC OF OFFERING SAFE PRODUCTS. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/16/2009",
        "dateOfIncident": "09/21/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296115,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 9/21/2009, MY CAR WAS DIAGNOSED WITH A FUEL PUMP FAILURE CAUSING A CONSTANT MOANING NOISE BY THE KEYS AUDI DEALERSHIP SERVICE IN VAN NUYS.  I WAS TOLD THAT THE FUEL PUMP IS INCREASINGLY FAILING TO DISTRIBUTE THE FUEL INTO THE ENGINE AND WILL EVENTUALLY STOP FULLY FUNCTIONING.      IN SEARCH OF MORE INFORMATION ON THE DIAGNOSIS, I HAVE FOUND A RECALL REPORT ON CERTAIN VEHICLES MATCHING MY CAR MODEL, YEAR, AND ENGINE TYPE WITH SIMILAR PROBLEMS THAT COULD PRESENT A RISK OF CRASH.  HOWEVER, AUDI DENIED THAT MY CAR IS QUALIFIED FOR THE REPLACEMENT OF THE FUEL PUMP FREE OF CHARGE.  I AM, ON THE OTHER HAND , SUSPICIOUS OF NEGLIGENCE ON THE PART OF AUDI IN FULL COMPLIANCE FOR A RECOVERY OF SUCH A VITAL DEFECT THAT CAUSE A STOPPAGE A BLOOD FLOW, IN ESSENCE, IN TO A HIGHLY REGARDED AUDI ENGINE WHICH FALSELY RELIED UPON BY THE UNFORTUNATE LOYAL AUDI CUSTOMERS LIKE ME.     I STRONGLY BELIEVE THAT MY CASE DESERVES A FURTHER INVESTIGATION.  I HOPE THAT MY COMPLAINT WILL BRING LIGHT TO THE PROBLEM THAT OTHER DRIVERS LIKE ME CAN BENEFIT AND LET THE BLOOD FLOW SAFELY AGAIN. *TR    THANK YOU.",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/04/2009",
        "dateOfIncident": "12/04/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294534,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 A4 CONVERTIBLE AUDI.  I HAVE BEEN RESEARCHING PROBLEMS I HAVE BEEN EXPERIENCING, AND HAVE FOUND THAT MANY PEOPLE ARE HAVING THE SAME TRANSMISSION ISSUES.  THE PROBLEM IS IN THE TRANSMISSION CONTROL UNIT.  THE RANGE SWITCH TELLING THE TRANSMISSION WHICH GEAR TO GO INTO GOES OUT.  THE DANGEROUS SYMPTOMS INCLUDE AN INABILITY TO GO INTO REVERSE, THE CAR NOT ACCELERATING WHEN THE GAS IS PRESSED AND THEN LUNGING FORWARD.  WHEN THE CAR SLOWS TO A STOP, IT OFTEN DOESN'T SHIFT DOWN AND THE CAR LUNGES FORWARD BEFORE KILLING THE ENGINE.  THERE HAVE BEEN NUMEROUS REPORTS OF THIS PROBLEM, AND AUDI HAS BEEN UNWILLING TO ADMIT FAULT IN THE MANUFACTURING, AND/OR PROVIDE A SOLUTION.  THE FIX HAS COME AT A COSTLY $8K NEW TRANSMISSION. *TR",
        "vin": "WAUAC48H23K"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2009",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294036,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE APRIL 2009 (CARFAX WAS CLEAN)  REPLACED IGNITION COIL 2X BY SEPTEMBER 2009  REPLACED CLUTCH, RACK AND PINION, AND COMPUTER MODULE IN OCT 2009  CURRENTLY CATALYTIC CONVERTER IS MALFUNCTIONING    I HAVE NOT BEEN ABLE TO DRIVE THIS VEHICLE IN A CONSISTENT OPERATING CONDITION FOR MORE THAN 2 WEEKS AT A TIME.  I HAVE SPENT ALMOST $5,000 IN CAR REPAIRS TO DATE.  *TR",
        "vin": "WAULC68E73A"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/14/2009",
        "dateOfIncident": "08/10/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287320,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2003 AUDI A4 CONVERTIBLE IN NOVEMBER 2008 AND SINCE THEN THE DEFECTIVE CONVERTIBLE TOP HAS RESULTED IN THE REAR GLASS WINDOW TO BE NEARLY COMPLETELY LOOSE.  THIS IS A MAJOR HAZARD AND REPRESENTS A DANGER SINCE THE WINDOW COULD FALL OUT AND HURT OTHER PEOPLE.  AUDI OF SANTA MONICA SAID THEY CAN'T/WON'T FIX IT AND REFERRED ME TO AN UPHOLSTERY SHOP WHO SAID THEY HAVE SEEN THIS PROBLEM BEFORE AND CAN'T FIX IT (DESPITE AUDI RECOMMENDING THEM FOR FIXING THIS).  A DETAILED CHECK OF NUMEROUS ONLINE DISCUSSION BOARDS (IN THE U.S. AND GERMANY) SHOWS THAT THIS IS AN EXTREMELY COMING PROBLEM FOR 2003 AUDI CONVERTIBLES THAT AUDI SIMPLY REFUSES TO ACKNOWLEDGE.  2003 WAS THE FIRST YEAR THAT KARMANN MANUFACTURE THE ROOF AND, INTERESTINGLY, HARMANN IN GERMANY SEEMS TO ACCEPT SOME RESPONSIBILITY AND HAS FIXED THIS PROBLEM FOR SOME PEOPLE, CHARGING ONLY FOR LABOR.  I STRONGLY RECOMMEND THAT NHTSA LOOK INTO THIS FAULTY MANUFACTURING ISSUE AND FORCE AUDI TO ACCEPT RESPONSIBILITY FOR IT. *TR",
        "vin": "WAUAT48H23K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/08/2009",
        "dateOfIncident": "10/08/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286773,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2003 AUDI A4.  WHILE APPROACHING A TRAFFIC LIGHT AT 20 MPH THE VEHICLE ACCELERATED WITHOUT INTENTION.   AS A CONSEQUENCE SHE REAR-ENDED ANOTHER VEHICLE.  THE FRONT-END OF THE VEHICLE WAS DAMAGED.  THE VEHICLE WAS IN THE PROCESS OF BEING TOWED TO AN AUTHORIZED DEALER. THE FAILURE AND CURRENT MILEAGES WERE 49,000.",
        "vin": "WAULT68EX3A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/19/2009",
        "dateOfIncident": "09/18/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284578,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI A4 ON TWO DIFFERENT OCCASIONS HAS STARTED TO ACCELERATE TO HIGH SPEEDS ON IT'S OWN. THE FIRST TIME IT HAPPENED I WAS PULLING OUT AND I PUSHED THE GAS AND IT JUST STARTED TO PICK UP SPEED I PULLED OVER AND THEN TRIED TO PULL OUT AGAIN AND IT STARTED AGAIN TO PICK UP SPEED I NOTICED THE CRUISE CONTROL WAS ON AND SO I TURNED IT OFF AND THEN IT WAS FINE. THE SECOND TIME I WAS PULLING OUT AND PUSHED THE GAS TO SPEED UP AND AGAIN IT STARTED TO ACCELERATE VERY FAST AND SO I PULLED OVER AGAIN AND THOUGHT I MUST OF HIT IT INTO SPEED CONTROL AGAIN, BUT THIS TIME WITH CRUISE CONTROL OFF IT STILL CONTINUED TO ACCELERATE AND IT WAS HARDER TO GET THE CAR TO STOP I HAD TO PUSH THE BRAKE PEDAL REALLY HARD AND I THOUGHT IT WASN'T GOING TO STOP. THEN WHEN I DID GET IT TO A COMPLETE STOP I PUT THE CAR IN PARK AND THE ENGINE CONTINUED TO REV, AS IF I WERE PUSHING THE GAS PEDAL. THIS COULD HAVE EASILY RESULTED IN A CRASH. IF IT WERE IN THE WINTER MONTHS I WOULD HAVE CRASHED, AND I HAD MY ONE YEAR OLD BOY WITH ME THIS WAS VERY FRIGHTENING FOR BOTH OF US.   *TR",
        "vin": "WAULC68E63A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/20/2009",
        "dateOfIncident": "08/19/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281162,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1. NORMAL DRIVING IN SUBURBAN CONDITIONS - APPROXIMATE SPEED BETWEEN 20MI/HR - 30MI/HR  2. SUDDEN LOSS OF ENGINE POWER AND SUBSEQUENTLY ENGINE RUNS ROUGH  3. IGNITION COILS REPLACED BY AUDI DEALER. *TR",
        "vin": "WAULC68E93A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/19/2009",
        "dateOfIncident": "08/11/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10281120,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE CONVERTIBLE TOP ON 2003 AUDI A4 HAS RESULTED IN THE REAR GLASS WINDOW TO BECOME LOOSE. I'M VERY CONCERNED THAT THE WINDOW WILL FLY OFF. BASED ON ON-LINE POSTINGS, THIS IS A VERY, VERY COMMON OCCURRENCE. TO DATE, AUDI NOR ANY GOVERNMENT AGENCY HAS DONE ANYTHING TO RECTIFY THE FAULTY MANUFACTURING ISSUE. *TR",
        "vin": "WAUAT48H23K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/22/2009",
        "dateOfIncident": "08/14/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277932,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  THE CONTACT NOTICED WATER IN THE FOOT WELLS ON BOTH THE DRIVER'S AND PASSENGER SIDE OF THE VEHICLE.  WHEN HE STARTED THE VEHICLE, THE ELECTRICAL SYSTEM WENT HAYWIRE.  THE DEALER STATED THAT THE ELECTRONIC CONTROL MODULE WAS FLOODED DUE TO CLOGGING OF THE INTAKE PLENUM DRAIN GROMMET.  THE CONTACT WAS ADVISED TO HAVE IT CLEANED IN ORDER TO PREVENT FUTURE FAILURES.  THE MANUFACTURER STATED THAT THERE WAS NO RECALL FOR HIS YEAR, MAKE, AND MODEL VEHICLE.  THE CURRENT MILEAGE WAS APPROXIMATELY 37,000 AND FAILURE MILEAGE WAS 31,342.      UPDATED 8/7/09 *CN  UPDATED 08/11/09.*JB",
        "vin": "WAULC68E43A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/15/2009",
        "dateOfIncident": "07/18/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273837,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW CAME UNGLUED AND COULD NOT BE REPAIRED ON MY 2003 A4 CABRIOLET. AUDI DEALER REPLACED TOP. MY COST WAS 4000.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "04/07/2009",
        "dateOfIncident": "03/04/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264434,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HI, I AM AN OWNER OF AN AUDI A4 2003. I AM NOT TOO SURE IF ITS THE \"RIGHT PLACE\" TO COMPLAINT ABOUT MY CAR'S SAFETY. MY CAR'S  HEADLIGHTS ARE GOING OUT THE WHOLE TIME WHILE I AM DRIVING AND I HAVE TO RESET THEM BY TURNING THE SWITCH OFF AND THEN BACK ON IN ORDER TO KEEP THEM WORKING FOR COUPLE MINUTES. AFTER SOME MINUTES THE SAME PROCEDURE. I WENT TO AN AUDI DEALER AND THEY WONT \"REPRODUCE\" THE ERROR. THEY SAY THAT ONCE WE CONNECT IT TO OUR DATABASE AND WE READ NO ERROR THERE IS NOTHING WE CAN DO. I LOOKED INTO IT (ONLINE) FOR COUPLE WEEKS NOW AND I READ THE SAME STORIES OVER AND OVER AGAIN FROM PEOPLE THAT THEY OWN CARS FROM YEARS 2000- 2006 . THEY SAID THEY CONTACT AUDI AND AUDI IGNORES THEM. THAT'S WHY I AM COMING TO YOU. IT IS SO DANGEROUS THE LIGHTS TO GO OUT WHILE WE RE DRIVING AND YET NOBODY CAN HELP US TO SOLVE THE PROBLEM. THANK YOU IN ADVANCE. *TR",
        "vin": "WAULT68E33A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2009",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264049,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REFERENCE: NHTSA CAMPAIGN ID NUMBER: 07V375000 & 06V017000     I HAVE AN AUDI A4 AND IT EXPERIENCED A \"PULL BACK/STALLING\" ISSUE ABOUT A YEAR AGO WHEN MY WIFE AND DAUGHTER WERE ON A TRIP TO VISIT A COLLEGE IN ARKANSAS.  THIS HAPPENED ON A BUSY ROAD THAT IS HEAVILY TRAVELED BY COMMERCIAL TRUCKS. THE CAR WAS TOWED FROM OKLAHOMA TO PLANO TEXAS TO AN AUDI DEALERSHIP. THEY PUT THE CAR THROUGH A DIAGNOSIS AND NOTHING WAS FOUND.  THIS PROBLEM RECURRED THIS WEEK ON APRIL 1, 2009.  INSTEAD OF TAKING IT TO AUDI, I TOOK IT TO A LOCAL SERVICE REPAIR SHOP. THE MECHANICS/TECHNICIANS THERE STATED THE ISSUE WAS THE FUEL PUMP CALLED OUT THE RECALLS MENTIONED ABOVE.  WHEN I RESEARCHED THESE RECALLS THE VEHICLES COVERED WERE ONLY THOSE MANUFACTURED THROUGH APRIL OF 3003.  SEE BELOW:  HTTP://NHTHQNWWS111.ODI.NHTSA.DOT.GOV/ACMS/DOCSERVLET/ARTEMIS/PUBLIC/RECALLS/2007/V/RCDNN-07V375-5676.PDF    MY AUDI WAS MANUFACTURED IN MAY OF 2003 SO THEREFORE NOT COVERED.  IF THEY DID NOT \"CHANGE OUT\" OR SOMEHOW CORRECT THE IDENTIFIED SYSTEM THEN A SAFETY ISSUES STILL EXISTED IN THE CAR AND SHOULD HAVE BEEN COVERED UNDER THE RECALL. ADDITIONALLY, I AM CONCERNED FOR OTHER DRIVERS THAT MIGHT PUT THEMSELVES AT RISK IN MERGING ONTO FREEWAYS OR OTHERWISE REQUIRING A STABLE ACCELERATION WHEN MANEUVERING THE VEHICLE. *TR",
        "vin": "WAUJC68EX3A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,EXTERIOR LIGHTING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2009",
        "dateOfIncident": "06/06/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255267,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ACCESSORY DIST., INC.",
                "productMake": "ACCESSORY",
                "productModel": "HELMET",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "FUEL PUMP FAILED, IGNITION COILS HAVE ALL BEEN REPLACED TWICE. *TR",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/14/2009",
        "dateOfIncident": "09/08/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255036,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A 2003 AUDI A4 1.8T, WHICH I BOUGHT AS A CERTIFIED PRE-OWNED VEHICLE.  I'VE HAD A SLEW OF PROBLEMS WITH THIS LOW-QUALITY VEHICLE FROM THE GET-GO, BUT THAT'S A WHOLE OTHER STORY.  UPON TAKING MY CAR TO THE DEALERSHIP (AUDI CHANDLER IN CHANDLER, AZ) FOR A SEPARATE PROBLEM, THEY TOLD ME THAT THEY WOULD CONDUCT A FREE INSPECTION ON MY TIMING BELT SINCE THEY WERE REQUIRED TO DO SO.  AND GUESS WHAT?  SURPRISE, SURPRISE, MY CAR WAS SUPPOSEDLY ONE OF THOSE WITH THE KNOWN FAULTY TIMING BELT.  KEEP IN MIND THIS CAR IS UNDER THE \"CERTIFIED\" PRE-OWNED WARRANTY, BUT FOR SOME REASON, THIS WAS CHALKED TO WEAR AND TEAR.  MY CAR ONLY HAD 62K MILES ON IT, AND THE OEM RECOMMENDS INSPECTION AT 80K MILES AND REPLACEMENT AT 108K MILES.  TO AVOID A POSSIBLE FUTURE ACCIDENT (I HAVE SMALL CHILDREN), I HAD TO COUGH UP $1000 TO REPLACE THE BELT, TENSIONERS, WATER PUMP, ETC.  I SUBMITTED A REIMBURSEMENT FORM FOR MY EXPENSES TO THE FIRM HANDLING THE CLASS ACTION LAWSUIT AGAINST AUDI/VOLKSWAGEN ABOUT FAULTY TIMING BELTS.  THE SETTLEMENT WAS SUPPOSED TO HAVE BEEN MADE ON 11/4/08, BUT IT'S NOW IN THE MIDDLE OF JANUARY 2009, AND NOTHING.  I AGREE WITH SOMEONE ELSE WHO POSTED ONLINE BEFORE...WHY DO THESE OEM'S HAVE TO WAIT UNTIL SOMEONE GETS BADLY HURT OR DIES UNTIL THEY ADMIT RESPONSIBILITY FOR THEIR FAULTY, DEFECTIVE PIECES OF JUNK THAT ARE WAY OVERPRICED??  PLUS, IF MY CAR WAS TRULY A CERTIFIED PRE-OWNED VEHICLE, WOULDN'T AUDI HAVE DISCLOSED THAT THE TIMING BELT WOULD BE FAULTY TO ME?  OR, HOW ABOUT REPLACING THE BELT PRIOR TO SELLING IT AGAIN???  NOTHING WAS DISCLOSED TO ME, AND THE CLASS ACTION LAWSUIT WAS OPENED IN 2002.  I AM STILL SEEKING REIMBURSEMENT, BUT KNOWING AUDI'S STANCE ON THEIR DEFECTIVE PARTS, THEY'LL JUST CHALK IT UP TO WEAR AND TEAR AND WISH ME A GOOD DAY.  WHAT'S WORSE, AUDI SOLD A MILLION CARS IN 2008, WHICH SET ANOTHER SALES RECORD FOR THEM.  HOW CAN WE GET THE WORD OUT TO NOT BUY AUDI AND BUY A QUALITY CAR?????!! *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/10/2009",
        "dateOfIncident": "01/09/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254459,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WARNING LIGHT ON DASHBOARD COMES ON SAYING \"LEFT HEADLIGHT DIPPED\" LIGHT DOES NOT WORK, CHANGED LIGHTBULBS AND CHECKED FUSE. SAW SEVERAL OTHER COMPLAINTS ABOUT THE SAME PROBLEM. *TR",
        "vin": "WAULC68E13A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2009",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254229,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THE VEHICLE IN SEPTEMBER 2002.  IN OCTOBER 2003, THE TRANSMISSION SUFFERED A MASSIVE FAILURE AND REQUIRED A COMPLETE REPLACEMENT UNDER WARRANTY.  AROUND JULY 2007 THE CHECK ENGINE LIGHT CAME ON AND THE \"PRND\" INDICATOR ON THE DASHBOARD STARTED FLASHING.  CHAMPION AUDI IN POMPANO BEACH, FLORIDA DIAGNOSED THE PROBLEM AS A DEFECTIVE TRANSMISSION CONTROL MODULE (TCM).  DESPITE MY DEMANDS, THE AUDI DEALER REFUSED TO FIX THE DEFECTIVE PART, AND WANTED TO CHARGE ME UPWARDS OF $2500 TO REPLACE THE TCM.  MY INDEPENDENT (AND AAA APPROVED) REPAIR FACILITY RECENTLY CONFIRMED THE TCM REQUIRES REPLACEMENT.      BOTTOM LINE:  THE TRANSMISSION COULD FAIL, AGAIN, AT ANY TIME.  THE TRANSMISSION HAS BEEN A PROBLEM FROM THE BEGINNING AND AUDI NEEDS TO STEP UP TO THE PLATE AND REPLACE THE TCM AT NO CHARGE.  MY RESEARCH INDICATES THAT TCM FAILURE IS A COMMON PROBLEM ON AUDIS.  AUDI IS AWARE OF THESE ISSUES YET REFUSES TO DO THE RIGHT THING.  *TR",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2008",
        "dateOfIncident": "11/24/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252033,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 AUDI A4 1.8 .  I WAS DRIVING MY CAR AND PULLED INTO A PARKING SPACE WHILE ADJUSTING MY CAR TO THE SPACE, THE ENGINE CUT OFF AND WHEN I TURNED THE KEY TO RESTART THE ENGINE NOTHING HAPPENED.  I HAD THE CAR TOWED TO THE DEALER ONLY TO BE TOLD IT WAS THE FUEL PUMP. WHEN I WAS TOLD THIS I IMMEDIATELY WENT ONLINE TO RESEARCH WHAT COULD CAUSE THIS ONLY TO DISCOVER THAT THERE WAS A RECALL ON THE FUEL PUMP. I CALLED THE NUMBER GIVEN FOR THE RECALL ONLY TO BE TOLD THAT MY CAR WAS NOT ONE ON THE RECALL LIST. I THEN WENT ON LINE TO CONSUMER AFFAIRS TO SEE IF THERE WAS ANY COMPLAINTS ABOUT THIS PROBLEM ONLY TO FIND THAT THERE WERE SEVERAL WITH FUEL PUMP COMPLAINTS AND WAS GIVEN THE SAME REASON. THE CAR COULD HAVE CUT OFF IN TRAFFIC OR WHILE I WAS DRIVING IF I DID NOT PULL INTO A PARKING SPACE, CREATING A SAFETY HAZARD OR CAUSING AN ACCIDENT. I BELIEVE THIS IS UNFAIR TO SELL DEFECTIVE PARTS, HAVE A RECALL AND REFUSE TO ACKNOWLEDGE THE PROBLEM EXISTS IN OTHER MODELS OTHER THAN WHAT THEY HAVE LISTED.  THAT REPAIR COSTS ME $768.00, I SHOULD AND SO SHOULD THE OTHER COMPLAINANTS BE REIMBURSED FOR THIS DEFECT BY AUDI., WHY DOES SOMEONE HAVE TO DIE OR BE SERIOUSLY INJURED BEFORE THESE MANUFACTURERS ACKNOWLEDGE DEFECTS.  SAME PROBLEM WITH THE IGNITION COILS, I REPAIRED THE FIRST IGNITION COIL, THEN THE SECOND ONE WENT BAD, IT WAS RECOMMENDED THAT I CHANGE ALL, PULLED UP THIS INFO ON CONSUMER AFFAIRS, AGAIN THERE WAS A DEFECT WITH THIS PART. CONSUMERS ARE BEING RIPPED OFF AND NO ONE SEEMS TO CARE. *TR",
        "vin": "WAUJC68E93A"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/04/2008",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10250717,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD NUMEROUS PROBLEMS WITH MY A4.  FIRST, MY HEADLIGHT SHORTED OUT AND COST OVER $600 BECAUSE IT FRIED ALL THE ELECTRICAL WIRES AND I HAD TO GET A NEW HEADLAMP SETTING AND WIRES.  EVEN AFTER REPLACING THE COMPUTER HAS A LIGHTBULB SIGNAL LIGHT THAT IT IS NOT SENDING THE CORRECT AMPAGE.   THE POWER STEERING LEAKS CONTINUOUSLY AND MAKES NOISES ALSO.  THE CHECK ENGINE LIGHT HAS CAME ON AND THE MOTOR IS RUNNING VERY BUMPY LIKE ALMOST LIKE IT IS MIS-FIRING OR SOMETHING.  AND LAST BUT NOT LEAST, THE TRANSMISSION IS NOT RUNNING CORRECTLY.  WHEN I PUT IT INTO REVERSE IT STALLS AND WILL NOT GO.  I PUT IT IN TO NEUTRAL, THEN REVERSE AGAIN AND IT SLOWLY CATCHES SOMETIMES.  NOW THE CHECK ENGINE LIGHT IS FLASHING AND I HAVE HAD MY CAR SITTING FOR A FEW DAYS AFTER ALL THIS SUDDENLY APPEARED.  I AM SAVING MONEY TO TRY TO GET THIS FIXED.  I AM AFRAID THAT THE ENGINE WILL STALL OR I WONT BE ABLE TO TURN DUE TO THE STEERING AND CRASH SO IT IS INOPERABLE AT THIS TIME. *TR",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/19/2008",
        "dateOfIncident": "09/11/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246045,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ADHESIVE WHICH HOLDS IN THE REAR WINDOW ON MY 2003 AUDI A4 3.0 CONVERTIBLE  CAME UNGLUED, RESULTING IN THE WINDOW GRADUALLY FALLING AWAY FROM THE ROOF.  I HAD TO DUCT TAPE IT IN AS I DIDN'T WANT IT POPPING OUT COMPLETELY WHILE DRIVING, AND TO PREVENT RAIN  / MOISTURE FROM GETTING IN.  THIS COULD BE A SERIOUS DRIVING HAZARD SHOULD IT DISLODGE WHILE OPERATING. FYI, THE CAR HAD BEEN BABIED SINCE DAY ONE;  GARAGE KEPT AND HAND WASHED.   AUDI OF AMERICA DID FINALLY AGREE TO PAY FOR A NEW TOP (ABOUT 6K RETAIL) BUT COULD NOT TELL ME IF THE NEW TOP HAD DIFFERENT ADHESIVE (I DON'T WANT A REPEAT OF THIS CIRCUMSTANCE A FEWS YRS DOWN THE LINE).  I RESEARCHED THIS, AND THERE ARE SEVERAL OTHER OWNERS W/ THIS PROBLEM.  MOST CARS WERE 03'S AT ABOUT 40-50K MILES.  IN MY OPINION, AUDI NEEDS TO ACKNOWLEDGE THERE WAS A DEFECT W/ THE ADHESIVE AND OFFER REPLACEMENT AT N/C.  IF YOU HAVE AN A4 OR S4 CONVERTIBLE, MONITOR WHERE THE GLASS FITS IN THE TOP. LISTEN FOR A \"FLAPPING\" NOISE AT HIGHWAY SPEEDS.  THE MAIN MECHANIC SAID IN ADDITION THE ADHESIVE COMING UNDONE, THERE ALSO APPEARED TO BE SHRINKAGE OF THE TOP.  I DO NOT KNOW, FROM AN ENGINEERING STANDPOINT, IF THE SHRINKAGE WAS THE MAIN PROBLEM (I.E, THE \"PULLING AWAY\" FROM THE TOP) OR IF IT WAS A COMBINATION OF BOTH PROBLEMS THAT CULMINATED IN THE END RESULT.  REGARDLESS, AUDI NEEDS TO ADDRESS THIS BEFORE THERE IS A SERIOUS PROBLEM W/ THE WINDOW FLYING OUT AT FREEWAY SPEEDS. *TR",
        "vin": "WAUAT48HX3K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/29/2008",
        "dateOfIncident": "09/06/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243933,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HELLO    A RECALL NOTICE CAME IN FOR MY 03' AUDI A4 FOR ETC SENSOR.(70K MILES) TOOK THE CAR INTO DEALER GOT IT FIXED.   A WEEK LATER OR SO CHECK ENGINE LIGHT CAME ON AND CAR WAS DEAD IN ITS TRACKS.  ACCORDING TO THE DEALER AND TWO MECHANICS SHOPS, ITS THE TRANSMISSION.        DEALER PRICE ON TRANSMISSION WAS 7,558.00 TOTAL. OWE MY GOODNESS...... CAR IS WORTH ABOUT THAT.  SINCE THEN I HAVE BEEN TRYING TO LOCATE A USED OR A REBUILD TRANSMISSION BUT THEIR IS NOT MUCH OF A DIFFERENCE IN PRICE BECAUSE THE TRANSMISSION IS SO HARD TO FIX AND PARTS ARE VERY EXPENSIVE THAT NO ONE WANTS TO DEAL WITH THE CAR AT ALL.  NOT TO MENTION THE DIFFICULTY THAT REQUIRES TO REPLACE THIS TYPE OF TRANSMISSION FOR MY VEHICLE MODEL.   SPECIAL TOOLS AND PROGRAMMING.  CALLED NEARBY STATES WITH NO LUCK FINDING A REBUILD TRANSMISSION. ALSO AUDI DOES NOT MAKE THEM ANYMORE, MAKING THEM EVEN HARDER TO FIND.    I HAVE BEEN SEARCHING ON THE INTERNET FOR THE PAST 3 WEEKS TRYING TO FIND SOME INFORMATION ON THIS TYPE OF VEHICLE AND THE TRANSMISSION PROBLEM AND I CAME ACROSS THE SAME STORY FROM MANY AUDI A4 OWNERS.  THIS IS NOT  A DRIVER PROBLEM BUT A DESIGN FLAW.       TRANSMISSION IS NOT FIXED BECAUSE I CAN'T AFFORD 7.5K FOR A NEW ONE THAT WILL GIVE OUT IN ABOUT 50K AGAIN.   THIS IS NOT RIGHT AND SOMETHING SHOULD BE DONE ABOUT THIS.      WHEN THE CAR STARTED TO SHAKE TREMENDOUSLY  IN THE MIDDLE OF TURNING ONTO A RAMP TO ENTER THE HIGHWAY  I COULD OF CAUSE AN ACCIDENT EASILY.      THROUGH OUT BLOGS AND WEBSITE ADVICE, THEIR ARE COUNTLESS NUMBER OF PEOPLE WITH THE SAME PROBLEM.  THE TRANSMISSION SEEMS TO GIVE OUT RIGHT ABOUT 50-85K MILES.     I HOPE YOU CAN HELP. *TR",
        "vin": "WAUJC68E13A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/10/2008",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241713,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI A 4 CONVERTIBLE HEADLIGHT LENSES DETERIORATED SO BADLY THAT IT SIGNIFICANTLY AFFECTED MY NIGHT DRIVING.  PLASTIC BECAME CLOUDY (NOT CONDENSATION) AND GRAY, ADVERSELY AFFECTING THE HEADLIGHT EFFECTIVENESS.  *TR",
        "vin": "WAUAT48H23K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/04/2008",
        "dateOfIncident": "08/28/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240957,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 AUDI A4 3.0 CABRIOLET WITH 38,000 MILES ON IT.  THE GEAR DISPLAY BEGAN TO BLINK FREQUENTLY AND THE MANUAL SHIFTING FUNCTIONALITY WOULD NOT WORK.  ADDITIONALLY, THE TRANSMISSION WOULD NOT ENGAGE WHILE IN REVERSE ON SEVERAL OCCASIONS.  THE DEALERSHIP INFORMED ME THAT THE TRANSMISSION CONTROL MODULE (TCM) NEEDED TO BE REPLACED AT A COST OF $2,400.  AFTER RESEARCHING, I HAVE SEEN MANY SIMILAR COMPLAINTS AND  FEEL THIS MAY BE DUE TO A MANUFACTURING DEFECT, GIVEN LOW RELATIVE MILES ON THE VEHICLE. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/27/2008",
        "dateOfIncident": "05/12/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239923,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8/1/07 I PURCHASED A 2003 AUDI A4 WITH A 1.8T ENGINE FROM A LOCAL USED CAR DEALERSHIP.  IN MAY, 2008, THE OIL LIGHT CAME ON, WE HAD A QUALIFIED MECHANIC CHECK THE VEHICLE THOROUGHLY AND NO PROBLEMS WERE FOUND.  2 DAYS LATER, THE ENGINE COMPLETELY SHUT DOWN AND THE VEHICLE HAS BEEN INOPERABLE SINCE THAT TIME.  I HAVE CONTACTED AUDI IN REGARD TO THIS SINCE IT IS DUE TO A MANUFACTURING DEFECT THAT CAUSES SLUDGE IN THE OIL PAN TO RECIRCULATE THROUGH THE ENGINE, WHICH IS WHAT LED TO THE ENGINE FAILURE.  THE OIL RETURN PORTS WERE NOT MADE LARGE ENOUGH TO RECIRCULATE THE OIL PROPERLY.  I HAVE BEEN TOLD THAT SINCE I PURCHASED IT AS A USED VEHICLE, \"AS IS\", THERE IS NOTHING THAT THEY WILL DO TO ASSIST ME IN THIS SITUATION.  I WAS NEVER MADE AWARE OF THIS PROBLEM WHATSOEVER PRIOR TO THE ENGINE FAILURE AND REPLACING THE ENGINE WILL COST IN EXCESS OF $5000.  THEY HAVE NEVER ISSUED A RECALL ON THESE VEHICLES, EVEN THOUGH THEY ARE AWARE OF THE PROBLEM.  THEY OFF AN \"EXTENDED WARRANTY\", BUT TO QUALIFY THE VEHICLE OWNER MUST PROVE THAT ALL SCHEDULED MAINTENANCE ON THE VEHICLE WAS PERFORMED BY AUDI CERTIFIED MECHANICS.  AS A 2ND OWNER, I HAVE NO PRIOR RECORDS FROM 8/1/07 AND PREVIOUS.  THE \"EXTENDED WARRANTY\" COVERS 200-2004 A4 MODELS WITH THE 1.8T ENGINES, SO OBVIOUSLY THEY ARE AWARE OF THE DEFECT, BUT THEY HAVE NEVER RECALLED THEM.  DO I HAVE ANY OTHER RECOURSE OTHER THAN TO FILE SUIT AGAINST THEM? *TR",
        "vin": "WAUAC48H93K"
    },
    {
        "components": "VISIBILITY,STRUCTURE,SEATS",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238628,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A 2003 AUDI A4 CABRIOLET IN 2005.  6 MONTHS LATER, REAR WINDOW IN 2003 AUDI A4 DETACHED FROM CONVERTIBLE TOP CAUSING REAR LEATHER SEAT TO ROT AND TEAR DUE TO RAIN WATER LEAKING THROUGH THE DETACHED WINDOW.  TRIED TO HAVE THE WINDOW REATTACHED BY AN AUDI DEALERSHIP REFERRED DETAILING COMPANY, ADHESIVE DID NOT HOLD AND I WAS TOLD THE CAR WOULD NEED A NEW ROOF.  THE DEALERSHIP I BOUGHT THE CAR FROM, DON ROSEN AUDI OF CONSHOHOKEN, PA NOR AUDI WILL TAKE ANY RESPONSIBILITY FOR THE DETACHED WINDOW OR PROVIDE PAYMENT FOR REPAIRS.  *TR",
        "vin": "WAUAT48HX3K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/30/2008",
        "dateOfIncident": "07/29/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236367,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4.  1.8 L TURBO.     WHILE IN TRAFFIC FUEL PUMP FAILED AND CAR STALLED. AUDI HAS ISSUED PREVIOUSLY A RECALL FOR FUEL PUMPS IN 2003 A4S. HOWEVER, I WAS TOLD PRODUCTION DATE ON MY CAR IS OUTSIDE OF DATE RANGE OF RECALL. DATE RANGE SHOULD BE EXPANDED.  RECALL INFORMATION IS PROVIDED BELOW.    RECALL DATE:  AUG 28, 2007     MODEL AFFECTED:  2003 AUDI A4     SUMMARY:  ON CERTAIN VEHICLES EQUIPPED WITH 1.8L TURBO, 2.8L V6, OR 3.0L ENGINES, A CHANGE IN THE ELECTRICAL MOTOR COMPONENTS IN THE FUEL PUMP CAN LEAD TO AN INOPERATIVE FUEL PUMP AND, ULTIMATELY, STOPPAGE OF FUEL SUPPLY TO THE ENGINE CAUSING IT TO STALL.     CONSEQUENCE:  IF FUEL FLOW TO THE ENGINE IS INTERRUPTED, THE VEHICLE COULD STALL WITHOUT WARNING AND THUS PRESENT A POTENTIAL RISK OF CRASH.     REMEDY:  DEALERS WILL INSTALL NEW FUEL PUMPS FREE OF CHARGE. THE RECALL BEGAN ON SEPTEMBER 28, 20007. OWNERS MAY CONTACT VW AT 1-800-222-8987 OR AUDI AT 1-800-822-2834. THIS RECALL IS A SUPPLEMENT TO A PREVIOUS CAMPAIGN (PLEASE SEE 06V017). *TR",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "07/13/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234847,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE BOX FLOODS AFTER DRIVING THROUGH LONG DISTANCES IN HEAVY RAIN.  RESULTS IN CAR THAT WILL NOT RUN AT ALL (NEEDED TO BE TOWED)  DIAGNOSIS IS THAT THE ENGINE BOX FLOODS FROM INSUFFICIENT DRAINAGE FROM THE COWL WHICH THEN SHORTS OUT THE ENGINE CONTROL MODULE AND TRANSMISSION CONTROL MODULE (BASICALLY THE CAR'S COMPUTER CENTER)   THIS IS THE SECOND TIME THIS PROBLEM HAS OCCURRED (BOTH AFTER DRIVING THROUGH DIFFICULT RAIN STORMS)  THE FIRST TIME THIS HAPPENED WAS IN OCTOBER OF 2005, AND IT TOOK NEARLY 6 WEEKS TO DIAGNOSE AND REPAIR.  REPAIR WAS DONE BY AUTHORIZED AUDI DEALER THAT ORIGINALLY SOLD ME THE CAR.  THE FINAL BILL WAS NEARLY $5000.   THEY INSISTED IT WAS A FLUKE AND HAD ME MAKE AN INSURANCE CLAIM TO COVER THE REPAIRS AS FLOOD DAMAGE.  I MADE A FORMAL COMPLAINT TO AUDI AT THAT TIME SINCE IT IS CLEARLY A DESIGN FLAW.  (SOMEONE THE DEALER ACKNOWLEDGED TO ME THAT THEY HAD WITNESSED THIS BEFORE, EACH TIME TELLING THE CUSTOMER TO GO THROUGH THEIR INSURANCE TO COVER THE COST).  HERE I AM LESS THAN 3 YEARS LATER AND THE SAME EXACT THING HAPPENED THIS WEEKEND.  I DROVE THROUGH AN INTENSE RAINSTORM AND I HAVE A FLOODED ENGINE BOX.  THE BILL IS ONCE AGAIN GOING TO EXCEED $4000, NOT TO MENTION THE AMOUNT OF TIME THAT I WILL NEED TO RENT A CAR (AGAIN) TO CONDUCT MY BUSINESS.  I SELL REAL ESTATE AND DEPEND ON MY VEHICLE.    ONCE AGAIN I PHONED AUDI CUSTOMER CARE AND LODGED ANOTHER FORMAL COMPLAINT WITH THIS ISSUE AND THEY REFUSE TO ACKNOWLEDGE THIS DESIGN FLAW.  I AM CURRENTLY SEEKING LEGAL COUNCIL IN ORDER TO RECOUP THESE COSTS.  I HAVE BOTH COMPLAINTS WHICH ARE EXACTLY THE SAME FILED WITH AUDI.   I DO NOT HAVE THE FIRST SET OF PARTS, BUT I CAN CERTAINLY KEEP THE ONES THAT HAVE RECENTLY FAILED.  AT THIS POINT I DO NOT HAVE A CAR, I AM WAITING TO SEE IF MY INSURANCE COMPANY WILL AGAIN PAY FOR THIS CLAIM.  I TRULY BELIEVE THIS IS SOMETHING THAT AUDI NEEDS TO TAKE CARE OF AND ACKNOWLEDGE THE FLAW.  *TR",
        "vin": "WAUVT68E93A"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "04/13/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234291,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH 33,000 MILES ON THE VEHICLE: THE STANDARD ALLOY WHEELS CORRODE TO THE WHEEL HUB OVER A PERIOD OF 4 MONTHS. IF THE WHEEL IS NEEDED TO BE REMOVED E.G. FLAT TIRE OR CHANGE FROM WINTER WHEELS, IT WILL NOT COME OFF WITH NORMAL TOOLS AND CONDITIONS. THE CAR MUST BE ELEVATED ON A LIFT AND THE WHEEL POUNDED WITH EXTREME BRUTE FORCE TO REMOVE IT. THIS HAS HAPPENED TWICE TO ME. I FIND IT EXTREMELY UNSAFE THAT A FLAT TIRE CAN'T BE REPLACED WITHOUT HAVING A TOW TRUCK TAKE THE CAR TO A SHOP--JUST TO REMOVE THE WHEEL. THE AUDI TECHNICIAN SAYS THAT IF I USE BRAKE ANTI-SEIZE PRODUCT ON THE WHEEL/HUB JUNCTION IT MAY PREVENT IT. [MY QUESTION IS \"WHY DIDN'T THEY APPLY THIS IF THEY ALREADY KNEW IT WAS NEEDED].  *TR",
        "vin": "WAULC68E33A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/25/2008",
        "dateOfIncident": "06/20/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232289,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1.THE EVENTS LEADING UP TO THE FAILURE:    AUDI A4S HAVE AN INTAKE PLENUM DRAIN GROMMET LOCATED NEAR THE BATTERY; THIS FUNNEL IS KNOWN TO BECOME CLOG DUE TO DEBRIS AND GRIME.  THE DRAIN GROMMET ON MY VEHICLE BECAME CLOGGED SOME TIME AGO AND I DID NOT BECOME AWARE OF THIS PROBLEM UNTIL THE FUNNEL STOPPED WORKING AND ALLOWED WATER TO DRAIN INSIDE MY CAR.  THIS CAUSED MY COMFORT MODULE TO FAIL - MY POWER WINDOWS, POWER LOCKS, INTERIOR LIGHTS, KEYLESS REMOTE ENTRY, ALARM, TRUNK, BATTERY AND GAS TANK LID CEASED TO FUNCTION.    2.THE FAILURE, HOW OFTEN IT OCCURS, ITS CONSEQUENCES; AND,    AUDI OF AMERICA KNOWS ABOUT THIS PROBLEM.  THIS PROBLEM IS PRETTY COMMON IN THE 2003 AUDI A4'S.  IF YOU DO A SEARCH ABOUT IT ONLINE, MANY CONSUMERS ARE AFFECTED BY THIS CLOGGED DRAIN GROMMET.  UPON DOING MORE RESEARCH, I WAS SHOCKED TO LEARN THAT THE 2002 AUDI A4 MODELS HAD EXACTLY THE SAME PROBLEM, BUT HAD ITS VEHICLES RECALLED.    3.WHAT WAS DONE TO CORRECT THE FAILURE; I.E, PARTS REPAIRED OR REPLACED (AND IF OLD PART IS AVAILABLE)    I BROUGHT MY 2003 AUDI A4 TO THE DEALERSHIP (AUDI OF HAWAII) TO CORRECT THE PROBLEM, WHICH COST ME $1400.  THE TECHNICIANS REPLACED THE PLENUM GROMMET DRAIN, COMFORT MODULE, BATTERY, AND HAD TO CLEAN THE BOTTOM INTERIOR OF MY CAR WHICH WAS SATURATED WITH WATER, MOLD, AND MILDEW.  I ALSO WROTE A LETTER TO AUDI OF AMERICA AND AUDI OF HAWAII TO ADDRESS THIS PROBLEM TO OTHER 2003 AUDI A4 OWNERS SINCE IT WAS ADDRESSED FOR THE 2002 AUDI A4 VEHICLES.  THEIR REPLY WAS THAT SINCE IT HAD NOT BEEN 'FEDERALLY MANDATED' THEY WILL NOT HAVE A RECALL FOR THE 2003 AUDI A4.  *TR",
        "vin": "WAUJC68EX3A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/20/2008",
        "dateOfIncident": "06/19/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231675,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AT A STOPLIGHT YESTERDAY, THE CVT TRANSMISSION SUDDENLY FAILED.  WHEN I PRESSED THE ACCELERATOR, THE VEHICLE WOULD ONLY VERY SLOWLY LURCH FORWARD WITH A GREAT DEAL OF \"GRINDING\" NOISE.  I WAS BARELY ABLE TO LIMP OUT OF THE FLOW OF TRAFFIC AND THEN HAD IT TOWED TO MY SHOP.  MY MECHANIC TODAY TOLD ME THE CVT (CONTINUOUSLY VARIABLE TRANSMISSION) FAILED AND NEEDS REPLACEMENT. NEW, THE PART ALONE IS $7,500, WITH ANOTHER $1,000+ IN LABOR.  MY 2003 A4 HAS BEEN METICULOUSLY MAINTAINED SINCE NEW AND ONLY HAS 75,000 MILES.  I HAVE FOUND CONSIDERABLE \"TRAFFIC\" ONLINE REGARDING MAJOR PROBLEMS WITH AUDI CVT - BUT VERY LITTLE ON YOUR SITE.   THIS IS S A MAJOR DESIGN PROBLEM THAT CONSUMERS SHOULD BE MADE AWARE OF.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229027,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE SOMETIMES DOES NOT GO INTO REVERSE AND JUMPS FORWARD WHEN APPLYING BRAKES. THE P R N D LIGHTS FLASH ON THE DASHBOARD. THE DEALER SAYS IT NEEDS A TRANSMISSION CONTROL MODULE (TCM).   *TR",
        "vin": "WAUJC68E53A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/24/2008",
        "dateOfIncident": "05/29/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228829,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IGNITION COILS HAVE GONE OUT 2 TIMES ALREADY. FIRST INCIDENT HAPPENED ON MAY 29,2007, SECOND HAPPENED IN AUGUST OF 2007.  *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/25/2008",
        "dateOfIncident": "04/24/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225724,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE COIL PACK ON THE VEHICLE WAS DAMAGED (SHAKING UPON ACCELERATION). AFTER RESEARCHING THE INTERNET, I FOUND THAT 2001, 2002 AND BEGINNING OF 2003 AUDI A4S HAS BEEN RECALLED FOR THIS PART. WHEN I CALLED AUDI AMERICA, THEY SAID MY VIN NUMBER WAS NOT INCLUDED IN THIS RECALL. THE DEALERSHIP REPLACED THE COIL PACK AT A COST OF OVER $500.  *TR",
        "vin": "WAULT68E53A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/24/2008",
        "dateOfIncident": "04/21/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225561,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE OF RIGHT CV JOINT, BOOT BECAME DETACHED.  IN 1996 AUDI HAD TO ISSUE A RECALL FOR THIS EXACT PROBLEM.  I WAS TOLD IT WAS DUE TO ROAD HAZARD BUT UPON INSPECTION IT APPEARS TO BE A FAULTY CONNECTION.  I HAVE THE PART AND WANT TO KNOW IF TAKING PICTURES OF IT WILL HELP YOU ISSUE A RECALL ON THIS FAILURE.      THE BOOT FAILED AS A RESULT THE CV JOINT FAILS.  EVEN THOUGH I A HAVE AN EXTENDED WARRANTY THE COVERS THE PART, THEY ARE SAYING THEY WON'T COVER IT BECAUSE IT WAS DEMANGE RESULTING FROM ROAD HAZARD.  IT IS OBVIOUS THAT THIS IN NOT THE CASE THAT IT FAILED EITHER BECAUSE IT WAS INSTALLED IMPROPERLY AT THE FACTORY OR THE SEAL FAILED AS HAPPENED IN THE 1996 RECALL.   *TR",
        "vin": "WAUAC48H53K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2008",
        "dateOfIncident": "04/18/2008",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225471,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  WHILE DRIVING 38 MPH, THE CHECK ENGINE SOON LIGHT ILLUMINATED AND THE ENTIRE VEHICLE BEGAN SHAKING.  THE VEHICLE HAD TO BE TOWED TO THE DEALER, BUT HAS NOT YET BEEN DIAGNOSED.  THE CONTACT ALSO NOTICED SMOKE COMING FROM THE ENGINE COMPARTMENT.  HE CHECKED THE VEHICLE AND DISCOVERED AN ENGINE LEAK.  HE TOOK THE VEHICLE TO THE DEALER AND THEY INFORMED HIM THAT THE VEHICLE HAD BEEN REPAIRED; HOWEVER, THE CONTACT DOES NOT BELIEVE THAT ANYTHING WAS DONE TO THE VEHICLE.  AN INDEPENDENT MECHANIC STATED THAT THE SHAKING WAS DUE TO THE MOTOR MOUNT.  THE CURRENT AND FAILURE MILEAGES WERE 35,600.",
        "vin": "WAUJC68E43A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2008",
        "dateOfIncident": "03/21/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223380,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4 CABRIOLET.  WHILE DRIVING 40 MPH, THE VEHICLE MADE A BUMPING SOUND AS IF THERE WERE A FLAT TIRE.  WHEN THE CONTACT RELEASED THE ACCELERATOR PEDAL, THE VEHICLE DROVE SMOOTHLY.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER TEN TIMES FOR THIS FAILURE.  INITIALLY, HE WAS INFORMED THAT THE FAILURE COULD NOT BE DUPLICATED.  FINALLY, THE CONTACT WAS INFORMED OF NHTSA CAMPAIGN ID NUMBER 07V375000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP).  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT MILEAGE WAS 55,130 AND FAILURE MILEAGE WAS 54,000.",
        "vin": "WAUAC48H73K"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/31/2008",
        "dateOfIncident": "12/23/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222874,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A4 WINDSHIELD WASHER PUMP SUDDENLY DOES NOT WORK.  I BROUGHT THE VEHICLE TO THE DEALERSHIP AND I WAS TOLD THERE IS A KNOWN PROBLEM WITH THE WASHER PUMP AND IT HAPPENS FREQUENTLY.  HOWEVER, THERE ISN'T AN OFFICIAL RECALL SO THEY WILL NOT REPLACE IT.  IT WILL JUST KEEP RUINING THE FUSES UNLESS I BUY ANOTHER WASHER PUMP WHICH WILL ULTIMATELY JUST BREAK AGAIN... IF THIS IS A KNOWN PROBLEM AND A FREQUENT ISSUE WHY ISN'T THERE A RECALL?  *TR",
        "vin": "WAULT68E13A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/25/2008",
        "dateOfIncident": "03/21/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222247,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN MID-FEBRUARY, I PURCHASED A 2003 AUDI A4 FROM OVERLAND PARK JEEP IN OVERLAND PARK, KANSAS.  THE CAR WAS A ONE OWNER, VERY LOW MILEAGE (28,000)VEHICLE AT AN ATTRACTIVE PRICE.  AS A ONE INCOME FAMILY WITH A NEWBORN, THIS CAR HAD THE SAFETY AND LOOKS WE DESIRED.  ON THE DAY OF PICKUP, THE CAR'S TOP MALFUNCTIONED, AND IT WAS SENT TO MOLLE AUDI IN KC, MO FOR REPAIR.  WHILE THERE, I ASKED MOLLE TO RUN AN INSPECTION ON THE CAR TO DETERMINE IF I SHOULD KEEP IT.  THEY TOUTED THAT THEY SOLD THE CAR, AND HAD SERVICED IT.  MENTIONING THEY WERE THE ONLY AUDI DEALER REPAIR EXPERTS IN THE AREA, THEY GAVE IT A CLEAN BILL OF HEALTH.  I PICKED IT UP AFTER FIVE DAYS, AND OP JEEP PAID FOR THE ROOF REPAIR.  I PAID FOR THE INSPECTION.  ON THE 34TH DAY OF OWNERSHIP, THE TRANSMISSION SLIPPED.  I THOUGHT MAYBE THE CAR WAS COLD.  A COUPLE DAYS LATER, IT DID IT AGAIN.  I CONTACTED MOLLE, AND TOOK THE  CAR IN FOR SERVICE AGAIN.  NOW, THEY CLAIM THE CAR NEEDS A NEW TRANSMISSION AND THAT IT WILL COST OVER $7300.00.  OP JEEP STATES THAT SINCE IT IS PAST THIRTY DAYS, THEY \"DON'T KNOW WHAT I EXPECT THEM TO DO ABOUT IT\".  MOLLE SAYS IT IS JUST TOUGH LUCK.  IT WAS PERFECT A COUPLE HUNDRED MILES AGO?   THE ORIGINAL WARRANTY ON THE CAR WAS 4 YEARS/50,000 MILES.  SINCE THE CAR IS 10 MONTHS PAST THE TIME FRAME (ALTHOUGH 22,000 UNDER THE MILEAGE), THEY WON'T DO ANYTHING FOR ME, I JUST NEED TO PAY THE $7,300.00....WHICH I CANNOT DO?  AUDI USA HAS YET TO RESPOND, BUT CLAIMED THEY FOLLOW THE ADVICE OF THE SERVICE MANAGER, WHICH DIDN'T INDICATE THEY WOULD DO ANYTHING BUT FIX IT FOR $7,300.00.  I NEED THIS CAR FOR WORK, IT NEEDS TO BE SAFE FOR MY FAMILY, AND OUR NEWBORN SON.  IT SEEMS INCREDIBLY UNFAIR THAT I HAVE OWNED A ONE OWNER, VERY LOW MILEAGE CAREFULLY MAINTAINED CAR FOR JUST OVER ONE MONTH, AND JUST OVER 200 MILES, AND BE FACED WITH A $7,300. BILL ON A VEHICLE THAT COST $17,000.  OP JEEP MADE CLAIMS TO THE QUALITY AND INSPECTION OF THE CAR THAT WERE NOT TRUE.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/04/2008",
        "dateOfIncident": "12/08/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220594,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 WITH DEFECTIVE FUEL PUMP. CONSUMER STATES THAT MANUFACTURER TOLD HER THAT HER VEHICLE WAS NOT AFFECTED BECAUSE HER VIN WAS NOT INCLUDED IN THE RECALL. SHE STATED HER VEHICLE WAS MANUFACTURED WITHIN THE DESIGNATED TIME.  *KB  THE CONSUMER HAD OTHER MECHANICAL PROBLEMS WITH THE VEHICLE SUCH AS: FAULTY IGNITION COILS, TRANSMISSION AND A RADIATOR REPLACEMENT. THE BATTERY WAS REPLACED DUE TO THE VEHICLE NOT STARTING, THE VALVE AND CAM SEALS WERE LEAKING OIL. THE VEHICLE ALSO HAD AN OIL SLUDGE PROBLEM. THE CONSUMER WAS UNABLE TO LOCK AND UNLOCK THE DOORS AT TIMES. THE DEALER REPLACED A LOOSE CONNECTION. *JB",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/22/2008",
        "dateOfIncident": "10/09/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218877,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 AUDI A4 1.8T QUATTRO.  MY CAR HAS SUFFERED A FUEL PUMP FAILURE TWICE, BOTH DOCUMENTED.  THE FIRST TIME AT APPROXIMATELY 20K MILES, THE SECOND TIME AT APPROX. 70K MILES WITH WHICH I PAID TO REPAIR.  I NOTICED THAT MY CAR MAKE AND MODEL HAS TWO CURRENT OUTSTANDING RECALLS RELATED TO THIS SAME PROBLEM (NHTSA CAMPAIGN ID NUMBER :  06V017000 AND  07V375000).  WHEN I CALLED AUDI SERVICE TO INQUIRE ABOUT A REIMBURSEMENT FOR REPAIR COSTS, I WAS TOLD THAT MY VIN# WAS NOT INCLUDED IN THE RECALL AND THEREFORE, A REIMBURSEMENT WAS NOT POSSIBLE.  FUEL PUMP FAILURES ARE NOT TYPICAL.  TWO FAILURES IN THE SAME CAR WITHIN 50K MILES OF EACH OTHER ARE EVEN LESS LIKELY AND I FEEL ARE INDICATIVE OF A MANUFACTURING DEFECT, ESPECIALLY WHEN TWO RECALLS ALREADY EXIST FOR THE SAME PART IN THE SAME CAR.  THE REPAIR WAS COSTLY, AND I WOULD APPRECIATE AN INVESTIGATION INTO THE MATTER SO THAT I MAY BE REIMBURSED FOR REPAIRS THAT I FEEL WERE CAUSED BY A MANUFACTURING ISSUE.  THANK YOU.  *TR",
        "vin": "WAULC68E43A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/13/2008",
        "dateOfIncident": "02/07/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217982,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AUDI A4 QUATRO 2003 MODEL. I WOULD LIKE TO REPORT PROBLEM AND SEE IF THIS IS COMMON WITH AUDI CARS. I HAVE TWO SEPARATE EPISODES OF ELECTRONIC CAR WINDOW NOT ROLLING UP. THE MOTOR THAT SUPPOSE TO HOLD WINDOW DID NOT HOLD THE WINDOW CLOSED AS WELL. EVERYTIME I DRIVE OVER BUMP ON THE ROAD THE WINDOW WILL COME DOWN.    I HAD FIRST INCIDENCE ON PASSENGER SIDE REAR WINDOW IN 2006 AND NOW I HAD ANOTHER INCIDENCE IN DRIVER SIDE REAR WINDOW IN 2008. I WONDER IF THIS IS A COMMON PROBLEM WITH AUDI. IT IS VERY EXPENSIVE TO FIX THIS PROBLEM AS NORMALLY THE WHOLE ROTATOR MOTOR NEEDS TO BE REPLACE. IT COSTS ABOUT $1,000 TO BE FIXED.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/11/2008",
        "dateOfIncident": "02/02/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217715,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  WHILE DRIVING 40 MPH, THE VEHICLE SHUT OFF WITHOUT WARNING.  IN ADDITION, THERE WAS A TOTAL LOSS OF POWER.  THE MECHANIC STATED THAT THE FUEL PUMP CAUSED THE FAILURE.  THERE IS A RECALL FOR THE FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP (NHTSA CAMPAIGN ID NUMBER 07V375000); HOWEVER, THE DEALER STATED THAT HIS VIN WAS NOT INCLUDED.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 47,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "11/06/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214145,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI HAS INTENTIONALLY PUT MY FAMILY AND ME AT RISK OF SERIOUS INJURY OR WORSE  BY REFUSING TO REPLACE A POSSIBLY DEFECTIVE FUEL PUMP IN MY 2003 A4 1.8L TURBO.  EVEN THOUGH MY CAR WAS MANUFACTURED WITHIN THE TIMEFRAME SPECIFIED IN THE FUEL PUMP RECALL CAMPAIGNS, AUDI USA TOLD ME MY CAR SHOULDN'T BE AFFECTED BY THIS PROBLEM SINCE THE RECALLS DON?T INCLUDE MY CAR'S VIN. (CAMPAIGNS #06V017000 AND #07V375000)  THESE RECALLS COVER A4 1.8L TURBO ENGINES MANUFACTURED FROM SEPTEMBER 1, 2002 TO MARCH 31, 2003.  MINE WAS MANUFACTURED ON NOVEMBER 8, 2002.  IT IS CLEAR TO ME THAT AUDI IS PUTTING US AT RISK FOR A CRASH AND INJURY, SINCE 1) THEY USED THE SAME EXCUSE TO DENY RESPONSIBILITY FOR ALL 4 DEFECTIVE IGNITION COILS THAT TURNED OUT NEEDING REPLACEMENT (SEE ODI #10214099); 2) MY CAR HAS ALREADY HAD SERIOUS MECHANICAL PROBLEMS (COMPLETELY NEW TRANSMISSION AND RADIATOR BY 69,000 MILES); 3) AUDI SEEMS UNAWARE OF HOW MANY CARS ARE REALLY AFFECTED BY THIS, GIVEN THEY DIDN'T INCLUDE ENOUGH VEHICLES IN THE FIRST FUEL PUMP RECALL OF 74,000 CARS AND HAD TO ADD A SECOND ONE FOR AN ADDITIONAL 34,000; AND 4) THESE FUEL PUMPS ARE KNOWN TO FAIL AS EARLY AS 50,000 MILES, AND MY CAR HAS 70,000.     IT IS FOR THESE FOUR REASONS MY FUEL PUMP NEEDS TO BE REPLACED AT AUDI?S EXPENSE.  AUDI NEEDS TO STOP MAKING ITS CAR OWNERS PAY FOR THEIR ENGINEERING MISTAKES.  THIS IS A DANGEROUS PRACTICE THAT NEEDS TO STOP BEFORE SOMEONE GETS KILLED.  *TR",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/07/2008",
        "dateOfIncident": "10/30/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214099,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THREE SEPARATE OCCASIONS MY 2003 A4 (1.8T) STARTED SHAKING VIOLENTLY AS I ACCELERATED FROM A COMPLETE STOP.  EVERY TIME IT HAPPENED THE CHECK ENGINE LIGHT CAME ON, THE CAR LOST MOST ALL OF ITS POWER AND WAS DIFFICULT TO STEER, AND WOULDN'T GET ABOVE 15 MPH.  AND EVERY TIME IT HAPPENED I WAS STRANDED IN THE MIDDLE OF TRAFFIC, HAVING TO COAX THE CAR OVER TO THE SIDE OF THE ROAD AND OUT OF HARM'S WAY.  THE CAR WAS TOWED EACH TIME TO THE DEALERSHIP WHERE I WAS TOLD THAT AN IGNITION COIL (OR TWO) HAD BLOWN.  ALL 4 COIL PACKS HAD TO BE REPLACED WITHIN A YEAR AT A COST OF OVER $900.  AUDI KNOWS THEY PRODUCED CARS WITH FAULTY IGNITION COILS IN A4 CARS EQUIPPED WITH 1.8 LITER ENGINES IN THE 2001, 2002, AND EARLY PRODUCTION 2003 MODEL YEARS.  IN FEBRUARY 2003 THEY ANNOUNCED THAT THEY WOULD REPLACE THESE COILS FREE OF CHARGE TO THE VEHICLE OWNERS.  ALTHOUGH MY CAR IS AN EARLY PRODUCTION 2003 MODEL, AUDI USA TOLD ME THAT MY CAR WAS PRODUCED VERY SOON AFTER THE RANGE OF CARS COVERED IN THE REPLACEMENT.  MEANING THAT I WAS RESPONSIBLE FOR THE COST OF ALL REPAIRS.  I DO NOT BELIEVE AUDI IS CERTAIN THEIR REPLACEMENT ACTION COVERED ALL DEFECTIVE COILS, ESPECIALLY AS MY CAR WAS PRODUCED IN THE SAME TIME FRAME AS THOSE THAT WERE PART OF THE REPLACEMENT.  FAULTY IGNITION COILS EXIST IN A FAR GREATER NUMBER OF CARS THAN WHAT AUDI RECOGNIZES AND COVERS IN THEIR 2003 REPLACEMENT ACTION.  *TR",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/04/2008",
        "dateOfIncident": "03/18/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213659,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN FEBRUARY 2007, MY 2003 A4'S MULTITRONIC CVT (TRANSMISSION) STARTED TO FAIL.  IT WAS SLOW TO ENGAGE TO REVERSE AND TO FIRST GEAR FROM A COMPLETE STOP, AND THE PRND INDICATOR ON THE DASHBOARD BEGAN TO BLINK CONTINUOUSLY.  ALTHOUGH THESE WERE OBVIOUS PROBLEMS, THE MECHANIC AT OUR AUDI DEALERSHIP INFORMED ME THE CAR WAS 'OPERATING ACCORDING TO MANUFACTURER'S SPECIFICATIONS.'  THE CAR ONLY HAD 61,000 MILES.    SOON THEREAFTER, THE TRANSMISSION GOT WORSE.  ON ONE OCCASION, MY INFANT DAUGHTER AND I WERE PUT IN DANGER WHEN THE TRANSMISSION DIDN'T ENGAGE AS I ATTEMPTED A LEFT TURN.  WE WERE STUCK IN ONCOMING TRAFFIC IN A CAR THAT WOULD NOT MOVE.  IT WAS ONLY AFTER I PRESSED THE GAS PEDAL MULTIPLE TIMES, REVVING THE ENGINE SIGNIFICANTLY, THAT THE CAR BUCKED INTO FIRST GEAR AND LURCHED FORWARD.  ON ANOTHER OCCASION, THE CAR WOULD NOT GO INTO REVERSE WHEN I TRIED TO BACK OUT OF A SPACE IN A BUSY PARKING LOT.  THIS SPACE WAS ON A SLIGHT INCLINE, CAUSING THE CAR TO ROLL FORWARD WHEN I STEPPED ON THE GAS IN THE ATTEMPT TO ENGAGE THE REVERSE.  INSTEAD OF REVERSING, AGAIN THE ENGINE REVVED SIGNIFICANTLY AND ROLLED FORWARD, NEARLY MISSING THE PARKED CAR IN FRONT OF ME.  AFTER SEVERAL ATTEMPTS THE REVERSE SUDDENLY ENGAGED AND LURCHED BACKWARDS.  THANK GOODNESS NOBODY WAS INJURED IN EITHER SITUATION.    AT 64,000 MILES THE TRANSMISSION FAILED COMPLETELY.  I HAD TO REPLACE IT AT A COST OF $6,500.  AUDI EVEN REQUIRED THAT MY BROKEN TRANSMISSION BE SENT BACK TO THEM SO THEY COULD STUDY THE FAILURE.    THE TECHNICAL STAFF AT MY AUDI DEALERSHIP, AS WELL AS THE OWNER OF THE REPAIR SHOP WHERE I EVENTUALLY HAD THE TRANSMISSION REPLACED, REMARKED THAT THE MULTITRONIC CVT'S DESIGN IS PROBLEMATIC, AND THAT THEY'RE SEEING MAJOR ISSUES WITH THEM.  *CN",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212502,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A HARD TURN AND QUICK ACCELERATION TO AVOID AN ACCIDENT LEAD TO POWER FAILURE TO THE WHEELS, AND THE CHECK ENGINE LIGHT CAME ON. I BROUGHT THE CAR TO THE DEALERSHIP AND THE CODE READ \"SLIPPING TORQUE CONVERTER\" THE CAR HAD ONLY 79,000 MILES AT THE TIME OF THIS OCCURRENCE. THANKFULLY NO ONE WAS INJURED. AUDI REPAIR FACILITY TOLD ME THE TORQUE CONVERTER NEEDS TO BE REPLACED, THE COST WOULD BE $900.00 FOR THE PART AND $2,000.00 FOR LABOR. THE REPAIRS HAVE YET TO BE MADE DUE TO THE EXTENSIVE PRICE FOR A FAULTY PART AND LABOR. THE PART IS NOT COVERED UNDER WARRANTY.  *TR",
        "vin": "WAULT64B63N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/04/2007",
        "dateOfIncident": "12/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210819,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  WHILE DRIVING 65 MPH, THE VEHICLE SUDDENLY STALLED WITHOUT WARNING.  THE CONTACT HEARD A LOUD WHINING NOISE COMING FROM THE FUEL PUMP.  THE VEHICLE WAS TOWED TO THE DEALER AND THEY STATED THAT THE FUEL PUMP WAS DISABLED.  THE CONTACT STATED THAT THE VEHICLE SHOULD BE COVERED UNDER NHTSA CAMPAIGN ID NUMBER 06V017000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP).  THE DEALER AND MANUFACTURER STATED THAT THE VIN WAS NOT INCLUDED IN THE RECALL.  THE CURRENT AND FAILURE MILEAGES WERE 70,000.",
        "vin": "WAULC68E73A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/03/2007",
        "dateOfIncident": "12/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210646,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS DRIVING ON THE HIGHWAY AND ACCELERATED TO ABOUT 65 MPH, THE GAS PEDAL WOULD LIFT SLIGHTLY AWAY FROM MY FOOT (LIKE I JUST TURNED ON CRUISE CONTROL, BUT I HAD NOT TOUCHED THE CRUISE AT ALL) AND WHEN I LIFTED MY FOOT COMPLETELY AWAY FROM THE PEDAL, IT WOULD STAY STEADY AT 65 MPH.  I BRAKED TO SLOW THE CAR DOWN, AND THE CAR WOULD SLOW AS LONG AS MY FOOT WAS ON THE BRAKE, BUT ONCE I LET OFF THE BRAKE, THE CAR WOULD MAINTAIN THE LOWERED SPEED.  THIS HAPPENED SEVERAL TIMES AND I FELT THAT I HAD LITTLE CONTROL OVER THE ACCELERATION/DECELERATION OF THE CAR.  AT ONE POINT, I SLOWED THE CAR DOWN COMPLETELY TO A STOP AND HAD MY FOOT ON THE BRAKE, THE CAR WAS STILL IN DRIVE AND THOUGH MY FOOT WAS ON THE BRAKE, THE RPM'S WERE STILL AROUND 2000.  I IMMEDIATELY PUT THE CAR INTO PARK AND THE TACH REVVED UP TO BETWEEN 4500 - 5000 RPM, AS IF THE GAS HAD BEEN PUSHED.  I TAPPED MY FOOT ON THE GAS A FEW TIMES LIGHTLY AND THE GAS PEDAL SEEMED TO COME UNSTUCK AND THE CAR WENT BACK TO IDLE RPM'S (<1000).  I TURNED THE CAR OFF AND PUMPED THE GAS PEDAL A FEW TIMES, THEN CAUTIOUSLY DROVE HOME.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/25/2007",
        "dateOfIncident": "07/16/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209859,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "COOLING STARTED TO LEAK INTO A SPARKPLUG, NO OVERHEATING OCCURRED AND CAR WAS TAKING TO DEALER, TO FIND OUT THE ENGINE WAS CRACKED. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/19/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209491,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 REQUESTING FUEL PUMP REPLACEMENT. CONSUMER STATED THAT THE VEHICLE IS HAVING FREQUENT STALLING  WHEN STARTING AND WHEN IN USE.  *KB  THE CONSUMER STATED HIS VEHICLE FELL WITHIN THE VEHICLE IDENTIFICATION NUMBER RANGE REGARDING THE RECALL FOR THE FUEL PUMP. THE CONSUMER STATED THE  VEHICLE WAS DISPLAYING FREQUENT STALLING AT START UP AND INTERMITTENT STALLING WHILE THE VEHICLE WAS IN USE. RECALL # 07V375000. *JB",
        "vin": "WAULT68E23A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2007",
        "dateOfIncident": "10/23/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206657,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE IS AN AUDI A4 3.0.  I ORIGINALLY PURCHASED IN 6/2003.  ON MULTIPLE OCCASIONS, WHEN I HAVE PUT THE CAR IN REVERSE THE CAR BEGINS TO BUCK/SHAKE VIOLENTLY FOR SEVERAL SECONDS UNTIL I PRESS ON THE BRAKE PUT THE CAR BACK INTO PARK.  I HAVE TAKEN IT TO THE AUDI DEALERSHIP TO ADDRESS THIS PROBLEM ON SEVERAL OCCASIONS WHILE IT WAS UNDER WARRANTY AND THEY WERE UNABLE TO DIAGNOSE THE PROBLEM.  MOST RECENTLY, AT THE BEGINNING OF THIS YEAR. HOWEVER, LAST WEEK AS I WAS RETURNING HOME, SMOKE BEGAN TO COME OUT OF THE ENGINE.  I BROUGHT IT TO AUDI SERVICE AND I WAS TOLD TODAY THAT MY TRANSMISSION WAS LEAKING AND WAS DRIPPING ONTO MY CATALYTIC CONVERTER WHICH WAS THE CAUSE FOR THE SMOKE.  HOWEVER, I AM NOW NO LONGER COVERED BY MY WARRANTY.  IT SEEMS LIKE THE CVT TRANSMISSION ON THIS CAR IS PRONE FOR FAILURE AFTER 50,000.  THEY WANT TO TAKE OUT MY TRANSMISSION AND EITHER REPLACE/REPAIR IT (IF POSSIBLE).  I CONTACTED AUDI CUSTOMER CARE AND THEY CONTACTED AUDI SERVICE.  THEY ARE CURRENTLY IN DISCUSSION WITH REGARDS TO THE COVERAGE FOR THE REPAIRS.  THEY SHOULD HAVE FOUND THE PROBLEM A WHILE AGO WHEN I BROUGHT IT IN SEVERAL TIMES BEFORE.  *TR",
        "vin": "WAUJT68E93A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/04/2007",
        "dateOfIncident": "09/28/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205051,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A4 6-CYL 3.0L AVANT 2003 MODEL YEAR. COIL PACK #2 FAILED ON SEP 28TH 2007.  AUDI HAS HAD A RECALL FOR THE 2003 A4 4-CYL 1.8L ENGINES BUT NOT FOR THE 3.0L ENGINES.  THE VEHICLE ONLY HAS 37K MILES ON THE ODOMETER. IT'S LIKELY THAT THERE WILL BE MORE CP FAILURES, UNTIL I HAVE ALL OF THEM REPLACED.  THERE SHOULD HAVE BEEN A RECALL FOR THE 3.0L ENGINE AS WELL.  *TR",
        "vin": "WAUVT68E23A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2007",
        "dateOfIncident": "08/20/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200392,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  THE CONTACT STATED THAT THE VEHICLE STALLED WHILE IDLING WITHOUT PRIOR WARNING.  THE VEHICLE WAS TOWED TO THE DEALER.  THE SERVICE TECHNICIAN STATED THAT THE FUEL PUMP FAILED AND NEEDED TO BE REPLACED.  THE DEALER STATED THAT THE VIN WAS EXCLUDED FROM NHTSA RECALL NUMBER 06V017000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP).  THE CURRENT AND FAILURE MILEAGES WERE 55,000 MILES.",
        "vin": "WAULT68E73A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "07/10/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198889,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  SHE NOTICED A LEAK ON THE PASSENGER SIDE REAR WINDOW OF THE CONVERTIBLE IN ADDITION SHE NOTICED THE ROOF DETACHED FROM THE REAR WINDOW.  THE DEALER STATED THAT THE CONVERTIBLE ROOF NEEDED TO BE REPLACED.  THE CURRENT AND FAILURE MILEAGES WERE 42,000.   UPDATED 02-01-08 *BF    THE CONSUMER STATED THE DEFECT IS ADHESIVE PROCESS USED DOESN'T STICK TO CONVERTIBLE TOP. THE CONSUMER STATED IT WOULD COST $4,000 TO REPLACE THE TOP. UPDATED 02/01/08  *TR",
        "vin": "WAUAT48H93K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/26/2007",
        "dateOfIncident": "07/26/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197613,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 AUDI A4 1.8T ENGINE. I DISCOVERED A LOUD MECHANICAL NOISE AT THE REAR OF MY CAR WHEN DRIVING AND NOW ALSO AT IDLE. I FOUND OUT FROM A AUDI INDEPENDENT SHOP & FROM ONLINE CAR FORUMS THAT THE ISSUE ON MY CAR IS THE FUEL PUMP IS ABOUT TO FAIL. I JUST FOUND OUT THAT THERE WAS A RECALL ON THIS CAR NHTSA CAMPAIGN ID IS 06V017000, THE MANU CAMPAIGN NUMBER IS JL. I THEN DISCOVERED FROM SERVICE RECORDS ON THE CAR THAT THE FUEL PUMP HAD BEEN REPLACED ON 4/19/06 WITH 35,434 MILES ON THE CAR WITH THE JL CODE.  I PURCHASED THE CAR AT THE END OF MAY 2006 WITH 35,500 MILES ON THE CAR. I HAD TO GET A REPAIR TO THE FUEL SENDER UNIT (SHOWS THE FUEL LEVEL) UNDER WARRANTY ON 6/16/06 WITH 36,706 MILES, THE DEALERSHIP NEVER MENTIONED THE SERVICE HISTORY TO ME AT THIS POINT.  THE CAR HAS JUST REACHED 57K MILES(OUT OF WARRANTY 50K)AND NOW THE FUEL PUMP IS SCREAMING WITH MECHANICAL NOISE.SO BASICALLY WITH ONLY APPROX 22K MILES ON THE \"NEW\" FUEL PUMP IT IS FAILING AGAIN.  TODAY I WENT TO A AUDI DEALERSHIP IN SAN JOSE, CA AND TOLD THEM THE ISSUE WITH THE CAR, AND THE HISTORY OF THE SERVICE. THE SERVICE CONSULTANT WAS EXTREMELY UNHELPFUL AND REFUSED THAT THEY SHOULD FIX THE CAR UNDER A RECALL NOTICE. IN HIS OWN WORDS HE SAID THAT A MECHANICAL PART COULD FAIL THE VERY NEXT DAY AFTER INSTALLATION. SO MUCH FOR INSPIRING CONFIDENCE IN A PREMIUM MANUFACTURER.  I TOLD HIM ABOUT THE SAFETY ASPECT THAT IF THE FUEL PUMP FAILS ON MY WIFE AND I WHEN DRIVING ON A INTERSTATE, HE DID NOT CARE.  AFTER THIS I THEN RANG UP AUDI OF AMERICAS CONSUMER HELPLINE, I TALKED TO A FRIENDLY LADY, BUT SHE SAID THAT NOTING COULD BE COVERED UNDER WARRANTY BY AOA AND I WOULD HAVE TO PAY OUT OF POCKET MYSELF  I AM EXTREMELY UNHAPPY, AND VERY WORRIED ABOUT OUR SAFETY TO DRIVE THIS CAR. AUDI SHOULD STEP UP AND REPLACE THIS CRITICAL COMPONENT ESPECIALLY AS HISTORY PROVES THAT THERE WAS A OFFICIAL RECALL ON THIS ISSUE. BUT THEY ARE UNWILLING TO HELP OUT.  PLEASE HELP MY WIFE AND I OUT. IT WOULD BE MUCH APPRECIATED.  THANKS.  *TR",
        "vin": "WAUVC68E73A"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/14/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196346,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR WINDOW OF MY 2003 A4 CABIOROLET HAS BECOME DETACHED FROM THE TOP. NOW BARELY HANGING ON, THE WINDOW PRESENTS A SIGNIFICANT SAFETY HAZARD TO PASSENGERS AND OTHER VEHICLES WHEN IT FALLS OUT.  *TR",
        "vin": "WAUAT48H43K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/04/2007",
        "dateOfIncident": "06/28/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195331,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, ENGINE LOST POWER, WAS ABLE TO GET THE VEHICLE INTO A PARKING LOT AND HAD IT TOWED TO MECHANIC.  IGNITION COIL IN CYLINDER #2 FAILED AND HAD TO BE REPLACED.",
        "vin": "WAUJC68E83A"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/13/2007",
        "dateOfIncident": "05/17/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193284,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT HUB WHELL  BEARING SEIZED INTO THE ADJOINING KNUCKLE.  THIS FAILURE RESULTED FROM WHAT THE DEALER REPORTED TO BE \"ELECTROLYSIS. WRONG CHOICE OF METALS IN THE WHEEL BEARING.  WHEEL PARTIALLY SIEZED  *AK.",
        "vin": "WAUVC68E93A"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/22/2007",
        "dateOfIncident": "05/21/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191508,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A4.  THE CONTACT STATED THAT THE VEHICLE FUEL PUMP FAILED.  THERE WERE NO WARNING SIGNS AND NO LIGHTS ILLUMINATED ON THE INSTRUMENT PANEL.  WHILE DRIVING 25 MPH, THE VEHICLE STALLED.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 57,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/18/2007",
        "dateOfIncident": "04/16/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10188218,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI 4.  THE CONTACT STATED THAT IN MARCH OF THIS YEAR, THE \"EPC\" WARNING LIGHT WOULD ILLUMINATE WHEN THE VEHICLE WAS STARTED.  ON APRIL 16, 2007, THE VEHICLE STALLED AND SHUT OFF WHILE DRIVING APPROXIMATELY 20 MPH.  THE CONTACT RESTARTED THE VEHICLE, ONLY FOR IT TO SHUT OFF AGAIN.  AAA TOWED THE VEHICLE TO THE DEALER (LEN STOLER) WHO DIAGNOSED THE FAILURE AS THE FUEL.  THE VEHICLE HAS EXPERIENCED THIS  FAILURE ONCE BEFORE.  THE SAME FAILURE OCCURRED AT APPROXIMATELY 20,000 MILES AND THE DEALER REPLACED THE FUEL PUMP UNDER WARRANTY.  THE MANUFACTURER STATED THAT THE VIN WAS EXCLUDED IN RECALL # 06V017000.  THE CURRENT MILEAGE IS 69,000 AND FAILURE MILEAGE WAS 20,000.",
        "vin": "WAULC68E23A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/10/2007",
        "dateOfIncident": "04/07/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187421,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I ACCELERATED ON THE HIGHWAY TO PASS A VEHICLE AND TO TAKE  THE  UPCOMING HIGHWAY EXIT.  THE ACCELERATOR APPEARED TO BE DEPRESSED TO THE FLOOR AND WAS STUCK FOR A PERIOD OF TIME.  THE VEHICLE WAS OUT OF CONTROL,  AND I PUMPED THE  BRAKES SEVERAL TIMES TO FINALLY SLOW DOWN THE VEHICLE.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/03/2007",
        "dateOfIncident": "03/29/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186954,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SUDDENLY WOULD NOT START. ASSUMED IT WAS A PROBLEM WITH THE FUEL FILTER OR PUMP (WHICH AUDI CALLS A FUEL DELIVERY UNIT).  FILTER WAS REPLACED AND CAR WAS GOOD FOR ABOUT 3 WEEKS, THEN IT DID THE SAME THING AGAIN.  HAVE TO HAVE IT TOWED TO THE SHOP. NOW AUDI HAS SENT THE WRONG FUEL PUMP TWICE. THERE IS A RECALL ON THE PUMP, BUT APPARENTLY MY CAR IS NOT WITHIN THE COVERED VIN NUMBERS. SEEMS LIKE A LOT OF PEOPLE ARE DEALING WITH THIS PROBLEM AND AUDI ISN'T STANDING BEHIND THE DEFECT!  THIS IS FRUSTRATING WHEN THEY DON'T STAND BEHIND THEIR PRODUCT.  *JB",
        "vin": "WAUJT68E93A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/02/2007",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186751,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* -  THE CONTACT OWNS A 2003 AUDI A4.  THE CONTACT STATED THAT WHILE DRIVING THE VEHICLE LOST POWER WITHOUT WARNING  AND WAS DIAGNOSED AS NEEDING A NEW FUEL PUMP.  THE DEALER REPLACED THE FUEL PUMP.  THE IDENTICAL PROBLEM OCCURRED AT 40,000 MILES WHILE DRIVING AT 30 MPH.  THERE WERE NO WARNING INDICATORS.  THE VEHICLE WAS TOWED AND DIAGNOSED AS NEEDING A NEW FUEL PUMP.   *AK",
        "vin": "WAULT68E53A"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/22/2007",
        "dateOfIncident": "03/20/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185923,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Toyo Tire Holdings of Americas, Inc.",
                "productMake": "TOYO",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I PURCHASED A BRAND NEW 03 AUDI A4T QUATTRO IN JUNE OF 03.  THE DEALER IS GREAT AND THANK GOD THEY VALUE THEIR CUSTOMERS BECAUSE MY CAR HAS GIVEN THEM ALOT PRACTICE ON EVERYTHING.  I THINK GERMANY SENT US A DUD! SINCE BUYING THE CAR I HAVE NEEDED VARIOUS ITEMS REPLACED:  A NEW COMPUTER, (REPLACED BY THE DEALER), A NEW FUEL SYSTEM WAS NEEDED BECAUSE MY CAR STALLED IN THE LEFT LANE OF A HIGHWAY WHILE DRIVING IN THE MIDDLE OF NOWHERE (LATER RECALLED BY AUDI BUT AFTER I NEEDED TO BE TOWED AND HAVE THE CPMPONENT FIXED ALONG WITH OTHER ITEMS SUPPOSEDLY ATTACHED TO THE SYTEM), AND MOST RECENTLY 2 SEPARATE PROBLEMS THAT HAVE NOT YET BEEN FIXED BUT HAVE OCCURRED WITHIN 1100 MILES OF EACH OTHER.  FIRST DIAGNOSIS OF THE NOISE AND SHIMMY WHILE DRIVING WAS TIRE BALANCE AND LATER RACK AND PIN STEERING AND AFTER ALL THAT  THEY ARE TRYING TO FIGURE OUT WHAT THE SHIMMY AT 65MPH + IS ALONG WITH THE WHINNING IN THE CAR THE FIRST 10 MILES FO EACH DAY (AFTER IT IS WARMED UP OR EVEN IF IT IS A WARM DAY).  AND  WHAT SUPPOSEDLY WAS FIRST THOUGHT TO BE A COIL IS NOW A MYSTERY.  THEY HAVE HAD MY CAR FOR OVER 2 DAYS AND ARE STILL UNSURE AS TO WHAT IS GOING ON.  THANK GOD I BOUGHT THE EXTENDED WARRANTY!",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/11/2007",
        "dateOfIncident": "01/31/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184755,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS CAR ON 1/24/07 WITH 22,422 MILES ON IT.  SIX DAYS LATER THE ENGINE LIGHT WAS FLASHING, IT WAS SHAKING UNBELIEVABLE, WOULD NOT RUN PROPERLY, GO OVER 20 MPH.  I RETURNED IT TO THE DEALERSHIP I PURCHASED IT FROM, THEY REPLACED A COIL PACK.  WITHIN A SHORT TIME, ON FEBRUARY 14, 2007, THE ENGINE LIGHT HAD COME BACK ON.  AT THAT POINT I BROUGHT IT TO THE NEAREST AUDI DEALER.  IT NEEDED A TURBO BYPASS VALVE REPLACED.   FRIDAY, MARCH 9, 2007 THE ENGINE LIGHT HAD COME ON AGAIN.  I BROUGHT IT TO THE AUDI DEALER ONCE AGAIN.  THEY RESET THE ENGINE CODES AND SAY IT HAS HAD A RANDOM MISFIRE.  TODAY, MARCH 11, 2007 THE ENGINE LIGHT IS FLASHING AGAIN, AND WILL NOT DRIVE OVER 20 MPH.  I AM HAVING IT TOWED TO THE DEALER IN THE MORNING, TODAY IS SUNDAY AND THEY ARE NOT OPEN FOR BUSINESS.  I DRIVE ABOUT 1,000 MILES A WEEK AND I NEED MY CAR OPERATIONAL.  I WORRY EACH TIME I DRIVE THIS CAR, I HAVE TO RETURN IT TO THE DEALER ALMOST WEEKLY.  IT HAS LOW MILES.  CARFAX STATES THIS AUTOMOBILE HAS A CLEAN HISTORY AND IS UNDER FACTORY WARRANTY UNTIL 6/07.  THE BOOKLET OBTAINED WITH THE PURCHASE OF THIS CAR STATES THE 4 YR/50,000 MI WARRANTY BECAME EFFECTIVE 6/03 WHICH WOULD LEAVE THE REMAINDER OF THE FULLY TRANSFERABLE FACTORY WARRANTY VALID UNTIL 6/07.  THE AUDI DEALERSHIP WILL NOT HONOR THE WARRANTY, SAYING THAT IT EXPIRED 1/31/07.  THE CAR NOW HAS 29,XXX MILES ON IT AND I HAVE HAD NOTHING BUT TROUBLE WITH IT.  THE SUNROOF MOTOR ALSO NEEDS TO BE REPLACED, AS I AM TOLD BY THE DEALER, WHO THEN TOLD ME THE MOTOR IS $501.     *JB",
        "vin": "WAULC68E33A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2007",
        "dateOfIncident": "12/20/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT CALLED REGARDING A 2003 AUDI A4.  THE CONTACT STARTED HEARING NOISES FROM THE REAR OF THE VEHICLE.  THE CONTACT TOOK THE VEHICLE TO THE DEALER ,AND THE VEHICLE WAS DIAGNOSED AS NEEDING A NEW FUEL PUMP.  THE FUEL PUMP AND FUEL FILTER WERE REPLACED.  THE CONTACT HAS THE REPAIR INVOICE.  THE FAILURE MILEAGE WAS 85,000.  THE CONTACT STATED RECALL 06V017000 WAS  FOR THE SAME PROBLEM  AS HE  WAS  HAVING WITH THE VEHICLE.  THE CONTACT CALLED THE MANUFACTURER, AND WAS  INFORMED  THAT THIS VEHICLE WAS NOT A PART OF THE RECALL.  THE CURRENT MILEAGE WAS 87000.*AK  UPDATED 03/19/07.*JB",
        "vin": "WAUJC68E43A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/21/2007",
        "dateOfIncident": "02/21/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183177,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE RIGHT INDICATOR IS TURNED ON BEFORE A TURN, THE INDICATOR LIGHTS KEEP SWITCHING BETWEEN LEFT AND RIGHT.  THE PROBLEM IS OBSERVED NOT ONLY ON THE DASHBOARD INDICATOR LIGHTS, BUT ALSO THE FRONT AND REAR INDICATOR CONSOLE.  THIS IS A SAFETY HAZARD, BECAUSE IT IS VIRTUALLY IMPOSSIBLE TO CHANGE LANES WITHOUT RISKING GETTING HIT FROM BEHIND; ESPECIALLY ON A CROWDED ROAD.  I HAVE COMPLAINED TO THE AUDI DEALERSHIP/SERVICE STATION ABOUT THIS ISSUE TWICE.  HOWEVER, THEY WERE UNABLE TO REPRODUCE THIS PROBLEM.  *NM",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/21/2007",
        "dateOfIncident": "10/15/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183179,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AUDI A4 1.8T THAT I PURCHASED IN DEC 2002 HAS A SUNROOF/MOONROOF ASSEMBLY.  A FEW TIMES I HAVE NOTICED THAT THE SUNROOF OPENS AND CLOSES ON ITS OWN WHILE THE CAR IS IN MOTION.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/24/2007",
        "dateOfIncident": "01/15/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10180609,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL- THE CONTACT OWNS A 2003 AUDI A4.  WHILE DRIVING 60MPH, THE ENGINE LIGHT CAME ON, THE VEHICLE BEGAN TO STALL AND THE SPEED DECREASED TO 20MPH AND RESULTED IN A LOSS OF POWER.  THE VEHICLE WAS TOWED AND THE DEALER STATED THAT THE INGITION COILS FAILED.  THE CONTACT SPOKE WITH AUDI WHO INFORMED HIM THAT THEY WOULD NOT PAY FOR THE REPAIRS BASED ON A RECALL.",
        "vin": "WAULT68E63A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2006",
        "dateOfIncident": "12/12/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176763,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR (AN AUDI A4) STARTED SHAKING AND COULD NOT BE DRIVEN OVER 40 MILES PER HOUR.  IT HAD TO BE PULLED OVER TO THE SIDE OF THE ROAD AND BE TOWED TO A DEALER TO REPLACE 2 SPARK PLUG IGNITION COILS.  4 SPARK PLUG IGNITION COILS HAVE FAILED DURING THE PAST YEAR.  THE MOST RECENT OCCURRENCE IS LISTED BELOW. *JB",
        "vin": "WAULC68E93A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/26/2006",
        "dateOfIncident": "11/24/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174279,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "VOLKSWAGEN",
                "productModel": "SEAT BELTS",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AUDI A4 2003, THE CLUTCH FAILED AT 30,000 MILES, BUT AUDI REFUSED TO FIX THE PROBLEM UNTIL IT WAS COMPLETELY UNDRIVABLE.  I HAD TO PAY OUT OF POCKET BECAUSE IT WAS CATEGORIZED AS WEAR AND TEAR, THUS NOT COVERED BY AUDI'S LEAST.  THE ELECTRICAL SYSTEM AND THE FUEL PUMP ALSO FAILED AND NEEDED TO BE REPLACED.  THE JACK BROKE WHILE CHANGING A FLAT TIRE AND I WAS TOLD THAT THIS HAD HAPPENED TO OTHER AUDI OWNERS, BUT STILL HAD TO PAY THE DAMAGE TO THE PLASTIC SIDING OUT OF POCKET. *JB",
        "vin": "WAULT68E03A"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/15/2006",
        "dateOfIncident": "11/11/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10173561,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 45 MPH ON A CITY STREET, THE PASSENGER SIDE AIRBAG DEPLOYED WITHOUT WARNING.  THE PASSENGER WAS WEARING A SEAT BELT, BUT MINOR INJURIES WERE SUSTAINED.  THE VEHICLE WAS INSPECTED BY A DEALER WHO DETERMINED THE FACTORY STEREO WIRING WAS ENTANGLED WITH THE AIRBAG WIRING WHICH RESULTED IN THE AIRBAG DEPLOYMENT.  THE MANUFACTURER WAS NOT ALERTED.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/26/2006",
        "dateOfIncident": "10/23/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171893,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCH FAILURE ON 2003 AUDI A-4 5-SPD MANUAL TRANSMISSION W. 39,000 MILES.  CAR PURCHASED NEW, DRIVEN BY EXPERIENCED MANUAL TRANSMISSION DRIVER.  *NM",
        "vin": "WAULC68E63A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/16/2006",
        "dateOfIncident": "06/27/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165672,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FAILURE RESULTING IN VEHICLE STOPPING IN TRAFFIC, REQUIRING TOW TO SERVICE CENTER.  NOT CURRENTLY COVERED IN RECALL CAMPAIGN.  *NM",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/09/2006",
        "dateOfIncident": "08/09/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165068,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE THE VEHICLE WAS IDLING, THE ENGINE STALLED WITHOUT WARNING AND WOULD NOT RESTART.  THE VEHICLE WAS TOWED TO AN INDEPENDENT REPAIR SHOP FOR INSPECTION WHO DETERMINED THE FUEL PUMP NEEDED TO BE REPLACED.  THERE WAS A NHTSA RECALL # 06V017000 REGARDING THE FUEL SYSTEM.  THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN. THE MANUFACTURER WAS CONTACTED.",
        "vin": "WAUVC68E73A"
    },
    {
        "components": "POWER TRAIN,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/07/2006",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164856,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER TRANSMISSION SEIZING WHILE IN USE WITH NO WARNING. WIPER MOTOR AND TRANSMISSION REPLACED AT 83000 MILES. VEHICLE IS THREE YEARS OLD. *JB",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/27/2006",
        "dateOfIncident": "06/10/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163658,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFFECTED VEHICLE: 2003 AUDI A4 SEDAN. AIR BAG FAILURE LIGHT REMAINED ON, NO PRIOR ACCIDENT OR EVENT THAT CAUSED THE FAILURE LIGHT TO REMAIN ON. HAD PROBLEM DIAGNOSED BY AUDI DEALERSHIP AND IT WAS FOUND TO BE CAUSED BY A FAULTY AIRBAG IGNITER IN THE STEERING WHEEL. IGNITER REPLACED WITH A NEW PART FROM AUDI BUT WAS NOT COVERED UNDER WARRANTY OR RECALL. TRANSPORT CANADA HAS A RECALL ON THIS PROBLEM FOR THE SAME VEHICLE, 2003 AUDI A4. TRANSPORT CANADA RECALL # IS 2002221 AND DETAILS CAN BE FOUND ON: (HTTP://WWW.TC.GC.CA/ROADSAFETY/RECALLS/RECALL_E.ASP?RECNO=10276&). TRANSPORT CANADA REPORTS THAT CANADIAN AUDI DEALERS WILL REPLACE THE AIRBAG UNITS ON ALL AFFECTED VEHICLES. NHTSA HAS A SIMILAR RECALL FOR THE 2003 AUDI A6 AND THE NHTSA RECALL ID IS 02V275000 AND DETAILS CAN BE FOUND ON: (HTTP://WWW.AUTOMALLUSA.NET/2003/AUDI/A6/RECALLS.HTML). NHTSA REPORTS THAT AUDI USA DEALERS WILL REPLACE THE AIR BAGS ON ALL AFFECTED VEHICLES.  *JB",
        "vin": "WAULT68E03A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/30/2006",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158542,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON TWO OCCASIONS BETWEEN JANUARY 2006 AND MAY 2006, AFTER FULLY STEPPING ON AND SUBSEQUENTLY RELEASING THE ACCELERATOR PEDAL, THE CAR CONTINUED TO ACCELERATE AS IF THE ACCELERATOR WAS STUCK TO THE FLOOR.  I THEN QUICKLY PRESSED ON AND RELEASED THE ACCELERATOR THREE OR FOUR TIMES BEFORE THE THROTTLE FINALLY LET UP AND THE CAR STOPPED ACCELERATING.  AFTER BOTH OCCASIONS, I CHECKED THE FLOOR MAT AND IT WAS SECURED TO THE FLOOR AND AWAY FROM THE ACCELERATOR PEDAL.  *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/15/2006",
        "dateOfIncident": "04/28/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157594,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR WINDOW GLASS IN CONVERTIBLE TOP FELL INWARD TOWARDS THE BACK OF THE PASSENGERS.  GLASS DID NOT FULLY DETACH FROM THE TOP.  *JB",
        "vin": "WAUAT48H93K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/07/2006",
        "dateOfIncident": "09/07/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154839,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PROCEEDING THROUGH A BUSY INTERSECTION MY CAR DIED.  IT WAS LATER DETERMINED THAT THE FUEL PUMP HAD FAILED IN MY CAR WHICH WAS ONLY 2 YEARS OLD AND HAD APPROXIMATELY 55,000 MILES. *JB",
        "vin": "WAULC68E83A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/30/2006",
        "dateOfIncident": "03/27/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154156,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR 2003 A4 HAS FAILED TWICE IN THE LAST YEAR DUE TO FUEL PUMP FAILURE.  THE SITUATION IS VERY DANGEROUS BECAUSE THE CAR STOPS IN THE MIDDLE OF THE ROAD.    I LEARNED ABOUT THE RECALL ON FUEL PUMPS AND CONTACTED AUDI USA AS OUTLINED IN NHTSA WEB SITE.  I WAS TOLD THERE WAS NO RECALL AND THEY COULD NOT HELP ME.  THE DEALERSHIP ALSO DID NOT KNOW ABOUT THE RECALL.  WHEN I SHOWED IT TO THEM THEY SAID THEY DID NOT HAVE THE NEW PUMPS AND MY ONLY OPTION WAS TO PLACE AN \"IN STOCK\" POTENTIALLY DEFECTIVE PUMP IN MY CAR UNTIL THE NEW PUMPS ARRIVE.    I TOLD THEM I DID NOT WANT THE OLD PUMP BECAUSE MY FAMILY HAD BEEN LUCKY TO ESCAPE INJURY IN THE FIRST TWO FAILURES.  I WAS TOLD THERE WAS NO OTHER OPTION.  IN SUM, AUDI HAS INTENTIONALLY PLACED MY FAMILY AT RISK BY INSTALLING A POSSIBLY DEFECTIVE PART IN OUR CAR.  *NM",
        "vin": "WAULT58E13A"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "03/23/2006",
        "dateOfIncident": "02/08/2006",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153564,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI QUATTRO 3.0 HEATED SEAT CAUGHT ON FIRE.  FORTUNATELY NO ONE WAS INJURED AND I WAS ABLE TO PUT OUT THE FIRE BEFORE IT SPREAD.  A HOLE WAS BURNED IN THE SEAT WHICH AUDI REPLACED.  I WAS LUCKY THAT I NOTICED THE FIRE BEFORE I LEFT MY CAR IN MY GARAGE OR ELSE THE CAR AND HOUSE COULD HAVE CAUGHT ON FIRE.  THIS IS A POTENTIALLY DANGEROUS PROBLEM THAT SHOULD BE LOOKED INTO.  THE AUDI DEALER TOLD ME THAT OTHERS HAVE HAD THIS PROBLEM IN THEIR ALL ROAD MODEL..IT IS JUST A MATTER OF TIME BEFORE SOMEONE IS SEVERELY INJURED FROM THIS TYPE OF DEFECT.*JB",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/28/2006",
        "dateOfIncident": "02/28/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151479,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER HARD ACCELERATION, THE THROTTLE ON MY 2003 AUDI A4 BECAME STUCK WIDE OPEN FOR APPROXIMATELY 15 SECONDS. IN ORDER TO STOP THE CAR, I NEEDED TO TURN OFF THE IGNITION. I WAS ABLE TO REPRODUCE THE PROBLEM WITH THE CAR IN NEUTRAL, AND THE THROTTLE SEEMS TO PERSISTENTLY STICK WHEN THE ENGINE REVS OVER 5000 RPM.  I'M PLANNING ON TAKING THIS CAR TO AN AUDI DEALER TOMORROW TO HAVE THE PROBLEM DIAGNOSED FURTHER. *JB",
        "vin": "WAULT68E73A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2006",
        "dateOfIncident": "06/11/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150440,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INOPERATIVE FUEL PUMP AND, ULTIMATELY, STOPPAGE OF FUEL SUPPLY TO THE ENGINE CAUSING IT TO STALL.  *NM",
        "vin": "WAULC68E13A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/16/2006",
        "dateOfIncident": "02/14/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150442,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INOPERATIVE FUEL PUMP AND, ULTIMATELY, STOPPAGE OF FUEL SUPPLY TO THE ENGINE CAUSING IT TO STALL    THIS IS THE 2ND FUEL PUMP INSTALLED ON THIS CAR.  SEE ODI # 10150440.  *NM",
        "vin": "WAULC68E13A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/04/2006",
        "dateOfIncident": "12/27/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149438,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 54000 MILES, 4,000 MILES BEYOND THE WARRANTY, MY 2003 AUDI A4 1.8T'S CLUTCH SIMPLY DISINTEGRATED. AUDI DECLARED IT A WEAR AND TEAR ITEM AND WOULD NOT OFFER ANY ASSISTANCE OTHER THAN A \"SYMPATHETIC EAR\".  TO HAVE A CAR I PURCHASED COSTING WELL OVER $30,000 HAVE SUCH A PROBLEM HAPPEN IT UNREASONABLE AS FAR AS I AM CONCERNED AND THE CALLOUSNESS OF AUDI HAS FOREVER LOST THEM A LOYAL CUSTOMER. EVERY CHANCE I GET TO LET OTHERS KNOW MY EXPERIENCE WITH THIS BRAND I TAKE. DO YOU THINK AUDI EVEN CARES? REPAIR WAS WELL OVER $1500 OUT OF MY POCKET.  *NM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/19/2006",
        "dateOfIncident": "01/16/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148067,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED AN 2003 AUDI A4 1.8 T PRE-OWNED AT 26K MILES IN OCT 2004.  I HAVE BROUGHT THE VEHICLE IN FOR REGULAR SCHEDULE MAINTENANCE AT 30, 40 AND 50K AT ROGER BEASLEY AUDI IN AUSTIN, TX. ON JAN 16, 2006 , AT 55450 MILES, ENGINE STARTED KNOCKING AND OIL WARNING LIGHT CAME ON. I HAD THE VEHICLE TOWED TO DEALERSHIP WHICH TURNED OUT TO BE SLUDGE PROBLEM AND ESTIMATE FOR REPAIR IS $2500. I WAS MADE AWARE ABOUT THE EXTENDED WARRANTY OF 8 YRS FOR SLUDGE ISSUE AUDI AND VW HAD ISSUE BACK IN 2004 BUT DEALER WOULD NOT REPAIR THE ISSUE UNDER WARRANTY SINCE THERE'S NO RECORD OF OIL CHANGE AT 20K. SINCE I PURCHASED THE VEHICLE PRE-OWNED, I'M UNABLE TO PROVIDE ANY OIL CHANGE DOCUMENTATION FOR 20K SERVICE. TO SUM THIS ALL UP, THERE'S A RECORD OF OIL CHANGES DURING 10K (PREVIOUS OWNER GOT SERVICE DONE AT A DEALERSHIP), 30K, 40K AND 50K MAINTENANCE. I HAVE CONTACTED AUDI CUSTOMER RELATION DEPT W/O ANY SUCCESS. IF I PAY THIS REPAIR OUT OF POCKET, I'M AFRAID THERE MIGHT BE OTHER ISSUE RELATING TO THIS AFTER ENGINE IS CLEAN OUT OF ALL SLUDGE. WITH MANY CONSUMERS OUT THERE WITH THE SAME DILEMMA, I THINK AUDI SHOULD STEP UP AND TAKE CARE OF THE REPAIR. ANY HELP IN THIS MATTER WOULD BE GREATLY APPRECIATED.  *NM",
        "vin": "WAULC68E43A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/22/2005",
        "dateOfIncident": "11/22/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143428,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A AUDI A4 2003.  TODAY FOR THE FIFTH TIME IN THE LAST 17K MILES, THE AUTO LEVELING SENSORS FOR THE XENON HEADLAMPS FAILED.  THE XENON HEAD LIGHTS NO LONGER \"AUTO LEVEL\" AND IN CERTAIN TERRAINS THE CAR WILL BLIND ONCOMING TRAFFIC.  THE AUDI DEALER HAS REPLACED NUMEROUS PARTS, BUT HAS YET TO DATE TO REALLY FIX THE PROBLEM.  THIS IS DEFINITELY A SAFTEY ISSUE, SINCE IT CAUSES MY CAR TO BLIND ONCOMING TRAFFIC, AND ALSO CAUSES TOO MUCH REFLECTION OF SIGNS TO THE DRIVER IN MY CAR DURING NIGHT DRIVING.  *NM",
        "vin": "WAUVT68E23A"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/18/2005",
        "dateOfIncident": "11/15/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143143,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 14TH MY A4 1.8 STALLED, WAS TOWED TO THE DEALER, A COIL WAS REPLACED...WHEN I DROVE THE CAR HOME IT WOULD THUMP AND JERK UP AROUND 60 MPH.  I RETURNED IT TO THE DEALER WHO STATED THAT IT COULD AGAIN BE ANOTHER COIL BUT WERE NOT PERMITTED TO REPLACE ALL THE COILS THE DAY BEFORE BECAUSE MANUFACTURER WOULDN'T PAY FOR ANYTHING MORE THAN THE FAULTY COIL...EVEN THOUGH THEY FIGURED MORE MIGHT FAIL...WELL, IT TURNS OUT IT WAS THE \"THROTTLE\" - THEY RESET IT AND I PICKED UP THE CAR AND STARTED DRIVING HOME WHEN IT THUMPED AND JERKED AGAIN...TURNED AROUND AND RETURNED IT TO THE DEALER...THIS ALL HAPPENED ON THE 15TH...IT IS NOW THE 18TH AND AFTER WORKING WITH THEIR ENGINEERS, THEY FEAR THEY MAY NOW NEED TO REPLACE THE ENTIRE TRANSMISSION...I AM JUST GLAD THAT I HAVE A LOANER CAR AND THAT I HAVE 5K MORE MILES ON MY WARRANTY...I THINK I AM GOING TO BY THE EXTENDED SINCE THIS IS 3 HUGE PROBLEMS IN 5 WEEKS TIME!  *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/14/2005",
        "dateOfIncident": "10/11/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142639,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ON THE FREEWAY WHEN MY A4 1.8 LOST POWER...I BARELY MADE IT TO THE SHOULDER AND ALMOST GOT HIT BY A CAR WHO MUST NOT HAVE NOTICE MY SPEED OR THAT MY HAZARDS LIGHTS WERE ON...I WAS TOWED TO THE DEALERSHIP AND ACCORDING TO THE SERVICE DEPARTMENT IT WAS A FAULTY FUEL FILTER THAT CAUSED THE FUEL PUMP TO FAIL.  BOTH PART WERE REPLACED, THE CAR WAS SUPPOSEDLY TEST DRIVEN TO ENSURE IT WAS OPERATING PROPERLY...HOWEVER, A MONTH LATER I HAD ANOTHER FAILURE (NOT RELATED TO THE FUEL SYSTEM).  *NM",
        "vin": "WAULC68E53A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/14/2005",
        "dateOfIncident": "11/14/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142642,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON OCTOBER 11TH MY FUEL FILTER AND PUMP WERE REPLACED AND A ROAD TEST WAS COMPLETED...ON NOVEMBER 14TH (5 WEEKS LATER) MY A4 BEGAN TO SHAKE AND THE MIL CAME ON.  I PULLED VEHICLE TO SIDE OF THE ROAD AND HAD IT TOWED TO DEALER.  DEALER INFORMED ME THAT INGNITION COIL FAILED AND HAD STARTED TO AFFECT THE SPARK PLUGS AND WAS ONLY RUNNING ON 3 CYLINDERS AS A RESULT.  THEY REPLACED THE COIL AND COMPLETED A ROAD TEST - HOWEVER THEY HAD COMPLETED A ROAD TEST 5 WEEKS AGO TOO - SO I AM FEELING LEST CONFIDENT WHEN I DRIVE...FEARFUL OF DRIVING IN LESS FAMILIAR LOCATIONS OR IN ANY LANE EXCEPT THE SLOW LANE IN CASE I NEED TO PULL OVER.  *NM",
        "vin": "WAULC68E53A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/31/2005",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141302,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATES WHILE DRIVING AT  10-15 MPH THE ENGINE BEGAN TO STALL, FOLLOWED BY THE CHECK ENGINE LIGHT.  THERE HAD BEEN NO PRIOR INCIDENTS.  THE VEHICLE WOULD NOT ACCELERATE BEYOND 20 MPH.  THERE WAS THE DISTINCT ODOR OF SOMETHING BURNING COMING FROM THE ENGINE COMPARTMENT BUT NO SMOKE.  HE PULLED OVER TO INSPECT THE VEHICLE.  HE COULD NOT DETERMINE THE PROBLEM AND THE VEHICLE TOWED TO A DEALER.  THE DEALER SAID THERE WAS A FAULTY IGNITION COIL IN CYLINDER THREE.  THIS WAS REPLACED UNDER WARRANTY.  THE SAME SYMPTOMS LATER RETURNED AT A SPEED OF 55 MPH.  THERE WAS A SIGNIFICANT LOSS OF POWER AND HE IMMEDIATELY PULLED OVER.  THE VEHICLE WAS TOWED BACK TO THE DEALERSHIP.  THE DEALER REPLACED THE IGNITION COIL IN CYLINDER ONE. HE OFFERED NO EXPLANATION OF THIS ONGOING PROBLEM.   UPDATED 01/19/06. *JB",
        "vin": "WAULC68E83A"
    },
    {
        "components": "TIRES,WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/19/2005",
        "dateOfIncident": "08/11/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140242,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GANS",
                "productMake": "PIRELLI",
                "productModel": "100022",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT:  2003 AUDI A4.   HAD A FLAT TIRE AND I CALLED INSURANCE COMPANY.  THEY SENT A TECHNICIAN   TO CHANGE TIRE AND TIRE WOULD NOT COME OFF THE WHEEL.  HAD TO GET UNDER VEHICLE AND KICK THE TIRE TO GET IT TO COME OFF.  THEN I  TOOK THE  VEHICLE TO THE DEALERSHIP TO GET THE TIRES TAKEN OFF, GET SURFACES CLEANED, AND TIRES ROTATED. THE TIRES  ARE PIRELLI , P235/45 R17, AND WERE ON  VEHICLE WHEN PURCHASED. THE TIRE PRESSURE THAT MANUFACTURER RECOMMENDED WAS 32.  THE PROBLEM WITH MY VEHICLE WAS WHEN THE LUG NUTS WERE REMOVED THE WHEEL WOULD NOT COME OFF.  THIS WAS THE FIRST TIME  HAD TO CHANGE TIRES SINCE OWNING THE VEHICLE.*AK   UPDATED 12/12/2007 *BF",
        "vin": "WAULC68E53A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/13/2005",
        "dateOfIncident": "10/08/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139628,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 QUATTRO 3.0 - WHILE DRIVING THE CAR JUST STOPPED RUNNING AS IF OUT OF GAS.  IT WAS TOWED TO THE DEALERSHIP AND THE LOCATED THAT THE FUEL PUMP HAD FAILED.  THIS CAR HAS BEEN FULLY SERVICED BY THE DEALER AND HAS 33K MILES.  THE DEALER INDICATED THAT THEY HAVE STARTED TO SEE THESE SHOW UP. *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "10/03/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138956,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 AUDI A4. I CAN NOT REFUEL THE CAR WITH THE OPW MODEL 12VW NOZZLE. THE NOZZLE SHUTS OFF IMMEDIATELY AND SPILLS GAS BACK OUT ONTO THE CAR AND PERSON FUELING THE CAR. ALL OTHER OPW MODELS AND OTHER MAKES OF NOZZLES WORK NORMALLY. THIS IS CAUSING MORE OF A PROBLEM IN MY AREA LATELY BECAUSE MOST NEW GAS STATIONS USE THIS NOZZLE AND AS OLD NOZZLES ARE BEING REPLACED, THEY USE THE OPW 12VW.   *NM",
        "vin": "WAULC68E33A"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/01/2005",
        "dateOfIncident": "08/30/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10135100,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR BRAND NEW 2003 AUDI A4 WAS REAR-ENDED BY A FORD F-550 TRAVELING AT APPROX. 55 MPH.  THE FORD F-550 DID NOT BRAKE BEFORE IMPACT AND HIT THE AUDI WITH SUCH FORCE THAT IT IMPACTED THE VEHICLE IMMEDIATELY IN FRONT WHICH HIT THAT VEHICLE IN FRONT OF IT. ALL WERE STOPPED FOR A TRAFFIC LIGHT. MY WIFE, THE ONLY OCCUPANT AND DRIVER, HAD TO BE CUT OUT OF THE AUDI.  SHE SUFFERED PERMANENT BRAIN INJURY AS A RESULT OF HITTING THE REAR-VIEW MIRROR AND WINDSHIELD. SHE ALSO SUFFERED NUMEROUS OTHER INJURIES.  SHE HIT THE STEERING WHEEL WITH SUCH FORCE AS TO BEND THE BOTTOM OF THE WHEEL INWARD. MY COMPLAINT...THE DRIVER AIR-BAG DID NOT DEPLOY WHILE THE PASSENGER SIDE AIR-BAG DID DEPLOY. HAD THE DRIVERS SIDE AIR-BAG DEPLOYED, SHE MAY HAVE NOT SUFFERED BRAIN INJURY FROM THIS EVENT.  I'VE CONTACTED AUDI SEVERAL TIMES FOR AN EXPLANATION WITH \"BS\" ANSWERS.  I FINALLY TOLD THEM THAT THEY SHOULD HAVE AT LEAST GIVEN HER A NEW CAR. PERHAPS I'M A BIT NAIVE. IN ANY EVENT, I'M CERTAIN THAT THE AIR-BAG SHOULD HAVE DEPLOYED HAD IT BEEN WORKING PROPERLY.  *NM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/29/2005",
        "dateOfIncident": "08/23/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134455,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 QUATTRO 3.0L, 38,517 MILES. FULLY MAINTAINED BY AUDI DEALER W/ DOCUMENTATION.  ENGINE SHUT OFF DURING NORMAL DRIVE IN HEAVY CITY TRAFFIC.  ALMOST LED TO AN ACCIDENT AT AN INTERSECTION.  AUDI DIAGNOSED AS FAILED FUEL PUMP WHICH THEY REPLACED.  SERVICE MANAGER NOTED THAT 3 OTHER NEW MODEL AUDI'S WITHIN SAME WEEK HAD FUEL PUMP FAILURE.  HIGHLY CONCERNING TO HIM AND US. *JB",
        "vin": "WAULT68E13A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/13/2005",
        "dateOfIncident": "07/02/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10128662,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JULY 2, 2005, AT APPROXIMATELY 11:00 A.M., I WAS DRIVING WITH MY TWO CHILDREN (AGES 7 AND 9) NORTH ON INTERSTATE 5 NEAR LAJOLLA, CA.  I WAS TRAVELING AT APPROXIMATELY 70-75 MILES PER HOUR.  SUDDENLY, MY CAR BEGAN TO ACCELERATE.  THINKING THAT THE CRUISE CONTROL HAD ENGAGED, I STEPPED ON THE BRAKE TO DISENGAGE IT.  ALTHOUGH MY CAR SLOWED A SMALL AMOUNT, THE ENGINE CONTINUED TO REV HIGHER.  I THEN TOOK MY FOOT OFF THE BRAKE (FEARING THAT MY BRAKES WOULD WEAR OUT AND WERE NOT VERY EFFECTIVE IN ANY EVENT), AND THE CAR ACCLERATED AGAIN.  I SUCCEEDED IN MOVING TOWARD THE SHOULDER, PUT THE CAR IN NEUTRAL, AND APPLIED THE BRAKE.  WHILE THIS SUCCEEDED IN STOPPING THE CAR, THE ENGINE CONTINUED TO REV UP AS I WAS STOPPED IN THE EMERGENCY LANE.  WITH MY LEFT FOOT ON THE BRAKE, I USED MY RIGHT FOOT TO STEP ON THE ACCELERATOR IN AN EFFORT TO DISENGAGE IT.  AFTER APPROXIMATELY A MINUTE, THE ACCELERATOR DISENGAGED, AND THE ENGINE REV'D DOWN.  AFTER THE INCIDENT, I DROVE THE CAR HOME AT A SIGNIFICANTLY SLOWER SPEED, AND THE PROBLEM DID NOT RECUR.    ON TUESDAY, JULY 5, I CALLED MIRAMAR AUDI AND REPORTED THE PROBLEM TO BEN BOSWELL.  HE ASKED ME WHEN AND WHERE THE INCIDENT TOOK PLACE, AND WHETHER THERE WAS ANY CONSTRUCTION IN THE AREA.  HE EXPLAINED THAT AUDI NORTH AMERICA HAD INSTRUCTED HIM TO ASK THIS QUESTION, BECAUSE THEY HAD RECEIVED OTHER COMPLAINTS OF AUDI A4S WITH THE SAME PROBLEM.  (THERE WAS NO CONSTRUCTION).   HE ALSO TOLD ME THAT HE HAD 4 OR 5 A4S IN THE SHOP WITH THE SAME COMPLAINT.      MY CAR WAS AT MIRAMAR AUDI FROM JULY 5 UNTIL JULY 13.  ON MONDAY, JULY 11, MR. BOSWELL TOLD ME THAT THEY HAD RUN A COMPUTER DIAGNOSTIC ON MY CAR, AND COULD NOT FIND ANY PROBLEM.  HE ALSO TOLD ME THAT HE HAD HAD EXTENSIVE COMMUNICATIONS WITH AUDI NORTH AMERICA, AND THAT HE HAD BEEN TOLD TO RELEASE THE CAR TO ME.  AFTER SEVERAL CONTACTS WITH AUDI NORTH AMERICA (WHICH I CAN PROVIDE IN DETAIL), I WAS TOLD THAT THE PROBLEM WAS MOST LIKELY CAUSED BY MY FLOORMAT BEING OUT OF POSITION.",
        "vin": "WAUAT48H13K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/27/2005",
        "dateOfIncident": "06/25/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10126736,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY AUDI A4 BROADSIDED A TOYATA AVALON (REAR PASSENGER SIDE). POLICE ESTIMATE IMPACT SPEED OF APPROX. 40 MPH. NO AIRBAGS DEPLOYED IN AUDI.",
        "vin": "WAULT68E63A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/01/2005",
        "dateOfIncident": "06/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123814,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS AN AUDI A4 3.0 (NON-QUATTRO). I HAVE EXPERIENCED ON MULTIPLE OCCASSIONS THE FOLLOWING...... WHEN THE CAR IS STARTED AND THE CAR IS PLACED IN REVERSE, THE VEHICLE BEGINS TO BUCK VIOLENTLY. IF I WAS PARALLEL PARKED, I WOULD HAVE HIT THE CAR IN FRONT OF ME AND IN BACK OF ME OR POSSIBLY A PERSON. I KNOW FOR SURE THERE ARE OTHER PEOPLE THAT HAVE EXPERIENCED THIS SAME DANGEROUS PROBLEM AS I HAVE SEEN IT ON AUDI MESSAGE BOARDS. THIS PROBLEM HAS BEEN HAPPENING FOR QUITE SOME TIME NOW. NO ONE SEEMS TO KNOW WHAT TO DO SINCE THE SITUATION IS HARD TO REPEAT AT WILL.",
        "vin": "WAUJT68E33A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/05/2005",
        "dateOfIncident": "01/07/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116436,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE OIL LIGHT ILLUMINATED WHILE DRIVING.  THE ENGINE WAS INSPECTED, AND IT WAS DISCOVERED THAT THERE WAS HEAVY OIL SLUDGE.  THE OIL PUMP HAD TO BE REPLACED.  THE CAR HAD ONLY 26,000 MILES AT THE TIME OF THE REPAIR.  AUDI RECOMMENDS OIL CHANGES EVERY 10,000 MILES WITH SYNTHETIC OIL.  I HAD THE CAR SERVICED BEFORE THE 10000 AND 20000 MILE SCHEDULED MAINTENANCE, AT AUDI DEALERSHIPS.  AUDI HAS NOT REIMBURSED THE COST OF REPAIRING THE ENGINE, DESPITE THEIR WARRANTY EXTENSION TO COVER THE COST OF OIL SLUDGE DAMAGE.*AK",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/01/2005",
        "dateOfIncident": "03/23/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116240,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUN ROOF ON OUR AUDI SPONTANEOUSLY SHATTERED WHILE WE WERE DRIVING ON THE HIGHWAY.  IT MORE OR LESS EXPLODED.  GLASS COVERED THE INSIDE OF THE CAR.  NO ONE WAS INJURED BUT WE ALMOST CAUSED AN ACCIDENT DUE TO THE FACT THIS OCCURED DURING RUSH HOUR TRAFFIC AT 65 MPH.  FOUR TO FIVE INCH DIAMETER PIECES OF GLASS FELL INTO OUR DAUGHTERS CHILD SEAT IN THE BACK SEAT.  WE HAD HAD PROBLEMS WITH THE WINDOW OPENING AND CLOSING ON IT'S OWN AND AUDI HAD WORKED ON THE WINDOW PRIOR TO THE INCIDENT.  THE WINDOW HAD ONCE AGAIN OPENED ON IT'S OWN AND IT WAS CLOSING WHEN IT EXPLODED.  IT SEEMED TO EXPLODE AT THE END OF CLOSING WHEN THE WINDOW RAISES UPWARD TO SEAL.  AUDI CLAIMS THAT THE INCIDENT COULD NOT HAVE HAPPENED THE WAY I HAVE STATED.  I FOUND SEVERAL OTHER INCIDENTS REPORTED ON THE INTERNET OF SUNROOF EXPLOSIONS ON BMW, VOLVO, TOYOTA AND LEXUS AUTOMOBILES.  ALTHOUGH NO ONE WAS INJURED I FEEL AS THOUGH WE WERE LUCKY.  IF MY DAUGHTER HAD BEEN IN THE CAR AT THE TIME SHE WOULD HAVE BEEN HIT BY LARGE PICES OF GLASS OR AN ACCIDENT COULD HAVE OCCURED AS A RESULT OF THE GLASS FALLING INTO THE DRIVERS EYES.  MY HAIR WAS FULL OF GLASS.  I WOULD LIKE TO KNOW HOW MANY CASES OF SIMILAR INCIDENTS HAVE BEEN REPORTED TO YOUR AGENCY.  I TRIED TO LOOK IT UP ON THE INTERNET BUT THE SEARCH IS SPECIFIC TO YEAR, MAKE AND MODEL OF THE CAR.  I WOULD APPRECIATE ANY INFORMATION YOU COULD PROVIDE ON SUNROOF BREAKAGE ON ALL OTHER AUTOMOBILES AS WELL.  THE WINDOW HAS BEEN REPLACED BUT AUDI REFUSES TO COVER THE WINDOW UNDER THE WARRANTY.  I WAS QUITE SURPRISED TO FIND THAT A SUNROOF IS NOT SHATTERPROOF GLASS.*AK",
        "vin": "WAULT68E23A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/03/2005",
        "dateOfIncident": "02/28/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113400,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 50 MPH DRIVER APPLIED THE ACCELERATOR PEDAL AND IT STUCK TO THE FLOOR.  THIS CAUSED THE VEHICLE TO ACCELERATE UNCONTROLLABLY.  DRIVER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE AND PULLED OVER. VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION, BUT  MECHANIC COULD NOT DUPLICATE THE PROBLEM.   *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/14/2004",
        "dateOfIncident": "09/29/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095789,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS MY SECOND AUDI I OWN, I ALREADY WITNESSED FEW KNOW ISSUES WITH THE 2003 A4 MODEL, WHICH HAS THE PIRRELLI TIRES AS POOR QULAITY, ALSO THE FUEL PUMP WHICH IS A FACTORY DEFECT ( NO RECALL FROM AUDI), PLUS LATELY THE GAS INDICATOR WHICH HAS TO DO WITH FUEL PUMP. MY CAR WAS HOLD FOR 3 WEEKS TO BE SERVICED AND AUDI DID NOT EVEN COVER THE TAB OF MY RENTAL DURING THIS TIME, MY EXPERIENCE IS AUDI CUTOMER RELATIONS SHOULD LEARN HOW TO TAKE OF THEIR CUSTOMERS, BECAUSE THE SERVICE SUCKS.*AK",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2004",
        "dateOfIncident": "09/18/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094059,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE STOPPED IN THE MIDDLE OF A DARK ROAD.  IT WAS TOWED,  AND DEALER DISCOVERED THAT FUEL PUMP WAS DEFECTIVE.  MANUFACTURER STATED THERE WERE NO RECALLS.  HOWEVER, MECHANIC CLAIMED THESE VEHICLES WERE PRONE FOR FUEL PUMP FAILURE.*AK",
        "vin": "WAULT68E23A"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/26/2004",
        "dateOfIncident": "03/05/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061664,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL STUCK WHILE DRIVING ON THE EXPRESSWAY AT 70 MPH. WHEN THIS OCCURRED VEHICLE SPEED ACCELERATED TO 90 MPH.  CONSUMER HAD TO STICK FOOT UNDERNEATH THE PEDAL AND LIFT IT UP, AND THEN PUT VEHICLE IN NEUTRAL TO STOP THE ACCELERATION.  *AK  *LA",
        "vin": "WAUJC68E33A"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/07/2004",
        "dateOfIncident": "06/04/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074961,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONCERN WITH PIRELLI TIRE MODEL P235/45R17-PIRELLI P6.-  I HAVE A TOTAL OF 28,000 MILES ON AN AUDI A4. I HAVE HAD TWO BLOWOUTS AND THREE TIRES THAT HAVE NEEDED TO BE REPLACED. SPECIFICALLY, THE SIDEWALLS OF THE TIRES BUBBLE OUT IN WEAK SPOTS. LAST WEEK MY WIFE WAS DRIVING MY CAR AND GOT A FLAT ON THE SIDEWALL, AND I NOTICED WHEN FIXING HER TIRE THAT NOW ANOTHER ONE OF THE TIRES HAS A BUBBLE. I WILL ONCE AGAIN  HAVE TO REPLACE TWO TIRES.  I BELIEVE THIS IS A DANGEROUS PROBLEM THAT COULD RESULT IN LOSS OF CONTROL OF A VEHICLE.*AK    I AM NOT A HIGH PERFORMANCE DRIVER. I DRIVE FOR WORK AND FAMILY RELATED MATTERS ONLY SO THIS PROBLEM IS NOT RELATED TO EXCESSIVE DRIVING SPEEDS OR HARSH HANDLING.    I AM FOLLOWING THIS COMPLAINT WITH A COMPLAINT DIRECTLY TO PIRELLI AND TO AUDI OF AMERICA.    IF DESIRED I CAN FORWARD A DIGITAL PHOTO OF THE TYPICAL BUBBLE.    BRUCE HENDEE",
        "vin": "WAULT68E83A"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "04/13/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10067089,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GANS",
                "productMake": "PIRELLI",
                "productModel": "PIRELLI",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE CONSUMER NOTICED THAT FRONT TIRE ON THE PASSENGER'S SIDE HAD A  BUBBLE.  THE DEALER AND THE MANUFACTURER WERE NOTIFIED, THEY INDICATED THAT THIS TIRE WAS NOT COVERED UNDER THE WARRANTY.   *AK   (PIRELLI P6 FOUR SEASON TIRES)   *SC  *JB",
        "vin": "WAULC6834A1"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/28/2004",
        "dateOfIncident": "05/27/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074432,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 40 MPH, CONSUMER REAR ENDED ANOTHER VEHICLE.  WITHOUT ANY INDICATION, THE DRIVER SIDE AIR BAG DID NOT DEPLOY; HOWEVER, THE PASSENGER SIDE AIR BAG DID.  *LA",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "05/04/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10072101,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 25 MPH AND WITHOUT WARNING STEERING WHEEL LOCKED UP. THIS CAUSED A HEAD ON COLLISION. UPON IMPACT, BOTH FRONTAL AIR BAGS DID NOT DEPLOY.  DRIVER SUSTAINED HEAD AND NECK INJURIES .   DRIVER WENT TO HOSPITAL THE NEXT DAY.  VEHICLE WAS TOWED TO THE DEALER.  *AK",
        "vin": "WAUJC68E23A"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/26/2004",
        "dateOfIncident": "03/20/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064961,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE COMES EQUIPPED WITH A SPORTS RIM THAT LEAVES THE BRAKE ROTORS EXPOSED TO ICE AND SNOW.  IF THE VEHICLE IS NOT WARMED UP FOR 10 MINUTES THERE IS A GLAZE OF ICE ON THE ROTORS. THIS CAUSES BRAKE FAILURE, AND RESULTS IN EXTENDED STOPPING DISTANCE. THE DEALERSHIP CANNOT DUPLICATE THE PROBLEM, AND INDICATED THAT THE BRAKES WERE FINE. ALSO, AT 70 MPH THE WINDSHIELD WASHER PUMP FAILED TO FUNCTION. THIS WAS DUE TO SALT IN THE ROAD WHICH CAUSED THE WASHER TO SEIZE. *AK",
        "vin": "WAULC68E23A"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2004",
        "dateOfIncident": "03/25/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063868,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 1/04, DURING NORMAL DRIVING CONDITIONS ONE EVENING, MY '03 1.8T A4 BEGAN SHAKING VIOLENTLY AS I BEGAN ACCELERATED FROM A STOP SIGN. THE CHECK ENGINE LIGHT CAME ON AND I LOST A SIGNIFICANT AMOUNT OF POWER AND COULDN'T ACCELERATE WELL. THE DEALER STATED THAT I BLEW AN IGNITION COIL.  NOT 2 MONTHS LATER, IN EARLY 3/04, THE SAME EXACT SITUATION OCCURED AND I HAD TO HAVE ANOTHER IGNITION COIL REPLACED.    I HAVE LEARNED THAT THE MFR HAD A PRODUCT RECALL FOR THIS EXACT PROBLEM, HOWEVER MY VEHICLE'S COMPONENTS ARE NOT COVERED BY THOSE UNDER RECALL.  I WAS TOLD I HAVE THE \"NEWER\" VERSIONS OF THE IGITION COILS ALREADY IN MY CAR.  WHILE THEY MIGHT BE NEWER, THEY SURE HAVEN'T SOLVED THE UNDERLYING PROBLEM! TWO BLOWN IGITION COILS IN LESS THAN 2 MONTHS AND I CAN'T GET THE MFR TO REPLACE THE OTHER 2 COILS THAT I'M CERTAIN WILL GO OUT AT SOME POINT SOON TOO.",
        "vin": "WAULC68E13A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": "03/16/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062427,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPER MOTOR AND WASHER FAILED THREE TIMES IN THE PAST TWO MONTHS AND EACH TIME IT WAS REPAIRED BY THE DEALER.   *NM",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": "03/13/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062484,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2003 AUDI A4 (3.0 ) ON  A HIGHWAY AT 60 MPH. TIME - 11:30 PM ON  SAT.,MARCH 13.  THERE WAS A SUDDEN POWER FAILURE: ENGINE SHUT DOWN AND THE HEADLIGHTS AND POWER SEERING WENT OUT. I MANAGED TO GET THE CAR OFF THE ROAD AND ONTO THE SHOULDER.  THE CAR WAS TOWED TO THE DEALER - PALISADES AUDI IN ROCKLAND COUNTY, NY.  ACCORDING TO THE SERVICE DEPT AT PALISADES AUDI, THE CAUSE OF THIS DISASTEROUS FAILURE WAS A DEFECTIVE FUEL PUMP.    I FEEL LUCKY TO BE ALIVE AFTER WHAT HAD HAPPENED WITH MY CAR ON THE NIGHT OF 3/13/04.",
        "vin": "WAULT68EX3A"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069092,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PARKING THE 2003 A4 AUDI THE CAR HAD A SUDDEN ACCELERATION AND RAN INTO A BUILDING.",
        "vin": "WAUJC68E93A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070247,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM THAT I HAVE IS WHEN IT RAINS. ALL FOUR DOORS FILL WITH UP WATER. WHEN I OPEN ANY DOOR A QUART OR MORE POURS OUT OF EACH DOOR, DOOR SILLS ARE ALWAYS WET. IN THE WINTER, WATER FREEZES ON THE DOOR SILLS AND CAN'T OPEN DOOR OR HAVE TROUBLE (CAN'T DRIVE THE CAR IF I CAN'T GET IN IT!) TOOK THE CAR TO THE DEALER TO GET IT FIXED.  THEY TOLD ME THE CAR IS TO AUDI SPEC.'S AND DID NOTHING! CALLED AUDI CUSTOMER RELATIONS AND THEY ARE DOING NOTHING AND ALSO I HAVE BEEN WAITING FOR A MANAGER TO RETURN MY PHONE CALL FOR A WEEK NOW. I HAVE LEFT SEVERAL MESSAGES, STILL NO RETURN PHONE CALL (GREAT AUDI SEVERCE!). FROM THIS WATER DAMAGE THE MIRRORS ARE NOT RESPONDING TO THEIR HOLD POSITIONS AND I'AM ALSO AFAID FROM ALL THE MOISTER IN THE DOORS THAT THE ELECTRONICS WE START TO CORROSION PROCESS AND WHO PAYS FOR THAT IN THE LONG RUN? I WOULD THINK THE LEAST THEY COULD HAVE REPLACED THE WEATHER STRIPPING AROUND ALL THE DOORS. MY AUDI IS 6 MONTHS OLD WITH 1800 MILES, FOUR DOORS RUSTING AWAY, AND THE DEALERSHIP AND AUDI WANTS TO DO NOTHING ABOUT IT. I EVEN SHOWED THEM THE RUST AT BOTTOM OF DOORS. WHAT HAPPENS WHEN THE ICE BUILDS UP SO MUCH AND CAN'T GET OUT OF THE CAR, IS THIS A SAFTY ISSUE? I'M JUST TIRED OF GETTING MY SHOES AND FEET WET GETTING INTO A $40,000 CAR, THEN HAVE TO GO GET CHANGED, BUT FOR SOME REASON THIS IS OK? I JUST NEVER OWNED A VEHICLE IN WHICH WATER IS ALLOWED TO GET INTO THE CAR'S DOOR BEFORE. I WOULD LIKE TO MEET THE ENGINEER WHO DESIGNED THIS FEATURE!",
        "vin": "WAULC68EX3A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070918,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONING UNIT BURST SPRAYING FREON ALL OVER ENGINE COMPARTMENT. REPAIRS WERE ATTEMPTED FOUR TIMES AND AFTER THE FOURTH TIME, I NOW HAVE WATER FROM THE AIRCONDITIONING SYSTEM DRAINING INTO THE CAR ON THE FRONT PASSENGER SIDE, JUST BELOW THE GLOVE COMPARTMENT.",
        "vin": "WAULC68E43A"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/24/2003",
        "dateOfIncident": "11/10/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047482,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI A4 3.0 WITH CVT TRANSMISSION, PURCHASED NEW 2/2004, HAS 8000 MILES ON IT.  DURING THE PAST 2 WEEKS (THE PAST 500 MILES) I HAVE NOTED THE FOLLOWING PROBLEM 4 DIFFERENT TIMES: UPON PRESSING THE ACCELERATOR WHILE AT A COMPLETE STOP, THE TRANSMISSION SEEMS NOT TO \"ENGAGE\" AND THE VEHICLE DOES NOT MOVE.  UNFORTUNATELY, DURING 3 OF THOSE OCCASIONS, MY VEHICLE WAS ON A DOWNWARD INCLINE AND I WAS ATTEMPTING TO MAKE A RIGHT TURN INTO A STREET WITH TRAFFIC.  I THEREFORE COASTED INTO TRAFFIC BUT WAS UNABLE TO ACCELERATE; I WAS VERY LUCKY NOT TO HAVE BEEN HIT BY THE TRAFFIC COMING FROM MY LEFT.  AFTER WAITING A FEW LONG SECONDS, THE TRANSMISSION WOULD EVENTUALLY SEEM TO \"ENGAGE\", AND I WOULD BE ON MY WAY.    *LA",
        "vin": "WAUJT68E43A"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/12/2003",
        "dateOfIncident": "04/13/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041665,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI ALL ROAD HAS A CONTINUAL PULL TO THE RIGHT. IT WILL NOT DRIVE STRAIGHT FOR MORE THAN 5-8 SECONDS AT A TIME, ON MOST ROAD SURFACES. I HAVE TAKEN THE CAR IN FOR REPAIRS FOUR TIMES IN 3400 MILES. EACH TIME THE CAR WAS OUT OF ALIGNMENT AND HAD TO BE ADJUSTED. THE SERVICE MANAGER SUGGESTS THAT THE CAR IS PERFORMING TO FACTORY SPECIFICATIONS, BUT IT STILL HAS A PULL TO THE RIGHT.  *LA",
        "vin": "WA1YD64B13N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/02/2003",
        "dateOfIncident": "10/01/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041107,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE SIDEWALL RUPTURED ON A GOODYEAR WRANGLER F1, 225/55R17 TIRE.  *JB",
        "vin": "WA1YD64B93N"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "08/22/2003",
        "dateOfIncident": "07/31/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10033324,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUDI A4 QUATRO.  I WAS ONLY PERSON IN THE CAR.  SLOWING TO A STOP WAS HIT FROM THE REAR @ 55MPH BY A FORD TRUCK F550. TRUCK #4 SLAMMED INTO MY REAR CAR #3 WHICH SLAMMED INTO CAR #2 & FINALLY CAR #1.  *AK    MY TRUNK ENDED UP IN MY BACK SEAT, MY FRONT LOOKED LIKE AN ACORDIAN. THOUGH I AM ALIVE. MY DRIVER AIRBAG & DRIVER CURTAIN DID NOT DEPLOY!! MY SEAT BELT DID NOT HOLD ME BACK. THE FORCE WAS SO GREAT THAT I BROKE THE REAR VIEW MIRROR WITH MY HEAD AND I CONTINUED INTO THE WINDSHIELD.  I HAVE SEVERE CONCUSION, CAN NOT WORK & OF COURSE HAVE A WONDERFUL CASE OF WHIPLASH!    AUDI CONSUMER IS TRYING TO TELL US THAT THE \"PASSANGER\" AIR BAG WENT OFF BECAUSE THE SEATBELT WAS NOT CLOSED!  HOW STUPID!  I THOUGHT BEING HIT @ THAT SPEED WITH SUCH A FORCE TO CREATE A CHAIN REACTION INTO THREE CARS..THE AIRBAGS SHOULD HAVE DEPLOYED & THE DRIVER SEATBELT SHOULD HAVE PREVENTED ME FROM HITTING MY STERNUM ON THE STEERING WHEEL.  WHICH, BY THE WAY WAS BENT BY MY BODY! ON THE FORCE OF MY CAR HITTING THE CAR IN FRONT OF ME...I BROKE MY SEAT & WAS IN A PRONE POSITION WHEN THE FIREDEPARTMENT CAME TO CUT ME OUT OF MY CAR.      CAN YOU  PLEASE ADVISE @ WHAT SPEED AN AIRBAG SHOULD DEPLOY! SHOULD THEY NOT DEPLOY WITH BACK HIT, AS WELL AS, A FRONT HIT?    EVEN THOUGH I WAS SLOWING TO 5MPH, I HAD AMPLE ROOM BETWEEN MY CAR & THE CAR IN FRONT OF ME. I WWAS HIT @55MPH AND THE FORD F550 DID NOT EVEN BRAKE OR ATTEMPT TO STOP. THUS MY SPEEN BECAME MORE THAN 5MPH.",
        "vin": "WAULC68E63A"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "05/05/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034081,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE EXPERIENCED AN EXPLOSION AND CHECK ENGINE LIGHT ILLUMINATED AND THERE WERE LOUD NOISES COMING FROM UNDER THE VEHICLE AND PARTS OF THE VEHICLE WERE ON THE GROUND. THE CAR THEN WAS TOWED TO THE DEALERSHIP, AND THEY CLAIMED THE VEHICLE WAS INVOLVED IN SOME TYPE OF IMPACT WHICH CAUSED THE EXPLOSION TO OCCUR, AND AUDI WAS NOT RESPONSIBLE FOR DAMAGES.  THE DEALERSHIP  FAILED TO FIND THE PROPER REASON FOR EXPLOSION. THE CONSUMER HAD TO PURCHASE A RENTAL CAR AT HER OWN EXPENSE TO HAVE A VEHICLE.  *MR  *CB   *JB",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "04/03/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015152,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PARKING BRAKE FAILED TO HOLD AND CAUSED AN ACCIDENT.   *JB   *SCC  *JB",
        "vin": "WAUJC68E13A"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "06/17/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023228,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLINDING BRIGHT HEADLIGHTS ON SOME NEW CARS ARE DANGEROUS. I FLASH MY BRIGHTS AT THEM THINKING THAT IS THE PROBLEM. IF CAR MANUFACTURERS CONTINUE TO PUT THEM ON NEW CARS, WILL THEY BE LIABLE FOR ACCIDENTS CAUSED BY THE BLINDING LIGHT?  *JB",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/10/2003",
        "dateOfIncident": "05/02/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021376,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI A4 FAILED TO START ON DECEMBER 24TH, 2002 AND MAY 2ND, 2003.  BOTH TIMES I WAS LEFT STRANDED.  THE FIRST TIME THEY REPLACED THE STEERING LOCK, IGNITION CYLINDER, AND STEERING COLUMN.  AFTER THE PROBLEM OCCURED A SECOND TIME, THEY REPLACED THE INSTRUMENT CLUSTER.  THIS PROBLEM OCCURRED AT 5,000 AND 11,000 MILES AND SHOULD NOT HAPPEN TO A NEW CAR.  IT IS A SAFETY ISSUE BECAUSE IT HAS LEFT ME STRANDED 2 TIMES.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/13/2003",
        "dateOfIncident": "12/20/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018630,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STEERING WHEEL IS TURNED TO LEFT OR RIGHT AND GRINDING/GROANING NOISE CAN BE HEARD.  I HAVE TAKEN THE CAR IN 4 TIMES AND THEY ARE UNABLE TO FIX THE PROBLEM.*JB",
        "vin": "WAULT68E23A"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": "12/15/2002",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005300,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A4",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A4 3.0 QUATTRO.  THE CAR HAS PROBLEM WITH OUTSIDE MIRRORS.  BOTH MIRRORS AREN'T ADJUST TO ITS POSITION THAT IS SET IN MEMORY.  EVERYTIME THE CAR WAS USED BY MY SPOUSE, I HAVE TO MANUALLY READJUST BOTH MIRROS INSTEAD OF AUTOMATICALLY ADJUST BY WHAT WAS PROGRAMMED IN MEMORY.   MORE OVER, THE DRIVER OUTSIDE MIRROR JUST CHANGE IT POSITION AFTER 1 OR 2 DAYS OF DRIVING.    IT IS VERY SCARY AND UNSAFE I FEEL EVERYTIME WHEN I DRIVE THE CAR WITH A WORRY THAT THE MIRROR ISN'T IN ITS POSITION THAT I SET.",
        "vin": "WAULT68E13A"
    }
]