[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "03/31/2021",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405748,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE GAS TANK OR COMPONENTS OF THE TANK ARE LEAKING GAS WHEN MORE THAN A SMALL AMOUNT OF GAS IS PUT INTO THE TANK.  GAS LEAKS ALL OVER THE GROUND FROM THE TANK AND THE CABIN FILLS WITH GAS FUMES.  MY 18 SON HAS BEEN DRIVING THIS CAR AND I WILL NOT ALLOW HIM OR ANYONE ELSE TO DRIVE THE CAR NOW.  AFTER READING ONLINE THAT MANY PEOPLE HAVE THIS SAME PROBLEM, I AM SHOCKED THAT THIS IS NOT A RECALL WHEN IT COULD BE POTENTIALLY LIFE THREATENING AND THAT AUDI WANTS TO CHARGE 3K TO LOWER THE TANK AND REPAIR.",
        "vin": "WAULD64B13N"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2018",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11092560,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A6. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT STATED THAT THE FAILURE OCCURRED MULTIPLE TIMES. THE VEHICLE WAS TAKEN TO AN UNKNOWN DEALER AND THE CRANKSHAFT SENSOR WAS REPLACED, BUT THE FAILURE PERSISTED. THE VEHICLE WAS NOT TAKEN BACK TO A DEALER FOR DIAGNOSTIC TESTING OR REPAIRS. THE MANUFACTURER WAS CONTACTED, BUT WAS UNABLE TO ASSIST. THE FAILURE MILEAGE WAS 149,000.",
        "vin": "WAULT64B43N"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/25/2018",
        "dateOfIncident": "01/23/2018",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11064868,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* TAKATA RECALL. THE CONTACT OWNS A 2003 AUDI A6. THE CONTACT STATED WHILE DRIVING AT VARIOUS SPEEDS ON THE HIGHWAY, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. A DEALER WAS NOT CONTACTED. THE MANUFACTURER WAS NOT CONTACTED AND MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 149,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/11/2017",
        "dateOfIncident": "02/23/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11004314,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT ON, VEHICLE WILL NOT PASS EMISSIONS TESTING.  AUDI DETERMINED THAT IT WAS DUE TO A FUEL LEAK FROM A CRACK IN THE PASSENGER SIDE REAR ROLLOVER VALVE. VEHICLE HAD BEEN RECALLED IN PAST FOR SIMILAR ISSUE (PERFORMED). TANK HAS 4 ROLLOVER VALVES, ONLY ONE (FRONT DRIVER) INCLUDED IN PRIOR RECALL. INITIAL QUOTED $3,300 TO REPLACE TANK. AUDI OFFERED TO PAY FOR REPLACEMENT TANK WITH THE EXCEPTION OF ~$600 (REPAIR ORDER ATTACHED).  REPAIR COMPLETED ON 2/23/2017, CAR PASSES STATE INSPECTION. AS YOU CAN SEE BY THE \"STAINING\" IN THE ATTACHED PHOTO, THE LEAK WAS SIGNIFICANT    DEALER THEN CALLS TO SAY THAT CAR NEEDS TO BE RETURNED TO PERFORM PRIOR RECALL ON THE NEWLY INSTALLED TANK.  RECALL TO BE PERFORMED ON ONLY THE ONE ROLLOVER VALVE (DRIVER FRONT) THAT CAN BE ACCESSED WITH OUT REMOVING FUEL TANK.  NOT THE VALVE THAT WAS LEAKING AND NECESSITATED THE REPLACEMENT.    I REQUESTED THAT AUDI PERFORM RECALL ON ALL 4 ROLLOVER VALVES AS THEY INSTALLED A KNOWINGLY DEFECTIVE PART AND THE RISK OF ANOTHER CRACK/LEAK EXISTS.  DEALER SAYS AUDI REFUSES.  I HAVE MADE SEVERAL CALLS TO BOTH DEALER AND AUDI WITH NO RESPONSE FROM AUDI BEYOND A CONVERSATION WITH CUSTOMER SERVICE.  CHECK ENGINE LIGHT BACK ON 5/08/2017. EMAILED DEALER ON 5/11/2017 (ATTACHED PDF) WITH MY REQUEST (AGAIN), AND HAVE RECEIVED NO CONTACT FROM AUDI.  RETURNING CAR TO DEALER FOR RECALL ON THE ONE ROLLOVER VALVE ON 7/12/17.   AUDI IS PUTTING THIS CAR BACK ON THE ROAD WITH THE STRONG POTENTIAL OF A FUEL LEAK.",
        "vin": "WAUVT64B03N"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/12/2017",
        "dateOfIncident": "05/12/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985459,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING IN LIGHT RAIN AND SAW A SMALL PUDDLE OF WATER AHEAD SO I SLOWED DOWN AND WENT THROUGH IT AT 10MPH, ALL OF THE SUDDEN MY STEERING WHEEL LOCKS UP AND IS STUCK GOING RIGHT, GRINDING NOISE CAME FROM THE FRONT DRIVERS WHEEL. I SOMEHOW MANAGED TO GET THE VEHICAL TO A FIRE STATION AND PARK IT THERE AFTER 30M AND ONLY GOING 20FT THEN ALL OF A SUDDEN WHILE I'M PRESSING THE GAS PEDDLE THE HORRIBLE GRINDING NOISE COMES BACK AND THE CAR GOES NO WHERE IN DRIVE OR REVERSE.",
        "vin": "WAULT64B73N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/02/2017",
        "dateOfIncident": "03/30/2017",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969985,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SUNROOF EXPLODED WHILE TRAVELING ON THE FREEWAY.",
        "vin": "WAUML64B73N"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "11/01/2016",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928760,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A6. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED A PUDDLE OF FUEL IN THE DRIVEWAY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE ROLLOVER VALVE HAD A CRACK, CAUSING THE FUEL TANK TO LEAK. THE VEHICLE WAS REPAIRED PER A RECALL, BUT THE FAILURE RECURRED. THE VEHICLE WAS NOT REPAIRED AGAIN. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE RECALL INFORMATION WAS NOT PROVIDED. THE FAILURE MILEAGE WAS APPROXIMATELY 180,000.",
        "vin": "WAUML64B43N"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "10/17/2014",
        "dateOfIncident": "10/15/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648381,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE 2003 AUDI A6 QUATTRO 4.2 L. I HAD IN SHOP FOR REAR BRAKES AND MECHANIC NOTED FUEL LEAKING/DRIPPING FROM FRONT DRIVERS SIDE OF PLASTIC FUEL TANK. I DID INTERNET SEARCH AND FOUND RECALL CAMPAIGN 11V267000 AND MANY COMPLAINTS REGARDING SIMILAR LEAKS. I VERIFIED MANUFACTURE DATE 4/3/(2002 OR 2003?) FROM VEHICLE WHICH FALLS IN WINDOW COVERED BY RECALL OF UNITS MANUFACTURED BETWEEN JUNE 19, 2001 THROUGH JUNE 8, 2004. I CONTACTED AUDI AMERICA AND EVENTUALLY SPOKE WITH XXXX AT [XXX]. SHE ASSURED ME THAT MY CAR WAS EITHER NOT SUBJECT TO THE RECALL OR HAD BEEN FIXED. I TOLD HER I WAS THE OWNER OF THE  CAR AT THE TIME OF THE RECALL ( MAY 2011) AND MY CAR HAD NOT BEEN FIXED. SHE ROBOTICALLY REPEATED THAT MY CAR HAD EITHER BEEN FIXED  OR NOT PART OF THE RECALL. I ASKED HER TO VERIFY THAT IT HAD BEEN FIXED AND SHE SAID THEY HAVE NO RECORDS TO SHOW THAT. SHE SAID I COULD CONTACT THE DEALER THAT ORIGINALLY SOLD THE CAR. I SAID WHY WOULD A DEALER IN WISCONSIN WHO SOLD THE CAR IN 2003 HAVE ANY RECORDS REGARDING A RECALL ISSUED IN 20011 WHEN I OWNED THE CAR? SHE WAS SILENT. I ASKED FOR A LIST OF ALL VINS IN THE RECALL. SHE SAID SHE COULD NOT GIVE ME THAT. SHE AGREED TO SEND ME A \"RANGE\" OF AFFECTED VIN'S. SHE SAID THEY MIGHT BE ABLE TO HELP ME OUT BUT I NEED TO HAVE AND EVALUATION DONE AT MY EXPENSE AT AN AUDI DEALER TO DETERMINE WHAT IS WRONG. I SAID I KNOW WHAT IS WRING, IT IS LEAKING GAS FROM THE ROLLOVER VALVE CONNECTION ON THE TANK AND REPORTED ALL OVER THE INTERNET IN  AUDI FORUMS ETC. I HAVE MADE AN APPOINTMENT WITH AUDI FOR 31 OCTOBER MIN 1 HR LABOR AT $110/HR TO EVALUATE MY LEAK.  THIS RECALL NEEDS TO BE ENFORCED AND AUDI NEEDS TO BE HELD ACCOUNTABLE FOR THEIR EVASIVE RESPONSES.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "WAUML64B43N"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/10/2014",
        "dateOfIncident": "10/09/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10643907,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILED CT EMISSIONS TEST.  CHECK ENGINE LIGHT ILLUMINATED.  CONFIRMED CODE TO BE P0741.  INFORMED BY AUTHORIZED TECHNICIAN THAT THE TORQUE CONVERTER REQUIRES REPLACEMENT.  *TR",
        "vin": "WAULT64B53N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/21/2014",
        "dateOfIncident": "08/01/2014",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629775,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AT TIMES WHEN  DRIVING THE CAR THE ACCELERATION BECOMES SLOW AND IT STALLS WITH A JERK LIKE IT'S GOING TO JUST STOP ALSO, WHEN THE  CAR IS PUT IN  REVERSE GEAR  IT WILL NOT MOVE. I AM STUCK. THE PRND FLASHING ON THE DASHBOARD. I BECOME AFRAID BECAUSE THIS CAN CAUSE SERIOUS ACCIDENTS.",
        "vin": "WAUJT64B13N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/25/2014",
        "dateOfIncident": "06/10/2014",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10605917,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A6. THE CONTACT STATED THAT THE SERVICE ENGINE WARNING LIGHT ILLUMINATED. THE CONTACT MENTIONED A LOUD NOISE COMING FROM THE FRONT OF THE VEHICLE INTERMITTENTLY. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO RESET THE CODES BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE AUTHORIZED DEALER WHO INDICATED THAT THE ENGINE MOUNT NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. IN ADDITION, THE CONTACT STATED WHILE DRIVING 60 MPH, SMOKE STARTED TO EMIT FROM THE ENGINE COMPLARTMENT. THE CONTACT MENTIONED THAT THE FIRE HAD CONSUMED AND BURNED THROUGH THE HOOD AROUND TO THE FRONT DRIVERS SIDE OF THE VEHICLE. THE CONTACT EXITED THE VEHICLE AND THE FIRE DEPARTMENT WAS ABLE TO EXTINGUISH THE FIRE. A POLICE REPORT WAS FILED. NO INJURIES HAD BEEN SUSTAINED. THE CONTACT WAS NOT NOTIFIED OF NHTSA CAMPAIGN ID NUMBER: 11V267000 (FUEL SYSTEM, OTHER), NHTSA CAMPAIGN ID NUMBER: 07V375000 (FUEL SYSTEM, GASOLINE) AND NHTSA CAMPAIGN ID NUMBER: 08V157000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS DESTROYED. THE CONTACT WAS AWAITING AN INSURANCE ADJUSTOR TO INSPECT THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 87,434.   UPDATED 08/25/14*LJ  UPDATED 09/5/2014   *JS",
        "vin": "WAULT64B83N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2013",
        "dateOfIncident": "08/19/2013",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10537368,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRE STARTED UNDER DASHBOARD AS I WAS DRIVING. I STOPPED THE CAR IN THE MIDDLE OF THE ROAD AND QUICKLY JUMPED OUT THE CAR WHEN SAW A FLAME. THIS WAS THE MOST FREIGHTING EXPERIENCE IN MY LIFE.   *TR",
        "vin": "WAULT64B53N"
    },
    {
        "components": "ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "05/15/2013",
        "dateOfIncident": "05/02/2013",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512114,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 3, 2013, I WAS DRIVING ON THE EXPRESSWAY AT APPROXIMATELY 10MPH. SUDDENLY, I BEGAN SMELLING SMOKE.  I THOUGHT THE SMOKE WAS COMING FROM NEARBY TRUCKS.  HOWEVER, SOON AFTER, SMOKE WAS PROFUSELY COMING THROUGH MY GLOVE COMPARTMENT.  I PULLED OVER, TURNED THE CAR OFF, AND EXITED THE CAR. ABOUT 5 MINUTES LATER, THIS VEHICLE ENGULFED IN FLAMES, BEGINNING WITH THE HOOD!  THE WIND SHIELD THEN SHATTERED APPROXIMATELY 3 MINUTES LATER.  BY THIS TIME, THE FIRE DEPARTMENT ARRIVED AND BATTLED THE FIRE APPROXIMATELY 20 MINUTES.  THERE WAS NO PREVIOUS SIGN THAT CAR SERVICE WAS NECESSARY.  FURTHERMORE, ACCORDING TO THE DEALER AND DMV, 3 MONTHS AGO, THERE WAS A CLEAN EMISSIONS AT THE TIME OF PURCHASE.   *TR",
        "vin": "WAULT64B73N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/04/2012",
        "dateOfIncident": "07/25/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483312,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TORQUE CONVERTER DISENGAGES AND POWER / RPM SURGE OCCURS.  *TR",
        "vin": "WAUVT64B83N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EXTERIOR LIGHTING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/09/2012",
        "dateOfIncident": "10/09/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479363,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BRAKE LIGHTS ARE ON ALL THE TIME AND IT REVES ALL THE TIME.  *TR",
        "vin": "WAULT64BX3N"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/26/2012",
        "dateOfIncident": "08/29/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10477126,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A6 2.7 QUATTRO. THE CONTACT STATED WHILE TRAVELING 20 MPH THE ABS SYSTEM ACTIVATED CAUSING THE VEHICLE TO VEER TO THE LEFT. THE VEHICLE WAS ABLE TO BE DRIVEN TO THE CONTACT'S HOME. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 89,000 AND THE CURRENT MILEAGE WAS 90,500.",
        "vin": "WAULD64B83N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/31/2012",
        "dateOfIncident": "01/12/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10473165,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION STARTED TO SHUDDER AND SOMETIMES THE TRANSMISSION DOES NOT GOES TO NEUTRAL WHEN THE CAR IS STOPPED, ENGINE REVS AND IT IS DIFFICULT TO STOP. PRND DISPLAY ON DASHBOARD IS BLINKING. CHECK ENGINE LIGHT IS ON. FAULT CODE SHOWS FAILURE ON TRANSMISSION CONTROL MODULE.  *TR",
        "vin": "WAUJT64B13N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/26/2012",
        "dateOfIncident": "03/22/2012",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453111,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FILLING THANK MORE THAN 2 QUARTERS WILL START SPILLING GAS, THE FUMES ARE COMING FROM THE TOP OF THE GAS THANK, DRIVER SIDE, UNDER THE REAR SEAT.  *TR",
        "vin": "WAUML64B63N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2011",
        "dateOfIncident": "12/18/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440535,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON DECEMBER 18, 2011 I WAS DRIVING DOWN THE ROAD AND MY VEHICLE STALLED.  I HAD MY CAR TOWED TO THE LOCAL AUDI DEALER AND WAS TOLD THAT IT NEEDED A NEW FUEL PUMP.     I CONDUCTED AN INTERNET SEARCH AND DISCOVERED THAT MY AUDI HAD BEEN PART OF A RECALL AND I ASKED THE LOCAL DEALER IF THE RECALL REPAIR HAD EVER BEEN CONDUCTED, THEY TOLD ME THAT MY VEHICLE WAS NOT PART OF A RECALL.  THEY TOLD ME THAT ONLY AUDI A-4'S WERE PART OF THE RECALL.    HOWEVER, THE NHTSA WEBSITE SHOWS A LETTER DATED JULY 23, 2007 SENT FROM VOLKSWAGEN OF AMERICA, INC. (PARENT COMPANY OF AUDI OF AMERICA, INC.) TO [XXX] OF NHTSA NOTIFYING NHTSA THAT VW OF AMERICA IS RECALLING AND REPLACING FUEL PUMPS ON VW PASSAT'S, AUDI A-4'S AND AUDI A-6'S, ADDITIONALLY, THE LETTER LISTED A RANGE OF VIN'S FOR EFFECTED AUDI A6'S THAT INCLUDED MY VIN.      IN THE AFOREMENTIONED LETTER, VW OF AMERICA TOLD NHTSA THAT 'ANY SUBJECT VEHICLE THAT IS PRESENTED FOR SERVICE TO AN AUTHORIZED VOLKSWAGEN/AUDI DEALER WILL BE REPAIRED FREE OF CHARGE. COULD SOMEONE PLEASE ASSIST ME IN CAUSING VW OF AMERICA TO DO WHAT THEY TOLD NHTSA THEY WERE GOING TO DO?  VW OF AMERICA NEVER NOTIFIED ME OF THE SAFETY ISSUE OR OF THE RECALL, AND WHEN I PRESENTED THIS INFORMATION TO THE DEALER THEY STILL REFUSED TO PAY FOR THE REPAIR.    AUDI ENDANGERED ME AND LIKELY OTHER CONSUMERS BY NEVER INFORMING US OF THE RECALL AND  I HAVE BEEN FORCED TO PAY OVER $500 TO REPAIR A PART THAT WAS PART OF A RECALL AND WOULD BE REPAIRED FREE OF CHARGE.      COULD YOU PLEASE ASSIST ME IN COLLECTING MY FUNDS FROM AUDI?  ADDITIONALLY, I BELIEVE THEY SHOULD BE SUBJECT TO SIGNIFICANT PENALTIES AND FINES FOR DECEIVING NHTSA.      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*TR",
        "vin": "WAULT64B43N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/20/2011",
        "dateOfIncident": "12/15/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10440541,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 AUDI A6. THE CONTACT WAS DRIVING 55 MPH WHEN THE VEHICLE STARTED TO SHUDDER DECELERATED ABNORMALLY. THE VEHICLE WAS TOWED TO THE DEALER WHO ADVISED THE CONTACT THAT THE FUEL PUMP FAILED AND NEEDED TO BE REPLACED. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 07V375000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP) BUT WAS ADVISED BY THE DEALER THAT THE VIN WAS NOT INCLUDED IN THE RECALL.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 109,000.  ...UPDATE 01/20/12 *BF    UPDATED 02/03/12*JB",
        "vin": "WAULT64B43N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/12/2011",
        "dateOfIncident": "07/12/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10412769,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHT SWITCH FAILURE.  HAD IT FIXED, BUT THE PROBLEMS SEEMS TO BE NOT IN THE BRAKE LIGHT SWITCH ITSELF, BUT THE WIRING OR SOCKETS TO THE SWITCH. USED SAME SWITCH, BUT SOON AS CAR IS TURNED OFF AND TURNED BACK ON, SWITCH TENDS TO WORK ONLY FOR A COUPLE OF DAYS AND ABS SYSTEM SHOWS UP AGAIN WITH NO BRAKES LIGHTS AT ALL.  TOOK TO AUDI DEALER IN WHICH THEY SAID THAT THERE HAS BEEN MANY PROBLEMS WITHIN THIS SYSTEM. BUT TO TOTALLY FIX THE PROBLEM WOULD RUN ANYWHERE FROM 700.00 TO 1200 DOLLARS ON A 35.00 TO 45.00 PART. NO BRAKES COULD LEAD TO SERIOUS ACCIDENTS NOT KNOWING THAT YOUR BRAKES LIGHTS ARE ACTUALLY OUT.  PLEASE PLEASE RECALL THIS ISSUE ON ALL AUDI'S.",
        "vin": "WAULT64B53N"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "06/02/2011",
        "dateOfIncident": "05/03/2011",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10404171,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY ABS MODULE.  *TR",
        "vin": "WAULD64B83N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2011",
        "dateOfIncident": "05/20/2011",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402332,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 A6 QUATTRO AVANT 3.0   CAR RAN FINE DRIVING TO WORK. WHEN LEAVING AT END OF DAY, STARTED CAR AND IT RAN VERY ROUGH I DECIDED TO REVERSE BACK INTO PARKING SPACE AND AT THAT POINT NOTED SMOKE COMING FROM UNDER HOOD (CAR HAD RUN FOR APPROXIMATELY 20 SECONDS). TURNED OFF ENGINE, OPENED   HOOD, AND FOUND THE DRIVERS SIDE REAR COIL PACK BURNING. EXTINGUISHED FLAME USING A BASEBALL CAP TO SMOTHER IT OUT. COIL PACK CONTINUED TO SMOKE AND REIGNITE DUE TO BURNING INSIDE COIL PACK. JAMMED SCREWDRIVER INTO PACK TO ROOT OUT FLAME. HAD CAR TOWED TO AUDI DEALER - AWAITING REPAIR. THERE IS AN ACTIVE RECALL CAMPAIGN FOR BAD COIL PACKS (28F2 / J1)   - RECALL STATES CHECK ENGINE LIGHT MAY COME ON AND CAR WILL RUN ROUGH, FURTHER RECOMMENDS RETURING VEHICLE TO DEALER AT THAT TIME. THERE IS APPARENTLY TWO WAYS THE PACK CAN FAIL - A FAULT ON THE HIGH VOLTAGE END JUST BYPASSES THE SPARK TO THE ENGINE BLOCK CAUSING A MISFIRE. A FAULT AT THE LOW VOLTAGE END RESULTS IN A SHORT AND MOST LIKELY A FIRE. THIS POTENTIAL FOR FIRE IS UNDERSTATED BY AUDI AND SHOUD BE CLEARLY IDENTIFIED IN THE RECALL CAMPAIGN TO ENSURE THE RIGHT URGENCY IS PLACED ON THIS ISSUE. THE FACT IS, I WAS ABLE TO REACT AND EXTIGUISH THE FIRE, HAD THIS OCCURED IN OTHER CIRCUMSTANCES THE CAR WOULD MOST LIKELY HAVE COMPLETELY BURNED.  *TR",
        "vin": "WAUVT64B83N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/19/2011",
        "dateOfIncident": "02/18/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378891,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "JANUARY 15, 2011  RE:  DEFECTIVE INVESTIGATION PE08008  AUDI 2003 A6 LEAKING FUEL FROM GAS TANK ASSEMBLY  ATTACHED, PLEASE FIND EVIDENCE I REPORTED MY FUEL TANK LEAKED FUEL TO A LOS ANGELES AUDI DEALER.  I BOUGHT THE CAR IN 2006 WITH 66,000 MILES AND REMAINS WITH NO DAMAGE HISTORY.  IN 2008, FUEL BEGAN DRIPPING AT THE LOWER DRIVER SIDE VACUUM NIPPLE FLANGE WHICH SHIFTED OFF THE RIM OF THE FUEL TANK.  WHEN THE TANK WAS FILLED PASSED HALF FULL, IT WOULD DRIP ONTO THE GROUND.  THERE IS A VALID RECALL FOR MOST 2003 SEDAN MODELS AND THE 4.2L OFF-ROAD QUATTRO.  THIS MODEL IS A 2003 SEDAN WITH THE 4.2L ENGINE SIZE AND SHOULD CERTAINLY BE INCLUDED IN THESE TWO RELATED RECALLS.  DUE TO NO FAULT OF MY OWN, THE NATURE AND SEVERITY OF THE DEFECT, I QUESTIONED THE PROBLEM WAS A MANUFACTURES DEFECT WARRANTING REPAIR AND POTENTIAL RECALL.  THEY DISAGREED, SAID IT WAS OUT OF WARRANTY AND QUOTED ME A REPAIR.  VALENTINE ASSERTED THE CONDITION WAS NOTED TO MY VIN IN THEIR SYSTEM.  LATER THAT YEAR, LA AUDI MADE DIFFERENT REPAIRS AND THE FUEL LEAK CONDITION WAS AGAIN PUT ON THE WORK ORDER.  FINALLY IN JUNE 2010, A NEIGHBOR WROTE NOTE THE CAR WAS LEAKING FUEL.  IT TANK WAS POURING FUEL AFTER FILLING TO THE THREE-QUARTERS MARK AND PARKING IN OUR SUBTERRANEAN PARKING GARAGE.  REPAIR COULD NOT BE AVOIDED.  BASED ON LA AUDI'S POSITION, A LOCAL MECHANIC REPLACED THE ENTIRE TANK WITH A SALVAGE ONE HE FOUND.    ATTACHED ARE PHOTOS, WORK REPAIR ORDERS, A HAZARD NOTE FROM NEIGHBOR OF THE FUEL LEAK, AND SIGNED DECLARATION THESE ITEM AS AUTHENTIC AND ALL ASSERTIONS ABOVE ARE TRUTHFUL.  I APPRECIATE ASSISTANCE OBTAINING RECOVERY FROM AUDI FOR THE REPAIRS AS THEY REFUSED TO WHEN PRESENTED TWICE.         YOUR ASSISTANCE IN THIS MATTER IS APPRECIATED.  UPDATED PORTABLE 02/18/11",
        "vin": "WAUML64B33N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/03/2010",
        "dateOfIncident": "10/27/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10363917,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 AUDI A6 QUATTRO 4.2L WHICH I BOUGHT USED AND HAVE DRIVEN IT SINCE 2004.  ON OCTOBER 27, 2010 I STARTED SMELLING GAS AND AFTER CHECKING FOUND A LEAK AT THE BASE OF THE GAS TANK. I CHECKED THE WEB AND FOUND OUT THAT THERE IS A RECALL ON OTHER SUB-MODELS. I CALLED AUDI USA  WHO CONTACTED A DEALER I CHOSE TO FIX THE PROBLEM. BUT THE DEALER IS SAYING THAT ALTHOUGH THE RECALL PROBLEM EXISTS IT IS DUE TO AN ACCIDENT WHICH HAPPENED 6 OR 7 YEARS AGO. I THINK THIS IS NOT FAIR.  THANK YOU  VIN [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRONIC STABILITY CONTROL",
        "crash": false,
        "dateComplaintFiled": "10/05/2010",
        "dateOfIncident": "10/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10359364,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE LOCKED MY BRAKES AND HAD A NEAR ACCIDENT. MY ABS AND ESP HAS STOPPED WORKING ON MY 2003 AUDI A6. I WAS TOLD THE ABS CONTROL UNITS ARE KNOWN TO GO BAD, AND WILL COST OVER A $1000 TO FIX.  I CANNOT AFFORD TO FIX.  IF THIS IS A WIDESPREAD PROBLEM, SHOULDN'T AUDI BE HELD ACCOUNTABLE FOR ANY TRAFFIC ACCIDENTS DUE TO FAILURE, AND SHOULD THERE BE A RECALL? *TR",
        "vin": "WAUJT64B13N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354292,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A6. CONSUMER STATES PROBLEMS WITH GAUGE CLUSTER *TGW  THE CONSUMER STATED THE WARNING GAUGES NO LONGER FUNCTIONED AND THE MULTI-FUNCTION LIQUID CRYSTAL DISPLAY DOES NOT INDICATE READABLE INFORMATION.  *JB",
        "vin": "WAULT64B73N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/16/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336975,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A6. CONSUMER WRITES IN REGARDS TO FUEL LEVEL SENSOR DAMAGED DUE TO RECALL REPAIR *TGW  THE CONSUMER STATED HE COMPLIED WITH THE RECALL AND TOOK HIS VEHICLE TO THE AUDI DEALER. THE DEALER FILLED THE GAS TANK; IN ACCORD WITH THE LETTER FROM AUDI. UNFORTUNATELY, AS THE CONSUMER DROVE THE 70 MILES BACK HOME, THE FUEL LEVEL DECREASED TO LESS THAT 1/4 AND THE WARNING LIGHT CAME ON.  SINCE THEN, THE WARNING LIGHT COMES ON AND GOES OFF WITHOUT REGARD TO HOW MUCH FUEL IS IN THE TANK. THE CONSUMER ALSO STATED HE SMELLED GASOLINE PARTICULARLY IN THE MORNING TIME WHEN HE WENT TO HIS GARAGE.  HE STATED HE WAS NOT ABLE TO RELY ON THE FUEL GAUGE BECAUSE IT SOMETIMES SHOWED FULL WHEN IT WAS LESS THAN 1/4 OF A TANK.  THE CONSUMER STATED HE HAS RAN OUT OF GAS TWICE, ON A COUNTRY ROAD IN MID-WINTER.  AFTER MAKING DOZENS OF FRUSTRATING CALLS TO AUDI, THEY FINALLY ARRANGED TO HAVE THE PROBLEM LOOKED AT. THE DEALER STATED THEY DIDN'T HAVE THE PART THEY NEEDED TO REPAIR THE DEFECT AND THEY WOULD CALL WHEN THE PART ARRIVED. THEY ESTIMATED THE REPAIR AT $483.64. THE CONSUMER STATED HE STILL HAS NOT HEARD FROM THE DEALER.  THE CONSUMER STATED HE TOOK HIS VEHICLE TO THE DEALER WITH NO FUEL GAUGE PROBLEMS AND IT WAS RETURNED TO HIM WITH PROBLEMS. *JB",
        "vin": "WAULT64B23N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/09/2010",
        "dateOfIncident": "04/12/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335926,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A6. CONSUMER SEEKS REPLY FOR REQUEST FOR REIMBURSEMENT *TGW  THE CHECK ENGINE LIGHT ILLUMINATED. THE CONSUMER TOOK THE VEHICLE TO A NEARBY REPUTABLE MECHANIC WHO REPLACED THE IGNITION COIL. THE CONSUMER IS SEEKING REIMBURSEMENT, SINCE AUDI ISSUED A VOLUNTARY CAMPAIGN STATING THEY WOULD REPLACE FOR FREE IF NEEDED. *JB",
        "vin": "WAULT64BX3N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/15/2010",
        "dateOfIncident": "01/05/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320034,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR COMPLETELY STOPPED IN THE MIDDLE OF HIGHWAY AND CAR BEHIND ALMOST HIT ME. TRANSMISSION FAILED SUDDENLY. IT HAD TO BE REPLACED. RECURRING PROBLEM WITH AUDI A6 3.0 2003 CVT. *TR",
        "vin": "WAUJT64B73N"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES, ELECTRIC,ELECTRONIC STABILITY CONTROL,TRACTION CONTROL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/03/2010",
        "dateOfIncident": "03/03/2010",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316384,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS HAVE STOPPED WORKING.  ALONG WITH ABS, TRACTION & STABILITY CONTROL. *TR",
        "vin": "WAULD64B03N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/02/2010",
        "dateOfIncident": "11/22/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315618,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2003 AUDI A6, 2.7 QUATTRO. THE CONTACT STATED THAT A FUEL LEAK OCCURRED ON NOVEMBER 22, 1999. THE CONTACT ALSO OBSERVED FUEL LEAKING FROM THE VEHICLE WHILE DRIVING 60 MPH.  THE CONTACT PARKED THE VEHICLE AND THE FUEL BEGAN LEAKING OUT OF THE VEHICLE EXCESSIVELY. THE REAR BUMPER WAS HANGING OFF OF THE VEHICLE WHEN HE RETURNED CLEAN UP THE FUEL THAT WAS LEAKING. THE CONTACT NOTIFIED THE BANK MANAGEMENT OF THE FUEL LEAK ON THEIR PROPERTY. THE POLICE AND FIRE TRUCK WERE ANONYMOUSLY NOTIFIED OF THE FUEL LEAK. THE WEATHER WAS NOT A FACTOR. THE VEHICLE WAS TOWED TO HIS RESIDENCE, THEN IT WAS TOWED TO THE LOCAL DEALER FOR DIAGNOSTIC TESTING. THE DEALER WAS NOT SYMPATHETIC TO THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 84,600 AND THE CURRENT MILEAGE WAS 84,610.",
        "vin": "WAULD64B93N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2010",
        "dateOfIncident": "07/30/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10310486,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LETTER FROM AUDI CUSTOMER COMPLAINT REIMBURSEMENT SERVICE ACTION REGARDING IGNITION COIL INSPECTION/REPLACEMENT LETTER DATED JULY 2009 WAS RECEIVED AND STILL WAITING FOR AUDI OF AMERICA INC. TO NOTIFY ME IF PARTS ARE AVAILABLE AT THE LOCAL DEALER AND SINCE THEN HAVE NOT HEARD FROM THEM. PLEASE LOOK INTO THIS MATTER. THANKS *TR",
        "vin": "WAUJT64B53N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/08/2009",
        "dateOfIncident": "10/26/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291370,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHUDDERS WHEN ACCELERATING MAINLY AND ALSO SLIGHTLY FELT WHEN BRAKING-DEALER RECOMMENDS REPLACEMENT TRANSMISSION. *TR",
        "vin": "WAUJT64B13N"
    },
    {
        "components": "SERVICE BRAKES, ELECTRIC",
        "crash": false,
        "dateComplaintFiled": "09/29/2009",
        "dateOfIncident": "05/19/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285639,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS CONTROL UNIT IS FAULTY ON MY AUDI A6 2003.  I BELIEVE IT IS SUBJECT TO RECALL INDICATED BY THE $1800 REPAIR AND FREQUENCY OF THIS COMPLAINT ON THE INTERNET. *TR",
        "vin": "WAULT64B83N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/30/2009",
        "dateOfIncident": "06/25/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275363,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AOA HAS FAILED TO TAKE RESPONSIBILITY FOR A SAFETY RELATED DEFECT IN MY AUDI A6 FUEL SYSTEM. GIVEN A NHTSA PRODUCT SAFETY GAS STORAGE TANK RECALL, I BELIEVE AOA ARE LIABLE FOR THIS SAFETY RELATED DEFECT. ON JUNE 26TH, 2009 HOFFMAN AUDI, EAST HARTFORD CT, SERVICE MANAGER JIM ORMAN ORALLY INFORMED ME THAT AOA WILL TAKE NO FURTHER ACTION IN THIS MATTER, THE REASONS PROVIDED WERE: 1) RECALL WAS ON OTHER SIDE OF THE TANK - THIS PARTICULAR VALVE WAS NOT PART OF THE RECALL AND THEY'VE SEEN ONLY A FEW OTHERS WITH ISSUES. ?THERE WAS NO POSSIBLE WAY THIS COULD OCCUR DURING THE RECALL REPAIR.? 2) FUEL TANK WAS OUT OF 4 YEAR, 50000 MILE WARRANTY. 3) AOA DISREGARDS THE UNSAFE CONDITION CAUSED BY FUEL VAPOR/FLUID LEAKS RESULTING FROM THE DEFECTIVE/WORN OUT VALVE. IN DISCUSSION IT WAS REFERENCED THAT ?THERE WERE ONLY FOUR OTHER INSTANCES OF THIS PROBLEM? AND CITED AGE OF THE VEHICLE. I WAS TOLD THAT AFTER REVIEWING IMAGES OF MY CLAIM, THE FINAL DECISION WAS MADE BY KARL KRUG, NEW ENGLAND REGIONAL SERVICE MANAGER AOA.  BACKGROUND:   IN LATE 2008 I WAS MADE AWARE OF A SAFETY RECALL REGARDING THE POTENTIAL FOR FUEL TANK LEAKAGE RESULTING FROM CRACKED NIPPLES ON THIS PLASTIC GAS STORAGE TANK. A REINFORCEMENT REPAIR WAS PERFORMED ON MY VEHICLE IN DECEMBER 2008 (NHTSA CAMPAIGN ID NUMBER:08V157000). ROUGHLY ONE MONTH LATER THE CHECK ENGINE LIGHT ILLUMINATED AND THE DIAGNOSTIC FAULT CODE RELATED TO THE TANK VENTILATION SYSTEM WAS IDENTIFIED.  LAST WEEK I ISOLATED THE P0456 16840 TANK VENTILATION SYSTEM PINHOLE LEAK CODE TO THE FUEL TANK. GIVEN THE COMPLEXITY OF THE VENTILATION SYSTEM IN THE FUEL TANK AREA, I DECIDED TO GET THE SYSTEM TESTED BY A DEALER.  A CRACKED VALVE NIPPLE ATOP THE GAS STORAGE TANK WAS IDENTIFIED BY A VOLKSWAGEN SERVICE CENTER. I HAVE FILED A COMPLAINT WITH THE CT ATTORNEY GENERAL AND ASKED THEY FORWARD TO THE APPROPRIATE STATE AND FEDERAL AGENCIES FOR FURTHER INVESTIGATION. *TR",
        "vin": "WAULD64B53N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2009",
        "dateOfIncident": "03/06/2009",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266590,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI A6 QUATTRO SPUTTERED, CHOKED AND DIED AS I TRIED TO PULL INTO TRAFFIC.  THE VEHICLE DID RESTART AND THEN DID THE SAME THING AS I TRIED TO PULL OUT ONTO ANOTHER ROAD, AND COMPLETELY FAILED.  VEHICLE HAD TO PUSHED OUT OF TRAFFIC AND TO THE SIDE OF THE ROAD WITH ASSISTANCE, THEN TOWED TO NEARBY GARAGE.  DIAGNOSED THAT FUEL PUMP WAS CAUSE OF FAILURE.  MECHANIC SAID THEY COULD TAP ON THE FUEL PUMP TO GET IT TO RUN, WHICH CONFIRMED THAT IT WAS THE CAUSE OF FAILURE.  I WAS ALSO ADVISED BY THE GARAGE THAT MY VEHICLE HAD BEEN SUBJECT OF FUEL PUMP RECALLS, ALTHOUGH AUDI DENIED THAT MY VEHICLE FELL UNDER THAT PARTICULAR RECALL.  VERY DANGEROUS SITUATION AS I FAILED TWICE AS I WAS ENTERING TRAFFIC.  IN MY OPINION, FUEL PUMPS SHOULD NOT FAIL BY 66,000 MILES. *TR",
        "vin": "WAULT64B63N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/09/2009",
        "dateOfIncident": "01/02/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254347,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD WASHER SYSTEM FAILS ROUTINELY IN AUDI A6 MODELS 1998 TO 2005 CAUSING THE FLUID RESERVOIR TO RAPIDLY EMPTY LEADING TO LOSS OF VISIBILITY IN BAD WEATHER LEADING TO A TRAFFIC SAFETY HAZARD. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/25/2008",
        "dateOfIncident": "12/24/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252769,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS STOP DURING WIPER CYCLE.  WIPERS DO NOT RESET OR RESTART FOR 30-45 SECONDS AFTER STOPPING.  WIPERS WILL NOT START OR RESET IF DRIVER MOVES WIPER SELECTOR LEVER DURING MALFUNCTION INTO ANY MODE, DELAY, LOW OR HI.  PROBLEM ONLY OCCURS WHEN RAINING.  COULD NOT DUPLICATE EFFECT IN DRY WEATHER.  PROBLEM PRIMARILY OCCURS WHEN WIPERS ARE IN THE DELAY MODE.  WIPERS WILL STOP AT ANY ANGLE ON WINDSHIELD WHEN MALFUNCTION STARTS.  PROBLEM DURATION AND FREQUENCY INCREASED WITH TIME FROM SEVERAL TIMES A MONTH TO EVERY 60-90 SECONDS WHILE WIPERS WHERE ACTIVATED OVER 12 MONTH PERIOD.  VEHICLE UNDER WARRANTY.  DEALER COULD NOT DUPLICATE EFFECT.  DURING WIPER MALFUNCTION,  IF WIPER SELECTOR LEVER IS MOVED TO THE OFF POSITION WHILE WIPERS ARE STUCK IN A RAISED/ELEVATED POSITION, WIPERS WILL NOT RESET.  WIPERS WILL REMAIN IN MALFUNCTIONING POSITION ON WINDSHIELD UNTIL WIPER SELECTOR LEVER IS MOVED TO DELAY/LO/ OR HI SETTING AND THEN WIPER WILL RESUME NORMAL FUNCTION AFTER 60-90 SECONDS.  DEALER HAS NOT TAKING ACTION TO CORRECT THIS PROBLEM AFTER REPEATED REQUESTS BY OWNER. *TR",
        "vin": "WAULT64B03N"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/08/2008",
        "dateOfIncident": "08/30/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244850,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 AUDI A6 HAD PROBLEMS WITH THE ENGINE LIGHT, SMOKING, AND LITTLE TO NO ACCELERATION.  CONSUMER STATES THAT AFTER A FEW REPAIRS THE PROBLEM IS NOT SOLVED AND WANTS TO BE REFUNDED HER MONEY.  *NJ  THE DEALER INFORMED THE CONSUMER THE #1 AND #3 COIL NEEDED TO BE REPLACED.  THE CONSUMER DROVE LESS THAN A MILE AND THE CHECK ENGINE LIGHT CAME BACK ON BLINKING AND THE VEHICLE WAS MOVING VERY HARD. WHEN THE CONSUMER RETURNED TO THE DEALER, THEY DIAGNOSED THE VEHICLE AGAIN, THE CONSUMER WAS TOLD THE #6 IGNITION COIL NEEDED TO BE REPLACED. BECAUSE NO ONE EVER TEST DROVE THE VEHICLE WHEN IT WAS SUPPOSE TO BE FIXED THE FIRST TIME, THE DEALER REPLACED THE #6 COIL FOR FREE. THE CONSUMER LEFT THE DEALERSHIP AGAIN ONLY TO HAVE THE ENGINE LIGHT COME AGAIN, BUT IT WASN'T BLINKING. THE DEALER DIAGNOSED THE FAILURE AND STATED IT WAS THE TORQUE CONVERTER CLUTCH CIRCUIT PERFORMANCE. *JB",
        "vin": "WAULT64B13N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/04/2008",
        "dateOfIncident": "08/01/2008",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236925,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LED PORTION OF THE INSTRUMENT CLUSTER FADES OUT ON HOT DAYS MAKING THE GEAR SELECTION INDICATOR (PRND321) SHOWN IN THE DISPLAY UNREADABLE. THIS IS A SAFETY ISSUE BECAUSE THE DRIVER NEEDS TO KNOW WHAT GEAR THAT TRANSMISSION IS IN AT ALL TIMES AND A FADING DISPLAY LEADS THE DRIVER TO GUESS RATHER THAN KNOW.  THIS FADING STARTED THREE YEARS AGO AND HAS GOTTEN PROGRESSIVELY WORSE WITH TIME.  IT ONLY HAPPENS ON HOT DAYS WHEN THE CAR IS PARKED OR DRIVEN IN THE SUN.  WE HAVE LOTS OF SUNNY DAYS IN CALIFORNIA!   *TR",
        "vin": "WAULD54B13N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/24/2008",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232161,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 AUDI A6.  APPROXIMATELY ONE YEAR AGO, THE CONTACT SMELLED A STRONG ODOR OF GASOLINE WHENEVER HE PLACED FUEL IN THE VEHICLE.  HE ALSO NOTICED FUEL LEAKING ON THE GARAGE FLOOR.  HE ASSUMED THAT HE WAS PLACING TOO MUCH FUEL INTO THE VEHICLE.  IN THE BEGINNING OF JUNE OF 2008, THE CONTACT MADE SURE TO FILL THE VEHICLE TO THE CORRECT AMOUNT TO AVOID ANY FUEL LEAKAGE.  WITHIN HALF AN HOUR OF PARKING THE VEHICLE, THE CONTACT SMELLED A STRONG GASOLINE ODOR AND NOTICED A MUCH LARGER PUDDLE OF GASOLINE UNDERNEATH THE VEHICLE.  HE CALLED THE DEALER AND WAS ADVISED TO HAVE THE VEHICLE TOWED; HOWEVER, THE CONTACT REFUSED AND DROVE THE VEHICLE TO THE DEALER.  A DIAGNOSIS WAS PERFORMED AND THEY STATED THAT THERE WAS A CRACK IN THE CHECK VALVE OF THE FUEL TANK THAT COULD NOT BE REPAIRED.  THE ENTIRE FUEL TANK NEEDED TO BE REPLACED.  THE CONTACT PROCEEDED WITH THE REPAIRS, WHICH WERE COMPLETED WITHIN A WEEK.  THE FAILURE MILEAGE WAS 38,000 AND CURRENT MILEAGE WAS 40,000.  UPDATED 07/16/08. *LJ  UPDATED 07/16/08",
        "vin": "WAULT64B13N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/05/2008",
        "dateOfIncident": "04/03/2008",
        "fire": true,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223446,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2003 AUDI A6 3.0 QUATTRO ON THURSDAY 04/03/2008 AROUND 10:30PM. I WAS TRAVELING 25MPH ON SYLVAN AVENUE IN ENGLEWOOD CLIFFS, NJ THE CHECK ENGINE LIGHT ILLUMINATED ON MY DASH BOARD AND STARTED FLASHING, I IMMEDIATELY PULLED OVER TO THE SIDE OF THE ROAD TO DIAGNOSE THE PROBLEM, WHEN I PULLED OVER I SAW SMOKE COMING OUT FROM UNDER THE HOOD OF MY CAR. I IMMEDIATELY TURNED OF THE VEHICLE AND POPPED THE HOOD TO SEE WHAT WAS GOING ON... I POPPED THE HOOD TO FIND THE IGNITION COIL ON THE THIRD CYLINDER (BACK LEFT CYLINDER) HAD STARTED ON FIRE WITH ABOUT 12INCHES OF FLAMES. THANK GOD THIS ALL HAPPENED I ABOUT 30 SECONDS AND I WAS ABLE TO GET THE FIRE OUT, OTHERWISE THE WHOLE CAR WOULD HAVE BURNED TO THE GROUND. IF I WAS STUCK IN TRAFFIC OR ON THE HIGHWAY THIS CAR WOULD HAVE MOST DEFINITELY BURNED TO THE GROUND. I FEEL VERY LUCKY MY TWO YEAR OLD DAUGHTER WAS NOT IN THE CAR WITH ME. NEVERTHELESS, THE  IGNITION COIL IS COMPLETELY MELTED AS WELL AS THE WIRING HARNESS. I ALWAYS HAVE DONE ALL THE MANUFACTURER RECOMMENDATIONS ON THE VEHICLE AND THE CAR WAS JUST AT THE DEALER SERVICE CENTER ON 04/01/2008 FOR MAINTENANCE, I HAD THEM LOOK OVER THE WHOLE CAR AND THEY SAID EVERYTHING WAS FINE. AFTER SPEAKING TO SERVICE TECHNICIANS AT AUDI I HAVE FOUND THIS TO BE A COMMONLY RECURRING PROBLEM WITH THEIR IGNITION COILS, SPECIFICALLY PERTAINING TO THE THIRD CYLINDER, THEY CLAIM IT OVERHEATS BECAUSE THE DESIGN IS TO CLOSE TO THE CATALYTIC CONVERTER. ALL I KNOW IS SOMETHING SHOULD BE DONE, I HAVE PICTURES OF THE DAMAGE WHERE YOU CAN CLEARLY SEE SOME TYPE OF ELECTRICAL MALFUNCTION THAT I WOULD BE MORE THEN WILLING TO SHARE. PLEASE SOMEONE DO SOMETHING BEFORE A LIFE IS LOST FROM THIS MANUFACTURER ERROR.!!!  *TR",
        "vin": "WAULT64B63N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "11/05/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212502,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A HARD TURN AND QUICK ACCELERATION TO AVOID AN ACCIDENT LEAD TO POWER FAILURE TO THE WHEELS, AND THE CHECK ENGINE LIGHT CAME ON. I BROUGHT THE CAR TO THE DEALERSHIP AND THE CODE READ \"SLIPPING TORQUE CONVERTER\" THE CAR HAD ONLY 79,000 MILES AT THE TIME OF THIS OCCURRENCE. THANKFULLY NO ONE WAS INJURED. AUDI REPAIR FACILITY TOLD ME THE TORQUE CONVERTER NEEDS TO BE REPLACED, THE COST WOULD BE $900.00 FOR THE PART AND $2,000.00 FOR LABOR. THE REPAIRS HAVE YET TO BE MADE DUE TO THE EXTENSIVE PRICE FOR A FAULTY PART AND LABOR. THE PART IS NOT COVERED UNDER WARRANTY.  *TR",
        "vin": "WAULT64B63N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/06/2007",
        "dateOfIncident": "10/28/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208020,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH NO INCIDENT TO MY AUDI (ACCIDENT, IMPACT, DIS-REPAIR) FUEL AND GAS FUMES LEAK. VEHICLE NOW SPILLS FUEL/FUMES WHEN TANK IS FULL TO 3/4. VISUAL INSPECTION SHOWS FUEL STAINS STARTING FROM THE TOP OF THE FUEL TANK ON THE DRIVER SIDE JUST UNDER THE REAR SEAT. VEHICLE IS NOW NOT BEING DRIVEN TO DETERMINE WHAT IS THE BEST COURSE OF ACTION FOR REPAIR.  *TR",
        "vin": "WAULD64B03N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/19/2007",
        "dateOfIncident": "02/15/2007",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185503,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "ECTSA ASX",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2003 2003 AUDI A6 QUARTO. WHILE DRIVING 65MPH ON THE HIGHWAY THE CONTACT HEARD A LOW BUMPING SOUND. THE VEHICLE THEN STARTED TO PULL TO THE RIGHT.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP AND THEY INFORMED THE CONTACT THAT BOTH FRONT TIRES STEEL BELTS WERE COMPLETELY SHREDDED. THE ROAD CONDITIONS WERE CLEAR.  THERE WEREN'T ANY POT HOLES NOR OTHER ROAD HAZARDS VISIBLE. THE FAILURE MILEAGE WAS 12000 MILES ON THE KUMHO ECSTA ASX TIRES.  THE VEHICLE CURRENTLY HAS 44800 MILES.",
        "vin": "WAULD64B73N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/23/2006",
        "dateOfIncident": "08/21/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166297,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FAILURE & VEHICLE TOTALLY & IMMEDIATELY DISABLED. *JB",
        "vin": "WAULT64BX3N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2006",
        "dateOfIncident": "12/23/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163715,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2003 AUDI A6 HAD FOUR TIRES REPLACED DUE TO CRACKING OF THE SIDEWALL. *KB ***NAR***  THE CONSUMER BELIEVES THAT WHEN TOUCHING THE CURB WHILE PARKING, THE SIDEWALL BEING SO THIN AND LOW PROFILE, SIMPLY CRACK, FAIL AND PUNCTURE.  THE SIDEWALLS CANNOT BE FIXED.  THIS PROBLEM HAS OCCURRED FOUR TIMES IN THE LAST TWO YEARS.  (PIRELLI P6 FOUR SEASON LOW PROFILES TIRES).  *NM  *NM",
        "vin": "WAULT64B93N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/27/2006",
        "dateOfIncident": "02/13/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151370,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 A6 AUDI QUATTRO \"DIED\" WHILE IN RUSH HOUR TRAFFIC ON AN INTERSTATE HWAY.  IT WAS DETERMINED THAT THIS WAS DUE TO FUEL PUMP FAILURE. VIN # NOT PART OF RECENT FUEL PUMP RECALL BY MANUFACTURER.  *NM",
        "vin": "WAULT64B63N"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "02/20/2006",
        "dateOfIncident": "02/18/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150669,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LIGHTS NO LONGER WORK (ANY). BRAKE LIGHTS WILL NOT TURN ON NO MATTER HOW MANY TIMES THE PEDAL IS DEPRESSED. *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/09/2006",
        "dateOfIncident": "02/09/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149902,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY IGNITION COILS (SO FAR 3 OUT OF 6 CYLINDERS WENT BAD).   ON THREE OCCASIONS AFTER STARTING AND PUTTING THE CAR INTO THE GEAR, SHAKING ENSUED AND THE \"CHECK ENGINE\" LIGHT TURNED ON.  THE CAR HAD TO BE TOWED EACH TIME TO THE DEALER WHERE THE FAULTY PARTS WERE REPLACED.  *JB",
        "vin": "WAULT64B13N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/06/2006",
        "dateOfIncident": "02/05/2006",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149505,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 15 MPH IN NORMAL CONDITIONS, THE FUEL PUMP FRACTURED AND THE VEHICLE STALLED.  THE VEHICLE WAS PULLED TO THE EMERGENCY LANE AND TOWED TO THE LOCAL DEALERSHIP FOR REPAIRS.  UPDATED 03/09/06. *JB",
        "vin": "WAULT64B83N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/26/2006",
        "dateOfIncident": "09/04/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148766,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE TIRES ON THE FRONT OF THE VEHICLE HAVE BEEN REPLACED NINE TIMES, WITHIN ONE AND A HALF YEARS.  THE SIDE WALLS ON THE TIRES ARE BLOWING OUT.  THE TIRE REPAIR SHOP WAS UNABLE TO DETERMINE THE CAUSE OF THE FAILURE.  THE MANUFACTURER OF THE VEHICLE HAS BEEN ALERTED.",
        "vin": "WAULD64B53N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/19/2005",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147516,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2003 AUDI A6 TIRE SIDEWALL IS THIN.  *TS    THE CONSUMER STATED THERE IS A STRUCTURAL PROBLEM WITH THE TIRE.  DURING PARKING, IF THE TIRE TOUCHES THE CURB; THE TIRE FAILS.  *JB",
        "vin": "WAULT64B93N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/15/2005",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125392,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER MADE A TURN AND ABOUT 2 GALLONS OF WATER CAME OUT FROM UNDER THE FRONT PASSENGER'S SEAT INTO THE REAR PASSENGERS SEAT FLOOR BOARD. TOOK  VEHICLE TO DEALERSHIP, WHO  SAID IT COULD BE THAT THE  CONDENSER LINE WASN'T PLUGGED, AND THEN A FACTORY SEAL ABOVE THE CONDENSER WAS  FAULTY. SUPPOSEDLY FIXED IT,  HOWEVER,  IT RECURRED THIS PAST WEEKEND. *AK",
        "vin": "WAULT64B33N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "04/01/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117273,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30-35 MPH VEHICLE COMPLETELY SHUT DOWN. THERE WAS NO WARNING. CONSUMER FOUND THAT THE VEHICLE HAD THE INCORRECT SPEED SENSORS INSTALLED ON IT. ALSO, THESE BAD SENSORS WERE ON EACH OF THE WHEELS. *AK",
        "vin": "WAULT64B43N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/30/2005",
        "dateOfIncident": "03/03/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113392,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  VEHICLE  STALLED ON NUMEROUS OCCASIONS.  DRIVER WAS MAKING A LEFT TURN AT AN INTERSECTION AND  VEHICLE STALLED.  DRIVER T WAS UNABLE TO RESTART VEHICLE.   MECHANIC  CLAIMED THAT THIS PROBLEM COULD NOT BE DETERMINED NOR DUPLICATED.   DRIVER INFORMED THE MECHANIC THAT THIS PROBLEM HAPPENED MORE THAN ONCE AND HAS NOT BEEN SOLVED.  *AK  THIS IS THE 4TH TIME CAR HAS BEEN TO THE DEALER FOR THIS PROBLEM. IF PROBLEM HAPPENS AGAIN, CONSUMER WILL RETURN TO THE DEALER.   *BF  *NM",
        "vin": "WAUJT64B43N"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/13/2005",
        "dateOfIncident": "03/10/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114032,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD NUMEROUS PROBLEMS WITH MY 2003 AUDI A6 CVT TRANSMISSION.  THE ENTIRE TRANSMISSION HAD BEEN REPLACED RECENTLEY, BUT THE SLIPPING OUT OF GEAR PROBLEM CONTINUES WITH NEW ONE.   THE SAN DIEGO AUDI DEALERS HAVE TOLD ME THAT THEY CANNOT FIND THE PROBLEM, BUT HAVE TOLD ME TO LET THE TRANSMISSION FAIL COMPLETELY AGAIN AND THEY WILL REPLACE IT UNDER WARRANTY AGAIN.  *AK",
        "vin": "WAUJT54B33N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/11/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111090,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GANS",
                "productMake": "PIRELLI",
                "productModel": "PIRELLI",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "CONSUMER EXPERIENCE SIGNIFICANT PROBLEMS WITH LOW PROFILE TIRES THAT ARE OEM ON AUDI A6 3.OL QUATTRO.  *BF   THE FAILURE OCCURRED WITHIN THE SIDEWALL OF THE TIRES.   *SC      *JB",
        "vin": "WAULT64B93N"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/20/2004",
        "dateOfIncident": "09/12/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10092797,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 30 MPH CONSUMER'S VEHICLE WAS INVOLVED IN A HEAD ON COLLISION. UPON IMPACT,  DUAL AIR BAGS DID NOT DEPLOY. DRIVER SUSTAINED BACK AND SHOULDER PAIN. *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/30/2004",
        "dateOfIncident": "12/18/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079048,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR SHAKES AND SHUDDERS WHEN COMING TO A STOP. WHEN TRYING TO START FROM A STOP, CAR HESITATES BEFORE MOVING.  CAN ROLL BACKWARDS IF CAR IS ON AN UPHILL INCLINE.  NATURAL RESPONSE IS TO DEPRESS GAS PEDAL FURTHER.  TRANSMISSION THEN ENGAGES AND CAR LURCHES FORWARD.  TOOK CAR TO DEALER 3 TIMES.  FIRST TIME TRANSMISSION FLUID TOPPED OFF.  SECOND TIME TRANMISSION CONTROL UNIT SOFTWARE UPGRADED.  3RD TIME WE WERE TOLD THAT THE PROBLEM CANNOT BE FIXED, EVEN WITH TRANSMISSION REPLACEMENT.*AK",
        "vin": "WAUJT64B23N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/03/2004",
        "dateOfIncident": "04/24/2004",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10068212,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Pirelli Tire, LLC",
                "productMake": "PIRELLI",
                "productModel": "P6",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I NOW DRIVE AN AUDI A6 WITH PIRELLI P/6 TIRES. I HAVE HAD 5 BLOW-OUTS IN THE PAST 19 MONTHS. THE SIDEWALLS ARE EITHER PAPER THIN OR NON-EXISTENT. I HAVE BEEN DRIVING FOR OVER 40 YEARS AND HAVEN'T HAD 5 FLAT TIRES IN THAT TIME. THESE TIRES ARE DANGEROUS AND SHOULD NOT BE ALLOWED TO BE PUT ON CARS THAT DRIVE ON REGULAR STREETS. I HAVE NOTIFIED THE DEALER\" NEW COUNTRY AUDI OF GREENWICH, CT.  THE SALES MANAGER SAID \"DIDN'T THE SALESPERSON TELL YOU YOU HAD TO BE CAREFUL WITH THESE TIRES?\" WHAT KIND OF AN ANSWER IS THAT?*AK",
        "vin": "WAULD64BX3N"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "10/15/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069311,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING WHEEL SHAKE AT 50 TO 60 MPH. MANY ATTEMPTS TO FIX PROBLEM HAS NOT HELPED. OTHER A6 OWNERS HAVE THE SAME PROBLEM. PROBLEM NOTED ON FIRST DRIVE AT 150 MILES AND STILL PRESENT AT 4000 MILES.",
        "vin": "WAUML64B03N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/14/2004",
        "dateOfIncident": "01/14/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10054064,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WINDSHIELD WIPERS DO  NOT HAVE ENOUGH FORCE TO REMOVE SNOW BUILD UP EVEN IF IN THE HIGHEST SPEED MODE. THIS RESULTS IN POOR VISIBILITY. *AK",
        "vin": "WAULT64B53N"
    },
    {
        "components": "FUEL SYSTEM, OTHER,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/17/2003",
        "dateOfIncident": "10/14/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043066,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAILURE TO ACCELERATE. I EXPERIENCE MAJOR DELAYS IN ANY ACCELERATION IMMEDIATELY AFTER I HAVE DEPRESSED THE BRAKE (AT ANY SPEED) AND THEN TRY TO REACCELERATE.       I UNDERSTAND THAT THIS IS A COMMON COMPLAINT AMONG ALL AUDI TIPTRONIC OWNERS REGARDLESS OF ENGINE TYPE. IT IS NOT, AS AUDI TRIES TO SAY, \"TURBO LAG.\"    IN ALMOST EVERY FAILURE TO DATE, I HAVE ALMOST BEEN INVOLVED IN AN ACCIDENT DUE TO THIS PROBLEM. HAD OTHER DRIVERS BEEN LESS ATTENTIVE, I MOST SURELY WOULD HAVE BEEN STRUCK.     I AM HESITANT TO PULL OUT INTO ANY VOLUME OF TRAFFIC WITH THIS PERSISTENT PROBLEM.  *LA",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/12/2003",
        "dateOfIncident": "04/13/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041665,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 AUDI ALL ROAD HAS A CONTINUAL PULL TO THE RIGHT. IT WILL NOT DRIVE STRAIGHT FOR MORE THAN 5-8 SECONDS AT A TIME, ON MOST ROAD SURFACES. I HAVE TAKEN THE CAR IN FOR REPAIRS FOUR TIMES IN 3400 MILES. EACH TIME THE CAR WAS OUT OF ALIGNMENT AND HAD TO BE ADJUSTED. THE SERVICE MANAGER SUGGESTS THAT THE CAR IS PERFORMING TO FACTORY SPECIFICATIONS, BUT IT STILL HAS A PULL TO THE RIGHT.  *LA",
        "vin": "WA1YD64B13N"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/02/2003",
        "dateOfIncident": "10/01/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041107,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "WRANGLER",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE SIDEWALL RUPTURED ON A GOODYEAR WRANGLER F1, 225/55R17 TIRE.  *JB",
        "vin": "WA1YD64B93N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/22/2003",
        "dateOfIncident": "06/20/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039291,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BUMPER GETS CAUGHT ON PARKING BUMPERS ON A REGULAR BASIS.  ON THIS OCCASION, IT WAS TORN FROM THE FENDER, AND CAUSED DAMAGE TO THE FENDER. IT HAS OCCURRED ON COUNTLESS OCCASIONS SINCE THEN.  THE CAR IS DESIGNED WITH THE LOWER BUMPER TOO CLOSE TO THE GROUND.*JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "05/05/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034081,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE EXPERIENCED AN EXPLOSION AND CHECK ENGINE LIGHT ILLUMINATED AND THERE WERE LOUD NOISES COMING FROM UNDER THE VEHICLE AND PARTS OF THE VEHICLE WERE ON THE GROUND. THE CAR THEN WAS TOWED TO THE DEALERSHIP, AND THEY CLAIMED THE VEHICLE WAS INVOLVED IN SOME TYPE OF IMPACT WHICH CAUSED THE EXPLOSION TO OCCUR, AND AUDI WAS NOT RESPONSIBLE FOR DAMAGES.  THE DEALERSHIP  FAILED TO FIND THE PROPER REASON FOR EXPLOSION. THE CONSUMER HAD TO PURCHASE A RENTAL CAR AT HER OWN EXPENSE TO HAVE A VEHICLE.  *MR  *CB   *JB",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2003",
        "dateOfIncident": "07/17/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029587,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "A6",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PUTTING VEHICLE IN THE REVERSE MODE IT WILL START SHAKING AND VIBRATING.  *AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/17/2003",
        "dateOfIncident": "06/17/2003",
        "fire": false,
        "manufacturer": "Volkswagen Group of America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023228,
        "products": [
            {
                "manufacturer": "Volkswagen Group of America, Inc.",
                "productMake": "AUDI",
                "productModel": "AUDI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLINDING BRIGHT HEADLIGHTS ON SOME NEW CARS ARE DANGEROUS. I FLASH MY BRIGHTS AT THEM THINKING THAT IS THE PROBLEM. IF CAR MANUFACTURERS CONTINUE TO PUT THEM ON NEW CARS, WILL THEY BE LIABLE FOR ACCIDENTS CAUSED BY THE BLINDING LIGHT?  *JB",
        "vin": ""
    }
]