[
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/27/2018",
        "dateOfIncident": "12/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11163653,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRAME AND ITS CROSSMEMBERS ARE RUSTED (ROTTED) THRU ABOVE THE GAS TANK MAKING THE VAN USELESS. THE GAS TANK IS EVEN ATTACHED AT THOSE AREAS MAKING IT A TICKING TIME BOMB. THIS IS A KNOW GM FRAME PROBLEM FOR MANY YEARS ON MANY TRUCK BODIES.",
        "vin": "1GCGG25V831"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/12/2018",
        "dateOfIncident": "02/12/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11072389,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 3500. THE CONTACT STATED THAT THE SEAT BELT BUCKLES PREMATURELY DETERIORATED TO THE POINT THAT THE BUCKLES FAILED TO LOCK THE SEAT BELTS TO SECURE A PASSENGER. THE MANUFACTURER INDICATED THAT A SEAT BELT RECALL REPAIR WAS PERFORMED IN 2016, BUT THE CONTACT EXPLAINED THAT THE REMEDY MAY NOT HAVE PROVIDED A SOLUTION. THE DEALER (MARSHFIELD CHEVROLET, 14963 MO-38, MARSHFIELD, MO 65706, (866) 218-7896) WAS CONTACTED. THE CONTACT WAS UNCERTAIN AS TO WHEN THE VEHICLE WOULD BE REPAIRED DUE TO THE MANUFACTURER STATING THAT THE RECALL HAD ALREADY BEEN PROVIDED. THE MANUFACTURER ISSUED FOUR TSBS AND THREE RECALLS FOR THE SEAT BELTS. THE APPROXIMATE FAILURE MILEAGE WAS 80,000. *TT  *TR",
        "vin": "1GAHG39U531"
    },
    {
        "components": "SEAT BELTS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/09/2017",
        "dateOfIncident": "08/05/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11013927,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS. THE CONTACT STATED THAT THE CABLE THAT HELD THE SEAT BELTS TOGETHER, LOCATED IN THE REAR MIDDLE ROW, SNAPPED WITHOUT WARNING. AS A RESULT, THE CONTACT WAS CONCERNED THAT, IN THE EVENT OF A CRASH, THE SEAT BELTS WOULD NOT SECURE PROPERLY AND CAUSE AN INJURY. THE CONTACT ALSO STATED THAT THE REAR DRIVER AND PASSENGER SIDE DOOR HINGES FRACTURED. THE CONTACT STATED THAT THE DOORS WERE GLUED SHUT. THE DEALER WAS NOT CONTACTED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 228,000.  UPDATED 10/17*LJ  UPDATED 10/4/18*JB",
        "vin": "1GBFG15TX31"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/21/2016",
        "dateOfIncident": "06/06/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10917814,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HINGES BROKE; DOORS ARE UNSAFE.",
        "vin": "1GBFG15TX31"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/22/2016",
        "dateOfIncident": "08/02/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10908790,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL OF THE EXHAUST HEADER BOLTS ARE BROKEN ON BOTH SIDES OF MY 5.3 LITTER ENGINE.  I DID SOME INTERNET SEARCHING AND FOUND A LOT OF PEOPLE WITH 5.3 LITTER ENGINES HAVING THE SAME ISSUE.",
        "vin": "1GCFG25T831"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2015",
        "dateOfIncident": "12/21/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811420,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CORRODED AND LEAKING FUEL FILLER NECK. FOOLISH DESIGN INVOLVING DISSIMILAR METALS HELD IN CONTACT AND SURROUNDED WITH A CONDUIT WHICH HOLDS WATER AND ROAD SALT. DESIGN IS DESTINED FOR FAILURE. GM HAS A PARTIAL RECALL FOR THE SNOW BELT. SUCH A FOOLISH DESIGN SHOULD BE FIXED EVERYWHERE AS IT IS JUST A MATTER OF TIME UNTIL FAILURE.",
        "vin": "1GBFH15T031"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/13/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10748421,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE SWING DOORS ARE VERY HARD TO OPEN AND SHUT AND THE DRIVERS SIDE SWING DOORS ARE IN THE INITIAL STAGE OF THIS. THE PASSENGER SWING DOOR THAT IS FIRST TO OPEN (RIGHT) DOES NOT WANT TO OPEN AND DOESN'T WANT TO SHUT. I HAVE TO FORCE IT. THE SECOND DOOR (LEFT) IS GETTING WORSE AS WELL. THIS IS CAUSING THE INTERIOR LIGHT PIN IN THE DOOR JAM TO NOT PUSH IN ALL THE WAY, THEREFORE; THE LIGHTS WILL NOT SHUT OFF.",
        "vin": "1GBFG15T131"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/06/2015",
        "dateOfIncident": "04/01/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10703964,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS. THE CONTACT STATED THAT THE FRONT OF THE VEHICLE VIBRATED WHENEVER THE VEHICLE WAS BEING DRIVEN OVER 30 MPH OVER A BUMP. THE VEHICLE WAS TAKEN TO A DEALER WHERE THE CONTROL ARMS, THE PITMAN ARM, THE TIRES AND THE HUBS WERE REPLACED, BUT THE FAILURE PERSISTED. THE FAILURE MILEAGE WAS 109,000. THE VIN WAS NOT AVAILABLE. ....UPDATED 07/22/15 *BF    UPDATED 10/4/2017*CN",
        "vin": "1GBGG294931"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2015",
        "dateOfIncident": "12/03/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A NOTICE FROM GM ( DOC ID #32202443, #12167 FUEL FILLER PIPE CORROSION) STATING THAT THERE WAS A RECALL ON MY VEHICLE FOR LEAKING GASOLINE. I BROUGHT IT TO SIGHN CHEVROLET IN RIVERSIDE CA AND THE SERVICE MANAGER TOLD ME THAT CA VEHICLES DO NOT QUALIFY. I CONTACTED CUSTOMER COMPLAINTS CASE # [XXX] AND ALL THEY DID WAS CALL THE SAME SERVICE MANAGER AND GOT BACK TO ME SAYING THEY WON'T FIX IT. I BELIEVE I AM DRIVING AROUND WITH A VEHICLE LEAKING GAS ON THE ROAD CREATING AN EXTREMELY DANGEROUS SITUATION FOR MY FAMILY WITH A DIRE FIRE HAZARD. MY CONTENTION IS, WHY WOULD THEY SEND ME A RECALL NOTICE AND THEN TELL ME I DON'T QUALIFY? I DID RECEIVE THE NOTICE AND IT SAID IT HAD TO BE ACTED ON BEFORE 12/31/12 BUT IT WAS NOT LEAKING THEN. I DON'T CARE WHEN IT EXPIRES. IT IS A ADMITTED DEFECT AND GM SHOULD STAND BEHIND THEIR DANGEROUS ERRORS.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).'  *TR",
        "vin": "1GBFG15T031"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "12/21/2014",
        "dateOfIncident": "12/21/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667542,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY SPEEDOMETER QUICKLY JUMPS FROM ONE INDICATED SPEED TO ANOTHER SPEED THAT IS CLEARLY INACCURATE, DOWN AS LOW AS -0- WHILE DRIVING, ACCOMPANIED BY THE TRANSMISSION ATTEMPTING TO DOWNSHIFT ON IT'S OWN, WHICH CAUSES A SEVERE ENGINE OVER-REV CONDITION OR GOING INTO A NEUTRAL MOMENTARILY WITH NO INPUT FROM ME AS THE DRIVER.  THERE ARE NO SPECIFIC ACTIONS I CAN TAKE TO TRIGGER THE ERRATIC SYMPTOM, NOR ANY SPECIFIC ACTION I CAN TAKE TO CAUSE NORMAL OPERATION.      WITH SNOW AND ICE ON THE ROADS AT THIS TIME OF THE YEAR THIS IS EXTREMELY DANGEROUS AS IT COULD CAUSE THE VAN TO LOCK UP THE REAR WHEELS ON SLIPPERY PAVEMENT CAUSING LACK OF CONTROL.      THIS CONDITION CAN OCCUR REGARDLESS OF WHETHER OR NOT CRUISE CONTROL IS SELECTED, REGARDLESS OF THE GEAR I MANUALLY SELECT, AND REGARDLESS OF THE TRAILER MODE BEING SELECTED OR NOT.  SIMULTANEOUSLY THE \"CHECK ENGINE\" LIGHT GOES ON, THE \"ABS LIGHT\" AND \"BRAKES\" LIGHTS ARE LIT ON THE DASHBOARD ALTHOUGH NO BRAKING ABNORMALITIES ARE NOTED.    I REPORTED A LESS SEVERE CASE OF THIS SEVERAL MONTHS AGO, BUT RECEIVED NO REPLY FROM THE NHTSA.  DOING INTERNET RESEARCH I FIND THAT IT MAY BE A DEFECTIVE SPEEDOMETER DASHBOARD ASSEMBLY THAT WOULD NEED TO BE SENT AWAY FOR REPAIR/EXCHANGE.  THEY REQUIRE A LARGE DEPOSIT IN ORDER TO GO THRU THE VERIFICATION PROCESS THAT THE ODOMETER READING I REPORT IS THE SAME AS THE UNIT I SEND IN. PART COST WITH DEPOSIT IS CLOSE TO $600, AND THEY SHOW AN ONLINE INTERNET VIDEO OF HOW TO REMOVE THE DASHBOARD UNIT WHICH TAKES LESS THAN 3 MINUTES.  I'VE READ THIS IS A COMMON PROBLEM WITH THIS VEHICLE MAKE, MODEL AND YEAR.  I AM THE ORIGINAL OWNER SINCE NEW, AND IT HAS LESS THAN 17,000 ACTUAL MILES ON IT.  *TR",
        "vin": "1GAGG29U931"
    },
    {
        "components": "STEERING,STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING ON THE HIGHWAY AT THE SPEED OF 50 MPH AND THE VAN SUDDENLY BEGAN TO VIOLENTLY SHAKE AND SHUDDER FROM THE FRONT WHEELS AND UP AND INCLUDING THE SHAKE OF THE STEERING WHEEL. I SLOWED THE VEHICLE DOWN BY BRAKING TO 35 MPH AND IT SLOWLY STOPPED SHAKING. THIS HAS BECOME A REGULAR ISSUE WITH THE VEHICLE AND I HAVE TAKEN IT FROM SHOP TO SHOP AND MECHANICS CANNOT FIGURE OUT THE PROBLEM. I FEAR FOR MY FAMILY'S SAFETY AS WELL AS MY OWN WHEN DRIVING ALONE IN THIS VEHICLE. IT HAS BEEN A YEAR SINCE THIS HAS BEGUN. MECHANIC HAS CHANGED THE SHOCKS FOR THE VAN AND IT HAS BEGAN TO VIOLENTLY SHAKE AND SHUDDER MORE FREQUENTLY. I NEED TO KNOW WHY THIS IS HAPPENING.   I OWN A CHEVROLET EXPRESS 2500 (2003).  *TR",
        "vin": "1GAGG25UX31"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/03/2014",
        "dateOfIncident": "08/07/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10630304,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS. THE CONTACT STATED THAT THERE WAS A FUEL LEAK COMING FROM THE VEHICLE. THE CONTACT INDICATED THAT AFTER REFUELING, FUEL PUDDLE UNDER THE VEHICLE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHO DIAGNOSED THAT THE FILLER NECK NEEDED TO BE REPLACED AND THE METAL FUEL FILLER PIPE WAS CORRODED.  THE CONTACT WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 12V388000 (FUEL SYSTEM, GASOLINE). THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 153,500.",
        "vin": "1GBFG15T931"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/30/2014",
        "dateOfIncident": "08/25/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629518,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING ON INTERSTATE AT 65 MPH, THE ABS WARNING LIGHT CAME ON, AND THE SPEEDOMETER STARTED JUMPING ERRATICALLY FROM ACTUAL SPEED TO LOWER SPEEDS 45, 25 + OTHERS AS LOW AS 8 (EIGHT) MPH. THIS CAUSED THE TRANSMISSION TO DOWNSHIFT UNPREDICTABLY, OVER-REVVING THE ENGINE SPEED. IT HAPPENED REPEATEDLY SO I DOCUMENTED THE ODOMETER ERRATIC MOVEMENT ON MY CELL PHONE AS A VIDEO, SHOWING ROAD MOVEMENT + ALL GAUGES + AUDIO EVENTS LIKE ENGINE OVER-REVVING AT SAME TIME. THE VIDEO IS OF HIGH QUALITY AND THE EVENTS TAKING PLACE ARE DOCUMENTED WITH THE VIDEO. RURAL AREA WITH FEW CARS ON ROAD AT THE TIME. IF IT TOOK PLACE IN A CITY INTERSTATE ENVIRONMENT (ESPECIALLY IN THE WINTER MONTHS) IT MIGHT HAVE CAUSED A MULTIPLE CAR COLLISION WITH SUDDEN UNEXPECTED DOWNSHIFTING THAT WAS OUT OF MY CONTROL. ENGINE RPM ALSO HUNTS ERRATICALLY AND OUT OF MY CONTROL. PREDICTABLE IN WHAT IT DOES, IT BEGINS APPROXIMATELY WITHIN A RANGE OF 4-8 MILES AFTER LEAVING HOME DAILY. WHEN ENGINE TURNED OFF AND PARKED AT A LOCAL STORE AS AN EXAMPLE, IT WILL CLEAR IT'S PROBLEM AS IF A CPU IS \"RE-BOOTED\", AND REPEAT THE CYCLE OF ERRATIC BEHAVIOR FROM THAT NEW STARTING POINT. WHEN I BOUGHT + INSTALLED ACTRON BRAND  OBD-II CODE READER WHICH FEATURES ABILITY TO REVEAL ABS BRAKE CODES, IT NEVER SHOWS ANY OTHER STORED CODES EXCEPT A SINGLE PO446 WHICH IS AN EMISSIONS RELATED CODE. THIS VAN WAS ORIGINALLY SENT NEW BY THE SELLING NH CHEVROLET DEALER TO THE PENNSYLVANIA BASED QUIGLEY CONVERSION FACILITY, SO IN FEBRUARY 2004 WAS MODIFIED FROM RWD TO A 4WD BY EXCHANGING STOCK MODEL 2500 FRONT END FOR A 4 WD PICKUP TRUCK NEW FACTORY FRONT END WITH 4WDL, NEUTRAL, 2WDH 4WDH FLOOR CONTROL LEVER. THE DRIVER'S DOOR JAM HAS AN 8600 LB GVW CERTIFICATION WHICH IS APPROPRIATELY QUIGLEY'S. MY VERY LOW ODOMETER AT 16,614 MILES IS ACCURATE, AS I ALSO HAVE OTHER VEHICLES TO USE, AND WORK AT HOME.  *TR",
        "vin": "1GAGG29U931"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/26/2014",
        "dateOfIncident": "07/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10628404,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 1500 VAN. THE CONTACT STATED THAT WHEN FUELING THE VEHICLE, FUEL SPRAYED FROM THE FILLER NECK. THE DEALER DIAGNOSED THAT FUEL FILLER PIPE NEEDED TO BE REPLACED. THE VEHICLE HAD NOT BEEN REPAIRED. THE MANUFACTURER HAD NOT BEEN NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 107,000.",
        "vin": "1GNFG15TX31"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "06/13/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE, ALL ELECTRICAL STOPPED, DISCOVERED THAT THE IGNITION HAD TURNED OFF BY ITSELF AND CAUSED A LOSS OF ALL POWER CREATING DANGEROUS STEERING AND STOPPING SITUATION.. I WAS ABLE TO PULL TO THE SIDE OF ROAD AND STOPPED VEHICLE. TOOK THE TRUCK TO CHEVROLET DEALER IN SARASOTA RT. 41 AND BEE RIDGE AND WAS TOLD  IT WAS NOT PART OF RECALL. THIS DOES NOT MAKE SENSE, IT HAS THE SAME SYMPTOMS AS THE OTHER DEFECTIVE VEHICLES MAYBE THEY DON'T WANT TO INCREASED THEIR PROBLEMS WITH ANOTHER YEAR AND MODEL. PLEASE HELP, I AM UNABLE TO DRIVE MY TRUCK FOR WORK AND AM LOSING MONEY AND CUSTOMERS, AS I AM A GENERAL ONE MAN CONTRACTOR. PLEASE ADVISE.  *TR",
        "vin": "1GBJG31UX31"
    },
    {
        "components": "STEERING,POWER TRAIN,AIR BAGS,STRUCTURE,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/15/2014",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10588771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS VEHICLE WAS BOUGHT BRAND NEW BUT UNBEKNOWNST TO ME WAS MADE IN CANADA (SOMETHING WHICH WOULD NOT HAVE BEEN ACCEPTABLE TO ME HAD I BEEN TOLD).  UPON POSSESSION THE WINDSHIELD MOLDING CAME OFF ON THE RIDE HOME.  THE DRIVER SIDE TIEROD END WENT AT 12,000 MILES AND AGAIN AT 24,000 MILES BECAUSE UPON INSPECTION THE BALL JOINTS WERE NEVER PROPERLY TIGHTENED.  THE BOLTS ON THE TRANSMISSION WERE FOUND BY THE DEALER TO HAVE BEEN NEVER PROPERLY TIGHTENED.  THE SIDEDOOR HINGE HAD TO BE REPLACED AT A COST OF $600 BECAUSE IT FROZE UP AND COULD NOT BE OPENED.  THE POWER STEERING UNIT RUSTED OUT AT 12,000 MILES AND STARTED LEAKING FLUID AND, WHAT I FIND MOST IMPORTANT, I AM NOT SURE IF I HAVE AIRBAGS BECAUSE THE AIRBAG LIGHT STAYS ON BUT IS NOTED TO GO OFF WHEN THE KEY IS PARTIALLY TURNED HOWEVER THE KEY CANNOT STAY IN THIS POSITION AND MUST BE TURNED TO START THE VEHICLE.  FUEL EXPECTATION WAS NEVER NEAR WHAT I WAS TOLD IT WOULD BE AND TAILPIPE CONSISTENTLY SHOWED EVIDENCE OF BEING BLACKENED DUE TO INSUFFICIENT FUEL BURNING.  THE POOR BACKDOOR DESIGN MAKES IT DIFFICULT TO SEE OUT THE BACK WINDOW AND IT IS CLEARLY EVIDENT BY ALMOST EVERY VAN OF THIS TYPE HAVING A DENTED BUMPER DUE TO THIS BLINDSPOT IN DESIGN. I HAVE NOT BEGUN TO LIST ALL THE THINGS NOT RIGHT WITH THIS VEHICLE BUT I WILL CHALK THEM UP TO DOWNRIGHT LYING AND JUST INFERIOR PARTS AND CRAFTSMENSHIP.  THIS VEHICLE HAS BEEN A NIGHTMARE.       *TR",
        "vin": "1GCFG15T731"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/17/2014",
        "dateOfIncident": "04/16/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583405,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR THE SECOND TIME IN ONE WEEK THE ENGINE RACED TO MAX RPM WITHOUT A THROTTLE INPUT.  HAD TO PUT IT IN NEUTRAL TO SLOW DOWN WITH THE BRAKES.  THE FIRST TIME (35MPH SLOWING DOWN FOR A RED LIGHT) WENT TO NEUTRAL, FOOT ON BRAKE AND BACK TO DRIVE, THE ENGINE RESPONDED NORMALLY.  LAST NIGHT THE ENGINE RACED TO MAX RPM AGAIN 100 FEET FROM MY PARKING SPOT GOING LESS THAN 5MPH WENT TO NEUTRAL BACK TO DRIVE NO CHANGE IN ENGINE SPEED BACK TO NEUTRAL GLIDE TO PARKING SPOT TURNED ENGINE OFF.  NO WARNING WHEN THE MAX ENGINE REV WOULD BEGIN, ONE WAS SLOW SPEED THE OTHER MODERATE SPEED, TEMP 75 ONE DAY, TEMP 45 YESTERDAY.  WORKED FINE TODAY.  WORRIED THE PROBLEM IS NOT REPEATABLE OR CAN BE FOUND USING A CODE READER.  WORRIED THAT THE ONLY WAY NOW TO STOP MAX ENGINE RPM IS BY TURNING ENGINE OFF, NOT SAFE WHILE DRIVING ON THE INTERSTATE.  *TT",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/08/2014",
        "dateOfIncident": "03/10/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578288,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS CONVERSION VAN. THE CONTACTED STATED THAT WHILE DRIVING 45 MPH, ALL OF THE GAUGES AND ELECTRICAL FEATURES FAILED HOWEVER, THE LIGHT FUNCTIONS REMAINED OPERABLE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN WAS UNABLE TO DIAGNOSE A FAILURE. NO REPAIRS WERE PERFORMED TO THE VEHICLE. THE MANUFACTURER WAS NOT NOTIFIED ABOUT THE FAILURE. THE FAILURE MILEAGE WAS 80,000 AND THE CURRENT MILEAGE WAS 84,000.   UPDATED 5/22/14*CN",
        "vin": "1GBFG15T931"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/20/2013",
        "dateOfIncident": "07/23/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10556819,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER A NOTICED LACK OF PRESSURE IN BRAKE PEDAL. THE BRAKE PEDAL WENT FULLY TO THE FLOOR AND RESULTED IN LESS BRAKING THAN EXPECTED. DRIVER REDUCED SPEED BY DOWNSHIFTING TO LOWER GEARS (AUTOMATIC TRANSMISSION) AND PULLED INTO FIRST AVAILABLE PARKING AREA. BY PUMPING THE BRAKES AND PULLING INTO AN UPHILL PARKING SPOT, DRIVER ACHIEVED ENOUGH BRAKING TO COME TO A FULL STOP WITHOUT USING THE EMERGENCY BRAKE. INSPECTION SHOWED A NEARLY FULL BRAKE RESERVOIR AND NO LEAKAGE FROM WHEEL CYLINDERS. FURTHER INSPECTION SHOWED LEAKING FLUID FROM BRAKE LINE ON LEFT SIDE UNDER THE DRIVERS SEAT AND ABOVE THE VEHICLE FRAME. IT SQUIRTED OUT FROM A CRACK IN A BRAKE LINE WHEN BRAKE PEDAL WAS PUMPED. THE VEHICLE WAS DEEMED UNSAFE TO DRIVE. THE VEHICLE WAS TOWED FOR REPAIR.  *TR",
        "vin": "1GAGG25U531"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "07/02/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523793,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 CHEVY EXPRESS 2500 CARGO VAN WAS IN EVENING RUSH HOUR STOP AND GO TRAFFIC. AFTER REDUCING MY SPEED TO 10 MPH THEN ATTEMPTING TO ACCELERATE. THE VEHICLE STALLED AND BEGAN TO IDLE ROUGH AND SHUT-OFF. I HAD TO PUT THE VEHICLE IN NEUTRAL AND RESTART IN THE MIDDLE OF THE INTERSTATE. I HAD TO CONTINUE TO SHIFT INTO NEUTRAL AND PRESS THE GAS TO PREVENT THE VEHICLE  FROM SHUTTING OFF IN THE MIDDLE OF TRAFFIC. I HAD THE PLUGS AND WIRES CHANGE THE VERY NEXT DAY AND THE PROBLEM CONTINUED.     THIS COULD HAVE TURNED INTO A MAJOR ACCIDENT WITH THE VEHICLE SHUTTING OFF IN THE MIDDLE OF TRAFFIC. THIS ISSUE SHOULD BE ADDRESSED AND AN IMMEDIATE RECALL NOTICE SHOULD BE PUT INTO EFFECT TO PREVENT A MAJOR ACCIDENT WHICH COULD LEAD TO A POSSIBLE FATALITY.     THIS IS DANGEROUS!   I'VE RESEARCHED THIS ISSUE AND HAVE FOUND MULTIPLE CHEVY EXPRESS OWNER'S WITH THE SAME CONCERN.    GM SHOULD DO THE RIGHT THING FOR THE CUSTOMERS WHO SUPPORT THEIR BRAND AND PRODUCT.   *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/17/2013",
        "dateOfIncident": "11/15/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10493335,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 1500. THE CONTACT STATED THAT FUEL WAS LEAKING FROM UNDER THE VEHICLE. THE VEHICLE WAS TAKEN TO THE DEALER AND TO AN INDEPENDENT MECHANIC FOR DIAGNOSTIC TESTING. THE TECHNICIAN AND THE MECHANIC ADVISED THAT THE RETURN AND DELIVERY FUEL LINES WOULD HAVE TO BE REPLACED DUE TO CORROSION. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 148,000.",
        "vin": "1GBFG15T431"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2012",
        "dateOfIncident": "10/17/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10484524,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2003 CHEVROLET EXPRESS. THE CONTACT STATED THAT SHE NOTICED A LEAK UNDER THE VEHICLE WHEN SHE WOULD PUT REFUEL.  THE VEHICLE WAS TAKEN TO A DEALER FOR INSPECTION WHERE THEY ADVISED THAT THE FUEL FILLER NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THEY WOULD PAY A PORTION OF THE REPAIR COSTS. THE FAILURE MILEAGE WAS 126,600.",
        "vin": "1GBFG15T831"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/25/2012",
        "dateOfIncident": "08/09/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482191,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 3500. THE CONTACT STATED THAT AFTER STARTING THE VEHICLE THE TRANSMISSION FAILED TO SHIFT INTO GEAR. THE VEHICLE WAS TOWED TO THE DEALER WHO STATED THAT THE CAUSE OF FAILURE WAS UNKNOWN. HOWEVER, THE TECHNICIAN STATED THAT THE MAF CENSOR NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE DEALER WHO STATED THAT THE VEHICLE NEEDED THE CATALYTIC CONVERTERS REPLACED. THE VEHICLE WAS REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 58,500.",
        "vin": "1GCHG35U731"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/24/2012",
        "dateOfIncident": "07/02/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482034,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE VEHICLE FUEL TANK IS FILLED, GAS FUMES ARE DETECTED AND SOME FUEL CAN BE SEEN ON THE BOTTOM OF THE TANK (A FEW DROPS OF FUEL).  AS THE TANK CONTENTS LOWER THE SMELL AND LEAK GOES AWAY.  AN ACCESS HOLE ON THE SIDE OF THE VAN REVEALS THAT THE TANK HAS A SMALL LEAK WHERE THE PLASTIC FILL NECK WAS BONDED TO THE TANK.  THE STEEL FILL NECK AND RUBBER CONNECTION LOOK FINE.  THIS IS A CONVERSION VAN W/O A LEFT HAND DOOR.  THIS VEHICLE WAS BOUGHT FROM A SOUTHERN CLIMATE AREA AND IS ONLY RECENTLY BEEN BROUGHT TO A NORTHERN CLIMATE SO CORROSION IS NOT SUSPECTED.     SINCE I SEE NO RECALL OR MANY COMPLAINTS, I AM LOOKING TO REPAIR OR REPLACE THE TANK.  CURRENTLY LOOKING FOR A SEAL MATERIAL THAT COULD BE APPLIED TO THE LEAK AND THAT WORKS ON POLYURETHANE AND RESISTS FUEL.  HAVE NOT FOUND ONE. THE VEHICLE IS WELL OUT OF WARRANTY BUT THIS DOES SEEM TO PRESENT A SAFETY ISSUE.    SHORT TERM SOLUTION IS TO NOT FILL THE TANK. *TR",
        "vin": "1GCHG39U331"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/09/2012",
        "dateOfIncident": "08/10/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479318,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A FAMILY OUTING WE WERE UNABLE TO CLOSE THE RIGHT REAR PASSENGER DOOR. EXPERIENCED DIFFICULTY CLOSING DOOR. AFTER SEVERAL ATTEMPTS, I NOTICED THE DOOR WAS NOT ALIGNED WITH THE BODY OF THE CAR WHICH PROHIBITED THE DOOR LATCH TO CONNECT AND CLOSE.  THE DOOR WOULD NOT CLOSE SHUT COMPLETELY AND HAS SINCE KNOCKED WHILE DRIVING AND ALSO CREATES A SAFETY HAZARD FOR  CHILDREN & ADULTS BECAUSE IT  IS PRIMARY EXIT FOR THE REAR EXIT TO THE SIDEWALK FORCING  PASSENGERS TO EXIT FROM THE REAR LEFT DOOR PASSENGER DOOR ONTO THE STREET TO ONCOMING TRAFFIC THAT CAN LEAD TO ACCIDENT, BODILY INJURY OR FATALITY.  NO PRIOR MAINTENANCE INSTRUCTIONS OR SUGGESTED UPKEEP WAS DOCUMENTED IN THE BUYERS MANUAL WHICH CAME WITH THE VEHICLE  THAT WOULD INDICATE POSSIBLE HINGE CORROSION OR RUSTING.  POSSIBLE PIN DEFECT DETECTED BY CERTIFIED DEALER ON 10/7/2012, WHEN TAKEN IN FOR SAFETY RECALL ON FUEL  FILLER PIPE  RECALL 12166 CAMPAIGN ID#12V388.  MULTIPLE COMPLAINT FOR HINGE/PINS HAVE BEEN DOCUMENTED IN COMPLAINTS ON SAFERCAR.ORG WEBSITE FOR 2003 CHEVY EXPRESS VAN. I BELIEVE THIS ISSUE SHOULD BE INVESTIGATED TO AVOID ACCIDENTAL DEATHS DUE TO INOPERABLE ACCESS TO SIDEWALK FROM THE LEFT REAR PASSENGER DOOR.  *TR",
        "vin": "1GBFG15T431"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/28/2012",
        "dateOfIncident": "12/14/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10472768,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS. THE CONTACT STATED THAT THE SEAT BELT BUCKLE ASSEMBLY BROKE. THE VEHICLE WAS TAKEN TO THE DEALER WHO STATED THAT THE SEAT BELT WAS WORKING UP TO SPECIFICATIONS. THE DEALER STATED THAT THERE WAS A RECALL NHTSA CAMPAIGN ID NUMBER: 03V050000 COMPONENT: SEAT BELTS:FRONT:BUCKLE ASSEMBLY. BUT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE WHO DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NOT INCLUDED IN ANY RECALLS. THE FAILURE MILEAGE WAS 65,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2012",
        "dateOfIncident": "08/17/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471856,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS. THE CONTACT STATED THAT A SMALL AMOUNT OF FUEL CONTINUOUSLY LEAKED OUT OF THE FUEL TANK FILLER NECK IMMEDIATELY AFTER REFUELING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO STATED THAT THE FUEL FILLER NECK TUBE EXHIBITED RUST CORROSION. THE PART WAS REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE PROBLEM. THERE WAS A RECALL ASSOCIATED WITH NHTSA CAMPAIGN ID NUMBER 12V388000 (FUEL SYSTEM, GASOLINE:STORAGE:TANK ASSEMBLY: FILLER PIPE AND CAP) HOWEVER THE VIN WAS NOT INCLUDED. THE APPROXIMATE FAILURE MILEAGE WAS 111,000.",
        "vin": "1GAGG25U231"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "08/14/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS CONVERSION VAN. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, HE NOTICED A HOLE IN THE FUEL FILLER NECK. THE VEHICLE WAS NOT TAKEN TO THE DEALER. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE AND CURRENT MILEAGES WERE 127,000.",
        "vin": "1GBFH15T431"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/22/2012",
        "dateOfIncident": "05/01/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10459328,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON A FEW OCCASIONS PRIOR TO LOCATING A LEAK, I NOTICED A GASOLINE SMELL.  FINALLY WHEN FILLING EARLIER THIS MONTH, I SAW A LOT OF LEAKING COMING OUT OF THE FUEL FILLER TUBE, BETWEEN THE METAL TUBE AND THE PLASTIC COVER SURROUNDING THE TUBE.  WHEN I GOT HOME, I CUT OFF THE PLASTIC TUBE ABOUT HALFWAY AND FOUND A STATIC WIRE RUNNING THE LENGTH OF THE TUBE.  EVERYWHERE, WHERE THIS WIRE TOUCHED TO METAL PIPE, IT WAS CORRODED COMPLETELY THROUGH.  THE STATIC WIRE IS OF A DIFFERENT MATERIAL AND WAS NOT CORRODED. PRESENTLY I HAVE WRAPPED THE TUBE WITH A GASOLINE RESISTANT TAPE. BUT, I WILL HAVE TO REPLACE THE TUBE SOON. THE LOCAL DEALERSHIP HAS QUOTED APPROX. $241.00 WITHOUT INSTALLATION. ARE THERE OTHER INSTANCES LIKE THIS AND IS THERE A RECALL I'M NOT AWARE OF. THANK YOU FOR YOUR TIME.  *TR",
        "vin": "1GCEG15X731"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/01/2012",
        "dateOfIncident": "03/31/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10453725,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR SOMETIME, THERE WAS A SMELL OF GASOLINE WHEN FILLING THIS VAN, WHICH I JUST ATTRIBUTED TO A VAPOR RELEASE WHEN THE TANK WAS FULL.  RECENTLY, I NOTICE GAS LEAKING UNDER THE VAN WHEN FILLING AT THE GAS STATION.  THE GAS LEAKS IN AND AROUND THE BRAKE LINES.  THIS VAN IS A 2003 CHEVROLET EXPRESS 1500 WITH LEFT HAND DOOR OPTION.  THIS IS MY FAMILY VEHICLE AND IN RESEARCHING THIS PROBLEM FURTHER, I UNDERSTAND IT TO BE A KNOWN PROBLEM AND A DESIGN FLAW, WHERE THE FUEL FILL HOSE RUSTS.  THIS NEEDS A RECALL WITH IMMEDIATE ATTENTION.  *TR",
        "vin": "1GBFG15T231"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/30/2012",
        "dateOfIncident": "01/19/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10445925,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS REFUELING MY VAN AND GAS STARTED POURING OUT FROM THE BOTTOM. AFTER LOOKING I DISCOVERED THE FUEL FILLER NECK WAS RUSTED THRU. THE VAN ONLY HAS 64K MILES. I REPLACED IT MYSELF AT THIS TIME. THERE WAS NO COLLISION DAMAGE....SIMPLY HEAVY CORROSION.  *TT",
        "vin": "1GNFH15T531"
    },
    {
        "components": "STRUCTURE,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2012",
        "dateOfIncident": "11/07/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 CHEVROLET EXPRESS VAN 2500 THAT THE PAINT JUST STARTED FALLING OFF IN LARGE FLAKES ON THE REAR AND SIDE DOORS, AND THE FRONT HOOD. I HAVE TRIED TOUCH UP PAINT TO TRY AND STOP THE PEELING, BUT IT HAS NOT HELPED.WHEN I WASH THE VEHICLE OR IT RAINS MAKES THE PROBLEM WORSEN BY FILLING UP POCKETS BEHIND THE PAINT. THIS IS A MY COMPANY VAN WHICH HAS DECAL LETTERING ON IT. THE FLAKING IS STARTING TO GET TO THE LETTERING. IF IT CONTINUES, I WILL LOOSE APPROX. $800.00 TO A $1000.00 IN DECAL LETTERING PLUS THE VAN LOOKS TERRIBLE FOR A COMPANY VAN. THE COLOR OF THE VAN IS WHITE. I HAVE NOTICED MANY GM CARS AROUND WHERE I LIVE THAT HAVE THIS PROBLEM. I NEVER REALLY NOTICED UNTIL MY VAN STARTED TO DO IT. MANY OF OUR CITY POLICE CARS WHERE I LIVE ARE WHITE GM PRODUCTS AND HAVE PAINT PEEL ON THEM.WHY IS GM NOT CORRECTING THIS ISSUE? WHAT CAN I DO TO GET THIS PROBLEM CORRECTED? I HAVE OTHER GM PRODUCTS I OWN. I AM NOT SURE IF I WILL PURCHASE ANOTHER DUE TO PROBLEMS SHOWING UP YEARS DOWN THE ROAD THAT SHOULD NOT EXIST IF THEIR PRODUCT IS A QUALITY PRODUCT AND GM STANDS BEHIND THEIR QUALITY OF WHAT THEY PRODUCE. NOW I AM FACED WITH THE COST OF A PAINT JOB AND THE COST OF RELETTERING THE VAN. THE SMARTER ANSWER MAY BE TO BUY ANOTHER VAN OF ANOTHER MAKE AND STAY AWAY FROM GM IF THEY CANNOT STAND BEHIND THEIR PRODUCT QUALITY. I HAVE READ TOO MANY ARTICLES ABOUT PAINT PEEL ON GM PRODUCTS SINCE INVESTIGATING THIS ISSUE. MANY SUGGEST SMALL CLAIMS COURTS BECAUSE GM WILL DO NOTHING ABOUT IT. NEED HELP IF THERE IS ANY SUGGESTIONS.",
        "vin": "1GCGG25U931"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/09/2012",
        "dateOfIncident": "09/01/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443143,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 1500. THE CONTACT STATED THAT AFTER REFUELING, HE NOTICED AN OVERPOWERING FUEL ODOR. THE CONTACT FURTHER INSPECTED THE VEHICLE AND FOUND THAT THE FUEL TANK WAS LEAKING AND RUSTED. THE VEHICLE WAS INSPECTED BY THE DEALER AND THEY ADVISED THE CONTACT THAT THE GASOLINE FILLER TUBE NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS APPROXIMATELY 64,000.     UPDATED 02/13/12",
        "vin": "1GBFG15T131"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/29/2011",
        "dateOfIncident": "12/26/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441615,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHEVROLET EXPRESS FUEL FILLER PIPE LEAK:    GAS FILLER TUBE RUSTED THROUGH AND GASOLINE LEAKED EVERY TIME I REFUELED.  CORROSION HOLES CAUSED FUEL TO LEAK AND CREATING A FIRE HAZARD.    THIS VAN HAS A LEFT SIDE REAR CARGO DOOR.    THIS IS A SIMILAR COMPLAINT AS: ODI ID NUMBER : 10413214    *KB",
        "vin": "1GBFH15T431"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/14/2011",
        "dateOfIncident": "12/09/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10439884,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 3500.  THE CONTACT STATED THAT THE FRONT DRIVER AND REAR SEAT BELTS WOULD NOT LATCH AND ONE OF THE REAR SEAT BELTS WAS COMPLETELY INOPERABLE.  THE DEALER AND MANUFACTURER WERE CONTACTED AND ADVISED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 05V558000 (SEAT BELTS).  THE RECURRING FAILURE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 65,030 AND THE CURRENT MILEAGE WAS 65,040.  UPDATED 01/20/12*LJ  UPDATED 01/20/12",
        "vin": "1GAHG35U431"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/19/2011",
        "dateOfIncident": "06/10/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS LEAKING FROM FUEL FILLER PIPE ONTO INSIDE OF WHEEL WELL AND GROUND. EXAMINATION REVEALS DESIGN OF PIPE ASSEMBLY (METAL PIPE INSIDE CORRUGATED PLASTIC TUBE), TRAPS CONDENSATION AND WATER AROUND METAL PIPE GUARANTEEING RUST AND LEAKS. MAY BE WORSE IN HIGH HUMIDITY REGIONS BUT SAME ASSEMBLY IS OPEN TO WATER SPLASHED UP FROM ROAD.   THIS MAY ONLY OCCUR ON CARGO VANS WITH LEFT HAND DOOR OPTION.  UPDATED 08/11/11 *BF  *KB",
        "vin": "1GCHG35U231"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "07/17/2011",
        "dateOfIncident": "07/16/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413213,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVERS SEAT BELT BECAME STUCK AND I HAD TO LIMBO TO GET OUT OF MY EXPRESS CONVERSION VAN. I HAD TO BAG ON IT TO MAKE IT RELEASE. IT DOESN'T LATCH ANYMORE AND I NEED TO REPLACE THE BOTTOM SECTION.  *TR",
        "vin": "1GBFG15T831"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2011",
        "dateOfIncident": "07/10/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413214,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS FILLER TUBE RUSTED THROUGH AND GASOLINE LEAKED EVERY TIME I REFUELED. THIS WAS NOT A SMALL HOLE. THE METAL ON THE WHOLE TUBE BROKE DOWN CAUSING FUEL TO LEAK AND CREATING A FIRE HAZARD.   UPDATED 08/11/11 *BF            UPDATED 3/08/2012 *LN  *TR",
        "vin": "1GBFG15T831"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/16/2011",
        "dateOfIncident": "06/26/2011",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413176,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRE HARNESS FIRE. WATER GOT INTO THE END OF ONE OF THE CONNECTORS FROM THE WIRE HARNESS GOING INTO THE TRASMISSION. THE RESULT OF THE WATER GETTING INTO THE TRANSMISSION CAUSED AN ELECTRICAL FIRE AND CAUSED A SHORT IN THE TRANSMISSION AND ENGINE WIRE HARNESS, THE FINAL RESULT WAS THE WIRE HARNESS WAS COMPLETELY BURNED UP. THERE WAS EVIDENCE OF GLUEING THE CONNECTORS YEARS AGO.I IF THE CONNECTORS ARE NOT SEALED, IT IS POSSIBLE FOR  WATER TO ENTER AND SHORT OUT CONNECTORS AND OTHER ELECTRICAL COMPONENTS.  *TT",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/11/2011",
        "dateOfIncident": "06/20/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411911,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FILLING UP THE VAN, NOTICE THAT GASOLINE WAS LEAKING FROM THE FUEL FILLER TUBE.  INVESTIGATION CONCLUDED THAT THE PLASTIC CORRIGATED WRAP THAT CHEVY PLACED ON THE TUBE, TRAPS WATER, SALT, DIRT, ECT... IN IT, ALLOWING THE PIPE TO RUST, WITHOUT THE DRIVER/OWNER NOTICING THE DAMAGE UNTIL IT STARTS LEAKING.  AS A FIREFIGHTER, I REALIZE THE DANGERS OF GASOLINE LEAKING UNDER A VEHICLE, I FEEL THAT THIS IS A SERIOUS DESIGN FLAW FOR THE FILLER TUBE.  *TT",
        "vin": "1GNGG25U731"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "05/09/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399953,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING IN A HORRIBLE RAINSTORM, THE DRIVER'S SIDE WINDSHIELD WIPER STOPPED MOVING AND THEN ON THE NEXT ROTATION, SWUNG ITSELF AROUND AND GOT LODGED BY THE SIDE VIEW MIRROR.  AN ACCIDENT WAS AVOIDED, BUT IT OCCURRED 3 MORE TIMES RANDOMLY THAT SAME DAY, AND THEN TODAY.  IT WAS A MIRACLE THROUGH THE HEAVY RAIN THAT WE DIDN'T WRECK.  LUCKILY THE PASSENGER SIDE WIPER KEPT WORKING AND WITH SOME LUCK, WE EXITED TO SAFETY.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/09/2011",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399510,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHEVROLET EXPRESS. WHILE DRIVING  APPROXIMATELY 30 MPH THE CONTACT APPLIED PRESSURE TO THE BRAKE  PEDAL BUT THE VEHICLE HESITATED TO STOP. THE CONTACT APPLIED  EXCESSIVE PRESSURE TO THE BRAKE PEDAL IN ORDER TO STOP THE VEHICLE. THE FAILURE RECURRED INTERMITTENTLY. THE VEHICLE WAS TAKEN TO AN AUTO SHOP WHERE THE VEHICLE WAS INSPECTED. THE TECHNICIANS  WERE ABLE TO DUPLICATE THE FAILURE. THE TECHNICIAN STATED THE BRAKE PADS AND ROTORS WERE IN GOOD CONDITION BUT INFORMED THE CONTACT OF A RECALL UNDER NHTSA CAMPAIGN ID NUMBER: 04V045000 (SERVICE BRAKES, HYDRAULIC). THE DEALER WAS NOTIFIED AND INFORMED THE CONTACT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "1GCFG15X431"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/10/2011",
        "dateOfIncident": "01/28/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10381462,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN AN ACCIDENT TRAVELING 65 MPH AND HIT ANOTHER VEHICLE BROADSIDE AND THE AIR BAG NEVER DEOLOYED. THE VEHICLE WAS TOTALED. ITS A 2003 3500 CHEVY VAN. *TR",
        "vin": "1GCHG35U231"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2010",
        "dateOfIncident": "09/13/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10355871,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CHEVY 2003 EXPRESS VAN FUEL FILLER NECK HAS RUSTED THROUGH IN 2 PLACES AND GAS POURS  OUT EVERY TIME  I REFUEL. ONLY 63,000 MILES ON VAN. I BELIEVE THIS I S A VERY SERIOUS FIRE HAZARD!!! IS THERE A RECALL? *TR",
        "vin": "1GBFG15T831"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/03/2010",
        "dateOfIncident": "09/03/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10353717,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAKING FROM FUEL TANK FILLER TUBE WHEN FILLING GAS TANK. *TR",
        "vin": "1GNFH15TX31"
    },
    {
        "components": "PARKING BRAKE,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2010",
        "dateOfIncident": "08/13/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10349272,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE APPROXIMATELY JANUARY OF 2010, FAMILY MEMBERS NOTICED AN INCREASING AMOUNT OF FUEL LEAKING ON THE GROUND DURING FUELING. AFTER FURTHER INVESTIGATION, I NOTICED IT ORIGINATED FROM THE FUEL FILLER TUBE WHICH ALLOWS THE GAS TO TRAVEL FROM THE GAS CAP TO THE GAS STORAGE TANK. AUGUST 2010, THE LEAKAGE BECAME SO SEVERE FROM THE FUEL FILLER TUBE I FEARED SOMEONE COULD IGNITE (I.E. CIGARETTE, CELL PHONE, STATIC CHARGE) THE 1 TO 2 GALLONS OF FUEL LEAKED AT THE PUMP. MY EXPRESS WAS ONLY OUT-OF-COMMISSION AT DEALERSHIP FOR 2 DAYS TO REPLACE THE FUEL FILLER TUBE. DROPPING A  AT THE TIME OF FILL UP. THE REPAIR COST $167.00 AND THE DEALERSHIP WHO REPAIRED MY 2003 CHEVY PASSENGER EXPRESS VAN SAID, \"... THE CAUSE WAS A PARK BRAKE CABLE RUBBING ON THE TUBE.\" AS A CONSUMER AND AUTOMOTIVE ENGINEER, I FEEL THE MANUFACTURER IS RESPONSIBLE FOR THIS DESIGN DEFECT. THE DEALERSHIP SIMPLY INDICATED THEY NEVER SEEN THIS ON THE EXPRESS. IT APPEARS THIS IS MORE THAN AN ISOLATED OCCURRENCE. *TR",
        "vin": "1GBGG25U731"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/25/2010",
        "dateOfIncident": "06/23/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS PARKED IN OUR COMPANY PARKING LOT, VEHICLE WAS NOT RUNNING AND THE KEY WAS NOT IN THE IGNITION. EMPLOYEE WAS LOADING TOOLS AND EQUIPMENT INTO REAR OF VEHICLE AFTER COMPLETING A JOB. SIDE SLIDING DOOR WAS OPEN. PASSENGER AIR BAG ONLY DEPLOYED. VEHICLE HAD NOT BEEN A WRECK. *TR",
        "vin": "1GCFG25T131"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "06/23/2010",
        "dateOfIncident": "05/11/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340091,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHEVROLET EXPRESS LOST CONTROL OF VEHICLE STRIKING THE MEDIAN BARRIER.  *BF  ACCORDING TO THE POLICE REPORT, THE REAR TIRES HAD VERY LITTLE TREAD. ON THE INSIDE OF THE TIRES, THERE WAS NO TREAD. (OHIO TRAFFIC CRASH REPORT # 10-0234-91)*JB  UPDATED 07/22/10  *BF",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/13/2010",
        "dateOfIncident": "07/07/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325541,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER HAD A WRECK IN HER VECHICLE AND THE AIR BAG DIDN'T DEPLOY. *TR",
        "vin": "KL1TD56686B"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "12/17/2009",
        "dateOfIncident": "06/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10296179,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 CHEVROLET EXPRESS VAN.  I AM UNABLE TO OPEN THE REAR DOORS ON THE DRIVER AND PASSENGER SIDES.  I HAVE BEEN TOLD BY A LOCAL BODY SHOP THAT THE PROBLEM IS THE PINS THAT WERE USED IN THE HINGES.  THEY ARE RUSTING FROM THE INSIDE CAUSING THE DOORS NOT TO OPEN.  THIS BODY SHOP SAID THEY HAVE BEEN GIVEN INFORMATION ON HOW TO FIX THE PROBLEM AT A COST OF $1500.00 PER SIDE.  BUT I CANNOT FIND ANY INFORMATION ABOUT A RECALL FROM GENERAL MOTORS.  I DO NOT HAVE AN EXTENDED WARRANTY ON THIS VEHICLE BUT I DON'T THINK THESE REPAIRS SHOULD BE MADE AT MY EXPENSE.  THIS VEHICLE IS USED MOSTLY WHEN I GO CAMPING.   I HAVE TWO YOUNG CHILDREN WHO RIDE IN THIS VEHICLE.  I TRIED TRADING THIS VEHICLE IN NUMEROUS TIMES BEFORE THE REAR DOORS BECAME TOTALLY INOPERABLE.  BUT EVERY DEALERSHIP I GO TO GOES FOR THE REAR DOORS AND TRIES TO OPEN THEM.  WHICH LEADS ME TO BELIEVE THAT THEY KNOW THAT A PROBLEM EXISTS.  *TR",
        "vin": "1GBFG15T231"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/06/2009",
        "dateOfIncident": "10/16/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291242,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET VENTURE.  CONDENSATION ACCUMULATES INSIDE OF THE HEADLIGHTS.  AFTER FUELING THE VEHICLE, SHE SMELLED A STRONG ODOR OF GASOLINE INSIDE OF THE VEHICLE.  THE WINDSHIELD WIPERS INTERMITTENTLY FAIL . SHE SPECULATED THAT THE VEHICLE HAS AN ELECTRICAL DEFECT. THE MANUFACTURER WAS NOTIFIED, BUT SHE WAS NOT PROVIDED WITH ANY ASSISTANCE. THE CURRENT MILEAGE WAS 109,200 AND FAILURE MILEAGE WAS 92,000.",
        "vin": "1GNDX03E53D"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/26/2009",
        "dateOfIncident": "10/22/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289860,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN A CITY ROAD THE LOW TRAC LIGHT CAME ON WHEN STOPPED AT A LIGHT THE CAR DIES PUSHED IT TO A PARKING LOT TRIED TO START WOULD NOT. TOOK IT TO THE DEALER AND FOUND THAT IT WAS A BAD FUEL PUMP. THIS COULD OF BEEN SCARY IF IT WOULD OF DIED ON THE HIGHWAY VEHICLE HAS 84,000 MILES ON IT. *TR",
        "vin": "1G1JH12F637"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/10/2009",
        "dateOfIncident": "09/10/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283608,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "UNDER NORMAL USE REAR SIDE DOOR IS HARD TO OPEN OR CLOSE AND NOW BROKEN. THE DOOR, EVEN BEFORE IT WAS BROKE WAS HARD TO LATCH IF IT WOULD LATCH. THIS WOULD MAKE THE FRONT SIDE DOOR NOT CLOSE TIGHT. NOW WITH THE HINGE BROKEN THE DOOR DOES NOT LATCH CORRECTLY. ALL EXPRESS VANS HAVE THIS SAME PROBLEM AND MANUFACTURE KNOWS IT. I TRIED USING EVERY PENETRATING OIL AND IT WOULD NOT KEEP THE DOOR HINGE FROM SEIZING UP. THIS IS A COMPANY VAN AND WE HAVE 2 OF THEM WITH BROKEN HINGES (BOTH ARE THE TOP REAR ON THE SIDE DOOR) AND A 3RD THAT IS VERY HARD TO OPEN CLOSE. IF THIS WERE A PASSENGER TYPE THE DOOR COULD BE HIT ON THE INSIDE AND OPENED BY ACCIDENT. WE ARE IN THE PROCESS OF LOCATING A HINGE TO REPLACE THE ONE ON THE VAN I DRIVE AND WAS TOLD BY THE LOCAL DEALER TO KEEP ALL RECEIPTS INCASE OF A RECALL. I WAS TOLD IT WOULD BE AROUND $1200 TO FIX 1 DOOR. I DO NOT HAVE THE VIN AT THIS TIME, BUT DURING THE DAY I AM WITH THE VAN 7AM TO 4PM . *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/19/2009",
        "dateOfIncident": "10/24/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259377,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE OCTOBER OF 08, I ORDERED A FILLER TUBE WHICH ALLOWS THE GAS TO TRAVEL FROM THE GAS CAP TO THE GAS STORAGE TANK. EVERYTIME I FILL UP, GAS STATIONS WILL SHUT THE PUMP OFF DUE TO SEVERE LEAKING FROM THIS FILLER TUBE. THE LEAK IS SO SEVERE THAT THE FEAR IS SOMEBODY DROPPING A CIGARETTE AT THE TIME OF FILLUP. APPROX 1 GAL OF GAS  LEAKS/ FILLUP. I ORDERED THE NEW PART IN LATE OCTOBER FROM THE DEALERSHIP  I PURCHASED MY 2003 CHEVY PASSENGER EXPRESS VAN. I HAVE SPOKEN TO THE CHEVY REGIONAL OFFICE AND BEEN TOLD THAT THE PART IS ONLY AVAILABLE AT 5 DEALERSHIPS IN THE COUNTRY BUT THEY HAVE BEEN RESERVED FOR CUSTOMERS AND I WOULD HAVE TO WAIT UNTIL THE PART GETS MANUFACTURED ONCE AGAIN. WHEN? THEY DON'T KNOW. I REQUESTED A SIMILAR VEHICLE BE LOANED TO ME UNTIL THE NEW PART BECOMES AVAILABLE. THEY SAID \"NO, IF YOU FEEL UNSAFE THEN I SHOULDN'T DRIVE IT. I TOLD THEM THIS IS AN ACCIDENT WAITING TO HAPPEN AND IT WILL NOT ONLY COST MY LIFE BUT ANYONE IN PROXIMITY TO THE GAS STATION. ONE PARTICULAR DEALERSHIP SHARED WITH ME THAT IF GM DOESN'T PAY A BILL FOR WHATEVER REASON, THE PART MANUFACTURER HALTS PRODUCTION AND THIS IS WHAT HAPPENS. WILL YOU PLEASE HELP ME? *TR",
        "vin": "1GNFG15T131"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "01/15/2009",
        "dateOfIncident": "12/18/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255155,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SEAT BACK OF DRIVERS SEAT FAILED AND NOW SEAT WILL NOT STAY IN THE UPRIGHT POSITION. THE VEHICLE WAS NOT INVOLVED IN A COLLISION AND THIS OCCURED WHILE DRIVING. *TR",
        "vin": "1GBFG15X831"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/07/2009",
        "dateOfIncident": "12/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254141,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 3500.  THE CONTACT STATED THAT THE VEHICLE MADE A GRINDING NOISE.  HE INSPECTED THE VEHICLE AND DISCOVERED THAT THE FRONT AND REAR BRAKE PADS AND ROTORS WERE CORRODED.  A REPORT WAS FILED WITH THE MANUFACTURER AND THEY STATED THAT THEY COULD COVER 50% OF THE REPAIR COST FOR THE ROTORS; HOWEVER, THE CONTACT WOULD BE RESPONSIBLE FOR THE BRAKE PADS AND ANY ADDITIONAL COSTS.  THE VEHICLE IS OUT OF WARRANTY.  THE MANUFACTURER ALSO STATED THAT IF THE VEHICLE IS NOT DRIVEN REGULARLY, THE COMPONENTS COULD CORRODE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CURRENT AND FAILURE MILEAGES WERE 38,000.",
        "vin": "1GCHG35U331"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/09/2008",
        "dateOfIncident": "09/07/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241601,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 1500.  ON SEPTEMBER 7, 2008, THE CONTACT STARTED THE VEHICLE AND HEARD A KNOCKING SOUND.  THE SOUND ORIGINATED FROM THE ENGINE AND PERSISTED THROUGHOUT THE DAY.  HE CHECKED THE OIL AND NOTICED THAT THERE WAS ONLY ONE QUART.  HE PLACED MORE OIL IN THE VEHICLE.  THE FAILURE DID NOT PREVENT HIM FROM ACCELERATING.  THE CONTACT TOOK THE VEHICLE TO A LOCAL REPAIR SHOP AND WAS INFORMED THAT THE LIFTERS AND PUSH RODS WERE DEFECTIVE, WHICH CAUSED THE ENGINE TO FAIL.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 138,000.",
        "vin": ""
    },
    {
        "components": "SEAT BELTS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/05/2008",
        "dateOfIncident": "06/28/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10233227,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "(1)SEAT BELT WILL NOT LATCH. SEATBELT LATCH OPENS WITHOUT WARNING. (2)THE SIDE CARGO DOOR HINGES ARE FAULTY AND HARD TO OPEN. OPENS WITHOUT WARNING.  *TR",
        "vin": "1GCEG15X131"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/23/2008",
        "dateOfIncident": "05/21/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228721,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2003 CHEVY EXPRESS 3500 IN 2003. ON THE PASSENGER SIDE OF THE VAN THERE IS A FRONT PASSENGER DOOR AND ARE TWO PASSENGER DOORS ON THE SIDE OF THE VAN. IN FIVE YEARS TIME I HAVE HAD TROUBLE WITH THE SIDE PASSENGER DOOR HINGE SEIZING UP AND NOW I CAN'T OPEN THE LEFT SIDE DOOR AND IT IS IMPROPERLY SEATED IN THE DOOR OPENING, I NOW DO NOT HAVE A TIGHT SEAL AND THE RIGHT SIDE DOOR CANNOT CLOSE PROPERLY. THIS POSES A SAFETY HAZARD BECAUSE IN AN EMERGENCY THE LEFT SIDE DOOR CANNOT BE OPENED.  *TR",
        "vin": "1GAHG39U231"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/24/2008",
        "dateOfIncident": "02/13/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219006,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AT 4:30 A.M. ON THE MORNING OF FEB 13 2008 WAS AWOKE TO FLAMES FLICKERING ON BEDROOM WALL IT WAS MY 2003 REGENCY CONVERSION VAN GOING UP IN SMOKE NO APPARENT REASON BUT IT DID START IN THE FUSE BOX AREA MAYBE THE SAME ISSUE AS THE HORN PROBLEM THE WEEK BEFORE HAD THE SAME PROBLEM OF HORN GOING OFF IN THE MIDDLE OF THE NIGHT BUT THERE WAS NO FIRE AT THAT TIME.   *TR",
        "vin": "1GBFG15T831"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/08/2008",
        "dateOfIncident": "01/07/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHEVY EXPRESS.  TURNED ON THE REAR DEFROSTER.  THE REAR PASSENGER SIDE WINDOW CAUGHT FIRE AND BEGAN BURNING.  PULLED THE VEHICLE TO THE SIDE OF THE ROAD AND ANOTHER CAR PULLED OVER WITH ME.  THE WINDOW CONTINUED TO BURN, AND THEN EXPLODED IN MY FACE.  THE FIRE WENT OUT AND THE WINDOW HAD SHATTERED INTO FRAGMENTS.  *TR",
        "vin": "1GAHG39U831"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/27/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10212891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2003 CHEVROLET TAHOE LT AND THE BACK GLASS HINGE HAS CAME UNGLUED FROM THE GLASS AND FALLEN ON ONE SIDE. I HAVE BEEN TOLD BY FOUR GLASS COMPANY'S THAT THEY HAVE HAD TO REPLACE MANY OF 2003 TAHOES AND SURBURBANS WITH THE SAME PROBLEM WITH THE BACK GLASS AND THAT IT IS A DEFECT. I CALLED THE CHEVROLET COMPANY AND WAS TOLD THAT THERE WAS NOTHING THEY COULD DO BECAUSE IT WAS OVER 100,000 MILES BUT ITS THERE PROBLEM THEY ARE THE ONES THAT GLUED THE HINGES TO THE GLASS AND WHY SHOULD I HAVE TO PAY 900.00 DOLLARS TO REPLACE THE GLASS ESPECIALLY WHEN I DON'T HAVE IT. PLEASE DO SOMETHING ABOUT THIS PROBLEM I KNOW THAT I AM NOT THE ONLY ONE WITH THIS PROBLEM. PLEASE MAKE THE CHEVROLET COMPANY FIX THIS PROBLEM. IT HAS CAUSED THE BACK GLASS TO STICK UP OVER THE BACK ABOUT A INCH AND YOU CAN NOT EVEN OPEN IT BECAUSE THE HINGE ON THE GLASS HAS COME COMPLETELY UNGLUED IT  FALLS DOWN WHEN YOU OPEN IT AND IS VERY VERY HARD TO CLOSE ONCE YOU OPEN IT. BECAUSE YOU HAVE TO PICK UP ON THE GLASS AND TRY TO CLOSE IT AT THE SAME TIME BELIEVE ME MY FINGERS HAS GOTTEN SMASHED MANY TIMES SO I STOPPED EVEN OPENING IT. BUT BEFORE THIS HAPPENED I REALLY USED IT ALOT TO PUT STUFF IN THE BACK WHEN THE 3RD ROW SEAT WAS BEING USED IF YOU OPENED THE WHOLE DOOR THEN YOUR STUFF FALLS OUT BECAUSE THERE'S NOT MUCH ROOM TO PUT YOUR STUFF BACK THERE.  *TR",
        "vin": "1GNEC13Z73J"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/21/2007",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212474,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 TAHOE AND HAVE HAD THE SPEEDOMETER STICK A NUMBER OF TIMES.  I HAVE TAKEN IT IN FOR REPAIR SEVERAL TIMES HOWEVER THE SERVICE TECH COULD NOT DUPLICATE THE CONDITION SO THEY TOLD ME NOT TO REPAIR THE ISSUE BECAUSE OF THE COST.  GM IS NOW OFFERING A \"SPECIAL COVERAGE\" THAT EXTENDS THE WARRANTY OF THE INSTRUMENT PANEL, HOWEVER ONLY IF THE TAHOE HAS LESS THAN 70,000 MILES OR YOU HAVE OWNED THE VEHICLE UNDER 7 YEARS WHICHEVER OCCURS FIRST. I FEEL THAT GM HAS KNOWN ABOUT THIS ISSUE AND SHOULD ISSUE A FULL RECALL TO CORRECT THIS ISSUE.  THIS IS A VERY DANGEROUS ISSUE THAT NEEDS TO BE ADDRESSED.   *TR",
        "vin": "1GNEC13Z33R"
    },
    {
        "components": "FUEL SYSTEM, OTHER,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/06/2007",
        "dateOfIncident": "12/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211040,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A LETTER FROM CHEVROLET STATING \"THIS LETTER IS INTENDED TO MAKE YOU AWARE THAT YOUR VEHICLE COULD DEVELOP A CONDITION WHERE ONE OR MORE OF THE INSTRUMENT PANEL GAUGE NEEDLES MAY STICK, FLUTTER, OR BECOME INOPERATIVE. THIS MAY CAUSE INACCURATE READINGS, INCLUDING THE SPEEDOMETER AND THE FUEL GAUGE\"  THE LETTER CONTINUES TO STATE THAT \"GENERAL MOTORS IS PROVIDING SPECIAL COVERAGE THAT EXTENDS THE WARRANTY\" IF \"YOUR 2003 CHEVROLET MODEL YEAR CHEVROLET TAHOE WITHIN 7 YEARS OF THE DATE\" OR \"70,000 MILES\".  MY CHEVROLET TAHOE HAS BOTH THESE ISSUES.  THEY STARTED ABOUT TWO WEEKS BEFORE I RECEIVED THE LETTER.  WHAT I DON'T UNDERSTAND AND WOULD LIKE A RESPONSE FROM GENERAL MOTORS IS WHY MY SAFETY IS NOT AN CONCERN TO THEM BECAUSE I HAVE DRIVEN MORE THAN 70,000 MILES IN MY TAHOE?  I TRAVEL THROUGH A LOT OF RURAL AREAS TO WORK AND I FEEL IT IS VERY IMPORTANT TO NOT RUN OUT OF GAS.  I FEEL IT EQUALLY IMPORTANT TO KNOW HOW FAST I AM GOING.  THE SPEEDOMETER REGISTERS THAT I AM GOING 60 OR 70 MILES PER HOUR WHEN I AM SITTING AT A RED LIGHT.  WHEN I AM GOING DOWN THE ROAD IT REGISTERS THAT I AM GOING OVER 120 MILES PER HOUR.  THIS IS ANOTHER SAFETY ISSUE BECAUSE I DON'T KNOW HOW FAST I AM GOING.  NOT TO MENTION THE POTENTIAL FOR SPEEDING TICKETS.  I WOULD LIKE TO THINK THAT GENERAL MOTORS CARES ABOUT THEIR CUSTOMERS SAFETY REGARDLESS OF HOW MANY MILES THEY HAVE DRIVEN.   THESE GAUGES ARE VERY EXPENSIVE TO HAVE REPLACED AND THEY ARE A SAFETY HAZARD.  NOT BEING ABLE TO MONITOR YOUR RATE OF SPEED OR BE AWARE IF YOU HAVE ENOUGH GAS TO GET HOME ARE SAFETY ISSUES TO ME FOR MY HEALTH AS WELL AS MY PEACE OF MIND AND I WOULD LIKE TO KNOW WHY GENERAL MOTORS DOESN'T FEEL RESPONSIBLE FOR CORRECTING THIS DEFAULT THEY ARE AWARE FOR ALL THEIR TAHOE OWNERS. I HAVE A COMPLAINT WITH THE GENERAL MOTORS ANSWER CALL CENTER BUT HAVE NOT RECEIVED A  RESPONSE. *TR",
        "vin": "1GNEC13Z93J"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/05/2007",
        "dateOfIncident": "10/28/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207973,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER OF 2003 CHEVY TAHOE, STOPPED WORKING ON THE FREEWAY.  I HAD NO WAY O MAKING SURE WHAT MY SPEED WAS. I WAS STOPPED BY A POLICE OFFICER AND EXPLAINED MY SITUATION. THE OFFICER LOOKED AT MY SPEEDOMETER THAT WAY SHOWING 60 MPH AT A DEAD STOP. HE GAVE ME A WARNING AND TOLD ME TO GET IT FIXED.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207685,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2003 CHEVY TAHOE AND THE SPEEDOMETER STOPPED WORKING AROUND 50,000 MILES.  CHEVY HAS SENT NO RECALL NOTICE AND I HAVE NO IDEA HOW FAST OR SLOW I AM GOING.  *TR",
        "vin": "1GNEC13Z53J"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/31/2007",
        "dateOfIncident": "10/31/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HAZARD FLASHER RELAY/SWITCH \"SOUNDS OFF\" AFTER THE TURN SIGNAL SWITCH IS RETURNED TO THE REST POSITION AFTER SIGNALING A RIGHT OR LEFT HAND TURN, THIS CLICKING SOUND ALSO HAPPENS WHEN THE STEERING WHEEL IS ADJUSTED AND WHILE I AM DRIVING DOWN THE ROAD ALL BY IT'S SELF. THE HAZARD AND TURN SIGNALS DO NOT LIGHT, ONLY THE AGGRAVATING CLICKING SOUND CAN BE HEARD. I CAN ALSO MAKE THE HAZARD/SIGNAL RELAY/SWITCH CLICK BY WIGGLING THE TURN SIGNAL INDICATOR SWITCH. I HAD THE HAZARD SWITCH REPLACED AT THE DEALER BUT THE PROBLEM PERSISTS. I HAVE THE HAZARD/FLASHER RELAY/SWITCH AVAILABLE FOR INSPECTION.  *TR",
        "vin": "1G1ND52J93M"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/19/2007",
        "dateOfIncident": "08/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200054,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING ROUTINE MAINTENANCE OF MY 2003 CHEVY EXPRESS VAN, I NOTICED THAT BOTH INNER TIE RODS HAVE EXCESSIVE END PLAY IN THEM, LEFT INNER AND RIGHT INNER. I DO NOT BELIEVE THIS IS A NORMAL WEAR PROBLEM AND IS A VERY DANGEROUS CONCERN.  *TR",
        "vin": "1GBFG15T131"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/14/2007",
        "dateOfIncident": "07/23/2007",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199531,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT CALLED REGARDING A 2003 CHEVROLET EXPRESS 1500.  THE CONTACT IS THE PHYSICAL DAMAGE INSPECTOR FOR AN INSURANCE COMPANY.  HE STATED THAT THE VEHICLE WAS PARKED WHEN THE HORN BEGAN TO SOUND.  HE STATED THAT THE HORN IS ALSO USED AS AN INTRUDER ALARM.  SHORTLY AFTER, FLAMES BEGAN TO RISE FROM THE HOOD.  THE VEHICLE WAS TAKEN TO THE DEALER AND THEY STATED THAT IT WAS NOT A WARRANTY RELATED FAILURE.  THE DEALER ALSO STATED THAT THE WIRE THAT RUNS FROM THE HORN RELAY TO THE ACTUAL HORN IN THE STEERING WHEEL COLUMN SUPER HEATED, WHICH CAUSED THE FIRE.  A POLICE REPORT WAS FILED.  THE PURCHASE DATE AND MILEAGES WERE UNKNOWN.  RETURN USPS, MADE 2ND ATTEMPT 08/04/07 FAILED.  *BF",
        "vin": "1GCFG15X631"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/07/2007",
        "dateOfIncident": "08/04/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198731,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHEVROLET EXPRESS.  WHILE PREPARING TO STOP FROM 20 MPH, THE VEHICLE FEELS AS IF IT IS GOING TO STOP, BUT SUDDENLY LUNGES FORWARD.  AFTERWARDS, THE VEHICLE WILL STOP.  THE DEALER STATED THAT HIS VEHICLE IS NOT INCLUDED IN THE RECALL FOR THIS FAILURE.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 42,000.",
        "vin": "1GCFH25T831"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/31/2007",
        "dateOfIncident": "07/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197912,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FIANCE AND I BOUGHT A 2003 CHEVY IMPALA IN  NOV OF 2006 WITH ONLY 40,000 MILES. IN JULY OF 2007, THE CAR WAS STARTED AND SHUT OFF BY ITSELF A FEW MINUTES LATER. IT WOULD THEN NOT START. WE FIRST HAD IT TOWED TO A LOCAL SHOP THAT INFORMED US THAT THE UPPER INTAKE MANIFOLD HAD CRACKED. IT LEAKED ANTIFREEZE INTO THE CYLINDERS, THE SPARK PLUGS AND OTHER PARTS OF THE ENGINE AND THE COST FOR REPAIR WOULD BE 1400.00. WE HAD THE CAR TOWED TO A 2ND SHOP FOR A 2ND OPINION. THEY TOLD US THAT THE ANTIFREEZE THAT LEAKED HAD TOTALLY LOCKED UP THE ENGINE AND WE NEEDED A WHOLE NEW ONE. THAT WAS GOING TO COST US AT LEAST 2,000 FOR A USED ONE. WE THAN DECIDED THAT A 4 YEAR OLD CAR WITH 60K MILES ON IT SHOULD NOT BE IN NEED OF A NEW ENGINE SO WE AGAIN HAD IT TOWED TO A CHEVROLET DEALER REPAIR SHOP. THEY TOLD US THE SAME THING. THE CAR WAS OFFICIALLY IN NEED OF A WHOLE NEW ENGINE. WE CONTACTED CHEVROLET'S CUSTOMER CARE DEPT AND THEY ARE SO FAR UNWILLING TO HELP. WE'VE ONLY HAD THE CAR 8-9 MONTHS AND ARE CONTINUING TO MAKE PAYMENTS ON THE LOAN. PER THE DEALER, THE USED ENGINE WILL COST US 3000.00 AND A NEW ONE WILL COST IS 5050.00. *JB",
        "vin": "2G1WH55KX39"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/28/2007",
        "dateOfIncident": "06/18/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197733,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DOING 60 MPH THE SPEEDOMETER NEEDLE READS OVER A 100 MPH.  YOU HAVE TO STOP AND START THE ENGINE SEVERAL TIMES TO GET IT RESET TO 0 MPH.  I SPENT 2 WEEKS RESEARCHING THIS AND IT IS A VERY COMMON PROBLEM WITH 2003 CHEVY TAHOE.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/18/2007",
        "dateOfIncident": "06/16/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY COMPLAINT IS ABOUT  CHEVROLET, CAVALIER 2003.  THE  CAR JUST QUIT WHILE DRIVING, THANK GOD I WAS ONLY ONE ON ROAD. THE  CAR ONLY HAD 57,000 MILES ON IT, AND I HAVE BEEN KEEPING UP WITH MAINTENANCE SCHEDULE; SUCH AS OIL CHANGES, TRANSMISSION FLUIDS, FILTERS, ETC. AFTER BEING TOWED TO THE CHEVROLET DEALERSHIP AND WAITING TO SEE WHAT THE PROBLEM WAS  IT  WAS DETERMINED TO  BE A BAD FUEL PUMP. THIS COASTED ME $721.29, WHICH WAS VERY UNEXPECTED. WHAT AMAZED ME EVEN MORE WAS MANY MORE HAD SAME PROBLEM ONCE I SEARCHED IT ONLINE. TAKE A LOOK AT THIS WEBSITE. TP://WWW.TOPIX.NET/FORUM/AUTOS/CHEVROLET-CAVALIER/TVINIC5TFU5SFSI5H  I FOLLOWED ANOTHER FORUM POSTERS RESPONSE AND CAME HERE TO LET MY EXPERIENCE BE HEARD.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/17/2007",
        "dateOfIncident": "03/17/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193530,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE THE CAR HOME FROM A FRIEND'S HOUSE ABOUT 3 MILES TURNED IT OFF AND LOCKED IT USING THE REMOTE.  WHEN I TRIED STARTING THE CAR ABOUT AN HOUR LATER , AFTER UNLOCKING IT USING THE REMOTE), THE CAR WOULD NOT START. IT SOUNDED LIKE IT WANTED TO START BUT JUST COULDN'T TURN OVER. LUCKILY, I HAVE A MECHANIC IN THE FAMILY THAT SUGGESTED A PROBLEM WITH  THE  ANTI-THEFT SYSTEM.  THE PROBLEM WAS SOLVED BY TURNING THE KEY TO THE ON POSITION FOR ABOUT 10 MINUTES TO RESET THE SYSTEM.  AS A RESULT I ENDED UP MISSING A VERY IMPORTANT MEETING. EVERY NOW AND THEN THE THEFT SYSTEM LIGHT ON DASHBOARD POPPED ON AND THEN EVENTUALLY  WENT  AWAY.   I DIDN'T ALWAYS HAVE 10 EXTRA MINUTES TO SPARE JUST IN CASE THE  CAR DECIDED  TO DO THIS.  *AK",
        "vin": "1G1ND52J93M"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "05/23/2007",
        "dateOfIncident": "05/22/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191588,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHEVROLET CAVALIER LS SPORT BROKE DOWN ON THE HIGHWAY NEEDING A FUEL PUMP AT 67000 MILES. A VERY EXPENSIVE JOB TO BE DONE SO EARLY IN THE CAR'S LIFE.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/17/2007",
        "dateOfIncident": "03/16/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190998,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ON A TWO LANE MOUNTAIN ROAD BETWEEN OAKHURST, CALIFORNIA AND YOSEMITE I OBSERVED A FRONT END VIBRATION COMING THROUGH THE STEERING WHEEL.  I PULLED OVER AND COULD FIND NOTHING WRONG SO I MADE A U-TURN AND WENT TO OAKHURST TO EFFECT A REPAIR.  I BARELY MADE IT TO TOWN TO A SHOP WHEN THE LEFT FRONT BEARING ASSEMBLY FAILED ,REQUIRING THE ENTIRE UNIT TO BE REPLACED.  THE SHOP WAS SURPRISED THAT THE WHEEL HAD NOT COME OFF.  THE COST WAS $520 ,AND NECESSITATED AN OVERNIGHT STAY DUE TO THE PART HAVING TO BE BROUGHT IN FROM FRESNO.  I HAD PURCHASED THE VEHICLE NEW, BUT IT WAS THREE WEEKS OUT OF WARRANTY.  THE MILEAGE WAS 25,000.  I TOOK THE PART TO MY LOCAL CHEVROLET  DEALER, THEY INFORMED ME IN WRITING THAT THE BEARING HAD INADEQUATE LUBRICATION AT THE FACTORY.  THE OTHER BEARING WAS PULLED,  AND IT WAS OKAY.  GM HAS TOTALLY DUCKED ANY FORM OF REIMBURSEMENT.  I AM JUST THANKFUL THAT WE DID NOT HAVE A ACCIDENT ON THAT MOUNTAIN ROAD *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/13/2007",
        "dateOfIncident": "04/01/2007",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187752,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHEVROLET EXPRESS 2500 VAN.  WHILE THE VEHICLE WAS PARKED IT CAUGHT ON FIRE AND BOTH AIR BAGS DEPLOYED.  THE CONTACT STATED THAT THE CAUSE OF FIRE  WAS THE SAME AS  MENTIONED IN RECALL # 05V104000 ELECTRICAL  SYSTEM: WIRING:INTERIOR/UNDER THE DASH BOARD).  THE FIRE DEPARTMENT EXTINGUISHED THE FIRE, AND THE VEHICLE WAS TOWED TO THE DEALER.  THE CURRENT AND FAILURE MILEAGES WERE 74,000.*AK",
        "vin": "1GCGG25U231"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/23/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179491,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT STATED THAT THE BRAKES ON THE 2003 CHEVROLET EXPRESS  WERE  DEFECTIVE DUE TO A PROGRAM ERROR IN THE ABS COMPUTER SYSTEM PER GENERAL MOTORS.  THERE WAS NOT FAILURE TO DATE, BUT THE CONTACT WAS CONCERNED.  GENERAL MOTORS HAS THREE (3) SERVICE BULLETINS TO DATE CONCERNING THESE BRAKES.  03-05-25-003, 02-05-25-005, 05-05-25-002.  *AK  UPDATED 2/22/2007 - THE BRAKES FAILED.  GM REPROGRAMMED THE COMPUTER THROUGH THE DEALER.  *NM*  UPDATED 02/22/07. *JB",
        "vin": "1GCGG25V331"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/23/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179492,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT STATED THAT THE BRAKES ON THE 2003 CHEVROLET EXPRESS  WERE DEFECTIVE DUE TO A PROGRAM ERROR IN THE ABS COMPUTER SYSTEM PER GENERAL MOTORS.  THEREWAS  NOT FAILURE TO DATE, BUT THE CONTACTWAS CONCERNED.  GENERAL MOTORS HAS THREE (3) SERVICE BULLETINS TO DATE CONCERNING THESE BRAKES.  03-05-25-003, 02-05-25-005, 05-05-25-002.*AK",
        "vin": "1GCGG25V331"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/23/2007",
        "dateOfIncident": "01/05/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10179497,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURE ON 2003 CHEVY EXPRESS 2500 CARGO VAN. GM KNOWS ABOUT THIS PROBLEM, SEE  GENERAL MOTORS TSB #'S..03-05-25-003 & 02-05-25-005 & 05-05-25-002. THIS SHOULD BE FIXED VIA A \"SAFETY RECALL \" SINCE THE ONLY WAY TO FIX THE VEHICLE IS TO HAVE THE ABS COMPUTER REPROGRAMMED AT A CHEVY OR GMC DEALER. THIS IS AN OBVIOUS MANUFACTURING ERROR AS NOTED BY THE TSB'S, & SHOULD BE REPAIRED FREE OF CHARGE. NO AMOUNT OF NORMAL SERVICING COULD PREVENT THIS FROM OCCURRING. I'VE CALLED GM RE. THIS & THEY SAY IT'S NOT A SAFETY ISSUE?????? LOSS OF BRAKES IS NOT A SAFETY ISSUE ???  THE DEALER CHARGED ME $90. TO CORRECT THEIR PROGRAMMING ERROR.  *JB",
        "vin": "1GCGG25V331"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/06/2006",
        "dateOfIncident": "08/29/2006",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRE TO VEHICLE . *JB",
        "vin": "1GCHG39U031"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/21/2006",
        "dateOfIncident": "05/01/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163111,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "WILDERNESS AT I",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "MY WIFE WAS DRIVING ALONG INTERSTATE 40 AND ONE OF THE TIRES BLEW OUT.  SHE WASN'T INJURED, NOR WAS THERE ANY DAMAGE TO THE VEHICLE.  WE TOOK THE VEHICLE INTO A LOCAL TIRE SHOP AND THEY STATED THAT THE TIRE WASN'T PUNCTURED, THAT THE TREAD WALL COLLAPSED AND THEY RECOMMENED NEW TIRES.  THE ORIGINAL TIRES WERE FIRESTONE WILDERNESS WITH 44,000 MILES ON A 2003 CHEVY TAHOE.  THE VEHICLE AND TIRES WERE LESS THAN 3 YEARS OLD.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/05/2006",
        "dateOfIncident": "06/27/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161433,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTED TO HEAR A CLUNKING NOISE. THEN VEHICLE WOULD NOT BACK UP.  CHECKED TRANSMISSION FLUID AND FOUND LOW. ADDED FLUID (1 QUART) AND WAS ABLE TO MOVE, BUT SINCE THEN THE VEHICLE WILL NOT STAY IN PARK. IT CREEPS AHEAD OR BACK ON UNEVEN GROUND SEVERAL FEET.  CALLED TO MAKE AN APPOINTMENT AND DROPPED VEHICLE OFF TO DEALER WHOM I BOUGHT IT. THEY HAD IT FOR A DAY AND CALLED TO HAVE ME PICK IT UP. THEY HAD A BILL FOR ME AND TOLD ME NOTHING WAS WRONG WITH THE VEHICLE. I TOLD THEM THERE WAS SOMETHING WRONG AND THE MANAGER BROUGHT THE MECHANIC OUT AND HE CONFIRMED THAT THERE WAS NOTHING WRONG. I TOLD THEM THAT THE VEHICLE ROLLS IN PARK. MECHANIC SAID NO WAY AND I SAID I'LL SHOW YOU. SO I TOOK THEM FOR A RIDE OUT BACK OF THE SHOP TO A SLIGHT HILL AND PARKED ON SAID HILL, IN PARK, SHUT THE ENGINE OFF AND THE VEHICLE ROLLED SLOWLY DOWN THE HILL. MECHANIC SAID HE NEVER SAW ANYTHING LIKE THAT.  THEY ARE FIXING THE VEHICLE AND I ASKED FOR A DETAILED LIST OF WHAT WAS WRONG AND THE FAXED ME A QUOTE WITH PRICE ONLY.  *NM",
        "vin": "1GCFH25T231"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/10/2006",
        "dateOfIncident": "06/10/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159521,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS REGARDING RECALL NUMBER 05113 (SAFETY BELTS) FOR WHICH WE RECEIVED A RECALL NOTICE FOR OUR CHEVY EXPRESS VAN WHICH IS THE FOUNDATION OF OUR FOREST RIVER 22' MOTORHOME.  I ASSUME THIS AFFECTS THE SEAT BELTS IN THE CAB ONLY.  OUR PROBLEM IS THAT WE HAVE BEEN UNABLE TO FIND A DEALER WHO WILL REPAIR THIS MANUFACTURER DEFECT EVEN THOUGH THE LETTER WE RECEIVED STATES WE CAN TAKE IT TO ANY GM DEALER.  WE ARE TWO WEEKS AWAY FROM LEAVING ON AN EXTENSIVE ROAD TRIP WITH THIS VEHICLE AND WOULD LIKE TO KNOW THAT IT IS SAFE AND WE BELIEVE IT IS UP TO THE MANUFACTURER TO CORRECT THEIR SAFETY DEFECT ASAP.  *NM",
        "vin": "1GBJG31U731"
    },
    {
        "components": "STEERING,POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2006",
        "dateOfIncident": "03/06/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153267,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RACK AND PINION UNIT HAS LOTS OF PLAY IN THE CENTER. (APPROX 50K)  THE TRANSMISSION SLIPS IN REVERSE FROM DAY ONE.  THE GAS PEDAL SHIFT FROM LEFT TO RIGHT ABOUT 3 INCHES. (APPROX 40K)  THIS VAN HAS ABOUT 50 REPAIRS UNDER WARRANTY.  THIS VAN IS USED BY MY WIFE AND 4 KIDS.  *NM",
        "vin": "1GNFH15TX31"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/16/2006",
        "dateOfIncident": "08/25/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152905,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAIL LIGHTS LIGHT BULBS HAVE TO BE CHANGE EVRY WEEK OR EVERY OTHER WEEK.  *NM",
        "vin": "1GCFG29XX31"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/02/2006",
        "dateOfIncident": "04/18/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151660,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HOSE THAT CONNECTS TO THE ENGINE TO THE RADIATOR HAS CRACKED AT LEAST THREE TIMES IN THE PAST TWO AND HALF YEARS, I HAVE ASK CHEVY ON EACH OCCASION THAT I HAD TO PURCHASE IT FROM THE DEALERSHIP, IF THERE IS A PROBLEM WITH HOW THE HOSE IS POSITION SO CLOSE TO THE EXHAUST PIPE WITH NO SUPPORT TO KEEP THE HOSE AWAY FROM THIS PIPE THAT GIVES OFF SO MUCH HEAT, I TRULY BELIEVE THIS IS CREATING THE PROBLEM  AND I'M TIRED OF REPLACING IT AND WOULD LIKE TO GET TO THE BOTTOM OF THIS. *JB",
        "vin": "1GCFG15XX31"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/15/2006",
        "dateOfIncident": "02/11/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150331,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 CHEVROLET 2500  EXPRESS VAN (PURCHASED NEW AND WELL MAINTAINED) THAT I USE FOR FIRE INVESTIGATIONS.  ON THE DATE OF THE INCIDENT, THE ODOMETER READING WAS 50628 MILES.  ON MY RETURN TRAVEL, I WAS ON I-75 NORTH BOUND THROUGH DAYTON, OHIO (SPEEDS EST @ 65-70 MPH) WHEN THE VIBRATION THROUGH THE STEERING WHEEL INCREASED.  APPROXIMATELY SEVEN MILES SOUTH OF PIQUA, OHIO, I EXPERIENCED A CATASTROPHIC FAILURE OF THE LEFT FRONT WHEEL (DIDN'T KNOW  WHAT TYPE OF FAILURE AT THIS TIME) WHICH CAUSED THE VEHICLE TO SUDDENLY \"JERK\" TO THE LEFT. TRAVELING IN THE CENTER NORTH BOUND LANE OF I-75 AND IN HEAVY TRAFFIC, I USED BOTH HANDS TO STEERING MY VAN TO THE RIGHT HAND LANE NARROWING MISSING A SEMI TRACTOR-TRAILER. I CONTINUED ONTO THE BERM WITH THE END OF THE  VAN SLIDING SIDEWAYS TO THE RIGHT.  AS THE VAN SLOWED AND NOW ALMOST PERPENDICULAR TO TRAFFIC,  THE LEFT SIDE OF THE VAN BEGAN TO LIFT WITH BOTH LEFT SIDE WHEELS OFF THE GROUND.  LUCKILY, THE VAN CAME TO A STOP AND THE LEFT SIDE DROPPED TO THE GROUND.  TRAFFIC ON I-75 WAS IN CHAOS TRYING TO AVOID MY VAN DURING THE WHOLE EPISODE.  I BELIEVE THE LONG WHEEL BASE OF THE VAN CONTRIBUTE TO PREVENTING THE VAN FROM ROLLING.  AAA TOWED THE  MY VAN TOWED TO DEFIANCE (OHIO) CHEVROLET DEALER IN PREPARATION FOR REPAIRS   BECKMAN CHEVROLET DEALER SERVICE DEPARTMENT INSPECTED THE VAN ON THE NEXT DAY AN FOUND COMPLETE FAILURE OF THE LEFT FRONT WHEEL BEARING WITH ONLY THE FRONT BRAKE SYSTEM KEEPING THE WHEEL ON THE SPINDLE.    THE VEHICLE WAS REPAIRED WITH THE INSTALLATION OF A NEW WHEEL AND BEARING ASSEMBLY(SOLD AS ONE UNIT).      I HAD TO PAY $300 AS A \"WARRANTY DEDUCTIBLE\" WITH THE DEFECTIVE PARTS RETURNED TO THE MANUFACTURER GM .   IN MY OPINION THIS WHEEL AND BEARING ASSEMBLY SHOULD NOT HAVE FAILED WITH ONLY 50,000 MILES AND IT APPEARS THERE WAS A MATERIAL OR INSTALLATION FAILURE IN SOME MANNER.   AAA IS OUT ABOUT $300 FOR THE TOW BILL. I REMAIN, BOB MARIHUGH, DEFIANCE, OHIO. *JB",
        "vin": "1GCGG25V431"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/13/2005",
        "dateOfIncident": "12/13/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145146,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A  PRE-OWNED 2003 CAVALIER LS EARLIER THIS YEAR. ON A REGULAR BASIS, THE DRIVERS SEAT BELT SLIPS OUT OF THE LOOP ON THE TOP OF THE SEAT THAT IS SUPPOSED TO HOLD IT, WHILE I AM BUCKLING UP, AND SMACKS ME IN THE NECK. SOMETIMES I DRIVE WITH IT THIS WAY, BUT WAS SINCE TOLD BY MY MECHANIC THAT I SHOULDN'T BECAUSE THE SEAT BELT IS NOT DOING ITS JOB EFFECTIVELY THAT WAY. THE LATEST TIME BEING TODAY, BUT THIS HAS HAPPENED EVER SINCE I PURCHASED THE VEHICLE. THE NUMBER OF FAILURES I HAVE BELOW IS 15, BUT THIS IS JUST AN ESTIMATE.  *JB",
        "vin": "1G1JH12F737"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/10/2005",
        "dateOfIncident": "12/08/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144891,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE SEAT BELT RECEIVER MALFUNCTION - WHILE INSERTING  BELT LOCKING TAB, RED RELEASE BUTTON POPPED OUT - TRIED TO REINSERT BUTTON, MECHANISM JAMMED TRAPPING ME IN SEAT; UNTIL I COULD THREAD MYSELF OUT OF BELTS. PART ORDERED. *JB",
        "vin": "1GCHG39U131"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/24/2005",
        "dateOfIncident": "10/23/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143617,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I DRIVE A 2003 CHEVROLET EXPRESS VAN.  I BELIEVE THERE IS AN ISSUE WITH THE WINDSHIELD WIPERS.  MANY TIMES, WHEN TRAVELING AT SPEEDS ABOVE 50 THE WIPERS DO VERY LITTLE TO KEEP THE WINDSHIELD CLEAR.  EVEN AFTER INSTALLING NEW BLADES.  THIS HAPPENS DURING ALL TYPES OF INCLEMENT WEATHER, BUT IS ESPECIALLY BAD IN THE WINTER. THE WIPER BLADES ALLOW ICE TO COLLECT ON THEM, AND THE DEFROSTER IS NOT ENOUGH TO KEEP THEM CLEAR. I MUST STOP AND MANUALLY CLEAR THE WIPERS  IF I MUST USE THE WIPERS, THEY JUST SCRAPE ACROSS THE WINDSHIELD BUT DO VERY LITTLE TO ACTUALLY CLEAR THE WINDSHIELD.  IF TRAFFIC PASSING BY, THROWS SLUSH AND SUCH ON THE WINDSHIELD. THE WIPERS CAN NOT CLEAR IT PROPERLY.  IN ADDITION TO THIS, THE WINDSHIELD WASHER SPRAY HOSES ARE ATTACHED TO THE WIPER ARMS AND TEND TO PLUG OR FREEZE AND COMPOUNDS THE PROBLEM.  I HAVE DRIVEN THIS VEHICLE FOR 3 YEARS AND ITS THE SAME THING EVERY YEAR.  IT PRESENTS QUITE A PROBLEM SINCE MANY TIMES, I AM OPERATING THE VEHICLE AT HIGHWAY SPEEDS, WITH LIMITED VISION.  UNTIL I STOP AND CLEAR IT OFF.  I DON'T KNOW IF ITS BECAUSE THE WIPERS LIFT OFF THE WINDSHIELD AT HIGH SPEEDS OR IF THE JUST SHRINK DUE TO THE COLD.  I DO KNOW THAT IT HAS BECOME A SAFETY ISSUE. *JB",
        "vin": "1GCHG35U931"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/16/2005",
        "dateOfIncident": "10/11/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10142926,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED  WHILE DRIVING THE VEHICLE STALLED INTERMITTENTLY. ALSO, IT STALLED  WHEN SLOWING DOWN OR WHEN STOPPING. THE VEHICLE WAS TAKEN TO THE DEALERSHIP, AND  THE FUEL INJECTOR PUMP WAS REPLACED.  THIS REPAIRED THE VEHICLE.*AK  UPDATED 11/7/2005 - *NM",
        "vin": "1GBJG31F821"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "09/05/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135447,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONSUMER STATED THAT WHILE DRIVING  AT 50-60 MPH  2003 CHEVROLET EXPRESS  STALLED. THE VEHICLE SAT FOR ABOUT A MINUTE, THEN IT  RESTARTED. THERE WERE NO LIGHTS THAT CAME ON  THE DASHBOARD. THIS HAPPENED WITH NO WARNING. THE DEALERSHIP HAS NOT BEEN CONTACTED AS OF NOW. THE MANUFACTURER HAS NOT BEEN CALLED.  THE  CONSUMER WAS GOING TO CONTACT THE DEALER SO THEY COULD EXAMINE THE VAN.*AK  THE VEHICLE WAS TAKEN TO THE DEALER BUT THEY FOUND NOTHING WRONG WITH THE VEHICLE.  *NM",
        "vin": "1GBHG31U831"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/11/2005",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136128,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE TIME I PURCHASED MY CHEVROLET IMPALA I HAVE HAD TROUBLE WITH THE STEERING COLUMN. I HAVE BROUGHT THE VEHICLE INTO THE SHOP NUMEROUS TIMES. 12 TO BE EXACT.  THE FIRST 6 TIMES WAS WITHIN THE FIRST 7 MONTHS. I ASKED ABOUT THE LEMON LAW AND WAS TOLD THAT IT DIDN'T QUALIFY UNLESS THE EXACT PART WENT BAD 3 TIMES.  TWO FULL NEW STEERING COLUMNS HAVE BEEN PUT IN PLUS ALL OTHER INDIVIDUAL PARTS HAVING BEEN FOUND INADEQUATE WERE REPLACED.  THE STEERING ALSO CONTINUOUSLY SQUEALED AND CLUNKED WHEN TURNING.  AFTER ALL THE REPAIRS IT IS STILL DOING IT. THEN AFTER NUMEROUS OTHER VISITS WHEN I TRIED AGAIN TO EXPLORE THE POSSIBILITY OF THE LEMON LAW I WAS TOLD IT WAS THREE WEEKS TO LATE.  THEY PUT ME OFF AND STALLED UNTIL IT WAS TOO LATE TO DO ANYTHING ABOUT THE LEMON THE TIME OR KNOWLEDGE TO INVESTIGATE. I HAVE BEEN LEFT NO RECOURSE AND I HAVE A CAR THAT STILL ISN'T FUNCTIONING PROPERLY AND THAT I AM AFRAID TO TAKE OUT ON THE HIGHWAYS OR INTERSTATE. I AM A WIDOWED SENIOR OF 74  I FEEL HAVE BEEN GREATLY TAKEN ADVANTAGE OF.   MONTHS AGO THEY OFFERED ME AND EXTENDED 75,000 MILE WARRANTY. I HAVE YET TO RECEIVE IT. THEN  I CALLED GM CONSUMER SERVICE. I SPOKE TO JEAN WHYRE AND SHE WAS OF NO HELP AT ALL. SHE DENIED ME BOTH THE EXCHANGE OF VEHICLES AND THE WARRANTY ON THE COLUMN.  SHE THEN SAID THAT SHE WAS WITHDRAWING IT CAUSE I REFUSED IT BEFORE THINKING THAT I WAS GOING TO GET A NEW CAR UNDER THE LEMON LAW. WHEN I TRIED TO EXPLAIN THAT TO HER SHE MALICIOUSLY RECANTED THE OFFER AND SAID I WOULD NOT GET IT THEN HUNG UP ON ME. I INQUIRED WITH THE FL. BAR ASSOCIATION BUT NO LAWYER WITH IN THE STATE WILL COVER THIS TYPE OF CASE. I HAVE NO IDEA WHERE TO GO TO FOR HELP WITH THIS PROBLEM SO I AM NOW CONTEMPLATING CONTACTING THE LOCAL TELEVISION STATION. THEY HAVE A DEPARTMENT WHICH TAKES CARE OF CONSUMER COMPLAINTS AND ABUSE.  I FEEL THAT THIS IS A CASE OF GROSS SENIOR ABUSE.  I WOULD TO MAKE CLEAR THAT I DID ENQUIRE ABOUT THE LEMON TWICE. *NM",
        "vin": "2G1WF52E339"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/31/2005",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134945,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT  OWNS 2003 CHEVROLET EXPRESS G3500 PASSENGER VAN. THE VAN WILL ACCELERATE ON ITS OWN SPORADICALLY.  THIS STARTED AROUND 7-20-05. IT DOES IT WHILE STOPPING AT STOP LIGHT AND IT WILL ALSO DO IT WHILE  DRIVING ON THE HIGHWAY. THE IDLE SPEED CONTROL MOTOR, THROTTLE POSITION SENSOR, COOLING SENSOR, ECM, AND THE PROM HAVE ALL BEEN CHANGED WITHIN 5-6 WEEKS. HE SAYS IT DID  IT AT ANY SPEED SPORADICALLY. HE MADE AN APPOINTMENT  TO BRING THE CAR IN AGAIN FOR A POSSIBLE REPAIR. THE CHECK ENGINE LIGHT WILL USUALLY COME ON AFTER AN INCIDENT. *AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/18/2005",
        "dateOfIncident": "08/17/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133393,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY TRANSMISSION IS GOING OUT OF MY TAHOE IT IS A 2003 MODEL AND HAS LESS THAN 40,000 MILES ON IT.   *NM",
        "vin": "1GNEK13Z03J"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/04/2005",
        "dateOfIncident": "06/04/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131623,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  CONSUMER WAS DRIVING AT 50 MPH AND THE BRAKES STARTED VIBRATING.  THE PROBLEM FIRST STARTED AROUND 6-4-05, AND HAS GRADUALLY GOTTEN WORSE.  THE CONSUMER TOOK VEHICLE IT TO THE DEALERSHIP TWICE.  THERE WAS NOTHING DONE TO FIX THE VEHICLE BECAUSE IT WAS NOT COVERED UNDER THE WARRANTY.  THE CONSUMER CONTACTED THE MANUFACTURER, THEY HAD HIM TO MAKE A SECOND APPOINTMENT WITH THE DEALERSHIP.  WHEN THE CONSUMER TOOK IT TO DEALER, THEY TOOK THE TIRES OFF, AND INSPECTED THE BRAKE PADS AND ROTORS.  THEY TOLD CONSUMER THAT THE METAL HAD DELAMINATED OFF THE ROTORS.  THE BRAKE PADS WERE OKAY.  THEY REPORTED IT TO THE MANUFACTURER, WHO SAID IT WAS NOT COVERED UNDER WARRANTY.  THE CONSUMER FELT IT WAS A MANUFACTURING DEFECT.  CONSUMER KNEW SOMEONE ELSE WITH THE SAME PROBLEM BUT, WITH A TRUCK.  THERE WAS A RECALL ON THE TRUCK.  THERE WERE NO OTHER KNOWN PROBLEMS WITH THE VEHICLE AT THIS TIME.  *AK",
        "vin": "1GCFH25T931"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/28/2005",
        "dateOfIncident": "05/24/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10122300,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE 2003 CHEVY EXPRESS VAN (BOX VAN), THE PASSENGER SIDE AIR BAG BLEW UP WITHOUT THE VEHICLE BEING IN MOTION.  IT BLEW UP ON THE CONSUMER'S DAUGHTER WHO IS 5 YEARS OLD.   *TT   THE PROBLEM OCCURRED WHEN THE CONSUMER'S DAUGHTER CLOSED THE DOOR. THE CONSUMERS DAUGHTER RECEIVED NUMEROUS BURNS AND LACERATIONS ON HER ARMS AND CHEST.   *SC  *JB",
        "vin": "1GCFG15X731"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/08/2005",
        "dateOfIncident": "02/15/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124627,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LEFT FRONT WHEEL BEARING HUB ASSEMBLY SEPARATED CAUSING THUMPING AND GRINDING NOISE.  IMMEDIATELY DROVE TO DEALER FOR REPAIRS.  UPON INSPECTION, IT WAS FOUND THAT THE RIGHT FRONT HUB ASSEMBLY HAD BEGIUN TO SEPARATE AS WELL.  BOTH FRONT HUB ASSEMBLIES REPLACED UNDER EXTENDED WARRANTY.",
        "vin": "1GAGG25U131"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121004,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 07/03 PROBLEM BEGAN. CONTACT STATES MOSTLY DURNING TURNING, AT LOW SPEEDS, THE ELECTRIC STABILITY CONTROL MALFUNCTIONS AND RIGHT FRONT PASSENGER WHEEL LOCKS AND VEHICLE AND PULLS STEERING WHEEL TO THE RIGHT AND TURNS THE VEHCILE IN THE DIRECTION OF THE WHEEL LOCK UP. EVERY TIME THE MESSAGE \"SERVICE STABILLITY\" AND \"STABILITY SYSTEM ACTIVE\" POPS UP. IN ACCORDANCE WITH VEHCILE MANUAL, VEHICLE TAKEN TO DEALERSHIP.COMPUTER AT THE DEALERSHIP READS THAT VEHICLE IS EXPERIENCING A SKID. THE DEALERSHIP HAS REPLACED THE SENSORS, WIRING, AND ALL REMEDIES PER GM. PROBLEM IS STILL THERE. CONTACT IS IN TOUCH WITH GM. GM HAS SPOKEN WITH DEALER AND VISITED VEHICLE, HOWEVER NO RESPONSE TO THE OWNER.",
        "vin": "1GNEK13Z33R"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "05/09/2005",
        "dateOfIncident": "04/25/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120247,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKE ROTOR BRAKING SURFACE AREA HAS FALLEN OFF.  I REPLACED ROTORS WITH SAME CASTING NUMBER.  PARTS HAVE BEEN DISCARDED.  VEHICLE WAS UNABLE TO STOP TO MANUFACTURES DESIGN FLAW.  (SUPPLIER PROBLEM)  VEHICLE HAS ONLY 24,700 MILES ON IT.  DEALERSHIP WONT WARRANTY THIS TYPE OF PROBLEM- THIS IS A NORMAL MAINTENANCE ISSUE.",
        "vin": "1GNFH15T431"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2005",
        "dateOfIncident": "04/20/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASE A USED 2003 CHEV CAVALIER ON APRIL 20, 2005 AND THE ODOMETER DOESN'T LIGHT UP PROPERLY I AM UNABLE TO SEE THE MILAGE ON THIS VEHCILE",
        "vin": "1G1JC52F437"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/28/2005",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10118624,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT MEMORY DOES NOT WORK.  WHEN YOU GET IN AND PUT YOUR KEY IN OR PRESS THE BUTTON IT MOVES THE SEAT TO EXTREME POSITIONS.  WE HAVE TAKEN IT TO DEALER AT LEAST 5 TIMES, AND THEY FINALLY TOLD US THAT WE NEED TO JUST TURN THAT (PAID FOR) OPTION OFF THERE IS NO FIX FOR IT.*AK",
        "vin": "1GNEK13Z63J"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/31/2005",
        "dateOfIncident": "01/31/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108300,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT WHEELS OFF THE GROUND, STEERING WHEEL CENTERED, HELD FIRMLY IN PLACE, THERE IS NO PLAY, LOOSENESS IN STEERING SYSTEM. WHEELS TURNED 10-15', EITHER DIRECTION THERE IS APPROXMATELY 1\" OF PLAY BETWEEN WHEELS AND STEERING WHEEL. CONDITION IS THE SAME BY MOVEING EITHER FRONT WHEELS. BOTH WHEELS REACT TO EACH OTHER BUT NOT TO THE STEERING WHEEL. THERE SEEMS TO BE A DESIGN DEFECIENTLY IN STEERING LINKAGE OR TURBO-BOOST PUMP.ANOTHER 2003 2500CHEV VAN, 28000 MILES HAS THE SAME PROBLEM, MINE HAS 13,338 MILES 2003.*AK",
        "vin": "1GAGG25U631"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/04/2004",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10102157,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE TIRE & RUBBER CO.",
                "productMake": "FIRESTONE",
                "productModel": "FR680",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FIRESTONE TIRES FR680, 215/70R15. REPLACED THE TIRES ON THE FRONT OF MY VEHICLE AT 25,000 MILES DUE TO SEVERE FLAT SPOTTING & STEEL CHORDS SHOWING. THE REAR TIRES ARE PERFECT. CHEVY DEALER AND TIRE STORE BOTH CONFIRMED NO ALIGNMENT ISSUES ARE PRESENT. THE TIRES ARE REALLY DEFFECTIVE. I HAD THE REAR TIRES MOVED TO THE FRONT AND BOUGHT NEW TIRES FOR THE REAR.  THE SAME WEARING OCCURRED, SO BOUGHT A NEW SET OF FOUR.  THERE HAS NOT BE ANY PROBLEM SINCE.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "11/17/2004",
        "dateOfIncident": "11/13/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100109,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MAIN LINE PARTY RENTALS HAS PURCHASED 2 OF THE 2003 CHEVROLET EXPRESS VANS.  THIS HAS BEEN ABOUT 12 TO 18 MONTHS AGO. BOTH OF THESE VEHICLES HAVE NEEDED THE FUEL TANKS REMOVED TO REPLACE A COMPONENT TO CORRECT NON FUNCTIONING FUEL GAGUES.*AK",
        "vin": "1GCFG29T431"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/28/2004",
        "dateOfIncident": "10/15/2004",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRE IN THE LEFT DASH OF A 2003 CHEVROLET EXPRESS VAN G3.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/13/2004",
        "dateOfIncident": "09/13/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091980,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH FRONT BRAKE HOSES ERUPTED ON TWO SEPARATED OCCASIONS WHILE DRIVING. DEALER WAS NOTIFIED.*AK",
        "vin": "1GCGG25VX31"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SEATS",
        "crash": false,
        "dateComplaintFiled": "04/19/2004",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066470,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED VEHICLE AND NOTICED BRAKE PEDAL ARM AND FORWARD RIGHT SEAT BOLT ON DRIVER SEAR WERE BOTH RUSTED. DEALER STATED THEY WOULD LOOK AT IT BUT DID NOT REPORT TO WHY A NEW VEHICLE WOULD HAVE RUST ON INTERIOR COMPONENTS. TWB.  *AK",
        "vin": "1GCFG25T531"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2004",
        "dateOfIncident": "03/19/2004",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062712,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PANIC ALARM WENT OFF AND COULDN'T BE TURNED OFF INITIALLY.  DEALER ADVISED TO BRING VEHICLE IN. ALARM WENT OFF WHEN VEHICLE STARTED FOR SECOND TIME.  VEHICLE DRIVEN ABOUT 3 MILES, ENGINE SHUT DOWN WHILE DRIVING.  PULLED OVER, SMOKE POURED FROM UNDER HOOD, THEN FLAMES UNTIL VEHICLE ENGULFED IN FLAMES.  VEHICLE TOTALLY DESTROYED BY FIRE.  *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2004",
        "dateOfIncident": "06/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10062568,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE MUFFLER ON MY 2003 CHEVROLET SILVERADO NEEDS ITS SECOND MUFFLER IN AS MANY YEARS.  IT APPEARS THE BAFFLE IS BECOMING LOOSE DUE TO INSUFFICIENT WELDS WITHIN THE MUFFLER.  THIS IS CAUSING A VIBRATION A VARIOUS RPM/SPEEDS.*AK",
        "vin": "2GCEC19X631"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/21/2004",
        "dateOfIncident": null,
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055464,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER SMELLED A BURNING ODOR.  WITHIN SECONDS  THE CABIN WAS IN SMOKE,  THEN FLAMES.  UPON INSPECTION OF THE VEHICLE BY THE CONSUMER THE FIRE STARTED FROM THE REAR OF THE VAN.  CONSUMER FELT IT WAS DUE TO THE REAR LICENSE PLATE LAMP SOCKET, RECALL 03V217000, BUT  WAS NOT SURE. THE VAN WILL BE INSPECTED BY A CHEVROLET INSPECTOR.*AK",
        "vin": "1GAHG39U731"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070592,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED BRAND NEW CHEVROLET CONVERSION VAN ON APRIL 30 2003 FROM BILL HEARD CHEVROLET.I AM HAVING PROBLEM WITH AC AND THE DEALER SHIP FAILED TO FIX IT. 1.  PROBLEM-AC NOT WORKING     DATE-5-14-03     MILAGE-769     CORRECTIVE ACTION-DEALERSHIP FOUND LOW ON FREON 2.  PROBLEM-AC NOT WORKING     DATE-5-15-2003     MILAGE-821     COMMENTS-DEALER SHIP FOUND LAEK 3.  PROBLEM-AC NOT WORKING     DATE-5-23-2003     MILAGE-1304     COMMENTS-DEALERSHIP KEPT THE VAN FOR 5 DAYS.ON 29 THEY  CALL AND SAID THE VAN IS FIXED.THE DEALER SHIP SAID  THEY CANT FIND THE PROBLEM 4.  PROBLEM-AC NOT WORKING     JUNE 11-2003     MILAGE-2200     COMMENTS-THE AC IS BLOWING WARM AIR.TOOK IT BACK TO DEALERSHIP AND TALKED WITH KELLY BURNETT(DIRECTOR OF  CUSTOMER RELATIONS)SHE PROMISED THAT SHE PERSONALLY TAKE CARE THE PROBLEM AND THE VAN WILL BE READY ON JUNE 13.I CALLED AND THEY SAID ,ICAN PICK IT UP ON JUNE 14@11.I ARRIVED AT THE DEALERSHIP 10.30AM AND FOUND OUT NOTHING HAS DONE TO MY VAN.I HAD TO TAKE THE VAN BECAUSE I HAVE TO DRIVE TO NEWJERSY FROM ATLANTA ON JUNE 14. I TOLD KELLY ABOUT MY TRIP BEFORE THIS APPOINTMENT. AT THIS TIME I UNDER STAND BILLHEARD DONT WANT TO TAKE CARE MY PROBLEM.AND I CALLED G.M OFFICE.I TALKED WITH KELLY BLANKERSHIP .AFTER SEVERAL ATTEMPTS KELLY BLANKS CALL ME AND AS PER HER ADVISE I TOOK IT TO AN ANOTHER  DEALERSHIP. 5.  PROBLEM-AC NOT WORKING     DATE-JULY-03     MILAGE-4797     COMMENTS-SOUTHTOWNE DEALER SHIP FOUND LOW SIDE PRESSURE  HIGH.HIGH ORFICE TUBE WAS CLOGGED UP WITH METAL. THEY REPLACED IT.IT WAS RUNNING GOOD FOR THREE DAYS AND AC START BLOWING WARM AIR AGAIN.SOUTHTOWN DEALERSHIP ADVISED TO CARRY VAN BACK TO BILL HEARD.",
        "vin": "1GBFG15TX31"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/19/2003",
        "dateOfIncident": "02/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10050771,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAG DEPLOYED AFTER IGNITION SWITCH WAS TURNED ON.  VEHICLE WAS PARKED IN DRIVEWAY AND WAS NOT MOVING.*AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/16/2003",
        "dateOfIncident": "12/13/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051603,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S HORN AND WINDSHIELD WIPER EQUIPMENT FAILED INTERMITTENTLY. THE CAUSE HAD NOT BEEN DETERMINED. PLEASE PROVIDE ADDITIONAL INFORMATION.  *JB  *MR",
        "vin": "1GCFG15XX31"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2003",
        "dateOfIncident": "08/10/2003",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS AWAKENED BY A HORN BLASTING IN THE DRIVEWAY OF  RESIDENCE.  AFTER A FEW MINUTES CONSUMER HEARD A LOUD EXPLOSION.  WHEN THE CONSUMER ARRIVED AT THE FRONT DOOR, VEHICLE WAS IN FLAMES.   ENGINE WAS TOTALLY CONSUMED BY THE  FIRE.  THE FIRE DEPARTMENT ARRIVED, AND INFORMED THE CONSUMER THAT  FAULTY WIRING CAUSED THE FIRE.  *AK          *PH   *NLM",
        "vin": "1GCEG15X831"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/08/2003",
        "dateOfIncident": "10/29/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045732,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ISSUE, NON-REMOVAL OF SHOCK SNUBBERS ON MAGNETIC SELECTIVE RIDE SHOCKS.  *AK",
        "vin": "1G1YY32G035"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/10/2003",
        "dateOfIncident": "10/09/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041577,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WITH THE INCREASED BRIGHTNESS OF HEADLIGHTS IT IS VERY DIFFICULT TO SPOT FRONT TURN SIGNALS AT NIGHT WHEN THEY ARE PLACED ADJACENT TO THE LOW BEAM LAMP.  PLEASE CONSIDER MANDATING THAT SIGNAL LAMPS MUST BE AT LEAST THREE INCHES FROM THE EDGE OF THE LOW BEAM'S REFLECTOR.  *LA",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2003",
        "dateOfIncident": null,
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033576,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "COSNUMER STATED VEHICLE WAS PARKED OVER NIGHT WHEN IT  SUDDENLY CAUGHT ON FIRE. FIRE DEPARTMENT STATED IT WAS AN ELECTRICAL FIRE. *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "03/27/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014549,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKES WERE APPLIED, THEY FAILED TO HOLD, WHICH RESULTED IN AN ACCIDENT.  *JB   ON 3-28-03, THE CONSUMER TOOK THE VEHICLE TO THE DEALER BUT THEY WOULDN'T CHECK THE BRAKES. NINE DAYS LATER, THE CONSUMER PASSED AS A RESULT OF A HEART ATTACK AND HIS WIFE FELT IT WAS THE RESULT OF THE ACCIDENT, BECAUSE HE WAS SCARED TO DRIVE THE VEHICLE WITH THE FAULTY BRAKES.  (CONNIE HUART ON BEHALF OF DECEASED HUSBAND, MICHEAL HUART).    *PH  *JB",
        "vin": "1GCHG39UX31"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/18/2003",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026277,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE DID NOT COME EQUIPPED WITH A INSIDE DOOR HANDLE ON THE PASSENGER SIDE IN ORDER FOR PASSENGERS TO ENTER OR EXIT THE VEHICLE.  *TS   *JB",
        "vin": "1GNFG15T631"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/18/2003",
        "dateOfIncident": "05/19/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030060,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHEVROLET EXPRESS  EXPERIENCED BRAKE PROBLEMS.* MR.  THE BRAKE  ROTORS WERE WORN AND RUSTED FROM SITTING. *TS     *JB    *CB",
        "vin": "1GCFG15X231"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/16/2003",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029386,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAX EMAIL FM DALE BROWN(MI) REQUEST ASSISTANCE IN GETTING GM TO INSTALL MISSING PASSENGER SIDE AIR BAG IN THEIR 2003 GM EXPRESS CARGO VAN.*MR  TRANSFERRED TO OVSC-NVS-220.   *CB",
        "vin": "9999"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2003",
        "dateOfIncident": "06/29/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023962,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "CHEVROLET",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FOLLOWING HAS BEEN A PROBLEM FOR YEARS AND IS REACHING EPIDEMIC PROPORTIONS NATIONWIDE CAUSING A SAFETY HAZARD FOR DRIVERS OF AMERICAN MADE AUTOMOBILES -- ALL MAKES, MODELS, AND  YEARS.  THERE IS AN EPIDEMIC RISE IN THE NUMBER OF CARS DRIVING WITH ONLY ONE HEADLIGHT BECAUSE OF POOR ELECTRICAL ENGINEERING/MANUFACTURING OF THAT SYSTEM IN AMERICAN MADE CARS.  I DO NOT SEE THAT PROBLEM WITH FOREIGN MADE CARS.  IT IS DIFFICULT TO BELIEVE THAT IN 2003 AMERICAN CAR MANUFACTURERS CANNOT BUILD A CAR WHERE HEADLIGHTS WILL NOT FAIL -- AND I'M NOT TALKING ABOUT FAILURES CAUSED BY ACCIDENTS OR IMPACTS.  IN OHIO IT WAS REALLY BAD, AND AS I MOVE AROUND THE COUNTRY IT IS NOT ISOLATED AT ALL, THERE ARE MILLIONS OF HEADLIGHT FAILURES IN AMERICAN CARS, REGARDLESS OF THEIR AGE OR YEAR.  THIS IS A WIDE-SPREAD PROBLEM THAT CAN BE TRACED TO AMERICAN CAR MANUFACTURING AND ENGINEERING PROBLEMS.  HEADLIGHTS ARE A MAJOR SAFETY ITEM IN A CAR, AND THEY SHOULD NOT BE FAILING AT SUCH AN ALARMING RATE.  I CANNOT BELIEVE THAT NO-ONE HAS TAKEN ACTION TO DATE REGARDING THIS OBVIOUS ISSUE.   *NLM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/21/2003",
        "dateOfIncident": "02/15/2003",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019088,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FIRE THAT ORIGINATED IN THE RIGHT REAR BACK DOOR FACTORY WIRING WHERE ARCING AND ELECTRICAL FAULTING WERE PRESENT, SPECIFICALLY THE WIRING TRAVELING TO THE LOCK MOTOR, WHERE A SHORT TO GROUND OCCURRED AND IGNITED WIRING INSULATION INTO OPEN FLAME.   *JB",
        "vin": "1GCFG25X731"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/26/2003",
        "dateOfIncident": "01/12/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10009457,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "EXPRESS",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE EXPERIENCED EXTENDED STOPPING DISTANCE WHEN THE BRAKES WERE APPLIED.*JB",
        "vin": "FULLFILL"
    }
]