[
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/29/2017",
        "dateOfIncident": "05/29/2017",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10992072,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINE FAILED WHILE DRIVING, TURNS OUT ALL LINES ARE RUSTED, NEED ALL BRAKE LINES REPLACED.",
        "vin": "1GNGK26UX3R"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/01/2016",
        "dateOfIncident": "10/09/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823383,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WILL BE DRIVING DOWN THE ROAD BOTH HWY AND CITY. THE SUBURBAN WILL GO INTO REDUCED ENGIN AND LOSE ALL ITS POWER AND SPEED. I HAVE TO PULL OVER AND CUT THE CAR OFF AND RESTART IT AND IT'S FINE TO GO FOR MAYBE A MILE AND IT DOES IT AGAIN. THEY CAN NOT PIN POINT WHAT THE PROBLEM IS . IT'S VERY DANGEROUS.",
        "vin": "3GNGK26UX3G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "01/31/2016",
        "dateOfIncident": "01/31/2016",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10823307,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINE FAILURE",
        "vin": "3GNGK26G13G"
    },
    {
        "components": "SERVICE BRAKES,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/15/2015",
        "dateOfIncident": "06/13/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10763849,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET SUBURBAN 2500. WHILE DRIVING 35 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL AND IT TRAVELED ALL THE WAY TO THE FLOORBOARD. THE CONTACT WAS ABLE TO STOP THE VEHICLE. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THEY PERFORMED AN INTERIM REPAIR. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT ALL THE BRAKE LINES WERE RUSTED AND NEEDED TO BE REPLACED. THE CONTACT WAS ALSO INFORMED BY THE INDEPENDENT MECHANIC THAT THE VEHICLE MAY NEED THE FUEL PUMP LINE REPLACED AS WELL. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 72,000.",
        "vin": "3GNGK26U23G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/25/2015",
        "dateOfIncident": "04/29/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721311,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE METAL BRAKE LINE BETWEEN THE ABS MODULATOR VALVE AND FRONT RIGHT WHEEL RUPTURED WHEN THE BRAKE PEDAL WAS PRESSED. THE LINE FAILED DUE TO CORROSION. ALL BRAKE LINES IN THE VEHICLE HAD SIMILAR LEVELS OF CORROSION NEAR THE AREA THE AFOREMENTIONED LINE RUPTURED, AND AT VARIOUS OTHER LOCATIONS ON THE VEHICLE. A BRAKE LINE BETWEEN THE MASTER CYLINDER AND ABS MODULATOR HAD FAILED IN A SIMILAR MANNNER APPROXIMATELY 8 MONTHS PREVIOUSLY. THE TRANSMISSION COOLER LINES HAD ALSO FAILED DUE TO CORROSION APPROXIMATELY 2 YEARS AGO. THE CORROSION AND RUST ON MANY OTHER COMPONENTS BENEATH THE VEHICLE AND IN THE ENGINE COMPARTMENT IS RATHER CONCERNING. POWER STEERING LINES (INCLUDING POWER BRAKES, SINCE THE VEHICLE HAS HYDRO-BOOST BRAKES) APPEAR TO BE NEXT. ALL METAL BRAKE LINES WERE REPLACED IMMEDIATELY AFTER THE MOST RECENT FAILURE FOR AN OWNER COST OF ABOUT $500. IT IS MY UNDERSTANDING THAT THE NHTSA RECENTLY CLOSED AN INVESTIGATION OF BRAKE LINE FAILURE DUE TO CORROSION ON SEVERAL GM TRUCKS AND SUVS. AFTER ABOUT 4 YEARS, THIS INVESTIGATION DETERMINED THAT \"A SAFETY-RELATED DEFECT HAS NOT BEEN IDENTIFIED AT THIS TIME.\" APPARENTLY THEY DON'T READ THE COMPLAINTS ON THEIR OWN WEBSITE...",
        "vin": "3GNGK26GX3G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/21/2014",
        "dateOfIncident": "11/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660000,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AS I WAS COMING TO AN INTERSECTION WITH A RED LIGHT, I WENT TO SLOW STOP FROM 30 MPH AND MY BRAKES FAILED ALMOST CAUSING ME TO CRASH INTO THE INTERSECTION.  WHEN I APPLIED THE BRAKES THEY DID NOT ENGAGE AND MY BRAKE PEDAL WENT TO THE FLOOR. *TR",
        "vin": "3GNGK26U13G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/16/2014",
        "dateOfIncident": "06/18/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10648287,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS SLOWLY BACKING UP AT A FLAT LAUNCH RAMP TO PUT OUR BOAT INTO THE WATER.  AS THE TRAILER REACHED THE WATER, I PRESSED HARDER ON THE BRAKE PEDAL.  WHEN I DID THAT, THE BRAKE PEDAL WENT TO THE FLOOR AND THE VEHICLE CONTINUED TO ROLL BACKWARDS UNTIL THE BOAT REACHED THE WATER. FORTUNATELY THAT STOPPED THE VEHICLE FROM MOVING AND ALLOWED ME TO APPLY THE PARKING BRAKE.  ONE OF MY BRAKE LINES HAD BURST.  THE REPAIR SHOP SAID THE BRAKE LINES WERE ALL RUSTED AND NOT IN VERY GOOD SHAPE. CONTRARY TO WHAT GM IS CLAIMING, MY VEHICLE COULD NOT STOP IN A SAFE DISTANCE AND THAT WAS WITHOUT THE BOAT/TRAILER ATTACHED.  IF WE HAD BEEN EXITING THE HIGHWAY WHEN THIS HAPPENED (WHICH WE DID SHORTLY BEFORE THE FAILURE), THE RESULTS COULD HAVE BEEN CATASTROPHIC.  *TR",
        "vin": "3GNGK26U33G"
    },
    {
        "components": "POWER TRAIN,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/01/2014",
        "dateOfIncident": "09/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10629913,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE OF THE METAL BRAKE LINES BETWEEN THE MASTER CYLINDER AND THE ABS MODULATOR VALVE RUPTURED DURING A STOP DUE TO CORROSION. ALL BRAKE LINES IN THE VEHICLE HAVE SIMILAR LEVELS OF CORROSION NEAR THE AREA THE AFOREMENTIONED LINE RUPTURED, AND AT VARIOUS OTHER LOCATIONS ON THE VEHICLE. THE TRANSMISSION COOLER LINES HAD FAILED APPROXIMATELY 18 MONTHS PREVIOUSLY DUE TO CORROSION. THE CORROSION AND RUST ON MANY COMPONENTS BENEATH THE VEHICLE AND IN THE ENGINE COMPARTMENT IS BECOMING RATHER CONCERNING.  *TR",
        "vin": "3GNGK26GX3G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/15/2014",
        "dateOfIncident": "08/15/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10622436,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING AWAY FROM THE DRIVEWAY, COMING TO A STOP THE BRAKE PEDAL WENT TO THE FLOOR. AFTER GETTING THE VEHICLE BACK IN THE DRIVEWAY, A LARGE AMOUNT OF BRAKE FLUID WAS RUNNING OUT FROM A LOCATION UNDER THE DRIVERS DOOR AREA. AFTER INSPECTION, THE BRAKE LINE TO THE LEFT REAR WHEEL WAS RUSTED THROUGH AND RUPTURED. ALL BRAKE LINES LOOK TOTALLY RUSTED. LIMITED OR NO BRAKES IS A BIG PROBLEM ON A 3/4 TON VEHICLE. THIS VEHICLE'S UNDER CARRIAGE IS WASHED ON A VERY REGULAR BASIS.  *TR",
        "vin": "3GNGK26U73G"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/09/2013",
        "dateOfIncident": "03/08/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10502170,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A COMPLETE LOSS OF BRAKE PRESSURE WITH NO WARNING LIGHT INDICATOR - WHEN INSPECTED THE DRIVERS SIDE LINE HAD CORRODED ALMOST DIRECTLY UNDER THE DRIVERS SIDE DOOR.  THIS IS THE SECOND TIME OF OCCURRENCE, THE FIRST BEING  THE PASSENGER SIDE BRAKE LINE IN SAME LOCATION.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/21/2012",
        "dateOfIncident": "01/03/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10471706,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHEVROLET SUBURBAN 2500. THE CONTACT WAS TRAVELING 45 MPH WHEN THE BRAKE PEDAL WAS DEPRESSED AND THE BRAKES FAILED TO WORK PROPERLY. THE CONTACT MENTIONED THAT THE BRAKE WARNING LIGHT ILLUMINATED IMMEDIATELY AFTER THE FAILURE. THE FAILURE RECURRED FIVE TIMES. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC. THE MECHANIC CONFIRMED THAT THE BRAKE LINES NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE FAILURE MILEAGE WAS 72,300 AND THE CURRENT MILEAGE WAS 75,293.",
        "vin": "3GNGK26U83G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/31/2011",
        "dateOfIncident": "10/13/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10433658,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR AT A RELATIVELY SLOW SPEED (35 MPH), I ATTEMPTED TO APPLY THE BRAKES AS I APPROACHED A TRAFFIC LIGHT TURNING YELLOW.  THE PEDAL WENT ALL THE WAY TO THE FLOOR WITHOUT ANY DECREASE IN SPEED WHATSOEVER.  ESSENTIALLY, THERE WAS NO BRAKING POWER AT ALL. PRIOR TO THIS, THERE HAD BEEN NO ISSUES WITH THE BRAKES AND THE TRUCK HAD BEEN ROUTINELY SERVICED AT MY LOCAL DEALERSHIP (NESENGER 112 CHEVROLET, 112 MEDFORD AVENUE, MEDFORD, NY 11763).    I WAS ABLE TO PLACE CAR IN NEUTRAL IN ORDER TO ALLOW IT TO COAST OFF THE ROAD AND IT WAS TOWED TO THE ABOVE NAMED DEALERSHIP FOR REPAIR THE NEXT MORNING.    FORTUNATELY, IT WAS APPROXIMATELY 10:30 PM ON A SIDE ROAD AND THERE WERE NO CARS IN FRONT OF ME.    THE SERVICE MANAGER AT THE DEALERSHIP TOLD ME THAT ALL THE BRAKE LINES WERE CORRODED AND HAD TO BE REPLACED, AS WELL AS THE REAR BACKING PLATES.    THE REPAIR TOTAL WAS $2457.01.  *TR",
        "vin": "3GNFK16ZX3G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/31/2011",
        "dateOfIncident": "08/30/2011",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10422710,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING MY 2003 SUBURBAN 2500 & WENT TO STOP, BRAKE PEDAL WENT ALL THE WAY TO THE FLOOR & TRUCK HAD TROUBLE STOPPING. AFTER LOOKING WHAT WAS THE PROBLEM SAW BRAKE FLUID ALL OVER THE UNDERSIDE OF TRUCK AND ON GROUND.  BRAKELINES HAVE RUSTED THROUGH AND HAVE BURST.  NOW NEED TO BE REPLACED.  *TR",
        "vin": "3GNGK26G83G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/09/2010",
        "dateOfIncident": "07/09/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342314,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2003 K2500 CHEVY SUBURBAN, ANOTHER VEHICLE PULLED OUT IN FRONT OF ME FROM A SIDE STREET WHILE I WAS TRAVELING ABOUT 35 MPH AND I PRESSED THE BRAKES VERY HARD - HARD ENOUGH TO LOCK UP AT LEAST ONE WHEEL, BUT AVOIDED AN ACCIDENT.       I CONTINUED ON, BUT JUST A FEW SECONDS LATER, I APPROACHED AN INTERSECTION, AND THE BRAKE PEDAL WENT TO THE FLOOR, WITH VERY LITTLE BRAKING POWER.  I WAS ABLE TO GET THE VEHICLE STOPPED BY PUMPING THE BRAKES QUICKLY AND RAN SLIGHTLY INTO THE BUSY INTERSECTION.   I PULLED INTO A PARKING LOT TO INSPECT WHETHER I HAD DAMAGED SOMETHING.  I DECIDED TO RETURN HOME ABOUT 1/2 MILE AWAY AND SLOWLY DROVE HOME, WITH VERY LITTLE BRAKING POWER.       WHEN I GOT HOME, I CRAWLED UNDER THE VEHICLE TO FIND BRAKE FLUID SPLATTERED AND LEAKING ALL OVER THE UNDERSIDE AROUND THE ABS UNIT.  THE BRAKE LINES ARE EXTREMELY CORRODED, AND I SUSPECT ONE HAS BLOWN OUT.   THE VEHICLE IS IN VERY GOOD AND WELL MAINTAINED CONDITION OTHERWISE, BUT THE UNDERSIDE SEEMS PARTICULARLY RUSTY.      IF I WERE TRAVELING MORE THAN THE 30-35 MPH I WAS, THERE WOULD HAVE BEEN NO WAY TO STOP THE VEHICLE.  A SERIOUS ACCIDENT WOULD HAVE OCCURRED.   THESE ARE VERY COMMON VEHICLES, IF THIS IS TYPICAL, A SAFETY RECALL MUST BE INITIATED. *TR",
        "vin": "3GNGK26U53G"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/16/2009",
        "dateOfIncident": "02/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261969,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHEVROLET SUBURBAN 2500.  WHILE APPROACHING A STOP OR SLOWING DOWN TO MAKE TURNS AT LOW SPEEDS, THE ABS ACTIVATES WITHOUT WARNING.  THE CONTACT IS UNABLE TO SAFELY COME TO A COMPLETE STOP.  THE MANUFACTURER STATED THAT HER VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 05V379000 (SERVICE BRAKES, HYDRAULIC: ANTILOCK).  SHE WILL TAKE THE VEHICLE TO THE DEALER FOR REPAIR.  THE CURRENT AND FAILURE MILEAGES WERE 88,000.",
        "vin": "3GNGK26U42G"
    },
    {
        "components": "EQUIPMENT,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/25/2008",
        "dateOfIncident": "11/24/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249806,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "SUBURBAN MANUFACTURING CO",
                "productMake": "SUBURBAN",
                "productModel": "SRSA3LGGSV",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "2003 CHEVY SUBURBAN 2500 WITH 122,000 MILES - THE FUEL GAUGE REGISTERED \"ZERO\" AND THEN THE SPEEDOMETER FAILED TO REGISTER ANY SPEED.  IT THEN REGISTERED BETWEEN 120MPH AND 0MPH ALTERNATELY. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE,TRAILER HITCHES",
        "crash": false,
        "dateComplaintFiled": "05/04/2008",
        "dateOfIncident": "04/10/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226578,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "READ ON RV.NET ABOUT HITCH FAILURES.  CONTACTED HITCH SHOP, HAD MINE INSPECTED.  UPON INSPECTION FOUND THAT THE DRIFT PIN HOLES WERE ELONGATING AND FRACTURING. SINCE I TOW A TRAVEL TRAILER OFTEN, IT WAS DETERMINED BY THE HITCH SHOP THAT THE HITCH WOULD EVENTUALLY FAIL DUE TO THE EXCESSIVE WEAR AROUND THE DRIFT PIN AREA OF THE HITCH. THEY STATED THAT THE METAL MAY NOT HAVE BEEN HARDENED CORRECTLY.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/15/2008",
        "dateOfIncident": "10/01/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218121,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHEVY SUBURBAN 2500 (3/4 TON) - THE INSTRUMENT CLUSTERS ARE JUNK AND DANGEROUSLY UNRELIABLE - FAULTY. IT IS ABSOLUTELY CRIMINAL THAT GM AND NHTSA NOT ISSUE A FORMAL RECALL ON GM 2003-2006 INSTRUMENT CLUSTERS. MINE BEGAN FAILING AT 40,000 MILES IN 2005 (FUEL GAUGE READING WRONG OR EMPTY IF IDLING MORE THAN 30 SECONDS, SPEEDOMETER PEGGING OR READING WRONG INTERMITTENTLY). I MENTIONED THIS TO THE DEALER BUT THEY LIED AND SAID THAT HAD NO OTHER REPORTS OF SUCH. WHEN TOLD IT WOULD COST $400 TO REPAIR, I HAD TO PASS ON THAT EXPENSE AND JUST RELIED ON A CHEAP GPS I MOUNTED TO READ ACCURATE SPEED. NOW, GM COMES OUT LATE AND CLAIMS THEY MAY PAY FOR THE REPAIR IF IT IS UNDER 70,000 MILES ON THE 03 AND 04 MODELS. I SURMISE THEY WAITED INTENTIONALLY TO MINIMIZE POTENTIAL COST AND THEY WILL SEND A LETTER ON THE 05 AND 06 MODELS IN TWO YEARS HOPING THOSE VEHICLES ALSO HAVE GONE OVER 70K. THIS IS OBVIOUSLY A VERY WELL KNOWN DEFECT BECAUSE THERE ARE SITES ON THE INTERNET SUCH AS WWW.SPEEDOMETER.COM DEDICATED TO REPAIRING GM CLUSTERS.  AGAIN, A FAULTY SPEEDOMETER IS A POTENTIALLY FATAL DEFECT AND THE NHTSA MUST STEP UP AND FORCE A FORMAL RECALL OR BE AS GUILTY OF NEGLECTING ITS DUTY AS THE FDA HAS BEEN.  *TR",
        "vin": "3GNGK26G43G"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/04/2008",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213765,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SPEEDOMETER FAILURE AT 52000 ON 2003 SUBURBAN 2500. SPEEDOMETER SHOWS BETWEEN 70 AND 120 MPH. *CN",
        "vin": "3GNGK26GX3G"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/28/2007",
        "dateOfIncident": "03/29/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213092,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN STARTING THE VEHICLE THE OIL IS OUT OF THE VALVES CAUSING IT TO SOUND LIKE A DIESEL MOTOR. THEREFORE NEEDING TO LEAVE THE VEHICLE RUNNING FOR AT LEAST 15 MINUTES BEFORE YOU SHOULD PUT IT INTO GEAR.  *TR",
        "vin": "3GNGK26G53G"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/25/2006",
        "dateOfIncident": "09/23/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169167,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "CHEVROLET",
                "productModel": "SUBURBAN 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WITHOUT PRIOR WARNING, THE TRANSFER CASE STARTED SWITCHING FROM 2 HI TO 4 HI AND 2 LO AT HIGHWAY SPEEDS AND BY ITSELF. THIS IS EXTREMELY DANGEROUS AS IT CAN RESULT IS A SUDDEN LOST OF CONTROL.  *JB",
        "vin": "3GNGK26G53G"
    }
]