[
    {
        "components": "POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/11/2021",
        "dateOfIncident": "07/10/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11424319,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "While driving approximately 25 mph I crossed over railroad tracks in the road. There is only a very small bump going over these. The front drivers side wheel came off.  The lower ball joint pulled out and pulled the front axle out. The vehicle only has 91,000 miles on it. There was no warning that this was going to happen. I was driving in normal traffic. And was unable to move the vehicle out of the traffic lane. Vehicle had to be towed. This happened yesterday 7/10/21. I have seen other reports of problems with this but vehicles have higher mileage than mine. Is there not a recall for this?",
        "vin": "1C3EL75T53N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/17/2018",
        "dateOfIncident": "01/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11079947,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL;  AIR BAG LIGHT ON DASH COMES ON & OFF INTERMITTENTLY FROM STARTUP TO SHUTDOWN, ANYWHERE -  WTF?",
        "vin": "1C3EL55TX3N"
    },
    {
        "components": "EXTERIOR LIGHTING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "10/13/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11041918,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PAST FEW WEEKS BEEN NOTICING ISSUES WITH THE CAR. 1. SUN VISORS HIT ME IN THE FACE 2. CAR STALLS TO START 3. LIGHTS  HARDLY WORK EVEN WHEN YOU TRY TO PUT ON HIGH BEAMS 3. FLUID DOESN'T STAY IN THE CAR 4. CAR CUTS OFF IN MID DRIVING 5. CAR ALSO CAN CUT OFF WHEN YOU APPLY BRAKES . CAR BACK TIRE SMOKES. WAS NOT IN A ACCIDENT WITH ANYONE CAR CUT OFF ON ME WHILE DRIVING I WAS ABLE TO OWN MY OWN BRING CAR TO STOP",
        "vin": "1C3EL55T33N"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2017",
        "dateOfIncident": "12/28/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10957747,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WON A CAR FROM MY LOCAL CHRYSLER DEALER. THE CAR HAD A 2.7L V6 ENGINE IN IT THAT NADA AND KBB DO NOT LIST SUCH AN ENGINE IN THIS TYPE OF CAR THAT I WON, SO I CAN ONLY ASSUME IT WAS A DEALER SWAP PRIOR TO THE RAFFLE DRAWING, BUT THEY DENY THE SWAP WHEN I CALLED THEM ABOUT THIS INCIDENT. WHEN I WON IT, LAST JUNE IT HAD LIKE 181,000 MILES ON THE CAR, UNKNOWN MILEAGE ON THE ENGINE, BUT I HAD IT FROM JUN TO DEB 2016 AND DROVE IT MAYBE 9000 MILES MAX AND IT FAILED WITHOUT WARNING. I CHANGED THE OIL EVERY 3000 TO 4000 MILES, SO LIKE 2-3 TIMES SINCE I HAVE HAD THE CAR AND IT HAD NO INDICATION OF ANY ENGINE PROBLEMS PRIOR TO SPONTANEOUS AND COMPLETE ENGINE FAILURE. I HAVE MY CARS SERVICES REGULARLY FOR TIRE ROTATIONS, CAR INSPECTIONS ETC. NOTHING COULD HAVE WARNED ME ABOUT THIS AND I HAD NO IDEA ABOUT THE CLASS ACTIONS LAW SUITS PERTAINING TO THIS EXACT ENGINE UNTIL MY ENGINE FAILED A FEW MONTHS AGO. I CLIMBING TH INTERSTATE ON RAMP WHEN ALL OF A SUDDEN THE RPM'S ON MY CAR CONTINUED TO RISE WHILE MY CAR WAS SLOWING DOWN, IN ESSENSE IT WAS REVING AS I ACCELLERATED, BUT MY CAR WAS SLOWING, SO I IMMEDIATELY PULLED OVER ON THE SIDE OF THE ROAD AND ATTEMPTED TO RESTART MY CAR, NOTHING HAPPENED, SO I HAD IT TOWED TO A LOCAL MECHANIC, WHEN IT GOT BACK TO THE SHOP, THE CAR STARTED BACK UP AS NORMAL, BUT I LEFT IT ANYWAY, BECAUSE IT CLEARLY HAD AN ISSUE. IT WAS DISCOVERED AFTER THE MECHANIC DROVE IT THAT THE OIL LIGHT CAME ON AND THE ENGINE LOST OIL PRESSURE. THERE WAS PLENTY OF GOOD OIL IN THE TANK, WHEN IT WAS CHECKED AND BASED ON THE LEVEL THERE WAS NO NEED TO ADD OIL. IT WAS DETERMINED THAT THE ENGINE WAS SEIZING UP DUE TO OIL SLUDGE AND THAT  MY ONLY FIX IS A NEW ENGINE.",
        "vin": "1C3LC56R17N"
    },
    {
        "components": "SUSPENSION,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/18/2016",
        "dateOfIncident": "07/17/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10885516,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHRYSLER SEBRING. THE CONTACT STATED THAT WHILE DRIVING AT 5 MPH, HE TRIED TO TURN LEFT AND THE FRONT PASSENGER SIDE TIRE TURNED OUTWARDS.  THE VEHICLE WAS DRIVEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE LOWER CONTROL ARM AND BONJOY WAS FRACTURED IT CAUSED THE AXLE TO FRACTURE.  THE VEHICLE WAS NOT REPAIRED.  THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE CONTACT STATED THAT THERE WAS A RECALL UNDER NHTSA CAMPAIGN NUMBER: 10E059000 (SUSPENSION) HOWEVER THE VIN WAS NOT INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS 131,389.",
        "vin": "1C3EL46X43N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/15/2015",
        "dateOfIncident": "06/02/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10810468,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHRYSLER SEBRING. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 15V338000 (AIR BAGS) HOWEVER, THE PART TO DO THE REPAIR WAS UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.  UPDATED 03/09/16*LJ",
        "vin": "4C3AG52H43E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/10/2015",
        "dateOfIncident": "11/06/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10789703,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN A WRECK ON 11/06/2015, A WOMEN FAILED TO YIELD AND I T-BONED HER PASSENGER SIDE BY BACK DOOR/BACK TIRE, I WAS GOING 30 MILES AN HOUR THE SPEED LIMIT ON THE CITY ROAD, I HAD MY SAFETY RESTRAINT ON AND STILL MANAGED TO HIT THE STEERING WHEEL AND WINDOW, I HAD A LOOSE CAR SEAT IN FRONT THAT HIT THE PASSENGER DASH, NO AIRBAGS DEPLOYED, SHE WAS HEADED NORTH AND I WAS HEADED WEST, I WAS DRIVING STRAIGHT ON THE ROAD WHEN I HIT HER, SO IT FELT LIKE A BRICK WALL AT 30 MPH, I ENDED UP IN THE ER WITH A SPRAINED WRIST, MY LEFT SIDE OF MY HEAD WAS SWOLLEN, AND I'M HAVING ISSUES IN MY BACK(DOCTOR SAID NECK AND BACK PAIN IS MOST LIKELY DUE TO WHIPLASH, I AM STILL HAVING ISSUES WITH BACK PAIN. FROM ALL THE INFORMATION I'VE FOUND ON RECALLS, THERE IS NOT ONE FOR FAULTY AIRBAGS ON MY CHRYSLER LXI....",
        "vin": "4C3AG52H63E"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2015",
        "dateOfIncident": "06/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723312,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "START CAR, WHEN IN IDLE IT SHUTS OFF WITH IN A FEW SECONDS OF HITTING GAS NOW. IT USE TO IDLE AND I WOULD HAVE TO REV A LITTLE SO IT WOULD NOT TURN OFF. THAT WORKED FOR A LITTLE BIT TODAY TO BROKE DOWN. LUCKILY IN MY DRIVE WAY THIS TIME INSTEAD OF THE MIDDLE OF ROAD LIKE LAST WEEK. WHY IS MY CAR DOING THIS?",
        "vin": ""
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/25/2015",
        "dateOfIncident": "03/23/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10701669,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING SEDAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHRYSLER SEBRING SEDAN. THE CONTACT NOTICED THAT THE ENTIRE STEERING COLUMN, HORN, AND CRUISE CONTROL WERE FRACTURED. IN ADDITION, THE DRIVER SIDE AIR BAG WARNING LIGHT WAS CONTINUOUSLY ILLUMINATED. THE FAILURES OCCURRED CONTINUOUSLY. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE CLOCK SPRING NEEDED TO BE REPLACED, BUT THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE  FAILURE. THE FAILURE MILEAGE WAS 130,000.",
        "vin": "1C3EL56R13N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/05/2015",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10681608,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHRYSLER SEBRING. THE CONTACT STATED THAT THE DASHBOARD BEGAN TO RISE WITHOUT CAUSE. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. THE VIN WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/07/2015",
        "dateOfIncident": "01/03/2015",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10670585,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING COUPE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER GOING APPROX 40 MILES AN HOUR AROUND CURVE, CLOCKSPRING BROKE CAUSING THE STEERING WHEEL TO BECOME INOPERABLE. DRIVER LOST CONTROL OF VEHICLE WENT OFF ROAD HIT TWO TREES. AIRBAG DID NOT DEPLOY. CAR IS TOTALED AND DRIVER IS IN CRITICAL CONDITION.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/13/2014",
        "dateOfIncident": "05/15/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598249,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE DUE TO OIL SLUDGE. THIS IS, APPARENTLY, A COMMON PROBLEM AFFECTING THE 2.7L V6 ENGINE.    *JS",
        "vin": "1C3EL55TX3N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/19/2013",
        "dateOfIncident": "09/05/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10544391,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHRYSLER SEBRING. THE CONTACT STATED THAT WHILE DRIVING 40 MPH, THE HORN FAILED TO FUNCTION AND THE AIR BAG WARNING LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS WHERE IT WAS STATED THAT THE CLOCK SPRING NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 143,000.",
        "vin": "1C3EL55T03N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/21/2013",
        "dateOfIncident": "06/01/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536601,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DASH SEPARATING FRO VENT POSSIBLY BY THE SUN.  ALSO THE FRONT BUMPER SCRAP MOST DRIVEWAYS.  *TR",
        "vin": "4C3AG42G33E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/13/2013",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498039,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHRYSLER SEBRING. THE CONTACT STATED THAT THE FRONT DRIVER SIDE TIRE FAILED. THE CONTACT ALSO STATED THAT HE PUT AIR IN THE TIRE AND IT DEFLATED A COUPLE OF HOURS AFTER. THE TIRE WAS REPLACED WITH THE SAME TYPE OF TIRE BUT THE FAILURE RECURRED.  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION AND THEY STATED THAT THE WHEEL HAD CORRODED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED. THE FAILURE MILEAGE WAS 46,000.  THE CONSUMER SATED THE VEHICLE HAS DEFECTIVE WHEELS. HE PURCHASED THE VEHICLE IN 2007 AND THE TIRES WERE REPLACED ONCE A YEAR DUE TO THE DEFECT. THE CONSUMER HAD THE WHEELS FIXED AT THE DEALER, AND THE FIX ONLY LASTED THREE DAYS. THE WHEELS LEAKED AT THE BEAD OF THE TIRE, DUE TO THEM NOT BEING SEATED PROPERLY.  THE CONSUMER STATED HE SPENT $2,000 ON TIRES, ONLY TO FIND OUT, THE PROBLEM WASN'T THE TIRES, IT WAS THE DEFECTIVE WHEELS. UPDATED 02/28/13",
        "vin": "4C3AG52H93E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/14/2012",
        "dateOfIncident": "08/14/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470685,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING COUPE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER PICKING UP VEHICLE FROM DEALER AND REPORTING \"SLIPPING\" ON THE TRANSMISSION, THE DEALER TOLD ME THE TRANSMISSION WAS STARTING TO BREAK UP. A NEW ONE WOULD COST $7,000, AND A REFURBISHED ONE WOULD BE $5,500, AND THERE WAS A WAITING LIST. I DECIDED TO DRIVE IT HOME AN EXPLORE OTHER AVENUES. THE VEHICLE LASTED MAYBE FIVE MILES AND IT DIED ON THE FREEWAY. THE ENGINE LIGHT CAME ON, THE ENGINE STARTED SMOKING, AND THE ENGINE JUST DIED. I LIFTED THE HOOD AND THE ENGINE WAS SMOKING AS THE TRANSMISSION HAD BROKEN AND IT HAD BEEN LEAKING ITS FLUID ON THE FREEWAY. I CALLED A TOW TRUCK TO TOW IT HOME.  AN INDEPENDENT TRANSMISSION REPAIR SHOP WILL CHARGE ME $1,800 TO REBUILT IT. I HAVE NO CHOICE.  *TR",
        "vin": "4C3AG52HX3E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/13/2012",
        "dateOfIncident": "01/30/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461672,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 CHRYSLER SEBRING. THE CONTACT STATED THAT WHILE DRIVING 25 MPH, THE FRONT END OF THE VEHICLE DROPPED DOWN TOWARD THE GROUND. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC. THE MECHANIC STATED THAT THE FRONT LOWER BALL JOINTS FAILED DUE TO DEFECTIVE MATERIAL. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED. THE VEHICLE WAS TAKEN BACK TO THE MECHANIC, BUT WAS NOT REPAIRED A SECOND TIME. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 115,000 AND THE APPROXIMATE CURRENT MILEAGE WAS 115,300.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/22/2011",
        "dateOfIncident": "05/12/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10402298,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 CHRYSLER SEBRING CONVERTIBLE WITH A 2.7L ENGINE.    I RECENTLY STARTED NOTICING PROBLEMS AROUND 88,000 MILES.. I NOW HAVE 92,000 MILES AND SEE ENGINE COOLANT IS BLACK.. ONLINE IT APPEARS A COMMON PROBLEM IS OIL MIXING WITH COOLANT.. APPARENTLY I HAVE THIS PROBLEM.     I ALSO HAVE THE 2.7L ENGINE THAT IS PRONE TO SLUDGE AND OTHER PROBLEMS. I NOTICED THE CAR WAS USING MORE OIL RECENTLY EVEN BEFORE MY 3,000 OIL CHANGE.. NOW I MIGHT HAVE THE REASON WHY...    I SEE I'M NOT THE ONLY PERSON WITH THIS PROBLEM, PLEASE HELP EVERYONE WHO PURCHASED A CHRYSLER PRODUCT WITH THIS 2.7L ENGINE...   *TR",
        "vin": "1C3EL55T23N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/23/2011",
        "dateOfIncident": "03/23/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392668,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING SEDAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "COMPLAINT OF KNOCKING NOISE FROM REAR OF VEHICLE.  FOUND REAR SPRING MOUNT BROKE DUE TO CORROSION.  MADE OF ALUMINUM POT METAL?  *TR",
        "vin": "1C3EL46XX3N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/01/2010",
        "dateOfIncident": "03/25/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323370,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHRYSLER SEBRING CONVERTIBLE. WHEN THE VEHICLE WAS TURNING TO THE LEFT AT APPROXIMATELY 8 MPH, THE CONTACT HEARD A NOISE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER WHERE THE LOWER BALL JOINTS WERE REPLACED. THE FAILURE MILEAGE WAS APPROXIMATELY 70,000. THE CURRENT MILEAGE WAS APPROXIMATELY 7,000.",
        "vin": "1C3EL45X43N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/28/2010",
        "dateOfIncident": "02/12/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10315016,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHRYSLER SEBRING 61,000 MILES DEFECTIVE NOW BROKEN CLOCK SPRING THAT OPERATES AIR BAG AND HORN, NOW STEERING WHEEL BINDS, VEHICLE UNSAFE TO OPERATE. THIS HAS HAPPENED TO MANY OTHERS, MOSTLY BREAKS WHEN ITS COLD OUT. HOW COME CHRYSLER ISSUED A RECALL ON THE CARAVANS FOR SAME REASON BUT NOT ON SEBRINGS? PLEASE ADVISE. *TR",
        "vin": "1C3EL55T93N"
    },
    {
        "components": "STEERING,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/10/2010",
        "dateOfIncident": "02/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10308389,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING SEDAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CLOCK SPRING BROKE IN STEERING WHEEL. AIR BAG LIGHT CAME ON. CALLED DEALER AND MADE APPOINTMENT. VERIFIED BROKEN SPRING . NOT IN STOCK. 10 DAYS LATER CALLED DEALER STILL NO PART. AM DRIVING WITHOUT AIR  BAG, LIGHT STILL ON. *TR",
        "vin": "1C3EL56R13N"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/24/2009",
        "dateOfIncident": "06/23/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274836,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PARKED MY CAR JUNE 23 2009 AROUND 5:15 PM SEAT BELT WAS WORKING FINE. CAME BACK OUT OF THE HOUSE 20 TO 30 MINUTES LATER, SEAT BELT WOULD NOT RELEASE FOR ME TO BUCKLE UP. *TR",
        "vin": "1C3EL46X23N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/23/2009",
        "dateOfIncident": "03/23/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262813,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WORKED WITH THE REPAIR SHOP - EVANS AUTO CAR IN BLUE ASH, OH - TO UNDERSTAND WHY 2003 CHRYSLER SEBRING SUDDENLY EXPERIENCES DROP IN SPEED FROM 70 TO 25 MPH. REPAIR SHOP NOTED CAR COMPUTER LIKELY FAULTY AND PARTS UNAVAILABLE FROM DEALERSHIP. ACCORDING TO MESSAGE BOARDS AND OTHER CHRYSLER SHOPS, DEALERS ARE RESTRICTED FROM RELEASING PARTS DUE TO ANTICIPATED FUTURE PROBLEMS. PROBLEMS STEM FROM COLD-SOLDERING OF THE MAIN COMPUTER BOARD.    THIS IS A DANGEROUS DEVELOPING SAFETY CONCERN THAT WARRANTS FUTURE INVESTIGATION DUE TO MANUFACTURER HOLDING BACK PARTS. REPAIR SHOP NOTED THEY MAY BE PREPARING FOR FUTURE PROBLEMS. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/14/2009",
        "dateOfIncident": "03/14/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261801,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEM: SMELLING GAS FUMES WHILE STARTING THE CAR. ENGINE FAILURE TO START.  FAILURE IS DAILY. MY WIFE AND HAVE TAKEN THE CAR NUMEROUS TIMES TO THE DEALER. THE DEALER STATED THAT THERE IS NOTHING WRONG WITH THE CAR, EXCEPT NEEDING A NEW GAS CAP.    SINCE THEN, OUR LOCAL DEALER HAS GONE OUT OF BUSINESS. I AM CONCERNED THAT OUR CAR WILL RESULT IN WORST CASE SCENARIO RESULTS, LIKE AN EXPLOSION WHILE STARTING THE CAR. OUR CAR WAS PURCHASED BRAND NEW IN 2003, IN 2009 THE CARS CONDITION HAS GOTTEN WORSE, SMELLING MORE FUEL FUMES. I AM NOT SURE WHAT TO DO, I AM IN HOPES THAT SOMEONE ON YOUR END CAN HELP US. WE DON'T HAVE ALOT OF MONEY TO GO OUT AND SIMPLY GET A NEW CAR. CHRYSLER SHOULD HAVE BEEN PAYING MORE ATTENTION WHEN DESIGNING THE SEBRING LX.     I AM AFRAID TO EVEN OPERATE IT. I HAVE TWO CHILDREN MY WIFE AND I SIMPLY CANNOT AFFORD TO REPEATEDLY TAKING OUR CAR TO SOMEONE ONLY TO BE TOLD THERE IS NOTHING WRONG WITH IT. WE HAVE ALSO NOTICED CLICKING SOUNDS FROM THE STEERING COLUMN. AND THE WHEN YOU HAVE YOUR HANDS ON THE STEERING WHEEL, YOU CAN FEEL THIS \"CLICKING\".    PLEASE HELP US.*TR",
        "vin": "1C3AL46X33N"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/21/2009",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259517,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 CHRYSLER SEBRING CONVERTIBLE THAT HAS CHROME/ALUMINUM WHEELS. I NOTICED THAT I WAS LOSING SUBSTANTIAL PRESSURE IN MY TIRES ON A REGULAR BASIS. THINKING THIS WAS A PROBLEM WITH THE TIRES, AND THE CAR WAS UNDER WARRANTY, I TOOK THE CAR BACK TO THE CHRYSLER SERVICE CENTER IN WYCKOFF NJ WHERE I PURCHASED IT. UPON INSPECTION, THE SERVICE TECHNICIAN INDICATED THAT THERE WAS NOTHING WRONG WITH THE WHEELS AND THAT I SHOULD MAKE SURE TO KEEP THE TIRES PROPERLY INFLATED.  THE PROBLEM PERSISTED AND, WHEN I BROUGHT THE CAR TO MY REGULAR (NON-CHRYSLER) MECHANIC, HE POINTED OUT THAT MY RIMS WERE CORRODING FROM THE INSIDE AND THAT THIS AFFECTED THE BEAD ON THE TIRE AND CAUSED IT TO LOSE PRESSURE. HE INDICATED THAT HE HAD CALLED CHRYSLER AND BEEN TOLD THE PROBLEM WAS NOT COVERED UNDER WARRANTY.  I HAVE SINCE READ THAT THIS IS A COMMON PROBLEM WITH SEBRING RIMS.  I SENT AN INTERNET COMPLAINT TO CHRYSLER'S WEBSITE BUT RECEIVED NO RESPONSE.  MY MECHANIC ADVISED THAT ALL HE COULD DO, INSTEAD OF TOTAL REPLACEMENT, WAS GRIND DOWN THE OLD RIMS AND TAR OVER THEM AS A STOP GAP SOLUTION.  I EXPERIENCE ADDITIONAL LOSS OF PRESSURE ABOUT EVERY OTHER DAY AND HAVE TAKEN THE CAR BACK TO TIRE DEALERS TWICE TO REGRIND THE RIMS. EACH TIME THEY POINT TO THE CORROSION AND THEIR FRUSTRATION WITH CHRYSLER NOT DEALING THE PROBLEM.  HAVING TIRES LOSE PRESSURE BECAUSE OF A DEFECT IN THE DESIGN AND PERFORMANCE OF THE WHEEL IS A CLEAR SAFETY HAZARD. I HOPE NHTSA WILL LOOK INTO THIS AND REQUIRE CHRYSLER TO STAND BEHIND ITS PRODUCT. THANK YOU. *TR",
        "vin": "1C3EL65T53N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/09/2009",
        "dateOfIncident": "02/07/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258016,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2003 CHRYSLER SEBRING IN EARLY '07' I STILL OWE ABOUT 5,000 ON THE CAR. FOR THE PAST SEVERAL MONTHS MY OIL LIGHT HAS BEEN COMING ON WHEN I COME TO A STOP. I TOOK IT TO A DEALER AND THEY SAID THE OIL SENDER SWITCH WAS BAD AND LEAKING OIL. THEY CHARGED ME 173.00 TO REPLACE IT AND WHEN I LEFT I GOT ABOUT 5 MILES DOWN THE ROAD AND THE LIGHT CAME ON AGAIN. NOW I HAVE BEEN TOLD THAT THE ENGINE MOST LIKELY WILL NEED TO BE REPLACED. IT IS THE 2.7  THAT I NOW HAVE LEARNED IS ONE OF THE WORSE ENGINES MADE. THIS LAST CHRISTMAS I WAS AT A PARTY AND MY FRIEND INTRODUCED ME TO HIS ROOMMATE THAT WAS GOING TO DIESEL ENGINE SCHOOL,HE HAD ALREADY RECEIVED EVERY GAS AUTOMOBILE CERTIFICATION THERE IN EXISTENCE AND IS ONE OF THE TOP MECHANICS IN THE AREA! WE STARTED TALKING ABOUT CARS AND HE ASKED ME WHAT I DROVE, I TOLD HIM I HAD A 2003 SEBRING. HIS REPLY WAS..\"OH, I'M SORRY\". NOW I KNOW WHAT HE MEANT BY THAT,AT THE TIME I THOUGHT HE WAS JUST JOKING. I HOPE SOMEONE WILL START A CLASS ACTION LAWSUIT,IF THEY DON'T REMEDY THIS PROBLEM I WILL PRAY DAILY THAT CHRYSLER GOES UNDER AND WILL BAD MOUTH THEM TO EVERY PERSON I KNOW AND MEET. *TR",
        "vin": "1C3EL55T63N"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "10/18/2008",
        "dateOfIncident": "08/17/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10245866,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS DRIVING OUR 2003 SEBRING LXI  AND HAD JUST LEFT OUR HOUSE  ON A SUN. MORNING HEADING BACK TO COLLEGE.  WE LIVE IN A RURAL AREA AND ONLY THE CENTER ROAD BED IS TAR AND THE SHOULDER IS GRAVEL.  SHE WENT SLIGHTLY INTO SHOULDER AND SAID SOMETHING UNUSUAL HAPPENED AS SHE COULD NOT STEER AND IMMEDIATELY REMEMBERS ROLLING A COUPLE OF TIMES AND AWAKING UPSIDE DOWN IN A STEEPER DITCH IN A CORN FIELD.  SHE ENDED UP ROLLING OVER A MAIL POST THAT JAVELIN THROUGH THE FRONT SHIELD AND JUST MISSED HER HEAD.  SHE WAS TAKEN BY AMBULANCE FOR HEAD INJURY.  WE THOUGHT SHE OVER COMPENSATED.    WE JUST DISCOVERED THAT WAS NOT THE CASE THE MOUNT ABOVE THE STRUT  WAS COMPLETELY RUSTED AND BROKE OFF WHICH DEFINITELY IS THE CAUSE OF THE ACCIDENT. THE AIR BAGS DID NOT DEPLOY.  SHE WAS WEARING A SEAT BELT.  THREE DIFFERENT EMERGENCY WORKERS SAID IF SHE WASN'T SHE WOULD OF DIED.   THIS IS SCARY AS THE CAR IS ONLY IS ONLY \"FIVE\" YEARS OLD.  AND A IMMEDIATE RECALL OR INVESTIGATION.  *TR",
        "vin": "1C3EL56T93N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/10/2008",
        "dateOfIncident": "10/08/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245037,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHRYSLER SEBRING.  WHILE DRIVING APPROXIMATELY 3 MPH AND PROCEEDING TO MAKE A LEFT TURN, THE ENGINE STOPPED WITHOUT WARNING.  THERE WERE NO WARNING INDICATORS ILLUMINATED ON THE INSTRUMENT PANEL.  THE CONTACT INSPECTED UNDERNEATH THE HOOD AND NOTICED THAT THE ENGINE WAS OVERHEATING.  AFTER SEVERAL ATTEMPTS, THE ENGINE FINALLY STARTED AND MADE A LOUD KNOCKING NOISE.  IMMEDIATELY FOLLOWING, THE TEMPERATURE GAUGE INCREASED DRASTICALLY.  THE VEHICLE WAS TOWED TO THE AUTHORIZED DEALER AND THEY STATED THAT THE FAILURE WAS DUE TO ENGINE SLUDGE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE FAILURE AND CURRENT MILEAGES WERE 94,000.",
        "vin": "1C3EL65R63N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/09/2008",
        "dateOfIncident": "10/06/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244978,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A 2003  CHRYSLER SEBRING WITH A 2.7 LITER ENGINE.     I BROUGHT THE CAR TO A CHRYSLER REPAIR SHOP WHEN IT WOULDN'T START, THEY SAID IT NEEDED A NEW BATTERY (THE BATTERY IN IT WAS A FEW MONTHS OLD) AND A NEW STARTER. I BORROWED THE MONEY TO PAY FOR THEM TO FIX IT. THEN AFTER DRIVING THE CAR ABOUT 15 MILES WHEN I GOT IT BACK, AND WITHOUT ANY WARNING OR PREVIOUS SYMPTOMS THE CAR ENGINE BLOWS.     THE CHRYSLER SHOP ACCUSES ME FALSE ALLEGATIONS OF NEVER CHANGING THE OIL. I PROVED IT WAS CHANGED ON A REGULAR BASIS. THEY SAY IMPROPER MAINTENANCE CAUSED \"ENGINE SLUDGE\" WHICH THE CAUSED ENGINE TO FAIL. THE CAR ALWAYS RAN QUITE AND COOL, BUT WHEN IT FAILED AND I GOT IT TO START AFTER 3 ATTEMPTS, IT MADE A LOUD CLUNKING NOISE, THE TEMPERATURE GAUGE WAS ALL THE WAY UP (WHICH NEVER HAPPENS) AND THE ENGINE WAS BOILING HOT.      THEY NOW SAY THEY NEED AN INSPECTOR FROM MY WARRANTY PEOPLE TO COME INSPECT AND \"DIAGNOSE\" THE ENGINE. THEY SAY THAT COST IS NOT COVERED TO BREAK DOWN AND OPEN THE ENGINE FOR INSPECTION AND IT COSTS SEVERAL THOUSAND DOLLARS. THEN IF THEY DO NOT COVER IT, I'LL NEED TO PAY AGAIN TO PUT THE BROKEN ENGINE BACK TOGETHER FOR ANOTHER FEW THOUSAND DOLLARS, AND ADDITIONALLY AND ABOVE THAT COST, THE COST TO REPAIR THE ENGINE THEY SAY IS $10, 000.     CHRYSLER PRETENDS THERE HAS BEEN NO KNOWN ISSUES WITH THIS ENGINE BUT A GOOGLE SEARCH OF \"CHRYSLER 2.7 ENGINE DEFECTIVE\" PROVES OTHERWISE. MILLIONS OF THEIR CARS HAVE THESE ENGINES AND THOUSANDS OF PEOPLE HAVE FILED COMPLAINTS ABOUT CHRYSLERS DENIAL OF THIS PROBLEM AND SYSTEMATIC COVER UP.    MY FIANCEE AND I JUST EVACUATED NEW ORLEANS DUE T HURRICANES GUSTAV. SHE IS DISABLED AND WE ARE ON THE VERGE OF BEING HOMELESS, THAT CAR WAS THE ONLY MEANS OF TRANSPORTATION FOR US AND FOR ME TO ATTEMPT TO EARN A LIVING. *TR",
        "vin": "1C3EL65R63N"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/29/2008",
        "dateOfIncident": "07/31/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243751,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHRYSLER SEBRING  HAS ISSUES WITH THE AIR BAGS AND A RUST PROBLEM WITH THE HOOD LATCH.   *NJ  THE CONSUMER STATED THE AIR BAG LIGHT STARTED TO BEEP SPORADICALLY AND THEN WOULD STAY ON ALL THE TIME. THE SEAT BELT TENSIONER WAS REPLACED, BUT THE PROBLEM CONTINUED. *JB",
        "vin": "1C3EL65R33N"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/08/2008",
        "dateOfIncident": "05/06/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241364,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING COUPE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHRYSLER SEBRING COUPE.  THE ENTIRE INSTRUMENT PANEL WAS WARPED AND THE PADDING WAS LOOSENED FROM THE PANEL.  THERE WAS NO PRIOR WARNING TO THIS DEFECT.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, BUT THEY WERE UNABLE TO DETERMINE THE CAUSE OF THE FAILURE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE CONTACT WAS CONCERNED OF THE POSSIBILITY OF THE AIR BAGS DEPLOYING.  THE FAILURE MILEAGE WAS UNKNOWN AND THE CURRENT MILEAGE WAS 108,000.",
        "vin": "4C3AG52H13E"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/21/2008",
        "dateOfIncident": "04/25/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239239,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 SEBRING LX MODEL, WITHIN THE FIRST YEAR OF OWNING IT, I WAS TURNING UP INTO A DRIVEWAY AND I HEARD A LOUD POP, THE CLOCK SPRING WENT IN THE STEERING WHEEL CAUSING THE HAZARD LIGHTS, SIGNAL LIGHTS AND CRUISE CONTROL TO BE INOPERATIVE.  THE DEALERSHIP THAT I PURCHASED IT FROM REPLACED IT UNDER WARRANTY. *TR",
        "vin": "1C3EL46R23N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/30/2008",
        "dateOfIncident": "07/01/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236368,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SEBRING REAR MOUNT ASSEMBLY FOR STRUT CRUMBLED WHILE DRIVING CAUSING BANGING NOISE IN REAR PASSENGERS SIDE. WAS TOLD BY MY DEALER THAT THOUSANDS OF REPLACEMENT PARTS ARE ON BACKORDER. WAS TOLD THAT PART MAY NOT BE AVAILABLE FOR SEVERAL WEEKS DUE TO MAKING THEM OUT OF STEEL AS THE ORIGINAL ALUMINUM ONES WERE BREAKING DOWN.  *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/02/2008",
        "dateOfIncident": "06/26/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233076,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOTH REAR (SUSPENSION) STRUT BRACKETS ON WIFE\"S 2003 CHRYSLER SEBRING BROKE,CAUSING THE COIL SPRING TO RUB INSIDE OF BACK TIRE.. CANNOT REPLACE BECAUSE OF THAT PART BACKORDER IN THE THOUSANDS....WHY?  *TR",
        "vin": "1C3EL56R43N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/22/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228694,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 CHRYSLER SEBRING.  WHILE DRIVING FROM MAINE TO SPRINGFIELD, MASSACHUSETTS AT 30 MPH, THE REAR STRUT ON THE PASSENGER SIDE FAILED.  THE VEHICLE DROPPED TO THE GROUND AND THE CONTACT HEARD A TERRIBLE NOISE.  THE SALES DEALER INFORMED HER THAT THE STRUT SHOULD NOT HAVE BEEN VISIBLE AND WAS MADE OUT OF ALUMINUM INSTEAD OF METAL.  THE FAILURE WAS NOT COVERED UNDER THE CONTACT'S WARRANTY AND SHE HAD TO PAY $130 FOR THE REPAIR.  THE MANUFACTURER HAS NOT BEEN NOTIFIED.  THE CURRENT MILEAGE WAS 76,000 AND FAILURE MILEAGE WAS APPROXIMATELY 75,500.   UPDATED 06/25/08 *BF",
        "vin": "1C3EL46X33N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/21/2008",
        "dateOfIncident": "02/07/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221969,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CHRYSLER 2.7L ENGINE FAILURE. REFUSAL OF CHRYSLER TO HONOR 7/70,000 DRIVETRAIN WARRANTY OR PURCHASED EXTENDED WARRANTY.  ENGINE SEIZED WITH NO WARNING LIGHTS. VEHICLE WAS STOPPED IMMEDIATELY AND TOWED. CHRYSLER IS FOLLOWING THE PATTERN STATED BY OTHER CUSTOMERS. NOT HONORING WARRANTY, THEN COMING BACK WITH A 50% OFFER WITH AN EXAGGERATED USED ENGINE PRICE. CAR HAS BEEN ON OUT OF SERVICE FOR 6 WEEKS.   *TR",
        "vin": "1C3EL55T83N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/07/2008",
        "dateOfIncident": "02/06/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LACK OF PASSENGER COMPARTMENT HEAT DURING VEHICLE IDLE.  *TR",
        "vin": "1C3EL75T23N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/11/2008",
        "dateOfIncident": "01/04/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214544,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING COUPE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A CHRY SEBRING 2003  CONCERNING ISSUE- ABLE TO TURN OFF THE CAR AND PULL THE KEY OUT OF IGNITION WHILE CAR IS STILL IN GEAR.  THIS HAPPENED ON SEVERAL OCCASIONS AND THE CAR ROLLED WHILE I WAS GETTING OUT. LUCKY THERE WAS NO INJURY INVOLVED BUT THIS IS VERY DANGEROUS AND COULD LED TO SERIOUS INJURY. THERE SHOULD BE A SAFETY FEATURE THAT DOES NOT ALLOW THE KEY TO COME OUT WHILE THE CAR IS STILL IN GEAR.  *TR",
        "vin": "4C3AG52H53E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/31/2007",
        "dateOfIncident": "10/01/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213232,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONNECTION FOR THE REAR WINDOW DEFOGGER HAS BROKEN 4 TIMES, FIXED 3 TIMES, AND HAVE BEEN TOLD BY THE DEALER THAT IT IS A KNOWN PROBLEM, BUT THEY CAN DO NOTHING BUT FIX IT AT OUR COST EACH TIME.  IT HAS BEEN RECONNECTED ONCE, AND   TWICE AT A COST OF JUST UNDER $100 EACH TIME.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/05/2007",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210903,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS RAINING OUT THE BRAKES ARE VERY INEFFECTIVE WHEN FIRST APPLIED. I JUST PUT IN A DATE IN THE INCIDENT DATE FIELD. IT HAPPENS EVERY TIME IT IS RAINING OR THE ROAD IS WET.  *TR",
        "vin": "1C3EL46X73N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/20/2007",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209509,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE CAR JUST STOPPED AT 41,000 (EST) WITH NO WARNING.  *TR",
        "vin": "1C3EL56R74N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/17/2007",
        "dateOfIncident": "03/06/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190992,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CLOCKSPRING THAT CONTROLS THE AIRBAG INSIDE THE STEERING COLUMN OF  THE  2003 CHRYSLER SEBRING BROKE IN COLD WEATHER, RENDERING THE AIRBAG INOPERABLE.  IDENTICAL PROBLEMS IN EARLIER CHRYSLER MODELS PROMPTED RECALLS OF THIS PART, BUT CHRYSLER HAS NOT REACTED TO THE SAME POTENTIAL DEADLY PROBLEM FOR THIS MODEL YEAR VEHICLE.*AK",
        "vin": "1C3EL55T73N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/06/2007",
        "dateOfIncident": "01/31/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181804,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAG LIGHT ON, HORN AND CRUISE CONTROL DO NOT WORK.... CAUSE BROKEN CLOCKSPRING. *JB",
        "vin": "1C3EL55T73N"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/21/2006",
        "dateOfIncident": "11/21/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173933,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHEN THE CONVERTIBLE TOP WAS RETURNED TO AN UPRIGHT POSITION, THE REAR DEFROSTER WIRE WAS PULLED OUT OF PLACE.  THIS RESULTED IN THE REAR DEFROSTER BEING INOPERABLE UNTIL THE VEHICLE WAS TAKEN TO THE DEALER FOR RECONNECTION.  THIS OCCURRED EVERY FALL.",
        "vin": "1C3EL45TX3N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/26/2006",
        "dateOfIncident": "09/06/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169321,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 25 MPH ON A STREET, THE VEHICLE STRUCK A SMALL POTHOLE, AND A BANGING NOISE WAS HEARD COMING FROM THE RIGHT REAR OF THE VEHICLE.  AN INDEPENDENT REPAIR SHOP INSPECTED THE VEHICLE, AND DETERMINED THE REAR SUSPENSION MOUNTING BRACKET WAS CORRODED AND NEEDED TO BE REPLACED.  ADDITIONALLY, THE MECHANIC DETERMINED THE CORROSION WAS DUE TO EXCESSIVE ROAD SALTS.  THE MANUFACTURER WAS NOTIFIED.",
        "vin": "1C3EL45T13N"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/01/2006",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167233,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE CHROME WHEELS BECAME CORRODED DUE TO THE WEATHER AND DAMAGED THE TIRES.  THE SERVICE DEALER DETERMINED THE PROBLEM WAS WEATHER RELATED AND COULD ONLY BE ADDRESSED BY CONTINUOUSLY ADDING AIR TO THE TIRES.  THE CONTACT EXPRESSED THAT AIR NEEDS TO BE ADDED TO THE TIRES ON A DAILY BASIS.",
        "vin": "1C3EL65R43N"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE,POWER TRAIN,VISIBILITY,STRUCTURE,SEATS,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/04/2006",
        "dateOfIncident": "06/01/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164462,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS STARTED EVEN BEFORE THE FIRST PAYMENT WAS DUE. THE TRANSMISSION WAS REPLACED TWICE AND STILL JOLTS WHEN DRIVING AND SLIPS OUT OF GEAR. ON THE THIRD OCCASION I WAS TOLD BY THE SERVICE MANAGER THAT IT IS NORMAL FOR THE SEBRING'S DRIVE THAT WAY AND IT WAS NOT FIXED.  OVER TIME THE FUEL PUMP HAS BEEN REPLACED THREE TIMES AND STILL HAS THE SAME PROBLEM. THE ROOF HAS LEAKED. THE DOORS SHAKE. AUTOMATIC WINDOWS DO NOT WORK PROPERLY. BOTH FRONT SEATS DO NOT LOCK INTO PLACE. THE KEY IS DIFFICULT TO REMOVE ON OCCASION. I HAVE HAD TWO ALIGNMENTS DONE BUT THE FRONT END SHAKES WHEN DRIVING AND HAS A RUBBING/GRINDING NOISE. THE CAR HAS 43,000 MILES AND I CONSIDER IT UNSAFE AND UNRELIABLE FOR LONG DISTANCES. *JB",
        "vin": "1C3EL45T83N"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/22/2006",
        "dateOfIncident": "06/22/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160415,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE VEHICLE HAS BEEN TO THE DEALERSHIP 10 TIMES BECAUSE THE AIR BAG LIGHT ILLUMINATES INTERMITTENTLY.  THE DEALERSHIP REPLACED THE AIR BAG MODULE, THE SEAT BELT, AND THE SEAT TRACK AND AFTER EACH REPAIR THE AIR BAG LIGHT ILLUMINATED AGAIN WITHIN TWO DAYS.  ONCE THE CONTACT HEARD A POPPING NOISE IN THE DASH AS THE LIGHT ILLUMINATED.  THE DEALERSHIP CANNOT DETERMINE THE REASON THE AIR BAG LIGHT CONTINUES TO ILLUMINATE.",
        "vin": "1C3EL65R93N"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/11/2006",
        "dateOfIncident": "05/10/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157252,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL PUMP FAILURE.  *NM",
        "vin": "1C3EL45T43N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "02/21/2006",
        "dateOfIncident": "02/21/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10150735,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE ENGINE WAS MAKING A CLICKING NOISE.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP.  THE DEALERSHIP DETERMINED THERE WAS SLUDGE IN THE OIL BECAUSE OF IRREGULAR MAINTENANCE.  THEREFORE, THE ENGINE NEEDS TO BE REPLACED.   WHILE THERE IS NOT CURRENTLY A PROBLEM WITH THE FUEL PUMP, THERE IS A NHTSA RECALL, # 03V443000, REGARDING THE FUEL PUMP.  HOWEVER, THE VEHICLE IS NOT INCLUDED DUE TO THE VIN.  THE CONTACT IS CONCERNED THE FUEL PUMP RECALL MAY BE RELATED IN SOME WAY TO THE SLUDGE BUILD UP PROBLEM.",
        "vin": "1C3EL55T93N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/30/2005",
        "dateOfIncident": "08/22/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134849,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM A 2003 CHRYSLER SEBRING OWNER WITH A 2.7L ENGINE, RIGHT AFTER I BOUGHT IT OF THE LOT PRE-OWNED IT HAD TO BE BOUGHT BACK TO GET CHECKED OUT BECAUSE THE ENGINE LIGHT CAME ON A FEW TIMES AND THE WATER PUMP HAD TO BE REPLACED. WHILE ON THE HIGHWAY IT JUST SEIZED ON ME, TURNS OUT THAT A ROD BARRING  SPUN IN THE ENGINE COMPLETELY TOTALING THE ENGINE AND FROM WHAT IM TOLD THE WATER PUMP AND A FEW MORE COMPONENTS NEED TO BE REPLACE BECAUSE OF THE ENGINE, GOT WORD FROM THE MECHANIC AT THE DEALERSHIP AND THERE WAS NO BUILD UP IN THE ENGINE THE OIL WAS WELL MAINTAINED BUT WAS UNABLE TO DETERMINE WHAT THE CAUSE WAS. I CONTACTED CHRYSLER AND SINCE IT FELL OUT OF WARRANTY BY 8,000 MILES THE ONLY THING THEY WOULD DO IS REPLACE IT WITH A REBUILT ENGINE AT THE COST OF $6,758.69 BUT ONLY WOULD PAY 50% OF THAT COST.  I TOLD THEM ITS CLEARLY A DEFECT IN THE ENGINE AND I SHOULDN'T HAVE TO PAY ANYTHING BUT THEY WILL ONLY DO 50% AND A REBUILT ENGINE.*JB",
        "vin": "1C3EL56T63N"
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/11/2005",
        "dateOfIncident": "08/11/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132503,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 CHRYSLER SEBRING LX, I BOUGHT IT USED WITH 21,000 MILES IN MARCH OF 2004, NEARLY NEW RIGHT? SINCE THEN, I HAVE GONE THROUGH 2 SETS OF ROTORS AND PADS FOR THE FRONT, 1 SET OF TIRES, PASSENGER SIDE LOWER BALL JOINT, TOTALING OVER $700.00 FOR REPAIRS, THAT I PAID OUT OF MY POCKET. THE FAN KNOB INSIDE THE CAR THAT CONTROLS THE SPEED OF THE HEATER FAN LABELED 1-4, NOW ONLY WORKS ON 3 AND 4. NOW THE LOWER TIE- ROD END ON PASSENGER SIDE IS  BAD OR MAKING A THUMPING NOISE. A NEARBY MECHANIC SAYS THAT  IT IS DRY AND NEEDS LUBRICATION BUT IS NOT ACCESSIBLE DUE TO CHRYSLER NOT PUTTING GREASE FITTINGS ON ANY OF THE IMPORTANT AREAS! I BROUGHT IT TO THE DEALERSHIP WHEN I FOUND IT WOULD COST $850.00 TO FIX. THERE MECHANICS SAY THAT THEY DON'T SEEM LOOSE AND NOTHING IS GOING TO FALL A PART, BUT JUST IN CASE, SINCE YOU CAN'T JUST REPLACE THE TIE-ROD END, YOU HAVE TO BUY THE WHOLE RACK AND PINION, SO THEY SUPPOSEDLY HAVE IT ON ORDER. THE DEALER SAYS IF IT HAS TO BE REPLACED AFTER THEY LOOK THE CAR OVER GOOD, THAT I WOULD HAVE TO PAY A $50.00 DEDUCTIBLE AND THE WARRANTY WILL COVER THE REST. I BOUGHT THIS CAR SINCE I HAVE ALWAYS BOUGHT DODGE/CHRYSLER VEHICLES ASSUMING IT WOULD BE A SAFE FAMILY CAR SINCE MY WIFE IS PREGNANT AND DUE IN NOVEMBER WHICH IS RIGHT AROUND THE CORNER! I HAVE HAD THE CAR LESS THAN A YEAR AND A HALF AND HAVE SUNK MORE MONEY IN IT THEN MOST VEHICLES 5 YEARS OR OLDER. I HAVE A LITTLE OVER 59,000 MILES ON IT WHICH WHEN I BOUGHT IT I GOT THE EXTENDED WARRANTY UP TO 75,000 MILES. AT THE RATE IT'S GOING, THE CAR WILL LUCKY TO MAKE IT THAT FAR. SAFETY IS MY MAIN CONCERN WHEN PURCHASING A VEHICLE, AND THIS CAR HAS PROVEN TO ME THAT IT IS A LEMON DUE TO THE FRONT END PROBLEMS AND IS A HAZARD TO MY FAMILY AND I. PLEASE CONTACT ME WITH ANY QUESTIONS YOU MAY HAVE. I AM LOOKING FORWARD TO HEARING BACK FROM YOU.  *NM",
        "vin": "1C3EL46R83N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/10/2005",
        "dateOfIncident": "08/04/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132241,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 CHRYSLER SEBRING WITH 4 CYLINDER ENGINE,AUTOMATIC TRANSMISSION AND CRUISE CONTROL. I PURCHASED THE VEHICLE USED IN MARCH OF 2005 WITH ABOUT 29,000 MILES ON THE ODOMETER.  IT CURRENTLY HAS 39,000 MILES. ON A TRIP THROUGH MARYLAND AND WEST VIRGINIA ON AUGUST 4TH,2005, I EXPERIENCED A TERRIFYING EXPERIENCE. WITH THE CRUISE CONTROL SET AT 65 MPH, I WAS TRAVELING ON THE INTERSTATE DOWN A 6 TO 8 % GRADE. THE CAR WOULD DOWN SHIFT THE TRANSMISSION AND ACCELERATE. WHEN THE SPEEDOMETER REACHED 75 MPH, I SHUT OFF THE CRUISE AND THE CAR WOULD UPSHIFT BACK TO HIGH GEAR AND WITH BRAKING I WAS ABLE TO REGAIN CONTROL OF THE SPEED OF THE CAR. I WAS ABLE TO DUPLICATE THIS ACTION WITH THE CAR UNTIL I TRAVELED ON INTERSTATE ROADS WITH 3% GRADES OR LESS,THEN THE CRUISE WORKS FINE.  I TOOK THE CAR TO NORTH EAST DODGE ,MAIN STREET,NORTH EAST,PA. 16428 ON AUGUST 8TH,2005 AND EXPLAINED THE CONCERNS ABOUT THE CRUISE CONTROL.  AFTER CONFERRING WITH CHRYSLER CORPORATION,I WAS INFORMED THAT THERE WAS NOTHING WRONG WITH THE CAR EVEN THOUGH THEY WERE ABLE TO DUPLICATE THE PROBLEM.  THEY STATED THAT I SHOULD HAVE READ THE OWNERS MANUAL WHICH( I AM PARAPHRASING HERE) STATES NOT TO USE THE CRUISE CONTROL UNLESS IT IS A SUNNY,DRY DAY AND THE HIGHWAY IS FLAT.  IN OTHER WORDS,CHRYSLER SAYS I SHOULD HAVE READ THE OWNERS MANUAL BEFORE I BOUGHT THE CAR AND IF I DON'T LIKE THE IDEA OF THE CAR GOING OUT OF CONTROL DOWN STEEP ROADS, THEN DON'T USE THE CRUISE CONTROL. BECAUSE CHRYSLER CORPORATION PUTS A DISCLAIMER IN THEIR OWNERS MANUAL ABOUT THEIR SELLING THE PUBLIC AN UNSAFE PRODUCT SHOULD NOT ABSOLVE THEM OF THE RESPONSIBILITY OF CORRECTING IT.  *NM",
        "vin": "1C3EL46X83N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/09/2005",
        "dateOfIncident": "08/08/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132039,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2003 CHRYSLER SEBRING.  THE CAR IS A 4 CYCLE AUTOMATIC WITH AIR CONDITIONER AND CRUSE CONTROL.  WHILE DRIVING  UP A 6% GRADE, AND  WHEN GOING DOWN THE  HILL TRANSMISSION  DOWN SHIFTED AND THE CAR  ACCELERATED  15-20 MILES FASTER THAN WHAT THE CRUISE WAS SET AT.   CALLED THE MANUFACTURER,  AND THEY STATED THAT THIS WAS ACCEPTABLE TO THEM.  THE OWNER'S MANUAL STATES THAT CERTAIN CONDITIONS MUST BE MET FOR THE CRUISE TO FUNCTION IN A SAFE MANNER.  *AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2005",
        "dateOfIncident": "07/22/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129773,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT HAS COME ON WHILE DRIVING MANY TIMES OVER THE PAST TWO YEARS.  I HAVE TAKEN THE CAR TO THE DEALER SEVERAL TIMES.  EACH TIME THE DEALER STATED THAT THERE WASN'T A CODE STORED AND THAT THEY COULD NOT GET THE AIRBAG LIGHT TO COME ON.  FINALLY, IN LATE JUNE OF THIS YEAR THE LIGHT CAME ON AND STAYED ON, I TOOK THE CARN TO THE DEALER AND THEY SAID THE SEAT BELT TENSIONER NEEDED TO BE REPLACED.  WHEN I PICKED UP THE CAR AFTER HAVING THE SEAT BELT TENSIONER REPLACED THE LIGHT WA OFF.  NOW, LESS THAN A MONTH LATER THE AIRBAG LIGHT IS ON AGAIN.  CURRENTLY THE VEHICLE IS UNDERN WARRANTY, BUT THE WARRANTY WILL BE UP IN A COUPLE OF MONTHS.  I CAN'T SEEM TO GET THIS PROBLEM FIXED, AND I DO NOT FEEL SAFE DRIVING THIS VEHICLE.",
        "vin": "1C3EL45X23N"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/19/2005",
        "dateOfIncident": "06/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129275,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 CHRYSER SEBRING LXI ,4 DOOR, V6 MOTOR  CRUISE CONTROLS SHUT DOWN WITHOUT WARNING. CAUSING A SUDDEN DECELERATION IN HIGHWAY SPEED AND NEARLY REAREND COLLISIONS.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "04/21/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT  CONSUMER STATES WHEN THE BRAKE WAS PRESSED, THE CAR ACCELERATED AND CAUSED THE VEHICLE TO CRASH.  *TT    DEALER WAS UNABLE TO DUPLICATE CONCERN.   *TT  *NM",
        "vin": "4C3AG42GX3E"
    },
    {
        "components": "SUSPENSION,FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/06/2005",
        "dateOfIncident": "02/03/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111653,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE'S ROOF LEAKED, THE WINDOWS SHOOK, AND THE STEERING WHEEL  RUBBED.  THEN, THE WHEEL BEARINGS WENT OUT, THE DRIVER'S DOOR WAS LOOSE, AND GAS GAUGE BROKE.  ALSO, THE SUSPENSION WAS DEFECTIVE.   *AK   THE STEERING RACK WAS REPLACED, BOTH DOOR PANELS WERE REPLACED, THE REAR WINDOWS WOULD SHAKE WHEN OPENED AND CLOSED, THE REGULATOR CABLE WAS KNOTTED, THE LEFT 1/2 REGULATOR WAS REPLACED, THE FRONT TIRES WERE RUBBING, THE FRONT END DISPLAYED A CLUNKING NOISE, THE BACKING PLATE WAS BENT, THE KEY DID NOT COME OUT AT TIMES, BUT NO REPAIR WAS NEEDED AT THE TIME, THE CHECK ENGINE LIGHT STAYED ON, A TIRE BLEW OUT AND THE WHEEL BEARINGS WERE REPLACED.  THE FUEL SENDING UNIT VOLTS WERE TOO HIGH PER ENGINE LIGHT AND THE FUEL GAUGE WAS NOT MOVING.  WIRING WAS FOUND OPEN IN THE FUEL PUMP MODULE WHICH WAS REPLACED.   *SC",
        "vin": "1C3EL75T13N"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/30/2005",
        "dateOfIncident": "01/04/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117090,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING OVER A SPEED BUMP IN COLD WEATHER CONSUMER HEARD A RATTLING NOISE COMING FROM THE FRONT END.  DEALERSHIP INFORMED THE CONSUMER THAT  FRONT UPPER CONTROL ARM PREMATURELY WORE OUT.  *AK",
        "vin": "1C3EL46X53N"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/12/2005",
        "dateOfIncident": "01/02/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114004,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 CHYRSLER THAT HAS BEEN BROUGHT IN TWO TIMES TO ADDRESS A PROBLEM WITH THE CAR NOT DRIVING SMOOTHLY. IT BEGUN BY ACTING AS THOUGH IT WAS STALLING ONLY IN REVERSE. IT THEN BECAME EVEN WHEN MOVING FORWARD AT LOW SPEEDS TO NOW WHEN ON THE FREEWAY AT 60MPH IT DOES THIS. I HAVE TAKEN IT IN TO THE DEALERSHIP WHO FIRST TIME TOLD ME THEY COULD NOT PINPOINT THE PROBLEM TO KEEP DRIVING IT TILL IT GOT WORSE. WELL, IT DID. I TOOK IT BACK AGAIN AND THIS TIME THEY TOLD ME THAT IT JUST NEEDED A TUNE-UP AND A FUEL INJECTION CLEANER BUT COULDN'T BE CERTAIN WHETHER OR NOT THAT WOULD FIX MY TRUE PROBLEM. SO WHY AM I GOING TO PAY FOR SOMETHING THAT COULD CORRECT MY PROBLEM. I WAS TOLD THAT I HAD TWO PROBLEMS AND THAT I NEEDED THIS TUNEUP.WHEN I INQUIRED WHAT MY SECOND PROBLEM WAS HE STATED HE DIDN'T KNOW, BUT I HAD ONE. WELL,  I HAD PREVIOUSLY ALREADY HAD A TUNE UP SO I KNEW THAT WAS NOT THE RESOLUTION. I HAD ANOTHER MECHANIC LOOK AT IT AND HE COULDN'T PINPOINT MY PROBLEM EITHER. SO HERE I AM DRIVING AROUND IN A CAR THAT MAY OR MAY NOT BREAK DOWN AND HAVE 3 KIDS. THIS IS A GREAT SITUATION FOR SOMEONE.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/24/2005",
        "dateOfIncident": "01/24/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108727,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SHIFT INTERLOCK ON THE VEHICLE WAS STUCK.  THE CONSUMER WAS UNABLE TO DRIVE THE VEHICLE.   THE MANUFACTURER OFFERED NO ASSISTANCE.   *JB",
        "vin": "1C3EL46X73N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/13/2004",
        "dateOfIncident": "07/26/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083589,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED AND APPLYING THE BRAKES VEHICLE TOOK LONGER TO STOP AND MADE NOISE.   VEHICLE WAS TAKEN TO  DEALERSHIP, AND MECHANIC REPLACED FRONT ROTORS WHICH WORE PREMATURELY AT 12,649 MILES. REPLACEMENT WAS AT CONSUMER'S EXPENSE.  *AK",
        "vin": "1C3EL56TX3N"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2004",
        "dateOfIncident": "05/28/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074561,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING COUPE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT A 2003 SEBRING EXACTLY TWO MONTHS AGO, AND PRIOR TO SIGNING THE PAPERS TO SEAL THE DEAL, I HAD THE DEALERSHIP CHECK OUT THE REASON THERE WAS NO STEREO, INTERIOR LIGHTS, TRUNK LIGHTS AND WHY THE KEYLESS ENTRY DID NOT WORK WHEN I TEST DROVE THE CAR. THEY CAME BACK TO EXPLAIN THAT THE \"FUSE HAD BLOWN\" THEY \"FIXED IT\" AND ASKED ME TO DRIVE THE CAR HOME THAT NIGHT, AND TO BRING IT BACK THE NEXT DAY FOR FURTHER EVALUATION. THE NEXT DAY, I DROPPED THE CAR OFF AT 4PM, AND THE CAR STAYED OVERNIGHT- THE NEXT DAY I DROVE THE CAR HOME (WITH LESS THAN A HALF OF TANK OF GAS,  AND IT WAS FULL WHEN I TOOK IT THERE) PARKED IT IN MY DRIVEWAY, AND TWO HOURS LATER WENT TO GO PICK UP MY SISTER FROM SCHOOL, AND THE KEYLESS ENTRY AGAIN DID NOT WORK, I UTILIZED MY KEY, AND WHEN I STUCK IT IN THE IGNITION- THE ALARM SOUNDED, AND THE RADIO DID NOT WORK, NO INTERIOPR LIGHTS, NO TRUNK LIGHTS, THE LOCKS DID NOT WORK AT ALL- AND IT WAS CHAOS. I HAD THE CAR TOWED TO THE DEALERSHIP, AND LEFT FOR SEVERAL DAYS TO AGAIN \"FIX IT.\" I GOT THE CAR BACK, AND NOW, EXACTLY TWO MONTHS LATER, THE SMELL OF BURNT PLASTIC IS AGAIN AN AROMA IN MY CAR, I HAVE NO KEYLESS ENTRY, NO RADIO, NO INTERIOR OR TRUNK LIGHTS, NO LOCKS- AND WHEN I CALLED THE \"FIVE STAR DEALERSHIP\" THEY SAID THEY COULDNT SEE ME FOR FOUR DAYS! DO THEY REALIZE I HAVE TO COMMUTE TWO HOURS DAILY WITH THE HOPES THAT NOTHING ELSE ELECTRICAL FAILS IN MY CAR WHILE I WAIT FOR \"CUSTOMER SERVICE.  *AK",
        "vin": "4C3AG42G93E"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/17/2003",
        "dateOfIncident": "12/17/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050637,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER'S SEAT BELT ANCHOR BROKE OFF IN DRIVER'S HAND WHILE BUCKLING SEAT BELT. THE ANCHOR CAME COMPLETELY OFF THE CAR. THIS IS OBVIOUSLY A SAFETY HAZARD, SINCE THE SEAT BELT IS NOW UNUSABLE, AND WHAT'S MORE, HAD BEEN OFFERING NO PROTECTION FOR SOME TIME, WHILE APPEARING TO BE INTACT. MILEAGE ON CAR IS 34,500 MILES. BREAKAGE OCCURRED IN STRANDED METAL BETWEEN THE BUCKLE RECEPTACLE, AND THE BASE OF THE ANCHOR. THIS LOOKED LIKE A METAL-FATIGUE TYPE OF PROBLEM WHERE INDIVIDUAL STRANDS OF THE STRANDED CABLE HAD WEAKENED AND BROKE OVER TIME.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/24/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041831,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CREATURES ARE ABLE TO GET INTO THE HEATER BLOWER FAN AND TO CONTAMINATE IT. WHEN THIS OCCURS  HEATER BLOWER BECOMES INOPERATIVE.  DEALERSHIP OR MANUFACTURER IS UNABLE TO PROVIDE A SOLUTION FOR THE PROBLEM.*AK       *TS",
        "vin": "1C3EL46T13N"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/23/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032326,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING CONVERTIBLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WERE PROBLEMS WITH THE WHEEL BEARING AND BRAKE CALIPER BOLTS FALLING OUT.  (IT WAS A NEW VEHICLE) THE MANUFACTURER WAS CONTACTED BY MAIL AND THE CONSUMER HAD NO RESPONSE.  THE DEALER WAS CONTACTED AND STATED THERE WAS NO EXPLANATION AS TO WHY THIS HAPPENED TO THE VEHICLE.   *AK   THERE WAS A HUMMING NOISE COMING FROM THE FRONT END AND THE TRANSMISSION HAD BECOME INOPERATIVE.   *SCC   *JB",
        "vin": "1C3EL65R23N"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/06/2003",
        "dateOfIncident": "07/03/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042383,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HEADLIGHTS INTERMITTENTLY START TO FLICKER, THEN SLOWLY FADE OUT.  AFTER A FEW MINUTES, HEADLIGHTS WILL COME BACK ON AS IF NOTHING EVER HAPPENED.  THIS PROBLEM  OCCURRED ON MANY OCCASIONS IN THE LAST FEW MONTHS.  *AK",
        "vin": "1C3EL46T03N"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,INTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/01/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042046,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE LOST POWER WHICH CAUSED INTERIOR AND EXTERIOR LIGHTS NOT TO FUNCTION.  ALSO, DRIVER NOTICED THAT WHEN TAPPING ON THE BRAKE PEDAL  BRAKES LOCKED, CAUSING  VEHICLE TO COME TO A SUDDEN STOP.  DEALER COULD NOT DUPLICATE OR DETERMINE THE CAUSE OF THE PROBLEM.  *AK",
        "vin": "1C3EL46X23N"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/29/2003",
        "dateOfIncident": "05/06/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031433,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHEN IT RAINS  THERE WOULD BE STANDING WATER IN VEHICLE. DEALER NOTIFIED.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/02/2003",
        "dateOfIncident": "06/02/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10022046,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING ON HIGHWAY AND WITHOUT PRIOR WARNING ANOTHER VEHICLE HIT  CONSUMER'S VEHICLE. UPON IMPACT, DRIVER'S SIDE AIR BAG EXPLODED AND CHEMICAL CONTENT CAME OUT ONTO  DRIVER'S FACE.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/14/2003",
        "dateOfIncident": "01/01/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007505,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE WAS A GRINDING NOISE COMING FROM THE REAR WHEELS.*JB",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/30/2003",
        "dateOfIncident": "01/28/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005998,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT ANY SPEED THE ENGINE WILL STAY ON THE REMAINDER OF THE TIME VEHICLE IS BEING OPERATED. DEALER NOTIFIED.      TS",
        "vin": "PLEASE PROV"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/21/2003",
        "dateOfIncident": "12/26/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 10003146,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "CHRYSLER",
                "productModel": "SEBRING",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2003 CHRYSLER SEBRING ON NOV 11, 2002. ON DEC. 26, 2003 I WAS DRIVING HOME AT ABOUT 0730. MY CAR SUDDENLY PULLED TO THE LEFT, LIKE A MAGNET WAS PULLING . I HAD NO CONTROL OF THE STAIRING, I TRIED TO SLOW THE CAR DOWN BY DOWN SHIFTING THE GEARS. THE ONLY THING THAT BROUGHT THAT CAR TO A STOP WAS THE CURVE ON THE OTHER SIDE OF THE ROAD. THIS WAS RIGHT BEFORE THE CURVE. THE MANUFACTURE WAS NASTY. MY INSURANCE STATED, \"THERE WAS A COMPLETE BRAKE IN THE RACK AND THAT IT WAS UNLIKELY CAUSED BY COLLISION. THIS BREAK CAUSED THE COLLISON.  THEIR WAS NO BODY DAMAGE OR NO TIRE DAMAGE TO THE CAR ACCORDING TO YHE COLLION PEOPLE. HOWEVER , SINCE I DID HIT THE CURVE , THE DEALER DECIDED TO TOW THE CAR  COLLSION PLACE. MY CAR WAS HEALED UP FOR 22 DAYS. THE MANUFACTURE PULLED THE RACK OUT OF THE STAIRING COLUME.,TO INVESTAGATE. THEY SAID THEY COUD NOT TELL WHETHER OR NOT WHO FAULT IT WAS. THEY SAID THEY WOUL FIX THE PROBLEM FOR A GOOD WILL GESTURE. I WANT A NEW CAR. THE ACCIDENT WAS VEY TRAMATIC. I AM AFRAID TO DRIVE THIS CAR. I WILL GO TO THE MEDIA IF I HAVE TO. I NEED HELP! WHAT CAN I DO.",
        "vin": "1C3EL46XX3N"
    }
]