[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/24/2021",
        "dateOfIncident": "03/23/2021",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404631,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING DOWN THE HIGHWAY AT REGULAR SPEED AND ENGINE COMPRESSION SHUT DOWN AND VEHICLE STALLED, AS I BARELY COASTED OFF TO THE SIDE OF THE HIGHWAY, AS THIS SITUATION WAS VERY DANGEROUS..",
        "vin": "1D4GP45323B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/15/2021",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11403052,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN. THE CONTACT STATED WHILE DRIVING AT 25 MPH, THE POWER STEERING STARTED TO FAIL WHICH MADE THE VEHICLE DIFFICULT TO STEER. THE CONTACT STATED NO WARNING LIGHT WAS ILLUMINATED. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED WITH THE UPPER POWER STEERING COOLER HOSE NEEDING TO BE REPLACED. THE CONTACT RELATED THE FAILURE TO NHTSA CAMPAIGN NUMBER: 04V386000 (STEERING) WHICH WAS PREVIOUSLY PERFORMED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER HAD NOT BEEN INFORMED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 108,000.",
        "vin": "1D4GP25373B"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/12/2020",
        "dateOfIncident": "01/21/2020",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11308740,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AND HIT A POT HOLE AND THE REAR AXLE BROKE CAUSE BY CHEAP DESIGN REAR AXLE SUPPORT. AFTER CHECKING OUT YOU TUBE IT IS E COMMON PROBLEM WITH DODGE AND CHRYSLER VANS. IF THIS HAPPENED ON THE HIGHWAY ONE CAN END UP UNDER A 18 WHEELER.",
        "vin": "1D4GP25313B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/31/2018",
        "dateOfIncident": "05/31/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11099032,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN. WHILE DRIVING 15 MPH AND ATTEMPTING TO MAKE A RIGHT OR LEFT TURN, THE STEERING WHEEL BECAME DIFFICULT TO MANEUVER. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE DEALER AND MANUFACTURER WERE NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/28/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11065549,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REFUELING ENGINE DIES WHEN PULLING OUT IN TRAFFIC.  HAPPENED LAST THREE TIMES AFTER REFUELING.",
        "vin": "2D4GP24343R"
    },
    {
        "components": "STEERING,POWER TRAIN,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/19/2018",
        "dateOfIncident": "06/10/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11063819,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD ALREADY SENT INFO TO DOL (BELOW) ON 03 CARAVAN I FROM UNLICENSED DEALER MICHAEL RANKIN. PLEASE SEE COMPLAINT FORM INATTACHMENT -IT'S TOO LONG TO ADD.    THEY'RE IN PROCESS OF CHARGING MICHAEL RANKIN ON 12 COUNTS FOR DIFFERENT VEHICLES SOLD,AND ASESSING MONETARY FINES.  I HAVE DONE TRANSMISSION REPAIRS TO THIS POSTAL FLEET VEHICLE.ACCORDING TO EXPERIENCED MECHANISS AT 32,300 MILES THE TRANSMISSION HAD ALREADY BEEN REBUILT -IMPROPERLY. I'M COMPLAINING BECAUSE I WAS STUCK ON FAST MOVING ARTERIAL WITH LEAKING TRANSMISSION (UNSAFE CONDITION) BECAUSE OF IMPROPER REPAIRS ,AND COULD NOT MOVE THE VEHICLE IN CONJESTED TRAFFIC   1621-72ND ST EAST,TACOMA,WA 98404.  VEHICLE WAS STATIONARY AT THAT MOMENT AND AT ANOTHER DIFFERENT TIME WHEN DRIVING.THIS IS THE UNSAFE PART.   THE MECHANIC CHARGED ME APPROXIMATELY $1500 AND ALSO TOLD ME IT HAD TRANSMISSION ALREADY REBUILT AND (4) LOOSE BOLTS ON PUMP SEAL,   ALSO HAD A \"PRE OWNED\" USED? WRECKING YARD TORQUE CONVERTER WHICH WAS PAINTED BLACK INDICATING THE REBUILD OCURRED.   HE ALSO STATED HOW THE 2 FRONT HALF SHAFTS (AXELS) WERE WORN OUT AND I HAD TO REPLACE THOSE, ABOUT $250.   IT HAS BAD POWER STEERING PUMP-AND GROANING NOISES CURRENTLY (UNSAFE CONDITION) JUST LIKE WHEN I GOT IT (32.3K MILES) VEHICLE HAS A BAD AIR CONDITIONER NOT UNSAFE.   *I HAVE JPEG PHOTOS AND RECEIPS FOR PARTS,AXELS, TRANSMISSION REPAIR AND FLUID I HAD TO BUY TO KEEP FLUID IN TRANSMISSION.  PLEASE SEE ATTACHMENT FOR COMPLAINT SENT TO WASHINGTON DOL , JOSH IS THE CONTACT.",
        "vin": "1D4GP21373B"
    },
    {
        "components": "ELECTRICAL SYSTEM,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2017",
        "dateOfIncident": "01/23/2017",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10978732,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL WIRING HARNESS IS TO CLOSE TO EXHAUST CAUSED MELTING OF WIRES WHILE GOING DOWN THE ROAD. I NOTICED A BURNING SMELL IN THE CABIN OF CARAVAN. IT HAPPENED APPROX. A MILE FROM MY HOUSE AT APPROX 45MPH AND A STRONG ODOR OF GAS WAS NOTICEABLE. THIS IS A SERIOUS ISSUE THAT NEEDS TO BE CORRECTED. VEHICLE BEGAN TO STALL COMING UP DRIVE WAY. WE STILL HAVE THE CARAVAN BUT HAVE PARKED IT. WE BELIEVE WHEN THE MELTING OCCURRED IT  CAUSED OTHER POSSIBLE ISSUES AND ARE SCARED TO HAVE IT FIXED, NOT KNOWING WHAT OTHER ISSUES THIS MAY HAVE CAUSED THAT WE WILL NOT KNOW UNTIL WE ARE GOING DOWN THE ROAD, IT'S NOT A RISK I'M WILLING TO TAKE...ESPECIALLY WITH GAS BEING FLAMMABLE AND SHORTENING OF FUEL ELECTRICAL WIRES. THAT'S A FIRE IN THE MAKING, IT'S NOT  WORTH RISKING OUR LIVES OR ANYONE ELSE'S ON ROAD. I HAVE SEEN SEVERAL OTHER COMPLAINTS ON REVIEW PAGES AND MECHANICS BLOGS/POSTS. THIS SEEMS TO BE A CONTINUING ISSUE THAT HAS NOT BEEN ADDRESSED. I HAVE SEEN THAT OTHER YEAR MODELS WERE RECALLED DUE TO THE SAME ISSUE BUT NOT THE 2003 DODGE CARAVAN SPORT. CAN YOU PLEASE INVESTIGATE THIS MATTER? IT COULD BE A SIMPLE FIX BY MOVING WIRES AWAY FROM EXHAUST BUT YOU ARE UNAWARE THAT, IT'S A ISSUE, UNTIL IT HAPPENS. BECAUSE IT NOT A VISIBLE HARNESS THAT YOU CAN SEE JUST BY RAISING HOOD.IT'S ONLY WHEN YOU HAVE PROBLEMS THAT YOU REALLY GET TO LOOKING AND THAT'S WHEN YOU SEE IT MELTED AND BURNED WITH STRONG ODOR COMING OUT FROM UNDER HOOD WHEN WE CHECKED IT. ALSO CATALYTIC CONVERTER WAS HOT THIS SHOULD NOT BE A CONSUMER EXPENSE WHEN IT HAPPENS. DUE TO WIRES TO CLOSE TO EXHAUST IT SEEMS TO BE A ISSUE FOR DODGE, SINCE THIS IS DUE TO THEIR FAULT AND NOT THE CONSUMER, DODGE SHOULD BE HELD ACCOUNTABLE FOR COST WHEN FUEL HARNESS WIRES MELTS AND ANY FURTHER DAMAGE CAUSED BY THE WIRES SHORTENING OUT . THIS IS A DANGEROUS/SERIOUS ISSUE THAT I HOPE CAN BE ADDRESSED SOON...BEFORE A LIFE IS LOST.",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/31/2017",
        "dateOfIncident": "03/01/2017",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10969672,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING DOWN THE ROAD   AIR BAG LIGHT CAME ON TOOK TO MIDDAS HAD INSPECTION $200 LATER LIGHT STILL ON NO ONE KNOWS WHY SCARED IT'S GOING TO BUST WAS ON A STRAIGHT ROAD NO BUMPS",
        "vin": "1D4GP24343B"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "06/08/2016",
        "dateOfIncident": "06/08/2016",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873338,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD TIRE SEPERATION ON A FIRESTONE SUPREME SI. I WAS TRAVELING 70 MPH ON THE HIGHWAY. THANKFULLY, NO ONE WAS INJURED AND THERE WAS NO ACCIDENT. THIS IS VERY DANGEROUS AND APPARENTLY HAPPENS QUITE FREQUENTLY. WHY HASN'T THIS ISSUE BEEN RESOLVED?",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/30/2015",
        "dateOfIncident": "07/30/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10744911,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN. WHILE DRIVING AT APPROXIMATELY 40 MPH, THE FRONT DRIVER SIDE WINDOW MADE A LOUP POPPING NOISE WHEN IT WAS BEING ROLLED UP. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, WHERE IT WAS DIAGNOSED THAT THE POWER WINDOW MECHANISM FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED. THE FAILURE RECURRED LATER AND THE WINDOW DROPPED DOWN INTO THE DOOR. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 98,000.",
        "vin": "1D4GP25363B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/07/2015",
        "dateOfIncident": "01/27/0201",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10733128,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CPSC: I1530226A. 2003 DODGE CARAVAN. CONSUMER STATED THE CAR AIR BAG DEPLOYED AND THE VEHICLE WAS NOT IN MOTION NEITHER DID IT HIT ANYTHING. *LN",
        "vin": "2D4GP44L53R"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "12/04/2014",
        "dateOfIncident": "01/04/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10662170,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I PUT THE KEY IN THE IGNITION SWITCH SOMETIMES IT WILL NOT TURN ALLOWING ME TO START THE CAR. WHEN I CALLED THE DODGE DEALER THEY SAID THAT THIS IS A COMMON PROBLEM. THEY TOLD ME TO INSERT THE KEY PULL IT TOWARDS ME THEN INSERT A FLAT HEAD SCREW DRIVER IN THE KEY AND TAP 2 TO 3 TIMES THEN TURN THE KEY. I WORKS LIKE THAT EACH TIME BUT THE SYMPTOMS MATCH THOSE DESCRIBED IN TV ADS PROMPTING DANGER OF HAVING THE ENGINE SHUT DOWN WHEN UNSUSPECTING AND CAUSING ACCIDENTS. WHAT CAN BE DONE?                                                                                                          [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1D4GP25R83B"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/06/2014",
        "dateOfIncident": "08/03/2014",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10619366,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE READ TIME AND TIME AGAIN ABOUT THE POWER TRAIN MODULE OR COMPUTER GOING OUT ON THE DODGE 2003 CARAVANS AND SHOULDN'T THIS BE A RECALL BY NOW?  THE VAN RUNS BEAUTIFUL BUT WILL STOP  AT ANY TIME WHILE DRIVING!  WHY DO WE HAVE TO WAIT FOR SO MANY PEOPLE TO DIE BEFORE IT IS A RECALL?  I WANT MY VAN FIXED BUT KNOWING THIS HAS BEEN AND STILL IS A PROBLEM WITH DODGE AND THEY SHOULD BE HELD ACCOUNTABLE!  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/13/2013",
        "dateOfIncident": "08/22/2013",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543535,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY CAR WHEN ALL OF A SUDDEN IT STARTED TO CHOCK LIKE IT WAS GETTING NO GAS I DECIDED TO TURN AROUND TO GO HOME BECAUSE I LIVE IN A RURAL AREA WITH NO CELL SERVICE WHEN I STOPPED TO TURN AROUND A MAN THAT WAS BEHIND ME CAME RUNNING OVER TO GET ME OUT OF THE CAR BECAUSE HE SAID IT WAS ON FIRE UNDER THE BACK DRIVERS SIDE I DIDN'T EVEN KNOW IT WAS ON FIRE IF IS WAS  NOT FOR HIM I COULD HAVE BEEN SEVERELY INJURED OR EVEN DIED THE CAR BURNED UP AND EXPLODED WITH IN TWO MINUTES OF ME GETTING OUT. THE CAR WAS FINE WHEN I STARTED IT THAT MORNING AND THE DAY BEFORE I DROVE IT ABOUT 100 MILES WITH NO PROBLEMS. I DON'T KNOW HOW THIS CAN BE A CAT SHOULD JUST NOT GO ON FIRE LIKE THAT. THE CAR HAD TO BE JUNKED BECAUSE THERE WAS NOTHING LEFT OF IT. I CONTACTED DODGE AND THEY SAID THERE WAS NOTHING THEY COULD DO FOR ME BECAUSE THE CAR WAS TOTALED. I HAD NO FIRE ON THIS CAR BECAUSE OF ITS AGE SO NOW I AM OUT A CAR THAT WAS IN VERY GOOD CONDITION AND I COULD HAVE HAD IT FOR MANY MORE YEARS. DODGE WILL NOT EVEN LOOK INTO THIS MATTER I HOPE THAT THIS DOESN'T HAPPEN TO SOMEONE ELSE BECAUSE THEY MIGHT NOT BE AS LUCKY AS ME TO GET OUT UNINJURED. CAN YOU PLEASE LOOK INTO THIS FOR ME I AM VERY UPSET WITH THIS AND AM WORRIED THAT SOMEONE IS GOING TO GET HURT SOMETHING IS NOT RIGHT WITH THIS CAR AND NOW I HAVE NO CAR AND CAN'T AFFORD TO BUY ONE NOW AND I LIVE 14 FROM THE NEAREST STORE.  *TR",
        "vin": "2D4GP24363R"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/19/2013",
        "dateOfIncident": "08/19/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536218,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING NORTHBOUND ON THE BALTIMORE WASHINGTON PARKWAY IN MARYLAND AT A CONSTANT SPEED IN A STRAIGHT AND LEVEL SECTION, THE DRIVER'S SIDE LOWER BALL JOINT STEM BROKE NEAR ITS BASE.  THE LEFT FRONT WHEEL IMMEDIATELY TURNED 90 DEGREES AND CAR SKIDDED TO AN ABRUPT STOP IN THE DRIVING LANE.  THERE WERE ABSOLUTELY NO WARNING SIGNS (NO NOISE, VIBRATION, HANDLING CHANGES, ETC.) BEFORE THE FAILURE.  ONLY BY LUCK WAS THERE NO ACCIDENT.  THE CAR HAD NO PRIOR ACCIDENT DAMAGE TO THE SUSPENSION AND NO PRIOR SERVICING (OTHER THAN ROUTINE MAINTENANCE - TIRE REPLACEMENT, BRAKE SERVICING, ETC.) HAD BEEN PERFORMED ON THE LOWER BALL JOINT OR NEARBY PARTS.  *TR",
        "vin": "1D4GP45363B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/20/2013",
        "dateOfIncident": "07/19/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525922,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HORN BLASTS, WIPERS TURN ON , WINDSHIELD WIPER FLUID SPRAYS, FOUR WAY FLASHERS TURN ON. LASTED 3 MINUTES THEN IT ENDS.  *TR",
        "vin": "1D8HN44H58B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/10/2013",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511399,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME IS DIFFERENT. ONE DAY THE HORN, LEFT DAYLIGHT, RIGHT BLINKER, RIGHT STOP LIGHT  DON'T WORK; NEXT DAY ALL WORK FINE, THEN NEXT DAY:  HORN, BLINKERS, LIGHT  STOP WORKING AGAIN....CHECK UP FUSES, CHANGED BULBS .  AND THIS GOES ON AND OFF......  *TR",
        "vin": "1D4GP25303B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/30/2012",
        "dateOfIncident": "11/09/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10486524,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVERS SIDE AIRBAG IS NONE FUNCTIONAL DO TO A FAULTY CLOCK SPRING.  *TR",
        "vin": "1D4GP25R93B"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/03/2012",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10478422,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SIDE SLIDING DOOR ON THE DRIVER'S SIDE WILL NOT UNLOCK WITH THE UNLOCK BUTTON NOR ARE YOU ABLE TO UNLOCK IT MANUALLY WITH THE CHILD SAFETY SWITCH OFF. THIS IS A SAFETY HAZARD AS YOU ARE UNABLE TO UNLOCK OR OPEN THIS DOOR IN AN EMERGENCY. THIS IS THE DOOR MY SMALL CHILD IS ACCESSED THROUGH. APPARENTLY IT IS A VERY COMMON ISSUE WITH THIS VEHICLE TOO!!! I CAN'T AFFORD TO HAVE A DEALER FIX IT. & THERE IS NO OTHER OPTION AVAILABLE.  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "07/26/2012",
        "dateOfIncident": "07/16/2012",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467845,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN. THE CONTACT CONFIRMED THAT THE DRIVER WAS TRAVELING 5-10 MPH WHEN THE BRAKES WERE DEPRESSED AND FAILED TO STOP HE VEHICLE. THE CONTACT CRASHED INTO THE FRONT OF ANOTHER VEHICLE. THERE WERE NO INJURIES AND THE POLICE WERE NOT CONTACTED. THE VEHICLE WAS TAKEN THE DEALER. THE DEALER CONFIRMED THAT THE REAR BRAKE AND MASTER CYLINDERS NEEDED TO BE REPLACED. THE MANUFACTURER WAS NOT CONTACTED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 100,000 AND THE CURRENT WAS 100,671.",
        "vin": "1D4GP44343B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/27/2011",
        "dateOfIncident": "11/01/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10441317,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT REMAINED ILLUMINATED. THE DEALER WAS CONTACTED AND ADVISED THE CONTACT THAT CLOCK SPRING FAILED AND WOULD NEED REPLACING. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND THE CURRENT MILEAGE WAS 100,700.  UPDATED 02/03/12*LJ  THE CONSUMER ALSO STATED THE HORN AND CRUISE CONTROL WERE INOPERATIVE, DUE TO THE DEFECTIVE CLOCK SPRING. UPDATED 02/10/12*JB",
        "vin": "1D4GP45303B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/04/2011",
        "dateOfIncident": "10/27/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434251,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS RAINING OR ROAD IS WET THERE IS A TENDENCY TO LOOSE CONTROL OF THE STEERING FOR A MOMENT , ONE TIME STEERING BECOME VERY STIFF CANNOT TURN RIGHT /LEFT , 2ND TIME WHILE DRIVING AT 40 MPH AND IT WAS RAINING COULD NOT CONTROL THE DIRECTION OF THE VEHICLE HEADING FOR 10 - 20 SECONDS, THIRD TIME REPEATED WHAT HAPPEN 2ND TIME ON SAT 29 NOV 2011. *TR",
        "vin": "1D4GP25373B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/15/2011",
        "dateOfIncident": "06/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10430297,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT BRAKE CALIPER HAS LOCKED UP REPEATEDLY AND CAUSES SEVERE HEAT BUILD IN THE FRONT WHEEL WHICH COULD CAUSE A FIRE AND THIS HAS ALSO HAPPENED TO MY BUDDY'S WIFE'S VAN TOO ALSO THE BACK BRAKES LOCK UP AFTER SITTING THE DEALERSHIP TOLD ME THIS IS COMMON IN DODGES. THIS HAS HAPPENED SEVERAL TIMES.  *TR",
        "vin": "1D8GP25R93B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/17/2011",
        "dateOfIncident": "07/25/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10419835,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN. THE CONTACT STATED WHILE TRAVELING 50 MPH THE ACCELERATOR WAS DEPRESSED, BUT THE VEHICLE FAILED TO MAINTAIN CURRENT SPEED. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC.  THE MANUFACTURER HAD NOT BEEN CONTACTED, AND THE VEHICLE HAD NOT BEEN REPAIRED. THE FAILURE MILEAGE WAS 95,968 AND THE CURRENT MILEAGE WAS  95,974.   UPDATED 9/13/11 *CN  THE CONSUMER STATED THE PROBLEM WAS WITH THE FUEL INJECTION HARNESS WHICH WERE BARE AND HITTING THE INTAKE MANIFOLD. ALSO, THE O2 SENSOR AND AC COMPRESSOR  NEEDS TO BE REPLACED.  UPDATED 10/31/11",
        "vin": "1D4GP25363B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/20/2011",
        "dateOfIncident": "12/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413824,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN.  THE CONTACT STATED THAT WHEN ADDING FUEL TO THE VEHICLE, GASOLINE WOULD SPILL OUT ONTO THE GROUND.  THE DEALER NOR MANUFACTURER WERE NOTIFIED OF THE FAILURE.  THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHO INSPECTED THE VEHICLE AND INFORMED THE CONTACT THAT THE CONTROL VALVE FOR THE EVAP HAD FAILED AND WAS NOT REPAIRABLE.  THE CURRENT MILEAGE WAS 130,000.  THE APPROXIMATE FAILURE MILEAGE WAS 120,000.  THE VIN WAS UNAVAILABLE. I THINK WE HAVE FIXED THE PROBLEM, WE MOVED THE VENT LINE OVER ABOUT 2\", DRILLED A HOLE IN GAS TANK THEN GLUED THE VENT LINE IN HOLE. SORRY TO HAVE BOTHERED YOU! TW  UPDATED 10/12/2011 *LN  *TR",
        "vin": "1D4GP24363B"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "03/16/2011",
        "dateOfIncident": "03/15/2011",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390414,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN ONLY EQUIPPED WITH 3 TETHER LATCHES. TWO ON THE 2ND ROW BUCKETS AND ONE IN THE MIDDLE OF THE REAR BENCH. IF A CHILD SEAT IS PLACED IN THE MIDDLE OF THE BENCH, YOU CAN NOT FIT ANOTHER CHILD SEAT BESIDE IT. IT IS NOT POSSIBLE TO LEGALLY AND SAFELY INSTALL MORE THAN THREE CHILD SEATS IN A 2003 CARAVAN.  *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/04/2011",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10380234,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER TIRE & RUBBER CO.",
                "productModel": "COOPER LIFELINER CLASSIC II",
                "productYear": "9999",
                "size": "225/60R16",
                "type": "Tire"
            }
        ],
        "summary": "15\" COOPER LIFELINER GLS TIRES OF VARIOUS AGES FROM NEW TO 2 YEARS OLD ARE CRACKING ON THE INSIDE EDGE NEAR THE RIM. WE HAVE APPROXIMATELY 38 TIRES SHOWING THIS CONDITION. WE HAVE PURCHASED NEW TIRES FROM ANOTHER COMPANY AS REPLACEMENTS. WE FEEL OBLIGATED TO LET PEOPLE KNOW AS WE FEEL THIS IS A SERIOUS SAFETY CONCERN.   [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6). *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "12/14/2010",
        "dateOfIncident": "11/12/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370628,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN POWER STEERING PROBLEM  WHEN COLD START THE CAR, THE POWER STEERING PUMP MAKES A WHINING NOISE. AT THE BEGINNING THE POWER STEERING IS SOLID HARD, SO I CANNOT TURN THE WHEELS. AFTER A MINUTE THE CAR STRUTS DRIVING NORMALLY. THE POWER STEERING PUMP WAS REPLACED BY CHRYSLER DEALERSHIP, BUT THE PROBLEM CAME BACK AFTER 2 YEARS AGAIN. WHEN YOU READ THE AUTOMOTIVE FORUMS FOR DODGE CARAVAN, A LOT OF PEOPLE HAVE THE SAME PROBLEM.  *TR",
        "vin": "1D4GP25R83B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/24/2010",
        "dateOfIncident": "10/22/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10362099,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN THE PARKING LOT OF A STORE I EXPERIENCED A TOTAL BRAKE PEDAL FAILURE. WHEN I APPLIED THE BRAKES THE VAN SIMPLY KEPT ON GOING.  I CHECKED FOR THE PEDAL AND COULD NOT SEE IT ANY LONGER. IT HAD PRACTICALLY DISAPPEARED - ONLY THE TOP OF THE PEDAL WAS VISIBLE AT THE FLOOR. AFTER TRYING TO STOP THE VAN WITH THE GEARS, I HIT THE EMERGENCY BRAKE AND CAME TO A STOP. THIS WAS A LIFE THREATENING SITUATION. THE CAR IS NOW AT THE SHOP. THE MECHANICS STATED THAT A SMALL PART NECESSARY FOR THE BRAKES TO FUNCTION WAS MISSING. APPARENTLY THE PART ONLY COSTS $12. IT HAS BEEN ORDERED AND WILL BE REPLACED SOON. *TR",
        "vin": "1D4GP25R63B"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/18/2010",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360894,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "TOURING T/A",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2003 DODGE CARAVAN. CONSUMER WRITES IN REGARDING TIRE INSTALLATION SERVICES AT SAM'S CLUB. *TGW  THE CONSUMER PURCHASED FIVE TIRES FROM TWO DIFFERENT LOCATIONS, BUT THE SAME COMPANY.  THE TIRES THAT WERE INSTALLED WERE BF GOODRICH P215/70R15 97T TOURING T/A PRO TIRES. A FEW DAYS LATER, THE CONSUMER NOTICED THAT ONE OF THE TIRES WAS IN FACT THE WRONG SIZE TIRE AND HAD AN INADEQUATE LOAD CARRYING CAPACITY FOR HIS VEHICLE.  HE ALSO NOTICED THE TIRES WERE ALMOST WORN OUT AND NEEDED TO BE REPLACED. THE CONSUMER STATED WITH THE TIRES WEARING OUT PREMATURELY, IT WAS A TESTAMENT THAT THE TIRES WERE INADEQUATE FOR HIS VEHICLE. *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/08/2010",
        "dateOfIncident": "06/20/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348021,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "03 DODGE CARAVAN WILL DIE FOR NO REASON WITH OUT NOTICE WEATHER YOU ARE IDLING OR GOING DOWN THE ROAD HAD BEEN BROUGHT TO DEALER WHERE IT WAS PURCHASED AFTER 8 DAYS THEY SAID THEY COULD NOT FIND ANYTHING THAT WAS WRONG WITH IT THAT I WOULD NEED TO HAVE IT TOWED OFF THE LOT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/10/2010",
        "dateOfIncident": "06/08/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342465,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS PEDAL GETS STUCK AND COMPRESSOR DOESN'T WORK CAUSING THE DEFROSTER NOT TO WORK. *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "06/15/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325198,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STARTED STALLING.  INTERIOR LIGHTS WOULD FLASH ON AND OFF, CAR WOULD DIE 15 SECONDS LATER. DIAGNOSED AS BODY CONTROL MODULE FAILURE. DUE TO CHRYSLER'S BANKRUPTCY PROBLEMS PART WAS NOT AVAILABLE FOR SIX MONTHS. HAD TO PURCHASE A JUNK PART AND HAVE PROGRAMMED AND PUT ON TO KEEP CAR RUNNING.  PART ALSO CONTROLS ODOMETER.... RAN MILEAGE UP TO 360,000 MILES FROM 64,000 MILES. *TR",
        "vin": "1D4GP25B33B"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/29/2010",
        "dateOfIncident": "03/22/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10322664,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE GRAND CARAVAN. THE DRIVER OF THE VEHICLE WAS A QUADRIPLEGIC WHO HAD A WHEELCHAIR INSTALLED IN THE VEHICLE BY MANUFACTURERS NAMED INDEPENDENT DRIVING VEHICLE. BRAUN, ANOTHER MANUFACTURER HELPED TO PRODUCE VEHICLE EQUIPMENT THAT WOULD ALLOW THE DRIVER TO SIT IN A WHEELCHAIR WHILE DRIVING. THE VEHICLE CRASHED AFTER HITTING A CURB AND DRIVING OVER AN ENTRAPMENT. AS A RESULT, THE DRIVER (THE QUADRIPLEGIC) WAS KILLED. A POLICE REPORT WAS FILED. A WITNESS TO THE CRASH STATED THAT THE VEHICLE WAS HEADING TOWARD A THREE-WAY INTERSECTION AND INSTEAD OF GOING EITHER LEFT OR RIGHT, THE VEHICLE DROVE STRAIGHT AHEAD. THE CAUSE OF THE CRASH HAD NOT BEEN DETERMINED AND THE VEHICLE HAD NOT BEEN INSPECTED AT THE TIME OF THE COMPLAINT. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 50,000.",
        "vin": "2D4GP74L93R"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/22/2010",
        "dateOfIncident": "03/22/2010",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10321401,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN. THE VEHICLE FAILED TO START DUE TO A DEFECTIVE IGNITION SWITCH. SINCE THE CONTACT IS UNABLE TO DRIVE HE VEHICLE, IT HAS NOT BEEN TAKEN TO THE DEALER. THE MANUFACTURER HAS NOT BEEN CONTACTED. THE FAILURE MILEAGE WAS 70,000.",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/19/2010",
        "dateOfIncident": "05/16/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10320917,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM ON MY THIRD RACK AND PINION FOR THE STEERING MECHANISMS FOR THE 2003 DODGE CARAVAN SPORT THAT WE OWN.  I PURCHASED THE CAR IN 2005 WITH 28000 MILES WITHIN THE YEAR I REPLACED MY FIRST RACK AND PINION (2006). SINCE THEN I REPLACED ANOTHER ONE (2008) AND NOW AM HAVING TO  REPLACE ANOTHER. I CAN'T AFFORD THIS AND AM HAVING TO CONTINUOUSLY DRIVE A CAR WITH DEFECTIVE STEERING. EVERY MECHANIC I CALL SAYS THAT THE DODGE VANS ARE NOTORIOUS FOR HORRIBLE RACK AND PINIONS AND THAT NO ONE WILL WARRANTY THAT PART. CAN YOU HELP ME?  THIS SHOULD BE RECALLED AND CORRECTED NOT JUST ACCEPTED. *TR",
        "vin": "1D4GP44373B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2009",
        "dateOfIncident": "04/13/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295583,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 DODGE CARAVAN. THERE WAS AN ELECTRICAL SHORTAGE IN THE INSTRUMENT CLUSTERS AND IN THE HEADLIGHTS. THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION. HE WAS ADVISED THAT HE WOULD HAVE TO REPLACE THE COMPUTER AT AN EXPENSE OF $1500.00. THE FAILURE MILEAGE WAS 99,000.",
        "vin": "1D4GP25323B"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/25/2009",
        "dateOfIncident": "11/05/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10269857,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA EL42",
                "productYear": "9999",
                "size": "P215/55R17",
                "type": "Tire"
            }
        ],
        "summary": "MY DODGE VAN HAS FOUR \"SLOW LEAK\" BRIDGESTONE TIRES. WHAT SHOULD I DO? I HAD THIS PROBLEM SINCE I GOT THIS VAN.    DO NOT BUY BRIDGESTONE TIRES.  BRIDGESTONE 215/65R16 98T M+S EL4213Z  DOT 7X6V CTO 2203 C19L  TUBELESS RADIAL . *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/20/2009",
        "dateOfIncident": "01/13/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266141,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHILE DRIVING 25 MPH, THE CONTACT HEARD A CLUNKING NOISE COMING FROM THE BACK OF THE VEHICLE.  THERE HAD BEEN NO PREVIOUS FAILURES.  THE VEHICLE WAS TAKEN TO A LOCAL REPAIR SHOP AND INSPECTED BY A TECHNICIAN, WHO DETERMINED THAT THE SWAY BAR FAILED.  THE CONTACT WAS NOT PROVIDED AN ESTIMATE FOR THE REPAIR COST.  NO REPAIRS HAVE BEEN MADE.  THE CONTACT IS IN THE PROCESS OF NOTIFYING THE MANUFACTURER.  THE FAILURE MILEAGE WAS 35,000 AND CURRENT MILEAGE WAS 36,000.",
        "vin": "1D4GP25373B"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/19/2009",
        "dateOfIncident": "03/18/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262465,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "DOUGLAS",
                "productModel": "XTRA-TRAC AW AS",
                "productYear": "9999",
                "size": "P195/75R14",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE RECEIVED TWO DIFFERENT DOUGLAS 215/70R 15BWX-TRACII TIRES.  BOTH HAVE SEPARATED ON ME.  THE TIRES ARE NO LONGER USABLE.  I AM NOT HAPPY WITH THE QUALITY OF TIRE.  THESE OCCURRENCES HAPPENED WITHIN 2 MONTHS OF EACH OTHER.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/07/2009",
        "dateOfIncident": "02/07/2009",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257819,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A USED 2003 DODGE CARAVAN WHICH I RECENTLY PURCHASED IN DECEMBER 2008 FROM A USED CAR DEALER IN WEST BURLINGTON, IA.  DURING THE 3RD WEEK OF JANUARY, I WAS DRIVING AND THE VAN COMPLETELY STOPPED AND WAS NOT DRIVABLE.  I WAS IN THE MIDDLE OF A BUSY STREET AND HAD TO HAD PEOPLE HELP PUSH IT INTO THE NEAREST PARKING LOT.  I HAD IT TOWED TO A MECHANIC AND WHEN THEY WENT TO LOOK AT IT, THEY WERE ABLE TO START IT UP, KEEP IT RUNNING AND PERFORMED A DIAGNOSTIC TEST ON IT AND COULDN'T FIND ANYTHING WRONG WITH IT.  SINCE THEN IT HAS BEEN RUNNING FINE EXCEPT FOR TODAY WHEN I WAS DRIVING DOWN A DIRT ROAD AND IT COMPLETELY STOPPED JUST LIKE THE FIRST TIME.  I HAD IT TOWED TO MY HOUSE BECAUSE SINCE IT'S A SATURDAY IN THE LATE AFTERNOON, THERE AREN'T ANY SHOPS OPEN TO LOOK AT IT.  I KNOW IT'S NOT THE BATTERY BECAUSE ALL OF THE DASH LIGHTS WORK, THE HEAT, INTERIOR LIGHTS, ETC. I ALSO JUST HAD IT SERVICED AT A DIFFERENT MECHANIC THAT THE USED CAR DEALER WORKS WITH FOR AN OIL CHANGE AND THEY CHECKED EVERYTHING AND COULDN'T FIND ANYTHING WRONG THAT CAUSES THAT.  PLUS BOTH MECHANICS THAT HAVE LOOKED AT THE VEHICLE TOLD ME THAT THEY CAN'T DIAGNOSE IT IF IT STARTS. THIS IS OUR ONLY VEHICLE THAT WILL FIT OUR FAMILY IN AND IT GETS US BACK AND FORTH TO WORK.  WHEN WE TALK TO THE PEOPLE THAT SOLD IT TO US, THEY CLAIM THAT THIS HAS NEVER HAPPENED TO THEM WHEN THEY HAD IT BUT I'M STARTING TO WONDER BECAUSE I NOTICED THAT OTHER DODGE 2003 CARAVAN OWNERS ARE HAVING SIMILAR \"STALLING PROBLEMS.\"  OUR VEHICLE HAS 167,000 MILES ON IT- IT HAD AROUND 163,00 ON IT WHEN WE PURCHASED IT.  WE WOULD LIKE TO GET THIS RESOLVED.  IT'S A GOOD RUNNING VEHICLE WHEN IT RUNS. *TR",
        "vin": "1D4GP25353B"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/22/2008",
        "dateOfIncident": "12/21/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252486,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "TURANZA EL42",
                "productYear": "9999",
                "size": "P215/55R17",
                "type": "Tire"
            }
        ],
        "summary": "WE EXPERIENCED A SIDEWALL BLOWOUT OF A BRIDGESTONE TURANZA EL42 (21565R16 98T) ON OUR 2003 DODGE CARAVAN (ONLY 20,800MI) WHEN I DROVE TO THE HOME. WHEN I CHECK OTHER TIRES. I FOUND A SAME PROBLEM ON ANOTHER TIRE --- FEW CRACKS ON THE SIDEWALL. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": true,
        "dateComplaintFiled": "12/16/2008",
        "dateOfIncident": "11/21/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251927,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE GRAND CARAVAN    ACCIDENT WAS CAUSED DUE TO SOME TYPE OF FAILURE WITH THE TURN SIGNALS. WHEN THE LEFT DIRECTIONAL WAS USED TO SIGNAL A LANE CHANGE THE RIGHT DIRECTIONAL TURNS ON INSTEAD. THE CAR THAT WAS BEHIND ME THOUGHT I WAS CHANGING LANES TO THE RIGHT WHEN I WAS ACTUALLY GOING LEFT. I NATURALLY HEARD THE CLICKING OF MY DIRECTIONAL BEFORE MOVING NEVER THINKING THIS COULD HAPPEN. I NEED TO HAVE THIS CHECKED AS IT HAPPENS AT LEAST A COUPLE OF TIMES PER DAY. *TR",
        "vin": "1D4GP24383B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/01/2008",
        "dateOfIncident": "11/18/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10250434,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAGS IN MY VEHICLE DEPLOYED BY IT SELF WITH OUT ANY REASON. *TR",
        "vin": "1D4GP25333B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/25/2008",
        "dateOfIncident": "08/23/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246709,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I TURNED ON MY VAN, STARTED DOWN THE STREET, LOOKED DOWN TO SEE WHAT SPEED I WAS GOING AND SAW THAT THE SPEEDOMETER WASN'T WORKING.  THE NEEDLE IS ON THE OTHER SIDE OF THE PIN AS IF WE WERE GOING 160 MPH AND DOES NOT BUDGE.  WHEN THE VAN WAS TURNED OFF, IT DID NOT RETURN TO THE OTHER SIDE OF THE PIN.  THE SPEEDOMETER HAS NEVER BEEN A PROBLEM FOR US IN THE PAST.  MY VAN IS A 2003 AND THIS SHOULD NOT BE AN ISSUE ON A VEHICLE THAT IS ONLY 5 YEARS OLD. *TR",
        "vin": ""
    },
    {
        "components": "STEERING,POWER TRAIN,ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/16/2008",
        "dateOfIncident": "08/20/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242529,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "C BODY",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "SERPENTINE BELT SLIPPING.  I HAVE OWNED SEVERAL YEAR MODELS OF CARAVAN AND HAVE FOUND THIS PROBLEM TO BE CONSTANT WITH ALL.  DURING RAIN OR OTHER WATER ON THE ROAD CONDITION, THE SERPENTINE BELT SLIPS ENOUGH TO INTERFERE WITH VEHICLE OPERATIONS UNTIL THE WATER IS DISPLACED FROM THE BELT.  IF A DRIVER IS NOT PAYING CLOSE ATTENTION OR IS USING THE CRUISE CONTROL AT THE TIME, THE DRIVER COULD LOSE CONTROL OF THE POWER STEERING, ELECTRICAL PROBLEMS WITH THE ALTERNATOR, OR LOSE OF ENGINE POWER TO THE DRIVE AXLES.  THIS ITEM SHOULD BE STUDIED AND REMEDIED TO PREVENT FUTURE OCCURRENCES.  IF THE FIX CAN BE RETROFITTED TO PREVIOUS YEARS, THE MANUFACTURER SHOULD PROVIDE THE REPAIRS AT NO COST TO THE OWNER.  THIS CONDITION BEGAN WITH THE PURCHASE DATE THROUGH TODAY.  THIS PROBLEM IS NOT CONTAINED TO ONE ENGINE SIZE. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/11/2008",
        "dateOfIncident": "07/30/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10241850,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN  THOUGHT IT WAS GREAT HAD  LITTLE PROBLEMS THAT  I NEVER  THOUGHT  MUCH OF UNTIL NOW, NOW  THAT  MY VEHICLE HAS BEEN IN A SHOP AND UNUSABLE FOR ABOUT 8 WEEKS.  THE HORRIBLE NOISE IT MADE WHEN STARTING IT, THE GEAR SHIFT MOVING ON OCCASION AND THE BRAKE PEDAL GOING ALL THE WAY  TO THE FLOOR UNTIL A SLIGHT BURNING SMELL  BUT ALL THESE  PROBLEMS WERE OCCASIONAL  BUT NOW I HAVE NO VEHICLE IT IS SITTING IN THE DEALERSHIP FOR REPAIR  AND I HAVE NO VEHICLE EXCEPT FOR BORROWING AND RENTING TO GET CHILDREN TO SCHOOL, AND MY CHILDREN WITH ECZEMA AND ALLERGIES TO DOCTORS AND IF THEY NEED TO GO TO THE HOSPITAL.  I AM DEVASTATED AND DESPERATE  HOW DO I AFFORD A NEW VEHICLE BECAUSE I AM GETTING TAPPED OUT. I ALSO HAVE NO ESTIMATED DATE OR PRICE FOR REPAIR. *TR",
        "vin": "1D4GP25313B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/03/2008",
        "dateOfIncident": "09/02/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10240746,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003, 6 CYL, 3.3L, DODGE CARAVAN,  LOSES IT'S POWER STEERING WHEN IT RAINS AND YOU HIT EVEN A SMALL PUDDLE OF WATER.  THE WATER SHIELD IS IN PLACE.  THE DODGE DEALER SAYS IT IS COMMON TO ALL THE CARAVANS AND THERE IS NO FIX.  I CALLED MAIN DODGE HQ WHICH CONFIRMED THIS.  THIS IS INCREDIBLY DANGEROUS. *TR",
        "vin": "1D4GP25323B"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/18/2008",
        "dateOfIncident": "08/07/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238618,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PASSENGER SLIDING DOOR ON DRIVER SIDE, LOCK WILL NO LONGER LOCK USING REMOTE OR DRIVER DOOR LOCK SWITCH, ALSO  AUTO LOCK AT 20MPH NO LONGER AUTO LOCKS, THIS IS SAFETY HAZARD AND THEFT HAZARD. DID NOT KNOW THAT ALL DOORS WERE NOT LOCKING ITEMS COULD BE EASILY STOLEN.  *TR",
        "vin": "1D4GP25R33B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/11/2008",
        "dateOfIncident": "08/09/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237724,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEEDOMETER NEEDLE ON MY 2003 DODGE CARAVAN GETS AN ELECTRICAL SPIKE FREQUENTLY AND SPINS COMPLETELY AROUND CLOCKWISE UNTIL IT GETS STUCK ON THE BACKSIDE OF THE STOP PIN.  IT BECOMES FROZEN THERE UNTIL I TAKE TO THE DODGE DEALER FOR A RESET WITH SOME KIND OF INSTRUMENT.  THE SERVICE DEPART AT THE HUNTSVILLE DEALERSHIP SAYS IT IS PROBABLY CAUSE BY \"STATIC ELECTRICITY\" OR AN ABNORMAL ELECTRICAL SURGE.  THIS HAS OCCURRED TWICE IN THE LAST SIX MONTHS.  THEY CHARGED THE FIRST TIME FOR RESET BUT NOT THE SECOND TIME.  *TR",
        "vin": "1D4GP25373B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/23/2008",
        "dateOfIncident": "05/15/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235493,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHILE DRIVING 5-30 MPH, THE STEERING WHEEL MAKES A POPPING, KICKING, AND CREEKING SOUND.  THE CONTACT SCHEDULED AN APPOINTMENT TO HAVE THE VEHICLE INSPECTED.  THE CURRENT AND FAILURE MILEAGES WERE 30,000.",
        "vin": "1D4GP24353B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2008",
        "dateOfIncident": "07/12/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234777,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHEN THE VEHICLE WAS STARTED IN HOT WEATHER, THE CONTACT HEARD A LOUD WHINING NOISE COMING FROM THE FUEL TANK.  THE VEHICLE WAS TAKEN TO A DEALER AND THEY STATED THAT THE FUEL PUMP FAILED AND NEEDED TO BE REPLACED.  THE CURRENT MILEAGE WAS 69,000 AND FAILURE MILEAGE WAS 50,000.  UPDATED 09/16/08. *LJ  UPDATE 09/18/08. *JB",
        "vin": "1D4GP45323B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/14/2008",
        "dateOfIncident": "12/05/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10234311,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN. A NOISE WAS PRESENT IN THE ENGINE AREA. THE COLD WEATHER WAS A FACTOR. THE MECHANIC STATED THAT THERE WAS AN INTERNAL LEAK AND THAT HER RACK AND PINION NEEDED TO BE REPLACED. THE REPAIR WAS MADE A YEAR AGO. THE CONTACT IS AWARE OF THE SAFETY RISK SINCE THE RACK AND PINION COULD RESULT IN HER LOSING STEERING CONTROL AND RESULTING IN A CRASH. THE CURRENT AND FAILURE MILEAGES WERE 68000.",
        "vin": "2D4GP44343R"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/04/2008",
        "dateOfIncident": "05/30/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229947,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  IN AN ATTEMPT TO DRIVE THE VEHICLE, THE HEADLIGHTS AND TAIL LIGHTS FLASHED AND WOULD NOT SHUT OFF WHEN THE KEY WAS REMOVED FROM THE IGNITION.  THE CONTACT HAD TO DISCONNECT THE BATTERY IN ORDER TO DIM THE LIGHTS.  THE VEHICLE HAS NOT BEEN TAKEN TO A DEALER, BUT WAS DIAGNOSED ONLINE AS HAVING A FAULTY FMC CONTROL MODULE.  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 50,000 AND FAILURE MILEAGE WAS 49,980.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/14/2008",
        "dateOfIncident": "05/10/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227834,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "ACCESSORY DIST., INC.",
                "productMake": "ACCESSORY",
                "productModel": "HELMET",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "CAR HAS BEEN MAKING LOUD \"POP\" SOUNDS WHEN STEERING WHEEL IS TURNED TO THE LEFT. THE SOUND IS NOT CONTINUOUS. IT MAY NOT HAPPEN AGAIN FOR ANOTHER 2-3 WEEKS. CAR CONTINUES TO DRIVE UNTIL IT HAPPENS AGAIN WITHIN ANOTHER WEEK OR TWO. IT CAME TO COMPLETE HALT WHILE TURNING IN MY DRIVEWAY ON MAY 10TH 2008.  TOWED CAR TO FIRESTONE SUNDAY MAY 11TH AND ON MONDAY MAY 12TH WAS TOLD THAT THEY COULD NOT HEAR ANY SOUNDS WHEN DRIVEN AND COULD SEE NOTHING WRONG FROM INSPECTION.  KNOCKING SOUNDS COULD POSSIBLY MEAN TRANSMISSION.  MY CAR WAS DRIVEN HOME FROM FIRESTONE BY MY BROTHER-IN-LAW WHO ALSO DID NOT HEAR ANY SOUNDS.  SOUNDS OCCUR RANDOMLY WHEN YOU LEAST EXPECT.  ON WEDNESDAY MAY 14TH MY BROTHER WHO WORKS AT A FORD DEALERSHIP DROVE IT TO WORK FOR A SECOND OPINION THEY TOO CAN SEE NOTHING WRONG WITH THE CAR.  I AM VERY FRIGHTENED TO DRIVE THIS CAR FAIRING THE WORST IS YET TO COME.  FIRST OCCURRENCE WAS ON APRIL 22ND 2008.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/07/2008",
        "dateOfIncident": "06/20/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226953,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING RACK AND RACK PROBLEMS 2003 DODGE CARAVAN WENT OUT AT 60,000 MILES.  *TR",
        "vin": "1D4GP25343B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/06/2008",
        "dateOfIncident": "03/28/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226856,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHILE DRIVING OVER A BUMP OR MAKING A TURN AT ANY SPEED, THE CONTACT COULD HEAR A THUMPING NOISE COMING FROM THE FRONT END OF THE VEHICLE.  THE DEALER INFORMED HIM THAT THE STEERING RODS NEEDED TO BE REPLACED.  THE VEHICLE HAS BEEN DIAGNOSED TWICE BY THE DEALER FOR THE SAME FAILURE.  THE CURRENT MILEAGE WAS 51,000 AND FAILURE MILEAGE WAS 48,000.",
        "vin": "1D4GP25BX3B"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,POWER TRAIN,EXTERIOR LIGHTING,VISIBILITY,AIR BAGS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "04/29/2008",
        "dateOfIncident": "11/10/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10226034,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHILE ATTEMPTING TO TURN THE VEHICLE AT 5 MPH, THE CONTACT HEARD A SOUND FOR THE FIRST TEN MINUTES OF DRIVING, AND THEN IT WOULD STOP.  THE VEHICLE WAS SERVICED BY THE DEALER, BUT THE FAILURE PERSISTS.  THE FAILURE MILEAGE WAS 18,380. UPDATED 05/20/08.  *LJ  THE CONSUMER HAD PROBLEMS WITH THE POWER STEERING, TRANSMISSION, REAR LIGHTS THAT WERE HANGING, THE REAR WIPER CAME OFF, THE SLIDING DOOR DID NOT SHUT PROPERLY. THE CLOCKSPRING WAS REPLACED. THE ENGINE LIGHT WAS ON, THE WATER PUMP WAS COMING APART THE VALVE COVER GASKET AND OIL PAN GASKET WERE  LEAKING. UPDATED 05/20/08. *JB",
        "vin": "1D4GP25373B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/13/2008",
        "dateOfIncident": "03/12/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221095,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SOLUTION TO: ODI CASE NUMBER: 10218207   DETAILS: 2003 DODGE CARAVAN. WHINING NOISE WHEN ENGINE IS FIRST STARTED. SOUNDS LIKE POWER STEERING PUMP. CHECKED FLUID, BUT LEVEL IS FINE. NO LEAKS ANYWHERE. MECHANIC CAN FIND NO APPARENT PROBLEM. IN WARMER WEATHER THE NOISE IS DIMINISHED, BUT STILL PRESENT. I PURCHASED VEHICLE NEW. IT HAS 71,000 MILES. I TRIED A POWER STEERING CONDITIONER THAT IS SUPPOSE TO STOP WHINING. THE WHINING WORSENED FOR A WHILE. NEVER GOT BETTER.   FROM PERSONAL KNOWLEDGE THERE IS A FLAW IN THE DESIGN IN THE FILLING TANK DESIGN FOR THE POWER STEERING  ON THIS VAN. FILL WITH POWER STEERING FLUID ABOVE THE FULL MARK TO THE BOTTOM OF THE FILL TUBE ON TOP BUT JUST BELOW THE FILLER CAP PLUG WHEN PUT BACK ON. THIS WILL STOP ALL NOISE FROM THE POWER STEERING PUMP.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/16/2008",
        "dateOfIncident": "10/14/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218207,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN. WHINING NOISE WHEN ENGINE IS FIRST STARTED. SOUNDS LIKE POWER STEERING PUMP. CHECKED FLUID, BUT LEVEL IS FINE. NO LEAKS ANYWHERE. MECHANIC CAN FIND NO APPARENT PROBLEM. IN WARMER WEATHER THE NOISE IS DIMINISHED, BUT STILL PRESENT. I PURCHASED VEHICLE NEW. IT HAS 71,000 MILES. I TRIED A POWER STEERING CONDITIONER THAT IS SUPPOSE TO STOP WHINING. THE WHINING WORSENED FOR A WHILE. NEVER GOT BETTER.   *TR",
        "vin": ""
    },
    {
        "components": "CHILD SEAT",
        "crash": false,
        "dateComplaintFiled": "02/15/2008",
        "dateOfIncident": "01/01/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218108,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Graco Children's Products, Inc.",
                "productMake": "GRACO",
                "productModel": "COMFORTSPORT",
                "productYear": "9999",
                "type": "Child Seat"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A GRACO COMFORTSPORT CHILD SEAT, MODEL NUMBER 8433F0F.  THE CHILD SEAT WAS INCLUDED IN A RECALL ON THE LATCH SYSTEM IN AUGUST OF 2007.  THE CONTACT RECEIVED INSTRUCTIONS ON HOW TO RE-ATTACH THE CHILD SEAT SO THAT THE LATCH SYSTEM WOULD FIT PROPERLY ON THE VEHICLE.  THE REMEDY LASTED TEMPORARILY, BUT FAILED IN JANUARY OF 2008.  THE SEAT IS CURRENTLY NOT FUNCTIONAL AND GRACO REFUSES TO REPLACE IT OR PROVIDE A REPAIR KIT.  THE RECALL NUMBER WAS UNKNOWN.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "01/21/2008",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215647,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE OWN 2 DODGE CARAVAN'S  A 2001 GRAND THAT WE HAD A PROBLEM WITH FOR 6 MONTHS.  WE KEPT GETTING A EVAP LEAK WARNING LIGHT.  FINALLY THEY DID A SMOKE TEST AND THE WHOLE TOP OF THE GAS TANK HAD TO BE REPLACED.  WE  JUST GOT THAT FIXED AND MY HUSBANDS 2003 CARAVAN NOW HAS THE SAME WARNING LIGHT.  I DO NOT BELIEVE THIS IS A COINCIDENCE.  DODGE IS NO HELP .  FIRST TIME I CALLED THEY SAID WE WILL HELP YOU.  NOW THEY SAY ITS NOT OUR PROBLEM.  COME ON 2 VANS IN THE SAME HOUSE WITH THE SAME PROBLEM.  *TR",
        "vin": "1D4GP25303B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "01/17/2008",
        "dateOfIncident": "07/05/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215257,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BRAKE FAILED TO STOP AT APPROPRIATE DISTANCE RESULTING IN AN ACCIDENT.  *TR",
        "vin": "1D4GP253X3B"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/30/2007",
        "dateOfIncident": "06/15/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10207494,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) COUPLE MONTHS BACK, OUR AIR CONDITIONING SYSTEM STOPPED WORKING.  HOWEVER, THE AIR WAS STILL COMING THROUGH AND THE SYSTEM WAS WORKING, ONLY THE COOLING SYSTEM STOPPED WORKING.  (2) WE WENT TO THE DEALERSHIP TO REPORT THE ISSUE.  THEY SAID THAT THE COMPRESSOR STOPPED WORKING.  BECAUSE OF THAT, THE AIR CONDITIONING SYSTEM HALTED.    (3) THEY OFFERED TO REPLACE THE COMPRESSOR FOR THE NORMAL PART CHARGE, PLUS LABOR.  WE DECLINED THE OFFER AND LOOKED AT OTHER OPTIONS, SUCH AS FINDING OUT IF THE CAR HAD ANY SERVICE BULLETINS ON SUCH A PROBLEM SINCE THE CAR HADN'T EVEN EXCEEDED 50,000 MILES!  LOOKING AROUND, I FOUND SERVICE BULLETIN #24-004-04, UNDER GROUP: HEATING & A/C, DATED JUNE 1, 2004.  IT ADDRESSES THE COMPRESSOR MALFUNCTION DUE TO LACK OF LUBRICATION.  I AM PRETTY SURE THAT THIS CAUSED OUR FAILURE.  HOWEVER, THE BULLETIN, ACCORDING TO THE MOSS BROS. DODGE IN SAN BERNARDINO, APPLIED TO ONLY 3.3L OR 3.8L.  I BELIEVE THAT THIS SHOULD APPLY TO OUR 2003 DODGE CARAVAN SE FWD.  MY WIFE AND I HAVE SUFFERED BREATHING PROBLEMS DUE TO THE HEAT DURING THIS PAST SUMMER (2007), ESPECIALLY BEING ENCLOSED IN A VEHICLE WITHOUT AIR CONDITIONING!  *TR",
        "vin": "1D4GP25B43B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/22/2007",
        "dateOfIncident": "09/18/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206541,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHILE DRIVING AT AN UNKNOWN SPEED, THE CONTACT HEARD A LOUD NOISE COMING FROM THE DRIVER SIDE FRONT TIRE.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT THE VEHICLE WAS UNSAFE TO DRIVE DUE TO A FAULTY CALIPER.  THE DEALER WILL NOT RELEASE THE VEHICLE THE UNTIL IT IS REPAIRED.  THE CURRENT MILEAGE WAS 61,634 AND FAILURE MILEAGE WAS 61,628.",
        "vin": "1D8GP25B53B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/10/2007",
        "dateOfIncident": "07/02/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10199090,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHILE HIS SPOUSE WAS DRIVING 70MPH, THE GEAR BOX LIT UP AND THE VEHICLE SHUT OFF.  THE CONTACT IMMEDIATELY MERGED THE VEHICLE TO THE SIDE OF THE ROAD AND WAS ABLE TO RESTART IT.  AFTER SHIFTING IN REVERSE, THE VEHICLE DROVE FORWARD.  THE DEALER COULD NOT DUPLICATE THE PROBLEM. THE FAILURE CONTINUED TO OCCUR. THE FAILURE MILEAGE WAS 9,365 AND THE CURRENT MILEAGE WAS 39,000.",
        "vin": "1D4GP25B43B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2007",
        "dateOfIncident": "07/30/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198962,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION, 56,432 MILES, ORIGINAL OWNER  THE FIRST TIME IT WOULDN'T START BACK UP AFTER HAVING IT OFF FOR 5 MINUTES. ONCE IT WAS TOWED IT STARTED RIGHT BACK UP (ABOUT AN HOUR LATER, IN THE DEALERSHIP PARKING LOT).   THE NEXT DAY AFTER DRIVING IT ABOUT 10 MILES TWO DIFFERENT TIMES AND HAVING IT ON/OFF NUMEROUS TIMES AND THEN HAVING IT PARKED FOR ABOUT 45 MINUTES, I GOT IN AND STARTED IT NO PROBLEM. TWO BLOCKS LATER IT DIED COMPLETELY. AGAIN EVERYTHING WORKED INCLUDING THE A/C, RADIO AND LIGHTS WITH NO SURGE IN POWER.  ABOUT 1/2 HOUR LATER WHEN THE TOW TRUCK SHOWED UP, IT STARTED WITHOUT ANY ISSUES.   WEIRD THING IS THE LIGHTS, AC AND EVERYTHING ELSE WORK JUST FINE!! IT DOESN'T EVEN SEEM AS IF THERE IS A DRAIN ON THEM. WHEN I TURN THE IGNITION, IT DOESN'T DO ANYTHING, NO CLICKS, NO \"STARTING\", NOTHING!!!  ALSO BOTH TIMES IT WOULDN'T START/STALLED, IT WAS ON AN INCLINE. THE FIRST TIME WAS IN A DRIVE WAY WHERE THE FRONT WAS UP HIGHER AND THE SECOND TIME WAS GOING DOWN A HILL. AND WHEN IT WAS STARTED IT WAS ON A FLAT SURFACE.    IT HAS BEEN AT THE DEALERSHIP SINCE LAST NIGHT AND OF COURSE IT IS NOT HAPPENING THERE. THEY DID HOOK IT UP TO THE MACHINE SINCE MY CHECK ENGINE LIGHT CAME ON THE SECOND NIGHT WHEN IT DIED, BUT THERE WERE NOT ANY MESSAGES THAT CAME OUT.      IT HAS BEEN AT THE DEALER FOR 9 DAYS, YESTERDAY WAS THE FIRST DAY THAT THEY WERE ABLE TO GET IT TO REPLICATE THE PROBLEM.  THEY HAD ALREADY REPLACED TWO PARTS, INCLUDING THE FUSE BOX.  THE 3RD PART THEY ARE CONSIDERING IS ON NATIONAL BACKORDER, BUT SUPPOSEDLY WAS SENT OUT TO THE DEALERSHIP.  I BELIEVE THE 3RD PART IS THE MAIN COMPUTER.     *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/19/2007",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197015,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN BROKEN WHEEL STUDS/BOLTS CUSTOMER WANTS SOMEONE TO ACCEPT RESPONSIBILITY FOR THE ONGOING PROBLEM**NAR**CC  THE CONSUMER STATED LAST JULY HE PURCHASED REPLACEMENT TIRES FROM COSTCO FOR HIS VEHICLE AND THEN HAD THE TIRES ROTATED IN DECEMBER FOR THE SAME VEHICLE. THEN THIS SPRING THE CONSUMER STATED HE HAD THE FRONT BRAKE PADS REPLACED AND ONE WHEEL STUD, ABOUT A MONTH LATER THE TIRES WERE ROTATED AGAIN AND THE CONSUMER INFORMED THE MECHANIC OF THE PREVIOUS PROBLEM WITH THE STUDS. THE CONSUMER STATED THE MECHANIC INFORMED HIM THEY COULD ONLY ROTATE 3 OF THE TIRES DUE TO THE FACT OF A POSSIBILITY THE STUDS WOULD BREAK AND THEY DID NOT WANT TO BE HELD RESPONSIBLE FOR THE DAMAGE. THE CONSUMER STATED HE ROTATED THE REMAINING TIRE WHICH THE STUDS DID INFACT BREAK AND WERE REPLACED BY THE CONSUMER. THE CONSUMER STATED LAST MONTH CHRYSLER WAS REPLACING A WATER PUMP AND WAS INFORMED BY THE MECHANIC THAT THE STUDS WOULD HAVE TO REPLACED YET AGAIN WHEN THE MECHANICS WERE REMOVING THE STUDS. THE CONSUMER STATED THE 2 STUDS HOLDING THE WATER PUMP IN PLACE ALSO BROKE OFF WHILE WORKING ON THE VEHICLE. THE CONSUMER STATED HE WANTED THIS ISSUE INVESTIGATED. EITHER POOR QUALITY BOLTS WERE USED BY CHRYSLER OR COSTCO WAS CARELESS WHEN TIGHTENING THE BOLTS.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/05/2007",
        "dateOfIncident": "02/01/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192500,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  THE CONTACT HEARD A LOUD NOISE COMING FROM UNDERNEATH THE HOOD.  THE NOISE BECOMES LOUDER WHEN THE VEHICLE IS COLD.  THE DEALER STATED THAT THE POWER STEERING PUMP WAS DEFECTIVE AND REPLACED THE LINES ON THE POWER STEERING PUMP.  HOWEVER, THE DEALER FAILED TO REPLACE THE POWER STEERING PUMP.  THE CURRENT MILEAGE IS 51,000 AND FAILURE MILEAGE WAS 35,000.",
        "vin": "1D4GP24323B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/31/2007",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192192,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 DODGE CARAVAN.  WHILE DRIVING 45 MPH, THE HEAD LIGHTS FLICKERED ON AND OFF AND THE INSTRUMENT PANEL LIGHTS DIMMED INTERMITTENTLY.  THE DEALER STATED THAT THE INSTRUMENT CONTROL AND POWER CONTROL MODULE NEEDED TO BE REPLACED.  THE DEALER MADE THE REPLACEMENT BUT, APPROXIMATELY TWO DAYS LATER, THE SAME FAILURE RECURRED.  THE DEALER DID NOT INSPECT THE VEHICLE AGAIN.  THERE WAS DEFECT INVESTIGATION # EA05009 FOR THE 2001-2002 DODGE CARAVAN.  THE CURRENT MILEAGE IS 52,000 AND FAILURE MILEAGE WAS 40,422.  THE CONSUMER PROVIDED REPAIR INVOICES. UPDATED 07/26/07  *TR",
        "vin": "2D4GP44L43R"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/30/2007",
        "dateOfIncident": "11/02/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10192069,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON NOVEMBER 2, 2006 MY WIFE (7 MONTHS PREGNANT) WAS HIT HEAD ON BY ANOTHER SEDAN.  SHE WAS DRIVING A 2003 DODGE CARAVAN.  I BELIEVE THAT AIR BAGS DEPLOYMENT AND VEHICLE DESIGN MAY HAVE BEEN THE CAUSE OF SERIOUS BROKEN ARMS/WRIST AND FOOT.  IN ADDITION TO WIFE'S INJURIES, THREE OTHER PASSENGERS ALSO SUFFERED BROKEN LIMBS AND SHOULDERS. *TR",
        "vin": "1D4GP253X3B"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/20/2007",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185658,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT OWNS A 2003 DODGE CARAVAN. THE ALUMINUM ON THE WHEELS DETERIORATED.  THE DEALERSHIP INFORMED THE CONTACT THAT THE DETERIORATION WAS CAUSED BY THE SALT ON THE ROAD. THE SALT FROM ROAD GOT  IN BETWEEN THE COATING OVER THE ALUMINUM, WHICH CAUSED CORROSION TO THE ALUMINUM. THIS CAUSED THE TIRES TO CONSTANTLY GO FLAT. THE CURRENT MILEAGE WAS 59,000.  *AK",
        "vin": "2D8GP54L23R"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/20/2007",
        "dateOfIncident": "03/20/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185713,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT COMPLAINED  ABOUT THE 2003 DODGE CARAVAN BRAKE SYSTEM WHICH WAS  PURCHASED ON JULY 19, 2003.  THE CONTACT EXPLAINED THAT THERE WAS  A PROBLEM WITH THE BOLTS THAT HELD THE RIGHT BRAKE CALIPER OVER THE DRIVER'S SIDE ROTOR.  THE CONTACT EXPLAINED THAT IN  DECEMBER  2005 THE VEHICLE WAS TAKEN TO  PRECISION TUNE AUTO CARE AT 10515-B CENTRUM PARKWAY PINESVILLE, NORTH CAROLINA 28134.  THE VEHICLE HAD 31015 MILES.  THE ROTORS BEGAN TO SMOKE AND NEEDED TO BE REPLACED ALONG WITH THE PADS. THE CONTACT WAS TOLD THAT THE ROTORS WERE OVERHEATED BECAUSE THE PADS WORE OUT PREMATURELY BECAUSE THE SQUEAKER NEVER ALERTED THE CONTACT OF ANY PROBLEMS WITH THE BRAKES.  THE CONTACT EXPLAINED THAT ON SEVEN MONTHS LATER ON AUGUST 2006 THE BRAKES WERE INSPECTED DUE TO SQUEAKING.  ON THE 20 MARCH OF 2007 THE CONTACT EXPERIENCED VIBRATION COMING FROM UNDER THE VEHICLE.  THE VEHICLE WAS IMMEDIATELY STOPPED AND THEN TAKEN TO PRECISION TUNE.  THEY CONTACT WAS TOLD THAT THERE WAS A BOLT MISSING FROM THE RIGHT FRONT DRIVER SIDE CALIPER HOUSING.  THE CONTACT WANTED  TO FILE A COMPLAINT AGAINST THE MAJOR BRAKE COMPANIES TO BETTER SECURE THESE BOLTS ON TO CALIPER HOUSING UNITS TO AVOID ANY OF THESE BOLTS FROM COMING OFF THE  VEHICLE.   THE CONTACT SUGGESTED SAFETY STANDARDS FOR BRAKES PADS, AND CALIPER INSTALLATION TO PREVENT THIS FROM HAPPENING.  *AK  THE CONSUMER STATED THE REAPIR SHOP WOULD BE USING A LOCK TIGHT LIQUID ON THE MOUNTING BOLTS. UPDATED 04/12/07. *JB",
        "vin": "1D4GP24393B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/12/2007",
        "dateOfIncident": "09/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184861,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MONDAY, MARCH 12, 2007 I AM PLANNING TO UP GRADE MY CARAVAN SE TO A NEWER CAR AND BEFORE I CHANGE TO A NEW PROBLEM I WHAT TO SOLVE MY OLD PROBLEM!!! THE CARAVAN TO ME IS AN EXCELLENT CAR ON THE HIGHWAY VERY COMFORTABLE AND STABLE. IN 2003 I PERCHES A NEW CARAVAN FIST I RESEARCHED TO CHECK ON POSSIBLE DEFECTS. WITH 18 THOUSAND I WAS TOLD I NEEDED NEW BRAKE PADS AT 20.000 THE METAL STARTED TO RUB ON THE ROTOR. INTERESTINGLY ONLY THE INNER PASSENGER SIDE SHOES HAD EXCESSIVE WHERE. TO ME THIS WAS UNUSUAL ON ALL MY NEW CARS I NEVER NEEDED BRAKES BEFORE 30 THOUSAND. WHEN I TRIED TO PUT A NEW SHOES, THE ONLY SHOES THAT WOULD FIT WAS SPECIFIED FOR. DISC BRAKES ON THE BACK MODEL, WHICH MINE, HAVE DRUMS. AND THE BRAKES SPECIFIED FOR DRUMS ON THE BACK DID NOT FIT! I HAVE TRIED TO FIND OUT WHY MY CAR HAS DISC ON FRONT MADE FOR MODEL THAT HAD DISC ON THE BACK IF MINE HAS DRUMS ON THE BACK??? THE CAR ALWAYS SKIDDED WHEN BRAKES WEAR APPLIED HEAVILY TO CORRECT THE PROBLEM I PUT THE BEST MICHELINS ON THE CAR.  IT DOS NOT SKID BECAUSE OF THE MICHELINS EXCEPT THE BRAKES DO NOT STOP THE CAR!!   NOW I HAVE NOTICED THE CAR DOS NOT STOP WHEN YOU POT THE PEDAL TO THE FLOOR   I PUT NEW BRAKES AND ROTOR AT SEARS AND THE PROBLEM SEEMS TO BE A DESIGN PROBLEM!  CAN YOU TELL ME HOW TO CORRECT THE PROBLEM? BEFORE I GET INTO A MAJOR ACCIDENT!!!  TO ME IT SEEMS ONLY ONE WHEEL IS STOPPING THE CAR!!!  AND FOR A FAIRLY NEW CAR THIS IS A DESIGNER PROBLEM!!!  THIS MODEL CAR HAS BIN MADE FOR ALL MOST 20 YEAR AND THERE IS NO RISEN FOR DESIGNER FLOWS.  IF YOU CANNOT ANSWER THIS SIMPLE PROBLEM I WILL NOT BE ACQUIRING ANY MORE CHRYSLER ORE MERCEDES PRODUCTS IN MY LIFETIME!!!  THANKING IN ADVANCE. *JB",
        "vin": "1D4GP25B23B"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/20/2007",
        "dateOfIncident": "02/19/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182995,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 DODGE CARAVAN AND ALL OF A SUDDEN WHEN I SLOW DOWN THE AIR BAG LIGHT COMES ON.  I TOOK IT IN TO THE DEALER AND THEY SAID IT WAS THE CLOCK SPRING.  AFTER DOING SOME RESEARCH ONLINE, I AM 1 OF THOUSANDS OF PEOPLE WITH THIS ISSUE.  *NM",
        "vin": "1D4GP25B23B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/20/2007",
        "dateOfIncident": "01/27/2007",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10183003,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER AUTO REPAIR SHOP CHANGE THE TRANSMISSION FLUID IN MY 2003 DODGE CARAVAN WITH 3.3L ENGINE (AT AROUND 45,000 MILES), THERE IS VERY ROUGH DOWNSHIFTING OF THE TRANSMISSION. THEY USED MOPAR OEM TRANSMISSION FLUID AND FILTER. THE PROBLEM IS ESPECIALLY VISIBLE WHEN DOWNSHIFTING FROM 4TH TO 3RD GEAR. THERE WAS ALSO A LITTLE BEAT ROUGH DOWNSHIFTING BEFORE CAR CAME TO STOP, SO I BELIEVE BETWEEN THE 2ND AND 1ST GEAR.  THIS A COMMON PROBLEM, AND I DO NOT FEEL SAFE WHEN IT OCCURS, BECAUSE THE WHEELS CAN SPIN ON THE WET OR SNOWY ROADS.  DEFINITELY IT SHOULD BE RECALLED, SINCE A LOT OF PEOPLE COMPLAIN ABOUT THE SAME PROBLEM ON THE INTERNET:  \"THE PROBLEM YOU DESCRIBED IS CALLED \"BUMP SHIFT\" AND IS PRETTY COMMON WITH THE 604/41TE. DEPENDING ON THE YEAR, THE TCM MAY NEED \"FLASHED\" OR THE SOLENOID PACK MAY BE FAULTY. YOU'LL NEED TO SEE THE DEALER TO CHECK THE TCM, WHILE YOUR THERE YOU CAN GET THE CODES CHECKED.\",  \"THE TRANS CONTROLLER WILL TAKE FOR EVER TO DO A RELEARN ON ITS OWN. YOU WILL GET TO THE POINT OF DUMPING IT IN THE RIVER BEFORE THE BUMP SHIFT WILL GO AWAY. BASICALLY IT IS A 4TH TO 3RD GEAR DOWNSHIFT BUMP, AND THE QUICKEST WAY TO GET RID OF IT IS TO HAVE YOUR DEALER DO A QUICKLEARN ON THE TRANS CONTROL MODULE. TAKES ALL OF 45 SECONDS TO RESET THE TRANSMISSION CONTROLLER AND GIVE IT A NEW SET OF BASELINE VALUES. DO NOT ADD ANY AFTERMARKET ADDITIVES TO THE TRANSMISSION FLUID.\",  \"HAD THE SAME PROBLEM. THEY HAD TO REPLACE THE ELECTRONIC SHIFTING MODULE. FIXED THE PROBLEM AND WAS COVERED UNDER WARRANTY.\"  ADDITIONAL INFORMATION FROM MANY DRIVERS COMPLAINING ABOUT THE SAME PROBLEM CAN BE FOUND ON: HTTP://WWW.DODGEFORUM.COM/M_599921/TM.HTM.  *NM",
        "vin": "1D4GP25R83B"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/01/2007",
        "dateOfIncident": "03/19/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10181347,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* - THE CONTACT CALLED REGARDING A 2003 DODGE CARAVAN. THE CONTACT STATED THAT THE WINDSHIELD WIPERS DO NOT WORK WHEN IT RAINS.  ALSO, THE DASHBOARD LIGHTS GO OUT WHEN IT RAINS.     THERE ARE NO WARNING INDICATORS.  THE CONTACT STATED IT VARIES WHEN THE DASHBOARD  LIGHTS COME BACK ON, IT COULD BE A COUPLE OF MINUTES OR A COUPLE OF HOURS.  THE DEALER HAS NOT DIAGNOSED A PROBLEM WITH THE VEHICLE. *AK  THE CONSUMER STATED THE PROBLEM WAS RESOLVED ON FEB 15, 2007. UPDATED 02/27/07. *JB",
        "vin": "2D4GP44313R"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "12/28/2006",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10177234,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * - THE CONTACT STATED THAT THE HEADLIGHTS WILL NOT STAY ON. THE VEHICLE HAS 59,000 MILES.  THE CONTACT STATED NO  PARTICULAR WEATHER CONDITION NOR SPEED WERE INVOLVED WHEN FAILURE OCCURRED.  THERE ARE NO WARNING SIGNALS.  THE VEHICLE DID NOT LOSE POWER.  THE CONTACTWAS NOT SURE IF THE LIGHTS ON THE DASHWENT OUT WHEN THE HEADLIGHTS  STOPPED.   THE DEALER REPLACED A MODULE UNDER THE HOOD.  THE CONTACT DID NOT KNOW WHAT TYPE OF MODULE, HOWEVER, IT DID NOT CORRECT THE PROBLEM.  THE CONTACT TOOK THE VEHICLE IN\\\\\\ TWO MORE TIMES  TO DEALER, AND THE DEALER COULD NOT FIND ANYTHING WRONG.  THERE HAVE BEEN NO INJURIES. *AK",
        "vin": "1D4GP25313B"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/27/2006",
        "dateOfIncident": "11/02/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 4,
        "odiNumber": 10177130,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING HEAD ON ACCIDENT, CAR'S AIR BAG BROKE DRIVERS RIGHT ARM AND SHATTERED WRIST. OTHER THREE PASSENGERS AND DRIVERS SUFFERED BROKEN RIGHT FOOT AND SEVERAL BRUISES. *JB",
        "vin": "1D4GP253X3B"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "12/18/2006",
        "dateOfIncident": "12/06/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176389,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*- THE CONTACT HAD A PROBLEM WITH HIS BRAKES WENT TO A MIDAS SHOP. THE CONTACT LATER EXPERIENCED THE SAME ISSUES WITH THE BRAKES.  MASTER CYLINDER WAS LOW, AND THE MIDAS SHOPS DID NOT BLEED THE BRAKES .  THE CONTACT FEELS THAT THE VEHICLE STILL HAS A SPONGY PEDAL AND THAT THE MIDAS SHOP NEVER BLED AIR OUT OF THE BRAKE SYSTEM.",
        "vin": "1D4GP25R33B"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "12/01/2006",
        "dateOfIncident": "09/17/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176447,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2003 GRAND CARAVAN TIRE BLEW OUT.  *TS  THE CONSUMER STATED THE CRUISE CONTROL WAS SET AND ALL OF A SUDDEN, SHE FELT THE VEHICLE SWERVE TO THE RIGHT AND HIT THE GUARDRAIL.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/23/2006",
        "dateOfIncident": "10/16/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171642,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 30 MPH UNDER NORMAL, DRY CONDITIONS, THE BRAKE PEDAL WENT TOO LOW TO THE FLOOR.  THE CONTACT ATTEMPTED TO APPLY THE BRAKES, THE VEHICLE STARTED TO JERK, AND THE BRAKE SYSTEM DID NOT ENGAGE.  THE BRAKE WENT FURTHER TO THE FLOOR AND MADE A SQUEAKING SOUND.  THE ABS LIGHT ILLUMINATED INTERMITTENTLY.  THE VEHICLE WAS NOT SEEN BY A DEALER.  UPDATED 01/10/07. *JB",
        "vin": "1D8GP24373B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/19/2006",
        "dateOfIncident": "10/13/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171356,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 50 MPH, THE HEADLIGHT DARKENED INTERMITTENTLY. THERE WAS NO WARNING SIGNAL PRIOR TO THE INCIDENT.  THE VEHICLE WAS TAKEN TO THE SERVICE DEALER WHERE THE PROBLEM COULD NOT BE DUPLICATED.  THE MANUFACTURER WAS CONTACTED AND A REFERENCE# 15541666 AND CASE# 8521138 WERE PROVIDED.    UPDATED 12/05/06. *JB",
        "vin": "1D4GP25353B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/03/2006",
        "dateOfIncident": "09/29/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169811,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2003 DODGE GRAND CARAVAN,WITH A HEADLIGHT/ELECTRICAL SYSTEM PROBLEM.  WITHOUT WARNING, THE HEADLIGHTS AND FOG LIGHTS WILL FLASH, SHUT OFF ALTOGETHER, OR DIM.  THE INTERIOR LIGHTS (DASH BOARD) ARE ALSO AFFECTED AND WILL DO THE SAME.  PROBLEM APPEARS TO BE WITH THE HEAD LIGHT SWITCH, HOWEVER, DIAGNOSIS IS INCONCLUSIVE.  IT IS AN INTERMITTENT PROBLEM.  VERY DANGEROUS WHEN LIGHTS GO OUT AT NIGHT AND VERY AGGRAVATING FOR DRIVERS IN FRONT OF YOU WHEN LIGHTS KEEP FLASHING.  INTERNET SEARCH REVEALS SEVERAL SIMILAR COMPLAINTS AND NHTSA INVESTIGATION / RECALL ON 2001 -2002 VEHICLES FOR SIMILAR PROBLEM.  *JB",
        "vin": "2D4GP44LX3R"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/03/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170171,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LTR FROM (OH) RE DEFECTIVE BRAKES ON HIS 2003 DODGE CARAVAN BELIEVES POOR JUDGMENT OF NHTSA AND DAIMLER CHRYSLER ALLOW THIS PROBLEM TO REACH THE MARKET. *TS  THE CONSUMER BEGAN HAVING PROBLEMS WITH THE REAR BRAKES AT 12000 MILES.  THE DRUMS HAVE BEEN REMOVED THREE TIMES TO BE CLEANED.  THEY ACCUMULATED RUST WHICH CAUSED SEVER GRINDING WHEN THE BRAKES WERE APPLIED.  *NM",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/26/2006",
        "dateOfIncident": "09/25/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169336,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED UPON STARTING THE VEHICLE, A NOISE WAS HEARD AND CONTINUED FOR 20 MINUTES.  THE NOISE RETURNED ON EVERY RESTART.  THE VEHICLE WAS DRIVEN TO THE DEALER WHO DETERMINED THE POWER STEERING PUMP RESERVOIR AND PIPING NEEDED TO BE REPLACED.     UPDATED 10/17/2006 - THE CONSUMER EXPLAINED THAT THE NOISE WAS FROM THE POWER STEERING PUMP DESIGN LOCATION AND INSTALLATION BY DODGE WHEN THE VEHICLE WAS BUILT.  A SERVICE BULLETIN WAS ISSUED FOR THE NOISE PROBLEM BUT IT WAS NEVER RECALLED.  THE SYSTEM DESIGN DID NOT ALLOW POWER STEERING FLUID TO RETURN FROM THE FLUID RESERVOIR TO THE PUMP AS QUICKLY AS THE PUMP DEMAND REQUIRED.  *NM",
        "vin": "1D4GP25333B"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "08/28/2006",
        "dateOfIncident": "08/24/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166717,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT SEAT DRIVER SIDE, SEAT BELT ANCHOR BOLT, TOP JUST FELL OUT.  *JB",
        "vin": "1D4GP253X3B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/27/2006",
        "dateOfIncident": "08/26/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166649,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN HEADLIGHTS - UNWANTED SHUTTING OFF WHILE DRIVING WITH MINIMAL ELECTRICAL LOAD. DANGEROUS FOR MOM & KIDS ON HIGHWAY AT NIGHT. PRECEDED BY OTHER, PROBABLY ASSOCIATED, ELECTRICAL PROBLEMS. WIFE AT WAL MART RETURNED TO VEHICLE. GAUGES FLICKERED, DASHBOARD CRAZY, CLICKING SOUND FROM DRIVER'S SIDE/RELAY(S) BUZZING, POWER LOCKS WOULDN'T FUNCTION (GREAT IF SHE WAS TRYING TO GET AWAY FROM MUGGER). WOULDN'T START. THIS EVENT PRECEDED BY HEADLIGHTS CYCLING OFF AND ON RIGHT AFTER STARTUP, BUT AFTER RUNNING A FEW MINUTES STAYED ON DURING THAT OPERATION CYCLE. BACK TO THE WAL MART EVENT. VEHICLE TAKEN TO DEALERSHIP - REPLACED BATTERY. BACK TO THE FUTURE. CHECKED FUSES, CONNECTIONS, HARNESS, BATTERY CABLES FOR FAULT/CORROSION - NOTHING. NO CODES. COSTLY FIXES MAY INCLUDE:1) FUSES AND BOXES, 2) BATTERY CABLES AND TERMINALS CORRODED, LOOSE OR NOT GROUNDED/BATTERY,3) HEADLIGHT SWITCH,4) MULTI-FUNCTION WAND ON STEERING COLUMN (THERE WAS A 2003 VIPER RECALL FOR LAMP CONTACTS CORRODING - 20031010 - THIS COULD BE IT FOR THE CARAVAN TOO...DEALERS WERE SUPPOSED TO REFLASH THE BCM SOFTWARE),5) FCM,6) BCM,7) ALTERNATOR (CHARGING ISSUE AS OPPOSED TO CONTROL/REGULATION ISSUE...MAYBE SHORTED DIODES),8) GOD DARNED ELECTRICAL HARNESS,MIGHT THROW IN IGNITION SWITCH TOO. NOTED THAT DODGE HAS A TSB FOR OLDER MODELS WITH A SOFTWARE ALGORITHM ADJUSTMENT FOR FCM, BUT NOT IN EFFECT FOR 2003 MODELS?CAN THIS WORK FOR THE 2003?THIS WILL BE THE LAST DODGE WE EVER PURCHASE, OR THAT EXTENDED FAMILY EVER IS ASSOCIATED WITH, IF THIS IS NOT RESOLVED TO OUR SATISFACTION PROMPTLY. DR.Z AND/OR NHTSA - IF YOU WANT TO FLY SOMEONE DOWN HERE ASAP TO SEE THESE RESULTS REPRODUCED - WE GET THEM NIGHTLY - SO QUIT THE LIABILITY MITIGATION GAME AND GET THIS RESOLVED. FACTORY CAR. *JB",
        "vin": "1D4GP25393B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "08/25/2006",
        "dateOfIncident": "11/26/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166585,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 DODGE CARAVAN AND WHEN IT HAD ABOUT 20000 MILES, THE BRAKES BEGAN TO ACT WEIRD.  IN NOVEMBER OF 2005, MY WIFE REAR-ENDED ANOTHER VEHICLE BECAUSE THE BRAKE  PEDAL WENT ALMOST TO THE FLOOR AND THE BRAKES WOBBLED.  I HAD THE BRAKES REPLACED RIGHT AFTER THE ACCIDENT, BUT NOW THE BRAKES ARE DOING THE SAME THING.  THE VEHICLE NOW HAS 34000 MILES AND I AM GOING TO TAKE IT TO THE DEALER FOR INSPECTION. *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/17/2006",
        "dateOfIncident": "07/07/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10165714,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE HEAD LIGHTS INTERMITTENTLY GO OUT WHILE DRIVING.  THE VEHICLE WAS DRIVEN TO THE DEALER FOR INSPECTION HOWEVER THE PROBLEM COULD NOT BE DUPLICATED.  UPDATED 9/5/2006 - THE LAST TIME THE HEADLIGHTS WENT OFF THEY REMAINED OFF FOR ABOUT 10 SECONDS BEFORE THEY CAME BACK ON.  THE VEHICLE WAS TAKEN TO THE DEALER WHO REPLACED THE HEADLIGHT SWITCH.  *NM",
        "vin": "1D4GP45303B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/31/2006",
        "dateOfIncident": "06/22/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10164008,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THAT THE BRAKES HAD A RUST PROBLEM AND GRINDED EVERY TIME THEY WERE APPLIED.  THE PROBLEM WAS DUE TO THE BACKER PLATE ALLOWING WATER INTO THE BRAKE SYSTEM.  THE BRAKES WERE SERVICED TWICE BY AN INDEPENDENT DEALER AND ONCE BY A SERVICE DEALER.  THE MANUFACTURER WAS CONTACTED. THE VEHICLE WAS A LEASE AND THE BRAKES WERE OUT OF WARRANTY.",
        "vin": "1D4GP25R93B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/06/2006",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162617,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BRAKE DRUMS ON THE CONSUMER'S 2003 DODGE CARAVAN WERE TAKEN OFF 3 TIMES TO CLEAN OFF RUST WHICH CAUSED GRINDING WHEN THE BRAKES WERE APPLIED.  THEY WERE FIRST CLEANED AT 12000 MILES.*TS  THE MANUFACTURER IS AWARE OF THE PROBLEM.  *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/25/2006",
        "dateOfIncident": "06/25/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160706,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 1998 DODGE CARAVAN SUFFERED FROM THIS TWICE IN THE 5 1/2 YEARS WE DROVE IT.  FAILURE OF THE CLOCKSPRING, WHICH IS LOCATED IN THE HUB OF THE STEERING WHEEL.    RECALL NO. D17.   MY 2003 DODGE CARAVAN WITH 33000 MILES ON IT NOW HAS THE AIR BAG LIGHT COMING ON JUST LIKE MY 1998 DID.  IS THERE A SIMILAR PROBLEM ON THE 2003?  *JB",
        "vin": "1D4GP25R03B"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/15/2006",
        "dateOfIncident": "06/08/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159929,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A FLAT TIRE AND TRIED TO USE THE SPARE.  HOWEVER, THE WINCH TO LOWER THE SPARE TIRE HAD STRIPPED GEARS AND WOULD NOT LOWER.  THIS IS ONLY THE THIRD TIME I'VE EVER USED IT.  I FINALLY HAD TO TAKE IT TO THE DEALER TO HAVE IT REPAIRED.  THEY CHARGED $265.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "06/12/2006",
        "dateOfIncident": "05/21/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159599,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EMERGENCY BRAKE WILL NOT ENGAGE. LOOKS LIKE SOMETHING IS LOCKED UP INSIDE THE REAR DRUM RESULTING IN BRAKES TO ENGAGE WITH HIGH FORCE WITH JUST LIGHT BRAKE PEDAL PRESSURE.  *JB",
        "vin": "1D4GP25R83B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/03/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158908,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS DRIVING HER 2003 DODGE CARAVAN SPORT, ON HIGHWAY 664 WHEN THE ALARM INDICATION CAME ON AND THE VAN STALLED OUT, HAD TO BE TOWED HOME. IT WOULD NOT START UNTIL THE NEXT MORNING AND THIS TIME ON 664 WITH MY TWO CHILDREN IN THE VAN AND AN 18 WHEELER BEHIND HER THE ALARM LIGHT CAME ON AGAIN AND THE DARN THING STALLED OUT AGAIN. AGAIN IT WAS TOWED HOME AND IT IS STILL WON'T START. I CALLED THE DEALERSHIP THEY SAID THERE IS NOTHING THEY CAN DO FOR ME SINCE I BOUGHT THE VAN USED IN AUG 2004. I CALLED THE DODGE CORPORATE OFFICE AND THEY SAID THE SAME THING, THE VAN ONLY HAS 39,294 MILES ON IT. THE SECOND TIME MY WIFE AND CHILDREN WERE ALMOST KILLED!!!!!!!!!!!!!!!! TOOK THE VAN TO FIRESTONE AND THEY PUT THE ECU ANALYZER ON IT AND FOUND NO PROBLEMS CAUSED BY ANYTHING IT MONITORS.  *JB",
        "vin": "1D4GP45383B"
    },
    {
        "components": "VISIBILITY,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/23/2006",
        "dateOfIncident": "09/02/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158060,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 DODGE CARAVAN THIS VEHICLE HAS HAD A REPETITIVE PROBLEM OF DRIVER SIDE PASSENGER WINDOW MOTORS STOP WORKING.  UPON A VISIT TO A DODGE DEALER SHIP IN MY AREA OF ORLANDO FLORIDA THE REPAIR PERSON ADMITTED THAT THESE A BAD PARTS AND CONTINUE TO HAVE THE PROBLEM WITH MANY DODGE VEHICLES.  ALSO MY SECOND PROBLEM HE ADMITS IS ALSO A COMMON PROBLEM OF THE VEHICLE WHICH IS THE A/C TO LEAK INTO THE PASSENGER SIDE CARPET CAUSING MOLD TO BE CREATED UNTIL YOU REALIZE THE PROBLEM EXIST.  I TOOK MY VEHICLE TO BE REPAIRED AT THE DEALERSHIP AND AFTER HEARING THE REPAIR MAN SAY THAT THIS HAPPENS TO MAJORITY OF THE VEHICLES THEY REPAIR I DECIDED NOT TO REPAIR IT AND INSTEAD COMPLAIN TO ALL AGENCIES INCLUDING DAIMLER CHRYSLER WHO'S RESPOND IS THE ITEM IS OUT OF WARRANTY.  YET THEY RECEIVE THE SAME COMPLAINTS OVER AND OVER AND REFUSE TO RECALL ITEMS THEY KNOW TO BE FAULTY.  I LEARNED AND WILL NEVER PURCHASE A DODGE.  I FEEL THAT THIS AUTOMAKER SHOULD BE REVIEWED AND ASKED TO RECALL ITEMS THAT ARE FAULTY INSTEAD OF MAKING MONEY REPAIRING PARTS THEY KNOW ARE FAULTY AND WILL CONTINUE TO MALFUNCTION. I HAVE A VEHICLE WITH MOLD AND MILDEW DUE TO THE LEAKAGE PROBLEM THEY ARE AWARE THAT EXIST ON THIS A/C UNIT.  *NM",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/23/2006",
        "dateOfIncident": "05/22/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10158135,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE JUST HAD OUR 2003 DODGE CARAVAN FIXED AFTER THE CHECK ENGINE LIGHT HAD BEEN ON, AND IT STARTED TO SPUTTER.  NOW IT WAS WORKING FINE AND THE CHECK ENGINE LIGHT CAME BACK ON, THEN THE SPEEDOMETER, GAS GAUGE, HEAT GUAGE, AND DIGITAL MILEAGE DISPLAY ALL TURNED OFF AND WENT HAYWIRE.  THE DIGITAL DISPLAY TURNED OFF, WHILE THE GAUGES ALL FLOATED.  ALL OVER THE PLACE.  LAST TIME IT WAS THE OIL PRESSURE SENSOR AND THE VACUUM LINE FOR THE FUEL SYSTEM, AND BEFORE THAT AT ANOTHER RECENT EVENT WITH THE CHECK ENGINE LIGHT, IT WAS THE GAS CAP NEEDING TO BE REPLACED.  THERE ARE ONLY APPROX. 48,000 MILES ON THE MINIVAN.  WE'VE HAD TO REPLACE THE ROTORS TWICE SINCE WE GOT IN IN OCTOBER 2004.  IN THE TWO YEARS WE'VE HAD IT, WE'VE NEEDED TO GET RENTALS TWICE BECAUSE OF THIS.  STAY AWAY FROM THE 2003 DODGE CARAVAN...IF YOU CAN'T PASS IT UP, GET THE EXTRA COVERAGE.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/18/2006",
        "dateOfIncident": "04/14/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CARAVAN HAS SOME KIND OF TRANSMISSION PROBLEM. WHEN IT STARTS TO MESS UP IT WILL NOT CHANGE GEARS WHEN I AM DRIVING OR WILL SHUT DOWN AS I AM DRIVING (65 MPH). IT HAS BEEN HAPPENING FOR A YEAR AND HAS BEEN TO THE SHOP MANY (5+) TIMES. IT IS IN THE SHOP RIGHT NOW IN JOHNSONS OF CHICKASHA,OKLAHOMA(405-222-2062) SAY THEY CAN FIX IT BUT I DON'T BELIEVE THEY CAN. DAVID STANLY IN MIDWEST CITY HAS TRIED TOO. *JB",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/05/2006",
        "dateOfIncident": "03/30/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154624,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING IN DASH CHEWED BY RODENTS. DEALER STATES THEY CAME IN THROUGH AC DRAIN.....WILL NOT HONOR MAXIMUM CARE WARRANTY AND WILL DO NOTHING TO TRY AND STOP RECURRENCE, IT CAME FROM THE MANUFACTURER LIKE THIS. *JB",
        "vin": "1D4GP24323B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/27/2006",
        "dateOfIncident": "12/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10148830,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE TURNING THE STEERING WHEEL TO THE RIGHT OR TO THE LEFT; A WHINING AND GRINDING NOISE IS HEARD.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP FOUR TIMES. THE WATER PUMP, THE POWER STEERING PUMP AND THE ALTERNATOR HAVE BEEN REPLACED. THE REPAIRS HAVE NOT CORRECTED THE PROBLEM.   UPDATED 2/24/2006 - *NM",
        "vin": "1D4GP25373B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/12/2006",
        "dateOfIncident": "09/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147660,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATED WHEN DEPRESSING THE BRAKE PEDAL IT WENT ALL THE WAY TO THE FLOOR. THE VEHICLE WAS TAKEN TO THE DEALERSHIP, WHERE THE MASTER CYLINDER WAS REPLACED, WHICH FIXED THE VEHICLE TEMPORARILY.  THE BRAKES COMPLETELY FAILED A SECOND TIME A MONTH AFTER THE MASTER CYLINDER WAS REPLACED.  THE VEHICLE WAS TOWED TO THE DEALERSHIP. THE MASTER CYLINDER WAS REPLACED AGAIN. THE VEHICLE WAS DRIVEN FOR TWO WEEKS BEFORE THE BRAKES FAILED A THIRD TIME.  THE VEHICLE WAS RETURNED TO THE DEALER WHERE THE MASTER CYLINDER AND THE AUTO TRANSMISSION WERE REPLACED. THE CONTACT WAS NOT HAVING TRANSMISSION PROBLEMS WHEN THE BRAKE FAILURE OCCURRED, BUT THE DEALER REPLACED IT IN AN EFFORT TO ALLEVIATE THE BRAKING PROBLEMS. WHILE DRIVING HOME FROM THE DEALERSHIP THE BRAKES FAILED ONCE AGAIN. IN FOUR INCIDENTS OF BRAKE FAILURE SPEED OR ROAD CONDITIONS DID NOT APPEAR TO PLAY A PART.*AK",
        "vin": "2D4GP44L23R"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/05/2006",
        "dateOfIncident": "01/04/2006",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146972,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED 2003 DODGE CARAVAN AUGUST 10, 2003.  JUNE 9, 2004 - 11,438 MILES - BRAKES REPLACED, ROTORS RESURFACED.  OCTOBER 23, 2004 - 16,533 MILES - ROTORS RESURFACED.  MARCH 5, 2005 - 21,887 MILES - FAULTY BRAKE PADS REPLACED, ROTORS REMOVED AND REPLACED.  SEPTEMBER 24, 2005 - 29,609 MILES - ROTORS RESURFACED  JANUARY 4, 2006, 33,071 MILES - RECOMMENDED BRAKES REPLACEMENT AND ROTOR RESURFACING, DEALERSHIP REFUSING TO HONOR WARRANTY FOR BRAKES WITH LESS THAN 12 MONTH OR 12K MILES.  *JB",
        "vin": "1D4GP25R83B"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/01/2006",
        "dateOfIncident": "09/20/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146666,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 DODGE CARAVAN MAKES A LOT OF NOISE WHEN YOU GO OVER A BUMP WHEN I TOOK IT TO THE DEALER THEY TOLD ME THAT THE SWAY BAR LINK BUSHINGS WERE BAD.  CONVENIENTLY MY EXTENDED SERVICE AGREEMENT DID NOT COVER THIS AND THE SERVICE MANAGER STATED IT SHOULD BE BECAUSE EVERY CARAVAN THAT COMES IN HAS NEEDED THESE AND HE WAS SURPRISED IT WAS NOT COVERED. I HAVE BEEN TOLD THAT IF THESE BREAK IT COULD COMPROMISE THE STABILITY OF THE VEHICLE I HAVE ALSO HAD TO REPLACE THE BRAKE PADS AND ROTORS ON THIS VEHICLE TWICE AND IT HAS ONLY 59,000 MILES I HAVE ALSO HAD COMPLETE FAILURE OF THE COMPONENTS ON THE FRONT SIDE OF THE MOTOR LEADING TO REPLACEMENT OF THE ALTERNATOR, POWER STEERING PUMP, WATER PUMP, AC, AND THE MAIN DRIVE PULLEY OF THE MOTOR ALONG WITH THE LIGHTS RADIO,HEATER FAN AND TRANSMISSION ALL HAVING PROBLEMS. WHEN I CONTACTED CHRYSLER ABOUT THE SWAY BAR LINKS THEY TOLD ME THAT IT WAS MY PROBLEM NOT THEIRS. *JB",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/01/2006",
        "dateOfIncident": "11/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146670,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK MY 2003 DODGE CARAVAN IN FOR AN OIL CHANGES AND WAS INFORMED BY THE DEALERSHIP (AFTER HEARING A KNOCKING NOISE) THAT THE FOLLOWINGS THINGS NEED TO BE REPLACED ON THE VAN THAT ON HAS 51,000 MILES ON IT:  STEERING RACK AND FRONT   SWAY BAR BUSHINGS ALONG WITH THE ALTERNATOR AND BELT. *JB",
        "vin": "1D4GP25333B"
    },
    {
        "components": "STEERING,SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/29/2005",
        "dateOfIncident": "11/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146336,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THERE WAS A KNOCKING SOUND COMING FROM THE DRIVER'S SIDE OF THE VEHICLE. THIS HAPPENED EVERY TIME THE VEHICLE WAS DRIVEN OVER A BUMP IN THE ROAD. IT WAS TAKEN TO THE DEALERSHIP FOR MAINTENANCE AND THE NOISE WAS INSPECTED. THEY RECOMMENDED REPLACEMENT OF THE ALTERNATOR, RACK AND PINION STEERING, AND SWAY BAR BUSHINGS. DUE TO THE LOW MILEAGE ON THE VEHICLE THE CONTACT WAS SEEKING A SECOND OPINION BEFORE MAKING ANY REPAIRS.   *AK",
        "vin": "1D4GP25333B"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "12/09/2005",
        "dateOfIncident": "12/04/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144835,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  OVER THE WEEKEND DRIVERS SEAT BELT FAILURE (FEMALE CLASP) UNDER NORMAL CONDITIONS  2.  DRIVER OF VEHICLE WAS NOT COMPLIANT WITH OHIO STATE SEAT BELT LAWS AND NOT RESTRAINED IN CASE OF AN ACCIDENT  3.  I PURCHASED A NEW SEAT BELT PART FROM THE PARTS DEPARTMENT ASAP.  *NM",
        "vin": "3B303520"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/05/2005",
        "dateOfIncident": "11/30/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144444,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT STATED  VEHICLE STALLED EVERY TIME THA  HE APPLIED THE BRAKES IN COLD TEMPERATURES. THE DEALER AND MANUFACTURER HAVE NOT BEEN CONTACTED.  *AK",
        "vin": "1D4GP25303B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/30/2005",
        "dateOfIncident": "09/30/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144059,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED THE VEHICLE  MADE A GROWLING NOISE. ON COLDER DAYS  ONE  COULD HEAR NOISE  MORE OFTEN.  IN WARM  WEATHER  ONE WOULD NOT HEAR THE NOISE AS OFTEN. HE CONTACTED THE DEALER, THE DEALER DETERMINED  THAT  RACK AND PINION STEERING  NEEDED TO BE REPLACED. THEY SUGGESTED HE CONTACT THE MANUFACTURER.  *AK",
        "vin": "1D4GP25313B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/22/2005",
        "dateOfIncident": "11/02/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143421,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT STATES  THERE IS NHTSA RECALL CAMPAIGN  04V386000 CONCERNING THE STEERING: HYDRAULIC POWER ASSIST: HOSE, PIPING, AND CONNECTIONS. THE DEALER TOLD HIM THAT THE SOLUTION CALLED FOR THE  REPLACEMENT OF  THE POWER STEERING FLUID WITH TRANSMISSION FLUID. THE STEERING WHEEL MADE NOISE WHEN TURNING. THE STEERING WHEEL DID NOT MAKE THIS NOISE BEFORE THE RECALL WORK WAS COMPLETED.   *AK    UPDATED DEC 7 2005. *JB",
        "vin": "1D4GP243X3B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/22/2005",
        "dateOfIncident": "11/22/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143499,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 DODGE CARAVAN, WITH 40K MILES, WENT TO THE SHOP TODAY FOR NEW TIRES. AT THAT TIME I ALSO ASKED THAT THE FRONT END ALIGNMENT BE CHECKED AND CORRECTED, IF NECESSARY. A SHORT WHILE LATER I WAS CONTACTED BY THE MANAGER STATING THAT THEY COULD NOT DO A FRONT END ALIGNMENT DUE TO THE TIE ROD ENDS BEING SO LOOSE AND WORN OUT. WE LIVE ON A PAVED ROAD. THE VEHICLE WAS NEVER IN A FRONT COLLISION OR EVEN HIT A CURB, TO MY KNOWLEDGE. THE VEHICLE IS NOW PARKED AWAITING NEW TIE ROD ENDS. I CAN'T BELIEVE THAT CHRYSLER WOULD PUT SUCH JUNK ON A CAR IN SUCH A CRITICAL SAFETY AREA. I WONDER HOW MANY MORE DODGE CARAVAN'S HAVE A SIMILAR SERIOUS PROBLEMS?  *JB",
        "vin": "1D4GP253X3B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/21/2005",
        "dateOfIncident": "11/12/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143362,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN BRAKES GO TO FLOOR WHEN STOPPED CAUSING LOST OF BRAKING.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "10/28/2005",
        "dateOfIncident": "10/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10141127,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE CONTACT  EXPERIENCED A PROBLEM WITH THE ANTI LOCK BRAKES INCLUDING  EXTENDED STOPPING DISTANCE.   THIS FAILURE RESULTED IN A REAR END ACCIDENT AT A RED LIGHT WHEN THE BRAKES COMPLETELY FAILED.  SHE TOOK THE VEHICLE TO A DEALER, WHO COULD NOT DUPLICATE THE PROBLEM.  SHE TOOK THE VEHICLE TO AN INDEPENDENT REPAIR SHOP THAT DISCOVERED THERE WAS AN INCORRECT ALIGNMENT OF THE BRAKE SYSTEM.  AFTER THE DEALER INSTALLED A NEW BRAKE SYSTEM THERE HAVE BEEN NO FURTHER PROBLEMS.  *AK",
        "vin": "1D4GP25R23B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/11/2005",
        "dateOfIncident": "09/07/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139272,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT  OWNS A 2003 DODGE GRAND CARAVAN SPORT.  OVER A PERIOD OF ONE YEAR  HAS HAD A STEERING PROBLEM.  WHILE DRIVING THE VEHICLE THERE IS A WHINING NOISE THAT APPEARS TO COME FROM THE STEERING.  THIS HAPPENS EVERY TIME THE VEHICLE IS STARTED AND CONTINUES FOR APPROXIMATELY 8 MINUTES.  THE NOISE GETS LOUDER AS THE STEERING WHEEL IS TURNED, AND  FEEL A SLIGHT VIBRATION UNDERNEATH THE DRIVER'S SIDE FLOORBOARD.  THIS IS MORE NOTICEABLE WHEN HE TURNS THE WHEEL.  THE SERVICE DEALER REPLACED TWO POWER STEERING PUMPS, AND PROVIDED A REPLACEMENT OF THE RACK AND PINION, THE LAST TIME AT THE SERVICE DEALER THEY REPLACED A POWER STEERING HOSE AND INSTALLED AN NC FOR CUSTOMER SATISFACTION.  NONE OF THE REPLACEMENTS OR REPAIRS HAS REMEDIED THE PROBLEM.  THE COST OF REPAIRS HAS BEEN COVERED 50/50 BY THE CONSUMER AND THE DEALERSHIP.  THE MANUFACTURER REFERRED HIM TO THE LOCAL SERVICE DEALER.  AS OF THE LAST TIME THE VEHICLE WAS SERVICED ON  SEPTEMBER 7, 2005,  HOWEVER, THE PROBLEM STILL EXISTS.  THE PROBLEM SEEMS TO BE GETTING PROGRESSIVELY WORSE SINCE THE LAST TIME THE VEHICLE WAS SERVICED.*AK",
        "vin": "2D4GP44323R"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/06/2005",
        "dateOfIncident": "09/02/2005",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138963,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS DRIVEN APPROXIMATELY  5 MILES TO WHERE MY WIFE AND I WERE TO DROP OFF OUR DAUGHTER AT A FRIENDS HOUSE. UPON ARRIVING AT MY FRIENDS HOUSE, MY SON AND 3 OTHER PASSENGERS REMAINED IN THE VEHICLE AND DUE TO THE WEATHER, THE CAR REMAINED RUNNING WITH THE AC ON.  WHEN WE ENTERED OUR FRIENDS HOUSE, WE OBSERVED SMOKE AND FLAMES COMING FROM THE VEHICLE.  WE IMMEDIATE RAN TO THE VEHICLE TO GET OUR SON AND THE OTHER PASSENGERS OUT.  WE ATTEMPTED TO EXTINGUISH THE FLAMES AND PLACED A 911 CALL TO THE LOCAL FIRE DEPARTMENT.    *NM",
        "vin": "1D4GP25RX3B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "09/02/2005",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138456,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADING OFF TO THE MALL ONE EVENING, I DROPPED OFF MY WIFE AND MY SON, KEEPING MY OTHER SON AND HIS FRIEND WITH ME.  AS I PULLED AWAY, I HEARD A LOUD POP AND SMELLED AND SAW SMOKE. WHEN I GOT OUT OF THE CAR, I COULD SEE MELTING PLASTIC AND WHAT APPEARED TO BE SMALL FIRE BALLS DROPPING TO THE GROUND UNDER THE HOOD. I TURNED THE ENGINE OFF AND GOT THE KIDS OUT OF THE CAR . CALLED 911 AND BY THE TIME THEY GOT THERE FLAMES WERE 10-15 FEET IN THE AIR. THERE WAS A RE-CALL ON THIS CAR ABOUT A STEERING HOSE I BELIEVE THAT I HAD DONE. OTHER THAN THAT I HAVE NEVER HAD ANY OTHER PROBLEMS WITH THIS CAR. IT WAS ONLY 2 YEARS OLD AND HAD ONLY 17,000 MILES ON IT. THE CAR HAS BEEN TOTALED.*JB",
        "vin": "1D4GP25R83B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "09/30/2005",
        "dateOfIncident": "09/30/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138231,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GRINDING NOISE FROM POWER STEERING SYSTEM. *JB",
        "vin": "1D4GP25R03B"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/30/2005",
        "dateOfIncident": "04/26/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138830,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER REQUEST CHRYSLER CONTACT QUADRIPLEGIC CUSTOMERS & COMPANIES THAT MODIFY VANS RE AIR CONDITIONER LUBRICATION DEFECT, WANTS REIMBURSEMENT FOR HIS 2003 DODGE CARAVAN EX. *TS  THE CONSUMER RECEIVED A RECALL IN RE TO A/C LUBRICATION PROBLEM.  IT ALSO STATED THAT THE MANUFACTURER WAS EXTENDING THE WARRANTY TO 70000 MILES.  THE CONSUMER DECIDED TO WAIT TO HAVE THE A/C REPAIRED.  WHILE THE CONSUMER WAS ON THE HIGHWAY HE DECIDED TO TURN ON THE A/C.  WHEN HE DID THE COMPRESSOR LICKED UP AND RIPPED OFF THE SERPENTINE BELT WHICH RESULTED IN LOSS OF POWER STEERING, BRAKES, ALTERNATOR AND BRAKES, ENGINE COOLING SYSTEM.  THE VEHICLE WAS TOED TO A SERVICE STATION WHERE THEY REPLACED THE BELT.  THE MANUFACTURER REFUSED TO REIMBURSE THE CONSUMER FOR TOWING BECAUSE THE VEHICLE WAS TOWED TO A CHRYSLER DEALERSHIP.  SECONDLY THEY REFUSED TO REPLACE ANY OF THE COMPONENTS WHICH WERE DAMAGED S A RESULT OF THE A/C FAILURE NOT REPAIRED BY A CHRYSLER.  (THE VEHICLE WAS  MODIFIED BY BRAUN CORPORATION).  *NM",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "09/23/2005",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137412,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: NOTICED THAT AROUND SEPTEMBER 1, 2004 THAT THE DESIGNED SEAT OF THE SECOND ROW SEATS HINGE IN THE FRONT SEAT  LOCKS ON THE BACK. WHEN LOCKING THE SEAT IT APPEARS THAT THEY ARE LOCK.  BUT, IN REALITY,  THEY ARE NOT LOCKING  IN THE BACK OF SECOND ROW SEAT. THERE IS NO INDICATION THAT THE SEAT IS NOT PROPERLY LOCKED.  WHEN CHILDREN ARE IN THE SEAT AND ITS IS NOT LOCKED IT WILL ROTATE FORWARD. THE ROW IN FRONT  FEATURES A HARD PLASTIC HANDLE THAT IF THE CHILDREN WOULD HIT WOULD CAUSE EVEN MORE DAMAGE WHEN NOT PROPERLY LOCKED DOWN. THIS HAPPENED WITH THE CONSUMER'S  CHILD IN THE VEHICLE, AND THE ENTIRE WEIGHT OF THE SEAT WAS ON HIM.  HE HIT THE BACK FRONT SEAT, AND THIS BROKE TEETH. CONTACTED MANUFACTURER AND THEY JUST COMPLAINT. *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/15/2005",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137739,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN ACCELERATOR BECAME STUCK WIDE OPEN.*MR  THE DEALER EXPLAINED TO THE CONSUMER THAT THE WARRANTY WOULD NOT COVER THE PROBLEM BECAUSE THE LINKAGE HAD BEE COMPROMISED DUE TO VARNISH.  THEY INDICATED THAT THIS COULD HAS RESULT FROM BAD GAS OR AN UNCLEAN AIR FILTER.    *NM",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/08/2005",
        "dateOfIncident": "08/27/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10135783,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "APPROX. 10:30 ON SAT. AUG. 27TH, 2005 I DROVE MY 2003 DODGE CARAVAN TO WAL-MART ON BLEACHERY BLVD TO GET MY SON A HAT FOR THE PARADE HE WOULD BE IN AT NOON THAT DAY. AS I PARKED MY VAN AND TURNED OFF THE IGNITION AND TURNED TO LOOK FOR MY PURSE ON THE BACK SEAT, I DECIDED TO GET OUT AND OPEN THE LEFT BACK SLIDING DOOR.  AS I TURNED GETTING OUT OF THE VAN THE DRIVERS AIRBAG EXPLODED IN MY BACK AND PUSHED ME THE REST OF THE WAY OUT OF THE VEHICLE. MY FATHER AND SON WERE WITH ME AND MY FATHER CALLED 911.  THE FIRE DEPT. CAME AND MADE A REPORT BECAUSE THE AIRBAG CAUSE WHELPS AND BURNS ON MY BACK AND I LATER WENT TO THE ER AFTER MY SON FINISHED HIS EVENTS FOR THE DAY. THE FIRE DEPT. CALLED APD(POLICE)AT THE TIME OF THE INCIDENT... THE OFFICER (KEITH MCCULLOCH #2600) SAID THAT BECAUSE I WAS SITTING STILL AND HAD NOT HIT ANYTHING AND NOTHING HIT ME, THERE WAS NO ACCIDENT THERE WAS NO POLICE REPORT NEEDED.. HE THEN GAVE ME THE PHONE NUMBER TO THE NHTSA AND SAID TO FILE A COMPLAINT.... SINCE THEN I HAVE BEEN TRYING TO GET CHRYSLER TO RESOLVE THE MATTER QUICKLY SO I CAN GET MY VEHICLE BACK. THEY HAVE DRUG THEIR FEET ON THE MATTER AND SAID THAT I WOULD HAVE TO WAIT UNTIL THEY MADE A DECISION IN ABOUT 10 WORKING DAYS.  THE INCIDENT IS A CLEAR DEFECT AND THEY ARE TRYING MAKE IT OUT TO BE MY FAULT. *JB",
        "vin": "1D4GP25B03B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/15/2005",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132877,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PADS AND ROTOR HAVE NEEDED TO BE REPLACED TWICE, NOVEMBER OF 2004, AND AUGUST OF 2005.  *JB",
        "vin": "1D4GP25343B"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "08/03/2005",
        "dateOfIncident": "07/20/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131251,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT OWNED A 2003 DODGE CARAVAN.  THE CONTACT STATED WHILE TRYING TO GET INTO  VEHICLE A FEW WEEKS AGO REALIZED THAT ON THE PASSENGER SIDE DOOR THERE WAS NO KEY LOCK TO UNLOCK THE DOOR FROM THE OUTSIDE.  THE VEHICLE HAS THE KEYLESS ENTRY SYSTEM WHICH UNLOCKS ALL OF THE DOORS. HE DRIVER'S SIDE DOOR WAS THE ONLY DOOR THAT HAS THE ACTUAL KEY LOCK.  THE CONSUMER CONTACTED THE SERVICE DEALER, WHO STATED IT WAS THE DESIGN OF THE VEHICLE. *AK",
        "vin": "1D4GP24353B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/20/2005",
        "dateOfIncident": "07/16/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129419,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE TRANSMISSION WOULD NOT GO INTO DRIVE, REVERSE, AND ALL THE WAY TO PARK.  IT WOULD FINALLY GO INTO DRIVE AFTER IN WAS IN PARK FOR A FEW MINUTES. HAD NOT CONTACTED DODGE DEALER YET, BUT THIS STARTED HAPPENING LAST SATURDAY JULY 16, 2005. NOTICED SINCE THEN WHEN COMING TO A STOP IT MADE A CLINKING NOISE LIKE IT WAS TRYINGTO  SHIFT DOWN. *AK",
        "vin": "2D4GP44383R"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/27/2005",
        "dateOfIncident": "06/20/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126741,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 CARAVAN AND A 2004 RAM AND HAVE HAD ONGOING ISSUES WITH MY BRAKES.  I BELEIVE THAT THE FACTORY MUST HAVE USED FAULTY ROTORS.  LAST AUGUST, TO MY AMAZEMENT I HAD TO HAVE THE ROTORS TURNED WHEN THE DEALER PUT NEW PADS ON MY CARAVAN (26,000 MILES).  I BEGRUDGINGLY PAID OVER 200 DOLLARS FOR THIS.  9 MONTHS LATER THE BRAKES AND STEERING WHEEL ARE PULSING AGAIN AND THE DEALER IS TELLING ME THE ROTORS MUST BE TURNED AGAIN EVEN THOUGH THE PADS ARE FINE.  I EXPECTED THAT THE DEALER WOULD TAKE CARE OF THIS SINCE THEY WERE JUST SERVICED 9 MONTHS AGO BUT THEY SAID I WAS 200 MILES OVER THE LIMIT.  I ALSO HAD THE SAME ISSUE WITH MY RAM AND EVEN THOUGH I HAD MORE THAN 50% OF MY PADS LEFT I HAD WARPED ROTORS AND HAD TO PAY THE DEALER TO HAVE THEM TURNED.  I SPOKE WITH THE SERVICE MANAGER AT LITHIA DODGE IN OMAHA, PREVIOUSLY JIMS DODGE, AND HE HAD THE AUDACITY TO TELL ME IF I REPLACE THE ROTORS THE NEW ONES WILL BE GUARANTEED FOR LIFE NOT TO WARP!  WHY WOULD YOU GUARANTEE THE AFTERMARKET ROTORS BUT NOT THE ROTORS FROM THE FACTORY??!",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING,POWER TRAIN,ELECTRICAL SYSTEM,EXTERIOR LIGHTING,STRUCTURE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/24/2005",
        "dateOfIncident": "01/08/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10127972,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER HAD SEVERAL PROBLEMS WITH HIS 2003 DODGE CARAVAN; SUCH PROBLEMS WERE A KNOCK IN THE TRANSMISSION AND 2 BRAKE JOBS.   *JB   THE TWO BRAKES JOBS OCCURRED WITHIN ONE YEAR.  THE STEERING WHEEL KNOCKED (RECALL CAMPAIGN #04V386000), THE VEHICLE HAD BROKEN DOWN AT 8K MILES, THE WHEEL ALIGNMENT WAS OFF, THE GEAR PANEL ILLUMINATED, AND THE WINDOW HAD BECOME LOOSE.  80% OF THE VEHICLES PROBLEMS WAS UNDER 10K MILES.  THE ROTATION NOISE CONTINUED AND THE RUBBER LINING AROUND THE SLIDING DOOR WAS COMING OFF.  OTHER PROBLEMS:  WHEN THE VEHICLE WOULD BE TAKEN OUT OF PARK TO DRIVE, ALL OF THE LIGHTS WOULD ILLUMINATE, THE FRONT RIMS/HUB CAPS WERE DIRTY DUE TO EXCESSIVE LEAKAGE AROUND THE BRAKES, EVEN DURING NORMAL WASHING, THERE WAS A MILD RINGING NOISE IN THE VEHICLE, THE FRONT DOOR RATTLED, THE REAR TAIL LAMP WAS DAMAGED, THE BRAKE LIGHT AND BACK-UP LIGHTS HAD GONE OUT, THE BRAKES WERE GOING BAD AGAIN, THE ENGINE WOULD SPUTTER DUE TO NO FUEL PRESSURE, THE VEHICLE WOULD PULL TO THE LEFT, WHEN THE DRIVER DOOR WAS SHUT IT MADE A LOUD RATTLE SOUND, THERE WOULD BE A DELAY IN THE TRANSMISSION WHEN GOING UPHILL, WHEN SITTING AT IDLE, THE ENGINE WOULD SOUND AS IF IT WERE REVVING BUT THE GAUGE DID NOT DISPLAY THIS.   *SC  *JB",
        "vin": "1D4GP25393B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/17/2005",
        "dateOfIncident": "09/10/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125591,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION PROBLEM, WHEN TAKING OFF VEHICLE HESITATES SHIFTING INTO GEAR. WHEN COMING TO A STOP HARD DOWNSHIFT AND FEELS LIKE BEING HIT IN REAR END. ON ONE OCCASION RECENTLY GOING UP HILL VAN SHIFTED INTO NEUTRAL FOR NO REASON. FIRST TIME FIXED AT 4493 MILES 9/10/04, MILEAGE 2ND TIME PROBLEM APPX 5850  MILEAGE TODAY 5950 AS OF 6/17/05 REPORTED TO DEALER 6/14/05 5908 MILES APT FOR FIXING 6/29/05",
        "vin": "1D4GP25R03B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/03/2005",
        "dateOfIncident": "12/10/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119926,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TWO AND A HALF WEEKS AFTER THE VEHICLE WAS PURCHASED THERE WAS A JERKING AND CLICKING NOISE WHENEVER THE VEHICLE WENT UP A HILL.  THE VEHICLE ONLY HAD 279 MILES ON IT AT THE TIME.  THE VEHICLE WAS TAKEN TO THE DEALER AND WAS TOLD THAT NOTHING WAS WRONG.  AT 1829 MILES, CHECK ENGINE LIGHT CAME ON AND CYLINDER NUMBER 4 WAS MISFIRING.  THE DEALER REPLACED A SPARK PLUG.  AFTER 13,301  MILES THIS HAPPENED AGAIN.  AT 14,456 MILES THE REAR WHEELS MOVED BUT THE FRONT WHEELS WOULD MOVE ALONG WITH BIG NOISE.  THERE WAS HESITATION AND RUMBLING WHEN IN DRIVE.  TOOK TO DEALER AND FOUND FRONT PUMP IN TRANSMISSION HAD FAILED. THE PUMP WAS REPLACED.  ON APRIL 4-7, 2005 AGAIN TO DEALER WHO FOUND NOTHING WRONG.  ON APRIL 28, 2005 HESITATION ALONG WITH CHECK ENGINE LIGHT CAME ON.  APRIL 29 CAR HAD TO BE TOWED TO DEALER.  MAY 2, 2005 WAS TOLD NEED REPLACEMENT OF VALVE BODY AND TRANSMISSION.  CHECK ENGINE LIGHT CAME ON SEVERAL TIMES.  ALL THIS OCCURRED AS CAR HAS YET TO HAVE 15,000 ACTUAL MILES.   *NM  *NM",
        "vin": "1D4GP45R84B"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "06/02/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123917,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM LEASING A 2003 DODGE CARAVAN. I HAVE NOTICED THAT THE MILEAGE ON THE VEHICLE IS UNUSUALLY HIGH. AT THE END OF A TWO YEAR PERIOD I HAD OVER 33000 MILES ON THE VEHICLE. I DRIVE 40 MILES PER DAY ROUND TRIP TO WORK 5 DAYS A WEEK MINUS 2WEEKS VACATION. THE VEHICLE IS DRIVEN NO MORE THAN 50 MILES ON THE WEEKENDS. WE PREVIOUSLY LEASED A VEHICLE FOR 18 MONTHS A KIA SPORTAGEAND DUE TO MECHANICAL PROBLEMS CANCELLED THE LEASE FOR THE CARAVAN. WHEN WE MADE THE TRADE THE KIA HAD 22000 MILES ON IT AND OUR DRIVING HABITS HAVE NOT CHANGED. IS THERE A WAY TO CHECK THE ODOMETER FOR ACCURACY? I BELIEVE THE DEALER HAS MODIFIED THE ODOMETER TO GET PENALTY MILEAGE AT THE END OF THE LEASE.",
        "vin": "1D4GP25323B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/25/2005",
        "dateOfIncident": "04/26/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10124688,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE GRAND CARAVAN LOCKED UP.*MR  THE VEHICLE STEERING LOCK UP WHILE DRIVING.  THE CONSUMER MANAGED TO PULL THE VEHICLE OVER ONTO THE SIDE OF THE ROAD.  THE DEALER DETERMINED THAT A BELT HAD SHEARED OFF AND CAUSED A LEAK.  SHORTLY AFTER THE REPAIRS WERE MADE THE CONSUMER RECEIVED A RECALL FOR THE UPPER POWER STEERING RETURN HOSE AND BELIEVES THAT THIS RECALL IS RELATED TO THE PROBLEM HER VEHICLE HAD.  THE CONSUMER REQUEST REIMBURSEMENT FOR REPAIRS.  *NM",
        "vin": "1D4GP24393B"
    },
    {
        "components": "ELECTRICAL SYSTEM,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/22/2005",
        "dateOfIncident": "05/20/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121831,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "SPORT UTILITY",
                "productYear": "1994",
                "type": "Equipment"
            }
        ],
        "summary": "MY 2003 DODGE CARAVAN WILL NOT START, SINCE FRI. MAY 20,2005. IT IS NOW AT SUPREME CO. 281-996-7888 FRANK FOUND THE PROBLEM TO BE THE IGNITION SWITCH. THE IGNITION SWITCH DESTROYED THE STARTER AND RELAY AND THE IGNITION SWITCH CAN ONLY BE PURCHASED THRU THE DEALER. WHY IS A 2003 DODGE CARAVAN HAVE SUCH A PROBLEM? HAS SUCH A PROBLEM BEEN REPORTED? WHY SHOULD THE CONSUMER HAVE TO PAY FOR SUCH DEFECT?",
        "vin": "2D4GP44343R"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/19/2005",
        "dateOfIncident": "05/11/2004",
        "fire": true,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121622,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE VEHICLE CAUGHT FIRE.  FIRE STARTED FROM  THE ENGINE. THE INSURANCE COMPANY STATED IT WAS A POWER STEERING HOSE THAT RUPTURED.  *JB",
        "vin": "2D4GP44L83R"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/17/2005",
        "dateOfIncident": "05/16/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10121181,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT  CONSUMER STATED THE POWER STEERING HOSE IS CROSSING OVER THE WATER LINE AND THE CLAMPS LEADING TO THE RADIATOR.  HE STATES THIS COULD CAUSE LOSS OF STEERING CONTROL AND THE VEHICLE HAS BEEN REPAIRED.  *JB  *SB",
        "vin": "1D4GP25B93B"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/16/2005",
        "dateOfIncident": "05/15/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10120986,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT  CONSUMER STATES THE HEADLIGHTS ON HER VEHICLE GOES OFF AND ON.  THE VEHICLE HAS BEEN SERVICED ON TEN DIFFERENT OCCASIONS, BUT THE SERVICE DEALER STATES THEY CAN'T FIND ANYTHING WRONG WITH THE VEHICLE.    *TT",
        "vin": "1D4GP25303B"
    },
    {
        "components": "STEERING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/07/2005",
        "dateOfIncident": "04/06/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10116570,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "C BODY",
                "productYear": "1969",
                "type": "Equipment"
            }
        ],
        "summary": "THE POWER STEERING RACK AND PINION ASSEMBLY ON MY 2003 DODGE CARAVAN HAS HAD TO BE REPLACED TWICE IN 50000 MILES OF DRIVING.  THERE WAS NO SPECIFIC EVENT LEADING TO THESE COMPONANT FAILURES.  THE DEFECT CAUSES ROUGH VEHICLE HANDLING I.E. ALIGNMENT PROBLEMS.  THIS WILL BE THE THIRD RACK AND PINION ASSEMBLY INSTALLED ON THIS VEHICLE, FACTORY INSTALLED AND TWO REPLACEMENTS.  ORIGINALLY INSTALLED ASSEMBLY WAS DISCARDED.  THE TWO REPALCEMENTS WERE PERFORMED BY THE ORIGINAL SELLING DEALERSHIP, MONROE CHRYSLER SUPERSTORES, USING MOPAR REPLACEMENTS.*AK",
        "vin": "1D4GP25393B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/04/2005",
        "dateOfIncident": "04/01/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10117702,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN HAD PROBLEMS WITH THE POWER STEERING PUMP.*MR  THE CONSUMER STATED WHEN HE MADE A LEFT TURN A LOUD NOISE WAS HEARD.  *JB",
        "vin": "1D4GP25373B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/24/2005",
        "dateOfIncident": "03/18/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114606,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STREERING WHEEL NO LONGER LOCKS WHEN KEY IS REMOVED. WE HAVE SEVERAL DODGE MINI VANS (YEARS 03,04) IN OUR WORK FLEET AND 4 OF THE 5 HAVE THE SAME PROBLEM.",
        "vin": "1D4GP25333B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/09/2005",
        "dateOfIncident": "02/08/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113795,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING CONSUMER HEARD A GRINDING NOISE COMING FROM THE POWER STEERING COLUMN.  DEALERSHIP WILL BE NOTIFIED. *AK",
        "vin": "2D4GP74L13R"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/09/2005",
        "dateOfIncident": "03/08/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112803,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I MANAGE A FLEET THAT CONTAINS 13, 2003 DODGE CARAVANS. SO FAR 5 OF THE 13 VANS HAS HAD PROBLEMS WITH THE ENGINE OIL SENSOR. ALL THE PROBLEMS HAVE OCCURRED BETWEEN 16,000 AND 18,000 MILES. THE DEALER DOESN'T SEEM TO WANT TO DO ANYTHING PROACTIVE ABOUT CHANGING OUT THE OTHER SENSORS ON THE OTHER 8 VEHICLES. I CALLED CORPORATE AND THEY TOOK THE SAME STANCE, AND SUGGESTED I CONTACT NHTSA. THE PROBLEM HAPPENS WHEN THE CAR IS BEING DRIVEN, ALL OF A SUDDEN THE ENGINE OIL LIGHT WILL COME ON. THE DRIVER DOESN'T KNOW IF THE ENGINE IS GETTING OIL OR NOT. SOMETIMES SHUTTING OFF THE ENGINE AND TURNING IT BACK ON TURNS OFF THE LIGHT, AND SOMETIMES IT DOESN'T. SINCE THIS HAS HAPPENED TO A HIGH PERCENTAGE OF MY FLEET, I BELIEVE IT SHOULD BE LOOKED INTO.*AK",
        "vin": "1D4GP25BX3B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/08/2005",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109436,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS HAVING A DIFFICULT TIME STOPPING WHEN THE BRAKES ARE APPLIED AT VARIOUS SPEEDS. MANUFACTURER WAS NOTIFIED BY CONSUMER.*AK  THE VEHICLE NEEDED TWO FRONT ROTORS.  *TC",
        "vin": "1D4GP25B83B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "02/22/2005",
        "dateOfIncident": "04/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10112821,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ROTOS AND BRAKES WORN AT 15,000 MILES. CONTACTED THE DEALER. HOWEVER, THE PROBLEM REMAINED.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/11/2005",
        "dateOfIncident": "01/10/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10110364,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WAS DRIVING THE VAN ON THE HIGHWAY WHEN THE RADIO AND HEAT CONTINUED TO GO ON AND OFF, THEN THE WIPERS AND LIGHTS WENT. ONCE THE VAN SLOWED DOWN AND CAME TO A STOP EVERYTHING CAME BACK ON. WAS LOOKED AT BY A DEALER AND THEY SAID THEY NEED TO REPLACE THE CLUSTER MODULE. ONE MONTH WENT BY WITH NO PROBLEM THEN IT REPEATED ALL THE ABOVE. BROUGHT TO THE DEALER AGAIN AND THEY SAID THAT THEY THOUGHT IT MAY BE THE IGNITION SWITCH. THEY REPLACED SWITCH AND I DROVE THE VAN THEN WHEN RETURNING FROM MY DESTINATION IT REPEATED THE PROBLEM AGAIN. DEALERSHIP LOOKED AT IT AGAIN RAN ALL THE TESTS THEY COULD THINK OF AND COULDN'T FIND THE CAUSE. THEY SAID BRING IT BACK WHEN IT HAPPENS AGAIN AND HOPEFULLY SOMETHING COULD BE PICKED UP ON THE MACHINE.   *JB",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2005",
        "dateOfIncident": "01/31/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109361,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER WAS FILLING UP THE GAS TANK AT A GAS STATION AND NOTICED THAT THE VEHICLE WAS LEAKING GASOLINE FROM UNDERNEATH THE VEHICLE.  DRIVER TOOK VEHICLE TO THE DEALER  FOR INSPECTION, AND MECHANIC DETERMINED THAT THE FUEL TANK NEEDED TO BE REPLACED.  DRIVER INFORMED THE MECHANIC THAT RECALL NOTICE 02V274000 FUEL TANK CONTROL VALVE WELD WAS ISSUED.  THIS  VEHICLE  WAS NOT COVERED UNDER  THIS RECALL. THIS DISCUSSION WAS HELD WITH VEHICLE SAFETY HOT LINE OPERATOR.  *AK",
        "vin": "2B4GP74L02R"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/19/2005",
        "dateOfIncident": "01/19/2005",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107559,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTORS AND BRAKE PADS HAD TO BE REPLACED AT 20,000 MILES.  THE GARAGE THAT DID THE WORK STATED THAT 1ST BRAKES SHOULD LAST APPROXIMATELY 40,000 MILES.  DODGE/CHRYSLER WOULD NOT INVESTIGATE THE PROBLEM TOLD ME THAT THEY ONLY COVERED BRAKES FOR 12,000 MILES.  I'VE NEVER REPLACED BRAKES AT 12,000 MILES....   *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/06/2005",
        "dateOfIncident": "12/14/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106928,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKING  AT ANY SPEED CONSUMER WOULD HAVE TO PUMP THE BRAKES TO DECELERATE THE VEHICLE.  DEALERSHIP REPAIRED VEHICLE 5 TIMES, BUT THE  THE SAME PROBLEMS RECURRED. *AK",
        "vin": "1D4GP24373B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/29/2004",
        "dateOfIncident": "12/23/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104709,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 DODGE CARAVAN HAD A FAULTY BEARING IN THE ALTERNATOR WHICH REQUIRED COMPLETE REPLACEMENT WITH ONLY 47,000 MILES ON THE VEHICLE.  I AM A LONG-TIME DODGE OWNER, HAVING OWNED AND DRIVEN TWO DODGE OMNIS, TWO DODGE DAKOTA PICK-UPS AND THIS IS MY SECOND CARAVAN, THE FIRST WENT 110,000 MILES.  I HAVE NEVER NEEDED TO REPLACE AN ALTERNATOR, AND I DRIVE MOST OF MY VEHICLES UNTIL THEY HAVE 150,000 TO 200,000 MILES.   *NM",
        "vin": "1D4GP25353B"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/12/2004",
        "dateOfIncident": "07/13/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098763,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD VIBRATION TYPE RATTLE COMING FROM UNDER VEHICLE, OCCURS MOSTLY AT AROUND 30 TO 40 MPH WHEN DRIVING SLOW WITH VEHICLE UNDER SLIGHT STRAIN IN  GEAR (AUTOMATIC TRANSMISSION).  BEEN TO DEALER +- 6 TIMES, ONE DEALER CHANGED EXHAUST SYSTEM TO NO AVAIL. ITS GETTING WORSE AS TIME GOES ON. CHRYSLER HAS NO CLUE WHAT IT IS.? *JB",
        "vin": ""
    },
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "11/12/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101354,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PASSENGER SIDE REAR TIRE WAS RUBBING THE WHEEL WELL.   *NM  THE INNER FENDER WHEEL COVER  HAD BEEN MODIFIED FOR THE HANDICAP WHEEL CHAIR CAUSING THE  FUEL TANK AND HOSES TO BE OFF CENTER. MODIFICATIONS WERE NOT MADE BY CHRYSLER.   *TC",
        "vin": "2D4GP74LX3R"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099277,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RECALL 04V386000/POWER STEERING FLUID LEAKAGE: DEALER REFUSED TO HONOR CONSUMER'S RECALL NOTICE.*AK",
        "vin": "1D8GP24R53B"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/27/2004",
        "dateOfIncident": "10/07/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10097849,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING ANY SPEED STEERING WHEEL JERKED AND MADE A SQUEAKING NOISE. DEALERSHIP INFORMED THE CONSUMER  THAT THE PROBLEM PERRTAINED TO POWER STEERING PUMP FAILURE. THE PROBLEM WAS NOT RESOLVED. *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/13/2004",
        "dateOfIncident": "10/13/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096747,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE STEERING WANDERED ON ITS OWN. THE DRIVER NOTICED THAT THE STEERING WHEEL WOULD MAKE A LOUD SQUEAKING NOISE. THE CONSUMER TOOK THE VEHICLE TO THE MECHANIC FOR AN INSPECTION.  THE MECHANIC INFORMED THE CONSUMER THAT THE STEERING SHAFT NEEDED TO BE REPLACED.  PLEASE FILL IN ADDITIONAL INFORMATION.*JB",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "08/18/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092103,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE VEHICLE STALLED. THE DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. THE CAUSE WAS NOT DETERMINED.",
        "vin": "1D4GP25B33B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/28/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10087659,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN STALLING PROBLEM.   *MR   WHILE THE VEHICLE WAS IN MOTION IT DIED IN THE MIDDLE OF THE ROAD.  THE STEERING WHEEL AND THE BRAKE PEDAL BECAME STUCK.  INCIDENT DATE:  JULY 29, 2004.   *SC  *JB",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "07/15/2004",
        "dateOfIncident": "06/17/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10079494,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR PASSENGER SIDE SEAT LUNGED FORWARD. AS A RESULT, CONSUMER  SUSTAINED A CONCUSSION AND A BLACK EYE. *AK  THE SEAT WAS LEFT RECLINED BY THE OWNER'S DAUGHTER BEFORE INCIDENT OCCURRED.  AS CONSUMER TRIED TO RETRIEVE SOME ITEMS FROM THE REAR DRIVER SIDE, CONSUMER LEANED ACROSS THE SEAT AND PULLED THE LEVER TO RAISE IT FROM THE RECLINED POSITION.  AS THE SEAT LUNGED FORWARD, IT HIT THE CONSUMER'S HEAD FORCING IT TO HIT THE HANDLE OF THE FRONT PASSENGER SEAT.  *LA",
        "vin": "2D4GP54L73R"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/29/2004",
        "dateOfIncident": "06/15/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079032,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A RAIN SHOWER, WITH MY WIPERS ON. THE WIPERS STOPPED HALF WAY. THIS WAY THE SECOND TIME THIS HAD HAPPENED DURING A RAIN SHOWER. THE WIPERS WILL RESTART AFTER A FEW MINUTES. THIS IS A SERIOUS PROBLEM AND NEED TO BE ADDRESSED BY THE MANUFACTURER. I HAVE SCHEDULED THE VEHICLE FOR SERVICE, BUT I BELIEVE THIS SHOULD BE COVERED BY THE MANUFACTURER. I WAS LUCKY, SOMEONE ELSE MAY NOT BE!!*AK",
        "vin": "1D4GP25353B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/24/2004",
        "dateOfIncident": "06/10/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10078764,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FLUID WAS REPLACED BY DEALER AT 34,000 MILES. AFTER LEAVING DEALERSHIP, VAN EXPERIENCED HARD DOWNSHIFTING AT 30 MPH.  DEALER SAID A CONTROL MODULE ON THE SIDE OF THE TRANSMISSION WAS FAULTY AND IT WAS REPLACED. VAN CONTINUED TO EXPERIENCE HARD DOWNSHIFT AT 30MPH, SO IT WAS AGAIN RETURNED TO THE DEALER. PROBLEM WAS CORRECTED, BUT NO FURTHER EXPLANATION OFFERED.*AK",
        "vin": "1D4GP25363B"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "05/28/2004",
        "dateOfIncident": "05/28/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074416,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED  ON SMALL INCLINE, WITHOUT ANY WARNING VEHICLE START ROLL BACKWARD.  THE VEHICLE FINALLY STOPPED WHEN IT HIT A UTILITY POLL.  DEALER AND MANUFACTURER WERE NOTIFIED.    *LA",
        "vin": "1D4GP25373B"
    },
    {
        "components": "AIR BAGS,SEAT BELTS",
        "crash": true,
        "dateComplaintFiled": "04/29/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10064895,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS IN AN ACCIDENT. THE SEAT BELTS DID NOT PROPERLY RESTRAIN THE DRIVER.  THE AIR BAGS ALSO FAILED TO DEPLOY UNTIL AFTER THE DRIVER HIT THE STEERING WHEEL.  *NM   *LA",
        "vin": "1D4GP25353B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/09/2004",
        "dateOfIncident": "04/09/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066905,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE APPLYING THE BRAKES PEDAL WENT TO THE FLOOR. THIS CAUSED THE CONSUMER TO LOSE BRAKING POWER.  BUT THE DRIVER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE, AND DROVE IT TO THE DEALER FOR INSPECTION.  MECHANIC  DETERMINED THAT FRONT BRAKE PADS AND ROTORS NEEDED  TO BE REPLACED.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,TIRES",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053564,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE VEHICLE'S MANUAL AND THE TIRE MANUAL HAVE SPECIAL CUSTOM SHOWING  A TREAD PATTERN WITH SOLID RUBBER ON THE SIDE OF THE TIRE. AS A RESULT, WATER WAS UNABLE TO ESCAPE WHICH CAUSED THE TIRE TO HYDRO PLANE OR SPIN EASILY WHEN DRIVING  ON  WET SURFACES.  THE CONSUMER REPLACED THE TIRES  WHICH CORRECTED THE PROBLEM,  BUT THE FUEL WAS LESS PER GALLON THAN ANTICIPATED IN THE MANUALS. *AK   *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/10/2004",
        "dateOfIncident": "01/12/2004",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10056935,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "POWER STEERING PUMP WHINES WHEN VEHICLE HAS BEEN DRIVEN AT HIGHWAY SPEEDS FOR A PERIOD OF TIME.  WHEN VEHICLE COMES TO A STOP A LOUD WHINING NOISE COMES FROM POWER STEERING.  WHINING IS AGGREVATED WHEN STEERING WHEEL IS TURNED FROM SIDE TO SIDE.  NOISE CHANGES WITH SPEED OF THE ENGINE.  MY FLUID LEVEL IS AT NORMAL.  MY DEALERS ANSWER WAS TO OVERFILL THE RESERVOIR WITH FLUID.  NOW THAT THE FLUID LEVEL IS COMPLETELY FILLED TO THE TOP OF THE RESERVOIR, INCLUDING THE NECK OF THE RESERVOIR, THE NOISE HAS GONE AWAY.  IT APPEARS THE RESERVOIR IS TOO SMALL FOR THE VEHICLE.*AK",
        "vin": "1D4GP25323B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "07/15/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069110,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST PROBLEM HAPPENED ON 4/24/03 TRANSMISSION STUCK IN SECOND GEAR WOULD NOT SHIFT.  DEALERSHIP REMOVED AND DISASSEMBLED TRANSMISSION.  FOUND A LOT OF METAL FILINGS AND FOUND TORQUE CONVERTER FAILURE.  THEY REPLACED CLUTCHES AND CONVERTER, REASSEMBLED.  THE SECOND TIME THE TRANSMISSION BLEW.  THE DEALERSHIP INSPECTED TRANSMISSION AND THERE WAS A HOLE IN THE CASE, DIFFERENTIAL FAILURE.  THEY REPLACED THE TRANSMISSION.  THE BRAND NEW FROM THE FACTORY TRANSMISSION IS DOING THE SAME AS WHEN WE FIRST BOUGHT IT. I BELIEVE IT IS A LEMON.",
        "vin": "1D4GP25B23B"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "11/15/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069129,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "POOR GAS MILAGE 13MILES/GALLON",
        "vin": "1D8GP25B53B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/13/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053956,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LEAKED CARBON MONOXIDE.  TOOK VEHICLE TO THE DEALERSHIP. 4 DAYS LATER  CONSUMER  PICKED UP VEHICLE FROM THE DEALERSHIP, AND WAS TOLD THAT THE CARBON MONOXIDE LEAKAGE WOULD NOT DUPLICATE ITSELF.  *AK",
        "vin": "1D4GP24RX3B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/08/2004",
        "dateOfIncident": "10/12/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10053643,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING TRANSMISSION FAILED, CAUSING  CONSUMER TO PULL OFF THE HIGHWAY.  DRIVER HAD  VEHICLE TOWED TO THE DEALER. *AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/02/2004",
        "dateOfIncident": "08/15/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051531,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASE A 2003 DODGE CARAVAN.  THE HEADLIGHT SWITCH IS NOT ILLUMINATED.  MY DEALER SAYS THAT THE ILLUMINATION WAS REMOVED IN THE 2003 MODELS.  DOES THIS COMPLY WITH TITLE 49 PART 571 STANDARD NO 101?  *AK",
        "vin": "1D4GP25R03B"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "12/18/2003",
        "dateOfIncident": "09/13/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10051738,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS REAR ENDED WHILE AT A COMPLETE STOP. DRIVER'S SIDE  AND PASSENGER'S SIDE SEAT BACKS COLLAPSED.  DRIVER AND PASSENGER SUSTAINED NECK INJURIES.  *AK",
        "vin": "1D4GT25363D"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "12/04/2003",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10050078,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE WAITING AT A RED LIGHT, THE CONSUMERS VEHICLE WAS STRUCK FROM THE BEHIND BY ANOTHER VEHICLE, DRIVING FROM 55 TO 60 MPH.  AT THE MOMENT OF IMPACT THE DRIVERS SEAT BACK COLLAPSED, SLAMMING THE CONSUMER ONTO THE REAR SEATS.  SEAT BELTS WERE WORN AT THE TIME OF THE COLLISION. THE POLICE ARRIVED ON THE SCENE AND CITED THE OTHER DRIVER.  THE CONSUMER SUFFERED NECK AND SPINAL INJURIES.  THE MANUFACTURER AND THE DEALER ARE AWARE OF THE PROBLEM.     *PH  *MR",
        "vin": "1D4GP25R53B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/02/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050230,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH FUEL MILEAGE ON 2003 DODGE CARAVAN SE.*MR  THE CONSUMER DISCOVERED THE FUEL MILEAGE WAS 13 MPG CITY DRIVING AND 20 MPG HIGHWAY DRIVING.  THE CONSUMER STATED THE MANUFACTURER ADVERTISED THE MPG AS 19 FOR CITY DRIVING AND 26 FOR THE HIGHWAY.  *JB   *NM",
        "vin": "1D4GP25363B"
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "11/29/2003",
        "dateOfIncident": "11/24/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10048839,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "40 TO 60 MPH REAR END CRASH BY BMW INTO STATIONARY (TRANS IN DRIVE, WAITING TO EXIT EXPRESSWAY) 2003 DODGE CARAVAN SPORT - (ONLY DRIVER AND FRONT PASSENGER IN CARAVAN, BOTH WITH SEAT BELTS FASTENED)  ALL SEAT BACKS COLLAPSED BACKWARD, INCLUDING MIDDLE BENCH, BOTH DRIVER AND PASSENGER WERE FLUNG BACK CAUSING NECK INJURIES.  IF A CHILD HAD BEEN SITTING ON THE MIDDLE BENCH SEAT THEY MAY HAVE BEEN CRUSHED.  IN ADDITION THE DRIVER SIDE VISOR DETACHED COMPLETELY (ELECTRICAL WIRES TORN OUT FROM VISOR LIGHT) AND FLEW INTO THE DRIVERS FACE.  THE CARAVAN AFTER BEING HIT WAS PUSHED INTO THE NEXT CAR IN FRONT OF IT.  NEITHER THE DRIVER SIDE OR PASSENGER SIDE AIRBAGS DEPLOYED.*AK",
        "vin": "1D4GP45383B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/21/2003",
        "dateOfIncident": "11/21/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048511,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE FILLING UP THE FUEL TANK, THE VALVE JOINT SEPARATED FROM GAS TANK, CAUSING GASOLINE TO POUR OUT.  THE DRIVER HAD THE VEHICLE TOWED TO THE DEALER FOR ANALYSIS.  THE MECHANIC RECOMMENDED THAT THE FUEL TANK BE REPLACED DUE TO A CRACK.   *NLM",
        "vin": "2FMZA5244YB"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/08/2003",
        "dateOfIncident": "10/22/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045753,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY NEW 2003 DODGE CARAVAN SE HAS A PRONOUNCED BIAS TO THE LEFT WHEN DRIVING AT SPEED ON AN INTERSTATE HIGHWAY. I BELIEVE THIS HAS BOTH SAFETY AND TYRE WEAR IMPLICATIONS. MY LOCAL GOOD YEAR DEALER SAID IT'S A PROBLEM WITH VEHICLE ALIGNMENT AFTER PUTTING THE CAR UP ON A LIFT. THE DEALER HAS SAID IT'S A PROBLEM WITH THE TYRE. THE CAR WILL BE SERVICED AT THE DEALR ON 11/14/2003.*AK",
        "vin": "1D8GP25RX3B"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "10/29/2003",
        "dateOfIncident": "10/29/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043879,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER ONLY 25000 MILES ON MY NEW VAN, DODGE VARAVAN I NEED ALL NEW BRAKES. I WAS NOT TOLD WHEN I BOUGHT IT THAT THE REAR BRAKES HAVE TO BE ADJUSTED AT 10000 MILES.*AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/03/2003",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041147,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A SUBSTANTIAL 'RATTLE' COMING FROM THE RACK AND PINION STEERING, STARTED AT ABOUT 47,000 MILES. UNABLE TO DETERMINE IF IT CAN CAUSE A STEERING PROBLEM. *JB",
        "vin": "1B4GP25B91B"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/10/2003",
        "dateOfIncident": "07/31/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037585,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THE CAR NEW IN NOVEMBER OF 2002.  I HAVE BEEN COMPLAINING OF FUEL ECONOMY SINCE THE CAR WAS NEW.  I AM NOT GETTING CLOSE TO WHAT IS LISTED AT 19-25 MPG.  DEALER HAS BEEN TOLD OF THIS SEVERAL TIMES.  THEY ARE UNABLE TO FIND A PROBLEM.   *JB",
        "vin": "1D4GP25383B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/10/2003",
        "dateOfIncident": "08/10/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037586,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CAR, THE TRANSMISSION STARTED TO GO IN NEUTRAL AND THEN TO DRIVE.   *JB",
        "vin": "1D4GP25383B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/10/2003",
        "dateOfIncident": "08/03/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037587,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MOVING THE CAR IN THE DRIVEWAY I HEARD SOME LOUD BANGING NOISES.  I STOPPED AND LOOKED IN THE DRIVEWAY AND FOUND BRAKE PARTS LAYING IN THE DRIVEWAY FROM THIS CAR.  WAS TOWED TO DEALER. *JB",
        "vin": "1D4GP25383B"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/13/2003",
        "dateOfIncident": "04/24/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032754,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SECURITY/VTA LAMP ILLUMINATED ON THE INSTRUMENT CLUSTER.   TOOK IT INTO THE DEALER FOR SERVICE.  SERVICE DEPARTMENT STATED THAT THE PART WAS ON BACK-ORDER.  THE PART HAS STILL NOT BEEN RECEIVED AS OF AUG 18, 2003.  *AK",
        "vin": "1D4GP253X3B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/06/2003",
        "dateOfIncident": "05/12/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032198,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ABS LIGHT COMES ON WHILE CONSUMER IS DRIVING.*AK",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/05/2003",
        "dateOfIncident": "07/31/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10030820,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING A RENTAL 2003 DODGE CARAVAN FROM ALAMO WITH 6,435 MILES ON IT.  I WAS IN A PARKING LOT MOVING AT APPROXIMATELY 3 MPH WHEN BOTH THE DRIVER AND PASSENGER AIRBAGS WERE DEPLOYED WITHOUT WARNING.*AK",
        "vin": "1D4GP24343B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": "07/23/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030394,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN - BRAKE FAILURE AT 6500 MILES, REPLACED CALIPERS AND PADS  BRAKE FAILURE AT 11800 MILES, REPLACED PADS, ROTORS, SHOES, DEALER STATED NPF  IN CAUSE OF FAILURE, BLAMES DRIVER ABUSE?  SOMETHING WRONG IN BRAKE BOOSTER OR OTHER CAUSES TO WHY BRAKES NEED REPLACING AT LOW MILEAGE INTERVALS AND NOT COVERED BY CHRYSLER WARRANTY.",
        "vin": "1D4GP25313B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10031544,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT INTERMITTENTLY NOT ABLE TO PHYSICALLY CHANGE TRANSMISSION GEAR TO THE REVERSE SETTING.  ALSO, INTERMITTENTLY WHEN GEAR IS IN REVERSE, VEHICLE WILL ROLL FORWARD.",
        "vin": "1D4GP25373B"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/28/2003",
        "dateOfIncident": "06/24/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026775,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Bridgestone Americas Tire Operations",
                "productMake": "BRIDGESTONE",
                "productModel": "BRIDGESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE BRIDGESTONE TIRE, TURANZA EL42 ,215/65R16, BLACK WALLS.  THE CONSUMER TRIED TO GET A HOLD OF THE MANUFACTURER BUT WAS LEFT ON HOLD SEVERAL TIMES WITH NO RESULTS.   *AK   THE CONSUMER ATTEMPTED TO MAKE A TURN WHEN THE VEHICLE FISHTAILED .  THE CONSUMER HEARD A NOISE IN THE REAR OF THE VEHICLE AND VIEWED SMOKE IN THE REAR.  WHEN THE VEHICLE  WAS STOPPED, THE CONSUMER SAW THE TIRE WAS SHREDDED.   *SCC   *JB",
        "vin": "2D4GP44L63R"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/25/2003",
        "dateOfIncident": "05/16/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020092,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE BACKING UP THE VEHICLES RIGHT SIDE COLLAPSED WITHOUT WARNING. THE DEALER STATED THAT THE SUSPENSION BOLT WAS MISSING.   *NLM   *CB",
        "vin": "1D4GP25B73B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/11/2003",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10021555,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY WHEN THE VEHICLE WAS IN THE REVERSE WITH THE GEAR AND GAS PEDAL DEPRESSED, THE VEHICLE DIDN'T ACCELERATE OR WHEN IT WAS IN THE DRIVE GEAR AND GAS PEDAL WAS DEPRESSED, THE VEHICLE WOULD GO INTO REVERSE.   *AK   THIS PROBLEM OCCURRED THREE TIMES A WEEK WHEN THE VEHICLE WAS IN FIRST GEAR.  THE ENGINE REVVED, BUT THE VEHICLE DIDN'T MOVE.  THE CONSUMER'S FOOT WAS ON THE GAS, AND HAD NO IDEA THE VEHICLE WOULD MOVE.  THE VEHICLE HAD BEEN BACK TO THE DEALER ON THREE OCCASIONS;  THE FIRST TIME FOR WARRANTY, THE SECOND TIME THE VEHICLE WAS INVOLVED IN AN ACCIDENT, AND THE THIRD TIME THE DEALER WASN'T SUCCESSFUL WITH FINDING THE PROBLEM.  THE CONSUMER DISCOVERED FORD HAD PROBLEMS WITH THEIR TRANSMISSIONS.   *SCC    *JB",
        "vin": "1D4GP25B13B"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/23/2003",
        "dateOfIncident": "06/23/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10024722,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE ON WEDNESDAY JUNE/1//03 VEHICLE STALLED AND TOWED THE VEHICLE TO THE DEALER.  DEALER REPLACED A SENSOR. BUT  ON SATURDAY JUNE/21/03, VEHICLE STALLED, AND TOWED AGAIN TO THE DEALER. *AK",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/29/2003",
        "dateOfIncident": "04/20/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020676,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WINDSHIELD WIPERS BECAME STUCK TOGETHER DURING AN OUT OF TOWN TRIP.  THERE WAS A HARD RAIN AND WE WERE DRIVING ALONG THE INTERSTATE WITH MANY OTHER PERSONAL AND COMMERCIAL VEHICLES WHEN WE ENCOUNTERED THE PROBLEM.  WE WERE FORCED TO PULL OFF THE ROAD AND MANUALLY DISENGAGE THE WIPER BLADES FROM ONE ANOTHER.  WE THEN PROCEEDED TOWARD OUR DESTINATION WHEN THE SAME PROBLEM OCCURRED AGAIN.  UPON OUR RETURN HOME OUR VEHICLE WAS TAKEN TO THE DEALER AND THE INCIDENT WAS REPORTED.  THE SERVICE PERSONNEL SEEMED VERY DISINTERESTED AND SIMPLY REPLACED THE BLADES WITH CHEAP REFILLS. WE WERE TOLD THAT NEW WIPER BLADES WERE BEING ORDERED BUT WE HAVE YET TO HEAR FROM ANYONE (ONE MONTH LATER).  WE HAVE CONTACTED THE DEALER ON SEVERAL OCCATIONS BUT WE HAVE NOT RECEIVED A RESPONSE.  THEIR SERVICE AFTER THE SELL IS EXTREMELY LOUSY TO SAY THE LEAST!    STILL WAITING",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/08/2003",
        "dateOfIncident": "02/17/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10018425,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 DODGE CARAVAN IS A PIECE OF GARBAGE! MY NEW CARAVAN HAD A RECALL FOR A PART IN THE TRANSMISSION. IT IS NOISY, RUFF RUNNING, AND IT DOES NOT GET 21-27 MILES PER GALLON AS ADVERTISED!! 12 MILES PER GALLON IS MORE REALISTIC. BE WARNED! THIS VAN IS TERRIBLE. LOOK AT OTHER VANS DO NOT BUY OR LEASE THIS VEHICLE. THIS HAS BEEN BROUGHT TO THE ATTENTION OF CHRYSLER AND MAROONE DODGE AND THEY WILL DO NOTHING ABOUT IT. GO ELSEWHERE! THEY ARE NOT 5 STAR THEY SUCK!  *NLM",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/28/2003",
        "dateOfIncident": "04/28/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016605,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING IN RESPONSE TO A REPORT THAT WAS FEATURED ON THE NEWS ON 4/27/03 CONCERNING  THE GEN 3 SEAT BELTS ON CHRYSLER AND DODGE VEHICLES.  I WAS VERY ALARMED AT THE INFORMATION THAT THESE SEAT BELTS CAN EASILY BECOME UNLATCHED WITH MINIMAL PRESSURE SUCH AS AN ELBOW OR DRINK CONTAINER.  THE REPORT ALSO SHOWED THE \"BALL TEST\"  WHICH EASILY DISENGAGED THE SEAT BELT.  THERE WERE SEVERAL OWNERS OF VEHICLES FEATURED, INCLUDING A WOMAN WHO LOST HER HUSBAND IN AN ACCIDENT WHEN HIS GEN 3 SEAT BELT UNLATCHED DURING AN ACCIDENT AND HE WAS THROWN 30 FEET.  CHRYSLER HAS INSISTED THAT THE SEAT BELT MEETS ALL SAFETY STANDARDS, HOWEVER IT WAS REPORTED THAT THEY HAVE CHANGED THE SEAT BELTS IN SOME OF THEIR NEWER MODEL CARS, INCLUDING THE FRONT SEAT, BUT NOT THE REAR SEAT OF THE CARAVAN,  I QUESTION WHY THEY WOULD CHANGE THE BELT IF THERE WAS NO PROBLEM.  I FEEL A SERIOUS INVESTIGATION IS NEEDED TO PROTECT THE SAFETY OF ALL DRIVERS AND PASSENGERS OF CHRYSLER AND DODGE VEHICLES.  *NLM",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/28/2003",
        "dateOfIncident": "04/07/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016629,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS JUST MADE AWARE OF THE FACT THAT MY 2003 DODGE CARAVAN HAS THE GEN. 3 SEAT BELTS IN THE REAR SEATS.  I HAVE THREE CHILDREN AND THEIR SAFETY IS IMPERATIVE.  MY 4 YEAR OLD SON HAS ACCIDENTALLY BUMPED MY 2 YEAR OLD'S CAR SEAT AT LEAST TEN TIMES, OPENING THE GEN 3 SEAT BELT...THEREBY MAKING MY DAUGHTER UNSAFE.    *NLM",
        "vin": "1D4GP25313B"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/27/2003",
        "dateOfIncident": "03/10/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016579,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY \"BRAND-NEW\" 03 DODGE CARAVAN HAS RUSTY AND OLD PARTS INSIDE.  IT HAS LESS THAN 3500 MILES, AND THERE ARE PROBLEMS WITH THE TRANSMISSION ALREADY, THE BRAKES MAKE A SLIGHT NOISE, AND THE BATTERY STARTED CORRODING, TOO.  WHEN I CALLED DAIMLER-CHRYSLER, THEY WOULD NOT GIVE ME SPECIFIC INFORMATION ABOUT MY VEHICLE.  I AM QUESTIONING WHETHER MY VEHICLE IS REALLY NEW...  I PAID WAY TOO MUCH FOR IT TO BE ACTING THIS WAY - AGAIN UNDER 3500 MILES!    *NLM",
        "vin": ""
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "02/21/2003",
        "dateOfIncident": "01/17/2003",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10007944,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BACK WHEEL FREEZE UP WHEN DRIVEN ON WET ROADS AND WHEN IT GETS COLD AT NIGHT.THE NEXT MORNING YOU CAN'T MOVE IT.",
        "vin": "1D4GP25333B"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/31/2003",
        "dateOfIncident": "12/30/2002",
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005024,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT A 2003 SPORT GRAND CARAVAN ON DEC 30, 2003.  THE SAME DAY, I DISCOVERED THE VEHICAL VIBRATE ON REVERSE ON GENTLE SLOPE.  LATER, TEST DRIVE TWO OTHER NEW 2003 SPORT GRAND CARAVAN = LESS VIBRATION. TEST DRIVE 2002 (13000 MILES) SPORT GRAND CARAVAN = NO VIBRATION AT ALL.  THE DEALER ACKNOWLEDGE THE PROBLEM AND REFUSE TO FIX THE PROBLEM BECAUSE THERE IS NO RECALL FROM THE MANUFACTURER.",
        "vin": "2D4GP44333R"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/26/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023330,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATE WHILE TRAVELING 40 MPH THEIR WAS A SMALL ROCK ON ROAD CONSUMER AVOID THE WITH TIRE CAUSING ROCK TO TRAVEL UNDER VEHICLE. CONSUMER NOTICE A LOUD NOISE FLOWING FUEL SMELL. CONSUMER PULL VEHICLE OVER AND NOTICE FUEL SPRAYING FROM UNDER VEHICLE. DEALER AND MANUFACTURE HAS BEEN CONTACTED. PLEASE PROVIDE FURTHER INFORMATION. TS",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/27/2002",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Chrysler (FCA US, LLC)",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 768950,
        "products": [
            {
                "manufacturer": "Chrysler (FCA US, LLC)",
                "productMake": "DODGE",
                "productModel": "CARAVAN",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE NIGHT OF OCTOBER 24, 2002, I PURCHASED A NEW 2003 DODGE SXT MINIVAN.  ON OCTOBER 25, 2002, I DISCOVERED EXPOSED ELECTRICAL WIRES UNDER BOTH THE DRIVER AND PASSENGER FRONT SEATS.  WHEN I REPORTED THIS TO THE DEALER ON OCTOBER 25, 2002, SALES AND CUSTOMER SERVICE REPRESENTATIVES INFORMED ME THIS IS THE CONFIGURATION FOR THE NEW 2003 DODGE CARAVAN SXT.  DAIMLER-CHRYSLER MADE A DECISION TO ELIMINATE WHAT HAD BEEN STORAGE COMPARTMENTS UNDER THE TWO SEATS.  THE DRIVER AND PASSENGER CHAIR BASE HAS HOLES DRILLED TO ACCEPT STORAGE DRAWERS, HOWEVER, NONE ARE INSTALLED.  UNDER BOTH SEATS ONE FINDS AN ACCUMULATION OF EXPOSED ELECTRICAL WIRES.  I WOULD NOT HAVE PURCHASED THE VAN HAD I DISCOVERED THIS THE NIGHT OF THE PURCHASE.  THIS IS NOT AN ISOLATED INCIDENT.  ON OCTOBER 25, 2002, THE DAVID STANLEY DODGE SALES AND CUSTOMER SERVICE PEOPLE INFORMED ME THIS IS STANDARD ON THE NEW CARAVAN STX.  IN MY OPINION, THIS IS A SIGNIFICANT SAFETY HAZARD AFFECTING EVERY 2003 DODGE CARAVAN SXT MINIVAN PRODUCED.  CONSEQUENTLY, EVERY OWNER SHOULD BE NOTIFIED OF THIS HAZARD; DAIMLER-CHRYSLER SHOULD CORRECT THE PROBLEM ON ALL FUTURE PRODUCTION, A RECALL SHOULD BE MADE TO INSTALL DRAWERS TO COVER THE EXPOSED WIRES OR SOME SORT OF FACE PLATE SHOULD BE MANUFACTURED WHICH COULD BE INSTALLED OVER THE OPENING ON THE FRONT OF THE DRIVER AND PASSENGER CHAIR BASE TO COVER THESE EXPOSED ELECTRICAL WIRES.  AGAIN, I REPEAT THIS IS NOT AN ISOLATED INCIDENT.  THESE EXPOSED ELECTRICAL WIRES EXIST ON EVERY 2003 DODGE CARAVAN SXT.  BY THE WAY, THE DEALER FROM WHOM I PURCHASED THE VEHICLE REFUSED TO TAKE ANY CORRECTIVE ACTION CITING COST AS THE REASON.  THE DEALER'S CUSTOMER SERVICE REPRESENTATIVE ACKNOWLEDGED A SAFETY PROBLEM EXISTS.  I FILED A COMPLAINT WITH THE DEALER.  I URGE NHSTA TO TAKE IMMEDIATE ACTION ON THIS ISSUE BEFORE SOME CATASTROPHE BEFALLS SOMEONE BECAUSE OF THE EXPOSED ELECTRICAL WIRES ON ALL NEW 2003 DODGE CARAVAN SXT MINIVANS.  DT",
        "vin": "1D4GP253X3B"
    }
]