[
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/24/2010",
        "dateOfIncident": "11/14/2005",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357344,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FLEETWOOD BOUNDER RV. THE CONTACT STATED THAT WHENEVER HE WOULD OPERATE THE VEHICLE, HE WOULD NOTICE THAT THE LCD SHIFT INDICATOR WOULD TAKE UNUSUALLY LONG TO ILLUMINATE BEFORE FAILING COMPLETELY. THE VEHICLE WAS NOT DIAGNOSED FOR THE FAILURE OR REPAIRED. THE FAILURE MILEAGE WAS 20,000 AND THE CURRENT MILEAGE WAS 40,000.",
        "vin": "5B4MP67G233"
    },
    {
        "components": "SERVICE BRAKES, AIR",
        "crash": false,
        "dateComplaintFiled": "11/12/2009",
        "dateOfIncident": "07/31/2009",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10291958,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FLEETWOOD BOUNDER 35E RV.  WHILE DRIVING APPROXIMATELY 35 MPH, THE BRAKE WARNING LIGHT ILLUMINATED ON THE INSTRUMENT PANEL.  HE THEN SMELLED A STRONG BURNING ODOR.  THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER FOR INSPECTION.  THE TECHNICIAN STATED THAT THE FRONT BRAKE CALIPER MELTED THE SENSOR. THE VEHICLE WAS REPAIRED UNDER RECALL CAMPAIGN ID NUMBER 09V198000 (SERVICE BRAKES, AIR).   THE MANUFACTURER REFUSED TO ACCEPT FINANCIAL RESPONSIBILITY FOR THE REAR BRAKE SYSTEM REPLACEMENT. THE VEHICLE HAS NOT BEEN REPAIRED FOR THE REAR BRAKES.  THE FAILURE AND CURRENT MILEAGES WERE 13,760. THE VEHICLE IDENTIFICATION NUMBER WAS UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/04/2009",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260641,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DUAL PANE WINDOWS IN MY MOTOR HOME ARE FOGGED UP MAKING IT HARD TO SEE IN MY REAR VIEW MIRROR.  THERE ARE MORE WINDOWS FOGGING UP BUT NOT ONES THAT WOULD AFFECT MY ABILITY TO SEE WHILE DRIVING.  FLEETWOOD KNOWS ABOUT THIS PROBLEM BUT CONTINUES TO DO BUSINESS WITH SI-GE WINDOWS AND IS NOT CONCERNED WITH THE PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/02/2009",
        "dateOfIncident": "12/16/2008",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260419,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN  2003 BOUNDER BUILT ON THE W/22 (WORKHORSE) CHASIS.. THREE TIMES  NOW I HAVE HAD MY LEFT FRONT ABS (BOSCH SYSTEM) BRAKE WHEN APPLIED GOING DOWN STEEP GRADE DRAG. MEANING RATHER THAN THE PUMPING ACTION OF ABS IT WAS NOT RELEASING, AND ONE COULD HERE AND FEEL THE SOUND SIMILAR TO METAL ON METAL. PULLED OFF TO SIDE OF ROAD AND FELT ALL WHEELS. LEFT FRONT ACTUALLY SLIGHTLY BLISTERED MY FINGER TIPS. IN A FEW WEEKS I AM AS PART OF MY MAINTENANCE SCHEDULE HAVING THE BRAKE SYSTEM BLED. I AM HOPING THAT WHEN THEY PULL MY WHEELS THAT ALL IS WELL. THE MH HAS 23,385 MILES ON IT. TWO YEARS AGO A ZRK FITTING WAS INSTALLED ON THE BELL CRANK. *TR",
        "vin": "5B4MP67G733"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/28/2008",
        "dateOfIncident": "08/29/2008",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246982,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE FAILURES(2) ON 2003 BOUNDER MOTORHOME WITH WORKHORSE W22 CHASSIS. CHASSIS PURCHASED NEW ON JAN.14,2004. LR BRAKE FAILED ON 8-29-08 ON I-5 AT OLYMPIA, WA, WITH APPROX. 21,100 MILES ON VEHICLE. RR BRAKE FAILED ON 9-29-08 ON HWY. 20 IN COUPEVILLE, WA AT APPROX.21,482 MILES. WEATHER WAS CLEAR AND ROADS WERE DRY; DUAL HOLDING TANKS WERE EMPTY; 100 GAL WATER TANK WAS ALSO EMPTY; FUEL TANK WAS ABOUT 1/2 FULL (35 GAL.). MOTORHOME WAS NOT OVERLOADED AND NO VEHICLE WAS IN TOW. 8-29 FAILURE  OCCURRED WHILE SLOWING IN PRE-LABOR DAY WEEKEND TRAFFIC AND BRAKE PEDAL WENT TO THE FLOOR ON INITIAL APPLICATION. REPEATED APPLICATIONS OF BRAKE PEDAL GAVE ABOUT 1/2 PEDAL TRAVEL WITH GREATLY LESSENED DECELERATION TIME AND STOPPING DISTANCE . THE SECOND FAILURE ON 9-29-08 OF THE RIGHT REAR BRAKE ASSEMBLY WAS LESS SURPRISING AND BRAKE PEDAL PUMPING WAS MORE INSTINCTIVE.  STOPPING A  24,000 POUND MOTORHOME ON AN EMERGENCY BRAKE  THAT MERELY CLAMPS AROUND THE DRIVE SHAFT IS NOT A VIABLE OPTION. REPAIRS REQUIRED REPLACEMENT OF ALL AFFECTED BRAKE ROTORS, BOSCH CALIPERS, AND BRAKE PADS, PLUS A WHEEL SPEED SENSOR FOR THE ABS SYSTEM ON THE RIGHT REAR BRAKE FAILURE. APPROX. $2200 IN REPAIR COSTS FOR TWO BRAKES. A NEIGHBOR OF MINE WITH EXACT SAME YEAR AND MODEL MOTORHOME/CHASSIS AS MINE IS NOW AT A REPAIR FACILITY IN YUBA CITY, CA HAVING EXPERIENCED FAILURE OR BURN-OUT OF ALL 4 BRAKE  ASSEMBLES  WHILE ENROUTE FROM RENO,NV TO SACRAMENTO,CA.. I STRONGLY FEEL THAT THE SAFETY RECALL ON W-22  BRAKE SYSTEMS NEEDS TO BE EXTENDED BEYOND THE CHASSIS #33356806 CUTOFF SPECIFIED IN NHSTA RECALL 04V084000. THANK YOU FOR YOUR TIME AND CONSIDERATION IN THIS MATTER.  *TR",
        "vin": "5B4MP67G233"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/10/2008",
        "dateOfIncident": "08/05/2008",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245061,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 BOUNDER MOTOR HOME BUILT ON THE WORK HORSE CHASSIS. ON AUG. 08, 2008 WHEN I STARTED MY MOTOR HOME I NOTICED THAT THE LCD SCREEN (WINDOW) WAS IMPOSSIBLE TO READ. THIS LCD WINDOW IS PRT OF THE ACTIA INSTRUMENT CLUSTER. I CALLED A WORK HORSE AUTHORIZED REPAIR CENTER IN BATH, NY AND MADE AN APPOINTMENT FOR AUG. 24. THEY TOLD ME IN THE MEANTIME THEY WOULD CONTACT WORK HORSE ON THIS TO SEE WHAT COULD BE DONE TO SPEED UP THE REPAIR. IN THAT TIME PERIOD WORK HORSE DID NOT GET BACK TO THEM, AND SO THE DAY I ARRIVED AFTER DRIVING OVER TWO HOURS I WAS INFORMED NO WORD YET. I KNEW THAT THEY HAD TO DO A DIAGNOSTIC TO VERIFY THE PROBLEM. ALL ONE HAD TO DO WAS LOOK AT THE SCREEN AND SEE THAT NOTHING ON IT COULD BE READ.    THE SCREEN SERVES A NUMBER OF FUNCTIONS BESIDE SHOWING WHAT GEAR THE VEHICLE IS IN. RIGHT NOW IT IS A MATTER OF FEELING THE SHIFT THROUGH TO DRIVE. FIRST CLICK REVERSE, 2ND. CLICK NEUTRAL, 3RD. CLICK DRIVE. ANY OTHER DOWN SHIFT TOO DANGEROUS TRYING TO FIND 3, 2, 1....THE LCD SCREEN ALSO SHOWS THE MILEAGE WHICH IS NOT ABLE TO BE READ. CAN'T SELL IT OR TRADE IF I WANTED TO. IT ALSO SHOWS MPG, OIL PRESSURE, INDIVIDUAL TRIP, AND A NUMBER OF OTHER DRIVER AID FUNCTIONS..IT IS PART OF THE WARNING SYSTEM OF A NUMBER OF PROBLEMS. NOW IF A BUZZER OR BEEP SOUNDS THE SCREEN WOULD NORMALLY INDICATE WHAT IT IS ABOUT. KIND OF LIKE DRIVING BLIND!   THE ACTIA CLUSTER HAD A RECALL REPAIR ON THIS FEB. 2006, I BOUGHT THE MH MARCH 2006. THE RECALL PERTAINED TO A RE-PROGRAMMING OF THE INSTRUMENT CLUSTER FOR THE ABS BRAKE WARNING. THE LCD IS PART OF THE INSTRUMENT CLUSTER..WH SAID THE DEALERSHIP WAS NOT AN AUTHORIZED WH DEALERSHIP. IT DID TO GET DONE. LATER I WAS TOLD IN PHONE CONVERSATION WITH WH THAT THERE WAS A COURTESY RECALL GOOD UNTIL FEB. '09.   OCT 8, I TOOK IT TO LAZY DAYS BECAUSE THEY ARE AUTHORIZED. THEY SAID WH WILL NOT TAKE CARE OF IT BECAUSE THE RECALL WAS ABOUT A BRAKE ISSUE.. RESEARCH SHOWS THAT NO LCD SCREEN IS VERY COMMON. CONTACT ME PLEASE. *TR",
        "vin": "5B4MP67G733"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/05/2007",
        "dateOfIncident": "06/16/2007",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10201990,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN JUNE, AFTER TIRE REPLACEMENT, A CERTIFIED BRAKE AND ALIGNMENT SHOP DISCOVERED THAT ALL FOUR BRAKE CALIPERS HAD BEEN INTERMITTENTLY STICKING WHICH CAUSED SEVERE OVERHEATING OF ALL BRAKE AND BEARING COMPONENTS. THE ROTORS, CALIPERS,  AND ALL BEARINGS HAD FAILED. THIS WAS INDEPENDENTLY CONFIRMED BY AN INSPECTOR SENT OUT BY THE EXTENDED WARRANTY PEOPLE. AFTER REPLACING ALL THESE COMPONENTS, I WAS DRIVING TO OREGON AND THE LEFT FRONT SPEED SENSOR OF THE ABS SYSTEM FAILED (INTERMITTENTLY), AND THE MOTORHOME WOULD PULL VIOLENTLY TO THE RIGHT ALMOST CAUSING LOSS OF CONTROL ON SEVERAL OCCASIONS BEFORE REPAIR COULD BE OBTAINED. THAT SENSOR HAS NOW BEEN REPLACED. ALL PARTS ARE STILL AVAILABLE (AT THE SERVICE CENTERS).  *TR  UPDATED 01-14-08.  *KB  UPDATED",
        "vin": "5B4MP67G533"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/19/2005",
        "dateOfIncident": "04/04/2005",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136947,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: INTERMITTENTLY THE DASHBOARD GAUGE PANEL WENT DEAD. TOOK THE VEHICLE TO DEALER, AND THEY  REPLACED THE ENTIRE GAUGE PACKAGE, AND TODAY IT WENT DEAD AGAIN. THEY REPLACED THE PANEL ON APRIL 4, 2005.  SEPTEMBER 19, 2005 IS THE FIRST TIME THIS HAPPENED SINCE IT WAS REPLACED. THE MANUFACTURER KNEW THERE WAS A PROBLEM. THEY DID A FLASH THEN HAD A REPLACEMENT. *AK",
        "vin": "5B4MP67G533"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "11/05/2004",
        "dateOfIncident": "11/01/2004",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101189,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PARKING BRAKE SOMETIMES DOES NOT FULLY ENGAGE.  *NM  THE DASHBOARD ASSEMBLY WAS CURVED AND AS IT WAS INSTALLED  IT RESTRICTED THE MOVEMENT OF THE LEVER DOWNWARD THUS CAUSING THE PAWL TO NOT FULLY ENGAGE.  THE PAWL LEVER RESTS ON THE DASHBOARD CAUSING THE PAWL TO BE ONLY PARTIALLY ENGAGED WHEN THE PARKING BRAKE IS ON,  THUS, ONLY A SMALL FORWARD MOVEMENT OF THE DASHBOARD WILL PUSH THE LEVER UP.  RELEASING THE PARKING BRAKE.  *TC",
        "vin": "5B4MP67G633"
    },
    {
        "components": "FUEL SYSTEM, OTHER,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/03/2004",
        "dateOfIncident": "03/15/2003",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094731,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SPEEDOMETER IS NOT REGISTERING THE PROPER SPEED WHILE DRIVING, AND THE FUEL GAUGE IS NOT REGISTERING THE PROPER AMOUNT OF FUEL IN THE  TANK.   THE FUEL GAUGE NEEDLE WOULD DROP TO EMPTY WHILE A QUARTER TANK  OR MORE OF FUEL REMAINS IN THE TANK. VEHICLE HAD BEEN TO DEALER ON FIVE OCCASIONS, AND THEY CANNOT LOCATE THE PROBLEM.*AK  THE SPEEDOMETER ALSO INDICATES WRONG SPEEDS.  SPEED SHOWN IS 25-30 MPH SLOWER THAN THE VEHICLE IS ACUALLY GOING.  *TC",
        "vin": "5B4MP67G433"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "08/27/2004",
        "dateOfIncident": "08/24/2004",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089894,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  65 MPH  POWER STEERING PUMP MALFUNCTIONED. AS A RESULT, THE POWER BRAKES FAILED. NO IMPACT REPORTED. THE PART HAD BEEN REPLACED OR REPAIRED SIX TIMES. HOWEVER, THE PROBLEM RECURRED.  *AK",
        "vin": "5B4MP67G133"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/08/2004",
        "dateOfIncident": "06/15/2003",
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075021,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE BOUGHT A NEW 2003 FLEETWOOD, BOUNDER MOTORHOME AND WE ARE EXPERIENCING MUCH DIFFICULTY IN HAVING A LEAK REPAIRED IN OUR REAR BEDROOM.  OUR CARPETING HAS BEEN SOAKED IN A CERTAIN SPOT AND NOW WE BELIEVE MILDEW IS SETTING IN.  *AK",
        "vin": "5B4MP67G933"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10050477,
        "products": [
            {
                "manufacturer": "FLEETWOOD ENTERPRISES, INC.",
                "productMake": "FLEETWOOD",
                "productModel": "BOUNDER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "MICHELIN TIRE CORP.",
                "productMake": "MICHELIN",
                "productModel": "XRV",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SAFETY OF MICHELIN XRV 225/80 R 22.5 TIRES.  *MR  THE CONSUMER EXPRESSED CONCERNS RELATED TO THE CARRYING CAPACITY OF THE MICHELIN XRV TIRES.  THE CONSUMER WITNESSED FIRST HAND THE BLOWOUT OF A PASSENGER SIDE INSIDE DUAL TIRE ON A 2001 BOUNDER.   THE CONSUMER BELIEVES HIS TIRES MAY ALSO EXPERIENCE THIS TYPE OF FAILURE, HE THEREFORE CONTACTED HIS LOCAL MICHELIN TIRE DEALER.  THE DEALER REFUSED TO TRADE THE TIRES STATING THAT THERE WAS NO MARKET FOR A USED MICHELIN XRV.   *NM   *JB   *SC  *JB",
        "vin": ""
    }
]