[
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/09/2019",
        "dateOfIncident": "02/20/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11166045,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK DELAMINATION LEADING TO STALLING AND EVENTUAL REPLACEMENT OF THE TANK AT MY COST",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,UNKNOWN OR OTHER,ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/22/2018",
        "dateOfIncident": "08/18/2018",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11141798,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PREPARING FOR A CAMPING TRIP THIS PASS SUMMER, I WENT TO CHECK THE OIL LEVEL.  WHEN I WENT TO REMOVE THE OIL DIPSTICK, THE DIPSTICK TUBE BROKE, DUE TO CORROSION.  THIS IS THE FIRST TIME IN MY 25 YEARS OF OWNING A VEHICLE FOR THAT TO HAPPEN.  IT WOULD BE ALRIGHT, BUT IN ORDER TO REPLACE THE TUBE, IT IS REQUIRED TO REMOVE THE EXHAUST MANIFOLD TO PROPERLY REPLACE IT.  IN TURN IT COST MORE MONEY TO REPLACE A PRODUCT THAT SHOULD NOT BREAK.  I WAS FUELING MY TRUCK AND WANTED TO CHECK ALL MY FLUIDS.",
        "vin": "1FTSX3173EB"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/17/2017",
        "dateOfIncident": "07/16/2017",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005857,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED LT265/75/16 BF GOODRICH RUGGED TERRAIN T/A TIRES FOR MY TRUCK EXACTLY 5 YEARS AND JUST OVER 21K MILES LATER I HAD 2 SEPARATE TIRE FAILURES LESS THAN A FEW HUNDRED MILES APART. FIRST TIRE A BELT SLIPPED. HAD A GIANT BULGE IN THE TREAD. I PUT MY SPARE ON AND INSPECTED THE OTHER TIRES. ALL OK. NO CRACKS NO DRY ROT. I HAVE PICS. TIRE PRESSURE SET EQUALLY AT 78 PSI. I WAS AWAY CAMPING AND PULLING A 9000 LB TRAILER. LOCAL TIRE STORE DIDN'T HAVE A REPLACEMENT SO I HEADED HOME FIGURED I WOULD REPLACE IT WITH ANOTHER MATCHING TIRE AT HOME. ABOUT 100 MILES LATER WE HAD A SECOND TIRE FAIL. THIS ONE BLEW OUT AT HIGHWAY SPEED, CAUSING A LOT OF DAMAGE TO THE TRUCK AND LEFT ME STRANDED WITH NO SPARE. AFTER DOING SO RESEARCH AND READING BFG RECALLS FOR TIRES SIMILAR TO THIS ONE BUT DIFFERENT SIZES, I AM LEFT TO WONDER IF ALL OF THESE SIZES SHOULD HAVE BEEN INCLUDED IN THE RECALL. THE RECALL TIRES FAILED IN THE SAME MANNER AS MINE THAT WAS NOT INCLUDED ONLY BECAUSE OF THE SIZE AND I WAS NEVER NOTIFIED. I HAD MY WIFE AND 3 KIDS IN THE TRUCK AND IT WAS A DANGEROUS SITUATION. THE TIRE BLEW OUT ON THE PA TURNPIKE. 65 MPH WHILE TOWING A HEAVY TRAILER. SUNNY. 85* DAY. THE BULGED TIRE HAPPENED A LOW SPEED. 25 MPH ON BACK ROADS. ALL OF THESE TIRES SHOULD HAVE BEEN INCLUDED IN THE RECALL IT IS DANGEROUS TO HAVE THEM ON THE ROAD.",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/12/2016",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10874730,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "AMERI-TRAC",
                "productYear": "9999",
                "size": "P255/70R17",
                "type": "Tire"
            }
        ],
        "summary": "TIRE FAILURE.  DESTROYED MY OUTER FENDER ON 2003 F350 DUALLY  DAMAGED INCLUDED, OUTER FENDER, INNER FENDER, DAMAGE TO THE BED OF THE TRUCK, AND DAMAGE TO THE SUPPORT BRACKETS.  BOUGHT THIS TRUCK USED ABOUT A MONTH AGO.  NOT SURE WHEN THE TIRES WERE PURCHASED.  MILEAGE ON TIRES IS AN ASSUMPTION",
        "vin": "1FTWW33F23E"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "06/18/2015",
        "dateOfIncident": "05/28/2015",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10726093,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNIROYAL TIRE CO.",
                "productMake": "UNIROYAL",
                "productModel": "LAREDO",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TRUCK STARTS TO HAVE A VIBRATION AND AT HIGHER SPEED GETS WORSE   BY THE TIME YOU THINK IT MAY BE A BAD TIRE YOU MAY GET PULLED OVER BEFORE IT BLOWS OUT  OR IT BLOWS DOING EXTENSIVE VEHICLE DAMAGE  BEFORE YOU GET STOPPED.  BETWEEN 04/15/09 TO 08/16/12 I PURCHASED 6 UNIROYAL LAREDO 265/75R16 TIRES FOR 2003 F-350 FORD TRUCK.   ON 9/15/2910 A TIRE SEPARATED AND HAD A HUGE KNOT AND ADJUSTED WITH A NEW TIRE. ON 8/16/2012 ANOTHER TIRE SEPARATED AND HAD A KNOT IT WAS REPLACED AND ADJUSTED WITH A NEW TIRE.  SINCE 2012 EVERY ONE OF THE 6 TIRES HAS SEPARATED AND HAD A KNOT.  2 BLEW COMPLETELY BEFORE I COULD GET STOPPED DOING EXTENSIVE VEHICLE DAMAGE.  THE LEFT FRONT BLEW OUT IN MAY OF THIS YEAR TAKING ME DIRECTLY INTO INCOMING TRAFFIC AND ALMOST HITTING A COUPLE HEADON ON A MOTORCYCLE AND THEN ENDING UP IN THE INCOMING VECHICLES ROAD DITCH AT 65 MPH. THE TIRE STORE RECCOMENDED TO NOT USE THE UNIROYAL LAREDOS BECAUSE  THIS HAS BECOME A COMMON QA ISSUE WITH THIS TIRE.  THE TECHNICIAN SHOWED ME WHERE THE TIRES START TO COME APART. I LEFT 2 UNIROYAL LAREDOS ON THE REAR WHEELS AND THE TIRE TECHINICIAN LOOKED AT THE TIRES AND HE SAID THEY STILL LOOKED OPERABLE IN LESS THAN 2 WEEKS LEFT REAR STARTED VIBRATING AND IT HAD A KNOT ON IT. SO NOW ALL UNIROYAL LAREDOS HAVE BEEN REPLACED  WITH BFG TIRES.  6 OUT OF 6 TIRES ALL WENT BAD  AND THE TIRE STORES KNOW THESE UNIROYAL TIRES ARE DEFECTIVE AND YET UNIROYAL HAS DONE NOTHING TO FIX THE PROBLEM OR RECALLED THE TIRE.  THIS IS A EXTREMELY DANGEROUS SAFETY ISSUE WHEN A TIRE BLOWS ON THE FRONT YOU HAVE NO CONTROL OVER THE TRUCK YOUR JUST A BOMB HEADING TO INCOMING TRAFFIC.",
        "vin": "1FTSW30P23E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/15/2014",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10598413,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I CALLED FORD MOTOR COMPANY ON MY 2003 FORD F350 SD. SC. 4X4 5.4 ENG. WITH THE PROBLEM WITH BOTH EXHAUST MANIFOLDS ROTTING AWAY & THE STUDS & NUTS ROTTING , THEY TOLD ME WE WON'T FIX THE PROBLEM FOR FREE . I WOULD LIKE FOR YOUR HELP TO MAKE FORD MOTOR COMPANY FIX THIS PROBLEMS FOR FREE BECAUSE I TALKED TO MANY FORD DEALERS THEY ARE REPLACING THIS SAME PROBLEMS ON ALL 5.4 ENG. ON FORD TRUCKS AND HAVE TO CHARGE FOR THESE PROBLEMS . PLEASE INVESTAGATE THIS PROBLEMS BEFORE ALL THESE TRUCKS WILL CATCH ON FIRE AND PEOPLE WILL BE INJURY OR FATALITY WILL HAPPEN . PLEASE HELP ME AND MANY PEOPLE CAN GET THESE PROBLEMS FIX FOR FREE FROM FORD MOTOR COMPANY THANKS.       *JS",
        "vin": "1FTSX31L63E"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/03/2013",
        "dateOfIncident": "05/31/2013",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523043,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 05/31/2013 AFTER DRIVING APROX 50 MILES AT HIGHWAY SPEEDS THE TRUCK WAS PARKED AND A SMALL FIRE STARTED DUE TO LEAKING OIL ON THE HOT EXHAUST SYSTEM FROM A RUSTED OIL PAN. THE FIRE WAS EXTINGUISHED BEFORE IT CONSUMED THE ENTIRE VEHICLE. I HAVE CONTACTED FORD MOTOR CO. CUSTOMER CARE AND WAS TOLD THAT THE TRUCK WAS OUT OF WARRANTY AND THAT THE COST TO REPAIR 1500.00 TO 2000.00 WOULD BE MY RESPONSIBILITY. I AM DISABLED AND ON SOCIAL SECURITY WITH A VERY FIXED INCOME AND CANNOT AFFORD THE COST OF THIS REPAIR. FROM LOOKING AT ALL THE OTHER POSTS AND LIVING IN MICHIGAN WITH WINTER SALT, FORD HAS RECALLED MANY OF THEIR VEHICLES DUE TO RUST AND CORROSION OF VARIOUS COMPONENTS THAT COULD CAUSE A ACCIDENT OR DEATH. PLEASE INVESTIGATE THIS MAJOR PROBLEM WITH FORD TRUCKS AND OTHER VEHICLES WITH THE 7.3 LITER DIESEL ENGINE. I HAVE CONTACTED MY DEALER AND THEY SAID THIS IS A VERY COMMON PROBLEM. THANK YOU IN ADVANCE. THE TRUCK IS CURRENTLY PARKED AND UNDRIVEABLE.  *TR",
        "vin": "1FTSW31FX3E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/15/2013",
        "dateOfIncident": "05/14/2013",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10512230,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT  TRUCK  IN  2009  .  ABS  LIGHT  IS  ON   WANTED  TO  FIND  OUT  IF  THERE  WAS  A  RECALL  ON  HUBS  AND  IF  SO  WOULD  LIKE  TO  FIND  OUT  IF  TRUCK  WAS  SERVICED  , AND  IF  NOT  HOW  WOULD  I  PROCEED  TO  DO  RECALL .  THANK  YOU   *TR",
        "vin": "3FTSF31L43M"
    },
    {
        "components": "ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/12/2012",
        "dateOfIncident": "12/03/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488604,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS ACCELERATING ONTO ON-RAMP TO INTERSTATE 90 WEST BOUND AT PINES ROAD IN SPOKANE VALLEY WA. VEHICLE WAS DRIVEN BY MY WIFE. AT APPROXIMATELY 30 MPH THEIR WAS A LOUD BANG AND NOISE THAT SOUNDED LIKE AN EXHAUST LEAK. VEHICLE WAS DRIVEN TO THE SHOULDER AND SHUT OFF. MY WIFE CALLED ME AND I CAME TO INVESTIGATE WHAT HAD HAPPENED. I TURNED THE ENGINE OVER AND DETERMINED IT WAS NOT AN EXHAUST LEAK BUT THAT A SPARK PLUG HAD BEEN BLOWN OUT OF THE RIGHT SIDE OF THE ENGINE. IT WAS THE NUMBER 4 SPARK PLUG FROM THE FRONT ON MY V-10 GAS ENGINE. I LOCATED THE BENT SPARK PLUG AT THE APPROXIMATE LOCATION OF WHERE THE INCIDENT OCCURRED. OTHER THAN BEING BENT THE THREADS ON THE PLUG WERE INTACT AND DID NOT APPEAR TO HAVE BEEN CROSS THREADED. I HAD THE PLUGS REPLACED AT JUST OVER 100,000 MILES AS PER THE OWNERS MANUAL. I CHECKED WITH THE AUTO REPAIR SHOP I USED, (AAFES AUTO HOBBY SHOP ON FAIRCHILD AFB), AND INFORMED THEM OF WHAT HAD OCCURRED. THEY INFORMED ME THAT FORD HAD A TECHNICAL SERVICE BULLETIN ON THIS VERY SUBJECT. THIS APPEARS TO BE A MANUFACTURING DEFECT IN THAT REPLACING SPARK PLUGS SHOULD NOT LEAD TO AN EXPLOSIVE EVENT STRONG ENOUGH TO DENT MY HOOD FROM THE INSIDE. I AM NOW EXPECTING TO HAVE 9 MORE LITTLE TIME BOMBS JUST WAITING TO GO OFF UNDER THE HOOD OF MY TRUCK. I AM JUST THANKFUL THAT MY WIFE HADN'T YET GOTTEN UP TO THE SPEED LIMIT OF 60MPH.  *TR",
        "vin": "1FTSW31S53E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "10/25/2012",
        "dateOfIncident": "08/13/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482186,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I WERE TAKING OUR SON BACK TO COLLEGE. THERE WAS A NOISE COMING FROM THE FRONT RIGHT TIRE THAT SOUNDED LIKE THE WARNING FOR YOUR BRAKE PADS, EXCEPT WHEN I APPLIED THE BRAKES IT DIDN'T STOP. SOUNDED LIKE MY BRAKE ROTOR WAS GRINDING. THE NEXT DAY I TOOK MY VEHICLE TO MY MECHANIC TO HAVE MY BRAKES AND ROTORS CHECKED. THEY WERE FINE, BUT I WAS SURPRISED WHEN MY MECHANIC TOLD ME IT WASN'T MY BRAKES BUT INSTEAD IT WAS MY ALUMINUM ALLOY RIM (FACTORY RIMS) HAD CRACKED ALL THE WAY THROUGH ONE OF THE SPOKES ON THE RIM AND HAD STARTED CRACKING ABOUT AN 1 1/2\" THROUGH ANOTHER! I TOLD MY MECHANIC THAT I HAD NEVER HAD THIS HAPPEN BEFORE IN MY LIFE. MY MECHANIC REPLIED THAT HE HAD SEEN THIS SAME THING ON 5 OR 6 OF THE SUPER DUTY'S. SO, I BROWSED THE INTERNET TO SEE IF ANYONE ELSE HAD EXPERIENCED THE SAME PROBLEM. COME TO FIND OUT THAT THERE ARE HUNDREDS OF PEOPLE THAT HAVE HAD THE EXACT PROBLEM NOT ONLY WITH THE ALUMINUM ALLOY RIMS BUT THE STEEL RIMS AS WELL AND NOT SPECIFIC TO ANY YEAR. FROM FLORIDA TO CALIFORNIA ALL OVER THE U.S. INFORMED FORD CUSTOMER RELATIONS OF MY FINDINGS AND THERE RESPONSE WAS TO HOLD ON TO MY RECEIPT IN CASE THERE IS A CUSTOMER SATISFACTION PROGRAM (CSP) OR A RECALL EVER PUT IN PLACE.  *TR",
        "vin": "1FTWW33P93E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/21/2012",
        "dateOfIncident": "01/20/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476647,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Michelin North America, Inc.",
                "productMake": "BF GOODRICH",
                "productModel": "COMMERCIAL T/A A/S",
                "productYear": "9999",
                "size": "LT 245/75R16 120 Q LRE",
                "type": "Tire"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F-350 SD EQUIPPED WITH BF GOODRICH COMMERCIAL T/A A/S TIRES, SIZE: 235/85/16.  WHILE DRIVING APPROXIMATELY 65 MPH, THE REAR TIRE EXPLODED AND CAUSED REAR END DAMAGE TO THE VEHICLE. THE CONTACT WAS ABLE TO MANEUVER THE VEHICLE TO THE SIDE OF THE ROAD WHERE THE REAR PASSENGER SIDE TIRE WAS REPLACED WITH A SPARE. THE VEHICLE WAS TAKEN TO A TIRE CENTER WHERE A WHERE A NEW TIRE WAS MOUNTED ONTO THE VEHICLE. THE MANUFACTURER WAS NOTIFIED OF THE DEFECT. THERE WAS A RECALL ASSOCIATED WITH THE TIRE UNDER NHTSA CAMPAIGN ID NUMBER 12T019000 (TIRES:TREAD/BELT) HOWEVER, THE CONTACT'S TIRE WAS NOT INCLUDED IN THE RECALL. THE APPROXIMATE FAILURE MILEAGE WAS 82,000. THE DOT NUMBER AND VIN WERE UNAVAILABLE.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/21/2012",
        "dateOfIncident": "09/20/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10476656,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F-350 SD. WHILE PARKED, THE CONTACT INSPECTED THE VEHICLE AND NOTICED THAT BOTH REAR BRAKE LIGHTS WERE INOPERABLE. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER:  11V352000 (EXTERIOR LIGHTING:BRAKE LIGHTS) AND CONTACTED THE MANUFACTURER. THE MANUFACTURER INFORMED THE CONTACT THAT THE VIN WAS NOT INCLUDED IN THE RECALL CAMPAIGN. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 165,000.",
        "vin": "1FTSW31PX3E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/16/2012",
        "dateOfIncident": "03/26/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461939,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS HAULING A LOADED HORSE TRAILER AND HAD JUST MERGED ONTO THE HIGHWAY.  AS I WAS TRYING TO ACCELERATE, THE ENGINE WAS \"CATCHING\" AND WOULDN'T LET ME ACCELERATE PAST 35 MPH AND WAS REVVING VERY HIGH AND WOULDN'T SHIFT UP INTO THE NEXT GEAR.  IT FINALLY STALLED AND COMPLETELY SHUT OFF IN THE MIDDLE OF TRAFFIC AND I HAD TO COAST TO THE SIDE OF THE ROAD WHERE WHITE SMOKE STARTED POURING OUT FROM UNDER THE HOOD.  MY ENTIRE RIG - TRUCK, TRAILER AND HORSES, HAD TO BE TOWED HOME AND THEN THE TRUCK TOWED TO THE MECHANIC.  HE FOUND THE ENGINE RUNNING POORLY, AND FOUND LOW COMPRESSION ON CYLINDERS #3 AND #8.  HE FOUND LOW OIL PRESSURE AND WHEN HE REMOVED THE OIL PAN FROM THE CHASSIS, HE FOUND PISTON MATERIAL IN THE OIL PUMP.  HE REMOVED THE ENGINE AND FOUND THE PISTONS IN CYLINDER 3 AND 8 MELTED DOWN.  HE HAD TO BORE OUT AND HONE ALL THE CYLINDERS, REPLACE ALL 4 VALVES IN CYLINDER #3 HEAD, REPLACE ALL PISTONS, REPLACE THE MAIN BEARING AND ROD BEARING, UPDATE THE OIL COOLER AND REPLACE 8 PISTONS AND 6 HEAD GASKETS.  WHEN HE PUT IT ALL BACK TOGETHER AND TEST DROVE IT, HE FOUND AN EXHAUST LEAK FROM THE EBP SENSOR AND TUBE.  THOSE HAD TO BE REPLACED.  BEFORE ALL THIS HAPPENED, I HAD NOTICED THAT THE ENGINE SEEMED TO BE \"SKIPPING\" WHEN I WAS HAULING MY HORSE TRAILER.  IT ONLY HAPPENED WHEN I WAS OVER 55 MPH AND IT ONLY HAPPENED WHEN I WAS HAULING.  I HAD TAKEN THE TRUCK TO THE MECHANIC BEFORE THE BIG BREAKDOWN (DESCRIBED ABOVE) AND HE COULDN'T FIND ANYTHING WRONG.  I THINK THAT IS BECAUSE HE WAS NOT HAULING A TRAILER AND THAT'S THE ONLY TIME THE PROBLEM OCCURRED.  THE TOTAL BILL FOR ALL THESE REPAIRS IS $6400.00 AND I HAVE BEEN TOLD THAT FORD WILL DO NOTHING TO HELP ME.  *JB",
        "vin": "1FTWW33P93E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/25/2012",
        "dateOfIncident": "03/22/2012",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452913,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC TR",
                "productYear": "9999",
                "size": "LT275/70R18",
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED 4 LT CONTINENTAL CONITRAC 275/70R18 TIRES/FORD OEM WHEELS FROM BARNEY'S TIRE AND WHEEL IN TEMECULA, CA FOR MY 2003 F350 FORD TRUCK. THESE TIRE AND WHEELS WERE IN NEW CONDITION. JUNE 2, 2011 I HAD DINSAUR TIRE LOCATED IN CALIMESA CA REPLACE THE LEFT FRONT TIRE DUE TO TIRE SEPARATION.  NEITHER I OR DINOSAUR TIRE WERE AWARE OF THE CONTINENTAL TIRE RECALL.  MARCH 22, I HAD THE LEFT REAR TIRE SEPARATE AND AGAIN CONTACTED DINOSAUR TIRE TO SCHEDULE A REPLACEMENT. AGAIN, THEY WERE UNAWARE OF THE RECALL.  THINKING TWO TIRE SEPARATIONS WERE ODD, I PERFORMED A SEARCH ON THE WEB FOR PROBLEMS RELATED TO THESE TIRES AND DISCOVERED CONTINENTAL HAD RECALLED CERTAIN TIRES.  EMAILED CONTINENTAL THE DOT NUMBERS OF THE TIRES AND THEY CONFIRMED WITH A EMAIL THESE  WERE TIRES SUBJECT TO THE RECALL AND I WAS DIRECTED TO CONTACT AN AUTHORIZED DEALER.  CONTACTED DINOSAUR TIRE (AUTHORIZED DEALER) AND FAXED ALL CORRESPONDENCE TO THEM.  THEY WERE STILL UNAWARE OF THE RECALL AND DID NOT KNOW THE PROCESS TO FILE A CLAIM.  DINOSAUR TIRE CALLED CONTINENTAL WITH ME IN THEIR COMPANY TO GET AN AUTHORIZATION.  UNFORTUNATELY AND WRONGFULLY, CONTINENTAL WILL ONLY PRORATE THE REMAINING THREE TIRES BECAUSE THERE WAS A COMPLIANCE DATE OF OCTOBER 15, 2011 AND STATED ALL PERSONS WHO PURCHASED THE TIRES WERE CONTACTED.  HAD THE AUTHORIZED DEALER DINOSAUR TIRE BEEN MADE AWARE OF THE RECALLED TIRES LAST JUNE, I COULD OF REPLACED THE 4 TIRES WITHOUT ANY FEES AND FREE OF CHARGE.  HOWEVER, BECAUSE CONTINENTAL FAILED TO COMMUNICATE THIS TO THE PUBLIC AND AUTHORIZED CONTINENTAL DEALERSHIPS, DEMONSTRATES A LACK TO TAKE FULL RESPONSIBILITY TO THE PUBLIC FOR TIRES THE PUBLIC ACCIDENTALLY CAME IN POSSESSION OF, AND SOLD BY UNAWARE TIRE COMPANIES. CONTINENTAL WOULD NOT PROVIDE ANY REIMBURSEMENT FOR THE TIRE REPLACED LAST JUNE, 2011.  AGAIN - FAILURE TO COMMUNICATE THE RECALL TO THE PUBLIC DEMONSTRATES A LACK OF RESPONSIBILITY.  *TR",
        "vin": "1FTSW31P03E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/20/2012",
        "dateOfIncident": "03/14/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10452402,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F-350 SD DIESEL.  THE CONTACT STATED THE VEHICLE EXPERIENCED A BLOWN HEAD GASKET.  THE DEALER REPLACED THE MOTOR BUT THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE BUT DENIED ANY ASSISTANCE WITH REPAIRS TO THE VEHICLE.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 25,000 AND THE CURRENT MILEAGE WAS 150,000. ..UPDATED 11/28/12 *BF    THE CONSUMER STATED WHEN THE HEADS CRACKED IT PUSHED WATER IN THE FUEL AND DESTROYED THE FUEL PUMP, INJECTORS, AND TURBO.  UPDATED 11/29/12",
        "vin": "1FTWW33P73E"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/15/2011",
        "dateOfIncident": "09/10/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425609,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING HIGH SPEED HIGHWAY DRIVING THE TURN SIGNAL BECAME STUCK IN RIGHT HAND TURN POSITION. AFTER CLICKING THE SIGNAL LEVER FROM LEFT, CENTER, AND RIGHT HAND TURN POSITIONS THE RIGHT HAND TURN SIGNAL REMAINED ON IN ALL POSITIONS. I HAVE BEEN DRIVING FOR 6 DAYS NOW WITH THE FOUR WAY HAZARDS ON. I FOUND ONLINE THERE WAS A SAFETY RECALL ON THE MULTI FUNCTION TURN SWITCH, BUT WHEN I TOOK VEHICLE TO THE DEALER THEY TURNED ME AWAY AND SAID THERE WAS NO RECALL. THEN I CALLED FORD CUSTOMER RELATIONSHIP CENTER AND THEY SAID THERE WAS NO RECALL EITHER AND ALSO SAID THAT EVEN THOUGH MY TRUCK WAS WITHIN THE YEARS AND MODELS STATED THAT THE VIN # WAS NOT WITHIN THE RECALL. HOW COULD THAT BE? IS A FORD F-350 SD 2003 DIFFERENT FROM ANOTHER FORD F-350 SD 2003. I STILL HAVE THE PROBLEM DESCRIBED IN THE RECALL. SAFETY HAZARD INDEED.   *KB",
        "vin": "1FTSW31F63E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/09/2011",
        "dateOfIncident": "06/09/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10418180,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F-350 SD.  THE CONTACT STATED THAT THE VEHICLE WOULD STALL SPORADICALLY WITHOUT WARNING. IN ADDITION, THE VEHICLE WOULD HESITATE WHEN ATTEMPTING TO START.  THE DEALER DIAGNOSED THAT THE INJECTION CONTROL PRESSURE MODULE WOULD NEED REPLACING.  THE MANUFACTURER ADVISED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 05V270000 (ELECTRICAL SYSTEM:WIRING) RECALL.  THE VEHICLE WAS NOT REPAIRED.  THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE WAS 60,200.",
        "vin": "1FTWW33P13E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/26/2011",
        "dateOfIncident": "05/27/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415201,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD SEVERAL BREAKDOWNS WITH MY TRUCK AND HAD TO HAVE IT TOWED TWICE. THE FIRST PLACE IT WAS TOWED TO COULD NOT FIND THE PROBLEM THEN AFTER SEVERAL MORE INSTANCES I HAD IT TOWED TO THE DEALERSHIP WHERE I PURCHASED THE VEHICLE AND THEY NEW THE PROBLEM RIGHT AWAY. THE FUEL TANK DELAMINATED AND I WAITED TWO MONTHS FOR ONE BECAUSE THEY WERE IN PRODUCTION AT A COST OF $2000.00 TO BE REPAIRED. THIS SEEMS TO BE A WIDE SPREAD PROBLEM WITH THESE TRUCKS AND IT SHOULD BE WARRANTIED.  *TR",
        "vin": "1FDWF37P53E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/22/2011",
        "dateOfIncident": "06/21/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10408561,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F-350 SD.  THE CONTACT WOULD SHIFT THE VEHICLE INTO PARK, BUT INSTEAD THE VEHICLE WOULD SHIFT INTO REVERSE.  THE CONTACT STATED THAT THE GEAR SHIFT WOULD READ PROPERLY, BUT PERFORM IN INACCURATELY. THE MANUFACTURER NOR DEALER WERE NOTIFIED. THE VEHICLE WAS NOT REPAIRED.  THE FAILURE AND CURRENT MILEAGE WAS 120,000.",
        "vin": "1FDWF36L73E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/02/2011",
        "dateOfIncident": "05/01/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398563,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F250.  THE CONTACT NOTICED THAT THE FRAME UNDERNEATH THE VEHICLE WAS COVERED WITH RUST.  HE ALSO NOTICED THAT THE RUST WAS AFFECTING THE DRIVERS SIDE DOOR PANEL.  THE DEALER DID NOT OFFER ANY ASSISTANCE SINCE THE VEHICLE WAS NO LONGER UNDER WARRANTY.  THE MANUFACTURER ALSO OFFERED NO ASSISTANCE.  THE CURRENT MILEAGES WERE 65,000 AND THE FAILURE MILEAGES WERE 50,000.     UPDATED 5/24/11 *CN  UPDATED 06/10/11",
        "vin": "1FTNX21L43E"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/17/2011",
        "dateOfIncident": "04/17/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10396559,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 F350 HAS ALL OF THE DEATH WOBBLE ISSUES, DRIVING AT 55 OR 70 ON THE HIGHWAY THE FRONT END WILL JUST GO INTO A CRAZY WOBBLE IN WHICH I HAVE TO SLOW DOWN TO TRY AND FIX. SOMETIMES WHEN I USE THE BRAKE PEDAL IT WILL ALSO GO INTO THE SAME EVENT. I'VE READ ALL THESE ISSUES ON THE NET AND CANNOT UNDERSTAND THAT IF ITS SUCH A HUGE PROBLEM WHY IS IT NOT BEING ADDRESSED. WILL IT TAKE ONE OF THESE VEHICLES KILLING A FAMILY MEMBER OF THE PEOPLE AT FORD TO GET THIS UNDER CONTROL OR MAYBE THEY JUST DON'T CARE AS LONG AS THEY ARE MAKING MONEY. TO THE FAMILY MEMBERS OF THE FORD PEOPLE AND EVERYONE ELSE I PRAY FOR YOU.  I DO NOT KNOW WHAT TO DO FOR MY TRUCK TO FIX IT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/19/2011",
        "dateOfIncident": "03/10/2011",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392217,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG EJECTION FROM 2003 FORD F-350 SUPER DUTY  ENGINE: TRITON 5.4L V8  DATE OF FAILURE: 03-10-11  MILEAGE OF TRUCK: 139414     THIS INCIDENT HAPPENED WHILE TRAVELING ON A STATE HWY51 NEAR POSTVILLE, IA   EJECTION OF SPARK PLUG FROM NUMBER 7 CYLINDER ON 5.4L V8 ENGINE.  DAMAGE TO CYLINDER HEAD OF ENGINE AND SPARK PLUG COIL.    THIS IS A WELL MAINTAINED 2003 F-350, SPARK PLUGS REPLACED AT A FORD DEALER  01-19-09: 109156 MILES.  *TR",
        "vin": "1FTSF31L53E"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "01/17/2011",
        "dateOfIncident": "01/10/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376977,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE A 2003 F-350 SUPER DUTY FORD TRUCK.NOISE IN REAR BRAKES UPON INVESTIGATION FOUND THAT THE EMERGENCY BRAKE BACKING PLATE THAT THE EMERGENCY BRAKE SHOES ATTACH TO WAS RUSTED AWAY AND THE EMERGENCY BRAKE SHOES AND THEIR HARD WARE FELL APART CREATING A VERY DANGEROUS SITUATION SINCE SUPER DUTY TRUCKS CARRY AND TOW HEAVY LOADS AND COULD CAUSE SERIOUS ACCIDENT.  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/14/2011",
        "dateOfIncident": "09/15/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376669,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F-350 6.0L DIESEL SD. THE CONTACT WAS DRIVING APPROXIMATELY 10-20 MPH AND ATTEMPTING A RIGHT TURN WHEN THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE ICP SENSOR WAS REPLACED YET THE FAILURE RECURRED TWO DAYS FOLLOWING THE REPAIRS. THE VEHICLE WAS TAKEN BACK TO THE LOCAL MECHANIC AND THE CONTACT WAS REFERRED TO THE DEALER. THE DEALER WAS INSTALLED A FLAT RECORD ON THE VEHICLE BUT WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 05V270000 (ELECTRICAL SYSTEM:WIRING) WHICH  INCLUDED THE 2005 MODEL FORD 350 DIESEL AND STATED THAT HE WAS EXPERIENCING THE EXACT SAME FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS UNAVAILABLE. THE FAILURE MILEAGE WAS 23,000 AND THE CURRENT MILEAGE WAS 25,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "08/11/2010",
        "dateOfIncident": "08/09/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348624,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE FORD F350 7.3 DIESEL, THE CLAMP BENEATH THE TURBO HOLDING THE HIGH PRESSURE DIESEL FUEL LINE IN PLACE IS A POOR DESIGN.  THE CLAMP APPEARS TO BE ALUMINUM WITH A RUBBER COATING.  THE RUBBER COATING WEARS AWAY AND THE FUEL LINE PASSES METAL ON METAL THROUGH THE CLAMP CAUSING WEAR.  IN THIS PARTICULAR CASE THE PINHOLE LEAK IN THE HIGH PRESSURE FUEL LINE CAUSED BY THE WEAR CREATED A MIST OF FUEL TO BE BLOWN ON THE HOT TURBO CAUSING A FLAMMABLE CLOUD OF DIESEL.  I IMMEDIATELY SHUT THE VEHICLES IGNITION OFF AND STOOD BY WITH AN EXTINGUISHER.  THIS IS GOING TO HAPPEN AGAIN TO SOMEBODY AND NEEDS TO BE REPAIRED.  SOMEBODY IS GOING TO BE INJURED OR THE VEHICLES ENGINE COMPARTMENT WILL CATCH FIRE.  THE FUEL LINE NEEDS TO PASS THROUGH A CLAMP OF BETTER DESIGN.  *TR",
        "vin": "1FTSW31F33E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/07/2010",
        "dateOfIncident": "06/19/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10341813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FAULTY FORD FUEL TANK. DIESEL TANKS ARE DELAMINATING, CAUSING FUEL LINE/FILTER TO CLOG AND VEHICLE NOT TO RUN PROPERLY. 6/16/10 REPLACED FUEL FILTER, RAN FOR ONE DAY. TOOK TRUCK TO HENRY CURTIS FORD ON 6/17/10, THEY TOLD US ABOUT DELAMINATION, NOT THEIR FAULT. CHARGED US $909.28 TO REMOVE TANK, CLEAN AND REPLACE MICRON FILTER. HCFORD SAYS THAT THE NEW GAS TANKS FROM FORD ARE ON BACK ORDER, NOT AVAILABLE UNTIL APPROX. SEPT 2010. ON 6/30/10 TRUCK RUNS IMPROPERLY AGAIN,FUEL FILTER CLOGGED DUE TO DELAMINATION, CHANGED FUEL FILTER. ON 7/1/10 TRUCK RUNS BAD AGAIN, LEAVE TRUCK AGAIN WITH HENRY CURTIS FORD WITH AN ODOMETER READING OF 73812 AND A 1/4 TANK OF GAS. THEY CALLED AND SAID THE FUEL FILTER IS CLOGGED, THEY AGAIN WANT TO PULL THE TANK AND REPLACE THE MICRON FILTER AT A CHARGE OF $900 + ONLY ELEVEN DAYS AFTER THEY JUST DID IT. WE DECLINED, THEY CHARGED US $122.00 AND RETURNED OUR TRUCK WITH AN ODOMETER READING OF 73896 AND AN EMPTY TANK OF GAS. WHEN QUESTIONED HCFORD ABOUT ODOMETER AND GAS THEY SAID THEY ONLY DROVE TRUCK 5 MILES. NO ACCOUNTABILITY. 100'S OF COMPLAINTS ON INTERNET REGARDING DELAMINATION OF FORD FUEL TANKS. PLEASE INITIATE A FORD FUEL TANK RECALL. *TR",
        "vin": "1FDSF35F73E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/30/2010",
        "dateOfIncident": "08/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340829,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FORD F-350 SUPER DUTY. THE CONTACT STATED THAT THE VEHICLE WILL REV UP TO 2000 RPMS, AND IF THE VEHICLE IS IN DRIVE THE VEHICLE WILL START TO ACCELERATE WITHOUT TOUCHING THE GAS PEDAL. THE CONTACT STATED THAT THE FAILURE HAS BEEN GOING ON SINCE THE VEHICLE WAS PURCHASED AND HAS PROGRESSIVELY GOTTEN WORSE. THE DEALER STATED THAT THE FAILURE OCCURS BECAUSE THE INJECTOR CONTROL PRESSURE SENSOR IS CAUSING THE FAILURE.  THE FAILURE MILEAGE WAS 75 AND THE CURRENT MILEAGE WAS 33714.",
        "vin": "1FTSW31P73E"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "05/20/2010",
        "dateOfIncident": "05/14/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331491,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 FORD F-350 DUELLY WITH THE ALUMINUM RIMS WITH THE TRIANGULAR CUT OUTS IN THEM. AT ABOUT 172,000MI MY PASSENGER FRONT RIM CRACKED FROM ONE CUT OUT TO ANOTHER ALL THE WAY THROUGH AND WAS OFFSET FROM THE RIM ABOUT 1/4 INCH. I REPLACED THAT ONE AND THEN ABOUT 2000MI LATER THE DRIVERS SIDE CRACKED JUST LIKE THE PASSENGER SIDE DID ONLY IN 2 PLACES. IT WAS REPLACED WITH A USED ONE. THE LOCAL TOWING/ TIRE DISTRIBUTOR SAID HE HAS OWNED FORD SUPERDUTYS FOR OVER 10 YEARS AND HAS NEVER HAD ONE OF HIS RIMS CRACK NOR HAS HE EVER SEEN ONE DO THAT. FROM MY PERSPECTIVE IT LOOKS AS THOUGH THERE MIGHT BE A DEFECT IN \"FORDS\" WHEELS THAT THEY MADE THAT YEAR. THERE ARE OTHER PEOPLE ON DIFFERENT ONLINE FORUMS THAT ARE HAVING THE SAME PROBLEMS WITH THE 2003 FORD SUPERDUTYS ONLY THERE'S HAVE BETWEEN 50K AND 178K MI ON THERE'S. I HOPE THIS CAUGHT YOUR ATTENTION BECAUSE FORD ISN'T DOING NOTHING ABOUT IT AND IF THE WHEEL CRACKED BAD ENOUGH AND SOMEONE DIDN'T CATCH IT IN TIME IT COULD DETACH FROM THE VEHICLE AND CAUSE A WRECK. THANKS FOR READING THIS. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/11/2010",
        "dateOfIncident": "05/10/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329843,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SPARK PLUG BLEW FROM ENGINE ON 2003 FORD F-350 5.4 TRITON ON MAY 10TH  20010. ON FREEWAY APROX.65MPH. CANNOT RE-INSTALL PLUG DUE TO THREAD DAMAGE. *TR",
        "vin": "1FDSF34L03E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2010",
        "dateOfIncident": "04/09/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10324699,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F350 EQUIPPED WITH 6.0L DIESEL ENGINE EXPERIENCED STALLING WITHOUT WARNING WHILE DRIVING AND/OR WHILE APPLYING BRAKES.  THIS LOOKS TO BE THE SAME ISSUE THAT AFFECTED VEHICLES IN THE 2004-2005 RECALL.   ICP SENSOR LIGHT IS LIT AND MOST LIKELY WILL NEED TO BE REPLACED.   SEPARATE OR RELATED ISSUE? : ENGINE WILL \"REV-UP\" WHILE DRIVING AND PRODUCE ACCELERATION WITHOUT GAS PEDAL BEING APPLIED.  ENGINE WILL REV-UP AND/OR IDLE HIGH WHILE IN PARK AND WHEN STOPPED/BRAKES APPLIED. *TR",
        "vin": "1FTSW31P23E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2010",
        "dateOfIncident": "12/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10316584,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    I OWN A 2003 FORD F-350 TRUCK. THE MOTOR WOULD SURGE WHEN DRIVING DOWN THE ROAD CAUSING THE TRUCK TO TRAVEL AT A HIGH RATE OF SPEED (BRAKING WOULD SLOW IT DOWN).  OTHER TIMES WHILE SITTING AT A LIGHTS OR STOP SIGNS THE MOTOR WOULD SURGE PUSHING THE TRUCK FORWARD (IT WAS HARD TO HOLD IN PLACE USING BRAKES).  I TOOK THE TRUCK TO FORD AND THEY SAID SENSORS HAD TO BE REPLACED.  THE SERIAL NUMBER IS [XXX] .  THE SURGING ACCURED APPROX. 15 TIMES WITHIN 5 DAYS. *TR",
        "vin": "1FTNX20L74E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "01/27/2010",
        "dateOfIncident": "01/27/2010",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302479,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 FORD F350.  AT 100000 MILES A FACTORY SPARKPLUG EJECTED FROM THE MOTOR.  AT 129000 JUST LOST ANOTHER*CW",
        "vin": "1FTSF31LX3E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/10/2009",
        "dateOfIncident": "07/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10295213,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS - SURGES - RUNS ROUGH - PROBLEM HAS EXISTED SINCE NEW - HAVE TAKEN TO FORD GARAGE AND THEY HAVE NEVER FIXED TO LAST. *TR",
        "vin": "1FTSW31P13E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/25/2009",
        "dateOfIncident": "11/24/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10293536,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FUEL SYSTEM OF MY 2003 FORD TRUCK CORRODED FROM THE INSIDE, CONTAMINATING THE FUEL WHICH RUINED THE FUEL PUMP, FUEL FILTERS AND INJECTORS. EVERYTHING NEEDED TO BE REPLACED AND REPAIRED AT THE COST OF $3000. FORD WILL NOT STAND BEHIND THEIR PRODUCT, THEY ARE AWARE OF THE PROBLEM. THEY CLAIM IT IS A PROBLEM WITH THE FUEL ITSELF. THE REPLACEMENT FUEL TANKS THEY SELL TO FIX THE PROBLEM BEGIN CORRODING AGAIN WITHIN 3 MONTHS. THIS PROBLEM DOES NOT OCCUR WHEN PLASTIC FUEL TANKS ARE USED. *TR",
        "vin": "1FDWW37FX3E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/16/2009",
        "dateOfIncident": "09/07/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284128,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE USING OUR FORD F350 DIESEL (6.0 MOTOR) WITH 63,000. WE WERE GOING 70 MPH ON THE INTERSTATE PULLING A LOADED 5 HORSE TRAILER WHEN THE TRUCK WOULD NOT ACCELERATE, 15 SECONDS LATER ENGINE CUT OFF. WE WERE IN THE LEFT LANE AND HAD NO POWER TO STEER OFF THE ROAD AND COULD NOT COME TO A FAST STOP BECAUSE OF THE WEIGHT OF THE OF HORSE TRAILER. WE HAD TO COAST APPROXIMATELY 100 YARDS AND PULL OFF ON THE LEFT SIDE BECAUSE TRAFFIC WAS TOO HEAVY AND GOING TO FAST TO LET US OVER TO THE RIGHT SIDE. TRUCK WOULD NOT START AGAIN. HAD TO BE TOWED OFF THE INTERSTATE AND HOME. TOOK IT TO THE REPAIR SHOP AND WAS TOLD THE ENGINE LOCKED UP AND NEEDS TO BE REPLACED AT A COST OF $7500 TO $10000. I CHECKED ON WARRANTY AND BECAUSE IT IS A 2003 IT IS EXPIRED. CALLED FORD AND WAS TOLD THERE WAS NO RECALLS. IT WAS EXTREMELY DANGEROUS SITUATION AND CAN NOT BELIEVE THAT WERE IS NOT SOME TYPE OF DEFECT IN THE ENGINE. *TR",
        "vin": "1FTWW33P93E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/08/2009",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 FORD F-350 SD. WHILE DRIVING APPROXIMATELY 40 MPH ON NORMAL ROAD CONDITIONS, THE ENGINE STALLED WITHOUT WARNING. THE CONTACT WAS ABLE TO RESTART THE VEHICLE AND  RESUMED NORMAL OPERATION; ALTHOUGH, THE FAILURE RECURRED INTERMITTENTLY. AN AUTHORIZED TECHNICIAN STATED THAT THE FAILURE WAS CONTRIBUTED TO THE INJECTION CONTROL PUMP (ICP); INJECTION PRESSURE REGULATOR (IPR) AND THE WIRING HARNESS WHICH WERE REPLACED ON TWO OCCASIONS. THE VEHICLE WAS ALSO TOWED TO AN AUTHORIZED DEALER TO HAVE THE TRANSMISSION REPLACED. THE COST TO REPAIR THE VEHICLE WAS 3,400. THE FOLLOWING DAY THE ALTERNATOR FAILED AND THE VEHICLE WAS TOWED TO AN AUTHORIZED DEALER. THE CONTACT HAD CONCERNS OF THE SAFETY RISK INVOLVED. THE FAILURE MILEAGE WAS 100,000 AND THE CURRENT MILEAGE WAS 132,000.",
        "vin": "1FTSW31P23E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/15/2009",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276901,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Kumho Tire Co., Inc.",
                "productMake": "KUMHO",
                "productModel": "KUMHO",
                "productYear": "9999",
                "size": "P195/55R15",
                "type": "Tire"
            }
        ],
        "summary": "I HAVE A SET OF KUHMO TIRES - ROAD VENTURE AT 285/75 -16 WHICH EXPERIENCED THE SAME DEFECTS AS THE KUHMO ROAD VENTURE TIRES CURRENTLY BEING RECALLED (WHICH IS SIDEWALL DELAMINATION AND THEN BLOWOUT) BUT MY TIRES DO NOT FALL UNDER THE CURRENT RECALL. THESE TIRES ARE LESS THAN 2 YEARS OLD AND I NO LONGER FEEL SAFE ON THEM - I WILL REPLACE THEM IN 2 DAYS. I THINK THAT ALL KUHMO TIRES OF THIS LINE SHOULD BE LOOKED AT. *TR",
        "vin": "1FTSX31P03E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,FUEL SYSTEM, OTHER,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/27/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10270288,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F350 HAS PROBLEMS WITH THE FUEL INJECTORS, TRANSMISSION AND AN OIL LEAK.  *NJ  THE CONSUMER STATED THE VEHICLE LOST POWER AND WHITE SMOKE EMITTED FROM THE TAILPIPE. HE ALSO NOTICED A DELAY OF ENGAGEMENT FROM DRIVE TO REVERSE AND THE FUEL GAUGE WAS STUCK.  THE NUMBER 8 INJECTOR HAD FAILED, THE TRANSMISSION NEEDED A NEW PART AND THE FUEL GAUGE NEEDED A NEW SENSOR.  IN THE FALL OF 2008, THE VEHICLE DEVELOPED AN OIL LEAK. IT WAS DISCOVERED THAT THE ICP SENSOR (INJECTOR CONTROL PRESSURE) WAS THE PROBLEM. IN MARCH 2009, WHILE TOWING A TRACTOR, THE TRUCK LOST POWER AND AGAIN IT EMITTED SMOKE AND THERE WAS A HARSH JERK. IT WAS DETERMINED THAT THE ENGINE FAILED AGAIN.  THE NUMBER 1 AND NUMBER 3 INJECTOR HAD FAILED AND THERE WAS A NEW OIL LEAK. *JB",
        "vin": "1FTSW31P93E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "05/17/2009",
        "dateOfIncident": "05/17/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10268979,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "LT26575R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TIRE EXPLOSION AND TREAD SEPARATION BF GOODRICH RUGGED TRAIL T/A TIRE (LT 265/75/16 E). PROPERLY INFLATED ON THE READ OF FORD F350 TRUCK.  TRAVELING 55 MPH WITH CLEAR ROAD CONDITIONS, NO ROAD HAZARD ENCOUNTERED. TIRE HAS LEGAL TREAD DEPTH & EVEN TREAD WEAR 54, 279 MILES. TREAD SEPARATION CAUSED EXTENSIVE DAMAGE TO LEFT REAR OF TRUCK. TRAVELING SOUTH ON J14 NEAR BYRON, CA. *TR",
        "vin": "1FTSW31P63E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "04/09/2009",
        "dateOfIncident": "04/08/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264773,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "7.3 LTR DIESEL ENGINE HAS A METAL FUEL LINE STRAPPED TO ENGINE BLOCK WITH METAL CLAMP. THE METAL CLAMP EVENTUALLY WEARS A HOLE IN THE METAL FUEL LINE AND THEN DIESEL FUEL IS SPRAYED ON TO BACK OF ENGINE, STARTER AND OTHER ELECTRICAL COMPONENTS. THE METAL FUEL LINE AND CLAMP IS ON THE PASSENGER SIDE OF THE ENGINE AND ATTACHED TO THE BACK OF THE ENGINE BLOCK.    I WOULD THINK THERE SHOULD BE SOME KIND OF RUBBER INSULATION AROUND THE FUEL LINE WHERE IT IS HELD BY THE METAL CLAMP. IT IS JUST A MATTER OF TIME BEFORE EVERY ONE F THESE 7.3 LTR ENGINES WILL SUFFER THIS WEAR THROUGH OF THE DIESEL FUEL LINE AND SPRAY FUEL DOWN THE BACK OF THE ENGINE AND ALL OVER THE STARTER AND ELECTRICAL COMPONENTS. IT IS A FIRE HAZARD IN EVERY VEHICLE USING THE 7.3 LTR ENGINE. WEB SITE FORUMS ARE FULL ON THIS EXACT SAME PROBLEM OF WEAR THROUGH OF THE FUEL LINE BY THE METAL CLAMP HOLDING IT.  *TR",
        "vin": "1FTSW31F53E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "03/09/2009",
        "dateOfIncident": "03/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10261279,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 FORD F350 SUPER DUTY.  THE CONTACT STATED THAT SOMETHING FELL INTO THE FUEL TANK OR DELAMINATE, WHICH CAUSED THE VEHICLE TO STALL, CLOGGED THE INJECTORS, AND CLOGGED THE FUEL FILTER.  THE VEHICLE STALLED APPROXIMATELY 55-60 TIMES DUE TO THE DELAMINATION AND WAS BECOMING PROGRESSIVELY WORSE.  THE LATEST FAILURE OCCURRED WHILE DRIVING 55 MPH.  THE CONTACT WAS UNABLE TO RESTART THE VEHICLE AND THE FUEL LINE HAD TO BE DRAINED SO THAT SHE COULD DRIVE TO HER RESIDENCE.  WHEN THE VEHICLE WAS RESTARTED, IT BUCKED AND SPUTTERED.  THERE WERE NO WARNING INDICATORS ILLUMINATED PRIOR TO THE FAILURE AND THE STEERING WAS INOPERABLE.  SHE TOOK THE VEHICLE TO THE DEALER THREE TIMES AND THEY CONTINUOUSLY ADVISED HER TO CHANGE THE FUEL FILTERS DUE TO POOR DIESEL FUEL.  THE VEHICLE HAS NOT BEEN REPAIRED AND IS PARKED AT THE CONTACT'S RESIDENCE.  THE MANUFACTURER ALSO STATED THAT THERE WAS BAD FUEL IN THE VEHICLE.  THE CURRENT MILEAGE WAS APPROXIMATELY 31,000 AND FAILURE MILEAGE WAS APPROXIMATELY 14,000.",
        "vin": "1FTSW31P83E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "02/10/2009",
        "dateOfIncident": "02/04/2009",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258280,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I SMELLED HINT OF RAW FUEL WHEN THE ENGINE WAS WARM FOR 1-2 MONTHS PRIOR TO THE OBVIOUS PROBLEM. 3-4 WEEKS PRIOR TO PROFESSIONAL INSPECTION THERE WAS WHITE SMOKE OUT OF  THE EXHAUST FOR 1-2 MINUTES. THIS SMOKE WAS ASSOCIATED WITH ROUGH IDLING THAT WHEN AWAY COMPLETELY UNTIL THE NEXT COLD START UP. THE PRECIPITATING EVENT FOR PROFESSIONAL INSPECTION WAS RAW FUEL SPRAYING ONTO THE TRAILER THAT WAS BEING PULLED. INSPECTION REVEALED RAW FUEL POOLED ON THE HORIZONTAL ENGINE SURFACES AND RAW FUEL IN THE COOLING SYSTEM. THIS WAS VERIFIED BY MANUFACTURER'S DEALER SERVICE DEPARTMENT AND FOUND TO BE A LEAKING FUEL INJECTOR CUP. IT WILL REQUIRE CHANGING ALL THE FUEL INJECTOR CUPS. THE DEALER SERVICE AGENT REPORTED THAT THIS SAME PROBLEM HAS BEEN SEVERAL TIMES IN THESE PARTICULAR MODELS. IT IS USUALLY A WARRANTY ITEM. THIS HAS NOT BEEN REPAIRED YET AS THIS VEHICLE'S WARRANTY HAS EXPIRED BY TIME LIMIT BUT NOT MILEAGE. THE MANUFACTURER HAS DENIED ANY OBLIGATION TO HELP RESTORE THE VEHICLE TO SAFE OPERATION GIVEN THAT IT SEEMS TO RUN UNIMPAIRED FROM A PERFORMANCE STANDPOINT. *TR",
        "vin": "1FDSW35F93E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/07/2009",
        "dateOfIncident": "12/29/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254147,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F-350 V10 EJECTED A SPARK PLUG FROM THE #3 CYLINDER. *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "12/23/2008",
        "dateOfIncident": "12/23/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD 350 DIESEL, FUEL TANK HAS CONTAMINATION WHICH RUINED PUMP, ONLY 65,000 MILES, COST TO REPAIR $2000, FORD SAYS NOT THEIR PROBLEM, IT'S THE FUEL. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/16/2008",
        "dateOfIncident": "12/10/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252038,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I'M SURE I HAVE THE SAME PROBLEM. I HEARD A TICKING NOISE ALSO, THEN MY TRUCK STARTED TO MISS UNDER LOAD. UNABLE TO DETERMINE WHICH CYLINDER IS THE PROBLEM, SOUNDS LIKE ALL MY BE BAD AT SOME TIME. FORD HAS TO BE AWARE OF THIS PROBLEM, NOT TAKING THE BLAME IS AN EXAMPLE OF HOW THEY RUN THEIR BUSINESS. OOOHHHH WAIT THEY ARE GETTING READY TO GO UNDER. WONDER WHY???? *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "11/11/2008",
        "dateOfIncident": "11/20/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248445,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SLUGGISH, CHUGGING, STALLING OF VEHICLE.  HAD INJECTOR CHANGED BY FORD. PROBLEM HAPPENED AGAIN ON 1/19/2007 THEY SAID LINING IN TANK WAS COMING APART IN THE FUEL TANK.  FORD CHANGED 3 INJECTORS, FUEL PUMP, FUEL FILTERS AND FUEL TANK.  IS HAS NOW HAPPENED AGAIN 11/7/2008 AND IS NO LONGER UNDER WARRANTY.  *TR",
        "vin": "1FDWF36P93E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/02/2008",
        "dateOfIncident": "10/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247457,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F350. DIESEL 6.0 LITER.   HARD TO START EVEN WHEN WARM OUT, NOW IS NOT  STARTING AT ALL, HAVE HAD THE SAME OIL LEAKS, AT SPEED OF 55 TO 60 JERKS HARD AND HAS EVEN STALLED WHILE DRIVING. JUST A FEW OF THE PROBLEMS AND WE KEEP SPENDING MONEY TO HAVE FIXED AND THEY JUST RECUR AGAIN. BEEN READING PEOPLE HAVE BEEN HAVING THE SAME PROBLEMS AS US. FORD IS NOT DOING ANYTHING TO FIX THIS. *TR",
        "vin": "1FTSW31PX3E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/20/2008",
        "dateOfIncident": "10/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246136,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CLUTCHES, LOTS OF THEM, WHEN THEY FAIL ITS HARD TO STOP TRUCK, NOT FROM ABUSE FAILING FROM DEFECTIVE PARTS THIS HAS BEEN ONGOING FOR A YEAR, FORD WONT STAND BEHIND IT, ALSO HAVE HAD LOTS OF CLUTCH MASTER CYLINDERS, WHEN THIS GOES THERE IS NO STOPPING, AM I THE ONLY ONE HAVING THIS PROBLEM?  CHECK ONLINE SEEMS LIKE ACROSS THE BOARD CLUTCH PROBLEMS AT FORD.  *TR",
        "vin": "1FTWW33F73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/06/2008",
        "dateOfIncident": "10/06/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10244582,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 FORD F350 KING RANCH WITH A 6.0L DIESEL MOTOR.  THE TRUCK HAS HAD A VARIETY OF SOFTWARE FAILURES WITH RESPECT TO THE PCM FOR THE MOTOR WHICH HAS RESULTED IN THE MOTOR COMPLETELY AND INSTANTANEOUSLY SHUTTING DOWN OR CATASTROPHIC FAILURE OF THE TURBOCHARGER RESULTING IN THE TURBO OVER BOOSTING AND BLOWING UP THE INTERCOOLER OR NO PSI OUT OF THE TURBO LEAVING ME AND MY FAMILY STRANDED TWICE IN THE MOUNTAINS PULLING A FULL TWO HORSE TRAILER (6,500 POUNDS).  VEHICLE HAS BEEN INTO BAKERSFIELD FORD, VISALIA FORD, RANCHO FORD FOR SERVICE.  PCM SYSTEM WAS ALWAYS REFLASHED AND REPAIRS MADE UNDER WARRANTY UNTIL THE MOST RECENT TURBOCHARGER FAILURE 09-28-2008.  THE VEHICLE WAS 5 MONTHS OUT OF WARRANTY AND THIS FAILURE COST ME $2,700.  TODAY 10-6-2008 THE PCM LOST ALL ITS MEMORY AND I AGAIN LOST POWER ON THE FREEWAY AND WAS NEARLY HIT BY MULTIPLE VEHICLES TRYING TO GET TO THE SIDE OF THE ROAD AND OFF THE FREEWAY.  THIS WAS FIVE DAYS AFTER GETTING THE TRUCK BACK FROM FORD.  A PROCESS WAS WENT THROUGH AT FORD TO RE-LEARN THE \"TURBO STRATEGY\" AND THE TRUCK WAS RETURNED TO ME WORKING FINE. *TR",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "09/30/2008",
        "dateOfIncident": "06/29/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243963,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT 70MPH A FUEL INJECTOR FAILED LITTERING THE #3 CYLINDER WITH DEBRIS.  A BLUE SMOKE CLOUD IMMEDIATELY BLANKETED THE HIGHWAY REDUCING VISIBILITY TO NEAR ZERO.  FORTUNATELY I WAS ABLE TO FIND A SAFE LOCATION TO PULL OFF BEFORE THE ENGINE SEIZED.  I TOWED THE  TRUCK TO THE FORD DEALER FOR AN ESTIMATE FOR REPAIRS.  I WAS ADVISED THAT A FUEL INJECTOR HAD FAILED AND IT COULD BE REPAIRED FOR $750.  I AUTHORIZED THE REPAIR AND RECEIVED A CALL THAT AFTERNOON THE TRUCK WAS DONE HOWEVER #3 CYLINDER COMPRESSION WAS HALF OF NORMAL.  THEY RECOMMENDED A \"SHORT BLOCK\"  WHICH COSTS $8,000 PLUS LABOR. I WAS ANGRY AND PAID THE BILL AND SOUGHT OUT A SECOND OPINION.  I CHOSE TO REPLACE THE ENTIRE ENGINE AFTER SEEING THE DAMAGE AND ON THE ADVICE OF THE SECOND MECHANIC.  I DID NOT WANT TO PUT THE OLD INJECTORS INTO A NEW MOTOR.  THIS WAS NOT THE FIRST INJECTOR TO FAIL ON THIS TRUCK, HOWEVER THE FIRST DID NOT CAUSE CATASTROPHIC FAILURE AND WAS COVERED UNDER WARRANTY,  I HAVE HEARD OTHER ANECDOTAL REPORTS OF SIMILAR FAILURES.  THIS WAS A WELL MAINTAINED VEHICLE WITH ALL THE WORK DONE AT FORD DEALERSHIPS AT THE RECOMMENDED INTERVALS.  I HAD THE MECHANIC SAVE THE DAMAGED PISTON WHICH BEARS THE IMPRINT OF THE INJECTOR DEBRIS INCLUDING PARTIAL PART NUMBER.  BEFORE TAKING THE TRUCK FROM THE DEALERSHIP I HAD THEM SUBMIT A REQUEST FOR ASSISTANCE FROM FORD TOWARD THE REPAIR WHICH WAS DECLINED.  I BELIEVE THIS PART FAILED PREMATURELY @ 120,000 MILES DUE TO A FLAW IN DESIGN OR CONSTRUCTION.  I HAVE A REASONABLE EXPECTATION OF GREATER LONGEVITY  FOR A HEAVILY BUILT DIESEL ENGINE FOR WHICH I PAID AN EXTRA $6000 OVER BASE PRICE.  A FAILURE COULD EASILY HAVE CAUSED AN ACCIDENT DUE TO THE THICK BLUE SMOKE OR THE INABILITY TO GET THE VEHICLE OFF THE ROAD UNDER ITS OWN POWER . *TR",
        "vin": "1FTSF31P43E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/01/2008",
        "dateOfIncident": "07/22/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236611,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 FORD F-350 SD.  WHILE THE CONTACT WAS EXAMINING HIS VEHICLE, HE NOTICED OIL SPOTS ON THE FLOOR OF THE GARAGE.  THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC AND THEY DISCOVERED THAT THE OIL PAN WAS EXTREMELY RUSTED AND THE VEHICLE WAS SERVICED FOR THE FAILURE.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER.  THE CURRENT AND FAILURE MILEAGES WERE 61,800.",
        "vin": "1FTSW30F03E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/24/2008",
        "dateOfIncident": "10/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235595,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRUCK BEGAN STARTING A LITTLE HARD ABOUT 2 WEEKS BEFORE THIS OCCURRED. AT ABOUT 60-70 MPH, TRUCK LOST POWER, ON HIGHWAY. VEHICLE BUCKED, AND CONTINUED TO COME TO A STOP. NO WARNING LIGHTS CAME ON. TURNED OFF VEHICLE, WOULD NOT RESTART. BROUGHT TO DEALER, FUEL INJECTORS WERE BAD. $700.00 BILL LATER, TRUCK LEAVES THE DEALER. THIS HAS HAPPENED TWICE NOW, AND THE TRUCK IS BEGINNING TO START HARD AGAIN WHEN COLD, WILL NOT RESTART WHEN HOT.  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/04/2008",
        "dateOfIncident": "06/24/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10233199,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD MOTOR COMPANY PUT OUT DEFECTIVE COOLANTS ON THEIR 6.0L DIESEL ENGINES. I HAVE/HAD 2003 F350 KING RANCH TRUCK WITH 67,000 MILES. FORD WARRANTIES DIESEL ENGINES TO 5 YEAR 100,000. ON JUNE 24, 2008, I WAS DRIVING WHEN MY TRUCK OVERHEATED. I PULLED OFF THE ROAD AND CALLED FORD NORTH SCOTTSDALE. THEY SAID THAT THE EJR COOLANTS ARE NOT GOOD ON THOSE TRUCKS AND MOST LIKELY IT GAVE OUT. THEY TOLD ME TO GET IT TO THE NEAREST DEALERSHIP. I DROPPED THE TRUCK OFF AT BELL FORD IN ARIZONA ON TUESDAY JUNE 24 TO LEARN THAT MY WARRANTY EXPIRED MAY 28, 2008. I GOT DIAGNOSTICS DONE AND THE HEAD GASKETS BLEW. BELL FORD SAID THEY BLEW BECAUSE THE COOLANT WENT OUT AND BLEW OUT THE WATER, WHICH OVERHEATED THE COOLANTS. WE CONTACTED FORD MOTOR COMPANY AND THEY HAD 2 CST (MARK & STEVE) \"RESOLVE\" THE DISPUTE AND SAY THEY CANT HELP US. I SPECIFICALLY ASKED, THAT WHY WOULD THEY NOT RECALL A PART THEY KNOW IS NOT EFFICIENT? THEY DID NOT GIVE ME AN ANSWER. AFTER DOING MORE RESEARCH, I HAVE SINCE LEARNED THAT THIS IS A VERY COMMON PROBLEM WITH THE 6.0L. I AM LOOKING AT $4300 JUST FOR THE HEAD GASKETS AND THEN PLENTY MORE IN LABOR CHARGES. THIS DOES NOT EVEN INCLUDE GETTING THE COOLANT FIXED. WILL I EVER BUY FORD AGAIN? MOST LIKELY NOT. THEY CANT STAND BEHIND THEIR PRODUCT OR HELP THEIR CUSTOMER. THIS IS A TRUCK THAT HAS BEEN BABIED AND UP TO DATE FOR ALL MAINTENANCE. AND NOW ITS DESTROYED.   *TR",
        "vin": "1FTSW31P53E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/01/2008",
        "dateOfIncident": "06/24/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10232916,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED THIS TRUCK IN NOVEMBER 2004 WITH 42,000 MILES.  IT NOW HAS 67,000 MILES AND BLOWN HEAD GASKETS.  THE WARRANTY EXPIRED ON 28 MAY 2008 AND I DID NOT RENEW BECAUSE THERE WERE NO PROBLEMS AND IT HAS SUCH LOW MILEAGE.  ON 24 JUNE 2008 THE HEAD GASKETS FAILED WHILE HAULING A HORSE TRAILER.  FORD WILL NOT DO ANYTHING AND THE COST WILL BE IN EXCESS OF 4,000 DOLLARS.  EVIDENTLY, THERE IS A KNOWN PROBLEM ABOUT EGR COOLERS LEAKING WHICH WOULD HAVE CAUSED THE PROBLEM.  THIS TRUCK HAS BEEN WELL MAINTAINED AT A REPUTABLE DEALER THROUGH THE 3.5 YEARS THAT I HAVE OWNED IT.  IS THERE ANY HELP THAT I CAN GET OR ADDRESSES WHERE THIS COMPLAINT MAY BE SENT?  I WILL NEVER BUY A FORD PRODUCT AGAIN, AND THAT IS SAD.  *TR",
        "vin": "1FTSW31P53E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/21/2008",
        "dateOfIncident": "04/15/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228590,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY EXPERIENCED SEVERE SURGING AT IDLE, MAKING THE VEHICLE JUMP FORWARD, ROUGH ACCELERATION, AND COMPLETE STALLING AT VARIOUS SPEEDS.  TOOK VEHICLE TO DEALER FOR REPAIR.  THEY REPLACED THE ICP SENSOR, AND THE ICP WIRING HARNESS (WHICH WAS BURNT AND SHORTING OUT), AND CLEANED INJECTORS = $1348.00  THIS IS THE SAME ISSUE THAT FORD RECALL NO. 05S34 ADDRESSES ON THE SAME TRUCK, SAME ENGINE (6.0), BUT ONE YEAR NEWER.  FORD DID NOT RETURN OLD PARTS TO ME AND I FAILED TO ASK FOR THEM.  I AM CONVINCED THAT THE SHORTING OUT OF THE ICP HARNESS, LIKE THE PROBLEM IN #05S34, CAUSED THE SENSOR TO FAIL.  *TR",
        "vin": "1FTWW33PX3E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2008",
        "dateOfIncident": "04/19/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228003,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALONG WITH OTHERS ARE HAVING PROBLEMS WITH BRAKE LINES RUSTING OUT AND FAILING ON FORD TRUCKS. MY REAR BRAKE LINES RUSTED OUT AT THE POINTS WHERE THE  LINES ARE CONNECTED TO THE FRAME. I HAVE SPOKEN WITH OTHER FORD TRUCK OWNERS AND AM HEARING SIMILAR STORIES. I OWN A 2003 FORD  F-350 4 WHEEL DRIVE WITH A V-10 GAS ENGINE. I FIND IT HARD TO BELIEVE  THAT I SHOULD HAVE 2 BRAKE LINES RUST OUT ON A TRUCK THAT IS ONLY 5.5 YEARS OLD AND ONLY HAS 55K MILES ON IT.  MY BRAKES FAILED EARLY ON A SUNDAY MORNING SO I WAS ABLE TO STOP MY TRUCK BEFORE THERE WAS AN ACCIDENT. I HAVE SPOKEN TO MECHANICS AND WAS TOLD THE CONNECTOR USED TO HOLD THE BRAKE LINE TO THE FRAME SCRATCHED OFF A PROTECTIVE COATING THAT KEEPS THE BRAKE LINES FROM RUSTING THUS I ONLY HAD RUST IN THE AREAS WHERE THE CLIPS WHERE. I HAD TO PAY 767.76 DOLLARS TO HAVE THIS PROBLEM FIXED WITH ONLY A GUARANTEE THAT IT WILL HAPPEN AGAIN WITHIN THE NEXT 5 OR 6 YEARS.  *TR",
        "vin": "1FTSX31S73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2008",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228034,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK (2003 F-350SD) LOST ALL POWER WHILE DRIVING. THE DEAL REPLACED THE EGR VALVE. THE DEALER SAID THAT THIS IS A KNOWN PROBLEM WITH 6.0L D MOTORS. THE EGR VALVE WILL STOP UP AND NOT ALLOW THE EXHAUST TO ESCAPE.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/08/2008",
        "dateOfIncident": "03/17/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10223684,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SEAT BELT LATCH IN THE REAR OF MY 2003 FORD F350 4DR QUIT WORKING APPROX 1 YEAR AGO. THE BUTTON STAYS IN SO IT WILL NOT LATCH. I THOUGHT THE SEAT BELTS HAD A LONGER WARRANTY, SO I WASN'T TO CONCERNED TO GET IT FIXED RIGHT AWAY. I GOT A RECALL NOTICE FROM FORD FOR THE CAM POSITION SENSOR (7.3L DIESEL), SO WHILE IT WAS IN, I ASKED ABOUT THE SEATBELT. THEY SAID MY WARRANTY WAS OUT BY LESS THAN 2 WEEKS AND COULD NOT HELP ME. I EVEN CONTACTED FORD CUSTOMER SERVICE AND AGAIN NO HELP. I HAVE AN 88 CHEVY  TRUCK AND A 95 GMC AND HAVE HAD NO SEATBELT ISSUES. IT SEEMS TO ME THAT THE BELTS SHOULD FUNCTION PROPERLY FOR MORE THAN 5 YEARS, AND THE FACT THAT IT WENT BAD AT AROUND 4 YEARS IS EVEN WORSE.  *TR",
        "vin": "1FTWW33F93E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/28/2008",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10216268,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE RECEIVED A RECALL NOTICE IN SEPT. 07 TO FIX  AND OR REPLACE MY \" I N 5 MONTHS ) AND HAVE BEEN TOLD THEY STILL DO NOT HAVE THE PARTS TO REPAIR THIS PROBLEM.   AS I DRIVE THIS VEHICLLE ALL THE TIME I CAN EITHER DO WITHOUT CRUISE CONTROL OR TAKE A CHANCE ON A FIRE.   JUSTWONDERINGIF YOU CAN HELP??*CN",
        "vin": "1FDWE35S13H"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/14/2008",
        "dateOfIncident": "01/08/2008",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214738,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR COMPANY HAS PURCHASED A 2003 FORD F350 IN JULY 2003 IT HAS 18,000 MILES ON IT AND HAS HAD 3 TURBO'S INSTALLED IS RUNS ROUGH LACKS POWER AND CONTINUES TO HAVE PROBLEMS WE DO NOT DRIVE THE TRUCK OFTEN BUT IS  RUN DAILY. I CAN'T IMAGINE THE PROBLEMS WE WOULD HAVE IF DRIVEN 500 MILES A WEEK . MY CONCERNS ARE WHAT WILL HAPPEN WHEN THE WARRANTY RUNS OUT AND I NEED TO PAY 1500 FOR A TURBO OR NEW ENGINE OR INJECTORS.  *TR",
        "vin": "1FDWF37P33E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/06/2007",
        "dateOfIncident": "07/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202675,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "AMERI-TECH",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "2003 F-350 TIRE BLOW OUT CAUSING DAMAGE. CUSTOMER STATES THAT THE TIRE BLEW OUT WITHOUT WARNING CAUSING DAMAGE TO THE TRUCK. CUSTOMER STATES THE INTERNET DESCRIBES A LOT OF PEOPLE WITH THIS PROBLEM AND WANTS TO BE REIMBURSED. *KB  *JB",
        "vin": "1FTWW33PX3E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/01/2007",
        "dateOfIncident": "03/01/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198194,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 FORD F350 SUPER DUTY.  THE CONTACT RECEIVED A RECALL NOTICE FROM FORD IN MARCH OF 2006 REGARDING EMISSION.  THE RECALL REPAIR WAS PERFORMED ON THE VEHICLE, BUT THE FAILURE STILL OCCURS.  THE DEALER AND MANUFACTURER STATED THAT NOTHING COULD BE DONE BECAUSE THE DEFECT IS COMPUTER RELATED.  THEY STATED THAT THEY WERE WAITING FOR A NEW RE- FLASH TO BE DEVELOPED FOR THE DEFECT.  THE RECALL NUMBER WAS UNKNOWN.  THE CURRENT MILEAGE WAS 30,000 AND FAILURE MILEAGE WAS 10,000.",
        "vin": "1FTSX31P23E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "07/24/2007",
        "dateOfIncident": "07/20/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197306,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY FORD F350 ON JANUARY 16, 2007 FROM JOHN BLEAKLY FORD, IN GEORGIA  MY FUEL INJECTORS HAVE GONE BAD SINCE THEN. ON 7/22/07 MY TRUCK SUDDENLY LOST POWER IT WOULD TURN BUT WON'T REV AND AFTER A WHILE WILL NOT EVEN TURN. IT WAS FINALLY DIAGNOSED AS FAULTY INJECTORS. I HAVE A $27,000 TRUCK LOAN AND HAVE ONLY PAID 4 MONTHS ON THIS TRUCK. I AM A SOLE PROPRIETOR AND HAVE A FAMILY TO SUPPORT. I STRONGLY BELIEVE THERE IS AN ONGOING PROBLEM WITH THEIR FUEL INJECTORS IN THE 6.0 LITER ENGINE. AFTER MANY HOURS OF RESEARCH, I HAVE LEARNED THAT THERE WAS A FIRST MASSIVE RECALL IN APRIL, 2003 FOR 66,720 TRUCKS FORD SOLD WITH THE 6.0 LITER DIESEL ENGINE TO REPLACE THE FUEL INJECTION CONTROL PRESSURE SENSOR. I\u0019VE ALSO LEARNED THERE WERE NEARLY 500 BUYBACKS OF TRUCKS WITH ENGINES SO BADLY FLAWED THAT THEY COULDN'T BE FIXED. APPARENTLY, A BATCH OF FAULTY FUEL INJECTORS LEAKED SO MUCH DIESEL FUEL THAT FUEL FILLED THE CRANKCASE, CAUSING ENGINES TO SEIZE. THERE WERE ALSO GLITCHES WITH THE TURBOCHARGER AND ENGINE CONTROL SOFTWARE. MY RESEARCH HAS ALSO REVEALED THAT MANY DEALERSHIPS HAVE REPLACED THE ENGINES FOR CUSTOMERS AND THAT FORD HAS BOUGHT BACK TRUCKS.  *TR",
        "vin": "1FTWX32PX3E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/11/2007",
        "dateOfIncident": "06/24/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196060,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "AMERI-TRAC",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 FORD F350 SUPER DUTY.  THE CONTACT HAD A BLOWOUT ON THE FRONT PASSENGER SIDE GENERAL AMERI-TRAC TIRE.  THE TIRE IS A FACTORY TIRE WITH ONLY 29,000 MILES.  THE MANUFACTURER HAS NOT YET BEEN NOTIFIED.  THE DOT NUMBER WAS UNKNOWN.  THE CURRENT MILEAGE IS 29,130 AND FAILURE MILEAGE WAS 29,000.",
        "vin": "1FTWW33PX3E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/24/2007",
        "dateOfIncident": "05/22/2007",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10191674,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON LEAVING THE FREEWAY AT 55MPH, I PROCEEDED UP THE EXIT RAMP TO A STOP LIGHT. I BRAKED TO SLOW AND NOTICED THAT THE VEHICLE WAS STILL CREEPING FORWARD AND THE ENGINE WAS STILL RACING. I SLAMMED THE BRAKE ALL THE WAY TO THE FLOORBOARD AND SHIFTED THE AUTOMATIC GEARSHIFT INTO PARK AS THE ENGINE WAS STILL RACING. THE ENGINE ONLY THEN RETURNED TO A NORMAL IDLE.  IF ANYONE WAS IN FRONT OF ME I WOULD HAVE HIT THEM OR CONTINUED INTO THE INTERSECTION.  VEHICLE WAS TAKEN TO THE FORD DEALER BUT THEY HAVE YET TO DETERMINE THE PROBLEM.",
        "vin": "1FTWF33P63E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/28/2007",
        "dateOfIncident": "04/20/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189152,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN TRAFFIC, TRUCK STARTED CUTTING OUT COULD BARELY GET TO THE SIDE OF THE ROAD, SWAPPED IN MY SPARE CPS AND TRUCK STARTED RIGHT UP AND I DROVE AWAY WITH NO PROBLEMS. *TR",
        "vin": "1FTSX31F83E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/13/2006",
        "dateOfIncident": "12/13/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10176084,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SALES OF A VEHICLE WITH SUPPORTING VIN DATA NOT MATCHED TO ACTUAL EQUIPMENT RECEIVED.  THIS MISMATCHED DATA HAS CAUSED THE WRONGFUL ORDERING AND INSTALLING OF A REPLACEMENT REAR GEAR RATIO THAT DOES NOT MATCH UP WITH THE FRONT RATIO WHILE IN FOUR WHEEL DRIVE.  THIS MISMATCH CAUSES A BIND ON THE TRANSFER CASE WHICH COULD EXPLODE AND CAUSE PERSONAL INJURY.  OF COURSE THIS MIGHT BE A ONE TIME PROBLEM, BUT MORE THAN LIKELY UNDER MODERN MANUFACTURING PROCESSES THERE COULD BE AN ENTIRE SERIES OF TRUCK PRODUCED.  *JB",
        "vin": "1FTSF31LX3E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/27/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169459,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "23585R16",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "BACKGROUND: ORIGINAL GENERAL TIRES ON 2003 F350 DUAL-TIRE TRUCK, APPROX 30,000 MILES. TIRE SIZE IS LT235/85R16.  1 WEEK PRIOR TO INCIDENT, ALL TIRES WERE ROTATED, BALANCED AND PRESSURE WAS PER MANUFACTURE SPECS AT LOCAL TIRE STORE.  FAILURE: AFTER DRIVING APPROX. 1 MILE FROM HOME, LEFT-OUTER REAR TIRE TREAD SEPARATED FROM BELTS DAMAGING LIGHT WIRING, AND DESTROYING FENDER WELL. (PICTURES CAN BE SENT IF DESIRED). TIRE WAS SENT TO MANUFACTURER.  TIRE DID RETAIN AIR AND DID NOT BLOW SINCE IT WAS A DOUBLE TIRE AREA.  TIRE WAS REMOVED BY OWNER AFTER REDUCING TIRE PRESSURE AS A SAFETY PRECAUTION. SINCE WE WERE UNSURE IF ANOTHER TIRE SEPARATION WAS UPCOMING , WE HAVE REMOVED ALL 6 TIRES AND REPLACED THEM WITH ANOTHER BRAND. ESTIMATES HAVE BEEN COMPLETED AT THE LOCAL REPAIR SHOP TO REPLACE FENDER WELL AND WIRING. LUCKILY NO OTHER VEHICLES WERE HIT BY THE FLYING DEBRIS, NOR WERE ANY INJURIES INCURRED.  *NM",
        "vin": "1FTWX33P33E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2006",
        "dateOfIncident": "01/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169038,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 FORD F-350 SUPER DUTY TRUCK SPEEDOMETER AND ODOMETER QUICK WORKING AND REQUIRED REPLACEMENT OF THE ENTIRE INSTRUMENT PANEL.  IT TOOK MONTHS TO GET A REPLACEMENT UNIT FROM FORD BECAUSE (ACCORDING TO THE DEALER) THE UNITS WERE SO BACK-ORDERED DUE TO THE HIGH RATE OF FAILURE OF THIS PARTICULAR ASSEMBLY.  I HAD TO PAY FOR THE REPLACEMENT UNIT.  DURING THE MONTHS I DROVE WITHOUT A SPEEDOMETER AND ODOMETER, THERE WAS NO WAY TO DETERMINE HOW FAST I WAS DRIVING NOR ANY ACCURATE MEANS OF KEEPING TRACK OF THE ACTUAL MILEAGE OF THE VEHICLE.  THE DEALER KEPT THE FAULTY UNIT.  A VEHICLE WITHOUT A SPEEDOMETER SHOULD BE OUTLAWED.  A VEHICLE WITHOUT ANY METHOD OF DETERMINING THE ACTUAL MILEAGE BY WHICH TO MONITOR EPA COMPLIANCE SHOULD ALSO BE OUTLAWED.  ACCORDING TO THE DEALER, MANY FORD TRUCKS HAVE THIS SAME PROBLEM AND THIS WAS NOT AN ISOLATED INCIDENT.  *NM",
        "vin": "1FTSX31PX3E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/18/2006",
        "dateOfIncident": "09/18/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168536,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 60MPH ON THE INTERSTATE, THE CHECK ENGINE LIGHT ILLUMINATED FOLLOWED BY THE VEHICLE OPERATING AT A REDUCED SPEED.  THIS WAS INTERMITTENT IN NATURE.  THE VEHICLE WAS PULLED OVER WITHOUT INCIDENT.  AFTER TURNING OFF THE IGNITION FOR A MOMENT, THE ENGINE RESTARTED WITHOUT FURTHER INCIDENT.  THE VEHICLE WAS INSPECTED BY A DEALER WHO DETERMINED THE ENGINE COMPUTER NEEDED TO BE REPROGRAMMED.  AFTERWARDS, THE ENGINE STALLING PERSISTED.  THE MANUFACTURER WAS ALERTED.",
        "vin": "1FTSW31P03E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2006",
        "dateOfIncident": "02/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167949,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F-350 DIESEL STALLING.  VEHICLE STALLS WITHOUT WARNING.  CONDITION STARTED WITHIN THE FIRST 7000 MILES.  DEALER SEEMED TO REMEDY AS THE CONDITION NEVER RECURRED UNTIL 37K MILES; NOW, 42K MILES.  COMMENCED STALLING IN FEB 2006 AND HAS STALLED 6 TIMES FROM FEB 2006 TO AUGUST 2006.  THE SECOND TIME IT STALLED, WE WERE IN FREEZING RAIN IN 4X4 DRIVING MY WIFE TO WORK (SHE DIDN'T WANT TO DRIVE IN THOSE CONDITIONS) THE VEHICLE STALLED ON TOP OF TALL BRIDGE 300 FT OVER THE WILLAMETTE RIVER IN ICE CONDITIONS.  LOST STEERING, HAD TO SHIFT TO NEUTRAL WHILE STILL MOVING AND RE-START THE VEHICLE TO RE-GAIN CONTROL.  NORMALLY, THE VEHICLE SIMPLY STALLS IN THE MIDDLE OF THE ROAD, AND WHILE THIS IS A MAJOR DISTRACTION, I'VE MANAGED TO RE-START WITHOUT INCIDENT.      DEALER/FORD HAS BEEN EXCRUCIATING RELUCTANT TO REMEDY.  EVEN THOUGH THEY HAVE RECALLED 180,000 2004-2005 VEHICLES UNDER RECALL 05V27000 7/22/05 FOR THE EXACT SAME SYMPTOM, ENGINE, VEHICLE MODEL, THEY CLAIM TO BE UNAWARE OF THE ABOVE RECALL.  THE VEHICLE HAS BEEN IN FOR REPAIR NUMEROUS TIMES (6 TIMES) SINCE FEBRUARY 2006.  A FLIGHT RECORDER HAS BEEN INSTALLED TWICE TO RECORD COMPUTER DATA.  ONCE THEY INDICATED IT WAS AN EGR PROBLEM AND PRESUMABLY REMEDIED.  STILL STALLS.  GOT ANOTHER STALLING INCIDENT RECORDED ON THE FLIGHT RECORDER (TWICE NOW) BUT APPARENTLY NO GOOD READING.  I HAVE CONTACTED FORD CUSTOMER SERVICE (REGIONAL) THREE TIMES NOW AND THEY HAVE SEEMED TO BE MODERATELY HELPFUL, BUT I DON'T KNOW IF THE SERVICE DEPARTMENT AND CUSTOMER SERVICE COMMUNICATE EFFECTIVELY.      AS IT STANDS NOW, THE DEALER/FORD SERVICE IS IGNORING THE RECALL EXISTS FOR SIMILAR VEHICLES (MY VEHICLE IS AN F-350 6.0 DIESEL WITH THE EXACT SAME SYMPTOMS, BUT IT IS A 2003 MODEL).  THEY WANT ME TO LEAVE THE VEHICLE WITH THE DEALERSHIP TO CONNECT THE FLIGHT RECORDER YET A 3RD TIME AND ALLOW THEM TO DRIVE THE VEHICLE AROUND THE 700 OR SO MILES IT TAKES TO GET A READING (PROBABLY A MONTH) AND I'M RESPONSIBLE FOR ANY LIABILITY. *NM",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2006",
        "dateOfIncident": "06/01/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166444,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE ACCELERATOR POSITIONER WENT DEFECTIVE ON THE VEHICLE, WHICH CAUSED THE ENGINE TO OPEN AND MADE A LOUD SOUND.  ALSO, THE CONTACT EXPRESSED THE ROTORS FOR THE BRAKES FLAKED APART.  THE CONTACT EXPRESSED THE DEALER WAS RESPONSIBLE TO FIX THESE ISSUES AT NO COST, HOWEVER THE DEALER AND MANUFACTURER HAVE OFFERED TO FIX, BUT NOT FOR FREE.*AK  UPDATED 11/3/2006 -  WHILE DRIVING THE CONSUMER LOST CONTROL OF HIS VEHICLE.  THE VEHICLE RAN OFF THE ROADWAY TO THE LEFT THEN RE-ENTERED THE ROAD THEN RAN OFF TO THE LEFT AGAIN AND ROLLED OVER RESULTING IN INJURY TO THE DRIVER AND DAMAGE TO THE VEHICLE.     *NM",
        "vin": "1FTSW31P73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/21/2006",
        "dateOfIncident": "07/16/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163051,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE OF A 2003 FORD WENT OUT AND WAS REPLACED WITH A NEW ENGINE BY THE FORD DEALER SHIP.  A FEW DAYS AFTER WE GOT THE TRUCK BACK IT WAS DRIVEN APPROX. 600 MILES, PULLING A TRAILER, WHEN THE ENGINE BEGAN TO BACK FIRE AND SPUTTER GOING DOWN THE INTERSTATE.  THE TRUCK WAS PULLED TO THE SIDE OF THE ROAD AND SHUT OFF.  THE ENGINE WAS CHECKED FOR ANY VISUAL PROBLEMS AND THEN STARTED AGAIN.  AFTER IT WAS RESTARTED THE ENGINE BEGAN TO PICK UP RPM.  AT THAT POINT THE EGNITION WAS SHUT OFF AND THE KEY REMOVED.  THE ENGINE CONTINUED TO RUN!  THE ENGINE CONTINUED TO INCREASE IT'S RPM UNTIL I THOUGHT THE ENGINE WOULD BLOW UP.  I TOLD MY GRANDWON WHO WAS TRAVELING WITH ME TO HIT THE DITCH AND I TRIED TO REMOVE THE BATTERY CABLES.  I FINALLY HAD TO LEAVE FOR FEAR THE ENGINE WOULD BLOW UP IN MY FACE.  THE ENGINE DID BLOW BUT NO FIRE WAS STARTED.  I TOWED IT TO THE FORD DEALERSHIP AND WAS TOLD THAT THE PROBLEM WAS MOST LIKELY THE TURBO THAT WENT OUT WHICH CAUSED THE ENGINE FAILURE.  WE ARE NOT HAVING IT FIXED AND IT HAS NOT AS YET BEEN DETERMINED IF THE ENGINE IS COMPLETELY RUINED.  IF IT IS, THE TURBO CAUSED THE FAILURE AND WE ARE BEEING TOLD THAT  THE WARRENTY ON THE NEW ENGINE WILL NOT COVER THE DAMAGE.   THE CONCERN IS THE RUN AWAY ENGINE.  SHOULD THE IGNITION SWITCH NOT ALWAYS SHUT OFF THE ENGINE?  WHAT WOULD HAVE HAPPENED IF THIS HAD BEEN IN GEAR AND THE TRUCK, PULLING A TRAILER, HAD BEEN RUNNING DOWN A CROUDED INTERSTATE?  THE DEALERSHIP IS TREATING US FAIRLY ON THE TRADE IN BUT WE FEEL LIKE THIS IS A DEFECT SOMEWHERE ALONG THE LINE WHEN A TRUCK IS OUT OF CONTROL.",
        "vin": "1FTWW32P33E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/20/2006",
        "dateOfIncident": "06/19/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 F 350 W/6.0 DIESEL FORD IS VERY UNSAFE STALLING SOME TIME NO POWER. *JB",
        "vin": "1FTWW33P43E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/20/2006",
        "dateOfIncident": "06/14/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160223,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "65 MPH RIGHT FRONT TIRE FAILURE (BLOW-OUT TREAD SEPARATION).  2003 FORD F350 DRW 4 WD PICK UP TOWING A 3 HORSE GOOSENECK HORSE TRAILER.  *JB",
        "vin": "1FTWX33F63E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/24/2006",
        "dateOfIncident": "04/24/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155989,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS AND APPLYING BRAKE PRESSURE THERE WAS A PRONOUNCED VIBRATION IN THE FRONT END.  THE VEHICLE WAS SEEN BY A DEALER FOR INSPECTION.  THE SHOCKS AND TIRES WERE REPLACED, BUT THE PROBLEM PERSISTED.  THE DEALER SUGGESTED INSTALLING AN AFTER MARKET DAMPENING KIT TO CORRECT THE FRONT SUSPENSION VIBRATION.  THE MANUFACTURER WAS ALERTED.",
        "vin": "1FTWW32P73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/22/2006",
        "dateOfIncident": "04/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155862,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F350 CREW CAB TRUCK WITH 6.0 DIESEL POWERED ENGINE LOOSES POWER WHILE DRIVING ON THE HIGHWAY. CAUSE: FUSE #22 BLOWS AND THE ENGINE SHUTS DOWN. THIS HAS HAPPENED TWICE IN A NINE MONTH PERIOD - LAST INCIDENT WAS ON DATE BELOW. TRUCK PURCHASED JUNE 30, 2003 AND HAS APPROXIMATELY 18,000 MILES ON IT.  *JB",
        "vin": "1FTSW31P93E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/18/2006",
        "dateOfIncident": "04/15/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10155567,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS TRAVELING DOWN RTE 37W IN TOMS RIVER NJ WHEN A LOUD \"BOOM\" OCCURRED IN MY ENGINE FOLLOWED BY A CONTINUOUS LOUD \"TICKING\" SOUND.   I HAD MY VEHICLE TOWED (2003 FORD F-350) TO THE LOCAL FORD DEALERSHIP FOR INVESTIGATION.  AFTER SPEAKING WITH LEAD TECHNICIANS AT FORD, I WAS INFORMED THAT THIS IS A VERY COMMON ISSUE WITH FORD MOTORS AND THEY ARE SURPRISED THIS HAS NOT BEEN RECALLED.  MY SPARK PLUG WAS EJECTED OUT OF THE CYLINDER HEAD DUE TO LACK OF THREADING WITHIN THE CYLINDER HEAD.   THIS WILL COST APPROX $4000.00 TO REPAIR THIS.     I HAVE CONTACTED FORD DIRECTLY AND THEY CANNOT ASSIST ME WITH THIS REPAIR AND DO NOT RECOGNIZE THIS TO BE A PROBLEM WITH FORD MOTORS.     I STARTED DOING MY OWN RESEARCH ON THIS ISSUE VIA INTERNET AND HAVE COME ACROSS HUNDREDS OF CASES AND COMPLAINTS OF THIS ISSUE HAPPENING WITH FORD ENGINES.  THERE IS EVEN A CLASS ACTION SUIT THAT IS IN THE WORKS OUT OF CALIFORNIA.    SOME OF THE LINKS CONTAINING THIS INFORMATION CAN BE FOUND HERE:  HTTP://WWW.CONSUMERAFFAIRS.COM/AUTOMOTIVE/FORD_SPARK.HTML  HTTP://WWW.TWOGUYSGARAGE.COM/FORUM/ARCHIVE/INDEX.PHP/T-7423.HTML   HTTP://WWW.JASPERENGINES.COM/PDF/4.6_&_5.4_STRIPPED_THREADS.PDF    THIS IS A VERY SERIOUS ISSUE AND VERY COSTLY TO REPAIR.   THIS IS ALSO VERY COMMON AMONGST FORD TRUCK MOTORS.   IF YOU LOOK AT THE LINKS I HAVE PROVIDED ABOVE OR EVEN DO A SEARCH ON SPARK PLUG PROBLEMS WITH FORD VEHICLES, YOU WILL SEE HOW OFTEN THIS OCCURS BUT FORD FAILS TO PROVIDE ANY ASSISTANCE WITH THIS MATTER.  *JB",
        "vin": "1FTSW31L83E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/04/2006",
        "dateOfIncident": "03/10/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154490,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 65 MPH, THE ENGINE HESITATED AND STALLED.  THE VEHICLE WAS TOWED TO THE DEALER WHERE THE FUEL INJECTORS WERE REPLACED.  HOWEVER, THE PROBLEM STILL EXISTED. AK",
        "vin": "1FTWW32P13E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/27/2006",
        "dateOfIncident": "01/17/2006",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10151324,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE SHIFTING FROM REVERSE TO PARK, THERE IS A VERY LOUD CLANKING, METAL TO METAL NOISE.  THERE IS A METALLIC SOUND THAT OCCURS ALL THE TIME, BUT IS VERY NOTICEABLE WHILE SHIFTING FROM REVERSE TO PARK.  THE VEHICLE HAS BEEN TO THREE DIFFERENT DEALERSHIPS.  ALL THREE DEALERSHIPS WERE UNABLE TO DETERMINE THE SOURCE OF THE PROBLEM.",
        "vin": "2FTWW32P23E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/14/2005",
        "dateOfIncident": "04/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145192,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WIRING HARNESS MELTED, HAD TO BE REPLACED.  DEALER AT FIRST ATTEMPTED TO SAY IT WAS A LOOSE OIL CAP THAT CAUSED THE PROBLEM, THEN AFTER A WEEK FOR REPAIR SIMPLY SAID THE WIRING HARNESS MELTED AND HAD TO BE REPLACED.  VEHICLE WAS IN SHOP OVER AT 4,000 MILES, BECAUSE THE HIGH PRESSURE OIL CAP FELL OFF OF THE VEHICLE, AND IT LOST ALL OF ITS OIL, NUMEROUS TIMES IN THE SHOP FOR INJECTORS, FORD KNOWS ABOUT THE PROBLEM BUT REFUSES TO FIX THE TRUCK.  SO NEEDLESS TO SAY IT IS A FAULTY PRODUCT, IT HAS LOST ALL OF ITS OIL ONCE, ITS PARTS WERE MELTED, WHICH SAYS TO ME UNSAFE.  I DID NOT RECEIVE ANY INFORMATION ON A RECALL FOR THE ENGINE.  MY FATHER WAS DRIVING IT TO THE SHOP WHEN THE RADIO WAS GOING IN AND OUT, HE THOUGHT IT WAS A PROBLEM WITH THE BATTERY.  WHILE IT MELTED THE HARNESS IT COULD HAVE MELTED MY FATHER.  THE TRUCK NO LONGER RUNS AND SITS BECAUSE IT IS TO COSTLY TO REPAIR EVERY 10,000 MILES.  I DO NOT REMEMBER THE EXACT MONTH I HAVE A STACK OF REPAIR ORDERS. *JB",
        "vin": "1FDWF36P93E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/29/2005",
        "dateOfIncident": "07/01/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134667,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THERE WAS A PROBLEM WITH THE WIRING THAT CAUSED THE VEHICLE TO STALL WHILE THE CONSUMER WAS DRIVING.  THE BRAKES AND THE STEERING FAILED  BECAUSE OF THIS.  THE FIRST TIME THIS PROBLEM OCCURRED WAS ON 7-1-05.  THE CONSUMER TOOK VEHICLE TO A DEALER FOR REPAIRS, AND THEY REPLACED A BLOWN FUSE.   THIS PROBLEM  OCCURRED AGAIN ABOUT 36 MILES AFTER HE PICKED IT UP FROM THE DEALER.  THE CONSUMER TOOK IT TO A DIFFERENT DEALERSHIP.  THEY TOLD HIM THAT THIS WAS A COMMON PROBLEM WITH HIS TYPE OF VEHICLE.  HE WAS TOLD THAT THERE WAS A RECALL ON  THE 2004 MODELS FOR THE SAME PROBLEM.  THE SECOND DEALERSHIP REPAIRED THE WIRING HARNESS.  ALSO, THEY TOLD HIM THAT THE PROBLEM OCCURRED BECAUSE OF CHAFFING OR RUBBING OF THE WIRES.  SO FAR THIS HAS FIXED THE PROBLEM.  *AK",
        "vin": "1FTSW31P43E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "08/23/2005",
        "dateOfIncident": "08/22/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10133857,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "AMERI-TECH",
                "productModel": "AMERI-TECH",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "I HAVE HAD TWO GENERAL - AMERITEC TIRES LOSE THE TREADS AND BLOW OUT IN THE LAST MONTH.  ONE HAD 39500 THE OTHER HAD 40000.  I HAVE A TRUCK (F-350) WITH DUAL WHEELS, BOTH WERE IN BACK.  THE TIRES CAME WITH THE TRUCK AND WERE NOT OVERLY WORN.",
        "vin": "1FDWF37P83E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "07/15/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10129066,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATESDTHE FRONT PASSENGER SIDE TIE ROD  BROKE ,CAUSING AN ACCIDENT.  CONSUMER'S VEHICLE  WAS GOING APPROXIMATELY 65 MPH WHEN THE ACCIDENT OCCURRED.  THE VEHICLE WAS  AT A BODY SHOP TO BE REPAIRED.  THE VEHICLE HAS NOT BEEN TO A SERVICE DEALER YET.  *AK",
        "vin": "1FTWW33FX2E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": true,
        "dateComplaintFiled": "06/20/2005",
        "dateOfIncident": "06/18/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10125784,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONSUMER HAS PREVIOUSLY FILED A COMPLAINT FOR THE SAME PROBLEM ON OCTOBER 22, 2004, AT THAT TIME HE SPOKE WITH FRANK BORIS AND STEVE CHAN.  THE VEHICLE CUTS OFF WHILE DRIVING, AND STEERING/ BRAKES GO OUT.  THE CONSUMER WAS TRANSPORTING A 11000 POUND BOAT, THE BRAKES ON THE TRAILER ACTUALLY STOPPED THE VEHICLE.  CONSUMER WAS CONCERNED BECAUSE FORD HAS REFUSED TO FIX THE PROBLEM UNTIL WARRANTY EXPIRED.  THE LAST TIME NORRIS FORD WORKED ON IT, AFTER WARRANTY EXPIRED, THEY SAID IT NEEDED 8 NEW INJECTIONS ,AND WOULD COST $2500.  CONSUMER 'S VEHICLE CRASHED INTO A DITCH BECAUSE OF THIS PROBLEM.  AFTER THE VEHICLE STALLED THIS LAST TIME,HE HAD TO HAVE IT TOWED.  THE VEHICLE CURRENTLY WON'T START, AND HASN'T STARTED SINCE THE PROBLEM OCCURRED.  THE PROBLEM STARTED WITHIN THE LAST 5,000 MILES.*AK",
        "vin": "1FTWW33P63E"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/22/2005",
        "dateOfIncident": "04/12/2005",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10119078,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PULLING OUT OF A PARKING SPACE THE CONSUMER HEARD A LOUD POPPING NOISE AND THEN LOST STEERING CONTROL. THE CONSUMER INSPECTED THE VEHICLE AND FOUND THE COUPLING THAT HELD THE TIE RODS HAD BROKEN. THE VEHICLE WAS TOWED TO THE REPAIR SHOP.  *JB",
        "vin": "1FDWF36P23E"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/10/2005",
        "dateOfIncident": "12/31/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114870,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE ACCELERATE PEDAL WAS DEPRESSED VEHICLE HESITATED BEFORE ACCELERATING.  IT WILL JERK INTO GEAR. DEALERSHIP INDICATED THE  ENGINE WANTED TO STALL WITH ACCELERATION WHEN RUNNING.  REPAIRS, PCM REPROGRAMMING. *AK",
        "vin": "1FTWW33T63E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/31/2005",
        "dateOfIncident": "11/21/2004",
        "fire": true,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109228,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE WAS PARKED.  CONSUMER PLUGGED THE FRONT VEHICLE HEATER IN AND WENT INTO THE HOUSE.  LATER, THE DOG STARTED TO BARK. CONSUMER LOOKED OUT, AND THE VEHICLE WAS ON FIRE.  VEHICLE WAS TOTALED.*AK",
        "vin": "1FTSW31F51E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/28/2005",
        "dateOfIncident": "10/21/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108191,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F-350 6.0L DIESEL. VEHICLE RAN ROUGH LOST POWER. 3 INJECTORS BAD THE FIRST TIME, 2 BAD INJECTORS TWO OTHER TIMES BEFORE ENGINE BLEW AT 41000 MILES. HAS HAD NUMERUS INJECTORS CHANGED, AND MANY OTHER EQUIPMENT FAILURES. WAS AT THE DEALER SHIP FOR OVER 5 WEEKS GETTING ENGINE REPLACED. WE JUST PREVIUSLY HAD THE TRUCK AT A DEALERSHIP FOR OVER 15 DAYS AND THEY COULD NOT DIAGNOS THE PROBLEM WE WERE HAVING OF LOSS OF POWER.*AK",
        "vin": "1FTWW32PX3E"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING,FUEL SYSTEM, DIESEL,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2004",
        "dateOfIncident": "12/20/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104678,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TOOK TRUCK IN TO GET COMPUTER UPDATES (132000 MI). DEALER DISCOVERED 12 QUARTS OF FUEL IN CRANKCASE. HAD TO GET INJECTOR SEALS REPLACED ($1200). I KNOW OF AT LEAST 4 OTHER OWNERS OF THIS MODEL TO HAVE THIS PROBLEM. IN AUGUST 2004 HAD TO HAVE FRONT END REBUILT EVEN THOUGH I HAD DONE REQUIRED MAINTENANCE ($450)VEHICLE LOST POWER (12/20/04)(182000 MI). STOPPED TO CHECK FOR PROBLEM. ENGINE RESTARTED. I SHUT IT OFF AND TRIED TO RESTART. IT WOULD TURN OVER BUT NOT START. HAD TOWED TO DEALER. THEY HAD 20 DIFFERENT CODES COME UP ON COMPUTER DIAGNOSTIC. AS OF 12/28/04 IT STILL WILL NOT START AND DEALER STILL HAS NO IDEA WHY. MOST RECENT ESTIMATE FOR THIS REPAIR AT LEAST $1200 AN HAVE NOT BEEN ABLE TO WORK SINCE BREAKDOWN.  *JB",
        "vin": "1FTWW32P63E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/23/2004",
        "dateOfIncident": "12/19/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104411,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY 2003 F-350 SRW 6.0L PSD FOR ABOUT 15 MINUTES AFTER STARTING WHEN I STALLED WITHOUT WARNING. I WAS TRAVELING ON THE HIGHWAY AROUND 45MPH WHEN THE TRUCK JUST SHUT OFF AND DUE TO NO POWER STEERING I WAS UNABLE TO PULL OF TO THE SIDE OF THE ROAD. ALSO THE TEMP AT THE TIME WAS AROUND 20 DEGREES F. AFTER MANY ATTEMPS TO RESTART THE ENGINE I WAS HELPED TO PUSH THE VEHICLE OFF TO THE SIDE OF THE ROAD WHERE IT SAT FOR ABOUT 45 MINUTES AND AFTER A FINAL ATTEMPT IT STARTED AS NORMAL AND HAS BEEN RUNNING FINE SINCE. I TOOK IT TO THE DEALER THE NEXT DAY AND THEY SAID THERE WAS NO PROBLEM WITH THE TRUCK.  I AM NOW AFRAID TO DRIVE THINKING THAT IT MAY STALL AGAIN IN HEAVY TRAFFIC AND CAUSE A CRASH.*AK",
        "vin": "1FTSW31P93E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/20/2004",
        "dateOfIncident": "11/22/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104145,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL TIRE",
                "productModel": "29575R225",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "SECOND OCCURRENCE OF THREAD SEPARATION WITH GENERAL TIRES.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/26/2004",
        "dateOfIncident": "02/24/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096407,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 F350 SUPER DUTY 6.0 DIESEL   REPEATED INSTANCES OF FAILURE TO ACCELLERATE  CONDITION IS INTERMITTENT AND OCCURS WITHOUT WARNING.  WE'VE MADE SEVERAL ATTEMPTS TO REPAIR THE CONDITION WITH THE DEALER STARTING IN 2/04 AND CONTINUING TO PRESENT.*AK",
        "vin": "1FTSW31P63E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/23/2004",
        "dateOfIncident": "08/26/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10093089,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL TIRE",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "FRONT PASSENGER SIDE TREAD SEPARATION GENERAL TYRE OEM ON FORD F350.  *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "09/21/2004",
        "dateOfIncident": "08/18/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10092934,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN TOUCHING THE ACCELERATOR VEHICLE CONTINUED TO ACCELERATE.    THE DEALER  INSPECTED THE VEHICLE,  AND   A BUY BACK WAS OFFERED.   COMPLAINT ALLEGED THAT PROBLEM  DESCRIBED WAS RESPONSIBLE FOR A ROLLOVER  CRASH THAT OCCURRED ON AN ICY ROAD SURFACE ON DECEMBER 26, 2003.  THERE WERE NO INJURIES, PROPERTY DAMAGE TO THE VEHICLE OCCURRED. *AK",
        "vin": "1FTSA31P03E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "09/08/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10090950,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR ACCIDENT, MY TRUCK'S BACK END STARTED TO SKID, I SIDE SWIPED THE JERSEY BARRIERS AND WENT BACK ACROSS THE HIGHWAY AND WENT THROUGH THE GUARD RAILS. THE TRUCK WENT DOWN THE RAVINE AND FLIPPED OVER END OVER END LANDING ON ITS ROOF.",
        "vin": "1FTSF31F33E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/09/2004",
        "dateOfIncident": "09/09/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091654,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR BRAKES DID NOT APPLY SUFFICIENTLY.  MANUFACTURER STATED THAT VEHICLE WAS OVERLOADED, AND REFUSED TO SEND A REPRESENTATIVE TO EXAMINE IT.   CONSUMER  LOADED THE VEHICLE TO TEST IT HIMSELF, AND   VEHICLE WAS DEFECTIVE.*AK  THE VEHICLE DOES NOT STOP LIKE IT SHOULD.  FRONT ROTORS WARPED.  *TC",
        "vin": "1FDWF37S23E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "06/17/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086812,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "7344 MILES, THERE IS A CLANK SOUND FROM THE REAR OF THE PICKUP. IT HAPPENS ON OCCASION STILL. FREEDOM FORD WAS UNABLE TO DETECTN A PROBLEM, BUT IT STILL HAPPENS A FEW TIMES A MONTH JUST AFTER STARTING.*AK",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086813,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VERY ROUGH IDLE.  *AK",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "05/26/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086814,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EXCESSIVE BLACK SMOKE AND LACK OF POWER ON ACCELERATION. FUEL ECONOMY IS WAY DOWN. I TOOK THE PICKUP TO SIERRA FORD IN BISHOP CA. THEY KEPT THE PICKUP FOR  TWO DAYS AND DID NOT HAVE THE PARTS TO FIX THE PICKUP, IN FACT THEY HAD TO TAKE PARTS OFF A DIFFERENT PICKUP AND PUT THEM ON MINE FOR ME TO GET HOME TO FRESNO CA.I TOOK THE PICKUP TO FREEDOM FORD TO BE FIXED WHEN I GOT HOME . BOTH DEALERS SAID THE TURBO WAS BAD.*AK",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "07/30/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086816,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PICKUP HAS LOSS OF POWER AND SURGING MOSTLY WHEN WARM. THE FIRST TRIP TO FREEDOM FORD THEY REPLACED THE EGR VALVE. THE SECOND TRIP TO FREEDOM FORD THEY SAID THEY COULD ONLY FIND NORMAL SURGING THE THIRD TIME TO FREEDOM FOR THE SAME PROBLEM THEY KEPT THE PICKUP FOR 7 DAYS AND REPLACED THE TURBO AGAIN AND THE EGR AGAIN.*AK",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "08/11/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086818,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRIM IS FALLING OFF THE PICKUP. I TOOK THE PICKUP TO FREEDOM FORD FOR REPAIR THEY ORDERED THE PART, THEY KEPT MY PICKUP ONE FULL DAY THN CALLED AND TOLD ME THE PAINT DID NOT MATCH SO I HAVE TO SCHEDULE ANOTHER TRIP AND ANOTHER DAY AT THE DEALER.*AK",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "08/13/2004",
        "dateOfIncident": "08/11/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086819,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEAT BLANKET LINER ATTACHED TO THE UNDERSIDE OF THE HOOD IS BEING RUBBED BY A BOLT THAT STICKS FROM THE ENGINE COMPARTMENT, CAUSING A HOLE TO BE RUBBED INTO THE BLANKET, MAKING PIECES OF THE BLANKET SHREAD INTO THE ENGINE COMPARTMENT.*AK",
        "vin": "1FTSW31P33E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/12/2004",
        "dateOfIncident": "06/22/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080833,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TRANSMISSION FAILURE, NO EVENTS LEADING UP TO THE FAILURE. BACKED TRUCK UP AND THEN WENT TO PULL FORWARD TRUCK WOULD NOT MOVE.  REPLACED OIL PUMP, GEARS, FILTER & GASKET. 28,330 MILES ON TRUCK.  *LA",
        "vin": "1FTSW31F23E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/08/2004",
        "dateOfIncident": "07/07/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080578,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY FORD F350 IN JULY, 2003 FROM LEO KAYTES IN WARWICK, NEW YORK AND HAVE HAD 4 FUEL INJECTORS GO BAD SINCE THEN. I HAVE A $35,000 TRUCK LOAN AND HAVE ONLY PAID 10 MONTHS ON THIS TRUCK.   I AM A SOLE PROPRIETOR AND HAVE A FAMILY TO SUPPORT.  EACH TIME MY TRUCK GOES INTO THE DEALERSHIP, I LOSE ACCOUNTS AS WELL AS THOUSANDS OF DOLLARS.  ON 7/4/04 AND 7/7/04, A FORD CUSTOMER SERVICE REPRESENTATIVE AND THE GENERAL MANAGER AT LEO KAYTES FORD DEALER IN WARWICK, NY HAVE ACKNOWLEDGED THAT FORD IS HAVING AN ONGOING PROBLEM WITH THEIR FUEL INJECTORS IN THE 6.0 LITER ENGINE.  AFTER MANY HOURS OF RESEARCH, I HAVE LEARNED THAT THERE WAS A FIRST MASSIVE RECALL IN APRIL, 2003 FOR 66,720 TRUCKS FORD SOLD WITH THE 6.0 LITER DIESEL ENGINE TO REPLACE THE FUEL INJECTION CONTROL PRESSURE SENSOR.  I\u0019VE ALSO LEARNED THERE WERE NEARLY 500 BUYBACKS OF TRUCKS WITH ENGINES SO BADLY FLAWED THAT THEY COULDN\u0019T BE FIXED.  APPARENTLY, A BATCH OF FAULTY FUEL INJECTORS LEAKED SO MUCH DIESEL FUEL THAT FUEL FILLED THE CRANKCASE, CAUSING ENGINES TO SEIZE.    THERE WERE ALSO GLITCHES WITH THE TURBOCHARGER AND ENGINE CONTROL SOFTWARE.  LEO KAYTES REPRESENTATIVES HAVE STATED THAT THE BEST APPROACH IS TO REPLACE ALL THE FUEL INJECTORS BUT ALSO TOLD ME THAT FORD MOTOR CORPORATION WILL NOT HONOR SAME UNDER THE WARRANTY.  MY RESEARCH HAS ALSO REVEALED THAT MANY DEALERSHIPS HAVE REPLACED THE ENGINES FOR CUSTOMERS AND THAT FORD HAS BOUGHT BACK TRUCKS.  MY CHIEF CONCERNS ARE WHO WILL BEAR THE FINANCIAL LIABILITY FOR FUTURE FAULTY INJECTORS ONCE THE WARRANTY HAS EXPIRED,  AND THE POSSIBILITY THAT MY ENGINE COULD CEASE IF CAREFUL AND COMPLETE REPAIRS TO THIS ENGINE HAVE NOT BEEN MADE AS OF THIS WRITING.  TO DATE, THE DEALERSHIP CONTINUES TO MAKE REPAIRS AS A BAND-AID FIX AND ARE NOT FINDING THE SOURCE OF WHAT IS CAUSING THESE INJECTORS TO GO BAD.  AS A RESULT, I ANTICIPATE FUTURE FAILURES.*AK",
        "vin": "1FTWX33P33E"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "07/08/2004",
        "dateOfIncident": "06/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080589,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING MY FORD F-350 AND MAKING A TURN.  WHEN I WENT TO STRAIGHTEN THE TRUCK OUT, I HAD NO STEERING AND WENT INTO A DITCH AND KNOCKED 2 EVERGREEN TREES DOWN AND RESTED AGAINST A UTILITY POLE.  TOO MUCH DAMAGED WAS DONE DURING THE ACCIDENT TO FIND OUT THE CAUSE OF THE ACCIDENT.    THERE WAS NO STEERING.  THE TRUCK WAS TOTALED OUT.*AK",
        "vin": "1FTSF31L43E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/06/2004",
        "dateOfIncident": "01/12/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060587,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "JANUARY, 2004, THE FIRST \"REAL\" LOAD IN MY NEW 2003 FORD F-350 \"SUPER DUTY\" TRUCK, WAS MY HARLEY-DAVIDSON FLHR.  IT LOADED WITH NO APPARENT PROBLEMS.   ON OFF-LOADING OF THE MOTORCYCLE, AS THE REAR TIRE ROLLED ONTO THE LEADING EDGE (LOWER EDGE) OF THE TAILGATE, THE TAILGATE CRUSHED. I SPOKE WITH THE PURCHASING DEALERS SERVICE MANAGER WHO AGREED THAT THE PROBLEM WAS UNUSUAL AND PROBABLY SHOULDN'T HAVE HAPPENED.  HOWEVER, HE WOULD NOT WARRANTY THE TAILGATE.  I WAS REFERRED TO THE FORD FACTORY SERVICE \"REP.\"  HE AGREED THAT HE DIDN'T THINK THE TAILGATE SHOULD HAVE FAILED, BUT HAD NO BASIS FOR WARRANTY.  THE TWO SERVICE MANAGERS REFERRED ME TO THE FORD CUSTOMER ASSISTANCE CENTER.  I CALLED THE CUSTOMER ASSISTANCE CENTER TWICE, HOPING TO GAIN ADDITIONAL  INFORMATION.  I WAS TOLD THAT FORD HAS TAILGATE SPECS AVAILABLE TO THE DEALERS THROUGH THE \"FORD TECH HOTLINE.\"  I CONTACTED THE DEALERS GENERAL MGR.  HE \"LOOKED INTO IT\" AND SAID THAT FORD DOESN'T OFFER SPECS OR CAPYS FOR TAILGATES. THEREFORE, HE WOULD NOT WARRANTY IT.  I FILED A COMPLAINT WITH THE FORD DISPUTE SETTLEMENT BOARD (DSB) PER MY OWNERS GUIDE.  THE COMPLAINT WAS VERY DETAILED.  I ASKED THAT THEY DETERMINE IF FORD OFFERED SPECS AND CAPYS ON THEIR TAILGATES - IF SO, AN OBJECTIVE DETERMINATION COULD BE MADE AS TO WHETHER OR NOT I MET OR EXCEEDED THOSE SPECIFICATIONS.  IF I DID, THE FAILURE WOULD BE ON ME; IF NOT, THE FAILURE SHOULD BE COVERED UNDER WARRANTY.  THE DSB RESPONDED: ...WE REGRET TO ADVISE YOU THAT THE CONCERN STATED IN YOUR APPLICATION DOES NOT FALL WITHIN THE JURISDICTION OF THE BOARD....IF THE PROBLEM STILL REMAINS, YOU MAY CONTACT THE FORD CUSTOMER ASSISTANCE CENTER AT 1-800------ FOR FURTHER ASSISTANCE.  I HAVE COME FULL CIRCLE.  TO DATE, NO ONE AT FORD MOTOR COMPANY IS WILLING TO DISCUSS THIS TAILGATE FAILURE IN OBJECTIVE, MEASURABLE TERMS.  APPARENTLY, THERE IS NO AVENUE TO PURSUE OUTSIDE OF THIS LOOP OF DEALERSHIP TO FORD ASSISTANCE CENTER AND BACK TO THE DEALERSHIP. *JB",
        "vin": "1FTWW33S13E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "02/18/2004",
        "dateOfIncident": "02/18/2004",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059245,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "FIRESTONE STEEL PROD. CO.",
                "productMake": "FIRESTONE",
                "productModel": "FIRESTONE",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING  AT 70 MPH AND WITH NO WARNING  RIGHT FRONT RIGHT TIRE TREAD SEPARATED, CAUSING THE TIRE TO BLOWOUT. CONSUMER HAD TO PULL OVER. ALSO,  TWO REAR TIRES BLEW OUT,  FIRESTONE, P205/70R14.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "05/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069320,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM IS CALLED DEAD PEDAL. WHEN YOU STEP ON THE GAS PEDAL YOU GET NO RESPONSE AT ALL UNTIL YOU LET OFF THEN THE TRUCK LUNGES FORWARD USUALLY LEAVING HALFWAY IN A INTERSECTION. HAPPENED  ON 6-26-03 AGAIN, LEAVING ME IN INTERSECTION WITH SEMI APPROACHING AND VEHICLE PULLED UP BEHIND ME, FORTUNATELY THE SEMI HAD ROOM TO STOP. DEALER HAS TRIED TO FIX THIS BUT HAS NO IDEA WHATS CAUSING THIS. AFTER LOOKING INTO THIS ON FORDTRUCKS.COM/FORUMS I FOUND I'M NOT THE ONLY ONE WITH THIS PROBLEM.",
        "vin": "1FTSW31P73E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "10/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10069517,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE FAILURE/INJECTORS- 5/19/03,6/16/03,8/14/03,10/4/03 WE PURCHASED THIS TRUCK 4/17/03",
        "vin": "1FTWW33P13E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "10/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10070997,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "6.0 LITRE DIESEL  ROUGH IDLE, DEAD ACCELERATOR AT TIMES, LOW POWER, EXCESSIVE SMOKE, POOR FUEL MILAGE 8 TO 12 MILES PER GALLON. HAVE 30,000 MILES ON VEHICLE, POOR ENGINE RESPONSE WHEN COLD, ENGINE WARNING LIGHT COMES ON, HAS BEEN TO SELLING DEALER FOUR TIMES FOR REPAIRS, RE-FLASH OF COMPUTER FOR UPDATED INFO FROM FORD BUT PROBLEMS TILL PRESENT! DEALER HAS HAD VEHICLE FOR THE PAST FOUR DAYS ,SAID ITS FIXED! PICKED UP LAST NITE, ALMOST DID NOT MAKE IT HOME! THEY NOW HAVE BACK TO LOOK AT..HAVE BEEN AROUND DIESELS FOR THE PAST THIRTY YEARS; THIS ONE IS A DUD!! MOST ALL PROBLEMS STILL PRESENT, NOW FUEL ODOR IN CRANKCASE, DEALER DID REPLACE I.P.C. SENSOR AND DOWNLOADED LATEST CALIBRATIONS TO NO HELP!",
        "vin": "1FTWW33P13E"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/15/2004",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071177,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRUCK WILL NOT DRIVE STRAIGHT.  THE TRUCK WANDERS ON THE ROAD. THERE IS APPROXIMATLEY 2 INCHES OF &#34;PLAY&#34; IN THE STEERING.  FORD CALLS THIS NORMAL AND CONSISTANT WITH OTHER &#34;LIKE&#34; VEHICLES. IT HAS BEEN TO THE DEALER AT LEAST 3 TIMES, MAYBE 4. I'VE LOST COUNT.  THE FACTORY &#34;REP&#34; SUPPOSEDLY HAS DRIVEN THE VEHICLE AND SAID IT'S NORMAL.  I'VE HAD THE MOTOR PROBLEMS LIKE THE CONCERNS I'VE READ ON THE INTERNET, BUT THE DEALER HAS CORRECTED THOSE. THIS VEHICLE DOES &#34;HAUL THE MAIL&#34;, BUT I PURCHASED IT TO PULL MY TRAVEL TRAILER. BUT, BECAUSE I CAN'T &#34;SAFELY&#34; KEEP IT BETWEEN THE LINES, WITH OR WITHOUT THE TRAILER, I DON'T FEEL SAFE HAVING MY FAMILY IN THE VEHICLE.",
        "vin": "1FTSW31P43E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/22/2003",
        "dateOfIncident": "12/22/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051945,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED VEHICLE  CUT OFF 3-4 TIMES WHILE DRIVING ON THE HIGHWAY.  EACH TIME HE TOOK VEHICLE TO THE DEALER/MECHANIC  THEY REPLACED A PART OR DID SOME ADJUSTMENTS, AND CLAIMED  IT WAS REPAIRED,  BUT THE PROBLEM RECURRED. *AK",
        "vin": "1FTWW32P93E"
    },
    {
        "components": "FUEL SYSTEM, DIESEL,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/06/2003",
        "dateOfIncident": "11/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049321,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F350 SUPERDUTY 6.0 POWERSTROKE. I PURCHASED IT NEW ON NOVEMBER 28, 2003. TWELVE HOURS AND 68 MILES LATER THE TRANSMISSION LOCKED UP AT 45 MILES AN HOUR. I HAD IT TOWED TO THE DEALER AND THEY YET TO FIX PROBLEM. I WOULD LIKE ANOTHER NEW TRUCK. THE DEALER WILL NOT GIVE ME ONE. I CAN'T BELIEVE THE RUN-A-ROUND THE DEALER IS GIVING ME. THEY DON'T CARE THAT THE TRUCK WAS JUST PURCHASED. THEY ARE TAKING THERE SWEET TIME OF FIXING THE TRUCK. THERE WERE ALSO OTHER PROBLEMS WITH THE INJECTORS, PCM, AND TCM. WITH ALL THESE FACTORS AND BEING 12 HOURS OLD AND ONLY 68 MILES, YOU WOULD THINK OUT OF COURTESY FORD OR THE DEALER WOULD GIVE ME A IDENTICAL NEW TRUCK. IT'S SO FRUSTRATING IT TOOK THE WHOLE ENJOYMENT OF OWNING A NEW TRUCK.   *LA",
        "vin": "1FTSX31P43E"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/17/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044216,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "AMERICAN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ALL SIX TIRES ARE BUBBLING  AT SIDEWALL.  DEALER REPLACED FOUR TIRES, BUT THOSE  REPLACED TIRES ARE STARTING TO BUBBLE ALSO.  *AK",
        "vin": "1FTWW32P83E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/13/2003",
        "dateOfIncident": "10/12/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041682,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 F350 6.0L DIESEL - SUDDEN LOSS OF POWER.DISPLAY LIGHTS COME ON BUT WON'T START, DOES NOT CRANK OVER AT ALL. HAS HAPPENED THREE TIMES. ONLY HAVE 5124 MILES ON IT. FIRST BREAKDOWN HAPPENED AT 900 MILES, SITTING STILL. 2ND BREAKDOWN HAPPENED AT LOW SPEED. THIRD BREAKDOWN HAPPENED TODAY 10/12/03 AT 75 MPH. STUCK IN HIGH SPEED TRAFFIC WITH FAMILY WAITING FOR TOW.GIVEN DIFFERENT REASON AT EACH REPAIR BY DIFFERENT DEALERSHIPS. EACH DEALERSHIP SAID FORD IS AWARE OF THE PROBLEM BUT CAN'T FIND A FIX.THIS IS THE FIRST YEAR THAT THESE 6.0 LITER ENGINES CAME OUT. MULTIPLE COMPLAINTS FOR SAME PROBLEM LISTED ON \"THEDIESELSTOP.COM\" WEB SITE. MANY PEOPLE ARE STUCK WITH THESE UNSAFE VEHICLES.  FORD IS AWARE OF THIS PROBLEM BUT HAS NOT RECALLED THESE TRUCKS, MAYBE YOU CAN FORCE THEM TO DO SOMETHING.  *LA",
        "vin": "1FTSW31P53E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/26/2003",
        "dateOfIncident": "04/05/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039618,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 6.0L FORD DIESEL WILL NOT ACCELERATE PROPERLY AND IS A DANGER TO MY AND MY FAMILY.  BY FAR I AM NOT ALONE AND YOU CAN GET MORE INFORMATION BY LOGGING ON TO THEDIESELSTOP.COM AND LOOK IN THE 6.0L FORUM.",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/01/2003",
        "dateOfIncident": "08/27/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037001,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 F-350 SUPER DUTY 5.4, WITH 3,500 MILES HAS AN ENGINE KNOCK ON COLD START-UP.THE DEALER HAD THE TRUCK FOR A WEEK, AND SAID THIS IS NORMAL.I TOOK AN OIL SAMPLE, AND HAD IT TESTED, AND WAS TOLD THE SAMPLE HAD TO COME FROM A HIGH MILEAGE MOTOR,THE SAMPLE SHOWS TRACES OF BEARING MATERIAL.THE DEALER SAYS THIS IS NORMAL FOR \"BREAK-IN\" OIL.I THINK THERE IS MORE WRONG, AND DON'T WANT TO RUIN IT.THIS IS A $30,000 TRUCK, AND I CAN'T SEE TEARING IT UP.*AK",
        "vin": "1FTSF31L33E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/24/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033388,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DANGERIOUS WHEN PULLING OUT IN TRAFFIC! FLAT SPOT IN LAUNCH!*AK",
        "vin": "1FTSW31P43E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "08/24/2003",
        "dateOfIncident": "08/23/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10033390,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LOSS OF POWER WHILE ATTEMPTING TO ACCELERATE.TOOK IT TO FORD DEALER AND WAS TOLD THAT THERE WAS NO FIX, THAT I SHOULD PULL OVER AND TURN OFF THE IGNITION AND RESET THE COMPUTER TO CORRECT THE PROBLEM.*AK     THIS COULD RESULT IN A SERIUOS (HEAD-ON) COLLISION IF IT OCCUR WHILE PASSING ON A TWO LANE ROAD.",
        "vin": "1FTWW33P83E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032339,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE STALLED WHILE DRIVING AND IT TOOK OFF REALLY FAST FROM A COMPLETE STOP.  THE VEHICLE WAS TAKEN TO THE DEALER ON 8/5/2003.  THE DEALER DID NOT IDENTIFY THE PROBLEM TO THE CONSUMER.  WHEN PICKING UP THE VEHICLE FROM THE DEALER THE VEHICLE STILL HAD THE SAME PROBLEM.  THE DEALER TOLD THE CONSUMER TO DRIVE IT FOR A COUPLE OF DAYS AND BRING IT BACK IF IT DOESN'T GET BETTER.  PLEASE PROVIDE DETAILS.     *PH",
        "vin": "1FTWW33P83E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/10/2003",
        "dateOfIncident": "06/05/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026936,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE STARTED TO SHUT OFF WHILE DRIVING DOWN THE ROAD. THE VEHICLE WAS TAKEN TO THE DEALER ON FOUR OCCASIONS, AND EACH TIME THEY SAID THE PROBLEM WAS FIXED. THE VEHICLE WAS STILL AT THE DEALER AND NOT RUNNING.  *MR  *TS   *JB",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/27/2003",
        "dateOfIncident": "06/26/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023867,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEAD PEDAL.  WHEN YOU STEP ON GAS PEDAL YOU GET NO RESPONSE UNTIL YOU LET OFF, THEN THE VEHICLE LUNGES FORWARD,USUALLY LEAVING YOU IN MIDDLE OF INTERSECTION.  *JB-",
        "vin": "1FTSW31P73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/26/2003",
        "dateOfIncident": "06/22/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023816,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NEW F350 DIELEL 6.0, CONTUNIAL INJECTOR PROBLEMS, RUNS ROUGH AND QUITS, TOWED 2X'S, SUCKING DIELES INTO OIL.*AK",
        "vin": "1FTSW31P93E"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/22/2003",
        "dateOfIncident": "06/06/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023530,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING BOX, OIL LEAK, BRAKE MASTER CYLINDER LEAK.   *NLM",
        "vin": "1FTWW33P33E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/21/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020294,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE PULLED TO THE LEFT AND RIGHT WHEN THE BRAKES WERE APPLIED.  THE VEHICLE HAS BEEN TAKEN TO THE DEALER FOR REPAIRS.  *NLM",
        "vin": "1FTWW33F93E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/06/2003",
        "dateOfIncident": "02/28/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017122,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SHIFT ON THE FLY 4WD SYSTEM DOES NOT ENGAGE PROPERLY ON THE TRUCK.  WHEN SELECTING 4WD AND TRAVELING UNDER THE OWNERS MANUAL REQUIRED SPEED THE VEHICLE TAKES OVER 2.5 MILES TO ENGAGE OR NOT AT ALL.  THE TRUCK HAS BEEN TO THE DEALER 2 TIMES WITH NO PROBLEMS FOUND.  I VIDEO TAPED THE INCIDENT AT THE END OF FEBRUARY AND NO I CANNOT GET THE DEALER TO CALL ME BACK AT ALL.  IF THE SWITCH IS LEFT ON AND THE UNIT DOES NOT ENGAGE I AM AFRAID I WILL EXCEED THE MAX RECOMMENDED SPEED THEN THE UNIT WILL ATTEMPT ENGAGEMENT AND DAMAGE THE 4WD.   *NLM",
        "vin": "1FTSX31F63E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/23/2003",
        "dateOfIncident": "04/01/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016427,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 FORD F-350 6.0 LITER ENGINE  DIESEL RUNAWAY AFTER OWNING 13 DAYS. VEHICLE HAS BEEN OUT OF SERVICE AND AT DEALERS FOR OVER THREE WEEKS. *JB",
        "vin": "1FTWW33P13E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/17/2003",
        "dateOfIncident": "04/17/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10016120,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES INTERMITTENTLY LOOSE THE BRAKE. NO POWER STEERING. DEALER NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION.",
        "vin": "1FTWW33P13E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/12/2003",
        "dateOfIncident": "03/25/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10014310,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE LOST POWER (AND NEVER RETURNED) WHILE PASSING ANOTHER VEHICLE ON THE HIGHWAY.  CHECK ENGINE LIGHT CAME ON AFTER 20 MILES OF DRIVING UNDER THE LOST POWER CONDITION.  TOOK THE TRUCK TO THE DEALER AND THEY REPLACED THE EGR VALVE.  THIS HAPPENED AT ONLY 3500 MILES.  I WISH FORD WOULD TEST THEIR VEHICLES INSTEAD OF HAVING THE CONSUMER TEST THEM FOR THEM ON THE HIGHWAYS.   *NLM",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/31/2003",
        "dateOfIncident": "03/24/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013704,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A BRAND NEW 6.0 POWERSTROKE SUPERCHARGER BLOW UP ON ME AND IT ONLY HAD 244 MILES ON IT. SO THE DEALERSHIP GAVE ME A NEW TRUCK. THEN THE NEW TRUCK HAD THE SAME PROBLEM AT 8,000 MILES AND IT WAS THE SUPERCHARGER TO BUT IT ALSO BURNT AN INJECTOR OUT AND TOLD ME I NEEDED A NEW ENGINE AND FORD WAS NOT GOING TO COVER IT UNDER WARRANTY BECAUSE  IT HAD AN AFTER MARKET PART ON IT, EVEN THOUGH I HAD THE SAME PROBLEM IN THE FIRST TRUCK ,BUT FIRST TRUCK DID NOT HAVE THE AFTERMARKET PART ON IT . SO I SHOULD NOT BE LIABLE FOR IT.  *NLM",
        "vin": "1FTWW32P73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/19/2003",
        "dateOfIncident": "03/17/2003",
        "fire": false,
        "manufacturer": "Ford Motor Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010723,
        "products": [
            {
                "manufacturer": "Ford Motor Company",
                "productMake": "FORD",
                "productModel": "F-350 SD",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FORD F350 CREW CAB WITH 6.0-LITER DIESEL ENGINE.  THE TURBO RANDOMLY SHUTS DOWN AND THE VEHICLE WILL NOT ACCELERATE OVER 45 - 50 MPH.  THE ONLY TEMPORARY FIX IS TO TURN THE ENGINE OFF AND RESTART THE VEHICLE.  MY SPOUSE WAS NEARLY REAR ENDED BY A HAY TRUCK WHILE TRYING TO GET ONTO THE HIGHWAY.  THE VEHICLE HAS HAD THREE COMPUTER PROGRAM UPDATES - NONE OF WHICH HAS FIXED THE PROBLEM.  FORD HAS NOW TOLD THE FLEET SERVICE DEPARTMENT THEY ARE AWARE OF THE PROBLEM BUT DO NOT KNOW HOW TO FIX IT.  FORD DOES NOT HAVE AN \"UPDATE\" TO FIX THIS PROBLEM AND TOLD THE SERVICE DEPARTMENT TO RETURN THE VEHICLE TO US TO DRIVE UNTIL THEY COME UP WITH A SOLUTION.  *NLM",
        "vin": "1FTSW31P83E"
    }
]