[
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "03/31/2021",
        "dateOfIncident": "06/19/2019",
        "fire": true,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11405848,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 N/A FREIGHTLINER SPRINTER VAN.  THE CONTACT STATED THAT WHILE DRIVING AT 65 MPH, THE VEHICLE BEGAN TO LOSE SPEED,  THAN THE VEHICLE BEGAN TO SHUTTER AND THE CONTACT LOOKED THRU THE REAR PASSENGER SIDE VIEW MIRROR AND NOTICED BLACK SMOKE COMING FROM EXHAUST. THE CONTACT MERGED TO THE SIDE OF THE ROAD. THE CONTACT PUT THE VEHICLE IN PARK AND EXITED OUT OF THE VEHICLE. THE CONTACT WENT TO THE FRONT OF THE VEHICLE WHEN IT WAS NOTICED FLUID WAS SPILLING OUT OF THE VEHICLE AND SMOKE COMING FROM UNDERNEATH THE HOOD. THE CONTACT WENT TO RECEIVE THEIR FIRE EXTINGUISHERS AND OPENED THE HOOD AND NOTICED FIRE COMING FROM UNDERNEATH THE AND STARTED TO EXTINGUISH THE FIRE BUT DID NOT FULLY PUT OUT THE FLAMES.  THE CONTACT THEN HAD HIS WIFE AND FOUR CHILDREN EXIT OUT OF THE VEHICLE AND WAITED FOR THE FIRE DEPARTMENT TO COME TO THE SCENE. THE FIRE DEPARTMENT DID COME OUT AND EXTINGUISHED THE FIRE FULLY. A FIRE REPORT WAS FILED. NO ONE WAS INJURED. THE VEHICLE WAS TOWED TO A NEAR BY TOWED LOT.THE CONTACT CALLED THE VEHICLE MANUFACTURER TO HAVE THEM TOW THE VEHICLE TO THEIR LOCAL DEALER TO HAVE INSPECTED AND DIAGNOSED OF THE FAILURE BUT THE MANUFACTURER DECLINED DO THAT SO THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE CONTACT DOES  NOT KNOW IF THE VEHICLE DEEMED A TOTAL LOSS OR IF THE THAT TOWED LOT SCRAPPED THE VEHICLE FOR PARTS. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 93,000.      ## VIN PASSED ## SPRINTER (DODGE OR FREIGHTLINER) 2003 ##",
        "vin": "WD2YD742735"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/04/2020",
        "dateOfIncident": "07/21/2020",
        "fire": false,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11353145,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FREIGHTLINER SPRINTER 2500. THE CONTACT STATED WHILE DRIVING 14 MPH AND DEPRESSING THE ACCELERATOR PEDAL, THE VEHICLE FAILED TO RESPOND. THE CONTACT STATED THAT THE MASTER WARNING LIGHT WAS ILLUMINATED. THE CONTACT PARKED ON THE SIDE OF THE ROADWAY. THE VEHICLE WAS  THEN SLOWLY DRIVEN BACK TO HIS RESIDENCE. THE CONTACT CALLED MERCEDES-BENZ OF LOUISVILLE LOCATED AT 2520 TERRA CROSSING BLVD, LOUISVILLE, KY 40245, (502) 896-4411, AND THE DEALER WAS MADE AWARE OF THE FAILURE. THE CONTACT CALLED AN INDEPENDENT MECHANIC AND MADE AN APPOINTMENT TO HAVE THE VEHICLE REPAIRED. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. UPON INVESTIGATION, THE CONTACT ASSOCIATED THE FAILURE WITH NHTSA CAMPAIGN NUMBER: 16V833000 (ELECTRICAL SYSTEM, SERVICE BRAKES, HYDRAULIC) HOWEVER, THE VIN WAS NOT INCLUDED. THE MANUFACTURER WAS NOT INFORMED OF FAILURE. THE FAILURE MILEAGE WAS 320,000.",
        "vin": "WD2YD141935"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/22/2014",
        "dateOfIncident": "07/07/2014",
        "fire": false,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10615198,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE EXPERIENCED REDUCED POWER AND WHOOSH SOUND.  FOUND INTAKE MANIFOLD WITH CRACKS LEAKING EXHAUST FROM EGR RUNNER.  MADE TEMPORARY REPAIR ON THE ROAD AND WAS ABLE TO RETURN TO SHOP.  FOUND THERE WAS A RECALL ON THIS PART (2010-040002) BUT HAVE BEEN UNABLE TO GET REPAIR FROM DAIMLER VANS USA.  *TR",
        "vin": "WD2YD642035"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "02/07/2013",
        "dateOfIncident": "02/07/2013",
        "fire": false,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10496777,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FREIGHTLINER SPRINTER 2500. THE CONTACT STATED AFTER RECEIVING A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 11V410000 (ENGINE AND ENGINE COOLING), THE CONTACT CALLED THE DEALER. THE DEALER STATED THAT THEY COULD NOT REMEDY THE VEHICLE DUE TO THE DEALER NOT BEING ABLE TO WORK ON VANS. THE CONTACT THEN CALLED THE MANUFACTURER TO FIND OUT WHERE TO TAKE THE VEHICLE. THE NEAREST DEALER WAS TOO FAR TO DRIVE FOR THE CONTACT. THE MANUFACTURER THEN STATED TO CALL FREIGHTLINER REGARDING THE RECALL. FREIGHTLINER INFORMED THE CONTACT THAT THEY WERE NOT RESPONSIBLE FOR THE REPAIR OF THIS VEHICLE. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "WD2YD642335"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/15/2012",
        "dateOfIncident": "06/14/2012",
        "fire": false,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10461911,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 FREIGHTLINER SPRINTER 2500. THE CONTACT STATED AFTER RECEIVING A RECALL NOTICE, HE TOOK THE VEHICLE WAS TAKEN TO A LOCAL DEALER. THE DEALER STATED THE CONTACT HAD TO PAY TO HAVE THE RECALL REPAIR PERFORMED ON THE VEHICLE. THE CONTACT STATED THE RECALL SAID THE REMEDY WAS FREE OF CHARGE. THE CONTACT CALLED THE MANUFACTURER TO VERIFY. THE FAILURE MILEAGE WAS 330,000.   UPDATED 07/05/12*LJ  THE DEALER CONFIRMED THE INTAKE MANIFOLD REPLACEMENT WAS COVERED BY THE RECALL. HOWEVER, THE DEALER STATED THEY WOULD NEED TO REPLACE THE FUEL LINES, WHICH COULD BE DAMAGED DURING THE REMOVAL OF THE INTAKE MANIFOLD. THE CONSUMER WAS INFORMED IT WOULD COST $300 TO REPLACE THE FUEL LINES. UPDATED 07/10/12  UPDATED 07/19/12.",
        "vin": "WD2YD742435"
    },
    {
        "components": "FUEL SYSTEM, DIESEL",
        "crash": false,
        "dateComplaintFiled": "06/15/2010",
        "dateOfIncident": "06/15/2010",
        "fire": false,
        "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10336376,
        "products": [
            {
                "manufacturer": "DAIMLERCHRYSLER MANUFACTURING INTL",
                "productMake": "FREIGHTLINER",
                "productModel": "SPRINTER 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL NOTICE FOR MY VEHICLE.  I CONTACTED THE NUMBER IN THE LETTER TO HAVE THE PROBLEM CORRECTED.  AFTER SPEAKING WITH A REPRESENTATIVE, I WAS INFORMED THAT THE CLOSEST REPAIR CENTER WAS 110 MILES AWAY.  THE SERVICE CENTER WHERE THE WORK WOULD BE PERFORMED IS ONLY OPEN M-F, 7A-5P.  IN ORDER FOR ME TO GET THE AFFECTED VEHICLE FOR REPAIRED, I WOULD HAVE TO TAKE OFF WORK AND LOSE A DAY'S PAY OR LONGER.  THE REPRESENTATIVE OFFERED NO HELP IN OVERCOMING MY DILEMMA. *TR",
        "vin": "WD2YD742535"
    }
]