[
    {
        "components": "STEERING,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "05/17/2019",
        "dateOfIncident": "10/01/2018",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11208186,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 GMC SAVANA. WHILE OPERATING THE VEHICLE, THE STEERING WHEEL AND BRAKE PEDAL MALFUNCTIONED AND DID NOT PROPERLY OPERATE. WHILE DEPRESSING THE BRAKE PEDAL, THE STEERING WHEEL WOULD JERK AND THE BRAKE PEDAL WAS HARD TO DEPRESS, WHICH AFFECTED THE VEHICLE STOPPING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE BRAKE HYDRO PUMP WAS FAULTY. THE PUMP WAS REPLACED, BUT THE FAILURES CONTINUED. THE CONTACT INDICATED THAT THE HYDRO PUMP HAD BEEN REPLACED THREE TIMES WITHIN THE PAST EIGHT MONTHS. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 100,000.",
        "vin": "1GTHG35U331"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/23/2015",
        "dateOfIncident": "10/01/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10785507,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 GMC SAVANA 1500. THE CONTACT STATED THAT THERE WAS A ODOR OF FUEL INSIDE THE VEHICLE. UPON INSPECTION, IT WAS DISCOVERED THAT FUEL WAS LEAKING FROM THE VEHICLE DUE TO CORROSION OF FUEL FILLER NECK. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 110,000. UPDATED 01/27/16*LJ",
        "vin": "1GTEG15XX31"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/05/2015",
        "dateOfIncident": "02/11/2015",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10714738,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GAS TANK LEAKS WHEN FULL. THE SEAM WHERE THE FILLER NECK MEETS THE TANK'S NIPPLE IS CRACKED. GM DOES NOT MANUFACTURE A REPLACEMENT TANK, NO USED TANKS AVAILABLE. I'M FORCED TO DRIVE A VAN THAT LEAKS FUEL IF FULL, OR HITS A BUMP IN THE ROAD. HELP!  *TR",
        "vin": "1GDFG15T231"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/30/2014",
        "dateOfIncident": "03/17/2014",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10575679,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 1500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DEPLOY HIGH IMPACT ACCIDENT 55 TO 65 MPH HIT CONCRETE WALL BOUGHT VAN NEW 2003 SAVANNA 1500.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/28/2013",
        "dateOfIncident": "03/15/2013",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10504823,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 GMC SAVANA. THE CONTACT STATED WHILE DRIVING 30 MPH, THE CHECK ENGINE LIGHT ILLUMINATED. ALSO, THE CONTACT SMELLED FUEL INSIDE THE VEHICLE AND FUEL LEAKED OUT OF THE FUEL TANK WHILE THE VEHICLE WAS PARKED ON A HILL. THE CONTACT RECEIVED A RECALL NOTICE FOR CAMPAIGN NUMBER 06E043000 (FUEL SYSTEM, GASOLINE) AND TOOK THE VEHICLE TO THE DEALER. THE DEALER DID NOT HONOR THE RECALL AND WOULD NOT INSPECT THE VEHICLE. THE CONTACT TOOK THE VEHICLE TO ANOTHER DEALER. THE DEALER STATED THERE WAS NO CORROSION ON THE FUEL FILLER PIPE BUT THE FUEL TANK HAD CORROSION AND NEEDED TO BE REPLACED, MAKING THE VEHICLE UNSAFE TO DRIVE. THE FAILURE MILEAGE WAS 159,000. THE VIN WAS NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/28/2012",
        "dateOfIncident": "06/27/2012",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463398,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 GMC SAVANA. THE CONTACT STATED THAT FUEL LEAKED TO THE GROUND WHILE REFUELING THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO THE DEALER TO HAVE A DIAGNOSTIC PERFORMED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VIN WAS NOT AVAILABLE. THE FAILURE AND THE CURRENT MILEAGE WAS 109,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "03/01/2011",
        "dateOfIncident": "11/09/2010",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386035,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 GMC SAVANNAH 2500. THE CONTACT WAS DRIVING DOWNHILL IN REVERSE WHEN THE BRAKES MALFUNCTIONED AND WOULD NOT ENGAGE, CAUSING THE VEHICLE TO CRASH INTO ANOTHER VEHICLE. A POLICE REPORT WAS AVAILABLE. THE VEHICLE WAS TOWED TO THE DEALER BUT THE DEALER WAS UNABLE TO LOCATE A FAILURE WITHIN THE BRAKES. THE VEHICLE WAS THEN TAKEN TO AN INDEPENDENT MECHANIC YET THE MECHANIC WAS ALSO UNABLE TO DIAGNOSE A BRAKE FAILURE. THE MANUFACTURER WAS CONTACTED BUT PROVIDED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE CONTACT HAD NOT EXPERIENCED ANY FURTHER BRAKE FAILURES SINCE THE CRASH. THE FAILURE MILEAGE WAS 110,000.",
        "vin": "1GJGG25U631"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/15/2010",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10325799,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 GMC SAVANA. THE CONTACT STATED THAT WHEN APPLYING THE BRAKES AT SPEEDS OF AT LEAST 50 MPH, THE ANTI-LOCK BRAKE WOULD ENGAGE, FORCING THE PETAL BACK INTO THE IDLE POSITION AND CAUSING REDUCED BRAKING RESPONSE. THE CONTACT CONFIRMED THAT THE ANTI-LOCK BRAKING LIGHT WOULD ILLUMINATE ON THE INSTRUMENT PANEL MOMENTS BEFORE THE FAILURE WOULD OCCUR. THE FAILURE MILEAGE WAS 37,000 AND THE CURRENT MILEAGE WAS 50,000. THE VIN WAS NOT AVAILABLE. UPDATED 05/19/10. *LJ",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/31/2009",
        "dateOfIncident": "12/20/2009",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10297664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 GMC SAVANA 2500.  WHILE DRIVING 30 MPH HE HAD TO INCREASE HIS STOPPING DISTANCES DURING BRAKE APPLICATION. THE VEHICLE WAS TAKEN TO A SEARS REPAIR FACILITY AND HE WAS ADVISED THAT THE BRAKE MASTER CYLINDER FAILED. A REPRESENTATIVE FROM THE MANUFACTURER STATED THAT HE WAS INELIGIBLE FOR A FREE REMEDY.  THE CURRENT AND FAILURE MILEAGES WERE 117,000.",
        "vin": "1GTGG25V931"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,EQUIPMENT,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/21/2009",
        "dateOfIncident": "03/06/2009",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10262640,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VAN WAS BEING DRIVEN EARLY MORNING FOR ABOUT 30 MINUTES. NO RAIN, 45 DEGREE OUTSIDE TEMP., HEADLIGHTS ON. DRIVER FIRST NOTICED DASH LIGHTS FLICKER & ALTERNATOR GAUGE SHOWING A DISCHARGE, THEN THESE ISSUES RETURNED TO NORMAL. THE VAN CONTINUED BEING DRIVEN FOR 15 MINUTES TO DESTINATION W/O FURTHER ISSUES. UPON DEPARTING VAN, DRIVER NOTICED UNUSUAL SMELL AND WAS TOLD BY ANOTHER PERSON THAT SMOKE AND FIRE WERE COMING FROM UNDERNEATH THE VAN AT ABOUT MIDPOINT. UPON INSPECTION THE DRIVER SAW FLAMES EMANATING FROM SAID POINT UNDERNEATH THE VAN AND LIQUIDS ON THE GROUND. EMERGENCY CALL TO THE FIRE DEPARTMENT WAS MADE & A THIRD PERSON BROUGHT A FIRE EXTINGUISHER TO THE SCENE. FIRE WAS EXTINGUISHED BUT REIGNITED AS THE FIREMEN ARRIVED TO COMPLETE THE JOB. VEHICLE NOT SEVERELY DAMAGED AND NO INJURIES. VEHICLE WAS TOWED FOR INSPECTION. DISCOVERED THE ALTERNATOR CHARGING WIRE TO THE BATTERY HAD NOT ORIGINALLY BEEN SECURED OR SHIELDED PROPERLY AND WAS RUBBING ON A BOLT HEAD SECURING TWO A/C CHARGING TUBES. OVER AN EXTENDED TIME THE WIRES INSULATION WORE THROUGH & VOLTAGE WAS SUPPLIED TO THE A/C FREON TRANSFER TUBES RUNNING FROM THE LEFT FRONT SIDE TO THE REAR OF THE VAN WHERE THEY CROSSED OVER TO THE DRIVER SIDE AT ABOUT MIDPOINT ON THE BODY. THE CROSS TUBES ARE BETWEEN THE VEHICLES BODY & LONG SHIELD. THIS IS WHERE THE POSITIVELY CHARGED REAR A/C TRANSFER TUBES MADE CONTACT WITH THE NEGATIVE/GROUNDED REAR HEATER TRANSFER TUBES, SPARKED & IGNITED THE COMBUSTIBLE FLUIDS WITHIN THE FREON. THE ALTERNATOR CHARGING WIRE WAS REPAIRED, SHIELDED & SECURED. THE DAMAGED REAR TRANSFER, CROSSOVER A/C/HEATER TUBES SET WAS ORDERED FOR REPLACEMENT. REAR HEATER TUBES WERE BYPASSED AND THE VEHICLE IS BEING DRIVEN WITHOUT A/C OR REAR HEAT UNTIL THE PARTS ARRIVE. NO APPARENT DAMAGE TO THE CHARGING SYSTEM, A/C OR REAR A/C/HEATER IS SUSPECTED AT PRESENT. CONFIRMATION WILL OCCUR WHEN PART IS INSTALLED AND A/C IS RECHARGED, COOLANT SYSTEM IS SERVICED AND TESTED. *TR",
        "vin": "1GJHG39U331"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/11/2008",
        "dateOfIncident": "06/08/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10230563,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 GMC SAVANA 3500.  THE CONTACT NOTICED THAT THE HORN IN THE VEHICLE SOUNDED AUTOMATICALLY WHILE PARKED.  IN AN ATTEMPT TO STOP THE NOISE, SOMEONE PRESSED THE HORN TO COUNTERACT THE FAILURE.  ALMOST IMMEDIATELY, SMOKE BEGAN POURING FROM THE HOOD AND THE POLICE DEPARTMENT WAS CALLED.  THE VEHICLE WENT UP IN FLAMES WITHIN A MATTER OF MINUTES.  THE FIRE DEPARTMENT ARRIVED AND EXTINGUISHED THE FIRE.  AT THE TIME OF THE COMPLAINT, THE CONTACT'S INSURANCE COMPANY WAS ASSESSING THE DAMAGE TO DETERMINE IF THE VEHICLE WAS DESTROYED.  THE ENTIRE FRONT END WAS BURNED.  THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 89,000.",
        "vin": "1GJHG39U831"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/13/2008",
        "dateOfIncident": "03/12/2008",
        "fire": true,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221059,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*VIRGINIA TECH OWNS A 2003 GMC SAVANA.  THE VEHICLE CAUGHT FIRE UNDER THE HOOD IN THE MIDDLE OF THE NIGHT.  THE FIRE DEPARTMENT EXTINGUISHED THE FIRE.  THE CAUSE OF THE FIRE HAS NOT YET BEEN DETERMINED.  THE CURRENT AND FAILURE MILEAGES WERE 75,128. UPDATED 04/03/08.  *LJ",
        "vin": "1GJGG25U131"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/06/2008",
        "dateOfIncident": "02/05/2008",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217114,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 GMC SAVANA.  WHILE DRIVING 65 MPH, THE ENGINE SUDDENLY STOPPED.  THE VEHICLE WAS ABLE TO BE RESTARTED AFTER FIVE MINUTES.  THE DEALER WAS UNABLE TO DIAGNOSE THE PREVIOUS FAILURES.  THE MOST RECENT FAILURE WAS DIAGNOSED AS THE CRANKSHAFT POSITION SENSOR.  THE DEALER STATED THAT THE FAILURE IS SIMILAR TO NHTSA CAMPAIGN ID NUMBER 07V521000 (ENGINE AND ENGINE COOLING).  THE VIN WAS UNKNOWN.  THE CURRENT MILEAGE WAS 66,000 AND FAILURE MILEAGE WAS 20,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/06/2007",
        "dateOfIncident": "09/06/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202095,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK DEVELOPED A LEAK WHERE FUEL LINE ENTERS THE TANK. *TR",
        "vin": "1GKDS13S032"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/10/2007",
        "dateOfIncident": "07/09/2007",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196031,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1.  WAS DRIVING VAN ON THE HIGHWAY (DURING 1ST FAILURE OD 15,403 AND 2ND FAILURE OD 55576 ), WHEN THE TRANSMISSION WOULD NOT SHIFT IN TO HIGHER GEAR AND FAILED.  WAS DRIVING VAN ON STREET WHEN VEHICLE BECAME UNDRIVEABLE (DURING 3RD FAILURE OD 56676).    2.  DURING FAILURE 1 VAN WAS UNABLE TO MAINTAIN HIGHWAY SPEED AND HAD TO BE MANEUVERED TO THE SIDE OF THE FREEWAY AND TOWED TO THE DEALER. DURING FAILURE TWO VAN UNABLE TO MAINTAIN HIGHWAY SPEEDS AND WAS ABLE TO EXIT THE HIGHWAY AND DRIVE IN LOW GEAR TO THE DEALER.  DURING FAILURE 3 VAN WAS UNABLE TO BE DRIVEN AT ALL AND OBSTRUCTED TRAFFIC ON A MAIN STREET UNTIL IT WAS TOWED TO A DEALER.  3.  DURING FAILURE ONE SUNSHELL STRIPPED, 3-4 CLUTCHES BURNED, 2-4 BAND BURNED.  SUN SHELL & GEAR REPLACED ALL CLUTCHES & 2-4 BAND REPLACED.  DURING FAILURE TWO EXTENSIVE DAMAGE TO THE  4/4 CLUTCH, INPUT HOUSING, PUMP, SHAFT AND DRUM.  CORE REASSEMBLED AND SRTA TRANS INSTALLED. DURING FAILURE THREE TRANSMISSION WAS SHREDDED AWAITING REPLACEMENT AT THIS TIME.  *TR",
        "vin": "1GDFG15T931"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/06/2006",
        "dateOfIncident": "11/30/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10175302,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 3500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 30 MPH UNDER NORMAL ROAD CONDITIONS, THE FRONT WHEEL BEARINGS FROZE UP, AND THE TIRES DID NOT TURN.  THERE WERE NO WARNINGS PRIOR TO THE INCIDENT.  THE VEHICLE WAS TAKEN TO THE SERVICE DEALER, WHO REPLACED THE FRONT WHEEL BEARINGS AND THE BRAKE ROTORS. UPDATED 02/12/07. *JB",
        "vin": "1GJHG39U131"
    },
    {
        "components": "POWER TRAIN,EXTERIOR LIGHTING,SEAT BELTS,WHEELS",
        "crash": false,
        "dateComplaintFiled": "08/21/2006",
        "dateOfIncident": "02/21/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166150,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 35 MPH THE TRANSMISSION FAILED.  THE VEHICLE WAS TAKEN TO THE SERVICE DEALER WHERE PARTS IN THE TRANSMISSION WERE REPLACED.  AFTER 90,000 MILES, THE TRANSMISSION CEASED TO OPERATE AGAIN.  THE VEHICLE WAS TAKEN TO A DIFFERENT SERVICE DEALER WHO OFFERED TO REPLACE THE TRANSMISSION IF A WARRANTY PACKAGE WAS PURCHASED AND THE TRANSMISSION WAS REPLACED. DURING THIS VISIT TO THE 2ND DEALER, A DIAGNOSTIC TEST WAS PERFORMED WHERE THE TAIL LIGHT WAS DISCOVERED NOT TO BE WORKING.  THERE WAS NO REPAIR WORK PERFORMED FOR THE TAIL LIGHT.  THE CONTACT ALSO EXPRESSED THAT ONE DAY THE DRIVER SEAT BELT WOULD NOT UNLATCHED SO THE SEAT BELT WAS BROKEN TO RELEASE THE CONTACT.  THE VEHICLE WAS TAKEN TO THE SERVICE DEALER FOR RECALL REMEDY #05113 PERTAINING TO THE SEAT BELT. WHILE AT THE DEALER THE REMEDY REPAIR WORK WAS PERFORMED ON THE PASSENGER SEAT BELT BUT NOT THE DRIVER'S SEAT BELT.  AFTER THE REMEDY REPAIR TO THE PASSENGER SEAT BELT, IT NO LONGER WORKED PROPERLY. THE SERVICE DEALER WAS CONTACTED; HOWEVER THE SERVICE DEALER HAD TO ORDER THE PARTS FOR ADDITIONAL REPAIRS.  ALSO, WHILE DRIVING 25 MPH THE LUG NUT ON THE HUB CAP DETACHED. THE VEHICLE WAS TAKEN TO THE SERVICE DEALER WHERE PLASTIC LUG NUTS WERE INSTALLED AND THEY DETACHED AGAIN.   WHEN THE VEHICLE WAS TAKEN BACK TO THE DEALER, THE SERVICE MANAGER RECOMMENDED THE LUG NUTS BE GLUED ON.  THE CONTACT TOOK THE VEHICLE TO A TIRE COMPANY WHO INSTALLED BRAND NEW TIRES AND LUG NUTS.",
        "vin": "1GTFG29T131"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "07/07/2006",
        "dateOfIncident": "06/23/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10161799,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE SEVERAL 2003 GMC SAVANA CARGO VANS THAT ARE USED AS SERVICE VEHICLES FOR BUILDING MAINTENANCE. I HAVE RECENTLY HAD THREE INCIDENTS WHERE THE OUTER SECTION OF THE OEM WHEELS (RIMS) HAVE SEPARATED FROM THE CENTER SPOKE SECTION ALONG THE WELD LINES THAT JOIN THE TWO. THE WHEELS ON THE VEHICLES AFFECTED HAVE BEEN REPLACED AND I HAVE THE OTHERS INSPECTED FOR POSSIBLE SIGNS OF FAILURE. I HAVE ONE OF THE WHEELS THAT SPLIT IN MY OFFICE. THE MOST RECENT INCIDENT WAS 6/23/2006.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "06/14/2006",
        "dateOfIncident": "06/14/2006",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159840,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA 2500",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL 4 BRAKES LOCK UP WHILE DRIVING. BRAKE PADS DRAGGING 1 DAY PRIOR TO LOCK UP.  BRAKE PEDAL GOES HARD. EXTREMELY DANGEROUS. TOLD COMPUTER ERROR IS PROBLEM FIRST TIME. SECOND TIME ANSWER PENDING. TRANSMISSION DOES NOT ENGAGE IMMEDIATELY WHEN SHIFTING FROM REVERSE TO FOREWORD.  BACK OUT OF DRIVEWAY ONTO PUBLIC STREET-LAG TIME, DANGEROUS. INTERMITTENT PROBLEM. NO RESOLUTION FROM DEALER.  *NM",
        "vin": "1GTFG25T631"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/11/2006",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147440,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE RUNNING BOARDS ARE TOO NARROW. WHILE STEPPING OUT OF THE VEHICLE THE CONTACT MISSED THE NARROW RUNNING BOARD WHICH COULD RESULT IN A FALL. ALSO, THERE ARE NO SAFETY HANDLES ON THE INSIDE OF THE VEHICLE. THE MANUFACTURER HAS BEEN CONTACTED.*AK  UPDATED 01/25/06. *JB",
        "vin": "1GDFG15T731"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/05/2006",
        "dateOfIncident": "06/06/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146944,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 3500 SAVANA GMC VAN, WHEN OPENING THE RIGHT PASSENGER DOOR AT THE SAME TIME THAT THE SIDE DOOR IS OPEN THE SIDE DOOR HITS THE FRONT PASSENGER DOOR WHICH HAS CAUSED A DENT IN THE SIDE DOOR. THE OTHER ISSUE IS WHEN SOMEONE OPENS THE FRONT PASSENGER DOOR AND HAS THEIR HAND IN THE SAME LOCATION WHERE THE TWO DOOR MEET IT COULD CAUSE DAMAGE TO THE HAND.*JB",
        "vin": "1GJHG39UX31"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/28/2005",
        "dateOfIncident": "12/27/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146227,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE  A LEAK COMING FROM MUFFLER, DRIPPING BLACK LIQUID. I COMPLAINED AT MY DEALER, THEY SAID IT WAS NOT A PROBLEM.  *NM",
        "vin": "1GTGG25V731"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2005",
        "dateOfIncident": "01/31/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145654,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 GMC SAVANNA 2500 EXT VAN 6.0 H.O. ENGINE. MALFUNCTION FUEL GAUGE, ELECTRICAL BURNING SMELL FROM DASH. RADIO FAILED FOUR TIMES AND HAS FAILED AGAIN. CAN NOT TURN RADIO OFF WITHOUT OPENING HOOD AND PULLING FUSE. BROKEN DASHBOARD ALL FOUR TIMES. NO RADIO SINCE SEPTEMBER 2005 IN OPERATION, AND DEALER WILL NOT INSTALL NEW UNIT.  THEY WILL ONLY HAVE IT REBUILT?. TRUCK HAS RUN OUT OF GAS WHEN GAUGE READS 1/2 TANK ON MANY OCCASSIONS!*JB",
        "vin": "1GTGG29U731"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/09/2005",
        "dateOfIncident": "07/31/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132047,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT CAN'T BE PRESET FOR DRIVER 1 OR 2.  OFTEN WHEN THE VEHICLE IS STARTED, THE SEAT GOES ALL THE WAY UP UNDER THE STEERING WHEEL.  AT OTHER TIMES THE SEAT REMAINS SO FAR BACK THAT NOBODY CAN REACH THE GAS/BRAKE PEDAL.  EACH TIME ANYONE DRIVES THE VEHICLE THE SEAT MUST BE RESET OR READJUSTED.  GMC HAS BEEN TAKEN TO A REPAIR FACILITY MANY TIMES BEFORE THE WARRANTY WAS UP, BUT THE REPAIR CENTER SAID THEY HAD NO IDEA OR REMEDY FOR THIS PROBLEM. *JB",
        "vin": "1GTGK13U43F"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "06/23/2005",
        "dateOfIncident": "07/26/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10126340,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT THIS GMC SAVANA  USED (22,000 MILES) AND THE PARKING BRAKE DID NOT WORK AT THAT TIME.  THE DEALER REFUSED TO FIX IT UNDER WARRANTEE, CLAIMING IT WAS A WEAR ITEM.  I HAVE NOT HAD IT REPAIRED YET.  PARKING BRAKES SHOULD NOT WEAR OUT IN THAT SHORT A TIME.  NO CRASHES YET, BUT I SAW THAT GMC PICKUPS ARE BEING RECALLED FOR THE SAME PROBLEM AND THIS VAN PROBABLY HAS THE SAME PARKING BRAKE SYSTEM.",
        "vin": "1GKFH15TX31"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/06/2005",
        "dateOfIncident": "03/18/2005",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115463,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RUNNING BOARDS ON THE VEHICLE ARE TOO SHORT AND WERE UNABLE TO BE SEEN WHEN THE DRIVER GETS OUT FROM THE VEHICLE.  THE CONSUMER ANTICIPATES THAT IT COULD CAUSE INJURY TO EITHER FOOT WHILE GETTING INTO OR OUT OF THE VEHICLE.  THE MANUFACTURER WAS CONTACTED.   *AK   THE PROBLEM WAS REPORTED TO THE DEALER IMMEDIATELY AFTER PURCHASE.   *SC  *JB",
        "vin": "1GDFG15T731"
    },
    {
        "components": "VISIBILITY",
        "crash": true,
        "dateComplaintFiled": "08/19/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10089370,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 SAVANAH VAN MISSED ON RECALL.*MR  THE CONSUMER BELIEVES THE SAME DEFECTIVE WIPER MODULE BEING RECALLED ON OTHER GMC VEHICLE'S IS THE SAME PART IN HIS VEHICLE WHICH ALSO FAILED.  THE DEALER REFUSED TO PERFORM THE RECALL ON THE VEHICLE DUE TO IT'S VIN.",
        "vin": "1GTHG39U831"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/04/2004",
        "dateOfIncident": "05/03/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10072236,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER NOTICED THAT EXCESSIVE FUEL WAS LEAKING FROM THE FRONT OF THE VEHICLE.  THE DEALER STATED THAT THE STORAGE TANK  FELL OUT.   *AK    *SC   *JB",
        "vin": "1GDFH15T031"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/01/2004",
        "dateOfIncident": "03/02/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061057,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER WAS UNABLE TO FILL THE  FUEL TANK WITH FUEL BECAUSE THE FUEL TANK SENSOR MALFUNCTIONED. THIS RESULTED IN THE GASOLINE PUMP NOZZLE CLICKING OFF BEFORE THE TANK WAS FULL.   DEALERSHIP IN AN ATTEMPT TO CORRECT THE PROBLEM  CHANGED THE FILLER NECK, ITS VALVE AND OTHER FUEL TANK COMPONENTS, BUT THE PROBLEM STILL EXISTS.     *AK",
        "vin": "1GJHG39U631"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/27/2004",
        "dateOfIncident": "01/24/2004",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055870,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ONE OF THE RETAINING KNOTS, WHICH WAS APART OF THE WHEEL BEARING ASSEMBLY WAS MISSING WHICH CAUSED THE FRONT DRIVER SIDE WHEEL TO FALL OFF.  PLEASE PROVIDE FURTHER DETAILS.  *JB",
        "vin": "1GTHG39U431"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "12/02/2003",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10046506,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 30 MPH, THE CONSUMER WAS INVOLVED IN A FRONT END COLLISION WHEN ANOTHER VEHICLE MADE AN ILLEGAL TURN.  UPON IMPACT, NONE OF THE FRONTAL AIR BAGS DEPLOYED.   THERE WERE TWO BACK AND NECK INJURIES.  *AK   *TT  *JB",
        "vin": "1GKGG25U731"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "11/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046154,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER FEELS THAT THERE IS A DESIGN FLAW IN THE  BRAKE SYSTEM.  THIS FLAW RESULTS IN EXCESSIVE BRAKE PAD WEAR.  ONLY THE OUTSIDE BRAKE PADS WEAR.  AS A RESULT, BRAKE PADS NEED TO BE CONTINUOUSLY REPLACED. *AK",
        "vin": ""
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "10/09/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042648,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TWO CAPTAIN CHAIRS LOCATED BEHIND THE FRONT SEATS ARE UNSTABLE, AND COULD BE POTENTIALLY DANGEROUS IN THE EVENT OF A COLLISION.  *AK",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/20/2003",
        "dateOfIncident": "07/19/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10028645,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "GMC",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I READ AN ARTICLE TODAY IN THE DETROIT FREE PRESS WHICH HAS PROMPTED ME TO WRITE YOU REGARDING HIDDEN LAMPS.  MY COMPLAINT IS GENERAL, IN THAT THE AMOUNT OF \"DAZZLE\" FROM THE SCATTERED LIGHT IS GREATLY OBJECTIONABLE, AND MUST BE CONTROLLED.  \"HEAD-ON\" VIEWING OS ACCEPTABLE, BUT SLIGHT OFF-ANGLE IS EXTREMELY DISTRACTING AND PAINFUL FROM THESE LAMPS.  I WORK FOR A MAJOR AUTO COMPANY, AND HAVE SOME EXPERIENCE IN LIGHTING TECHNOLOGY.  I WOULD PREFER IF NHTSA MIGRATE TO EUROPEAN REQUIREMENTS (CUT-OFF LINES) AND ENFORCE SOME TYPE OF ANTI-DAZZLE REQUIREMENTS FOR THESE LAMPS.  ALTHOUGH ALLOWING A \"WASH\" IN FRONT OF THE VEHICLE ON THE ROAD, THE SIDE SCATTER I BELIEVE IS MORE DANGEROUS, POSSIBLE CAUSING OR RELATING TO ONCOMING DRIVER IRRITATION, ROAD RAGE, OR POSSIBLE ACCIDENTS.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/24/2003",
        "dateOfIncident": "06/24/2003",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10023664,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EXHAUST LEAK IN CONNECTION FROM TAIL PIPE TO CAT CONVERTER. SOUNDS LIKE METAL SQUEAKING UNDER VEHICLE WHEN ENGINE IS RUNNING, BUT IT IS THE SOUND OF AIR WHISTLING THROUGH LEAK. WATER ALSO DRIPS FROM LEAK. LEAK IS UNDER CLAMP THAT HOLDS TAIL PIPE UP.  *JB",
        "vin": "1GTHG39U531"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "04/27/2003",
        "dateOfIncident": "03/05/2002",
        "fire": false,
        "manufacturer": "General Motors, LLC",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10016575,
        "products": [
            {
                "manufacturer": "General Motors, LLC",
                "productMake": "GMC",
                "productModel": "SAVANA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SEAT FALLS OUT CONTINUOUSLY.   *NLM",
        "vin": "1GDFG15W0Y1"
    }
]