[
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "05/23/2010",
        "dateOfIncident": "02/02/2010",
        "fire": true,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10331883,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE THE OWNERS OF A 2003 OUTBACK BY LITEWAY (KEYSTONE) UNTIL  FEB. 2010 AT WHICH TIME IT CAUGHT FIRE AND BURNED COMPLETELY. IT WAS SITTING IN OUR DRIVEWAY AND LUCKILY A NEIGHBOR WOKE UP AND REPORTED IN ON FIRE. THE FIRE MARSHAL DETERMINED IT STARTED BEHIND THE REFRIGERATOR. WHILE LOOKING ON LINE YESTERDAY, I CAME ACROSS SEVERAL BLOGS DISCUSSING A RECALL ON THE SAME REFRIGERATOR WE HAD IN OURS. IT IS MADE BY DOMETIC AND APPARENTLY THEY'RE HANDLING THE SITUATION VERY POORLY.THIS PROBLEM IS EFFECTING AN IMMENSE AMOUNT OF TRAILERS. WE, LIKE HUNDREDS OR THOUSANDS OF OTHERS, NEVER RECEIVED A NOTICE OF RECALL THAT WOULD ALERT US TO THE POTENTIAL DANGERS! I'VE READ SEVERAL OTHER COMPLAINTS REGARDING THE \"BANDAID\" FIX DOMETIC WAS OFFERING AND READ THAT EVEN AFTER THE \"FIX\", THEIR TRAILERS CAUGHT FIRE. WHAT CAN WE DO? OUR INS. ONLY COVERED A PORTION OF THE REMAINING BALANCE THAT WE OWE AND WE ARE STILL MAKING PAYMENTS ON SOMETHING THAT DOESN'T EXIST! HELP..... *TR",
        "vin": "4YDT2302835"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/30/2008",
        "dateOfIncident": "10/24/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10247226,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 KEYSTONE OUTBACK LITE FIFTH WHEEL.  WHILE DRIVING LESS THAN 70 MPH, THE RIGHT SIDING ON THE PASSENGER SIDE OF THE VEHICLE PEELED OFF.  THERE WAS FIBERGLASS DEBRIS.  NO REPAIRS HAVE BEEN MADE.  AN INDEPENDENT MECHANIC INSPECTED THE VEHICLE AND ADVISED THE CONTACT TO HIRE AN ATTORNEY.    UPDATED 11/17/08 *CN  THE CONSUMER WAS INFORMED THE RV HAD EXTENSIVE WATER DAMAGED ON THE FRONT A RIGHT AND LEFT SIDE. UPDATED 11/24/08.*JB",
        "vin": "4YDF5272X35"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/20/2003",
        "dateOfIncident": "10/26/2003",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10048377,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "OUTBACK",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRAILERS REAR BUMPER IS SEPARATING FROM THE FRAME. THE CAUSE OF BUMPER SEPARATION IS UNDETERMINED. PLEASE PROVIDE ADDITIONAL INFORMATION.     *PH",
        "vin": "PLEASE FILL"
    }
]