[
    {
        "components": "EQUIPMENT ADAPTIVE/MOBILITY",
        "crash": false,
        "dateComplaintFiled": "06/21/2012",
        "dateOfIncident": "05/24/2012",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462574,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS 2003 KEYSTONE COUGAR RV. THE CONTACT STATED THAT THERE WAS A BIRD'S NEST IN THE PIN BOX OF THE VEHICLE AND THE HEAD OF THE PIN BOX WAS SPLIT IN HALF. THE VEHICLE WAS TAKEN TO A LOCAL REPAIR FACILITY WHERE THEY ADVISED THAT THE FRAME WORK OF THE PIN BOX WOULD NEED REPLACING. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND ADVISED THAT THEY WOULD FURTHER INVESTIGATE THE ISSUE. THE FAILURE AND THE CURRENT MILEAGE WAS NOT AVAILABLE.",
        "vin": "4YDF2852432"
    },
    {
        "components": "TIRES,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/18/2008",
        "dateOfIncident": "10/31/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10249155,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GOING FROM CALIFORNIA TO LAS VEGAS  ON INTERSTATE 15 ABOUT TEN MILES FROM THE NEVADA STATE LINE WHEN I HEARD A WHOLE LOT OF THUMPING FROM MY COUGAR FIFTH WHEEL TRAILER.  I HAD JUST TRAVERSED A VERY ROUGH SECTION OF ROAD WITH CONCRETE BARRIERS AND NO SHOULDERS ALONG THE HIGHWAY. I PULLED OVER ONTO THE PRECARIOUSLY NARROW SHOULDER AS SOON AS IT SEEMED SAFE. IT REALLY WASN'T SAFE. I SAW THAT MY FRONT TIRE ON THE RIGHT SIDE WAS SHREDDED BUT THAT THE REAR TIRE WAS STILL HOLDING THE FRONT TIRE JUST OFF ITS RIM. I FOUND A BETTER SHOULDER. I GOT SOME RV ROADSIDE ASSISTANCE. THE BIG REPAIR TRUCK PULLED UP BEHIND ME AND THE GUY PUT ON MY SPARE. HE MENTIONED THAT HE SMELLED A LOT OF PROPANE, SO I SHUT OFF THE TANK SUPPLY VALVES.   I TOOK A LOOK UNDER THE RV NEAR THE SITE OF THE FLAT. THE SHEET METAL WAS PULLED OUT AND THE PLASTIC FENDER PANEL BROKEN. ALSO THERE WAS A ?T? IN THE PROPANE LINE NEAR THE TIRE WITH A  TERMINAL CAP AND A TINY PIECE OF CRUMPLED UP COPPER TUBING POKING OUT OF A FITTING. AFTER TURNING ON THE PROPANE I COULD TELL IMMEDIATELY THAT IT WAS LEAKING BADLY, SO I TURNED THE PROPANE OFF AGAIN.  LATER, I REALIZED THAT MY HEATER WASN'T WORKING.  I DISCOVERED THAT I APPARENTLY LEFT PIECE OF THE HEATERS PROPANE COPPER SUPPLY LINE ON INTERSTATE 15. THE  COPPER LINE LED THROUGH THE UNDERCARRIAGE ABOVE THE TIRE THAT WAS DESTROYED LEAVING A TELLTALE HOLE. THE TIRE RESIDUE SHREDDED THE COPPER GAS LINE  IN SHORT ORDER. CONSIDERING HOW THE REST OF THE PROPANE SUPPLY LINE IS RATHER SOLID BLACK PIPE, I WOULD CONSIDER THIS GROUNDS FOR A RECALL. FLAT TIRES SHOULD NOT CAUSE DANGEROUS PROPANE LEAKS!  FIXING THE HEATER HOSE SEEMED STRAIGHTFORWARD ENOUGH. I BOUGHT A MADE UP REPLACEMENT HOSE AFTER REALIZING THAT THE ORIGINAL COPPER HOSE WAS NOT THE BEST AND EASIEST WAY TO GO. I THEN DRILLED A SMALL HOLE UP THROUGH THE FLOORING ABOUT A FOOT FROM THE ORIGINAL HOLE. THE NEW HOLE IS OUT OF THE WHEEL WELL, CLOSER TO THE CENTER LINE OF THE FIFTH WHEEL. OLD PARTS ARE AVAILABLE. *TR",
        "vin": "4YDF2452339"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "06/18/2008",
        "dateOfIncident": "04/29/2008",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231457,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Dometic Corporation",
                "productMake": "DOMETIC",
                "productModel": "RM2652",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 KEYSTONE COUGAR RV.  THE VEHICLE HAS A DOMETIC REFRIGERATOR, MODEL RM2652.  THE CONTACT SMELLED A STRONG AMMONIA ODOR COMING FROM THE UNIT AND THE REFRIGERATOR WAS NOT OPERATING PROPERLY.  THE REFRIGERATOR WAS TAKEN TO AN AUTHORIZED DEALER AND THEY STATED THAT THE HEAT TUBE WAS FRACTURED WITH A SLIGHT LEAK.  THE REFRIGERATOR HAS NOT BEEN REPAIRED.  THE CONTACT WAS DISPLEASED TO KNOW THAT DOMETIC WOULD NOT REPLACE THE DEFECTIVE COOLING UNIT.  THE PART NUMBER WAS UNKNOWN.   UPDATED 07/29/08 *BF",
        "vin": "4YDF2862039"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/18/2007",
        "dateOfIncident": "08/18/2007",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203378,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE AND I PURCHASED A NEW 2003 COUGAR 5TH WHEEL MANUFACTURED BY KEYSTONE.  TWO MONTHS PAST THE 1-YEAR MANUFACTURER WARRANTY, WE EXPERIENCED TWO TIRE BLOWOUTS ON THE PASSENGER SIDE.  SINCE THE WARRANTY HAD EXPIRED ON THE TIRES, WE REPLACED THEM ALL WITH NEW 10-PLY TIRES.  AFTER LESS THAN 1,000 MILES, WE EXPERIENCED ANOTHER BLOWOUT ON THE SAME SIDE RESULTING IN EXTENSIVE DAMAGE TO THE TRAILER SIDING.  IN AUGUST 2007 BEFORE TAKING A TRIP, I NOTICED THAT ONE OF THE NEW 10-PLY TIRES HAD A BUBBLE IN THE SIDE WALL.  I REPLACED THE TIRE.  ON THE WAY HOME, AFTER TRAVELING LESS THAN 500 MILES, WE EXPERIENCED ANOTHER BLOWOUT ON THE PASSENGER SIDE CAUSING MORE DAMAGE TO THE EXTERIOR.  IN RESEARCHING THE WEB, WE FOUND NUMEROUS COMPLAINTS AND HAVE CONTACTED THE DEALER, KEYSTONE AND ALKO REGARDING AXLE PROBLEMS.  ALL THREE HAVE DECLINED TO ADDRESS THE ISSUE.  WE ARE RELUCTANT TO USE OUR 5TH WHEEL BECAUSE OF SAFETY CONCERNS. *TR",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "06/27/2007",
        "dateOfIncident": "05/26/2007",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10194797,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "NANKANG RUBBER & TIRE CORP.",
                "productMake": "NANKANG",
                "productModel": "NANKANG",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "NANKING MILESTAR TRAILER TIRES SIDEWALL FAILURE/CRACKING   ST225/75R15  LOAD RANGE  D",
        "vin": "4YDT2942432"
    },
    {
        "components": "STRUCTURE,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/20/2006",
        "dateOfIncident": "10/10/2006",
        "fire": false,
        "manufacturer": "Keystone RV Company",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10171438,
        "products": [
            {
                "manufacturer": "Keystone RV Company",
                "productMake": "KEYSTONE",
                "productModel": "COUGAR",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "KEYSTONE, INC.",
                "productMake": "KEYSTONE",
                "productModel": "MINI KLASSIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE THE VEHICLE WAS PARKED, THE BUMPER METAL WAS OBSERVED TO BE TORN ON BOTH SIDES.  THE MANUFACTURER WAS NOTIFIED AND ADVISED THE CONTACT TO TAKE THE TRAILER TO THE SERVICE DEALER FOR INSPECTION.  *AK  UPDATED 11/30/06. *JB",
        "vin": "4YDT2942132"
    }
]