[
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/06/2011",
        "dateOfIncident": "05/20/2011",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10410706,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 KIA SORRENTO EX (NA). WHILE THE CONTACT DISPENSED FUEL INTO THE FUEL TANK, FUEL WOULD SPRAY OUT ONTO THE GROUND AND CLOTHING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR DIAGNOSIS AND REPAIR. THE FAILURE CONTINUED TO OCCUR AFTER THE REPAIR. THE DEALER WAS NOTIFIED AND RECOMMENDED THE VEHICLE BE DIAGNOSED TO DETERMINE THE CAUSE OF FAILURE. THE MANUFACTURER WAS NOT MADE AWARE OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "KNDJC733535"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/11/2011",
        "dateOfIncident": "05/28/2010",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10395458,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "APRIL 11, 2011    TO WHOM IT MAY CONCERN,    THIS LETTER IS TO OFFICIALLY SUBMIT A COMPLAINT ABOUT THE SAFETY OF OUR 2003 KIA SORENTO WITH  MILEAGE OF 109209  MY HUSBAND AND I PURCHASED THIS VEHICLE BEFORE THE BIRTH OF OUR BABY BACK IN MAY 2010, BECAUSE WE NEEDED THE EXTRA SPACE.  UNFORTUNATELY, WE HAVE SOME CONCERNS ABOUT THE SAFETY OF THE VEHICLE. AFTER MUCH RESEARCH WE FOUND THAT THIS PARTICULAR COMPLAINT ALONG WITH OTHER FUEL PUMP COMPLAINTS ARE COMMON AMONG OTHER KIA OWNERS. I AM ASKING THE PERSON OR DEPARTMENT IN CHARGED TO  PLEASE LOOK INTO THIS MATTER AND TAKE THE PROPER ACTION.     OUR COMPLAINTS ARE AS FOLLOWS.       THE MAIN PROBLEM AND CONCERN IS WITH THE FUEL TANK, EVERY TIME WE PUMP GAS THE GAS SHOOTS BACK AND SPRAYS ME OR MY HUSBAND AND IT RUNS DOWN THE SIDE OF THE CAR. WE HAVE TO CONSTANTLY STOP PUMPING GAS EVERY 10 SECONDS TO PREVENT THE SPRAYING OF GAS. ON NUMEROUS OCCASIONS THE GAS HAS ALMOST SPRAYED ME ON MY EYES, AND JUST RECENTLY IT SPRAYED ME IN BOTH ARMS, AND BURNED MY SKIN. I HAVE TO BE VERY CAREFUL EVERY TIME I PUMP GAS, I'M AFRAID THIS IS GOING TO SPRAY ME IN MY FACE OR WORST YET HARM MY CHILD!   OUR SECOND COMPLAINT IS THAT THE KIA NEEDS CONSTANT ANTI-FREEZE BECAUSE THE HEAT THERMOMETER SHOWS THE VEHICLE OVERHEATS ABOUT EVERY 3 MONTHS. WE HAVE TAKEN OUR VEHICLE TO VARIOUS MECHANICS, AND TWICE TO THE KIA DEALERSHIPS, HOWEVER THEY CAN NOT FIND A PROBLEM, ON BOTH OF THE ISSUES LISTED ABOVE. THE KIA IS THE MAIN VEHICLE WE USE TO GET AROUND, HOWEVER LATELY I HAVE BEEN VERY CONCERN ABOUT THE SAFETY OF THE CAR. PLEASE TAKE THIS LETTER AS OUR OFFICIAL COMPLAINT, AND WE LOOK FORWARD TO HAVING AN OFFICIAL RESPONSE BACK. I?M CONCERN ABOUT OUR SAFETY, BUT ALSO THE SAFETY OF OTHER DRIVERS WITH THE SAME KIA MODEL. PLEASE LOOK INTO THE MATTER, AND I TRUST THE RIGHT THING WILL BE DONE TO SOLVE THIS PROBLEM.      THANK YOU IN ADVANCE.  *TR",
        "vin": "KNDJD733335"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/14/2007",
        "dateOfIncident": "06/13/2007",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193335,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 KIA SPORTAGE.  THE CONTACT STATED THAT A COUPLE OF YEARS AGO, THE BLADES ON HIS COOLING FAN BEGAN TO COME OFF, CAUSING THE VEHICLE TO OVERHEAT.  THE DEALER COULD NOT FIND ANYTHING WRONG WITH THE VEHICLE.  THE CONTACT STATED THAT HE RECENTLY RECEIVED RECALL NOTICE # 07V161000 (ENGINE AND ENGINE COOLING:COOLING SYSTEM:FAN).  THE PURCHASE DATE AND FAILURE MILEAGE WERE UNKNOWN.  THE CURRENT MILEAGE IS 93,314.",
        "vin": "KNDJB723625"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2003",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Kia Motors America",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10044528,
        "products": [
            {
                "manufacturer": "Kia Motors America",
                "productMake": "KIA",
                "productModel": "SPORTAGE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH 2002 KIA SPORTAGE/ LEMON VEHICLE..*MR  THE CONSUMER WAS REQUESTING THAT KIA OF AMERICA INC PURCHASE THE DEFECTIVE VEHICLE IMMEDIATELY.  PLEASE RESPOND PROMPTLY IN RESOLVING MATTERS*  CB",
        "vin": "KNDJB723125"
    }
]