[
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2004",
        "dateOfIncident": "08/28/2003",
        "fire": true,
        "manufacturer": "MID-WEST CHOPPERS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061926,
        "products": [
            {
                "manufacturer": "MID-WEST CHOPPERS",
                "productMake": "MID-WEST CHOPPERS",
                "productModel": "MOTORCYCLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLAMP BURNED OUT WHILE TRAVELING AT NIGHT CAUSING A POTENTIAL LIFE THREATENING SITUATION.*AK",
        "vin": "1P90558PSLY"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2004",
        "dateOfIncident": "07/08/2003",
        "fire": false,
        "manufacturer": "MID-WEST CHOPPERS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10061951,
        "products": [
            {
                "manufacturer": "MID-WEST CHOPPERS",
                "productMake": "MID-WEST CHOPPERS",
                "productModel": "MOTORCYCLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE RIDING MY MID-WEST CHOPPERS MOTORCYCLE IN THE EVENING, MY HEADLIGHT SHORTED OUT AND FAILED. UPON INSPECTION IT APPEARED THE WIRING WAS POORLY INSTALLED. THIS IS A SAFETY ISSUE.*AK",
        "vin": "1P90557PSLY"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": true,
        "dateComplaintFiled": "11/19/2003",
        "dateOfIncident": "08/29/2003",
        "fire": false,
        "manufacturer": "MID-WEST CHOPPERS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047156,
        "products": [
            {
                "manufacturer": "MID-WEST CHOPPERS",
                "productMake": "MID-WEST CHOPPERS",
                "productModel": "MOTORCYCLE",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AUTOMATIC EQUIP. MFG. CO.",
                "productMake": "UNKNOWN",
                "productModel": "AUTOMATIC",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I WAS RIDING MY 2003 MID-WEST CHOPPERS MOTORCYCLE ON AUGUST 29TH, 2003. I WAS TRAVELING ABOUT 65 MPH WHEN MY REAR SWINGARM ASSEMBLY ON MY MOTORCYCLE FAILED CATASTROPHICALLY. I ALMOST WAS THROWN FROM THE MOTORCYCLE DUE TO THE SHIFTING OF THE SWINGARM ASSEMBLY. I CONTACTED THE MANUFACTURER OF THE MOTORCYCLE AND THEY INSTRUCTED ME TO TAKE THE MOTORCYCLE TO A SHOP IN THE AREA - I DID. THE SHOP DISASSEMBLED THE SWINGARM ASSEMBLY AND FOUND THE SWINGARM PIVOT BOLT TO BE SNAPPED JUST WHERE IT FITS INTO THE BUSHING. MID-WEST CHOPPERS (GALESBURG, IL) WAS CONTACTED AND INSTRUCTED ME THAT PRO-STREET FRAMEWORKS (HENRYETTA, OK) WAS RESPONSIBLE. I HAD THE SHOP (DD CUSTOMS, GURNEE, IL) CONTACT PSFW AND PSFW ADMITTEDLY HAD ISSUES WITH THEIR \"TRADITIONAL V-STYLE\" SWINGARM ASSEMBLY AND SAID THEY WOULD SEND A NEW SPACER AND BOLT. AFTER SEEING THE NEW SPACER AND BOLT, IT WAS DETERMINED THAT THIS FIX PROBABLY WOULD NOT MAKE A DIFFERENCE AND WOULD PUT ME IN JUST AS MUCH RISK AS BEFORE. I AM NOW STUCK WITH AND $30,000 MOTORCYCLE THAT IS QUESTIONABLY SAFE AT BEST. MID-WEST CHOPPERS (S. LHEUREUX) INSTRUCTED ME THAT THIS WAS A BAD BATCH FROM PSFW AND THEY WERE WORKING TO RECALL SOME OF THOSE ASSEMBLIES. I HAVE NEVER RECEIVED ANY CORRESPONDENCE REGARDING A RECALL. SOMEONE WILL MOST LIKELY DIE BECAUSE OF THIS SWINGARM ASSEMBLY - ONE THAT HAS BEEN SOLD TO NUMEROUS INDIVIDUALS WHO ARE COMPLETELY UNAWARE OF THIS SITUATION. PLEASE HELP ME PREVENT ANY FUTURE FATALITIES DUE TO THIS UNSAFE PRODUCT. THE VIN IS [XXX] - A VIN MID-WEST CHOPPERS HAS ASSURED ME IS VALID, HOWEVER NO ONE ELSE THINKS SO. SINCERELY, [XXX]    *LA     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "1P90558PSLY"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/19/2003",
        "dateOfIncident": "09/19/2003",
        "fire": false,
        "manufacturer": "MID-WEST CHOPPERS",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047180,
        "products": [
            {
                "manufacturer": "MID-WEST CHOPPERS",
                "productMake": "MID-WEST CHOPPERS",
                "productModel": "MOTORCYCLE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 09/19/03 I WAS RIDING MY MOTORCYCLE WHEN THE SWINGARM ASSEMBLY FAILED, NEARLY THROWING ME FROM IT. THE SWINGARM PIVOT BOLT WAS BENT OR BROKEN, THE SWINGARM WAS SHIFTED, THE TIRE WAS CONTACTING THE REAR FENDER, THE BELT FRAYED, AND PAINT WAS DAMAGED. I TOOK THE MOTORCYCLE TO A LOCAL REPAIR SHOP.     I CONTACTED THE MANUFACTURER/SELLER, MID-WEST CHOPPERS IN GALESBURG, ILLINOIS, TO AUTHORIZE WARRANTEE WORK. THEY REFUSED TO ASSIST. THE REPAIR SHOP, DD CUSTOM CYCLE IN GURNEE, ILLINOIS, CONTACTED THEM AND SPOKE WITH CHIP MIYLER, OWNER. HE INSTRUCTED THE SHOP TO STOP ALL WORK. MIDWEST CHOPPERS CONTACTED ME AND CLAIMED THEY ARE NOT RESPONSIBLE FOR ANY PROBLEMS AND TOLD ME TO CONTACT THE SWINGARM/FRAME MANUFACTURER, PRO STREET FRAMEWORKS IN HENRYETTA, OKLAHOMA.     I CONTACTED PRO STREET FRAMEWORKS. AN EMPLOYEE, KEVIN ADMITTED THEY WERE AWARE OF SIMILAR PROBLEMS OCCURRING WITH OTHER MOTORCYCLES MANUFACTURED WITH THEIR SWINGARM/FRAME. HE SENT ME A NEW PIVOT BOLT AND SPACER TO REPLACE THE ORIGINALS. I SENT THEM TO THE REPAIR SHOP. THE SHOP ENGINEER BELIEVES THIS IS NOT ADEQUATE. THE SHOP NOW ALSO NOTICED THE REAR LEFT FRAME SUPPORT WAS ALSO BENT.     I CONTACTED PRO STREET FRAMEWORKS TO INFORM THEM. I SPOKE WITH THE OWNER, DANNY. HE INSTRUCTED ME TO SEND HIM THE SWINGARM AND FRAME FOR REPAIR. IN ORDER TO SEND THE PARTS THE MOTORCYCLE HAD TO BE DISASSEMBLED. I INSTRUCTED THE SHOP AND SENT THE PARTS. I CONTACTED PRO STREET FRAMEWORKS OVER 20 TIMES TO CHECK ON STATUS AND REQUEST ASSISTANCE. NONE OF MY MESSAGES WERE RETURNED.     I AM SUBMITTING THIS REQUEST TO PURSUE A SERIOUS SAFETY ISSUE. I HAVE NEVER BEEN NOTIFIED OF THIS KNOWN DEFECT BY THE SELLER. THE FAILED PIVOT BOLT AND SPACER DESIGN WAS CLEARLY NOT ADEQUATE. THIS SITUATION IS ACKNOWLEDGED SINCE THEY SENT REPLACEMENT PARTS, AND ATTEMPTED TO REPAIR MY SWINGARM AND FRAME. FORTUNATELY, I AM STILL ALIVE. I HOPE THIS SITUATION DOES NOT RESULT IN SOMEONE ELSE'S INJURY OR FATALITY.*AK",
        "vin": "1P90557PSLY"
    }
]