[
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/18/2021",
        "dateOfIncident": "09/21/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11433439,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The sensor does not send the speed to the speedometer",
        "vin": "4F2YZ02BX3K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2021",
        "dateOfIncident": "08/17/2021",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11432893,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "The contact owns a 2003 Mazda Tribute. The contact had taken his vehicle to an independent mechanic and was informed that there was severe corrosion on the lower control arm. Upon investigation, the contact discovered NHTSA Campaign Number: 14V174000 (Structure) which he linked to the failure. After performing a VIN search, the contact also discovered that his vehicle was not included in the recall. The dealer was notified of the failure and confirmed that the VIN was not under recall. The manufacture had yet to be notified of the failure. The vehicle had yet to be repaired. The failure mileage was approximately 138,000.",
        "vin": "4f2yz94173k"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/25/2021",
        "dateOfIncident": "03/24/2021",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11404928,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A FREE, AAA INSPECTION, THE AUTO SHOP TOLD ME THAT THE VEHICLE IS DANGEOUS DUE TO STRUCTURAL DAMAGE OR BODY DAMAGE.   I DON'T KNOW HOW LONG THIS BEEN A PROBLEM",
        "vin": "4F2CZ96103K"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365995,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING AROUND 50MPH AND COMNG UP TO A STOP LIGHT, AS I BEGAN TO SLOW DOWN IN THE LEFT TURNING LANE FOR THE RED LIGHT GOING LEFT, MY TRIBUTE SUDDENLY STALLED.THE LIGHT THEN OF COURSE TURNED GREEN AND THIS WAS NOT GOOD, CAUSE ALL THE CARS COMING UP FROM BEHIND ME WERE NOW INTENDING TO NO SLOW DOWN AND BEGIN TO SPEED UP, TO CARRY ON THROUGH THE VERY BUSY INTERSECTION. WHICH ALMOST CREATED A PILE UP, BEGINNING AT MY REAR BUMPER, OR ANOTHER SUDDEN COLLISION NEAR BY. LUCKILY ALL THE CARS HAD EITHER SWERVED AROUND MINE, OR MANAGED TO STOP BEHIND ME. I THEN PUT MINE IN PARK AND TRIED TO START IT, THE ENGINE STARTED BUT I WAS UNABLE TO SHIFT OUT OF PARK. SO I SHUT IT OFF, PUT IT IN NEUTRAL AND TRIED STARTING IT, IT STARTED AND SHIFTED OUT OF PARK BUT WOULD NOT MOVE WHILE IN DRIVE. SO I TRIED IN ONE OF THE LOWER GEARS AND IT VERY SLOWLY, ABOUT 5 MPH BEGAN TO MOVE, GETTING ME OFF THE MAJOR ST AND ON TO A SIDE STREET. I THEN CHECKED REVERSE, WHICH WORKED JUST FINE AND ALLOWED ME TO PULL INTO A NEARBY STORE TO WAIT FOR A TOW TRUCK. I PUT IT IN PARK AND SHUT IT OFF, TOO WAIT FOR IT TO BE TOWED HOME. THE NEXT DAY I TRIED TO USE IT, BUT STILL NOTHING IN DRIVE, NO CHECK ENGINE LIGHT AND ITS BEEN PARKED EVER SINCE, ABOUT 5 MONTHS NOW.",
        "vin": "4F2YZ04173K"
    },
    {
        "components": "POWER TRAIN,VEHICLE SPEED CONTROL,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "10/23/2020",
        "dateOfIncident": "05/01/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11365999,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR STALLED WHEN SLOWING TO STOP IN LEFT TURNING LANE DOING AROUND 45MPH, APPROACHING THE LIGHT IN A BUSY INTERSECTION AND VEHICLES APPROACHING MINE FROM BEHIND. IT WOULD NO LONGER START IN PARK OR MOVE IN DRIVE, TO GET OUR OF THE WAY AND OFF THE STREET I HAD TO WAIT AND THE MOVE IT IN REVERSE. GOT TOWED HOME AND IT STILL SITS.",
        "vin": "4F2YZ04173K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/27/2020",
        "dateOfIncident": "02/27/2020",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11319553,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS COMING UP TO A STOP LIGHT AND AS I SLOWED DOWN MY 03 MAZDA TRIBUTE STALLED, LEAVING ME STOPPED IN THE MIDDLE OF 5 LANES. AS THE LIGHT WAS TURNING GREEN & THE CARS NEARING MY REAR, HAD TO SWERVE AROUND TO AVOID A COLLISION. I HAD PLACED MY SHIFTER INTO PARK AND WAS ABLE TO RESTART MY VEHICLE, BUT IT STILL WOULD NOT MOVE AFTER SHIFTING INTO D(DRIVE). SO I SHIFTED INTO ONE OF THE LOWER GEARS, TO SLOWLY GET OFF THE STREET AND INTO THE NEAREST PARKING LOT. I PARKED AND SHUT MY VEHICLE OFF, MADE SURE ALL WAS INTACT THEN RESTARTING MY VEHICLE. I SHIFTED INTO R(REVERSE) AND BACKED UP NORMALLY, I THEN SHIFTED INTO D(DRIVE) BUT MY CAR ONLY ROLLED AS THOUGH IT WAS IN N(NEUTRAL). SO I SHIFTED INTO R(REVERSE), BACKED DIRECTLY INTO MY PARKING SPACE AND CALLED MY ROADSIDE ASSIST. TO BE TOWED HOME.",
        "vin": "4F2YZ04173K"
    },
    {
        "components": "STRUCTURE,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/20/2019",
        "dateOfIncident": "07/21/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11245355,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS MALFUNCTIONED AND THE ABS LIGHT IS ON. WHEN I ENGAGE THE BREAK IT MAKES NOISE INITIAL BEFORE IT WILL START TO ENGAGE PROPERLY, BUT THE ABS LIGHT KEEPS SHOWING STEADILY.    THE TRUNK OF THE VEHICLE REMAINS LOCKED AND CANNOT OPEN. THE LATCH IS NOT BAD.",
        "vin": "4F2CZ96103K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/13/2019",
        "dateOfIncident": "07/13/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11231621,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE I WAS DRIVING THE CAR JUST SHUT OFF. I WAS TOLD IT WAS THE BATTERY AND ALTERNATOR. SO I HAD THEM REPLACED. THE CAR RAN FOR ABOUTV10 MINUTRS AND JUST SHUT OFF. WHILE AT THE MACHANICS HE SAID THAT THE WIRE HARNESA IS MELTING AMD THAT I GOT LUCKY NOT TO HAVE A FIRE. THE ABS LIGHT GOAE OFF AND ON TO. I CALLED ABOUT A RECALL I SAW IN 2007 ABOUT THE WIRE HARNESS AND THEY ARE TELLING ME IT IS FIXES. I HAVE PROOF IT IS MELTED AND. WOULD LIKE MY CAR FIXED UNDER THE RECALL.",
        "vin": "4F2CZ96153K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2019",
        "dateOfIncident": "07/04/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11230379,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS PULLING EXCESSIVELY TO THE RIGHT AND MADE A GRINDING NOISE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHO DIAGNOSED THAT THE FRONT PASSENGER SIDE SUBFRAME CROSSMEMBER AND ENGINE CRADLE WERE CORRODED THROUGH. ALSO, THE FRONT LOWER CONTROL ARMS MOUNT WAS DETACHED AND NEEDED TO BE REPLACED. THE CONTACT ALSO STATED THAT THE FRONT DRIVER'S SIDE WAS CORRODED. THE VEHICLE WAS NOT REPAIRED. THE DEALER WAS NOT NOTIFIED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND PROVIDED CASE NUMBER: 12237710780. THE CONTACT WAS REFERRED TO NHTSA. THE CONTACT WANTED TO KNOW WHY THE MANUFACTURER AND NHTSA DID NOT INCLUDE HIS STATE IN NHTSA CAMPAIGN NUMBER: 14V174000 (STRUCTURE). THE APPROXIMATE FAILURE MILEAGE WAS 146,000.   *TR*JB",
        "vin": "4F2CZ06103K"
    },
    {
        "components": "STEERING,SUSPENSION,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/07/2019",
        "dateOfIncident": "05/15/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11205991,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NOTHING HAPPENED. I HAVE BEEN EXPERIENCING FRONT END ISSUES FOR SOME TIME NOW.",
        "vin": "4F2CZ96143K"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/20/2019",
        "dateOfIncident": "02/17/2019",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11181291,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING IN GREEN BAY WI 2/17/2019 AND WENT THROUGH A ROUNDABOUT, FELT SOMETHING GIVING OUT IN STEERING? PULLED INTO A PARKING LOT NEAR BY AND HAD NO CONTROL OVER CAR? FOUND OUT THERE IS A RECALL ON THE MAZDA TRIBUTE SUBFRAME WHICH GETS CORRODED WITH SALT AND RUSTS OUT? MAZDA FIXED THIS RECALL ON THIS CAR 12/18/2015 AND PERFORMED THE SUBFRAME RECALL ON THIS CAR. NOW THE PARTS GAVE OUT AGAIN AND BROKE SO THE PARTS DO NOT LAST LIKE THEY THINK THEY DO? PEOPLE WILL PROBABLY DIE IN THIS CAR, THINKING THESE PARTS ARE MADE TO LAST AND THEY DONT.? THIS VEHICLE IS A DANGER TO ALL WHO DRIVE IT THIS WAY, NOT KNOWING THE PARTS WILL NOT LAST? MAZDA CLAIMS THEY FIXED IT, IT LASTED 40,000 MILES, WONT FIX IT AGAIN, BUT HOW LONG DOES A RECALL PART LAST? ESPECIALLY SINCE THE PREVIOUS OWNER TOOK CARE OF THIS CAR, WENT THROUGH ALL THE NECESSARY REPAIRS AND THEN WE LOST STEERING AND HAD NO  IDEA THAT THIS WAS A SEVERE DANGER? WE ARE LUCKY TO BE ALIVE. IF THIS HAPPENS ON A FREEWAY THIS CAR CAN ROLL AND PEOPLE WILL BE KILLED, NOT KNOWING ABOUT THE PARTS FAILURE? PLEASE HELP, WE HAVE NO CAR FOR WORK AND ARE SCARED TO EVEN FIX IT? IT ONLY HAS 160,000 MILES ON IT? I HONESTLY NEED THE RIGHT PEOPLE TO EXAMINE THIS? I DONT HAVE A PICTURE YET, BUT WOULD GLADLY PROVIDE THEM WHEN YOU CONTACT ME WITH A CASE NUMBER AND WHAT WE CAN DO? YIKES THANKS FOR THE HELP?",
        "vin": "4F2CZ96153K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/29/2018",
        "dateOfIncident": "11/27/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11154822,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD A NOISE BEGIN ALL OF THE SUDDEN ON THE REAR RIGHT SIDE. THOUGHT IT WAS THE MUFFLER OR SHOCK AND I WAS CORRECT. TOOK IT TO A MAZDA DEALERSHIP AND THEY SAID THE BODY RUSTED THROUGH AT THE STRUT TOWER CONTACT AND THE SHOCK/STRUT WAS COMPLETELY UNATTACHED. IT STARTED WHILE I WAS ON THE HIGHWAY. THIS BECOMES A DANGEROUS SITUATION AND THEY SAY THEY CAN'T DO ANYTHING ABOUT IT. THIS IS A MANUFACTURER ISSUE AND I ATTEMPTED TO HAVE IT FIXED. THIS SHOULD BE ADDRESSED ON ALL THESE VEHICLES. I WAS TOLD I NEED TO GO AND TRY TO FIND A BODY SHOP SEE IF THEY CAN FIX THIS. I FIND THIS UNACCEPTABLE FROM THE MANUFACTURER.",
        "vin": "4F2YZ94123K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/12/2018",
        "dateOfIncident": "10/05/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11139903,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HELP PLEASE?  I PURCHASED MY 2003 MAZDA TRIBUTE IN OCTOBER, 2016.  I RECENTLY NEEDED REPAIRS DONE (NEW MUFFLER SYSTEM WAS INSTALLED) BUT WAS TOLD MY LOWER CONTROL ARM ASSEMBLIES COULDN'T BE REPLACED BECAUSE OF THE HUGE CRACK IN THE SUB-FRAME.  THE RECALL ON THE SUB-FRAME WAS DONE IN JULY, 2014 (BEFORE MY PURCHASE) ' BY INSTALLING A CROSS-BRACE.  WHEN MAZDA MADE THE RECALL, OWNERS WERE INFORMED THAT THE PARTS TO REPAIR THE SUSPENSION PROBLEM WERE NOT YET AVAILABLE' AND A SECOND LETTER WOULD BE MAILED ONCE PARTS WERE AVAILABLE.  A 'NEWLY DESIGNED' REINFORCEMENT CROSS-BRACE WAS THE FIX?... OR JUST A BAND-AID THAT DELAYED THE INEVITABLE?... BECAUSE EVEN WITH THE CROSS-BRACE INSTALLED, MY PROBLEM IS STILL HERE ' MY SUBFRAME IS SEVERELY CRACKED AND NOT SAFE' IT COULD SNAP SUDDENLY FROM SOMETHING AS SIMPLE AS HITTING A POTHOLE.  I AM ATTACHING PICTURES TO THIS E-MAIL OF THE SUBFRAME SHOWING WHERE IT IS RUSTED THROUGH. YOU CAN SEE HOW WIDE THAT CRACK IS... YOU CAN SEE WHERE THE REINFORCEMENT CROSS-BRACE FIX IS ATTACHED... AND WHY THE CONTROL ARM ASSEMBLY CANNOT BE REPLACED.  IF THE PICTURES AREN'T ACCEPTABLE, I WOULD BE HAPPY TO HAVE THE MAZDA DEALERSHIP HERE IN WOOSTER (330) 804-1000 VERIFY MY CLAIM.    I AM 72 AND ONLY GET $700 A MONTH SS ' WHICH I AM BARELY GETTING BY ON.  I HAD TO SAVE TO GET THE NEW MUFFLER AND CONTROL ARMS SO A MECHANIC FRIEND COULD INSTALL THEM. I REALLY NEED MAZDA TO COVER THIS EXPENSIVE REPAIR' AND I HAVE ASKED MAZDA FOR AN EXCEPTION (OR EXTENSION) TO THE RECALL THAT WAS DONE ON MY CAR.  I CONTACTED MAZDA IN AN EMAIL ON 10/5/18' AND RECEIVED A REPLY BACK THE 'SAME' DAY ASSIGNING ME AN SR NUMBER: 1-1768908199' BUT I HAVEN'T HEARD FROM THEM AGAIN.  IS THERE ANY WAY YOUR AGENCY CAN ASSIST ME HERE?... MAYBE THEY'LL RESPOND TO YOU?    THANK YOU FOR YOUR TIME AND ANY EFFORTS ON MY BEHALF.  (XX)    PARTS OF THIS DOCUMENT HAVE BEEN REDACTED TO PROTECT PERSONALLY IDENTIFIABLE INFORMATION PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)",
        "vin": "4F2CZ96183K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/01/2018",
        "dateOfIncident": "06/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11132802,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME I START MY 2003 MAZDA TRIBUTE AND EVERY 30 MINUTES OF OPERATION THEREAFTER, THE CAR MAKES 5 SETS OF 5 BEEPS.  AN INTERNET SEARCH TOLD ME THAT THIS IS BECAUSE OF A MALFUNCTIONING INSTRUMENT PANEL LIGHT TO INDICATE THAT THE AIRBAGS ARE ALSO MALFUNCTIONING.  A MAZDA MECHANIC INFORMED ME THAT THIS IS A CHRONIC PROBLEM WITH MY MAKE AND MODEL VEHICLE.  AND EVEN IF I HAVE THE VERY EXPENSIVE JOB DONE TO REPLACE THE ENTIRE AIRBAG SYSTEM, THE REPLACEMENT PARTS DON'T WORK EITHER.  I HAVE OWNED THIS VEHICLE FOR OVER 3 YEARS AND THIS HAS BEEN GOING ON ALMOST THE ENTIRE TIME.  MAZDA NEEDS TO PROVIDE A GOOD WORKING SOLUTION TO THIS PROBLEM AND SOON.",
        "vin": "4F2CZ96153K"
    },
    {
        "components": "SUSPENSION,AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/12/2018",
        "dateOfIncident": "07/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11129166,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS SIGN ACTIVE",
        "vin": "4F2YZ94123K"
    },
    {
        "components": "POWER TRAIN,AIR BAGS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2018",
        "dateOfIncident": "06/11/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11114420,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL, LIGHT CONTINUES TO FLASH WHILE DRIVING AND SITTING IN PARK, GOING DOWN THE HIGHWAY OR CITY STREETS.DRIVING DOWN THE HIGHWAY THE CAR STOPPED PULLING WITH TRAFFIC SPEED OF 65 MPH HAD TO MANEUVER OFF THE HIGHWAY. WOULDN'T PULL IN ANY GEAR, SHIFTER ONLY HAD ONE GEAR IT WOULD SIT IN WILL SLIDE FROM NEUTRAL TO DRIVE 2. COST $224.00 TO TOW WHICH I HAD TO BORROW.",
        "vin": ""
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/25/2018",
        "dateOfIncident": "05/25/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11097980,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ACCELATOR IS STUCK AT 4,000 RPM. JUST ARRIVED IN DRIVEWAY AND PUT IN PARK.",
        "vin": "4F2CZ961X3K"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/08/2018",
        "dateOfIncident": "07/01/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11071847,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STRUCTURE CROSS BRACKET FOR LOWER CONTROL ARM. ACCELERATOR CABLE.CRUISE CONTROL CABLE THROTTLE BODY STICKS EVEN AFTER THE RECALLS THE DRIVER AIR BAG DOES NOT WORK LIGHT ON DASH IT'S THE PLUG AT WIRE HARNESS MASTER CYLINDER LEAKS LOSE BRAKE FLUID ENGINE STALLED WHEN ON HWY105 WAS ABLE TO GET IT STARTED AGAIN BUT WHILE TURNING CAR STARTED TO ROUGH IDLE AND STARTED TO DIE AGAIN. IDLED TO A STOP CAR WAS SHAKING AND WOULD RUN. HAD TO SIT AROUND 20 MINUTES BEFORE IT WOULD RUN AND STAY GOING. CAR HAS BEEN REGISTERED IN MINNESOTA AND CANADA BOTH HAVE RECALLS FOR THIS CAR.",
        "vin": "4F2YZ94143K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/15/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11062909,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER FINISHING A ROAD TRIP, WE PARKED THE CAR AND THE RPMS BEGAN TO MOVE HIGHER AND HIGHER. WE PUT THE VEHICLE IN NEUTRAL, BUT THE RPMS BEGAN TO DRASTICALLY RISE. THE VEHICLE WAS THEN PUT INTO PARK AND ONCE AGAIN THE RPM'S CONTINUED TO RISE. WE THEN TURNED THE VEHICLE OFF AND THE PROBLEM STOPPED.",
        "vin": "4F2CZ94103K"
    },
    {
        "components": "STEERING,SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/01/2017",
        "dateOfIncident": "11/01/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11042213,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING MY 2003 MAZDA TRIBUTE I HEARD A FEW STRANGE SOUNDS. SEVERAL TIMES THE CAR SUDDENLY PULLED TO THE RIGHT. THERE WAS ALSO A SOUND OF SOMETHING RUBBING THAT GOT FASTER AND FASTER AS I ACCELERATED. THEN WHEN THE CAR PULLED SUDDENLY TO THE RIGHT MY SON AND I HEARD A LOUD SOUND. FORTUNATELY, I WAS FAIRLY CLOSE TO OUR MECHANIC SO I SLOWLY DROVE THE CAR THERE. UPON INSPECTION THE MECHANIC FOUND THE SUB FRAME OF MY 2003 MAZDA TRIBUTE WAS COMPLETELY CORRODED AND IS NOW DEEMED UNSAFE TO DRIVE. THE COST TO REPAIR IT WAS ESTIMATED AT $5,000.00 PLUS. THE CAR HAS APPROXIMATELY 95,000 MILES ON IT AND HAS BEEN OTHERWISE A TROUBLE-FREE VEHICLE THAT WAS ROUTINELY MAINTAINED.     I AM VERY FORTUNATE THAT MY SON AND I WERE NOT INJURED IN AN ACCIDENT CAUSED BY THE SUDDEN VEERING OF THE CAR ' OR BY THE FRONT END FRAME COMPLETELY COLLAPSING FROM BENEATH US AS WE WERE DRIVING.     MAZDA ISSUED A RECALL FOR THIS ISSUE (7514D) IN MAY OF 2014. THE NHTSA CAMPAIGN NO. IS 14V174000. I ENTERED THE VIN NO. FOR MY CAR AT SAFER CAR.GOV AND IT SHOWS 0 RECALLS. (WE WERE ISSUED A RECALL NOTICE FOR A DIFFERENT PROBLEM WHICH WE DID GET CORRECTED BY MAZDA A FEW YEARS AGO.) I WAS NOT NOTIFIED OF THIS RECALL.",
        "vin": "4F2CZ04103K"
    },
    {
        "components": "ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/25/2017",
        "dateOfIncident": "09/21/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11025357,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT'S SON OWNS A 2003 MAZDA TRIBUTE. WHILE THE CONTACT'S SON WAS DRIVING AT AN UNKNOWN SPEED, THE ABS INDICATOR ILLUMINATED. WHILE THE BRAKE PEDAL WAS DEPRESSED, THE VEHICLE FAILED TO COME TO A COMPLETE STOP. THE VEHICLE WAS TAKEN TO ISLAND MAZDA (1580 HYLAN BLVD, STATEN ISLAND, NY 10305 (844) 667-0618) WHERE IT WAS DIAGNOSED THAT THE ABS MODULE'S ELECTRICAL WIRING HARNESS NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE CONTACT REFERENCED NHTSA CAMPAIGN NUMBER: 07V157000 (SERVICE BRAKES, HYDRAULIC), BUT THE DEALER STATED THAT THE RECALL WAS CLOSED ON FEBRUARY 8, 2008. THE MANUFACTURER WAS NOTIFIED AT 800-222-5500, BUT THE CONTACT WAS UNABLE TO SPEAK WITH A REPRESENTATIVE. THE APPROXIMATE FAILURE MILEAGE WAS 58,899.",
        "vin": "4F2CZ94153K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/24/2017",
        "dateOfIncident": "08/20/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11019390,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE DRIVING APPROXIMATELY 20 MPH, A LOUD BOOMING NOISE SUDDENLY CAME FROM THE FRONT OF THE VEHICLE AND THE VEHICLE ABRUPTLY STOPPED. UPON INSPECTION, IT WAS DISCOVERED THAT THE FRONT PASSENGER SIDE SUSPENSION WAS SEVERELY DAMAGED DUE TO RUST AND CORROSION OF THE SUBFRAME. THE CAUSE OF THE FAILURE WAS NOT DIAGNOSED. THE VEHICLE WAS NOT REPAIRED. AN UNKNOWN DEALER WAS NOTIFIED OF THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND THE CONTACT WAS INFORMED THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 14V174000 (SUSPENSION). THE CONTACT STATED THAT THE VEHICLE EXPERIENCED THE SAME FAILURE LISTED IN THE RECALL. THE VIN WAS INVALID. THE FAILURE MILEAGE WAS 35,000.",
        "vin": "4F2CV961X3K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/18/2017",
        "dateOfIncident": "08/17/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11016192,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC FOR  BRAKE SERVICE. THE MECHANIC NOTICED THAT THE FRONT PASSENGER SIDE SUBFRAME CORRODED. THE VEHICLE WAS NOT REPAIRED. THE DEALER WAS NOT CONTACTED. THE CONTACT ALSO STATED THAT THE VEHICLE WAS PREVIOUSLY SERVICED PER NHTSA CAMPAIGN NUMBER: 14V174000 (STRUCTURE); HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 87,402.     UPDATED 11/06/17*LJ    THE VEHICLE WAS REPAIRED. UPDATED 09/05/17*JS",
        "vin": "4F2CZ96133K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/15/2017",
        "dateOfIncident": "04/27/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10985846,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS PREVIOUSLY REPAIRED PER A RECALL PERTAINING TO THE SUBFRAME. WHILE DRIVING, THE FRAME FRACTURED ON THE VEHICLE. THE VEHICLE WAS TOWED TO THE DEALER, BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE MANUFACTURER INFORMED THE CONTACT THAT THEY WERE REQUIRED TO PERFORM THE RECALL REPAIR ONE TIME. THE NHTSA CAMPAIGN NUMBER WAS NOT PROVIDED. THE FAILURE MILEAGE WAS 130,000. UPDATED 07/12/17*LJ",
        "vin": "4F2YZ94133K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/03/2017",
        "dateOfIncident": "07/22/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10983264,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT RECEIVED A RECALL REPAIR FROM THE DEALER CONCERNING THE FRAME, BUT THE NEWLY DESIGNED REINFORCEMENT CROSS-BRACE FAILED TO SUPPORT THE FRAME AND THERE WAS EXTENSIVE RUST AND CORROSION. THE MANUFACTURER WAS NOTIFIED THAT THE RECALL REMEDY FAILED TO PROVIDE A SOLUTION, BUT THEY PROVIDED NO ASSISTANCE. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND WAS UNABLE TO BE DRIVEN. THE VIN, NHTSA CAMPAIGN NUMBER, AND FAILURE MILEAGE WERE NOT AVAILABLE.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "03/22/2017",
        "dateOfIncident": "03/17/2017",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10967692,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT BRAKE HOSE RUPTURED WHEN PULLING INTO A PARKING SPOT (PARKING LOT), RESULTING IN FULL LOSS OF BRAKES. INSPECTION REVEALED EXCESSIVE WEAR OF BOTH FRONT BRAKE HOSES (FROM LINE TO CALIPER), PARTICULARLY IN THE REGION AROUND THE CRIMPED METAL FITTINGS.",
        "vin": "4F2YZ94143K"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/05/2016",
        "dateOfIncident": "12/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10929881,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE PULLING OUT OF A PARKING SPACE, A SCREECHING NOISE STARTED. AN INDEPENDENT MECHANIC DIAGNOSED THAT THE VEHICLE WAS UNABLE TO BE DRIVEN DUE TO SEVERE RUST IN THE SUBFRAME AND SUSPENSION COMPONENTS. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 143,000.",
        "vin": "4F2YZ94183K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/17/2016",
        "dateOfIncident": "08/18/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10926581,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS SO MUCH FRAME ROT THAT IT WILL NOT PASS STATE INSPECTION.  200K MILES, UNACCEPTABLE FOR A 13 YEAR OLD CAR.   I PURCHASED BRAND NEW IN '03 AND HAVE ALWAYS TAKEN STEPS TO GET SALT, ETC., OFF THE UNDERCARRIAGE.",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/06/2016",
        "dateOfIncident": "10/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10914207,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V174000 (STRUCTURE). TO REPLACE THE PART, THE DEALER WOULD NEED TO MANEUVER OTHER COMPONENTS TO ACCESS THE LOCATION NECESSARY TO REPLACE THE PART. SOME PARTS COULD POTENTIALLY FRACTURE TO COMPLETE THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED AND PROVIDED NO SOLUTION OTHER THAN TO COVER THE REMEDY IN THE RECALL REPAIR. THE CONTACT HAD ALREADY EXPERIENCED THE SUBFRAME CRACKING DUE TO EXTENSIVE RUST AND CORROSION SHORTLY AFTER RECEIVING NOTIFICATION OF THE RECALL. THE DEALER WAS AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "4F2YZ94133K"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/26/2016",
        "dateOfIncident": "09/24/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10909602,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL , THE CAR JUST STOP, WONT TAKE FORWARD, THE TRUCK MOVE REVERSE BUT FAILED TO MOVE FORWARD IS STAR WITH NO PROBLEM BUT THE DRIVE DONT WORK AT ALL",
        "vin": "4F2YZ94143K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "06/26/2016",
        "dateOfIncident": "06/22/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10876698,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I START MY CAR UP AN I SEE THE AIR BAG LIGHT FLASHING",
        "vin": "4F2CZ941X3K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/16/2016",
        "dateOfIncident": "06/15/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10874637,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE HAD AN ACCISDENT WITH SUBSTANTIAL FRONT END DAMAGE. NO AIR BAGS DEPLOYED SHE WAS INJURED HIT A TREE",
        "vin": "4F2CZ96153K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/31/2016",
        "dateOfIncident": "09/15/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10852759,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE ENTIRE FRAME ON THE VEHICLE WAS COMPLETELY CORRODED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DEEMED AS UNSAFE TO DRIVE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 160,000.",
        "vin": "4F2CZ96163K"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "03/08/2016",
        "dateOfIncident": "02/21/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 3,
        "odiNumber": 10845568,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "\" TAKATA RECALL\"  IT HAPPENED ON THE TWO LANE HIGHWAY ON BRIGHT SUNNY DAY AT AROUND 1 PM.  CAR DRIFTED THE MIDDLE LANE AND I COULDN'T BRING IT BACK IN THE LANE. I FELT SOMEBODY WAS CONTROLLED THE STEERING WHEEL.   I HOLD THE STEERING WHEEL WITH BOTH HANDS BUT I COULDN'T DIRECT THE CAR. IT DID SWING AROUND 4 TIMES AND HIT THE ON COMING CAR.",
        "vin": "4F2YZ94173K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/24/2016",
        "dateOfIncident": "02/01/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10838434,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE BOTH AIRBAGS WENT OUT.*BF  THE CONSUMER STATED ONLY THE PASSENGER AIR BAG WAS REPLACED. *JB",
        "vin": "4F2CZ94143K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/23/2016",
        "dateOfIncident": "02/19/2016",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10837744,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE DRIVING APPROXIMATELY 25 MPH, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED. THE ENGINE STARTED TO HESITATE AND THE VEHICLE WAS PULLED OVER TO THE SIDE OF THE ROAD. THE CONTACT WAITED A FEW MINUTES TO RESTART THE VEHICLE AND IT PERFORMED NORMALLY. THE VEHICLE WAS TAKEN TO AUTO ZONE TO GET THE FAILURE CODES. THE VEHICLE WAS DRIVEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE IGNITION SWITCH FAILED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VIN WAS INVALID. THE APPROXIMATE FAILURE MILEAGE WAS 114,000.",
        "vin": "64F2YU08132"
    },
    {
        "components": "STRUCTURE,WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/20/2016",
        "dateOfIncident": "12/08/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10821261,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE DRIVING APPROXIMATELY 25 MPH OVER A BUMP, A LOUD NOISE EMITTED FROM THE FRONT END OF THE VEHICLE. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS NOTICED THAT THE FRONT SUBFRAME EXHIBITED EXCESSIVE RUST AND CORROSION. IN ADDITION, THE FRONT PASSENGER SIDE WHEEL WAS PARTIALLY DETACHED FROM THE VEHICLE DUE TO RUST. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 166,000.",
        "vin": "4F2CZ96163K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/07/2016",
        "dateOfIncident": "07/17/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10818586,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V174000 (STRUCTURE)  HOWEVER, THE PART NEEDED TO PERFORM THE REPAIR WAS UNAVIALBE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "4F2YZ94103K"
    },
    {
        "components": "SUSPENSION,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/22/2015",
        "dateOfIncident": "06/01/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10811701,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE DRIVING AT VARIOUS SPEEDS, THE VEHICLE SUDDENLY STALLED. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED AND REPAIRED. THE DIAGNOSTIC RESULTS WERE UNKNOWN. THE FAILURE RECURRED. THE CONTACT STATED THAT THE VEHICLE WAS LEAKING OIL FROM THE LOWER CONTROL ARM AND THE AIR BAG WARNING LIGHT ILLUMINATED. THE CONTACT RECIEVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 14V174000 (STRUCTURE), WHICH STATED THAT THE LOWER CONTROL ARM COULD DETACH AND CAUSE A LOSS OF STEERING CONTROL. THE CONTACT TOOK THE VEHICLE TO THE DEALER AND INFORMED THEM OF THE RECALL. THE VEHICLE WAS NOT REPAIRED AND BECAME INOPERABLE. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 98,000.",
        "vin": "4F2CZ96173K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/13/2015",
        "dateOfIncident": "10/09/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10781578,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE STARTING THE VEHICLE, THE AIR BAG WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL. THE CONTACT STATED THAT THE VEHICLE WAS TAKEN TO THE DEALER ON NUMEROUS OCCASIONS TO BE DIAGNOSED, BUT THE FAILURE COULD NOT BE DETERMINED. THE CONTACT STATED THAT A SEAT BELT CONNECTION WAS REPAIRED TO RECTIFY THE SITUATION; HOWEVER, THE AIR BAG LIGHT ILLUMINATED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "4F2YZ04153K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/17/2015",
        "dateOfIncident": "09/01/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10761577,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE.  CONSUMER WRITES IN REGARDS TO VEHICLE AIRBAG ISSUES.  *SMD  THE CONSUMER WANTED TO KNOW IF HIS VEHICLE WAS ON THE RECALL LIST. *JB",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/24/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10758764,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE DRIVING AT APPROXIMATELY 40 MPH, THE STEERING WHEEL VEERED TO THE RIGHT CAUSING THE VEHICLE TO CRASH INTO A CURB. A POLICE REPORT WAS NOT FILED AND THERE WERE NO INJURIES REPORTED. THE VEHICLE WAS TOWED TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FRONT PASSENGER SIDE SUBFRAME FRACTURED AND NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE VEHICLE WAS PREVIOUSLY REPAIRED UNDER NHTSA CAMPAIGN NUMBER: 14V174000 (STRUCTURE) BUT THE REMEDY FAILED TO PREVENT THE FAILURE. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS APPROXIMATELY 91,800.  MA 10/25/15       *CN",
        "vin": "4F2CZ961X3K"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/15/2015",
        "dateOfIncident": "07/05/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10734348,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRAME OF MY 2003 MAZDA TRIBUTE RUSTED AND BROKE WHILE I WAS DRIVING.  THIS VEHICLE SHOULD HAVE LASTED SEVERAL MORE YEARS AND IF THIS HAD HAPPENED WHEN I WAS GOING FASTER, I COULD HAVE BEEN SERIOUSLY INJURED.",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "AIR BAGS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "06/05/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723968,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE DRIVING AT APPROXIMATELY 55 MPH, THE BRAKES FAILED AND THE AIR BAG LIGHT ILLUMINATED. THE VEHICLE WAS MERGED OVER TO SIDE OF THE ROAD. THE CONTACT WAS AWARE THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 07V157000 (SERVICE BRAKES, HYDRAULIC). THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 202,654.",
        "vin": "4F2CZ96163K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/27/2015",
        "dateOfIncident": "05/25/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10721674,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE SUBFRAME FRACTURED. THE VEHICLE WAS PREVIOUSLY SERVICED UNDER NHTSA CAMPAIGN NUMBER: 14V177000 (EXTERIOR LIGHTING). THE CONTACT FELT THAT THE RECALL REMEDY FAILED TO PREVENT THE FAILURE. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 112,000.",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/14/2015",
        "dateOfIncident": "05/12/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10716570,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE WITH A RECALL THAT MAZDA REFUSED TO REPAIR. THE VEHICLE HAS A RECALL FOR CORROSION TO THE SUB-FRAME RESULTING IN SEPARATION OF THE LOWER CONTROL ARM INCREASING THE RISK OF A CRASH. INSTEAD OF REPLACING RECALLED SUB-FRAME THEY PUT AN INEXPENSIVE BRACE UNDERNEATH THE CORRODED PART FOR THE RECALL. MAZDA SAID IF THE CORRODED PART HASN'T ACTUALLY SNAPPED IN HALF THEN THEY PUT A CHEAP BRACE UNDERNEATH IT. NOW 8 MONTHS LATER THE CORRODED PART SNAPPED IN HALF AND MAZDA SAYS THEY ARE OFF THE HOOK SINCE THEY PUT A CHEAP BRACE UNDER THE CORRODED SUB-FRAME. I HAVE BEEN INFORMED THAT IF THE VEHICLE IS DRIVEN NOW THE WHEELS WILL FALL OFF. HOW CAN THEY JUSTIFY FIXING A RECALL BY INSTALLING A MEANINGLESS SO CALLED BRACE UNDER THE CORRODED PART WHEN IT DOES NOTHING. ONCE THE SUB-FRAME BRAKES THE LOWER CONTROL ARM STILL SEPARATES AND YOU STILL ARE IN RISK OF A CRASH.",
        "vin": "4F2CZ96163K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/26/2015",
        "dateOfIncident": "02/05/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10690857,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. WHILE DRIVING AT AN UNKNOWN SPEED, THE FRONT PASSENGER SIDE SUBFRAME DISENGAGED FROM THE VEHICLE. THE VEHICLE WAS TOWED TO A MECHANIC. THE VEHICLE WAS THEN TAKEN TO A DEALER, WHERE IT WAS DIAGNOSED THAT THE CONTROL AND SUBFRAME NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 58,000.",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/26/2015",
        "dateOfIncident": "09/30/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10660632,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE AIR BAG LIGHT CAME ON AND WOULD NOT GO OUT.  *MW  THE DEALER INFORMED THE CONSUMER, THE CONNECTORS UNDER THE PASSENGER SEAT WERE BAD AND NEEDED TO BE REPLACED. SEVERAL WEEKS LATER, THE AIR BAG LIGHT ILLUMINATED AGAIN AND IT WOULD NOT GO OUT.  THE CONSUMER RETURNED TO THE DEALER, WHERE HE WAS INFORMED THE CONNECTORS UNDER THE DRIVER' SEAT WERE BAD. *JB",
        "vin": "4F2YZ04143K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/24/2015",
        "dateOfIncident": "01/12/2015",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10678678,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT IS STAYING ON, FIRST BLINKING, AND THEN IT STAYS ON FOR ALL OF CAR'S OPERATION.  I FEEL UNSAFE IN THE CAR, NOT KNOWING WHETHER IT WILL DEPLOY WHEN NEEDED OR WHEN NOT NEEDED.  THE CAR IS IN FINE SHAPE, NO ACCIDENTS, AND THERE APPEAR TO BE A NUMBER OF COMPLAINTS ABOUT THIS ISSUE, AS WELL AS FRUSTRATION WITH THE INADEQUATE AND EXPENSIVE REPAIRS PEOPLE HAVE HAD TO DO TO GET THEIR AIR BAG LIGHT ISSUE ADDRESSED.  SHOULDN'T THIS BE A FORMAL RECALL TO COINCIDE WITH THE BULLETIN ISSUED RELATING TO IT?  *TR",
        "vin": "4F2YZO4133K"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "11/07/2014",
        "dateOfIncident": "06/03/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10653470,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD TO STOP SUDDEN...NO SKID...AND BRAKES WERE SPONGY AND HAD TO USE EMERGENCY BRAKE TO INSURE STOP IN TIME TO PREVENT A FENDER BENDER.  STOPPING IS NOT GREAT AND STICK FOR A SECOND OR TWO AT STOP SIGNS.   *TR",
        "vin": "4F2YZ94133K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/31/2014",
        "dateOfIncident": "10/01/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10651582,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT REMAINED. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "4F2CZ96153K"
    },
    {
        "components": "STEERING,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "07/24/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631498,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE MADE ABNORMALLY LOUD SOUNDS WHEN STARTED AND WHILE DRIVING. THE SOUNDS BEGAN AFTER THE VEHICLE WAS REPAIRED ACCORDING TO NHTSA CAMPAIGN NUMBER: 14V174000 (STRUCTURE: FRAME AND MEMBERS). THE DEALER STATED THAT THE EXHAUST BOLTS WERE NOT TIGHTENED AND THE FRONT DRIVER SIDE TIE ROD END WAS LOOSE. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 117,685.",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/08/2014",
        "dateOfIncident": "08/06/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631602,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT WAS INFORMED BY THE DEALER THAT THE ENTIRE FRONT END OF THE VEHICLE NEEDED TO BE REPLACED DUE TO CORROSION. THE CONTACT STATED THAT THE FAILURE CAUSED MORE DAMAGE TO THE VEHICLE THAT IS NOT COVERED BY NHTSA CAMPAIGN NUMBER: 14V174000 (SUSPENSION). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 79,000.",
        "vin": "4F2YZ04133K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/29/2014",
        "dateOfIncident": "06/01/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617120,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN NUMBER: 12V357000 (ENGINE AND ENGINE COOLING, VEHICLE SPEED CONTROL); HOWEVER, THE PART FOR THE REPAIR WAS UNAVAILABLE. THE MANUFACTURER WAS NOTIFIED. THE CONTACT HAD NOT EXPERIENCED A FAILURE.",
        "vin": "4F2YU08102K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/17/2014",
        "dateOfIncident": "07/08/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10611220,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "COIL FAILURE, REPLACED AND SAME COIL FAILURES REOCCUR.   PCM FAILURE CAUSING COIL FAILURE.  *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "STEERING,SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/02/2014",
        "dateOfIncident": "02/22/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10607765,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE VEHICLE WAS REPAIRED ACCORDING TO NHTSA CAMPAIGN NUMBER: 04V583000 (VEHICLE SPEED CONTROL), BUT THE FAILURE RECURRED. THE CONTACT EXPERIENCED NO FAILURES WITH THE VEHICLE PRIOR TO THE RECALL REPAIR. AFTER THE REPAIR, THE CONTACT HEARD AN INTERMITTENT SQUEAKING SOUND COMING FROM THE STEERING WHEEL. IN ADDITION, THE STEERING WHEEL WAS EXTREMELY DIFFICULT TO TURN. THE DEALER WAS NOTIFIED SEVERAL TIMES AND STATED THAT THE COIL SPRING NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED AGAIN AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 5,000.",
        "vin": "4F2CZ94133K"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/26/2014",
        "dateOfIncident": "05/26/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10594144,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RIGHT FRONT WHEEL FOLDED BACK AND UNDER VEHICLE. WAS ABLE TO JUST GET OFF ROADWAY. VEHICLE IS NOW UNUSABLE AS THE FRONT CROSS MEMBER HAS RUSTED AWAY AND ALLOWED FRONT SUSPENSION TO COLLAPSE (INCLUDING THE  ENGINE AND TRANSMISSION).  *TR",
        "vin": "4F2YZ94173K"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "04/29/2014",
        "dateOfIncident": "04/19/2014",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10585585,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE JUST PURCHASED THIS CAR USED FOR MY MOTHER IN LAW THE DAY BEFORE.  I WAS EXITING EXPRESSWAY RAMP AND I CAME TO A LIGHT.  WHEN I TOOK MY FOOT OFF THE ACCELERATOR THE CAR SURGED.  I STARTED HITTING THE BRAKES BUT THE CAR CONTINUED TO ACCELERATE.  I PUSHED CAR IN NEUTRAL AND APPLIED BRAKES TO STOP CAR.  I WAS IN THE MIDDLE OF TRAFFIC.  I STARTED CAR AND IT IMMEDIATELY ACCELERATED TO 3000 RPM WHILE IN PARK.  I TURNED IT BACK OFF AND ON AGAIN AND IT DID THE SAME THING.  I CALLED FOR A TOW AND HAD IT TOWED TO THE DEALER.  I RESEARCHED PROBLEM ONLINE AND SAW THE RECALLS FOR THE TRIBUTE.  I FIGURED IT HADN'T BEEN DONE YET.  ON MONDAY THE SERVICE DEPT. OPENED AND THEY SAID WHEN THEY STARTED VEHICLE IT REVVED UP TO 3000 RPM.  THEY WERE ABLE TO  GET VEHICLE TO STOP ACCELERATING.  THEY LOOKED UP VEHICLE AND SAW THAT IT ALREADY HAD THE SUDDEN ACCELERATION RECALL WORK COMPLETED.  CAR WAS THERE FOR 3 DAYS AS THEY CHECKED EVERYTHING ON VEHICLE AS WELL AS DROVE IT TO SEE IF IT WOULD REPEAT THE PROBLEM. THEY EVENTUALLY TOOK IAC VALVE OFF, CLEANED IT AND LET IT SIT OVERNIGHT IN CLEANER ALONG WITH CLEANING THE THROTTLE BODY.  THEY COULD NOT GET VEHICLE TO REPEAT ACCELERATION AFTER WORK WAS COMPLETED.  I BELIEVE RECALL ISSUE IS STILL NOT FIXED.",
        "vin": "4F2YZ94183K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/09/2014",
        "dateOfIncident": "04/08/2014",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10578459,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT AFTER DRIVING THE VEHICLE FOR 15 MINUTES, SHE DROVE IT INTO A DRIVE WAY AND AFTER SHIFTING INTO PARK THE BRAKE LIGHT ILLUMINATED. THE CONTACT STATED THAT SHE SHIFTED INTO DRIVE AND BACK TO PARK TO SEE IF THE VEHICLE WOULD RESET ITSELF BUT THE ABS LIGHT ILLUMINATED FOR 3 SECONDS AND SHUT OFF. THE CONTACT TURNED THE VEHICLE OFF AND EXIT THE VEHICLE.  THE CONTACT STATED THAT ABOUT AN HOUR AND A HALF LATER, SHE WAS INFORMED THAT THE VEHICLE WAS ENGULFED IN FLAMES. THE FIRE DEPARTMENT WAS NOTIFIED AND EXTINGUISHED THE FIRE. THE FIRE DEPARTMENT FILED A REPORT AND STATED THAT THE FIRE WAS MECHANICAL AND CONFIRMED THAT THE VEHICLE HAD BEEN  ON FIRE FOR A LEAST AN HOUR. THE VEHICLE WAS DESTROYED. THERE WERE NO INJURIES. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT INSPECTED. THE FAILURE MILEAGE WAS 147,000.",
        "vin": "4F2CZ96123K"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "01/30/2014",
        "dateOfIncident": "12/20/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562271,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "COOPER",
                "productModel": "COOPER DISCOVERER CTS",
                "productYear": "9999",
                "size": "215/70R16",
                "type": "Tire"
            }
        ],
        "summary": "TIRE FAILURE AT 75 MPH - COOPER DISCOVERER CTS 215/70R16 RADIAL MOUNTED ON A 2003 MAZDA TRIBUTE DX.   THE TIRE DISINTEGRATED WITHIN A COUPLE OF SECONDS AFTER PROLONGED DRIVING AT 70 TO 75 MPH ON THE FLORIDA TURNPIKE.  THE TIRE HAD  ONLY 15,000 MILES - DURING WHICH THE TIRE WAS PROPERLY INFLATED AND ROTATED.  *TR",
        "vin": "4F2YZ02B63K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/07/2013",
        "dateOfIncident": "12/07/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10555177,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE  AIRBAG ALERT LIGHT COMES ON ONCE ENGINE IS STARTED. IT FLASHES UP TO SIX FLASHES AND THEN REMAINS ON IN A STEADY MANNER.  *TR",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "10/14/2013",
        "dateOfIncident": "04/22/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547842,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TIRES BEGAN MAKING EXTREMELY LOUD ROAD NOISE ABOVE 30 MPH.  I WAS TOLD AT THE TIME THAT THE TIRES WERE \"CUPPED\" PROBABLY THE RESULT OF DEFECTIVE TIRES.  I HAD THE MAZDA 2003 TRIBUTE SERVICED AT THE LOCAL DEALERSHIP, \"JAY MAZDA\" IN COLUMBUS, GA AND THE TIRES WERE REPLACED AT APPROXIMATELY 84978 MILES ON THE VEHICLE ON 04-22-11.  AROUND APPROX 112000 MILES ON THE VEHICLE I BEGAN EXPERIENCING THE SAME ROAD NOISE I HAD EXPERIENCED EARLIER ON 04-22-2011.  I BEGAN HEARING THE LOUD ROAD NOISE AGAIN.  I AGAIN HAD MY MAZDA 2003 TRIBUTE SERVICED AT \"JAY MAZDA\" IN COLUMBUS, GA ON 08-31-2013 AT APPROXIMATELY 114190 MILES WHERE I HAD MY OIL CHANGED, BRAKES REPLACED , & SPOKE WITH THE MAZDA TECH ABOUT THE EXTREMELY LOUD ROAD NOISE I WAS AGAIN EXPERIENCING SINCE I PURCHASED THE TIRES ON THE VEHICLE FROM JAY MAZDA ON 04-22-2011 FOR THE SAME TROUBLE.  UPON PICKING UP MY VEHICLE THE TECHNICIAN TOLD ME THAT MY TIRES WERE AGAIN \"CUPPED\" AND THAT WAS WHAT WAS CAUSING THE LOUD VEHICLE NOISE AND THEY WERE \"CUPPED\" DUE TO ME NOT HAVING MY TIRES ROTATED AT THE PROPER INTERVAL.  I TOLD THE TECHNICIAN THAT I NEVER EXPERIENCED THE NOISE UNTIL SOMETIME AFTER HAVING THE TIRES ROTATED THE 1ST TIME.  THE TECHNICIAN SAID HE FOUND NO PROBLEMS WITH THE VEHICLES SUSPENSION THAT \"LACK\" OF ROTATION WAS THE ONLY CAUSE.  I BELIEVE THAT THERE IS A PROBLEM WITH THE REAR SUSPENSION THAT CAUSES THE REAR TIRES ON MAZDA 2003 TRIBUTES TO \"CUP\" & THAT ROTATION OF THE TIRES ONLY WORSENS THE PROBLEM. I BELIEVE THIS BECAUSE THE MAZDA TECHNICIAN TOLD ME THAT IF I HAD MY TIRES ROTATED NOW THAT THE NOISE WOULD ONLY GET \"WORSE\".  *TR",
        "vin": "4F2YZ04113K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/14/2013",
        "dateOfIncident": "10/10/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10547843,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SHORTLY AFTER STARTING MY MAZDA 2003 TRIBUTE ON 10-10-2013 AT APPROXIMATELY:30 PM, AFTER ABOUT 1 MILE OF TRAVELING,MY AIR BAG INDICATOR LIGHT BEGAN TO FLASH ON THE DASHBOARD & SHORTLY THEREAFTER STAYED ON SOLID WITHOUT FLASHING. EACH TIME I HAVE USED MY VEHICLE SINCE THAT DATE I EXPERIENCE THE SAME TROUBLE WITH THE AIR BAG INDICATOR LIGHT INITIALLY FLASHING AND THEN STAYING ON STEADY THROUGHOUT THE DURATION TRAVELING FROM LOCATION TO LOCATION.  *TR",
        "vin": "4F2YZ04113K"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "09/16/2013",
        "dateOfIncident": "09/07/2013",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543849,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE THE VEHICLE WAS PARKED, SMOKE WAS SEEN COMING FOR UNDER THE HOOD. THE CONTACT OPENED THE HOOD TO ALLOW THE SMOKE TO EXIT AND CALLED A TOW TRUNK. THE TOW TRUCK DRIVER STATED THAT THE VEHICLE WAS SAFE TO DRIVE HOWEVER, WHEN THE CONTACT STARTED THE VEHICLE, THE CHECK ENGINE AND THE ABS WARNING LIGHTS WERE ILLUMINATED. THE CONTACT DROVE THE VEHICLE AND PARKED THE VEHICLE AGAIN. THE VEHICLE WAS ON FIRE AND DESTROYED THE VEHICLE. THE FIRE DEPARTMENT WAS CALLED TO EXTINGUISH THE FIRE. THE FIRE DEPARTMENT DID NOT STATE WHAT CAUSED THE FIRE. THE CONTACT CALLED THE MANUFACTURER TO FILE A REPORT. THE MANUFACTURER STATED THEY WOULD NOT TAKE A REPORT UNTIL THERE WAS A FIRE REPORT ISSUED THAT STATED WHAT CAUSED THE FIRE. THE CONTACT DID NOT HAVE A REPORT OF WHAT CAUSED THE FIRE. THE FAILURE MILEAGE WAS 139,000.",
        "vin": "4F2CZ04163K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/23/2013",
        "dateOfIncident": "07/07/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536975,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE SUBFRAME ON MY 2003 MAZDA TRIBUTE V6 ROTTED THROUGH ON THE PASSENGER SIDE.  I WAS COMING TO A STOP AT AN INTERSECTION AND THE SUBFRAME BROKE, SENDING THE PASSENGER FRONT WHEEL AGAINST THE BACK OF THE WHEEL WELL.  THE TRIBUTE WAS UNDRIVEABLE AND I HAD TO GET IT TOWED TO A REPAIR SHOP.  THE MECHANIC SAID THAT WITH THE LOW NUMBER OF MILES AND CONDITION OF MY CAR, THAT THE SUBFRAME SHOULD NOT HAVE ROTTED THROUGH LIKE THIS.  THE SUBFRAME ALSO HOLDS UP THE ENGINE OF THE VEHICLE.  THIS SHOULD NOT HAVE TO BE REPLACED ON A 10 YEAR OLD CAR.  *TR",
        "vin": "4F2CZ96183K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/23/2013",
        "dateOfIncident": "07/05/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10526298,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY FRONT SIDE PASSENGER SUBFRAME MUST HAVE BEEN ROTTED AS OPPOSED TO RUSTED.  PLEASE VOICE YOUR COMPLAINT IF ANYONE ELSE HAS HAD A SIMILAR ISSUE. MY PREVIOUS COMPLAINT WAS THE SAME ISSUE AS ...    DATE COMPLAINT FILED: 02/15/2013   COMPONENT(S): STRUCTURE   DATE OF INCIDENT: 11/14/2012  NHTSA ID NUMBER: 10498267  ALL PRODUCTS ASSOCIATED WITH THIS COMPLAINT    VEHICLE MAKEMODELMODEL YEAR(S)  ?MAZDATRIBUTE2003  DETAILS    0 ASSOCIATED DOCUMENTS   ?CRASH:NO  ?FIRE:NO  ?NUMBER OF INJURIES:0  ?NUMBER OF DEATHS:0  MANUFACTURER: MAZDA MOTOR CORP  VEHICLE IDENTIFICATION NO. (VIN): NOT AVAILABLE  SUMMARY:  I HAVE A 2003 MAZDA TRIBUTE V6. AFTER TAKING THE VEHICLE IN FOR A RECALL, THEY NOTICED THAT MY FRONT PASSENGER SIDE SUBFRAME WAS ROTTED. THE DRIVERS SIDE IS FINE. THE EXHAUST GOES THRU THAT AREA - IT APPEARS THAT THE HEAT FROM THE EXHAUST CAUSED THE PAINT ON THE SUBFRAME TO 'BURN' OFF AND THUS ALLOW IT TO BE EXPOSED TO THE ELEMENTS AND ROT. I HAVE READ OTHER CASES OF THIS SAME THING HAPPENING TO OTHER PEOPLE WITH THIS VEHICLE. THERE ARE OTHER MANUFACTURERS WHO HAVE RECALLS ON THIS SAME ITEM FOR THEIR VEHICLES - WHY DOESN'T MAZDA? IT IS NOT AN EASY OR CHEAP FIX! *TR",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/18/2013",
        "dateOfIncident": "07/05/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10525636,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 MAZDA TRIBUTE SUBFRAME SNAPPED AFTER 9-10 YEARS OF OWNING THE VEHICLE.  WHEN THAT HAPPENED MY WIFE IMMEDIATELY PULLED INTO A MERLIN AND THEY INFORMED HER WE CANNOT DRIVE THE VEHICLE OUT OF THERE OR IT WOULD BREAK ALL THE WAY THROUGH.  WE WERE INFORMED WE HAVE UNTIL THE END OF THE UPCOMING MONDAY TO HAVE IT TOWED OUT OF THERE.  WE HAD IT TOWED AND WERE GIVEN $220 DOLLARS FOR THE TRIBUTE.  THE SUBFRAME COMPLETELY SNAPPED ALL THE WAY THROUGH WHILE THE TOW TRUCK EMPLOYEE TURNED THE WHEEL.  I'M CONCERNED BECAUSE MY WIFE WAS DRIVING MY TRIBUTE WITH MY SON IN THE CAR.  IT SEEMS DANGEROUS HAVING THE SUBFRAME WOULD RUST AND BREAK WITHIN A TIMEFRAME THAT SOMEONE WOULD TYPICALLY OWN A VEHICLE. ESPECIALLY WITH MY WIFE AND SON IN THE VEHICLE. IS THIS A FREAK OF NATURE INCIDENT OR IS THIS SOMETHING THAT WOULD BE CONSIDERED MANUFACTURER ERROR.  *TR",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522641,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE  25, 2013 @ 11:00AM I CALLED MAZDA CORPORATION (REFERENCE CALL NUMBER: [XXX]) ABOUT RECALLS ASSOCIATED WITH MY MAZDA TRIBUTE 2003 AND WAS TOLD THAT THE RECALLS WERE NOT ASSIGNED TO THE VIN NUMBER OF MY VEHICLE. THE MAZDA REPRESENTATIVE STATED THAT ONLY THE SEAT BEAT ADJUSTMENT HAS BEEN ASSIGNED TO MY VEHICLE AND THAT I DO NOT QUALIFY FOR THE RECALL. MAZDA WILL NOT HONOR THE RECALL. I BOUGHT THE TRIBUTE IN 2010 FROM A DEALERSHIP; THUS, WAS NOT AWARE OF THE RECALLS. I HAVE BEEN HAVING A LOT OF PROBLEMS WITH THE VEHICLE AND HAVE SPENT A LOT OF MONEY TRYING TO FIX IT. I HAVE A 13 AND 14 YEAR OLD GIRLS AND AM A SINGLE PARENT. ACCORDING TO THE RECALL, THE VEHICLE IS NOT SAFE. I CAN NOT AFFORD RIGHT NOW TO PURCHASE ANOTHER VEHICLE. I AM ONLY ASKING MAZDA TO HONOR THE RECALLS. PLEASE SEE THE RECALL NOTICE BELOW FROM MAZDA.        2003 MAZDA TRIBUTE RECALL  ITEM AFFECTED: SERVICE BRAKES, HYDRAULIC:ANTILOCK:CONTROL UNIT/MODULE   DATE ANNOUNCED: 4/11/2007    DESCRIPTION OF RECALL:  ON CERTAIN SPORT UTILITY VEHICLES EQUIPPED WITH ANTILOCK BRAKES (ABS), THE ABS MODULE CONNECTOR MAY HAVE MISSING OR DISLODGED WIRE SEALS. THIS CONDITION COULD ALLOW CONTAMINATION TO ENTER THE MODULE CONNECTOR, CREATING A POTENTIAL FOR AN ELECTRICAL SHORT.     ACTION NEEDED TO FIX IT:  DEALERS WILL INSPECT THE WIRE HARNESS CONNECTOR TO THE ABS MODULE FOR MISSING OR DISLODGED WIRE SEALS, AND REPAIR OR REPLACE THE HARNESS CONNECTOR AS APPROPRIATE. THE DEALER WILL ALSO INSPECT THE CONNECTOR ON THE ABS MODULE AND REPLACE IT IF IT IS FOUND TO BE CORRODED OR DAMAGED. THE RECALL BEGAN ON MAY 9, 2007. OWNERS MAY CONTACT MAZDA AT 1-800-222-5500.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)*TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "06/11/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522663,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 25, 2013 @ 11:00AM I CALLED MAZDA CORPORATION (REFERENCE CALL NUMBER:[XXX]) ABOUT RECALLS ASSOCIATED WITH MY MAZDA TRIBUTE 2003 AND WAS TOLD THAT THE RECALLS WERE NOT ASSIGNED TO THE VIN NUMBER OF MY VEHICLE. THE MAZDA REPRESENTATIVE STATED THAT ONLY THE SEAT BEAT ADJUSTMENT HAS BEEN ASSIGNED TO MY VEHICLE AND THAT I DO NOT QUALIFY FOR THE RECALL. MAZDA WILL NOT HONOR THE RECALL. I BOUGHT THE TRIBUTE IN 2010 FROM A DEALERSHIP; THUS, WAS NOT AWARE OF THE RECALLS. I HAVE BEEN HAVING A LOT OF PROBLEMS WITH THE VEHICLE AND HAVE SPENT A LOT OF MONEY TRYING TO FIX IT. I HAVE A 13 AND 14 YEAR OLD GIRLS AND AM A SINGLE PARENT. ACCORDING TO THE RECALL, THE VEHICLE IS NOT SAFE. I CANNOT AFFORD RIGHT NOW TO PURCHASE ANOTHER VEHICLE. I AM ONLY ASKING MAZDA TO HONOR THE RECALLS. PLEASE SEE THE RECALL NOTICE BELOW FROM MAZDA.     2003 MAZDA TRIBUTE RECALL  ITEM AFFECTED: VEHICLE SPEED CONTROL:CABLES  DATE ANNOUNCED: 7/27/2012    DESCRIPTION OF RECALL:  MAZDA IS RECALLING CERTAIN MODEL YEAR 2001 THROUGH 2006, AND 2008, TRIBUTE VEHICLES EQUIPPED WITH 3.0L V6 ENGINES AND SPEED CONTROL. INADEQUATE CLEARANCE BETWEEN THE ENGINE COVER AND THE SPEED CONTROL CABLE CONNECTOR COULD RESULT IN A STUCK THROTTLE WHEN THE ACCELERATOR PEDAL IS FULLY OR ALMOST-FULLY DEPRESSED. THIS RISK EXISTS REGARDLESS OF WHETHER OR NOT SPEED CONTROL (CRUISE CONTROL) IS USED.    ACTION NEEDED TO FIX IT:  MAZDA WILL NOTIFY OWNERS, AND DEALERS WILL REPAIR THE VEHICLES BY INCREASING THE ENGINE COVER CLEARANCE, FREE OF CHARGE. REMEDY PARTS ARE NOW AVAILABLE. THE SAFETY RECALL BEGAN ON SEPTEMBER 13, 2012. OWNERS MAY CONTACT MAZDA CUSTOMER ASSISTANCE CENTER AT 1-800-222-5500, OPTION #6.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "04/15/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522648,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 25, 2013 @ 11:00AM I CALLED MAZDA CORPORATION (REFERENCE CALL NUMBER:[XXX]) ABOUT RECALLS ASSOCIATED WITH MY MAZDA TRIBUTE 2003 AND WAS TOLD THAT THE RECALLS WERE NOT ASSIGNED TO THE VIN NUMBER OF MY VEHICLE. THE MAZDA REPRESENTATIVE STATED THAT ONLY THE SEAT BEAT ADJUSTMENT HAS BEEN ASSIGNED TO MY VEHICLE AND THAT I DO NOT QUALIFY FOR THE RECALL. MAZDA WILL NOT HONOR THE RECALL. I BOUGHT THE TRIBUTE IN 2010 FROM A DEALERSHIP; THUS, WAS NOT AWARE OF THE RECALLS. I HAVE BEEN HAVING A LOT OF PROBLEMS WITH THE VEHICLE AND HAVE SPENT A LOT OF MONEY TRYING TO FIX IT. I HAVE A 13 AND 14 YEAR OLD GIRLS AND AM A SINGLE PARENT. ACCORDING TO THE RECALL, THE VEHICLE IS NOT SAFE. I CAN NOT AFFORD RIGHT NOW TO PURCHASE ANOTHER VEHICLE. I AM ONLY ASKING MAZDA TO HONOR THE RECALLS. PLEASE SEE THE RECALL NOTICE BELOW FROM MAZDA. 2003 MAZDA TRIBUTE RECALL  ITEM AFFECTED: SERVICE BRAKES, HYDRAULIC:FOUNDATION COMPONENTS:MASTER CYLINDER  DATE ANNOUNCED: 3/29/2007    DESCRIPTION OF RECALL:  CERTAIN CARDONE MASTER CYLINDERS WITH PART NUMBERS 10-2925, 10-2987, 10-2987MZA, 10-3083, 11-3015, 11-3042, 11-3044, 11-3045, 11-3047, 11-3064, AND 11-3156, AND WITH DATE CODES LOWER THAN DCA7078 SOLD AS REPLACEMENT EQUIPMENT FOR USE ON THE VEHICLES LISTED ABOVE. THE SEAL ON MASTER CYLINDER CAN FAIL AND LEAK BRAKE FLUID.    ACTION NEEDED TO FIX IT:  CARDONE WILL NOTIFY OWNERS AND OFFER TO REPURCHASE ANY DEFECTIVE MASTER CYLINDERS. THE RECALL BEGAN DURING APRIL 2007. OWNERS CAN CONTACT CARDONE AT 1-800-777-4780.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "06/10/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522653,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 25, 2013 @ 11:00AM I CALLED MAZDA CORPORATION (REFERENCE CALL NUMBER: [XXX]) ABOUT RECALLS ASSOCIATED WITH MY MAZDA TRIBUTE 2003 AND WAS TOLD THAT THE RECALLS WERE NOT ASSIGNED TO THE VIN NUMBER OF MY VEHICLE. THE MAZDA REPRESENTATIVE STATED THAT ONLY THE SEAT BEAT ADJUSTMENT HAS BEEN ASSIGNED TO MY VEHICLE AND THAT I DO NOT QUALIFY FOR THE RECALL. MAZDA WILL NOT HONOR THE RECALL. I BOUGHT THE TRIBUTE IN 2010 FROM A DEALERSHIP; THUS, WAS NOT AWARE OF THE RECALLS. I HAVE BEEN HAVING A LOT OF PROBLEMS WITH THE VEHICLE AND HAVE SPENT A LOT OF MONEY TRYING TO FIX IT. I HAVE A 13 AND 14 YEAR OLD GIRLS AND AM A SINGLE PARENT. ACCORDING TO THE RECALL, THE VEHICLE IS NOT SAFE. I CANNOT AFFORD RIGHT NOW TO PURCHASE ANOTHER VEHICLE. I AM ONLY ASKING MAZDA TO HONOR THE RECALLS. PLEASE SEE THE RECALL NOTICE BELOW FROM MAZDA.     ITEM AFFECTED: ENGINE AND ENGINE COOLING  DATE ANNOUNCED: 7/27/2012    DESCRIPTION OF RECALL:  MAZDA IS RECALLING CERTAIN MODEL YEAR 2001 THROUGH 2006, AND 2008, TRIBUTE VEHICLES EQUIPPED WITH 3.0L V6 ENGINES AND SPEED CONTROL. INADEQUATE CLEARANCE BETWEEN THE ENGINE COVER AND THE SPEED CONTROL CABLE CONNECTOR COULD RESULT IN A STUCK THROTTLE WHEN THE ACCELERATOR PEDAL IS FULLY OR ALMOST-FULLY DEPRESSED. THIS RISK EXISTS REGARDLESS OF WHETHER OR NOT SPEED CONTROL (CRUISE CONTROL) IS USED.    ACTION NEEDED TO FIX IT:  MAZDA WILL NOTIFY OWNERS, AND DEALERS WILL REPAIR THE VEHICLES BY INCREASING THE ENGINE COVER CLEARANCE, FREE OF CHARGE. REMEDY PARTS ARE NOW AVAILABLE. THE SAFETY RECALL BEGAN ON SEPTEMBER 13, 2012. OWNERS MAY CONTACT MAZDA CUSTOMER ASSISTANCE CENTER AT 1-800-222-5500, OPTION #6.       INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "06/17/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522667,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 25, 2013 @ 11:00AM I CALLED MAZDA CORPORATION (REFERENCE CALL NUMBER: [XXX]) ABOUT RECALLS ASSOCIATED WITH MY MAZDA TRIBUTE 2003 AND WAS TOLD THAT THE RECALLS WERE NOT ASSIGNED TO THE VIN NUMBER OF MY VEHICLE. THE MAZDA REPRESENTATIVE STATED THAT ONLY THE SEAT BEAT ADJUSTMENT HAS BEEN ASSIGNED TO MY VEHICLE AND THAT I DO NOT QUALIFY FOR THE RECALL. MAZDA WILL NOT HONOR THE RECALL. I BOUGHT THE TRIBUTE IN 2010 FROM A DEALERSHIP; THUS, WAS NOT AWARE OF THE RECALLS. I HAVE BEEN HAVING A LOT OF PROBLEMS WITH THE VEHICLE AND HAVE SPENT A LOT OF MONEY TRYING TO FIX IT. I HAVE A 13 AND 14 YEAR OLD GIRLS AND AM A SINGLE PARENT. ACCORDING TO THE RECALL, THE VEHICLE IS NOT SAFE. I CANNOT AFFORD RIGHT NOW TO PURCHASE ANOTHER VEHICLE. I AM ONLY ASKING MAZDA TO HONOR THE RECALLS. PLEASE SEE THE RECALL NOTICE BELOW FROM MAZDA:     2003 MAZDA TRIBUTE RECALL  ITEM AFFECTED: POWER TRAIN:AUTOMATIC TRANSMISSION:CONTROL MODULE (TCM, PCM)  DATE ANNOUNCED: 4/14/2004    DESCRIPTION OF RECALL:    ON CERTAIN SPORT UTILITY VEHICLES EQUIPPED WITH 3.0L V6 DURATEC ENGINES , DURING DECELERATION, THE ENGINE CAN STALL.     ACTION NEEDED TO FIX IT:  DEALERS WILL REPROGRAM THE POWER CONTROL MODULE (PCM) WITH THE APPROPRIATE CALIBRATION. THE RECALL BEGAN ON MAY 3, 2004. OWNERS SHOULD CONTACT MAZDA AT 1-800-222-5500.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "07/01/2013",
        "dateOfIncident": "06/24/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522671,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON JUNE 25, 2013 @ 11:00AM I CALLED MAZDA CORPORATION (REFERENCE CALL NUMBER: [XXX]) ABOUT RECALLS ASSOCIATED WITH MY MAZDA TRIBUTE 2003 AND WAS TOLD THAT THE RECALLS WERE NOT ASSIGNED TO THE VIN NUMBER OF MY VEHICLE. THE MAZDA REPRESENTATIVE STATED THAT ONLY THE SEAT BEAT ADJUSTMENT HAS BEEN ASSIGNED TO MY VEHICLE AND THAT I DO NOT QUALIFY FOR THE RECALL. MAZDA WILL NOT HONOR THE RECALL. I BOUGHT THE TRIBUTE IN 2010 FROM A DEALERSHIP; THUS, WAS NOT AWARE OF THE RECALLS. I HAVE BEEN HAVING A LOT OF PROBLEMS WITH THE VEHICLE AND HAVE SPENT A LOT OF MONEY TRYING TO FIX IT. I HAVE A 13 AND 14 YEAR OLD GIRLS AND AM A SINGLE PARENT. ACCORDING TO THE RECALL, THE VEHICLE IS NOT SAFE. I CANNOT AFFORD RIGHT NOW TO PURCHASE ANOTHER VEHICLE. I AM ONLY ASKING MAZDA TO HONOR THE RECALLS. PLEASE SEE THE RECALL NOTICE BELOW FROM MAZDA:     2003 MAZDA TRIBUTE RECALL  ITEM AFFECTED: LATCHES/LOCKS/LINKAGES:HATCHBACK/LIFTGATE:LOCK  DATE ANNOUNCED: 12/23/2004    DESCRIPTION OF RECALL:  CERTAIN 2004-2005 SPORT UTILITY VEHICLES AND CERTAIN 2001-2003 SPORT UTILITY VEHICLE HAVING REAR LIFTGATE COMPONENTS SERVICED WITH 2004 EQUIVALENT COMPONENTS FAIL TO COMPLY WITH THE REQUIREMENTS OF FEDERAL MOTOR VEHICLE SAFETY STANDARD NO. 206, 'DOOR LOCKS AND DOOR RETENTION COMPONENTS.' THE REAR LIFTGATE LATCHING SYSTEM DOES NOT MEET THE INERTIA LOAD REQUIREMENT IN ONE DIRECTION.    ACTION NEEDED TO FIX IT:  DEALERS WILL REPLACE THE REAR LIFTGATE LATCH RELEASE ROD, THE RELEASE ROD ATTACHMENT CLIP AND THE DOOR HANDLE RETURN SPRING. THE RECALL BEGAN ON MARCH 31, 2005. OWNERS SHOULD CONTACT MAZDA AT 1-800-222-5500.     INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "VISIBILITY,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "06/25/2013",
        "dateOfIncident": "04/11/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10521674,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON MAY 11, 2013 MY WINDSHIELD WIPERS STOP WORKING DURING RAINY STORMING DAY. AT FIRST THE WIPERS SLOWED DOWN AND WOULD MOVE EVERY 5 TO 10 MINUTES; THUS, THEY STOPPED COMPLETELY. I HAD A HOUR AND HALF COMMUTE HOME BEFORE I COULD PARK THE VEHICLE. THINKING THAT IT WAS THE WIPER THAT NEED TO BE REPLACED, I HAD A MECHANIC TO LOOK AT IT; HOWEVER, IT WAS DISCOVERED THAT THE WINDSHIELD WIPER LINKAGE WAS BROKEN IN HALF. I CALLED MAZDA ABOUT THE RECALL ON IT THE ITEM AND WAS TOLD THAT THE RECALL DOES NOT APPLY TO MY VIN NUMBER. MAZDA WILL NOT REPAIR THE PROBLEM. THE RECALL WAS FOR 2003 MAZDA TRIBUTE HOWEVER MAZDA STATES THAT IT DOES NOT APPLY TO MY 2003 VIN NUMBER. PLEASE ASSIST.      ITEM AFFECTED: VISIBILITY:WINDSHIELD WIPER/WASHER:LINKAGES  DATE ANNOUNCED: 11/29/2000    DESCRIPTION OF RECALL:  VEHICLE DESCRIPTION: SPORT UTILITY VEHICLES. THE WINDSHIELD WIPER LINKAGE CAN DISENGAGE DUE TO A BROKEN BALL SOCKET.   ACTION NEEDED TO FIX IT:  DEALERS WILL INSPECT AND, IF NECESSARY, REPLACE THE WIPER MODULE.01.  *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/09/2013",
        "dateOfIncident": "06/06/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10511224,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT AFTER STARTING THE IGNITION, THE AIR BAG WARNING INDICATOR ILLUMINATED CONTINUOUSLY UNTIL THE ENGINE WAS TURNED OFF. WHENEVER THE ENGINE WAS OPERABLE THE FAILURE OCCURRED. THE VEHICLE HAD NOT BEEN DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE FAILURE MILEAGE WAS UNAVAILABLE.",
        "vin": "4F2YZ941X3K"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "04/19/2013",
        "dateOfIncident": "03/23/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10508786,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE PARKED, HE NOTICED THAT THE FRONT DRIVER'S SIDE SEAT BELT WOULD NOT LATCH. ADDITIONALLY, THE SEAT BELT COULD NOT BE UNLATCHED. THE VEHICLE WAS TAKEN TO THE DEALER FOR DIAGNOSIS. THE TECHNICIAN STATED THAT THE SEAT BELT BUCKLE WOULD HAVE TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 90,000.   *TR",
        "vin": "4F2YZ04113K"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/11/2013",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10505961,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE TRAVELING 20 MPH, THE REAR OF THE VEHICLE WAS CRASHED INTO BY ANOTHER VEHICLE. UPON IMPACT, THE HATCH OPENED INADVERTENTLY. THE CONTACT SUSTAINED NECK AND BACK INJURIES. THE VEHICLE WAS TAKEN TO A PRIVATE MECHANIC WHERE THE FAILURE COULD NOT BE DIAGNOSED. THE MANUFACTURER WAS CONTACTED AND INFORMED THE CONTACT THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 04V605000 (LATCHES/LOCKS/LINKAGES). THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS APPROXIMATELY 87,000.",
        "vin": "4F2YZ94173K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/20/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10499441,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS SERVICED IN NOVEMBER 2012 UNDER NHTSA CAMPAIGN ID NUMBER: 12V357000 (SPEED CONTROL) HOWEVER, PRIOR TO THE REPAIR, THE CONTACT HAD NO ISSUES WITH SUDDEN ACCELERATION. THE CONTACT WAS TRAVELING AT AN UNKNOWN SPEED WITH THE CRUISE CONTROL ACTIVATED.  THE BRAKES WERE DEPRESSED AND THE CRUISE CONTROL ACTIVATION LIGHT WAS TURNED OFF HOWEVER, THE VEHICLE DID NOT DECELERATE. THE CONTACT MENTIONED THAT WITH THE BRAKES STILL DEPRESSED, HE WAS ABLE TO MOVE INTO THE EMERGENCY LANE AND STOP THE VEHICLE. THE ENGINE RPMS CONTINUED TO EXCESSIVELY FLUCTUATE AS IF THE CONTACT WAS STILL DRIVING AND AT RAPID SPEEDS. THE CONTACT POWERED THE VEHICLE ON AND OFF SEVERAL TIMES BEFORE IT WOULD PERFORM NORMALLY. THE VEHICLE WAS TAKEN TO THE DEALER AND THE CONTACT WAS TOLD THAT THE DEALER COULD NOT DUPLICATE THE FAILURE. THERE WERE NO REPAIRS PERFORMED ON THE VEHICLE.  THE MANUFACTURER WAS CONTACTED BUT CONFIRMED THAT THE VEHICLE COULD NOT BE REPAIRED BECAUSE THE FAILURE COULD NOT BE DIAGNOSED. THE CONTACT BELIEVED THAT EITHER THE RECALL REPAIR WAS INEFFECTIVE OR WAS PERFORMED IMPROPERLY. THE FAILURE MILEAGE WAS 94,500 AND THE CURRENT MILEAGE WAS 96,400.",
        "vin": "4F2CZ04113K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "02/15/2013",
        "dateOfIncident": "08/06/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498252,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE AIR BAG WARNING LIGHT WAS ILLUMINATED. THE CONTACT TOOK THE VEHICLE TO A DEALER AND WAS TOLD THAT THE SPRING TENSIONER FOR THE AIR BAG NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 98,000 AND THE CURRENT MILEAGE WAS 110,000.",
        "vin": "4F2YZ94173K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/15/2013",
        "dateOfIncident": "11/14/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498267,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MAZDA TRIBUTE V6.  AFTER TAKING THE VEHICLE IN FOR A RECALL, THEY NOTICED THAT MY FRONT PASSENGER SIDE SUBFRAME WAS ROTTED.  THE DRIVERS SIDE IS FINE.  THE EXHAUST GOES THRU THAT AREA - IT APPEARS THAT THE HEAT FROM THE EXHAUST CAUSED THE PAINT ON THE SUBFRAME TO 'BURN' OFF AND THUS ALLOW IT TO BE EXPOSED TO THE ELEMENTS AND ROT.  I HAVE READ OTHER CASES OF THIS SAME THING HAPPENING TO OTHER PEOPLE WITH THIS VEHICLE.  THERE ARE OTHER MANUFACTURERS WHO HAVE RECALLS ON THIS SAME ITEM FOR THEIR VEHICLES - WHY DOESN'T MAZDA?  IT IS NOT AN EASY OR CHEAP FIX!  *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/17/2012",
        "dateOfIncident": "12/16/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10489005,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, THE BRAKE WARNING LIGHT ILLUMINATED. THE CONTACT MERGED TO THE SHOULDER OF THE ROAD AND NOTICED THAT THE BRAKE MASTER CYLINDER RESERVOIR CAP WAS LEAKING BRAKE FLUID. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC TESTING. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE VEHICLE WAS REPAIRED. THE APPROXIMATE FAILURE AND THE CURRENT MILEAGE WAS 55,000.   UPDATED 1/29/13 *CN  THE BRAKE FLUID RESERVOIR WAS RE-FILLED. A NEW BRAKE RESERVOIR CAP WAS PURCHASED FROM THE MAZDA DEALER.  THE ORIGINAL CAP WAS FOUND TO BE LEAKING. UPDATED 02/06/13",
        "vin": "4F2CZY6173A"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": true,
        "dateComplaintFiled": "12/16/2012",
        "dateOfIncident": "12/16/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10488931,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE WAS IN THE PARKING LOT AT CHURCH WAITING FOR A CAR TO PULL AWAY SO SHE COULD PARK. THE CAR STARTED TO ROLL FORWARD SO SHE STEPPED HARDER ON THE BRAKE. THE CAR LURCHED AHEAD CRASHING INTO THE CAR IN FRONT OF HER. MY WIFE IS QUITE SURE SHE HAD HER FOOT ON THE BRAKE. AS SHE TOLD ME ABOUT THIS I STARTED REMEMBERING AN EVENT. THIS CAR HAD BELONGED TO MY FATHER WHO HAS SINCE PASSED AWAY. HE PURCHASED IT NEW. I'M NOT EXACTLY SURE OF THE DATE, BUT I BELIEVE IT WAS IN THE FIRST YEAR OF OWNERSHIP. HE WAS PARKING AT A HOSPITAL WHEN ALL OF A SUDDEN THE VEHICLE WAS TAKING OFF AND PUSHING THE CAR IN FRONT OF HIM. I FIGURED HE WAS HAVING A SENIOR MOMENT AND HAD HIS FOOT ON THE WRONG PEDAL. I DID SOME QUICK RESEARCH TODAY AND FOUND THAT OTHERS HAVE HAD THIS PROBLEM. MAYBE MY FATHER WAS DOING ALL THE RIGHT THINGS AND IT REALLY WAS THE CARS FAULT. I ALSO SEE THAT THERE HAVE BEEN RECALLS ON THIS MATTER. I'M NOT SURE IF ANY OF THESE ISSUES WERE ADDRESSED WHEN MY FATHER HAD THE CAR, BUT I WILL BE CHECKING IT OUT. I HOPE YOU WILL BE CONTINUING TO FOLLOW UP ON THIS. THIS IS A SCARY AND DANGEROUS ISSUE THAT DESERVES YOUR ATTENTION. WHEN THINGS START EFFECTING YOUR DRIVING RECORD, INSURANCE COSTS, AND MAKE YOU PAY DEDUCTIBLES WHEN IT  IS NOT YOUR FAULT SOMETHING NEEDS TO CHANGE!  *TR",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/01/2012",
        "dateOfIncident": "11/01/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10482922,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE RECALL REPAIRS, IT WAS NOTED THAT THE CRUISE CONTROL CABLE WAS DAMAGED. WHEN I REQUESTED THAT THE DEALER REPLACE THE CABLE CAUSED BY THE HOLDING BRACKET AS COVERED UNDER MAZDA RECALL DATED 7/12 I WAS TOLD THAT THEY ARE ONLY REPLACING THE HOLDING BRACKET AND NOT THE CABLE EVEN THOUGH THE CABLE WAS DAMAGED BY THE DEFECTIVE HOLDING BRACKET. SO, WHAT GOOD IS THE RECALL? I WAS TOLD IT WOULD COST ME APPROXIMATELY $100 PLUS TO GET IT REPLACED.  *TR",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "STEERING,ELECTRICAL SYSTEM,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "09/06/2012",
        "dateOfIncident": "08/28/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10474091,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "EVERY TIME IT RAINS  REALLY HARD OR THERE'S FLOODING IN THE STREETS THE CAR STARTS SHOWING THE BATTERY LIGHT LIKE IT IS GOING TO DIE ON ME AND AS A PRECAUTION I TRY TO PULL OUT OF THE STREET TO ANY PLACE AND WHILE TURNING THE STEERING WHEEL THE CAR LOOSES POWER AND THE WHEELS WON'T TURN. DRIVING  NO MORE THAN 5MPH WHILE SLOWING DOWN FROM A NORMAL 35MPH  WITHOUT WARNING MY ENGINE SHUT OFF AND I LOST POWER TO MY STEERING WHEEL AND BRAKES. I WAS ABLE TO GET THE CAR TO OFF THE ROAD AFTER APPLYING ALL MY WEIGHT TO THE BRAKES AND STEERING WHEEL. I MISSED AN ONCOMING CAR AND A TREE BY AN INCH. I DECIDED TO DO SOME ONLINE RESEARCH AND IT SEEMS I AM NOT THE ONLY ONE WITH THIS PROBLEM WITH A MAZDA TRIBUTE 2003. I AM VERY WORRIED BECAUSE IT  HURRICANE SEASON HERE IN FL AND THE RAIN IS NOT SOMETHING I CAN PREDICT, BESIDES IT SEEMS ABSURD THAT I WOULD EVEN HAVE TO WATCH THE WEATHER TO SEE IF I SHOULD OR NOT DRIVE THE CAR. THIS IS AN ACCIDENT WAITING TO HAPPEN!! I DRIVE MY 2 YEAR OLD EVERY DAY AND IT IS NOT RIGHT THAT MAZDA WOULD HAVE CARS WITH THIS ISSUES OUT IN THE STREET. IF FEELS LIKE BY SIGNING A PURCHASE CONTRACT ON IT. I HAD SIGNED A DEATH WITH IT. PLEASE DO SOMETHING. I HAVEN'T FOUND THAT THERE IS A RECALL FOR THIS ISSUE.  *TR",
        "vin": "4F2CZ06193K"
    },
    {
        "components": "VEHICLE SPEED CONTROL,ENGINE",
        "crash": false,
        "dateComplaintFiled": "08/13/2012",
        "dateOfIncident": "02/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10470419,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FIRST 2 TO 4 TIMES THE ACCELERATOR IS USED (NOT PUSHED HARD), THE CABLE STICKS.  WE HAVE TO PUSH HARDER ON THE PEDAL, THEN IT SUDDENLY RELEASES.  THIS CAUSES THE VEHICLE TO JUMP IN THE DIRECTION CHOSEN.  IT IS VERY DIFFICULT TO SMOOTHLY BACK OUR OF THE GARAGE OR PARKING SPACE.  THEN THE ACCELERATOR IS SLOW TO RETURN TO IDLE.    IT APPEARS TO BE THE SAME ISSUE AS RECALL NHTSA CAMPAIGN #04V583000 FOR 2004 TRIBUTES, BUT OUR VEHICLE WAS BUILT AT THE END OF 2003.  *TR",
        "vin": "4F2YZ04113K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/25/2012",
        "dateOfIncident": "07/23/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10467681,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE DRIVING 55 MPH WITH THE CRUISE CONTROL ENGAGED, SHE APPLIED THE BRAKES BUT THE VEHICLE DID NOT DECELERATE. THE CONTACT ALSO STATED THAT THE VEHICLE ACCELERATED WHEN THE BRAKE PEDAL WAS APPLIED. THE CONTACT HAD TO APPLY REPEATED PRESSURE TO THE BRAKE PEDAL TO STOP THE VEHICLE. THE CONTACT STOP AND RESTARTED THE VEHICLE, BUT THE FAILURE CONTINUED. THE VEHICLE WAS TOWED TO A DEALER FOR AN INSPECTION AND THE CAUSE OF THE FAILURE WAS UNKNOWN. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOTIFIED AND STATED THAT THERE WERE NO RECALLS ADDRESSING THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4F2YZ94113K"
    },
    {
        "components": "POWER TRAIN,ENGINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2012",
        "dateOfIncident": "01/14/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466455,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RPM ON THIS VEHICLE JUMPS EVEN IF I AM AT A FULL STOP SOMETIMES IT RACES EVEN IF THE CAR IS IN PARK TOOK THE CAR TO SEVERAL SHOPS HAD SEVERELY PARTS REPLACED.  *TR",
        "vin": "4F2YZ04183K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "07/18/2012",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10466501,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE ENTERING PARKING SPACE IN FRONT OF BUILDING, ACCELERATOR RACED, CAUSING VEHICLE TO HIT CONCRETE POLE IN FRONT OF BUILDING.  I HAVE HAD SEVERAL INSTANCES WHERE THE ACCELERATOR RACED LIKE THIS; ONCE AT A RED LIGHT, WHERE I HIT THE VEHICLE IN FRONT OF ME, AND ONCE AT A STOP SIGN WHERE FORTUNATELY THERE WERE NO OTHER VEHICLES AROUND.  *TR",
        "vin": "4F2YZ04123K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/01/2012",
        "dateOfIncident": "04/27/2012",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10457004,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUNE. THE CONTACT STATED THAT WHILE BRAKING TO A STOP, THE BRAKE LINE FAILED. THE BRAKE LINE FRACTURED AND ALL OF THE FLUIDS LEAKED OUT. THE VEHICLE WAS TOWED TO A LOCAL MECHANIC WHO REPAIRED THE BRAKE LINES. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE VIN WAS UNAVAILABLE.  THE FAILURE MILEAGE WAS 150,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "04/17/2012",
        "dateOfIncident": "03/19/2012",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10455537,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 MAZDA TRIBUTE WAS RECALLED IN MAY 2007 FOR ABS VOLUNTARY SAFETY RECALL.  I TOOK IT IN THAT SAME MONTH AND THE DEALER DETERMINED MODULE CONNECTOR DID NOT NEED TO BE REPLACED.  ON MARCH 15, 2012 ABS LIGHT CAME ON FOR NO REASON AND STAYED ON FOR AN HOUR.  TOOK IT TO HAVE IT CHECKED ON MARCH 17, CODE COULD NOT BE DETERMINED.  UPON INSPECTION EVERYTHING LOOKED FINE. I WAS INSTRUCTED TO TAKE IT TO THE DEALERSHIP SHOULD THE ABS LIGHT COME ON AGAIN. TWO DAYS LATER, ON MARCH 19, 2012 I HAD BEEN AT WORK FOR AN HOUR WITH MY CAR PARKED WHEN I WAS NOTIFIED THAT MY CAR WAS ON FIRE.  THE CAR WAS TOTALED DUE TO THE FIRE.  ACCORDING TO THE RECALL OF MAY 2007, AN ELECTRICAL SHORT COULD CAUSE AN ABS MALFUNCTION WHICH WOULD ILLUMINATE THE ABS LIGHT AND COULD RESULT IN \"BURNING ODOR, SMOKE, AND/OR FIRE.  THIS COULD OCCUR EITHER WHEN THE VEHICLE IGNITION SWITCH IS IN THE OFF POSITION OR WHILE THE VEHICLE IS BEING OPERATED.\"  MY CAR WAS OFF WHEN THIS OCCURRED.  I BELIEVE THAT HAD THE MODULE CONNECTOR BEEN REPLACED IN 2007 WHEN I TOOK IT IN UNDER THE SAFETY RECALL,  THIS FIRE WOULDN'T HAVE OCCURRED.       *JS",
        "vin": "4F2CZ96173K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/08/2012",
        "dateOfIncident": "04/04/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454470,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 TRIBUTE HAS BEEN LEAKING OIL FROM THE OIL PAN GASKET BETWEEN THE OIL PAN AND ENGINE BLOCK. OF COURSE AFTER TIME IT WOULD LEAK BUT I HAVE HEARD THAT THE TRIBUTE HAS A BAD DESIGN WITH THE OIL PAN AND GASKET. THE DEALERSHIP TRIED TO SELL ME THE NEW OIL PAN REPLACEMENT FOR THE DEFECTIVE ONE AND THE NEW GASKET REPLACEMENT FOR ALSO THAT DEFECTIVE PART.    MAZDA REDESIGNED THE OIL PAN WITH AN EMBEDDED O RING IN LIEU OF A GASKET. THE DEALERS WANT TO SELL THE NEWLY DESIGNED PAN INSTALLED FOR $440 + TAX (MEDFORD, NY).    I WOULD THINK THAT IT IS A DEFECT AND WOULD LIKE THIS AGENCIES OPINION. IF THE DESIGN WAS GOOD FROM THE START MAZDA WOULDN'T PUT THE TIME AND MONEY INTO REDESIGNING THE OIL PAN AND GASKET, AND RECOMMENDING THE REPLACEMENT. MAZDA WILL NOT DO THE GASKET REPLACEMENT UNLESS THE NEW DESIGNED PAN AND GASKET WAS USED.    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "4F2YZ94173K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/08/2012",
        "dateOfIncident": "03/04/2012",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10450758,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE WAS PARKED IN A RESIDENTIAL GARAGE WHEN THE CONTACT HEARD AN EXPLOSION. THE CONTACT THEN NOTICED THAT THE VEHICLE WAS IN FLAMES AND THE FIRE DEPARTMENT WAS CONTACTED TO EXTINGUISH THE FIRE. THE VEHICLE WAS NOT DIAGNOSED FOR THE FAILURE AND DECLARED AS DESTROYED.  THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 07V157000 (SERVICE BRAKES, HYDRAULIC:ANTI LOCK:CONTROL UNIT/MODULE ) IN WHICH THE CONTACT HAD EXPERIENCED SIMILAR SYMPTOMS AS THAT WHICH WAS DESCRIBED IN THE RECALL BUT THE VEHICLE WAS NOT INCLUDED IN THE RECALL. THE VIN WAS NOT AVAILABLE. THE FAILURE AND CURRENT MILEAGE WAS 100,000.",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "08/01/2011",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443687,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE.  THE CONTACT STATED THAT ANTI-LOCK BRAKE FLUID WAS LEAKING ONTO THE WIRING.  THE CONTACT COULD ALSO SMELL A BURNING ODOR FROM THE ENGINE WHEN DRIVING.  THE BATTERY AND THE ABS WARNING LIGHTS WOULD ILLUMINATE SPORADICALLY.  THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO WAS UNABLE TO DIAGNOSE THE FAILURE, BUT THE CONTACT HAD THE BRAKE FLUID CAP REPLACED.  THE DEALER AND THE MANUFACTURER WERE NOTIFIED OF THE FAILURE, BUT DENIED ANY ASSISTANCE WITH REPAIRS TO THE VEHICLE.  THE CONTACT REFERENCED NHTSA CAMPAIGN ID NUMBER: 12V005000 (SERVICE BRAKES, HYDRAULIC:ANTILOCK:CONTROL) BUT DID NOT CONFIRM IF THE VEHICLE WAS INCLUDED IN THE RECALL. THE FAILURE MILEAGE WAS 82,000 AND THE CURRENT MILEAGE WAS 89,000.",
        "vin": "4F2CZ06123K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2011",
        "dateOfIncident": "05/01/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10420955,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT WAS DRIVING 25 MPH WHEN THE VEHICLE STALLED WITHOUT WARNING. THE CONTACT MENTIONED THAT THE VEHICLE WOULD START AFTER BEING JUMP STARTED BUT THE FAILURE WOULD RECUR IMMEDIATELY AFTER. THE VEHICLE WAS TAKEN TO A LOCAL MECHANIC WHO DIAGNOSED THAT THE ALTERNATOR WAS DEFECTIVE AND NEEDED TO BE REPLACED. THE CONTACT MENTIONED THAT HE HAD TO REPLACED THE SAME PARTS TWICE BEFORE. THE MANUFACTURER WAS NOT MADE AWARE OF THE PROBLEM. THE VIN WAS NOT AVAILABLE. THE FAILURE MILEAGE WAS 125,000 AND THE CURRENT MILEAGE WAS 160,000.",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "07/19/2011",
        "dateOfIncident": "07/19/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413665,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 65MPH ON FREEWAY WENT TO SWITCH LANES AND ACCELERATOR PEDAL FELL COMPLETELY TO FLOORBOARD. IMMEDIATELY PUT ON EMERGENCY FLASHERS AND PUMPED BRAKES INTO EMERGENCY LANE. UPON INSPECTION SHOWED THROTTLE CABLE JUST SNAPPED CLEAN.  *KB",
        "vin": "4F2CZ06163K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/29/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10409386,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT WHILE THE VEHICLE WAS IN NEUTRAL, THE ENGINE EXHIBITED AN ABNORMAL INCREASE IN RPMS.  THE VEHICLE WAS INSPECTED BY AN INDEPENDENT MECHANIC AND THEY ADVISED HER THAT THE ACCELERATOR CABLE WOULD NEED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS CONTACTED AND THEY ADVISED HER THAT THE VEHICLE WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER: 04V583000(VEHICLE SPEED CONTROL:CABLES). THE FAILURE MILEAGE WAS APPROXIMATELY 115,000.",
        "vin": "4F2YZ92B23K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/29/2011",
        "dateOfIncident": "04/27/2011",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398211,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE LINE FAILING, DURING A NORMAL STOP ONE OF THE BRAKE LINES RUPTURE. TWO OTHERS HAD TO BE REPLACED DUE TO POOR CONDITIONS. *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/06/2011",
        "dateOfIncident": "09/28/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394430,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE TRANSMISSION WAS DEFECTIVE AND WOULD NEED TO BE REPLACED. THE MANUFACTURER WAS CONTACTED BUT OFFERED NO ASSISTANCE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 55,913.     UPDATED 5/9/11 *CN  THE TRANSMISSION WAS REPLACED. UPDATED 05/16/11",
        "vin": "4F2YZ04193K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/30/2011",
        "dateOfIncident": "03/20/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393795,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLS WITHOUT WARNING ON OCCASIONS WHEN I STOP AT LIGHTS OR STOP SIGNS.  IT RESTARTS EACH TIME.  II TOOK MY CAR TO THE DEALER.  LEFT IT THERE 3-4 DAYS AND THE DEALER COULD NOT EXPLAIN WHAT IS WRONG OR FIX THE PROBLEM.  *TR",
        "vin": "4F2YZ02B63K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/02/2011",
        "dateOfIncident": "11/18/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10386182,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT WAS DRIVING AT AN UNKNOWN SPEED WHEN THE VEHICLE BEGAN JERKING ABNORMALLY. THE CONTACT STATED THAT THE FAILURE WOULD ONLY OCCUR IN COLD TEMPERATURES AND WHEN THERE WAS SNOW ON THE GROUND. IN ADDITION, THE ALTERNATOR HAD FAILED AND WAS REPLACED THREE TIMES BY THE LOCAL DEALER. THE VEHICLE WOULD ALSO ABNORMALLY ACCELERATE AND EXHIBIT AN UNUSUAL INCREASE IN ENGINE RPMS TO 4000.  THE CONTACT BELIEVED THE VEHICLE TO BE INVOLVED IN NHTSA CAMPAIGN ID NUMBER: 04V583000 (VEHICLE SPEED CONTROL: CABLES) AND NHTSA CAMPAIGN ID NUMBER: 07V157000 (SERVICE BRAKES, HYDRAULIC: ANTILOCK: CONTROL UNIT/MODULE) BUT WAS INFORMED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED IN EITHER RECALL. THE VEHICLE WAS NOT. THE CURRENT MILEAGE WAS 175,000 AND THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "4F2YZ92BX3K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/12/2011",
        "dateOfIncident": "11/18/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376386,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MAZDA TRIBUTE LX(NA). THE CONTACT STATED THAT WHEN TRYING TO START HIS VEHICLE, THE ENGINE SUDDENLY EXPLODED BUT DID NOT IGNITE; PARTS FLEW AND PENETRATED THE HOOD. THE VEHICLE WAS TOWED TO A INDEPENDENT MECHANIC WHO INFORMED THE CONTACT THAT THE FAILURE WAS DUE TO THE TYPE OF ENGINE, WHICH WAS CALLED AN \"INTERFERENCE ENGINE\" AND THE DESIGN OF IT. THE MECHANIC RECOMMENDED THAT HE REPLACE THE ENGINE. THE FAILURE MILEAGE WAS APPROXIMATELY 74,000.",
        "vin": "4F2YZ041X3K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/09/2011",
        "dateOfIncident": "11/18/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10376116,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "UPON STARTING, A SEVERE EXPLOSION OCCURRED, DENTING THE HOOD FROM PARTS OF ENGINE.  SMOKE POURED OUT FROM HOOD, BUT IGNITED GASOLINE DID NOT LEAVE ENGINE. ENGINE IS AN INTERFERENCE FORD PRODUCT AND SUV HAS ALWAYS BEEN WELL MAINTAINED AND SERVICED.  THE SEVERITY OF THE DANGER OF THIS EXPLOSION CANNOT NOR SHOULD BE OVERLOOKED OR DISMISSED.  HAD THE HOOD BEEN OPEN, SOMEONE COULD HAVE RESULTED IN SEVERE INJURY OR POSSIBLY DEATH.  I HAVE TRIED TO WORK WITH MAZDA FOR A RESOLUTION IN THIS MATTER AND ALL ATTEMPTS HAVE FAILED.  AS A PREVIOUSLY SATISFIED CUSTOMER FOR ALMOST 30 YEARS, I AM FRUSTRATED AND INFURIATED BY THEIR DENIALS TO WORK OUT A RESOLUTION, IN EITHER A NEW ENGINE OR SUBSTANTIAL TRADE ON A NEW VEHICLE. AN ENGINE WITH THIS LOW MILEAGE EXPLODING  IS UNHEARD OF AND, CERTAINLY, NOT EXPECTED. MY LETTER TO MAZDA CEO AND PRESIDENT JAMES O'SULLIVAN AND MY MECHANIC'S ASSESSMENT IS AVAILABLE.",
        "vin": "4F2YZ041X3K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "09/27/2010",
        "dateOfIncident": "07/15/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10357925,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STARTING IN 7/2009 MY 2003 MAZDA TRIBUTE'S AIR BAG LIGHT CAME ON. REPAIRS INCLUDED REPLACING THE CONNECTOR UNDER THE PASS SEAT. SINCE THEN THE LIGHT HAS COME ON 5 TIMES AND EACH TIME A CONNECTOR KIT WAS NEEDED FOR REPAIRS. EVENTUALLY THE LIGHT BURNED OUT AND COST OVER $200.00 FOR REPAIRS. I CALLED MAZDA AND COMPLAINED. I ALSO FOUND NUMEROUS OTHER OWNERS COMPLAINING OF THE SAME PROBLEM ON THE INTERNET. WHILE THE LIGHT IS ON OR BURNED OUT ACCORDING TO MECHANICS I HAVE TALKED TO THE AIR BAG WILL NOT DEPLOY IN THE EVENT OF A ACCIDENT. *TR",
        "vin": "4F2CZ96133K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/09/2010",
        "dateOfIncident": "03/03/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10348370,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA TRIBUTE, 2003. AIRBAG LIGHT STAY ILLUMINATED. MAZDA REPAIRED IT 5 TIMES AND STILL IT IS LIT. HAVE BEEN TOLD BY THE DEALER THAT THE AIRBAG WILL NOT DEPLOY SHOULD I BE IN AN ACCIDENT. I BOUGHT THE CAR NEW, IT HAS NOT BEEN IN AN ACCIDENT AND UP TO NOW IT WAS COVERED BY WARRANTY. NOW THEY WANT ME TO PAY $400 TO FIX SOMETHING THEY CAN'T FIX ANYWAY. I FEEL A DEFECT TREND EXISTS WITH THEIR AIRBAGS FROM ALL THAT I'VE READ. IF CARS ARE MANDATED BY THE GOVERNMENT TO HAVE FUNCTIONING AIRBAGS THEN WHY IS MAZDA NOT BEING HELD ACCOUNTABLE FOR THE SERIOUS SAFETY DEFECTS IN THEIR AIRBAG SYSTEM? *TR",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/22/2010",
        "dateOfIncident": "04/17/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10327059,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 MAZDA TRIBUTE JUST RECENTLY BEGAN LOSING POWER. LATE LAST WEEK I NOTICED IT WASN'T GRABBING AS IT SHOULD SHIFTING (AUTOMATIC) BETWEEN THIRD AND FOURTH GEAR.   TOOK IT TOOK RECOMMENDED REPAIR SHOW AND THEY ARE INDICATING TRANSMISSION REBUILD IS REQUIRED. I JUST CHECKED THE FLUID LEVEL LAST WEEK AND ABOUT TWO OR THREE WEEKS PRIOR AND ALL WAS WELL THERE. ENGINE BLEW ON SAME VEHICLE AT 70K MILES DESPITE OIL CHANGES EVERY 3000 MILES.   REPAIR SHOP ESTIMATE: $3500 FOR THE FOLLOWING:  FILTER, OVERDRIVE BAND, BUSHING KIT, BEARINGS, DRIVE CHAIN, TORQUE CONVERTER, SOLENOID BLOCK, MLP SWITCH, FORWARD PLANETARY GEAR, AND FLUID.   I CANNOT BELIEVE A VEHICLE THIS AGE WITH LESS THAN 80,000 MILES HAS LOST AN ENGINE AND TRANSMISSION UNDER NORMAL WEAR AND TEAR, WHEN PROPER MAINTENANCE HAS BEEN PERFORMED.   CARMAX DID HONOR THE WARRANTY FOR THE ENGINE FAILURE, BUT THE EXTENDED WARRANTY COVERAGE ONLY EXTENDS TO 75K. *TR",
        "vin": "4F2YZ94173K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/05/2010",
        "dateOfIncident": "03/28/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10323775,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MAZDA TRIBUTE. THE CONTACT STATED THAT WHEN DRIVING UPHILL OR APPROACHING A STOP SIGN, THE VEHICLE WOULD STALL. THE VEHICLE HAD BEEN TO THE DEALER SEVERAL TIMES; HOWEVER, THE FAILURE COULD NOT BE DUPLICATED. THE DEALER REPLACED THE BATTERY BUT TO NO AVAIL. THE CONTACT WAS ABLE TO LOCATE A RECALL, IN WHICH SHE BELIEVED TO BE DIRECTLY RELATED TO THE FAILURE (NHTSA CAMPAIGN ID NUMBER 04V175000: POWER TRAIN: AUTOMATIC TRANSMISSION: CONTROL MODULE TCM, PCM), HOWEVER HER VIN WAS NOT INCLUDED. THE MANUFACTURER WOULD NOT PROVIDE ANY ASSISTANCE. THE FAILURE MILEAGE WAS 60,000 AND THE CURRENT MILEAGE 82,000.  UPDATED 11/03/10 *BF   THE CONSUMER ALSO STATED THE VEHICLE WOULD STALL WHILE BACKING UP, AND WHEN IT STALLED, IT COULDN'T BE RESTARTED. UPDATED 11/04/10*JB",
        "vin": "4F2CZ06153K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "03/30/2010",
        "dateOfIncident": "03/26/2010",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322877,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT ON MY 2003 MAZDA TRIBUTE WENT ON. I TOOK IT TO THE MAZDA DEALER OF ORANGE CA. THEY HAD CLAIMED TO MY FACE THAT THIS HAS BEEN A RECURRING ISSUE WITH THE MAZDA TRIBUTES LATELY. I WAS SHOCKED TO FIND OUT THAT THIS SERIOUS PROBLEM IS HAPPENING WITH MANY OF THE TRIBUTES NOT JUST MINE. WHY HAS MAZDA NOT FIXED THE PROBLEM IF THEY ARE AWARE OF IT? THEY CLAIMED THAT THE ISSUE WAS WITH THE ELECTRICAL WIRING OF THE SEAT BELTS THAT CONNECTED TO THAT AIR BAG. THE SEAT BELTS WOULD NOT LOCK IF WE WERE EVER IN A CRASH. IS THAT SAFE? DOES A DEATH NEED TO HAPPEN TO GET ATTENTION ABOUT THE PROBLEM? BECAUSE THE CAR WAS NOT UNDER WARRANTY, I PAID 486.00 OUT OF MY POCKET TO FIX A DEFECT THAT WAS NOT CAUSED BY NORMAL WEAR AND TEAR. AFTER THE REPAIR THE TECHNICIANS COULD NOT GET THE AIR BAG LIGHT TO TURN OFF. I ASKED IF THERE MAY BE A BIGGER PROBLEM THAT WAS OVERLOOKED. THEY SAID NO THE AIR BAG LIGHT STILL PERIODICALLY TURNS ON AND OFF. IF I OR ANY OF MY FAMILY MEMBERS GETS INJURED IN AN ACCIDENT BECAUSE OF THIS SAFETY NEGLIGENCE ISSUE, I WILL SUE MAZDA. THIS SERIOUSLY NEEDS TO BE LOOKED INTO TO PROTECT PEOPLE FROM INJURY.",
        "vin": "4F2CZ04133K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/21/2010",
        "dateOfIncident": "03/11/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10312464,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA 2003 TRIBUTE  THE ACCELERATOR PEDAL HAS BEEN STICKING OFF AND ON SINCE MARCH 2009.  WHEN THE CAR IS GOING ON HIGH SPEEDS, IT WOULD NOT SLOW DOWN.  HAVE TO PUT IN NEUTRAL AND TURN OFF.   TOOK TO MECHANIC, UNHOOKED CRUISE AND NEW ACCELERATOR CABLE IN 2009.  NO CHANGES.  TRADED CAR IN FOR A HONDA IN JANUARY, 2010.  MAZDA WOULD NOT DO ANYTHING. *TR",
        "vin": "4F2CZ96173K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/01/2010",
        "dateOfIncident": "08/01/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10303731,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STICKY ACCELERATOR STICKS WHEN GAS PEDAL IS PRESSED (FROM A FULL STOP). STICKINESS INCREASES WITH COLDER WEATHER. CAUSES A LURCHING ACTION EVEN WHEN ADDING MINIMAL PRESSURE ON THE ACCELERATOR PEDAL. I'M WORRIED THAT IF THE PROBLEM PERSISTS OR GETS WORSE WITH THE COLDER WEATHER, IT MAY CAUSE WHIPLASH TO ANY CHILDREN RIDING IN MY CAR. OR WORSE - LURCHING INTO THE GARAGE AND CAUSING DAMAGE TO MY HOME. OR LURCHING IN A PARKING LOT AND HITTING A PEDESTRIAN/CHILD. I HAVE RESEARCHED THIS IN SEVERAL AUTO FORUMS AND THIS HAS BEEN AN ISSUE WITH FAR MORE CONSUMERS THAN MAZDA IS WILLING TO ACKNOWLEDGE. IT IS A SERIOUS ISSUE. IF TOYOTA CAN ADDRESS A STICKY ACCELERATOR PROBLEM, WHY CAN'T MAZDA DO THE SAME? OUR LIVES, AS WELL AS INNOCENT BYSTANDERS, ARE IN DANGER! *TR",
        "vin": "4F2CZ96183K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/08/2009",
        "dateOfIncident": "02/09/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10294932,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS A 2003 MAZDA TRIBUTE, WHICH HAD A RECALL 04V583000 FOR VEHICLE SPEED CONTROL CABLES. WAS TOLD THIS RECALL WAS FIXED ON 8/11/2005. THIS VEHICLE HAS HORRIBLE ISSUES WITH SUDDEN ACCELERATION WHILE DRIVING DOWN THE HIGHWAY, IT WILL NOT SLOW DOWN, THE ACCELERATOR IS STUCK WIDE OPEN AND BRAKING WILL NOT SLOW THE VEHICLE DOWN. THESE INCIDENTS HAPPEN AT LEAST THREE TIMES A WEEK, AND AT VARIOUS SPEEDS (25 MPH-55MPH), IT CAN SUDDENLY BE DRIVING DOWN THE ROAD UP TO 85 AND 90 MPH. HAPPENS BOTH IN RURAL AND CITY DRIVING. WAS TOLD BY MAZDA DEALER RECALL IS CLOSED AND WILL NOT CONSIDER THIS AS ANYTHING TO DO WITH THE RECALL. THERE WERE TWO RECALLS ON THIS VEHICLE FOR THIS ISSUE, AND I FEEL THIS ISSUE IS STILL RELATED TO THE SAME PROBLEM. THE INCIDENT IS ONGOING AND HAS BEEN SINCE FEBRUARY, 2009. *TR",
        "vin": "4F2CZ96123K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/03/2009",
        "dateOfIncident": "08/03/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10279195,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIR BAG LIGHT ON MY 2003 MAZDA TRIBUTE WENT ON.  I ASKED THE LOCAL MECHANIC SEE WHY DURING A ROUTINE OIL CHANGE.  HE SAYS MAZDA HAS A \"TECHNICAL SERVICE BULLETIN\" OUT FOR WIRING REPAIRS UNDER THE SEAT.  HE SAYS THEY KNOW THEY HAVE THIS WIRING PROBLEM.  SINCE MY CAR HAS 100,000 MILES MAZDA SAYS IT IS OUT OF WARRANTY AND THEY WON'T COVER IT EVEN THOUGH THIS IS THEIR WIRING ISSUE.  THE DEALER WANTS TO CHARGE ME $700 TO FIX THEIR WIRING PROBLEM WHICH IS VERY WRONG. *TR",
        "vin": "4F2CZ96143K"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/30/2009",
        "dateOfIncident": "06/29/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275381,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RETAINING CLIP CAME OFF OF THE PIN THAT HOLDS THE FRONT DRIVER DOOR IN THE HINGE, CAUSING THE DOOR TO FALL. THE PIN IS INSERTED FROM THE BOTTOM UP RATHER THAN FROM THE TOP DOWN SO WHEN THE CLIP CAME OFF, THE PIN FELL OUT. *TR",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/19/2009",
        "dateOfIncident": "06/09/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274349,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MAZDA TRIBUTE.  THE CONTACT RECEIVED A RECALL NOTICE FOR NHTSA CAMPAIGN ID NUMBER 07V157000 AND TOOK THE VEHICLE TO THE DEALER.  THE DEALER KEPT THE VEHICLE FOR OVER FOUR DAYS.  THE CONTACT WAS INFORMED THAT THE PARTS FOR THE REPAIR WERE UNAVAILABLE AND WOULD ARRIVE THE FOLLOWING DAY.  THE DEALER ALSO STATED THAT THEY WOULD NOT PROVIDE A RENTAL VEHICLE BECAUSE HER WARRANTY WAS EXPIRED.  THE DEALER REMOVED THE ABS WIRING HARNESS, BUT COULD NOT INSTALL IT BACK INTO PLACE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE VIN WAS UNKNOWN.  THE FAILURE AND CURRENT MILEAGES WERE LESS THAN 86,000.",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2009",
        "dateOfIncident": "01/18/2009",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260888,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 03 MAZDA TRIBUTE ES  ABS LIGHT CAME ON AT 80K. UPON INSPECTION THE LEFT FRONT  DRIVE AXLE ABS SPEED SENSOR RING WAS BROKEN. THE RING IS NOT AVAILABLE ANYWHERE AND MAZDA TOLD ME THE SHAFT WILL HAVE TO BE REPLACED. THE PART ALONE $325. PLUS LABOR. THE MAZDA PARTS PEOPLE TOLD ME IT'S A SHAME THAT YOU CAN'T JUST REPLACE THE RING. AND THAT THERE KNOWN FOR BRAKING. IT DOES EFFECT THE OPERATION OF THE BRAKES. I HAVE NOT REPLACED THE SHAFT YET STILL LOOKING FOR THE RING. *TR",
        "vin": "4F2CZ96103K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "01/14/2009",
        "dateOfIncident": "12/28/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10254946,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MAZDA TRIBUTE LX. MY AIRBAG DRIVERSIDE AIRBAG LIGHT IS COMING ON. SOMETIMES IT STAYS ON OTHER TIMES IT BLINKS CONTINUOUSLY. MY MAZDA WARRANTY RAN OUT AND I AM TOLD THAT IT WILL COST TO GET THE DIAGNOSIS AND TO HAVE REPAIRED. I BELIEVE THIS IS A SAFETY ISSUE AND SHOULD BE ADDRESSED AS SOON AS POSSIBLE WITHOUT COST. I BOUGHT THE MAZDA ON 2006 SO ITS ONLY 2 YEARS THAT I HAVE THE TRUCK. *TR",
        "vin": "4F2CZ06153K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/31/2008",
        "dateOfIncident": "12/22/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10253401,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MAZDA TRIBUTE LX. MY AIRBAG DRIVERSIDE AIRBAG LIGHT IS COMING ON. SOMETIMES IT STAYS ON OTHER TIMES IT BLINKS CONTINUOUSLY. MY MAZDA WARRANTY RAN OUT THIS PAST MAY AND I AM TOLD THAT IT WILL COST TO GET THE DIAGNOSIS AND TO HAVE REPAIRED. I BELIEVE THIS IS A SAFETY ISSUE AND SHOULD BE ADDRESSED AS SOON AS POSSIBLE AND I AM SINGLE WITH A FIXED INCOME. ARE OTHER PEOPLE HAVING THIS SAME ISSUE WITH THEIR MAZDA? HELP! *TR",
        "vin": "4F2YZ04163K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/25/2008",
        "dateOfIncident": "12/21/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252790,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 70 MPH. VEHICLE BEGAN ACCELERATING WITHOUT FOOT ON GAS PETAL. HAD TO HOLD FOOT ON BRAKE TO KEEP BELOW 70. WHEN FINALLY GOT TO EXIT AND STOPPED IDLING AT 4000 RPM AND VIBRATION SO BAD HAD TO SHUT CAR OFF. THROTTLE BODY AND A CABLE HAD TO BE REPLACED. *TR",
        "vin": "4F2CZ06123K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/09/2008",
        "dateOfIncident": "10/15/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251168,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MAZDA TRIBUTE.  THE CONTACT STATED THAT HIS VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 07V157000 (SERVICE BRAKES, HYDRAULIC:ANTI LOCK:CONTROL UNIT/MODULE).  HE WAS EXPERIENCING ISSUES WITH THE ABS.  THE MODULAR CONNECTOR HAD TO BE REPLACED BECAUSE IT LOST CONNECTION WITH THE COMPUTER AND LOCKED THE BRAKING SYSTEM.  WHILE DRIVING BETWEEN 35-45 MPH, THE FRONT PASSENGER SIDE WHEEL FROZE AND SLOWED DOWN THE VEHICLE.  A MECHANIC REPAIRED THE FAILURE BECAUSE THE WHEEL WOULD LOCK AND CAUSE THE VEHICLE TO SPIN.  THE CONTACT CALLED THE MANUFACTURER TO INQUIRE ABOUT A RECALL, AND WAS INFORMED THAT THEY WOULD NOT PROCESS A REIMBURSEMENT BECAUSE HE DID NOT TAKE THE VEHICLE TO AN AUTHORIZED DEALER FOR REPAIR.  THE FAILURE MILEAGE WAS 40,000.  UPDATED 12/30/08.*LJ  UPDATED 01/05/09.*JB",
        "vin": "4F2YZ94163K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/16/2008",
        "dateOfIncident": "11/14/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248938,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MAZDA TRIBUTE DX WITH A 4CYLINDER ENGINE AND A 5 SPEED TRANSMISSION.  THE ENGINE WILL SURGE WHEN THE ACCELERATOR IS NOT PRESSED ADDITIONALLY THE ENGINE SURGES WHEN THE CLUTCH IS PRESSED. AFTER CLEANING THE THROTTLE BODY THE PROBLEM STILL REMAINED. FURTHER TROUBLESHOOTING REVEALED THE ACCELERATOR CABLE STICKS. WHILE SEARCHING FOR AN ACCELERATOR CABLE ONLINE I FOUND A RECALL HERE BUT APPARENTLY IT DOES NOT APPLY TO THE 4 CYLINDER. *TR",
        "vin": "4F2YZ02B83K"
    },
    {
        "components": "PARKING BRAKE,AIR BAGS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/14/2008",
        "dateOfIncident": "02/08/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10245411,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE, PURCHASE NEW. ABS LIGHT KEEPS BLINKING AND THEN STAYS ON AND THEN GOES OFF.  THREE SEPARATE TRIPS TO WHITE PLAINS MAZDA AT A GOOD COST TO US AND TELLING US IT WAS CORRECTED - DRIVE A 1/2 MILE FROM THE DEALER AND THE LIGHT GOES ON AGAIN.  CORRECTED AGAIN AND A WEEK LATER IT GOES ON AGAIN!     ADDITIONALLY, WE HAVE AN INCIDENT IN A PARKED POSITION WITH MOTOR RUNNING (10/13/08) WHERE THE CAR'S RPM JUMPED TO 7,000, THE CAR RUMBLED AND COMPLETELY SHUT DOWN.  CAR COULD NOT BE RESTARTED.  HAD TO HAVE IT TOWED AT A SUBSTANTIAL COST TO ME INCLUDING A SEPARATE CHARGE TO TRY AND JUMP THE CAR AND NOW IS AT MAZDA WHITE PLAINS AGAIN.  PLEASE CONTACT ME.  I HAVE CALLED CUSTOMER SERVICE NUMBER AND THEY ARE TO BE IN TOUCH WITH MY DEALER.  PLEASE ADVISE. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/30/2008",
        "dateOfIncident": "02/09/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10236445,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MAZDA TRIBUTE.  WHILE DRIVING 40 MPH, THE ENGINE WARNING LIGHT ILLUMINATED ON THE INSTRUMENT CONTROL PANEL AND THE VEHICLE STALLED.  IMMEDIATELY AFTER THE FAILURE, THE VEHICLE WAS ABLE TO BE RESTARTED.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND THEY STATED THAT THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN ID NUMBER 04V175000 (POWER TRAIN:AUTOMATIC TRANSMISSION:CONTROL MODULE (TCM, PCM)).  HE WOULD BE RESPONSIBLE FOR THE REPAIR COSTS.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE MANUFACTURER DID NOT ASSIST.  THE FAILURE MILEAGE WAS 86,400 AND CURRENT MILEAGE WAS 90,000.",
        "vin": "4F2CZ06163K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "07/22/2008",
        "dateOfIncident": "07/21/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235261,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE AIRBAG LIGHT HAS BEEN REPAIRED AT LEAST FOUR TIMES WITHIN THE LAST TWO YEARS.  THE LAST TIME WAS ON JULY 10, 2008 AT CLIPPINGER MAZDA F, 2539 EAST GARVEY AVENUE NORTH, WEST COVINA, CA  91791.  YESTERDAY, JULY 21, THE AIRBAG LIGHT HAS BEEN CONSISTENTLY ON.  I AM CONCERNED ABOUT MY SAFETY BECAUSE THE BAG COULD DEPLOY UNEXPECTEDLY, OR IN THE CASE OF AN ACCIDENT, NOT DEPLOY AT ALL.  I AM DRIVING A CAR THAT FEELS LIKE HAVING A HAND GRENADE WITH THE  PIN PULLED.  *TR",
        "vin": "4F2CZ06113K"
    },
    {
        "components": "VEHICLE SPEED CONTROL,SERVICE BRAKES, ELECTRIC",
        "crash": true,
        "dateComplaintFiled": "07/08/2008",
        "dateOfIncident": "07/01/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233476,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT MAZDA TRIBUTE 2003 FROM CARMAX ON 06/26/08.  MOTHER WAS DRIVING TRUCK W/MY DAUGHTER (6), WHEN THE BRAKES FAILED AND COLLIDED W/VAN IN FRONT OF HER.  TWO HRS AFTER THE ACCIDENT, TOOK THE TRUCK TO THE LOCAL CARMAX.  EXPLAINED TO THEM WHAT HAPPENED AND ASKED WERE THERE ANY RECALLS ON THE TRUCK.  THE LADY IN THE SERVICE DEPARTMENT SAID SHE DID NOT KNOW AND GAVE ME THE TOLL FREE NUMBER TO MAZDA.  I CALLED FROM THEIR FACILITY AND FOUND OUT THAT THERE WAS AN OPEN RECALL FOR THE ABS MODULE.  I EXPLAINED THAT TO THE SERVICE PERSON.  THE MANAGER CAME OUT TO SPEAK WITH ME AND SAID THAT I WOULD HAVE TO TAKE IT TO MY INSURANCE COMPANY.  BECAUSE I HAD GEICO INSURANCE, THE MANAGER SAID THAT THERE WAS AN ADJUSTER ACROSS THE STREET FROM THEIR BLDG.  BY THIS TIME IT WAS 17:45.  I RENTED A VEHICLE TO GET MY FAMILY HOME AND CALLED THE CARMAX THAT I PURCHASED THE CAR FROM.  I SPOKE WITH LAURIE DOOLITTLE, THE MANAGER OF CARMAX IN CHARLOTTESVILLE, VIRGINIA, SHE ADVISED ME THERE WAS NOTHING THAT SHE COULD DO BUT SHE WOULD CHECK WITH SOMEONE HIGHER THAN HER.  SHE CALLED ME BACK AROUND 1805 AND SAID THAT IT IS UNFORTUNATE WHAT HAPPENED, HOWEVER \"THE ABS MODULE HAS NOTHING TO DO WITH THE BEING DRIVABLE\".  I WAS IN SHOCK.  ME AND MY FAMILY COULD HAVE BEEN KILLED!  WE ONLY HAD THE TRUCK 5 DAYS!  I CALLED THAT MORNING BEFORE ACCIDENT TO GET A 2004 MAZDA TRIBUTE WITH LOWER MILES AND LOWER PRICE TRANSFERRED IN TO THE CARMAX IN CHARLOTTESVILLE!  AFTER SEVERAL CALLS TO CARMAX'S CUSTOMER SVC (HEADQRTR) REPEATEDLY HEARING THAT I WAS AT FAULT FOR THE ACCIDENT BECAUSE I DID NOT REGISTER THE VEHICLE WITH MAZDA.  WENT TO CHVILLE CARMAX TO SPEAK W/LAURIE DOOLITTLE IN PERSON.    I ASKED HER TO REBUY THE CAR.  LAURIE SAID NO.  I HAD AN APPLICATION FROM CONSUMER AFFAIRS AND STARTED TO FILL IN THE BLANKS AND NOTED THE TIME AND DATE OF THE REQUEST TO REBUY THE CAR DUE TO THE RECALLS THAT WERE ON MY VIN.  (07/07/08   TIME  17:05)      TODAY 07/08/08, GEICO STILL WORKING ON IT!  *TR",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,PARKING BRAKE",
        "crash": true,
        "dateComplaintFiled": "07/02/2008",
        "dateOfIncident": "07/01/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10232976,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2003 MAZDA TRIBUTE ON JUNE 26, 2008.  THE CAR WAS WRECKED TODAY 7/1/08.  THE BRAKES FAILED TO OPERATE AND RAN INTO THE BACK OF A VAN IN FRONT OF US.      I TOOK THE VEHICLE BACK TO THE AUTO DEALER, EXPLAINED WHAT HAPPENED ( I HAD A 5 DAY RETURN POLICY)  I WAS TOLD THE VEHICLE IS NO LONGER ABLE TO RETURN BECAUSE IT WAS WRECKED.  THE DEALER ALSO SAID THAT THEY WERE NOT LIABLE FOR ANY FACTORY RECALLS.      THE DEALER GAVE ME THE TOLL FREE NUMBER TO CALL MAZDA.  IT TURNS OUT THAT THERE WAS A RECALL ON ABS BRAKES FOR MY VEHICLE AND IT WAS NEVER BROUGHT IN TO BE SERVICED.     I'M THANKFUL NO ONE WAS HURT.  I HAD DRIVEN 500 MILES PRIOR TO THE ACCIDENT AT SPEEDS FROM 5-70MPH.  WE COULD HAVE BEEN KILLED!!!!!!! *TR",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "06/19/2008",
        "dateOfIncident": "05/19/2008",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10231636,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MAZDA TRIBUTE.  THE CONTACT STATED THAT THE REAR HATCH DOOR WOULD NOT LOCK.  HE MADE SEVERAL UNSUCCESSFUL ATTEMPTS TO LOCK THE REAR HATCH.  HE CALLED THE MAZDA DEALER IN REGARDS TO NHTSA CAMPAIGN ID NUMBER 04V605000 (LATCHES/LOCKS/LINKAGES:HATCHBACK/LIFTGATE:LOCK) AND THEY STATED THAT HIS VIN WAS NOT INCLUDED IN THE RECALL.  THE FAILURE MILEAGE WAS 72,000 AND CURRENT MILEAGE WAS 75,000.",
        "vin": "4F2YZ04153K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/14/2008",
        "dateOfIncident": "05/15/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10221177,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MAZDA TRIBUTE.  WHILE DRIVING BETWEEN 45-65 MPH, THE VEHICLE MAKES A LOUD VIBRATING SOUND AS IF THE TRANSMISSION WAS FAILING.  THE CONTACT FEELS THAT THE DRIVESHAFT WILL SPIT IN HALF.  THE FINAL ASSESSMENT WAS THAT THE TORQUE CONVERTER NEEDED TO BE REPLACED.  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT MILEAGE WAS 91,000 AND FAILURE MILEAGE WAS 87,000.",
        "vin": "4F2YZ94163K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "12/06/2007",
        "dateOfIncident": "05/10/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211094,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHENEVER I DRIVE MY VEHICLE FOR ANY EXTENDED AMOUNT OF TIME IT SMELLS AS THOUGH SOMETHING IS BURNING WHEN I STOP. THE SMELL SEEMS TO BE COMING FROM AROUND THE FRONT WHEELS. THE SMELL IS ESPECIALLY STRONG ON THE DRIVERS SIDE. I RECEIVED A RECALL NOTICE EARLIER ON THIS YEAR FOR A FAULTY BRAKE/ABS SWITCH. I TOOK THE VEHICLE IN TO A LOCAL MAZDA DEALER WHO SAID THERE WAS NOTHING WRONG WITH THE VEHICLE HENCE THEY REPLACED NOTHING. I AM FILING THIS COMPLAINT AS THERE MIGHT BE OTHERS HAVING THIS SAME PROBLEM.  *TR",
        "vin": "4F2CZ06113K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "11/15/2007",
        "dateOfIncident": "10/29/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209096,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "(1) AIRBAG LIGHT ILLUMINATED ON  2003 MAZDA TRIBUTE DASHBOARD DURING RETURN TRIP HOME FROM FAMILY GATHERING.    (2) TROUBLE CODES IDENTIFIED AT MAZDA DEALERSHIP WHERE CAR WAS PURCHASED:        B1994 DRIVER-SIDE SIDE AIR BAG MODULE CIRCUIT RESISTANCE HIGH        B1998 PASSENGER-SIDE SIDE AIR BAG MODULE CIRCUIT RESISTANCE HIGH     INFORMED BY DEALERSHIP THAT AIRBAGS MAY DEPLOY AT ANY TIME OR MAY NOT DEPLOY IN CASE OF A COLLISION. REPAIRS NECESSARY FOR PROPER AIRBAG FUNCTION.    (3) AS PER TSB 0800205 AND SERVICE KIT 1L84-14293-AA PROBLEMS ADDRESSED BY DEALERSHIP TECHNICIAN AND AIRBAG LIGHT NO LONGER ILLUMINATED.     CHARGE $338.37 PARTS AND LABOR.    MAZDA AND IT'S DEALERSHIPS HAVE PROFITED BY REPAIRING, WITH MAZDA CERTIFIED PARTS, A KNOWN SAFETY ISSUE THAT COULD ENDANGER THE LIVES AND SAFETY OF MAZDA OWNERS AND THEIR PASSENGERS IF NOT ADDRESSED.     THERE IS A TSB AND SERVICE KIT DESIGNED TO ADDRESS THIS EXACT PROBLEM. THIS INDICATES MAZDA IS AWARE OF THE PROBLEM AND IS PREPARED TO REPAIR IT AT THE COST OF IT'S CUSTOMERS. WHEN BUYING A PRODUCT (A VEHICLE ESPECIALLY) SAFETY IS ASSUMED.     WHEN  THERE IS A KNOWN SAFETY HAZARD CAUSED BY THE PRODUCT, DUE TO MALFUNCTION OR NEGLIGENCE, IT IS THE MANUFACTURER'S TO CORRECT THE HAZARD. NOT THE CUSTOMER.  *TR",
        "vin": "4F2CZ94193K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/08/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208460,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OIL PAN GASKET IS LEAKING.  I CALLED MAZDA CUSTOMER SERVICE, RECEIVED A FILE #115785220.  MY 2003 MAZDA TRIBUTE (5 YEARS OLD WITH 35,000 MILES) IS LEAKING OIL FROM THE OIL PAN GASKET.  MY VEHICLE IS NO LONGER UNDER WARRANTY.  SINCE I PURCHASED MY VEHICLE, MAZDA HAS REDESIGNED THE OIL PAN WITH AN EMBEDDED O RING IN LIEU OF A GASKET.  THE LOCAL MAZDA SERVICE CENTER (MAZDA 112) DOES NOT REPLACE THE GASKET; THEY FIX THE VEHICLE BY SELLING AND INSTALLING THE REDESIGNED OIL PAN FOR $440 + TAX (MEDFORD, NY).  YOU CAN BUY A GASKET FOR THE ORIGINAL PAN AND DO IT YOURSELF OR MAYBE HAVE A LOCAL MECHANIC DO IT (I DON'T KNOW IF IT'S WORTH IT).  MAZDA 112 TOLD ME THEY CALLED THE REGIONAL MAZDA REPRESENTATIVE AND THEY WOULD SAVE ME THE PRICE OF THE PARTS BUT THE COST OF REPAIR WILL STILL BE OVER $300.  I BELIEVE THIS PROBLEM IS DUE TO A MANUFACTURER DEFECT AND MAZDA IS NOT ADDRESSING THE ISSUE.\"  I HAVE CALLED MAZDA TWICE AND EMAILED THEM.  THE REPRESENTATIVES ARE POLITE BUT COULD NOT TELL ME IF THE OIL PAN WAS REDESIGNED BECAUSE THE ORIGINAL DESIGN WAS DEFECTIVE???  THEN WHY THE REDESIGN?  ON THE INTERNET I HAVE VIEWED MANY COMPLAINTS OF LATE MODEL MAZDA TRIBUTE OWNERS WITH \"OIL PAN LEAKS.\"    *TR",
        "vin": "4F2CZ96143K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "05/30/2007",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10192057,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MAZDA TRIBUTE.  THE CONTACT RECEIVED RECALL NOTICE # 07V157000 (SERVICE BRAKES, HYDRAULIC:ANTILOCK:CONTROL UNIT/MODULE).  HE TOOK THE VEHICLE TO THE DEALER TO INSPECT THE AIR BAGS BECAUSE THE INDICATOR LIGHT CONTINUED TO ILLUMINATE ON THE INSTRUMENT PANEL.  HE BELIEVES THIS FAILURE IS SIMILAR TO THE FAILURE STATED IN THE RECALL.  THE MAZDA DEALER WILL NOT DO ANYTHING BECAUSE THE MANUFACTURER MUST ISSUE THE RECALL. MAZDA WILL NOT ISSUE A RECALL UNLESS THEY ARE PRESSURED TO DO SO BY NHTSA.  THE CONTACT HAS TO PAY $375 FOR THE AIR BAG INDICATOR LIGHT.  THE MECHANIC REPLACED THE WIRING HARNESS.  WHEN THE LIGHT WAS ILLUMINATED, THE AIR BAGS WOULD NOT DEPLOY DUE TO THE FAILED CONNECTION.  THE ENGINE SIZE WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 50,000.",
        "vin": "4F2CZ04183K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "04/13/2007",
        "dateOfIncident": "02/05/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187753,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON FEBURARY 5,2007 THE TRANSMISSION IN MY MAZDA TRIBUTE WENT. I HAVE ONLY 61,000 MILES ON THE VEHICLE AT THE TIME AND HAVE OWNED THE VEHICLE SINCE 11/2002. THE REASON FOR MY FILING THE COMPLIANT IS THE RECALL SHOWN IN DATA REGARDING THE TRIBUTE TRANSMISSION. I HAD TO REPLACE THE TRANSMISSION AT MY OWN COST. I WAS NEVER INFORMED ABOUT THIS RECALL BY MAZDA.*AK",
        "vin": "4F2YZ94153K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/30/2007",
        "dateOfIncident": "03/30/2007",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10186604,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WIFE DROVE 2003 MAZDA TRIBUTE TO ARBY'S (I WAS MEETING HER THERE), GOT OUT OF CAR AND WALKED UP TO THE ENTRANCE.  AS SHE GOT TO ARBY'S DOOR, SOMEONE OUTSIDE MENTIONED TO HER THAT HER CAR WAS SMOKING.  SHE CAME INSIDE TO GET ME AND AS I CAME OUT A LOT OF SMOKE WAS COMING OUT OF THE ENGINE COMPARTMENT.  I UNLOCKED THE CAR CRACKED THE HOOD SLIGHTLY WHERE I SAW FLAMES CLOSE TO THE FIREWALL.  USED FIRE EXTINGUISHER TO PUT OUT FLAMES.  FIRE SEEMED TO ORIGINATE TOWARDS THE BACK OF THE ENGINE CLOSE TO BRAKE MASTER CYLINDER.  I HAVE MANY PICTURES OF THE ENGINE COMPARTMENT IF NEEDED.  SEEMS SIMILAR TO NHTSA ACTION # PE06048.  *JB",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/20/2007",
        "dateOfIncident": "03/20/2007",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10185636,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE CAUGHT ON FIRE  WHILE PARKED IN FRONT OF HOUSE. IT HAD NOT BEEN DRIVEN SINCE THE NIGHT BEFORE. DAMAGE WAS LIMITED TO ENGINE COMPARTMENT. IT APPEARED  TO HAVE ORIGINATED FROM THE ANTI-LOCK BRAKING ELECTONIC CONTROL MODULE DIRECTLY BELOW THE POWER STEERING RESERVOIR. THE CAR HORN/ALARM STARTED BEEPING, AND OWNER OF CAR RESPONDED TO SEE SMOKE COMING FROM THE HOOD. OWNER OPENED THE HOOD AND OBSERVED FIRE FROM THE ELECTRICAL COMPONENTS. THE FIRE DEPARTMENT WAS IMMEDIATELY CALLED.*AK",
        "vin": "4F2CZ06143K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/05/2007",
        "dateOfIncident": "03/05/2007",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184225,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MAZDA TRIBUTE 2003 ONLY 30,300. MILES TOOK IN FOR GENERAL SERVICE TO BE INFORMED MY BRAKES & ROTORS NEED TO BE REPLACED AT ONCE COULD BE A SAFETY ISSUE. ROTORS HAD UNUSUAL WEAR PATTERN & PADS WERE WORN SMOOTH. I UNDERSTAND THE TWO MATERIALS ARE NOT WORKING TOGETHER AND PADS ARE HARDER THAN ROTOR MATERIAL. THIS IS A SAFETY ISSUE WHICH COULD RESULT IN BRAKE FAILURE OR FIRE.   *JB",
        "vin": "4F2YZ04103K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/09/2006",
        "dateOfIncident": "12/09/2006",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10175677,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "JUST BOUGHT A 2003 MAZDA TRIBUTE FROM TOYOTA OF NICHOLASVILLE 3 WEEKS AGO. WENT OUT TO THE GARAGE TO START IT THIS MORNING AND THE THING CAUGHT FIRE. PUT IT OUT WITH FIRE EXTINGUISHER. THE AIR FILTER AREA IS BURNED AND MELTED. MY WIFE NO LONGER FEELS SAFE DRIVING THIS VEHICLE(ISN'T REPAIRED YET), WITH OUR YOUNG CHILD STRAPPED IN THE CAR SEAT. I SUSTAINED SMALL BURNS TO MY HANDS PUTTING THE FIRE OUT.  *JB",
        "vin": "4F2CZ06163K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/01/2006",
        "dateOfIncident": "11/17/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174888,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AUTOMATIC TRANSMISSION FAILURE ON 2003 MAZDA TRIBUTE ES (AWD & 4WD) WITH 100,000 MILES.  TRANSMISSION CUT OUT WHILE DRIVING AND WOULD NOT SHIFT INTO ANY FORWARD GEAR.  ONLY REVERSE WAS FUNCTIONAL AND APPARENTLY NOT AFFECTED BY FAILURE.  HAD SUV HAULED ON FLAT-BED TO DEALER WHO INITIALLY INDICATED THAT IT WAS PROBABLY THE LINKAGE, BUT THEY COULD NOT GET IT TO SHIFT INTO ANY FORWARD GEAR EITHER (ONLY REVERSE).  UPON FURTHER INSPECTION DEALER INDICATED TRANSMISSION WAS BLOWN, REQUIRING A COMPLETE REPLACEMENT, COSTING ALMOST $4K.  *NM",
        "vin": ""
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "11/27/2006",
        "dateOfIncident": "11/27/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10174456,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE ATTEMPTING TO CLOSE THE REAR HATCH, THE LIFT GATE WAS DIFFICULT TO LOCK INTO PLACE.  THE VEHICLE WAS INSPECTED BY A DEALER, WHO DETERMINED THE LIFT GATE LOCK NEEDED TO BE REPLACED.  THERE WAS A NHTSA RECALL, # 04V605000, REGARDING THE LIFT GATE LOCK.  THE VEHICLE WAS NOT INCLUDED IN THE RECALL DUE TO THE VIN.  THE MANUFACTURER WAS ALERTED.",
        "vin": "4F2YZ92B43K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/26/2006",
        "dateOfIncident": "09/05/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169329,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING 40 MPH, A HUMMING NOISE WAS HEARD FROM UNDER THE FRONT OF THE VEHICLE FOR TWO MONTHS.  THE VEHICLE WAS DRIVEN TO THE DEALER WHO REPLACED THE FRONT BEARINGS.",
        "vin": "4F2CZ06153K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "08/27/2006",
        "dateOfIncident": "08/25/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166652,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 8-25-2006 MY TRIBUTE WAS TOWED TO STAR MAZDA OF GLENDALE.  THE PCM WAS RECALLED AND NEEDED TO BE REPAIRED, BUT THE BATTERY AND ALTERNATOR WHERE RUINED. ROUGHLY TWO WEEKS PRIOR TO TODAY, THESE TWO ITEMS HAD BEEN REPLACED AT A COST OF $900. THESE REPAIRS WHERE MADE BY MY MECHANIC WITHOUT MY AUTHORIZATION, WHILE I WAS ATTEMPTING TO VERIFY THE WARRANTY ON THE TRIBUTE.       ONCE THE VEHICLE ARRIVED AT STAR MAZDA, I WAS TOLD I NEEDED TO AUTHORIZE AN EIGHTY FIVE DOLLAR EXAMINATION FEE BECAUSE THE BATTERY WAS NOW DEAD. AN EXPLANATION INDICATED THAT THIS FEE WAS APPLIED BECAUSE THE BATTERY WAS NOT A MAZDA BATTERY AND HAD NOT BEEN INSTALLED BY A MAZDA MECHANIC. AN EMPLOYEE THEN PROCEEDED TO TELL ME THAT ALTHOUGH MY VEHICLE WAS UNDER WARRANTY, I WAS GOING TO BE CHARGED $1,100 TO REPLACE BOTH THE BATTERY AND THE ALTERNATOR. ON TOP OF THAT I WAS TOLD THAT THE PCM WOULD NOT BE REPAIRED UNTIL THE NON-MAZDA PRODUCTS WERE REMOVED AND REPLACED. FOLLOWING THAT LAST BIT OF NEWS, I WAS INFORMED THAT I WAS NOT ENTITLED TO A RENTAL.     I AM OUTRAGED OVER THE FACT THAT I WAS NEVER NOTIFIED BY WEST COVINA MAZDA OF THESE RECALLS! THEY ARE CLEARLY SERIOUS DEFECTS AND COULD HAVE RESULTED IN A COLLISION.    IT IS MY OPINION THAT THE FAULTY PCM DESTROYED A BRAND NEW ALTERNATOR AND BATTERY IN LESS THAN TWO WEEKS.  *JB",
        "vin": "4F2CZ06113K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/17/2006",
        "dateOfIncident": "07/17/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10162542,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "HOOD",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AT 38,800 MILES, I HAD TO REPLACE MY BRAKES PAD AND ROTORS, NOW AT 49,785 I WILL NEED TO REPLACED MY ROTORS AGAIN.  I BELIEVE THESE ROTORS ARE DEFECTED.  PLEASE INVESTIGATE THIS ISSUE.  *JB",
        "vin": "4F2YZ04173K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/29/2006",
        "dateOfIncident": "02/28/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10161091,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE RAN HEAD ON INTO A TELEPHONE POLL AT A SPEED OF APPROXIMATELY 30 MPH.  AIRBAG DID NOT DEPLOY.  *JB",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/16/2006",
        "dateOfIncident": "05/02/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10160004,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING ABOUT 30 MPH, WITH ACCELERATOR PRESSURE APPLIED, THE ACCELERATOR PEDAL PULLED TO THE FLOOR WITHOUT WARNING.  THE VEHICLE ACCELERATED AT A HIGH SPEED ONTO THE HIGHWAY.  THE CONTACT ATTEMPTED TO DISENGAGE THE ACCELERATOR PEDAL BY PUMPING THE PEDAL SEVERAL TIMES WITHOUT SUCCESS.  THE VEHICLE SLOWLY RESPONDED TO BRAKE PRESSURE AND THE VEHICLE WAS PLACED IN PARK.  WHILE PARKED, THE ENGINE REVVED UNTIL THE IGNITION WAS TURNED OFF.  THE VEHICLE WAS TOWED TO A DEALER WHO DETERMINED THE CASING ON THE CRUISE CONTROL CRACKED WHICH CAUSED THE CRUISE CONTROL CABLE TO STICK, ALTHOUGH THE CRUISE CONTROL WAS NOT ENGAGED AT THAT TIME.  THE DEALER REPLACED THE CRUISE CONTROL CASING AND CABLES WHICH CORRECTED THE PROBLEM.  THE VALVE COVER AND GASKET WERE REPLACED. UPDATED 07/07/06",
        "vin": "4F2YZ04173K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/09/2006",
        "dateOfIncident": "06/09/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159413,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE HAD MY FRONT BRAKES REPLACED 3 TIMES AND ROTORS ONCE IN 50K MILES. IT STARTED AROUND 15K MILES WITH LOAD RUBBING NOISE WHEN BRAKES APPLIED.  *JB",
        "vin": "4F2YZ04143K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2006",
        "dateOfIncident": "05/16/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157658,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IS SOMETIMES HARD TO START AND IT STALLS FREQUENTLY IN TRAFFIC. A TUNE-UP WAS DONE, FUEL SYSTEM PARTS REPLACED. DEALER RECENTLY REPROGRAMMED THE PCM WITH NO CHANGE IN PERFORMANCE.  NEAR ACCIDENT THIS MORNING WITH A SCHOOL BUS. VEHICLE JUST CUT OFF AS I SLOWED TO MAKE A RIGHT TURN.  *JB",
        "vin": "4F2CZ06103K"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/03/2006",
        "dateOfIncident": "02/23/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156723,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT DRIVER SEAT ASSEMBLY MOVES 1/4 INCH TO 1/2 INCH ON SEAT TRACK WHILE CAR IS IN MOTION. DURING ACCELERATION SEAT ASSEMBLY MOVES BACKWARDS; SEAT MOVES FORWARD DURING SLOW DOWN/BRAKING. DEALER CLAIMS THIS ONLY OCCURS IN VEHICLES WITH ELECTRIC FRONT SEATS.  *JB",
        "vin": "4F2CZ96153K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/21/2006",
        "dateOfIncident": "02/28/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10153357,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HIT A TELEPHONE POLE AT AN ESTIMATED SPEED OF 36 MPH AND THE FRONT AIRBAG DID NOT OPEN.  *JB",
        "vin": "4F2CZ96193K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/16/2006",
        "dateOfIncident": "03/16/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10152920,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MAZDA TRIBUTE 2WD V6 - BRAKES WORN AND AND ROTERS WORN AND RIPPLED BEYOND REPAIR AT 30,000 MILES. PER DEALER REP, THEY HAVE SEEN THIS PROBLEM ON MANY MAZDA TRIBUTES. DEALER REP STATED IF NOT REPLACED, HIGH POTENTIAL FOR BRAKES HEATING AND CAUSING FIRE. VEHICLE IS DRIVEN ABOUT 60% CITY DRIVING AND ABOUT 40% HIGHWAY DRIVING.  *NM",
        "vin": "4F2YZ041X3K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/31/2006",
        "dateOfIncident": "01/26/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10149101,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE THE CRUISE CONTROL IS ENGAGED, IF THE ACCELERATOR IS GENTLY APPLIED THE PEDAL PULLED DOWN TO THE FLOOR.  THE VEHICLE SUDDENLY LURCHED FORWARD.  THE CONTACT PULLED OVER AND PLACED THE VEHICLE IN NEUTRAL.  WITH THE ACCELERATION SUBDUED, THE ENGINE WAS TURNED OFF AND ON, BUT THE ACCELERATOR PEDAL REMAINED ON THE FLOOR.  THE VEHICLE WAS SEEN BY A DEALER, BUT THE DEALER WAS UNABLE TO DUPLICATE THE PROBLEM.  THE VEHICLE WAS SEEN BY A SECONDARY DEALER.  ALTHOUGH THE DEALER WAS UNABLE TO DUPLICATE THE PROBLEM AS WELL, THE DEALER REPLACED THE ACCELERATOR CABLE AND CRUISE CONTROL.  THE VEHICLE HAS NOT BEEN DRIVEN TO DETERMINE IF THIS REPAIR REMEDIED THE PROBLEM.",
        "vin": "4F2CZ94133K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "01/09/2006",
        "dateOfIncident": "01/06/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147318,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A ROUTINE MAINTENANCE VISIT, I REQUESTED THAT THE FRONT DISC BRAKES BE INSPECTED AND SERVICED IF DEEMED NECESSARY ON THIS VEHICLE.  THE MILEAGE AT THE TIME WAS 38,400 AND THE VEHICLE HAD BEEN SERVICED ON MULTIPLE OCCASIONS BY THE MAZDA DEALERSHIP FROM WHICH IT WAS PURCHASED.  THE SERVICE ADVISOR CALLED ME TO INFORM ME THAT THE BRAKE ROTORS WERE WORN AND WOULD HAVE TO BE REPLACED TO ENSURE THE VEHICLE REMAINED SAFE TO OPERATE.  THEY REFUSED TO REPLACE THE BRAKE PADS ALONE.  WHEN I RETRIEVED THE VEHICLE (WITHOUT THE BRAKES BEING SERVICED), I INSPECTED THE ROTORS TO FIND A VERY UNUSUAL WEAR PATTERN ON THE ROTORS.  THE PADS (WHICH HAD SEVERAL THOUSAND MILES LEFT TO GO)  HAD \"CUT\" A PERFECTLY SMOOTH/FLAT GROOVE INTO THE ROTOR SURFACES ACROSS THE ENTIRE WIDTH OF THE PAD SURFACE - LEAVING A RAISED EDGE ON THE  INNER AND OUTER EDGES OF BOTH SIDES OF THE ROTORS ON THE DRIVER AND PASSENGER SIDES.  IT APPEARS THAT THE BRAKE PAD MATERIAL IS HARDER THAN THE ROTOR MATERIAL AND THE WEAR ON THE ROTOR WAS EQUIVALENT TO THE WEAR OF THE PADS.  *NM",
        "vin": "4F2CZ06193K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/05/2006",
        "dateOfIncident": "01/04/2006",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146998,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED WHILE DRIVING HOME AT 25 MPH THE VEHICLE SUDDENLY ACCELERATED WITHOUT WARNING.  THE EMERGENCY BRAKE HAD TO BE ENGAGED AND THE KEYS REMOVED FROM THE IGNITION BEFORE THE VEHICLE STOPPED. WHEN THE VEHICLE WAS RESTARTED THE ENGINE REVVED TO THE MAXIMUM RPMS. AFTER FIVE MINUTES  THE VEHICLE RESTARTED  AND IT OPERATED NORMALLY. AFTER THE VEHICLE WAS DRIVEN HOME IT WAS TOWED TO THE LOCAL DEALER. WHEN THE TOW TRUCK OPERATOR STARTED THE VEHICLE HE EXPERIENCED THE SAME PROBLEM WITH THE ENGINE REVVING TO THE MAXIMUM RPMS. AT THE DEALERSHIP THE MECHANIC ALSO OBSERVED THE ENGINE REVVING AT THE HIGHEST RPMS. THIS VEHICLE WAS REPAIRED UNDER NHTSA RECALL CAMPAIGN  04V583000 CONCERNING THE VEHICLE SPEED CONTROL IN MARCH 2005. THE CONTACT WAS CONCERNED THAT RECALL REPAIRS  DID NOT REMEDY THE PROBLEM. THE VEHICLE IS CURRENTLY UNDERGOING DIAGNOSTIC TESTING. *AK",
        "vin": "4F2CZ06113K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/17/2005",
        "dateOfIncident": "10/17/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140002,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE DESCRIPTION: 2003 MAZDA TRIBUTE LX AWD - PURCHASED BRAND NEW FROM ROTO MAZDA OF ARLINGTON HEIGHTS, IL. ALL SERVICES LIKE REGULAR OIL CHANGES WERE DONE WITHIN THE RECOMMENDED TIME.   COMPLAINT: THE VEHICLE STALLS WITHOUT ANY WARNING. WE TOOK THE VEHICLE TO THE DEALER FEW TIMES WHILE IT WAS IN WARRANTY (LESS THAN 36000 MILES). THE DEALER ASSURED THAT THE SAFETY RECALL FOR MAZDA TRIBUTE IS ALREADY IN PLACE. THEY COULDN'T FIND ANYTHING WRONG WITH THE SUV. THE VEHICLE STALLED AGAIN YESTERDAY WHILE I WAS PULLING OUT OF THE DRIVEWAY (ON REVERSE) IT CAME TO A STOP AND DIED.(THIS IS THE SECOND TIME IN LAST SIX MONTHS) I HAD TO RESTART THE CAR. IT STARTS IMMEDIATELY. IT STALLED TODAY. I WAS WAITING AT A TRAFFIC SIGNAL AND WHEN IT TURNED GREEN, I STARTED TO ACCELERATE AND IT DIED. (THIS HAPPENED ABOUT 4 TIMES IN LAST SIX MONTHS) I AM AFRAID THAT ONE OF THESE DAYS I AM GOING TO GET REAR ENDED. WE TOOK IT TO THE DEALER TWO TIMES WITH THE SAME COMPLAINT AND THEY COULDN'T FIND ANY THING WRONG WITH THE VEHICLE. DO I HAVE A LEMON? DID YOU RECEIVE SIMILAR COMPLAINTS ? MY CAR HAS 36300 MILES NOW AND OTHERWISE EXCELLENT CONDITION. THANK YOU.*JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/13/2005",
        "dateOfIncident": "08/11/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10136410,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PURCHASED MAZDA TRIBUTE NEW NOVEMBER 2003.  TWO MONTHS AFTERWARD THE CAR STALLED AND THE ELECTRICAL SYSTEM CLOSED DOWN.  I HAD DIFFICULTY TURNING THE KEY IN THE IGNITION, IT LOCKED.  AFTER FOUR EFFORTS TO CRANK THE CAR, THE IGNITION UNLOCKED AND THE ENGINE STARTED.  I NOTICED THAT THE CLOCK HAD STOPPED.  THE DEALERSHIP STATED THAT THEY COULD NOT TELL WHAT THE PROBLEM WAS UNLESS IT HAPPENED WITH THEM.  SINCE NOVEMBER 2003 THIS HAS HAPPENED FOUR TIMES.  THE SEASON NOR WEATHER CONDITIONS DO NOT APPEAR TO MATTER.  THE LATEST INCIDENT WAS IN AUGUST 2005 IT WAS THE WORST.  THE ENGINE WOULD NOT TURN OVER UNTIL AFTER FIVE TRIES, RIGHT AFTER THIS I DROVE ABOUT 50 YARDS THEN IT STALLED AND IT TOOK AN ADDITIONAL THREE TRIES TO GET THE ENGINE TO START. I DROVE ABOUT ANOTHER 200 YARDS, IT STALLED AGAIN. IT APPEARS THIS PROBLEM IS BECOMING WORSE. *JB",
        "vin": "4F2CZ96123K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/08/2005",
        "dateOfIncident": "03/01/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132490,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS STALLED IN MAJOR INTERSECTIONS ON AT LEAST 10 OCCASIONS WHEN REMOVING FOOT FROM GAS. VEHICLE HAS BEEN REPAIRED BY DEALER ON 4 OCCASIONS, REPLACING THE IAC VALVE WITH UPDATED MODELS ON AT LEAST TWO SEPARATE OCCASIONS. NHTSA CAMPAIGN ID NUMBERS: 04V583000 AND/OR 04V175000 HAVE DEALT WITH SIMILAR COMPLAINTS. MAZDA NORTH AMERICA IS NOW REQUIRING ME TO DO AN \"EXTENSIVE TEST DRIVE ON PUBLIC ROADS IN VERO BEACH, FLORIDA WITH THEIR REPRESENTATIVE IN ORDER TO DUPLICATE MY CONCERN\".  I HAVE INFORMED MAZDA NORTH AMERICA BY MAIL ON TWO OCCASIONS AND BY TELEPHONE ON FOUR OCCASIONS THAT THIS VEHICLE IS INHERENTLY DANGEROUS AND WILL CAUSE INJURY TO SOMEONE. I HOLD MAZDA NORTH AMERICA RESPONSIBLE FOR ANY SUCH INJURIES. RUSH D. LAWSON. I ASK THE NHTSA TO INVESTIGATE THIS COMPLAINT AND TO INQUIRE AS TO WHY MAZDA NORTH AMERICA IS KNOWINGLY PLACING CONSUMERS AND INNOCENT INDIVIDUALS ON THE STREETS AT RISK IN A VEHICLE WHICH IS KNOWN TO BE INHERENTLY DANGEROUS.  *NM  *JB",
        "vin": "4F2YZ04133K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "08/06/2005",
        "dateOfIncident": "07/19/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131810,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING THE LAST 30 DAYS, MY AIRBAG LIGHT HAS LIT UP. MAZDA FIRST REPLACED THE PASSENGER SIDE RESTRAINT. THE SECOND TIME THEY REPLACED THE CONTROL MODULAR FOR THE SRS. THE THIRD TIME, THEY CLAIM A CABLE WAS LOOSE, THEY TIGHTENED IT. THE DEALER TELLS ME IT IS AN ONGOING PROBLEM THEY HAVE HAD WITH THE 2003 AND PART OF 2004 TRIBUTES. HOWEVER; THEY HAVE OFFERED ME A FREE OIL CHANGE SO I WOULDN'T FILE A COMPLAINT.  *JB",
        "vin": "4F2YZ94123K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/25/2005",
        "dateOfIncident": "12/01/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10119157,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCIDENT INVOLVING MAZDA TRIBUTE WHEREIN THE ACCELERATOR BECAME STUCK.*MR  THE ATTORNEY REQUEST INFORMATION ON BEHALF OF CLIENT WHO WAS INJURED WHEN HER VEHICLE ACCELERATED SUDDENLY.  THE VEHICLE WAS TOTALED.  *NM",
        "vin": "4F2YZ94163K"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/23/2005",
        "dateOfIncident": "04/22/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118302,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN AN 2003 ES 4X4; DURING MY LAST TWO SCHEDULED MAINTENANCE INSPECTIONS I NOTICED THE REAR SHOCKS STARTED LEAKING. THEY HAVE BEEN REPLACED TWICE AND ARE GETTING READY TO BE REPLACED AGAIN. WE DON'T GO OFF ROAD WITH THIS VEHICLE SO THE ONLY THING I COULD THINK IS THAT THE FACTORY MOTORCRAFT PARTS ARE DEFECTIVE OR NOT PROPERLY MATCHED TO THIS VEHICLE. IF YOU SEE AN OILY RESIDUE ON YOUR SHOCKS THEY NEED TO BE REPLACED DUE TO LEAKAGE. *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/18/2005",
        "dateOfIncident": "04/17/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10118058,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CATASTROPHIC FRONT DISC BRAKE FAILURE ON 2003 MAZDA TRIBUTE AFTER ONLY 56,651 MILES, REQUIRING COMPLETE REPLACEMENT OF BOTH FRONT DISC PADS AND BOTH FRONT ROTORS.  DEALER INDICATED THAT THEY WERE SEEING EXCESSIVE WEAR, AND FREQUENT REPLACEMENT ON FRONT DISC BRAKES, WHICH INDICATED THAT THEY WERE UNDER DESIGNED BY MAZDA OR THAT MAZDA WAS USING INFERIOR QUALITY BRAKE PADS.*AK",
        "vin": "4F2CZ96113K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "03/30/2005",
        "dateOfIncident": "02/09/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10111725,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE, THE ACCELERATOR STUCK.  THE CONSUMER PULLED OFF THE ROAD DUE TO HEAVY FOG BUT THE VEHICLE WENT INTO THE LAKE.   *NM   RECALL CAMPAIGN# 04V583000.   *SC  *JB",
        "vin": "4F2YZ04153K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/24/2005",
        "dateOfIncident": "03/08/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114588,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MAZDA TRIBUTE.  I RECEIVED A RECALL NOTICE IN LATE FEBRUARY JUST BEFORE GOING ON A BUSINESS TRIP ABOUT AN \"ACCELERATOR CABLE\" PROBLEM. SHORTLY AFTER I RETURNED FROMMY TRIP AND BEFORE I COULD BRING THIS VEHICLE TO THE DEALER I EXPERIENCED THIS PROBLEM WHILE ON THE HIGHWAY AT 65 MPH !!!!!!  IT WAS ICY AND SNOWY AND IN TRAFFIC !!! THE CAR WOULD NOT SLOW DOWN. I HONKED THE HORN, PUT ON FLASHERS AND WAIVED PEOPLE OUT OF MY WAY, GOT TO THE SIDE OF THE ROAD, SLAMMED ON THE BRAKES AND WHEN I GOT SLOW ENOUGH, THREW IT IN PARK AND PULLED THE KEY.    MAZDA ROADSIDE ASSISTANCE TOWED THE CAR, GAVE ME A RENTAL AND FIXED THE PROBLEM, BUT I COULD HAVE DIED! THIS WAS BAD - REALLY BAD!  I AM SO THANKFUL THAT MY WIFE WAS NOT DRIVING THE CAR !!!!    I UNDERSTAND THAT SINCE THEY SENT A RECALL NOPTICE OUT, THEY FEEL THERE IS NOTHING MORE THAT COULD HAVE BEEN DONE, BUT I DISAGREE !!!   THIS IS A LIFE-THREATENING PROBLEM!  THEY SHOULD CALL, OR DO SOMETHING TO MAKE SURE THAT THIS RECALL IS PERFORMED IMMEDIATELY!  FAILURE TO DO SO COULD RESULT IN SERIOUS ACCIDENT OR DEATH. MAZDA SENDS OUT SO MUCH MAIL, THAT I AM WORRIED MANY PERSONS MIGHT DISREGARD AND NOT EVEN KNOW ABOUT THE RECALL. GREATER EFFORTS SHOULD BE MADE TO NOTIFY TRIBUTE OWNERS OF THE PROBELM AND URGE THEM TO GET THE RECALL REPAIR PERFORMED IMMEDIATELY!    I WAS VERY VERY FORTUNATE, BUT I IMAGINE THAT OTHERS WILL NOT BE.",
        "vin": "4F2CZ94113K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/16/2005",
        "dateOfIncident": "11/01/1993",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115224,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE WOULD INTERMITTENTLY STALL WHILE IN STOP AND GO TRAFFIC.  VEHICLE  WAS TAKEN  TO THE DEALER ON FOUR SEPARATE OCCASIONS, AND THEY COULD NOT DUPLICATE THE PROBLEM.*AK",
        "vin": "4F2YZ94163K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/10/2005",
        "dateOfIncident": "01/18/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10111295,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 40 MPH  VEHICLE ACCELERATED. AS A RESULT, CONSUMER'S VEHICLE REAR ENDED ANOTHER VEHICLE. NO INJURIES REPORTED.  CONSUMER STATED TWO WEEKS LATER A RECALL FOR THE ACCELERATOR PEDAL WAS ISSUED. *AK",
        "vin": ""
    },
    {
        "components": "PARKING BRAKE,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/06/2005",
        "dateOfIncident": "01/06/2005",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10105860,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE FAILURE, PASSENGER SEAT HEATER TURNS ITSELF ON, CD PLAYER FAILURE, RADIO FAILURE.  *AK",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "01/05/2005",
        "dateOfIncident": "09/25/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106829,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR  PEDAL GETS STUCK IN IDLE POSITION. BY APPLYING FORCE, THEN ACCELERATOR PEDAL MOVES BUT VEHICLE TAKES OFF ERRATICALLY. IT HAPPENS WHEN ENGINE IS COLD AND HOT. *AK",
        "vin": "4F2CZ06123K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/27/2004",
        "dateOfIncident": "11/04/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10104559,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELLATOR PEDAL IS HARDER TO PRESS DOWN, THEN IT WAS 15,000 MILES AGO.  IT DOES RETURN TO A PROPER IDLE SPEED AT THIS TIME.    PER MAZDA SERIVCE DEPARTMENT TECH, THE THROTTLE BODY COLLECTS A \"SOOT\", OR OILY EXHAUST OVER TIME, CAUSING THE THROTTLE BODY BUTTERFLY VALVE TO NOT MOVE FREELY.  THE CAUSE OF THIS CONDITION IN MAZDA TRIBUTE AND IN FORD ESCAPES IS A POOR DESIGN OF THE ENTRANCE OF EXHAUST GASSES TO BE REBURNED.  THE EXHAUST GASSES ARE RETURNED JUST IN BACK OF THE THROTTLE BODY, THEREBY CAUSING THE BUILDUP AND POSSIBLE MALFUNCTION OF THE THROTTLE BODY IN THE OPEN POSITION.  RECALL CAMPAIGN NUMBER 04V583000 DOES NOT COVER THIS PROBLEM, AS IT COVERS THE VEHICLE SPEED CONTROL CABLES.*AK",
        "vin": "4F2CZ96163K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "12/14/2004",
        "dateOfIncident": "12/12/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103722,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 40 MPH VEHICLE COMMENCED TO ACCELERATE. CONSUMER WAS ABLE TO DRIVE THE VEHICLE TO A SERVICE STATION. WHILE PARKED AND IDLING THE PROBLEM RECURRED. THIS TIME THE ACCELERATOR PEDAL WAS DOWN TO THE FLOOR. VEHICLE WAS TOWED TO THE DEALER, WHO INFORMED THE CONSUMER ACCELERATOR ASSEMBLY  BURNED OUT AND NEEDED TO BE REPLACED.*AK",
        "vin": "4F2CZ06133K"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "10/15/2004",
        "dateOfIncident": "10/15/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10096972,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT HER AIR BAG LIGHTS STAYS ON ALL OF THE TIME.  SHE STATES SHE HAS TAKEN THIS VEHICLE BACK TO THE DEALER 6-7 TIMES, AND HAS BEEN TOLD SEVERAL DIFFERENT THINGS THAT CAUSES THIS PROBLEM.  ONCE SHE SAYS SHE WAS TOLD THAT SOMETHING IS WRONG WITH THE RETENTIONER, AND THEY WENT IN AND RESET THE COMPUTER.   *NM",
        "vin": "4F2YZ94143K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/29/2004",
        "dateOfIncident": "11/15/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10076254,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INTERMITTENTLY, THE VEHICLE HESITATES BEFORE STARTING WHEN THE KEYS ARE TURNED IN THE IGNITION.  ALSO, THE VEHICLE LOSES POWER WHILE DRIVING.  THE DEALERSHIP INDICATED THAT THEY ARE AWARE OF THIS PROBLEM AND PERFORMED THE REPAIRS INDICATED BY THE MANUFACTURER.  THE DEALERSHIP ALSO TEST DROVE THE VEHICLE AND THE FAILURE DIDN'T OCCUR IN THEIR PRESENCE SO THEY ARE REFUSING TO SERVICE THE VEHICLE.   *LA   *SC",
        "vin": "4F2YZ94163K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/09/2004",
        "dateOfIncident": "09/09/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090701,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION FAILED WITH LESS THAN 600 MILES ON THE CAR DUE TO A HOSE CLAMP NOT BEING SECURED DURING MANUFACTURE. EVER SINCE THEN I HAVE HAD PROBLEMS WITH THE CAR HESITATING AND ALMOST STALLING WHEN ACCELERATING FROM A STOP JUST AFTER STARTING THE CAR. IT ALSO HAPPENS MORE OFTEN IF THE CAR IS NOT LEVEL AT THE TIME, EITHER ON AN INCLINE OR DECLINE. IF I LET THE CAR WARM UP FOR A FEW MINUTES, I GENERALLY DO NOT HAVE THIS PROBLEM. I HAVE ALSO HAD A PROBLEM WITH THE GAS PEDAL FEELING LIKE IT STICKS OR IS CATCHING ON SOMETHING, I HAVE NOTICED THIS PROBLEM MORE OFTEN WHEN THE OUTSIDE TEMPERATURE IS BELOW 75 DEGREES. WHEN THE ACCELERATOR FINALLY ACTIVATES, THE CAR GENERAL LUNGES FORWARD OR WILL SPIN THE TIRES, I HAVE LEARNED TO LET MY FOOT OFF OF THE ACCELERATOR TO KEEP THE CAR UNDER CONTROL. I HAVE ALSO HAD PROBLEMS WITH THE CAR SHIFTING ABRUPTLY BETWEEN GEARS, BUT THIS HAS SUBSIDED QUITE A BIT. I HAVE ALSO FELT A VIBRATION IN THE CAR AROUND 45 AND 70 MPH. I DON'T FEEL THE VIBRATION IN THE STEERING WHEEL, IT FEELS LIKE IT IS COMING FROM THE MIDDLE OF THE CAR, MORE IN THE TRANSMISSION/DRIVETRAIN AREA. I HAVE HAD THE TIRES ROTATED A BALANCED 3 TIMES AND ALSO HAD THE ALIGNMENT CHECKED, BUT THE VIBRATION STILL OCCURS.  I HAVE TAKEN THE CAR BACK TO THE DEALERSHIP NUMEROUS TIMES AND THEY ALWAYS SAY THEY CAN NOT DUPLICATE THE PROBLEMS. I HAVE RESEARCHED ALL OF THE COMPLAINTS AND RECALLS FOR THE TRIBUTE AND THE FORD ESCAPE, SINCE THEY ARE BASICALLY THE SAME VEHICLE, AND THERE ARE QUITE A FEW SIMILAR COMPLAINTS. I THINK THE HESITATING PROBLEM IS RELATED TO THE RECALL FOR THE \"STALLING\" PROBLEM, I THINK THE PROBLEM IS MORE WIDESPREAD THAN THEY THOUGHT OR THE FIX FOR THE RECALL DID NOT SOLVE THE PROBLEM ENTIRELY.*AK",
        "vin": "4F2YZ04173K"
    },
    {
        "components": "AIR BAGS,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "08/03/2004",
        "dateOfIncident": "04/10/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086073,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "AIRBAG SYSTEMS, INC.",
                "productMake": "AIRBAG",
                "productModel": "SWITCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AIR BAG LIGHT COMES ON AND STAYING ON FOR OVER A PERIOD 6MONTHS EVEN WITH SEVERAL SERVICES CALLS WITH THIS PROBLEM THE AIR BAG WILL NOT EVN WORK IN AN ACCIDENT SITUATION.  *AK",
        "vin": "4F2YZ04183K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/30/2004",
        "dateOfIncident": "07/11/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083023,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DROVE MY 03 MAZDA TRIBUTE IN TYPICAL FLORDA AFTERNOON RAINSTORM VEHICLE STALLED IN MIDDLE OF ROAD ALMOST CAUSING VEHICLES FOLLOWING TO CRASH FROM BEHIND LUCKILY I COASTED OFF TO THE SIDE QUICKLY AFTER FEW TRIES RESTARTED VEHICLE  HOWEVER AFTER RESTARTED VEHICLE NOW MAKING LOUD RATTLING SOUND FROM ENGINE PROCEEDED TO DRIVE REST OF WAY HOME-ABOUT A MILE FROM WHERE STALLED PRIOR TO PULLING INTO DRIVEWAY LOUD POP & GRINDING FROM ENGINE COASTED INTO DRIVEWAY & REALIZED ENGINE BLOWN-OIL POURING OUT UNDERNEATH THINKING THIS WAS WARRANTY ISSUE (VEHICLE WELL MAINTAINED & ONLY YEAR OLD) TOOK VEHICLE TO LOCAL MAZDA DEALER FOR REPAIR AFTER HAVING VEHICLE  3 WEEKS THEY NOW TOLD ME THAT CAUSE OF STALL & BLOWING OF ENGINE WAS WATER FROM RAIN OR PUDDLES SPLASHING UP GOT INTO AIR INTAKE OF ENGINE WATER WAS PULLED INTO CYLINDERS WHERE IT CANT BE COMPRESSED & PISTON RODS BENT & BROKE UNTIL THEY PUNCTURED THROUGH BLOWING ENGINE DEALERS SERVICE DEPT STATED AIR INTAKE FOR VEHICLE IS LOCATED BEHIND FRONT GRILLE ABOUT HEADLIGHT LEVEL RIGHT WHERE MOST RAIN & SPLASHING WOULD END UP AT FRONT OF VEHICLE-SO NOT VERY WELL PROTECTED-WOULD NOT TAKE MUCH FOR WATER TO GET INTO CAUSING FAILURE MAZDA WOULD NOT REPAIR VEHICLE UNDER WARRANTY-RECOMMENDED MY AUTO INS WOULD PAY FOR REPAIR I FEEL THIS IS SERIOUS DESIGN FLAW WITH VEHICLE ESP CONSIDERING MANY SMALLER VEHICLES WERE DRIVING AROUND IN SAME CONDITIONS WITHOUT INCIDENT & IF THIS CAN HAPPEN TO ME IN THE CONDITIONS & SPEEDS I WAS DRIVING I WOULD THINK IT COULD BE POTENTIAL CAUSE OF FUTURE ACCIDENTS FROM THESE VEHICLES STALLING IN WET CONDITIONS NOT ONLY IS IT SAFETY CONCERN-ALSO WOULD BE CONSUMER CONCERN BECAUSE IT CAN BLOW ENGINE & IF MAZDA WONT REPAIR VEHICLES WHEN THIS HAPPENS THERE WILL BE MANY UPSET CONSUMERS MAZDA TRIBUTE & FORD ESCAPE ESSENTIALLY SAME VEHICLE SO THIS WOULD APPLY THERE ALSO I FEEL BOTH FORD & MAZDA SHOULD RECALL THESE VEHICLES & EITHER RELOCATE OR BETTER PROTECT AIR INTAKE SO THIS KIND OF THING SHOULD NOT HAPPEN.  *AK",
        "vin": "4F2YZ94183K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/29/2004",
        "dateOfIncident": "06/18/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10080170,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED NHTSA RECALL 04V175000 CONCERNING ENGINE STALLING.  THREE WEEKS AFTER HAVING  RECALL REPAIRS  PERFORMED AND  WHILE DRIVING AT LOW SPEEDS  VEHICLE STALLED. CONSUMER RESTARTED VEHICLE, AND TOOK IT BACK TO DEALER FOR INSPECTION.  HOWEVER,   MECHANIC COULD NOT DUPLICATE THE PROBLEM.  *AK",
        "vin": "4F2YZ04143K"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/24/2004",
        "dateOfIncident": "06/02/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075776,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT AN  IGNITION PROBLEM.  WHILE DRIVING 40 MPH, THE VEHICLE STALLED IN TRAFFIC.  *AK   THIS PARTICULAR MODEL WITH 4 WHEEL DRIVE, WOULD STOP WHEN STARTED AND WOULD INTERMITTENTLY STOP IN TRAFFIC.   *SC   *JB",
        "vin": "4F2YZ94163K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/22/2004",
        "dateOfIncident": "03/17/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071658,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN ACCELERATING THE VEHICLE FIRST HESITATED AND THEN ACCELERATED.  THE  DEALERSHIP WAS NOTIFIED BUT DID NOT RESOLVE THE PROBLEM. *AK   *NM",
        "vin": "4F2YZ94173K"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "05/03/2004",
        "dateOfIncident": "03/23/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071979,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING/BRAKING DRIVER'S SEAT  LURCHED FORWARD/BACKWARD 1 1/2 INCHES. DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/23/2004",
        "dateOfIncident": "04/23/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10071507,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED RECALL NOTICE CONCERNING FUEL PRESSURE REGULATOR.  NO PARTS WERE AVAILABLE.  SERVICE MANAGER BRIAN SHELTON.  *AK",
        "vin": "4F2YZ04103K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/17/2004",
        "dateOfIncident": "01/24/2004",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063393,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE STALLED WITHOUT WARNING.  *AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/19/2004",
        "dateOfIncident": "12/01/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10059403,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE CARGO CARRIER SLID OUT OVER THE ROOF, FRONT WINDSHIELD AND HOOD.   *PH   *JB",
        "vin": "4F2YZ041X3K"
    },
    {
        "components": "FUEL SYSTEM, OTHER,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/01/2004",
        "dateOfIncident": "02/12/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10051474,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER SITTING FOR 2 DAYS IN FEBURARY OF 2003, MY 2001 MAZDA TRIBUTE HAS A HARD START AND EXTRAME HESITATION WHEN DRIVING. LATER THE ENGINE LIGHT CAME ON. I HAD THE VEHICLE TOWED TO MAZDA DEALERSHIP WHO SAID IT WAS CAUSED BY BUSTED SPARK PLUG. I OKED A TUNE UP. IN MARCH 2003 AFTER SITTING TWO DAYS, THE SAME PROBLEM OCCURRED. I CALLED THE DEALERSHIP AND WAS TOLD THEY FOUND A CALLAPSED HOSE. I HAVE NOT ALLOWED THE VEHICLE TO SIT FOR 2 DAYS AGAIN BUT DID NOTICE A SLIGHT HESITATION OFF AND ON AND IT IS NOW DECEMBER 2003 AND THE PROBLEM HAS GOTTEN WORSE. AND LIKE OTHER COMPLAINTS, IT STARTS AT ELEVATION BETWEEN 45-50 MPH. AFTER 55 IT'S FINE. IT DOES THIS ALL THE TIME. AS OF 1-2-04 I HAVE A SCHEDULED APPOINTMENT TO HAVE IT CHECKED OUT. I ALSO WANT TO MENTION THAT ABOUT 4 MONTHS AGO AS I WAS DRIVING TO WORK, THE VEHICLE STALLED WITH NO WARNING HOWEVER, I WAS ABLE TO COAST TO THE SHOULDER WITH NO PROBLEMS. AFTER ABOUT 15 MINUTES THE VEHICLE STARTED WITH NO PROBLEM.*AK",
        "vin": "4F2CU09181K"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/03/2003",
        "dateOfIncident": "11/27/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049131,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECENTLY PURCHASED A NEW 2003 MAZDA TRIBUTE SUV.  AT TIMES IT IS DIFFICULT TO GET IT OUT OF THE PARK POSITION AFTER I START THE ENGINE. AT OTHER TIMES IT WILL NOT START UNTIL I FORCE THE STEERING WHEEL TO MOVE.  IS THIS INHERENT IN THIS MODEL?    *NLM",
        "vin": "4F2YZ94153K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/20/2003",
        "dateOfIncident": "11/17/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047269,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR PEDAL IS STICKY RIGHT FROM THE START OF DEPRESSING THE PEDAL.  ONCE THE RESISTANCE IS OVERCOME THE VEHICLE LURCHES FORWARD.  DEALER CLAIMS CARBON BUILD UP (CONTAMINATION) ON OR NEAR THE THROTTLE PLATE IS CAUSING INITIAL RESISTANCE.  TWO OCCURRENCES (APPROXIMATELY 5,000 AND 10,000 MILES) HAVE RESULTED IN DEALER CLEANING AREA TO REMOVE CONTAMINATION.   *LA",
        "vin": "4F2CZ04113K"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "11/07/2003",
        "dateOfIncident": "12/10/2002",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046572,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IT IS COLD  THE ACCELERATOR STICKS AFTER GOING ABOUT AN INCH.  WHEN THE ACCELERATOR BECOMES UNLOCKED IT CAUSES THE VEHICLE TO LURCH FORWARD.  THE VEHICLE WAS TAKEN TO A DEALER, WHO INFORMED THE CONSUMER THAT THERE WAS A CARBON BUILDUP ON THE CABLE. THIS INCIDENT OCCURRED AT LEAST TWENTY FIVE TIMES.  THE MANUFACTURER WAS AWARE OF THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/06/2003",
        "dateOfIncident": "11/06/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10046505,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING IN INCLEMENT WEATHER A LEAK OCCURRED THROUGH THE HOOD. DRIVER TOOK THE VEHICLE TO DEALER FOR ANALYSIS. MECHANIC COULD NOT  DUPLICATE THE LEAK.  *AK",
        "vin": "4F2CZ96143K"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "10/20/2003",
        "dateOfIncident": "10/15/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043212,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "ON OCTOBER 15, A CONTINENTAL CONTITRAC TIRE ON OUR 2003 MAZDA TRIBUTE EXPERIENCED A BLOW OUT AT HIGHWAY SPEEDS ON A BUSY OVER-PASS. THERE WAS NO INDICATION OF ROAD HAZARDS COMING INTO CONTACT WITH THE TIRE. THE TIRE WAS BADLY DAMAGED ON THE BLOWOUT AND WHILE SUBSEQUENTLY TRAVELING ON THE RIM WHILE COMING TO A STOP ON THE SHOULDER.      THE LOCAL MANUFACTURER REPRESENTATIVE DENIED A WARRANTY CLAIM OUTRIGHT INDICATING THAT THE DAMAGE TO THE TIRE WAS CAUSED BY RIDING ON THE RIM, NOT A BLOWOUT. I AM PURSUING THIS MATTER WITH THE MANUFACTURER AND THE LOCAL MAGISTRATE.     WHAT CONCERNS ME MORE IS THAT IF CONTINENTAL HAS CREATED ARTIFICIAL BARRIERS TO THEIR REPRESENTATIVES PROCESSING WARRANTY CLAIMS, THEN SERIOUS MANUFACTURING DEFECTS MAY GO UNKNOWN. I BELIEVE THAT THE FAILED TIRE WAS UNQUESTIONABLY DEFECTIVE.  *LA",
        "vin": ""
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/06/2003",
        "dateOfIncident": "10/06/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10042407,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING ABOUT 45 MPH ON THE HIGHWAY AND WITHOUT WARNING  THE VEHICLE SHUT DOWN.  STEERING LOCKED/ BRAKES FAILED, AND  HEADLIGHTS  WERE FLICKERING ON AND OFF.  DRIVER LOST CONTROL OF THE VEHICLE, AND WENT INTO A FENCE, CAUSING A COLLISION. UPON IMPACT, AIR BAGS FAILED TO DEPLOY.  THE DRIVER'S SIDE AIR BAG DID NOT DEPLOY. DRIVER SUFFERED INJURIES, AND  WAS TRANSPORTED BY AMBULANCE TO THE HOSPITAL.*AK",
        "vin": "4F2YZ04143K"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "09/23/2003",
        "dateOfIncident": "08/04/2003",
        "fire": true,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10034439,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER THE VEHICLE WAS INVOLVED IN A COLLISION, THE ENGINE COMPARTMENT CAUGHT FIRE DUE TO LEAKING GASOLINE ON THE MANIFOLD. *AK *TS  *JB",
        "vin": "4F2CZ06183K"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "08/19/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10034168,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE TRAVELING AT 50 MPH VEHICLE TRAVELING IN FRONT CAME TO A DEAD STOP, WHICH RESULTED IN A REAR ENDED COLLSION. UPON IMPACT,  NONE OF THE AIRBAGS DEPLOYED.  *AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/07/2003",
        "dateOfIncident": "05/14/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026587,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATES THAT WHILE DRIVING VEHICLE OVER A METAL BRIDGE VEHICLE WOULD MOVE LEFT TO RIGHT. DEALER NOTIFIED.*AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2003",
        "dateOfIncident": "06/09/2003",
        "fire": false,
        "manufacturer": "Mazda North American Operations",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10022824,
        "products": [
            {
                "manufacturer": "Mazda North American Operations",
                "productMake": "MAZDA",
                "productModel": "MAZDA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SMALL QUANTITY OF GASOLINE COLLECTED IN A CAVITY ON THE TOP OF THE GAS TANK IN 2003 MAZDA 6.  *MR  WHILE PREPARING THE VEHICLE FOR A 40 MPH OFFSET FRONTAL CRASH TEST, THE ENGINEERS AND TECHNICIANS FOUND A SMALL AMOUNT OF GASOLINE COLLECTED ON TOP OF THE GAS TANK AND ADJACENT TO THE SCREW IN THE FUEL SENDING UNIT.  THEY WERE UNSURE IF THE LEAKED GASOLINE WAS PRESENT WHEN THE VEHICLE WAS DELIVERED OR DUE TO ONE OF THE TWO 5 MPH IMPACTS THAT WERE CONDUCTED.  *SCC    *JB",
        "vin": "1YVHP80C435"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2003",
        "dateOfIncident": "03/16/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10020018,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 100 MPH THE VEHICLE BEGAN TO BUCK.  *NLM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "05/07/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019409,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CONSUMER APPLIED PRESSURE TO THE ACCELERATOR PEDAL THE VEHICLE DID NOT MOVE.  *NLM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/07/2003",
        "dateOfIncident": "05/07/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10019410,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE CHECK ENGINE LIGHT ILLUMINATED ON THE DASHBOARD.  THE CONSUMER HAS HAD MULTIPLE PROBLEMS WITH THIS VEHICLE.   *NLM",
        "vin": "PLEASE FILL"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/04/2003",
        "dateOfIncident": "05/04/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10017011,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MOTHER JUST BOUGHT A 2003 MAZDA TRIBUTE (5/3/03). TODAY (5/4/03) SHE SLAMMED THE REAR DOOR (CARGO \"TRUNK\" HATCH) AND AS IT SLAMMED, A SPACE WAS BRIEFLY CREATED BETWEEN THE REAR WINDOW AND THE WINDOW FRAME. THEN THE WINDOW WAS TIGHT IN ITS FRAME AGAIN. I THINK IT DOES THAT TO LET SOME OF THE AIR PRESSURE ESCAPE AS YOU SLAM THE DOOR. HER HAND WAS NEAR ENOUGH TO THE WINDOW,  WHEN THIS HAPPENED, HER RIGHT PINKIE FINGER WENT INTO THAT SPACE AND WAS CRUSHED.  SHE IS CURRENTLY IN THE EMERGENCY ROOM HAVING X-RAYS PERFORMED, AND HAVING THE END OF HER FINGER (HOPEFULLY) SEWN BACK ON. *JB",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2003",
        "dateOfIncident": "04/21/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017300,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE STEERING WENT OUT.    *NLM",
        "vin": "4F2CZ96133K"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/21/2003",
        "dateOfIncident": "04/21/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10017301,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKES WERE APPLIED THE PEDAL WENT DOWN TO THE FLOOR.   *NLM",
        "vin": "4F2CZ96133K"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "03/31/2003",
        "dateOfIncident": "03/29/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013712,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Continental Tire the Americas, LLC",
                "productMake": "CONTINENTAL",
                "productModel": "CONTITRAC",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "THE LEFT REAR TIRE ON MY 2002 MAZDA TRIBUTE CAME APART WHILE WAS DRIVING.  THE TIRE WAS A CONTINENTAL CONTITRAC 235R70 16.    *NLM",
        "vin": ""
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/30/2003",
        "dateOfIncident": "03/21/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013681,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "#1-TRANSMISSION FAILURE @ 3617 MILES.  VEHICLE 3 MONTHS OLD. MFG SOLUTION/REMANUFACTURED TRANSMISSION VS NEW..#2-REQUESTED REPAIR OF SMART UNLOCKING FEATURE AS STATED IN OWNERS MANUAL ON PAGE 70 OF PART #9999-95-014C-03..MFG SOLUTION/WILL CORRECT OWNERS MANUAL..SOMETHING ISN'T RIGHT WITH THESE SOLUTIONS..SERVICING DEALER HAS DONE EVERYTHING IN IT'S POWER TO CORRECT TO CORRECT THESE ISSUES & MAINTAIN GOOD RELATIONS..MAZDA MFG  IS RELUCTANT TO MOVE BEYOND THESE SOLUTIONS......   *NLM",
        "vin": "4F2CZ04163K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/19/2003",
        "dateOfIncident": "03/13/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010756,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED FOUR TIMES IN THE TIME I HAVE HAD IT SINCE JUNE OF 2002. THE CD PLAYER ALSO QUIT WORKING, BUT MY MAIN CONCERN WAS THE STALLING WHILE DRIVING , USUALLY AROUND 30-35 MPH, GOING DOWNHILL, EACH TIME. I WILL GIVE THE MOST RECENT DATE OF THE STALL.   *NLM",
        "vin": "4F2YU09192K"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "03/19/2003",
        "dateOfIncident": "03/13/2003",
        "fire": false,
        "manufacturer": "Mazda Motor Corp.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010755,
        "products": [
            {
                "manufacturer": "Mazda Motor Corp.",
                "productMake": "MAZDA",
                "productModel": "TRIBUTE",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE STALLED FOUR TIMES IN THE TIME I HAVE HAD IT SINCE JUNE OF 2002. THE CD PLAYER ALSO QUIT WORKING, BUT MY MAIN CONCERN WAS THE STALLING WHILE DRIVING , USUALLY AROUND 30-35 MPH, GOING DOWNHILL, EACH TIME. I WILL GIVE THE MOST RECENT DATE OF THE STALL.   *NLM",
        "vin": "4F2YU09192K"
    }
]