[
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/04/2019",
        "dateOfIncident": "10/31/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11286857,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR CONTROL ARMS ARE RUSTED THROUGH, THERE WAS A RECALL FOR THE FRONT AND HAD THE REPAIRS DONE. THE FRONT CONTROL ARM RECALL WAS DUE TO POOR RUST PROOFING DURING MANUFACTURING. THE REAR HAS THE SAME PROBLEM. CANNOT REALIGN REAR WHEELS AND REAR SWAY BAR BRACKET BROKE FREE ENTIRELY. VEHICLE IS NOW STATIONARY AS IT CANNOT BE DRIVEN.",
        "vin": "JA4LZ41G43U"
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/04/2019",
        "dateOfIncident": "04/20/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11278142,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR TAKEN TO DEALERSHIP, ANDERSON MITSUBISHI, 8162790354), JANUARY 2017, FOR NHTSA RECALL 16V458.  CROSSMEMBER NOT REPLACED OR RUST TREATED.  CROSSMEMBER FAILED 4-20-2019. REPAIRED AT MY EXPENSE $2161.70.  MADE CLAIM FOR REIMBURSEMENT THROUGH MITSUBISHI DEALER AND MITSUBISHI OF NORTH AMERICA.  HAVE A MITSUBISHI FILE NUMBER [XXX].  MITSUBISHI OF NA HAS VERBALLY AGREED TO SETTLE, BUT HAS NOT CONTACTED ME SINCE AUGUST OF 2019.  I HAVE NOT BEEN ABLE TO GET MY CALLS RETURNED SINCE.  THE CROSSMEMBER BROKE WHILE MY WIFE WAS DRIVING ON CITY STREETS WHICH CAUSED THE CAR TO VEER INTO ONCOMING TRAFFIC LANE, WITHOUT ACCIDENT.  CAR WAS TOWED AND REPAIRED AT MY EXPENSE.  I NEED HELP GETTING MY REIMBURSEMENT PAID.  I AM THE ORIGINAL OWNER OF THE CAR.    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": "JA4LZ31G73U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/24/2019",
        "dateOfIncident": "05/25/2019",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11222052,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 35 MPH, THE DRIVER LOST CONTROL OF THE VEHICLE AND CRASHED WHILE ATTEMPTING TO AVOID COLLIDING WITH A DEER. DURING THE CRASH, THE VEHICLE HAD ROLLED OVER AND THE DRIVER WAS KNOCKED UNCONSCIOUS. THE DRIVER SUSTAINED HEAD AND NECK INJURIES, A FRACTURED LEFT SHOULDER AND AN INJURED TORSO AND WAS TRANSPORTED TO THE HOSPITAL. THE VEHICLE WAS DESTROYED AND TOWED AWAY. A POLICE REPORT WAS TAKEN AT THE SCENE. THE CAUSE OF THE FAILURE WAS NOT DETERMINED. THE MANUFACTURER AND LOCAL DEALER WERE NOT NOTIFIED. THE FAILURE MILEAGE WAS 340,000. *DT  *TR  *BF    CONSUMER STATES THAT AIRBAGS FAILED TO DEPLOY DURING THE COLLISION. CONSUMER SAYS THAT MANUFACTURER WAS AWARE AIRBAG FAILURE SINCE 2004, BUT FAILED TO INFORM CONSUMERS. *DL",
        "vin": "JA4LX41G33U"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11192997,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ISSUE BEGAN IN 2004 WHEN MY VEHICLE WAS 1 YEAR OLD.  THE TEMPERATURE CONTROL KNOB BECAME FROZEN AND YOU COULD NOT TURN IT FROM HEAT TO AIR CONDITIONING OR THE OTHER WAY.  I SPENT $23,000 ON THIS CAR AND YOU COULD NOT TURN FROM AIR CONDITIONING TO HEAT AT WILL ONLY A MECHANIC CAN MANUALLY TURN IT UNDERNEATH THE VEHICLE AND THEN ONLY PUT IT ON HOT OR COLD.   ONE TIME I WAS DRIVING 600 MILES FOR AN EMERGENCY WITH THE KNOB STUCK ON AIR CONDITIONING AND I WAS NOT ABLE TO TURN IT TO HEAT.   IT WAS BELOW FREEZING TEMPERATURES AND THE WINDOW FOGGED UP BECAUSE I WAS NOT ABLE TO PUT THE DEFROSTER ON.  I HAD TO CONTINUALLY PULL OVER TO WIPE OFF THE WINDOW AND THE FROST.   THERE COULD HAVE BEEN AN ACCIDENT IF I HAD NOT CONTINUALLY PULLED OVER.   2002 TO 2007 LANCERS AND OUTLANDERS HAVE THIS PROBLEM.  IT WAS A DESIGN FLAW BY THE MANUFACTURER BUT THEY WILL NOT OWN UP TO THIS DANGEROUS PROBLEM.    I HAVE HAD IT TO A MECHANIC MANY TIMES BUT THEY CANNOT FIX IT.   I DO NOT UNDERSTAND WHY MITSUBISHI IS NOT FORCED TO FIX THIS FOR CONSUMERS WHEN THIS IS CLEARLY A DANGEROUS PROBLEM IF YOU CANNOT USE THE DEFROSTER.   I SHOULD NOT BE MADE TO PAY FOR SOMETHING WHEN IT IS A MANUFACTURING FLAW.   THERE ARE 1000S OF VEHICLES ON THE ROAD WITH THIS PROBLEM AND MITSUBISHI WILL NOT OWN UP THAT THIS IS A CLEARLY SAFETY ISSUE.   THE CONSUMER HAS NO POWER IN THIS SITUATION I HAVE CALLED CUSTOMER SERVICE AND AM TOLD THEY WILL DO NOTHING ABOUT IT UNLESS IT'S RECALLED.   THANK YOU FOR YOUR HELP IN THIS MATTER I HAVE NO PLACE ELSE TO GET HELP WITH THIS AND I CAN'T AFFORD ANOTHER VEHICLE.  THIS IS WRONG MITSUBISHI ALLOWS CARS ON THE ROAD WITH THIS PROBLEM AND TURNS A BLIND EYE TO POTENTIALLY DANGEROUS SITUATIONS.   THANK YOU FOR YOUR ASSISTANCE.",
        "vin": "JA4LX41GX3U"
    },
    {
        "components": "UNKNOWN OR OTHER,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/01/2019",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11193003,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE SECOND YEAR SINCE I'VE OWNED THIS CAR THE TEMPERATURE CONTROL KNOB HAS BEEN FROZEN.   THE ONLY WAY YOU CAN TURN THE KNOB IS TO HAVE A MECHANIC MANUALLY TURN THE KNOB UNDERNEATH THE VEHICLE.   MITSUBISHI MOTORS ADMITTED THIS WAS A DESIGN FLAW IN 2002 TO 2007 MITSUBISHI LANCERS AND OUTLANDERS.    I HAVE CALLED MITSUBISHI MANY TIMES AND SENT LETTERS OF COMPLAINTS BUT THEY WILL NOT DO ANYTHING ABOUT IT BUT LEAVE THE  VEHICLES OWNER IN WHAT CAN BE A DANGEROUS SITUATIONS.   I'VE HAD TO DRIVE IN EMERGENCY SITUATIONS BEFORE AND THE KNOB WAS STUCK ON AIR CONDITIONING IT WAS FREEZING TEMPERATURES WHERE I WAS DRIVING IN AND YOU COULD NOT USE THE DEFROSTER BE CAUSE IT WAS ON COLD AIR!   YOU HAD TO PULL OVER AND SCRAPE THE WINDOW AND CONTINUALLY WIPE THE CLOUDED OVER WINDOW.      I PAID $23,000 FOR THIS VEHICLE AND NOT TO HAVE CONTROL OF THE HEAT AND AIR IS REDICULUS!  YOU CANNOT ALWAYS GET YOUR VEHICLE INTO A MECHANIC AND HAVE THEM MANUALLY TURN THE HEAT AND AIR KNOB. AND THAT'S ALL YOU HAVE A CHOICE OF IS EITHER HEAT OR COLD AIR.    THE HVAC SYSTEM WAS INAPPROPRIATELY DESIGNED BY MITSUBISHI AND THE CABLE FROM THE KNOB BUNCHES UP AND DOES NOT WORK ANYMORE.  I THOUGHT NOT BEING ABLE TO USE THE DEFROSTER IS A SAFETY HAZARD.   MITSUBISHI NEEDS TO OWN UP TO THIS AND RECALL WHAT HAS AFFECTED 1000S OF VEHICLES.   YOU CAN BE IN AN AREA OF THE COUNTRY WHERE YOU NEED THE AIR CONDITIONING AND THEN DRIVE INTO A SNOW STORM AND YOU CAN'T USE THE DEFROSTER UNLESS YOU FIND A MECHANIC IN THE MIDDLE OF THE NIGHT TO CHANGE IT OVER TO HEAT.        THIS IS DEFINITELY A SAFETY ISSUE NOT BEING ABLE TO TURN THE KNOB TO THE SETTING YOU NEED AT WILL FOR THE DEFROSTER.   VEHICLE OWNERS HAVE COMPLAINED TO MITSUBISHI BUT WILL NOT FIXIT.  THIS HAS BEEN AN ONGOING ISSUE WITH MY CAR SINCE 2004.  THE PHOTO SHOWS THE HEAT AND AIR CONDITIONING KNOB THAT CAN ONLY BE MANUALLY TURNED BY A MECHANIC.",
        "vin": "JA4LX41GX3U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "11/13/2018",
        "dateOfIncident": "11/13/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11151262,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR HAS BEEN OWNED FOR 10+ YEARS AND HAS BEEN MAINTAINED VERY WELL. GAS MILEAGE HAS DROPPED SINCE 2014. CAR THREW A P420 CODE IN THE YEARS AFTER. CATALYTIC CONVERTER HAS BEEN REPLACED FOUR TIMES IN A YEAR. OXYGEN SENSOR HAS BEEN REPLACED AND NEW EXHAUST HAS BEEN INSTALLED. WE HAVE NOW SEEN THE EXHAUST MANIFOLD HAS A CRACK IN IT. THIS APPEARS TO BE A MANUFACTURER ISSUE.",
        "vin": "JA4LZ31G03U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "06/12/2018",
        "dateOfIncident": "05/16/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11101307,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DID NOT DELPOY DURING CRASH.  THE VEHICLE WAS TOTATLED AND I NO LONGER OWN THE VEHICLE.    *JS",
        "vin": "JA4LZ41G43U"
    },
    {
        "components": "EXTERIOR LIGHTING,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/16/2018",
        "dateOfIncident": "01/15/2018",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11063034,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 MITSUBISHI OUTLANDER. WHILE DRIVING VARIOUS SPEEDS AT NIGHT, THE HEADLIGHTS INTERMITTENTLY ILLUMINATED. THE CONTACT COASTED THE VEHICLE TO THE SIDE OF THE ROAD, WAITED A WHILE, AND WAS ABLE TO RESUME DRIVING. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC, BUT WAS NOT DIAGNOSED OR REPAIRED. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL. IN ADDITION, THE CONTACT CRASHED INTO ANOTHER VEHICLE WHILE DRIVING 30 MPH. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED HEAD INJURIES THAT REQUIRED MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT TAKEN TO A DEALER. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS CONTACTED. THE APPROXIMATE FAILURE MILEAGE WAS 160,000.",
        "vin": "JA4LX31G83U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/11/2017",
        "dateOfIncident": "10/15/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11053979,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. WHILE ATTEMPTING TO CHECK UNDER THE VEHICLE, THE CONTACT NOTICED THAT THE REAR FRAME WAS ROTTED. THE VEHICLE WAS TAKEN TO CHERRY HILL MITSUBISHI AT (856) 471-1057 (1805 MARLTON PIKE W, CHERRY HILL, NJ 08002) WHERE IT WAS DIAGNOSED THAT THE REAR FRAME NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 80,000.",
        "vin": "JA4LZ31G73U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/01/2017",
        "dateOfIncident": "11/28/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11051755,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V458000(SUSPENSION); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. DORSETT AUTOMOTIVE IN TERRE HAUTE, IN REFUSED TO PERFORM THE REPAIR BECAUSE THE PASSENGER SIDE OUTER TIE ROD AND LOWER CONTROL ARM NEEDED TO BE REPAIRED BEFORE THE RECALL REPAIR COULD BE COMPLETED. THE MANUFACTURER WAS MADE AWARE OF THE ISSUE AND INFORMED THE CONTACT THAT THE COMPONENTS HAD TO BE REPAIRED BEFORE THE REMEDY COULD BE PERFORMED. THE FAILURE MILEAGE WAS APPROXIMATELY 148,000.",
        "vin": "JA4LX31G83U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/04/2017",
        "dateOfIncident": "09/01/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11031697,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. WHILE DRIVING UNKNOWN SPEEDS, THE CONTROL ARM, BALL JOINT, CROSS MEMBERS, AND  CV AXLE DETACHED. THE VEHICLE WAS TOWED TO THE CONTACT'S RESIDENCE AND LATER TOWED TO SAVANNAH MITSUBISHI (8203 WHITE BLUFF RD, SAVANNAH, GA 31406, PHONE NUMBER: (912) 226-6200) WHERE IT WAS DIAGNOSED THAT THE CROSS MEMBERS WERE CORRODED THROUGH AND CAUSED THE CV AXLE, BALL JOINT, AND CONTROL ARM TO DETACH. THE VEHICLE WAS IN THE PROCESS OF BEING REPAIRED. THE VIN WAS INCLUDED IN NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION). THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INFORMED THE CONTACT THAT THEY WOULD NOT REPAIR THE VEHICLE. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "JA4LZ31G53U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/21/2017",
        "dateOfIncident": "08/30/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11029708,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAVY SMELL OF GASOLINE WHEN FUEL TANK IS FILLED. FILL GARAGE WITH FUMES. CHECK ENGINE LIGHT IS ON.  IF FILLED TO A HALF TANK OR SO, NO INDICATION OF FUEL SMELL. DOES NOT APPEAR TO BE LEAKING.  I HAD AN ASE CERTIFIED MECHANIC LOOK AT IT AND THE FUEL TANK AS WELL AS FILLER NOZZLE ARE DETERIORATED.  I CALLED MITSUBISHI MOTORS NORTH AMERICA AND THEY ACTED AS IF THIS WAS THE FIRST TIME THEY EVER HEARD OF THIS PROBLEM.  I CALLED MULTIPLE DEALERS, AND ALL HAVE EXPERIENCED THE SAME PROBLEM WITH THEIR CUSTOMERS.  THE INTER-NET IS FULL OF SIMILAR COMPLAINTS ON 2003 TO 2006 OUTLANDERS. I HAVE HAD A RECALL FOR THE FRONT END BECAUSE OF EXCESSIVE RUST MAKING IT UNSAFE TO DRIVE.  I DO NOT THINK THIS IS A NORMAL WEAR AND TEAR WITH THE FUEL TANK. MITSUBISHI SHOULD ACKNOWLEDGE THIS PROBLEM AND CORRECT IT FOR THEIR CUSTOMERS.  I AM THE ORIGINAL OWNER.  THE CAR IS ALWAYS GARAGED WHEN NOT BEING DRIVEN.",
        "vin": "JA4LX41G43U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/09/2017",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10959767,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION). THE CONTACT STATED THAT THE RECALL SHOULD ALSO COVER THE FRAME THAT HELD THE REAR AXLE, WHICH THE CONTACT STATED WAS MORE RUSTED THAN THE FRONT FRAME. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE AND STATED THAT THE RECALL DID NOT COVER THE REAR FRAME. THE FAILURE MILEAGE WAS 193,000. PARTS DISTRIBUTION DISCONNECT.",
        "vin": "JA4LZ41G43U"
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/23/2017",
        "dateOfIncident": "01/02/2017",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946971,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT WHILE DRIVING AT 45 MPH, THE CONTACT DEPRESSED THE BRAKE PEDAL AND THE SEAT BELT RETRACTOR MECHANISM FRACTURED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 164,241.",
        "vin": "JA4LX31G73U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/17/2017",
        "dateOfIncident": "08/01/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10945663,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RECEIVED A SAFETY RECALL NOTICE IN AUGUST 2016. AS OF THIS DATE THE PART TO REPAIR THE VEHICLE IS NOT AVAILABLE. HAVE CALL MITSUBISHI SEVERAL TIMES AND THEY KEEP SAYING THE PART IS BEING PROCESSED. CONFUSION AS TO WHETHER THE PARTS ARE SENT TO A DEALER FOR REPAIR OR IF THE VEHICLE NEEDS TO BE INSPECTED FIRST AND THEN THE PART IS ORDERED BY THE DEALER. THE DEALER CLAIMS THAT THE VEHICLE NEEDS TO BE INSPECTED FIRST THEN THE PART IS ORDERED IF NECESSARY. MITSUBISHI STATES THAT THEY WILL DETERMINE HOW MANY PARTS TO SEND TO WHAT DEALERS. CONFUSION. NEAREST DEALER TO ME IS 3 TO 4 HOURS ONE WAY TRIP. IF THE VEHICLE NEEDS TO BE INSPECTED FIRST BEFORE THE PART IS ORDERED THEN IF WILL HAVE TO MAKE TWO 6 TO 8 HOUR ROUND TRIPS. HOW THE DEALER KNOWS HOW MANY PARTS TO SEND TO WHAT DEALERS DOES'T MAKE SENSE. THIS PART IS NEEDED TO PREVENT THE VEHICLE'S STEERING FROM FAILING. THE PART IS THE LOWER CONTROL ARM. PLEASE CLEAR THIS UP FOR ME.",
        "vin": "JA4LZ1G13UO"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "12/09/2016",
        "dateOfIncident": "12/09/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10934119,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT THE REAR SUSPENSION AND CROSS MEMBER WERE CORRODED. THE CONTACT TOOK THE VEHICLE TO A CERTIFIED MECHANIC WHO STATED THAT A TRAVEL-ARM HUBBERING WAS NEEDED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 190,000.",
        "vin": "JA4LZ41G13U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/30/2016",
        "dateOfIncident": "08/19/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10928696,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V458000(SUSPENSION); HOWEVER, THE PARTS TO DO THE REPAIR WERE UNAVAILABLE. THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOT NOTIFIED OF THE ISSUE. THE CONTACT HAD NOT EXPERIENCED A FAILURE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JA4LZ31G53U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "09/12/2016",
        "dateOfIncident": "08/27/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10905695,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM REFERRING TO A WELL KNOWN \"STICKY HVAC MIX DOOR\" ISSUE IN THE MITSUBISHI OUTLANDER AND LANCER VEHICLES IN MODEL YEAR 2003 (PERHAPS AMONG OTHER YEARS AND MODELS).  THIS ISSUE CAN RESULT IN AN INABILITY TO DEFROST THE WINDSHIELD DURING COLD WEATHER DRIVING.  I HAVE HAD THE \"STICKY\" ISSUE FOR SOME TIME, WHICH, WHILE IT WAS DIFFICULT TO TURN THE KNOB, WAS NOT A HUGE ISSUE.  HOWEVER, RECENTLY WHILE DRIVING, THE DOOR WENT FROM \"STICKY\" TO \"STUCK,\" ON THE \"COLD\" SETTING. MY WINDOWS GRADUALLY STARTED TO FOG AND I WAS UNABLE TO DEFOG THEM SINCE THE SYSTEM COULD NOT BLOW HOT AIR DUE TO THE STUCK MIX DOOR.  I WAS DRIVING ON AN INTERSTATE HIGHWAY (I-39) IN CENTRAL WISCONSIN AT THE TIME, ON AUGUST 27, 2016 IN THE EVENING.  IN LATE SUMMER / EARLY AUTUMN, THERE IS A WIDE TEMPERATURE SWING DURING THE DAY AND NIGHT, SO FLIPPING FROM HOT TO COLD SETTINGS IS VERY COMMON.  FORTUNATELY IT WAS NOT EXTREMELY COLD SO I WAS ABLE TO TURN OFF THE HVAC AND OPEN ALL MY WINDOWS IN ORDER TO GET BY DURING MY SHORT DRIVE.  HOWEVER, IN THE WINTER, I NEED TO HAVE IT SET ON \"HOT\" AT ALL TIMES: THEREFORE, FOR WINTER DRIVING, MY CAR WILL NOT BE DRIVABLE AT ALL DUE TO THIS ISSUE.  PLEASE ISSUE A RECALL IN COLD WEATHER STATES ASAP.  THIS IS A VERY WELL KNOWN ISSUE WITH THESE VEHICLES, BUT ONLY AT THIS TIME DID IT BECOME A SERIOUS CAUSE OF CONCERN: WHEN THE HVAC MIX DOOR IS STUCK ON THE COLD SETTING, THE INABILITY TO DEFOG THE WINDSHIELD IS A SERIOUS SAFETY ISSUE FOR THE DRIVER AS WELL AS FOR ANYONE ELSE SHARING THE ROAD.",
        "vin": "JA4LZ41G83U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/2016",
        "dateOfIncident": "08/25/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10904609,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT WHEN THE VEHICLE WAS TAKEN TO BE INSPECTED FOR NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION), THE TECHNICIAN INFORMED THAT THE FRONT CROSS MEMBER WAS CORRODED AND NEEDED TO BE REPLACED HOWEVER, THE PARTS WERE UNAVAILABLE. THE CONTACT STATED THAT THE MANUFACTURER EXCEEDED A REASONABLE AMOUNT OF TIME FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JA4LZ31G83U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2016",
        "dateOfIncident": "06/06/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10903766,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT THE REAR CROSS MEMBER FRACTURED DUE TO CORROSION WHILE THE VEHICLE WAS PARKED AT THE CONTACT'S RESIDENCE. THE VEHICLE WAS NOT DIAGNOSED NOR REPAIRED. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION); HOWEVER, THE RECALL ONLY COVERED THE FRONT CROSS MEMBER. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE AND INSTRUCTED THAT THE REPAIRS WOULD NOT BE PERFORMED PER A RECALL. THE FAILURE MILEAGE WAS APPROXIMATELY 220,000.",
        "vin": "JA4LX41G93U"
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/29/2016",
        "dateOfIncident": "02/15/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10899311,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. WHILE DRIVING 35 MPH, THE CONTACT HEARD AN ABNORMAL SOUND WHEN THE BRAKE PEDAL WAS DEPRESSED AND THE FRONT END OF THE VEHICLE SHOOK UNCONTROLLABLY. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT IT NEEDED A WHEEL ALIGNMENT AND THE TIE ROD NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED, BUT THE FAILURE RECURRED INTERMITTENTLY. THE CONTACT RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION); HOWEVER,THE PART WAS UNAVAILABLE FOR THE RECALL REPAIR. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS 45,432.",
        "vin": "JA4LZ31G73U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/24/2016",
        "dateOfIncident": "08/23/2016",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10898226,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT UPON INSPECTING THE VEHICLE, IT WAS NOTICED THAT THERE HAD BEEN EXTENSIVE PREMATURE RUST AND CORROSION ON THE LOWER CONTROL ARM AND THE FRONT SUB-FRAME TO THE POINT THAT THE PART MIGHT FRACTURE. THE CONTACT LATER RECEIVED NOTIFICATION OF NHTSA CAMPAIGN NUMBER: 16V458000 (SUSPENSION), BUT WAS UNABLE TO DRIVE THE VEHICLE DUE TO THE FAILURE. THE CONTACT INDICATED THAT THE VEHICLE NEEDED TO BE TOWED TO THE DEALER AND WAS UNCERTAIN OF WHEN THE VEHICLE WOULD BE REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE CONDITION AND THEY PROVIDED NO SOLUTION TO GET THE VEHICLE TO THE DEALER. THE FAILURE MILEAGE WAS NOT AVAILABLE. VIN TOOL CONFIRMS PARTS NOT AVAILABLE.",
        "vin": "JA4LZ31G03U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2016",
        "dateOfIncident": "08/17/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10897984,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. WHILE DRIVING VARIOUS SPEEDS, THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHERE IT WAS DIAGNOSED THAT THE WIRING HARNESS FAILED AND NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE FAILURE MILEAGE WAS UNKNOWN.",
        "vin": "JA4LX31G23U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/04/2016",
        "dateOfIncident": "05/15/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10863243,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR  STEERS TO THE RIGHT ON HIGHWAY., UNABLE TO REPAIR.",
        "vin": "JA4LX31G83U"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/19/2016",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10860316,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. WHILE DRIVING AT VARIOUS SPEEDS AND ALSO WHILE IN PARK, THE VEHICLE BEGAN TO OVERHEAT AND THE AIR CONDITIONER BLEW HOT AIR. THE VEHICLE WAS TAKEN TO A DEALER WHERE IT WAS DIAGNOSED THAT THE FAN CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED; HOWEVER, THE FAILURE RECURRED ON NUMEROUS OCCASIONS. THE VEHICLE WAS TAKEN BACK TO THE DEALER MULTIPLE TIMES WHERE IT WAS DIAGNOSED THAT THE FAN CONTROL MODULE NEEDED TO BE REPLACED. THE VEHICLE WAS REPAIRED NUMEROUS TIMES. THE FAILURE PERSISTED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURES. THE FAILURE MILEAGE WAS 20,000.",
        "vin": "JA4LZ41G43U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/24/2015",
        "dateOfIncident": "08/03/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10806563,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT WHILE DRIVING AT APPROXIMATELY 55 MPH, THE CHECK ENGINE WARNING INDICATOR ILLUMINATED CONTINUOUSLY. THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE IT WAS DIAGNOSED THAT THE MUFFLER AND THE FUEL TANK NEEDED TO BE REPLACED. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 152,000.",
        "vin": "JA4LZ41GX3U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "11/02/2015",
        "dateOfIncident": "10/30/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10787627,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. WHILE THE VEHICLE WAS UNDERGOING ROUTINE MAINTENANCE, IT WAS BROUGHT TO THE CONTACT'S ATTENTION THAT THE SUBFRAME AND REAR END WERE RUSTING. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 161,000.",
        "vin": "JA4LZ41G83U"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/08/2015",
        "dateOfIncident": "02/16/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10723966,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE IS WAS PURCHASED USED WITH NO CHECK ENGINE LIGHT ON AT THE TIME OF PURCHASE. AFTER DRIVING FOR A WEEK THE LIGHT CAME ON AND THERE WAS  A STRONG FUEL SMELL AFTER FILLING THE GAS TANK. A DIAGNOSIS CHECK WAS DONE AND IT WAS FOUND THERE IS AN ISSUE WITH THE FUEL TANK. IT WAS BROUGHT TO THE DEALERSHIP AND FOUND THAT THERE IS A HOLE IN THE TOP OF THE GAS TANK CAUSING FUMES TO LEAK. THE TANK CANNOT GO BELOW A QUARTER TANK OR THE ENGINE WILL SHUT OFF AS WELL. AFTER RESEARCHING THROUGH THE INTERNET IT WAS FOUND THAT THIS IS A VERY COMMON PROBLEM WITH THE VEHICLE. MITSUBISHI WAS CONTACTED TO FIND OUT IF THERE WAS A RECALL TO FIND OUT THERE WAS NOT, THEY ALSO DID NOT ASSIST IN ANY WAY TO MAKE THIS ISSUE ANY BETTER. DEALERSHIP WOULD CHARGE $1700.00 TO REPLACE TANK.",
        "vin": ""
    },
    {
        "components": "SUSPENSION,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/29/2014",
        "dateOfIncident": "12/16/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10668660,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINGLE OWNER/USER;RETIRED, GARAGE KEPT.  UNDERCARRIAGE SO ERODED WHEELS BEGAN TO LIST.  IMPRACTICAL TO REPAIR.  BODY AND ENGINE WITHOUT PROBLEMS.  NOT NOTIFIED BY DEALERSHIP AT RECENT SERVICE THERE WAS A PROBLEM.  AN UNKNOWN PERSON THAT DROVE BEHIND ME MENTIONED THAT I SHOULD GET REAR WHEEL LOOKED AT.  WHEN BROUGHT FOR ALIGNMENT CHECK, I WAS NOTIFIED BY THE MECHANIC TO LOOK AT THE UNDERSIDE OF THE CAR.  EROSION  WAS SO BAD, I DROVE THE 5 MILES TO MY HOME AND WILL NOT TAKE IT ON THE ROAD AGAIN.  NO RECALLS RECEIVED.  *TR",
        "vin": "JA4LZ41G13U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/19/2014",
        "dateOfIncident": "12/15/2014",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10667260,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 MITSUBISHI OUTLANDER. WHILE THE VEHICLE WAS PARKED, THE CONTACT NOTICED SPARKS EMITTING NEAR THE RADIO. THE CONTACT ALSO STATED THAT THERE WAS SMOKE AND SUDDENLY THE INTERIOR FRONT OF THE VEHICLE CAUGHT FIRE. A POLICE AND FIRE REPORT WERE FILED. THE VEHICLE WAS DESTROYED. THE MANUFACTURER WAS NOT MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 206,000.",
        "vin": "JA4LZ31G73U"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "11/12/2014",
        "dateOfIncident": "11/11/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10654554,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HVAC KNOB HAS ALWAYS BEEN HARD TO TURN FROM HEAT TO COOL, BUT IT HAS NOW COMPLETELY BROKEN. IF YOU TURN IT TO HEAT IT BOUNCES BACK TO COOL. I HAVE NO HEATER OR DEFROST! I WAS QUOTED $1,500 TO FIX THE PROBLEM BECAUSE THE HVAC CABLE AND DOOR ARE STUCK SHUT. THE DEALER KNEW MY EXACT PROBLEM AND THE PART NUMBER OFF THE TOP OFF HIS HEAD! HE SAID IT IS A VERY COMMON PROBLEM, BUT THEY DON'T RECALL IT BECAUSE IT ISN'T A SAFETY HAZARD. I DON'T SEE HOW THIS IS SO. WE WERE PLUMMETED WITH SNOW AND FREEZING TEMPERATURES THIS WEEK AND I HAD TO USE AN ICE SCRAPPER ON THE INSIDE OF MY WINDOWS WHILE STOPPED AT LIGHTS! FREEZING AND NO VIABILITY SEEMS LIKE A SAFETY CONCERN TO ME.  *TR",
        "vin": "JA4LX31G83U"
    },
    {
        "components": "WHEELS,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/27/2014",
        "dateOfIncident": "11/01/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10639513,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT MY CAR SOME TIME LAST YEAR EVERYTHING SEEMED FINE BUT AFTER A FEW MONTHS THINGS STARTED TO GO WRONG ON THE CAR. IT BEGAN WITH ME CONSTANTLY HAVING TO GET THE OIL CHANGED THE  TIRES WERE BAD THE CAR STARTED MAKING NOISES THAT I COULDN'T EXPLAIN AND THE TIRES IN THE TIRES IN THE BACK WERE CONSTANTLY BUSTING. THE ENGINE IS NOW GOING BAD AND I HAVE BOUGHT AT LEAST 10 SETS OF TIRES FOR THE BACK IN THIS YEAR ALONE. I DON'T HAVE THE MONEY TO KEEP PUTTING IN THIS CAR AND CONTINUE TO PAY THE LEASE OFF FOR IT AS WELL. ITS GETTING ABSOLUTELY RIDICULOUS.  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/24/2014",
        "dateOfIncident": "07/24/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10593869,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RECENTLY BOUGHT A USED 2003 MITSUBISHI OUTLANDER AND THE HEADLIGHT LENS ON BOTH SIDES ARE CRACKED, EXTREMELY CRAZED AND THE WHOLE THING IS MILKY, WHICH DULLS THE HEADLIGHT AT NIGHT, I HAVE RESEARCHED AND MITSUBISHI WILL NOT REPLACE AFTER WARRANTY, IT WOULD COST ABOUT $1000 TO REPLACE THE ENTIRE HEADLIGHT ASSEMBLIES.  WITH ALL THE COMPLAINTS ON THIS ISSUE, MITSUBISHI SHOULD DO SOMETHING ABOUT IT.  *TR",
        "vin": "JA4LZ31G53U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/14/2014",
        "dateOfIncident": "01/07/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10579658,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OVER THE LAST 4-6 MONTHS I NOTICED A GASOLINE ODOR AFTER FILLING THE GAS TANK (AFFECTED PART). THE GAS ODOR HAS GOTTEN SIGNIFICANTLY STRONGER OUTSIDE AND INSIDE THE VEHICLE EACH MONTH. IF I FILL THE GAS TANK TODAY THERE IS AN EXTREME GAS ODOR/FUME THAT IS LEAKING FROM THE GAS TANK. AS THE GAS TANK EMPTIES THE ODOR DECREASES. THERE ISN'T A GAS LIQUID LEAKAGE THAT YOU WOULD SEE ON THE GROUND, BUT A FLUME LEAKAGE THAT FILLS THE PASSENGER COMPARTMENT AND SURROUNDS THE OUTSIDE REAR AREA OF THE VEHICLE. I THINK IF THERE WAS SPARK, OPEN FLAME, REAR END COLLISION, OR IF THE VEHICLE WAS PARKED IN DIRECT SUN LIGHT A COMBUSTIBLE FIRE/EXPLOSION COULD OCCUR. THIS AN EXTREMELY DANGEROUS AND UNSAFE CONDITION. I HAVE BROUGHT THIS PROBLEM TO THE ATTENTION OF THE DEALER AND THEY HAVE RECEIVED MULTIPLE COMPLAINTS FROM CUSTOMERS OWNING 2003 AND NEWER MITSUBISHI MODEL YEARS, WITH THE SAME PROBLEM. THE SOLUTION IS TO REPLACE THE GAS TANK AT AN ESTIMATED COST OF $1500. THEY SAID THERE SHOULD BE RECALL FOR SOMETHING AS DANGEROUS AND LIFE THREATENING AS THIS BUT THERE ISN'T. THE OUTCOME COULD BE SIMILAR TO THE FORD PINTO GAS TANK DEFECT THAT CAUSED THE INJURY AND DEATH OF MANY PEOPLE BEFORE A RECALL WAS ISSUED NATIONAL HIGHWAY TRAFFIC SAFETY ADMINISTRATION.   *JS",
        "vin": "JA4LZ41G53U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/21/2013",
        "dateOfIncident": "01/27/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548666,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMPERATURE KNOB BROKE OFF AFTER GETTING STUCK. SOUNDS LIKE THIS HAPPENS QUITE FREQUENTLY. I GOT AN ESTIMATE TO FIX IT FROM THE DEALER. OVER $2000. MAJOR ISSUE IN THE WINTER FOR DEFROST/HEAT.   *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "06/10/2013",
        "dateOfIncident": "05/10/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10516124,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT WHILE DRIVING 30 MPH, THE SEAT BELT FAILED TO UNLOCK. THE VEHICLE WAS TAKEN TO THE DEALER FOR A DIAGNOSIS BUT THEY WERE UNABLE TO DUPLICATE THE PROBLEM. THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOT NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 200,000.  *TR",
        "vin": "JA4LX41G63U"
    },
    {
        "components": "SUSPENSION,STRUCTURE,VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "04/08/2013",
        "dateOfIncident": "03/02/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10507543,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2003 MITSUBISHI OUTLANDER IN FEBRUARY, 2013 WITH 104,000 MILES ON IT. AT FIRST EVERYTHING SEEMED FINE, BUT AFTER 2 WEEKS THE BACK END OF THE CAR ON THE PASSENGER SIDE SQUEAKS AND MAKES LOTS OF NOISE. AT FIRST IT WOULD ONLY DO IT A LITTLE BUT IT GOT WORSE AND WORSE WITHIN A COUPLE WEEKS IT CONSTANTLY MAKES NOISE, WHICH IS VERY ANNOYING. I THINK THE DEALERSHIP MUST HAVE DONE A QUICK CHEAP FIX ON IT SO WHEN I TEST DROVE IT, IT WOULD NOT DO IT UNTIL IT WAS PURCHASED. I ALSO HAVE WATER SEEPING IN IN THE FLOOR NEXT TO THE DOOR ON THE DRIVER SIDE AND WATER COMING THROUGH THE DASH AREA ON THE PASSENGER SIDE WHEN IT RAINS OR IN A CAR WASH. I READ ONLINE THAT THAT CAN CAUSE ELECTRICAL PROBLEMS WHICH WORRY'S ME. MY HEAD LIGHTS ALSO HAVE CRACKS AND FOGGED UP AND MAKES IT HARD TO SEE AT NIGHT, WHICH I'VE SEEN TO BE A COMMON PROBLEM WITH THIS CAR. I DON'T UNDERSTAND WHY THIS CAR WAS NEVER RECALLED FOR ALL THE PROBLEMS IT HAS, THIS IS RIDICULOUS!  *TR",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "10/09/2012",
        "dateOfIncident": "03/15/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10479403,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. THE CONTACT STATED THAT WHILE PARKED THE CONTACT NOTICED THE TEMPERATURE CONTROL KNOB WAS DIFFICULT TO TURN. THE COTACT MENTIONED THAT AFTER SOME TIME THE KNOB DETACHED FROM THE VEHICLE. THE VEHICLE WAS NOT TAKEN TO THE DEALER FOR DIAGNOSTIC. THE VEHICLE WAS NOT REPAIRED. THE VIN WAS NOT AVAILABLE. THE APPROXIMATE FAILURE MILEAGE WAS 112,000.",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "06/29/2012",
        "dateOfIncident": "01/01/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10463625,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS OF THIS MODEL GET SEVERELY CRACKED TO THE POINT OF RAINWATER ACCUMULATING INSIDE THEM AND BURNING THE LIGHTS. DRIVERS ARE RISKING LOOSING THEIR HEADLIGHTS WHEN THEY NEED THEM MOST - IN A BAD RAINSTORM. MITSUBISHI DOESN'T OFFER HEADLIGHT COVERS AS A SEPARATE PART, SO THE WHOLE ASSEMBLY HAS TO BE CHANGED EVERY FEW YEARS. NO RECALL HAS BEEN DONE EVEN THOUGH THE PROBLEM IS RAMPANT.  I HAVEN'T BEEN IN AN ACCIDENT BUT MITSUBISHI HAS LET ALL OF THEIR OUTLANDER'03  CUSTOMERS TO FEND FOR THEMSELVES EVEN THOUGH IT'S SOMETHING THEY ARE BEST EQUIPPED TO FIX.   *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/25/2011",
        "dateOfIncident": "05/05/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10427058,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ALL HEADLIGHTS ON 2003 -2006 OUTLANDERS CRACK SEVERELY BESIDES BESIDES BRING EXPENSIVE THE HEADLIGHTS GO OUT BECAUSE OF RAIN THERFORE BECOME A SAFETY HAZARD    [XXX]    INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).  *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/08/2011",
        "dateOfIncident": "01/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10411506,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MITSUBISHI OUTLANDER HEAD LAMP ASSEMBLIES HAVE FAILED. THEY FIRST BECAME CLOUDY WITH SMALL CRACKS. EVENTUALLY THOSE CRACKS BECAME LARGER AND THE HEAD LAMP ASSEMBLIES HAVE FILLED WITH WATER MAKING THEM INOPERABLE. THIS BEGAN IN YEAR FIVE OF OWNING THE VEHICLE. THIS VEHICLE HAS NEVER BEEN IN AN ACCIDENT AND IS PARKED IN A GARAGE OVERNIGHT. *TR",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "11/15/2010",
        "dateOfIncident": "11/15/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10365836,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DEFECTIVE HEADLAMP ASSEMBLIES ON 2003 MITSUBISHI OUTLANDER..    THE HEADLAMP LENSES ON THIS VEHICLE HAVE TOTALLY FAILED.  THEY ARE MILKY IN COLOR, NOT THE CLEAR THEY SHOULD BE, AND THE LENSES THEMSELVES ARE CRACKED AND CRAZED, BUT SHOW NO IMPACT DAMAGE, OR DAMAGE OF ANY OTHER KIND OTHER THAN DETERIORATION OF THE PLASTIC ITSELF.    THE VEHICLE IS VERY UNSAFE TO DRIVE AT NIGHT AND I WOULD ESTIMATE THE LIGHT OUTPUT AT MUCH LESS THAN 50% OF WHAT IT SHOULD BE.    MY LOCAL DEALER WILL REPLACE THEM FOR A GRAND TOTAL OF $1,251.10 INCLUDING TAX AND LABOR BUT IT IS MY CONTENTION THAT THESE ITEMS ARE DEFINITELY SAFETY RELATED, AND ARE DEFINITELY SAFETY HAZARD.  THEY SHOULD LAST THE LIFE OF THE VEHICLE, OR AT LEAST MUCH LONGER THAN THEY HAVE.    I HAVE PHOTOGRAPHS OF THESE AVAILABLE TO EMAIL AND THERE IS AN INTERNET SITE IN THE MITSUBISHI FORUMS THAT REPORTS NUMEROUS OTHER COMPLAINTS DESCRIBED ALMOST IDENTICALLY. *TR",
        "vin": "JA4LZ31G33U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/05/2010",
        "dateOfIncident": "11/05/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10364210,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A MITSUBISHI 2003 OUTLANDER  - THE HEATING COOLING KNOB IS VERY HARD TO TURN AND EVENTUALLY BROKE OFF - I SPENT OVER $300 TO FIX IT - THEY INSTALLED A $150.00 PART BUT SAID I WOULD NEED A MORE EXTENSIVE FIX TO GET THE KNOB TO TURN FROM HEATING TO COOLING. THAT WOULD COST OVER $1500   ALSO TO TURN IT I HAVE TO GET DOWN ON THE FLOOR AND PUSH ON A PART UNDER THE HEATING SYSTEM - THIS IS DANGEROUS WITH A RISK OF BURNS BECAUSE IT GETS HOT DOWN THERE.  I FEEL THAT THE COMPANY SHOULD RECALL THESE CARS - NOT REALISTIC TO HAVE SUCH AN EXPENSIVEFIX FOR WHAT SHOULD BE A SIMPLE PROBLEM WITH A TIGHT CABLE .  THEY KNOW ABOUT IT - OTHERS HAVE COMPLAINED . *TR",
        "vin": "JA4LZ31G73U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/07/2010",
        "dateOfIncident": "09/07/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10354321,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI OUTLANDER WHICH I PURCHASED NEW.  IT HAS NEVER BEEN IN AN ACCIDENT AND HAS BEEN KEPT IN A GARAGE WHEN PARKED.  BOTH OF MY HEADLIGHTS HAVE SEVERE CRACKS AND NOW I HAVE MOISTURE INSIDE THE LIGHTS. *TR",
        "vin": "JA4LZ41G93U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/09/2010",
        "dateOfIncident": "05/15/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329497,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I ALSO HAVE THE CRACKING LIGHT PROBLEM WHICH REDUCES VISION AT NIGHT. WHENEVER THE CAR WAS MUCH NEWER I HAD TAKEN IT IN TO THE DEALER FOR A SERVICE COMPLIANCE AND TOLD THEM ABOUT THE LIGHTS AND WAS TOLD THERE WAS NOTHING THEY COULD DO EXCEPT REPLACE THE ASSEMBLIES AT ABOUT 150-200 DOLLARS PER SIDE. *TR",
        "vin": "JA4LX41GX3U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "05/06/2010",
        "dateOfIncident": "11/18/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10329154,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FROM THE TIME OF PURCHASE THE HEADLIGHT ASSEMBLIES ARE CRACKING FROM THE INSIDE OUT REDUCING THE LIGHT, MAKING IT UNSAFE TO DRIVE AT NIGHT. *TR",
        "vin": "JA4LZ41G13U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/11/2010",
        "dateOfIncident": "02/28/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10318896,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY MITSUBISHI OUTLANDER HEADLIGHTS ARE CRACKED AND HAZED, THIS IS NOT FROM NORMAL USE, THIS IS DEFECT IN THE MANUFACTURING OF THE HEADLIGHT ASSY. THEY HAVE CAUSED ME TO SLAM ON MY BRAKES 3 TIMES DUE TO POOR ILLUMINATION OF THE ROAD. I BELIEVE THAT MITSUBISHI SHOULD OFFER TO FIX THE HEADLIGHTS, OR OFFER A DISCOUNT, NOT $300 HUNDRED DOLLARS A PIECE TO REPLACE!!!!! *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/11/2010",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10319096,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6)    MY NAME IS [XXX] . CONTACT NUMBER IS [XXX] . I OWN A 2003 MITSUBISHI OUTLANDER. A LITTLE  OVER 2 YEARS AGO THE CAR STARTED TO VIBRATE VIOLENTLY BETWEEN 30 AND 50 MILES PER HOUR. I LOOKED UNDER THE CAR AND SAW THAT THE BOOTS ON THE CV JOINTS WERE CRACKED AND HAD LEAKED OUT THE GREASE INSIDE THE BOOTS. I ASSUMED THIS WAS THE PROBLEM. I BOUGHT NEW AXLES AND REPLACED THEM. DURING THE INSTALLATION WHILE REMOVING THE AXLE BRACKET ON THE PASSENGER SIDE I FOUND THAT ONE OF THE 2 BOLTS HOLDING THE BRACKET INPLACE HAD SHEARED OFF FROM THE VIBRATION. IF THE SECOND BOLT HAD BROKEN AS WELL THE AXLE WOULD HAVE BROKEN AWAY FROM THE ENGINE BLOCK AND SURELY CAUSED COMPLETE LOSE OF CONTROL OF THE CAR AND A POTENTIAL LIFE THREATENING ACCIDENT. I REPLACED THE AXLES AND THE BRACKET BOLTS AND THOUGHT THAT WAS THE END OF IT. I TEST DROVE THE CAR AFTER THE REPAIRS AND TO MY DISMAY THE VIOLENT VIBRATION WAS STILL THERE. I TOOK THE CAR TO A PROFESSIONAL SHOP FOR FURTHER DIAGNOSIS AT WHICH TIME THE TECHNICIAN CONFIRMED THE VIBRATION AND WAS STUMPED BY IT'S ORIGIN. HE RAN A SEARCH ON ALLDATA AND COME TO FIND OUT YOU'VE KNOW ABOUT A PROBLEM KNOW AS TORQUE CONVERTER VIBRATION IN THESE MITSUBISHI'S SINCE 10/2003 AND THAT IT GOES BACK TO MODELS AS EARLY AS 1997 PER YOUR NO. TSB-03-23-006. SO WHY HAVEN'T YOU DONE ANYTHING ABOUT IT? YOU CONTINUE TO ALLOW MITSUBISHI TO PUT DEFECTIVE AND DANGEROUS CARS ON THE ROAD THAT COULD ENDANGER THE SAFETY AND WELL BEING OF THE DRIVER AND THE PUBLIC IN GENERAL IF THE AXLE BROKE LOOSE AND THE DRIVE LOST CONTROL OF THE VEHICLE. WHAT DO YOU HAVE TO SAY FOR YOURSELVES?  WHY DOES SOMEONE HAVE TO DIE BEFORE YOU'LL DO ANYTHING ABOUT THESE DANGEROUS DEFECTS. I'D LIKE AN EXPLANATION. I CAN BE REACHED AT THE NUMBER ABOVE OR BY EMAIL AT [XXX] . *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/26/2010",
        "dateOfIncident": "06/01/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10302312,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN SLOWING DOWN AND THEN ACCELERATING AT ABOUT 35MPH, THE TRANSMISSION DOWNSHIFTS HARD, JERKING THE CAR FORWARD HARD AND CAUSING ONE OF THE REAR CV JOINTS TO POP. THE DEALER SAID THERE WASN'T ENOUGH OCCURRENCES OF IT HAPPENING TO WARRANT ANY INSPECTION OR REPAIR. THEY CALLED IN A MITSUBISHI REP AND HE CLAIMED TO NEVER FEEL OR HEAR THE PROBLEM EVEN THOUGH THE SERVICE TECH DID. *TR",
        "vin": ""
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "10/28/2009",
        "dateOfIncident": "10/27/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10290158,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS PERTAINS TO MY 2003 MITSUBISHI OUTLANDER (CURRENT MILEAGE 44732) AND WAS OUR FIRST ENCOUNTER WITH THIS POTENTIALLY DANGEROUS PROBLEM.    MY WIFE WENT TO THE POST OFFICE IN TOWN TO MAIL A PACKAGE. AFTER STOPPING IN THE PARKING SPOT, THE CAR SURGED (ACCELERATED) BEFORE SHE COULD SHIFT INTO PARK AND STRUCK THE LANDSCAPING WALL AT THE POST OFFICE. FORTUNATELY, NO ONE WAS WALKING ON THE SIDEWALK BETWEEN THE FRONT OF THE CAR AND A HEDGE IN FRONT OF THE WALL. ALSO, FORTUNATELY, ONLY DAMAGE WAS DONE TO THE CAR.     AN INCIDENT REPORT HAS BEEN FILED WITH THE LOCAL POLICE, MITSUBISHI, AND 21ST CENTURY INSURANCE. THE CAR IS CURRENTLY IN MY GARAGE. *TR",
        "vin": "JA4LX31G53U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/13/2009",
        "dateOfIncident": "06/09/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287175,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. ONE YEAR AFTER PURCHASING THE VEHICLE SHE HAD TO REPLACE THE  ENGINE, RADIATOR, GASKETS, AND WATER PUMP. SHE IS CURRENTLY UNABLE TO DRIVE THE VEHICLE. THE MANUFACTURER ADVISED HER THAT THE COOLANT FAN WAS REPLACED TWICE PER THE RECALL WITH THE PREVIOUS OWNER. THEY ALSO STATED THAT SINCE THE WARRANTY EXPIRED SHE COULD NOT RECEIVE A FREE REMEDY. NONE OF THE REPAIRS HAVE REMEDIED THE FAILURE. THE FAILURE MILEAGE WAS 67,500.",
        "vin": "JA4LZ31G13U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/22/2009",
        "dateOfIncident": "05/01/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284859,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER. BOTH FRONT HEADLIGHT IN THE VEHICLE ARE CRACKED WHICH ALLOWS WATER TO GO INSIDE. DUE TO THIS, THE VEHICLE WILL NOT PASS INSPECTION. SHE DID RESEARCH ON THIS DEFECT AND FOUND NUMEROUS COMPLAINTS ON THIS PROBLEM. SHE ALSO FOUND A TSB ON THIS PROBLEM AND SHE SPOKE WITH THE MANUFACTURE, THEY STATED IT WAS NOT A RECALL BECAUSE IT DOES NOT APPEAR TO BE A SAFETY CONCERN. SHE BELIEVES THIS SHOULD BE RECALLED AND THAT THE MANUFACTURE SHOULD BE RESPONSIBLE FOR THE REPAIRS. THE FAILURE MILEAGE WAS 35,000. THE CURRENT MILEAGE IS 68,000.",
        "vin": "JA4LZ31G53U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/14/2009",
        "dateOfIncident": "07/13/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276711,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEADLIGHTS ON MY 2003 MITSUBISHI OUTLANDER HAVE STRESS CRACKS EVENTUALLY  RESULTING IN THEM FOGGING OVER AND EVEN TAKING IN WATER AND BLOWING BULBS. WHEN I RESEARCHED IT ONLINE, IT APPEARS THIS IS A COMMON PROBLEM AMONG THIS MAKE/MODEL OF VEHICLE. REPLACEMENT ASSEMBLY KITS ARE ONLY AVAILABLE THROUGH THE DEALER AND THIS IS NOT COVERED UNDER ANY KIND OF WARRANTY. *TR",
        "vin": "JA4LZ31G43U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/25/2009",
        "dateOfIncident": "06/16/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274901,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE HAVE BEEN NO REPAIR ISSUES WITH THIS 2003 OUTLANDER. THERE HAVE BEEN NO COOLANT OR ANY FLUID LEAKS WITH THIS CAR. THE CAR SUDDENLY FILLED WITH SMOKE ON THE PASSENGER'S SIDE; SMOKE POURED FROM THE ENGINE; PRIOR TO THAT - FIVE MINUTES EARLIER THE CHECK ENGINE LIGHT WENT ON AND ACCELERATION WAS DIFFICULT; THERE WAS AN ODD ODOR AS WELL AS A METAL ON METAL TYPE SOUND. 911 WAS CALLED AS THE SMOKE WAS HEAVY. THE DEALERSHIP WAS ASKED BY MITSUBISHI CORP. TO PULL THE ENGINE TO DETERMINE IF IT WAS THE ENGINE - WARRANTIED OR OUR FAULT- A RADIATOR ISSUE. THIS WAS A 400$ COST TO US UNLESS THEY FOUND IN OUR FAVOR..THIS WAS IN ADDITION TO THE 80$ DIAGNOSTIC FEE TO BEGIN THE PROCESS. THEY ARE SAYING THAT THERE IS A CRACK IN THE RADIATOR WHERE THE ENGINE CONNECTS BY A HOSE TO THE RADIATOR AND THAT IT IS \"NORMAL\" WEAR. THERE IS NOTHING NORMAL ABOUT THIS. IT WAS IMMEDIATE AND CATASTROPHIC. THEY WANT TO CHARGE US $3600 TO REPLACE THE ENGINE. I AM ARGUING THAT THIS IS OBVIOUSLY A DEFECT - WE HAVE 100,000/7  YEAR WARRANTY ON THE DRIVETRAIN. MY CAR ONLY HAS 57,000 MILES AND HAS RUN PERFECTLY FINE UP TO LAST WEEK. I HAVE ASKED MITSUBISHI TO RECONSIDER AND HAVE BEEN PROMISED AN ANSWER BY A CASE MANAGER BY CLOSE OF BUSINESS TOMORROW -6/25. I HOLD LITTLE HOPE THAT THEY WILL COVER THE COST OF AN ENGINE YET I FEEL THAT THE WAY IN WHICH THE ENGINE OVERHEATED AND THEN DIED IS NOT ALL NORMAL FOR A CAR WITH SUCH LOW MILEAGE AND ONE WHICH HAS NO HISTORY OF REPAIRS. WE NEVER RECEIVED A RECALL NOTICE ON A RADIATOR FAN CONTROL PART AND WONDER IF THAT IS WHAT CAUSED THIS SERIES OF EVENTS TO OCCUR. IF SO, ARE THEY NOT RESPONSIBLE FOR THE REPAIR?  I CURRENTLY HAVE ONLY FOUR PAYMENTS LEFT ON THE CAR FOR A TOTAL OF A BIT UNDER 2000$. THE DEALERSHIP TOLD ME THAT WITHOUT REPLACING THE ENGINE, THEY COULD ONLY GIVE ME 500$ TOWARD A TRADE! I WOULD APPRECIATE YOUR INTERVENTION AND HELP. *TR",
        "vin": "JA4LZ41G53U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "06/12/2009",
        "dateOfIncident": "01/04/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10273666,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD THE COOLING FAN CONTROLLER REPLACED TWO TIMES/FANS COMING ON IMMEDIATELY WHEN STARTING THE CAR/ I HAD TO REPLACE THE THIRD ONE ON MY DIME/ NOW ITS CUTTING OUT @ CERTAIN SPEEDS/ I HAVE REPLACED THE MASS AIR FLOW METER/BOTH COILS /SPARK PLUGS/ PLUG WIRES STILL THE PROBLEM CONTINUES.*TR",
        "vin": ""
    },
    {
        "components": "STEERING,VISIBILITY",
        "crash": true,
        "dateComplaintFiled": "05/22/2009",
        "dateOfIncident": "03/31/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10269738,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER.  WHILE DRIVING AT AN UNKNOWN SPEED, SMALL STONES FELL OFF OF ANOTHER VEHICLE AND STRUCK THE SUNROOF OF THE CONTACT'S VEHICLE.  AS A RESULT, DEBRIS AND GLASS SHATTERED INSIDE OF HER VEHICLE.  TWO PASSENGERS WERE MODERATELY INJURED.  IN ADDITION, WHILE DRIVING APPROXIMATELY 60 MPH, THE VEHICLE ROLLED OVER WITHOUT AN IMPACT OR CRASH OCCURRING.  THE VEHICLE WAS TOWED TO THE DEALER, BUT THEY COULD NOT IDENTIFY THE CAUSE OF THE FAILURE.  THE FAILURE AND CURRENT MILEAGES WERE 100,000.   UPDATED 6/18/09 *CN  THE CONSUMER STATED THE SUN ROOF WAS NOT TEMPERED. UPDATED 06/22/09. *JB",
        "vin": "JA4LX41G63U"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS,SEAT BELTS,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/27/2009",
        "dateOfIncident": "11/20/2007",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10260218,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER.  WHILE DRIVING APPROXIMATELY 30 MPH ON NORMAL ROAD CONDITIONS, THE REAR BRAKE LIGHTS ACTIVATED WITHOUT THE BRAKE PEDAL BEING DEPRESSED.  THE FAILURE OCCURRED SPONTANEOUSLY WHENEVER THE VEHICLE WAS IN OPERATION.  IN ADDITION, THE SRS WARNING INDICATOR ILLUMINATED ON THE INSTRUMENT PANEL AND REMAINED LIT UNTIL THE ENGINE WAS TURNED OFF.  THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER FOR DIAGNOSTIC TESTING AND THEY STATED THAT THE FAILURE WAS RELATED TO THE ELECTRICAL SYSTEM.  THE VEHICLE WAS PREVIOUSLY REPAIRED ACCORDING TO NHTSA CAMPAIGN ID NUMBER 03V194000 (ELECTRICAL SYSTEM;WIRING,INTERIOR/UNDER DASH); HOWEVER, THE RECALL REMEDY DID NOT CORRECT THE FAILURE.  ON A SEPARATE OCCASION, THE INSTRUMENT CLUSTER FAILED AND THE CONTACT NOTICED A BURNING SMELL INSIDE THE PASSENGER COMPARTMENT.  ALSO, THE ACCELERATOR PEDAL WOULD BECOME STUCK WITHOUT WARNING WHEN IT WAS DEPRESSED AND THE FRONT DRIVER'S SIDE SEAT BELT RETRACTOR WAS INOPERATIVE.  THE WEBBING FAILED TO EXTRACT.  THE FAILURE MILEAGE WAS 82,000 AND CURRENT MILEAGE WAS 99,000.",
        "vin": "JA4LZ41G13U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/17/2009",
        "dateOfIncident": "01/20/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10259091,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TEMPERATURE KNOB ON THE MITSUBISHI OUTLANDER 2003 IS VERY DIFFICULT TO TURN ON FOR HEAT. SOMETIMES I CAN'T GET IT TO MOVE AT ALL, AND I HAVE TO DRIVE IN THE COLD. I SUFFER FROM ARTHRITIS, AND THIS MAKES IT VERY DIFFICULT FOR ME TO DRIVE AS MY FINGERS FREEZE-UP IN THE COLD WEATHER. *TR",
        "vin": "JA4LX31G63U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/04/2009",
        "dateOfIncident": "02/03/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10257441,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM HIGHLY UPSET ABOUT OUR 2003 MITSUBISHI OUTLANDER. WE TAKE VERY GOOD CARE OF OUR CAR. THE HEATER KNOB WAS HARD TO TURN FROM HOT TO COLD AND EVENTUALLY BROKE. I WENT IN TO VIVA MITSUBISHI AND THE INFORMED ME THAT THERE WAS A DEFECT ON THE OUTLANDERS AND LANCERS. THEY HAVE NOT RECALLED THE CARS TO FIX THIS PROBLEM. THEY ALSO INFORMED THAT IT WOULD COST $1300 TO FIX IT. WE DON'T HAVE THE MONEY TO FIX IT. I HAVE TO LITTLE BOYS AND IT GETS COLD HERE AND MY BOYS HAVE TO FREEZE. ALSO, WHEN WE NEED TO DEFROST THE WINDOWS, WE CAN'T CHANGE THE TEMP AND IT DOESN'T WORK. THIS IS A HUGE SAFETY HAZARD FOR US. I CAN'T BELIEVE MITSUBISHI IS WILLING TO PUT OUR LIVES, EVEN CHILDREN'S LIVES, IN DANGER ALL BECAUSE THEY WON'T RECALL THIS PART. *TR",
        "vin": "JA4LX31GX3U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/28/2008",
        "dateOfIncident": "07/10/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246914,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 DIAMANTE WITH ABOUT 60,000 MILES ON IT.  MY WINDOWS CONTINUALLY FOG UP WHILE DRIVING OR PARKED AND THE DEFROSTER/VENTS DOES NOT ELIMINATE THE FOG AT ALL, MAKING DRIVING VERY DIFFICULT AND DANGEROUS ESPECIALLY IN RAINY WEATHER AND DURING THE NIGHTTIME. THE SMELL OF ANTIFREEZE IS EXTREMELY STRONG INSIDE THE VEHICLE.   I HAD A PROBLEM WITH MY TRANSMISSION SHIFTING AND THE LIGHT AROUND THE \"N\" ON THE INSTRUMENT PANEL WAS FLASHING.  THE MECHANIC SAID MY HEATER CORE WAS  LEAKING COOLANT ONTO THE TRANSMISSION CONTROL MODULE CAUSING IT TO MALFUNCTION.  I WAS TOLD THAT EVEN THOUGH I PAID FOR AND HAVE AN EXTENDED WARRANTY ON THIS VEHICLE IT WOULD NOT BE COVERED BECAUSE THE HEATER CORE LEAKING IS WHAT CAUSED THE TRANSMISSION CONTROL MODULE TO FAIL.  THE HEATER CORE WAS REPLACED ALONG WITH THE CONTROL MODULE AND THE RELAY WITH A COST OF OVER 2,500 DOLLARS.  IT SEEMS LIKE A PROBLEM LIKE THIS THAT IS EXTREMELY COMMON IS THESE VEHICLES, CREATES SAFETY AND HEALTH HAZARDS, AND VERY EXPENSIVE TO FIX SHOULD BE RECALLED AND COVERED UNDER WARRANTY.  *TR",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/15/2008",
        "dateOfIncident": "09/14/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10242260,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MITSUBISHI OUTLANDER.  ON TWO DIFFERENT OCCASIONS, THE TIRES FLATTENED DUE TO THE VALVE STEMS.  THREE OF THE VALVE STEMS WERE REPAIRED AT $20 EACH, AND THE FIRST VALVE STEM WAS FREE.  NHTSA CAMPAIGN ID NUMBER 08T018000 (TIRES:VALVE) WAS REFERENCED.  THE FAILURE MILEAGE AND VIN WERE UNKNOWN.",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/07/2008",
        "dateOfIncident": "07/07/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10233402,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I TOOK MY VEHICLE IN TO THE DEALER TWICE IN 2006 ABOUT A \"SQUEAK\" THAT I HEARD FROM THE REAR PASSENGER SIDE WHILE DRIVING. THE FIRST TIME A SERVICE TECH DROVE THE AROUND THE NEIGHBORHOOD, BUT COULDN'T HEAR ANYTHING. THE SECOND TIME...THE SAME AND YOUR SERVICE DEPARTMENT DID NOT CHECK IT OUT ON MY REQUEST.    THE PROBLEM IS THAT I WASN'T SIMPLY THAT I WAS HEARING THINGS. AT THIS POINT, THE SQUEAK IS SO PRONOUNCED THAT IT CAN BE HEARD FROM THE INSIDE AND FROM THE OUTSIDE OF THE VEHICLE. I FOLLOWED DUE DILIGENCE, SO TO SPEAK, AND SOUGHT HELP DURING THE WARRANTY PERIOD, BUT WAS NOT HELPED NOR SATISFIED.       ON A RECENT BRAKE INSPECTION AT SEARS, I WAS TOLD THAT THE SUSPENSION WAS THE CULPRIT. I SUSPECTED THIS ALL ALONG. TO DATE I HAVE AGAIN VISITED MY MITSUBISHI DEALER AND THEY HAVE ARRIVED AT A COST TO REPAIR AND REPLACE THE REAR UPPER CONTROL ARMS AND BOTH LOWER BUSHINGS.     THE DEALER SHOULD HAVE TAKING CARE OF THIS A LONG TIME AGO RATHER THAN TELLING ME THAT THEY DIDN'T HEAR ANYTHING. ON MY VISIT TODAY, I WAS TOLD THAT IT ISN'T REALLY A SAFETY ISSUE. IN MY VIEW, WHEN A VEHICLE SQUEAKS AS THOUGH SOMETHING IS COMING APART....IT IS A SAFETY ISSUE.        ON A RECENT BRAKE INSPECTION AT SEARS, I WAS TOLD THAT THE SUSPENSION WAS THE CULPRIT. I SUSPECTED THIS ALL ALONG. TO DATE I HAVE AGAIN VISITED MY MITSUBISHI DEALER AND THEY HAVE ARRIVED AT A COST TO REPAIR AND REPLACE THE REAR UPPER CONTROL ARMS AND BOTH LOWER BUSHINGS.     THE DEALER SHOULD HAVE TAKING CARE OF THIS A LONG TIME AGO RATHER THAN TELLING ME THAT THEY DIDN'T HEAR ANYTHING. ON MY VISIT TODAY, I WAS TOLD THAT IT ISN'T REALLY A SAFETY ISSUE. IN MY VIEW, WHEN A VEHICLE SQUEAKS AS THOUGH SOMETHING IS COMING APART....IT IS A SAFETY ISSUE.  *TR",
        "vin": "JA4LX31G33U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "05/16/2008",
        "dateOfIncident": "05/16/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10228038,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS STUCK IN TRAFFIC FOR 45 MINUTES AND MY VEHICLE (2003 MITSUBISHI OUTLANDER) OVERHEATED.  AS A RESULT OF THIS I BLEW THE SEAL IN THE RADIATOR. I WAS NEVER NOTIFIED THAT THERE WAS A RECALL ON THE COOLING FANS BUT THE DEALERSHIP HAD MY ADDRESS AND DID NOT NOTIFY ME. WHEN I CONTACTED THE DEALERSHIP, THEY STATED THAT THE NOTICES ARE MAILED FROM MITSUBISHI AND NOT THEIR DEALERSHIP.  *TR",
        "vin": "JA4LZ41G63U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/28/2008",
        "dateOfIncident": "04/17/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10225904,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A MITSHBISHI OUTLANDER IN 2003. IT RECENTLY OVERHEATED AND I TOOK TO MY REGULAR AUTO SHOP. HE CHANGED THE RADIATOR BECAUSE OF THE HEATING DAMAGE HOWEVER, WHEN HE CHECKED THE FAN SYSTEM , HE REALIZED THAT THE POWER MOTOR WAS BURNT OUT. HE LOOKED THE VEHICLE UP AND NOTIFIED ME THAT THERE WAS A DEALER RECAL L ON THE 2003-2006, COOLING FAN SYSTEM. BECAUSE HE HAD ALREADY WORKED ON THE CAR, I PAID HIM ~$400 (I CAN'T RECALL THE EXACT AMOUNT AT THIS TIME). I TOOK THE CAR TO MITSUBISHI AND THEY DID INFORM ME OF THE RECALL HOWEVER, STATED THAT THEY NEEDED HEADQUARTERS APPROVAL FOR THE REPAIR. SEVERAL DAYS I WAS CONTACTED AND THE REPAIRS WERE NOT APPROVED BECAUSE, THEY STATED THAT I WAS SENT A RECALL NOTICE IN 2007. I EXPLAINED THAT I NEVER RECEIVED SUCH NOTICE BUT THEY STILL REFUSED TO ASSIST WITH ANY REPAIRS, OR ANY REIMBURSEMENT FOR REPAIRS.  I THINK THIS IS UNFAIR AND WOULD GREATLY APPRECIATE YOUR ASSISTANCE.  *TR",
        "vin": "JA4LX31G03U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "03/05/2008",
        "dateOfIncident": "03/05/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220101,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHT LENS (COVERS) HAS BECOME CLOUDY AND CRACKED,  MAKING HEADLIGHTS VERY DIM TO ONCOMING CARS.  DEALER SAYS IT IS A COMMON PROBLEM BUT NOT COVERED UNDER WARRANTY. IT SEEMS STRANGE THAT AN ITEM THAT IS KNOWN BY DEALERS TO BE A HAZARDOUS, ILLEGAL ,PROBLEM IN MOST STATES, AND THAT COSTS OWNERS 700+ DOLLARS WOULD NOT BE RECALLED.   *TR",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/05/2008",
        "dateOfIncident": "03/03/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10220182,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REGULAR USE. WIRING CONNECTION TO AUTOMATIC SHIFTER CONTROL HAS BROKEN. SHIFTER HAS TO BE REPLACED. AUTOMATIC DRIVE LIGHTS DON'T WORK (DRIVE, REVERSE, NEUTRAL, ETC.) AND MANUAL SHIFTER FAILS TO WORK. NO LONGER SAFE TO DRIVE WITHOUT REPAIRS.  *TR",
        "vin": "JA4LZ31G63U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218777,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON 12/21/07 I HAD MY CAR SERVICED FOR THE 75,000 MILE SERVICE AT THE DEALER. THEN ON 2/14/08 I WAS DRIVING HOME FROM WORK WHEN ALL OF A SUDDEN MY MITSUBISHI OUTLANDER STARTING SHAKING AND THE SERVICE ENGINE LIGHT CAME ON. I IMMEDIATELY TELEPHONED THE DEALER TO SEE WHAT THEY RECOMMEND I WAS ASKED TO BRING THE CAR FIRST THING IN THE MORNING. THE VERY NEXT DAY I BARELY MADE IT TO DEALER WHICH IS ONLY 7MINUTES AWAY FROM MY HOME (IN THE SAME TOWN). AS SOON AS I PULLED INTO THE DEALERSHIP THE CAR TURNED OFF. I WAS TOLD THAT THE HEATING COIL BURNED OUT WHICH CAUSED MY SPARK PLUGS TO BURN OUT AND THE CAR TO MISFIRE. I AM BEING TOLD THAT I MAY NEED TO REPLACE THE ENGINE IF ANY OF THE PISTONS WERE DAMAGED IF NOT THEN I ONLY HAVE TO REPLACE THE PARTS WHICH WERE DAMAGED. WHAT I DON'T UNDERSTAND IS HOW CAN THIS HAPPEN TO A VEHICLE WHICH HAS HAD EVERY RECOMMENDED SERVICE  PERFORMED TO IT ON OR BEFORE THE RECOMMENDED MILEAGE?!  *TR",
        "vin": "JA4LZ31G73U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "01/22/2008",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10215606,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OUR MITS. OUTLANDER PULLS TO THE RIGHT, BADLY! WE HAD IT ALIGNED...TWICE! HAD NEW TIRES PUT ON, RE-ALIGNED, AND IT STILL PULLS TO THE RIGHT! IF I LET GO OF THE WHEEL, W/IN 2 SECONDS, I AM IN THE NEXT LANE!  *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "01/09/2008",
        "dateOfIncident": "01/05/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10214300,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS FOR A MITSUBISHI OUTLANDER 2003. THERE WAS A LOT OF WATER UNDER THE SEATS, DON'T KNOW HOW, AND THE SERVICE ENGINE LIGHT IS ON DUE TO BAD OXYGEN SENSOR AND THERE MIGHT BE CORROSION IN THE ELECTRICAL SYSTEM, THIS CAN CAUSE A FIRE, REAR STOP LIGHT STOP WORKING, THE SEAT BELT TENSIONER CAN GO BAD.  TOOK THE CAR TO THE DEALERSHIP, AND THE MANUFACTURER SAID THAT I ONLY HAVE 1 RECALL WHEN THE NHTSA SAYS THAT THERE'S A RECALL FOR THIS,=NHTSA CAMPAIGN NUMBER 03V194000.  *TR",
        "vin": "JA4LX31G03U"
    },
    {
        "components": "SUSPENSION,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/26/2007",
        "dateOfIncident": "11/26/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209993,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "DIAMOND CARE",
                "productModel": "DIAMOND CARE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "WHEN CAR WAS FIRST PURCHASED TOLD DEALER IT FELT LIKE BACK END WAS KICKIN OUT ON WET ROADS,TOOK IT DEALER WAS TOLD THEY COULD FIND NOTHING. SEVERAL DAYS LATER CAR SPUN OUT ON WAY TO WORK DUE TO BLOW OUT. HAD VEHICLE TOWED TO DEALER WERE UPPER AND LOWER LATS. WERE REPLACED.(NO OLD PARTS NOT AVAILABLE) CAR SEEMED OK FOR SEVERAL MONTHS AT WHICH POINT IT BEGAN TO FEEL LIKE IT WAS SLIDING AROUND IN REAR END AGAIN. AGAIN DEALER CHECKED FOUND NOTHING.. MY HUSBAND THREW A FIT WITH DEALER AT WHICH POINT A BALL JOINT WAS REPLACED(PART NOT AVAILABLE), IN MY OPINION ONLY TO PACIFY US. THE CAR HAS STILL NEVER FELT RIGHT. AT WHICH POINT THE WARRANTY HAS EXPIRED AND THE DEALERSHIP REFUSES TO EVEN TALK TO US ABOUT THIS. NOW FOUR MONTHS AFTER HAVING FOUR NEW TIRES MOUNTED AND BALANCED I HAVE TWO REAR TIRES SO WORN AND DAMAGED THE BELTS ARE COMING THROUGH THEM. I HAVE TAKEN THE CAR TO A PRIVATE TECH.TO TRY TO FIND ANYTHING THAT MAY BE WRONG. I AM SCARED FOR MYSELF AND MY FAMILY EVERYTIME I HAVE TO DRIVE THIS CAR!  *TR",
        "vin": "JA4LZ31G93U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/10/2007",
        "dateOfIncident": "11/09/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208572,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "11/08/07 MY HUSBAND WAS DRIVING OUR FAMILY TO MY SONS FOOTBALL PRACTICE WHEN HE NOTICED THAT THE ENTIRE STEERING WHEEL WAS SHIFTING LEFT TO RIGHT IN THE DASH BOARD. 11/09/07 MY HUSBAND LOOKED AT THE STEERING WHEEL AND IT WAS LITERALLY FLOPPING AROUND IN THE DASH BOARD, WHEN HE REMOVED THE DASH THE STEERING COLUMN FELL IN THE DRIVER'S SEAT. THE ENTIRE STEERING COLUMN BROKE FREE FROM WERE IT IS BOLTED TO THE CAR.  *TR",
        "vin": "JA4LX41G33U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/21/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206477,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN RESEARCHING WHAT MIGHT BE WRONG WITH MY MITSUBISHI GALANT HEATER, I FIND IT IS A COMMON PROBLEM DESCRIBED TO THE TEE. NOT HAVING HEAT IN MY CAR AND LIVING IN THE PACIFIC NORTHWEST COULD PROVE TO BE DANGEROUS FOR MYSELF AND OTHERS AS VISIBILITY AND FREEZING WILL OCCUR AS I HAVE TO RUN THE COLD AIR ON MY WINDSHIELD TO SEE.  *TR",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/08/2007",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205171,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS HAVE NUMEROUS STRESS CRACKS, UNABLE TO GET 2007 INSPECTION DUE TO HEADLIGHTS. HAVE CONTACTED DEALERSHIP NUMEROUS TIMES, WAS GIVEN MITSUBISHI DISTRICT MANAGER NAME AND NUMBER, WILL NOT RETURN CALL.  HEADLIGHTS NOW HAVE WATER INSIDE .  HAVE TAKEN NUMEROUS PICTURES OF OTHER MITSUBISHI OUTLANDERS WITH SAME PROBLEM.  WAS FIRST QUOTED $750.00 FOR REPLACEMENT, NOW QUOTED $850.00. CONSUMERS SHOULD NOT HAVE TO REPLACE SOMETHING THAT NEVER SHOULD HAVE HAPPENED IN THE FIRST PLACE.  *TR",
        "vin": "JA4LX31G13U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/19/2007",
        "dateOfIncident": "01/15/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10200074,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I BOUGHT MY 2003 MITSIBUSHI OUTLANDER IN JANUARY 2005 WITH 32,000 MILES ON IT.  THE HEADLIGHTS WERE SHOWING SOME STRESS CRACKS FROM THE HEADLAMP HEAT.  I NOW HAVE 69,000 MILES ON THE CAR AND THE HEADLIGHTS HAVE SEVER STRESS CRACKS IN THE LENSES THAT ARE EXTREMELY NOTICEABLE.  I HAVE HEARD THIS IS A COMMON PROBLEM FOR THESE CARS. *JB",
        "vin": ""
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "07/16/2007",
        "dateOfIncident": "05/10/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10196481,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NO EVENTS.  HEADLIGHT GLOBES ARE INADEQUATE.  THEY CRACKED FOR NO REASON OTHER THAN POOR QUALITY.  THIS ALLOWED MOISTURE TO INTER THE HEADLIGHT ASSEMBLY CAUSING THE BULBS TO FAIL.  PAID $850.00 TO REPLACE DEFECTIVE HEADLIGHT ASSEMBLIES.  UNABLE TO DRIVE THE CAR AT NIGHT FOR FEAR OF TRAFFIC CITATIONS AND OBVIOUS SAFETY REASONS. *TR",
        "vin": "JA4LZ31G73U"
    },
    {
        "components": "SUSPENSION,SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/13/2007",
        "dateOfIncident": "02/12/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182467,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*-  CONTACT OWNS  A 2003 MITSUBISHI OUTLANDER, FOR WHICH HE HAD TO REPLACE THE REAR LOWER SUSPENSION ARM 4 TIMES. FIRST TIME IT WAS AT 30,000 MILES,  SECOND  TIME  AT 48,000 MILES, AND THE  THIRD TIME AT 89,000 MILES, AND  CURRENTLY  AT 106,000 MILES.  THE CONTACT  TOOK  VEHICLE  TO THE SAME DEALERSHIP , ARNOLD AUTOMOTIVE GROUP IN ROSEVILLE, MI  4 TIMES,  AND THEY STATED THAT THEY DIDN'T  KNOW WHY THE PART KEPT GOING BAD.  THE CONTACT  THE CURRENT MILEAGE WAS 106000.*AK  THE LEFT REAR SEAT BETL WOULD NOT RETRACT. THE SWAY BAR WERE REPLACED AND THE LOWER CONTROL ARM  WAS WORN.  UPDATED 03/30/07. *JB",
        "vin": "JA4LZ31G93U"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "01/16/2007",
        "dateOfIncident": "11/12/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178854,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE CRACKS IN THE HEADLIGHT LENS IN BOTH HEADLIGHTS. THERE HAS BEEN NO WRECKS, BANGS, OR BAD TREATMENT OF THIS VEHICLE. I WAS TOLD BY A SOURCE CLOSE TO THE COMPANY THAT THEY ARE STRESS FRACTURES, I AM CONCERNED THEY MAY BEGIN TO LEAK AND TAKE ON WATER. PLUS THEY ARE $400 EACH TO REPLACE. I CALLED MITSUBISHI AND ALL THEY WANTED TO TALK ABOUT WAS WARRANTY. THEN I WAS TOLD THEY DO NOT DO RECALLS UNLESS YOU FOLKS BRING IT TO THEIR ATTENTION. ANY HELP WILL BE APPRECIATED. I TALKED WITH LOCAL MITSUBISHI DEALER ABOUT IT IN MID DECEMBER 2006.  *NM",
        "vin": "JA4LX31G43U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/05/2006",
        "dateOfIncident": "09/05/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167358,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHEN THE VEHICLE WAS STARTED, THE COOLING FAN DID NOT ENGAGE COMPLETELY.  THE VEHICLE WAS TAKEN TO A PRIVATE REPAIR SHOP, WHERE IT WAS DETERMINED THAT THE FAN WAS A DEFECTIVE PART.  THE VEHICLE WAS THEN TAKEN TO A SERVICE DEALER, WHERE THE DEALER INFORMED THE CONTACT THAT BECAUSE THE VEHICLE WAS OUT OF WARRANTY, THE REPAIRS WOULD NOT BE MADE.  THERE WERE NO IMMEDIATE REPAIRS MADE.",
        "vin": "JA4LX31G73U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/12/2006",
        "dateOfIncident": "05/02/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10157413,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE MORNING OF MAY 2, WHILE IT WAS RAINING A CAR THAT WAS TWO CARS IN FRONT OF MY WIFE DECIDED TO MAKE A LEFT TURN ON THE HIGHWAY WITHOUT ANY ADVANCED NOTICE; MY WIFE ENDS UP RUNNING INTO THE CAR IN FRONT OF HER AND SERIOUSLY DAMAGING THE FRONT OF THE CAR.  THE AIRBAGS, HOWEVER DID NOT DEPLOY.  MY WIFE SUFFERED A CONTUSION ON HER HEAD.  MY 17 MONTH OLD DAUGHTER WAS ALSO IN THE CAR BUT WAS NOT SERIOUSLY HURT.  MY INSURANCE COMPANY ESTIMATES THAT THE REPAIRS WILL COST $8000 AND THE SENSORS FOR THE AIRBAGS WAS ONE OF THE PARTS THAT NEEDED TO BE REPAIRED.  THE SENSOR IS CURRENTLY BEING REPLACED.   *JB",
        "vin": "JA4LZ41G63U"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/01/2006",
        "dateOfIncident": "03/15/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154335,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER WENT OUT, AND AFTER SEVERAL ATTEMPTS TO HAVE REPAIRED, WAS INFORMED HEATER CORE WAS DEFECTIVE.  REPAIRING/REPLACING HEATER CORE IS AN EXTREMELY EXPENSIVE PROCEDURE!!  *NM",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "12/29/2005",
        "dateOfIncident": "12/20/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10146378,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE RADIATOR BLEW APART WHILE DRIVING ON THE HWY CAUSING THE ENGINE TO QUICKLY OVERHEAT. THERE WERE NO WARNING LIGHTS TO INDICATE THERE WAS A PROBLEM. UPON INSPECTION BY MY MECHANIC IT WAS DISCOVERED THAT THE CYLINDER HEAD ALSO CRACKED. HE WAS AWARE OF A POSSIBLE KNOWN ISSUE AND CONTACTED MITSUBISHI WHO VERIFIED A PROBLEM WITH THE COOLING FAN CONTROLLER. AFTER HAVING THE VEHICLE TOWED TO THE MITSUBISHI DEALERSHIP I WAS TOLD BY THEM THAT THEY WOULD ONLY COVER THE COST OF THE PARTS AND NOT THE LABOR. I WOULD HAVE THOUGHT THAT IF A DEFECTIVE PART CAUSED THESE PROBLEMS THAT I SHOULDN'T HAVE TO PAY ANYTHING MUCH LESS OVER $1,100 IN LABOR.",
        "vin": "JA4LX41G23U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/31/2005",
        "dateOfIncident": "10/13/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10141332,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONTACT'S VEHICLE  WAS INVOLVED IN A  THREE CAR COLLISION. UPON IMPACT, THE AIR BAGS DID NOT DEPLOY.  THE FRONT END OF THE VEHICLE WAS DAMAGED.  THE VEHICLE WAS TOWED TO THE MECHANIC, AND HE DETERMINED  THAT THE WIRE FOR THE SENSOR WAS TORN.  THIS SHOULD HAVE MADE THE AIRBAGS DEPLOY.   A POLICE REPORT TAKEN AT THE SCENE.*AK",
        "vin": "JA4LZ41G73U"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/23/2005",
        "dateOfIncident": "09/06/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140534,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HANDLE ON THE FRONT PASSENGER SIDE COMES OUT OF ITS PLACE.  THE HATCHBACK ON THE OUTLANDER NO LONGER CAN STAY UP ON ITS OWN, THE ARM THAT HOLDS IT UP IS DEFECTIVE.",
        "vin": "JA4LX31G13U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "10/04/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138599,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI LANCE OZ RALLY, CAR HAS 32,000 MILES ON IT, I PURCHASED IT USED.  I HAVE HAD A PROBLEM WHERE SOMETIMES I WOULD SMELL BURNING ODOR FROM THE VENTS.  I THINK CAR RUNS VERY RUFF AND IM NOT SURE WHAT IT IS.. I BELIEVE IT'S THE TRANSMISSION FROM READING ALL THE POST ON HERE.. AND ALSO THE SHIFTING IS ROUGH.  I WILL BE TAKING IT TO A DEALER SOON.. HOPEFULLY THEY WONT GIVE ME THE RUN AROUND AND FIX THE PROBLEM RIGHT AWAY.. THANKS!  *NM",
        "vin": "JA3AJ86E33U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "08/10/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137550,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MITSUBISHI MOTORS WILL NOT ACCEPT LIABILITY AND PAY TO HAVE A FAILURE OF A FACTORY WELD REPAIRED ON THE RIGHT FRONT ENGINE CROSS MEMBER OF MY 2003 MITSUBISHI MONTERO WHICH IS STILL UNDER THE FACTORY WARRANTY. MY INSURANCE ADJUSTER HAS SUBMITTED A LETTER INFORMING MITSUBISHI'S VEHICLE DEPARTMENT THAT THE DAMAGE TO MY VEHICLE IS DUE TO FAILURE FROM IMPROPER WELDING. I HAVE ALSO BEEN INFORMED BY A CERTIFIED BODY SHOP THAT THE PART WAS NOT WELDED PROPERLY. MITSUBISHI HAS REFUSED TO PARTICIPATE IN REPAIRING THE VEHICLE SINCE AUGUST 12, 2005.  *JB",
        "vin": "JA4NW51S73J"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "09/11/2005",
        "dateOfIncident": "09/09/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10136135,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON SEPT 3 MY WIFE WAS DRIVING OUR 2003 MITSUBISHI OUTLANDER WHEN IT VEERED TO THE RIGHT SO SHARPLY THAT IT ALMOST PULLED THE STEERING WHEEL FROM HER GRASP.  THE COULD NOT DUPLICATE THE OCCURRENCE,WE DECIDED WE WOULD GET IT CHECKED OUT NEXT WEEK.  BEFORE WE COULD GET THE VEHICLE CHECKED OUT,DUE TO HURRICANE KATRINA,ON SEPT.9 MY YOUNGEST DAUGHTER WAS JUST LEAVING SCHOOL, HAD ONLY GONE A FEW HUNDRED YARDS WHEN THE CAR SUDDENLY VEERED TO THE RIGHT,CAUSING HER TO GO OFF THE ROAD AND FLIP THE CAR.  A WITNESS SAID SHE SAW SOMETHING FLY OUT FROM UNDERNEATH THE CAR JUST BEFORE THE CRASH.  WITH THE CAR UPSIDE DOWN WE ALL SAW THE CV JOINT BROKEN.  I LOOKED ON THE SIDE OF THE ROAD DOWN FROM THE ACCIDENT SITE AND FOUND A PART THAT MAY BE THE CAUSE OF THE CRASH,I AM CHECKING THIS OUT,BUT HAVE ALSO FOUND OUT THROUGH INTERNET RESEARCH THAT THIS IS A PROBLEM WITH THIS MODEL VEHICLE.  DOES SOMEONE HAVE TO DIE BEFORE AN INVESTIGATION IS DONE CONCERNING THIS SERIOUS FLAW IN CONSTRUCTION.",
        "vin": "JA4LX41G73U"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/07/2005",
        "dateOfIncident": "07/03/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135671,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THIS IS A 2 YEAR OLD CAR AND THE HEATER AND AIR CONDITIONER DO NOT WORK. I HAVE RA AND LUPUS AND MY HUSBAND HAS EMPHYSEMA.  THE LACK OF AIR CONDITIONING MAKES IT HARD FOR HIM TO BREATH WHEN IT IS REALLY HOT, AND THE COLD REALLY HURTS MY JOINTS. THE AIR BROKE JUST A COUPLE OF MONTHS AFTER WE BOUGHT IT, WE TOOK IT BACK TO THE DEALER AND THEY SAID IT WAS NOT COVERED UNDER THE WARRANTY, WE  BOUGHT THE EXTENDED WARRANTY. THEN A MONTH AGO THE HEATER STOPPED WORKING, WE AGAIN TOOK IT TO THE DEALER AND THEY SAID IT WAS NOT COVERED BY THE WARRANTY BECAUSE IT IS A DEFECTIVE HEATER,SO THERE FOR IT IS NOT COVERED, I DO NOT KNOW WHY I PURCHASED A WARRANTY IF IT DOES NOT COVER DEFECTIVE EQUIPMENT. MY HUSBAND AND I ARE BOTH DISABLED AND ON A FIXED INCOME WHICH IS WHY WE PURCHASED THE EXTENDED WARRANTY, WE CAN NOT AFFORD TO FIX IT CAN YOU HELP.   *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/26/2005",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130966,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE FIRST TIME THE PROBLEM HAPPENED  WAS ABOUT A YEAR AGO WHEN COMING TO A STOP SIGN. THE CONSUMER  PUT HER FOOT ON THE BRAKE AND THE VEHICLE WOULDN'T STOP.  THE CONSUMER USED THE EMERGENCY BRAKE TO STOP. WHEN CONSUMER TRIED TO STOP WHILE GOING 10 MPH THE FIRST TIME THERE WAS NO PRESSURE IN THE BRAKES AND THEY WENT TO THE FLOOR. CONSUMER DIDN'T TAKE THE CAR TO THE MECHANIC AT THAT TIME.   THE PROBLEM SEEMED TO HAPPEN A ONCE A MONTH. IN  MAY IT HAPPENED TWICE. THE OWNER HAD THE VEHICLE TOWED FROM WORK TO THE DEALERSHIP WHO ADVISED THE CONSUMER THEY COULD NOT FIND ANY PROBLEM. TWO WEEKS LATER WHILE  DRIVING ON A BACK ROAD THERE WAS A MAN HOLDING A SIGN TELLING CARS TO SLOW DOWN, WHEN THE CONSUMER TRIED TO SLOW DOWN, THE BRAKES WENT TO THE FLOOR AGAIN. CONSUMER  PULLED EMERGENCY BRAKE AGAIN TO GET  VEHICLE TO  STOP. THE OWNER STATES THE BRAKES JUST WON'T HOLD. THE OWNER CALLED THE DEALERSHIP AGAIN TO INFORM THEM OF THE PROBLEM AND THEY CAN'T REPAIR THE BRAKES BECAUSE THEY CAN'T FIND ANY PROBLEMS WITH THE BRAKES. YESTERDAY WHILE DRIVING HOME FROM WORK THE OWNER PULLED UP TO GET OUT OF PARKING LOT AND TRIED TO PUT THE BRAKES ON WHEN THEY WENT TO THE FLOOR AGAIN, AND THEN THE OWNER PULLED THE EMERGENCY BRAKES AND VEHICLE STOPPED. *AK *JB",
        "vin": "JA4LX31G43U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/18/2005",
        "dateOfIncident": "06/14/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129169,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:   VEHICLE IS A 2003 MITSUBISHI OUTLANDER. TOOK IT TO IDEAL MITSUBISHI AUTOMOTIVE GROUP 645 S. HIGHWAY 92 SIERRA VISTA, AZ 85635 520-458-4808.  THEY FLUSHED THE TRANSMISSION ON 6-13-05, AND ON   6-14-05 SHE WAS ON A PULL OUT WITH HER FOOT ON THE BRAKE WHEN THE VEHICLE BEGAN TO ACCELERATE AND THE WHEELS STARTED TO SPIN.  SHE CONTACTED DEALERSHIP ON 6-14-05 AND LEFT A MESSAGE. ON 6-20-05 SHE WAS STOPPED AT AN INTERSECTION WHILE ACCELERATING VERY SLOWLY AND TURNING RIGHT, IT HAD A POWER SURGE, WHICH CAUSED IT TO BE PUSHED INTO THE OTHER LANE.  ALSO, ON 6-20-05  WHILE AFTER  VEHICLE SURGED AND JUMPED FORWARD IN THE LANE LIKE IT WAS BUCKING WHILE DRIVING ABOUT 20-30 MPH.   CONTACTED THEM AGAIN AND THEY DID NOT KNOW HOW TO RETRIEVE THEIR VOICE MAIL THAT WAS  WHY THEY DID NOT CALL HER BACK.  THEY TOLD HER TO BRING VEHICLE  BACK , AND THEY DID NOTHING WRONG, AND THAT IT HAD TO BE SOME OTHER MALFUNCTION.  BETWEEN 6-13 AND 6-21 THERE WERE OTHER OCCURRENCES WHICH THE CONSUMER HAS NOT DOCUMENTED.  ON 6-21-05 TOOK IT TO A LOCAL MECHANIC ,TIGERS SERVICE CENTER 160 EAST CALLE SONORA NOGALES, AZ 85621 520-377-2810, THEY TOLD CONSUMER THAT THERE WAS NO TRANSMISSION FLUID SHOWING ON THE STICK.  THE MECHANICS PUT IN TRANSMISSION FLUID AND REINSTALLED THE AIR FILTER SO THAT THE CASING WOULD SHUT.  WHEN THEY FOUND THE RUBBER GASKET FROM THE OLD AIR FILTER. THEY GAVE HER A TSB . 0323006 SUBJECT- TORQUE CONVERTER VIBRATION. WHILE AT THE MECHANICS THE CONSUMER CALLED THE DEALERSHIP AND HAD THEM TO TALK TO EACH OTHER.  THE DEALERSHIP SENT THE SPECIAL TRANSMISSION FLUID TO THE MECHANICS AT NO CHARGE.  ON 6-24 -05 SHE SENT A LETTER BY REGISTERED MAIL TO THE DEALERSHIP ADDRESSING HER CONCERN.  6-27-05  SHE CALLED THE DEALERSHIP SERVICE MANAGER, HE SAID, THAT THERE WERE HOLES IN HER STORY.  ON 7-11-05 SHE TOOK IT BACK THE MECHANICS BEFORE GOING ON VACATION, AND THERE WERE NO PROBLEMS WITH IT.     *AK",
        "vin": "JA4LZ31G13U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2005",
        "dateOfIncident": "12/14/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129014,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MONTERO SPORT XLS--- STUDDERS/JERKS AT 30+ MPH WHILES DRIVING DOWN THE RD, HAS BEEN IN SHOP 9 TIMES",
        "vin": "JA4MT21H23J"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "01/03/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123889,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR \"STUCK\" & VEHICLE REMAINED IN IDLE, FORCING TO CRASH",
        "vin": "JA4LZ41G23U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "03/18/2005",
        "dateOfIncident": "09/24/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114297,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "LOUD TICKING NOISE, INTERNITENT AT IDLE SPEED.  SOUNDS LIKE VALVE STICKING.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/18/2005",
        "dateOfIncident": "09/11/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10114293,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT BRAKES SQUEAK AND LOCK UP WHEN COLD, (MORNINGS) DEALER SAY IT'S NORMAL.  MY FRIEND HAS AN OUTLANDER AND HE DOES NOT HAVE THE SAME PROBLEM.  I HAVE TAKEN IT IT 4 TO 5 TIMES.  THE BRAKES LOCKING UP NEARLY CAUSED A COLLISION FROM THE CAR BEHIND ME.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "03/01/2005",
        "dateOfIncident": "08/19/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10113228,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PULLED TO THE RIGHT ALL THE TIME.  CONSUMER  HAD THE VEHICLE SERVICED FOR ALIGNMENT, AND THE ARMS WERE REPLACED.  HOWEVER,  THIS HAD NOT SOLVED THE PROBLEM.    MANUFACTURER REFUSED TO ADMIT THERE WAS A PROBLEM WITH THESE VEHICLES.*AK",
        "vin": "JA4LZ41G33U"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "02/03/2005",
        "dateOfIncident": "02/03/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10108485,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HAVE HAD A CONSTANT SQUEAL AND PULLING AND DRIFTING IN OUTLANDER FOR THE LAST 4 MONTHS. HAVE HAD IT CHECKED OUT 3 TIMES BEFORE. TODAY IT WAS LOUDER AND CAR DID NOT FEEL RIGHT. GOT OFF THE HIGHWAY AND CAR POWER WAS LOST. MANUERVERED CAR TO RIGHT HAND SIDE. TURNED EVERYTHING OFF. TURNED CAR BACK ON AND IT WAS \"FINE\". CALLED ROADSIDE ASSISTANCE AND WAS DISCONNECTED THREE TIMES. CALLED 411 WENT STRAIGHT TO CLOSEST DEALER WHO WENT FOR RIDE A LONG AND SAID IT WAS FINE. DROVE TOWARDS HOME AND CAR WAS NOT DRIVING RIGHT STILL DRIFTING MORE, SQUEAL WAS BACK, STRANGE ACCELERATION NOISES, SPEEDOMETER SEEMED OFF, TACHING WAS HIGH. WENT TO DEALER CLOSEST TO HOME. THEY ARE LOOKING AT IT NOW. *JB",
        "vin": ""
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/01/2004",
        "dateOfIncident": "07/30/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101965,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Yokohama Tire Corporation",
                "productMake": "YOKOHAMA",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "VEHICLE HAS HAD TWO TIRE BLOW OUTS ON  PASSENGER'S REAR, AND DRIVER'S FRONT TIRES.   CONSUMER REPLACED THE TIRES AT CONSUMER'S  EXPENSE.  NO RECALLS FOUND.*AK",
        "vin": "JA4LX41G53U"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2004",
        "dateOfIncident": "07/02/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100086,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A ROTTEN EGG SMELL, ALL THE TIME. I'VE TAKEN IT IN TO THE DEALER 3 PLUS TIMES, AND EACH TIME THEY TELL ME THERE IS NOTHING WRONG, AND THAT I AM USING CHEAP GAS.  THEY SUGGUESTED CHANGING GAS STATIONS.  IT STILL SMELLS NO MATTER WHERE I GET THE GAS.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/15/2004",
        "dateOfIncident": "08/06/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098895,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "DIAMOND CARE",
                "productModel": "DIAMOND CARE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "BRAKES VIBRATE WHEN APPLIED. I HAVE RETURNED MY '03 DIAMONTE FOUR TIMES FOR REPAIRS AND EACH TIME THEY STATE THAT THE ROTORS WERE  WARPED AND EITHER REPLACED OR MACHINED THEM. BRAKES ARE NOW VIBRATING AGAIN AND WILL NEED TO BE RETURNED FOR REPAIR OR REPLACEMENT. WIND NOISE COMING FORM THE DRIVERS SIDE WINDOW. WINDOW ADJUSTMENTS WERE MADE THREE TIMES STILL HAVING NOISE PROBLEMS. RETURNED THREE TIMES TO HAVE LUMBAR SUPPORT SWITCH REPLACED. *AK",
        "vin": "6MMAP87P13T"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/13/2004",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098795,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "EAGLE LS KEEPS LOSING TIRE PRESSURE (ABOUT 10PSI) EVERY 5-7 DAYS.  HAVE WENT TO THE MITSUBISHI DEALERSHIP 4 TIMES NOW FOR THE PROBLEM AND THEY SAID TO GO SEE A GOODYEAR SERVICE CENTER.  GOODYEAR SAYS THE TIRE JUST NEEDS AIR AND IT'S OK.  THIS CANNOT BE SAFE IF THE TIRE IS CONTINUALLY LOSING AIR PRESSURE IN SUCH A SHORT TIME FRAME. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/11/2004",
        "dateOfIncident": "11/08/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10098657,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DIDN'T DEPLOY IN MY 2003 GALANT ES.  I HIT A STOPPED VEHICLE, WHILE MOVING APPROXIMATELY 25 MPH, HEAD-ON INTO THE PASSENGER SIDE OF THE OTHER CAR. *JB",
        "vin": "4A3AA46G33E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/07/2004",
        "dateOfIncident": "10/23/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098395,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ENGINE HAS STARTED ON ITS OWN W/OUT THE KEY IN THE IGNITION. YOU CANNOT TURN THE ENGINE OFF W/ THE KEY, AFTER SOME TIME IT WILL TURN ITSELF OFF. THIS PROBLEM HAS OCCURRED TWICE. THE FIRST TIME THE DEALERSHIP REPLACED THE IGNITION. THE SECOND TIME THE DEALERSHIP STATED IT IS IMPOSSIBLE, AND DID NOT FIND A PROBLEM.  *JB",
        "vin": "JA4LZ31G23U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "10/31/2004",
        "dateOfIncident": "03/21/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098059,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "1. EVER SINCE I PURCHASED THE VEHICLE, IT HAS ALWAYS PULLED TO THE RIGHT. I TOOK THE VEHICLE INTO THE SHOP AND A ALIGNMENT WAS DONE. THE PROBLEM STILL PERSIST. THE RIGHT SIDE TIRE IS STARTING TO WORN EVEN WITH THE NEW ALIGNMENT AND BALANCE AND ROTATION. 8JB",
        "vin": "JA4LZ41GX3U"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/31/2004",
        "dateOfIncident": "09/20/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098060,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "6 MONTHS AFTER VEHICLE PURCHASED. THE TWO FANS (RADIATOR AND COOLING) FAN STARTED TO COME ON AT THE SAME TIME. THE COOLING FAN ONLY NEEDS TO COME ON WHEN VEHICLE'S ENGINE IS HOT. BUT THE FAN COMES ON WHEN A TURN ON THE CAR FOR THE FIRST TIME. I DRIVE IT AND THE FANS KEEP ON RUNNING. IT SOUNDS LIKE I'M FLYING A PLAN AND NOT DRIVING A CAR. I TOOK IT TO THE DEALERSHIP AND THEY SAID THAT IF I HAVE THE DEFROSTER AND ON, THEN THE FANS WOULD COME ON. BUT THE FANS COME ON EITHER WAY. NO PROBLEMS FOUND BY DEALERSHIP AND SAID IT'S NORMAL. WELL, I DON'T THINK SO.  *JB",
        "vin": "JA4LZ41GX3U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "10/18/2004",
        "dateOfIncident": "10/10/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10095972,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE IN FOR SECOND REPAIR OF STEERING RACK.  FIRST TIME THE RACK WAS REPLACED.  REQUESTED REPLACEMENT AGAIN.  VERY RARE FAILURE, YET TWICE WITHIN 30 K MILES? THERE IS A VARIABLE PULSING AND UNEQUAL PRESSURE WITHIN THE STEERING RACK HYDRAULICS.  FIRST INSTANCE 16000, SECOND 31K MILES.  ADDITIONALLY FAILED TIE ROD IN THIS SECOND INSTANCE.  BEING REPAIRED AT UNIVERSITY MIT. IN BLOOMINGTON, INDIANA, AS IN THE FIRST INSTANCE.  CALLED MIT. CUST SVC AND REQUESTED NEW RACK AND REPAIR OF TIE ROD AS WELL AS ALIGNMENT.  THEY STATE THIS TO BE AN ISOLATED, TWICE STRUCK, DEFECT ISSUE AND NOT A CROSS PLATFORM/VEHICLE MODEL PROBLEM.  *AK",
        "vin": "JA4LX41G83U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "06/30/2004",
        "dateOfIncident": "01/23/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079070,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE THE PURCHASE OF OUR 2003 OUTLANDER, IT HAS VEERED BADLY TO THE RIGHT.  I NOTIFIED THE DEALER OF THE PROBLEM FROM THE DATE OF PURCHASE.  I HAVE HAD IT IN THE DEALERSHIP TO CORRECT THE PROBLEM 3 TIMES AND THE PROBLEM STILL EXISTS.  IF YOU ARE TRAVELING AT A LOW SPEED IT IS NOT AS OBVIOUS, BUT WHEN TRAVELING AT HIGHER SPEEDS (60-70MPH) IF YOU DO NOT APPLY PRESSURE TO THE STEERING WHEEL, YOU WILL   VEER RIGHT AND IN 5 TO 7 SECONDS BE IN A DITCH, OR IF PASSING ANOTHER VEHICLE, YOU WOULD CRASH INTO THEM.  I CONSIDER THIS A VERY DANGEROUS PROBLEM, THAT COULD RESULT IN SERIOUS INJURY OR EVEN DEATH.  I HAVE CONTACTED THE MANUFACTURER SEVERAL TIMES AND THEY HAVE CONTACTED THE DEALERSHIP. I JUST HAD THE OUTLANDER IN THE DEALERSHIP YESTERDAY FOR THE 3RD TIME, AND NEEDLESS TO SAY, THE PROBLEM IS STILL UNRESOLVED.  ALIGNMENT HAS NOT SOLVED THE PROBLEM AND I AM TAKING IT BACK FOR THE 4TH TIME AND EXPECTING THE SAME END RESULTS.*AK",
        "vin": "JA4LX41G53U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/20/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073984,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN DRIVING VEHICLE PULLED TO THE RIGHT. CONSUMER TOOK VEHICLE TO DEALER  FOR A WHEEL ALIGNMENT ON THREE OCCASSIONS,  BUT PROBLEM RECURRED. *AK",
        "vin": "JA4LZ41G93U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/18/2004",
        "dateOfIncident": "05/18/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10073852,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE MAKING A RIGHT TURN THE STEERING WHEEL WANDERED OFF ON ITS OWN.  THE DRIVER WAS ABLE TO MAINTAIN CONTROL OF THE VEHICLE AND DROVE IT TO THE DEALER. THE MECHANIC COULD NOT DUPLICATE THE PROBLEM.  THE DRIVER INFORMED THE MECHANIC THE PROBLEM HAD OCCURRED MORE THAN ONCE AND THE PROBLEM HAS NOT BEEN RESOLVED.  *JB",
        "vin": "JA4LZ41G93U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/09/2004",
        "dateOfIncident": "04/07/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10066899,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER'S VEHICLE  STOPPED AT A TRAFFIC LIGHT AND WAS REAR ENDED BY  ANOTHER VEHICLE, CAUSING   CONSUMER'S VEHICLE TO REAR END ANOTHER VEHICLE. UPON IMPACT, BOTH FRONT AIR BAGS DID DEPLOY.  CONSUMERS HEAD HIT THE STEERING WHEEL. CONSUMER HAD THE VEHICLE TOWED TO THE DEALERSHIP. *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/29/2004",
        "dateOfIncident": "03/18/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10064077,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PULLS TO THE RIGHT FROM THE DAY I RECEIVED IT, RETURNED FOR SERVICE SEVERAL TIMES, STILL PULLS TO THE RIGHT.  FRONT TIRES ARE WORN AFTER 29,000 MILES.  LAST VISIT TIRES WERE ROTATED AND NOW THE VEHICLE PULLS VERY HARD TO THE LEFT.  NOW I AM BRINGING IT BACK TO ROTATE THE TIRES BACK SO NOW IT WILL CONTINUE TO PULL TO THE RIGHT AGAIN I'M SURE.  I DON'T FEEL SAFE DRIVING THIS VEHICLE.*AK",
        "vin": "JA4LX31G53U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/24/2004",
        "dateOfIncident": "01/20/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058876,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIFTS TO RIGHT-BEEN BACK 4 TIMES FOR THIS- NOW LAST TIME THEY SAY NOTHING IS WRONG AND IT NO LONGER DRIFTS-AS I DROVE OUT OF DEALER I LET GO OF WHEEL AND OFF IT GOES TO THE RIGHT...AGAIN..*AK",
        "vin": "JA4LZ41G03U"
    },
    {
        "components": "SUSPENSION,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "02/24/2004",
        "dateOfIncident": "01/15/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058913,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR BUSHING HAD TO BE REPLACED WITH ONLY 6000 MILES.. WHY? DEALER COULDNT EXPLAIN.  ALSO, TWICE CAR HAS ACCELERATED WHEN COASTING ON FLAT ROAD.  *AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,AIR BAGS,SEAT BELTS,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "01/21/2004",
        "dateOfIncident": "01/21/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10055561,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CANNOT UNLOCK THE FRONT AND REAR DOORS FROM THE INSIDE OR OUTSIDE OF THE VEHICLE.   WATER WENT UNDER FLOOR AND CORRODED THE ELECTRICAL SYSTEM.  THIS PROBLEM  WAS SIMILAR TO NHTSA RECALL 03V194000: ON CERTAIN SPORT UTILITY VEHICLES, WATER COULD ENTER THE FRONT FLOORBOARD AREA FROM OPENINGS IN THE SIDE SILL OR UPPER DASH AREA.  THIS WATER COULD COLLECT UNDER THE SEAT AND CAUSE ELECTRICAL CORROSION TO OCCUR IN THE HARNESS CONNECTORS THAT CONTAIN THE WIRING FOR THE SEAT BELT RETACTOR, SIDE AIR BAG IMPACT SENSOR, AND STOP LAMPS.  *AK",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": true,
        "dateComplaintFiled": "11/05/2003",
        "dateOfIncident": "09/09/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10045507,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CAR WAS PARKED WITH KEY OUT OF THE IGNITION.  CAR ROLLED BACKWARDS AND STRUCK TREE.",
        "vin": "JA4LX41G33U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/07/2003",
        "dateOfIncident": "10/07/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042431,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING  AUTOMATIC  TRANSMISSION STICK SHIFT INDICATOR BROKE, MAKING HARD TO SHIFT THE GEAR. DEALER STATED THEY DIDN'T HAVE THE PART, AND DIDN'T KNOW WHEN THEY WILL HAVE IT.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/17/2003",
        "dateOfIncident": "07/20/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10039043,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OUTLAND CONTINUES TO PULL VERY HARD TO THE RIGHT.  IT HAS BEEN SERVICED THREE TIMES AND PROBLEM STILL OCCURS.  DEALERSHIP SAYS THERE IS NO PROBLEM AND THE PULLING IS NORMAL.  *JB",
        "vin": "JA4LX31G43U"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/10/2003",
        "dateOfIncident": "09/10/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038572,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED A RECALL NOTICE#03-V-194-000  FROM THE MANUFACTURER ON AUGUST 3, 2003 HOWEVER NO PARTS WERE AVAILABLE.  *JB",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/08/2003",
        "dateOfIncident": "01/13/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038422,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE VEERED TO THE RIGHT WHEN DRIVING.  THE VEHICLE WAS TAKEN TO THE DEALER FOR REPAIRS BUT THE VEHICLE CONTINUED TO VEER TO THE RIGHT.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING,SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/06/2003",
        "dateOfIncident": "08/12/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10037336,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING/SUSPENSION OUTLANDER XLS CAR PULLS AND DRIFTS TO THE RIGHT, CAR HAS BEEN TO AUTO SERVICE 3 TIMES AND PROBLEM STILL EXIST.  *AK",
        "vin": "JA4LZ41G03U"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "09/05/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10038310,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING VEHICLE PULLED TO THE RIGHT.   DEALER DID AN ALIGNMENT, AND CHECKED THE STEERING WHEEL.   DEALER INDICATED THAT THIS WAS A NORMAL PROBLEM AND THERE WAS NO SOLUTION.  *AK",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/24/2003",
        "dateOfIncident": "07/24/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029084,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPAIR, THE AUTOMOBILE (MITSUBISHI OUTLANDER 2003 XLS) CONTINUES TO VEER AND DRIFT.*AK",
        "vin": ""
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2003",
        "dateOfIncident": "07/20/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10028783,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM DRIVING A RENTED MITSUBISHI PROTOGE'. YESTERDAY I REACHED DOWN TO PICK UP A BOTTLE OF WATER FROM THE RECEPTACLE BY THE DASH. AS I REACHED, I ACCIDENTLY BRUSHED THE GEAR SHIFT LEVER ( AUTOMATIC TRANSMISSION ) AND THE GEAR SHIFT POPPED INTO NEUTRAL.  I PULLED OUT OF TRAFFIC AND TRIED THIS AGAIN. SAME RESULT. JUST BUMPING THE GEAR SHIFT SENT IT INTO NEUTRAL.  I FEEL THAT THIS REPRESENTS THE POSSIBILITY OF A SERIOUS SAFETY HAZARD. IF IT WERE TO OCCUR IN HEAVY TRAFFIC OR IN ADVERSE WEATHER CONDITIONS, ACCIDENTS COULD OCCUR.  *AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "07/09/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026919,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER CALLED COMPLAINING  ABOUT ENGINE PROBLEMS.   STATED THAT VEHICLE WILL NOT HAVE ENOUGH POWER. MANUFACTURER WAS CONTACTED, AND HAD FIXED IT A COUPLE OF TIMES.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,VISIBILITY,VEHICLE SPEED CONTROL,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "04/21/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015967,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER MADE A LEFT TURN AND THE ENGINE HAD RUN AWAY.  THE VEHICLE WAS TAKEN TO FOUR DEALERSHIPS AND WAS TOLD THEY ARE UNABLE TO DUPLICATE.  THE WIPERS DID NOT CLEAR THE WINDOWS OR OPERATE ON HIGH SPEED, THE KEYLESS REMOTE SYSTEM DID NOT OPERATE WITH THE KEY IN THE IGNITION, THERE WAS A BURNING SMELL COMING FROM THE ENGINE, AND THE FUEL CAP DID NOT LOCK.  RECALL#03V0S8000-THE PCM WAS REPROGRAMMED.  MR  SCC *JB",
        "vin": "JA4LZ31G634"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/15/2003",
        "dateOfIncident": "04/15/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10015944,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE SUDDENLY VEERED TO THE RIGHT WHICH WAS FOLLOWED BY A LOUD NOISE.  THE DEALER HAS BEEN NOTIFIED.  *NLM",
        "vin": "JA4LX31G83U"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/27/2003",
        "dateOfIncident": "03/23/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10013549,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE PULLS TO THE RIGHT.  THE DEALER SAYS NUMEROUS COMPLAINTS OF THIS VEHICLE DOING SAME AND THE REPAIRS THE FACTORY SUGGESTED TO THE DEALER ARE NOT WORKING.   *NLM",
        "vin": "JA4LZ41G03U"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/10/2003",
        "dateOfIncident": "03/09/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011195,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE FAILED TO ACCELERATE, THE CAUSE WAS UNKNOWN.*JB",
        "vin": "JA4LX31G13U"
    },
    {
        "components": "LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "02/04/2003",
        "dateOfIncident": "02/01/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10006440,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "OUTLANDER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE DOOR WILL NOT UNLOCK. PLEASE FILL IN ADDITIONAL. DEALER IS AWARE OF THE PROBLEM.    PH",
        "vin": "PLEASE FILL"
    }
]