[
    {
        "components": "ELECTRICAL SYSTEM,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/27/2022",
        "dateOfIncident": "03/26/2022",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11458494,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "Check engine light suddenly came on and the vehicle lost all engine power and driving capabilities while driving at a low speed, turning a corner. There had been no other issues or indication of a failure of any kind. The car was pulled over on the roadside out of traffic and was able to be restarted with no problem. It was taken to a nearby auto parts store where they performed a free diagnostic check. The result that came back was generally regarding a vacuum issue in fuel system or lines. The gas cap lid and door were checked for proper closure and it was established they had been closed and sealed properly at the time the engine power failure occurred.",
        "vin": "4A3AA46GX3E"
    },
    {
        "components": "POWER TRAIN,ELECTRICAL SYSTEM,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/26/2021",
        "dateOfIncident": "06/16/2020",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11390079,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT CAME ON AND THE CAR QUIT ON ME WHEN I WAS DRIVING IT",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/27/2015",
        "dateOfIncident": "09/22/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10777954,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FREQUENT CLOGGING OF A/C DRAIN AND DRAINAGE INTO DRIVER SIDE FOOT HOLD. THE SERVICE DEPARTMENT IS UNABLE TO CLEAN DRAIN TUBE AT THIS POINT. THE CAR IS NOT PARKED UNDER OR NEAR TREES.",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "ELECTRICAL SYSTEM,AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "04/24/2015",
        "dateOfIncident": "04/20/2015",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10712563,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HORN WHICH IS PART OF THE AIRBAG STAYED ON WHEN I USED MY KEYLESS ENTRY REMOTE TO LOCK THE CAR. I HAD TO HIT THE HORN BUTTON IN THE STEERING WHEEL TO MAKE IT STOP. THE HORN ONCE AGAIN BECAME STUCK THE NEXT DAY WHEN I HONKED MY HORN ON THE FREEWAY TO PREVENT A CAR FROM COLLIDING WITH ME AS THEY TRIED TO SWITCH LANES. I COULD NOT GET THE HORN TO SHUT OFF THIS TIME AND HAD TO PULL OVER TO PULL OUT THE FUSE. I PLUGGED IN THE FUSE WHEN I ARRIVED HOME AND THE HORN CAME RIGHT BACK ON. I THEN USED A RUBBER MALLET TO TAP AROUND THE HORN BUTTON AND STEERING WHEEL WHICH FINALLY STOPPED THE HORN. THIS IS A HUGE SAFETY CONCERN AS MY HORN WILL NOW NOT SOUND AT ALL.  *TR",
        "vin": "4A3AA46G33E"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/04/2014",
        "dateOfIncident": "08/02/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10618612,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI GALANT. THE CONTACT STATED THAT WHILE TRAVELING AT APPROXIMATELY 40 MPH, THE DEFROSTER FAILED TO ACTIVATE. THE CONTACT ATTEMPTED TO USE THE TEMPERATURE CONTROLS AND SUDDENLY THERE WAS AN ABNORMAL NOISE. THE FAILURE OCCURRED WHEN THE DEFROSTER, A/C, OR HEATER WAS ACTIVATED. AS A RESULT, THE CONTACT'S VISIBILITY WAS IMPAIRED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 87,000.",
        "vin": "4A3AA46G63E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/02/2014",
        "dateOfIncident": "04/11/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10586268,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR BAGS DIDN'T COME OUT WHEN ACCIDENT OCCURRED, THERE IS SMOKE COMING FROM EXHAUST NOT SOMETHING IS EATING THE GAS UP THERE IS LEAKAGE COMING FROM ENGINE, OIL, AND RADIATOR (UNKNOWN AREAS).  *TR",
        "vin": "4A3AA46H33E"
    },
    {
        "components": "SUSPENSION,TIRES",
        "crash": false,
        "dateComplaintFiled": "04/18/2014",
        "dateOfIncident": "04/11/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10583474,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "APRIL 11, 2014 I WAS TRAVELING UP 85 NORTH TO ATLANTA BETWEEN 9:30 PM & 10:00PM. JUST OUTSIDE OF MACON COUNTY ON MILE MARKER 45 THERE WAS A CAR SPEEDING IN THE WORK ZONE WHERE SIGNS WERE UP SAYING UNLEVELED ROAD. I EXCHANGED LANES TO THE RIGHT SIDE WHICH WAS THE PAVED SIDE AND CAME NEAR THE BRIDGE AND HIT A HARD BUMP WHICH MADE MY CAR HOP UP AND SLAM DOWN HARD. I HAD TO PULL OVER AND STOP BECAUSE MY TIRES WERE SMOKING. MY STRUT BOTTOMED OUT AND WAS SITTING ON MY TIRE MAKING IT NOT DRIVABLE BECAUSE THE TIRES WERE RUBBING AGAINST THE STRUT. TWO OTHER CARS HIT THE SAME BUMP INCLUDING THE STATE TROOPER THAT CAME TO ASSIST ME. I CALLED MY INSURANCE BUT THE COULDN'T PINPOINT WHERE I WAS. SO I ENDED UP CALLING THE STATE TROOPER AND HAD TO PAY OUT OF THE POCKET FOR TOWING BACK TO MONTGOMERY. THERE WERE NO SIGNS OR CONES IN THE ROAD TO NOTIFY THAT THERE WAS A ROUGH BUMP IN THE ROAD. I NEED HELP WITH THIS CAUSE I SPENT MONEY ON THIS DAMAGE AND FEEL USELESS BECAUSE OF A BUMP THAT DISABLE MY ONLY CAR FOR WORK.  *TR",
        "vin": "4A3AA46H33E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/21/2014",
        "dateOfIncident": "01/20/2014",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560747,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI GALANT. THE CONTACT STATED THAT WHILE DRIVING APPROXIMATELY 40 MPH, THE HEAT CONTROL MODULE WAS ACTIVATED BUT COLD AIR BEGAN TO CIRCULATE OUT OF THE VENTS.  THE VEHICLE WAS TAKEN TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS AWAITING A DIAGNOSIS OF THE FAILURE. THE MANUFACTURER WAS NOT NOTIFIED OF THE DEFECT. THE APPROXIMATE FAILURE MILEAGE WAS 150,000.",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "12/28/2013",
        "dateOfIncident": "11/04/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10557571,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER REPLACING FRONT/REAR BRAKE PADS, CALIPERS, AND ROTORS PLUS APPLYING THE PROPER LUBRICANT BRAKES NOT ONLY STILL SQUEAL BUT I AM HAVING OCCASIONAL GRINDING MAINLY COMING FROM THE FRONT DISC. HAVE HAD THEM INSPECTED BY MULTIPLE MECHANICS. THEY SAID EVERYTHING LOOKED FINE. DIAGNOSIS HAS YET TO BE DETERMINED NOT ONLY BY MECHANICS BUT APPARENTLY BY MITSUBISHI. THIS IS MY ONLY TRANSPORTATION AFTER JUST HAVING TO LEASE THIS VEHICLE TO FIND OUT THIS IS A VERY COMMON ISSUE THAT HAS NOT HAD ATTENTION FROM MITSUBISHI. I HAVE ALWAYS OWNED AMERICAN MADE VEHICLES BECAUSE OF TOO MANY FEARS FROM FOREIGN MANUFACTURES. I CHOSE THIS VEHICLE BECAUSE MITSUBISHI HAS GREAT DESIGNS. AS FOR PRODUCING A RECALL FOR THIS VERY KNOWN PROBLEM. IT SEEMS LIKE PRODUCING THIS RECALL WOULD ONLY PUT MITSUBISHI FURTHER IN DEBT. IF HONOR IS WHAT YOUR CULTURE LIVE BY, THEN HONOR THIS MISTAKE BEFORE MANY LIVES ARE LOST.    *TR",
        "vin": "4A3AA46G93E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/23/2013",
        "dateOfIncident": "08/21/2013",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10536949,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I STARTED MY CAR IN THE AFTERNOON, THEN I TURNED ON MY RADIO 3 MINUTES LATER. THEN, I SMELLED LIKE SOMETHING BURNT, THAT'S WHEN I SAW SMOKE CAME OUT OF THE FRONT RIGHT PASSENGER SEAT DOOR.  I STOPPED IN A RANDOM TIRE SHOP TO SEE WHAT WAS GOING ON. A FEW MINUTES LATER, I SAW FIRE COMING OUT OF THE LOUDSPEAKER ON THE FRONT RIGHT DOOR. A GUY FROM THE TIRE SHOP HELPED ME TO EXTINGUISH THE FIRE. AFTER I MADE SURE THAT IT WAS SAFE ENOUGH FOR ME TO DRIVE, I DROVE MY CAR TO MY REGULAR AUTO SHOP TO GET IT CHECKED. THE INSIDE OF THE DOOR WAS MELTED (HALFWAY MELTED, BECAUSE THE FIRE WAS HANDLED EARLY) AND BLEW THE FUSE.  *TR",
        "vin": "3A3AA46G63E"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "08/12/2013",
        "dateOfIncident": "08/09/2013",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10534802,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING  AT 33 MPH ON A MAIN STREET WHEN CAR ON MY RIGHT GOES THROUGH STOP SIGN AND DRIVES INTO MY CAR.  HE HIT THE FRONT OF MY CAR NEAR, BUT NOT INCLUDING,  THE PASSENGER DOOR.  AFTER IMPACT (HE NEVER BRAKE) HE CONTINUED TO MOVE MY CAR WITH HIS THEREBY FOLDING THE FRONT OF MY CAR IN HALF, TAKING OFF FRONT WHEELS, FENDERS AND BUMPER, GAS TANK (SMOKING BUT NOT ON FIRE), AND MOVING MY CAR TWO LANES TO THE LEFT VIA IMPACT AND PUSH.  NO AIR  BAGS DEPLOYED.  DRIVER'S DOOR, MINE, WOULD NOT OPEN. SEAT BELT PULLED IN VERY TIGHT.  IMPACT SLAMMED MY CHEST, KNEE AND ANKLE.  FRACTURED STERNUM, CUTS AND BRUISES ON LEG AND FOOT.  BACK PAIN AT SITE OF CRASH.  COULD NOT WALK UP AMBULANCE STEPS.  HOSPITAL STAY 2 DAYS WITH MULTIPLE TESTS.  DRS. VISITS REQUIRED THIS WEEK, ONE DAY AFTER RELEASE.  CAR TOTALED.  PHYSICAL THERAPY AND PAIN MANAGEMENT PUT INTO PLACE UPON HOSPITAL DISCHARGE.  *TR",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "VISIBILITY/WIPER",
        "crash": false,
        "dateComplaintFiled": "07/08/2013",
        "dateOfIncident": "11/13/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10523697,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 MITSUBISHI GALANT. THE CONTACT STATED THAT THERE WAS A CLICKING NOISE COMING FROM THE VENTS AFTER SWITCHING THE TEMPERATURE GAUGE FROM COLD TO HOT. THE CONTACT ALSO MENTIONED THAT THE HOT AIR FAILED TO ENGAGE. THE VEHICLE WAS NOT TAKEN TO A DEALER FOR A DIAGNOSTIC. THE MANUFACTURER WAS NOTIFIED OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE APPROXIMATE FAILURE MILEAGE WAS 128,000 AND THE CURRENT MILEAGE WAS 135,000. *TR",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "SUSPENSION,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "08/06/2012",
        "dateOfIncident": "08/05/2012",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10469289,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE DRIVER AND PASSENGER LEFT /RIGHT FRONT SIDE TIRES ARE DISFUNCTIONAL WHEN I TURN THE STEERING WHEEL THE LEFT AND RIGHT SIDE I HERE THE BEARINGS POPPING AND THE TIRES ALSO DIS FUNCTIONAL AND THE THIS CAR IS BURNING A LOT OF OIL THE DEALER SHIP WHERE I'M BUYING IT FROM SAID EVERYTHING WAS WORKING FINE THE CAR WAS WELL TAKING CARE OF THE BELT ON THE CAR IS CRACKED IT HASN'T HAD A TUNE UP AT ALL THE AIR CONDITIONER ISN'T BLOWING OUT COLD AIR.  *TR",
        "vin": "4A3AA46H33E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/22/2012",
        "dateOfIncident": "05/07/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10462746,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ABOUT A YEAR AFTER PURCHASING THIS VEHICLE IN 2007, THE PAINT BEGAN TO WEAR OFF. IT STARTED CHALKING AND CHIPPING AND I'VE NOTICED PRETTY MUCH EVERY MITSUBISHI I SEE ON THE ROAD HAS THE SAME ISSUE. THIS IS RIDICULOUS THAT THEY ARE ALLOWED TO PUT OUT SUCH CARS AND BE NEGLEGENT ON THE PAINT JOB. WE ALL PAY GOOD MONEY FOR THESE AND MITSUBISHI ONLY RECALLED THE \"BLACK PAINT\" THEY NEED TO RECALL THEM ALL BECAUSE ALL OF THEM ARE IN HORRIBLE SHAPE. MITSUBISHI NEEDS TO BE HELD ACCOUNTABLE.!!!!!!! I SHOULDNT HAVE TO PAY THOUSANDS OF DOLLARS TO GET MY CAR PAINTED...IT SHOULDNT EVEN NEED PAINTED YET. I'LL NEVER PURCHASE ANOTHER.  *TT",
        "vin": "4A3AA36G43E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/08/2011",
        "dateOfIncident": "10/01/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10434913,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TURNED HEAT ON AND HEARD A RATTELING NOISE UNDER DASH, WHEN HEAT CAME ON NOISE STOPPED. TURNED HEAT ON A WEEK LATER, NOTHING, ONLY COLD AIR. INDEPENDENT MECHANIC SAYS HEATER CORE, AFTER REPLACING THERMOSTAT AND COOLANT SENSOR. DEALERSHIP  SAYS HEATER CONTROL VALVE, EITHER WAY, WITH SEEING HOW MANY PEOPLE ARE COMPLAINING ABOUT THE SAME THING, THERE IS CLEARLY A PROBLEM AT THE MANUFACTURING LEVEL. MAYBE MITSUBISHI SHOULD LOOK AT DOING SOMETHING LIKE ACCEPTING FULL RESPONSIBILITY AND REPAIRING THESE CARS. WITH THE ECONOMY WHAT IT IS THERE ARE FEW PEOPLE WHO ARE ABLE TO AFFORD THIS EXPENSE, MYSELF INCLUDED. SOMEBODY PLEASE HELP US! WHY SHOULD THE CONSUMER ALWAYS GET THE SHORT END OF THE STICK?  *TR",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/15/2011",
        "dateOfIncident": "02/16/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10425665,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY 2003, MITSUBSHI, GALANT 1 1/2 YEARS AGO AND I'M HAVING PROBLEMS WITH THE PAINT FADING ON THE DOORS AND THE HOOD OF THE CAR. AFTER 1 YEAR OF HAVING THE CAR IT STARTED TO FADE. MY CAR IS A BLACK MITSUBSHI AND WITH THIS BEING A BLACK CAR THE FADING REALLY STANDS OUT.   *KB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/08/2011",
        "dateOfIncident": "02/04/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424373,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN THE LATE WINTER OF 2011 MY CAR HEATER BEGAN TO MAKE STRANGE NOISES THEN WOULD WORK FINE. SOON AFTER THAT HAPPENED, THE HEAT STOPPED WORKING. ONLY COLD AIR WOULD PUSH THROUGH THE SYSTEM. I UNDERSTAND THAT THE AC IS NOT CONSIDERED A NECESSITY, BUT I BEG TO DIFFER ON HEAT, CONSIDERING OUR TECHNOLOGICAL STATE.  A HEATER KEEPS WINDOWS DEFROSTED AND CLEAR OF HUMIDITY THAT WOULD OTHERWISE CLOUD VISION OR WORSE, COMPLETELY HINDER TOTAL VISIBILITY. THE IDEA   OF HAVING HEAT IN A CAR SEEMS LIKE A LUXURY BUT, IN   REALITY IT IS REALLY A BASIC DRIVING NEED.    THERE IS ABSOLUTELY NO EXCUSE AS TO WHY A   CONSUMER SHOULD PAY $20,000,  BRAND NEW, FOR A CAR THAT'S HEATER IS ALL TOO OFTEN   BROKE BEFORE 60,000 MILES. THE COST OF REPAIR CAN EASILY COST $1000, DUE TO THE LABOR. THERE HAVE BEEN ACCOUNTS OF THEM BREAKING AGAIN, ONE YEAR LATER.  THE HEATER SYSTEM NEEDS TO BE RESEARCHED AND   ADDRESSED IN THE 03' GALANTS. IT KEEPS THE WINDOWS CLEAR SO CONSUMERS CAN SAFELY DRIVE THEIR CAR.  *TR",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "01/23/2011",
        "dateOfIncident": "01/20/2011",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10378316,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER CORE IN 2003 GALANT HAS GONE OUT, WHICH MEANS NO HEAT IN VEHICLE. QUOTES FOR REPAIR ARE BETWEEN 900-1300, LABOR BEING 5-6 HOURS. I WAS TOLD THIS SEEMS TO BE A COMMON DEFECT IN THE GALANT.  THERE WAS AN IDENTICAL VEHICLE AT THE REPAIR SHOP WITH EXACT SAME PROBLEM. FURTHER SEARCHING ON THE INTERNET REVEALS THAT THIS IS A COMMON PROBLEM & SHOULD BE CONSIDERED A DEFECT THAT MITSUBISHI MOTORS SHOULD CONSIDER INVESTIGATING. *LN",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/08/2010",
        "dateOfIncident": "11/01/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10369597,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT STOPPED WORKING DUE TO A FAULTY HEAT CONTROL VALVE.  FIRST IT STARTED MAKING A CLICKING NOISE AND NOW I HAVE NO HEAT AT ALL. *TR",
        "vin": "4A3AA46H43E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/07/2010",
        "dateOfIncident": "11/20/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10370133,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS WITH MY SON LEAVING A STORE, WHILE IT WAS 38 DEGREES OUTSIDE. AFTER WE GOT IN THE CAR AND I TURNED ON THE HEATER, IT BEGAN MAKING A FLUTTERING SOUND UNDER THE DASH AS IF THE VENTS WERE OPENING UP. WITH THE KNOB ALL THE WAY TO THE RED POSITION AND THE OTHER KNOB IN THE WINDOW DEFROST POSITION, I WAITED FOR THE WINDOWS TO DEFROST AND THE HEAT TO MAKE THE CAR WARM. THE WINDOWS NEVER DEFROSTED AND THE HEAT NEVER CAME ON. I HAD TO DRIVE HOME WITH THE WINDOW DOWN IN THE COLD, AND MY SON FREEZING IN THE BACK SEAT. I HAD IT CHECKED OUT AND THE MECHANIC TOLD ME THIS IS A VERY POPULAR PROBLEM WITH THIS CAR.",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/13/2010",
        "dateOfIncident": "10/13/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10360226,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HEATER CONTROL VALVE BEGAN MAKING CLICKING NOISES ABOUT A MONTH AGO IN MY 2003 MITSUBISHI GALANT V6 LS. THE CAR HAS ONLY 59,000 MILES ON IT. THEN THIS MORNING WITH OUTSIDE TEMPERATE OF 41 DEGREES HERE IN MINNEAPOLIS THE HEAT WOULD NOT TURN ON. THE HEATER CONTROL VALVE IS NOW STUCK IN THE COLD MODE. I HAD TO DRIVE MY 2 YEAR OLD TO DAY CARE IN A COLD CAR.  THE REPLACEMENT COST BY THE DEALER IS $1000. THE INTERNET FINDING SHOWS MOST GALANT OWNERS HAVE HAD FAILED HEATER CONTROL VALVE. THIS CAN PUT DRIVERS IN UNSAFE SITUATIONS BECAUSE WE CAN NOT DEFROST THE WINDSHIELD WHEN ITS COLD OUTSIDE.",
        "vin": "4A3AA46H63E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/21/2010",
        "dateOfIncident": "09/18/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10356713,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 GALANT ES.  V-6 MOTOR.  HAD TO REPLACE HEATER CONTROL VALVE DUE TO NO HEAT.  CLICKING NOISE FROM TIME TO TIME THEN NOTHING AS WELL AS NO HEAT.  NO SOONER DID I REPLACE THAT AND THEN HEAT SELECTOR QUIT WORKING.  CAN NOT CHANGE FROM VENTS TO DEFROST.  MECHANIC SAID HEATER BOX WARPED AND COST ABOUT 2500.00 TO FIX THIS.  NOW PULLING INTO THE DRIVEWAY, THE RADIATOR BURST OPEN ON THE FRONT SIDE.  ABOUT A 4 INCH OPENING JUST TO THE RIGHT SIDE OF CAP IF YOU ARE FACING THE CAR.  MECHANIC HAS SAID ALL OF THIS IS VERY COMMON IN THESE CARS AND MITSUBISHI SHOULD HAVE DONE SOMETHING TO TAKE CARE OF THESE PROBLEMS AS EVERY GALANT MADE HAS HAD SAME ISSUES.. *TR",
        "vin": "4A3AA46H83E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/09/2010",
        "dateOfIncident": "04/06/2010",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10342181,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 BLACK MITUSBISHI GALANT ES. THE PROBLEM WITH IT IS THE PAINT...THE TOP OF MY HOOD IS DISGUSTINGLY WHITE AND FADED, ALSO THE ROOF OF THE CAR, AND THE TOP OF THE TRUNK. THE FADE IS SPREADING AND I DON'T  KNOW WHAT TO DO. MY CAR IS NOT THE ONLY ONE..I SEARCHED FOR THIS PROBLEM ONLINE AND FOUND THAT THERE ARE THOUSANDS OF COMPLAINTS ABOUT MITSUBISHI PAINT. THERE HAS TO BE A RECALL FOR THIS. IT'S EMBARRASSING DRIVING AROUND WITH THE PAINT THAT HIDEOUS. *TR",
        "vin": "4A3AA46G33E"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "02/24/2010",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313815,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HIT A DEER DUE TO NOT BEING ABLE TO STOP BECAUSE MY SEAT UNLOCKED AND SLID BACK ALL THE WAY, THAN I HIT THE DEER AND WRECKED MY WHOLE FRONT END. HAVE DODGED SOME MAJOR CRASHES DUE TO MY SEAT SLIDING. EVER SINCE I GOT MY CAR WHEN IT CAME OUT IN 03' THE DRIVER SEAT SLIPS WHEN IT SHOULD BE LOCKED HAPPENS RANDOMLY (EXTREMELY UNSAFE) MITSUBISHI SHOULD FIX OR REPLACE THE SEAT MECHANISM BEFORE MORE PEOPLE GET INJURED. FEELS LIKE IT DECIDES WHEN TO LOCK AND WHEN TO \"LET GO\" SENDING ME INTO A SLIDE TOWARDS THE BACK OF THE VEHICLE. IT'S PRETTY MUCH A DEATH TRAP. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/14/2009",
        "dateOfIncident": "09/29/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287416,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 GALANT AND MY HEATER HAS FAILED THERE IS AIR BLOWING BUT IT'S NOT HOT. WHEN I TURN THE DIAL FROM COLD TO HOT IT WAS MAKING A RATTLING SOUND WHICH I THOUGHT IT MIGHT BE IN THE VENT AREA, THINKING MAYBE IT WAS JUST NOT TURNING. COME TO FIND OUT IT'S THE HEATER CORE AND IT'S OVER $500 TO REPAIR. I THINK THIS IS RIDICULOUS I HAVE SEEN MANY COMPLAINTS ONLINE DATING BACK TO 2006 AND I BELIEVE THAT MITSUBISHI SHOULD RECALL THIS PROBLEM AND TAKE RESPONSIBILITY. *TR",
        "vin": "4A3AA46G83E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/13/2009",
        "dateOfIncident": "04/16/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10287299,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IM COMPLAINING ABOUT MY BLACK PAINT ON MY GALANT. I BOUGHT IT IN 05 AND BYT THE BEGINNING OF 06 MY PAINT WAS OXIDIZED AND FLAKING. THE ROOF HAS RUSTED THROUGH THE PAINT. IT LOOKS TERRIBLE AND ITS GOING COST OVER 2000 JUST TO GET IT PAINTED WHEN THE PAINT THAT WAS USED TO PAINT IT WAS OF POOR QUALITY?! GALANTS THAT ARE OLDER AND ARE BLACK LOOK BETTER THAN MINES AND EVEN THE GALANTS WITH DENTS AND SCRATCHES LOOK BETTER THAN MINES BECAUSE THEIR PAINT IS STILL GLOSSY. PLEASE FIX THIS THANK YOU *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/05/2009",
        "dateOfIncident": "11/07/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286324,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MITSUBISHI GALANT. WHILE THE CONTACT WAS EXAMINING HIS VEHICLE HE NOTICED THAT THE BLACK PAINT ON THE VEHICLE BEGAN FALLING OFF.  THE VEHICLE HAS NOT BEEN DIAGNOSED BY THE DEALER. THE CURRENT MILEAGE WAS 113000 AND THE FAILURE MILEAGE WAS 95000.",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/04/2009",
        "dateOfIncident": "10/01/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10286264,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FOR A WHILE THE AC AND HEATER FAN HAS BEEN MAKING A \"RUBBING\" SOUND WITHIN THE DASHBOARD IN MY 2003 MITSUBISHI GALANT. A FEW MONTHS LATER, THE HEAT IN THE CAR HAD TOTALLY STOPPED WORKING. AS IT GETS COLDER OUTSIDE, THE WINDSHIELD FOGS AND WITHOUT HEAT, THERE IS NO WAY TO DEFROST IT CAUSING INABILITY TO SEE CLEARLY THROUGH THE WINDSHIELD. THIS PROBLEM CAN OBVIOUSLY LEAD TO CAR ACCIDENTS. THE PART HAS NOT YET BEEN REPLACED BUT IS CURRENTLY BEING LOOKED INTO. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/26/2009",
        "dateOfIncident": "06/06/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10285341,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN OWNER OF A 2003 BLACK MITSUBISHI GALANT,I'M HAVING  PAINT ISSUES WITH MY CAR  THE PAINT HAS BEEN FADING ALL OVER MY CAR,I THINK THIS IS A FACTORY PROBLEM, I SAW ALOT ANOTHER BLACK MITSUBISHI CARS WITH THE SEEM PAINT PROBLEM! *TR",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/17/2009",
        "dateOfIncident": "05/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10284414,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN ISSUE WITH THE PAINT ON MY MITSUBISHI GALANT  IT IS AN BLACK 2003 GALANT DE. THIS IS THE FIRST YEAR I HAVE HAD IT UNCOVERED AND NOW FOR ABOUT SIX MONTHS GRAYISH WHITE MARKS ARE APPEARING ALL OVER THE TRUCK, TOP, AND HOOD OF MY CAR. *TR",
        "vin": "4A3AA36G83E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/14/2009",
        "dateOfIncident": "09/01/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283871,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM WRITING TO COMPLAIN ABOUT THE PAINT ON THE EXTERIOR OF MY 2003 MITSUBISHI GALANT.  IT IS BLACK AND HAS BEGUN TO TURN WHITE AND PEEL.  I HAVE NOTICED THERE ARE COUNTLESS OTHER INSTANCES OF THIS HAPPENING.  I BELIEVE THIS MAY BE A MANUFACTURER DEFECT. *TR",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/12/2009",
        "dateOfIncident": "08/10/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10283748,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BLACK 2003 MITSUBISHI GALANT ES PAINT IS FADING AND CRACKING ON THE ROOF AND TRUNK OF THE CAR.  I'VE NOTICED THROUGH MY TRAVELS THAT THIS SEEMS TO BE A COMMON PROBLEM WITH GALANTS. *TR",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/28/2009",
        "dateOfIncident": "06/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278524,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 BLACK MITSUBISHI GALANT - THE PAINT BEGAN  OXIDIZING ON THE ROOF AND SPREAD TO THE TRUNK LID AND HOOD OF THE CAR. THE DEALER AND MITSUBISHI REFUSE TO HELP DESPITE HAVING SOLD CARS WITH A LATENT DEFECT.  THE CAR IS GREATLY DEVALUED AND THIS IS APPARENTLY A WIDE SPREAD PROBLEM.  PLEASE HELP. *TR",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/27/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10278389,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY BLACK IS FADING ON MY MITSUBISHI GALANT. *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/17/2009",
        "dateOfIncident": "01/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10277175,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BLACK PAINT FADING, PEELING, FALLING OFF.... *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "07/01/2009",
        "dateOfIncident": "06/28/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275502,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 MITZUBISHI GALANT. THE EXTERIOR PAINT STARTED FADING APPROXIMATELY ONE YEAR AFTER I PURCHASED THE VEHICLE AND NOW THE ENTIRE HOOD, ROOF, AND TRUNK AREA HAVE OXIDIZED AND FADED TO THE METAL. THE CAR ONLY HAS 40,000 MILES ON IT! THERE WAS CLEARLY NEGLIGENCE ON THE PART OF THE MANUFACTURER IN COMPLETING THE PAINT PROCESS. I HAVE CHECKED WITH OTHER OWNERS OF THIS YEAR AND MAKE VEHICLE AND HAVE FOUND THAT THEY HAVE THE SAME COMPLAINT. IT WOULD BE NICE IF THE MANUFACTURER WOULD AT LEAST PAY HALF IF NOT ALL THE COST OF REPAINTING THIS VEHICLE. *TR",
        "vin": "4A3AA46H23E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2009",
        "dateOfIncident": "06/07/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274939,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN OWNER OF A 2003 MITSUBISHI GALANT (BLACK). MY PAINT STARTED FADING/OXIDIZING ABOUT A YEAR AGO. I WENT TO THE DEALERSHIP, THEY TOOK PICTURES AND HAD ME SUBMIT MY MAINTENANCE RECORDS AND JUMP THROUGH A BUNCH OF HOOPS JUST TO TELL ME MY VEHICLE WAS OUT OF WARRANTY AND THEY WEREN'T GOING TO DO ANYTHING TO HELP ME! *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/03/2009",
        "dateOfIncident": "06/02/2009",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272735,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE'S ENGINE BURNED DOWN. WE WERE DRIVING DOWN THE ROAD WHEN WE SAW SMOKE COMING OUT OF THE ENGINE COMPARTMENT. WHEN WE RUSHED OUT OF THE VEHICLE,WE NOTICED THAT SOME KIND OF LIQUID GAS LIKE SUBSTANCE WAS DROPPING ON THE GROUND WITH FLAME. THAT IS WHEN WE REALIZED THAT THERE WAS SOME KIND OF GASOLINE LIKE DEFECT MUST HAVE CAUSED THE FIRE. *TR",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/30/2009",
        "dateOfIncident": "05/01/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10272409,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PROBLEM STARTED ABOUT A YEAR AGO.  THE CONSTANT RATTLING SOUND BEHIND THE DASHBOARD WHEN YOU FIRST TURN ON THE HEAT.  AFTER ABOUT 10-15 SECS IT STOPS.  THEN EVENTUALLY THE RATTLING SOUND STOPS COMPLETELY WHEN YOU TURN ON THE HEAT AND SO DOES THE HEAT AND THE DEFROSTER.  I LOST HEAT THE FIRST TIME BACK AROUND DECEMBER OF 2008.  IT CAME BACK ON WITHIN TWO WEEKS AND STAYED ON DURING THE WINTER.  AROUND THE FIRST OF MAY, I LOST HEAT AGAIN AND IT HAS NOT BEEN BACK ON SINCE. *TR",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "05/05/2009",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267749,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM AN OWNER OF A 2003 MITSUBISHI BLACK GALANT.  I AM THE ORIGINAL OWNER OF THE VEHICLE AND IT IS GARAGE-KEPT.  ABOUT A YEAR AGO, I STARTED NOTICING THE PAINT ON MY VEHICLE STARTED TO FADE/OXIDIZE.  I REPORTED THIS TO MITSUBISHI AND THEY DID NOTHING.  I DID MY RESEARCH AND THERE ARE THOUSANDS OF OTHER GALANT OWNERS THAT ARE EXPERIENCING THE SAME PROBLEM.  I BELIEVE A RECALL NEEDS TO BE DONE.  IT WASN'T EVEN A MONTH AFTER MY VEHICLE WAS PAID OFF THAT THE PAINT STARTED TO FAINT.  FIRST ON THE ROOF, THEN ON THE HOOD, NOW IT'S SPREADING LIKE A RASH.  SOMETHING NEEDS TO BE DONE AND MITSUBISHI WILL NOT FIX THE PROBLEM BECAUSE THEY CLAIM THE VEHICLE IS OUT OF WARRANTY. *TR",
        "vin": "4A3AA36G43E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/23/2009",
        "dateOfIncident": "04/21/2009",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266457,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS 2003 MITSUBISHI GALANT.  IMMEDIATELY, AFTER STARTING THE ENGINE THE POWER WINDOW CONTROL MECHANISM WAS ACTIVATED IN THE DOWNWARD POSITION ON THE FRONT PASSENGER SIDE. THERE WAS A STRONG BURNING SMELL AND A CRACKLING NOISE. SMOKE AND SMALL FLAMES EXPELLED FROM THE FRONT PASSENGER DOOR PANEL. THE CONTACT EXTINGUISHED THE FIRE WITHOUT INJURY. HE DID NOT NOTIFY THE FIRE DEPARTMENT. THE INSIDE OF THE DOOR PANEL EXHIBITED SEVERE DAMAGE FROM THE FLAMES.  THE CAUSE OF FAILURE HAS NOT BEEN DETERMINED AND THE VEHICLE IS BEING REPAIRED.  THE CONTACT IS AWARE OF THE SAFETY RISK. THE FAILURE AND CURRENT MILEAGES WERE 80,000.",
        "vin": "4A3AA46G83E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "04/05/2009",
        "dateOfIncident": "02/20/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264161,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FADED PAINT NOTICED ON LEFT SIDE OF HOOD ABOUT A MONTH AND HALF AGO, LOOKED LIKE OXIDATION, A COUPLE WEEKS LATER ANOTHER SPOT ON THE RIGHT SIDE OF HOOD APPEARED, BOTH SPOTS APPEAR TO BE GETTING LARGER (ABOUT THE SIZE OF A DESSERT PLATE) AND MORE PRONOUNCED.  DEALERSHIP SAYS NO DEFECT AND NOT UNDER WARRANTY, ACCORDING TO MANY WEBSITE THERE IS A HUGE ISSUE WITH THE BLACK MITSUBISHI CARS AND THE CLEARCOAT FAILING, CAUSING CHIPPING, PAINT WEAR, AND OXIDATION TO SPREAD THROUGHOUT THE ENTIRE CAR. *TR",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/23/2009",
        "dateOfIncident": "02/14/2009",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 1,
        "odiNumber": 10259677,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE DRIVER OWNS A 2003 MITSUBISHI GALANT.  WHILE DRIVING 55 MPH, THE DRIVER LOST CONTROL OF THE VEHICLE.  THE VEHICLE STRUCK AN EMBANKMENT AND A POWER POLE BEFORE ROLLING OVER A COUPLE OF TIMES.  THE VEHICLE WAS SMASHED AND DENTED ALL OVER, BUT THE AIR BAGS FAILED TO DEPLOY.  THE VEHICLE WAS DESTROYED AND TOWED.  THE DRIVER WAS KILLED AT THE SCENE.  THE MANUFACTURER AND DEALER WERE NOT NOTIFIED.  A POLICE REPORT WAS FILED.  THE FAILURE MILEAGE WAS 66,803.",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/16/2009",
        "dateOfIncident": "11/19/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258738,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BEGINNING OF THIS WINTER SEASON, NOV 2008 MY CAR BEGAN TO MAKE ODD NOISES FROM THE DASH BOARD WHEN I ENGAGED THE HEATER/DEFROSTER.  I HAVE DISCOVERED THAT NUMEROUS OTHER OWNERS OF THIS MAKE/MODEL HAVE EXPERIENCED THE SAME PROBLEM.    IN THIS ECONOMY, IF MITSUBISHI WANTS TO CONTINUE TO BE ABLE TO SELL CARS, IT SHOULD GAIN THE TRUST AND RESPECT OF IT'S CURRENT OWNERS BY COMPENSATING FOR THE NUMEROUS PROBLEMS THEY HAVE WITH THE MITSUBISHI GALANT. *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/16/2009",
        "dateOfIncident": "12/15/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10255359,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR HAD AROUND 65,000 MILES ON IT, AND ALL THE SUDDEN THE HEAT STOPPED WORKING. AIR WOULD BLOW, BUT IT WOULD BE COLD AIR. WE REPLACED THE THERMOSTAT, AS A MECHANIC TOLD ME TO TRY THAT, AND SEE IF IT HELPED, BUT THE HEAT WAS STILL NOT COMING OUT. EVENTUALLY, AS IT WAS GETTING REALLY COLD, WE TOOK IT TO THE MECHANIC, AND IT COST $498.30 TO FIX! HE SAID THE  WATER SHUT VALVE NEEDED TO BE REPLACED. *TR",
        "vin": "4A3AA36G93E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/17/2008",
        "dateOfIncident": "09/20/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10252082,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEAT DID NOT WORK ONE DAY. AND ONLY WORKS RANDOMLY WHEN IT WANTS TO. THE PROBLEM IS THE HEATER CONTROL VALVE, WHICH IS EXPENSIVE TO REPLACE. THOUSANDS OF MITSUBISHI OWNERS HAVE THIS PROBLEM. THE CAR IS PRACTICALLY NEW (2003).  *TR",
        "vin": "4A3AA46H23E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "10/28/2008",
        "dateOfIncident": "07/10/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246914,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 DIAMANTE WITH ABOUT 60,000 MILES ON IT.  MY WINDOWS CONTINUALLY FOG UP WHILE DRIVING OR PARKED AND THE DEFROSTER/VENTS DOES NOT ELIMINATE THE FOG AT ALL, MAKING DRIVING VERY DIFFICULT AND DANGEROUS ESPECIALLY IN RAINY WEATHER AND DURING THE NIGHTTIME. THE SMELL OF ANTIFREEZE IS EXTREMELY STRONG INSIDE THE VEHICLE.   I HAD A PROBLEM WITH MY TRANSMISSION SHIFTING AND THE LIGHT AROUND THE \"N\" ON THE INSTRUMENT PANEL WAS FLASHING.  THE MECHANIC SAID MY HEATER CORE WAS  LEAKING COOLANT ONTO THE TRANSMISSION CONTROL MODULE CAUSING IT TO MALFUNCTION.  I WAS TOLD THAT EVEN THOUGH I PAID FOR AND HAVE AN EXTENDED WARRANTY ON THIS VEHICLE IT WOULD NOT BE COVERED BECAUSE THE HEATER CORE LEAKING IS WHAT CAUSED THE TRANSMISSION CONTROL MODULE TO FAIL.  THE HEATER CORE WAS REPLACED ALONG WITH THE CONTROL MODULE AND THE RELAY WITH A COST OF OVER 2,500 DOLLARS.  IT SEEMS LIKE A PROBLEM LIKE THIS THAT IS EXTREMELY COMMON IS THESE VEHICLES, CREATES SAFETY AND HEALTH HAZARDS, AND VERY EXPENSIVE TO FIX SHOULD BE RECALLED AND COVERED UNDER WARRANTY.  *TR",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/22/2008",
        "dateOfIncident": "07/09/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10246306,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE PAINT ON MY CAR IS FADING AWAY.  THE CAR IS 6 YEARS OLD AND THIS HAS BEEN GOING OWN FOR ABOUT 3 YEARS.  I FEEL IT SHOULD BE COVERED BY THE CAR COMPANY TO GET THIS FIXED.  I'VE SEEN OTHER CARS IN TOWN WITH THE SAME PROBLEM AS MINE.  SO ITS GOT TO BE THE PAINT FROM THE COMPANY THAT MADE THE CAR.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/24/2008",
        "dateOfIncident": "04/10/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10243314,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MITSUBISHI GALANTE HEATER CONTROL MOTOR HAS BROKEN, WITH NO HEAT BEING AVAILABLE TO THE CAR. APPARENTLY THIS IS A PROBLEM THAT HAS HAPPENED TO MANY, MANY PEOPLE, AND I'M ANOTHER OF THESE UNLUCKY FOLKS. *TR",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM,LATCHES/LOCKS/LINKAGES",
        "crash": true,
        "dateComplaintFiled": "08/19/2008",
        "dateOfIncident": "08/09/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10238826,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2007, HORN WOULD JUST BLOW ON IT'S OWN AT RANDOM TIMES.  EVEN THOUGH THE BATTERY WAS ONLY ONE YEAR OLD AT THE TIME, I REPLACED IT AGAIN.  LAST WEEK, 8/09/08 THE HORN JUST STARTED BLARING AGAIN WHILE DRIVING.  IT NEARLY CAUSED AN ACCIDENT DUE TO ANOTHER CAR SWERVING OUT OF THE LANE NEXT TO MY VEHICLE AND INTO MY REAR DRIVER'S SIDE QUARTER-PANEL.      SINCE THE FIRST INSTANCE, THERE SEEMS TO BE ELECTRICAL PROBLEMS, AS THE RADIO AND CLOCK ALWAYS RESET, THE TRIP ODOMETER RESETS TO ZERO, AND THE INTERIOR LIGHTS DO NOT WORK.  THERE ARE NO BLOWN FUSES, AND NO DAMAGE TO THE ELECTRICAL SYSTEM.    NO ONE OR BUSINESS CAN SEEM TO FIND THE SOURCE OF THE PROBLEM.  IT WILL TAKE OVER $5000 TO REWIRE THE CAR.  AS A WORKING CLASS CITIZEN, AND UNEMPLOYED VETERAN, I DON'T HAVE THAT KIND OF MONEY, NOR ACCESS TO IT.  I HAVE NO CHOICE BUT TO DRIVE AN UNSAFE VEHICLE.    I HAVE ALSO HAD PROBLEMS WITH WARPING ON THE ROTORS (TWICE).  *TR",
        "vin": "4A3AA46H53E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/11/2008",
        "dateOfIncident": "05/13/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10237733,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER LEAKS INTO THE INTERIOR CAB ON THE PASSENGER SIDE OF CAR FROM THE AIR CONDITIONING UNIT LOCATED UNDER THE GLOVE COMPARTMENT. WHEN MAKING A LEFT TURN, THE WATER POURS INSIDE CAB CAUSING WATER TO POOL UNDER THE CARPET. ALSO WETS THE WIRES AND HAS CAUSED THE RADIO TO SHORT OUT SO FAR. *TR",
        "vin": "4A3AA46G53E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/04/2008",
        "dateOfIncident": "06/04/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229886,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I JUST BOUGHT A 2003 MITSUBISHI GALANT AND THE HEATER CONTROL MOTOR HAS GONE BAD. IT'S GOING TO COST ABOUT $450.00 TO GET IT FIXED.  *TR",
        "vin": "4A3AA46G63E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/03/2008",
        "dateOfIncident": "02/20/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229714,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MITSUBISHI GALANT.  ON THE DRIVER SIDE OF THE ROOF AND HOOD, THE PAINT IS FADING FROM DARK BLACK TO LIGHT GRAY.  THE FADING WORSENS AFTER THE VEHICLE IS WASHED.  SHE TOOK THE VEHICLE TO AN AUTO BODY SHOP AND WAS INFORMED THAT THE CLEAR COATING ON TOP OF THE BLACK PAINT WAS CAUSING THE FAILURE.  THE VEHICLE HAS NOT BEEN REPAIRED.  THE MANUFACTURER HAS NOT BEEN NOTIFIED.  THE FAILURE AND CURRENT MILEAGES WERE 55,000.",
        "vin": "4A3AA46H83E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/28/2008",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10229111,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT STOPPED WORKING. TURNED THE HEAT ON ONE DAY AND IT THERE WAS A RATTLING SOUND. WHEN YOU TURN THE HEAT ON IT BLOWS OUT COLD AIR. THE PROBLEM SEEMED TO FIX ITSELF THEN IT STARTED AGAIN IN THE BEGINNING OF WINTER 07 AND NOW HAS STOPPED AGAIN (MAY 2008). DEFROSTER ALSO DOES NOT WORK.  WHEN I TOOK IT TO A MECHANIC I WAS TOLD IT WAS THE HEATER COIL WHICH IS STRANGE B/C USUALLY CARS ARE MUCH OLDER BEFORE THE HEATER COIL GOES OUT.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/10/2008",
        "dateOfIncident": "05/10/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227212,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY 2003 MITSUBISHI GALANT HAS A FAILED HEATER CONTROL MOTOR. IT STARTED GOING BAD OVER A YEAR AGO (CLICKING NOISES ON ACTUATION) AND HAS FINALLY STOPPED WORKING ALTOGETHER. IT IS STUCK ON 'COLD' AND DOES NOT SWITCH OVER TO HEAT UNDER ANY CONDITIONS. ON RESEARCHING THIS PROBLEM, IT SEEMS MANY OTHER PEOPLE ARE EXPERIENCING THE SAME ISSUE. THE VOLUME OF SIMILAR COMPLAINTS AND RELATIVELY HIGH EXPENSE OF FIXING THE PROBLEM ON CARS THAT AREN'T THAT OLD SEEMS TO INDICATE A FAULT IN THE DESIGN OF THIS MECHANISM. A RECALL BY MITSUBISHI WHICH WOULD COVER THE COSTS OF REPAIR SHOULD BE ISSUED.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/30/2008",
        "dateOfIncident": "02/15/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10222729,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FALL OF 2007 I FLIPPED FROM AC TO HEAT. THERE WAS CLICKING INSIDE THE DASH AND IT FINALLY SWITCHED OVER. HAD TO SWITCH BACK TO AC ON WARM DAY AND THE CLICKING WAS THERE AGAIN AND IT EVENTUALLY WENT FROM HEAT TO COLD. FINALLY I FLIPPED IT BACK A WEEK OR TWO AGO ON A COLD MORNING, NO CLICKING AND NO HEAT AT ALL. I'VE REACHED UNDER THE DASH PUSHING THE WHITE LEVER BACK AND FORTH THINKING MAYBE IT WAS JUST THE CABLE THAT'S STRETCHED BUT THAT'S NOT THE CASE. I TOOK THE WHITE LEVER OFF (JUST 1 SCREW) AND TURNED THE LITTLE GEAR BY HAND. CLOCKWISE IS TO COLD AND WHEN IT GETS ALL THE WAY IT STOPS. COUNTER-CLOCKWISE IS HEAT AND WHEN I GET TO THE END IT CLICKS LIKE THE EARLIER CLICKING LIKE IT'S STRIPPED OUT SOMEWHERE IN THE DASH.   THERE'S A LOT OF COMPLAINTS ABOUT THIS ON THE INTERNET AND I BELIEVE ONE OTHER SIMILAR COMPLAINT ON THIS SITE. I BELIEVE THIS SHOULD BE CONSIDERED A SUBJECT FOR RECALL THAT THE MANUFACTURER SHOULD COMPENSATE ITS CUSTOMERS FOR.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/27/2008",
        "dateOfIncident": "02/27/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10219353,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI GALANT, AND I HAVE DONE RESEARCH THOROUGHLY ON THE MITSUBISHI AND IT SEEMS THAT THIS CAR WAS MADE TO HAVE A FAILURE IN THE HEAT ASSEMBLY. ACTUALLY, MY HEAT IS NOT WORKING AND EVERYONE SAY IT IS THE MOTOR THAT IS INSIDE THE DASH. THIS SHOULD NOT GO BAD, IS THERE ANYTHING THAT COULD BE DONE SO I WOULD NOT BE SPENDING SO MUCH MONEY FOR THIS REPAIR.  *TR",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/21/2008",
        "dateOfIncident": "01/19/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218742,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER IN CAR STOPPED WORKING DUE TO A PROBLEM WITH THE CONTROL MOTOR MR958603.  *TR",
        "vin": "4A3AA46H32E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/14/2008",
        "dateOfIncident": "02/14/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10218076,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER MOTOR CONTROL STOPPED WORKING AND FROM WHAT I'VE HEARD A LOT OF PEOPLE ARE HAVING THIS PROBLEM IN MITSUBISHI GALANT'S AND I FEEL THEY SHOULD REPLACE THE PART.  *TR",
        "vin": ""
    },
    {
        "components": "SEAT BELTS",
        "crash": false,
        "dateComplaintFiled": "02/05/2008",
        "dateOfIncident": "01/28/2008",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10216949,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A MITSUBISHI GALANT 2003. MY CHILD IS 6YRS. OLD AND WERE RIDING WHEN THIS HAPPENED. SOMEHOW HE WAS IN TIED IN A HANG LOOP HOLE. I HAD TO STOP THE CAR, I THOUGHT I WOULD HAVE TO CUT THE SEATBELT TO REMOVE HIM, BUT I DIDN'T HAVE ANY SCISSORS. WHEN I TRIED TO UNTANGLE HIM, THE SEATBELT SQUEEZED HIS NECK AND HE STATED THAT HE COULD NOT BREATHE. THE LOOP WAS SMALLER THAN HIS HEAD, I HAD TO LIFT HIS BODY TO REMOVE HIM SAFELY. THIS WAS SO SCARY. I'M GLAD I SAW HIM OR ELSE I WOULD HAVE LOST MY SON THAT DAY INSTANTLY. WHEN I TRIED TO UNTANGLE HIM, I DIDN'T TAKE MUCH FOR THE LOOP TO SQUEEZE HIS NECK. THIS IS NOT SAFE AT ALL.  *TR",
        "vin": "4A3AA46G53E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/05/2008",
        "dateOfIncident": "12/29/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213828,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IT STARTED WITH A CLICKING NOISE WHEN I TURNED THE TEMPERATURE CONTROL KNOB FROM COLD TO HOT. NOW THE HEATER ONLY BLOWS COLD AIR. THIS HAPPENED IN A MATTER OF 2 DAYS. THE WINDSHIELD FOGGED UP CREATING A VERY DANGEROUS SITUATION. I LIVE IN A TOWN WHERE NOBODY WANTS TO WORK ON A MITSUBISHI. LOOKS LIKE I'LL DRIVE 100 MILES TO GET IT FIXED. HOW MANY MORE HAVE TO BREAK BEFORE MITSUBISHI FIXES THEIR PROBLEM?  *CN",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/28/2007",
        "dateOfIncident": "12/26/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213030,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI GALANT V6. IN THIS CAR I HAVE AN ISSUE WITH THE HEATING SYSTEM IN THE CABIN. IT SEEMS THIS IS A COMMON FAILURE IN ALL 1999-2003 MODELS. PLEASE LET MITSUBISHI MOTORS OF AMERICA  KNOW ABOUT IT AS ITS VERY COMMON IN THESE PARTICULAR MODELS. PLEASE REFER TO THE LINK  HTTP://WWW.MITSUBISHI-FORUMS.COM/T11076-NO-HEAT.HTM  AGAIN  OVERALL, MITSUBISHI ARE VERY GOOD CARS.  *TR",
        "vin": "4A3AA46H73E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/12/2007",
        "dateOfIncident": "12/09/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10211527,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER CONTROL VALVE LOCKS UP AND MAKES THE VEHICLE UNABLE TO HEAT UP.  THE FACTORY PART IS VERY POORLY DESIGNED AND LEADS TO PREMATURE FAILURE AND A VERY PRICEY REPAIR BILL.  *TR",
        "vin": "4A3AA46G33E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/24/2007",
        "dateOfIncident": "11/21/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209787,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER VALVE MOTOR FAILED IN MY 2003 GALANT I HAVE HEARD MANY MANY COMPLAINTS ABOUT THE SAME ISSUE AND HAVE READ MANY MORE OF THE SAME ISSUE ONLINE.  *TR",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/20/2007",
        "dateOfIncident": "11/17/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209528,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE HAVE A 2003 MITSUBISHI GALANT AND AFTER ONLY 3 WINTERS THE HEATING CORE HAS GONE OUT.  THIS IS RIDICULOUS!!  ESPECIALLY SINCE THIS CAR HAS EXTENDED COOLANT AND NOTHING NEEDS TO BE DONE TO THIS CAR FOR AT LEAST 5 YEARS. THE AUTO REPAIR SERVICE I USED REPLACED THE HEATING CORE ONLY TO FIND OUT THAT THE HEATER CONTROL MOTOR VALVES WERE NOT OPENING UP WHICH CAUSED THE HEATER CORE TO GO BAD.  FROM MY UNDERSTANDING THE MITSUBISHI DEALER WHERE THE PARTS CAME FROM KEEP THESE IN STOCK BECAUSE THIS IS HAPPENING QUITE FREQUENTLY IN THESE CARS.  THIS IS $1400 WORTH OF PARTS AND LABOR. THIS SHOULD DEFINITELY NOT HAPPEN TO A CAR THAT IS ONLY 4 YEARS OLD.  *TR",
        "vin": "4A3AA46H33E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/17/2007",
        "dateOfIncident": "10/14/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10209199,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NO HEAT.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/11/2007",
        "dateOfIncident": "11/11/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208650,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY WIFE'S 2003 MITSUBISHI GALANT'S HEATER FAILED LAST YEAR. WE HAD THE HEATER CONTROL MOTOR REPLACED. IT HAS HAPPENED AGAIN THIS YEAR. I CAN'T SEE SPENDING 400 DOLLARS ONCE A YEAR TO FIX THE HEATER.  *TR",
        "vin": "4A3AA46G93E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "11/10/2007",
        "dateOfIncident": "10/15/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208581,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKING NOISE FROM THE VENTS WHEN SWITCHING TEMPERATURE GAUGE FROM COLD TO HOT.  NO HOT AIR COMING FROM VENTS. FAN CONTINUES TO BLOW COLD AIR WHILE CAR IS AT OPERATING TEMPERATURE.  NOT THE FIRST TIME IT HAS HAPPENED.  HEAT WAS RESTORED AFTER A FEW MONTHS JUST IN TIME BEFORE THE WINTER LAST YEAR. IT HAS HAPPENED AGAIN THIS FALL AND COLD AIR CONTINUES TO BLOW AS WINTER APPROACHES.  *TR",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/10/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10208597,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AFTER NORMAL USE, THE HEATING SYSTEM WITHIN THE 2003 MITSUBISHI GALANT BREAKS.  EVERYONE WITH THIS CAR HAS OR WILL HAVE THIS PROBLEM. *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/05/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207910,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI GALANT WITH PROBLEMS WITH THE HEATER CONTROL MOTOR, FROM WHAT I UNDERSTAND THERE HAVE BEEN AN EXUBERANT AMOUNT OF THESE HAVING THIS ISSUE AND IT SHOULD BE RECALLED BY MITSUBISHI SEEING THEY CHARGED 22,000 FOR THIS CAR AND IT IS NOW ONLY WORTH 3000.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "11/02/2007",
        "dateOfIncident": "11/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10207747,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MITSUBISHI GALANT NO HEAT,  I'VE BEEN ONLINE AND THERE A HUNDREDS OF COMPLAINTS ABOUT THE SAME ISSUE. I'VE BEEN TO THE DEALER AND INDEPENDENT GARAGE AND TALKING BETWEEN 300/ 1000 TO FIX WITH SO MANY COMPLAINTS THE DEALER SHOULD BE REQUIRED TO FIX THIS PROBLEM.  *TR",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/21/2007",
        "dateOfIncident": "09/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206477,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN RESEARCHING WHAT MIGHT BE WRONG WITH MY MITSUBISHI GALANT HEATER, I FIND IT IS A COMMON PROBLEM DESCRIBED TO THE TEE. NOT HAVING HEAT IN MY CAR AND LIVING IN THE PACIFIC NORTHWEST COULD PROVE TO BE DANGEROUS FOR MYSELF AND OTHERS AS VISIBILITY AND FREEZING WILL OCCUR AS I HAVE TO RUN THE COLD AIR ON MY WINDSHIELD TO SEE.  *TR",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "10/19/2007",
        "dateOfIncident": "10/19/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10206321,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 03 BLACK MIT. GALANT AND THE PAINT HAS FADED ON THE TRUNK AND TOP CLOSE TO THE SUNROOF. I KEEP MY CAR UNDER A CARPORT. THE CAR IS NOT PAID FOR AND IT ALREADY LOOKS VERY OLD. I HAVE ALSO NOTICED OTHER CARS THIS SAME MODEL AND COLOR AND THE PAINT IS FADING TOO. IT SEEMS THE COMPANY WOULD REPAINT THESE CARS SINCE IT IS OBVIOUS THAT THE PAINT WASN'T OF ANY QUALITY.",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/11/2007",
        "dateOfIncident": "03/06/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10205458,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I'VE OWNED MY 2003 MITSUBISHI GALANT LS SINCE NEW AND MY HEATER HAS STOPPED WORKING.  THE CAR HAS  60000 MILES ON IT AND I NOTICED THAT THERE WERE MANY PEOPLE THAT HAS THE SAME PROBLEM.  *JB",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/23/2007",
        "dateOfIncident": "09/08/2007",
        "fire": true,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10203896,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PASSENGER SIDE DOOR STARTED SMOKING AND IT MELTED THE WINDOW WIRING AND DOOR LOCK CLICKER AND THE MOTOR IN THE WINDOW AND MELTED THE DOOR A LITTLE BIT. IT SHOULD HAVE BLOWN THE FUSE FOR THE WINDOW BUT IT DIDN'T IT STARTED SMOKING . *TR",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/09/2007",
        "dateOfIncident": "03/15/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10202315,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT STOPPED WORKING ABOUT 6 MONTHS AGO DUE TO WHAT I THINK IS A HEATER CORE OR HEAT VALVE ISSUE. *JB",
        "vin": "4A3AA46H43E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/08/2007",
        "dateOfIncident": "08/07/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198807,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A MITSUBISHI GALANT, 2003, AND THE HEATER CORE HAS GONE BAD.  I AM NOT OPPOSED TO COST OF THE PART, IT IS THE LABOR CHARGE THAT HAS ME UPSET.  BECAUSE THE DASH HAS TO BE TAKEN APART I AM LOOKING AT $300.00-$400.00 FOR THIS REPAIR.  I WOULD LIKE MITSUBISHI TO HELP DEFRAY THE LABOR COSTS.  I UNDERSTAND THIS IS HAPPENING A LOT IN MITSUBISHI GALANTS.  *TR",
        "vin": "4A3AA46G83E"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2007",
        "dateOfIncident": "09/12/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10198516,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY PAINT ON MY CAR STARTED TO FADE A YEAR AGO. ITS A SHAME THAT MY CAR IS ONLY 3 YRS OLD AND LOOKS 10YRS OLD. I BOUGHT MY CAR BRAND NEW AND I'M MAKING PAYMENTS NOW I HATE TO MAKE MY PAYMENTS BECAUSE MY CAR LOOKS SO BAD.  *TR",
        "vin": "4A3AA36G53E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2007",
        "dateOfIncident": "07/06/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197650,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI GALANT PURCHASED NEW WITH 12 MILES. I HAVE KEPT UP MAINTENANCE ON MY CAR AND HAVE A MANUFACTURER AND EXTENDED WARRANTY (BOUGHT FROM THE DEALER) BOTH COVERING MY CAR UP TO 100,00 MILES. MY CAR HAS 91,000 MILES. I WAS DRIVING DOWN THE FREEWAY AND NOTICED THAT MY FOOT WAS ON THE GAS PEDAL BUT THE CAR WAS SLOWING DOWN. I IMMEDIATELY BEGAN EXITING THE FREEWAY TO THE RIGHT TO ATLEAST TRY TO REACH THE EMERGENCY LANE BEFORE THE CAR DIED ON THE FREEWAY. WHILE GETTING OVER SMOKE STARTED COMING OUT THE HOOD ENTERING THE CAR THROUGH THE AIR VENTS, BY THE TIME I CROSSED 4 LANES; MY CAR LOOKED LIKE IT WAS GOING TO BLOW UP. I JUMPED OUT THE CAR DUE TO FEAR ONCE I WAS ABLE TO DRIFT TO THE SIDE. I HAD IT TOWED TO AN AUTO MECHANIC SHOP WHERE THEY TOLD ME MY ENGINE AND TRANSMISSION WERE BLOWN. I HAD MY CAR TOWED TO A MITSUBISHI DEALERSHIP FOR REPAIRS AND WAS INFORMED (AFTER A WEEK OF GETTING THE RUN AROUND FROM MITSUBISHI, THE DEALER, AND THE EXTENDED WARRANTY COMPANY) THAT NONE OF THE MAINTENANCE WOULD BE COVERED.   SO, I THE CONSUMER HAVE TO PAY AN OUT OF POCKET EXPENSE OF $3500. I WAS TOLD BY MITSUBISHI THAT IT WAS A PROBLEM WITH THE RADIATOR, (TEMPERATURE GAUGE WAS STUCK) WHICH CAUSED THE ENGINE AND TRANSMISSION TO GO OUT AND SINCE THE RADIATOR IS NOT COVERED BY THE MANUFACTURER OR THE EXTENDED WARRANTY THEN NONE OF THE REPAIRS WERE COVERED. IT TOOK THE DEALER 2 WEEKS TO START WORK ON MY CAR. *TR",
        "vin": "4A3AA46GX3E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/27/2007",
        "dateOfIncident": "07/06/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10197651,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI GALANT PURCHASED NEW WITH 12 MILES. I HAVE KEPT UP MAINTENANCE ON MY CAR AND HAVE A MANUFACTURER AND EXTENDED WARRANTY (BOUGHT FROM THE DEALER) BOTH COVERING MY CAR UP TO 100,00 MILES. MY CAR HAS 91,000 MILES. I WAS DRIVING DOWN THE FREEWAY AND NOTICED THAT MY FOOT WAS ON THE GAS PEDAL BUT THE CAR WAS SLOWING DOWN. I IMMEDIATELY BEGAN EXITING THE FREEWAY TO THE RIGHT TO AT LEAST TRY TO REACH THE EMERGENCY LANE BEFORE THE CAR DIED ON THE FREEWAY. WHILE GETTING OVER SMOKE STARTED COMING OUT THE HOOD ENTERING THE CAR THROUGH THE AIR VENTS, BY THE TIME I CROSSED 4 LANES; MY CAR LOOKED LIKE IT WAS GOING TO BLOW UP. I JUMPED OUT THE CAR DUE TO FEAR ONCE I WAS ABLE TO DRIFT TO THE SIDE. I HAD IT TOWED TO AN AUTO MECHANIC SHOP WHERE THEY TOLD ME MY ENGINE AND TRANSMISSION WERE BLOWN. I HAD MY CAR TOWED TO A MITSUBISHI DEALERSHIP FOR REPAIRS AND WAS INFORMED (AFTER A WEEK OF GETTING THE RUN AROUND FROM MITSUBISHI, THE DEALER, AND THE EXTENDED WARRANTY COMPANY) THAT NONE OF THE MAINTENANCE WOULD BE COVERED. SO, I THE CONSUMER HAVE TO PAY AN OUT OF POCKET EXPENSE OF $3500. I WAS TOLD BY MITSUBISHI THAT IT WAS A PROBLEM WITH THE RADIATOR, (TEMPERATURE GAUGE WAS STUCK) WHICH CAUSED THE ENGINE AND TRANSMISSION TO GO OUT AND SINCE THE RADIATOR IS NOT COVERED BY THE MANUFACTURER OR THE EXTENDED WARRANTY THEN NONE OF THE REPAIRS WERE COVERED. IT TOOK THE DEALER 2 WEEKS TO START WORK ON MY CAR. *TR",
        "vin": "4A3AA46GX3E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "07/26/2007",
        "dateOfIncident": "07/24/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10197527,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "REAR ENDED A SUV FRONT END OF 2003 GALANT WAS WRECKED.  AIRBAGS NEVER DEPLOYED.  I WAS WEARING MY SAFETY BELT.  THAT IS WHAT KEPT ME UNHARMED.  NEITHER AIRBAG DEPLOYED.  *JB",
        "vin": "4A3AA46GX3E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/02/2007",
        "dateOfIncident": "09/16/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10195186,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE FRONT STEERING GOES OFF CENTER, WHENEVER TIRES ARE ROTATED, OR NEW TIRES ARE INSTALLED ON THE FRONT. RE-ALIGNMENT IS NECESSARY TO GET THE STEERING BACK TO CENTER.  *TR",
        "vin": "4A3AA46G83E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "06/21/2007",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193917,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 MITSUBISHI GALANT.  THE CONTACT NOTICED A CRACK IN THE VEHICLE'S DASHBOARD THAT HAS SPREAD AS THE YEAR PROGRESSED.  THE VEHICLE WAS TAKEN TO A MECHANIC WHO HAS NOT DIAGNOSED THE CAUSE OF FAILURE AT THIS TIME.  THE CURRENT MILEAGE IS 43,100 AND FAILURE MILEAGE WAS 43,000.",
        "vin": "4A3AA46H93E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/20/2007",
        "dateOfIncident": "06/19/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193782,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CLICKS FOR 10-20 SECONDS WHEN I SWITCH FROM AC TO HEATER AND BACK EVERY TIME. TWICE WHILE DRIVING I SWITCHED FROM AC TO HEATER AND HEARD NO CLICKING, BUT ALSO GOT NO HEAT (STILL BLOWING COLD AIR). STARTED HAPPENING AFTER ABOUT 5,0000, AND HAS BEEN ONGOING FOR A FEW MONTHS. *AK",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "05/16/2007",
        "dateOfIncident": "05/12/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190966,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT 2003 GALANT NEW. WITH 54,000 JUST REPLACED BRAKE ROTORS FOR THE 2ND TIME. BRAKES STILL GOOD, BUT ROTORS WARPED,  CAUSING WHEEL SHIMMY WHEN BRAKING AND TIRE CUPPING.  *AK",
        "vin": "4A3AA46H13E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/02/2007",
        "dateOfIncident": "04/20/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10189519,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME FROM WORK ON FRIDAY, 4/20/2007 IN MY 2003 MITSUBISHI GALANT; I PASSED OUT BEHIND THE WHEEL FROM IMPROPER BLOOD PRESSURE MEDICATION CAUSING MY BLOOD PRESSURE TO BECOME TOO LOW.  I APPARENTLY DROVE OFF THE ROAD ONTO A BUSINESSES PROPERTY AND STRUCK THE SIGNS IN THE FRONT YARD.  MY INSURANCE COMPANY HAS TOTALED MY VEHICLE AND SAYS THAT BASED ON THE DAMAGE DONE TO THE CAR I MUST HAVE BEEN TRAVELING AT 35 MPH UPON IMPACT AND NEITHER AIRBAG DEPLOYED! *TR",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "05/01/2007",
        "dateOfIncident": "03/16/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10189412,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MITSUBISHI GALANT 2.4 LITER 4 CYL.   SYMPTOM: CLICKING IN THE DASH BOARD.  HEAT WOULD SOMETIMES WORK AND SOMETIMES NOT.  CLICKING STOPPED ABOUT A MONTH AGO AND SO DID THE HEAT. HEATER CONTROL VALVE OR MOTOR IS THE PROBLEM IT WOULD SEEM...A FIX OF 300-500 DOLLARS JUST TO GET HEAT. *TR",
        "vin": "4A3AA46GX3E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/12/2007",
        "dateOfIncident": "12/27/2002",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10187647,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A 2003 MITSUBISHI GALANT IN DECEMBER 2002.  SINCE PURCHASING THE CAR THE BRAKES AND ROTORS HAVE BEEN REPLACED EVERY YEAR.  ALSO, THERE IS A HUGE LIST OF OTHER PARTS AND REPLACEMENTS THAT HAVE BEEN DONE;  THE MOST RECENTLY TIMING BELT, WATER PUMP, VALVE COVER AND GASKET, HEATER HOT WATER CONTROL, VALVE, THERMOSTAT FOR COOLING SYSTEM, ETC.  THIS CAR ONLY HAS 44,000 MILES, AND IT WORKS AS IF IT HAS OVER 200,000 MILES.*AK",
        "vin": "4A3AA36G73E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/09/2007",
        "dateOfIncident": "03/09/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10184603,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MITS GALANT, HEATER ALL OF A SUDDEN STOPPED WORKING, NO SOUNDS BEFORE, JUST WOKE UP NEXT MORNING TURNED ON HEAT AND GOT COLD AIR. *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "02/19/2007",
        "dateOfIncident": "02/19/2007",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182977,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 GALANT THAT THE HEATER JUST SUDDENLY QUIT WORKING ON IT.  IT HAS BEEN DIAGNOSED AS A HEATER CONTROL MOTOR.  WITH THE COST EXCEEDING $300 TO REPAIR.  WORKED FINE THEN JUST QUIT.  *NM",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/24/2006",
        "dateOfIncident": "11/22/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10174171,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE DRIVER SIDE AIR BAG DID NOT DEPLOY IN A FRONTAL IMPACT CRASH. THE SPEED AT THE TIME OF IMPACT WAS 42 MPH. THERE WAS PRE-IMPACT BRAKING. THE DRIVER WAS WEARING THE SEAT BELT, BUT THE LOCK BECAME UNLATCHED. THE DRIVER SUSTAINED A CONCUSSION ON THE FOREHEAD AND SPRAIN IN THE HAND, RISK, ARM AND RIGHT KNEE. A POLICE REPORT WAS PROCESS. *AK",
        "vin": "4A3AA46GX3E"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "10/11/2006",
        "dateOfIncident": "08/11/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170592,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER DOES NOT BLOW WARM AIR ANYMORE.  WAS TOLD BY DEALER THAT THIS IS A COMMON PROBLEM, BUT SHOULD NOT BE FOR THE AGE OF THE VEHICLE.  WILL COST ABOUT $300 TO FIX.  ALSO AIR ALWAYS COMES THROUGH THE VENTS EVEN IN OFF POSITION.  WAS TOLD BY DEALER THAT THIS IS ANOTHER COMMON PROBLEM.  *NM",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/07/2006",
        "dateOfIncident": "10/01/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170194,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MITSUBISHI GALANT ES V6 60,000 MILES...HEAT DOES NOT WORK...RECENTLY TURNED HEAT ON IN CAR...HEARD A CLICKING SOUND COMING FROM HEATER, THEN ONLY COLD AIR CAME OUT THROUGH VENTS...BASED ON THE VOLUME OF CONSUMER INTERNET POSTINGS, THIS IS A VERY COMMON PROBLEM AMONG THIS TYPE OF CAR.   *JB",
        "vin": "4A3AA46H13E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/03/2006",
        "dateOfIncident": "09/19/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169815,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE BLUE AND RED CONTROLS FOR THE AIR AND HEATER STARTED TO MAKE A GRINDING NOISE WHEN TURNED TO HEAT. IT CONTINUED TO DO SO FOR A FEW MORE TIMES THEN STOPPED. IT WAS RAINING ONE DAY AND I WANTED TO DEFROST THE WINDSHIELD. THAT IS WHEN I DISCOVERED THE HEAT WAS NOT WORKING. I AM NOT MECHANICALLY INCLINED AND HAVE DONE NOTHING YET TO FIX THE PROBLEM. I WANTED TO SEE IF THERE WAS A RECALL OR SOMETHING FIRST BEFORE I SPENT ANY MONEY ON THE PROBLEM. *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/21/2006",
        "dateOfIncident": "03/25/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168819,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEAT DOES NOT WORK.  *JB",
        "vin": ""
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "03/21/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168689,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MITSUBISHI GALANT-- BAD HEATER CONTROL MOTOR.  SEEMS LIKE TOO NEW OF A CAR TO BE HAVING THESE PROBLEMS.  *NM",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/08/2006",
        "dateOfIncident": "09/08/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10167638,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THE ENGINE STALLED SUDDENLY WITHOUT WARNING.  THE OIL LIGHT ILLUMINATED ON THE DASHBOARD.  THE VEHICLE WAS TAKEN TO THE DEALERSHIP SEVERAL TIMES.  ON ONE OCCASION, A NEW BATTERY WAS INSTALLED AND THE THROTTLE WAS CLEANED BUT THE PROBLEM PERSISTED.  ON 8-10-06 A NEW TRANSMISSION WAS INSTALLED BUT THE PROBLEM STILL PERSISTED.",
        "vin": "4A3AA46H43E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "08/29/2006",
        "dateOfIncident": "07/01/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166995,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TEMPERATURE CONTROL  WAS MAKING WEIRD GRINDING NOISES WHEN ADJUSTING FROM COLD TO HOT OR VICE VERSA.  TEMPERATURE INITIALLY WOULD CHANGE AS DESIRED.  GRINDING NOISES EVENTUALLY CEASED AS WELL AS NO HEAT AVAILABLE.  PERIOD OR LAPSE OF TIME WAS ROUGHLY 1 TO 2 MONTHS BEFORE HEAT DIDN'T WORK.  CORRECTIVE ACTION IS BEING LOOKED AT IN 1 WEEK.  UNDERSTAND OTHER 2003 GALANTS HAVE BEEN HAVING THIS SAME ISSUE.  WITH THE HEATER CONTROL MOTOR AND OTHER PARTS NEEDING TO BE REPLACED. *JB",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/22/2006",
        "dateOfIncident": "08/22/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10166204,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED A USED 2003 MITSUBISHI GALANT FROM A LARGE USED-CAR DEALERSHIP.  ON THE NEXT DAY, THE HORN SOUNDED OFF SPONTANEOUSLY WHILE SITTING IN THE DRIVEWAY OVERNIGHT AND WOULD NOT TURN OFF, REQUIRING ME TO PULL THE FUSE IN ORDER TO STOP THE SOUND.  THE USED CAR DEALERSHIP DISCUSSED THE ISSUE WITH A MITSUBISHI DEALER, WHO ADVISED THEM TO REPLACE THE HORN AND THE HORN RELAY.  THEY DID SO, BUT THE HORN ONCE AGAIN WENT OFF SPONTANEOUSLY WHILE SITTING IN THE DRIVEWAY JUST OVER A WEEK LATER.  THE DEALERSHIPS COORDINATED THEIR REPAIR EFFORTS ONCE AGAIN, BUT THIS TIME THEY COULD NOT REPLICATE THE PROBLEM.  IT WAS DETERMINED, HOWEVER THAT A POOR GROUND CONNECTION ON THE HORN COULD BE THE SOURCE OF THE PROBLEM.  UNFORTUNATELY, JUST ONE WEEK LATER, THE HORN ONCE AGAIN WENT OFF WHILE IN THE DRIVEWAY AND CONTINUED TO BLARE UNTIL I PULLED THE FUSE.  THE DEALERSHIP IS UNCERTAIN WHAT TO DO TO FIX THE INTERMITTENT PROBLEM.  CLEARLY, FROM MY EXPERIENCE AND THE NUMBER OF COMPLAINTS I HAVE SEEN REGISTERED WITH THE NHTSA OVER THIS ISSUE, THE GALANT HAS A SIGNIFICANT SAFETY ISSUE WITH RESPECT TO THE FUNCTIONING OF ITS HORN ASSEMBLY.  DRIVERS, PASSENGERS AND PEDESTRIANS ARE AFFECTED BY THE UNSAFE NATURE OF THIS VEHICLE, AND A RECALL IS CERTAINLY REQUIRED.  *NM",
        "vin": "4A3AA46G83E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/25/2006",
        "dateOfIncident": "09/02/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10163385,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE ROTOR GETTING WARPED CAUSING VIBRATIONS, MACHINED(LATHE) EACH TIME AND I WANTED NEW ROTORS. IT HAPPENED AT AROUND 18,000 AND 9 MONTHS LATER 24,000 SAME PROBLEM. THE THIRD TIME AT AROUND 32,000 THEY BLAMED ME FOR THE CAUSES FROM POOR DRIVING,NON ROTATION OF TIRES,TORQUE OF WHEELS, ETC. I AM THE DRIVER MOST OF THE TIME OF THIS CAR SINCE IT'S THE NEWEST OF 5 CARS AND I AM THE MOST EXPERIENCED. I NEVER HAD THIS PROBLEM WITH MY HONDA,SUBARU,TOYOTA, AND MAZDA. I SPOKE TO MITSUBISHI CUSTOMER RELATIONS OFFICERS TO NO AVAIL. THEY INSIST IT IS WEARABLE ITEM AND IT'S NOT COVERED ALTHOUGH THE FIRST TIME THE OFFICER TOLD ME WHEN I ASKED FOR NEW ROTOR THEY WILL DO IT THE NEXT TIME SINCE IT WAS JUST TURNED(LATHE). BUT THE SECOND TIME THEY DENY TELLING ME THAT AND WANTED ME TO PAY THE DEALER TO HAVE IT OPENED AND HAVE IT INSPECTED. I JUST LEFT, WHY PAY THEM FOR WHAT I FEEL A WARRANTY ISSUE.  *NM",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/07/2006",
        "dateOfIncident": "03/05/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156947,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI GALANT ES.  IT HAS 69000 MILES. AS OF RIGHT NOW THE PROBLEM WITH MY CAR HASN'T CAUSED  AN ACCIDENT BUT I AM AFRAID IN THE FUTURE IT MIGHT.  IT STARTED WITH THE RADIO STAYING ON EVEN AFTER THE KEY IS PULLED,  THEN IT WENT TO THAT IF I USED THE WIPERS AND THE HEADLIGHTS AT THE SAME TIME, THE WIPERS WOULDN'T SHUT OFF UNTIL I SHUT THE HEADLIGHTS OFF. WE THEN HAD TO PULL THE FUSE FOR THE HORN, BECAUSE WHILE SITTING IN THE GARAGE, NOT RUNNING, HADN'T BEEN RUNNING FOR SEVERAL HOURS, THE HORN STARTED BLARING, AND WOULDN'T GO OFF UNTIL MY HUSBAND DISCONNECTED THE BATTERY.   I AM SCARED FOR MY OWN SAFETY AS WELL AS OTHERS, TO USE THE CRUISE.  I AM SCARED IT WILL STAY ON, AND I WOULD BE INVOLVED IN A SEVERE CRASH.  PLEASE HELP, NO ONE SEEMS TO KNOW EXACTLY WHAT THE PROBLEM IS.  *JB",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "ELECTRICAL SYSTEM,EXTERIOR LIGHTING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/07/2006",
        "dateOfIncident": "09/22/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156948,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A FEW MONTHS AGO  THE RADIO STARTED STAYING ON EVEN WHILE THE KEY WAS PULLED COMPLETELY OUT, THEN THE HORN FUSE HAD TO BE PULLED BECAUSE WHILE SITTING IN OUR GARAGE AND THE CAR NOT RUNNING, AND HADN'T BEEN RUNNING  FOR 12 HOURS, THE HORN STARTED BLARING, UNTIL MY HUSBAND COULD DISCONNECT THE BATTERY, THEN WHILE DRIVING HOME ONE EVENING IN THE RAIN, I HAD THE WIPERS AND HEADLIGHTS ON  THE WIPERS WOULD NOT SHUT OFF, EVEN WHEN PUT IN THE OFF POSITION.  THEY WOULD NOT SHUT OFF UNTIL I SHUT THE HEADLIGHTS OFF.  I AM SCARED FOR MY SAFETY AS WELL AS OTHERS TO DRIVE MY CAR, AND ESPECIALLY TO USE THE CRUISE.   I FEAR THAT IF I DO USE THE CRUISE IT WILL STAY ON, AND I WILL BE INVOLVED IN A DEADLY CRASH.  NO ONE SEEMS TO KNOW WHAT IS THE PROBLEM.  IT SEEMS TO REALLY ACT UP WHEN THE WEATHER IS DAMP OR WET.  THE WIPERS WILL COME ON BY THEMSELVES IN THE OFF POSITION, WITH OR WITHOUT THE HEADLIGHTS.  PLEASE HELP.  *JB",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/30/2006",
        "dateOfIncident": "01/10/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10156448,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "GALANT 2003, 55,000KMS, GRINDING SOUND WHEN TURNING THE HEATER TEMP DIAL, SOUNDS LIKE HEATER CONTROL MOTOR. *JB",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/12/2006",
        "dateOfIncident": "03/10/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10155123,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED WHILE DRIVING 40MPH, THE VEHICLE WAS INVOLVED IN A CRASH AND THE AIR BAGS DID NOT DEPLOY.  THE COLLISION OCCURRED WHEN ANOTHER VEHICLE RAN A RED LIGHT.  THE CONTACT TRIED TO AVOID AN ACCIDENT, BUT HIT A TREE HEAD ON.  THE IMPACT WAS THE COMPLETE FRONT END OF THE VEHICLE.  BOTH OCCUPANTS OF THE VEHICLE RECEIVED INJURIES TO THE HEAD AND SHOULDERS; HOWEVER, BOTH WERE WEARING SEAT BELTS.   THE POLICE WERE AT THE SCENE OF THE ACCIDENT AND PROVIDED A WRITTEN REPORT.  THE VEHICLE WAS NOT CONSIDERED TOTALED BY THE INSURANCE COMPANY AND WAS REPAIRED.",
        "vin": "4A3AA46G53E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "04/01/2006",
        "dateOfIncident": "03/15/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10154335,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEATER WENT OUT, AND AFTER SEVERAL ATTEMPTS TO HAVE REPAIRED, WAS INFORMED HEATER CORE WAS DEFECTIVE.  REPAIRING/REPLACING HEATER CORE IS AN EXTREMELY EXPENSIVE PROCEDURE!!  *NM",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "VISIBILITY,UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "03/25/2006",
        "dateOfIncident": "03/20/2006",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10153713,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI GALANT AND ALREADY THE HEATER IS GONE IN IT, I HAVE SEARCHED THE INTERNET AND LEARNED THAT MANY OTHERS THAT HAVE THIS VEHICLE HAS THE SAME PROBLEM I THINK MITSUBISHI SHOULD PAY FOR THIS DEFECT SINCE WE PAID MONEY OUT OF A-- TO REPLACE THERMOSTAT,WATER HOSES,ETC AND THE PROBLEM STILL EXIST THE HEATER ONLY BLOWS OUT COLD AIR.    *JB",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/02/2005",
        "dateOfIncident": "12/02/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10144319,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "DIAMOND CARE",
                "productModel": "DIAMOND CARE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "CHECK ENGINE LIGHT KEEPS COMING ON.  TOLD BY DEALERSHIP TUNE UP WOULD FIX PROBLEM AND IT DIDN'T FIX IT.  ALSO CAR IS UNSTABLE WHEN FIRST TURNED ON, LIKE IT'S GOING TO CUT OFF.  *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": true,
        "dateComplaintFiled": "11/21/2005",
        "dateOfIncident": "11/18/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10143404,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED MY CAR ON AUGUST 10. 2005, AT APPROXIMATELY 32,000 MILES. ON NOVEMBER 8, 2005 I WAS DRIVING ON I-285. I WENT TO APPLY MY BRAKES, BUT MY CAR FAILED TO STOP, AND SKIDDED FOR UP TO A MINUTE. ON NOVEMBER 11, 2005, I HAD MY CAR SERVICED AT THE MITSUBISHI DEALERSHIP. IT WAS STATED THAT MY BACK BRAKES, WERE NOT WORKING AND NEEDED ADJUSTING, CAUSING THE FRONT BRAKES TO HAVE TO DO ALL THE WORK. THIS IS TURN CAUSED THE FRONT ROTORS TO OVERHEAT AND BECOME WARPED. THE DEALERSHIP TURNED THE FRONT ROTORS, AND ADJUSTED THE BACK. ONE WEEK LATER ON NOVEMBER 18, 2005, I WAS DRIVING ON DONALD LEE HOLLOWELL PARKWAY, WHEN A DRIVER IN FRONT OF ME SLAMMED ON HER BRAKES. I IN TURN PUT ON MINE BUT THE CAR DID NOT STOP AND SKIDDED INTO THE BACK OF HER CAR,  CAUSING AN ACCIDENT.   *NM",
        "vin": "4A3AA46G83E"
    },
    {
        "components": "STRUCTURE,LATCHES/LOCKS/LINKAGES",
        "crash": false,
        "dateComplaintFiled": "10/23/2005",
        "dateOfIncident": "09/06/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10140534,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HANDLE ON THE FRONT PASSENGER SIDE COMES OUT OF ITS PLACE.  THE HATCHBACK ON THE OUTLANDER NO LONGER CAN STAY UP ON ITS OWN, THE ARM THAT HOLDS IT UP IS DEFECTIVE.",
        "vin": "JA4LX31G13U"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/17/2005",
        "dateOfIncident": "10/17/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10140004,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: THE  CONSUMER STATED ON OCTOBER 17, 2005  CONSUMER'S VEHICLE WAS INVOLVED  IN  A HEAD ON COLLISION.  UPON IMPACT,  THE DRIVER'S SIDE AIR BAG DID NOT DEPLOY. THIS IS A MITISIBISHI GALANT 2003, THERE WAS NO PRIOR WARNING .  THE AIR BAG LIGHT HAD NOT BEEN ON. CONSUMER HAS NOT CONTACTED HAS NOT CONTACTED THE DEALER. *AK",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/11/2005",
        "dateOfIncident": "10/10/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10139280,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY CAR HAD AROUND 11,000 MILES ON IT (2003 MITSUBISHI GALANT ES) WHEN THE BRAKES STARTED TO MAKE A THUMPING NOISE.  I BROUGHT THE CAR TO THE DEALERSHIP AND WAS TOLD THE BRAKES ARE STILL FINE, BUT THE BRAKES PUT ON IN THE FACTORY ARE CHEAP BRAKES AND A LOT OF PEOPLE WITH GALANT'S ARE HAVING THE SAME ISSUE.  I HAVE 12,000 MILES ON THE CAR AND THE NOISE IS GETTING WORSE.  IF MY BRAKES ARE STILL GOOD, WHAT IS GOING ON?  *NM",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "10/04/2005",
        "dateOfIncident": "10/04/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10138599,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 MITSUBISHI LANCE OZ RALLY, CAR HAS 32,000 MILES ON IT, I PURCHASED IT USED.  I HAVE HAD A PROBLEM WHERE SOMETIMES I WOULD SMELL BURNING ODOR FROM THE VENTS.  I THINK CAR RUNS VERY RUFF AND IM NOT SURE WHAT IT IS.. I BELIEVE IT'S THE TRANSMISSION FROM READING ALL THE POST ON HERE.. AND ALSO THE SHIFTING IS ROUGH.  I WILL BE TAKING IT TO A DEALER SOON.. HOPEFULLY THEY WONT GIVE ME THE RUN AROUND AND FIX THE PROBLEM RIGHT AWAY.. THANKS!  *NM",
        "vin": "JA3AJ86E33U"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "09/26/2005",
        "dateOfIncident": "08/10/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10137550,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MITSUBISHI MOTORS WILL NOT ACCEPT LIABILITY AND PAY TO HAVE A FAILURE OF A FACTORY WELD REPAIRED ON THE RIGHT FRONT ENGINE CROSS MEMBER OF MY 2003 MITSUBISHI MONTERO WHICH IS STILL UNDER THE FACTORY WARRANTY. MY INSURANCE ADJUSTER HAS SUBMITTED A LETTER INFORMING MITSUBISHI'S VEHICLE DEPARTMENT THAT THE DAMAGE TO MY VEHICLE IS DUE TO FAILURE FROM IMPROPER WELDING. I HAVE ALSO BEEN INFORMED BY A CERTIFIED BODY SHOP THAT THE PART WAS NOT WELDED PROPERLY. MITSUBISHI HAS REFUSED TO PARTICIPATE IN REPAIRING THE VEHICLE SINCE AUGUST 12, 2005.  *JB",
        "vin": "JA4NW51S73J"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "04/28/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10135958,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: 2003 MITSUBISHI GALANT - THE CAR STRUGGLES TO CHANGE GEARS. A NEW ENGINE WAS PLACED IN THE CAR, AND VEHICLE  WAS STILL HAVING PROBLEMS WITH SHAKING. INFORMATION ON  SERVICE PROVIDED WITHIN SIX MONTHS OF PURCHASE.  HAD PROBLEMS WITH THE ENGINE - DIAGNOSIS WITH ENGINE CYCLE MISFIRED AND FAULTY SPARK PLUGS. EVERY FOUR TO SIX MONTHS THERE WERE MAJOR PROBLEMS  WITH ENGINE. . ON 4/28/03 ENGINE SERVICE LIGHT CAME ON, INDICATING ENGINE MISFIRED.   REPLACED PISTON AND ENGINE  HEAD. 9/1/04 SPARKS PLUG FAILED, AND CYLINDER MISFIRED. ON 9/10/04 THE ENGINE WAS REPLACED. 12/17/04 ALL DASHBOARD LIGHTS REPLACED. 3/28/05 DIAGNOSED AND REPLACED HOT WATER VALVE. ON  9/2/05 CRANK CASE SENSOR REPLACED.   *AK",
        "vin": "4A3AA46G53E"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/05/2005",
        "dateOfIncident": "07/13/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10131750,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT:  THE CONSUMER STATED THE VEHICLE WAS HANDLING POORLY.  WHEN  HITTING A BUMP IT FELT LIKE ONE WAS  RIDING ON A WAVE.  THE VEHICLE FELT LIKE THE WEIGHT WAS BEING TOSSED TOO MUCH.  IT BOUNCED WHEN HITTING A BUMP, AND IT LEANED WHEN  TURNING.  BEFORE THIS IT CAUSED THE CONSUMERS DAUGHTER TO GET  HER  SHOE STUCK UNDER THE BRAKE PEDAL.  THE CONSUMER CONTACTED A MECHANIC ,THEY TOLD HER THAT THE STRUTS WERE BAD.  SHE WAS WAITING TO HAVE THEM REPLACED.  THERE WERE NO OTHER KNOWN PROBLEMS WITH THE VEHICLE AT THIS TIME.  *AK  THE REAR STRUTS WERE REPLACED AS WELL. UPDATED 12/07/05.*JB",
        "vin": "4A3AA46G83E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/17/2005",
        "dateOfIncident": "12/14/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10129014,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 MONTERO SPORT XLS--- STUDDERS/JERKS AT 30+ MPH WHILES DRIVING DOWN THE RD, HAS BEEN IN SHOP 9 TIMES",
        "vin": "JA4MT21H23J"
    },
    {
        "components": "POWER TRAIN",
        "crash": true,
        "dateComplaintFiled": "06/02/2005",
        "dateOfIncident": "01/03/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10123889,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ACCELERATOR \"STUCK\" & VEHICLE REMAINED IN IDLE, FORCING TO CRASH",
        "vin": "JA4LZ41G23U"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "03/30/2005",
        "dateOfIncident": "02/01/2005",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10115042,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE BRAKES SQUEAK VERY BADLY.  CONSUMER TOOK THE VEHICLE TO THE REPAIR SHOP.  SHE WAS TOLD THAT THE AIR PRESSURE WAS VERY LOW AND THAT THIS COULD HAVE BEEN CAUSED BY MOISTURE. *AK  *NM",
        "vin": "4A3AA46G13E"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "03/08/2005",
        "dateOfIncident": "02/12/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109312,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER COMPLAINED ABOUT A  HEAT PROBLEM. WITH THE HEAT. WHILE DRIVING, THE HEAT BLEW OUT FROM THE VENTS IN THE TOP OF THE DASHBOARD,  BUT WHEN DIRECTING IT TO THE FLOOR, IT DID NOT COME OUT OF THE LOWER PORTION OF THE VEHICLE. CONSUMER WAS TOLD THAT THIS WAS NORMAL.   *AK  CONSUMER ADDED THAT WITH THE CONTROL KNOB ON OFF POSITION, AIR OR HEAT CAMED OUT FROM THE VENT.    *TT",
        "vin": "4A3AA46G03E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "03/02/2005",
        "dateOfIncident": "07/12/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10109467,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IS DEFECTIVE. THE GEARS DO NOT CONNECT LIKE THEY SHOULD.  SOMETIMES THE GEARS DO NOT RESPOND AT ALL.*AK  THE CONSUMER STATED THAT THE AUTOMATIC TRANSMISSION DOES NOT SHIFT SMOOTHLY FROM 2ND TO 3RD GEAR.  THE VEHICLE WAS CHECKED BY THE DEALER BUT THE PROBLEM WAS NOT FIXED.  *TC",
        "vin": "4A3AA46GX3E"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/17/2004",
        "dateOfIncident": "07/02/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10100086,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THERE IS A ROTTEN EGG SMELL, ALL THE TIME. I'VE TAKEN IT IN TO THE DEALER 3 PLUS TIMES, AND EACH TIME THEY TELL ME THERE IS NOTHING WRONG, AND THAT I AM USING CHEAP GAS.  THEY SUGGUESTED CHANGING GAS STATIONS.  IT STILL SMELLS NO MATTER WHERE I GET THE GAS.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "11/15/2004",
        "dateOfIncident": "08/06/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098895,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "DIAMOND CARE",
                "productModel": "DIAMOND CARE",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "BRAKES VIBRATE WHEN APPLIED. I HAVE RETURNED MY '03 DIAMONTE FOUR TIMES FOR REPAIRS AND EACH TIME THEY STATE THAT THE ROTORS WERE  WARPED AND EITHER REPLACED OR MACHINED THEM. BRAKES ARE NOW VIBRATING AGAIN AND WILL NEED TO BE RETURNED FOR REPAIR OR REPLACEMENT. WIND NOISE COMING FORM THE DRIVERS SIDE WINDOW. WINDOW ADJUSTMENTS WERE MADE THREE TIMES STILL HAVING NOISE PROBLEMS. RETURNED THREE TIMES TO HAVE LUMBAR SUPPORT SWITCH REPLACED. *AK",
        "vin": "6MMAP87P13T"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "11/13/2004",
        "dateOfIncident": "09/01/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10098795,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Goodyear Tire & Rubber Company",
                "productMake": "GOODYEAR",
                "productModel": "EAGLE LS",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "EAGLE LS KEEPS LOSING TIRE PRESSURE (ABOUT 10PSI) EVERY 5-7 DAYS.  HAVE WENT TO THE MITSUBISHI DEALERSHIP 4 TIMES NOW FOR THE PROBLEM AND THEY SAID TO GO SEE A GOODYEAR SERVICE CENTER.  GOODYEAR SAYS THE TIRE JUST NEEDS AIR AND IT'S OK.  THIS CANNOT BE SAFE IF THE TIRE IS CONTINUALLY LOSING AIR PRESSURE IN SUCH A SHORT TIME FRAME. *JB",
        "vin": ""
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/11/2004",
        "dateOfIncident": "11/08/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10098657,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIRBAGS DIDN'T DEPLOY IN MY 2003 GALANT ES.  I HIT A STOPPED VEHICLE, WHILE MOVING APPROXIMATELY 25 MPH, HEAD-ON INTO THE PASSENGER SIDE OF THE OTHER CAR. *JB",
        "vin": "4A3AA46G33E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/16/2004",
        "dateOfIncident": "09/16/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091132,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 GALANT THAT I PURCHASED USED AT 16000 MILES. I HAVE HAD IT FOR ONLY 6 MONTHS AND HAVE PUT 5000 MILES ON IT. RIGHT AFTER I BOUGHT IT THE BRAKES STARTED SQUEALING PULSING. I TOOK IT INTO THE DEALERSHIP WHO SAID THERE WAS NOTHING WRONG WITH THE BRAKES. THEY CONTINUED TO GET WORSE SO I HAD THEM INSPECT THEM AT THE DEALERSHIP AGAIN WITH MY 2ND OIL CHANGE. THEY SAID I NEEDED ALL NEW BRAKES. HOW COULD I NEED ALL NEW BRAKES IN LESS THAN 3000 MILES? THERE IS SOMETHING WRONG HERE. I WON'T PAY THEM THE  300.00 THEY WANT FOR THIS. I WILL TAKE IT SOMEWHERE ELSE AND HAVE IT DONE CHEAPER, BUT I DON'T THINK I SHOULD BE OUT ANY MONEY AT ALL FOR WHAT SEEMS TO BE A DEFECT.   *JB",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "07/23/2004",
        "dateOfIncident": "07/01/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10083756,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE REAR BRAKE CYLINDERS ON THE 2003 MITSUBISHI GALANT ARE LEAKING.   *MR   *SC  *JB",
        "vin": "4A3AA46G93E"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "06/21/2004",
        "dateOfIncident": "06/21/2004",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079562,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE ACCELERATOR IS DEPRESSED GAS PEDAL INTERMITTENTLY STICKS OR VEHICLE  WON'T MOVE.  DEALER INSPECTED VEHICLE AND COULD NOT REPRODUCE OR CORRECT THE PROBLEM.*AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "04/08/2004",
        "dateOfIncident": "12/12/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10052236,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE BRAKE PEDAL WAS APPLIED, THEY FAILED TO RESPOND WHICH CAUSED THE CONSUMER TO HIT A GUARDRAIL. *AK THE VEHICLE WAS SERVICED IN AUG OF 2003 AND THE CONSUMER WA TOLD THE ROTORS WERE BAD. THREE MONTHS LATER THE ROTORS WENT BAD AGAIN AND THE DEALER MACHINED THEM AND TWO DAYS LATER THE ACCIDENT OCCURRED. THE CONSUMER STATED THE AIR BAGS DID NOT DEPLOY. *JB",
        "vin": "4A3AA46G33E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/14/2004",
        "dateOfIncident": "01/13/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058170,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE LIFTERS ARE KNOCKING. AND AFTER 3 ATTEMPS IT HAS YET TO BE FIXED. I HAVE BEEN WAITING A WEEK NOW TO HEAR FROM THE DEALERSHIP. THEY SAID THEY DO NOT KNOW WHAT TO DO NOW. THEY ARE WAITING FOR A FACTORY REP. TO CALL. HALF THE MOTOR HAS BEEN REPLACED. THEY HAVE ALREADY REPLACED THE WHOLE VALVE TRAIN.*AK",
        "vin": "4A3AA46G43E"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "12/25/2003",
        "dateOfIncident": "12/15/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10051103,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAD PURCHASED A NEW MITSUBISHI GALLANT 2003 TWO WEEKS BEFORE BEING INVOLVED IN A HIT AND RUN FROM THE REAR ON THE HIGHWAY. BECAUSE I WAS STRUCK FROM THE REAR, MY SEAT MUST HAVE JOLTED AND ULTIMATELY BROKE SO THAT I WAS IN THE LAY DOWN POSITION. IF I HAD SOMEONE IN MY BACKSEAT, I WOULD'VE CRUSHED THEIR LEGS. IF I WERE ON A CITY STREET WITH ONLY ONE HAND ON THE WHEEL (AS MOST PEOPLE DRIVE THESE DAYS) I COULD'VE HURT MYSELF MORE SERIOUSLY OR SOMEONE ELSE. THIS SEEMS LIKE IT'S A MAJOR ISSUE AND SHOULD BE ADDRESSED. NOT SAFE. I WILL NEVER PURCHASE ANOTHER MITSUBISHI PRODUCT AGAIN IN MY LIFE. I HAVE NO FAITH IN THIS PRODUCT.   *LA",
        "vin": ""
    },
    {
        "components": "AIR BAGS,SEATS",
        "crash": true,
        "dateComplaintFiled": "10/16/2003",
        "dateOfIncident": "09/06/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 2,
        "odiNumber": 10044134,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE WAS INVOLVED IN A FOUR CAR PILE UP. DURING THE COLLISION,  VEHICLE WAS STRUCK FROM THE REAR AND  FRONT, AND AIR BAGS DEPLOYED.   REAR SEAT PASSENGER HIT THE FRONT PASSENGER'S SEAT, CAUSING IT TO BREAK.  FRONT SEAT PASSENGER SUSTAINED MASSIVE BRAIN DAMAGE AND BLOOD CLOTS.  THE PASSENGER IN THE REAR SEAT SUSTAINED A COMPOUND FRACTURE TO THE RIGHT ARM.  *AK",
        "vin": "4A3AA46G73E"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/03/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042291,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLES BRAKES SQUEAKED WHEN THEY WERE APPLIED. THE VEHICLE WAS TAKEN TO THE DEALER WHO DETERMINED THAT THE BRAKES WERE  FINE AND THAT IT WAS NORMAL FOR THE BRAKES TO SQUEAK.   PLEASE DESCRIBE FURTHER.   *NLM",
        "vin": "4A3AA46C23E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "09/12/2003",
        "dateOfIncident": "06/09/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10040162,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "POTENTIAL SAFETY HAZARD REGARDING 2003 MITSUBISHI GALANT.*MR  THE CONSUMER BELIEVES THE VEHICLE'S TRANSMISSION WAS SLIPPING.  THE VEHICLE WAS TAKEN TO THE DEALER AND REPAIRS WERE MADE.  TEN DAYS AFTER REPAIRS THE TRANSMISSION BEGAN TO SLIP AGAIN.  *NM",
        "vin": "4A3AA46H93E"
    },
    {
        "components": "SEATS",
        "crash": true,
        "dateComplaintFiled": "08/31/2003",
        "dateOfIncident": "08/23/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10036952,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHAED A MITSUBISHI GALANT 2003 ON 8/19/03 FROM JIM HUDSON MITSUBISHI.  ON 8/23/2003 I WAS HIT IN THE REAR BY A MINI VAN.  THE FRONT SEATS OF THE GALANT SLID BACK AND THE SEATS WERE BROKEN.  SO MYSELF AND THE DRIVER WERE FLAT ON OUR BACKS IN THE GALANT. JUST THOUGHT THIS WAS SOMETHING THAT CONSUMERS SHOULD KNOW.  THE SEATS SHOULD NOT HAVE BROKEN AND WENT BACK THE WAY THEY DID.*AK",
        "vin": "4A3AA46G23E"
    },
    {
        "components": "SEATS",
        "crash": false,
        "dateComplaintFiled": "08/15/2003",
        "dateOfIncident": "07/22/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10032879,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RENTED A CAR AND THE DRIVER SEAT KEPT SLIDING BACK.  IT WOULD NOT LATCH INTO PLACE.  IT OCCURRED MOST WHEN PRESSING ON THE BRAKE PEDAL.  *AK",
        "vin": "4A3AA46G63E"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "07/30/2003",
        "dateOfIncident": "07/12/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030476,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN THE CAR IS WARMED UP AND THE AIR CONDITIONING IS TURNED ON THE AIR BLOWING OUT ON THE FLOOR AREA IS MUCH WARMER THAN THE AIR BLOWING OUT IN THE UPPER AREA OF THE CAR. IN ORDER TO GET COOL AIR TO COME OUT ON THE FLOOR AREA, YOU HAVE TO USE ONE OF THE LAST TWO COLD AIR CONDITIONING SETTINGS. THE PROBLEM WITH THIS SETTING IS THAT THE AIR BLOWING OUT IN THE UPPER AREA OF THE CAR IS EXTREMELY COLD. TWO DIFFERENT DEALERSHIP SERVICE DEPARTMENTS HAVE CHECKED THE CAR AND THEY REPORTED THAT THIS IS THE NORMAL OPERATION OF THE CAR.",
        "vin": "4A3AA46H53E"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/22/2003",
        "dateOfIncident": "07/20/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10028783,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "MITSUBISHI",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I AM DRIVING A RENTED MITSUBISHI PROTOGE'. YESTERDAY I REACHED DOWN TO PICK UP A BOTTLE OF WATER FROM THE RECEPTACLE BY THE DASH. AS I REACHED, I ACCIDENTLY BRUSHED THE GEAR SHIFT LEVER ( AUTOMATIC TRANSMISSION ) AND THE GEAR SHIFT POPPED INTO NEUTRAL.  I PULLED OUT OF TRAFFIC AND TRIED THIS AGAIN. SAME RESULT. JUST BUMPING THE GEAR SHIFT SENT IT INTO NEUTRAL.  I FEEL THAT THIS REPRESENTS THE POSSIBILITY OF A SERIOUS SAFETY HAZARD. IF IT WERE TO OCCUR IN HEAVY TRAFFIC OR IN ADVERSE WEATHER CONDITIONS, ACCIDENTS COULD OCCUR.  *AK",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,FUEL SYSTEM, GASOLINE,POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/01/2003",
        "dateOfIncident": "06/09/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025249,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "WAGNER ELEC. BRAKE/CLUTCH",
                "productMake": "WAGNER",
                "productModel": "BRAKE/CLUTCH",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "I HAVE A '03 MITSUBISHI GALANT (AUTOMATIC) WHICH NOW HAS APPROX 8000 MILES.  AT APPROX. 4500 MILES THE VEHICLE BEGAN HESITATING UPON HARD ACCELERATION, SUCH AS WHEN ENTERING A FREEWAY.  THE VEHICLE ALSO HESITATES WHILE DRIVING IN \"STOP AND GO\" TRAFFIC, SUCH AS WHAT IS DONE WITH IN-TOWN DRIVING IN TRAFFIC.  AT FIRST I BELIEVED I HAD FILLED THE GAS TANK WITH BAD GASOLINE.  THE VEHICLE ACTED LIKE IT HAD A CLOGGED FUEL FILTER/LINE.  I CONTINUED DRIVING THE VEHICLE WHILE TRYING TO FIGURE OUT WHAT WAS WRONG.  A WARNING LIGHT FINALLY CAME ON AND I TOOK THE VEHICLE IN TO THE DEALER WHERE I PURCHASED IT ON 6/9/03.  I WAS INFORMED THAT THERE WAS A PROBLEM WITH THE TRANSMISSION.  THE DEALER KEPT THE VEHICLE FOR APPROX 3 WEEKS TO MAKE THE REPAIRS.  DIAGNOSIS:  INTERNAL TRANS FAILURE UPON INSPECTION FOURND 4TH GEAR CLUTCH PAST CLEARANCE OUT OF SPEC AND CLUTCHES BURNED.  REPLACED 4TH GEAR CLUTCHES AND RESET SNAP RING CLEARANCE.  INSP 2ND BRAKE PISTON AND REPLACED O-RINGS.  REMOVED VALVE BODY.  INSP AND FOUND CHECK BALL WEARING THROUGH SEPARATOR PLATE.  REPLACED VALVE BODY SEPARATOR PLATE.  REPLACE SEAL FROM VALVE BODY TO 2ND BRAKE.  I PICKED UP MY VEHICLE 6/27/03.  AFTER DRIVING FOR ONE DAY, I AM EXPERIENCING THE SAME PROBLEMS.  MY CONCERN IS THAT THIS IS A SAFETY HAZARD.  WHEN TRYING TO GET ONTO A FREEWAY AND/OR MANUEVERING THROUGH IN TOWN TRAFFIC, THIS VEHICLE IS POSING A HAZARD FOR MYSELF AND/OR OTHER DRIVERS. I WILL RETURN THE VEHICLE TO THE DEALER AS SOON AS I DETERMINE WHAT MY OPTIONS ARE.  PLEASE FEEL FREE TO CONTACT ME IF THERE ARE ANY QUESTIONS OR TO LET ME KNOW IF I NEED TO REPORT THIS TO ANOTHER AGENCY.  THANKS.  *AK",
        "vin": "4A3AA46H93E"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "02/06/2003",
        "dateOfIncident": "01/08/2003",
        "fire": false,
        "manufacturer": "Mitsubishi Motors North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10005435,
        "products": [
            {
                "manufacturer": "Mitsubishi Motors North America, Inc.",
                "productMake": "MITSUBISHI",
                "productModel": "GALANT",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN EVER I CRANK THE CAR UP IN THE MORNING OR AFTERNOON AFTER THE CAR SITS  FOR A WHILE THE EXHAUST SMELLS LIKE BAD EGGS. THE RADIO/CD WAS REPLACE THREE TIMES ALREADY AND THE CD PLAYER STILL SOUNDS STATICTY  WHEN PLAYIND DISC AND THE SPEAKERS POP WHEN THE RADIO IS COMPLETELY OFF. ALSO WHEN EVER SOME GETS IN AND OUT OF THE CAR THEY GET SHOCKED BY IT TO THE POINT WHERE U CAN ACTUALLY SEE THE SPARK FROM THE SHOCK. AND WHEN THE CAR IS JUST SITING RUNNING U CAN FEEL THE CAR SHAKE LIKE IT IS ABOUT TO CUT OFF.",
        "vin": "4A3AA46GX3E"
    }
]