[
    {
        "components": "SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "08/29/2021",
        "dateOfIncident": "08/28/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11430903,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "Emergency Parking Brake lock",
        "vin": "1N6ED29X93C"
    },
    {
        "components": "STEERING,POWER TRAIN,WHEELS",
        "crash": false,
        "dateComplaintFiled": "09/10/2020",
        "dateOfIncident": "08/13/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11354222,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEEL BEARINGS KEEP BACKING OFF SPOKE WITH OTHER PEOPLE WHO OWN A FRONTIER AND THEY HAVE SAME PROBLEM THIS IS A SAFTEY ISSUE HAVE TO TIGHTEN THEM REGULARLY",
        "vin": "1N6ED26Y73C"
    },
    {
        "components": "AIR BAGS,STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "05/03/2020",
        "dateOfIncident": "04/10/2020",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11323109,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS RECENTLY INVOLVED IN A FRONTEND COLLISION IN MY 2003 NISSAN FRONTIER AND NEITHER AIRBAG DEPLOYED.  I WAS ACCELERATING FROM A STOP SIGN ON A FARM TO MARKET  ROAD.   DENISON TX.",
        "vin": "1N6ED27T33C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/02/2020",
        "dateOfIncident": "12/28/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11296729,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS IN AN ACCIDENT ON 12/28/19 AND BOTH OF MY AIRBAGS DEPLOYED.  THE DRIVERS SIDE HOWEVER DID NOT BLOW UP ENOUGH TO HELP ME OR EVEN CONTACT ME AT ALL AND I SUFFERED A CONCUSSION.  I WAS TRAVELING ABOUT 20 MPH ON A CITY STREET WHEN A DRIVER PULLED OUT RIGHT IN FRONT OF ME AND WE COLLIDED.",
        "vin": "1N6ED26Y63C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "12/08/2018",
        "dateOfIncident": "12/05/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11157049,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "OUT. VEHICLE HAS SEVERE RUST CORROSION FROM THE BACK CAB BREAK LIGHT. IT LOOKS LIKE THE SEAL AROUND THE LIGHT WAS COMPROMISED AND CAUSES MOISTURE TO SEEP IN AND LEAK THROUGH THE ROOF. IT LOOKS AS IF IT IS RUSTING FROM THE INSIDE",
        "vin": "1N6ED26Y43C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/02/2018",
        "dateOfIncident": "08/09/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11091387,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "IN 2014 MY SON WAS INVOLVED IN AN ACCIDENT ON A HIGHWAY IN WHICH THE AIRBAG DEPLOYED AND THE SHRAPNEL FROM THE AIRBAG CUT HIS FACE TERRIBLY.  HE REQUIRED HOURS OF PLASTIC SURGERY AND STILL SUFFERS THE EFFECTS OF IT.  PLEASE HELP.  THE AIRBAG SHOULD NOT HAVE DONE THIS TO HIS FACE!",
        "vin": "1N6ED27T03C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/02/2018",
        "dateOfIncident": "08/09/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 11091417,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TAKATA RECALL:  MY SON WAS INVOLVED IN A MOVING HIGHWAY ACCIDENT WHERE THE AIRBAG DEPLOYED, SENDING SHRAPNEL TO HIS FACE AND CAUSING NUMEROUS DEEP LACERATIONS.  HE REQUIRED HOURS OF PLASTIC SURGERY AND STILL SUFFERS THE EFFECTS OF THE INJURY. PLEASE DO SOMETHING.  THE AIRBAG SHOULD NOT HAVE CAUSED THIS MUCH DAMAGE TO HIS FACE!",
        "vin": "1N6ED27T03C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "07/25/2017",
        "dateOfIncident": "07/25/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11010549,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TOP OF THE GAS TANK IS COMPLETELY RUSTY AND IS EMITTING GAS FUMES.   IF YOU LOOK AT THE GAS TANK UNDER THE TRUCK YOU CAN SEE GAS STAINS.   HAD MY TRUCK IN THE SHOP AT MY LOCAL MECHANIC AND HE DID A SMOKE TEST AND SHOWS THE SMOKING COMING FROM THE TOP OF THE TANK WHERE ALL THE RUST IS.  THERE'S A RECALL ON THE TRUCK FOR THE PREVIOUS YEAR BUT MINE IS A COUPLE OF MONTHS OFF.  I FIND IT HARD TO BELIEVE THIS ISSUE WAS FIXED.   YOU CAN READ ABOUT IT ALL OVER THE INTERNET.    HTTP://TUNFS.YUKU.COM/TOPIC/6458/RUSTED-GAS-TANK#.WXEO8OJYSDU  HTTP://WWW.CLUBFRONTIER.ORG/FORUMS/F46/FUEL-TANK-WHERE-BUY-88558/    SEARCH BOTH OF THOSE SITES AND YOU'LL SEE ALL THE COMPLAINTS.      MY 15 MONTH OLD SON SITS ABOUT THE TANK AND ITS REALLY TROUBLING TO THINK NISSAN WOULD LET THIS CONTINUE WITH ALL THE COMPLAINTS ON THE INTERNET.      ID BE MORE THAN HAPPY TO GIVE YOU THE LOCAL MECHANICS INFORMATION AND YOU CAN TALK TO HIM DIRECTLY.",
        "vin": "1N6MD27Y73C"
    },
    {
        "components": "SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "07/14/2017",
        "dateOfIncident": "07/14/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11005262,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE ABS DOES NOT FUNCTION CORRECTLY. WHILE MOVING FORWARD, FAST OR SLOW, ON WET OR ICY (SLICK) PAVEMENT, WHEN BRAKES ARE APPLIED FORCEFULLY THE ABS DOES NOT WORK, BRAKES FAIL, AND A CLICKING NOISE IS HEARD (AS IF ABS IS NOT FULLY ENGAGING). THIS HAS OCCURRED SINCE PURCHASED NEW IN 2003. HAVE HAD SERVICE MANY TIMES AND MENTIONED THIS PROBLEM. DEALER SAYS THEY FIND NO PROBLEM.",
        "vin": "1N6DD26T73C"
    },
    {
        "components": "WHEELS",
        "crash": false,
        "dateComplaintFiled": "01/20/2017",
        "dateOfIncident": "01/20/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10946612,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A NEW SOUND WHICH I THOUGHT MIGHT BE A STUCK CALIPER, YESTERDAY. THIS MORNING I DROVE TO MY AUTO GARAGE TO GET IT CHECKED AND JUST AFTER LEAVING THE HIGHWAY AND A BLOCK BEFORE THE GARAGE THE DRIVER SIDE WHEEL FELL OFF! THE GARAGE CHECKED IT REPLACED THE LUG NUTS WHICH HAD ALL LOOSENED SPONTANEOUSLY AND FALLEN OFF. THE VEHICLE WAS MOVING AT A WALKING PACE, TURNING TO THE LEFT WHEN THE WHEEL SEPARATED.  *TR",
        "vin": "1N6ED26Y03C"
    },
    {
        "components": "SUSPENSION",
        "crash": true,
        "dateComplaintFiled": "04/27/2016",
        "dateOfIncident": "03/23/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10861752,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNED A 2003 NISSAN FRONTIER. WHILE DRIVING 30 MPH, THE CONTACT HEARD AN ABNORMAL NOISE AND THOUGH IT WAS DUE TO A FLAT TIRE. THE CONTACT COASTED OVER TO THE SIDE OF THE ROAD AND NOTICED ALL THE TIRES WERE NORMAL. THE CONTACT CONTINUED TO DRIVE AND THE REAR OF THE VEHICLE DETACHED. THE CONTACT LOST CONTROL OF THE VEHICLE. THE VEHICLE FLIPPED OVER AND CRASHED INTO A DITCH. THE CONTACT NOTICED THAT THE LEAF SPRING FRACTURED, PULLING ALL CABLES AND CAUSED THE REAR END TO DETACH. THE CONTACT WAS NOT INJURED. A POLICE REPORT WAS FILED. THE VEHICLE WAS DESTROYED AND TOWED TO THE CONTACT'S RESIDENCE. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 135,000.",
        "vin": "1N6ED26Y13C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/29/2016",
        "dateOfIncident": "02/01/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10839097,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEHICLE HAS SEVERE RUST CORROSION FROM THE BACK CAB BREAK LIGHT. IT LOOKS LIKE THE SEAL AROUND THE LIGHT WAS COMPROMISED AND CAUSES MOISTURE TO SEEP IN AND LEAK THROUGH THE ROOF. IT LOOKS AS IF IT IS RUSTING FROM THE INSIDE OUT.",
        "vin": "1N6ED29Y23C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/30/2014",
        "dateOfIncident": "01/24/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10617573,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL * THE CONTACT OWNS A 2003 NISSAN FRONTIER. WHILE MAKING A RIGHT TURN AT AN UNKNOWN SPEED, THE CONTACT HEARD A LOUD CRANKING NOISE. THE DEALER STATED THAT THE STEERING PLATE WAS EXTREMELY LOOSE. THE STEERING STOPS WERE LUBED AND THE SHAFT WAS CLEANED MULTIPLE TIMES, BUT THE FAILURE PERSISTED. THE DEALER STATED THAT THE STEERING SHAFT NEEDED TO BE REPLACED, BUT FURTHER APPROVAL WAS REQUIRED FROM THE MANUFACTURER TO DETERMINE IF THE PART WAS AVAILABLE TO PERFORM THE REPAIR. THE CONTACT WAITED BUT DID NOT HEAR BACK FROM THE DEALER. THE VIN WAS NOT INCLUDED IN NHTSA CAMPAIGN NUMBER: 10V554000 (STEERING). THE VEHICLE WAS NOT REPAIRED AND THE MANUFACTURER WAS NOTIFIED. THE APPROXIMATE FAILURE MILEAGE WAS 112,909.",
        "vin": "1N6DD26T93C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/04/2013",
        "dateOfIncident": "10/30/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10550828,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN FRONTIER. THE CONTACT STATED WHILE DRIVING VARIOUS SPEEDS, HE CONTINUOUSLY HAD A HEADACHE. THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE TECHNICIAN VERIFIED THAT FUEL FUMES WERE EMITTED INTO THE VEHICLE. AS RESULT, THE FUEL TANK NEEDED TO BE REPLACED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 105,000.",
        "vin": "1N6ED29Y73C"
    },
    {
        "components": "SUSPENSION,WHEELS,SERVICE BRAKES",
        "crash": false,
        "dateComplaintFiled": "10/19/2013",
        "dateOfIncident": "10/11/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10548505,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HEARD A SUDDEN THUD AND THEN A GRINDING NOISE COMING FROM THE REAR END AS IF A BRAKE HAD HUNG UP,METAL TO METAL.WHEN I EXITED THE VEHICLE THERE WAS SMOKE COMING FROM THE REAR OF THE VEHICLE AND A VERY STRONG SMELL OF OVERHEATING OF THE BRAKES OR METAL AND FLUID.UPON PULLING THE WHEELS,OUR COMPANY MECHANIC FOUND NOTHING OF THE SORT TO BE WRONG. I CALLED A FRIEND TO HAVE THE VEHICLE TRAILER-ED TO MONRO MUFFLER AND BRAKE IN MANSFIELD PA,WHERE IT WAS DETERMINED THE BEARINGS HAD FAILED IN THE REARS,BOTH INNER AND OUTER. NISSAN USA DETERMINED THAT MY VIN # DID NOT FALL INTO THE RECALL CAMPAIGN EVEN THOUGH IT FELL WITHIN THE SAME MAKE,MODEL AND YEAR WITHIN RECALL CAMPAIGN #02V299000! NISSAN ADVISED ME TO TAKE THE TRUCK TO WILLIAMS NISSAN IN SAYRE PA AND HAVE IT DIAGNOSED THERE. I HAD PREVIOUSLY CALLED THEM BEFORE CONTACTING NISSAN USA WHERE THEY HAD ALREADY ADVISED ME OF THE VIN # NOT BEING WITHIN THE RECALL CAMPAIGN. THERE IS NO DOUBT THAT AN ACCIDENT COULD HAVE OCCURRED IF NOT A FIRE OR BOTH! THIS CAME WITH ABSOLUTELY NO WARNING IN THE VERY EARLY MORNING ON MY WAY TO WORK. I WOULD ADVISE ANYONE WHO OWNS THESE MAKE,MODEL AND YEARS TO HAVE THIS CHECKED AND REPAIRED. I CANNOT BELIEVE NISSAN WOULD NOT TAKE RESPONSIBILITY IN SUCH AN EXACT CASE AS THIS PARTICULAR RECALL STATES. IN ESSENCE THIS DOES START WITH THE ABS BRAKING SYSTEM AND SEALS AS MONRO TOLD ME THE SEALS HAD FAILED!  *TR",
        "vin": "1N6MD27Y03C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/13/2013",
        "dateOfIncident": "01/09/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543432,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BOUGHT TRUCK NEW IN 2003 ORIGINAL OWNER.  AT 36433 MILES CHECK ENGINE LIGHT CAME ON WAS TOLD FUEL TANK WAS RUSTED OUT NEEDED NEW TANK WHICH WAS REPLACED UNDER EXTENDED WARRANTY.  AT 91989 MILES CHECK ENGINE LIGHT AGAIN COMES ON.  WAS TOLD FUEL TANK/EVAP CANISTER VALVE/EVAP CONTROL SYSTEM NEEDED REPLACED AGAIN.  AGAIN DONE UNDER EXTENDED WARRANTY.  AT 120,608 MILES (28589 MILES LATER) CHECK ENGINE CAME ON AGAIN.  TOOK TO NISSAN DEALER AGAIN FOR DIAGNOSTIC CHECK AND AM TOLD THAT THERE IS CORROSION AGAIN ON THE FUEL TANK AROUND SENDING UNIT.  MAY NEED ANOTHER FUEL TANK, BUT NEED TO DROP TANK AND SEE HOW BAD IT IS.  EXTENDED WARRANTY IS EXPIRED AT THIS POINT AND THE CHARGE WOULD BE UP TO ME.  I WAS TRYING TO WORK WITH NISSAN TO REPLACE THIS TANK IF NEED BE.  I UNDERSTAND THAT IT IS AN OLDER TRUCK, BUT IT IS GARAGE KEPT AND NEVER OFF ROAD IN EXCELLENT SHAPE.  THEY WANT ME TO TAKE IT AND HAVE THE TANK DROPPED AT MY EXPENSE.  IF IT TURNS OUT TO BE THE TANK THEY WILL THEN DECIDE WHAT THEY MIGHT PAY IF ANY.  THEY ARE CALLING IT A GOOD WILL DECISION.  I NEED A DEFINITE ANSWER FROM THEM ON HOW MUCH THEY WILL PAY BEFORE I DO THIS AND THEY WON'T DO THAT.  MY THEORY IS THAT IF THIS TURNS OUT TO BE YET ANOTHER RUSTED FUEL TANK WHICH WILL MAKE THE FOURTH ONE THEY SHOULD HAVE A RECALL ON THESE.  I HAVE TWO OTHER FRIENDS WITH NISSAN FRONTIERS 2002, AND 2003 WITH THE SAME PROBLEM.  I BELIEVE THAT THIS IS NOT AN ISOLATED PROBLEM FOR I HAVE GOOGLED THIS AND FOUND THOUSANDS OF COMPLAINTS ABOUT RUSTED FUEL TANKS ON THESE YEARS AND MAKE OF NISSAN.  I AM A 66 YEAR OLD MAN, AND HAVE NEVER IN ALL MY YEARS OF OWNING AN AUTOMOBILE EVER HAD TO REPLACE A FUEL TANK BECAUSE IT WAS RUSTED OUT, LET ALONE 4 OF THEM.  SOMETHING NEEDS TO BE DONE, AND NISSAN NEEDS TO STEP UP AND ADDRESS THIS PROBLEM ONCE AND FOR ALL.  *TR",
        "vin": "1N6ED27Y13C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/28/2013",
        "dateOfIncident": "06/28/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10522330,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE JUST OVER 100,000 MILES ON MY 2003 TRUCK.  I HAVE BEEN FIGHTING RUST ISSUES ALL OVER THE RIG FOR THE PAST FIVE YEARS.  I WASH AND CLEAN MY TRUCK EACH WEEK AND POLISH TWICE A YEAR.  I DO LIVE NEAR THE BEACH, BUT I UNDERSTAND THIS, AND BEING A AIRCRAFT MECHANIC BY TRADE, WORKING WITH AIRCRAFT ON SHIPS AT SEA, KNOW HOW TO PROPERLY SERVICE MY EQUIPMENT.  THE RUST COMES OUT UNDER THE PAINT, ALONG THE REAR CAB BRAKE LIGHT, AND ALONG THE FRONT WIND SHIELD, PASSENGER SIDE.  THE RIG HAS NEVER BEEN IN AN ACCIDENT AND SINCE I'M RETIRED AND I BOUGHT THE TRUCK NEW, I HAVE TAKEN GOOD CARE OF IT.  NISSAN REFUSES TO DEAL WITH THE ISSUE, AND I BELIEVE THE PAINT SYSTEM THEY USE NEEDS SERIOUS UP GRADING.  *TR",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "04/10/2012",
        "dateOfIncident": "06/16/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10454713,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN FRONTIER. WHILE OPERATING THE VEHICLE, THE CONTACT NOTICED THAT THE CHECK ENGINE LIGHT ILLUMINATED. THE VEHICLE WAS TAKEN TO THE DEALER, WHERE THE FUEL TANK WAS REPLACED DUE TO ITS STRAPS RUSTING THROUGH. THE FAILURE MILEAGE WAS 78,000 AND THE CURRENT MILEAGE WAS 80,000.  UPDATED 05/11/12*LJ  THE CONSUMER STATED THE GAS TANK SEAL ON THE FILER NECK ALSO RUSTED OUT. UPDATED 05/15/12",
        "vin": "1N6ED26Y23C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/08/2011",
        "dateOfIncident": "09/08/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10424364,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL LEAKING FROM TANK CAUSED BY CORRODED TANK PARTS.  *TR",
        "vin": "1N6ED27Y53C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "08/25/2011",
        "dateOfIncident": "08/06/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10421477,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN FRONTIER. THE CONTACT STATED THE BEARINGS ARE DEFECTIVE. WHILE DRIVING 10 MPH, THERE WAS A GRINDING NOISE COMING FROM THE REAR OF THE VEHICLE. THE MANUFACTURER WAS CONTACTED WHO STATED THERE ARE NO RECALLS AND THE VEHICLE WAS OUT OF WARRANTY. THEY OFFERED NO OTHER ASSISTANCE. THE FAILURE MILEAGE WAS 77,000.",
        "vin": "1N6ED29Y43C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "07/18/2011",
        "dateOfIncident": "07/12/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10413401,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL TANK ASSEMBLY - THE TOP OF THE FUEL TANK WHERE THE FUEL PUMP/SENDING UNIT BOLTS INTO THE TANK RUSTED/CORRODED CAUSING A VAPOR LEAK AND THE CHECK ENGINE LIGHT TO COME ON. THIS REQUIRED CLEANING/REMOVING RUST/CORROSION RESEALING ASSEMBLY TO RETURN VEHICLE TO USABLE CONDITION.  *KB",
        "vin": "1N6ED29Y23C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/21/2011",
        "dateOfIncident": "06/20/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10407720,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY VEHICLE FUEL PUMP FAILED AND NEARLY CAUSED ME TO CRASH. I HAVE LOCATED NHTSA # 04V230000 THAT NOTES A RECALL. THE DEALER SAYS THAT MY VIN NUMBER WAS NOT PART OF THE FAULTY PUMPS THAT WERE PLACED IN THE VEHICLES. I WANT TO ADD THAT THESE OTHER FUEL PUMPS ARE ALSO NO GOOD. I AM IN THE COAST GUARD AND MY VEHICLE HAS BEEN NEAR THE SALTY OCEAN AIR SINCE I'VE OWNED IT (THE SAME REASON FOR THE CORROSION ON THE OTHER PUMPS). THERE SHOULD ALSO BE A RECALL FOR THESE PUMPS.  *TR",
        "vin": "1N6ED27TX3C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/11/2011",
        "dateOfIncident": "05/11/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10399961,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS STEERING ISSUES THAT I HAVE COMPLAINED ABOUT TO BOTH THE DEALER AND THE CORPORATE HEADQUARTERS SINCE I HAVE OWNED IT. BOTH HAVE ESSENTIALLY TOLD ME THAT I WAS \"IMAGINING THINGS\". A CALL TO THEIR CONSUMER COMPLAINTS LINE CAME WITH THE ANSWER OF \"I HAVE TO BELIEVE WHAT MY TECHNICIANS TELL ME\". RECENTLY I WAS CONTACTED IN A RECALL OF THE VEHICLE AND HAD THE 'SUPPOSEDLY' BAD PART REPLACED YESTERDAY, BUT THE VEHICLE IS STILL IN THE SAME CONDITION AND STILL FEELS EXTREMELY UNSTABLE AND UNSAFE ON THE ROAD - PARTICULARLY AT HIGHWAY SPEEDS. I AM AFRAID I AM GOING TO BE KILLED AND I CANNOT AFFORD ANOTHER VEHICLE AT THIS TIME. A NEAR MISS JUST OCCURRED ON 9A - AT 65 MILES PER HOUR IN WHICH THE VEHICLE WAS SWEPT BY WIND WHICH NEARLY SENT ME INTO THE PATH OF A SEMI TRUCK (THE MAN SMOKED HIS TIRES AND BLEW HIS HORN). THE STEERING FEELS AS THOUGH IT IS LOOSE OR RUBBERY AND I HAVE NOTICED THAT \"PLAY\" IN THE STEERING WHEEL SEEMS TO BE ABOUT 1-2\" BEFORE THE STEERING ENGAGES. I AM BEGINNING TO THINK THE REPLACEMENT PART WAS NO MORE THAN A LEGAL \"CYA\" SINCE THE STEERING IS NOT FIXED, AND IS INDEED AS BAD AS IT EVER WAS. I AM BEGGING FOR RELIEF AT THIS POINT, AND I DO NOT WISH TO DIE OR BE CRIPPLED OVER THIS COMPANY'S COVER-UP OF AN ENGINEERING FLAW THAT THEY ARE UNWILLING TO CORRECT. ANY ASSISTANCE WILL BE GREATLY APPRECIATED.  *TR",
        "vin": "1N6DD26T33C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "05/03/2011",
        "dateOfIncident": "04/27/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10398765,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN FRONTIER. THE CONTACT STATED THAT THE VEHICLE WAS REPAIRED UNDER NHTSA CAMPAIGN ID NUMBER: 10V554000 (STEERING COLUMN). THE DEALER ADVISED THAT THE STEERING WAS OFF CENTER AND THE RECALL REPAIR COULD NOT BE PERFORMED WITHOUT THE STEERING BEING CENTERED. THE ADDITIONAL FAILURE WAS NOT COVERED UNDER THE RECALL. THE CONTACT STATED THAT THE RECALLED DEFECT WAS WHAT CAUSED THE ADDITIONAL FAILURE.  THE MANUFACTURER WAS CONTACTED AND A COMPLAINT WAS FILED. THE MANUFACTURER ADVISED THAT SOMEONE WOULD CONTACT HIM AT A LATER DATE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE MILEAGE WAS 50,113 AND THE FAILURE MILEAGE WAS 53,000.",
        "vin": "1N6ED26Y73C"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "04/07/2011",
        "dateOfIncident": "10/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10394500,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SEVERAL MONTHS AGO THE CHECK ENGINE LIGHT IN MY 2003 NISSAN FRONTIER XE CAME ON.  I TOOK THE VEHICLE TO A LOCAL REPAIR SHOP AND WAS INFORMED THAT THE FUEL TANK WAS RUSTING AT THE TOP.  THIS CAUSED AIR TO ENTER THE SYSTEM MAKING THE CHECK ENGINE LIGHT GO ON.  I HAD TO HAVE THE TANK REPLACED TO PASS STATE INSPECTION.  *TR",
        "vin": "1N6ED29Y63C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "03/28/2011",
        "dateOfIncident": "04/10/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10393051,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CHECK ENGINE LIGHT IS ON CHECKED OUT BY LOCAL NISSAN DEALERSHIP . I WAS TOLD THAT A SMALL   EVO LEAK ON GASKET OF FUEL SENDING UNIT. HAD CHECKED BY OWN MECHANIC HE CONFIRMED WHAT NISSAN HAD SAID. I NOTICED MORE COMPLAINTS OF THIS PROBLEM BY OTHER OWNERS OF THE 2003 FRONTIER I THINK THIS ISSUED SHOULD BE INVESTIGATED FOR RECALL. THE DEALERSHIP WANTED OVER $600 TO FIX IF THE GAS TANK IS STILL USABLE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/14/2011",
        "dateOfIncident": "01/02/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10390044,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN FRONTIER. THE DRIVER OF THE VEHICLE WAS ATTEMPTING A TURN WHEN THE POWER STEERING FAILED. THE DRIVER WAS UNABLE TO MAINTAIN CONTROL OF THE VEHICLE AND CRASHED INTO A TREE INJURING HER HEAD AND KNEE. THE CONTACT LATER RECEIVED NOTIFICATION OF NHTSA CAMPAIGN ID NUMBER: 10V554000 (STEERING: COLUMN) AND CONTACTED THE MANUFACTURER BUT RECEIVED NO ASSISTANCE. THE VEHICLE WAS TRADED AND SOLD IN AN AUCTION. THE FAILURE AND CURRENT MILEAGE WAS 59,533.",
        "vin": "1N6DD26T13C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/03/2011",
        "dateOfIncident": "03/01/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10387848,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE RECALL NOTICE FOR CORROSION ON STEERING COLUMN. I TOOK THE TRUCK TO PREMIER NISSAN OF SAN JOSE DEALERSHIP INVOICE. 37,0751   THEY REPLACED THE DEFECTED PART STEERING COLUMN LOWER SHAFT-SALT AREA, BUT NOW MY STEERING WHEEL IN NOT STRAIGHT, AND ALIGNMENT ALL MESSED UP. NOW IT IS NOT SAFE TO DRIVE MY TRUCK. I MENTIONED IT TO THE SERVICE MANAGER AND HE SAID WE CAN NOT DO ANYTHING ABOUT IT,THAT SHAFT ONLY GOES IN ONE WAY. I COMPLIANT TO THE NISSAN NORTH AMERICA REF #[XXX], MARCH 3,2011  THEY ARE SUPPOSE TO CALL ME TOMORROW. PLEASE HELP TO SOLVE THIS PROBLEM. THANK YOU      INFORMATION REDACTED PURSUANT TO THE FREEDOM OF INFORMATION ACT (FOIA), 5 U.S.C. 552(B)(6).*TR",
        "vin": "1N6ED29X83C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2011",
        "dateOfIncident": "09/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381937,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE PURCHASE IN 2004 THE TILT STEERING DOES LOCK INTO PLACE. THE STEERING WHEEL MOVES UP AND DOWN DURING DRIVING WHICH COULD RESULT IN AN CRASH.  THE TILT MECHANISM HAS BEEN REPAIRED AND REPLACED BY THE DEALER WITH THE SAME FAILURE TO LOCK AND HOLD AFTER A SHORT PERIOD OF TIME.  THIS MUST BE A DESIGN ERROR SINCE AFTER REPAIR/REPLACEMENT THERE IS NO POSITIVE LOCK FOR THE TILT CONTROL.",
        "vin": "1N6ED29Y03C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "01/04/2011",
        "dateOfIncident": "03/01/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10374637,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A/C FAILED FOR UNKNOWN REASON, WAS A WARRANTY RECALL FOR SAME ISSUE IN FIRST 3 YEARS OF OWNERSHIP. *TR",
        "vin": "1N6ED27T03C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "11/30/2010",
        "dateOfIncident": "11/29/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10368350,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN FRONTIER. THE CONTACT STATED THAT IN OCTOBER 2010, THE RIGHT FRONT WHEEL SEPARATED FROM THE VEHICLE WHILE THE CONTACT WAS DRIVING 5 MPH. THE VEHICLE WAS REPAIRED BY A LOCAL MECHANIC; THE MECHANIC STATED THAT THE LOWER CONTROL ARM WAS THE CAUSE OF THE FAILURE. THREE WEEKS LATER, THE LEFT FRONT WHEEL SEPARATED WHILE DRIVING 45 MPH BECAUSE OF THE LOWER CONTROL ARM. THE VEHICLE WAS TOWED TO A REPAIR SHOP FOR REPAIRS. THE CONTACT CALLED THE MANUFACTURER WHO ADVISED HIM TO TAKE THE VEHICLE TO A DEALER FOR A DIAGNOSTIC TEST. THE FAILURE MILEAGE WAS APPROXIMATELY 100,000.",
        "vin": "1N6ED27T53C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "04/12/2010",
        "dateOfIncident": "09/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10313174,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 NISSAN FRONTIER WAS MAKING NOISES BECAUSE THE LEAF SPRINGS ON BOTH SIDES HAD SNAPPED. *DT",
        "vin": ""
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/26/2010",
        "dateOfIncident": "10/30/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10322283,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE AN 03 NISSAN FRONTIER SE 4 DR.  IT IS BLUE AND THE PAINT IS COMING OFF, ALL THE WAY TO THE PRIMER.  YOU CAN SEE IT RAISED AND THEN IT JUST FLAKES OFF.  IT FIRST STARTED IN 06 WHILE IT WAS UNDER WARRANTY ON THE PASSENGER REAR DOOR AND NISSAN REPAINTED IT AND NOW IT IS FLAKING OFF EVERYWHERE ELSE EXCEPT ON THE ROOF AND BOTH PASSENGER DOORS.  I KNOW IT IS OUT OF WARRANTY BUT THIS IS NOT NORMAL FOR PAINT AND IT BEGAN WHEN IT WAS ONLY 3 YEARS OLD.  BECAUSE OF THIS IF I WERE TO TRY AND RESALE IT AT THIS POINT I WOULD TAKE A BIG HIT ON PRICE BECAUSE OF THE PAINT JOB AND THEN THERE IS A HEALTH ISSUE WITH CHILDREN, SUPPOSE A FLAKE AS BIG AS A QUARTER IS SPOTTED BY A SMALL CHILD AND THEY INSERT IN THERE MOUTH AND GET SICK OR WORSE, THERE'S NO WAY I CAN BE LIABLE FOR THAT SO THEREFORE IF I'M NOT LIABLE THEN SOMEONE ELSE IS AND THAT SOMEONE ELSE WOULD BE NISSAN, SO IF NISSAN IS LIABLE THEN THEY NEED TO REPAINT IT NOW. *TR",
        "vin": "1N6ED27T53C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/20/2009",
        "dateOfIncident": "09/12/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10289138,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED NISSAN 2003 FRONTIER NEW IN 2003.  I RECENTLY HAD TO REPLACE 2 PARTS -FUEL SENDER AND GAS TANK THAT WERE DEFECTIVE FROM THE FACTORY.  THEY BOTH SHOULD HAVE BEEN INCLUDED IN A RECALL  -AFTER RESEARCHING FOUND THESE 2 PARTS ARE A COMMON PROBLEM  AND A CAUSE FOR REPLACEMENT DUE TO DEFECT AND LACK OF PROPER COATINGS AND SEALANTS FROM THE FACTORY.  I HAVE SOUGHT RESOLUTION FROM NISSAN USA AND WAS DENIED WITHOUT REVIEWU=ING ANY SUPPORTING INFO I HAD - THEY REFUSED ANY PICTURES, DOCUMENTATION OR TESTIMONY FROM DEALER OR MECHANIC, STATING THE PARTS WERE \"OUT OF WARRANTY\" THIS IS NOT A WARRANTY ISSUE IT IS A DEFECTIVE PARTS ISSUE.  I CONSULTED THE ATTY GENERAL OFFICE AND AFTER THEY CONTACTED NISSAN GOT THE SAME RESULT AS I DID. THE GAS TANK WAS LEAKING VAPORS INTO THE ENGINE WHICH COULD HAVE EVENTUALLY POSED A SAFETY ISSUE - I AM SEEKING REIMBURSEMENT FOR THE COST AND DIAGNOSTIC OF THIS PROBLEM AND PARTS AND NISSAN SHOULD STAND BY THEIR PRODUCT.  I PURCHASED THIS VEHICLE IN GOOD FAITH UNAWARE I HAD PURCHASED IT FROM THE FACTORY WITH DEFECTIVE AND UNSAFE PARTS IN IT.  *TR",
        "vin": "1N6ED27Y53C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/25/2009",
        "dateOfIncident": "05/01/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10274993,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN FRONTIER.  THE CONTACT STATED THAT THE EXTERIOR PAINT ON THE ROOF OF THE VEHICLE BEGAN TO PEEL ALL THE WAY DOWN THE DRIVER'S SIDE.  THERE WERE ALSO VISIBLE RUST SPOTS AND HOLES IN THE PAINT.  HE WAS CONCERNED THAT A SMALL CHILD COULD EAT THE PAINT AND THAT THE PAINT JOB SEEMED TO BE DEFECTIVE.  THE CURRENT AND FAILURE MILEAGES WERE LESS THAN 105,000.",
        "vin": "1N6DD26T43T"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "05/01/2009",
        "dateOfIncident": "03/31/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10267470,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 NISSAN FRONTIER GAS TANK ROTTED OUT AROUND FUEL SENDING UNIT. SMELLED GAS AND FUMES AND REMOVED THE TANK AND FOUND WATER GETS BETWEEN THE FUEL SENDING UNIT AND TANK CAUSING ROT HOLES TO FORM IN THE TANK. FUEL WAS LEAKING FROM HOLES WHEN TANK WAS FULL. *TR",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "04/08/2009",
        "dateOfIncident": "01/23/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10264769,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I NOTICED A \"TICKING\" SOUND FROM THE REAR OF MY TRUCK. MY OWN INVESTIGATION I FOUND THAT THE \"HOUSING\" THAT THE REAR SPEED SENSOR IS MOUNTED IN IS CRACKED. THIS IS WHAT CONTROLS THE ABS SYSTEM FOR THE REAR WHEELS. THE \"HOUSING\" IS MOUNTED TO THE FRONT OF THE DIFFERENTIAL. I DID CHECK AND THERE IS/WAS A RECALL ON CERTAIN NISSAN FRONTIER TRUCKS DURING THE 03 YEAR. I WAS TOLD THAT MY TRUCK IS NOT COVERED UNDER THIS RECALL. THE PART, WHICH I HAVE YET TO REPLACE, IS EXTREMELY CORRODED FOR BEING ONLY 6YEARS OLD WITH 45000 MILES. IT IS MADE OF ALUMINUM. I AM HAVING A HARD TIME LOCATING THE CORRECT PART, EVEN FROM THE DEALER. THE PART THAT I WAS TOLD IS THE CORRECT ONE IS $232. BUT DOING A LITTLE RESEARCH THAT PART IS ONLY THE WIRING FOR THE SENSOR NOT THE METAL \"HOUSING\". I NOTICED THIS ABOUT 2 MONTHS BACK, BUT THOUGHT IT MIGHT BE SOME RUST IN THE BRAKE DRUM FROM THE WINTER. *TR",
        "vin": "1N6DD26T63C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "02/10/2009",
        "dateOfIncident": "01/06/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10258273,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN FRONTIER XE.  THE CONTACT STATED THAT THE WHEEL BEARINGS ON THE REAR OF THE VEHICLE FAILED AND PREVENTED THE VEHICLE FROM MOVING.  THE ISSUE WAS FIRST EXPERIENCED AT 63,000 MILES AND THE CONTACT HAD THE WHEEL BEARINGS REPLACED.  CURRENTLY, AT 70,000 MILES, THE FAILURE HAS RECURRED.  NISSAN HAS PROVIDED TO PAY FOR THE PART, BUT NOT THE LABOR.  THE CONTACT FEELS THAT THE FAILURES SHOULD HAVE BEEN COVERED BY THE MANUFACTURER.  HE FEELS THAT THIS IS A SAFETY ISSUE BECAUSE THE FAILURES COULD CAUSE A CRASH.  THE VIN WAS UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 70,000.",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/08/2008",
        "dateOfIncident": "12/08/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10251050,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE JUST BEEN INFORMED THAT THE GAS TANK ON MY 2003 NISSAN FRONTIER NEEDS TO BE REPLACED AS IT LEAKS AT THE TOP OF THE TANK.  THE DEALER ACKNOWLEDGED THAT THIS IS A PROBLEM AND THAT THE SUPPLIER OF THESE TANKS NO LONGER MAKES THEM AS THEY ARE ALL COMING BACK AS DEFECTIVE. *TR",
        "vin": "1N6ED27Y73C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/17/2008",
        "dateOfIncident": "11/17/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10248982,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WATER GOT INTO MY REAR END ON A 2003 FRONTIER CREW CAB DUE TO A FAULTY ABS SEAL AND RUINED THE GEARS.  NISSAN HAD A RECALL ON THIS BUT SAID MY VIN# WAS NOT ONE OF THE VEHICLES RECALLED EVEN THOUGH OTHERS OF MY YEAR, MAKE AND MODEL HAVE BEEN AND MINE HAD THE EXACT SAME PROBLEM.  NISSAN SAID I WAS ON MY OWN AND RESPONSIBLE FOR ALL REPAIRS. *TR",
        "vin": "1N6ED27Y83C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "08/21/2008",
        "dateOfIncident": "04/01/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239150,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN FRONTIER XE.  THE CHECK ENGINE LIGHT ILLUMINATED ON THE INSTRUMENT PANEL.  THE CONTACT TOOK THE VEHICLE TO THE DEALER AND WAS INFORMED THAT HE NEEDED A NEW FUEL TANK, FUEL SENDING UNIT, AND FUEL FILTER.  THROUGH RESEARCH, THE CONTACT DISCOVERED NHTSA CAMPAIGN ID NUMBER 04V230000 (FUEL SYSTEM, GASOLINE:DELIVERY:FUEL PUMP) FOR THE REGULAR 2003 NISSAN FRONTIER.  THE DEALER STATED THAT HIS VIN WAS NOT INCLUDED IN THE RECALL, ALTHOUGH THE FAILURES WERE IDENTICAL.  THE CONTACT BELIEVES THAT IF HE IS EXPERIENCING THE SAME FAILURE, HIS VEHICLE SHOULD ALSO BE REPAIRED UNDER THE RECALL.  THE FAILURE MILEAGE WAS 98,000 AND CURRENT MILEAGE WAS 105,000.",
        "vin": "1N6ED29Y03C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/25/2008",
        "dateOfIncident": "07/21/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10235751,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "B.F. GOODRICH TIRE CO.",
                "productMake": "B.F.GOODRICH",
                "productModel": "RADIAL T/A",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN FRONTIER XE.  THE VEHICLE HAS B.F. GOODRICH RADIAL T/A TIRES, SIZE P265/70/R15 (NA).  THE CONTACT STATED THAT THE VEHICLE STARTED TO SHAKE LEFT AND RIGHT.  THE DEALER STATED THAT THE FRONT PASSENGER SIDE TIRE WAS SPLITTING AND THE OTHER TIRES WERE DRY ROTTING AND CRACKING.  THE SPARE WAS PLACED ON THE VEHICLE AND THE CONTACT WAS INFORMED THAT SHE NEEDED TO PURCHASE FOUR NEW TIRES.  NO REPAIRS HAVE BEEN MADE.  THE FAILURE AND CURRENT MILEAGES WERE 50,000.",
        "vin": "1N6ED27T43C"
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "05/13/2008",
        "dateOfIncident": "11/16/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10227593,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN FRONTIER XE.  WHILE DRIVING AT ANY SPEED, THE CONTACT COULD HEAR A GRINDING NOISE COMING FROM THE REAR OF THE VEHICLE.  HE ALSO SMELLED OLD OIL.  HE EXAMINED THE VEHICLE AND NOTICED THAT THE BREATHER TUBE WAS MISSING.  NHTSA CAMPAIGN ID NUMBER 02V299000 (SUSPENSION:REAR) WAS REFERENCED.  THE VEHICLE WAS PREVIOUSLY DIAGNOSED BY THE DEALER FOR THE SAME FAILURE ON THE FRONT END, BUT HAS NOT BEEN DIAGNOSED FOR THE REAR END.  THE CURRENT MILEAGE WAS 130,000 AND FAILURE MILEAGE WAS 125,000.",
        "vin": "1N6ED29Y13C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "02/06/2008",
        "dateOfIncident": "01/22/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10217125,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE PREPARING TO PARK MY 2003 NISSAN FRONTIER XE (WITH 35,000 MILES) WITH BRAKES APPLIED IT SUDDENLY SURGED FORWARD, WENT UP A GRASSY BANK AND HIT A CONCRETE SUPPORT AT THE BASE OF A LIGHT POLE RESULTING IN $5200 DAMAGE TO RIGHT FRONT. BRAKING COULD NOT OVERRIDE THE ACCELERATION.  FORTUNATELY, TRUCK HIT POLE AND NOT PEDESTRIAN WALKING DIRECTLY IN FRONT OF VEHICLE. TRUCK SERVICED AT LOCAL NISSAN DEALERSHIP ON REGULAR BASIS. TRUCK STILL AT BODY SHOP AND WILL EVENTUALLY BE CHECKED BY NISSAN DEALER BEFORE I DRIVE IT AGAIN.  *TR",
        "vin": "1N6DD26T83C"
    },
    {
        "components": "POWER TRAIN,EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "12/31/2007",
        "dateOfIncident": "12/20/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10213268,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN DIESEL",
                "productModel": "CLA83",
                "productYear": "1988",
                "type": "Equipment"
            }
        ],
        "summary": "NISSAN MURANO 2003 HAS PROBLEM WITH PRESSURE SENSOR INSIDE TRANSMISSION.  THIS CAUSES THE VEHICLE TO HESITATE, 10-15 SECONDS BEFORE YOU CAN ACCELERATE.  THIS ONLY STARTED 2 WEEKS AGO AND I HAVE 89K MILES ON IT.  I ALMOST WAS STUCK BY AN ONCOMING VEHICLE DUE TO THE HESITATION. THERE ARE MANY MORE STORIES LIKE MINE ON EDMUNDS.COM.  NISSAN DOES NOT ACKNOWLEDGE ANY PROBLEM WITH THE TRANSMISSION BUT CLEARLY STATES THAT THE DEFECT WAS CORRECTED IN THE LATER MODELS. BIG SAFETY ISSUE, PLEASE LOOK INTO THIS ASAP BEFORE SOMEONE IS KILLED. *TR",
        "vin": "JN8AZ08W33W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/26/2007",
        "dateOfIncident": "12/07/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10212846,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SERVICE ENGINE SOON LIGHT CAME ON AND I BEGAN TO SMELL GASOLINE.    GAS TANK ROTTED OUT AROUND FUEL SENDING UNIT GASKET.  FUEL SENDING UNIT AND GAS TANK REPLACED.  I DO NOT HAVE THE OLD GAS TANK BUT I DID PHOTOGRAPH IT DIGITALLY.  *TR  I UNDERSTAND THERE WAS A RECALL FOR NEARLY 500,000 OF THESE VEHICLES BUT DEALER REPORTED MINE WAS NOT COVERED UNDER RECALL.",
        "vin": "1N6ED29Y33C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "12/05/2007",
        "dateOfIncident": "11/03/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10210925,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "GRABBER AW",
                "productYear": "9999",
                "size": "P22770/R15",
                "type": "Tire"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN FRONTIER.  THE VEHICLE HAS GENERAL GRABBER AW, SIZE P22770/R15 TIRES.  WHILE DRIVING APPROXIMATELY 55 MPH, THE REAR OF THE VEHICLE BEGAN TO VIBRATE EXCESSIVELY.  THE CONTACT TOOK THE VEHICLE TO A SERVICE STATION TO HAVE IT INSPECTED AND THEY STATED THAT THE DRIVER SIDE REAR TIRE HAD A LARGE BUBBLE IN IT, WHICH CAUSED THE VIBRATION.  THE TIRE WAS REPLACED.  THE MECHANIC STATED THAT THE REMAINING TIRES WERE NORMAL.  TWO WEEKS LATER, THE VIBRATION BEGAN AGAIN AND THE TIRE BLEW OUT WHILE DRIVING 70 MPH.  HE PULLED HIS VEHICLE TO THE SIDE OF THE ROAD AND NOTICED THAT THE PASSENGER SIDE REAR TIRE TREAD COMPLETELY SEPARATED AND WRAPPED AROUND THE AXLE.  THE FAILURE CAUSED SUBSTANTIAL DAMAGE TO THE VEHICLE INCLUDING THE BENDING OF THE FENDER AND PASSENGER SIDE REAR QUARTER PANEL.  THE TIRE LINE FAILED AS WELL.  THE VIN AND ENGINE SIZE WERE UNKNOWN.  THE CURRENT AND FAILURE MILEAGES WERE 80,000.",
        "vin": ""
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "11/06/2006",
        "dateOfIncident": "08/20/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10172676,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A GROWING PROBLEM WITH OUR 2003 NISSAN FRONTIER 4X2 PURCHASED NEW FROM DELAND NISSAN IN FLORIDA.  OVER THE PAST SIX MONTHS THE FACTORY ORIGINAL PAINT HAS BEGUN TO FAIL IN NUMEROUS LOCATIONS.  IT BEGINS WITH A BUBBLING OF THE PAINT IN A SPOT FOLLOWED BY FLAKING OFF OF THE OUTER COLOR PAINT FROM THE GRAY PRIMER.  THE AREA OF PAINT FAILURE CONTINUES TO EXPAND WITH NO END IN SIGHT.  ATTEMPTS TO WORK WITH OUR DELAND DEALERSHIP HAVE BEEN UNSUCCESSFUL SINCE THE VEHICLE WAS WITHIN THE 3 YEAR WARRANTY BUT OVER THE MILEAGE ALLOTMENT.  NISSAN NORTH AMERICA DISTRICT PARTS AND SERVICE MANAGERS HAVE BOTH REVIEWED THIS SITUATION AND EARLIER PHOTOGRAPHS OF THE PAINT FAILURE AND HAVE DECLINED TO REPAIR THE DAMAGE THAT IS OCCURRING FROM THIS FACTORY DEFECT IN THE PAINTING OF OUR VEHICLE.  THE FAILURE OF THE PAINT IN THE AREA AFFECTED IS GROWING RAPIDLY. THIS FAILURE IS NOW OCCURRING IN THREE MAJOR AREAS WITH OTHER AREAS SHOWING THE EARLY SIGNS OF PAINT FAILURE.  WE HAVE TAKEN THIS VEHICLE TO TWO LOCAL PAINT AND BODY SHOPS TO GET AN OPINION AS TO WHAT MAY BE CAUSING THE FAILURE.  IN BOTH CASES THESE PAINT EXPERTS BELIEVE THAT IT IS A FAILURE OF THE EXTERIOR PAINT TO EFFECTIVELY BOND TO THE PRIMER PAINT.  THIS IS A PROBLEM THAT OCCURRED DURING THE MANUFACTURING PROCESS AND NOT A RESULT OF OUTSIDE ELEMENTS THAT MAY HAVE COME IN CONTACT WITH THE VEHICLE.  WHEN THE PAINT STARTS TO FLAKE AWAY FROM THE VEHICLE IT DOES SO IN A BUBBLING FASHION FROM UNDERNEATH THE SEAL OF THE PAINT.    I HAVE RESEARCHED THE INTERNET AND FIND THERE ARE OTHER  OWNERS OF NISSAN VEHICLES AND THE 2003 NISSAN FRONTIER WHO HAVE EXPERIENCED THE SAME PROBLEM WITH THE FACTORY ORIGINAL PAINT. THIS APPEARS TO BE FURTHER EVIDENCE OF A SYSTEMATIC PROBLEM IN EITHER THE PAINTING PROCESSES OR THE CHEMICAL COMBINATIONS USED TO FORMULATE YOUR PRIMERS AND PAINTS.    WE HAVE TRIED TO APPEAL THIS LOCAL/REGIONAL DECISION ON THE FAILURE OF THE PAINT ON OUR FRONTIER THROUGH CUSTOMER SERVICE OPERATIONS, BUT HAVE BEEN UNSUCCESSFUL.  *JB",
        "vin": "1N6ED27T83C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "11/02/2006",
        "dateOfIncident": "08/28/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10173283,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 NISSAN FRONTIER HAD INTERMITTENT LOSS OF POWER STEERING. MECHANIC STATED THAT THE STEERING BOX THEY REPLACED WAS DEFECTIVE AND IT NEEDED TO ORDER ANOTHER ONE. *KB  THE STEERING BOX THE DEALER INSTALL BEGAN TO DRIP FLUID WITHIN 30 DAY OF INSTALLATION.  THE CONSUMER BELIEVES A DEFECT EXIST IN THE STEERING BOXES NISSAN IS INSTALLING IN THEIR VEHICLE'S.  THE CONSUMER REQUEST REIMBURSEMENT FOR THE ORIGINAL GEAR BOX REPLACED.",
        "vin": "1N6MD27Y03C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "10/07/2006",
        "dateOfIncident": "10/20/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10170207,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I RECEIVED A RECALL LETTER CONCERNING AN INSTALLATION OF A FUEL TANK PROTECTOR.  I SPOKE WITH THE CONSUMER AFFAIRS OFFICE ABOUT A REIMBURSEMENT OF THE COST TO REPLACE THE TANK (AS NOTED IN THE RECALL LETTER).  I FAXED ALL REQUESTED INFORMATION TO NISSAN, BUT HAVE NOT RECEIVED A REIMBURSEMENT.    *NM",
        "vin": "JN8AZ08TX3W"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "10/04/2006",
        "dateOfIncident": "09/15/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10169949,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE HIGH MOUNTED BRAKE LIGHT ON MY 2003 NISSAN FRONTIER HAS SEALS THAT ARE COMPROMISED.  THE LIGHT ASSEMBLY TAKES ON WATER CAUSING THE BRAKE LIGHT TO FAIL.  NISSAN REPLACED THE LIGHT ONCE DURING THE INITIAL 36 MONTHS OF THE ORIGINAL WARRANTY AND REFUSES TO REPLACE THE UNIT AGAIN.  SINCE THE BRAKE LIGHT IS A SAFETY COMPONENT, I WOULD APPRECIATE YOUR INVESTIGATION OF THIS COMPLAINT.  IT IS MY POSITION THAT NISSAN IS RESPONSIBLE FOR ENGINEERING AND MANUFACTURING A SAFETY COMPONENT THAT WORKS PROPERLY. *JB",
        "vin": "1N6ED27Y23C"
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "03/20/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168673,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "UNKNOWN MANUFACTURER",
                "productMake": "UNKNOWN",
                "productModel": "UNKNOWN",
                "productYear": "9999",
                "type": "Equipment"
            }
        ],
        "summary": "AIR CONDITIONER COMPRESSOR AND LINES BROKE.  *NM",
        "vin": "1N6ED27T83C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "09/19/2006",
        "dateOfIncident": "08/01/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10168671,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 NISSAN FRONTIER PAINT IS CHIPPING IN 3 PLACES WITH A 4TH AREA BUBBLING.  *NM",
        "vin": "1N6ED27T83C"
    },
    {
        "components": "SUSPENSION,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "05/17/2006",
        "dateOfIncident": "05/17/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10157736,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*: THE CONTACT STATED THERE WAS A LOUD HUMMING SOUND COMING FROM THE REAR END AND THE ABS LIGHT IS ILLUMINATED.  AN INDEPENDENT MECHANIC DETERMINED THERE WAS WATER IN THE REAR AXLE DUE TO INADEQUATE SEALING OF THE ANTI-LOCK BRAKING SYSTEM (ABS) SENSOR.  THERE IS AN NHTSA RECALL, # 02V299000, REGARDING THE SUSPENSION: REAR.  THE VIN WAS NOT INCLUDED IN THE RECALL. *AK  UPDATED 9/15/2006 - *NM",
        "vin": "1N6ED29Y33C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "01/09/2006",
        "dateOfIncident": "01/02/2006",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10147230,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT*:  THE CONTACT STATED THE VEHICLE WOULD NOT SHIFT OUT OF PARK.  THE VEHICLE WAS TOWED TO THE DEALERSHIP, WHO DETERMINED THE SHIFTER WAS NOT CATCHING.  THE DEVICE ASSEMBLY/TRANSMISSION CONTROL WAS REPLACED.*AK",
        "vin": "1N6ED27TX3C"
    },
    {
        "components": "UNKNOWN OR OTHER",
        "crash": false,
        "dateComplaintFiled": "12/20/2005",
        "dateOfIncident": "12/10/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10145768,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A FRONTIER 2003 XE CREW CAB MODEL, AND ONE DAY RUNNING ON THE HIGHWAY AT ABOUT 90+ MPH,SUDDENLY IT LOOSE THE TRACTION THAT KEEP THE VEHICLE IN MOTION FOR A MOMENT AND BACK AGAIN. I THINK THAT TRUCK CHASSIS SUDDENLY LOST THE WEIGHT THAT KEEP THE TRUCK ASIDE TO THE GROUND CAUSED BY THE AIR FLOW UNDER THE TRUCK (AERODYNAMIC EFFECT) SO I GOT VERY NERVOUS BECAUSE IT COULD CAUSE TO LOOSE CONTROL ON THE TRUCK WITH CAUSING POTENTIAL INJURES TO MYSELF FURTHERMORE THE INCIDENT CAME UP WITH OUT NOTICE. MY FIRST THOUGHT WAS THAT PROBABLY THERE WERE SOME PROBLEM WITH THE FUEL ENGINE SYSTEM BUT NO LIGHT AT THE PANEL CAME ON.   *NM",
        "vin": "1N6ED27T53C"
    },
    {
        "components": "STRUCTURE",
        "crash": true,
        "dateComplaintFiled": "04/27/2005",
        "dateOfIncident": "04/05/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 1,
        "numberOfInjuries": 0,
        "odiNumber": 10118535,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY DAUGHTER WAS INVOLVED IN A HEAD ON CRASH AND HER  NISSAN, 2003 DISINTEGRATED. THE WHOLE FRONT OF HER VEHICLE ENDED UP IN THE FRONT SEAT.  SHE WAS GOING 55 MPH, AND THE OTHER VEHICLE WAS GOING 20 MPH.*AK",
        "vin": "JN8AZ08W93W"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/24/2005",
        "dateOfIncident": "01/22/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107828,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A 2003 NISSAN FRONTIER SC, THE SUPER CHARGED MODEL, WITH 43,000 MILES.  I WAS DRIVE ON THE NYS THRUWAY LAST SATURDAY.  THE AMBIENT TEMPERATURE WAS EXTREMELY LOW -10F.  THE TRUCK WAS INTERMITTENTLY LOSING POWER.  IT FINALLY WENT INTO A SLOW IDLE AND LOST ALL POWER.  I PULLED OVER AND TRIED TO CALL FOR HELP.  I HAD MY WIFE AND 14 MONTH OLD CHILD IN THE TRUCK WITH ME.  IT WAS A VERY DANGEROUS SITUATION.  WE HAD NO POWER, IT WAS EXTREMELY COLD AND IT HAD BEEN SNOWING AT NEAR BLIZZARD CONDITIONS.  I WAS NOT ABLE TO GET OFF THE ROAD.  I WAS VERY CONCERNED ABOUT THE SAFETY OF MY WIFE AND CHILD.  AFTER 15 MINUTES OF MAKING CALLS, I TRIED TO START THE TRUCK AGAIN.  THE CHECK ENGINE LIGHT WAS ON, BUT THE TRUCK STARTED AND RAN NORMALLY.  THAT EVENING, AFTER THE TRUCK HAD BEEN SITTING FOR A FEW HOURS, THE SAME PROBLEM OCCURRED.  THIS TIME, I WAS IN 4WD AND TRYING TO DRIVE THROUGH SNOW AT HIGHER RPMS WHEN THE TRUCK LOST POWER.     I TOOK THE TRUCK TO THE BURDICK NISSAN, A DEALERSHIP IN CICERO, NY.  THEY TOLD ME I NEEDED A NEW AIR FLOW METER.  I SEE THAT THE 2002 MODELS WERE EXPERIENCING THE EXACT SAME PROBLEM, BUT THEY WERE RECALLED (R2013) AND THE FIX IS TO REPROGRAM THE EXISTING METER.  THE COST OF THE PART (AIR FLOW METER) IS $600.00!   *NM",
        "vin": "1N6MD29Y23C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/29/2004",
        "dateOfIncident": "08/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10090175,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, SPECIFICALLY IN RAIN STORMS, VEHICLE STALLED. TOOK THE VEHICLE TO THE DEALER. WAS TOLD THAT WATER WAS BEING SUCKED INTO THE AIR FILTER FROM THE WHEEL WELL. *AK   VEHICLE WOULD KNOCK AND SPUTTER WHEN TRYING TO ACCELERATE.  AIR FILTER SUCKS WATER FROM AROUND THE WHEEL AREA.  *TC",
        "vin": "1N6ED29Y53C"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "07/08/2004",
        "dateOfIncident": "06/18/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10081561,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH TRANSMISSION FAILED. THIS CAUSED THE VEHICLE NOT TO ACCELERATE. CONSUMER MANAGED TO PULL OVER AND HAD THE VEHICLE TOWED.  DEALERSHIP WAS NOTIFIED, BUT DID NOT RESOLVE THE PROBLEM. *AK",
        "vin": "1N6ED29Y93C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "05/21/2004",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10074062,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE VEHICLE HAS A GOVERNOR THAT  DOESN'T ALLOW IT TO EXCEED THE SPEED OF 89 MPH, EVEN THOUGH THE SPEEDOMETER GOES TO 120 MPH. THIS INFORMATION IS NOT PROVIDED IN THE OWNER'S MANUAL, NOR TOLD UPON PURCHASE OF THE VEHICLE BY THE DEALERSHIP.  THIS COULD RESULT IN AN ACCIDENT BECAUSE THE VEHICLE STOPS ACCELERATING WHEN THE SPEED REACHES 89 MPH.  *AK",
        "vin": "1N6ED29X43C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/26/2004",
        "dateOfIncident": "03/25/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063963,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN IGNITION IS TURNED OFF POWER DOOR LOCKS RANDOMLY LOCK VEHICLE BY THEMSELVES, LOCKING OUT DRIVER. HAPPENS ONCE EVERY ONE OR TWO WEEKS.*AK",
        "vin": "1N6ED26T83C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "03/16/2004",
        "dateOfIncident": "05/15/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10063244,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING AT NIGHT DRIVER WAS UNABLE TO SEE THE GAUGES ON THE VEHICLE BECUASE OF LACK OF ILLUMINATION.  CONSUMER STATED THAT THE GAUGES WERE COLORED WITH BLACK AND GRAY.*AK",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "02/10/2004",
        "dateOfIncident": "02/10/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10057861,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER RECEIVED A RECALL  NOTICE FROM THE MANUFACTURE FOR STALLING. DEALER DID NOT PERFORM RECALL REPAIRS DUE TO LACK OF PARTS. SCOTTSDALE NISSAN, 7000 EAST MCDOWELL ROAD, SCOTTSDALE, AZ 85257.408-994-0301. GENERAL MANAGER MARK JOHNSON.  *AK",
        "vin": "3N1CB51D2YL"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "12/08/2003",
        "dateOfIncident": "11/02/2003",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10049422,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAND NEW TRUCK WITH 1507 MILES DUMPED ALL IT'S TRANSMISSION FLUID, EMITTING SMOKE FROM ALL SIDES AND UNDERNEATH,  STOPPED VEHICLE DEAD IN ITS TRACKS.  REPAIRING DEALER GAVE ME ONE OF THE \"WEDGES\" LEFT IN THE TRANSMISSION COOLER LINE AT THE FACTORY WHICH CAUSED COOLER HOSE TO DETACH AND PRECIPITATED MAJOR VEHICLE FAILURE.  IT WAS JUST PLAIN LUCK THAT WE WERE NOT INJURED OR KILLED AS WE WERE ON OUR WAY TO CLIMB DONNER PASS (CA) WITH CHAINS ON DURING A HEAVY SNOWSTORM.  REPORTED TO NISSAN CUSTOMER SATISFACTION.    I SUGGEST NHTSA INSTITUTE A RECALL FOR AT LEAST INSPECTION AS THIS FACTORY DEFECT  CAUSE TOTAL TRANSMISSION FAILURE AT ANY TIME,  WITH RESULTANT RISK OF INJURY AND OR  DEATH.*AK",
        "vin": "1N6DD26T43C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/19/2003",
        "dateOfIncident": "07/30/2003",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10042364,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING, THE  ENGINE SERVICE LIGHT STARTED FLASHING, INDICATING  AN ENGINE FIRE. *AK   THE FIREMAN INFORMED THE CONSUMER THE FIRE WAS LIKELY CAUSED BY AN ELECTRICAL SHORT UNDER THE HOOD.  *LA  *JB",
        "vin": "1N6ED29Y73C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/18/2003",
        "dateOfIncident": "10/09/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10043172,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ANTI-LOCK BRAKES ACTIVATE AT UNPREDICTABLE TIMES WHEN STOPPING.  HAVE NEARLY CAUSED 2 WRECKS.  DEALER COULDN'T FIND THE PROBLEM AND REFUSES TO TAKE ANY ACTION.  IT HAS HAPPENED 4 TIMES IN 3000 MILES.  *LA",
        "vin": "1N6DD26T43C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/15/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10030109,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN BRAKES ARE DEPRESSED THE VEHICLE WILL SHIMMY.  THE REAR END SHIMMIES MORE SEVERELY WHEN BRAKE ARE DEPRESSED AT HIGH SPEEDS. CAUSE OF PROBLEM UNKNOWN.  *AK *TS",
        "vin": "1N6DD26T83C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "08/01/2003",
        "dateOfIncident": "07/03/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10026749,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER STATED THE HEADLIGHTS HIGH BEAMS WERE TOO BRIGHT. DEALER NOTIFIED.  *AK *TS   *JB",
        "vin": ""
    },
    {
        "components": "EQUIPMENT",
        "crash": false,
        "dateComplaintFiled": "07/25/2003",
        "dateOfIncident": "07/22/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10029183,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "AIR CONDITIONER  A/C WORKS PROPERLY UNTIL THE DEFROSTER IS ENGAGED.  ONCE THE DEFROSTER IS TURNED ON THE AC REMAINS ON UNTIL THE ENGINE IS TURNED OFF.  THERE IS NO OTHER WAY TO SHUT IT OFF.*AK",
        "vin": ""
    },
    {
        "components": "SUSPENSION,ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "06/30/2003",
        "dateOfIncident": "06/27/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10025174,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "VEH HAD 2400 MI AT DATE OF INCIDENT.  THE CLAMP TO RADIATOR HOSE BROKE CUASING TO LEAK RADIATOR FLUID. CONTACTED THE DEALERSHIP THEY REQUESTED TO BRING THE VEHICLE IN.  I WAS OUT OF STATE, BUT WAS LUCKY ENOUNGH TO PLACE AN AFTERMARKET HOSE CLAMP ON THE HOSE (SOMETHING A BIT MORE STURDY) ALSO THE LEFT FRONT SUSPENSION HAS BEEN MAKING A VERY NOISEY SQWEEK WHILE GOING OVER BUMPS.  I WILL HAVE THE DEALERSHIP LOOK AT IT THAT AS WELL.*AK",
        "vin": ""
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/25/2003",
        "dateOfIncident": "02/01/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10011033,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I PURCHASED  A 2003 NISSAN FRONTIER PICKUP TRUCK.  WHEN I USE THE DEFROSTER THE AIR CONDITIONER COMES ON WHICH IS NORMAL.  I CANNOT TURN OFF THE DEFROSTER AND AIR CONDITIONER UNTIL I TURN OFF THE ENGINE. THE AIR CONDITIONER COMPRESSOR STAYS ON UNTIL THE ENGINE IS SHUT DOWN.  IF I AM ON A HIGHWAY I HAVE TO STOP AND TURN THE ENGINE OFF TO TURN THE AIR CONDITIONER OFF, RESTART THE ENGINE, AND THEN MERGE BACK ON THE HIGHWAY.  AT ONE NISSAN DEALERSHIP THE SERVICE DEPARTMENT TELLS ME THIS IS NORMAL AND IT IS WRITTEN UP THAT WAY IN THE MANUAL.  YET THEY TELL ME THERE IS A NATIONWIDE BACKORDER FOR A PART.  ANOTHER NISSAN DEALERSHIP TELLS ME THERE IS A PROBLEM BUT THEY ARE UNABLE TO DIAGNOSE WITHOUT TEARING EVERYTHING APART.",
        "vin": "1N6DD26T03C"
    },
    {
        "components": "AIR BAGS",
        "crash": false,
        "dateComplaintFiled": "12/02/2002",
        "dateOfIncident": "11/20/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8023549,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER STATED THAT THE AIRBAG LIGHT APPEAR ON THE DASHBOARD PANEL.  AND WILL STAY ON INTIL THE VEHICLE IS TURN OFF DEALER IS AWARE OF THE PROBLEM. TS",
        "vin": "1N6ED27T73C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "10/30/2002",
        "dateOfIncident": "05/05/2002",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 8021921,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "FRONTIER",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING THE VEHICLE  APPLIED THE BRAKE AND THE ENGINE SUDDEN ACCELERATION, CAUSING A REAR ENDING ACCIDENT. DEALER HAS BEEN NOTIFIED. PLEASE PROVIDE FURTHER INFORMATION.       TS",
        "vin": "1N6MD29YX2C"
    }
]