[
    {
        "components": "STEERING,ENGINE,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/07/2021",
        "dateOfIncident": "06/15/2021",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11428152,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "Fuel pump power steering abs O2 sensors yes it's available for inspection upon requests car shut off while driving at 70 miles an hour on a highway due to fuel pump because my VIN number is not with all the other 2003 Nissan xterra's that have recalls on all of the same problems I have just for some reason my car has zero recalls which is ridiculous and not believable so yes my life was put at risk I took it to an independent service my mechanic because I can't take it to a dealer because all the parts that are broken and that need replacement that have been recalled on every other 2003 does not apply to my VIN so I've had to pay for labor and parts and the headache that I could have had this all replaced and fixed due to the recall and I would have taken it to the dealership immediately after purchasing the car in 2019 and since the previous owner didn't have any recalls why would he bother either I will not pass inspection if they do not fix this evap O2 sensor and now my fuel pump I would like to be reimbursed on that was purchased through Nissan dealership the gauge is no longer working just put in brand new part so I would like someone from the dealerships take a look at my car and replace everything that's wrong with it with every other 2003 Nissan Xterra regardless of my VIN number and I have check engine light on forever for evac leak replace catalytic converters exhaust system O2 sensors power steering fuel pump ABS sensors I would just like to take the best care of this vehicle that I can and that would be done through the dealership replacing all of the recalled parts on this make model of the Xterra 2003 3.3 l V6 non supercharged. The vehicle stalled while driving due to the fuel pump check engine light's been on for EVAP code for the fuel tank cap gas cap small leak and O2 sensors which I've been replaced but codes are still there no code has popped up pertaining to fuel pump car died at 70 miles an hour on a Thruway at midnight not fun.7Codes remaining",
        "vin": "5n1ed28y33c"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "10/10/2020",
        "dateOfIncident": "07/24/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11363744,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE OVERHEATING ALL COOLING PARTS HAVE BEEN REPLACED STILL OVERHEATING WITH NO KNOWN ISSUE FOUND VERY COMMON IN THE 2000 TO 2004 MODELS AND YET NO RECALLS TO FIX THE ISSUE AND KEEPS BLOWING RADIATOR HOSES",
        "vin": "5N1ED28Y53C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "01/24/2019",
        "dateOfIncident": "01/21/2019",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11171830,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. AFTER THE VEHICLE WAS FILLED WITH FUEL, IT WOULD NOT RESTART. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHO STATED THERE WAS A CRACK IN THE FUEL SENDING UNIT. THE VEHICLE WAS REPAIRED. THE DEALER AND MANUFACTURER WERE NOT CONTACTED. THE FAILURE MILEAGE WAS 180,000.",
        "vin": "5N1ED28T73C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/31/2018",
        "dateOfIncident": "10/01/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11066135,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED THAT THERE WAS A PREMATURE FAILURE OF COOLANT LEAKING INTO THE RADIATOR, WHICH IMPACTED THE TRANSMISSION. THE VEHICLE WAS NOT DIAGNOSED BY A DEALER. THE INDEPENDENT MECHANIC REPLACED THE RADIATOR AND FLUSHED THE TRANSMISSION. THE MANUFACTURER STATED THAT THE VEHICLE WAS NOT INCLUDED IN A RECALL CAMPAIGN AND PROVIDED NO SOLUTION. THE FAILURE MILEAGE WAS NOT AVAILABLE.",
        "vin": "5N1ED28T43C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "11/13/2017",
        "dateOfIncident": "11/10/2017",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 11045547,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. WHILE DRIVING 20 MPH, THE VEHICLE STALLED WITHOUT WARNING. IN ADDITION, THE POWER STEERING AND BRAKES FAILED. THE CONTACT STATED THAT THE VEHICLE WAS SERVICED AT CASA NISSAN (5855 MONTANA AVE, EL PASO, TX) PER NHTSA CAMPAIGN NUMBER: 04V230000 (FUEL SYSTEM) THREE TIMES PREVIOUSLY. THE DEALER INSPECTED THE VEHICLE AND ADDED SEALANT TWICE BEFORE; HOWEVER, THE FUEL TANK WAS REPLACED DURING THE FINAL VISIT. THE REMEDIES FAILED TO REPAIR THE VEHICLE OVER THE PAST THREE YEARS. THE VEHICLE WAS DRIVEN TO NISSAN OF LAS CRUCES (1801 S MAIN ST, LAS CRUCES, NM, 88005), BUT WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS CONTACTED AND PROVIDED CASE NUMBER: 28820775. THE FAILURE MILEAGE WAS APPROXIMATELY 190,000.",
        "vin": "5N1MD28Y63C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "10/14/2016",
        "dateOfIncident": "10/14/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10916137,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. WHILE DRIVING 55 MPH, THE CONTACT CRASHED INTO THE REAR OF ANOTHER VEHICLE. THE AIR BAGS FAILED TO DEPLOY. THE CONTACT SUSTAINED NECK AND BACK INJURIES, BUT DID NOT REQUIRE MEDICAL ATTENTION. A POLICE REPORT WAS FILED. THE VEHICLE WAS TOWED TO A TOWING LOT. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS NOT NOTIFIED OF THE FAILURE. THE APPROXIMATE FAILURE MILEAGE WAS 160,000.",
        "vin": "5N1ED28T43C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "06/12/2016",
        "dateOfIncident": "06/12/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10873775,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "JUNE 12 2016 AT THE TRI-PAR IN SLINGER, WI I WAS FILLING UP THE GAS TANK, WHEN GAS BEGAN SPILLING OUT OF THE VEHICLE'S WHEEL WELL.  I IMMEDIATELY STOPPED IT AFTER I NOTICED IT.  THE STATION ALONG WITH THE SLINGER FIRE DEPARTMENT ESTIMATED A GALLON WAS SPILT.      IT APPEARS THE VEHICLE'S GAS TANK NECK HAS RUSTED OUT. THEY DEEMED THE VEHICLE NOT SAFE TO DRIVE AND RECOMMEND WE HAVE IT TOWED HOME, WHICH WE DID.",
        "vin": "5N1ED28Y64C"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "03/07/2016",
        "dateOfIncident": "12/02/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10840315,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING TO WORK ONE DAY AND WHILE I WAS TURNING CORNERS I FELT IT WAS GETTING HARDER TO STEER. I STOP AT THE RED LIGHT AND WHEN DROVE OFF AGAIN I WAS GOING MAYBE 5-10 MPH, I TURNED LEFT AND I WAS GOING TO STRAIGHTEN THE CAR UP THE CAR STARTED TO SWURVE AND BEAR TO THE LEFT. I TRIED TO REGAIN CONTROL BUT THE CAR WOULD NOT RESPOND I ENDED UP CRASHING INTO A POLE.",
        "vin": "5N1ED28T93C"
    },
    {
        "components": "STRUCTURE,ENGINE",
        "crash": false,
        "dateComplaintFiled": "01/14/2016",
        "dateOfIncident": "01/08/2016",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10820189,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN XTERRA FRAME RUSTED BEYOND ANY SAFETY JUSTIFICATION.    OIL LEAKS FROM ENGINE UP TWO 2 QUART A DAY LEAD TO ENGINE SEIZED UP WITHOUT WARNING.",
        "vin": ""
    },
    {
        "components": "STRUCTURE,TIRES",
        "crash": false,
        "dateComplaintFiled": "03/22/2015",
        "dateOfIncident": "03/22/2015",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10700996,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CALLED ROADSIDE ASSISTANCE TO CHANGE A TIRE.  THE SPARE TIRE RUBBER WAS BURNED IN THREE OR MORE PLACES FROM THE HEAT SPREADING UNDER THE VEHICLE, AND THE CHAR/MELTING/BURNING WENT THROUGH THE VEHICLE BODY FROM THE BOTTOM OF THE VEHICLE OUTSIDE TO THE FLOOR INSIDE.  THE MAN CHANGING MY TIRE SUGGESTED IT WAS A FIRE WAITING TO HAPPEN AND THAT THERE COULD BE A RECALL FOR THIS SORT OF ISSUE.  I CHECKED AND DO NOT SEE ANYTHING LISTED.  MY TIRED IS NOW DAMAGED FROM THE HEAT MELTING THE RUBBER, AND MY VEHICLE IS CHARRED IN PLACES.    *TR",
        "vin": ""
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "09/05/2014",
        "dateOfIncident": "03/04/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10631151,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*  THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED THAT THE REAR DRIVER AND PASSENGER SIDE CATALYTIC CONVERTERS FAILED. THE CONTACT ALSO MENTIONED THE EGR SYSTEM FAILED. THE VEHICLE WAS NOT DIAGNOSED OR REPAIRED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE. THE FAILURE MILEAGE WAS 120,000.",
        "vin": "5N1ED28T13C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": true,
        "dateComplaintFiled": "07/04/2014",
        "dateOfIncident": "06/28/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10608227,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WE WERE DRIVING ON VACATION AND THE CAR STOPPED. IT STARTED BACK UP AND  THEN AFTER A COUPLE OF MILES STOPPED AGAIN. WE WERE STRANDED AND DIDN'T GET HOME FOR THREE DAYS.I HAVE TAKE CODES OFF THE ENGINE AND IT SHOWED A 0462 CODE. WENT BACK TO GET XTERRA WITH A CAR DOLLY AND DOLLY BROKE AND CAR CAME UNDONE. THIS UNFORTUNATE INCIDENT WAS A DIRECT RESULT OF A BAD SENDING UNIT.  *TR",
        "vin": "5N1ED28T83C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "06/26/2014",
        "dateOfIncident": "06/11/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10606088,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "RADIATOR IS FALLING OUT OF TRUCK ,DUE TO SERIOUS RUST ON FRAMING, HOOD LATCH IS STARTING TO BREAK FREE HOOD COULD FLY UP ONTO WINDSHIELD .  *TR",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "ENGINE",
        "crash": false,
        "dateComplaintFiled": "04/24/2014",
        "dateOfIncident": "04/20/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10584612,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DURING A DRIVE HOME FROM A WEEKEND IN THE COUNTRY, MY XTERRA BEGAN TO OVERHEAT.  A FAINT POP, LIKE A BACKFIRE, HAPPENED.  AFTER I HEARD THE NOISE, A CONSISTENT TICKING OR PINGING SOUND STARTED COMING FROM THE RIGHT FRONT SIDE OF MY XTERRA.  THE SOUND IS CONSISTENT WITH THE ACCELERATION.  ONCE I GOT HOME, I STARTED TO RESEARCH THE ISSUE ONLINE.  FOUND THAT 2000-2004 XTERRAS HAVE A VERY COMMON PROBLEM WITH THE EXHAUST MANIFOLD CRACKING DUE TO WEAK MATERIAL.  I AM AN ACTIVE MEMBER ON WWW.CLUBXTERRA.ORG AND MANY OTHER MEMBERS REPORT THE SAME ISSUE.  THIS IS QUITE A SET BACK FOR MOST PEOPLE AND CAN CAUSE SERIOUS DAMAGE TO THE ENGINE IF IT IS NOT TAKEN CARE OF IN A TIMELY MANNER.  NISSAN SHOULD RECOGNIZE THAT THIS IS A MANUFACTURING FAULT AND ISSUE A RECALL.  EVERYONE I KNOW THAT OWNS AN XTERRA HAS OR HAD THIS ISSUE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "02/04/2014",
        "dateOfIncident": "12/30/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10562985,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I BOUGHT THE CAR THE ADJUSTER FOR THE STEERING WHEEL LEVER TO LOWER OR LIFT UP THE WHEEL IS STUCK IN THE DOWN POSITION & WON'T MOVE. THE WHEEL IS HARD TO MOVE BUT THE STEERING FLUID IS FULL.  *TR",
        "vin": "5N1ED28T73C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "01/19/2014",
        "dateOfIncident": "01/17/2014",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10560534,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVING 30 MPH ON STREET AND HIT A POTHOLE AND THE CAR GEARED TOWARDS THE RIGHT AND WAS VERY DIFFICULT TO CONTROL THE STEERING WHEEL. I HAD TO HOLD THE STEERING WHEEL WITH TWO HANDS WITH CONSTANT PRESSURE TO HOLD IT IN A STRAIGHT POSITION. I ARRIVED AT MY BROTHERS HOUSE AFTER TEN MINUTES BUT I WAS UNABLE TO PARK IN THEIR DRIVEWAY. THE CAR WOULD NOT TURN LEFT AND THE STEERING WHEEL WAS VERY STIFF. ABOUT  TWO MONTHS PRIOR MY HUSBAND CHECKED THE POWER STEERING FLUID CAUSE I COULD PARK ON THE LEFT OF ANY STREET. BECAUSE OF THE STIFF STEERING WHEEL AND CRANKING NOISE COMING FROM THE BOTTOM OF THE VEHICLE. I FEEL LIKE I WILL BE LOSING CONTROL OF THE CAR SOON. SO I WILL BE TAKING IT TO OUR MECHANIC ON MONDAY.   *TR",
        "vin": "5N1ED28Y13C"
    },
    {
        "components": "FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/12/2013",
        "dateOfIncident": "09/07/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10543334,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS PUMPING GAS AND IT BACKED UP AND SPLASHED ALL OVER MY EXPOSED SKIN AND CLOTHING.  BECAUSE THE FUEL PUMP FUEL LEVEL SENDER IS MALFUNCTIONING GAS SPILLS WHEN I ATTEMPT TO FILL MY TANK.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING,AIR BAGS,SERVICE BRAKES",
        "crash": true,
        "dateComplaintFiled": "02/17/2013",
        "dateOfIncident": "01/21/2013",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10498397,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS DRIVING ALONG A SLIGHTLY SNOW COVERED ROAD WITH A LITTLE BIT OF ICE. MY SPEED WAS LOW ABOUT 15-20 MILES PER HOUR. THE CAR STARED SLIDING SIDEWAYS TOWARD ANOTHER CAR HEADING TOWARD ME. MY FOUR-WHEELED DRIVE WAS ENGAGED WHILE DRIVING. I MANAGED TO STEER THE CAR OUT OF THE WAY OF THE OTHER CAR BUT I COULD NOT GAIN CONTROL OF MY VEHICLE. THE BRAKES DID NOT HELP AND THE STEERING WOULD NOT RESPOND. I TRAVELED AT LEAST 80 FEET HITTING TREES AND BUSHES UNTIL A SET OF TREES STOPPED MY CAR. THE CRASH TOTALED MY CAR.  *TR",
        "vin": "5N1ED28Y53C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL/PROPULSION SYSTEM",
        "crash": false,
        "dateComplaintFiled": "12/28/2012",
        "dateOfIncident": "08/26/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10490307,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ENGINE LIGHT CAME ON IN 09. VEHICLE FAILED EMISSIONS DUE TO PROBLEM WITH EVAC SYSTEM. GASKET AT FUEL TANK WAS REPLACED. WITHIN A YEAR, ENGINE LIGHT CAME BACK ON. THERE WAS ANOTHER PROBLEM WITH THE EVAC SYSTEM. AFTER $ 862.00 DOLLARS THAT WERE SPENT ON VEHICLE FOR O RING AND GASKET REPAIRS, VEHICLE PASSED EMISSIONS. WITHIN 8 MONTHS, ENGINE LIGHT WAS BACK ON DUE TO EVAC SYSTEM. MECHANIC STATES THAT THERE IS MAJOR CORROSION OF THE FUEL TANK AND THAT HE HAS SEEN THE SAME THING ON MANY NISSAN VEHICLES OF THIS AGE DUE TO THE MATERIAL USED TO CONSTRUCT THE FUEL TANK AND BELIEVES THAT IT IS A WIDESPREAD PROBLEM THAT SHOULD HAVE BEEN RECALLED AND THAT NISSAN STARTED USING A DIFFERENT MATERIAL ONCE THE PROBLEM WAS KNOWN. THE ENTIRE INTERIOR OF THE VEHICLE SMELLS OF GASOLINE AND MECHANIC STATES THAT ANYONE IN CLOSE PROXIMITY OF VEHICLE COULD CAUSE AN EXPLOSION IF A SPARK WAS CREATED.  *TR",
        "vin": "3N1BC13EX7L"
    },
    {
        "components": "POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "11/09/2012",
        "dateOfIncident": "11/09/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10483883,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE TRANSMISSION IN MY 2003 NISSAN XTERRA NEEDS TO BE REPLACED. THE RADIATOR FLUID HAS LEAKED INTO THE TRANSMISSION FLUID CAUSING DAMAGE TO MY TRANSMISSION. THIS IS A WIDESPREAD PROBLEM AND SHOULD BE HANDLED BY THE NISSAN DEALERSHIP. *TR",
        "vin": "5N1ED28Y63C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "06/04/2012",
        "dateOfIncident": "06/02/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460549,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I WAS NEGOTIATING A CURVE WITH AROUND 45 MPH AND SUDDENLY LOST STEERING CONTROL. THE VEHICLE STARTED TURNING TO THE RIGHT SIDE, I PANICKED AND TRIED TO STEER IT TO THE LEFT ,AND THE VEHICLE TOOK A U TURN AND CAME TO A STOP FACING THE INBOUND VEHICLES. LUCKILY THERE WAS NO OTHER CARS AND I MANAGED TO TAKE DRIVE IT AGAIN. IT NEVER HAPPENED BEFORE AND I HAVE NO IDEA WHAT CAUSES IT. IT WAS REALLY SCARY AND I AM NOT SURE WHAT TO DO ABOUT IT. PLEASE ADVICE.    THANKS  *TR",
        "vin": "5N1ED28Y23C"
    },
    {
        "components": "STEERING,STRUCTURE,WHEELS",
        "crash": true,
        "dateComplaintFiled": "05/30/2012",
        "dateOfIncident": "03/16/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10460065,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I DROVE THE VEHICLE ON A FREEWAY UNDER CONSTRUCTION WITH ONE FINISHED NEW PAVEMENT LANE.  WHEN I WAS CHANGED THE OTHER OLD LANE TO THE NEW ONE, THE WHEEL SUDDENLY GOT OUT OF CONTROL AND SPUN FROM ONE LANE TO THE OTHER AND ENDED IN THE MIDIUM BUMPED INTO BARRIERS.  LATELY I CONTACTED WITH NISSAN AND QUESTION IF THIS IS ASSOCIATED WITH THE RECALL R1037.  THEY DENIED.  *TR",
        "vin": "5N1ED28Y63C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "01/13/2012",
        "dateOfIncident": "01/09/2012",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10443653,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "NISSAN PUT OUT A RECALL ON THE 2003 FUEL SYSTEMS IN REGARDS TO CORRISON THAT COULD OCCUR TO THE FUEL SYSTEM.  OUR VEHICLE WAS NOT PART OF THE RECALL.  THE FUEL SYSTEM DID CORRODE, CAUSING US TO PAY OUT OF POCKET FOR A NEW TANK, NEW FUEL PUMP.  THIS RECALL WAS FOR SALT AREAS, THAT WOULD BE IN MA.  WHAT WAS DONE TO FIX THIS PROBLEM DID NOT.  *TR",
        "vin": "5N1ED85Y53C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/06/2011",
        "dateOfIncident": "04/01/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423968,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED THAT WHILE DRIVING 35 MPH, THE BRAKES WERE APPLIED AND THE ANTI LOCK BRAKING SYSTEM WAS ENGAGED. THE ANTI LOCK BRAKING LIGHT ALSO ILLUMINATED ON THE INSTRUMENT PANEL DURING THE FAILURE. THE VEHICLE WAS TAKEN TO AN AUTHORIZED DEALER, WHERE THEY WERE UNABLE TO DIAGNOSE A FAILURE. THE VEHICLE WAS NOT REPAIRED. THE FAILURE CONTINUED TO OCCUR WHENEVER THE BRAKES WERE ENGAGED. THE MANUFACTURER WAS MADE AWARE OF THE FAILURE, BUT OFFERED NO ASSISTANCE. THE FAILURE MILEAGE WAS 50,000.",
        "vin": "5N1ED28Y13C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "09/06/2011",
        "dateOfIncident": "09/06/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423988,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKES FAILED AND THE ABS DIDN'T WORK UNTIL I ALMOST HIT ANOTHER CAR IN FRONT OF ME. THE ABS TRIGGERS WITHOUT ANY NOTICE AND HAS CAUSE ME TO MERGE ONTO THE OTHER LANE. CAUSE MY CAR DOES NOT STOP. THE ABS LIGHT DOESN'T GO ON SO THE MANUFACTURER NISSAN TOLD ME THEY COULDN'T FIND ANY PROBLEMS WITH IT. AND ITS SITTING AT A LOCAL TRUSTWORTHY MECHANIC SHOP WHERE IT WILL BE FIXED FOR THE SERVICE BRAKES AIR-ANTILOCK BRAKE FAILURE. PLEASE HELP WITH A RAPID RECALL SO MY FAMILY COULD GET REIMBURSED FOR THE HUGE EXPENSE OF FIXING A MANUFACTURER PROBLEM. *TR",
        "vin": "5N1ED28Y13C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE,VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "09/06/2011",
        "dateOfIncident": "09/02/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10423994,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CAR DOESN'T SEEM TO BE ACCELERATING PROPERLY DUE TO SOMETHING WRONG WITH THE FUEL SYSTEM OR GASOLINE DELIVERY THERE IS A VIBRATING SOUND AND VIBRATION COMING FROM THE GAS PEDAL. AND THE GASOLINE SMELL IS TERRIBLE.  THE GAS PEDAL IS VERY LOOSE AND I DON'T FEEL SAFE DRIVING MY CAR AT THIS TIME.   *TR",
        "vin": "5N1ED28Y13C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "07/25/2011",
        "dateOfIncident": "07/23/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10415118,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN I WAS DRIVING ON FREEWAY, THE STEERING WHEEL OF MY CAR GOT HARD TO MANEUVER. I PULLED VERY HARD. I HAD TO TAKE MY CAR TO THE DEALER AND THEY SAID THEY HAVE TO REPLACE THE HOSE FROM THE STEERING WHEEL, THE STEERING LIQUID IS POURED. AND IT COSTS ME $ 500 TO REPAIR MY CAR. I THINK IT'S A MANUFACTURER'S DEFECT IN THE STEERING FLUID HOSE.  *TR",
        "vin": ""
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "04/21/2011",
        "dateOfIncident": "04/18/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10397018,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED THAT AFTER HAVING THE REPAIRS UNDER NHTSA CAMPAIGN ID NUMBER: 10V554000 (STEERING:COLUMN), THE VEHICLE STALLED WITHOUT WARNING. THE VEHICLE WAS TAKEN TO THE DEALER WHO DIAGNOSED THAT THE BATTERY AND THE STARTER SYSTEM WERE DEFECTIVE AND NEEDED TO BE REPLACED. THE PARTS WERE REPLACED BUT THE FAILURE PERSISTED. THE MANUFACTURER WAS NOT CONTACTED AND THE VEHICLE WAS NOT FURTHER REPAIRED. THE FAILURE AND CURRENT MILEAGE WAS 110,000.",
        "vin": "5N1ED28T43C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": true,
        "dateComplaintFiled": "04/13/2011",
        "dateOfIncident": "12/07/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10395760,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED THAT WHEN APPLYING THE BRAKES AT LOW SPEEDS THE VEHICLE SUDDENLY ACCELERATED AND CRASHED INTO THE HOUSE. THE DRIVER WAS INJURED AND WAS NOT TRANSPORTED TO THE HOSPITAL. A POLICE REPORT WAS FILED.  THE VEHICLE WAS THEN TOWED TO AN INDEPENDENT MECHANIC WITH THE INSURANCE AGENCY. THE FAILURE WILL BE DIAGNOSED PENDING AN INVESTIGATION. THE FAILURE AND CURRENT MILEAGES WERE APPROXIMATELY 93,700.",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "STEERING",
        "crash": false,
        "dateComplaintFiled": "03/25/2011",
        "dateOfIncident": "03/25/2011",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10392896,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT RECEIVED NOTIFICATION ON NHTSA CAMPAIGN ID NUMBER: 10V554000 (STEERING:COLUMN) AND TOOK THE VEHICLE TO THE DEALER FOR REPAIRS. AFTER REPAIRS, THE CONTACT WAS ATTEMPTING A TURN WHEN THE STEERING WHEEL BECAME RESISTANT AND ALMOST IMPOSSIBLE TO MANEUVER. THE DEALER ADVISED THE CONTACT THAT THERE WAS NOTHING THAT THEY COULD DO AND OFFERED NO ADDITIONAL ASSISTANCE. THE CURRENT AND FAILURE MILEAGE WAS 130,000.",
        "vin": "5N1ED28Y93C"
    },
    {
        "components": "STEERING,SERVICE BRAKES, HYDRAULIC,WHEELS",
        "crash": false,
        "dateComplaintFiled": "03/10/2011",
        "dateOfIncident": "11/21/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10390968,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "STEERING INPUTS VERY SLOWER TO RESPOND, HUGE NOISE, COULD NOT MAKE TURN EASILY, IT IS HAPPENING EVERY YEAR SINCE 2008 EVEN AFTER I SERVICED THE VEHICLE AND CHANGED THE PARTS, PREVIOUSLY PROBLEM STARTED WITH U- TURNS AND NOW WIDE TURNS, LEFT AND RIGHT TURNS ALSO.  FOLLOWING IT-UP WITH NISSAN CONSUMER AFFAIRS SINCE JULY 2009 (  FILE # 6541095  AND [INTR #1358858] ), THEY DID NOT TAKE IT SERIOUSLY AND CLOSING THE CASE,  NOW I GOT A RECALL NOTICE ABOUT MY STEERING INPUT ISSUE RELEASED BY NISSAN,  HOWEVER I FEEL THIS MODEL OR MY PARTICULAR VEHICLE IS GIVING PROBLEMS ON TURNS AND UNCERTAIN ABOUT BRAKING CONDITION.  LAST TIME DEALER WARNED ME THAT VEHICLE IS IN BAD CONDITION HOW COULD I MANAGED TO DRIVE TO HIS SHOP.       PROBLEM STARTED AGAIN WITH NOISE AND TURNS, SUGGEST ME WHAT SHOULD BE DONE, I WILL KEEP THE VEHICLE IN SAME CONDITION UNTIL THAT TIME.  SOME TIMES WHEN I'M TURNING ON LEFT HAND SIDE I FEEL LIKE COMPLETE VEHICLE WEIGHT ON MY LEFT HAND AND CHEST CAUSING PAINS.",
        "vin": "5N1ED28T23C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,POWER TRAIN",
        "crash": false,
        "dateComplaintFiled": "02/08/2011",
        "dateOfIncident": "02/08/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10381086,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED THAT THE BRAKES WOULD LOCK ABNORMALLY WHENEVER ATTEMPTING TO BRAKE WITH THE FOUR WHEEL DRIVE ACTIVATED. THE FAILURE WOULD ALSO OCCUR WHEN DRIVING IN WET OR INCLEMENT WEATHER WITH THE FOUR WHEEL DRIVE ACTIVATED. THE VEHICLE WAS TAKEN TO THE DEALER WHO WAS UNABLE TO DUPLICATE THE FAILURE. THE VEHICLE WAS NOT REPAIRED. THE MANUFACTURER WAS NOT CONTACTED. THE FAILURE MILEAGE WAS 75,000.",
        "vin": "5N1ED28Y93C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "12/27/2010",
        "dateOfIncident": "12/22/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10372517,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED THAT THE VEHICLE SUDDENLY STALLED. IT WAS TOWED TO THE CONTACT'S RESIDENCE; THE CONTACT WAS INFORMED THAT THERE WAS CORROSION ON THE FUEL PUMP CONNECTOR AND THE SENDING UNIT CAUSED THE FAILURE. THE CONTACT REFERENCED RECALL 04V230000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP) BUT WAS INFORMED BY THE MANUFACTURER THAT THE VEHICLE WAS NOT INCLUDED. THE CURRENT AND FAILURE MILEAGES WERE APPROXIMATELY 70,000.",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "STEERING",
        "crash": true,
        "dateComplaintFiled": "11/17/2010",
        "dateOfIncident": "03/26/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10366638,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING HOME MY 2003 NISSAN XTERRA JERKED TO THE LEFT, TAKING ME INTO ONCOMING TRAFFIC. *TR",
        "vin": "5N1DD28T93C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/28/2010",
        "dateOfIncident": "06/01/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10340344,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHEN FUELING MY 2003 NISSAN XTERRA GAS UNEXPECTED BACK WASHES OUT OF THE FUEL FILLER. I WAS COVERED IN GAS ALONG WITH THE VEHICLE AND SURROUNDING GROUND. A RECALL WAS FOR THE 2001 NISSAN XTERRA FOR THE IDENTICAL PROBLEM. I WOULD LIKE THE RECALL TO COVER THE 2003 NISSAN XTERRA. THE PROBLEM AND PART FAILURE IS IDENTICAL IN BOTH CASES. THE FAILING PART IS THE FUEL TANK INLET SHUTTER VALVE. *TR",
        "vin": "5N1ED28Y63C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/11/2010",
        "dateOfIncident": "06/10/2010",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10335815,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL* THE CONTACT OWNS A 2003 NISSAN XTERRA. THE CONTACT STATED  THAT HIS VEHICLE WAS SERVICED FOR THE RECALL ASSOCIATED WITH  NHTSA CAMPAIGN ID NUMBER: 04V230000 (FUEL SYSTEM, GASOLINE: DELIVERY: FUEL PUMP). A FEW MONTHS LATER, THE CONTACT STATED THAT HE ATTEMPTED TO START THE VEHICLE BUT IT WOULD NOT START. THE VEHICLE WAS TOWED TO AN INDEPENDENT MECHANIC WHERE THE CONTACT WAS INFORMED THE FUEL PUMP WOULD NEED TO BE REPLACED. THE FUEL PUMP WAS REPLACED. THE FAILURE AND CURRENT MILEAGES WERE 70,000.",
        "vin": "5N1ED28Y13C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "07/09/2009",
        "dateOfIncident": "07/02/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10276178,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "Cooper Tire & Rubber Co.",
                "productMake": "MASTERCRAFT",
                "productModel": "MASTERCRAFT COURSER A/T 2",
                "productYear": "9999",
                "size": "LT265/75R16",
                "type": "Tire"
            }
        ],
        "summary": "PURCHASED MASTERCRAFT COURSER A/T2  265/70R16 TIRES 9/13/2007, TOOK TO MECHANIC FOR SHIMMY, WAS INFORMED THAT BELTS IN TIRES SHIFTED, BROUGHT TO TOWN FAIR TIRE IN WESTFIELD, MA. BALANCED TIRES  SENT ME ON MY WAY, WENT BACK 2 WEEKS LATER FOR SAME PROBLEM, WAS INFORMED THAT THERE WAS A SAFETY CONCERN, HOWEVER IT STILL COST ME $322.01 WITH OLD TIRES BEING PRORATED. I ONLY HAD 12000 MILES ON THE TIRES AND IF IT WAS A SAFETY CONCERN SHOULDN'T THE TIRES BEEN COVERED UNDER A RECALL OR WORKMANSHIP WARRANTY. I DID CHECK FOR RECALLS DIFFERENT SIZE TIRE HAD A RECALL FOR BELT SHIFTING IN TIRE, HOWEVER THIS SIZE WAS NOT AFFECTED BY RECALL. I FEEL THIS IS A PROBLEM AND I AM VERY UPSET THAT I HAD TO PAY FOR THE PROBLEM WITH COULD HAVE BEEN WORSE. SO IN LESS THAN TWO YEARS I HAD TO SPEND ALMOST $900.00 WITH ONE SET BEING PRORATED ON TIRES.... VERY CONCERNED VERY UPSET. PLEASE NOTE THIS WAS A PROBLEM ON MORE THAN ONE TIRE. *TR",
        "vin": ""
    },
    {
        "components": "SUSPENSION",
        "crash": false,
        "dateComplaintFiled": "07/02/2009",
        "dateOfIncident": "06/27/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10275637,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 NISSAN XTERRA, REAR AXLE FELL OFF DURING DRIVING.     6-27-09 BY CHANCE WE GOT OUT OF LINE TO ENTER THE INTERSTATE, AND DRIVE INTO A DRIVE-THRU, AS WE TURNED IN, WE HEARD A LOUD NOISE AND LOST POWER OF THE TRUCK,  WE WERE ABLE TO DRIFT INTO A PARKING SPOT THE REAR AXLE AND STILL ATTACHED TO THE DRIVER SIDE REAR TIRE WERE IN THE PARKING SPOT NEXT TO US.  *TR",
        "vin": "5N1ED28T73C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "04/21/2009",
        "dateOfIncident": "04/08/2009",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10266229,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 NISSAN XTERRA 4WD.  IT HAS 55,000 MILES AND ONLY BEEN SERVICED AT NISSAN DEALERSHIP.  I NOTICED A SWEET SMELL COMING FROM THE ENGINE WHEN THE CAR WAS WARM SO WHEN I TOOK IN FOR OIL CHANGE ASKED THEM TO CHECK IT OUT.  TOLD ME THE HEADS WERE WARPED AND NEEDED TO BE GROUND DOWN, NEW GASKET, BELTS AND SPARKPLUGS D/T THE HEAD LEAKING.  THIS IS THE SECOND HEAD GASKET PROBLEM I'VE HAD WITH A NISSAN I'VE OWNED.  THE OTHER ONE WAS UNDER WARRANTY AND WAS TOLD IT WAS A FREAK THING.  I BELIEVED THEM, AND HAD NO PROBLEM BUYING ANOTHER NISSAN.  NOW SAME PROBLEM AND I HAVE TO PAY $2,250.00 FOR REPLACEMENT.  NO ONE CAN TELL ME WHY.  I CONTACTED NISSAN CORP FOR REIMBURSEMENT ON THIS.  IM STILL WAITING FOR A REPLY, BUT AFTER SEARCHING THE NET I SEE THAT THIS IS A FAMILIAR PROBLEM WITH NISSAN.  I WILL NOT BE BUYING ANOTHER NISSAN PRODUCT. *TR",
        "vin": "5N1ED28Y43C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING",
        "crash": false,
        "dateComplaintFiled": "08/26/2008",
        "dateOfIncident": "05/23/2008",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10239739,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "SINCE 2006, SENSOR LIGHT WAS COMING ON AND OFF. IN 2008 FAILED EMISSION INSPECTION DUE TO SENSOR LIGHT. HAD REPAIRED BY A STATE CERTIFIED REPAIR FACILITY, AS REQUIRED BY STATE OF MASS, FOR SENSOR AND CAT CONVERTER IN MAY 2008. IN AUG 2008 SENSOR LIGHT CAME BACK ON. HAD RESET - WAS SAME ISSUE THAT WAS REPAIRED IN MAY 2008.  *TR",
        "vin": "5N1ED28Y13C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "06/19/2007",
        "dateOfIncident": "06/17/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10193754,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*THE CONTACT OWNS A 2003 NISSAN XTERRA.  THE CONTACT STATED THAT THE ACCESS HATCH ABOVE THE GAS TANK SEAL IS CORRODED SO BADLY, THAT IT WILL NOT FILL PROPERLY.  THE VEHICLE HAS EMISSION VAPORS IN THE PASSENGER COMPARTMENT AND ON JUNE 17, 2007, THE CHECK ENGINE LIGHT ILLUMINATED.  THE DEALER STATED THAT THE GAS TANK NEEDS TO BE REPLACED.  THE REPAIR WILL COST $1,000.  THE CONTACT STATED THAT THIS IS A SAFETY DEFECT.  THE PURCHASE DATE WAS UNKNOWN.  THE CURRENT MILEAGE IS 129,500 AND FAILURE MILEAGE WAS 129,425.",
        "vin": "5N1ED28Y43C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "05/08/2007",
        "dateOfIncident": "05/06/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10190155,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THREE OF THE POWER WINDOWS ON  THE 2003 NISSAN XTERRA HAVE CEASED FROM FUNCTIONING.  THE ONLY WINDOW FUNCTIONING  WAS THE FRONT DRIVER SIDE WINDOW.  *AK",
        "vin": "5N1ED28Y63C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "02/12/2007",
        "dateOfIncident": "01/04/2007",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10182401,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TL*-  THE CONTACT  STATEDON THE 2003 NISSAN XTERRA THE AIR BAG DID NOT DEPLOY ON THE DRIVER'S  SIDE. THE CAR WAS BEING DRIVEN AT 40 MPH IN FOG, AT NIGHT, WHEN ITBSTRUCK A DEAR. THE AIR BAG ON THE DRIVER SIDE DID NOT DEPLOY, BUT THE PASSENGER SIDE AIR BAG   DEPLOYED, BUT  THERE WAS NO ONE ON THE PASSENGER'S  SIDE. THE POLICE FILED A REPORT. *AK",
        "vin": "5N1ED28T63C"
    },
    {
        "components": "PARKING BRAKE",
        "crash": false,
        "dateComplaintFiled": "01/15/2007",
        "dateOfIncident": "06/01/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10178698,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PARKING BRAKE FAILURE AND UNDETERMINED ENGINE NOISE - ON 2 OCCASIONS, THE PARKING BRAKE HOLD BECAME LOOSE AND CAUSED THE VEHICLE TO ROLL BACKWARD.  IT WAS REPAIRED TWICE IN LESS THAN 6 MONTHS, BOTH TIMES SAYING THE SOME TYPE OF WASHER THAT HOLDS A CABLE HAD BECOME LOOSE. THE PARKING BRAKE TENSION WOULD BECOME VERY LOOSE BEFORE THE FAILURES.      THERE IS AN ADDITIONAL ENGINE NOISE ISSUE THAT HAS NOT BEEN RESOLVED AFTER 4 VISITS TO THE DEALER WHILE UNDER WARRANTY.  THE NOISE SOUNDS LIKE A LOOSE BELT SQUEALING OR A CONSTANT SQUEAKY NOISE, ESPECIALLY WHEN THE ENGINE IS COLD OR THE OUTSIDE TEMPS ARE LOWER THAN ABOUT 60 DEGREES.  DEALER CLAIMS THEY HEAR THE NOISE BUT ARE UNABLE TO LOCATE THE PROBLEM OR REPAIR IT.  IT STILL SQUEAKS AND IS NO LONGER UNDER WARRANTY.      *NM",
        "vin": ""
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "06/08/2006",
        "dateOfIncident": "04/14/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10159461,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 XTERRA BRAKES FAILED TO STOP CAUSING CONSUMER TO RUN A RED LIGHT.  *TS  THE FIRST FAILURE OCCURRED ON MAY, 21, 2004.  THE DEALER INFORMED THE CONSUMER THAT THE BRAKES WERE WORN, THE RIGHT INNER PAD CAME OUT OF HOLDER FROM METAL CONTACT WITH THE ROTOR CAUSING CALIPER PISTON TO JAM INTO INSIDE OF RIGHT FRONT ROTOR.  THE DEALER REPLACED THE FRONT BRAKE PADS AND ROTORS AND RIGHT FRONT CALIPERS.  THE SECOND FAILURE OCCURRED ON APRIL 15, 2005.  THE VEHICLE WAS TAKEN TO THE DEALER WHERE THE DID A COMPLETE BRAKE FLUID EXCHANGE TO REMOVE CONTAMINANT FROM BRAKE LINES.  *NM  THE CONSUMER HAS SINCE MOVED WITH NO FORWARDING ADDRESS. UPDATED 07/03/06. *JB",
        "vin": "5N1ED28Y63C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "09/09/2005",
        "dateOfIncident": "05/27/2005",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10130783,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DT: CONTACT STATED  2003  NISSAN XTERRA  CAUGHT ON FIRE ON 5-27-05. CONTACT  WAS  DRIVING AND SMELLED SOMETHING BURNING, WITHIN ONE MINUTE THE HOOD WAS ENGULFED IN FLAMES. SHE WAS STOPPED AT A RED LIGHT WHEN SHE FIRST SMELLED SOMETHING BURNING. THE FIRE DEPARTMENT  CAME AND EXTINGUISHED THE FIRE. THEY THOUGHT IT WAS AN ELECTRICAL FIRE.  THE MANUFACTURER SENT SOMEONE TO LOOK AT THE CAR AND THE CORPORATE CONSUMER AFFAIRS CALLED AND SAID THEY DID NOT KNOW WHAT CAUSED IT, BUT THE WARRANTY EXPIRED. DEALER  SAID THEY DID NOT KNOW WHAT CAUSED THE FIRE. IT DESTROYED THE VEHICLE COMPLETELY. *AK  *NM",
        "vin": "5N1ED28T53C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC",
        "crash": false,
        "dateComplaintFiled": "08/27/2005",
        "dateOfIncident": "08/22/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10134383,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FRONT RIGHT BRAKE FROZE IN THE \"ON\" POSITION WHILE DRIVING IMPEDING ACCELERATION AND BRAKING CAPACITY. BRAKE ALSO CAUSED SMOKE. THIS OCCURRED ON TWO OCCASIONS. AFTER FIRST OCCURRENCE THE BRAKE PADS WERE REPLACED AND BRAKING CYLINDER SEEMED TO BE WORKING. AFTER SECOND OCCURRENCE THE BRAKE CYLINDER WAS REPLACED.  *JB",
        "vin": "5N1ED28Y13C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "08/02/2005",
        "dateOfIncident": "05/21/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10132368,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "2003 NISSAN XTERRA DEVELOPED PROBLEMS WITH THE BRAKES, HEADLIGHTS AND TAIL LIGHTS.*MR  WHEN THE CONSUMER ATTEMPTED TO APPLY THE BRAKES, THE VEHICLE DID NOT STOP.  *JB",
        "vin": "5N1ED28Y63C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "01/21/2005",
        "dateOfIncident": "01/01/2005",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10107677,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE WHOLE FRONT END OF THE VEHICLE IS COMING APART IT HAS STRESS CRACKS AND WHERE THE SPOT WELDS ARE THEY ALSO ARE COMING APART.  *NM",
        "vin": "5N1DD28T13C"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "01/12/2005",
        "dateOfIncident": "01/29/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10066480,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PRODUCT DEFECT.  NO SUMMARY LISTED (NISSAN).   *AK   *SC  *JB WHILE THE CONSUMER WAS DRIVING DOWN A SMOOTHLY PAVED ROAD SHE SUDDENLY LOST CONTROL OF THE VEHICLE.  THE VEHICLE VEERED SHARPLY ACROSS THE YELLOW LINES AND FLIPPED END OVER END AT LEAST TWICE.  THE VEHICLE LANDED UPSIDE DOWN ON THE OPPOSITE SIDE OF THE ROAD FACING IN THE OPPOSITE DIRECTION.  THE AIR BAGS DID NOT DEPLOY.  THE MANUFACTURER'S SENT AN EMPLOYEE OF AN ENGINEERING FIRM AS AN UNBIASED THIRD PARTY.  THE ENGINEER DETERMINED THAT THERE WAS NO IMPACT TO THE BALL JOINT TO CAUSE A FAILURE.  THE MANUFACTURER IGNORED HIS FINDINGS AND DENIED THE CONSUMER'S CLAIM.  THE VEHICLE WAS TOTALED.  *NM   *TC",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "01/04/2005",
        "dateOfIncident": "11/04/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10106780,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER NOTICED THAT THE DEFOGGER SYSTEM  WAS  INOPERATIVE.  THIS CAUSED THE WINDOWS TO FOG UP,  AND  POOR VISIBILITY TO THE DRIVER.   VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION, AND  MECHANIC DETERMINED THAT THE  VENT SYSTEM NEEDED TO BE CLEANED.   *AK",
        "vin": "5N1ED28Y93C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "12/15/2004",
        "dateOfIncident": "12/15/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10103011,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 NISSAN XTERRA AND THE WINDOWS ON THE FRONT AND BACK PASSENGER SIDE ROLL UP AT A SNAIL'S PACE, IF THEY ROLL UP AT ALL.   I HAVE HAD THE CAR LOOKED AT AND CAN GET NO ANSWERS.*AK",
        "vin": "5N1DD28T63C"
    },
    {
        "components": "FUEL SYSTEM, OTHER",
        "crash": false,
        "dateComplaintFiled": "12/08/2004",
        "dateOfIncident": "09/28/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094543,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER RECEIVED 04V230000, CONTACTED THE DEALERSHIP, AND WAS TOLD THAT HE COULD BRING THE VEHICLE IN TO BE CHECKED OUT.  ALSO WAS TOLD THEY WILL NOT REPLACE ANY OF THE PARTS THAT THE RECALL ENUMERATED.  THE CONSUMER SPOKE WITH THE NISSAN MANUFACTURER.   *AK   *SC",
        "vin": "5N1ED28Y03C"
    },
    {
        "components": "ENGINE AND ENGINE COOLING,FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/29/2004",
        "dateOfIncident": "10/31/2004",
        "fire": true,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10101778,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "FUEL INJECTION SYSTEM WAS REPLACED FOUR TIMES.  AFTER THE LAST REPAIR, WHILE DRIVING THE VEHICLE, IT CAUGHT ON FIRE IN THE ENGINE.  *AK",
        "vin": ""
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "11/02/2004",
        "dateOfIncident": "09/22/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10099191,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "THE CONSUMER SMELLED GAS AND TOOK IT BACK TO THE DEALER, WHO KEPT THE VEHICLE FOR TWO DAYS, THEY REPLACED THE FUEL PUMP.  THE CONSUMER SMELLED GAS AGAIN, MADE CONTACT WITH THE DEALER AGAIN WHO TOLD THE CONSUMER TO AIR THE VEHICLE. *JB",
        "vin": "5N1ED28T73C"
    },
    {
        "components": "FUEL SYSTEM, GASOLINE",
        "crash": false,
        "dateComplaintFiled": "09/29/2004",
        "dateOfIncident": "09/22/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10094638,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "CONSUMER TOOK  VEHICLE TO DEALER FOR  RECALL 04V230000 REPAIRS ON THE FUEL SENDING UNIT.       AFTER PICKING THE VEHICLE UP,  10 MINUTES  LATER, CHECK ENGINE LIGHT CAME ON.  CONSUMER TOOK IT BACK TO THE DEALER, IT WAS  REPAIRED ONCE AGAIN, AND CURRENTLY THE ENGINE LIGHT WAS  BACK ON. DEALER WANTED TO CHARGE CONSUMER FOR A  FUEL CANISTER THAT WAS NOT DEFECTIVE AT FIRST.*AK",
        "vin": "5N1ED28Y53C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/17/2004",
        "dateOfIncident": "05/16/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091198,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "MY HEADLIGHTS JUST WENT OUT IN THE MIDDLE OF DRIVING AT NIGHT.  LUCKILY THERE WASN'T ANYONE ELSE AROUND ME ON THE INTERSTATE, BECAUSE THAT COULD HAVE BEEN A REALLY NASTY WRECK. I PULL OVER ON THE SHOULDER OF THE ROAD AND WIGGLE THE WIRES AND THEY CAME BACK ON.  I DROVE HOME AND CHANGED THE LIGHT BULBS, THINK THAT WOULD FIX THEM.  ABOUT TWO MONTHS LATER IT HAPPENED AGAIN, THAT IS WHEN I FOUND OUT THAT THE HEADLIGHT SOCKETS ON MY TRUCK WERE BURT UP. I WAS TOLD THAT IT WAS CAUSED BY HEAT FROM THE HEADLIGHTS. I WENT TO AUTO ZONE AND BOUGHT NEW ONES AND REPLACED THEM.  I CALLED NISSAN AND THEY SAID BECAUSE MY TRUCK WAS OUT OF WARRANTY THEY COULDN'T DO ANYTHING ABOUT IT. I JUST WANT TO MAKE SURE THAT SOMEONE KNOWS THAT A TRUCK THAT IS ONE YEAR OLD IS ALREADY HAVING PROBLEMS WITH ITS HEADLIGHTS. ALSO TO MAKE SURE THAT THERE ISN'T SOMETHING WRONG WITH THE HEAD LIGHTS THAT NISSAN PUTS INTO THE CARS.*AK",
        "vin": "5N1ED28Y43C"
    },
    {
        "components": "TIRES",
        "crash": false,
        "dateComplaintFiled": "09/14/2004",
        "dateOfIncident": "06/06/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10075789,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "GRABBER AW",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING 65 MPH, THE CONSUMER HEARD A NOISE COMING FROM THE REAR.   THE CONSUMER PULLED OVER AND NOTICED THAT THE DRIVER'S REAR TIRE SIDEWALL SPLIT.   *AK   *SC",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "EXTERIOR LIGHTING",
        "crash": false,
        "dateComplaintFiled": "09/09/2004",
        "dateOfIncident": "09/09/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10091707,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "HEADLIGHTS CAME ON AND OFF WHILE VEHICLE WAS IN MOTION. CONSUMER TOOK VEHICLE BACK TO THE DEALER ON THREE OCCASSIONS TO HAVE THE PROBLEM RESOLVED. HOWEVER, THE PROBLEM RECURRED.  *AK",
        "vin": "5N1ED28Y83C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "08/04/2004",
        "dateOfIncident": "07/16/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10086173,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "ON THE WAY TO THE BEACH TRAVELING 55 MPH IN MY 2003 NISSAN XTERRA, MY SURF BOARD FLEW OFF THE ROO TRACK INTO THE MIDDLE OF ROUTE 1 IN DELAWARE.  THE TRAFFIC BEHIND ME MANAGED TO AVOID HITTING THE SURFBOARD THAT WAS SITUATED IN THE LEFT LANE OF TRAFFIC.  MORE IMPORTANTLY, THERE WERE NO ACCIDENTS CAUSED BY THE INCIDENT HENCE THE POLICE WERE NOT INVOLVED.  AFTER REMOVING MY SURFBOARD FROM THE HIGHWAY AND INSPECTING DAMAGE TO IT AND THE ROOFRACK CROSSBARS, I NOTICED THE PLASTIC CLASP ON THE CROSSBAR HAD SNAPPED, CAUSING THE SURFBOARD TO FLY OFF THE ROOFOF MY XTERRA. THE FOLLOWING MONDAY, THE DEALERSHIP EVALUATED THE SITUATION AND ACKNOWLEDGED THAT THE RACK HAD \"BROKEN FROM STRESS/FATIGUE\" AND IS REPLACING IT UNDER WARRANTY.  HOWEVER, MY SURFBOARD IS COMPLETELY DESTROYED AND NEITHER THE DEALERSHIP NOR THE NISSAN CONSUMER AFFAIRS WILL REIMBURSE ME FOR THE COST OF THE SURFBOARD, STATING THAT DAMAGE TO PERSONAL PROPERTY IS NOT COVERED UNDER WARRANTY.*AK",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "06/23/2004",
        "dateOfIncident": "01/01/1901",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10079818,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "PROBLEMS WITH THE WAY THE DEFOGGER WORKS ON THE 2003 NISSAN XTERRA.*MR  THE  CONSUMER TURNED ON THE DEFOGGER THE AIR CONDITIONER COMPRESSOR STARTED TO OPERATE, AS IT SHOULD.  BUT WHEN THE CONTROL SWITCH WAS TURNED FORM DEFOGGER THE COMPRESSOR REMAINED ON.  THE ONLY WAY TO GET THE COMPRESSOR TO TURN OF WAS TO STOP THE VEHICLE, TURN IT OFF, THEN TURN IT BACK ON.  THE VEHICLE WAS TAKEN TO THE DEALER WHO INDICATED THAT THE SYSTEM WAS OPERATING AS DESIGNED.  THE CONSUMER BELIEVES THE VEHICLE SHOULD BE RECALLED IN ORDER TO MODIFY THE DEFOGGER SYSTEM SO THAT THE AIR CONDITIONER COMPRESSOR STOPS OPERATING WHEN THE CONTROL IS MOVED AWAY FROM THE DEFOGGER POSITION.  *NM",
        "vin": "5N1ED28T93C"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/27/2004",
        "dateOfIncident": "05/22/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10074401,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 45 MPH, THE DRIVER APPLIED THE BRAKES, THE BRAKES FAILED.  THE DRIVER WAS UNABLE TO MAINTAIN CONTROL OF THE VEHICLE AND COLLIDED WITH A TREE AND ROLLED OVER THREE TIMES.  BOTH FRONTAL AIR BAGS FAILED TO DEPLOYED.   THE DRIVER SUSTAINED MAJOR INJURIES AND WAS TAKEN TO THE HOSPITAL .  THE VEHICLE WAS TAKEN TO THE DEALER FOR INSPECTION.  THE CAUSE HAS NOT BEEN DETERMINED AT THIS TIME.  PLEASE PROVIDE ANY ADDITIONAL INFORMATION.    *NM",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "SUSPENSION,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "05/20/2004",
        "dateOfIncident": "01/29/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10067379,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 50 MPH DRIVER LOST CONTROL OF THE VEHICLE.  A TECHNICIAN DETERMINED THAT UPPER BALL JOINT ON DRIVER'S SIDE  BROKE.  THE AIR BAGS DID NOT DEPLOY DURING THIS ACCIDENT.  THE TECHNICIAN INDICATED THAT HE HAD NEVER SEEN BALL JOINT FAIL THIS WAY BEFORE.    *AK   *NM",
        "vin": "5N1ED28Y73C"
    },
    {
        "components": "ELECTRICAL SYSTEM",
        "crash": false,
        "dateComplaintFiled": "03/04/2004",
        "dateOfIncident": "02/25/2004",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10060387,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I OWN A 2003 NISSAN XTERRA WITH 7400 MILES ON IT. ON WEDNESDAY, FEBRUARY 25, 2004, I ATTEMPTED TO ROLL DOWN MY WINDOWS AND ALL FOUR WINDOWS WERE POWERLESS. I CALLED CONICELLI NISSAN SERVICE IN CONSHOHOCKEN, PA IMMEDIATLEY AND BROUGHT IT IN FOR SERVICE THE NEXT DAY (FEBRUARY 26, 2004). DURING THE FIRST SERVICE CHECK, THE TECHNICIAN COULD NOT DUPLICATE THE CONCERN AND DID NOT FIX ANYTHING.     ON FEBRUARY 27, 2004, THE EXACT SAME THING HAPPENED TO MY WINDOWS. THIS TIME MY FRONT, RIGHT, DRIVER-SIDE WINDOW WAS DOWN AND I WAS NOT ABLE TO GET IT UP. I IMMEDIATELY CALLED CONICELLI, EXPLAINED THE SITUATION, AND DROVE DIRECTLY TO THE DEALERSHIP. THIS TIME THE ASSISTANT SERVICE MANAGER AND TECHNICIAN WERE ABLE TO SEE FOR THEMSELVES THE PROBLEM. THEY HAD TO CONNECT A CHARGE TO THE WIRE TO ROLL THE WINDOW UP. I WAS TOLD TO COME BACK ON MONDAY, MARCH 1, 2004.     ON MARCH 1, 2004, THEY REPLACED THE MASTER PANEL SWITCH AND TIGHTEND UP A WIRE THAT WAS APPRARENTLY LOOSE. THE SERVICE WAS DONE FROM THE DIRECTION FROM A NISSAN TECHINCAL CALL.     ON MARCH 3, 2004, WHILE I THOUGHT MY CAR WAS FIXED, I ONCE AGAIN ATTEMPTED TO ROLL DOWN MY WINDOWS AND THEY WERE POWERLESS. I CALLED CONICELLI NISSAN AND DROVE DIRECTLY TO THE DEALERSHIP WHERE MY CAR REMAINS TODAY (MARCH 4, 2004). I HAVE NOT HEARD BACK FROM THE DEALERSHIP YET. I AM COMPLETELY BAFFLED THAT MY CAR HAS BEEN LOOKED AT THREE TIMES IN SIX BUSINESS DAYS AND MY WINDOWS ARE STILL NOT WORKING PROPERLY. MAYBE THE FOURTH TIME WILL WORK.",
        "vin": "1HGEJ8249XL"
    },
    {
        "components": "SERVICE BRAKES, AIR,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "03/03/2004",
        "dateOfIncident": "10/06/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10060232,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "BRAKE PEDAL FADED TO THE FLOOR,WHILE TRYING TO STOP FOR A RED LIGHT.RESULTING IN A THREE CAR ACCIDENT.WHEN I MADE CONTACT WITH THE CAR IN FRONT OF ME MY AIRBAG DID NOT DEPLOY ALTHOUGH MY EMPTY PASSANGER SEATS DID.ALTHOUGH THERE WERE NO SKID MARKS AND THE OFFICERS THAT RESPONDED DID NOT TICKET ME FOR FAILURE TO STOP,NISSAN INSISTS THAT EVERYTHING CHECKS OUT AND THAT IT MUST HAVE BEEN OPERATOR ERROR.SINCE THIS ACCIDENT I HAVE HAD MY STEREO REPLACED UNDER WARRANTY I HAVE HAD WORK DONE ON MY STEERING COLUMN DUE TO GRINDING NOISES AND BOTH MOTORS IN MY REAR WINDOWS ARE FAILING AND NEED TO BE REPLACED,AND THIS IS JUST WITH 7200 MILES ON THIS VEHICLE, NOT TO MENTION THAT EVERY TIME I GET OUT OF THE CAR THE BRAKES SMELL HOT AFTER ASHORT OR LONG DRIVE AND WHEN I GET IN IT THE SQUEAL AND GRIND UNTIL THEY GET NICE AND HOT AND START TO SMELL.AND ALL THIS IS OPERATING WITHIN NORMAL LIMITS.I WOULD JUST LIKE TO KNOW IS THE 12.5 MILES PER GALLON THAT I'M GETTING CONSIDERED TO BE NORMAL ALSO? I'M HAPPY TO SEE THAT THERE IS A WEB SITE LIKE THIS THAT PROTECTS PEOPLE LIKE ME AND THE OTHERS THAT PURCHASED THESE ALL TOGATHER LOW QUALITY,OVERPRICED, NOT TO MENTION DANGEROUS CARS.AND JUST HAVE TO LIVE WITH THE FACT THAT THERE IS NO RECOURSE,IT MAKES MY DAY!!*AK",
        "vin": "5N1ED28Y23C"
    },
    {
        "components": "STRUCTURE",
        "crash": false,
        "dateComplaintFiled": "02/25/2004",
        "dateOfIncident": "11/28/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10058997,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "TICKING NOISE COMING FROM TOP REAR OF DRIVER DOOR (SEAL) AND HEAD-LINER RIGHT ABOVE DRIVER'S SEAT.*AK",
        "vin": "5N1MD28Y33C"
    },
    {
        "components": "AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/12/2003",
        "dateOfIncident": null,
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10047773,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "WHILE DRIVING 45-50 MPH, THE DRIVER TRIED TO AVOID A CRASH BY HITTING A WALL HEAD ON. UPON IMPACT WITH THE WALL, NONE OF THE AIR BAGS DEPLOYED.  PLEASE PROVIDE FURTHER INFORMATION.    *PH",
        "vin": "FILL IN"
    },
    {
        "components": "SERVICE BRAKES, HYDRAULIC,AIR BAGS",
        "crash": true,
        "dateComplaintFiled": "11/07/2003",
        "dateOfIncident": "10/06/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10045652,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "DRIVER SIDE AIRBAG FAILURE IN A FRONT END COLLISION AT SPEEDS OF 30-40 MPH. DRIVERS AIRBAG DID NOT DEPLOY WHILE THE EMPTY PASSENGERS DID. COMPLETE BRAKE FAILURE RESULTING IN A THREE CAR ACCIDENT.  2003 NISSAN XTERRA 3,700 MILES.  *LA",
        "vin": "5N1ED28Y23C"
    },
    {
        "components": "ELECTRICAL SYSTEM,VISIBILITY",
        "crash": false,
        "dateComplaintFiled": "10/13/2003",
        "dateOfIncident": "09/15/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10041694,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "I HAVE A PROBLEM WITH THE FRONT WINDOWS OF MY NISSAN XTERRA, I BOUGHT THE CAR TWO MONTHS AGO AND THE FRONT WINDOWS STOPPED WORKING TWICE ALREADY.      I WAS TOLD BY THE SERVICE MANAGER THAT THERE IS A PROBLEM WITH THE WINDOW REGULATORS IN THE XTERRAS AND THAT NISSAN DOES NOT HAVE A RECALL OR EVEN HAS A SOLUTION TO THIS PROBLEM OTHER THAN HAVING TO CHANGE THE SAME PART OVER AND OVER.    AS WE ALL KNOW WE BUY NEW CARS FOR THEIR DEPENDABILITY NOT BECAUSE WE LIKE THE PAYMENTS!  *LA",
        "vin": "5N1ED28T23C"
    },
    {
        "components": "TIRES",
        "crash": true,
        "dateComplaintFiled": "08/07/2003",
        "dateOfIncident": "06/24/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 1,
        "odiNumber": 10024916,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            },
            {
                "manufacturer": "GENERAL TIRE & RUBBER CO.",
                "productMake": "GENERAL",
                "productModel": "GRABBER AW",
                "productYear": "9999",
                "size": null,
                "type": "Tire"
            }
        ],
        "summary": "WHILE DRIVING ON THE HIGHWAY AT 55 MPH  THE CONSUMER  LOSS CONTROL OF THE VEHICLE AND FLIPPED OVER THREE TIMES.  WITNESSES TO THE ACCIDENT STATED THE REAR RIGHT TIRE BLEWOUT. GENERAL GRABBER AW P265/70R16.  *AK    BRAKES AND STEERING WERE INOPERABLE PRIOR TO TIRE BLOW OUT.  THE VEHICLE WAS TOTALED.   *PH  *JB",
        "vin": "5N1ED28T63C"
    },
    {
        "components": "VEHICLE SPEED CONTROL",
        "crash": false,
        "dateComplaintFiled": "03/20/2003",
        "dateOfIncident": "02/18/2003",
        "fire": false,
        "manufacturer": "Nissan North America, Inc.",
        "numberOfDeaths": 0,
        "numberOfInjuries": 0,
        "odiNumber": 10010817,
        "products": [
            {
                "manufacturer": "Nissan North America, Inc.",
                "productMake": "NISSAN",
                "productModel": "XTERRA",
                "productYear": "2003",
                "type": "Vehicle"
            }
        ],
        "summary": "A NEWLY PURCHASED NISSAN XTERRA 2003 WENT OUT OF CONTROL AND DID A 180 DEGREE TURN AT 60 MPH ON A DRY DAY, WHEN THE BRAKES WERE LIGHTLY APPLIED.  *JB",
        "vin": "5N1ED28T73C"
    }
]